[
    {
        "name": "TOPLAS",
        "year": "2022",
        "info": "Volume 44, 2022",
        "count": 5,
        "papers": [
            "Bounded Verification of Multi-threaded Programs via Lazy Sequentialization.",
            "On Time-sensitive Control Dependencies.",
            "The Systematic Design of Responsibility Analysis by Abstract Interpretation.",
            "Conditional Independence by Typing.",
            "Bounded Abstract Effects."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2021",
        "info": "Volume 43, 2021",
        "count": 17,
        "papers": [
            "Robustly Safe Compilation, an Efficient Form of Secure Compilation.",
            "CSim2: Compositional Top-down Verification of Concurrent Systems using Rely-Guarantee.",
            "A Lightweight Formalism for Reference Lifetimes and Borrowing in Rust.",
            "Polymorphic Iterable Sequential Effect Systems.",
            "Ranking and Repulsing Supermartingales for Reachability in Randomized Programs.",
            "A Programming Language for Data Privacy with Accuracy Estimations.",
            "On Polymorphic Sessions and Functions: A Tale of Two (Fully Abstract) Encodings.",
            "Armed Cats: Formal Concurrency Modelling at Arm.",
            "Compositional Programming.",
            "Safe-by-default Concurrency for Modern Programming Languages.",
            "A Fresh Look at Zones and Octagons.",
            "Securing Interruptible Enclaved Execution on Small Microprocessors.",
            "Introduction to the Special Section on ESOP 2020.",
            "An Extended Account of Trace-relating Compiler Correctness and Secure Compilation.",
            "RustHorn: CHC-based Verification for Rust Programs.",
            "TaDA Live: Compositional Reasoning for Termination of Fine-grained Concurrent Programs.",
            "Completeness and Complexity of Reasoning about Call-by-Value in Hoare Logic."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2020",
        "info": "Volume 42, 2020",
        "count": 19,
        "papers": [
            "Introduction to the Special Issue on ESOP 2018.",
            "Consistent Subtyping for All.",
            "Modular Product Programs.",
            "Behavioural Equivalence via Modalities for Algebraic Effects.",
            "Reasoning about a Machine with Local Capabilities: Provably Safe Stack and Return Pointer Management.",
            "A Theory of Slicing for Imperative Probabilistic Programs.",
            "Debugging Large-scale Datalog: A Scalable Provenance Evaluation Strategy.",
            "Generalized Points-to Graphs: A Precise and Scalable Abstraction for Points-to Analysis.",
            "Symbolic Disintegration with a Variety of Base Measures.",
            "A Principled Approach to Selective Context Sensitivity for Pointer Analysis.",
            "Corrigendum to \"Type-driven Gradual Security with References, \" by Toro et al., ACM Transactions on Programming Languages and Systems (TOPLAS) Volume 40, Issue 4, Article No. 16.",
            "An Effective Fusion and Tile Size Model for PolyMage.",
            "Inferring Lower Runtime Bounds for Integer Programs.",
            "Obsidian: Typestate and Assets for Safer Blockchain Programming.",
            "Type Inference for C: Applications to the Static Analysis of Incomplete Programs.",
            "Interprocedural Context-Unbounded Program Analysis Using Observation Sequences.",
            "Chocola: Composable Concurrency Language.",
            "Active Learning for Inference and Regeneration of Applications that Access Databases.",
            "Semantic Correctness of Dependence-based Slicing for Interprocedural, Possibly Nonterminating Programs."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2019",
        "info": "Volume 41, 2019",
        "count": 23,
        "papers": [
            "Dynamic Deadlock Verification for General Barrier Synchronisation.",
            "Rigorous Estimation of Floating-Point Round-Off Errors with Symbolic Taylor Expansions.",
            "Optimal Choice of When to Garbage Collect.",
            "Feature-Specific Profiling.",
            "Practical Subtyping for Curry-Style Languages.",
            "Rethinking Incremental and Parallel Pointer Analysis.",
            "Editorial.",
            "A Classical Sequent Calculus with Dependent Types.",
            "Context-Free Session Type Inference.",
            "Probabilistic Termination by Monadic Affine Sized Typing.",
            "ML, Visibly Pushdown Class Memory Automata, and Extended Branching Vector Addition Systems with States.",
            "CSS Minification via Constraint Solving.",
            "A Machine-Learning Algorithm with Disjunctive Model for Data-Driven Program Analysis.",
            "Higher-order Demand-driven Program Analysis.",
            "Failure Recovery in Resilient X10.",
            "PYE: A Framework for Precise-Yet-Efficient Just-In-Time Analyses for Java Programs.",
            "Combinatorial Register Allocation and Instruction Scheduling.",
            "Static Identification of Injection Attacks in Java.",
            "Analysis and Optimization of Task Granularity on the Java Virtual Machine.",
            "Non-polynomial Worst-Case Analysis of Recursive Programs.",
            "On the Impact of Programming Languages on Code Quality: A Reproduction Study.",
            "Environmental Bisimulations for Probabilistic Higher-order Languages.",
            "Faster Algorithms for Dynamic Algebraic Queries in Basic RSMs with Constant Treewidth."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2018",
        "info": "Volume 40, 2018",
        "count": 19,
        "papers": [
            "Bit-Precise Procedure-Modular Termination Analysis.",
            "Constraint-Based Refactoring.",
            "Verifying Reliability Properties Using the Hyperball Abstract Domain.",
            "Conditioning in Probabilistic Programming.",
            "Program Synthesis for Program Analysis.",
            "A Logical Analysis of Framing for Specifications with Pure Method Calls.",
            "Algorithmic Analysis of Qualitative and Quantitative Termination Problems for Affine Probabilistic Programs.",
            "Cross-Language Interoperability in a Multi-Language Runtime.",
            "Algorithms for Algebraic Path Properties in Concurrent Systems of Constant Treewidth Components.",
            "POP-PL: A Patient-Oriented Prescription Programming Language.",
            "Editor's Foreword to \"Static Backward Slicing of Non-Deterministic Programs and Systems\".",
            "Static Backward Slicing of Non-deterministic Programs and Systems.",
            "Modular Termination Verification of Single-Threaded and Multithreaded Programs.",
            "A Theoretical Foundation of Sensitivity in an Abstract Interpretation Framework.",
            "Adaptive Static Analysis via Learning with Bayesian Optimization.",
            "Transactional Sapphire: Lessons in High-Performance, On-the-fly Garbage Collection.",
            "Type-Driven Gradual Security with References.",
            "Interconnectability of Session-Based Logical Processes.",
            "Corrigendum to \"Cross-Language Interoperability in a Multi-Language Runtime\", by Grimmer et al., ACM Transactions on Programming Languages and Systems (TOPLAS) Volume 40, Issue 2, Article No. 8."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2017",
        "info": "Volume 39, 2017",
        "count": 18,
        "papers": [
            "Foreword.",
            "Limitations of Partial Compaction: Towards Practical Bounds.",
            "Polymorphic Manifest Contracts, Revised and Resolved.",
            "On Subtyping-Relation Completeness, with an Application to Iso-Recursive Types.",
            "SPL: An Extensible Language for Distributed Stream Processing.",
            "Don't Sit on the Fence: A Static Analysis Approach to Automatic Fence Insertion.",
            "Programs from Proofs: A Framework for the Safe Execution of Untrusted Software.",
            "Towards a Compiler for Reals.",
            "Newtonian Program Analysis via Tensor Product.",
            "Multiple Facets for Dynamic Information Flow with Exceptions.",
            "Verifying Invariants of Lock-Free Data Structures with Rely-Guarantee and Refinement Types.",
            "From Clarity to Efficiency for Distributed Algorithms.",
            "The Chemical Approach to Typestate-Oriented Programming.",
            "A Simple, Possibly Correct LR Parser for C11.",
            "Precise Predictive Analysis for Discovering Communication Deadlocks in MPI Programs.",
            "Sound Non-Statistical Clustering of Static Analysis Alarms.",
            "Scaling Reliably: Improving the Scalability of the Erlang Distributed Actor Platform.",
            "SHErrLoc: A Static Holistic Error Locator."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2015",
        "info": "Volume 38, 2015/2016",
        "count": 16,
        "papers": [
            "Fast: A Transducer-Based Language for Tree Manipulation.",
            "A Dynamic Continuation-Passing Style for Dynamic Delimited Continuations.",
            "A Logical Approach to Deciding Semantic Subtyping.",
            "Verifying Custom Synchronization Constructs Using Higher-Order Separation Logic.",
            "Compiler-Driven Software Speculation for Thread-Level Parallelism.",
            "Selective X-Sensitive Analysis Guided by Impact Pre-Analysis.",
            "An Abstract Interpretation-Based Model of Tracing Just-in-Time Compilation.",
            "ThisType for Object-Oriented Languages: From Theory to Practice.",
            "Thinking Inside the Box: Compartmentalized Garbage Collection.",
            "A Practical Approach for Model Checking C/C++11 Code.",
            "Automatic Storage Optimization for Arrays.",
            "The Pluto+ Algorithm: A Practical Approach for Parallelization and Locality Optimization of Affine Loop Nests.",
            "Analyzing Runtime and Size Complexity of Integer Programs.",
            "The Design and Formalization of Mezzo, a Permission-Based Programming Language.",
            "The Truth, The Whole Truth, and Nothing But the Truth: A Pragmatic Guide to Assessing Empirical Evaluations.",
            "DRFx: An Understandable, High Performance, and Flexible Memory Model for Concurrent Languages."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2014",
        "info": "Volume 37, 2014/2015",
        "count": 14,
        "papers": [
            "Editorial.",
            "Interval Analysis and Machine Arithmetic: Why Signedness Ignorance Is Bliss.",
            "A Scheduling Framework for Spatial Architectures Across Multiple Constraint-Solving Theories.",
            "Reactive Imperative Programming with Dataflow Constraints.",
            "Practical Fine-Grained Information Flow Control Using Laminar.",
            "MCALIB: Measuring Sensitivity to Rounding Error with Monte Carlo Programming.",
            "Secure Compilation to Protected Module Architectures.",
            "Verification of a Cryptographic Primitive: SHA-256.",
            "Automated Classification of Data Races Under Both Strong and Weak Memory Models.",
            "An Extension of ATL with Strategy Interaction.",
            "The Design and Implementation of a Verification Technique for GPU Kernels.",
            "Affine Refinement Types for Secure Distributed Programming.",
            "Polyhedral AST Generation Is More Than Scanning Polyhedra.",
            "Behavioral Subtyping, Specification Inheritance, and Modular Reasoning."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2014",
        "info": "Volume 36, 2014",
        "count": 14,
        "papers": [
            "Extending Type Inference to Variational Programs.",
            "Æminium: A Permission-Based Concurrent-by-Default Programming Language Approach.",
            "Rely-Guarantee-Based Simulation for Compositional Verification of Concurrent Program Transformations.",
            "Formal Verification of an SSA-Based Middle-End for CompCert.",
            "Specialization Slicing.",
            "Atomicity Refinement for Verified Compilation.",
            "Herding Cats: Modelling, Simulation, Testing, and Data Mining for Weak Memory.",
            "Global Sparse Analysis Framework.",
            "Pattern-Based Verification for Multithreaded Programs.",
            "Lazy Scheduling: A Runtime Adaptive Scheduler for Declarative Parallelism.",
            "Abstract Domains of Affine Relations.",
            "Foundations of Typestate-Oriented Programming.",
            "Kitsune: Efficient, General-Purpose Dynamic Software Updating for C.",
            "A Widening Approach to Multithreaded Program Verification."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2013",
        "info": "Volume 35, 2013",
        "count": 14,
        "papers": [
            "Editorial.",
            "Mixin' Up the ML Module System.",
            "A Transformation Framework for Optimizing Task-Parallel Programs.",
            "TSL: A System for Generating Abstract Interpreters and its Application to Machine-Code Analysis.",
            "Practical Integrated Analysis of Pointers, Dataflow and Control Flow.",
            "Dependent Type Theory for Verification of Information Flow and Access Control Policies.",
            "Efficient Identification of Linchpin Vertices in Dependence Clusters.",
            "Proof-Directed Parallelization Synthesis by Separation Logic.",
            "Probabilistic Relational Reasoning for Differential Privacy.",
            "Analysis of Recursively Parallel Programs.",
            "Contracts for First-Class Classes.",
            "Making the java memory model safe.",
            "Divergence analysis.",
            "Reachability analysis of program variables."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2012",
        "info": "Volume 34, 2012",
        "count": 17,
        "papers": [
            "Editorial.",
            "Implicit dynamic frames.",
            "Parameterized loop tiling.",
            "A data-centric approach to synchronization.",
            "ScalaExtrap: Trace-based communication extrapolation for SPMD programs.",
            "Algorithmic verification of asynchronous programs.",
            "Partially Evaluating Finite-State Runtime Monitors Ahead of Time.",
            "Structured Communication-Centered Programming for Web Services.",
            "On a Technique for Transparently Empowering Classical Compiler Optimizations on Multithreaded Code.",
            "Reasoning about Web Applications: An Operational Semantics for HOP.",
            "Equivalence checking of static affine programs using widening to handle recurrences.",
            "Essential AOP: The a calculus.",
            "Space overhead bounds for dynamic memory management with partial compaction.",
            "Multivariate amortized resource analysis.",
            "Natural and Flexible Error Recovery for Generated Modular Language Environments.",
            "On the Termination of Integer Loops.",
            "Bisimulation for Quantum Processes."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2011",
        "info": "Volume 33, 2011",
        "count": 21,
        "papers": [
            "Editorial.",
            "Semantics of transactional memory and automatic mutual exclusion.",
            "LOCKSMITH: Practical static race detection for C.",
            "Mechanically verified proof obligations for linearizability.",
            "Environmental bisimulations for higher-order languages.",
            "Morphing: Structurally shaping a class by reflecting on others.",
            "Automated termination proofs for haskell by term rewriting.",
            "Refinement types for secure implementations.",
            "Refactoring using type constraints.",
            "Mathematical foundation of trace scheduling.",
            "Solving systems of rational equations through strategy iteration.",
            "JavaGI: The Interaction of Type Classes with Interfaces and Inheritance.",
            "An Abstract Model of Certificate Translation.",
            "A Theory of Synchronous Relational Interfaces.",
            "Software model checking using languages of nested trees.",
            "On contract satisfaction in a higher-order world.",
            "Bottom-up shape analysis using LISF.",
            "Editorial note.",
            "Floyd-hoare logic for quantum programs.",
            "Separating ownership topology and encapsulation with generic universe types.",
            "Fast interprocedural linear two-variable equalities."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2009",
        "info": "Volume 32, 2009/2010",
        "count": 24,
        "papers": [
            "Dependence clusters in source code.",
            "Parametric polymorphism for XML.",
            "An experimental analysis of self-adjusting computation.",
            "JavaCOP: Declarative pluggable types for java.",
            "A relational approach to interprocedural shape analysis.",
            "Hybrid type checking.",
            "Semantic foundations for typed assembly languages.",
            "A termination analyzer for Java bytecode based on path-length.",
            "Satin: A high-level and efficient grid programming model.",
            "La dolce vita at TOPLAS.",
            "An optimization framework for embedded processors with auto-addressing mode.",
            "Nomadic pict: Programming languages, communication infrastructure overlays, and semantics for mobile computation.",
            "Scratchpad allocation for concurrent embedded software.",
            "Santa Claus: Formal analysis of a process-oriented solution.",
            "Detecting bugs in register allocation.",
            "A hybrid type system for lock-freedom of mobile processes.",
            "Execution suppression: An automated iterative technique for locating memory errors.",
            "Verifying safety properties of concurrent heap-manipulating programs.",
            "A calculus for uniform feature composition.",
            "La prossima vita at TOPLAS.",
            "Typing linear constraints.",
            "Semantics of fractional permissions with nesting.",
            "WYSINWYX: What you see is not what you eXecute.",
            "Finite differencing of logical formulas for static analysis."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2008",
        "info": "Volume 31, 2008/2009",
        "count": 25,
        "papers": [
            "A programming model for concurrent object-oriented programs.",
            "Efficient constraint propagation engines.",
            "Decomposing bytecode verification by abstract interpretation.",
            "A probabilistic language based on sampling functions.",
            "Verified interoperable implementations of security protocols.",
            "Erratum to \"Efficient constraint propagation engines\".",
            "Revisiting coroutines.",
            "Expressive and modular predicate dispatch for Java.",
            "The computational power and complexity of constraint handling rules.",
            "Deferring design pattern decisions and automating structural pattern changes using a design-pattern-based programming system.",
            "Ranking functions for size-change termination.",
            "Separation and information hiding.",
            "Operational semantics for multi-language programs.",
            "Sequent calculi and abstract machines.",
            "Program transformations using temporal logic side conditions.",
            "On the origins of bisimulation and coinduction.",
            "Term transformers: A new approach to state.",
            "Remembrances of things past.",
            "Mostly static program partitioning of binary executables.",
            "Certificate translation for optimizing compilers.",
            "A theory of contracts for Web services.",
            "Program locality analysis using reuse distance.",
            "From datalog rules to efficient programs with time and space guarantees.",
            "Self-stabilization preserving compiler.",
            "Local policies for resource usage analysis."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2007",
        "info": "Volume 30, 2007/2008",
        "count": 34,
        "papers": [
            "Heap reference analysis using access graphs.",
            "Forma: A framework for safe automatic array reshaping.",
            "Empirical study of optimization techniques for massive slicing.",
            "Efficient field-sensitive pointer analysis of C.",
            "Efficient dynamic dispatching with type slicing.",
            "Run-time principals in information-flow type systems.",
            "Reverse-mode AD in a functional framework: Lambda the ultimate backpropagator.",
            "Exceptional situations and program reliability.",
            "Normalize, transpose, and distribute: An automatic approach for handling nonscalars.",
            "Dynamic slicing on Java bytecode traces.",
            "FeatherTrait: A modest extension of Featherweight Java.",
            "The pitfalls of verifying floating-point computations.",
            "On the complexity of partially-flow-sensitive alias analysis.",
            "AspectML: A polymorphic aspect-oriented functional programming language.",
            "Witnessing side effects.",
            "Size-change termination with difference constraints.",
            "PEAK - a fast and effective performance tuning system via compiler optimization orchestration.",
            "Checking type safety of foreign function calls.",
            "Relations as an abstraction for BDD-based program analysis.",
            "Types for atomicity: Static checking and inference for Java.",
            "Java bytecode verification via static single assignment form.",
            "Remote specialization for efficient embedded operating systems.",
            "Register allocation for software pipelined multidimensional loops.",
            "Local reasoning about a copying garbage collector.",
            "A semantics-based approach to malware detection.",
            "Nominal logic programming.",
            "A capability calculus for concurrency and determinism.",
            "Two-dimensional bidirectional object layout.",
            "A type system equivalent to a model checker.",
            "Verifying policy-based web services security.",
            "Domain specific language implementation via compile-time meta-programming.",
            "XARK: An extensible framework for automatic recognition of computational kernels.",
            "Perfect hashing as an almost perfect subtype test.",
            "Dually nondeterministic functions."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2007",
        "info": "Volume 29, 2007",
        "count": 39,
        "papers": [
            "A constraint-based approach to guarded algebraic data types.",
            "Profile-based pretenuring.",
            "PPMexe: Program compression.",
            "A static type system for JVM access control.",
            "Program termination analysis in polynomial time.",
            "Type-based publish/subscribe: Concepts and experiences.",
            "Slicing as a program transformation.",
            "A deterministic logical semantics for pure Esterel.",
            "Allocating architected registers through differential encoding.",
            "Termination analysis of logic programs through combination of type-based norms.",
            "Fast online pointer analysis.",
            "METRIC: Memory tracing via dynamic binary rewriting to identify cache inefficiencies.",
            "A provenly correct translation of Fickle into Java.",
            "Editorial.",
            "Transition predicate abstraction and fair termination.",
            "Saturn: A scalable framework for error detection using Boolean satisfiability.",
            "Combinators for bidirectional tree transformations: A linguistic approach to the view-update problem.",
            "Design, implementation, and evaluation of a compilation server.",
            "A practical interprocedural dominance algorithm.",
            "An efficient on-the-fly cycle collection.",
            "Static validation of XSL transformations.",
            "Mutatis Mutandis: Safe and predictable dynamic software updating.",
            "Introduction to special ESOP'05 issue.",
            "BI-hyperdoctrines, higher-order separation logic, and abstraction.",
            "A type discipline for authorization policies.",
            "The trace partitioning abstract domain.",
            "A new foundation for control dependence and slicing for modern program structures.",
            "Enforcing resource bounds via static verification of dynamic checks.",
            "Analysis of modular arithmetic.",
            "Editorial: A changing of the guard.",
            "A uniform type structure for secure information flow.",
            "Encapsulating objects with confined types.",
            "The embedded machine: Predictable, portable real-time code.",
            "A step towards unifying schedule and storage optimization.",
            "Dynamic graph-based software fingerprinting.",
            "A proof theory for machine code.",
            "Optimizing indirect branch prediction accuracy in virtual machine interpreters.",
            "An improved bound for call strings based interprocedural analysis of bit vector frameworks.",
            "Goal-directed weakening of abstract interpretation results."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2006",
        "info": "Volume 28, 2006",
        "count": 27,
        "papers": [
            "An on-the-fly reference-counting garbage collector for java.",
            "EDO: Exception-directed optimization in java.",
            "Effective sign extension elimination for java.",
            "A region-based compilation technique for dynamic compilers.",
            "Computability classes for enforcement mechanisms.",
            "Types for safe locking: Static race detection for Java.",
            "Nontermination inference of logic programs.",
            "A bisimulation-based semantic theory of Safe Ambients.",
            "Traits: A mechanism for fine-grained reuse.",
            "Type inference for unique pattern matching.",
            "Quantified types in an imperative language.",
            "Generating object lifetime traces with Merlin.",
            "MultiJava: Design rationale, compiler implementation, and applications.",
            "Right nulled GLR parsers.",
            "A machine-checked model for a Java-like language, virtual machine, and compiler.",
            "Fast partial evaluation of pattern matching in strings.",
            "Message analysis for concurrent programs using message passing.",
            "Calculational semantics: Deriving programming theories from equations by functional predicate calculus.",
            "Variant parametric types: A flexible subtyping scheme for generics.",
            "An algebraic array shape inference system for MATLAB.",
            "Controlling garbage collection and heap growth to reduce the execution time of Java applications.",
            "Exploiting reference idempotency to reduce speculative storage overflow.",
            "Denali: A practical algorithm for generating optimal code.",
            "Adaptive functional programming.",
            "Flow-insensitive type qualifiers.",
            "Interprocedural slicing of multithreaded programs with applications to Java.",
            "On minimizing materializations of array-valued temporaries."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2005",
        "info": "Volume 27, 2005",
        "count": 33,
        "papers": [
            "A type system for certified binaries.",
            "Regular expression types for XML.",
            "Optimizing aggregate array computations in loops.",
            "Automatic discovery of covariant read-only fields.",
            "Pretty printing with lazy dequeues.",
            "Symbolic bounds analysis of pointers, array indices, and accessed memory regions.",
            "Dealing with incomplete knowledge on CLP(FD) variable domains.",
            "Resource usage analysis.",
            "Polymorphic predicate abstraction.",
            "A systematic approach to static access control.",
            "Corrigendum:  a new, simpler linear-time dominators algorithm.",
            "When do bounds and domain propagation lead to the same search space?",
            "A practical and fast iterative algorithm for phi-function computation using DJ graphs.",
            "Resource aware programming.",
            "CCured: type-safe retrofitting of legacy software.",
            "Efficient and effective array bound checking.",
            "Comparing conservative coalescing criteria.",
            "The KaffeOS Java runtime system.",
            "Cost and precision tradeoffs of dynamic data slicing algorithms.",
            "Interprocedural parallelization analysis in SUIF.",
            "Design and evaluation of dynamic optimizations for a Java just-in-time compiler.",
            "Analysis of recursive state machines.",
            "Efficient subtyping tests with PQ-encoding.",
            "Mixin modules in a call-by-value setting.",
            "Link-time binary rewriting techniques for program compaction.",
            "An accurate cost model for guiding data locality transformations.",
            "Functional declarative language design and predicate calculus: a practical approach.",
            "Dynamic software updating.",
            "A parallel, incremental, mostly concurrent garbage collector for servers.",
            "Termination analysis and specialization-point insertion in offline partial evaluation.",
            "A theory of overloading.",
            "Implicit-signal monitors.",
            "Birrell's distributed reference listing revisited."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2004",
        "info": "Volume 26, 2004",
        "count": 28,
        "papers": [
            "An interval constraint system for lattice domains.",
            "Send-receive considered harmful: Myths and realities of message passing.",
            "Access control for mobile agents: The calculus of boxed ambients.",
            "Synthesis of fault-tolerant concurrent programs.",
            "On exponential-time completeness of the circularity problem for attribute grammars.",
            "Offline partial evaluation can be as accurate as online partial evaluation.",
            "Logic of global synchrony.",
            "A fast and accurate framework to analyze and optimize cache memory behavior.",
            "Hancock: A language for analyzing transactional data streams.",
            "Modular refinement of hierarchic reactive machines.",
            "Traversals of object structures: Specification and Efficient Implementation.",
            "A framework for the integration of partial evaluation and abstract interpretation of logic programs.",
            "An unfold/fold transformation framework for definite logic programs.",
            "Natural semantics as a static program analysis framework.",
            "JR: Flexible distributed programming in an extended Java.",
            "First-class monadic schedules.",
            "Polymorphic specialization for ML.",
            "Symmetry and reduced symmetry in model checking.",
            "Optimistic register coalescing.",
            "Guest editorial.",
            "Modern concurrency abstractions for C#.",
            "Extensible objects without labels.",
            "Modular typechecking for hierarchically extensible datatypes and functions.",
            "A semantics for advice and dynamic join points in aspect-oriented programming.",
            "The pattern calculus.",
            "A fast, memory-efficient register allocation framework for embedded systems.",
            "Automatic tiling of iterative stencil loops.",
            "A tail-recursive machine with stack inspection."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2003",
        "info": "Volume 25, 2003",
        "count": 20,
        "papers": [
            "Mobile safe ambients.",
            "Pointer analysis for structured parallel programs.",
            "Information flow inference for ML.",
            "Intensional analysis of quantified types.",
            "A transformational approach to binary translation of delayed branches.",
            "PolyTOIL: A type-safe polymorphic object-oriented language.",
            "A foundation for embedded languages.",
            "Eliminating synchronization bottlenecks using adaptive replication.",
            "Stack inspection: Theory and variants.",
            "Rank 2 intersection types for local definitions and conditional expressions.",
            "Automatic program specialization for Java.",
            "Continuous program optimization: A case study.",
            "The receptive distributed pi-calculus.",
            "Class analyses as abstract interpretations of trace semantics.",
            "Generating LR syntax error messages from examples.",
            "Jam - designing a Java extension with mixins.",
            "Escape analysis for JavaTM: Theory and practice.",
            "Fractal symbolic analysis.",
            "Extending Java for high-level Web service construction.",
            "Stack allocation and synchronization optimizations for Java using escape analysis."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2002",
        "info": "Volume 24, 2002",
        "count": 21,
        "papers": [
            "Automatic data and computation decomposition on distributed memory parallel computers.",
            "An assume-guarantee rule for checking simulation.",
            "Efficient and precise array access analysis.",
            "Guest editorial.",
            "Type-preserving compilation of Featherweight Java.",
            "More dynamic object reclassification: Fickle||.",
            "The apprentice challenge.",
            "Parametric shape analysis via 3-valued logic.",
            "Handling irreducible loops: optimized node splitting versus DJ-graphs.",
            "Compiling language definitions: the ASF+SDF compiler.",
            "Automatic derivation of compiler machine descriptions.",
            "Register tiling in nonrectangular iteration spaces.",
            "On loops, dominators, and dominance frontiers.",
            "Data abstraction and information hiding.",
            "The undecidability of associativity and commutativity analysis.",
            "Information flow vs. resource access in the asynchronous pi-calculus.",
            "On the usefulness of type and liveness accuracy for garbage collection and leak detection.",
            "Practical extraction techniques for Java.",
            "Efficient and effective branch reordering using profile data.",
            "Repairing syntax errors in LR parsers.",
            "Type-Safe linking with recursive DLLs and shared libraries."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2001",
        "info": "Volume 23, 2001",
        "count": 17,
        "papers": [
            "Semiring-based contstraint logic programming: syntax and semantics.",
            "Using types to analyze and optimize object-oriented programs.",
            "Scheduling time-constrained instructions on pipelined processors.",
            "A schema for interprocedural modification side-effect analysis with pointer aliasing.",
            "Synthesis of concurrent programs for an atomic read/write model of computation.",
            "Type elaboration and subtype completion for Java bytecode.",
            "Model checking of hierarchical state machines.",
            "Transformations of CCP programs.",
            "Featherweight Java: a minimal core calculus for Java and GJ.",
            "Error repair with validation in LR-based parsing.",
            "Parallel execution of prolog programs: a survey.",
            "Operator strength reduction.",
            "Mechanizing a theory of program composition for UNITY.",
            "An indexed model of recursive types for foundational proof-carrying code.",
            "A framework for call graph construction algorithms.",
            "Efficient Java RMI for parallel programming.",
            "Lessons learned about one-way, dataflow constraints in the Garnet and Amulet graphical toolkits."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "2000",
        "info": "Volume 22, 2000",
        "count": 28,
        "papers": [
            "Local type inference.",
            "Lazy rewriting on eager machinery.",
            "An automata-theortetic approach to modular model checking.",
            "Efficient and safe-for-space closure conversion.",
            "Undecidability of context-sensitive data-independence analysis.",
            "Incremental analysis of constraint logic programs.",
            "Generation of LR parsers by partial evaluation.",
            "From flop to megaflops: Java for technical computing.",
            "Independence in CLP languages.",
            "Type-based analysis of uncaught exceptions.",
            "Compiler techniques for code compaction.",
            "Context-sensitive synchronization-sensitive analysis is undecidable.",
            "Fusion-based register allocation.",
            "Java bytecode compression for low-end embedded systems.",
            "Automated data-member layout of help objects to improve memory-hierarchy performance.",
            "Integrating object-oriented programming and protected objects in Ada 95.",
            "Understanding class hierarchies using concept analysis.",
            "Graph rewrite systems for program optimization.",
            "Standard fixpoint iteration for Java bytecode verification.",
            "Program transformation and runtime support for threaded MPI execution on shared-memory machines.",
            "Typed memory management via static capabilities.",
            "Optimizing memory usage in the polyhedral model.",
            "A balanced code placement framework.",
            "Sets and constraint logic programming.",
            "The benefits and costs of DyC's run-time optimizations.",
            "Extending Graham-Glanville techniques for optimal code generation.",
            "The role of commutativity in constraint propagation algorithms.",
            "Syntactic type abstraction."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1999",
        "info": "Volume 21, 1999",
        "count": 32,
        "papers": [
            "On Failure of the Pruning Technique in \"Error Repair in Shift-Reduce Parsers\".",
            "Dynamic Typing for Distributed Programming in Polymorphic Languages.",
            "Specification and Verification of Fault-Tolerance, Timing, and Scheduling.",
            "A Type System for Java Bytecode Subroutines.",
            "Space-Efficient Scheduling of Nested Parallelism.",
            "Identifying Loops in Almost Linear Time.",
            "Effectivness of Abstract Interpretation in Automatic Parallelization: A Case Study in Logic Programming.",
            "A Provably Time-Efficient Parallel Implementation of Full Speculation.",
            "Techniques for the Translation of MATLAB Programs into Fortran 90.",
            "'C and tcc: A Language and Compiler for Dynamic Code Generation.",
            "Componential Set-Based Analysis.",
            "Reasoning about Grover's quantum search algorithm using probabilistic wp.",
            "Compile-time memory reuse in logic programming languages through update in place.",
            "Should your specification language be typed.",
            "From system F to typed assembly language.",
            "Efficient logic variables for distributed computing.",
            "Partial redundancy elimination in SSA form.",
            "Specificational functions.",
            "Cache miss equations: a compiler framework for analyzing and tuning memory behavior.",
            "Model-checking concurrent systems with unbounded integer variables: symbolic representations, approximations, and experimental results.",
            "Dependency analysis for Standard ML.",
            "Hierarchical modularity.",
            "Interprocedural pointer alias analysis.",
            "Linear scan register allocation.",
            "Linearity and the pi-calculus.",
            "Sharing and groundness dependencies in logic programs.",
            "Procedure placement using temporal-ordering information.",
            "Static correlated branch prediction.",
            "Specification and dialogue control of visual interaction through visual rewriting systems.",
            "Constraint-based termination analysis of logic programs.",
            "The type system for object initializatiion in the Jave bytecode language.",
            "A global communication optimization technique based on data-flow analysis and linear algebra."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1998",
        "info": "Volume 20, 1998",
        "count": 33,
        "papers": [
            "Solving Shape-Analysis Problems in Languages with Destructive Updating.",
            "Synthesis of Concurrent Systems with Many Similar Processes.",
            "Fast Algorithms for Compressed Multimethod Dispatch Table Generation.",
            "Polymorphic Splitting: An Effective Polyvariant Flow Analysis.",
            "Controlling Generalization amd Polyvariance in Partial Deduction of Normal Logic Programs.",
            "\"Maximal-munch\" Tokenization in Linear Time.",
            "A Study of the Applicability of Existing Exception-Handling Techniques to Component-Base Real-Time Software Technology.",
            "Isomorph-Free Model Enumeration: A New Method for Checking Relational Specifications.",
            "A Systematic Study of Functional Language Implementations.",
            "A New Framework for Elimination-Based Data Flow Analysis Using DJ Graphs.",
            "A Partially Deadlock-Free Typed Process Calculus.",
            "The Design, Implementation, and Evaluation of Jade.",
            "Static Caching for Incremental Computation.",
            "An Abstract Machine for Tabled Execution of Fixed-Order Stratified Logic Programs.",
            "Constraint-Based Array Dependence Analysis.",
            "Within ARM's Reach: Compilation of Left-Linear Rewrite Systems via Minimal Rewrite Systems.",
            "Proofs about a Folklore Let-Polymorphic Type Inference Algorithm.",
            "A Region Inference Algorithm.",
            "Partial Evaluation of Functional Logic Programs.",
            "A Practical and Flexible Flow Analysis for Higher-Order Languages.",
            "Automatic Data Layout for Distributed-Memory Machines.",
            "Compositional Verification of Concurrent Systems Using Petri-Net-Based Condensation Rules.",
            "Efficient and Flexible Incremental Parsing.",
            "Alma-O: An Imperative Language That Supports Declarative Programming.",
            "A Logical Model for Relational Abstract Domains.",
            "Dynamic Currency Determination in Optimized Programs.",
            "A Task- and Data-Parallel Programming Language Based on Shared Objects.",
            "Finitary Fairness.",
            "Space/Time-Efficient Scheduling and Execution of Parallel Irregular Computations.",
            "Optimizing Compilation of CLP(R).",
            "Equality-based flow analysis versus recursive types.",
            "A New, Simpler Linear-Time Dominators Algorithm.",
            "Cost-Optimal Code Motion."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1997",
        "info": "Volume 19, 1997",
        "count": 35,
        "papers": [
            "Precise Flow-Insensitive May-Alias Analysis is NP-Hard.",
            "Complementation in Abstract Interpretation.",
            "Lightweight Closure Conversion.",
            "A Practical Soft Type System for Scheme.",
            "Implementing Signatures for C++.",
            "Evidence-Based Static Branch Prediction Using Machine Learning.",
            "Pure Versus Impure Lisp.",
            "Incremental Computation of Dominator Trees.",
            "Abstract Interpretation of Reactive Systems.",
            "Protocol Specifications and Component Adaptors.",
            "Formally Based Profiling for Higher-Order Functional Languages.",
            "Symboloc Model Checking for Event-Driven Real-Time Systems.",
            "On the Use of Regular Expressions for Searching Text.",
            "Kleene Algebra with Tests.",
            "Formal Derivation of Efficient Parallel Programs by Construction of List Homomorphisms.",
            "Optimal Control Dependence Computation and the Roman Chariots Problem.",
            "Specifying Representations of Machine Instructions.",
            "Slicing Real-Time Programs for Enhanced Schedulability.",
            "Nesting of Reducible and Irreducible Loops.",
            "Interprocedural Control Flow Analysis of First-Order Programs with Tail-Call Optimization.",
            "A Refinement Calculus for the Synthesis of Verified Hardware Descriptions in VHDL.",
            "Utilizing Symmetry when Model-Checking under Fairness Assumptions: An Automata-Theoretic Approach.",
            "Toward a Complete Transformational Toolkit for Compilers.",
            "Proving Concurrent Constraint Programs Correct.",
            "Verifying Parameterized Networks.",
            "Disjunctive Program Analysis for Algebraic Data Types.",
            "Mobile Objects in Distributed Oz.",
            "Parallelizing Nonnumerical Code with Selective Scheduling and Software Pipelining.",
            "Combinatory Formaulations of Concurrent Languages.",
            "A Reflection on Call-by-Value.",
            "Commutativity Analysis: A New Analysis Technique for Parallelizing Compilers.",
            "A Practical Framework for Demand-Driven Interprocedural Data Flow Analysis.",
            "Making Graphs Reducible with Controlled Node Splitting.",
            "An Approach for Exploring Code-Improving Transformations.",
            "A Note on \"On the Conversion of Indirect to Direct Recursion\"."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1996",
        "info": "Volume 18, 1996",
        "count": 27,
        "papers": [
            "Iteration Abstraction in Sather.",
            "On the Optimality of Change Propagation for Incremental Evaluation of Hierarchical Attribute Grammars.",
            "An Incremental Algorithm for Satisfying Hierarchies of Multiway Dataflow Constraints.",
            "Conditional Attribute Grammars.",
            "Type Classes in Haskell.",
            "Handling Floating-Point Exceptions in Numeric Programs.",
            "Total Correctness by Local Improvement in the Transformation of Functional Programs.",
            "Storage Assignment to Decrease Code Size.",
            "Polymorphic typing of Variables and References.",
            "Parallelism for Free: Efficient and Optimal Bitvector Analyses for Parallel Programs.",
            "Iterated Register Coalescing.",
            "Probabilistic Predicate Transformers.",
            "Reconciling Responsiveness with Performance in Pure Object-Orieted Languages.",
            "On Subtyping and Matching.",
            "Improving Data Locality with Loop Transformations.",
            "Compositional Parallel Programming Languages.",
            "Symbolic Analysis for Parallelizing Compilers.",
            "Constrained Types and Their Expressiveness.",
            "Principles and Practice of Unification Factoring.",
            "Global Analysis of Constraint Logic Programs.",
            "Indirect Distributed Garbage Collection: Handling Object Migration.",
            "Identifying Loops Using DJ Graphs.",
            "Using Dataflow Analysis Techniques to Reduce Ownership Overhead in Cache Coherence Protocols.",
            "Demand-Driven Register Allocation.",
            "A Natural Semantics for Eiffel Dynamic Binding.",
            "Eta-Expansion Does The Trick.",
            "Parameter Passing and Control Stack Management in Prolog Implementation Revisited."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1995",
        "info": "Volume 17, 1995",
        "count": 37,
        "papers": [
            "Optimal Incremental Parsing.",
            "Deducing Fairness Properties in UNITY Logic - A New Completeness Result.",
            "Improving Abstract Interpretations by Combining Domains.",
            "Notes on \"A Methodology for Implementing Highly Concurrent Data Objects\".",
            "Closure Analysis in Constraint Form.",
            "Safe: A Semantic Technique for Transforming Programs in the Presence of Errors.",
            "Beyond Induction Variables: Detecting and Classifying Sequences Using a Demand-Driven SSA.",
            "Optimal Evaluation of Array Expressions on Massively Parallel Machines.",
            "Local and Temporal Predicates In Distributed Systems.",
            "Combining Analyses, Combining Optimizations.",
            "Experimental Results from Dynamic Slicing of C Program.",
            "A Reexamination of \"Optimization of Array Subscript Range Checks\".",
            "A Worst Case of Circularity Test Algorithms for Attribute Grammars.",
            "Supporting Dynamic Data Structures on Distributed-Memory Machines.",
            "Efficient Implementation of Adaptive Software.",
            "Optimization of Functional Programs by Grammar Thinning.",
            "On the Complexity of Dataflow Analysis of Logic Programs.",
            "A Complete Calculus for the Multialgebraic and Functional Semantics of Nondeterminism.",
            "Matching-Based Incremental Evaluators for Hierarchical Attribute Grammar Dialects.",
            "Covariance and Contravariance: Conflict without a Cause.",
            "Type Checking Concurrent I/O.",
            "BURS Automata Generation.",
            "Efficientlty Computing Phi-Nodes On-The-Fly.",
            "Conjoining Specifications.",
            "Efficient Fault-Tolerant Algorithms for Distributed Resource Allocation.",
            "Influence of Cross-Interferences on Blocked Loops: A Case Study with Matric-Vector Multiply.",
            "A Type System Equivalent to Flow Analysis.",
            "Extracting Task-Level Parallelism.",
            "Backtracking without Trailing in CLP(R-lin).",
            "Error Repair in Shift-Reduce Parsers.",
            "An Evaluation of an Automatically Generated Compiler.",
            "Higher-Order Distributed Objects.",
            "Efficient Instruction Scheduling for Delayed-Load Architectures.",
            "Lattice Frameworks for Multiscore and Bidirectional Data Flow Problems.",
            "Typechecking and Modules for Multimethods.",
            "A Polymorphic Record Calculus and Its Compilation.",
            "Fast Strictness Analysis Based on Demand Propagation."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1994",
        "info": "Volume 16, 1994",
        "count": 63,
        "papers": [
            "Determinacy Testing for Nondeterminate Logic Programming Languages.",
            "Experimental Evaluation of a Generic Abstract Interpretation Algorithm for PROLOG.",
            "Cliché-Based Program Editors.",
            "The POLYLITH Software Bus.",
            "Efficient Computation of Interprocedural Definition-Use Chains.",
            "Live-Structure Dataflow Analysis for Prolog.",
            "Compositional Specification and Verification of Distributed Systems.",
            "Program Optimization and Parallelization Using Idioms.",
            "Path Analysis and the Optimization of Nonstrict Functional Programs.",
            "Efficient Register Allocation via Coloring Using Clique Separators.",
            "Debugging Optimized Code Without Being Misled.",
            "Improvements to Graph Coloring Register Allocation.",
            "Metalevel Building Blocks for Modular Systems.",
            "On the Adequacy of Graph Rewriting for Simulating Term Rewriting.",
            "Parallel Programming with Control Abstraction.",
            "A Compiler Approach to Scalable Concurrent-Program Design.",
            "Some Comments on \"A Denotational Semantics for Prolog\".",
            "Denotational Abstract Interpretation of Logic Programs.",
            "Suspension Analyses for Concurrent Logic Programs.",
            "On the Occur-Check-Free Prolog Programs.",
            "TransformGen: Automating the Maintenance of Structure-Oriented Environments.",
            "A Linear-Time Scheme for Version Reconstruction.",
            "Reasoning about Probabilistic Parallel Programs.",
            "Model Checking and Modular Verification.",
            "The Temporal Logic of Actions.",
            "Adding Fair Choice to Dijkstra's Calculus.",
            "A Bounded First-In, First-Enabled Solution to the l-Exclusion Problem.",
            "Coordinating First-Order Multiparty Interactions.",
            "How to Securely Replicate Services.",
            "Lazy and Incremental Program Generation.",
            "Controlled Grammatic Ambiguity.",
            "Recognizing Substrings of LR(k) Languages in Linear Time.",
            "Transforming Acyclic Programs.",
            "Static Slicing in the Presence of Goto Statements.",
            "The Definition of Dependence Distance.",
            "Optimal Code Motion: Theory and Practice.",
            "Avoidance and Suppression of Compensation Code in a Trace Scheduling Compiler.",
            "Operational Semantics-Directed Compilers and Machine Architectures.",
            "Static Analysis of Upper and Lower Bounds on Dependences and Parallelism.",
            "Functions as Passive Constraints in LIFE.",
            "Optimally Profiling and Tracing Programs.",
            "Modular Logic Programming.",
            "Efficient Counting Program Events with Support for On-Line Queries.",
            "Polymorphic Type Inference and Abstract Data Types.",
            "Fixpoint Computation for Polyvariant Static Analyses of Higher-Order Applicative Programs.",
            "Strictness Optimization for Graph Reduction Machines (Why id Might Not Be Strict).",
            "The Undecidability of Aliasing.",
            "A Generalized Theory of Bit Vector Data Flow Analysis.",
            "Model Checking and Abstraction.",
            "An Old-Fashined Recipe for Real-Time.",
            "Extending Attribute Grammars to Support Programming-in-the-Large.",
            "Decompilation: The Enumeration of Types and Grammars.",
            "Automatic Isolation of Compiler Errors.",
            "Time-Constrained Buffer Specifications in CSP+T and Timed CSP.",
            "Two Issues in Parallel Language Design.",
            "Single-Pass Generation of Static Single-Assignment Form for Structured Languages.",
            "Axiomatic Bootstrapping: A Guide for Compiler Hackers.",
            "Composing First-Class Transactions.",
            "Powerlist: A Structure for Parallel Recursion.",
            "Improving the Ratio of Memory Operations to Floating-Point Operations in Loops.",
            "A Behavioral Notion of Subtyping.",
            "A Unified Model of Pointwise Equivalence of Procedural Computations.",
            "Software Merge: Semantics of Combining Changes to Programs."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1993",
        "info": "Volume 15, 1993",
        "count": 29,
        "papers": [
            "The Derivation of Distributed Termination Detection Algorithms from Garbage Collection Schemes.",
            "The Concurrency Workbench: A Semantics-Based Tool for the Verification of Concurrent Systems.",
            "Composing Specifications.",
            "A General Framework for Semantics-Based Bottom-Up Abstract Interpretation of Logic Programs.",
            "Lazy Caching.",
            "A Correction to the Denotational Semantics for the Prolog of Nicholson and Foo.",
            "On the Type Structure of Standard ML.",
            "Type Inference with Polymorphic Recursion.",
            "Type Reconstruction in the Presence of Polymorphic Recursion.",
            "An Elimination Algorithm for Bidirectional Data Flow Problems Using Edge Placement.",
            "A Superimposition Control Construct for Distributed Systems.",
            "A Further Note on Hennessy's \"Symbolic Debugging of Optimized Code\".",
            "Interprocedural Optimization: Eliminating Unnecessary Recompilation.",
            "Compiling Nested Data-Parallel Programs for Shared-Memory Multiprocessors.",
            "Parameterized Partial Evaluation.",
            "The Design of the E Programming Language.",
            "Defining Context-Dependent Syntax Without Using Contexts.",
            "Leader Election in Uniform Rings.",
            "Subtyping Recursive Types.",
            "Scheduling Time-Critical Instructions on RISC Machines.",
            "Analysis of Or-Parallel Execution Models.",
            "A Formal Definition of Priority in CSP.",
            "A Calculus for Access Control in Distributed Systems.",
            "An Alternative Solution to a Problem on Self-Stabilization.",
            "A Methodology for Implementing Highly Concurrent Objects.",
            "Mathematical Foundations of Time Warp Systems.",
            "Reasoning About Naming Systems.",
            "Cost Analysis of Logic Programs.",
            "Procedural Implementation of Algebraic Specification."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1992",
        "info": "Volume 14, 1992",
        "count": 18,
        "papers": [
            "An Adaptive Tenuring Policy for Generation Scavengers.",
            "Epochs.",
            "Computer-Assisted Microanalysis of Parallel Programs.",
            "Denotational Semantics of a Goal-Directed Language.",
            "The Euclidian Definition of the Functions div and mod.",
            "A Self-Applicable Partial Evaluator for the Lambda Calculus: Correctness and Pragmatics.",
            "Incremental Global Reoptimization of Programs.",
            "An Object-Based Programming Model for Shared Data.",
            "Cache Behavior of Combinator Graph Reduction.",
            "Experience with a Software-Defined Machine Architecture.",
            "The CLP(R) Language and System.",
            "Trace-Based Network Proof Systems: Expressiveness and Completeness.",
            "A Stepwise Refinement Heuristic for Protocol Construction.",
            "Subsequence References: First-Class Values for Substrings.",
            "Incremental Generation of Lexical Scanners.",
            "A Model Parametric Real-Time Logic.",
            "Type Matching, Type-Graphs, and the Schanuel Conjecture.",
            "M-Lisp: A Representation-Independent Dialect of Lisp with Reduction Semantics."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1991",
        "info": "Volume 13, 1991",
        "count": 25,
        "papers": [
            "Linking Programs Incrementally.",
            "Compilation of Functional Languages by Program Transformation.",
            "Automatic Transformation of Series Expressions into Loops.",
            "The Concurrent Language, Shared Prolog.",
            "Wait-Free Synchronization.",
            "Efficient Construction of LR(k) States and Tables.",
            "Constant Propagation with Conditional Branches.",
            "INC: A Language for Incremental Computations.",
            "Dynamic Typing in a Statically Typed Language.",
            "Collecting Interpretations of Expressions.",
            "Practical Adaptation of the Global Optimization Algorithm of Morel and Renvoise.",
            "Table Compression for Tree Automata.",
            "Incremental Attribute Evaluation: A Flexible Algorithm for Lazy Update.",
            "An Ad Hoc Approach to the Implementation of Polymorphism.",
            "An Improved Storage Management Scheme for Block Structured Languages.",
            "Data Flow Analysis of Communicating Finite State Machines.",
            "Efficiently Computing Static Single Assignment Form and the Control Dependence Graph.",
            "Techniques for Debugging Parallel Programs with Flowback Analysis.",
            "Automatic Generation and Use of Abstract Structure Operators.",
            "A First-Come-First-Served Mutual-Exclusion Algorithm with Small Communication Variables.",
            "A Fully Abstract Semantics for a First-Order Functional Language with Logic Variables.",
            "Type-Extension Type Tests Can Be Performed In Constant Time.",
            "Reply to \"Type-Extension Tests Can Be Performed In Constant Time\".",
            "Subtypes and Quantification.",
            "Reply to \"Subtypes and Quantification\"."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1990",
        "info": "Volume 12, 1990",
        "count": 24,
        "papers": [
            "A Mechanism for Environment Integration.",
            "Interprocedural Slicing Using Dependence Graphs.",
            "Production Trees: A Compact Representation of Parsed Programs.",
            "A Modular Technique for the Design of Efficient Distributed Leader Finding Algorithms.",
            "A Distributed Deadlock Detection Algorithm for CSP-Like Communication.",
            "A Correctness Proof for Combinator Reduction with Cycles.",
            "Type Extension Through Polymorphism.",
            "On Iterative Constructs.",
            "Creating User Interfaces Using Programming by Example, Visual Programming, and Constraints.",
            "Linguistic Support for Atomic Data Types.",
            "An Exercise in the Formal Derivation of Parallel Programs: Maximum Flows in Graphs.",
            "Search Direction by Goal Failure in Goal-Directed Programming.",
            "A Method for Specializing Logic Programs.",
            "Adding Liveness Properties to Coupled Finite-State Machines.",
            "An Interval-Based Approach to Exhaustive and Incremental Interprocedural Data-Flow Analysis.",
            "win and sin: Predicate Transformers for Concurrency.",
            "Efficient Evaluation of Circular Attribute Grammars.",
            "Linearizability: A Correctness Condition for Concurrent Objects.",
            "The Priority-Based Coloring Approach to Register Allocation.",
            "Remote Evaluation.",
            "An Approach to Support Automatic Generation of User Interfaces.",
            "On Kilbury's Modification of Earley's Algorithm.",
            "Using Symbolic Execution for Verification of Ada Tasking Programs.",
            "A Comparative Evaluation of Object Definition Techniques."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1989",
        "info": "Volume 11, 1989",
        "count": 26,
        "papers": [
            "A Simple Interprocedural Register Allocation Algorithm and Its Effectiveness for Lisp.",
            "Row Replacement Algorithms for Screen Editors.",
            "Scheduling Expressions on a Pipelined Processor with a Maximal Delay of One Cycle.",
            "Type Representation of Objects by Functions.",
            "Distributed FIFO Allocation of Identical Resources Using Small Shared Space.",
            "Efficient Implementation of Lattice Operations.",
            "Verifying Temporal Properties without Temporal Logic.",
            "Incremental Dynamic Semantics for Language-Based Programming Environments.",
            "Efficient High-Level Iteration with Accumulators.",
            "Designing Families of Data Types Using Exemplars.",
            "Local Atomicity Properties: Modular Concurrency Control for Abstract Data Types.",
            "ECCS and LIPS: Two Languages for OSI Systems Specification and Verification.",
            "Uniform Self-Stabilizing Rings.",
            "Integrating Noninterfering Versions of Programs.",
            "Efficient Implementation of the First-Fit Strategy for Dynamic Storage Allocation.",
            "On Lamport's Interprocessor Communication Model.",
            "Static Inference of Modes and Data Dependencies in Logic Programs.",
            "Functional Computations in Logic Programs.",
            "Code Generation Using Tree Matching and Dynamic Programming.",
            "A Generalization of Dijkstra's Calculus.",
            "Concurrency in Heavily Loaded Neighborhood-Constrained Systems.",
            "Synchronization of Asynchronous Processes in CSP.",
            "I-Structures: Data Structures for Parallel Computing.",
            "On the Productivity of Recursive List Definitions.",
            "A Denotational Semantics for Prolog.",
            "Some Comments on ''A Solution to a Problem with Morel and Renvoise's 'Global Optimization by Suppression of Partial Redundancies'."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1988",
        "info": "Volume 10, 1988",
        "count": 27,
        "papers": [
            "Incremental Data-Flow Analysis.",
            "An Overview of the SR Language and Implementation.",
            "A Mathematical Approach to Nondeterminism in Data Types.",
            "System Semantics: Principles, Applications, and Implementation.",
            "Specification and Verification of Liveness Properties of Cyclic, Concurrent Processes.",
            "A Note on the Drinking Philosophers Problem.",
            "An Ada Package for Dimensional Analysis.",
            "Type Extensions.",
            "Abstract Interaction Tools: A Language for User Interface Management Systems.",
            "ACE: An Automatic Complexity Evaluator.",
            "Control Predicates are Better than Dummy Variables for Reasoning about Program Control.",
            "Efficient and Correct Execution of Parallel Programs that Share Memory.",
            "Simple, Efficient Asynchronous Parallel Algorithms for Maximization.",
            "On the (non-) Relationship between SLR(1) and NQLALR(1) Grammars.",
            "Efficient Incremental LR Parsing for Syntax-Directed Editors.",
            "Constrained Expressions: Toward Broad Applicability of Analysis Methods for Distributed Software Systems.",
            "The Specification Statement.",
            "Fairness in Parallel Programs: The Transformational Approach.",
            "Determining the Extent of Lookahead in Syntactic Error Repair.",
            "Abstract Types Have Existential Type.",
            "Distributed Cooperation with Action Systems.",
            "Analysis of Functional Programs to Detect Run-Time Garbage Cells.",
            "Efficient Synchronization on Multiprocessors with Shared Memory.",
            "Director Strings as Combinators.",
            "Smarter Recompilation.",
            "Tichy's Response to R. W. Schwanke and G. E. Kaiser's \"Smarter Recompilation\".",
            "A Solution to a Problem with Morel and Renvoise's \"Global Optimization by Suppression of Partial Redundancies\"."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1987",
        "info": "Volume 9, 1987",
        "count": 25,
        "papers": [
            "Writing Larch Interface Language Specifications.",
            "The Geometry of Semaphore Programs.",
            "On the Algebraic Definition of Programming Languages.",
            "Soundness of Hoare's Logic: An Automated Proof Using LCF.",
            "Parsing and Compiling Using Prolog.",
            "A Practical Method for LR and LL Syntactic Error Diagnosis.",
            "Language Support for the Specification and Development of Composite Systems.",
            "DIB - A Distributed Implementation of Backtracking.",
            "Retargetable Microcode Synthesis.",
            "An Editor for Revision Control.",
            "IDL: Sharing Intermediate Representations.",
            "The Program Dependence Graph and Its Use in Optimization.",
            "The Multiway Rendezvous.",
            "Data Descriptors: A Compile-Time Model of Data and Addressing.",
            "An Axiomatic Treatment of Exception Handling in an Expression-Oriented Language.",
            "Sublinear-Space Evaluation Algorithms for Attribute Grammars.",
            "A Methodology for Synthesis of Recursive Functional Programs.",
            "Graph Translation Schemes to Generate Compiler Parts.",
            "Automatic Translation of Fortran Programs to Vector Form.",
            "Efficient Algorithms for Automatic Construction and Compactification of Parsing Grammars.",
            "A Generalized Iterative Construct and Its Semantics.",
            "Embedding Continuations in Procedural Objects.",
            "Conversion from Data-Driven to Synchronous Execution in Loop Programs.",
            "A Data-Driven Model for a Subset of Logic Programming.",
            "Algorithmic Specifications: A Constructive Specification Method for Abstract Data Types."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1986",
        "info": "Volume 8, 1986",
        "count": 21,
        "papers": [
            "Parlog: Parallel Programming in Logic.",
            "A Formal Approach to Undo Operations in Programming Languages.",
            "Applicative Caching.",
            "Efficient Demand-Driven Evaluation - Part 2.",
            "Clarification of \"Feeding Inputs on Demand\" in Efficient Demand-Driven Evaluation - Part 1.",
            "Axioms for Memory Access in Asynchronous Hardware Systems.",
            "Proving Liveness for Networks of Communicating Finite State Machines.",
            "Toward Compiler Implementation Correctness Proofs.",
            "The ML Approach to the Readable All-Purpose Language.",
            "Automatic Verification of Finite-State Concurrent Systems Using Temporal Logic Specifications.",
            "A Short Proof of a Conjecture of DeRemer and Pennello.",
            "Smart Recompilation.",
            "The Concept of a Supercompiler.",
            "An Example of Stepwise Refinement of Distributed Programs: Quiescence Detection.",
            "Proving Systolic Systems Correct.",
            "Correctness Proofs of Distributed Termination Algorithms.",
            "A Structural View of the Cedar Programming Environment.",
            "The Impact of Interprocedural Analysis and Optimization in the Rn Programming Environment.",
            "The PegaSys System: Pictures as Formal Documentation of Large Programs.",
            "The PSG System: From Formal Language Definitions to Interactive Programming Environments.",
            "Generating Editing Environments Based on Relations and Attributes."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1985",
        "info": "Volume 7, 1985",
        "count": 32,
        "papers": [
            "On Convergence Toward a Database of Program Transformations.",
            "A Distributed Alternative to Finite-State-Machine Specifications.",
            "Information-Flow and Data-Flow Analysis of while-Programs.",
            "Optimal Prepaging and Font Caching.",
            "Generative Communication in Linda.",
            "Proofs as Programs.",
            "Generalizing Specifications for Uniformly Implemented Loops.",
            "A New Analysis of LALR Formalisms.",
            "A Note on Hennessy's \"Symbolic Debugging of Optimized Code\".",
            "Towards Monolingual Programming Environments.",
            "A Modular Verifiable Exception-Handling Mechanism.",
            "Implementation of Resilient, Atomic Data Types.",
            "Circal and the Representation of Communication, Concurrency, and Time.",
            "Detecting Global Variables in Denotational Specifications.",
            "Efficient Demand-Driven Evaluation - Part 1.",
            "Dealing with World-Model-Based Programs.",
            "Optimal Parallel Generation of a Computation Tree Form.",
            "Program Transformations in a Denotational Setting.",
            "Describing and Analyzing Distributed Software System Designs.",
            "Virtual Time.",
            "Data Types Are Values.",
            "Program Abstraction and Instantiation.",
            "Noncorrecting Syntax Error Recovery.",
            "Addendum to \"The Promotion and Accumulation Strategies in Transformational Programming\".",
            "Multilisp: A Language for Concurrent Symbolic Computation.",
            "Procedures as Persistent Data Objects.",
            "Affix Grammar Driven Code Generation.",
            "Editing by Example.",
            "Symmetric Intertask Communication.",
            "Side Effects and Aliasing Can Have Simple Axiomatic Descriptions.",
            "The Denotational Semantics of Dynamic Networks of Processes.",
            "A Note on Cohen's \"Eliminating Redundant Recursive Calls\"."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1984",
        "info": "Volume 6, 1984",
        "count": 32,
        "papers": [
            "User Recovery and Reversal in Interactive Systems.",
            "Grammar-Based Definition of Metaprogramming Systems.",
            "Recursion As an Effective Step in Program Development.",
            "Synthesis of Communicating Processes from Temporal Logic Specifications.",
            "The Type Theory of PL/CV3.",
            "Tailored-List and Recombination-Delaying Buddy Systems.",
            "Encapsulation Constructs in Systems Programming Languages.",
            "Annotations to Control Parallelism, Reduction Order in the Distributed Evaluation of Functional Programs.",
            "Communicating Sequential Processes for Centralized and Distributed Operating System Design.",
            "Global Data Flow Analysis Problems Arising in Locally Least-Cost Error Recovery.",
            "Real-Time Synchronization of Interprocess Communications.",
            "Proving Failure-Free Properties of Concurrent Systems Using Temporal Logic.",
            "Using Time Instead of Timeout for Fault-Tolerant Distributed Systems.",
            "The \"Hoare Logic\" of CSP, and All That.",
            "An APL Compiler for a Vector Processor.",
            "A Directly Executable Encoding for APL.",
            "Algorithms for On-the-fly Garbage Collection.",
            "Translation of Attribute Grammars into Procedures.",
            "Modeling the Distributed Termination Convention of CSP.",
            "Distributed Algorithms for Finding Centers and Medians in Networks.",
            "Using Message Passing for Distributed Programming: Proof Rules, Disciplines.",
            "Comments on Soisalon-Soininen's \"Inessential Error Entries\".",
            "Unassigned Objects.",
            "Magma2: A Language Oriented toward Experiments in Control.",
            "The Promotion and Accumulation Strategies in Transformational Programming.",
            "Code Selection through Object Code Optimization.",
            "Jump Minimization in Linear Time.",
            "Optimization of Parser Tables for Portable Compilers.",
            "Selective and Locally Controlled Transport of Privileges.",
            "Transformations and Reduction Strategies for Typed Lambda Expressions.",
            "The Drinking Philosopher's Problem.",
            "Axiomatic Semantics of Communicating Sequential Processes."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1983",
        "info": "Volume 5, 1983",
        "count": 28,
        "papers": [
            "On the Construction of Submodule Specifications and Communication Protocols.",
            "Experience with the SETL Optimizer.",
            "Concurrent Reading While Writing.",
            "A New Solution to Lamport's Concurrent Programming Problem Using Small Shared Variables.",
            "A Distributed Algorithm for Minimum-Weight Spanning Trees.",
            "Access-Right Expressions.",
            "Final Data Types and Their Specification.",
            "Generation of Compiler Symbol Processing Mechanisms.",
            "Basic Techniques for the Efficient Coordination of Very Large Numbers of Cooperating Sequential Processors.",
            "Specifying Concurrent Program Modules.",
            "An Effective Implementation for the Generalized Input-Output Construct of CSP.",
            "Automatic Program Improvement: Variable Usage Transformations.",
            "Eliminating Redundant Recursive Calls.",
            "Parallel Generation of Postfix and Tree Forms.",
            "Parameterized Specifications: Parameter Passing and Implementation with Respect to Observability.",
            "Termination of Probabilistic Concurrent Program.",
            "Guardians and Actions: Linguistic Support for Robust, Distributed Programs.",
            "VLSI Layout as Programming.",
            "Postpass Code Optimization of Pipeline Constraints.",
            "Incremental Context-Dependent Analysis for Language-Based Editors.",
            "A Formal Framework for the Derivation of Machine-Specific Optimizers.",
            "User Format Control in a Lisp Prettyprinter.",
            "Comparison of Compacting Algorithms for Garbage Collection.",
            "Control Flow Aspects of Semantics-Directed Compiling.",
            "Tentative Steps Toward a Development Method for Interfering Programs.",
            "Correctness Proofs of Communicating Processes: Three Illustrative Examples from the Literature.",
            "Assessing Test Data Adequacy through Program Inference.",
            "A Syntax-Error-Handling Technique and Its Experimental Analysis."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1982",
        "info": "Volume 4, 1982",
        "count": 35,
        "papers": [
            "A System for Assisting Program Transformation.",
            "Using Peephole Optimization on Intermediate Code.",
            "Termination Detection of Diffusing Computations in Communicating Sequential Processes.",
            "The VAL Language: Description and Analysis.",
            "Programming with Equations.",
            "A Flexible Notation for Syntactic Definitions.",
            "Synchronization in Distributed Programs.",
            "An Introduction to S/SL: Syntax/Semantic Language.",
            "Inessential Error Entries and Their Use in LR Parser Optimization.",
            "Some Observations Concerning Formal Differentiation of Set Theoretic Expressions.",
            "Error Data Values in the Data-Flow Language VAL.",
            "High-Level Language Implications of the Proposed IEEE Floating-Point Standard.",
            "An Efficient Unification Algorithm.",
            "R/ for Semantics.",
            "Some Techniques for Recursion Removal from Recursive Programs.",
            "Symbolic Debugging of Optimized Code.",
            "Compact Storage of Binary Trees.",
            "Combining Algebraic and Algorithmic Reasoning: An Approach to the Schorr-Waite Algorithm.",
            "The Byzantine Generals Problem.",
            "Finite Differencing of Computable Expressions.",
            "Proving Liveness Properties of Concurrent Programs.",
            "Deriving Target Code as a Representation of Continuation Semantics.",
            "A Value Transmission Method for Abstract Data Types.",
            "A Model for Implementing Euclid Modules and Prototypes.",
            "The Evaluation of Expressions in Icon.",
            "A Structured APL System.",
            "A One-Pass Algorithm for Overload Resolution in Ada.",
            "Efficient Computation of LALR(1) Look-Ahead Sets.",
            "Transformational Derivation of a Garbage Collection Algorithm.",
            "A Weaker Precondition for Loops.",
            "A Distributed Graph Algorithm: Knot Detection.",
            "Formal Specification of Graphic Data Types.",
            "Data Type Specification: Parameterization and the Power of Specification Techniques.",
            "On the Development of the Algebra of Functional Programs.",
            "An O(n log n) Unidirectional Algorithm for the Circular Extrema Problem."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1981",
        "info": "Volume 3, 1981",
        "count": 24,
        "papers": [
            "A Statement-Oriented Approach to Data Abstraction.",
            "A Multiprocessing Approach to Compile-Time Symbol Resolution.",
            "Compilation of Acyclic Smooth Programs for Parallel Execution.",
            "Deleting Irrelevant Tasks in an Expression-Oriented Multiprocessor System.",
            "Methods for Computing LALR(k) Lookahead.",
            "Handling Operator Precedence in Arithmetic Expressions with Tree Transformations.",
            "An Exercise in Program Explanation.",
            "Editing Data Structures.",
            "An Automatic Technique for Selection of Data Structures in SETL Programs.",
            "Generators in Icon.",
            "Algorithm 568: PDS - A Portable Directory System.",
            "The Construction of Stack-Controlling LR Parsers for Regular Right Part Grammars.",
            "Data-Abstraction Implementation, Specification, and Testing.",
            "Process Communication Based on Input Specifications.",
            "Associons: A Program Notation with Tuples Instead of Variables.",
            "Referencing and Retention in Block-Structured Coroutines.",
            "Nonsequentiality and Concrete Activity Phases in Discrete-Event Simulation Languages.",
            "Locally Least-Cost Error Recovery in Early's Algorithm.",
            "The Programming Language Aspects of ThingLab, a Constraint-Oriented Simulation Laboratory.",
            "Space-Efficient Storage Management in an Attribute Grammar Evaluator.",
            "Synchronizing Resources.",
            "Ten Years of Hoare's Logic: A Survey - Part 1.",
            "Specifying the Semantics of while Programs: A Tutorial and Critique of a Paper by Hoare and Lauer.",
            "A Cost Model for the Internal Organization of B+-Tree Nodes."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1980",
        "info": "Volume 2, 1980",
        "count": 31,
        "papers": [
            "And/Or Programs: A New Approach to Structured Programming.",
            "Global Context Recovery: A New Strategy for Syntactic Error Recovery by Table-Drive Parsers.",
            "Distributed Termination.",
            "An Axiomatic Approach to Information Flow in Programs.",
            "On the Performance of Balanced Hashing Functions When the Keys Are Not Equiprobable.",
            "A Deductive Approach to Program Synthesis.",
            "Uniform Random Generation of Balanced Parenthesis Strings.",
            "A Note on Median Split Trees.",
            "External Representations of Objects of User-Defined Type.",
            "An Alternative to the Use of Patterns in String Processing.",
            "Automatic Derivation of Code Generators from Machine Descriptions.",
            "The Design and Application of a Retargetable Peephole Optimizer.",
            "On Parsing and Compiling Arithmetic Expressions on Vector Computers.",
            "Ada Exception Handling: An Axiomatic Approach.",
            "Output Guards and Nondeterminism in \"Communicating Sequential Processes\".",
            "Design of a Machine-Independent Optimizing System for Emulator Development.",
            "Managing Reentrant Structures Using Reference Counts.",
            "Chaining Span-Dependent Jump Instructions.",
            "A Coroutine Approach to Parsing.",
            "Applicability of Software Validation Techniques to Scientific Programs.",
            "Derivation of Invariant Assertions During Program Development by Transformation.",
            "Synthesis of Resource Invariants for Concurrent Programs.",
            "A Proof System for Communicating Sequential Processes.",
            "A Formal System for Reasoning about Programs Accessing a Relational Database.",
            "An Improved Context-Free Recognizer.",
            "Prettyprinting.",
            "Ultracomputers.",
            "Specification of Abstract Data Types in Modula.",
            "An Abstract Type for Statistics Collection in Simula.",
            "Assignment and Procedure Call Proof Rules.",
            "The Activity of a Variable and Its Relation to Decision Trees."
        ]
    },
    {
        "name": "TOPLAS",
        "year": "1979",
        "info": "Volume 1, 1979",
        "count": 20,
        "papers": [
            "Backtracking in a Generalized Control Setting.",
            "Programming by Refinement, as Exemplified by the SETL Representation Sublanguage.",
            "The Compilation of Loop Induction Expressions.",
            "Incremental Parsing.",
            "Code Generation and Storage Allocation for Machines with Span-Dependent Instructions.",
            "A New Approach to Proving the Correctness of Multiprocess Programs.",
            "A Hierarchial Approach to Formal Semantics With Application to the Definition of PL/CS.",
            "Morris's Garbage Compaction Algorithm Restores Reference Counts.",
            "A Fast Algorithm for Finding Dominators in a Flowgraph.",
            "A Deterministic Attribute Grammar Evaluator Based on Dynamic Scheduling.",
            "Operators.",
            "A Language for Array and Vector Processors.",
            "Use of a Nonprocedural Specification Language and Associated Program Generator in Software Development.",
            "Comments on \"Communicating Sequential Processes\".",
            "Verification of Array, Record, and Pointer Operations in Pascal.",
            "Simplification by Cooperating Decision Procedures.",
            "Is Sometimes Ever Better Than Alway?",
            "Compact Encodings of List Structure.",
            "A Space Efficient Dynamic Allocation Algorithm for Queuing Messages.",
            "Noncanonical SLR(1) Grammars."
        ]
    }
]