[
    {
        "name": "TOSEM",
        "year": "2022",
        "info": "Volume 31, 2022",
        "count": 17,
        "papers": [
            "Enhancing Search-based Testing with Testability Transformations for Existing APIs.",
            "Adaptive Hypermutation for Search-Based System Test Generation: A Study on REST APIs with EvoMaster.",
            "Memory-Safety Challenge Considered Solved? An In-Depth Study with All Rust CVEs.",
            "The Impact of Dormant Defects on Defect Prediction: A Study of 19 Apache Projects.",
            "MICOSE4aPS: Industrially Applicable Maturity Metric to Improve Systematic Reuse of Control Software.",
            "Towards an Anatomy of Software Craftsmanship.",
            "Psychometrics in Behavioral Software Engineering: A Methodological Introduction with Guidelines.",
            "Parallel Test Prioritization.",
            "The Case for Adaptive Security Interventions.",
            "Bug Localization in Model-Based Systems in the Wild.",
            "Automating App Review Response Generation Based on Contextual Knowledge.",
            "CodeMatcher: Searching Code Based on Sequential Semantics of Important Query Words.",
            "SPI: Automated Identification of Security Patches via Commits.",
            "Automatic Fault Detection for Deep Learning Programs Using Graph Transformations.",
            "On the Reproducibility and Replicability of Deep Learning in Software Engineering.",
            "Towards a Consistent Interpretation of AIOps Models.",
            "A Survey of Flaky Tests."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2021",
        "info": "Volume 30, 2021",
        "count": 57,
        "papers": [
            "StreamGen: Model-driven Development of Distributed Streaming Applications.",
            "Mastering Variation in Human Studies: The Role of Aggregation.",
            "Security Smells in Ansible and Chef Scripts: A Replication Study.",
            "Uncertainty-wise Requirements Prioritization with Search.",
            "Verification of Program Transformations with Inductive Refinement Types.",
            "Automated Patch Transplantation.",
            "RegionTrack: A Trace-Based Sound and Complete Checker to Debug Transactional Atomicity Violations and Non-Serializable Traces.",
            "An Empirical Study of Developer Discussions in the Gitter Platform.",
            "A Practical Approach to Verification of Floating-Point C/C++ Programs with math.h/cmath Functions.",
            "SEADS: Scalable and Cost-effective Dynamic Dependence Analysis of Distributed Systems via Reinforcement Learning.",
            "Technical Q8A Site Answer Recommendation via Question Boosting.",
            "Enabledness-based Testing of Object Protocols.",
            "Test Selection for Deep Learning Systems.",
            "Beyond Tests: Program Vulnerability Repair via Crash Constraint Extraction.",
            "History-based Model Repair Recommendations.",
            "Adversarial Specification Mining.",
            "Test Data Generation for Path Coverage of MPI Programs Using SAEO.",
            "Emoji-powered Sentiment and Emotion Detection from Software Developers' Communication Data.",
            "Killing Stubborn Mutants with Symbolic Execution.",
            "An Empirical Study on Type Annotations: Accuracy, Speed, and Suggestion Effectiveness.",
            "Why an Android App Is Classified as Malware: Toward Malware Classification Interpretation.",
            "Are Comments on Stack Overflow Well Organized for Easy Retrieval by Developers?",
            "Interpreting Deep Learning-based Vulnerability Detector Predictions Based on Heuristic Searching.",
            "Leveraging the Defects Life Cycle to Label Affected Versions and Defective Classes.",
            "Why My Code Summarization Model Does Not Work: Code Comment Improvement with Category Prediction.",
            "Editorial.",
            "A Hybrid Approach to Formal Verification of Higher-Order Masked Arithmetic Programs.",
            "Facet-oriented Modelling.",
            "Developing Cost-Effective Blockchain-Powered Applications: A Case Study of the Gas Usage of Smart Contract Transactions in the Ethereum Blockchain Platform.",
            "Are Multi-Language Design Smells Fault-Prone? An Empirical Study.",
            "Toward an Objective Measure of Developers' Cognitive Activities.",
            "Automatic API Usage Scenario Documentation from Technical Q&A Sites.",
            "Taming Reflection: An Essential Step Toward Whole-program Analysis of Android Apps.",
            "Predicting Performance Anomalies in Software Systems at Run-time.",
            "A Formal Framework of Software Product Line Analyses.",
            "Architecting Internet of Things Systems with Blockchain: A Catalog of Tactics.",
            "An Adaptive Search Budget Allocation Approach for Search-Based Test Case Generation.",
            "How Should I Improve the UI of My App?: A Study of User Reviews of Popular Apps in the Google Play.",
            "DeepWukong: Statically Detecting Software Vulnerabilities Using Deep Graph Neural Network.",
            "IntDroid: Android Malware Detection Based on API Intimacy Analysis.",
            "On the Impact of Sample Duplication in Machine-Learning-Based Android Malware Detection.",
            "Leveraging Control Flow Knowledge in SMT Solving of Program Verification.",
            "When and How to Make Breaking Changes: Policies and Practices in 18 Open Source Software Ecosystems.",
            "Toward a Holistic Approach to Verification and Validation of Autonomous Cognitive Systems.",
            "Diversifying Focused Testing for Unit Testing.",
            "How Far Have We Progressed in Identifying Self-admitted Technical Debts? A Comprehensive Empirical Study.",
            "Eagle: CFL-Reachability-Based Precision-Preserving Acceleration of Object-Sensitive Pointer Analysis with Partial Context Sensitivity.",
            "Specifying with Interface and Trait Abstractions in Abstract State Machines: A Controlled Experiment.",
            "Automatically Identifying the Quality of Developer Chats for Post Hoc Use.",
            "Speeding Up Data Manipulation Tasks with Alternative Implementations: An Exploratory Study.",
            "Software Architectural Migration: An Automated Planning Approach.",
            "Evaluation of Software Architectures under Uncertainty: A Systematic Literature Review.",
            "The Agile Success Model: A Mixed-methods Study of a Large-scale Agile Transformation.",
            "Recommending Faulty Configurations for Interacting Systems Under Test Using Multi-objective Search.",
            "An Empirical Study of the Impact of Data Splitting Decisions on the Performance of AIOps Solutions.",
            "Understanding Software-2.0: A Study of Machine Learning Library Usage and Evolution.",
            "Context-aware Retrieval-based Deep Commit Message Generation."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2020",
        "info": "Volume 29, 2020",
        "count": 33,
        "papers": [
            "On the Monitoring of Decentralized Specifications: Semantics, Properties, Analysis, and Simulation.",
            "Many-Objective Test Suite Generation for Software Product Lines.",
            "How C++ Templates Are Used for Generic Programming: An Empirical Study on 50 Open Source Systems.",
            "Automatically Generating SystemC Code from HCSP Formal Models.",
            "Toward Better Evolutionary Program Repair: An Integrated Approach.",
            "Is Static Analysis Able to Identify Unnecessary Source Code?",
            "DESEN: Specification of Sociotechnical Systems via Patterns of Regulation and Control.",
            "Editorial.",
            "Assessing and Improving Malware Detection Sustainability through App Evolution Studies.",
            "Visualizing Distributed System Executions.",
            "Quality Indicators in Search-based Software Engineering: An Empirical Evaluation.",
            "Practical Constraint Solving for Generating System Test Data.",
            "A Defect Estimator for Source Code: Linking Defect Reports with Programming Constructs Usage Metrics.",
            "Predicting Node Failures in an Ultra-Large-Scale Cloud Computing Platform: An AIOps Solution.",
            "Editorial.",
            "KLEESpectre: Detecting Information Leakage through Speculative Cache Attacks via Symbolic Execution.",
            "Computing Alignments of Well-Formed Process Models using Local Search.",
            "Unveiling Elite Developers' Activities in Open Source Projects.",
            "Monotone Precision and Recall Measures for Comparing Executions and Specifications of Dynamic Systems.",
            "Testing Relative to Usage Scope: Revisiting Software Coverage Criteria.",
            "Wireframe-based UI Design Search through Image Autoencoder.",
            "Multi-objective Integer Programming Approaches for Solving the Multi-criteria Test-suite Minimization Problem: Towards Sound and Complete Solutions of a Particular Search-based Software-engineering Problem.",
            "psc2code: Denoising Code Extraction from Programming Screencasts.",
            "Handling SQL Databases in Automated System Test Generation.",
            "Fine-grained Code Coverage Measurement in Automated Black-box Android Testing.",
            "iSENSE2.0: Improving Completion-aware Crowdtesting Management with Duplicate Tagger and Sanity Checker.",
            "Measuring Task Conflict and Person Conflict in Software Testing.",
            "Generating Question Titles for Stack Overflow from Mined Code Snippets.",
            "Smart Contract Repair.",
            "Using Relative Lines of Code to Guide Automated Test Generation for Python.",
            "Why Developers Refactor Source Code: A Mining-based Study.",
            "Practical Accuracy Estimation for Efficient Deep Neural Network Testing.",
            "Modular Tree Network for Source Code Representation Learning."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2019",
        "info": "Volume 28, 2019",
        "count": 28,
        "papers": [
            "Farewell Editorial from the Outgoing Editor-in-Chief.",
            "Editorial from the Incoming Editor-in-Chief.",
            "Oracles for Testing Software Timeliness with Uncertainty.",
            "The State of Empirical Evaluation in Static Feature Location.",
            "RESTful API Automated Test Case Generation with EvoMaster.",
            "An Active Learning Approach for Improving the Accuracy of Automated Domain Model Extraction.",
            "Software Effort Interval Prediction via Bayesian Inference and Synthetic Bootstrap Resampling.",
            "Editorial.",
            "Runtime Fault Detection in Programmed Molecular Systems.",
            "Understanding and Analyzing Java Reflection.",
            "Domain Analysis and Description Principles, Techniques, and Modelling Languages.",
            "Status Quo in Requirements Engineering: A Theory and a Global Family of Surveys.",
            "Isolation Modeling and Analysis Based on Mobility.",
            "How Understandable Are Pattern-based Behavioral Constraints for Novice Software Designers?",
            "Editorial.",
            "Automated N-way Program Merging for Facilitating Family-based Analyses of Variant-rich Software.",
            "Theoretical and Practical Aspects of Linking Operational and Algebraic Semantics for MDESL.",
            "Neural Network-based Detection of Self-Admitted Technical Debt: From Performance to Explainability.",
            "Verifying and Quantifying Side-channel Resistance of Masked Software Implementations.",
            "Developing and Evaluating Objective Termination Criteria for Random Testing.",
            "Efficient Verification of Concurrent Systems Using Synchronisation Analysis and SAT/SMT Solving.",
            "Editorial.",
            "An Empirical Study on Learning Bug-Fixing Patches in the Wild via Neural Machine Translation.",
            "The Virtual Developer: Integrating Code Generation and Manual Development with Conflict Resolution.",
            "Automated Reuse of Model Transformations through Typing Requirements Models.",
            "Recommending New Features from Mobile App Descriptions.",
            "Precise Learn-to-Rank Fault Localization Using Dynamic and Static Features of Target Programs.",
            "Differential Testing of Certificate Validation in SSL/TLS Implementations: An RFC-guided Approach."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2018",
        "info": "Volume 27, 2018",
        "count": 19,
        "papers": [
            "Editorial.",
            "How Far We Have Progressed in the Journey? An Examination of Cross-Project Defect Prediction.",
            "Assessing the Refactoring of Brain Methods.",
            "An Empirical Study of Meta- and Hyper-Heuristic Search for Multi-Objective Release Planning.",
            "Inferring Extended Probabilistic Finite-State Automaton Models from Software Executions.",
            "FEMOSAA: Feature-Guided and Knee-Driven Multi-Objective Optimization for Self-Adaptive Software.",
            "Prove it! Inferring Formal Proof Scripts from CafeOBJ Proof Scores.",
            "STADS: Software Testing as Species Discovery.",
            "Maintaining Architecture-Implementation Conformance to Support Architecture Centrality: From Single System to Product Line Development.",
            "Editorial.",
            "Shadow Symbolic Execution for Testing Software Patches.",
            "The ABC of Software Engineering Research.",
            "Linear Programming as a Baseline for Software Effort Estimation.",
            "Spectrum-Based Fault Localization in Model Transformations.",
            "Multi-Objective Optimization of Energy Consumption of GUIs in Android Apps.",
            "Test-Equivalence Analysis for Automatic Patch Generation.",
            "Recommending Who to Follow in the Software Engineering Twitter Space.",
            "Refactoring Multi-Level Models.",
            "Variability-Aware Static Analysis at Scale: An Empirical Study."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2017",
        "info": "Volume 26, 2017",
        "count": 15,
        "papers": [
            "Augmenting Field Data for Testing Systems Subject to Incremental Requirements Changes.",
            "Ensuring the Consistency of Adaptation through Inter- and Intra-Component Dependency Analysis.",
            "Predicting Query Quality for Applications of Text Retrieval to Software Engineering Tasks.",
            "Human Competitiveness of Genetic Programming in Spectrum-Based Fault Localisation: Theoretical and Empirical Analysis.",
            "Parallel Algorithms for Generating Distinguishing Sequences for Observable Non-deterministic FSMs.",
            "Editorial.",
            "Fixing Faults in C and Java Source Code: Abbreviated vs. Full-Word Identifier Names.",
            "A Logic-Based Approach for the Verification of UML Timed Models.",
            "Early Evaluation of Implementation Alternatives of Composite Data Structures Toward Maintainability.",
            "Global and Local Deadlock Freedom in BIP.",
            "Variability Bugs in Highly Configurable Systems: A Qualitative Analysis.",
            "Lightweight, Obfuscation-Resilient Detection and Family Identification of Android Malware.",
            "Understanding and Combating Memory Bloat in Managed Data-Intensive Systems.",
            "Detecting the Behavior of Design Patterns through Model Checking and Dynamic Analysis.",
            "Configuring Software Product Lines by Combining Many-Objective Optimization and SAT Solvers."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2015",
        "info": "Volume 25, 2015/2016",
        "count": 31,
        "papers": [
            "Editorial Journal-First Publication for the Software Engineering Community.",
            "Understanding Integer Overflow in C/C++.",
            "Intelligent Code Completion with Bayesian Networks.",
            "Combining Genetic Algorithms and Constraint Programming to Support Stress Testing of Task Deadlines.",
            "Do Automatically Generated Test Cases Make Debugging Easier? An Experimental Assessment of Debugging Effectiveness and Efficiency.",
            "Test Case Prioritization Using Extended Digraphs.",
            "Boa: Ultra-Large-Scale Software Repository and Source-Code Mining.",
            "The Effectiveness of Test Coverage Criteria for Relational Database Schema Integrity Constraints.",
            "Type-Based Call Graph Construction Algorithms for Scala.",
            "Estimating Semantic Relatedness in Source Code.",
            "Editorial.",
            "Understanding JavaScript Event-Based Interactions with Clematis.",
            "Inflow and Retention in OSS Communities with Commercial Involvement: A Case Study of Three Hybrid Projects.",
            "Concurrency Debugging with Differential Schedule Projections.",
            "Control Explicit-Data Symbolic Model Checking.",
            "Less is More: Estimating Probabilistic Rewards over Partial System Explorations.",
            "SIP: Optimal Product Selection from Feature Models Using Many-Objective Evolutionary Optimization.",
            "DiaPro: Unifying Dynamic Impact Analyses for Improved and Variable Cost-Effectiveness.",
            "A Stack Memory Abstraction and Symbolic Analysis Framework for Executables.",
            "Multi-Step Learning and Adaptive Search for Learning Complex Model Transformations from Examples.",
            "Learning Weighted Assumptions for Compositional Verification of Markov Decision Processes.",
            "Mining Privacy Goals from Privacy Policies Using Hybridized Task Recomposition.",
            "Multi-Criteria Code Refactoring Using Search-Based Software Engineering: An Industrial Case Study.",
            "Using Cohesion and Coupling for Software Remodularization: Is It Enough?",
            "The Effect of Program and Model Structure on the Effectiveness of MC/DC Test Adequacy Coverage.",
            "Stochastic Performance Analysis of Global Software Development Teams.",
            "Hierarchical Program Paths.",
            "Impact-Driven Process Model Repair.",
            "Generating API Call Rules from Version History and Stack Overflow Posts.",
            "Dynamic Dependence Summaries.",
            "A Posteriori Typing for Model-Driven Engineering: Concepts, Analysis, and Applications."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2014",
        "info": "Volume 24, 2014/2015",
        "count": 26,
        "papers": [
            "Assessing the Effect of Screen Mockups on the Comprehension of Functional Requirements.",
            "A Continuous ASM Modelling Approach to Pacemaker Sensing.",
            "Directed Incremental Symbolic Execution.",
            "Mining Unit Tests for Discovery and Migration of Math APIs.",
            "Combining Centralised and Distributed Testing.",
            "Code-Smell Detection as a Bilevel Problem.",
            "Residual Investigation: Predictive and Precise Bug Detection.",
            "A Large-Scale Evaluation of Automated Unit Test Generation Using EvoSuite.",
            "Conditional Commitments: Reasoning and Model Checking.",
            "A Unified Test Case Prioritization Approach.",
            "Formal Verification of Software Countermeasures against Side-Channel Attacks.",
            "When and How to Use Multilevel Modelling.",
            "aToucan: An Automated Framework to Derive UML Analysis Models from Use Case Models.",
            "Documenting Design-Pattern Instances: A Family of Experiments on Source-Code Comprehensibility.",
            "Deciding Type-Based Partial-Order Constraints for Path-Sensitive Analysis.",
            "Automatic Workarounds: Exploiting the Intrinsic Redundancy of Web Applications.",
            "Many-Objective Software Remodularization Using NSGA-III.",
            "Software Change Contracts.",
            "Platys: An Active Learning Framework for Place-Aware Application Development and Its Evaluation.",
            "A Baseline Model for Software Effort Estimation.",
            "Introduction to the Special Issue on ISSTA 2013.",
            "Guidelines for Coverage-Based Comparisons of Non-Adequate Test Suites.",
            "Does Automated Unit Test Generation Really Help Software Testers? A Controlled Empirical Study.",
            "Effective Techniques for Static Race Detection in Java Parallel Loops.",
            "Data Model Property Inference, Verification, and Repair for Web Applications.",
            "Automated Support for Reproducing and Debugging Field Failures."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2014",
        "info": "Volume 23, 2014",
        "count": 35,
        "papers": [
            "Editorial.",
            "Architecture-centric support for adaptive service collaborations.",
            "Automated cookie collection testing.",
            "Improving software modularization via automated analysis of latent topics and dependencies.",
            "Do we need to handle every temporal violation in scientific workflow systems?",
            "Model-based synthesis of control software from system-level formal specifications.",
            "Join point interfaces for safe and flexible decoupling of aspects.",
            "Prevalence of coincidental correctness and mitigation of its impact on fault localization.",
            "Traceability and SysML design slices to support safety inspections: A controlled experiment.",
            "An in-depth study of the potentially confounding effect of class size in fault prediction.",
            "Editorial.",
            "Guided test generation for database applications via synthesized database interactions.",
            "On the impact of UML analysis models on source-code comprehensibility and modifiability.",
            "Degree-of-knowledge: Modeling a developer's knowledge of code.",
            "Required behavior of sequence diagrams: Semantics and conformance.",
            "A taxonomy for requirements engineering and software test alignment.",
            "ADAM: External dependency-driven architecture discovery and analysis of quality attributes.",
            "Key factors for adopting inner source.",
            "Exact scalable sensitivity analysis for the next release problem.",
            "Dynamite: A tool for the verification of alloy models based on PVS.",
            "Generating Test Cases for Programs that Are Coded against Interfaces and Annotations.",
            "A Methodology for Exposing Risk in Achieving Emergent System Properties.",
            "Scalable Runtime Bloat Detection Using Abstract Dynamic Slicing.",
            "GreASE: A Tool for Efficient \"Nonequivalence\" Checking.",
            "Architecture-Level Configuration of Large-Scale Embedded Software Systems.",
            "Solving the Search for Source Code.",
            "Editorial.",
            "Introduction to the Special Issue International Conference on Software Engineering (ICSE 2012).",
            "Automated Detection of Client-State Manipulation Vulnerabilities.",
            "DIG: A Dynamic Invariant Generator for Polynomial and Array Invariants.",
            "On the Comprehension of Program Comprehension.",
            "Amplifying Tests to Validate Exception Handling Code: An Extended Study in the Mobile Application Domain.",
            "Some Code Smells Have a Significant but Small Effect on Faults.",
            "Scaling Up Symbolic Analysis by Removing Z-Equivalent States.",
            "Peer Review on Open-Source Software Projects: Parameters, Statistical Models, and Theory."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2013",
        "info": "Volume 22, 2013",
        "count": 38,
        "papers": [
            "Editorial - looking back.",
            "Editorial - looking forward.",
            "Modeling and verifying hierarchical real-time systems using stateful timed CSP.",
            "Views: Synthesizing fine-grained concurrency control.",
            "Facilitating the transition from use case models to analysis models: Approach and experiments.",
            "Achieving scalable model-based testing through test case diversity.",
            "Detecting missing method calls as violations of the majority rule.",
            "Scaling predictive analysis of concurrent programs by removing trace redundancy.",
            "Synthesizing nonanomalous event-based controllers for liveness goals.",
            "ConMem: Detecting Crash-Triggering Concurrency Bugs through an Effect-Oriented Approach.",
            "Business Process Model Merging: An Approach to Business Process Consolidation.",
            "Personalized Reliability Prediction of Web Services.",
            "Automated Comparison of State-Based Software Models in Terms of Their Language and Structure.",
            "An Information Foraging Theory Perspective on Tools for Debugging, Refactoring, and Reuse Tasks.",
            "Verification across Intellectual Property Boundaries.",
            "In memoriam: David Notkin (1955-2013).",
            "Precise memory leak detection for java software using container profiling.",
            "Marple: Detecting faults in path segments using automatically generated analyses.",
            "Fault localization prioritization: Comparing information-theoretic and coverage-based approaches.",
            "Bounded satisfiability checking of metric temporal logic specifications.",
            "The value of design rationale information.",
            "Trading obliviousness for modularity with cooperative aspect-oriented programming.",
            "An algebra of design patterns.",
            "Finite satisfiability of UML class diagrams with constrained class hierarchy.",
            "Enabledness-based program abstractions for behavior validation.",
            "Using a functional size measurement procedure to evaluate the quality of models in MDD environments.",
            "Use case and task models: An integrated development methodology and its formal foundation.",
            "Test-and-adapt: An approach for improving service interchangeability.",
            "A methodology for testing CPU emulators.",
            "Exception handlers for healing component-based systems.",
            "A theoretical analysis of the risk evaluation formulas for spectrum-based fault localization.",
            "Path exploration based on symbolic output.",
            "Path- and index-sensitive string analysis based on monadic second-order logic.",
            "On software component co-installability.",
            "Software effort estimation as a multiobjective learning problem.",
            "A web-centred approach to end-user software engineering.",
            "Portfolio: Searching for relevant functions and their usages in millions of lines of code.",
            "Evaluating a query framework for software evolution data."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2011",
        "info": "Volume 21, 2011/2012",
        "count": 25,
        "papers": [
            "Feasibility of Stepwise Design of Multitolerant Programs.",
            "QVM: An Efficient Runtime for Detecting Defects in Deployed Systems.",
            "Expressive and Extensible Parameter Passing for Distributed Object Systems.",
            "How Well Do Search Engines Support Code Retrieval on the Web?",
            "Lattice-Based Sampling for Path Property Monitoring.",
            "The Choice Calculus: A Representation for Software Variation.",
            "Editorial.",
            "A Precise Method-Method Interaction-Based Cohesion Metric for Object-Oriented Classes.",
            "Weak Alphabet Merging of Partial Behavior Models.",
            "An Approach for Modeling Architectural Design Rules in UML and its Application to Embedded Software.",
            "A Generative Programming Framework for Context-Aware CSCW Applications.",
            "Symbolic Message Sequence Charts.",
            "Verification and Validation of UML Conceptual Schemas with OCL Constraints.",
            "Type checking annotation-based product lines.",
            "A framework for the checking and refactoring of crosscutting concepts.",
            "A logical verification methodology for service-oriented computing.",
            "Accounting for defect characteristics in evaluations of testing techniques.",
            "A two-phase approximation for model checking probabilistic unbounded until properties of probabilistic systems.",
            "DARWIN: An approach to debugging evolving programs.",
            "Systematizing pragmatic software reuse.",
            "A formal model for automated software modularity and evolvability analysis.",
            "Validation of requirements for hybrid systems: A formal approach.",
            "Concept location using formal concept analysis and information retrieval.",
            "Validating software metrics: A spectrum of philosophies.",
            "HAMPI: A solver for word equations over strings, regular expressions, and context-free grammars."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2010",
        "info": "Volume 20, 2010/2011",
        "count": 19,
        "papers": [
            "Types and modularity for implicit invocation with implicit announcement.",
            "Method and developer characteristics for effective agile method tailoring: A study of XP expert opinion.",
            "Clone region descriptors: Representing and tracking duplication in source code.",
            "Extracting and answering why and why not questions about Java program output.",
            "Modular aspect-oriented design with XPIs.",
            "The small-world effect: The influence of macro-level properties of developer collaboration networks on open-source project success.",
            "Supporting dynamic aspect-oriented features.",
            "PrIMe: A methodology for developing provenance-aware applications.",
            "Temporal dependency-based checkpoint selection for dynamic verification of temporal constraints in scientific workflow systems.",
            "Reducing the effort of bug report triage: Recommenders for development-oriented decisions.",
            "A model for spectra-based software diagnosis.",
            "FlagRemover: A testability transformation for transforming loop-assigned flags.",
            "A revisit of fault class hierarchies in general boolean specifications.",
            "Runtime Verification for LTL and TLTL.",
            "The Minimal Failure-Causing Schema of Combinatorial Testing.",
            "Discovering Multidimensional Correlations among Regulatory Requirements to Understand Risk.",
            "Gaia-PL: A Product Line Engineering Approach for Efficiently Designing Multiagent Systems.",
            "A Compiler for Multimodal Scenarios: Transforming LSCs into AspectJ.",
            "Recommending Adaptive Changes for Framework Evolution."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2009",
        "info": "Volume 19, 2009/2010",
        "count": 13,
        "papers": [
            "J-Orchestra: Enhancing Java programs with distribution capabilities.",
            "From business process models to process-oriented software systems.",
            "Unifying aspect- and object-oriented design.",
            "Conceptual data model-based software size estimation for information systems.",
            "Measuring the strength of information flows in programs.",
            "Amoeba: A methodology for modeling and evolving cross-organizational business processes.",
            "Editorial.",
            "Synthesizing hierarchical state machines from expressive scenario descriptions.",
            "Partial constraint checking for context consistency in pervasive computing.",
            "Design and implementation of Sator: A web service aggregator.",
            "Analysis and applications of timed service protocols.",
            "Semantic self-assessment of query results in dynamic environments.",
            "A verification system for interval-based specification languages."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2008",
        "info": "Volume 18, 2008/2009",
        "count": 15,
        "papers": [
            "Unit-level test adequacy criteria for visual dataflow languages and a testing methodology.",
            "Power laws in software.",
            "Evaluating the benefits of context-sensitive points-to analysis using a BDD-based implementation.",
            "Automatically repairing event sequence-based GUI test suites for regression testing.",
            "Semantic parameterization: A process for modeling domain descriptions.",
            "Domain-specific languages and program generation with meta-AspectJ.",
            "Using a pilot study to derive a GUI model for automated testing.",
            "Editorial.",
            "Composing expressive runtime security policies.",
            "A systematic review of theory use in studies investigating the motivations of software engineers.",
            "Empirical evaluation of a nesting testability transformation for evolutionary testing.",
            "Tools and experiments supporting a testing-based theory of component composition.",
            "Interacting process classes.",
            "Verdict functions in testing with a fault domain or test hypotheses.",
            "Programming pervasive and mobile computing applications: The TOTA approach."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2007",
        "info": "Volume 17, 2007/2008",
        "count": 20,
        "papers": [
            "Editorial.",
            "An empirical study of slice-based cohesion and coupling metrics.",
            "Identifying Crosscutting Concerns Using Fan-In Analysis.",
            "Efficient Analysis of DynAlloy Specifications.",
            "Editorial.",
            "Introduction to the special section from the ACM international symposium on software testing and analysis (ISSTA 2006).",
            "Breaking up is hard to do: An evaluation of automated assume-guarantee reasoning.",
            "DSD-Crasher: A hybrid analysis tool for bug finding.",
            "Effective typestate verification in the presence of aliasing.",
            "Combining symbolic execution with model checking to verify parallel numerical programs.",
            "Impact of classes of development coordination tools on software development performance: A multinational empirical study.",
            "Editorial.",
            "An empirical investigation of software reuse benefits in a large telecom product.",
            "Developing and debugging algebraic specifications for Java classes.",
            "Functional size measurement revisited.",
            "An upper bound on software testing effectiveness.",
            "Post-release reliability growth in software products.",
            "Topology analysis of software dependencies.",
            "The impact of research on the development of middleware technology.",
            "The role of outcome feedback in improving the uncertainty assessment of software development effort estimates."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2007",
        "info": "Volume 16, 2007",
        "count": 15,
        "papers": [
            "Editorial.",
            "Editorial.",
            "Representing concerns in source code.",
            "Designing and comparing automated test oracles for GUI-based software applications.",
            "A formal model of services.",
            "Editorial.",
            "Foundations of incremental aspect model-checking.",
            "An empirical study of static program slice size.",
            "Polychronous design of embedded real-time applications.",
            "Test conditions for fault classes in Boolean specifications.",
            "Metamodel-based model conformance and multiview consistency checking.",
            "Model checking the Java metalocking algorithm.",
            "Recovering traceability links in software artifact management systems using information retrieval methods.",
            "Static checking of dynamically generated queries in database applications.",
            "Three empirical studies on estimating the design effort of Web applications."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2006",
        "info": "Volume 15, 2006",
        "count": 12,
        "papers": [
            "Symbolic model checking of UML activity diagrams.",
            "Model driven security: From UML models to access control infrastructures.",
            "UML-B: Formal modeling and design aided by UML.",
            "The interpretation and utility of three cohesion metrics for object-oriented design.",
            "Integrating automated test generation into the WYSIWYT spreadsheet testing methodology.",
            "SNIAFL: Towards a static noninteractive approach to feature location.",
            "Avoiding coincidental correctness in boundary value analysis.",
            "HOTTest: A model-based test design technique for enhanced testing of domain-specific applications.",
            "LIME: A coordination model and middleware supporting mobility of hosts and agents.",
            "Wrapper-based evolution of legacy information systems.",
            "Process modeling in Web applications.",
            "Efficient path conditions in dependence graphs for software safety analysis."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2005",
        "info": "Volume 14, 2005",
        "count": 14,
        "papers": [
            "Parameterized object sensitivity for points-to analysis for Java.",
            "Formal interpreters for diagram notations.",
            "An empirical study of industrial requirements engineering process assessment and improvement.",
            "Editorial.",
            "A scalable formal method for design and automatic checking of user interfaces.",
            "Software reuse for scientific computing through program generation.",
            "A comprehensive approach for the development of modular software architecture description languages.",
            "An extended fault class hierarchy for specification-based testing.",
            "Reasoning about inconsistencies in natural language requirements.",
            "Toward an engineering discipline for grammarware.",
            "Editorial.",
            "Impact of software engineering research on the practice of software configuration management.",
            "The impact of software engineering research on modern programming languages.",
            "Reasoning about static and dynamic properties in alloy: A purely relational approach."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2004",
        "info": "Volume 13, 2004",
        "count": 10,
        "papers": [
            "Address translation in telecommunication features.",
            "Incremental elaboration of scenario-based specifications and behavior models using implied scenarios.",
            "A formal model for reasoning about adaptive QoS-enabled middleware.",
            "Assembly instruction level reverse execution for debugging.",
            "Classifying data dependences in the presence of pointers for program comprehension, testing, and debugging.",
            "Mae - a system model and environment for managing architectural evolution.",
            "On test suite composition and cost-effective regression testing.",
            "Coupling and cohesion metrics for knowledge-based systems using frames and rules.",
            "Flow analysis for verifying properties of concurrent software systems.",
            "A framework for modeling and implementing visual notations with applications to software engineering."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2003",
        "info": "Volume 12, 2003",
        "count": 14,
        "papers": [
            "Editorial.",
            "Feature specification and automated conflict detection.",
            "Flexible consistency checking.",
            "High-order architectural connectors.",
            "Reviewers 2002.",
            "A formal approach for designing CORBA-based applications.",
            "Term rewriting with traversal functions.",
            "Static analysis to support the evolution of exception structure in object-oriented systems.",
            "Automatic testing equivalence verification of spi calculus specifications.",
            "Automatic high-quality reengineering of database programs by abstraction, transformation and reimplementation.",
            "Developing multiagent systems: The Gaia methodology.",
            "Multi-valued symbolic model-checking.",
            "A framework and tool support for the systematic testing of model-based specifications.",
            "A model-checking verification environment for mobile processes."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2002",
        "info": "Volume 11, 2002",
        "count": 15,
        "papers": [
            "Modeling software architectures in the Unified Modeling Language.",
            "On fault classes and error detection capability of specification-based testing.",
            "An inheritance-based technique for building simulation proofs incrementally.",
            "Behavior-consistent specialization of object life cycles.",
            "A formal design notation for real-time systems.",
            "Achieving extensibility through product-lines and domain-specific languages: a case study.",
            "Mixin layers: an object-oriented implementation technique for refinements and collaboration-based designs.",
            "Alloy: a lightweight object modelling notation.",
            "Temporal abstract classes and virtual temporal specifications for real-time systems.",
            "Two case studies of open source software development: Apache and Mozilla.",
            "Equivalence analysis and its application in improving the efficiency of program slicing.",
            "Obituary.",
            "Architecting families of software systems with process algebras.",
            "Comparing test sets and criteria in the presence of test hypotheses and fault domains.",
            "Automated abstraction of class diagrams."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2001",
        "info": "Volume 10, 2001",
        "count": 11,
        "papers": [
            "A slicing-based approach for locating type errors.",
            "TACCLE: a methodology for object-oriented software testing at the class and cluster levels.",
            "A methodology for testing spreadsheets.",
            "A comparative study of coarse- and fine-grained safe regression test-selection techniques.",
            "An empirical study of regression test selection techiques.",
            "Interprocedural control dependence.",
            "Automated deductive requirements analysis of critical systems.",
            "Parallel changes in large-scale software development: an observational case study.",
            "Reasoning about code mobility with mobile UNITY.",
            "Modeling statecharts and activitycharts as signal equations.",
            "Designing data marts for data warehouses."
        ]
    },
    {
        "name": "TOSEM",
        "year": "2000",
        "info": "Volume 9, 2000",
        "count": 14,
        "papers": [
            "Composite model-checking: verification with type-specific symbolic representations.",
            "Using shape analysis to reduce finite-state models of concurrent Java programs.",
            "Abstracting dependencies between software configuration items.",
            "SMC: a symmetry-based model checker for verification of safety and liveness properties.",
            "Using a coordination language to specify and analyze systems containing mobile components.",
            "A generic model for reflective design.",
            "Static checking of system behaviors using derived component assumptions.",
            "Law-governed interaction: a coordination and control mechanism for heterogeneous distributed systems.",
            "A knowledge-based method for inferring semantic concepts from visual models of system behavior.",
            "SAFKASI: a security mechanism for language-based systems.",
            "Proof linking: modular verification of mobile programs in the presence of lazy, dynamic linking.",
            "Protecting privacy using the decentralized label model.",
            "Verifying security protocols with Brutus.",
            "A compiler for analyzing cryptographic protocols using noninterference."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1999",
        "info": "Volume 8, 1999",
        "count": 13,
        "papers": [
            "Composition and Refinement of Discrte Real-Time Systems.",
            "Checking Safety Properties Using Compositional Reachability Analysis.",
            "From Formal Models to Formally Based Methods: An Industrial Experience.",
            "Modeling Mobile IP in Mobile UNITY.",
            "Software Process Validation: Quantitatively Measuring the Correspondence of a Process to a Model.",
            "GENOA - A Customizable, Front-end-Retargetable Source Code Analysis Framework.",
            "A Hierarchy-aware Approach to Faceted Classification of Objected-Oriented Components.",
            "Estimation of Software Reliability by Stratified Sampling.",
            "Reifying Variants in Configuration Management.",
            "The Desert environment.",
            "PRIME - Toward process-integrated modeling environments: 1.",
            "Fault classes and error detection capability of specification-based testing.",
            "Corrigenda: a hierarchy-aware approach to faceted classification of object-oriented components."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1998",
        "info": "Volume 7, 1998",
        "count": 14,
        "papers": [
            "Software Process Modeling and Execution Within Virtual Environments.",
            "Understanding the Sources of Variation in Software Inspections.",
            "Toward Formalizing Structured Analysis.",
            "Supporting the Restructuring of Data Abstractions Through Manipulation of a Program Visualization.",
            "An Empirical Study of Static Call Graph Extractors.",
            "Delta Algorithms: An Empirical Analysis.",
            "Discovering Models of Software Processes from Event-Based Data.",
            "In Black and White: An Integrated Approach to Class-Level Testing of Object-Oriented Programs.",
            "Formalizing Space Shuttle Software Requirements: Four Case Studies.",
            "Errata: A Formal Basis for Architectural Connection.",
            "Managing Inconsistent Specifications: Reasoning, Analysis, and Action.",
            "Eliciting software Process Models with the E3 Language.",
            "Applying GQM in an Industrial Software Factory.",
            "Addendum to \"Delta Algorithms: An Empirical Analysis\"."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1997",
        "info": "Volume 6, 1997",
        "count": 13,
        "papers": [
            "Four Dark Corners of Requirements Engineering.",
            "A Graphical Environment for the Design of Concurrent Real-Time Systems.",
            "Task Dependence and Termination in Ada.",
            "An Evolutionary Approach to Constructing Effective Software Reuse Repositories.",
            "The Use of Description Logics in KBSE Systems.",
            "A Safe, Efficient Regression Test Selection Technique.",
            "A Formal Basis for Architectural Connection.",
            "Mobile UNITY: Reasoning and Specification in Mobile Computing.",
            "Assessing Process-Centered Software Engineering Environments.",
            "Technical Correspondence Comments on \"A Reduced Test Suite for Protocol Conformance Testing\".",
            "Specification Matching of Software Components.",
            "Hybrid Slicing: Integrating Dynamic Information with Static Analysis.",
            "Unified Versioning Through Feature Logic."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1996",
        "info": "Volume 5, 1996",
        "count": 13,
        "papers": [
            "Generation of Formatters for Context-Free Languages.",
            "Generating Testing and Analysis Tools with Aria.",
            "The Chaining Approach for Software Test Data Generation.",
            "Using Failure Cost Information for Testing and Reliability Assessment.",
            "An Experimental Determination of Sufficient Mutant Operators.",
            "Testing by Means of Inductive Program Learning.",
            "Reengineering of Configurations Based on Mathematical Concept Analysis.",
            "A Framework for Formalizing Inconsistencies and Deviations in Human-Centered Systems.",
            "Automated Consistency Checking of Requirements Specifications.",
            "Lightweight Lexical Source Model Extraction.",
            "The STATEMATE Semantics of Statecharts.",
            "Context Constraints for Compositional Reachability Analysis.",
            "A Framework for Event-Based Software Integration."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1995",
        "info": "Volume 4, 1995",
        "count": 12,
        "papers": [
            "Program Integration for Languages with Procedure Calls.",
            "Software Trustability Analysis.",
            "A Concurrency Analysis Tool Suite for Ada Programs: Rational, Design, and Preliminary Experience.",
            "Aspect: Detecting Bugs with Abstract Dependences.",
            "Signature Matching: A Tool for Using Software Libraries.",
            "Graph Models for Reachability of Concurrent Programs.",
            "Comments on \"The Cost of Selective Recompilation and Environment Processing\".",
            "Authors' Response.",
            "APPL/A: A Language for Software Process Programming.",
            "A Time-Sensitive Object Model for Real-Time Systems.",
            "Formalizing Style to Understand Descriptions of Software Architecture.",
            "Structuring Z Specifications with Views."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1994",
        "info": "Volume 3, 1994",
        "count": 12,
        "papers": [
            "The Cost of Selective Recompilation and Environment Processing.",
            "Double Iterative Framework for Flow-Sensitive Interprocedural Data Flow Analysis.",
            "Object-Oriented Logical Specification of Time-Critical Systems.",
            "The ASTOOT Approach to Testing Object-Oriented Programs.",
            "A Graphical Interval Logic for Specifying Concurrent Systems.",
            "An Algebraic Theory of Class Specification.",
            "A Reduced Test Suite for Protocol Conformance Testing.",
            "The Larch/Smalltalk Interface Specification Language.",
            "A Simplified Domain-Testing Strategy.",
            "Formal Specification and Designof a Message Router.",
            "Validating Real-Time Systems by History-Checking TRIO Specifications.",
            "Application and Experimental Evaluation of State Space Reduction Methods for Deadlock Analysis in Ada."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1993",
        "info": "Volume 2, 1993",
        "count": 13,
        "papers": [
            "Functional Specification of Time-Sensitive Communicating Systems.",
            "Parallel and Distributed Incremental Attribute Evaluation Algorithms for Multiuser Software Development Environments.",
            "Markow Analysis of Software Specifications.",
            "Experimental Results from an Automatic Test Case Generator.",
            "Simulating Reactive Systems by Deduction.",
            "A Meta-Environment for Generating Programming Environments.",
            "Coordinating Rule-Based Software Processes with ESP.",
            "Automated Assistance for Program Restructuring.",
            "A Methodology for Controlling the Size of a Test Suite.",
            "Retrieving Reusable Software by Sampling Behaviour.",
            "A Visual Model for Ada Tasking.",
            "Distributed Real-Time System Specification and Verification in APTL.",
            "Conjunction as Composition."
        ]
    },
    {
        "name": "TOSEM",
        "year": "1992",
        "info": "Volume 1, 1992",
        "count": 17,
        "papers": [
            "Editorial.",
            "Investigations of the Software Testing Coupling Effect.",
            "Interprocedural Static Analysis of Sequencing Constraints.",
            "A Reference Architecture for the Component Factory.",
            "The Automated Production Control Documentation System: A Case Study in Cleanroom Software Engineering.",
            "The Pan Language-Based Editing System.",
            "Editorial.",
            "Building Integrated Software Development Environments Part I: Tool Specification.",
            "Structural Testing of Rule-Based Expert Systems.",
            "An Experimental Study of Fault Detection In User Requirements Documents.",
            "Computing Similarity in a Reuse Library System: An AI-Based Approach.",
            "Reconciling Environment Integration and Software Evolution.",
            "OBSERV - A Prototyping Language and Environment.",
            "A Program Integration Algorithm that Accommodates Semantics-Preserving Transformations.",
            "The Design and Implementation of Hierarchical Software Systems with Reusable Components.",
            "On Statecharts with Overlapping.",
            "Detection of Linear Errors via Domain Testing."
        ]
    }
]