[
    {
        "name": "TPLP",
        "year": "2022",
        "info": "Volume 22, 2022",
        "count": 6,
        "papers": [
            "Probabilistic QoS-aware Placement of VNF Chains at the Edge.",
            "On Correctness and Completeness of an n Queens Program.",
            "Modeling and Reasoning in Event Calculus using Goal-Directed Constraint Answer Set Programming.",
            "Learning Distributional Programs for Relational Autocompletion.",
            "On Signings and the Well-Founded Semantics.",
            "Exploiting Database Management Systems and Treewidth for Counting."
        ]
    },
    {
        "name": "TPLP",
        "year": "2021",
        "info": "Volume 21, 2021",
        "count": 44,
        "papers": [
            "Introduction to the Special Issue on Logic Rules and Reasoning: Selected Papers from the 2nd International Joint Conference on Rules and Reasoning (RuleML+RR 2018).",
            "Restricted Chase Termination for Existential Rules: A Hierarchical Approach and Experimentation.",
            "Characterizing Boundedness in Chase Variants.",
            "A Logic-Based Framework Leveraging Neural Networks for Studying the Evolution of Neurological Disorders.",
            "Backjumping is Exception Handling.",
            "Omission-Based Abstraction for Answer Set Programs.",
            "Incremental and Modular Context-sensitive Analysis.",
            "Interactive Text Graph Mining with a Prolog-Based Dialog Engine.",
            "Implementing WordNet Measures of Lexical Semantic Similarity in a Fuzzy Logic Programming System.",
            "Fundamental Proof Methods in Computer Science: A Computer-Based Approach, by Arkoudas and Musser, The MIT Press, Cambridge, USA, ISBN 978-0-262-03553-8.",
            "A general framework for static profiling of parametric resource usage - CORRIGENDUM.",
            "Omission-based Abstraction for Answer Set Programs - ERRATUM.",
            "Preface.",
            "Splitting Epistemic Logic Programs.",
            "Train Scheduling with Hybrid Answer Set Programming.",
            "Elaboration Tolerant Representation of Markov Decision Process via Decision-Theoretic Extension of Probabilistic Action Language +.",
            "Manipulation of Articulated Objects Using Dual-arm Robots via Answer Set Programming.",
            "Introduction to the TPLP Special Issue from the 16th European Conference on Logics in Artificial Intelligence (JELIA 2019).",
            "The Probabilistic Description Logic.",
            "A Qualitative Theory of Cognitive Attitudes and their Change.",
            "Exploring the Jungle of Intuitionistic Temporal Logics.",
            "Completing the Picture: Complexity of Graded Modal Logics with Converse.",
            "Introduction to the 37th International Conference on Logic Programming Special Issue I.",
            "Modal Logic S5 Satisfiability in Answer Set Programming.",
            "Optimizing Probabilities in Probabilistic Logic Programs.",
            "Nonground Abductive Logic Programming with Probabilistic Integrity Constraints.",
            "Utilizing Treewidth for Quantitative Reasoning on Epistemic Logic Programs.",
            "Reasoning on Multirelational Contextual Hierarchies via Answer Set Programming with Algebraic Measures.",
            "I-DLV-sr: A Stream Reasoning System based on I-DLV.",
            "A Logical Characterization of the Preferred Models of Logic Programs with Ordered Disjunction.",
            "Determining Action Reversibility in STRIPS Using Answer Set and Epistemic Logic Programming.",
            "Planning with Incomplete Information in Quantified Answer Set Programming.",
            "Planning for an Efficient Implementation of Hypothetical Bousi∼Prolog.",
            "Introduction to the 37th International Conference on Logic Programming Special Issue II.",
            "Transformation-Enabled Precondition Inference.",
            "Harnessing Incremental Answer Set Solving for Reasoning in Assumption-Based Argumentation.",
            "Here and There with Arithmetic.",
            "Solution Enumeration by Optimality in Answer Set Programming.",
            "VeriFly: On-the-fly Assertion Checking via Incrementality.",
            "as Input Language for Answer Set Solvers.",
            "An Asymptotic Analysis of Probabilistic Logic Programming, with Implications for Expressing Projective Families of Distributions.",
            "Refactoring the Whitby Intelligent Tutoring System for Clean Architecture.",
            "An ASP-based Solution to the Chemotherapy Treatment Scheduling problem.",
            "Knowledge-Based Stable Roommates Problem: A Real-World Application."
        ]
    },
    {
        "name": "TPLP",
        "year": "2020",
        "info": "Volume 20, 2020",
        "count": 47,
        "papers": [
            "A Logic Framework for P2P Deductive Databases.",
            "Compositional Specification in Rewriting Logic.",
            "In Praise of Impredicativity: A Contribution to the Formalization of Meta-Programming.",
            "Implementing a Library for Probabilistic Programming Using Non-strict Non-determinism.",
            "The Seventh Answer Set Programming Competition: Design and Results.",
            "Efficiently Coupling the I-DLV Grounder with ASP Solvers.",
            "The External Interface for Extending WASP.",
            "Action-Centered Information Retrieval.",
            "An Application of ASP Theories of Intentions to Understanding Restaurant Scenarios: Insights and Narrative Corpus.",
            "ASP-Core-2 Input Language Format.",
            "A Transformational Approach to Resource Analysis with Typed-norms Inference.",
            "A Comparative Study of Some Central Notions of ASPIC+ and DeLP.",
            "Solving Advanced Argumentation Problems with Answer Set Programming.",
            "Answer Set Programming, by Vladimir Lifschitz, Springer NatureSwitzerland AG, ISBN 978-3-030-24657-0.",
            "selp: A Single-Shot Epistemic Logic Program Solver.",
            "OntoScene, A Logic-Based Scene Interpreter: Implementation and Application in the Rock Art Domain.",
            "Boosting Answer Set Optimization with Weighted Comparator Networks.",
            "Rethinking Defeasible Reasoning: A Scalable Approach.",
            "Introduction to the 36th International Conference on Logic Programming Special Issue I.",
            "Modelling Multi-Agent Epistemic Planning in ASP.",
            "Advancing Lazy-Grounding ASP Solving Techniques - Restarts, Phase Saving, Heuristics, and More.",
            "Managing caching strategies for stream reasoning with reinforcement learning.",
            "MAP Inference for Probabilistic Logic Programming.",
            "White-box Induction From SVM Models: Explainable AI with Logic Programming.",
            "Concolic Testing in CLP.",
            "A Generalised Approach for Encoding and Reasoning with Qualitative Theories in Answer Set Programming.",
            "On the Semantics of Abstract Argumentation Frameworks: A Logic Programming Approach.",
            "Incremental maintenance of overgrounded logic programs with tailored simplifications.",
            "Verifying Tight Logic Programs with anthem and vampire.",
            "An ASP approach for reasoning in a concept-aware multipreferential lightweight DL.",
            "Modular Answer Set Programming as a Formal Specification Language.",
            "Towards Metric Temporal Answer Set Programming.",
            "Conflict Generalisation in ASP: Learning Correct and Effective Non-Ground Constraints.",
            "Introduction to the 36th International Conference on Logic Programming Special Issue II.",
            "Flexible coinductive logic programming.",
            "eclingo : A Solver for Epistemic Logic Programs.",
            "Modular Constraint Solver Cooperation via Abstract Interpretation.",
            "A logic-based decision support system for the diagnosis of headache disorders according to the ICHD-3 international classification.",
            "Exploiting Game Theory for Analysing Justifications.",
            "ASP(𝓐𝒞): Answer Set Programming with Algebraic Constraints.",
            "A General Framework for Stable Roommates Problems using Answer Set Programming.",
            "An Application of ASP in Nuclear Engineering: Explaining the Three Mile Island Nuclear Accident Scenario.",
            "Reasoning about Cardinal Directions between 3-Dimensional Extended Objects using Answer Set Programming.",
            "DaRLing: A Datalog rewriter for OWL 2 RL ontological reasoning under SPARQL queries.",
            "Explanation Generation for Multi-Modal Multi-Agent Path Finding with Optimal Resource Utilization using Answer Set Programming.",
            "The New Normal: We Cannot Eliminate Cuts in Coinductive Calculi, But We Can Explore Them.",
            "Human Robot Collaborative Assembly Planning: An Answer Set Programming Approach."
        ]
    },
    {
        "name": "TPLP",
        "year": "2019",
        "info": "Volume 19, 2019",
        "count": 50,
        "papers": [
            "Enabling reasoning with LegalRuleML.",
            "Multi-shot ASP solving with clingo.",
            "Hybrid metabolic network completion.",
            "Introduction to the TPLP Special Issue on User-oriented Logic Programming and Reasoning Paradigms.",
            "Answering the \"why\" in answer set programming - A survey of explanation approaches.",
            "Introducing Computer Science to High School Students Through Logic Programming.",
            "Using SWISH to Realize Interactive Web-based Tutorials for Logic-based Languages.",
            "onlineSPARC: A Programming Environment for Answer Set Programming.",
            "Debugging Non-ground ASP Programs: Technique and Graphical Tools.",
            "Web-STAR: A Visual Web-based IDE for a Story Comprehension System.",
            "Inlining External Sources in Answer Set Programs.",
            "Description, Implementation, and Evaluation of a Generic Design for Tabled CLP.",
            "Probabilistic DL Reasoning with Pinpointing Formulas: A Prolog-based Approach.",
            "plasp 3: Towards Effective ASP Planning.",
            "Hybrid ASP-based Approach to Pattern Mining.",
            "Semantic DMN: Formalizing and Reasoning About Decisions in the Presence of Background Knowledge.",
            "Property-Based Testing for Spark Streaming.",
            "Optimizing Answer Set Computation via Heuristic-Based Decomposition.",
            "Solving Horn Clauses on Inductive Data Types Without Induction - ERRATUM.",
            "Introduction to the 35th International Conference on Logic Programming Special Issue.",
            "Querying Knowledge via Multi-Hop English Questions.",
            "Enhancing Magic Sets with an Application to Ontological Reasoning.",
            "Founded (Auto)Epistemic Equilibrium Logic Satisfies Epistemic Splitting.",
            "Paracoherent Answer Set Semantics meets Argumentation Frameworks.",
            "Beyond NP: Quantifying over Answer Sets.",
            "Resource Analysis driven by (Conditional) Termination Proofs.",
            "Abstract Solvers for Computing Cautious Consequences of ASP programs.",
            "Better Paracoherent Answer Sets with Less Resources.",
            "Anti-unification in Constraint Logic Programming.",
            "About Epistemic Negation and World Views in Epistemic Logic Programs.",
            "Applying Constraint Logic Programming to SQL Semantic Analysis.",
            "On Uniform Equivalence of Epistemic Logic Programs.",
            "Online Event Recognition from Moving Vehicles: Application Paper.",
            "Partial Compilation of ASP Programs.",
            "Symbolic Analysis of Maude Theories with Narval.",
            "Inconsistency Proofs for ASP: The ASP - DRUPE Format.",
            "Revisiting Explicit Negation in Answer Set Programming.",
            "The Expressive Power of Higher-Order Datalog.",
            "On the Equivalence Between Abstract Dialectical Frameworks and Logic Programs.",
            "Incremental Answer Set Programming with Overgrounding.",
            "A Distributed Approach to LARS Stream Reasoning (System paper).",
            "Control-Flow Refinement by Partial Evaluation, and its Application to Termination and Cost Analysis.",
            "Relating Two Dialects of Answer Set Programming.",
            "Using Answer Set Programming for Commonsense Reasoning in the Winograd Schema Challenge.",
            "A Syntactic Operator for Forgetting that Satisfies Strong Persistence.",
            "A Case for Stale Synchronous Distributed Model for Declarative Recursive Computation.",
            "Precomputing Datalog Evaluation Plans in Large-Scale Scenarios.",
            "Bridging Commonsense Reasoning and Probabilistic Planning via a Probabilistic Action Language.",
            "Evaluation of the Implementation of an Abstract Interpretation Algorithm using Tabled CLP.",
            "Domain-Independent Cost-Optimal Planning in ASP."
        ]
    },
    {
        "name": "TPLP",
        "year": "2018",
        "info": "Volume 18, 2018",
        "count": 45,
        "papers": [
            "Logic + control: On program construction and verification.",
            "Stepwise debugging of answer-set programs.",
            "SUNNY-CP and the MiniZinc challenge.",
            "Random generation of closed simply typed λ-terms: A synergy between logic programming and Boltzmann samplers.",
            "Lock-free atom garbage collection for multithreaded Prolog - ERRATUM.",
            "Editorial: 29th International conference on logic programming special issue - ADDENDUM.",
            "Introduction to the special issue on computational logic for verification.",
            "Predicate Pairing for program verification.",
            "Interval-based resource usage verification by translation into Horn clauses and an application to energy consumption.",
            "Tree dimension in verification of constrained Horn clauses.",
            "A concurrent constraint programming interpretation of access permissions.",
            "Introduction to the 34-th international conference on logic programming special issue.",
            "Shared aggregate sets in answer set programming.",
            "Cautious reasoning in ASP via minimal models and unsatisfiable cores.",
            "Constraint Answer Set Programming without Grounding.",
            "A Trajectory Calculus for Qualitative Spatial Reasoning Using Answer Set Programming.",
            "Certified Graph View Maintenance with Regular Datalog.",
            "Functional ASP with Intensional Sets: Application to Gelfond-Zhang Aggregates.",
            "Temporal Answer Set Programming on Finite Traces.",
            "Approximation Fixpoint Theory and the Well-Founded Semantics of Higher-Order Logic Programs.",
            "Optimal Scheduling for Exposed Datapath Architectures with Buffered Processing Units by ASP.",
            "Solving Horn Clauses on Inductive Data Types Without Induction.",
            "Shape Neutral Analysis of Graph-based Data-structures.",
            "Proof-relevant Horn Clauses for Dependent Type Inference and Term Synthesis.",
            "Experimenting with robotic intra-logistics domains.",
            "Routing Driverless Transport Vehicles in Car Assembly with Answer Set Programming.",
            "An ASP Methodology for Understanding Narratives about Stereotypical Activities.",
            "An iterative approach to precondition inference using constrained Horn clauses.",
            "Exploiting Answer Set Programming with External Sources for Meta-Interpretive Learning.",
            "Translating LPOD and CR-Prolog2 into standard answer set programs.",
            "A Probabilistic Extension of Action Language ${\\cal BC}$+}$.",
            "Incremental and Iterative Learning of Answer Set Programs from Mutually Distinct Examples.",
            "Constraint-Based Inference in Probabilistic Logic Programs.",
            "Phylotastic: An Experiment in Creating, Manipulating, and Evolving Phylogenetic Biology Workflows Using Logic Programming.",
            "First-order Answer Set Programming as Constructive Proof Search.",
            "Specifying and Verbalising Answer Set Programs in Controlled Natural Language.",
            "Top-down and Bottom-up Evaluation Procedurally Integrated.",
            "Past and present (and future) of parallel and distributed computation in (constraint) logic programming.",
            "A review of literature on parallel constraint solving.",
            "Parallelism, concurrency and distribution in constraint handling rules: A survey.",
            "Scaling-up reasoning and advanced analytics on BigData.",
            "Logic programming as a service.",
            "A datalog-based computational model for coordination-free, data-parallel systems.",
            "Performing fully parallel constraint logic programming on a quantum annealer.",
            "Table space designs for implicit and explicit concurrent tabled evaluation."
        ]
    },
    {
        "name": "TPLP",
        "year": "2017",
        "info": "Volume 17, 2017",
        "count": 43,
        "papers": [
            "The pragmatic proof: Hypermedia API composition and execution.",
            "Enablers and inhibitors in causal justifications of logic programs.",
            "Range-based argumentation semantics as two-valued models.",
            "The KB paradigm and its application to interactive configuration.",
            "Constraint Solving and Planning with Picat by Neng-Fa Zhou , Håkan Kjellerstrand , and Jonathan Fruhman , xi + 148 pages, Springer, 2015. Paperback, ISBN 978-3-319-25881-2.",
            "Default rules for Curry.",
            "Consistency and trust in peer data exchange systems.",
            "Non-monotonic spatial reasoning with answer set programming modulo theories.",
            "Temporal logic programs with variables.",
            "A linear algebraic approach to datalog evaluation.",
            "ASPeRiX, a first-order forward chaining approach for answer set computing.",
            "αCheck: A mechanized metatheory model checker.",
            "Computation, Proof, Machine: Mathematics Enters a New Age, Gilles Dowek , Cambridge University Press, 2015. Hardback, ISBN 978-0-521-11801-9, 152 pages.",
            "Preface.",
            "Contractibility for open global constraints.",
            "Clingcon: The next generation.",
            "Constraint answer set solver EZCSP and why integration schemas matter.",
            "Constraint solving for finite model finding in SMT solvers.",
            "On relation between constraint answer set programming and satisfiability modulo theories.",
            "CASP solutions for planning in hybrid domains.",
            "Solving distributed constraint optimization problems using logic programming.",
            "Introduction to the 33rd international conference on logic programming special issue.",
            "Inspecting Maude variants with GLINTS.",
            "Model enumeration in propositional circumscription via unsatisfiable core analysis.",
            "Finite model reasoning over existential rules.",
            "Ticker: A system for incremental ASP-based stream reasoning.",
            "Improving adherence to heart failure management guidelines via abductive reasoning.",
            "Constraints, lazy constraints, or propagators in ASP solving: An empirical analysis.",
            "Logic programming approaches for routing fault-free and maximally parallel wavelength-routed optical networks-on-chip (Application paper).",
            "Annotated defeasible logic.",
            "When you must forget: Beyond strong persistence when forgetting in answer set programming.",
            "Program completion in the input language of GRINGO.",
            "Clingo goes linear constraints over reals and integers.",
            "Well-founded operators for normal hybrid MKNF knowledge bases.",
            "Productive corecursion in logic programming.",
            "Representing hybrid automata by action language modulo theories.",
            "Computing LPMLN using ASP and MLN solvers.",
            "Achievements in answer set programming.",
            "The intricacies of three-valued extensional semantics for higher-order logic programs.",
            "Constraint handling rules with binders, patterns and generic quantification.",
            "A new algorithm to automate inductive learning of default theories.",
            "Hybrid conditional planning using answer set programming.",
            "Fixpoint semantics and optimization of recursive Datalog programs with aggregates."
        ]
    },
    {
        "name": "TPLP",
        "year": "2016",
        "info": "Volume 16, 2016",
        "count": 46,
        "papers": [
            "Description and Optimization of Abstract Machines in a Dialect of Prolog.",
            "Justifying answer sets using argumentation.",
            "Characterization of logic program revision as an extension of propositional revision.",
            "Combining decidability paradigms for existential rules. Theory and Practice of Logic Programming - Corrigendum.",
            "CLP(H):  Constraint logic programming for hedges.",
            "AC-KBO revisited.",
            "Modular action language.",
            "All about Proofs, Proofs for All, Bruno Woltzenlogel Paleo and David Delahaye, Eds., College Publications, Series Mathematical Logic and Foundations, vol. 55., 2015. Paperback, ISBN 978-1-84890-166-7, vii + 240 pages.",
            "Introduction to the special issue on the International Web Rule Symposia 2012-2014.",
            "Solving stable matching problems using answer set programming.",
            "Programming in logic without logic programming.",
            "The rationale behind the concept of goal.",
            "An event calculus production rule system for reasoning in dynamic and uncertain domains.",
            "Using linear constraints for logic program termination analysis.",
            "Putting logic-based distributed systems on stable grounds.",
            "A model building framework for answer set programming with external computations.",
            "Disjunctive answer set solvers via templates.",
            "On definite program answers and least Herbrand models.",
            "Introduction to the 32nd International Conference on Logic Programming Special Issue.",
            "Assertion-based analysis via slicing with ABETS.",
            "Anytime answer set optimization via unsatisfiable core shrinking.",
            "The power of non-ground rules in Answer Set Programming.",
            "Stable-unstable semantics: Beyond NP with normal logic programs.",
            "Justifications for programs with disjunctive and causal-choice rules.",
            "A Physician Advisory System for Chronic Heart Failure management based on knowledge patterns.",
            "Query answering in resource-based answer set semantics.",
            "On local domain symmetry for model expansion.",
            "Combining Answer Set Programming and domain heuristics for solving hard industrial problems (Application Paper).",
            "Deriving conclusions from non-monotonic cause-effect relations.",
            "Logic Programming with Graph Automorphism: Integrating nauty with Prolog (Tool Description).",
            "Paraconsistency and word puzzles.",
            "Semantic code browsing.",
            "ASP for minimal entailment in a rational extension of SROEL.",
            "First-order modular logic programs and their conservative extensions.",
            "Stable models for infinitary formulas with extensional atoms.",
            "Proving infinitary formulas.",
            "CoreALMlib: An ALM library translated from the Component Library.",
            "Online learning of event definitions.",
            "Iterative Learning of Answer Set Programs from Context Dependent Examples.",
            "A general framework for static profiling of parametric resource usage.",
            "The dlvhex system for knowledge representation: recent advances (system description).",
            "Efficient algebraic effect handlers for Prolog.",
            "On the Implementation of an Or-Parallel Prolog System for Clusters of Multicores.",
            "Precise complexity guarantees for pointer analysis via Datalog with extensions.",
            "Tabling with Sound Answer Subsumption.",
            "Lock-free atom garbage collection for multithreaded Prolog."
        ]
    },
    {
        "name": "TPLP",
        "year": "2015",
        "info": "Volume 15, 2015",
        "count": 41,
        "papers": [
            "An application of answer set programming to the field of second language acquisition.",
            "On equivalence of infinitary formulas under the stable model semantics.",
            "Generating explanations for biomedical queries.",
            "Characterizing and extending answer set semantics using possibility theory.",
            "aspeed: Solver scheduling via answer set programming.",
            "A Gentle Guide to Constraint Logic Programming via ECLiPSe  by Antoni Niederliński, xiii + 509 pages, published by Jacek Skalmierski Computer Studio, Third Edition, 2014.",
            "Introduction to the special issue on probability, logic and learning.",
            "Viterbi training in PRISM.",
            "Structure learning of probabilistic logic programs by searching the clause space.",
            "A probabilistic logic programming event calculus.",
            "Lower complexity bounds for lifted inference.",
            "Unfolding for CHR programs.",
            "Abstract interpretation of temporal concurrent constraint programs.",
            "Inference and learning in probabilistic logic programs using weighted Boolean formulas.",
            "Decidability of the Clark's completion semantics for monadic programs and queries.",
            "Introduction to the 31st International Conference on Logic Programming special issue.",
            "Tabling as a library with delimited control.",
            "Improved answer-set programming encodings for abstract argumentation.",
            "Abstract gringo.",
            "Knowledge compilation of logic programs using approximation fixpoint theory.",
            "A logic programming approach to predict effective compiler settings for embedded software.",
            "Dual-normal logic programs - the forgotten class.",
            "Learning weak constraints in answer set programming.",
            "Horn clauses as an intermediate representation for program analysis and transformation.",
            "Planning as tabled logic programming.",
            "Rewriting recursive aggregates in answer set programming: back to monotonicity.",
            "Complexity and compilation of GZ-aggregates in answer set programming.",
            "Fuzzy answer set computation via satisfiability modulo theories.",
            "Optimizing phylogenetic supertrees using answer set programming.",
            "A denotational semantics for equilibrium logic.",
            "Proving correctness of imperative programs by linearizing constrained Horn clauses.",
            "Adding partial functions to Constraint Logic Programming with sets.",
            "An infinitary encoding of temporal equilibrium logic.",
            "Semantics of templates in a compositional framework for building logics.",
            "Taming primary key violations to query large inconsistent data via ASP.",
            "Concolic testing in logic programming.",
            "Practical run-time checking via unobtrusive property caching.",
            "Timed soft concurrent constraint programs: An interleaved and a parallel approach.",
            "Predicate logic as a modeling language: modeling and solving some machine learning and data mining problems with IDP3.",
            "Random logic programs: Linear model.",
            "Checking termination of bottom-up evaluation of logic programs with function symbols."
        ]
    },
    {
        "name": "TPLP",
        "year": "2014",
        "info": "Volume 14, 2014",
        "count": 44,
        "papers": [
            "A Transformation-based implementation for CLP with qualification and proximity.",
            "Singular and plural functions for functional logic programming.",
            "The third open answer set programming competition.",
            "Independence-Friendly Logic: A Game-Theoretic Approach, Allen L. Mann, Gabriel Sandu and Merlijn Sevenster, Cambridge University Press, 2011. Paperback, ISBN 9780521149341, 216 pp.",
            "Tractable answer-set programming with weight constraints: bounded treewidth is not enough.",
            "Rewriting and narrowing for constructor systems with call-time choice semantics.",
            "Transforming floundering into success.",
            "A goal-directed implementation of query answering for hybrid MKNF knowledge bases.",
            "Programming with Higher-Order Logic, by Dale Miller and Gopalan Nadathur, Cambridge University Press, 2012, Hardcover, ISBN-10: 052187940X, xiv + 306 pp.",
            "An ER-based framework for declarative web programming.",
            "GEM: A distributed goal evaluation algorithm for trust management.",
            "Complexity of super-coherence problems in ASP.",
            "Redundant Sudoku rules.",
            "Optimal multibinding unification for sharing and linearity analysis.",
            "Introduction to the 30th International Conference on Logic Programming Special Issue.",
            "Dynamic Consistency Checking in Goal-Directed Answer Set Programming.",
            "Tabling, Rational Terms, and Coinduction Finally Together!",
            "Efficient Computation of the Well-Founded Semantics over Big Data.",
            "The P-Box CDF-Intervals: A Reliable Constraint Reasoning with Quantifiable Information.",
            "Simulating Dynamic Systems Using Linear Time Calculus Theories.",
            "A Linear Logic Programming Language for Concurrent Programming over Graph Structures.",
            "SUNNY: a Lazy Portfolio Approach for Constraint Solving.",
            "Exchanging Conflict Resolution in an Adaptable Implementation of ACT-R.",
            "Pengines: Web Logic Programming Made Easy.",
            "Incremental Tabling in Support of Knowledge Representation and Reasoning.",
            "claspfolio 2: Advances in Algorithm Selection for Answer Set Programming.",
            "Vicious Circle Principle and Logic Programs with Aggregates.",
            "Causal Graph Justifications of Logic Programs.",
            "On Termination, Confluence and Consistent CHR-based Type Inference.",
            "Contextual Abductive Reasoning with Side-Effects.",
            "A Proof Theoretic Study of Soft Concurrent Constraint Programming.",
            "A Measure of Arbitrariness in Abductive Explanations.",
            "Lifted Variable Elimination for Probabilistic Logic Programming.",
            "Using Tabled Logic Programming to Solve the Petrobras Planning Problem.",
            "On Cascade Products of Answer Set Programs.",
            "Minimum Model Semantics for Extensional Higher-order Logic Programming with Negation.",
            "Resource Usage Analysis of Logic Programs via Abstract Interpretation Using Sized Types.",
            "Anytime Computation of Cautious Consequences in Answer Set Programming.",
            "A Module System for Domain-Specific Languages.",
            "Abstract Diagnosis for tccp using a Linear Temporal Logic.",
            "Truth versus information in logic programming.",
            "A multi-engine approach to answer-set programming.",
            "The rise and fall of semantic rule updates based on SE-models.",
            "Infinite probability computation by cyclic explanation graphs."
        ]
    },
    {
        "name": "TPLP",
        "year": "2013",
        "info": "Volume 13, 2013",
        "count": 84,
        "papers": [
            "Relating weight constraint and aggregate programs: Semantics and representation.",
            "Semantics for Possibilistic Disjunctive Programs.",
            "Representation sharing for Prolog.",
            "Interdefinability of defeasible logic and logic programming under the well-founded semantics.",
            "Introduction to the special issue on the 25th annual GULP conference.",
            "Autonomous agents coordination: Action languages meet CLP() and Linda.",
            "Generalization strategies for the verification of infinite state systems.",
            "Reasoning about actions with Temporal Answer Sets.",
            "Consistent query answering via ASP from different perspectives: Theory and practice.",
            "Parallel instantiation of ASP programs: techniques and experiments.",
            "Well-definedness and efficient inference for probabilistic logic programming under the distribution semantics.",
            "Finding similar/diverse solutions in answer set programming.",
            "Expressiveness of communication in answer set programming.",
            "Reasoning with Forest Logic Programs and f-hybrid knowledge bases.",
            "Editorial: 29th International Conference on Logic Programming special issue.",
            "Detection and exploitation of functional dependencies for model generation.",
            "The jobs puzzle: Taking on the challenge via controlled natural language processing.",
            "Lloyd-Topor completion and general stable models.",
            "Stable model semantics for founded bounds.",
            "Delimited continuations for prolog.",
            "ASP with non-herbrand partial functions: a language and system for practical use.",
            "Disjunctive logic programs with existential quantification in rule heads.",
            "Relative expressiveness of defeasible logics II.",
            "Failure tabled constraint logic programming by interpolation.",
            "A declarative extension of horn clauses, and its significance for datalog and its applications.",
            "Using sequential runtime distributions for the parallel speedup prediction of SAT local search.",
            "Business process verification with constraint temporal answer set programming.",
            "SeaLion: An eclipse-based IDE for answer-set programming with advanced debugging support.",
            "Minimal intervention strategies in logical signaling networks with ASP.",
            "Compiling Input* FO(·) inductive definitions into tabled prolog rules for IDP3.",
            "A practical analysis of non-termination in large logic programs.",
            "A CLP heap solver for test case generation.",
            "Logic programming with function symbols: Checking termination of bottom-up evaluation through program adornments.",
            "Fuzzy answer sets approximations.",
            "Probabilistic legal reasoning in CHRiSM.",
            "Answer set programming as a modeling language for course timetabling.",
            "BigYAP: Exo-compilation meets UDI.",
            "A declarative approach to distributed computing: Specification, execution and analysis.",
            "Finding optimal plans for multiple teams of robots through a mediator: A logic-based approach.",
            "Compact serialization of Prolog terms (with catalan skeletons, cantor tupling and Gödel numberings).",
            "On the stable model semantics for intensional functions.",
            "Combining decidability paradigms for existential rules.",
            "Reasoning about Complex Networks: A Logic Programming Approach.",
            "ABA-Based Answer Set Justification.",
            "Porting and refactoring Prolog programs: the PROSYN case study.",
            "Towards Parametrizing Logic Program Analysis: Two Examples.",
            "An ASP Approach to Query Completeness Reasoning.",
            "co-LP: Back to the Roots.",
            "Checking Proof Transformations with ASP.",
            "Tabled Abduction in Logic Programs.",
            "Constructive Circumscription.",
            "Towards Inverse Execution of Constraint Handling Rules.",
            "Sized Type Analysis for Logic Programs.",
            "Combining Answer Set Programs for Adaptive and Reactive Reasoning.",
            "Monitoring and Visualizing Answer Set Solving.",
            "Attribute Global Types for Dynamic Checking of Protocols in Logic-based Multiagent Systems.",
            "Computing Loops with at Most One External Support Rule for Basic Logic Programs with Arbitrary Constraint Atoms.",
            "Action Programming In Rewriting Logic.",
            "Pattern-Based Compaction for ProbLog Inference.",
            "Adding Plural Arguments to Curry Programs.",
            "The effects of buying a new car: an extension of the IDP Knowledge Base System.",
            "Extending Transaction Logic with External Actions.",
            "Reasoning about Triggered Scenarios in Logic Programming.",
            "Object-Oriented Knowledge Bases in Logic Programming.",
            "Encoding Petri Nets in Answer Set Programming for Simulation Based Reasoning.",
            "Integration Schemas for Constraint Answer Set Programming: a Case Study.",
            "Problem Solving with the Enfragmo System.",
            "A Pigeon-Hole Based Encoding of Cardinality Constraints.",
            "The ICLP 2013 Doctoral Consortium.",
            "Evaluation and Application of Portfolio Approaches in Constraint Programming.",
            "The Role of Functions in the Stable Model Semantics.",
            "LogicObjects: A Portable and Extensible Approach for Linguistic Symbiosis between an Object-Oriented and a Logic Programming Language.",
            "Implementing LP Systems with CP Techniques.",
            "Engineering an Efficient Native ASP Solver.",
            "Algebraic Approach to Causal Logic Programs.",
            "Backdoors to the Tractability of Answer Set Programming.",
            "The Semantics of Gringo and Proving Strong Equivalence.",
            "Visualizing Answer Set Programming.",
            "Towards Computational Morality with Logic Programming.",
            "Argumentation for Answer Set Programming and other Non-monotonic Reasoning Systems.",
            "An Abstract Interpretation Framework for Verification of Timed Concurrent Constraint Languages.",
            "Representing Actions in Logic-based Languages.",
            "Dynamics of knowledge in DeLP through Argument Theory Change.",
            "Region-based memory management for Mercury programs."
        ]
    },
    {
        "name": "TPLP",
        "year": "2012",
        "info": "Volume 12, 2012",
        "count": 41,
        "papers": [
            "Introduction to the special issue on Prolog systems.",
            "The YAP Prolog system.",
            "SICStus Prolog - The first 25 years.",
            "SWI-Prolog.",
            "The BinProlog experience: Architecture and implementation choices for continuation passing Prolog and first-class logic engines.",
            "ECLiPSe - From LP to CLP.",
            "XSB: Extending Prolog with Tabled Logic Programming.",
            "The language features and architecture of B-Prolog.",
            "An overview of Ciao and its design philosophy.",
            "On the implementation of GNU Prolog.",
            "Certificate size reduction in abstraction-carrying code.",
            "A design and implementation of the Extended Andorra Model.",
            "Team-building with answer set programming in the Gioia-Tauro seaport.",
            "Representing first-order causal theories by logic programs.",
            "Models and Games by Jouko Väänänen, Cambridge University Press, Cambridge Studies in Advanced Mathematics Series 132, 2011. Hardcover, ISBN 978-0-521-51812-3, 367 pp.",
            "Logic: A Brief Course by Daniele Mundici, Springer, 2012. Paperback, ISBN 978-88-470-2360-4, xi + 124 pp.",
            "Introduction to the 28th international conference on logic programming special issue.",
            "Towards multi-threaded local tabling using a common table space.",
            "D-FLAT: Declarative problem solving using tree decompositions and answer-set programming.",
            "Compiling finite domain constraints to SAT with BEE.",
            "ASP modulo CSP: The clingcon system.",
            "Inference in probabilistic logic programs with continuous random variables.",
            "Multi-threaded ASP solving with clasp.",
            "Efficient tabling of structured data with enhanced hash-consing.",
            "Relational theories with null values and non-herbrand stable models.",
            "Annotation of logic programs for independent AND-parallelism by partial evaluation.",
            "SMCHR: Satisfiability modulo constraint handling rules.",
            "Annotating answer-set programs in Lana.",
            "An Improved Proof-Theoretic Compilation of Logic Programs.",
            "Conflict-driven ASP solving with external sources.",
            "Model checking with probabilistic tabled logic programming.",
            "Disjunctive datalog with existential quantifiers: Semantics, decidability, and complexity issues.",
            "Module theorem for the general theory of stable models.",
            "Diagrammatic confluence for Constraint Handling Rules.",
            "Lightweight compilation of (C)LP to JavaScript.",
            "Typed answer set programming lambda calculus theories and correctness of inverse lambda algorithms with respect to them.",
            "Relative expressiveness of defeasible logics.",
            "Reducing fuzzy answer set programming to model finding in fuzzy logics.",
            "Contextual hypotheses and semantics of logic programs.",
            "Coding guidelines for Prolog.",
            "A simple correctness proof for magic transformation."
        ]
    },
    {
        "name": "TPLP",
        "year": "2011",
        "info": "Volume 11, 2011",
        "count": 45,
        "papers": [
            "Efficient local unfolding with ancestor stacks.",
            "Polytool: Polynomial interpretations as a basis for termination analysis of logic programs.",
            "Analysing graph transformation systems through constraint handling rules.",
            "Guarded resolution for Answer Set Programming.",
            "Constraint Handling Rules by Thom Frühwirth, Cambridge University Press, 2009. Hard cover: ISBN 978-0-521-87776-3.",
            "Introduction to Mathematics of Satisfiability, Victor W. Marek, Chapman & Hall/CRC, 2009. Hardback, ISBN-13: 978-143980167-3, $89.95.",
            "Introduction to the 24th international conference on logic programming special issue.",
            "Abstract answer set solvers with backjumping and learning.",
            "A general framework for equivalences in Answer-Set Programming by countermodels in the logic of Here-and-There.",
            "Functional answer set programming.",
            "On the implementation of the probabilistic logic programming language ProbLog.",
            "Products of weighted logic programs.",
            "Solving functional constraints by variable substitution.",
            "Detecting inconsistencies in large biological networks with answer set programming.",
            "Reasoning support for risk prediction and prevention in independent living.",
            "Automatic music composition using answer set programming.",
            "Introduction to the 27th International Conference on Logic Programming Special Issue.",
            "The PITA system: Tabling and answer subsumption for reasoning under uncertainty.",
            "ALPprolog - A new logic programming method for dynamic domains.",
            "Observational equivalences for linear logic concurrent constraint languages.",
            "Abstract diagnosis for timed concurrent constraint programs.",
            "SAT-based termination analysis using monotonicity constraints over the integers.",
            "Non-termination analysis of logic programs with integer arithmetics.",
            "RedAlert: Determinacy inference for Prolog.",
            "Parallel backtracking with answer memoing for independent and-parallelism.",
            "Estimating the overlap between dependent computations for automatic parallelization.",
            "(Co-)Inductive semantics for Constraint Handling Rules.",
            "A structured alternative to Prolog with simple compositional semantics.",
            "Transition systems for model generators - A unifying approach.",
            "Actual causation in CP-logic.",
            "The magic of logical inference in probabilistic programming.",
            "On combining linear-based strategies for tabled evaluation of logic programs.",
            "Efficient instance retrieval of subgoals for subsumptive tabled evaluation of logic programs.",
            "On the correctness of pull-tabbing.",
            "Optimal placement of valves in a water distribution network with CLP(FD).",
            "Automatic network reconstruction using ASP.",
            "Constraint-based deadlock checking of high-level specifications.",
            "Normative design using inductive learning.",
            "Splitting and updating hybrid knowledge bases.",
            "Complex optimization in answer set programming.",
            "Concurrent goal-based execution of Constraint Handling Rules.",
            "Trichotomy and dichotomy results on the complexity of reasoning with disjunctive logic programs.",
            "Active integrity constraints and revision programming.",
            "On elementary loops of logic programs.",
            "Mathematical Logic: Foundations for Information Science by Wei Li, Birkhäuser, Berlin, 2010. Hardcover, ISBN-978-3-7643-9976-4."
        ]
    },
    {
        "name": "TPLP",
        "year": "2010",
        "info": "Volume 10, 2010",
        "count": 36,
        "papers": [
            "As time goes by: Constraint Handling Rules.",
            "On the interaction between sharing and linearity.",
            "On the complexity of identifying head-elementary-set-free programs.",
            "NP Datalog: A logic language for expressing search and optimization problems.",
            "Multivalued action languages with constraints in CLP(FD).",
            "Handbook of Practical Logic and Automated Reasoning, John Harrison, Cambridge University Press, 2009. Hardcover, ISBN-13: 978-0-521-89957-4, 681 pp. + xix, $135.00.",
            "Introduction to the TPLP special issue, logic programming in databases: From Datalog to semantic-web rules.",
            "The role of semantics in mining frequent patterns from knowledge bases in description logics with rules.",
            "Querying incomplete data over extended ER schemata.",
            "Inductive Logic Programming in Databases: From Datalog to DL+log.",
            "Introduction to the 26th international conference on logic programming special issue.",
            "Automated termination analysis for logic programs with cut.",
            "Transformations of logic programs on infinite lists.",
            "Swapping evaluation: A memory-scalable solution for answer-on-demand tabling.",
            "Threads and or-parallelism unified.",
            "CHR(PRISM)-based probabilistic logic learning.",
            "Inference with constrained hidden Markov models in PRISM.",
            "A translational approach to constraint answer set solving.",
            "A decidable subclass of finitary programs.",
            "Disjunctive ASP with functions: Decidable queries and effective computation.",
            "Catching the Ouroboros: On debugging non-ground answer-set programs.",
            "Loop formulas for description logic programs.",
            "Towards closed world reasoning in dynamic open worlds.",
            "A program-level approach to revising logic programs under the answer set semantics.",
            "FO(FD): Extending classical logic with rule-based fixpoint definitions.",
            "A complete and terminating execution model for Constraint Handling Rules.",
            "Decidability properties for fragments of CHR.",
            "A declarative semantics for CLP with qualification and proximity.",
            "Logic-based decision support for strategic environmental assessment.",
            "Test case generation for object-oriented imperative languages in CLP.",
            "Logic programming for finding models in the logics of knowledge and its applications: A case study.",
            "Applying Prolog to develop distributed systems.",
            "CLP-based protein fragment assembly.",
            "Formalization of psychological knowledge in answer set programming and its application.",
            "Testing and debugging techniques for answer set solver development.",
            "The system Kato: Detecting cases of plagiarism for answer-set programs."
        ]
    },
    {
        "name": "TPLP",
        "year": "2009",
        "info": "Volume 9, 2009",
        "count": 16,
        "papers": [
            "Justifications for logic programs under answer set semantics.",
            "Probabilistic reasoning with answer sets.",
            "A non-termination criterion for binary constraint logic programs.",
            "Logical Algorithms meets CHR: A meta-complexity result for Constraint Handling Rules with rule priorities.",
            "On finitely recursive programs.",
            "Lambda-Calculus and Combinators, An Introduction, 2nd Edition, J. Roger Hindley and Jonathan P. Seldin, Cambridge University Press, 2008. Hardback, ISBN 9780521898850.",
            "CP-logic: A language of causal probabilistic events and its relation to logic programming.",
            "Fuzzy linguistic logic programming and its applications.",
            "Efficient description logic reasoning in Prolog: The DLog system.",
            "On the cooperation of the constraint domains , R, and F in CFLP.",
            "Characterizations of stable model semantics for logic programs with arbitrary constraint atoms.",
            "Characterising equilibrium logic and nested logic programs: Reductions and complexity, .",
            "Optimality in goal-dependent analysis of Sharing.",
            "The CIFF proof procedure for abductive logic programming with constraints: Theory, implementation and experiments.",
            "Termination prediction for general logic programs.",
            "Relativized hyperequivalence of logic programs for modular programming."
        ]
    },
    {
        "name": "TPLP",
        "year": "2008",
        "info": "Volume 8, 2008",
        "count": 28,
        "papers": [
            "Calculating modules in contextual logic program refinement.",
            "Improving precision of type analysis using non-discriminative union.",
            "Linear tabling strategies and optimizations.",
            "Recurrence with affine level mappings is P-time decidable for CLP(R).",
            "Logic programming with satisfiability.",
            "Experimenting with recursive queries in database and logic programming systems.",
            "Logic programs with monotone abstract constraint atoms.",
            "Improving Prolog programs: Refactoring for Prolog.",
            "A common view on strong, uniform, and other notions of equivalence in answer-set programming.",
            "Learn Prolog Now! Patrick Blackburn, Johan Bos, Kristina Striegnitz: College Publications, 2006 Paperback, ISBN 1-904987-17-6, xiv + 265 pages.",
            "Constraint Logic Programming using ECLiPSe Krzysztof Apt and Mark Wallace, Cambridge University Press, 2007 Hardback, ISBN 9780521866286, 348 pages.",
            "Introduction to the Special Issue on Logic Programming and the Web.",
            "N3Logic: A logical framework for the World Wide Web.",
            "Building Rules on Top of Ontologies for the Semantic Web with Inductive Logic Programming.",
            "Translating OWL and semantic web rules into prolog: Moving toward description logic programs.",
            "Querying XML documents in logic programming.",
            "SWI-Prolog and the web.",
            "Query evaluation and optimization in the semantic web.",
            "Guarded hybrid knowledge bases.",
            "Theory of finite or infinite trees revisited.",
            "TCHR: a framework for tabled CLP.",
            "Preferred extensions as stable models.",
            "Design and implementation of aggregate functions in the DLV system.",
            "Design and implementation of a tracer driver: Easy and efficient dynamic analyses of constraint logic programs.",
            "Checking the quality of clinical guidelines using automated reasoning tools.",
            "Logic programming with social features.",
            "Extended ASP Tableaux and rule redundancy in normal logic programs.",
            "Achieving compositionality of the stable model semantics for smodels programs."
        ]
    },
    {
        "name": "TPLP",
        "year": "2007",
        "info": "Volume 7, 2007",
        "count": 22,
        "papers": [
            "Introduction Special Issue on Multiparadigm Languages and Constraint Programming.",
            "Removing redundant arguments automatically.",
            "Combining relational algebra, SQL, constraint modelling, and local search.",
            "Constraint-based automatic verification of abstract models of multithreaded programs.",
            "Integration of declarative and constraint programming.",
            "Mapping Fusion and Synchronized Hyperedge Replacement into logic programming.",
            "Demand analysis with partial predicates.",
            "A comparison between two logical formalisms for rewriting.",
            "Forward slicing of functional logic programs by partial evaluation.",
            "A knowledge-based approach for selecting information sources.",
            "Well-founded and stable semantics of logic programs with aggregates.",
            "A Constructive semantic characterization of aggregates in answer set programming.",
            "Reasoning and planning with sensing actions, incomplete information, and static causal laws using answer set programming.",
            "Updates in answer set programming: An approach based on basic structural properties.",
            "Fast Frequent Querying with Lazy Control Flow Compilation.",
            "Explanatory Nonmonotonic Reasoning by Alexander Bochman, World Scientific, Hardback: ISBN 981-256-101-3, xiv + 408 pages.",
            "Incremental copying garbage collection for WAM-based Prolog systems.",
            "Constraint functional logic programming over finite domains.",
            "Decomposable theories.",
            "PALS: Efficient Or-Parallel execution of Prolog on Beowulf clusters.",
            "Automated Verification of Weak Equivalence within the SMODELS System.",
            "Propositional theories are strongly equivalent to logic programs."
        ]
    },
    {
        "name": "TPLP",
        "year": "2006",
        "info": "Volume 6, 2006",
        "count": 22,
        "papers": [
            "Stabilization of cooperative information agents in unpredictable environment: a logic programming approach.",
            "Towards automated integration of guess and check programs in answer set programming: a meta-interpreter and applications.",
            "Graphs and colorings for answer set programming.",
            "Preferred answer sets for ordered logic programs.",
            "On the existence of stable models of non-stratified logic programs.",
            "Optimal union-find in Constraint Handling Rules.",
            "Introduction to the Special Issue on Specification Analysis and Verification of Reactive Systems.",
            "Equivalence-checking on infinite-state systems: Techniques and results.",
            "Automatic verification of timed concurrent constraint programs.",
            "State space computation and analysis of Time Petri Nets.",
            "Parametric Verification of a Group Membership Algorithm.",
            "Epistemic foundation of stable model semantics.",
            "Computing minimal models, stable models and answer sets.",
            "EPspectra: a formal toolkit for developing DSP software applications.",
            "Programming finite-domain constraint propagators in Action Rules.",
            "A three-valued semantics for logic programmers.",
            "Temporal phylogenetic networks and logic programming.",
            "Planning with preferences using logic programming.",
            "Improving PARMA trailing.",
            "Set unification.",
            "Embedding defeasible logic into logic programming.",
            "Logic programming with default, weak and strict negations."
        ]
    },
    {
        "name": "TPLP",
        "year": "2005",
        "info": "Volume 5, 2005",
        "count": 28,
        "papers": [
            "Enhanced sharing analysis techniques: a comprehensive evaluation.",
            "Weight constraints as nested expressions.",
            "Inferring Termination Conditions for Logic Programs using Backwards Analysis.",
            "A uniform approach to logic programming semantics.",
            "Abductive Logic Programs with Penalization: Semantics, Complexity and Implementation.",
            "On Applying Or-Parallelism and Tabling to Logic Programs.",
            "A Parameterised Hierarchy of Argumentation Semantics for Extended Logic Programming and its Application to the Well-founded Semantics.",
            "cTI: A constraint-based termination inference tool for ISO-Prolog.",
            "Computing convex hulls with a linear solver.",
            "Specialization of functional logic programs based on needed narrowing.",
            "A treatment of higher-order features in logic programming.",
            "On termination of meta-programs.",
            "Book review: Programming in Prolog. Using the ISO Standard by William F. Clocksin , Christopher S. Mellish, Springer-Verlag, 2003, ISBN 3-540-00678-8.",
            "Book review: Term Rewriting Systems by \"Terese\" (Marc Bezem, Jan Willem Klop, and Roel de Vrijer, eds.), Cambridge University Press, Cambridge Tracts in Theoretical Computer Science 55, 2003, hard cover: ISBN 0-521-39115-6.",
            "Introduction to the Special Issue on Constraint Handling Rules.",
            "Automatic generation of CHR constraint solvers.",
            "A CHR-based implementation of known arc-consistency.",
            "Schedulers and redundancy for a class of constraint propagation rules.",
            "CHR grammars.",
            "Optimizing compilation of constraint handling rules in HAL.",
            "FLUX: A logic programming method for reasoning agents.",
            "Intelligent search strategies based on adaptive Constraint Handling Rules.",
            "Book review: Concepts, Techniques, and Models of Computer Programming by Peter Van Roy, Seif Haridi, MIT Press, 2004, ISBN 0-262-22069-5.",
            "Integrating design synthesis and assembly of structured objects in a visual design language.",
            "Checking modes of HAL programs.",
            "Proving correctness and completeness of normal programs - a declarative approach.",
            "Optimization of bound disjunctive queries with constraints.",
            "Normal forms for answer sets programming."
        ]
    },
    {
        "name": "TPLP",
        "year": "2004",
        "info": "Volume 4, 2004",
        "count": 28,
        "papers": [
            "Polymorphic Lemmas and Definitions in lambda-Prolog and Twelf.",
            "A Proof Theoretic Approach to Failure in Functional Logic Programming.",
            "Minimal founded semantics for disjunctive logic programs and deductive databases.",
            "Defeasible Logic Programming: An Argumentative Approach.",
            "Offline specialisation in Prolog using a hand-written compiler generator.",
            "Computing stable models: worst-case performance estimates.",
            "Book review: Programming Constraint Services: High level Programming of Standard and New Constraint Services by Christian Schulte. Springer 2002, LNAI 2302, ISBN 3-540-43371-6.",
            "Book review: Knowledge Representation, Reasoning and Declarative Problem Solving by Chitta Baral, Cambridge University press, 2003, ISBN 0-521-81802-8.",
            "XPath-Logic and XPathLog: a logic-programming-style XML data manipulation language.",
            "A correct, precise and efficient integration of set-sharing, freeness and linearity for the analysis of finite and rational tree languages.",
            "Applications of Intuitionistic Logic in Answer Set Programming.",
            "Speedup of Logic Programs by Binarization and Partial Deduction.",
            "Enhancing a search algorithm to perform intelligent backtracking.",
            "Book review: Essentials of Constraint Programming by Thom Frühwirth and Slim Abdennadher, Springer, 2003, hard cover: ISBN 3-540-67623-6, ix + 145 pages.",
            "Abduction in Well-Founded Semantics and Generalized Stable Models via Tabled Dual Programs.",
            "Logic-Based Specification Languages for Intelligent Software Agents.",
            "Transformations of logic programs with goals as arguments.",
            "Book review: Advanced Topics in Term Rewriting by Enno Ohlebusch, Springer-Verlag, 2002, hard cover: ISBN 0-387-95250-0.",
            "Introduction to the Special Issue on Verification and Computational Logic.",
            "Soft Constraint Programming to Analysing Security Protocols.",
            "Model Checking Linear Logic Specifications.",
            "Temporalized logics and automata for time granularity.",
            "On model checking data-independent systems with arrays without reset.",
            "Ackermann Encoding, Bisimulations, and OBDDs.",
            "Inference of termination conditions for numerical loops in Prolog.",
            "Book review: Logic for Learning: Learning Comprehensible Theories from Structured Data by John W. Lloyd, Springer-Verlag, 2003, ISBN 3-540-42027-4.",
            "Book review: Constraint Processing by Rina Dechter, Morgan Kaufmann Publishers, 2003, ISBN 1-55860-890-7.",
            "Book review: Principles of Constraint Programming by Krzysztof R. Apt, Cambridge University Press, 2003, ISBN 0-521-82583-0."
        ]
    },
    {
        "name": "TPLP",
        "year": "2003",
        "info": "Volume 3, 2003",
        "count": 26,
        "papers": [
            "The witness properties and the semantics of the Prolog cut.",
            "The Deductive Database System LDL++.",
            "Efficient Groundness Analysis in Prolog.",
            "Book review: Set Theory for Computing: From Decision Procedures to Declarative Programming with Sets by Domenico Cantone, Eugenio Omodeo, and Alberto Policriti, Springer, 2001, ISBN 0-387-95197-0.",
            "A Framework for Compiling Preferences in Logic Programs.",
            "Composing Programs in a Rewriting Logic for Declarative Programming.",
            "Two results for prioritized logic programming.",
            "Three Optimisations for Sharing.",
            "Characterization of strongly equivalent logic programs in intermediate logics.",
            "Learning in a Compiler for MINSAT Algorithms.",
            "On the abductive or deductive nature of database schema validation and update processing problems.",
            "Handling defeasibilities in action domains.",
            "An Open Ended Tree.",
            "Introduction to the special issue on Programming with Answer Sets.",
            "Answer sets for consistent query answering in inconsistent databases.",
            "Diagnostic reasoning with A-Prolog.",
            "Computing preferred answer sets by meta-interpretation in answer set programming.",
            "Tight logic programs.",
            "Bounded LTL model checking with stable models.",
            "On the expressibility of stable logic programming.",
            "A semantic framework for preference handling in answer set programming.",
            "Strong equivalence made easy: nested expressions and weight constraints.",
            "Introducing Dynamic Behavior in Amalgamated Knowledge Bases.",
            "An abductive framework for computing knowledge base updates.",
            "Logic programming in the context of multiparadigm programming: the Oz experience.",
            "Book review: Introduction to Constraint Databases by Peter Revesz. Texts in Computer Science, Springer-Verlag, 2002, ISBN 0-387-98729-0, xiv + 393 pages, 112 illustrations, hardcover."
        ]
    },
    {
        "name": "TPLP",
        "year": "2002",
        "info": "Volume 2, 2002",
        "count": 22,
        "papers": [
            "Computing large and small stable models.",
            "Sequence-based abstract interpretation of Prolog.",
            "An effective fixpoint semantics for linear logic programs.",
            "Book review: Mathematical Logic for Computer Science (Second Revised Edition) by Mordechai Ben-Ari, Springer, 2001, paperback: ISBN 1-85233-319-7.",
            "Properties of input-consuming derivations.",
            "Soundness, idempotence and commutativity of set-sharing.",
            "Chain Programs for Writing Deterministic Metainterpreters.",
            "Decomposing non-redundant sharing by complementation.",
            "On modular termination proofs of general logic programs.",
            "Disjunctive Logic Programs with Inheritance.",
            "A logic-based approach to data integration.",
            "Classes of terminating logic programs.",
            "Book review: Dynamic Logic by David Harel, Dexter Kozen and Jerzy Tiuryn, The MIT Press, ISBN 0-262-08289-6.",
            "Special Issue on Program Development, Guest Editors' Introduction.",
            "A refinement calculus for logic programs.",
            "Logic program specialisation through partial deduction: Control issues.",
            "A Backward Analysis for Constraint Logic Programs.",
            "Using parametric set constraints for locating errors in CLP programs.",
            "Generic program monitoring by trace analysis.",
            "Using Methods of Declarative Logic Programming for Intelligent Information Agents.",
            "On Properties of Update Sequences Based on Causal Rejection.",
            "CLAIRE: Combining sets, search and rules to better express algorithms."
        ]
    },
    {
        "name": "TPLP",
        "year": "2001",
        "info": "Volume 1, 2001",
        "count": 33,
        "papers": [
            "Invited editorial.",
            "Editorial (by the Editor in Chief).",
            "On a theory of probabilistic deductive databases.",
            "Declarative semantics for active rules.",
            "Linear tabulated resolution based on Prolog control strategy.",
            "Enhancing the expressive power of the U-Datalog language.",
            "Book Review - Logic in Computer Science: Modelling and Reasoning about Systems by Michael R. A. Huth and Mark D. Ryan, Cambridge University Press, 2000, ISBN 0521652006, (hardback), ISBN 0521656028, (paperback).",
            "Knowledge and the Action Description Language A.",
            "A General Framework for Lazy Functional Logic, Programming with Algebraic Polymorphic Types.",
            "Guest editor's introduction Special issue on Logic Programming and the Internet.",
            "Distributed WWW Programming using (Ciao-)Prolog and the PiLLoW library.",
            "Multi-threading and Message Communication in Qu-Prolog.",
            "The Munich Rent Advisor: A Success for Logic Programming on the Internet.",
            "Secure Prolog Based Mobile Code.",
            "High-Level Networking with Mobile Code and First Order AND-Continuations.",
            "Greedy Algorithms in Datalog.",
            "Verifying Termination and Error-Freedom of Logic Programs with block Declarations.",
            "Constraint Logic Programming with Hereditary Harrop Formula.",
            "Order-consistent programs are cautiously monotonic.",
            "Transformation-based bottom-up computation of the well-founded model.",
            "On redundancy elimination tolerant scheduling rules.",
            "On the problem of computing the well-founded semantics.",
            "Worst-case groundness analysis using definite boolean functions.",
            "O(1) reversible tree navigation without cycle.",
            "In honor of Alain Colmerauer's 60th birthday.",
            "A Tribute to Alain Colmerauer.",
            "An interactive semantics of logic programming.",
            "Propositional Defeasible Logic has Linear Complexity.",
            "Constraint programming viewed as rule-based programming.",
            "Typing constraint logic programs.",
            "Learning Hybrid Algorithms for Vehicle Routing Problems.",
            "A short bibliography of Alain Colmerauer.",
            "PhD theses surpervised by Alain Colmerauer."
        ]
    }
]