[
    {
        "name": "TSC",
        "year": "2022",
        "info": "Volume 15: 2022",
        "count": 43,
        "papers": [
            "A Lightweight Auditing Service for Shared Data with Secure User Revocation in Cloud Storage.",
            "Delta Debugging Microservice Systems with Parallel Optimization.",
            "MAGNETIC: Multi-Agent Machine Learning-Based Approach for Energy Efficient Dynamic Consolidation in Data Centers.",
            "Differential Privacy-Based Location Protection in Spatial Crowdsourcing.",
            "Ontology-Based Privacy Data Chain Disclosure Discovery Method for Big Data.",
            "Enabling Verifiable and Dynamic Ranked Search over Outsourced Data.",
            "Value-Based Analysis Framework of Crossover Service: A Case Study of New Retail in China.",
            "A Security Framework for Scientific Workflow Provenance Access Control Policies.",
            "Delay-Optimal Scheduling of VMs in a Queueing Cloud Computing System with Heterogeneous Workloads.",
            "Achieve Efficient and Verifiable Conjunctive and Fuzzy Queries over Encrypted Data in Cloud.",
            "Profit Maximization Incentive Mechanism for Resource Providers in Mobile Edge Computing.",
            "A Cooperative Coevolution Hyper-Heuristic Framework for Workflow Scheduling Problem.",
            "Server-Aided Fine-Grained Access Control Mechanism with Robust Revocation in Cloud Computing.",
            "Fast Multi-Criteria Service Selection for Multi-User Composite Applications.",
            "Delay-Sensitive and Availability-Aware Virtual Network Function Scheduling for NFV.",
            "BOEW: A Content-Based Image Retrieval Scheme Using Bag-of-Encrypted-Words in Cloud Computing.",
            "Ultra Lightweight Multiple-Time Digital Signature for the Internet of Things Devices.",
            "A General Performance and QoS Model for Distributed Software-Defined Environments.",
            "Novel Secure Outsourcing of Modular Inversion for Arbitrary and Variable Modulus.",
            "Two-Tier Matching Game in Small Cell Networks for Mobile Edge Computing.",
            "Cloud-Based Outsourcing for Enabling Privacy-Preserving Large-Scale Non-Negative Matrix Factorization.",
            "Trust-Based Scheduling Framework for Big Data Processing with MapReduce.",
            "Microservices Monitoring with Event Logs and Black Box Execution Tracing.",
            "Achieving One-Round Password-Based Authenticated Key Exchange over Lattices.",
            "A Novel Demand Dispatching Model for Autonomous On-Demand Services.",
            "DOPIV: Post-Quantum Secure Identity-Based Data Outsourcing with Public Integrity Verification in Cloud Storage.",
            "SEnD: A Social Network Friendship Enhanced Decentralized System to Circumvent Censorships.",
            "Dynamic Cluster-Based Flow Management for Software Defined Networks.",
            "Improving the Schedulability of Real-Time Tasks Using Fog Computing.",
            "A Self-Adaptive Service Discovery Model for Smart Cities.",
            "Context-Aware and Adaptive QoS Prediction for Mobile Edge Computing Services.",
            "A Novel Addressing and Routing Architecture for Cloud-Service Datacenter Networks.",
            "Nationality and Geolocation-Based Profiling in the Dark(Web).",
            "Secure Cloud Data Deduplication with Efficient Re-Encryption.",
            "A Granular SVM-Based Method for Top-N Web Services Recommendation.",
            "Auction-Based Resource Allocation Mechanism in Federated Cloud Environment: TARA.",
            "M-BSRM: Multivariate BayeSian Runtime QoS Monitoring Using Point Mutual Information.",
            "An Efficient, Fair, and Robust Image Pricing Mechanism for Crowdsourced 3D Reconstruction.",
            "ProDiff: A Process Difference Detection Method Based on Hierarchical Decomposition.",
            "Economically-Robust Dynamic Control of the Additive Manufacturing Cloud.",
            "iConSnap: An Incremental Continuous Snapshots System for Virtual Machines.",
            "A Comparative Measurement Study of Deep Learning as a Service Framework.",
            "Cryptographic Solutions for Cloud Storage: Challenges and Research Opportunities."
        ]
    },
    {
        "name": "TSC",
        "year": "2021",
        "info": "Volume 14: 2021",
        "count": 154,
        "papers": [
            "An Approximation Algorithm for Sharing-Aware Virtual Machine Revenue Maximization.",
            "An Availability Analysis Approach for Deployment Configurations of Containers.",
            "An Iterative Budget Algorithm for Dynamic Virtual Machine Consolidation Under Cloud Computing Environment.",
            "Analysis of the Comments on \"Identity-Based Distributed Provable Data Possession in Multicloud Storage\".",
            "CALM: Survivable Virtual Data Center Allocation in Cloud Networks.",
            "CASR-TSE: Context-Aware Web Services Recommendation for Modeling Weighted Temporal-Spatial Effectiveness.",
            "Certificateless Public Integrity Checking of Group Shared Data on Cloud Storage.",
            "Certification-Based Cloud Adaptation.",
            "Context-Aware Service Input Ranking by Learning from Historical Information.",
            "CryptCloud$^+$+: Secure and Expressive Data Access Control for Cloud Storage.",
            "Declarative Construction of Distributed Event-Driven IoT Services Based on IoT Resource Models.",
            "Evaluating High Availability-Aware Deployments Using Stochastic Petri Net Model and Cloud Scoring Selection Tool.",
            "GraphA: Efficient Partitioning and Storage for Distributed Graph Computation.",
            "Inference Attack-Resistant E-Healthcare Cloud System with Fine-Grained Access Control.",
            "Interactive Refactoring of Web Service Interfaces Using Computational Search.",
            "OSPN: Optimal Service Provisioning with Negotiation for Bag-of-Tasks Applications.",
            "Privacy-Preserving Linear Region Search Service.",
            "Privacy-Preserving Outsourced Clinical Decision Support System in the Cloud.",
            "Privacy-Preserving Task Recommendation Services for Crowdsourcing.",
            "RepNet: Cutting Latency with Flow Replication in Data Center Networks.",
            "SOLAR: Services-Oriented Deep Learning Architectures-Deep Learning as a Service.",
            "Supporting User Requirements and Preferences in Cloud Plan Selection.",
            "TARCO: Two-Stage Auction for D2D Relay Aided Computation Resource Allocation in HetNet.",
            "Web Service Interaction Modeling and Verification Using Recursive Composition Algebra.",
            "A Classification Based Web Service Selection Approach.",
            "A Dynamic Virtual Machine Placement and Migration Scheme for Data Centers.",
            "A Topic-Sensitive Method for Mashup Tag Recommendation Utilizing Multi-Relational Service Data.",
            "An Instance Reservation Framework for Cost Effective Services in Geo-Distributed Data Centers.",
            "ASSEMBLE: Attribute, Structure and Semantics Based Service Mapping Approach for Collaborative Business Process Development.",
            "CASO: Cost-Aware Secure Outsourcing of General Computational Problems.",
            "Cost-Aware Traffic Management Under Demand Uncertainty from a Colocation Data Center User's Perspective.",
            "Enabling Cloud Applications to Negotiate Multiple Resources in a Cost-Efficient Manner.",
            "Enabling Probabilistic Differential Privacy Protection for Location Recommendations.",
            "Estimating Global Completeness of Event Logs: A Comparative Study.",
            "Evolutionary Multi-Objective Optimization for Web Service Location Allocation Problem.",
            "Leveraging Official Content and Social Context to Recommend Software Documentation.",
            "Low-Cost Adaptive Monitoring Techniques for the Internet of Things.",
            "Mashup Recommendation by Regularizing Matrix Factorization with API Co-Invocations.",
            "Model-Based Big Data Analytics-as-a-Service: Take Big Data to the Next Level.",
            "Optimized Contract-Based Model for Resource Allocation in Federated Geo-Distributed Clouds.",
            "QoS-Aware Robotic Streaming Workflow Allocation in Cloud Robotics Systems.",
            "Replication Schemes for Highly Available Workflow Engines.",
            "sPARE: Partial Replication for Multi-Tier Applications in the Cloud.",
            "Toward a Smart Cloud: A Review of Fault-Tolerance Methods in Cloud Systems.",
            "Towards Optimal Request Mapping and Response Routing for Content Delivery Networks.",
            "User Grouping for Sharing Services with Capacity Limit.",
            "A Distributed Truthful Auction Mechanism for Task Allocation in Mobile Cloud Computing.",
            "Achieving Fairness-Aware Two-Level Scheduling for Heterogeneous Distributed Systems.",
            "Dependence-Based Data-Aware Process Conformance Checking.",
            "Distributed Pricing Policy for Cloud-Assisted Body-to-Body Networks with Optimal QoS and Energy Considerations.",
            "Efficient and Adaptive Procurement Protocol with Purchasing Privacy.",
            "Efficient Query of Quality Correlation for Service Composition.",
            "Elastic Provisioning of Stateful Telco Services in Mobile Cloud Networking.",
            "Evaluation of Opportunistic Service Provisioning with Ordered Chaining.",
            "Location-Based Web Service QoS Prediction via Preference Propagation to Address Cold Start Problem.",
            "Model Checking Based Web Service Verification: A Systematic Literature Review.",
            "Multi-Scale LSTM Model for BGP Anomaly Classification.",
            "Optimizing Autonomic Resources for the Management of Large Service-Based Business Processes.",
            "Privacy Preserving Location-Aware Personalized Web Service Recommendations.",
            "Quality and Profit Assured Trusted Cloud Federation Formation: Game Theory Based Approach.",
            "Robust and Reliable Process-Aware Information Systems.",
            "Scheduling Inter-Datacenter Video Flows for Cost Efficiency.",
            "Semantic-based Compound Keyword Search over Encrypted Cloud Data.",
            "Semantics Mining&Indexing-Based Rapid Web Services Discovery Framework.",
            "SEPDP: Secure and Efficient Privacy Preserving Provable Data Possession in Cloud Storage.",
            "Similarity-Maintaining Privacy Preservation and Location-Aware Low-Rank Matrix Factorization for QoS Prediction Based Web Service Recommendation.",
            "STAGER: Semantic-Based Framework for Generating Adapters of Service-Based Generic-API for Portable Cloud Applications.",
            "Towards Deadline Guaranteed Cloud Storage Services.",
            "Web Service Slicing: Intra and Inter-Operational Analysis to Test Changes.",
            "An Effective Classification-Based Framework for Predicting Cloud Capacity Demand in Cloud Services.",
            "An Analysis of Public REST Web Service APIs.",
            "Browser-Level Parallelism and Interactive Rendering APIs for Scalable Computation-Intensive SaaS: Application to Brain Diffusion MRI.",
            "Resource Aware Routing for Service Function Chains in SDN and NFV-Enabled Network.",
            "Towards Encrypted In-Network Storage Services with Secure Near-Duplicate Detection.",
            "Secure Data Group Sharing and Dissemination with Attribute and Time Conditions in Public Cloud.",
            "LKSM: Light Weight Key-Value Store for Efficient Application Services on Local Distributed Mobile Devices.",
            "Fair Task Allocation in Crowdsourced Delivery.",
            "Reputation Measurement for Online Services Based on Dominance Relationships.",
            "DP-LTOD: Differential Privacy Latent Trajectory Community Discovering Services over Location-Based Social Networks.",
            "Multiple Attributes QoS Prediction via Deep Neural Model with Contexts.",
            "Identity-Preserving Public Integrity Checking with Dynamic Groups for Cloud Storage.",
            "A Game-Based Price Bidding Algorithm for Multi-Attribute Cloud Resource Provision.",
            "X-Check: Improving Effectiveness and Efficiency of Cross-Browser Issues Detection for JavaScript-Based Web Applications.",
            "Mining Set of Interested Communities with Limited Exemplar Nodes for Network Based Services.",
            "Outsourcing Service Fair Payment Based on Blockchain and Its Applications in Cloud Computing.",
            "Uncertainty-Aware Online Scheduling for Real-Time Workflows in Cloud Service Environment.",
            "Synthesis of Regulation Compliant Business Processes.",
            "On QoE-Oriented Cloud Service Orchestration for Application Providers.",
            "Integrating Social Networks with Mobile Device-to-Device Services.",
            "Workflow Refactoring for Maximizing Concurrency and Block-Structuredness.",
            "Towards Green Service Composition Approach in the Cloud.",
            "PDLM: Privacy-Preserving Deep Learning Model on Cloud with Multiple Keys.",
            "A Location-Based Factorization Machine Model for Web Service QoS Prediction.",
            "A QoS-Based Splitting Strategy for a Resource Embedding Across Multiple Cloud Providers.",
            "Achieving Efficient and Privacy-Preserving Multi-Domain Big Data Deduplication in Cloud.",
            "Automated Validation of Compensable SLAs.",
            "Availability Evaluation of Multi-Tenant Service Function Chaining Infrastructures by Multidimensional Universal Generating Function.",
            "Covering-Based Web Service Quality Prediction via Neighborhood-Aware Matrix Factorization.",
            "Dynamic Trust Enforcing Pricing Scheme for Sensors-as-a-Service in Sensor-Cloud Infrastructure.",
            "Encryption Switching Service: Securely Switch Your Encrypted Data to Another Format.",
            "Exploiting Reliable and Scalable Multicast Services in IaaS Datacenters.",
            "HCache: A Hash-based Hybrid Caching Model for Real-Time Streaming Data Analytics.",
            "HMGOWM: A Hybrid Decision Mechanism for Automating Migration of Virtual Machines.",
            "Holistic VM Placement for Distributed Parallel Applications in Heterogeneous Clusters.",
            "Incentive Mechanism Design for Two-Layer Wireless Edge Caching Networks Using Contract Theory.",
            "Joint Computation Partitioning and Resource Allocation for Latency Sensitive Applications in Mobile Edge Clouds.",
            "Joint Scheduling of Overlapping MapReduce Phases: Pair Jobs for Optimization.",
            "Microservices: Migration of a Mission Critical System.",
            "Network Aware Mobile Edge Computation Partitioning in Multi-User Environments.",
            "On Cyber Risk Management of Blockchain Networks: A Game Theoretic Approach.",
            "Optimized Portfolio Contracts for Bidding the Cloud.",
            "PPFilter: Provider Privacy-Aware Encrypted Filtering System.",
            "Selecting Services for Multiple Users: Let's Be Democratic.",
            "Sifter: A Service Isolation Strategy for Internet Applications.",
            "Temporal Task Scheduling of Multiple Delay-Constrained Applications in Green Hybrid Cloud.",
            "Test-Oriented RESTful Service Discovery with Semantic Interface Compatibility.",
            "An Attention-Based Spatiotemporal LSTM Network for Next POI Recommendation.",
            "Analysis and Controlling of Manufacturing Service Ecosystem: A Research Framework Based on the Parallel System Theory.",
            "Delegated Authorization Framework for EHR Services Using Attribute-Based Encryption.",
            "Toward Intelligent Surveillance as an Edge Network Service (iSENSE) Using Lightweight Detection and Tracking Algorithms.",
            "Web Application Resource Requirements Estimation Based on the Workload Latent Features.",
            "A Guard-Driven Analysis Approach of Workflow Net with Data.",
            "A Learning Automata-Based Scheduling for Deadline Sensitive Task in The Cloud.",
            "A Secure Searchable Encryption Framework for Privacy-Critical Cloud Storage Services.",
            "Analysis of the Influence of Per-Second Billing on Virtual Machine Allocation Costs in Public Clouds.",
            "Auction-Based VM Allocation for Deadline-Sensitive Tasks in Distributed Edge Cloud.",
            "Defending N-Version Programming Service Components against Co-Resident Attacks in IoT Cloud Systems.",
            "Electricity Price-aware Consolidation Algorithms for Time-sensitive VM Services in Cloud Systems.",
            "Exploiting Heterogeneity for Opportunistic Resource Scaling in Cloud-Hosted Applications.",
            "Fitness-Aware Containerization Service Leveraging Machine Learning.",
            "Fog Computing Service Provision Using Bargaining Solutions.",
            "FogSpot: Spot Pricing for Application Provisioning in Edge/Fog Computing.",
            "HAP: A Hybrid QoS Prediction Approach in Cloud Manufacturing Combining Local Collaborative Filtering and Global Case-Based Reasoning.",
            "LA-LMRBF: Online and Long-Term Web Service QoS Forecasting.",
            "McTAR: A Multi-Trigger Checkpointing Tactic for Fast Task Recovery in MapReduce.",
            "Mining Batch Activation Rules from Event Logs.",
            "Monitoring-Aware Optimal Deployment for Applications Based on Microservices.",
            "MP-Coopetition: Competitive and Cooperative Mechanism for Multiple Platforms in Mobile Crowd Sensing.",
            "Practical Multi-Keyword and Boolean Search Over Encrypted E-mail in Cloud Server.",
            "Prediction of Cloud Resources Demand Based on Hierarchical Pythagorean Fuzzy Deep Neural Network.",
            "Privacy-Preserving Traffic Monitoring with False Report Filtering via Fog-Assisted Vehicular Crowdsensing.",
            "ProFact: A Provenance-Based Analytics Framework for Access Control Policies.",
            "Provable Data Possession with Outsourced Data Transfer.",
            "Secure and Verifiable Outsourcing of Large-Scale Nonnegative Matrix Factorization (NMF).",
            "Variation-Aware Cloud Service Selection via Collaborative QoS Prediction.",
            "QoS-Aware Dispersed Dynamic Mapping of Virtual Sensors in Sensor-Cloud.",
            "Scheduling Real-Time Security Aware Tasks in Fog Networks.",
            "Client-Side Service for Recommending Rewarding Routes to Mobile Crowdsourcing Workers.",
            "Computation Offloading in MIMO Based Mobile Edge Computing Systems Under Perfect and Imperfect CSI Estimation.",
            "Heterogeneous Computational Resource Allocation for C-RAN: A Contract-Theoretic Approach.",
            "Secure Channel Free Certificate-Based Searchable Encryption Withstanding Outside and Inside Keyword Guessing Attacks.",
            "Cybersecurity in Big Data Era: From Securing Big Data to Data-Driven Security.",
            "Demystifying Membership Inference Attacks in Machine Learning as a Service.",
            "Comments on \"SEPDP: Secure and Efficient Privacy Preserving Provable Data Possession in Cloud Storage\"."
        ]
    },
    {
        "name": "TSC",
        "year": "2020",
        "info": "Volume 13: 2020",
        "count": 92,
        "papers": [
            "Editorial.",
            "A Hybrid Bio-Inspired Algorithm for Scheduling and Resource Management in Cloud Environment.",
            "A Privacy-Preserving Localization Service for Assisted Living Facilities.",
            "A Semi-Automatic and Trustworthy Scheme for Continuous Cloud Service Certification.",
            "Assessing Invariant Mining Techniques for Cloud-Based Utility Computing Systems.",
            "Deadline Constrained Video Analysis via In-Transit Computational Environments.",
            "DLTSR: A Deep Learning Framework for Recommendations of Long-Tail Web Services.",
            "Game-Theoretic Resource Pricing and Provisioning Strategies in Cloud Systems.",
            "Integrated Content and Network-Based Service Clustering and Web APIs Recommendation for Mashup Development.",
            "Optimal Load Distribution for the Detection of VM-Based DDoS Attacks in the Cloud.",
            "Resource Renting for Periodical Cloud Workflow Applications.",
            "Shifting to Mobile: Network-Based Empirical Study of Mobile Vulnerability Market.",
            "TAFC: Time and Attribute Factors Combined Access Control for Time-Sensitive Data in Public Cloud.",
            "Traffic-Aware and Energy-Efficient vNF Placement for Service Chaining: Joint Sampling and Matching Approach.",
            "Virtual Machine Consolidation with Multiple Usage Prediction for Energy-Efficient Cloud Data Centers.",
            "Guest Editorial: Special Issue on Blockchain-Based Services Computing.",
            "A Service-Oriented Permissioned Blockchain for the Internet of Things.",
            "Chronos$^{{\\mathbf +}}$+: An Accurate Blockchain-Based Time-Stamping Scheme for Cloud Storage.",
            "Policy-Driven Blockchain and Its Applications for Transport Systems.",
            "A Hybrid BlockChain-Based Identity Authentication Scheme for Multi-WSN.",
            "Groupchain: Towards a Scalable Public Blockchain in Fog Computing of IoT Services Computing.",
            "DEAL: Differentially Private Auction for Blockchain-Based Microgrids Energy Trading.",
            "A Blockchain-Based Model for Cloud Service Quality Monitoring.",
            "Blockchain Empowered Arbitrable Data Auditing Scheme for Network Storage as a Service.",
            "BoR: Toward High-Performance Permissioned Blockchain in RDMA-Enabled Network.",
            "ContractGuard: Defend Ethereum Smart Contracts with Embedded Intrusion Detection.",
            "Blockchain-Based Object Name Service With Tokenized Authority.",
            "Decentralized Services Computing Paradigm for Blockchain-Based Data Governance: Programmability, Interoperability, and Intelligence.",
            "Cloud/Edge Computing Service Management in Blockchain Networks: Multi-Leader Multi-Follower Game-Based ADMM for Pricing.",
            "Scalable Discovery of Hybrid Process Models in a Cloud Computing Environment.",
            "Facilitating Application-Aware Bandwidth Allocation in the Cloud with One-Step-Ahead Traffic Information.",
            "A Framework of Hypergraph-Based Data Placement Among Geo-Distributed Datacenters.",
            "A Practical System for Privacy-Aware Targeted Mobile Advertising Services.",
            "Availability-Aware Virtual Cluster Allocation in Bandwidth-Constrained Datacenters.",
            "Deadline Flow Scheduling in Datacenters with Time-Varying Bandwidth Allocations.",
            "Dynamic Outsourced Auditing Services for Cloud Storage Based on Batch-Leaves-Authenticated Merkle Hash Tree.",
            "Flexible Wildcard Searchable Encryption System.",
            "Full Verifiability for Outsourced Decryption in Attribute Based Encryption.",
            "Mining Domain Knowledge on Service Goals from Textual Service Descriptions.",
            "Opportunistic Sharing of Continuous Mobile Sensing Data for Energy and Power Conservation.",
            "Pattern-Based Design and Verification of Secure Service Compositions.",
            "QoS Constrained Large Scale Web Service Composition Using Abstraction Refinement.",
            "Sorting of Fully Homomorphic Encrypted Cloud Data: Can Partitioning be Effective?",
            "Time Dependent Pricing for Large-Scale Mobile Networks of Urban Environment: Feasibility and Adaptability.",
            "VOD-ADAC: Anonymous Distributed Fine-Grained Access Control Protocol with Verifiable Outsourced Decryption in Public Cloud.",
            "What and With Whom? Identifying Topics in Twitter Through Both Interactions and Text.",
            "Holistic Technologies for Managing Internet of Things Services.",
            "ThinORAM: Towards Practical Oblivious Data Access in Fog Computing Environment.",
            "GUARDIAN: Blockchain-Based Secure Demand Response Management in Smart Grid System.",
            "An Energy-Efficient SDN Controller Architecture for IoT Networks With Blockchain-Based Security.",
            "Privacy in Data Service Composition.",
            "Buoy Sensor Cyberattack Detection in Offshore Petroleum Cyber-Physical Systems.",
            "Resilient Edge Data Management Framework.",
            "MMDP: A Mobile-IoT Based Multi-Modal Reinforcement Learning Service Framework.",
            "Personalized Recommendation System Based on Collaborative Filtering for IoT Scenarios.",
            "Improving Brain E-Health Services via High-Performance EEG Classification With Grouping Bayesian Optimization.",
            "An Efficient Resource Monitoring Service for Fog Computing Environments.",
            "A Cyclic Game for Service-Oriented Resource Allocation in Edge Computing.",
            "Towards Service Composition Aware Virtual Machine Migration Approach in the Cloud.",
            "Security-Critical Energy-Aware Task Scheduling for Heterogeneous Real-Time MPSoCs in IoT.",
            "IoT-Enabled Service for Crude-Oil Production Systems Against Unpredictable Disturbance.",
            "A Crowd-Sensing Framework for Allocation of Time-Constrained and Location-Based Tasks.",
            "A Reinforcement Learning Method for Constraint-Satisfied Services Composition.",
            "Customized Network Security for Cloud Service.",
            "Doris: An Adaptive Soft Real-Time Scheduler in Virtualized Environments.",
            "Energy-Aware Service Selection and Adaptation in Wireless Sensor Networks with QoS Guarantee.",
            "Making Neighbors Quiet: An Approach to Detect Virtual Resource Contention.",
            "Minimizing Data Access Latencies for Virtual Machine Assignment in Cloud Systems.",
            "Minimizing Redundancy to Satisfy Reliability Requirement for a Parallel Application on Heterogeneous Service-Oriented Systems.",
            "Mining Deficiencies of Online Reputation Systems: Methodologies, Experiments and Implications.",
            "Model-as-You-Go for Choreographies: Rewinding and Repeating Scientific Choreographies.",
            "Modeling Latent Relation to Boost Things Categorization Service.",
            "Providing Service Continuity in Clouds Under Power Outage.",
            "Research on the Architecture and its Implementation for Instrumentation and Measurement Cloud.",
            "SSL: A Surrogate-Based Method for Large-Scale Statistical Latency Measurement.",
            "Accelerating Skycube Computation with Partial and Parallel Processing for Service Selection.",
            "Attribute-Based Keyword Search over Hierarchical Data in Cloud Computing.",
            "Consistent State Updates for Virtualized Network Function Migration.",
            "Coordinating Workload Scheduling of Geo-Distributed Data Centers and Electricity Generation of Smart Grid.",
            "Decentralized Server-Aided Encryption for Secure Deduplication in Cloud Storage.",
            "Dynamic Multi-Phrase Ranked Search over Encrypted Data with Symmetric Searchable Encryption.",
            "Efficient QoS-Aware Service Recommendation for Multi-Tenant Service-Based Systems in Cloud.",
            "Electricity Cost Minimization for Interruptible Workload in Datacenter Servers.",
            "EliMFS: Achieving Efficient, Leakage-Resilient, and Multi-Keyword Fuzzy Search on Encrypted Cloud Data.",
            "ENORM: A Framework For Edge NOde Resource Management.",
            "Learning User Preference from Heterogeneous Information for Store-Type Recommendation.",
            "Location Recommendation for Enterprises by Multi-Source Urban Big Data Analysis.",
            "Minimal Fault-Tolerant Coverage of Controllers in IaaS Datacenters.",
            "Multi-Value-Independent Ciphertext-Policy Attribute Based Encryption with Fast Keyword Search.",
            "Secure and Efficient Cloud Data Deduplication with Ownership Management.",
            "Service Integrity Assurance for Distributed Computation Outsourcing.",
            "Understanding E-Commerce Systems under Massive Flash Crowd: Measurement, Analysis, and Implications."
        ]
    },
    {
        "name": "TSC",
        "year": "2019",
        "info": "Volume 12: 2019",
        "count": 76,
        "papers": [
            "Editorial.",
            "Guest Editor's Introduction: Special Section on Services and Software Engineering Towards Internetware.",
            "Programming Situational Mobile Web Applications with Cloud-Mobile Convergence: An Internetware-Oriented Approach.",
            "A Requirement-Driven Mechanism for the Management of Distributed Infrastructures.",
            "ROSF: Leveraging Information Retrieval and Supervised Learning for Recommending Code Snippets.",
            "Multi-Dimensional QoS Prediction for Service Recommendations.",
            "Storage Sharing Optimization Under Constraints of SLO Compliance and Performance Variability.",
            "Architecture-Based Behavioral Adaptation with Generated Alternatives and Relaxed Constraints.",
            "Guest Editor's Introduction: Special Section on Virtualization and Services for Cloud-Based Application Systems.",
            "Straggler Root-Cause and Impact Analysis for Massive-scale Virtualized Cloud Datacenters.",
            "Flow Classification for Software-Defined Data Centers Using Stream Mining.",
            "Cost-Efficient Consolidating Service for Aliyun's Cloud-Scale Computing.",
            "HyperCo: Optimizing Network Performance in ARM-Based Mobile Virtualization.",
            "A Cloud Brokerage Architecture for Efficient Cloud Service Selection.",
            "Multi-Objective Energy Efficient Virtual Machines Allocation at the Cloud Data Center.",
            "A Distributed Discovery of Communicating Resource Systems Models.",
            "A Hybrid Approach for Optimizing Carbon Footprint in InterCloud Environment.",
            "An Integrated Framework for Mining Temporal Logs from Fluctuating Events.",
            "CauseInfer: Automated End-to-End Performance Diagnosis with Hierarchical Causality Graph in Cloud Environment.",
            "Defending Against Flow Table Overloading Attack in Software-Defined Networks.",
            "Novel Artificial Bee Colony Algorithms for QoS-Aware Service Selection.",
            "QoS-Aware Service Selection Using an Incentive Mechanism.",
            "QoS-Aware Web Service Selection with Internal Complementarity.",
            "Transactional Behavior Verification in Business Process as a Service Configuration.",
            "Understanding Mobile Users' Privacy Expectations: A Recommendation-Based Method Through Crowdsourcing.",
            "Elastic Load Balancing for Dynamic Virtual Machine Reconfiguration Based on Vertical and Horizontal Scaling.",
            "Errata to \"Guest Editor's Introduction: Special Section on Virtualization and Services for Cloud-Based Application Systems\".",
            "Guest Editorial: Data-Centric Big Services.",
            "Lightweight Indexing and Querying Services for Big Spatial Data.",
            "Building and Querying an Enterprise Knowledge Graph.",
            "A Novel Workflow-Level Data Placement Strategy for Data-Sharing Scientific Cloud Workflows.",
            "SMS: A Framework for Service Discovery by Incorporating Social Media Information.",
            "Learning the Evolution Regularities for BigService-Oriented Online Reliability Prediction.",
            "Guest Editorial: Recent Advances in Web Services Research.",
            "EPICS: A Framework for Enforcing Security Policies in Composite Web Services.",
            "A Proof-of-Trust Consensus Protocol for Enhancing Accountability in Crowdsourcing Services.",
            "SeCo-LDA: Mining Service Co-Occurrence Topics for Composition Recommendation.",
            "When Human Service Meets Crowdsourcing: Emerging in Human Service Collaboration.",
            "Fairness-Efficiency Allocation of CPU-GPU Heterogeneous Resources.",
            "Social-Aware Data Dissemination via Device-to-Device Communications: Fusing Social and Mobile Networks with Incentive Constraints.",
            "An Effective Scheme for QoS Estimation via Alternating Direction Method-Based Matrix Factorization.",
            "AutoTune: Game-Based Adaptive Bitrate Streaming in Cloud-Based Hybrid VoD Systems.",
            "Efficient Provisioning of Security Service Function Chaining Using Network Security Defense Patterns.",
            "Energy and Migration Cost-Aware Dynamic Virtual Machine Consolidation in Heterogeneous Cloud Datacenters.",
            "Memory Partitioning and Management in Memcached.",
            "Minimizing Traffic Migration During Network Update in IaaS Datacenters.",
            "Optimizing Semantic Annotations for Web Service Invocation.",
            "Purpose-Based Privacy Preserving Access Control for Secure Service Provision and Composition.",
            "Security Middleground for Resource Protection in Measurement Infrastructure-as-a-Service.",
            "Towards Comprehensive Support for Privacy Preservation Cross-Organization Business Process Mining.",
            "Transformation-Based Streaming Workflow Allocation on Geo-Distributed Datacenters for Streaming Big Data Processing.",
            "Guest Editor's Introduction: Special Section on Fog/Edge Computing and Services.",
            "Server Placement and Selection for Edge Computing in the ePC.",
            "Adaptive Wireless Video Streaming Based on Edge Computing: Opportunities and Approaches.",
            "Latency-Driven Fog Cooperation Approach in Fog Radio Access Networks.",
            "Migration Modeling and Learning Algorithms for Containers in Fog Computing.",
            "Multi-User Multi-Task Computation Offloading in Green Mobile Edge Cloud Computing.",
            "A Double Deep Q-Learning Model for Energy-Efficient Edge Scheduling.",
            "Mobile Edge Provision with Flexible Deployment.",
            "Blockchain for Large-Scale Internet of Things Data Storage and Protection.",
            "Lightweight Fine-Grained Search Over Encrypted Data in Fog Computing.",
            "Privacy-Preserving Reputation Management for Edge Computing Enhanced Mobile Crowdsensing.",
            "Congestion-Minimizing Network Update in Data Centers.",
            "Enabling Semantic Search Based on Conceptual Graphs over Encrypted Outsourced Data.",
            "Incentive and Unconditionally Anonymous Identity-Based Public Provable Data Possession.",
            "A High-Reliability Multi-Faceted Reputation Evaluation Mechanism for Online Services.",
            "A Truthful and Fair Multi-Attribute Combinatorial Reverse Auction for Resource Procurement in Cloud Computing.",
            "An Adaptive Efficiency-Fairness Meta-Scheduler for Data-Intensive Computing.",
            "An Agent-Based Integrated Self-Evolving Service Composition Approach in Networked Environments.",
            "Clustering-Based Predictive Process Monitoring.",
            "Computational Experiment-Based Evaluation on Context-Aware O2O Service Recommendation.",
            "Distributed Multi-Dimensional Pricing for Efficient Application Offloading in Mobile Cloud Computing.",
            "Monitoring Interactions Across Multi Business Processes with Token Carried Data.",
            "MUIT: A Domain-Specific Language and its Middleware for Adaptive Mobile Web-Based User Interfaces in WS-BPEL.",
            "Topic-Based Influence Computation in Social Networks Under Resource Constraints.",
            "Probabilistic Modeling of Computing Demand for Service Level Agreement."
        ]
    },
    {
        "name": "TSC",
        "year": "2018",
        "info": "Volume 11: 2018",
        "count": 77,
        "papers": [
            "Editorial.",
            "An Inter-Cloud Meta-Scheduling (ICMS) Simulation Framework: Architecture and Evaluation.",
            "Fair Resource Allocation for Data-Intensive Computing in the Cloud.",
            "FUNNEL: Assessing Software Changes in Web-Based Services.",
            "Goal-Driven Service Composition in Mobile and Pervasive Computing.",
            "Hierarchical, Portfolio Theory-Based Virtual Machine Consolidation in a Compute Cloud.",
            "Imperfect Information Dynamic Stackelberg Game Based Resource Allocation Using Hidden Markov for Cloud Computing.",
            "Incentive Mechanism and Rating System Design for Crowdsourcing Systems: Analysis, Tradeoffs and Inference.",
            "iTune: Engineering the Performance of Xen Hypervisor via Autonomous and Dynamic Scheduler Reconfiguration.",
            "meGautz: A High Capacity, Fault-Tolerant and Traffic Isolated Modular Datacenter Network.",
            "Metaheuristic Optimization for Long-term IaaS Service Composition.",
            "MobiCoRE: Mobile Device Based Cloudlet Resource Enhancement for Optimal Task Response.",
            "Resource Dependency Processing in Web Scaling Frameworks.",
            "Scientific Workflow Clustering and Recommendation Leveraging Layer Hierarchical Analysis.",
            "Towards Trustworthy Multi-Cloud Services Communities: A Trust-Based Hedonic Coalitional Game.",
            "Crowdsourcing, Mixed Elastic Systems and Human-Enhanced Computing-A Survey.",
            "Static and Dynamic Process Change.",
            "Guest Editorial: A Roadmap for Mobile and Cloud Services for Digital Health.",
            "Adaptable Context-Aware Cooking-Safe System.",
            "A New Deep Learning-Based Food Recognition System for Dietary Assessment on An Edge Computing Service Infrastructure.",
            "RunnerPal: A Runner Monitoring and Advisory System Based on Smart Devices.",
            "Special Issue on Service-Oriented Collaborative Computing and Applications.",
            "Live Migration for Multiple Correlated Virtual Machines in Cloud-Based Data Centers.",
            "MLaaS: A Cloud-Based System for Delivering Adaptive Micro Learning in Mobile MOOC Learning.",
            "Knowledge-Based Resource Allocation for Collaborative Simulation Development in a Multi-Tenant Cloud Computing Environment.",
            "On Secure Wireless Communications for Service Oriented Computing.",
            "Cloud Workflow Scheduling with Deadlines and Time Slot Availability.",
            "Service-Oriented Feature-Based Data Exchange for Cloud-Based Design and Manufacturing.",
            "Cloud Service Description Model: An Extension of USDL for Cloud Services.",
            "Computational Experiment Research on the Equalization-Oriented Service Strategy in Collaborative Manufacturing.",
            "MobiGoal: Flexible Achievement of Personal Goals for Mobile Users.",
            "Probabilistic Time-Constrained Paths Search over Uncertain Road Networks.",
            "Secure Multi-Attribute One-to-Many Bilateral Negotiation Framework for E-Commerce.",
            "Elasticity in Cloud Computing: State of the Art and Research Challenges.",
            "Privacy in Web Service Transactions: A Tale of More than a Decade of Work.",
            "A Formal Model for Compliance Verification of Service Compositions.",
            "A Workflow Management System for Scalable Data Mining on Clouds.",
            "Covering the Sensitive Subjects to Protect Personal Privacy in Personalized Recommendation.",
            "Entropy-Based Scheduling Policy for Cross Aggregate Ranking Workloads.",
            "Full Solution Indexing for Top-K Web Service Composition.",
            "Modeling, Analysis, and Implementation of Universal Acceleration Platform Across Online Video Sharing Sites.",
            "Opportunistic Task Scheduling over Co-Located Clouds in Mobile Environment.",
            "A Taxonomy of Consistency Models in Dynamic Migration of Business Processes.",
            "Benchmarking Big Data Systems: A Review.",
            "Errata to \"Adaptable Context-Aware Cooking-Safe System\".",
            "Guest Editorial: Cloud Services Meet Big Data.",
            "Policy-Aware Service Composition: Predicting Parallel Execution Performance of Composite Services.",
            "Automated Testing of WS-BPEL Service Compositions: A Scenario-Oriented Approach.",
            "Efficient Dynamic Evolution of Service Composition.",
            "Effective BigData-Space Service Selection over Trust and Heterogeneous QoS Preferences.",
            "Secure Cloud Connectivity for Scientific Applications.",
            "Data-Driven and Feedback-Enhanced Trust Computing Pattern for Large-Scale Multi-Cloud Collaborative Services.",
            "Dynamic Proofs of Retrievability for Coded Cloud Storage Systems.",
            "A Data Set for User Request Trace-Oriented Monitoring and its Applications.",
            "Cost and Energy Aware Scheduling Algorithm for Scientific Workflows with Deadline Constraint in Clouds.",
            "A Genetic Algorithm Based Data Replica Placement Strategy for Scientific Applications in Clouds.",
            "Errata to \"Modeling, Analysis, and Implementation of Universal Acceleration Platform Across Online Video Sharing Sites\".",
            "Guest Editorial: Cloud Services Meet Big Data - Part II.",
            "Data-Driven Auction Mechanism Design in IaaS Cloud Computing.",
            "Hypervisor and Neighbors' Noise: Performance Degradation in Virtualized Environments.",
            "A Fuzzy Galois Lattices Approach to Requirements Elicitation for Cloud Services.",
            "Linking Issue Tracker with Q&A Sites for Knowledge Sharing across Communities.",
            "Privacy-Preserving Top-k Spatial Keyword Queries in Untrusted Cloud Environments.",
            "Efficient Keyword Searching in Large-Scale Social Network Service.",
            "Efficient and Exact Query of Large Process Model Repositories in Cloud Workflow Systems.",
            "Editorial Preface: Special Issue on Mobile & Cloud Computing Services.",
            "Performance Evaluation and Optimization of Multi-Dimensional Indexes in Hive.",
            "Cloud-Assisted Key Distribution in Batch for Secure Real-Time Mobile Services.",
            "When Privacy Meets Usability: Unobtrusive Privacy Permission Recommendation System for Mobile Apps Based on Crowdsourcing.",
            "Optimizing Elastic IoT Application Deployments.",
            "A Fund-Constrained Investment Scheme for Profit Maximization in Cloud Computing.",
            "CATrust: Context-Aware Trust Management for Service-Oriented Ad Hoc Networks.",
            "Preference-Based Spectrum Pricing in Dynamic Spectrum Access Networks.",
            "QoS Dependency Modeling for Composite Systems.",
            "User Differentiated Verifiable File Search on the Cloud.",
            "Predictive Monitoring of Business Processes: A Survey.",
            "Searchable Encryption for Healthcare Clouds: A Survey."
        ]
    },
    {
        "name": "TSC",
        "year": "2017",
        "info": "Volume 10: 2017",
        "count": 78,
        "papers": [
            "Serving the Services Computing Community.",
            "Editorial: A Message from the New Editor-in-Chief.",
            "Guest Editorial: Advances in Web Services Research.",
            "Software-Defined Service Networking: Performance Differentiation in Shared Multi-Tenant Cloud Applications.",
            "Towards Correct Cloud Resource Allocation in Business Processes.",
            "Towards Efficient and Truthful Market Mechanisms for Double-Sided Cloud Markets.",
            "Modeling Service Level Agreements with Linked USDL Agreement.",
            "On the Verification of Opacity in Web Services and Their Composition.",
            "SDA-CLOUD: A Multi-VM Architecture for Adaptive Dynamic Data Race Detection.",
            "Localizing Runtime Anomalies in Service-Oriented Systems.",
            "Web Service Compensation at Runtime: Formal Modeling and Verification Using the Event-B Refinement and Proof Based Formal Method.",
            "Querying Similar Process Models Based on the Hungarian Algorithm.",
            "Efficient Alignment Between Event Logs and Process Models.",
            "A Classroom Scheduling Service for Smart Classes.",
            "A New ADS-B Authentication Framework Based on Efficient Hierarchical Identity-Based Signature with Batch Verification.",
            "An Overview and Classification of Service Description Approaches in Automated Service Composition Research.",
            "Dynamic IaaS Computing Resource Provisioning Strategy with QoS Constraint.",
            "Dynamic Optimal Pricing for Heterogeneous Service-Oriented Architecture of Sensor-Cloud Infrastructure.",
            "Energy Efficient Scheduling and Management for Large-Scale Services Computing Systems.",
            "Multi-Objective Optimization in Dynamic Content Adaptation of Slide Documents.",
            "NCShield: Protecting Decentralized, Matrix Factorization-Based Network Coordinate Systems.",
            "On the Security of Data Access Control for Multiauthority Cloud Storage Systems.",
            "Online Virtual Machine Placement for Increasing Cloud Provider's Revenue.",
            "Question Quality Analysis and Prediction in Community Question Answering Services with Coupled Mutual Reinforcement.",
            "Resource Accounting of Shared IT Resources in Multi-Tenant Clouds.",
            "Using π-calculus for Formal Modeling and Verification of WS-CDL Choreographies.",
            "An Adaptive IO Prefetching Approach for Virtualized Data Centers.",
            "An Efficient Delta Synchronization Algorithm for Mobile Cloud Storage Applications.",
            "Collaborative Filtering Service Recommendation Based on a Novel Similarity Computation Method.",
            "Configuration Guidance Framework for Molecular Dynamics Simulations in Virtualized Clusters.",
            "Generalized Nash Equilibria for the Service Provisioning Problem in Multi-Cloud Systems.",
            "Joint Optimization of Resource Provisioning in Cloud Computing.",
            "Modelling and Implementing Social Community Clouds.",
            "Reliability Analysis of On-Demand Service-Based Software Systems Considering Failure Dependencies.",
            "Semantics-Enhanced Online Intellectual Capital Mining Service for Enterprise Customer Centers.",
            "Semi-Markov Models of Composite Web Services for their Performance, Reliability and Bottlenecks.",
            "Synthesizing Minimal Protocol Adaptors for Asynchronously Interacting Services.",
            "Computational Intelligence Based QoS-Aware Web Service Composition: A Systematic Literature Review.",
            "A Systematic Review of Bio-Inspired Service Concretization.",
            "CloudNetSim++: A GUI Based Framework for Modeling and Simulation of Data Centers in OMNeT++.",
            "Efficient and Scalable Query Authentication for Cloud-Based Storage Systems with Multiple Data Sources.",
            "Efficient Orchestration Mechanisms for Congestion Mitigation in NFV: Models and Algorithms.",
            "Hybrid Optimization Algorithm for Large-Scale QoS-Aware Service Composition.",
            "Improve Service Chaining Performance with Optimized Middlebox Placement.",
            "Integrating Trust with User Preference for Effective Web Service Composition.",
            "MacroServ: A Route Recommendation Service for Large-Scale Evacuations.",
            "Search-Based Web Service Antipatterns Detection.",
            "Self-Adaptive Trade-off Decision Making for Autoscaling Cloud-Based Services.",
            "Target-Based, Privacy Preserving, and Incremental Association Rule Mining.",
            "Towards Social-Aware Ridesharing Group Query Services.",
            "Trust-Based Service Composition and Binding with Multiple Objective Optimization in Service-Oriented Mobile Ad Hoc Networks.",
            "Editorial: Security and Dependability of Cloud Systems and Services.",
            "RepCloud: Attesting to Cloud Service Dependency.",
            "A Trust Label System for Communicating Trust in Cloud Services.",
            "Dynamic-Hash-Table Based Public Auditing for Secure Cloud Storage.",
            "KSF-OABE: Outsourced Attribute-Based Encryption with Keyword Search Function for Cloud Storage.",
            "SecRBAC: Secure data in the Clouds.",
            "Automatically Enforcing Security SLAs in the Cloud.",
            "An Efficient Privacy-Preserving Outsourced Computation over Public Data.",
            "Enumerating Maximal Bicliques from a Large Graph Using MapReduce.",
            "Flexible and Fine-Grained Attribute-Based Data Storage in Cloud Computing.",
            "mCloud: A Context-Aware Offloading Framework for Heterogeneous Mobile Cloud.",
            "Privacy-Preserving Location Sharing Services for Social Networks.",
            "Publicly Verifiable Inner Product Evaluation over Outsourced Data Streams under Multiple Keys.",
            "Guest Editorial: In Search of a New Alignment in Service Research-Dual-Journal Special Sections.",
            "Service Pattern: An Integrated Business Process Model for Modern Service Industry.",
            "Facilitating Cloud Process Family Co-Evolution by Reusable Process Plug-in: An Open-source Prototype.",
            "CBL: Exploiting Community Based Locality for Efficient Content Search Service in Online Social Networks.",
            "Logistic Support Architecture with Petri Net Design in Cloud Environment for Services and Profit Optimization.",
            "Emerging Service Orchestration Discovery and Monitoring.",
            "Cloud Service Reliability Enhancement via Virtual Machine Placement Optimization.",
            "Efficient Role Mining for Context-Aware Service Recommendation Using a High-Performance Cluster.",
            "Editorial: Security and Dependability of Cloud Systems and Services - Part II.",
            "Cost Effective, Reliable and Secure Workflow Deployment over Federated Clouds.",
            "Risk Assessment in a Sensor Cloud Framework Using Attack Graphs.",
            "A Context-Aware Architecture Supporting Service Availability in Mobile Cloud Computing.",
            "Reliable Computing Service in Massive-Scale Systems through Rapid Low-Cost Failover.",
            "Failure Analysis and Prediction for Big-Data Systems."
        ]
    },
    {
        "name": "TSC",
        "year": "2016",
        "info": "Volume 9: 2016",
        "count": 82,
        "papers": [
            "Editorial: Services Computing in 2016.",
            "Editorial Preface: Special Issue on Big Data Analytics, Infrastructure, and Applications.",
            "Dynamic Job Ordering and Slot Configurations for MapReduce Workloads.",
            "Trust-but-Verify: Verifying Result Correctness of Outsourced Frequent Itemset Mining in Data-Mining-As-a-Service Paradigm.",
            "Accelerated PSO Swarm Search Feature Selection for Data Stream Mining Big Data.",
            "Processing Cassandra Datasets with Hadoop-Streaming Based Approaches.",
            "Supporting Multi Data Stores Applications in Cloud Environments.",
            "Skyline Discovery and Composition of Multi-Cloud Mashup Services.",
            "BeTL: MapReduce Checkpoint Tactics Beneath the Task Level.",
            "Dynamic Virtual Chunks: On Supporting Efficient Accesses to Compressed Scientific Data.",
            "Distributed Maximal Clique Computation and Management.",
            "A Configuration-Independent Score-Based Benchmark for Distributed Databases.",
            "Towards Achieving Data Security with the Cloud Computing Adoption Framework.",
            "Common Pitfalls of Benchmarking Big Data Systems.",
            "Deep Computation Model for Unsupervised Feature Learning on Big Data.",
            "Guest Editorial: Special Issue on Cyber-Physical Systems and Services.",
            "Uncertainty Analysis of Middleware Services for Streaming Smart Grid Applications.",
            "Service Pricing Decision in Cyber-Physical Systems: Insights from Game Theory.",
            "SEED: A Scalable Approach for Cyber-Physical System Simulation.",
            "A Chemistry-Inspired Workflow Management System for Decentralizing Workflow Execution.",
            "A Semi-Automatic Approach of Transforming Applications to be Multi-Tenancy Enabled.",
            "CDA Generation and Integration for Health Information Exchange Based on Cloud Computing System.",
            "Heuristics for Provisioning Services to Workflows in XaaS Clouds.",
            "Multi-Phase Ant Colony System for Multi-Party Data-Intensive Service Provision.",
            "Robust Service Compositions with Functional and Location Diversity.",
            "Service Selection for Composition with QoS Correlations.",
            "Towards Relevancy Aware Service Oriented Systems in WSNs.",
            "Trustworthy Stigmergic Service Compositionand Adaptation in Decentralized Environments.",
            "A Multilevel Index Model to Expedite Web Service Discovery and Composition in Large-Scale Service Repositories.",
            "A Trusted IaaS Environment with Hardware Security Module.",
            "An Efficient Algorithm for the Bursting of Service-Based Applications in Hybrid Clouds.",
            "Kriging-Based Self-Adaptive Cloud Controllers.",
            "Long-Term QoS-Aware Cloud Service Composition Using Multivariate Time Series Analysis.",
            "Mobility-Enabled Service Selection for Composite Services.",
            "Modeling Active Virtual Machines on IaaS Clouds Using an M/G/m/m+K Queue.",
            "Online Energy Budgeting for Cost Minimization in Virtualized Data Center.",
            "Online Learning in Large-Scale Contextual Recommender Systems.",
            "Performance and Cost-Effectiveness Analyses for Cloud Services Based on Rejected and Impatient Users.",
            "Refactor Business Process Models with Maximized Parallelism.",
            "Scalable Process Discovery Using Map-Reduce.",
            "Trust Management for SOA-Based IoT and Its Application to Service Composition.",
            "A Feature-Based Framework for Developing and Provisioning Customizable Web Services.",
            "A Highly Accurate Prediction Algorithm for Unknown Web Service QoS Values.",
            "An Approach to Computation of Similarity, Inter-Cluster Distance and Selection of Threshold for Service Discovery Using Clusters.",
            "An Integrated Semantic Web Service Discovery and Composition Framework.",
            "Automatic Web Service Composition Based on Uncertainty Execution Effects.",
            "Diversifying Web Service Recommendation Results via Exploring Service Usage History.",
            "OMI-DL: An Ontology Matching Framework.",
            "Rescue Wings: Mobile Computing and Active Services Support for Disaster Rescue.",
            "SmartCrawler: A Two-Stage Crawler for Efficiently Harvesting Deep-Web Interfaces.",
            "The Use of Ubiquitous Computing for Business Process Improvement.",
            "TICRec: A Probabilistic Framework to Utilize Temporal Influence Correlations for Time-Aware Location Recommendations.",
            "VerChor: A Framework for the Design and Verification of Choreographies.",
            "Services Computing: From Cloud Services, Mobile Services to Internet of Services.",
            "Modern Service Industry and Crossover Services: Development and Trends in China.",
            "Fast Service Process Fragment Indexing and Ranking.",
            "Location-Aware and Personalized Collaborative Filtering for Web Service Recommendation.",
            "Optimization of Complex Elastic Processes.",
            "Process Discovery from Dependence-Complete Event Logs.",
            "Web Scaling Frameworks for Web Services in the Cloud.",
            "Editorial: Software Engineering and Applications for Cloud-Based Mobile Systems.",
            "FLANDROID: Energy-Efficient Recommendations of Reliable Context Providers for Android Applications.",
            "Mobile Medical Data Synchronization on Cloud-Powered Middleware Platform.",
            "Query Expansion Based on Crowd Knowledge for Code Search.",
            "Special Issue on Mobile Big Data Management and Innovative Applications.",
            "GroRec: A Group-Centric Intelligent Recommender System Integrating Social, Mobile and Big Data Technologies.",
            "Big Data Driven Mobile Traffic Understanding and Forecasting: A Time Series Approach.",
            "Big Data-Driven Service Composition Using Parallel Clustered Particle Swarm Optimization in Mobile Environment.",
            "On Improving Constrained Single and Group Operator Placement Using Evictions in Big Data Environments.",
            "A Co-Training Strategy for Multiple View Clustering in Process Mining.",
            "A Location- and Diversity-Aware News Feed System for Mobile Users.",
            "A New Approach to the Cloud-Based Heterogeneous MapReduce Placement Problem.",
            "A Unified Business-Driven Cloud Management Framework.",
            "Adaptive Service Selection According to the Service Density in Multiple Qos Aspects.",
            "Auction Mechanisms Toward Efficient Resource Sharing for Cloudlets in Mobile Cloud Computing.",
            "BGM-BLA: A New Algorithm for Dynamic Migration of Virtual Machines in Cloud Computing.",
            "Minimizing Content Reorganization and Tolerating Imperfect Workload Prediction for Cloud-Based Video-on-Demand Services.",
            "Role-Based Integrated Access Control and Data Provenance for SOA Based Net-Centric Systems.",
            "The Tomaco Hybrid Matching Framework for SAWSDL Semantic Web Services.",
            "Trust and Reputation of Web Services Through QoS Correlation Lens.",
            "VMCD: A Virtual Multi-Channel Disk I/O Scheduling Method for Virtual Machines.",
            "Comments on \"Identity-Based Distributed Provable Data Possession in Multicloud Storage\"."
        ]
    },
    {
        "name": "TSC",
        "year": "2015",
        "info": "Volume 8: 2015",
        "count": 76,
        "papers": [
            "Editorial: Service Computing in 2015.",
            "Data-Driven Composition for Service-Oriented Situational Web Applications.",
            "Decentralized Plan-Free Semantic-Based Service Composition in Mobile Networks.",
            "Defects per Million Computation in Service-Oriented Environments.",
            "Designing High Performance Web-Based Computing Services to Promote Telemedicine Database Management System.",
            "MonPaaS: An Adaptive Monitoring Platformas a Service for Cloud Computing Infrastructures and Services.",
            "Network and QoS-Based Selection of Complementary Services.",
            "Panda: Public Auditing for Shared Data with Efficient User Revocation in the Cloud.",
            "Requirements-Driven Self-Optimization of Composite Services Using Feedback Control.",
            "Scalable Transaction Management with Snapshot Isolation for NoSQL Data Storage Systems.",
            "Service Outsourcing with Process Views.",
            "Tunable Version Control System for Virtual Machines in an Open-Source Cloud.",
            "Services in the Cloud.",
            "Task Scheduling with Dynamic Voltage and Frequency Scaling for Energy Minimization in the Mobile Cloud Computing Environment.",
            "Using Ant Colony System to Consolidate VMs for Green Cloud Computing.",
            "Selecting Optimum Cloud Availability Zones by Learning User Satisfaction Levels.",
            "PriDyn: Enabling Differentiated I/O Services in Cloud Using Dynamic Priorities.",
            "Design Support for Performance Aware Dynamic Application (Re-)Distribution in the Cloud.",
            "A Framework for Composing SOAP, Non-SOAP and Non-Web Services.",
            "A Real-Time Group Auction System for Efficient Allocation of Cloud Internet Applications.",
            "Assessing and Comparing Vulnerability Detection Tools for Web Services: Benchmarking Approach and Examples.",
            "Constructing a Global Social Service Network for Better Quality of Web Service Discovery.",
            "Coverage-Based Testing for Service Level Agreements.",
            "Governance Model for Cloud Computing in Building Information Management.",
            "Identity-Based Distributed Provable Data Possession in Multicloud Storage.",
            "Emerging Web Services.",
            "Automatic Reuse of User Inputs to Services among End-Users in Service Composition.",
            "Time-Aware Service Recommendation for Mashup Creation.",
            "CCCloud: Context-Aware and Credible Cloud Service Selection Based on Subjective Assessment and Objective Assessment.",
            "A Partial Selection Methodology for Efficient QoS-Aware Service Composition.",
            "Towards Operational Cost Minimization in Hybrid Clouds for Dynamic Resource Provisioning with Delay-Aware Optimization.",
            "Quality of Experience: User's Perception about Web Services.",
            "Guest Editorial: Recommendation Techniques for Services Computing and Cloud Computing.",
            "Prediction of Atomic Web Services Reliability for QoS-Aware Recommendation.",
            "ReputationNet: Reputation-Based Service Recommendation for e-Science.",
            "Unified Collaborative and Content-Based Web Service Recommendation.",
            "Service Selection for Web Services with Probabilistic QoS.",
            "Service Selection with Runtime Aspects: A Hierarchical Approach.",
            "Model-Based Automated Navigation and Composition of Complex Service Mashups.",
            "Environment-Aware Virtual Slice Provisioning in Green Cloud Environment.",
            "An Efficient Approach to Generating Location-Sensitive Recommendations in Ad-hoc Social Network Environments.",
            "A Framework for Consumer-Centric SLA Management of Cloud-Hosted Databases.",
            "Cohesion-Driven Decomposition of Service Interfaces without Access to Source Code.",
            "Control of Large-Scale Systems through Dimension Reduction.",
            "Dynamic Test Reconfigurationfor Composite Web Services.",
            "Efficient Community Formation for Web Services.",
            "From RBAC to ABAC: Constructing Flexible Data Access Control for Cloud Storage Services.",
            "Network Aware Scheduling for Virtual Machine Workloads with Interference Models.",
            "Network-Aware QoS Prediction for Service Composition Using Geolocation.",
            "A Performance Model for the Web Service Protocol Stacks.",
            "A Subsumption Hierarchy of Test Case Prioritization for Composite Services.",
            "Category-Aware API Clustering and Distributed Recommendation for Automatic Mashup Creation.",
            "Cloud Computing Service: The Caseof Large Matrix Determinant Computation.",
            "iGeoRec: A Personalized and Efficient Geographical Location Recommendation Framework.",
            "LITMUS: A Multi-Service Composition System for Landslide Detection.",
            "Personalized Decision-Strategy based Web Service Selection using a Learning-to-Rank Algorithm.",
            "Preemptive Regression Testingof Workflow-Based Web Services.",
            "Reputation Measurement and Malicious Feedback Rating Prevention in Web Service Recommendation Systems.",
            "Spot Transit: Cheaper Internet Transit for Elastic Traffic.",
            "Time Aware and Data Sparsity Tolerant Web Service Recommendation Based on Improved Collaborative Filtering.",
            "Typetheoretic Approach to the Shimming Problem in Scientific Workflows.",
            "Processes Meet Big Data: Connecting Data Science with Process Science.",
            "Multilevel Process Mining for Financial Audits.",
            "Online Discovery of Declarative Process Models from Event Streams.",
            "Event Correlation Analytics: Scaling Process Mining Using Mapreduce-Aware Event Correlation Discovery Techniques.",
            "Discovering Interacting Artifacts from ERP Systems.",
            "An Automated Approach for Assisting the Design of Configurable Process Models.",
            "A Dataflow-Pattern-Based Recommendation Framework for Data Service Mashup.",
            "Analysis of Technology Trends Basedon Diverse Data Sources.",
            "Collaborative Agents for Distributed Load Management in Cloud Data Centers Using Live Migration of Virtual Machines.",
            "A Service Framework for Scientific Workflow Management in the Cloud.",
            "Application Portability in Cloud Computing: An Abstraction-Driven Perspective.",
            "Business Process Regulatory Compliance is Hard.",
            "Enabling Multi-Tenancy via Middleware-Level Virtualization with Organization Management in the Cloud of Things.",
            "Provable Storage Medium for Data Storage Outsourcing.",
            "Comments on a Public Auditing Mechanism for Shared Cloud Data Service."
        ]
    },
    {
        "name": "TSC",
        "year": "2014",
        "info": "Volume 7: 2014",
        "count": 56,
        "papers": [
            "Editorial: Farewell 2013, Welcome 2014.",
            "Confucius: A Tool Supporting Collaborative Scientific Workflow Composition.",
            "QoS-Aware Dynamic Composition of Web Services Using Numerical Temporal Planning.",
            "Investigating QoS of Real-World Web Services.",
            "A Bare-Metal and Asymmetric Partitioning Approach to Client Virtualization.",
            "Prioritizing Test Cases for Regression Testing of Location-Based Services: Metrics, Techniques, and Case Study.",
            "A Technique for Deploying Robust Web Services.",
            "A Scalable Architecture for Automatic Service Composition.",
            "Licit: Administering Usage Licenses in Federated Environments.",
            "Automating Cloud Services Life Cycle through Semantic Technologies.",
            "A Novel Time-Obfuscated Algorithm for Trajectory Privacy Protection.",
            "An Empirical Study of Error Patterns in Industrial Business Process Models.",
            "Commitments to Regulate Social Web Services Operation.",
            "Comprehensive Explanation of SLA Violations at Runtime.",
            "Decentralized Enactment of BPEL Processes.",
            "Introducing Replaceability into Web Service Composition.",
            "Privacy-Enhanced Web Service Composition.",
            "Reliability-Based Design Optimization for Cloud Migration.",
            "Satisfiability Analysis of Workflows with Control-Flow Patterns and Authorization Constraints.",
            "Scalable and Accurate Prediction of Availability of Atomic Web Services.",
            "Service Identification in Interorganizational Process Design.",
            "Towards Efficient Virtual Appliance Delivery with Minimal Manageable Virtual Appliances.",
            "Variations in Performance and Scalability: An Experimental Study in IaaS Clouds Using Multi-Tier Workloads.",
            "Workload Analysis, Implications, and Optimization on a Production Hadoop Cluster: A Case Study on Taobao.",
            "Some Complexity Results for the Soundness Problem of Workflow Nets.",
            "Guest Editorial: Special Issue on Clouds for Social Computing.",
            "Trustworthy Distributed Computing on Social Networks.",
            "An Optimized Computational Model for Multi-Community-Cloud Social Collaboration.",
            "A Social Compute Cloud: Allocating and Sharing Infrastructure Resources via Social Networks.",
            "An Anonymous End-to-End Communication Protocol for Mobile Cloud Environments.",
            "OmniSuggest: A Ubiquitous Cloud-Based Context-Aware Recommendation System for Mobile Social Networks.",
            "Computing Refined Ordering Relations with Uncertainty for Acyclic Process Models.",
            "Mining Contracts for Business Events and Temporal Constraints in Service Engagements.",
            "Power-Aware Cloud Metering.",
            "SanGA: A Self-Adaptive Network-Aware Approach to Service Composition.",
            "SLA-Based Resource Provisioning for Hosted Software-as-a-Service Applications in Cloud Computing Environments.",
            "Towards Complex Event Aware Services as Part of SOA.",
            "Verification of Change in a Fragmented Event-Based Process Coordination Environment.",
            "Verification of Semantic Web Service Annotations Using Ontology-Based Partitioning.",
            "Editorial: Service Computing in the Next Seven Years.",
            "Automated Analysis of Conflicts in WS-Agreement.",
            "Cooperative Virtual Machine Management in Smart Grid Environment.",
            "Cost Optimization of Elasticity Cloud Resource Subscription Policy.",
            "Improving Heterogeneous SOA-Based IoT Message Stability by Shortest Processing Time Scheduling.",
            "Instant Recommendation for Web Services Composition.",
            "Modeling and Analysis of Dependability Attributes for Services Computing Systems.",
            "Novel Optimal and Scalable Nonfunctional Service Matchmaking Techniques.",
            "On the Conceptualization of Performance Evaluation of IaaS Services.",
            "Opportunistic Service Composition in Dynamic Ad Hoc Environments.",
            "Probabilistic Matchmaking Methods for Automated Service Discovery.",
            "Stochastic Model Driven Capacity Planning for an Infrastructure-as-a-Service Cloud.",
            "Top K Query for QoS-Aware Automatic Service Composition.",
            "Towards Efficient Authenticated Subgraph Query Service in Outsourced Graph Databases.",
            "Using Parametric Models to Represent Private Cloud Workloads.",
            "A Survey of Cloud-Based Service Computing Solutions for Mammalian Genomics.",
            "A Novel Approach to Mapped Correlation of ID for RFID Anti-Collision."
        ]
    },
    {
        "name": "TSC",
        "year": "2013",
        "info": "Volume 6: 2013",
        "count": 45,
        "papers": [
            "Editorial: Farewell and introduction to the new editor-in-chief.",
            "Editorial: A message from the new Editor-in-Chief.",
            "Introduction of new Associate Editors.",
            "Effective Message-Sequence Generation for Testing BPEL Programs.",
            "QoS-Driven Service Composition with Reconfigurable Services.",
            "Personalized QoS-Aware Web Service Recommendation and Visualization.",
            "Performance Analysis of Network I/O Workloads in Virtualized Data Centers.",
            "A Decentralized Service Discovery Approach on Peer-to-Peer Networks.",
            "A Bayesian Network-Based Knowledge Engineering Framework for IT Service Management.",
            "An Enterprise Ontology-Based Approach to Service Specification.",
            "Ev-LCS: A System for the Evolution of Long-Term Composed Services.",
            "A Two-Tiered On-Demand Resource Allocation Mechanism for VM-Based Data Centers.",
            "Dynamic Service Contract Enforcement in Service-Oriented Networks.",
            "Finding the Optimal Social Trust Path for the Selection of Trustworthy Service Providers in Complex Social Networks.",
            "Budget Strategy in Uncertain Environments of Search Auctions: A Preliminary Investigation.",
            "Artificial Societies, Computational Experiments, and Parallel Systems: An Investigation on a Computational Theory for Complex Socioeconomic Systems.",
            "Formal Design and Verification of Long-Running Transactions with Extensible Coordination Tools.",
            "A Generic Query Model for the Unified Discovery of Heterogeneous Services.",
            "Message-Efficient Service Management Schemes for MOM-Based UPnP Networks.",
            "Dynamic Audit Services for Outsourced Storages in Clouds.",
            "Cost-Based Optimization of Service Compositions.",
            "Evolution of Social Networks Based on Tagging Practices.",
            "Toward Trustworthy Coordination of Web Services Business Activities.",
            "Collaborative Web Service QoS Prediction via Neighborhood Integrated Matrix Factorization.",
            "THEMIS: A Mutually Verifiable Billing System for the Cloud Computing Environment.",
            "Who Is Your Neighbor: Net I/O Performance Interference in Virtualized Clouds.",
            "Security-Aware Service Composition with Fine-Grained Information Flow Control.",
            "A Novel Process Network Model for Interacting Context-Aware Web Services.",
            "A Collaborative and Scalable Platform for On-Demand IPTV Services.",
            "QoS Analysis for Web Service Compositions with Complex Structures.",
            "Coalitional Game for Community-Based Autonomous Web Services Cooperation.",
            "A Web Service Framework Supporting Multimedia Streaming.",
            "Optimizing Service Selection and Allocation in Situational Computing Applications.",
            "Generalized Nash Equilibria for the Service Provisioning Problem in Cloud Systems.",
            "Simulating Service-Oriented Systems: A Survey and the Services-Aware Simulation Framework.",
            "A Fully Distributed Scheme for Discovery of Semantic Relationships.",
            "Cost and Accuracy Aware Scientific Workflow Composition for Service-Oriented Environments.",
            "Efficient Selection of Process Mining Algorithms.",
            "A Methodology for Evolving E-Contracts Using Templates.",
            "Parametric Design and Performance Analysis of a Decoupled Service-Oriented Prediction Framework Based on Embedded Numerical Software.",
            "Service Mining: Using Process Mining to Discover, Check, and Improve Service Behavior.",
            "A Formal Engineering Framework for Service-Based Software Modeling.",
            "Proxy Provable Data Possession in Public Clouds.",
            "Robust Dynamic Service Composition in Sensor Networks.",
            "Personalized Web Service Recommendation via Normal Recovery Collaborative Filtering."
        ]
    },
    {
        "name": "TSC",
        "year": "2012",
        "info": "Volume 5: 2012",
        "count": 43,
        "papers": [
            "Editorial: Moving to the Fifth Year of TSC.",
            "Energy-Aware Autonomic Resource Allocation in Multitier Virtualized Environments.",
            "Dynamic Authentication for Cross-Realm SOA-Based Business Processes.",
            "Bootstrapping Ontologies for Web Services.",
            "A Dataflow-Based Scientific Workflow Composition Framework.",
            "Using Rules and Data Dependencies for the Recovery of Concurrent Processes in a Service-Oriented Environment.",
            "Reducing Adapter Synthesis to Controller Synthesis.",
            "ubiSOAP: A Service-Oriented Middleware for Ubiquitous Networking.",
            "A Proxy-Based Architecture for Dynamic Discovery and Invocation of Web Services from Mobile Devices.",
            "Collaborative Testing of Web Services.",
            "RLM: A General Model for Trust Representation and Aggregation.",
            "Correction to \"The Integration of Corporate Security Strategies in Collaborative Business Processes\".",
            "Guest Editorial: Special Section on Enforcement and Management in Services Computing.",
            "Adaptive SOA Solution Stack.",
            "Optimization of Resource Provisioning Cost in Cloud Computing.",
            "Query Access Assurance in Outsourced Databases.",
            "Runtime Enforcement of Web Service Message Contracts with Data.",
            "TiCoBTx-Net: A Model to Manage Temporal Consistency of Service-Oriented Business Collaboration.",
            "Toward Secure and Dependable Storage Services in Cloud Computing.",
            "Expert Discovery and Interactions in Mixed Service-Oriented Systems.",
            "Business-OWL (BOWL) - A Hierarchical Task Network Ontology for Dynamic Business Process Decomposition and Formulation.",
            "Semantics-Based Automated Service Discovery.",
            "A Model for Checking Contractual Compliance of Business Interactions.",
            "Realizability of Choreographies Using Process Algebra Encodings.",
            "Specifying and Verifying Cross-Organizational Business Models: An Agent-Oriented Approach.",
            "An Integrated Approach to Automated Semantic Web Service Composition through Planning.",
            "Mining Business Contracts for Service Exceptions.",
            "Hierarchical Online Problem Classification for IT Support Services.",
            "E³: A Multiobjective Optimization Framework for SLA-Aware Service Composition.",
            "Service-Oriented Architecture for High-Dimensional Private Data Mashup.",
            "SOAP Processing Performance and Enhancement.",
            "Probabilistic Resource Space Model for Managing Resources in Cyber-Physical Society.",
            "Port-Based Reliability Computing for Service Composition.",
            "Reducing Data Transfer in Service-Oriented Architectures: The Circulate Approach.",
            "Enterprise Service Bus Monitoring Framework for SOA Systems.",
            "A Trusted Virtual Machine in an Untrusted Management Environment.",
            "VNsnap: Taking Snapshots of Virtual Networked Infrastructures in the Cloud.",
            "Resource Provisioning with Budget Constraints for Adaptive Applications in Cloud Environments.",
            "Monetary Cost-Aware Checkpointing and Migration on Amazon Cloud Spot Instances.",
            "CloudTPS: Scalable Transactions for Web Applications in the Cloud.",
            "Component Ranking for Fault-Tolerant Cloud Applications.",
            "Social Cloud Computing: A Vision for Socially Motivated Resource Sharing.",
            "Agent-Based Cloud Computing."
        ]
    },
    {
        "name": "TSC",
        "year": "2011",
        "info": "Volume 4: 2011",
        "count": 30,
        "papers": [
            "EIC Editorial: Application-Driven Management of Service Systems.",
            "Service-Centric Framework for a Digital Government Application.",
            "Monitoring Service Systems from a Language-Action Perspective.",
            "An Adaptive and Intelligent SLA Negotiation System for Web Services.",
            "Exploiting Mobility Prediction for Dependable Service Composition in Wireless Mobile Ad Hoc Networks.",
            "Automatic Generation of Service Availability Models.",
            "A Delegation Solution for Universal Identity Management in SOA.",
            "Editorial: Quality-Driven Service and Workflow Management.",
            "Addressing Dependability throughout the SOA Life Cycle.",
            "Expressive and Deployable Access Control in Open Web Service Applications.",
            "Automatic (Re)Configuration of IT Systems for Dependability.",
            "Robust Execution of Service Workflows Using Redundancy and Advance Reservations.",
            "QoS-Aware Web Service Recommendation by Collaborative Filtering.",
            "A Formal Approach Enabling Risk-Aware Business Process Modeling and Simulation.",
            "Transaction Management in Service-Oriented Systems: Requirements and a Proposal.",
            "Guest Editorial: Services Composition and Virtualization Technologies.",
            "Toward Reliable Service Management in Message-Oriented Pervasive Systems.",
            "Parallel Mapping with Time Optimization for SLA-Aware Compositional Services in the Business Grid.",
            "Scheduling of Computing Services on Intranet Networks.",
            "Building Quick Service Query List Using WordNet and Multiple Heterogeneous Ontologies toward More Realistic Service Composition.",
            "Vulnerability Analysis in SOA-Based Business Processes.",
            "The Integration of Corporate Security Strategies in Collaborative Business Processes.",
            "Guest Editorial: Security and Dependability in SOA and Business Processes.",
            "Two-Dimensional Trust Rating Aggregations in Service-Oriented Applications.",
            "Server-Side Streaming Processing of WS-Security.",
            "Runtime Administration of an RBAC Profile for XACML.",
            "Adaptive Reordering and Clustering-Based Framework for Efficient XACML Policy Evaluation.",
            "Security Policy Composition for Composite Web Services.",
            "Dependability and Rollback Recovery for Composite Web Services.",
            "GEODAC: A Data Assurance Policy Specification and Enforcement Framework for Outsourced Services."
        ]
    },
    {
        "name": "TSC",
        "year": "2010",
        "info": "Volume 3: 2010",
        "count": 29,
        "papers": [
            "Editorial: Context-Aware Application Integration and Transactional Behaviors.",
            "Semantic-Based Mashup of Composite Applications.",
            "Computing Service Skyline from Uncertain QoWS.",
            "Guest Editorial: Special Section on Transactional Web Services.",
            "Event-Based Design and Runtime Verification of Composite Service Transactional Behavior.",
            "FACTS: A Framework for Fault-Tolerant Composition of Transactional Web Services.",
            "Rule-Based Coordination of Distributed Web Service Transactions.",
            "TQoS: Transactional and QoS-Aware Selection Algorithm for Automatic Web Service Composition.",
            "Guest Editorial: Introduction to the Special Issue on Modeling and Implementation of Service Enterprise Systems.",
            "The Impact of Service Cohesion on the Analyzability of Service-Oriented Software.",
            "An Autonomic Service Delivery Platform for Service-Oriented Network Environments.",
            "Template-Based Adaptation of Semantic Web Services with Model-Driven Engineering.",
            "An Integrated Workbench for Model-Based Engineering of Service Compositions.",
            "From Software Architecture Analysis to Service Engineering: An Empirical Study of Methodology Development for Enterprise SOA Implementation.",
            "Guest Editorial: Special Section on Query Models and Efficient Selection of Web Services.",
            "Ranking and Clustering Web Services Using Multicriteria Dominance Relationships.",
            "Ranking BPEL Processes for Service Discovery.",
            "End-to-End Support for QoS-Aware Service Selection, Binding, and Mediation in VRESCo.",
            "A Query Rewriting Approach for Web Service Composition.",
            "Interacting with the SOA-Based Internet of Things: Discovery, Query, Selection, and On-Demand Provisioning of Web Services.",
            "Design of Service-Oriented Systems Using SODA.",
            "End-to-End Service Support for Mashups.",
            "Editorial: Data Intelligence in Services Computing.",
            "A Mathematical Programming Approach for Server Consolidation Problems in Virtualized Data Centers.",
            "Service Data Correlation Modeling and Its Application in Data-Driven Service Composition.",
            "An Intentional Approach to Service Engineering.",
            "Converting Legacy Desktop Applications into On-Demand Personalized Software.",
            "Secure Abstraction Views for Scientific Workflow Provenance Querying.",
            "Technical Target Setting in QFD for Web Service Systems Using an Artificial Neural Network."
        ]
    },
    {
        "name": "TSC",
        "year": "2009",
        "info": "Volume 2: 2009",
        "count": 29,
        "papers": [
            "TSC Cloud: Community-Driven Innovation Platform.",
            "A QoS Control Mechanism to Provide Service Differentiation and Overload Protection to Internet Scalable Servers.",
            "A Distributed System for Consuming Web Services and Caching Their Responses in MANETs.",
            "Configurable Composition and Adaptive Provisioning of Web Services.",
            "Identification and Analysis of Business and Software Services - A Consolidated Approach.",
            "Service Mining on the Web.",
            "A Reference Architecture for Scientific Workflow Management Systems and the VIEW SOA Solution.",
            "Services Design and Optimization.",
            "Mismatch Patterns and Adaptation Aspects: A Foundation for Rapid Development of Web Service Adapters.",
            "Optimizing Service Systems Based on Application-Level QoS.",
            "Mixed-Integer Programming for QoS-Based Web Service Matchmaking.",
            "Personalized Recommendation over a Customer Network for Ubiquitous Shopping.",
            "Choreographing Web Services.",
            "Discovering Homogeneous Web Service Community in the User-Centric Web Environment.",
            "Services Quality and Analytics.",
            "Resilience Metrics for Service-Oriented Networks: A Service Allocation Approach.",
            "The Design and Evaluation of MPI-Style Web Services.",
            "Context-Based Matching and Ranking of Web Services for Composition.",
            "Runtime Monitoring of Web Service Conversations.",
            "Guest Editorial: Special Section on Service-Oriented Distributed Computing Systems.",
            "Toward Development of Adaptive Service-Based Software Systems.",
            "Situ: A Situation-Theoretic Approach to Context-Aware Service Evolution.",
            "Editorial: Modern Services Engineering.",
            "From Web Service Artifact to a Readable and Verifiable Model.",
            "Distributed Management of Concurrent Web Service Transactions.",
            "Ontology Classification for Semantic-Web-Based Software Engineering.",
            "Guest Editorial: Special Section on Requirements Engineering for Services—Challenges and Practices.",
            "Requirements for QoS-Based Web Service Description and Discovery.",
            "An Online Monitoring Approach for Web Service Requirements."
        ]
    },
    {
        "name": "TSC",
        "year": "2008",
        "info": "Volume 1: 2008",
        "count": 21,
        "papers": [
            "Welcome Message.",
            "Introduction to the IEEE Transactions on Services Computing.",
            "Introduction of New Associate Editors.",
            "Effective Web Service Composition in Diverse and Large-Scale Service Networks.",
            "Bridging Security and Fault Management within Distributed Workflow Management Systems.",
            "Adaptive Secure Access to Remote Services in Mobile Environments.",
            "EIC Editorial: Introduction to the Knowledge Areas of Services Computing.",
            "A Secure Information Flow Architecture for Web Service Platforms.",
            "Similarity-Based SOAP Multicast Protocol to Reduce Bandwith and Latency in Web Services.",
            "Dynamic Web Service Selection for Reliable Web Service Composition.",
            "Coordinated Service Allocation through Flexible Reservation.",
            "EIC Editorial: Research Innovations in Service-Oriented Solutioning.",
            "A Privacy Preserving Repository for Data Integration across Data Sharing Services.",
            "Continually Learning Optimal Allocations of Services to Tasks.",
            "Dissemination Protocols for Event-Based Service-Oriented Architectures.",
            "Selective Querying for Adapting Web Service Compositions Using the Value of Changed Information.",
            "EIC Editorial: Quality-Aware SOA and Applications.",
            "Probabilistic QoS and Soft Contracts for Transaction-Based Web Services Orchestrations.",
            "Tisa: Toward Trustworthy Services in a Service-Oriented Architecture.",
            "CoopFlow: A Bottom-Up Approach to Workflow Cooperation for Short-Term Virtual Enterprises.",
            "End-User Service Computing: Spreadsheets as a Service Composition Tool."
        ]
    }
]