[
    {
        "name": "TWEB",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 5,
        "papers": [
            "Factorizing Historical User Actions for Next-Day Purchase Prediction.",
            "Context-aware Distance Measures for Dynamic Networks.",
            "How Do Home Computer Users Browse the Web?",
            "A Large-scale Empirical Analysis of Browser Fingerprints Properties for Web Authentication.",
            "On the Aggression Diffusion Modeling and Minimization in Twitter."
        ]
    },
    {
        "name": "TWEB",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 21,
        "papers": [
            "CBPCS: A Cache-block-based Service Process Caching Strategy to Accelerate the Execution of Service Processes.",
            "Investigating and Modeling the Web Elements' Visual Feature Influence on Free-viewing Attention.",
            "Decoupled Variational Embedding for Signed Directed Networks.",
            "Attributed Collaboration Network Embedding for Academic Relationship Mining.",
            "A Structured and Linguistic Approach to Understanding Recovery and Relapse in AA.",
            "Cross-site Prediction on Social Influence for Cold-start Users in Online Social Networks.",
            "A Two Phases Self-healing Framework for Service-oriented Systems.",
            "Utilizing Web Trackers for Sybil Defense.",
            "An Integrated Approach for Improving Brand Consistency of Web Content: Modeling, Analysis, and Recommendation.",
            "Exploring Weather Data to Predict Activity Attendance in Event-based Social Network: From the Organizer's View.",
            "Welcome Message from the New Editor-in-Chief.",
            "Semantic Table Retrieval Using Keyword and Table Queries.",
            "Who Has the Last Word? Understanding How to Sample Online Discussions.",
            "Review Summary Generation in Online Systems: Frameworks for Supervised and Unsupervised Scenarios.",
            "Dynamic, Incremental, and Continuous Detection of Cyberbullying in Online Social Media.",
            "Sequential Learning-based IaaS Composition.",
            "Studying and Understanding Characteristics of Post-Syncing Practice and Goal in Social Network Sites.",
            "Categorizing Sexism and Misogyny through Neural Approaches.",
            "Sampling Graphlets of Multiplex Networks: A Restricted Random Walk Approach.",
            "Identifying and Evaluating Anomalous Structural Change-based Nodes in Generalized Dynamic Social Networks.",
            "Cookie Banners and Privacy Policies: Measuring the Impact of the GDPR on the Web."
        ]
    },
    {
        "name": "TWEB",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 19,
        "papers": [
            "\"The Best of Both Worlds!\": Integration of Web Page and Eye Tracking Data Driven Approaches for Automatic AOI Detection.",
            "An Outsourcing Model for Alert Analysis in a Cybersecurity Operations Center.",
            "A Survey of Figurative Language and Its Computational Detection in Online Social Networks.",
            "Improving the Accuracy of the Video Popularity Prediction Models through User Grouping and Video Popularity Classification.",
            "Time-aspect-sentiment Recommendation Models Based on Novel Similarity Measure Methods.",
            "An Experimental Study of Automatic Detection and Measurement of Counterfeit in Brand Search Results.",
            "Image Privacy Prediction Using Deep Neural Networks.",
            "Browser Fingerprinting: A Survey.",
            "Topic-aware Web Service Representation Learning.",
            "PatternRank+NN: A Ranking Framework Bringing User Behaviors into Entity Set Expansion from Web Search Queries.",
            "SMINT: Toward Interpretable and Robust Model Sharing for Deep Neural Networks.",
            "QoS-aware Automatic Web Service Composition with Multiple Objectives.",
            "On Scalability of Association-rule-based Recommendation: A Unified Distributed-computing Framework.",
            "Roaming Through the Castle Tunnels: An Empirical Analysis of Inter-app Navigation of Android Apps.",
            "Dynamic Offloading of Web Application Execution Using Snapshot.",
            "Emotions Behind Drive-by Download Propagation on Twitter.",
            "Analyzing Genetic Testing Discourse on the Web Through the Lens of Twitter, Reddit, and 4chan.",
            "Early Detection of Social Media Hoaxes at Scale.",
            "Cold-start Point-of-interest Recommendation through Crowdsourcing."
        ]
    },
    {
        "name": "TWEB",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 21,
        "papers": [
            "Analyzing Privacy Policies at Scale: From Crowdsourcing to Automated Annotations.",
            "Mining Abstract XML Data-Types.",
            "Test-Based Security Certification of Composite Services.",
            "New Phone, Who Dis? Modeling Millennials' Backup Behavior.",
            "Web Portals for High-performance Computing: A Survey.",
            "Social Networks under Stress: Specialized Team Roles and Their Communication Structure.",
            "A Large-scale Behavioural Analysis of Bots and Humans on Twitter.",
            "FusE: Entity-Centric Data Fusion on Linked Data.",
            "What Web Template Extractor Should I Use? A Benchmarking and Comparison for Five Template Extractors.",
            "Polarization and Fake News: Early Warning of Potential Misinformation Targets.",
            "Cashtag Piggybacking: Uncovering Spam and Bot Activity in Stock Microblogs on Twitter.",
            "Layout Cross-Platform and Cross-Browser Incompatibilities Detection using Classification of DOM Elements.",
            "Exploiting Usage to Predict Instantaneous App Popularity: Trend Filters and Retention Rates.",
            "\"The Enemy Among Us\": Detecting Cyber Hate Speech with Threats-based Othering Language Embeddings.",
            "User Studies on End-User Service Composition: A Literature Review and a Design Framework.",
            "Learning Linear Influence Models in Social Networks from Transient Opinion Dynamics.",
            "Detecting Cyberbullying and Cyberaggression in Social Media.",
            "Long-term Measurement and Analysis of the Free Proxy Ecosystem.",
            "Fast and Practical Snippet Generation for RDF Datasets.",
            "Combining URL and HTML Features for Entity Discovery in the Web.",
            "Efficient Pairwise Penetrating-rank Similarity Retrieval."
        ]
    },
    {
        "name": "TWEB",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 27,
        "papers": [
            "Exploring the Emerging Type of Comment for Online Videos: DanMu.",
            "Adaptive Knowledge Propagation in Web Ontologies.",
            "Recommendation in a Changing World: Exploiting Temporal Dynamics in Ratings and Reviews.",
            "Activity Recommendation with Partners.",
            "Caching to Reduce Mobile App Energy Consumption.",
            "Modeling and Simulating the Web of Things from an Information Retrieval Perspective.",
            "List of 2016 TWEB Reviewers.",
            "Editorial.",
            "Knowledge Graph Embedding: A Locally and Temporally Adaptive Translation-Based Approach.",
            "When Simpler Data Does Not Imply Less Information: A Study of User Profiling Scenarios With Constrained View of Mobile HTTP(S) Traffic.",
            "Semantics-Based Analysis of Content Security Policy Deployment.",
            "Characterizing and Predicting Users' Behavior on Local Search Queries.",
            "BUbiNG: Massive Crawling for the Masses.",
            "A Model of Information Diffusion in Interconnected Online Social Networks.",
            "Evaluating Quality in Use of Corporate Web Sites: An Empirical Investigation.",
            "Localness of Location-based Knowledge Sharing: A Study of Naver KiN \"Here\".",
            "Extracting and Summarizing Situational Information from the Twitter Social Media during Disasters.",
            "Completeness Management for RDF Data Sources.",
            "Optimizing Whole-Page Presentation for Web Search.",
            "Faster Base64 Encoding and Decoding Using AVX2 Instructions.",
            "Top-k User-Defined Vertex Scoring Queries in Edge-Labeled Graph Databases.",
            "Exploring and Analysing the African Web Ecosystem.",
            "A Rule-Based Transducer for Querying Incompletely Aligned Datasets.",
            "You, the Web, and Your Device: Longitudinal Characterization of Browsing Habits.",
            "Understanding Cross-Site Linking in Online Social Networks.",
            "Unsupervised Domain Ranking in Large-Scale Web Crawls.",
            "Imaginary People Representing Real Numbers: Generating Personas from Online Social Media Data."
        ]
    },
    {
        "name": "TWEB",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 26,
        "papers": [
            "Information Sharing by Viewers Via Second Screens for In-Real-Life Events.",
            "Toward Automated Online Photo Privacy.",
            "Effort Mediates Access to Information in Online Social Networks.",
            "Spam Mobile Apps: Characteristics, Detection, and in the Wild Analysis.",
            "User's Web Page Aesthetics Opinion: A Matter of Low-Level Image Descriptors Based on MPEG-7.",
            "MultiWiki: Interlingual Text Passage Alignment in Wikipedia.",
            "MyAdChoices: Bringing Transparency and Control to Online Advertising.",
            "Value and Misinformation in Collaborative Investing Platforms.",
            "Periodicity in User Engagement with a Search Engine and Its Application to Online Controlled Experiments.",
            "Analyzing the Adoption and Cascading Process of OSN-Based Gifting Applications: An Empirical Study.",
            "Nonlinear Dynamics of Information Diffusion in Social Networks.",
            "On Obstructing Obscenity Obfuscation.",
            "An Empirical Investigation of Ecommerce-Reputation-Escalation-as-a-Service.",
            "A Bayesian Method for Comparing Hypotheses About Human Trails.",
            "Multirelational Recommendation in Heterogeneous Networks.",
            "Nucleus Decompositions for Identifying Hierarchy of Dense Subgraphs.",
            "Location-Based Distance Measures for Geosocial Similarity.",
            "Modeling and Evaluating a Robust Feedback-Based Reputation System for E-Commerce Platforms.",
            "WISeR: A Multi-Dimensional Framework for Searching and Ranking Web APIs.",
            "LDoW-PaN: Linked Data on the Web - Presentation and Navigation.",
            "Clickstream User Behavior Models.",
            "Canonical Forms for Isomorphic and Equivalent RDF Graphs: Algorithms for Leaning and Labelling Blank Nodes.",
            "A Study of Web Print: What People Print in the Digital Era.",
            "Exploring and Analyzing the Tor Hidden Services Graph.",
            "Collusive Opinion Fraud Detection in Online Reviews: A Probabilistic Modeling Approach.",
            "A Fast and Scalable Mechanism for Web Service Composition."
        ]
    },
    {
        "name": "TWEB",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 23,
        "papers": [
            "Analysis and Solution of CSS-Sprite Packing Problem.",
            "Discovering Best Teams for Data Leak-Aware Crowdsourcing in Social Networks.",
            "Individual Judgments Versus Consensus: Estimating Query-URL Relevance.",
            "Detecting Spam and Promoting Campaigns in Twitter.",
            "Flexible Construction of Executable Service Compositions from Reusable Semantic Knowledge.",
            "W-tree: A Compact External Memory Representation for Webgraphs.",
            "A Spatial-Temporal QoS Prediction Approach for Time-aware Web Service Recommendation.",
            "A Novel Evidence-Based Bayesian Similarity Measure for Recommender Systems.",
            "A Buyer-Friendly and Mediated Watermarking Protocol for Web Context.",
            "Q2P: Discovering Query Templates via Autocompletion.",
            "Activity Dynamics in Collaboration Networks.",
            "Probabilistic QoS Aggregations for Service Composition.",
            "Search and Breast Cancer: On Episodic Shifts of Attention over Life Histories of an Illness.",
            "What Users Actually Do in a Social Tagging System: A Study of User Behavior in BibSonomy.",
            "Scalable and Efficient Web Search Result Diversification.",
            "PeaCE-Ful Web Event Extraction and Processing as Bitemporal Mutable Events.",
            "A Comprehensive Survey and Classification of Approaches for Community Question Answering.",
            "Prediction and Predictability for Search Query Acceleration.",
            "Scanpath Trend Analysis on Web Pages: Clustering Eye Tracking Scanpaths.",
            "Web Content Classification Using Distributions of Subjective Quality Evaluations.",
            "From Footprint to Evidence: An Exploratory Study of Mining Social Data for Credit Scoring.",
            "COIP - Continuous, Operable, Impartial, and Privacy-Aware Identity Validity Estimation for OSN Profiles.",
            "Manipulation among the Arbiters of Collective Intelligence: How Wikipedia Administrators Mold Public Opinion."
        ]
    },
    {
        "name": "TWEB",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 20,
        "papers": [
            "Elastic Personalized Nonfunctional Attribute Preference and Trade-off Based Service Selection.",
            "ReputationPro: The Efficient Approaches to Contextual Transaction Trust Computation in E-Commerce Environments.",
            "Active Learning for Web Search Ranking via Noise Injection.",
            "Characterizing Web Censorship Worldwide: Another Look at the OpenNet Initiative Data.",
            "NautiLOD: A Formal Language for the Web of Data Graph.",
            "Editorial.",
            "Modeling, Enacting, and Integrating Custom Crowdsourcing Processes.",
            "The Augmented Web: Rationales, Opportunities, and Challenges on Browser-Side Transcoding.",
            "Integrating Transactions into BPEL Service Compositions: An Aspect-Based Approach.",
            "A Formal Account of the Open Provenance Model.",
            "A UI-Centric Approach for the End-User Development of Multidevice Mashups.",
            "Sampling Content from Online Social Networks: Comparing Random vs. Expert Sampling of the Twitter Stream.",
            "Should We Use the Sample? Analyzing Datasets Sampled from Twitter's Stream API.",
            "Reliable and Resilient Trust Management in Distributed Service Provision Networks.",
            "A Supervised Learning Approach to Protect Client Authentication on the Web.",
            "Detection of Political Manipulation in Online Communities through Measures of Effort and Collaboration.",
            "Improving Researcher Homepage Classification with Unlabeled Data.",
            "Diversionary Comments under Blog Posts.",
            "Estimating Clustering Coefficients and Size of Social Networks via Random Walk.",
            "Fona: Quantitative Metric to Measure Focus Navigation on Rich Internet Applications."
        ]
    },
    {
        "name": "TWEB",
        "year": "2013",
        "info": "Volume 8: 2013/2014",
        "count": 25,
        "papers": [
            "UsageQoS: Estimating the QoS of Web Services through Online User Communities.",
            "Form-Based Web Service Composition for Domain Experts.",
            "Second Chance: A Hybrid Approach for Dynamic Result Caching and Prefetching in Search Engines.",
            "Efficient Time-Stamped Event Sequence Anonymization.",
            "Control-Flow Patterns for Decentralized RESTful Service Composition.",
            "Analyzing, Detecting, and Exploiting Sentiment in Web Queries.",
            "Analysis of Search and Browsing Behavior of Young Users on the Web.",
            "How to Improve Your Search Engine Ranking: Myths and Reality.",
            "Leveraging Social Feedback to Verify Online Identity Claims.",
            "Efficient Multiview Maintenance under Insertion in Huge Social Networks.",
            "Textual and Content-Based Search in Repositories of Web Application Models.",
            "Neighbor Selection and Weighting in User-Based Collaborative Filtering: A Performance Prediction Approach.",
            "Foundations of Trust and Distrust in Networks: Extended Structural Balance Theory.",
            "Conceptual Development of Custom, Domain-Specific Mashup Platforms.",
            "Propagating Both Trust and Distrust with Target Differentiation for Combating Link-Based Web Spam.",
            "Incremental Text Indexing for Fast Disk-Based Search.",
            "Analyzing and Mining Comments and Comment Ratings on the Social Web.",
            "Ten Years of Rich Internet Applications: A Systematic Mapping Study, and Beyond.",
            "A Model-Based Approach for Crawling Rich Internet Applications.",
            "Merging Query Results From Local Search Engines for Georeferenced Objects.",
            "Constructing and Comparing User Mobility Profiles.",
            "Sentiment-Focused Web Crawling.",
            "EXIP: A Framework for Embedded Web Development.",
            "Using Interaction Data to Explain Difficulty Navigating Online.",
            "Content Bias in Online Health Search."
        ]
    },
    {
        "name": "TWEB",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 24,
        "papers": [
            "Measuring the Visual Complexities of Web Pages.",
            "Progress on Website Accessibility?",
            "A Comprehensive Study of Techniques for URL-Based Web Page Language Classification.",
            "HTML Automatic Table Layout.",
            "A test-based security certification scheme for web services.",
            "Enhancing the trust-based recommendation process with explicit distrust.",
            "A measurement study of insecure javascript practices on the web.",
            "Understanding query interfaces by statistical parsing.",
            "A language for end-user web augmentation: Caring for producers and consumers alike.",
            "Coordinating the web of services for a smart home.",
            "Assessing relevance and trust of the deep web sources and results based on inter-source agreement.",
            "A feature-word-topic model for image annotation and retrieval.",
            "Improving contextual advertising by adopting collaborative filtering.",
            "Virtual private social networks and a facebook implementation.",
            "A term-based inverted index partitioning model for efficient distributed query processing.",
            "The parallel path framework for entity discovery on the web.",
            "Semantic content-based recommendation of software services using context.",
            "Understanding latent interactions in online social networks.",
            "A bottom-up, knowledge-aware approach to integrating and querying web data services.",
            "Web browsing behavior analysis and interactive hypervideo.",
            "Robust detection of semi-structured web records using a DOM structure-knowledge-driven model.",
            "A vlHMM approach to context-aware search.",
            "Captions and biases in diagnostic search.",
            "Semantic contextual advertising based on the open directory project."
        ]
    },
    {
        "name": "TWEB",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 18,
        "papers": [
            "ClickRank: Learning Session-Context Models to Enrich Web Search Ranking.",
            "Identifying Web Spam with the Wisdom of the Crowds.",
            "Crawling Ajax-Based Web Applications through Dynamic Analysis of User Interface State Changes.",
            "Quality and Leniency in Online Collaborative Rating Systems.",
            "Editorial.",
            "Integrating trust management and access control in data-intensive Web applications.",
            "A hybrid approach for efficient Web service composition with end-to-end QoS constraints.",
            "Modellus: Automated modeling of complex internet data center applications.",
            "Friendship prediction and homophily in social media.",
            "A model-driven methodology to the content layout problem in web applications.",
            "Extracting information networks from the blogosphere.",
            "FoXtrot: Distributed structural and value XML filtering.",
            "Navigating tomorrow's web: From searching and browsing to visual exploration.",
            "Cache-Based Query Processing for Search Engines.",
            "A Methodology for SIP and SOAP Integration Using Application-Specific Protocol Conversion.",
            "Workload Characterization and Performance Implications of Large-Scale Blog Servers.",
            "Beyond Social Graphs: User Interactions in Online Social Networks and their Implications.",
            "Exploiting External Collections for Query Expansion."
        ]
    },
    {
        "name": "TWEB",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 21,
        "papers": [
            "Introduction to special issue on recommender systems.",
            "Comparison of collaborative filtering algorithms: Limitations of current techniques and proposals for scalable, high-performance recommender systems.",
            "Using external aggregate ratings for improving individual recommendations.",
            "Automatic tag recommendation algorithms for social recommender systems.",
            "Recommending friends and locations based on individual location history.",
            "Topic Distillation with Query-Dependent Link Connections and Page Characteristics.",
            "Host-Based P2P Flow Identification and Use in Real-Time.",
            "Characterizing Web-Based Video Sharing Workloads.",
            "Cost-Aware Strategies for Query Result Caching in Web Search Engines.",
            "A Survey of Requirements Specification in Model-Driven Development of Web Applications.",
            "Designing and Implementing the OP and OP2 Web Browsers.",
            "A Clustering-Driven LDAP Framework.",
            "ACConv - An Access Control Model for Conversational Web Services.",
            "On Computing Deltas of RDF/S Knowledge Bases.",
            "A Comprehensive Study of Features and Algorithms for URL-Based Topic Classification.",
            "Building Mashups by Demonstration.",
            "A Practical Architecture for an Anycast CDN.",
            "Efficient Search Engine Measurements.",
            "Characterizing Organizational Use of Web-Based Services: Methodology, Challenges, Observations, and Insights.",
            "Camera Brand Congruence and Camera Model Propagation in the Flickr Social Graph.",
            "A Specialized Search Assistant for Learning Objects."
        ]
    },
    {
        "name": "TWEB",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 17,
        "papers": [
            "Understanding transportation modes based on GPS data for web applications.",
            "A distributed service-oriented architecture for business process execution.",
            "Declarative specification and verification of service choreographiess.",
            "Ads-portal domains: Identification and measurements.",
            "Reporting incentives and biases in online review forums.",
            "Optimal distance bounds for fast search on compressed time-series query logs.",
            "Engineering rich internet applications with a model-driven approach.",
            "A large-scale study on map search logs.",
            "Modeling web quality using a probabilistic approach: An empirical validation.",
            "Privacy-preserving query log mining for business confidentiality protection.",
            "Exploring XML web collections with DescribeX.",
            "Discovery of latent subcommunities in a blog's readership.",
            "AjaxScope: A Platform for Remotely Monitoring the Client-Side Behavior of Web 2.0 Applications.",
            "Learning Deterministic Regular Expressions for the Inference of Schemas from XML Data.",
            "Mining Historic Query Trails to Label Long and Rare Search Engine Queries.",
            "Fast and Compact Web Graph Representations.",
            "Relating Reputation and Money in Online Markets."
        ]
    },
    {
        "name": "TWEB",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 14,
        "papers": [
            "Methods for extracting place semantics from Flickr tags.",
            "Protecting browsers from DNS rebinding attacks.",
            "Do not crawl in the DUST: Different URLs with similar text.",
            "Browsing on small displays by transforming Web pages into hierarchically structured subpages.",
            "Classifying search queries using the Web as a source of knowledge.",
            "A large-scale empirical study of P3P privacy policies: Stated actions vs. legal obligations.",
            "Extraction and classification of dense implicit communities in the Web graph.",
            "IRLbot: Scaling to 6 billion pages and beyond.",
            "Cookies: A deployment study and the testing implications.",
            "A framework for QoS-based Web service contracting.",
            "Unified publication and discovery of semantic Web services.",
            "Trust and nuanced profile similarity in online social networks.",
            "Search-as-a-service: Outsourced search over outsourced storage.",
            "Emergence of consensus and shared vocabularies in collaborative tagging systems."
        ]
    },
    {
        "name": "TWEB",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 22,
        "papers": [
            "Introduction to special section on adversarial issues in Web search.",
            "Link analysis for Web spam detection.",
            "Tracking Web spam with HTML style similarities.",
            "Detecting splogs via temporal dynamics using self-similarity analysis.",
            "Not quite the average: An empirical study of Web use.",
            "Framework for Web service query algebra and optimization.",
            "Scalable semantic analytics on social networks for addressing the problem of conflict of interest detection.",
            "Adaptive quality of service management for enterprise services.",
            "Discovering global network communities based on local centralities.",
            "Introduction to special issue on service oriented computing (SOC).",
            "Automatic annotation of Web services based on workflow definitions.",
            "Correctness-aware high-level functional matching approaches for semantic Web services.",
            "Supporting the dynamic evolution of Web service protocols in service-oriented architectures.",
            "An environment for flexible advanced compensations of Web service transactions.",
            "Mitigating application-level denial of service attacks on Web servers: A client-transparent approach.",
            "Leveraging popular destinations to enhance Web search interaction.",
            "Models and framework for supporting runtime decisions in Web-based systems.",
            "Introduction to special issue on query log analysis: Technology and ethics.",
            "A survey of query log privacy-enhancing techniques from a policy perspective.",
            "Design trade-offs for search engine caching.",
            "Learning about the world through long-term query logs.",
            "Combating spam in tagging systems: An evaluation."
        ]
    },
    {
        "name": "TWEB",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 14,
        "papers": [
            "Introduction.",
            "Analytic modeling of multitier Internet applications.",
            "The comparative effectiveness of sponsored and nonsponsored links for Web e-commerce queries.",
            "Mobile information access: A study of emerging search behavior on the mobile Internet.",
            "The dynamics of viral marketing.",
            "Efficient algorithms for Web services selection with end-to-end QoS constraints.",
            "Visualizing tags over time.",
            "Scouts, promoters, and connectors: The roles of ratings in nearest-neighbor collaborative filtering.",
            "The effects of proxy bidding and minimum bid increments within eBay auctions.",
            "Decoding the structure of the WWW: A comparative analysis of Web crawls.",
            "BrowserShield: Vulnerability-driven filtering of dynamic HTML.",
            "Model-directed Web transactions under constrained modalities.",
            "Cache architecture for on-demand streaming on the Web.",
            "Modeling process-driven and service-oriented architectures using patterns and pattern primitives."
        ]
    }
]