[
	{
		"year": "2021",
		"name": "ICSA 2021",
		"info": "Stuttgart, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/icsa/2021",
				"sub_name": "18th IEEE International Conference on Software Architecture, ICSA 2021, Stuttgart, Germany, March 22-26, 2021.",
				"count": 16,
				"papers": [
					"Enabling Consistency between Software Artefacts for Software Adaption and Evolution.",
					"System- and Software-level Architecting Harmonization Practices for Systems-of-Systems : An exploratory case study on a long-running large-scale scientific instrument.",
					"Practitioner Views on the Interrelation of Microservice APIs and Domain-Driven Design: A Grey Literature Study Based on Grounded Theory.",
					"Semi-automatic Feedback for Improving Architecture Conformance to Microservice Patterns and Practices.",
					"A Decision Model for Choosing Patterns in Blockchain-Based Applications.",
					"Continuous API Evolution in Heterogenous Enterprise Software Systems.",
					"Towards Resilient IoT Messaging: An Experience Report Analyzing MQTT Brokers.",
					"Quantum Computing Platforms: Assessing the Impact on Quality Attributes and SDLC Activities.",
					"Architectural Decay as Predictor of Issue- and Change-Proneness.",
					"Model-based Performance Analysis for Architecting Cyber-Physical Dynamic Spaces.",
					"The Influence of Cognitive Biases on Architectural Technical Debt.",
					"Aligning Architecture with Business Goals in the Automotive Domain.",
					"ArCode: Facilitating the Use of Application Frameworks to Implement Tactics and Patterns.",
					"Constructing a Shared Infrastructure for Software Architecture Analysis and Maintenance.",
					"Exploring Web Search Engines to Find Architectural Knowledge.",
					"InMap: Automated Interactive Code-to-Architecture Mapping Recommendations."
				]
			},
			{
				"sub_name_abbr": "conf/icsa/2021c",
				"sub_name": "18th IEEE International Conference on Software Architecture Companion, ICSA Companion 2021, Stuttgart, Germany, March 22-26, 2021.",
				"count": 35,
				"papers": [
					"Facilitating Connector Evolution With Architecture-Centric Development.",
					"Knowledge-based Adequacy assessment Approach to support AI adoption.",
					"Message from the SAIP, NEMI, ECRF, Journal First, and Workshops Track Chairs.",
					"Modeling Data Flow Constraints for Design-Time Confidentiality Analyses.",
					"Designing a Security Platform for Collaborating Autonomous Systems - An Experience Report.",
					"Contrasting Big Bang with Continuous Integration through Defect Reports.",
					"Why and How Your Traceability Should Evolve: Insights from an Automotive Supplier.",
					"A Framework of Software Architecture Principles for Sustainability-driven Design and Measurement.",
					"A Process Model for Microservices Design and Identification.",
					"Microservices for Continuous Deployment, Monitoring and Validation in Cyber-Physical Systems: an Industrial Case Study for Elevators Systems.",
					"Monolith Modularization Towards Microservices: Refactoring and Performance Trade-offs.",
					"PPTAMλ: What, Where, and How of Cross-domain Scalability Assessment.",
					"φ comp: An Architecture for Monitoring and Enforcing Security Compliance in Sensitive Health Data Environment.",
					"Automatic Class Decomposition using Clustering.",
					"Long Live The Image: Container-Native Data Persistence in Production.",
					"The Tao way to anti-fragile software architectures: the case of mobile applications.",
					"Ethics-driven Software Architecture Decision Making.",
					"Self-Adapting Model-Based SDSec For IoT Networks Using Machine Learning.",
					"1st Workshop on Quantum Software Architecture (QSA).",
					"Expanding Data Encoding Patterns For Quantum Algorithms.",
					"Modelling for Quantum Error Mitigation.",
					"Hybrid Quantum Network for classification of finance and MNIST data.",
					"Composable Programming of Hybrid Workflows for Quantum Simulation.",
					"BlockArch'21 - Second International Workshop on Blockchain-Based Architecture.",
					"Blockchain and Smart Contracts as New Governance Tools for the Sharing Economy.",
					"On the Integration of Artificial Intelligence and Blockchains 3.0: Prospects and Challenges.",
					"Design Patterns for Smart Contract in Ethereum.",
					"ElectionBlock: An Electronic Voting System using Blockchain and Fingerprint Authentication.",
					"Blockchain-based Local Energy Grids: Advanced Use Cases and Architectural Considerations.",
					"7th International Workshop on Automotive System/Software Architecture (WASA 2021).",
					"Architecture-based Hybrid Approach to Verify Safety-critical Automotive System Functions by Combining Data-driven and Formal Methods.",
					"A Rapid Prototyping System, Intelligent Watchdog and Gateway Tool for Automotive Applications.",
					"Simulation-as-a-Service: a simulation platform for cyber-physical systems.",
					"Digital Sustainability and Digital Diversification: The Two Key Challenges for Automotive Software Development.",
					"AUTOSAR Classic Platform Flexibility Managing the complexity of distributed embedded software development : Invited Talk."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "ICSA 2020",
		"info": "Salvador, Brazil",
		"venues": [
			{
				"sub_name_abbr": "conf/icsa/2020",
				"sub_name": "2020 IEEE International Conference on Software Architecture, ICSA 2020, Salvador, Brazil, March 16-20, 2020.",
				"count": 19,
				"papers": [
					"Employment of Optimal Approximations on Apache Hadoop Checkpoint Technique for Performance Improvements.",
					"Quantitative Verification-Aided Machine Learning: A Tandem Approach for Architecting Self-Adaptive IoT Systems.",
					"Incremental Calibration of Architectural Performance Models with Parametric Dependencies.",
					"Enforcing Architectural Security Decisions.",
					"Technical Architectures for Automotive Systems.",
					"Unlimited Rulebook: a Reference Architecture for Economy Mechanics in Digital Games.",
					"The Evolution of Architectural Decision Making as a Key Focus Area of Software Architecture Research: A Semi-Systematic Literature Study.",
					"REST vs GraphQL: A Controlled Experiment.",
					"Strategies for Pattern-Based Detection of Architecturally-Relevant Software Vulnerabilities.",
					"COCOS: A Scalable Architecture for Containerized Heterogeneous Systems.",
					"Model-Based Analysis of Microservice Resiliency Patterns.",
					"Anatomy, Concept, and Design Space of Blockchain Networks.",
					"Automated Microservice Identification in Legacy Systems with Functional and Non-Functional Metrics.",
					"A Goal-Driven Approach for Deploying Self-Adaptive IoT Systems.",
					"From Monolithic Architecture Style to Microservice one Based on a Semi-Automatic Approach.",
					"A Complexity Metric for Microservices Architecture Migration.",
					"DesignDiff: Continuously Modeling Software Design Difference from Code Revisions.",
					"Architectural Patterns for Cross-Domain Personalised Automotive Functions.",
					"Butterfly Space: An Architectural Approach for Investigating Performance Issues."
				]
			},
			{
				"sub_name_abbr": "conf/icsa/2020c",
				"sub_name": "2020 IEEE International Conference on Software Architecture Companion, ICSA Companion 2020, Salvador, Brazil, March 16-20, 2020.",
				"count": 48,
				"papers": [
					"Message from the General Chair and PC Chairs of ICSA 2020 Foreword to ICSA 2020 proceedings.",
					"Challenges and Approaches for the Assessment of Micro-Service Architecture Deployment Alternatives in DevOps : A tutorial presented at ICSA 2020.",
					"Towards the Factory of the Future with Digital Twins and SOA : Towards the Factory of the Future with Digital Twins and SOA.",
					"Architecting and Analysing Connected Autonomous Vehicles.",
					"Modeling Microservices with DDD.",
					"Microservice Decomposition via Static and Dynamic Analysis of the Monolith.",
					"On the Deployment of IoT Systems: An Industrial Survey.",
					"A Lightweight Architecture Analysis of a Monolithic Messaging Gateway.",
					"A Classification of Replicated Data for the Design of Eventually Consistent Domain Models.",
					"Towards Identifying Microservice Candidates from Business Rules Implemented in Stored Procedures.",
					"Serverless: What it Is, What to Do and What Not to Do.",
					"Understanding Software Systems through Interactive Pattern Detection.",
					"Semi-automatic Architectural Suggestions for the Functional Safety of Cooperative Driving Systems.",
					"Data-driven Adaptation in Microservice-based IoT Architectures.",
					"An Automated Approach to Recover the Use-case View of an Architecture.",
					"The Impact of Constructors on the Validity of Class Cohesion Metrics.",
					"Towards Formalizing Microservices Architectural Patterns with Event-B.",
					"How 'micro' are your services?",
					"Automated Security Analysis for Microservice Architecture.",
					"Multi-tenant Quality Attributes to Manage Tenants in SaaS Applications.",
					"A Model-Driven Architectural Design Method for Big Data Analytics Applications.",
					"Research Opportunities for E-health Applications with DNA Sequence Data using Blockchain Technology.",
					"A Pattern Adherence Analysis to a Blockchain Web Application.",
					"Motivating Web and Blockchain Application Modeling.",
					"Using a Hybrid Approach to Data Management in Relational Database and Blockchain: a Case Study on The E-health Domain.",
					"Building a prototype based on Microservices and Blockchain technologies for notary's office: An academic experience report.",
					"Scalable Architecture for sharing EHR using the Hyperledger Blockchain.",
					"Towards Cloud Computing and Blockchain Integrated Applications.",
					"SklCoin: Toward a Scalable Proof-of-Stake and Collective Signature Based Consensus Protocol for Strong Consistency in Blockchain.",
					"CompliancePal: A Tool for Supporting Practical Agile and Regulatory-Compliant Development of Medical Software.",
					"DPF: App for diagnosing the psychological profile of a possible feminicide.",
					"Data Mining for Hospital Morbidity Forecasting.",
					"Defining Security Metrics To Evaluate Electronic Health Records Systems: A Case Study in Chile.",
					"Last Mile Healthcare Through Micro-entrepreneurs.",
					"On Medical Device Software CE Compliance and Conformity Assessment.",
					"Safety Improvement for SMART on FHIR Apps with Data Quality by Contract.",
					"A Case Study for Implementing a Laboratory Information Management System for HLA Typing.",
					"Continuous security patch delivery and risk management for medical devices.",
					"Graphical and Collaborative Annotation Support for Semantic Web Services.",
					"Constituent System Design: A Software Architecture Approach.",
					"Business Process Management in Digital and Software Ecosystems: A Systematic Mapping Study.",
					"A Study on Organizational IT Security in Mobile Software Ecosystems Literature.",
					"Fostering Reuse by Integration: A Directed System of Systems Development Case.",
					"Evaluating Frameworks Assemblies In Microservices-based Systems Using Imperfect Information.",
					"Risk Management for System of Systems: A Systematic Mapping Study.",
					"Reference Architecture for Trust-Based Digital Ecosystems.",
					"PerfMinerArch - A Tool to Visualize and Analyze Performance Deviations.",
					"A Toolbox for Realtime Timeseries Anomaly Detection."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "ICSA 2019",
		"info": "Hamburg, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/icsa/2019",
				"sub_name": "IEEE International Conference on Software Architecture, ICSA 2019, Hamburg, Germany, March 25-29, 2019.",
				"count": 22,
				"papers": [
					"Message from the General Chair and PC Chairs of ICSA 2019.",
					"Data-Driven Software Architecture for Analyzing Confidentiality.",
					"An Architectural View for Data Protection by Design.",
					"Aspect-Oriented Modeling of Technology Heterogeneity in Microservice Architecture.",
					"Architectural Security Weaknesses in Industrial Control Systems (ICS) an Empirical Study Based on Disclosed Software Vulnerabilities.",
					"An Architecture-Driven Adaptation Approach for Big Data Cyber Security Analytics.",
					"Microservice Architecture in Reality: An Industrial Inquiry.",
					"Component-Based Refinement and Verification of Information-Flow Security Policies for Cyber-Physical Microservice Architectures.",
					"Integrating Statistical Response Time Models in Architectural Performance Models.",
					"Exploiting Architecture/Runtime Model-Driven Traceability for Performance Improvement.",
					"How Developers Discuss Architecture Smells? An Exploratory Study on Stack Overflow.",
					"A Platform Architecture for Multi-Tenant Blockchain-Based Systems.",
					"Mitigating the Influence of Embedded Software Development Environments and Toolsets (ESDT) on Software Architecture.",
					"Synchronous Reconfiguration of Distributed Embedded Applications During Operation.",
					"Continuous Architecture: Towards the Goldilocks Zone and Away from Vicious Circles.",
					"Guidelines for Architecting Android Apps: A Mixed-Method Empirical Study.",
					"Improving the Consistency and Usefulness of Architecture Descriptions: Guidelines for Architects.",
					"On Interfaces to Support Agile Architecting in Automotive: An Exploratory Case Study.",
					"Testing the Implementation of Concurrent AUTOSAR Drivers Against Architecture Decisions.",
					"Safety Analysis Method for Cooperative Driving Systems.",
					"Flaws in Flows: Unveiling Design Flaws via Information Flow Analysis.",
					"A Framework for Tunable Anomaly Detection."
				]
			},
			{
				"sub_name_abbr": "conf/icsa/2019c",
				"sub_name": "IEEE International Conference on Software Architecture Companion, ICSA Companion 2019, Hamburg, Germany, March 25-26, 2019.",
				"count": 51,
				"papers": [
					"Sense of Place within the Virtuous Circle of Architecture Decision-Making.",
					"Architecting Trustworthy Self-Adaptive Systems (Tutorial).",
					"TCP-Inspired Congestion Avoidance for Cloud-IoT Applications.",
					"Message from the General Chair and PC Chairs of ICSA 2019 Foreword to ICSA 2019 Proceedings.",
					"Reinforcement Learning for IoT Interoperability.",
					"Identifying Requirements for Architectural Modeling in Internet of Things Applications.",
					"A Process Model for Elastic and Resilient IoT Applications with Emergent Behaviors.",
					"System/ Software Architecture for Autonomous Driving Systems.",
					"Agile System Architecture in Large Organizations: An Experience Report from Volvo Cars.",
					"Exploring Automotive Stakeholder Requirements for Architecture Optimization Support.",
					"Microservice Architectures for Advanced Driver Assistance Systems: A Case-Study.",
					"On the Nature of Automotive Service Architectures.",
					"Towards a Virtual Continuous Integration Platform for Advanced Driving Assistance Systems.",
					"Experience Report: Combining Mixed-Criticality Support with Resource Reservation and Spare Capacity Allocation.",
					"A Retargetable Fault Injection Framework for Safety Validation of Autonomous Vehicles.",
					"Architectural Runtime Verification.",
					"Unleashing the Power of Multi-Core MCUs by AUTOSAR Communication Stack Software Distribution.",
					"Component Comparison, Evaluation, and Selection: A Continuous Approach.",
					"Towards Continuous Quality: Measuring and Evaluating Feature-Dependent Non-Functional Requirements in DevOps.",
					"Towards a Collaborative Repository for the Documentation of Service-Based Antipatterns and Bad Smells.",
					"Vulnerabilities in Continuous Delivery Pipelines? A Case Study.",
					"Continuous Performance Testing in Virtual Time.",
					"Rapid Canary Assessment Through Proxying and Two-Stage Load Balancing.",
					"Industrial DevOps.",
					"Continuous Software Engineering of Innovative Automotive Functions: An Industrial Perspective.",
					"Extracting Quality Attributes from User Stories for Early Architecture Decision Making.",
					"High-Level Design Stories in Architecture-Centric Agile Development.",
					"Evaluating Design Rationale in Architecture.",
					"DecidArch V2: An Improved Game to Teach Architecture Design Decision Making.",
					"ADeX: A Tool for Automatic Curation of Design Decision Knowledge for Architectural Decision Recommendations.",
					"PerOpteryx: Automated Improvement of Software Architectures.",
					"A Pattern-Oriented Design Framework for Self-Adaptive Software Systems.",
					"PaaSArch: Quality Evaluation Tool for PaaS Cloud Applications Using Generated Prototypes.",
					"Assessing Migration of a 20-Year-Old System to a Micro-Service Platform Using ATAM.",
					"\"Functional-First\" Recommendations for Beneficial Microservices Migration and Integration Lessons Learned from an Industrial Experience.",
					"Microservices in Industry: Insights into Technologies, Characteristics, and Software Quality.",
					"Deconstructing the Lambda Architecture: An Experience Report.",
					"Using View-Based Architecture Descriptions to Aid in Automated Runtime Planning for a Smart Factory.",
					"A Flexible Platform Architecture for the Dynamic Composition of Third-Party-Services.",
					"Virtualizing Embedded Firmware to Boost Innovation Cycles.",
					"Helping Software Architects Familiarize with the General Data Protection Regulation.",
					"Risk Containers - A Help or Hindrance to Practitioners?",
					"Towards Blockchain Tactics: Building Hybrid Decentralized Software Architectures.",
					"When Natural Language Processing Jumps into Collaborative Software Engineering.",
					"A Machine Learning-Driven Approach for Proactive Decision Making in Adaptive Architectures.",
					"Designing Safety Critical Software Systems to Manage Inherent Uncertainty.",
					"Towards Consistency Checking Between Software Architecture and Informal Documentation.",
					"Applying Social Network Analysis Techniques to Architectural Smell Prediction.",
					"Refactoring Decision Support for Developers and Architects Based on Architectural Impact.",
					"Machine Learning System Architectural Pattern for Improving Operational Stability.",
					"Beyond Reason: Uniting Intuition and Rationality in Software Architecture Decision Making."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "ICSA 2018",
		"info": "Seattle, WA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/icsa/2018",
				"sub_name": "IEEE International Conference on Software Architecture, ICSA 2018, Seattle, WA, USA, April 30 - May 4, 2018.",
				"count": 23,
				"papers": [
					"Message from the General Chair and PC Chairs of ICSA 2018.",
					"The Anatomy of a Large-Scale Experimentation Platform.",
					"A Blockchain-Based Micro Economy Platform for Distributed Infrastructure Initiatives.",
					"Reducing Development Overheads with a Generic and Model-Centric Architecture for Online Games.",
					"Migrating Towards Microservice Architectures: An Industrial Survey.",
					"Microservices: Architecting for Continuous Delivery and DevOps.",
					"Towards Micro Service Architecture Recovery: An Empirical Study.",
					"Architecting a Software-Based Ecosystem for the Automotive Aftermarket: An Experience Report.",
					"Data-Centric Communication and Containerization for Future Automotive Software Architectures.",
					"An Architecture for Decentralized, Collaborative, and Autonomous Robots.",
					"An Expert Recommendation System for Design Decision Making: Who Should be Involved in Making a Design Decision?",
					"Recovering Architectural Design Decisions.",
					"EASIER: An Evolutionary Approach for Multi-objective Software ArchItecturE Refactoring.",
					"Architectural Design Decisions for Systems Supporting Model-Based Analysis of Runtime Events: A Qualitative Multi-method Study.",
					"Availability-Driven Architectural Change Propagation Through Bidirectional Model Transformations Between UML and Petri Net Models.",
					"Modeling of Parametric Dependencies for Performance Prediction of Component-Based Software Systems at Run-Time.",
					"A Generic and Highly Scalable Framework for the Automation and Execution of Scientific Data Processing and Simulation Workflows.",
					"Infrastructure-as-Code for Data-Intensive Architectures: A Model-Driven Development Approach.",
					"Predicting the Performance of Privacy-Preserving Data Analytics Using Architecture Modelling and Simulation.",
					"An Empirical Study of Architectural Decay in Open-Source Software.",
					"Improving the Search for Architecture Knowledge in Online Developer Communities.",
					"Self-Commissioning Industrial IoT-Systems in Process Automation: A Reference Architecture.",
					"View-Centric Context Modeling to Foster the Engineering of Cyber-Physical System Networks."
				]
			},
			{
				"sub_name_abbr": "conf/icsa/2018c",
				"sub_name": "2018 IEEE International Conference on Software Architecture Companion, ICSA Companion 2018, Seattle, WA, USA, April 30 - May 4, 2018.",
				"count": 41,
				"papers": [
					"Message from the ICSA 2018 Tutorials Chairs.",
					"Performance-Driven Software Architecture Refactoring.",
					"Modeling and Executing Software Architecture Using SysADL.",
					"How to Evaluate Software Architectures: Tutorial on Practical Insights on Architecture Evaluation Projects with Industrial Customers.",
					"IoT-ASAP 2018: Message from the Chairs.",
					"KEYNOTE. IoT Challenges for Smart Manufacturing: Connecting a Laser Level Transmitter to the Cloud.",
					"A Case Study for Workflow-Based Automation in the Internet of Things.",
					"Straightforward Specification of Adaptation-Architecture-Significant Requirements of IoT-enabled Cyber-Physical Systems.",
					"I4.0-Device Integration: A Qualitative Analysis of Methods and Technologies Utilized by System Integrators: Implications for Enginering Future Industrial Internet of Things System.",
					"Using Blockchain Technology to Ensure Trustful Information Flow Monitoring in CPS.",
					"ICSA 2018 Early Career Researchers Forum: Message from the Chairs.",
					"KEYNOTE. Push, Pull, Partner: A Few Models for Working with Industry.",
					"Traceable Threat Modeling for Safety-Critical Systems.",
					"Architectural Technical Debt Identification: Moving Forward.",
					"Engineering Software Architectures of Blockchain-Oriented Applications.",
					"New and Emerging Ideas Track 2018.",
					"Towards a Dual Processing Perspective of Software Architecture Decision Making.",
					"Decision Making and Cognitive Biases in Designing Software Architectures.",
					"Perspectives for Selecting Cloud Microservices.",
					"The Vision of Self-Aware Performance Models.",
					"Can Network Analysis Techniques Help to Predict Design Dependencies? An Initial Study.",
					"Online and Offline Analysis of Streaming Data.",
					"Cost-Aware Stage-Based Experimentation: Challenges and Emerging Results.",
					"ICSA 2018: Engineering Track: Message from the Chairs.",
					"Bridging the Gap between Architecture Specifications and Simulation Models.",
					"Designing and Executing Software Architectures Models Using SysADL Studio.",
					"A Virtual Playground for Testing Smart Cyber-Physical Systems.",
					"SPARTA: Security & Privacy Architecture Through Risk-Driven Threat Assessment.",
					"Model Driven Deployment of Auto-Scaling Services on Multiple Clouds.",
					"An Efficient Mobile-Based Middleware Architecture for Building Robust, High-Performance Apps.",
					"A Tool for Traceable Evolution of Process Architectures.",
					"Web Based Tool for Traceability from Architecture Artifacts to ATAM.",
					"Using Microservices for Rapid Creation of Remote Sensing Products.",
					"Message from the WASA 2018 Organizing Committee.",
					"Modeling for Stakeholder Engagement.",
					"A Standard Driven Software Architecture for Fully Autonomous Vehicles.",
					"Viewpoint-Based Methodology for Adaption of Automotive E/E-Architectures.",
					"Building an Effective Software Issues Scorecard: An Action Research Report from the Automotive Domain.",
					"Development of a Functional Safety Software Layer for the Control of an Electric In-Wheel Motor Based Powertrain.",
					"Defining the C-ITS Reference Architecture.",
					"Innovation Welcome: An Agile Approach to Model-Based Development of Safety-Critical Embedded Systems."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "ICSA 2017",
		"info": "Gothenburg, Sweden",
		"venues": [
			{
				"sub_name_abbr": "conf/icsa/2017",
				"sub_name": "2017 IEEE International Conference on Software Architecture, ICSA 2017, Gothenburg, Sweden, April 3-7, 2017.",
				"count": 34,
				"papers": [
					"Microservice Ambients: An Architectural Meta-Modelling Approach for Microservice Granularity.",
					"Workload-Based Clustering of Coherent Feature Sets in Microservice Architectures.",
					"Research on Architecting Microservices: Trends, Focus, and Potential for Industrial Adoption.",
					"Quality Evaluation of PaaS Cloud Application Design Using Generated Prototypes.",
					"Towards a Reference Architecture for Cloud-Based Plant Genotyping and Phenotyping Analysis Frameworks.",
					"Comparing the Built-In Application Architecture Models in the Web Browser.",
					"A Framework for the Structural Analysis of REST APIs.",
					"Determination and Enforcement of Least-Privilege Architecture in Android.",
					"Understanding Software Vulnerabilities Related to Architectural Security Tactics: An Empirical Investigation of Chromium, PHP and Thunderbird.",
					"Experiments in Curation: Towards Machine-Assisted Construction of Software Architecture Knowledge Bases.",
					"Developing an Ontology for Architecture Knowledge from Developer Communities.",
					"Digital Space Systems Engineering through Semantic Data Models.",
					"Continuous Analysis of Collaborative Design.",
					"Human Aspects in Software Architecture Decision Making: A Literature Review.",
					"Modeling Context with an Architecture Viewpoint.",
					"Accurate Analysis of Quality Properties of Software with Observation-Based Markov Chain Refinement.",
					"Designing Robust Software Systems through Parametric Markov Chain Synthesis.",
					"Challenges on the Relationship between Architectural Patterns and Quality Attributes.",
					"Semantic Differencing for Message-Driven Component & Connector Architectures.",
					"On the Understandability of Semantic Constraints for Behavioral Software Architecture Compliance: A Controlled Experiment.",
					"What to Fix? Distinguishing between Design and Non-design Rules in Automated Tools.",
					"Continuous Integration Impediments in Large-Scale Industry Projects.",
					"Architecture-Based Change Impact Analysis in Information Systems and Business Processes.",
					"Continuous Architectural Knowledge Integration: Making Heterogeneous Architectural Knowledge Available in Large-Scale Organizations.",
					"On Service-Orientation for Automotive Software.",
					"Design Criteria to Architect Continuous Experimentation for Self-Driving Vehicles.",
					"CAPS: Architecture Description of Situational Aware Cyber Physical Systems.",
					"Architecting Emergent Configurations in the Internet of Things.",
					"Mapping Features to Source Code through Product Line Architecture: Traceability and Conformance.",
					"Traceability Metrics as Early Predictors of Software Defects?",
					"Bidirectional Mapping between Architecture Model and Code for Synchronization.",
					"A Taxonomy of Blockchain-Based Systems for Architecture Design.",
					"Predicting Latency of Blockchain-Based Systems Using Architectural Modelling and Simulation.",
					"Comparing Blockchain and Cloud Services for Business Process Execution."
				]
			},
			{
				"sub_name_abbr": "conf/icsa/2017w",
				"sub_name": "2017 IEEE International Conference on Software Architecture Workshops, ICSA Workshops 2017, Gothenburg, Sweden, April 5-7, 2017.",
				"count": 66,
				"papers": [
					"Current Research Topics and Trends in the Software Architecture Community: ICSA 2017 Workshops Summary.",
					"Message from the WASA 2017 Organizing Committee.",
					"Cooperative Vehicle Automation: Safety Aspects and Control Software Architecture.",
					"Containerized Development and Microservices for Self-Driving Vehicles: Experiences & Best Practices.",
					"Stakeholder Impact on the Software Architecture of Intelligent Transport Systems Implementations.",
					"Multi-faceted Reliability Assessment Techniques: An Industrial Case Study.",
					"Extending ExSched with Mixed Criticality Support - An Experience Report.",
					"Towards Industry 4.0: Gap Analysis between Current Automotive MES and Industry Standards Using Model-Based Requirement Engineering.",
					"Message from the AMS Chairs.",
					"Differences between Model-Driven Development of Service-Oriented and Microservice Architecture.",
					"Towards Recovering the Software Architecture of Microservice-Based Systems.",
					"Decision Guidance Models for Microservice Monitoring.",
					"From Monolith to Microservices: Lessons Learned on an Industrial Migration to a Web Oriented Architecture.",
					"A Dashboard for Microservice Monitoring and Management.",
					"Message from the IoT-ASAP Chairs.",
					"Self-Healing for Distributed Workflows in the Internet of Things.",
					"Towards the Web of Augmented Things.",
					"A Commitment-Based Approach to Realize Emergent Configurations in the Internet of Things.",
					"Architecting IoT Applications with SysADL.",
					"Automatic Generation of Distributed Run-Time Infrastructure for Internet of Things.",
					"Knowledge-Driven Architecture Composition: Case-Based Formalization of Integration Knowledge to Enable Automated Component Coupling.",
					"IoT-Enabled Physical Telerehabilitation Platform.",
					"On-the-Fly Computing Meets IoT Markets - Towards a Reference Architecture.",
					"Message from the MARCH 2017 Chairs.",
					"Involving Relevant Stakeholders into the Decision Process about Software Components.",
					"Using Stakeholder Preferences to Make Better Architecture Decisions.",
					"Facilitating Collaborative Decision Making with the Software Architecture Video Wall.",
					"Grounded Architectures: Using Grounded Theory for the Design of Software Architectures.",
					"Risk Appetite in Architectural Decision-Making.",
					"Risk-Based Decision-Making Fallacies: Why Present Functional Safety Standards are Not Enough.",
					"Decision Support for Reducing Unnecessary IT Complexity of Application Architectures.",
					"Message from the SODA 2017 Chairs.",
					"Anthropocentrism in Software Design: A New Reference Problem in the Design of Intelligent Sociotechnical Systems?",
					"Towards Architect's Activity Detection through a Common Model for Project Pattern Analysis.",
					"Revealing Social Debt with the CAFFEA Framework: An Antidote to Architectural Debt.",
					"Welcome Message from the ICSA 2017 Tutorial Chairs.",
					"How to Evaluate Software Architectures: Tutorial on Practical Insights on Architecture Evaluation Projects with Industrial Customers.",
					"ThingML: A Generative Approach to Engineer Heterogeneous and Distributed Systems.",
					"Language Engineering with the GEMOC Studio.",
					"Software Quality Analysis with Observation-Enhanced Quantitative Verification (Tutorial).",
					"Discover Quality Requirements with the Mini-QAW.",
					"Architectural Runtime Modeling and Visualization for Quality-Aware DevOps in Cloud Applications.",
					"Strategic Management of Technical Debt: Tutorial at ICSA 2017.",
					"Motivation and Impact of Modeling Erosion Using Static Architecture Conformance Checking.",
					"Architectural Design Group Decision-Making in Agile Projects.",
					"Automatic Uncertainty Detection in Software Architecture Documentation.",
					"A Catalog of Security Architecture Weaknesses.",
					"Architecting Microservices.",
					"A Web-Based Reference Architecture for Mobile Learning: Its Quality Aspects and Evaluation.",
					"Semantics-Driven Optimistic Data Replication: Towards a Framework Supporting Software Architects and Developers.",
					"Welcome Message from the ICSA 2017 Industry Track Co-Chairs.",
					"Microservice Architectures for Scalability, Agility and Reliability in E-Commerce.",
					"System for Collection and Processing of Smart Home Sensor Data.",
					"Quality Attribute Trade-Offs in Industrial Software Systems.",
					"Communication Overhead Reduction by Algorithmic Redundancy in Embedded Systems.",
					"Software Architecture Decoupling at Ericsson.",
					"A Reflexion Model Based Architecture Conformance Analysis Toolkit for OSGi-Compliant Applications.",
					"Welcome Message from the Tool Demonstrations Chairs of ICSA 2017.",
					"ArchiMedes Publication and Integration of Architectural Knowledge.",
					"Querying Software Architecture Knowledge as Linked Open Data.",
					"ActivFORMS: A Runtime Environment for Architecture-Based Adaptation with Guarantees.",
					"Arcan: A Tool for Architectural Smells Detection.",
					"CAPS: A Tool for Architecting Situational-Aware Cyber-Physical Systems.",
					"Parallel and Generic Pipe-and-Filter Architectures with TeeTime.",
					"CASPA: A Platform for Comparability of Architecture-Based Software Performance Engineering Approaches.",
					"MicroART: A Software Architecture Recovery Tool for Maintaining Microservice-Based Systems."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "13th WICSA 2016",
		"info": "Venice, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2016",
				"sub_name": "13th Working IEEE/IFIP Conference on Software Architecture, WICSA 2016, Venice, Italy, April 5-8, 2016.",
				"count": 47,
				"papers": [
					"A Multiple Case Study of Continuous Architecting in Large Agile Companies: Current Gaps and the CAFFEA Framework.",
					"Empirical Research in Software Architecture: How Far have We Come?",
					"An Experience Report on Detecting and Repairing Software Architecture Erosion.",
					"Characterizing Implicit Communal Components as Technical Debt in Automotive Software Systems.",
					"Missed Architectural Dependencies: The Elephant in the Room.",
					"A Decision Model for Cyber-Foraging Systems.",
					"Distilling Architectural Design Decisions and Their Relationships Using Frequent Item-Sets.",
					"Creating Software Modernization Roadmaps: The Architecture Options Workshop.",
					"Flow Sensitive Slicing for MATLAB/Simulink Models.",
					"Software Architecture Pattern Morphology in Open-Source Systems.",
					"Automated Extraction of Rich Software Models from Limited System Information.",
					"System Architecture Recovery Based on Software Structure Model.",
					"Defeasible Argumentation of Software Architectures.",
					"On the Architecture of Liquid Software: Technology Alternatives and Design Space.",
					"Architectural Knowledge for Technology Decisions in Developer Communities: An Exploratory Study with StackOverflow.",
					"Model-Driven Observability for Big Data Storage.",
					"Specifying Architecture Behavior with SysADL.",
					"Continuous Architecting of Stream-Based Systems.",
					"Behavior-Based Architecture Reconstruction and Conformance Checking.",
					"Architectural Tactics for the Design of Efficient PaaS Cloud Applications.",
					"Statistical Approach to Architecture Modes in Smart Cyber Physical Systems.",
					"Relating Architectural Decay and Sustainability of Software Systems.",
					"The Blockchain as a Software Connector.",
					"Towards a HTML-UI-Compositor by Introducing the Wayland-Protocol into a Browser-Engine.",
					"Modern Software Architecture for Embedded Real-Time Devices: High Value, Little Overhead.",
					"Mining Software Component Interactions to Detect Security Threats at the Architectural Level.",
					"Towards an Architecture-Centric Approach to Security Analysis.",
					"Improving Testing in an Enterprise SOA with an Architecture-Based Approach.",
					"Architecture-Violation Management for Internal Software Ecosystems.",
					"Tutorial Summary for Designing Software Architectures Using ADD 3.0.",
					"Tutorial Summary for Speed, Data and Ecosystems: The Future of Software Engineering.",
					"Tutorial Summary for Dependability Analysis in the Context of Component-Based System Architectures.",
					"Architectural Pattern Definition for Semantically Rich Modular Architectures.",
					"On Formalizing and Identifying Patterns in Cloud Workload Specifications.",
					"A Reference Structure for Metamodels of Quality-Aware Domain-Specific Languages.",
					"Architectural Data Flow Analysis.",
					"Investigating Software Deployment on Heterogeneous Platforms.",
					"On Timing Analysis of Component-Based Vehicular Distributed Embedded Systems at Various Abstraction Levels.",
					"Context-Aware Software Ecosystem for Industrial Products.",
					"Context-Based Architectural Security Analysis.",
					"Variability Handling for Mobile Banking Apps on iOS and Android.",
					"Introducing Software Product Lines in Model-Based Design Processes: An Industrial Experience.",
					"A Reference Architecture for Software Protection.",
					"An Evaluation of Design Rule Spaces as Risk Containers.",
					"MUSA: A Scalable Multi-touch and Multi-perspective Variability Management Tool.",
					"BUDGET: A Tool for Supporting Software Architecture Traceability Research.",
					"Architectural Analysis of MATLAB/Simulink Models with Artshop."
				]
			},
			{
				"sub_name_abbr": "conf/wicsa/2016qrasa",
				"sub_name": "Qualitative Reasoning about Software Architectures, QRASA@WICSA 2016, Venice, Italy, April 5-8, 2016.",
				"count": 4,
				"papers": [
					"Rule Type Based Reasoning on Architecture Violations: A Case Study.",
					"Rigorous Architectural Reasoning for Self-Adaptive Software Systems.",
					"Reflective Approach for Software Design Decision Making.",
					"Architectural Patterns and Quality Attributes Interaction."
				]
			},
			{
				"sub_name_abbr": "conf/wicsa/2016march",
				"sub_name": "1st International Workshop on Decision Making in Software ARCHitecture, MARCH@WICSA, Venice, Italy, April 5, 2016.",
				"count": 6,
				"papers": [
					"Inclusion of Ethical Aspects in Multi-criteria Decision Analysis.",
					"A Context Model for Architectural Decision Support.",
					"Architectural Decision-Making in Open-Source Systems - Preliminary Observations.",
					"Towards Software Assets Origin Selection Supported by a Knowledge Repository.",
					"DecDoc: A Tool for Documenting Design Decisions Collaboratively and Incrementally.",
					"SECO Patterns: Architectural Decision Support in Software Ecosystems."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "12th WICSA 2015",
		"info": "Montreal, QC, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2015",
				"sub_name": "12th Working IEEE/IFIP Conference on Software Architecture, WICSA 2015, Montreal, QC, Canada, May 4-8, 2015.",
				"count": 21,
				"papers": [
					"The Danger of Architectural Technical Debt: Contagious Debt and Vicious Circles.",
					"A Study on Architectural Decision-Making in Context.",
					"An Architecture Framework for Collective Intelligence Systems.",
					"Supporting Dynamic Software Architectures: From Architectural Description to Implementation.",
					"A Unified Approach to Architecture Conformance Checking.",
					"Hotspot Patterns: The Formal Definition and Automatic Detection of Architecture Smells.",
					"When Software Architecture Leads to Social Debt.",
					"Architectural Technical Debt Identification Based on Architecture Decisions and Change Scenarios.",
					"Why Data Needs more Attention in Architecture Design - Experiences from Prototyping a Large-Scale Mobile App Ecosystem.",
					"Architectural Decision Guidance Across Projects - Problem Space Modeling, Decision Backlog Management and Cloud Computing Knowledge.",
					"Architecture Knowledge for Evaluating Scalable Databases.",
					"A Conceptual Model for Architecting Mobile Applications.",
					"Architecting in the Automotive Domain: Descriptive vs Prescriptive Architecture.",
					"A Proactive Support for Conceptual Interoperability Analysis in Software Systems.",
					"Exploring Software Architecture Context.",
					"Architecting in a Solution Costing Context: Early Experiences with Solution-Based Estimating.",
					"Towards Architecting for Continuous Delivery.",
					"Enriching Architecture Knowledge with Technology Design Decisions.",
					"Migrating to an Extensible Architecture for Abstract Syntax Trees.",
					"Proactive Detection of Higher-Order Software Design Conflicts.",
					"A Conversation Based Approach for Modeling REST APIs."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "11th WICSA 2014",
		"info": "Sydney, NSW, Australia",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2014",
				"sub_name": "2014 IEEE/IFIP Conference on Software Architecture, WICSA 2014, Sydney, Australia, April 7-11, 2014.",
				"count": 36,
				"papers": [
					"The Stream Software Connector Design Space: Frameworks and Languages for Distributed Stream Processing.",
					"The Role of Platform Boundary Resources in Software Ecosystems: A Case Study.",
					"A Journey through the Land of Model-View-Design Patterns.",
					"Deriving Component Interfaces after a Restructuring of a Legacy System.",
					"Green Architectural Tactics for the Cloud.",
					"Lessons Learned from Safety-Critical Software-Based Automation Architectures of Nuclear Power Plants.",
					"Scalability of Ecosystem Architectures.",
					"Sustaining Agility through Architecture: Experiences from a Joint Research and Development Laboratory.",
					"A Flexible Framework for Runtime Monitoring of System-of-Systems Architectures.",
					"Scapegoat: An Adaptive Monitoring Framework for Component-Based Systems.",
					"Consistent Runtime Evolution of Service-Based Business Processes.",
					"Architecture Adaptation Based on Belief Inaccuracy Estimation.",
					"Architecting Self-Aware Software Systems.",
					"Automatic Reference Architecture Conformance Checking for SOA-Based Software Systems.",
					"Evaluating a Representational State Transfer (REST) Architecture: What is the Impact of REST in My Architecture?",
					"Software Architecture Evaluation in Practice: Retrospective on More Than 50 Architecture Evaluations in Industry.",
					"A Recoverability-Oriented Analysis for Operations on Cloud Applications.",
					"Component-Aware Triggered Scenarios.",
					"Processing the Evolution of Quality Requirements of Web Service Orchestrations: A Pattern-Based Approach.",
					"Consolidating a Process for the Design, Representation, and Evaluation of Reference Architectures.",
					"Inconsistency Resolution in Merging Versions of Architectural Models.",
					"Cumulative Software Architecture Development.",
					"Towards a Reference Architecture to Provision Tools as a Service for Global Software Development.",
					"The Functional Architecture Modeling Method Applied on Web Browsers.",
					"Architectural Decisions for HW/SW Partitioning Based on Multiple Extra-Functional Properties.",
					"A Study on Group Decision-Making in Software Architecture.",
					"Towards an Evidence-Based Understanding of Emergence of Architecture through Continuous Refactoring in Agile Software Development.",
					"A Dynamic Software Product Line Architecture for Prepackaged Expert Analytics: Enabling Efficient Capture, Reuse and Adaptation of Operational Knowledge.",
					"The Supportive Effect of Traceability Links in Architecture-Level Software Understanding: Two Controlled Experiments.",
					"Industrial Implementation of a Documentation Framework for Architectural Decisions.",
					"Model-Based Formalization of Software Architecture Knowledge.",
					"Empirical Study of Architectural Knowledge Management Practices.",
					"Agile Software Architecture in Advanced Data Analytics.",
					"Architecting in Networked Organizations.",
					"Architecture Description Leveraging Model Driven Engineering and Semantic Wikis.",
					"Systematic Architectural Decision Management, A Process-Based Approach."
				]
			},
			{
				"sub_name_abbr": "conf/wicsa/2014c",
				"sub_name": "Proceedings of the WICSA 2014 Companion Volume, Sydney, NSW, Australia, April 7-11, 2014.",
				"count": 16,
				"papers": [
					"Towards a pattern language for self-adaptation of cloud-based architectures.",
					"On improving the dependability of cloud applications with fault-tolerance.",
					"A security reference architecture for cloud systems.",
					"Empirical evaluation of the understandability of architectural component diagrams.",
					"Towards quantitative metrics for architecture models.",
					"Runtime verification of state machines and defect localization applying model-based testing.",
					"A framework for architecture-driven migration of legacy systems to cloud-enabled software.",
					"A metamodel for the support of semantically rich modular architectures in the context of static architecture compliance checking.",
					"Towards flexible automated software architecture erosion diagnosis and treatment.",
					"On bridging the gap between practice and vision for software architecture reconstruction and evolution: a toolbox perspective.",
					"Modeling multiplicity and hierarchy in product line architectures: extending a decision-oriented approach.",
					"Architectural bad smells in software product lines: an exploratory study.",
					"Composition of applications based on software product lines using architecture fragments and component sets.",
					"Variability viewpoint to describe reference architectures.",
					"An architecture design method for critical embedded systems.",
					"A reference architecture for providing tools as a service to support global software development."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "10th WICSA / 6th ECSA 2012",
		"info": "Helsinki, Finland",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2012",
				"sub_name": "2012 Joint Working IEEE/IFIP Conference on Software Architecture and European Conference on Software Architecture, WICSA/ECSA 2012, Helsinki, Finland, August 20-24, 2012.",
				"count": 48,
				"papers": [
					"A Case Study on the Evolution of a Component-based Product Line.",
					"Supporting ARINC 653-based Dynamic Reconfiguration.",
					"Supporting Model Maintenance in Component-based Product Lines.",
					"Workload-aware System Monitoring Using Performance Predictions Applied to a Large-scale E-Mail System.",
					"Reusable Formal Models for Secure Software Architectures.",
					"SecArch: Architecture-level Evaluation and Testing for Security.",
					"A Runtime Resource-aware Architecture for Service-oriented Embedded Systems.",
					"COAST: An Architectural Style for Decentralized On-Demand Tailored Services.",
					"Extracting and Facilitating Architecture in Service-Oriented Software Systems.",
					"In Search of a Metric for Managing Architectural Technical Debt.",
					"Forces on Architecture Decisions - A Viewpoint.",
					"Architectural Decision Making for Service-Based Platform Integration: A Qualitative Multi-Method Study.",
					"Ontology-based Software Architecture Documentation.",
					"On the Composition and Reuse of Viewpoints across Architecture Frameworks.",
					"A Study of Architectural Information Foraging in Software Architecture Documents.",
					"Semantic Analysis of Component-aspect Dynamism for Connector-based Architecture Styles.",
					"Automated Analysis and Code Generation for Domain-Specific Models.",
					"Exploiting Traceability Uncertainty between Architectural Models and Code.",
					"Quality-Centric Approach for Software Component Identification from Object-Oriented Code.",
					"TopDocs: Using Software Architecture Knowledge Base for Generating Topical Documents.",
					"Using Architectural Patterns to Define Architectural Decisions.",
					"A Viewpoint for Dealing with Change in Migration to Services.",
					"Capturing and Maintaining Architectural Knowledge Using Context Information.",
					"Modelling Architectural Decisions under Changing Requirements.",
					"Design Principles for Effective Knowledge Discovery from Big Data.",
					"A Generic Platform for Enterprise Gamification.",
					"Net4Care: Towards a Mission-Critical Software Ecosystem.",
					"Architecture-aware Programming in Agile Environments.",
					"Architecture Engagement Purposes: Towards a Framework for Planning \"Just Enough\"-Architecting in Software Engineering.",
					"Using an Architecture Description Language to Model a Large-Scale Information System - An Industrial Experience Report.",
					"Architecture for Large-Scale Innovation Experiment Systems.",
					"Towards Dependable Emergent Ensembles of Components: The DEECo Component Model.",
					"MORPHOSIS: A Lightweight Method Facilitating Sustainable Software Architectures.",
					"Simulating Structural Design Evolution of Software.",
					"Integrating Variability Management and Software Architecture.",
					"A Variability Viewpoint for Enterprise Software Systems.",
					"Dedal-CDL: Modeling First-class Architectural Changes in Dedal.",
					"Understanding the Context of Architecture Evaluation Methods.",
					"A Reference Architecture for Mobile Code Offload in Hostile Environments.",
					"Utilizing Clone Detection for Domain Analysis of Simulation Systems.",
					"A Framework for Obtaining the Ground-Truth in Architectural Recovery.",
					"RAModel: A Reference Model for Reference Architectures.",
					"Automated Reliability Prediction from Formal Architectural Descriptions.",
					"Enabling Performance Antipatterns to Arise from an ADL-based Software Architecture.",
					"Issues Dealing with Non-Functional Requirements across the Contractual Divide.",
					"TracQL: A Domain-Specific Language for Traceability Analysis.",
					"An Architectural Approach for Cost Effective Trustworthy Systems.",
					"Documenting Early Architectural Assumptions in Scenario-Based Requirements."
				]
			},
			{
				"sub_name_abbr": "conf/wicsa/2012c",
				"sub_name": "2012 Joint Working IEEE/IFIP Conference on Software Architecture and European Conference on Software Architecture, WICSA/ECSA 2012, Helsinki, Finland, August 20-24, 2012 - Companion Volume.",
				"count": 35,
				"papers": [
					"Nordic Symposium on Cloud Computing and Internet Technologies (NordiCloud).",
					"Cloud infrastructure for providing tools as a service: quality attributes and potential solutions.",
					"Elements for a cloud-based development environment: online collaboration, revision control, and continuous integration.",
					"An architecture framework for application-managed scaling of cloud-hosted relational databases.",
					"Message-driven FP-growth.",
					"Delivering ICT infrastructure for biomedical research.",
					"Does cloud computing deliver the promised benefits for IT industry?",
					"Framework for monitoring and testing web application scalability on the cloud.",
					"A lean and mean strategy for migration to services.",
					"A first account on stigmergic information systems and their impact on platform development.",
					"Enough about standardization, let's build cloud applications.",
					"Towards bridging the communication gap between consumers and providers in the cloud.",
					"Towards component-based software engineering of cloud applications.",
					"myTrustedCloud: trusted cloud infrastructure for security-critical computation and data management.",
					"Software architecture tool demonstrations.",
					"VULCAN: architecture-model-based software development workbench.",
					"Workshop on SHAring and Reusing architectural Knowledge (SHARK 2012).",
					"\"Just-in-time\" architectural knowledge for developers.",
					"Architectural decision identification in architectural patterns.",
					"A reference architecture template for software-intensive embedded systems.",
					"Aligning architecture knowledge management with Scrum.",
					"Graph-based implicit knowledge discovery from architecture change logs.",
					"A case study on co-evolution of software artifacts using integrated views.",
					"Second international workshop on variability in software architecture.",
					"Modeling variability in product lines using domain quality attribute scenarios.",
					"The role of variability patterns in multi-tenant business software.",
					"How variation changes when an embedded product ceases to be embedded?",
					"Configurator-as-a-service: tool support for deriving software architectures at runtime.",
					"Reference architectures and variability: current status and future perspectives.",
					"Variability viewpoint for introducing variability in software architecture viewpoints.",
					"Architectures and platforms for knowledge discovery from data: workshop at WICSA/ECSA 2012.",
					"Data management requirements for a knowledge discovery platform.",
					"Formal concept analysis for identifying mobile subscribers: a case study in a governmental transition project.",
					"Unified analytics platform for big data.",
					"A short survey on the state of the art in architectures and platforms for large scale data analysis and knowledge discovery from data."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "9th WICSA 2011",
		"info": "Boulder, Colorado, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2011",
				"sub_name": "9th Working IEEE/IFIP Conference on Software Architecture, WICSA 2011, Boulder, Colorado, USA, June 20-24, 2011.",
				"count": 51,
				"papers": [
					"Making Abstraction Concrete.",
					"Architecting as a Risk- and Cost Management Discipline.",
					"Capabilities and Features: Linking Business and Application Architectures.",
					"Prioritizing Architectural Concerns.",
					"Experiences with Semantic Wikis for Architectural Knowledge Management.",
					"Attempting to Understand the Progress of Software Architecture Decision-Making on Large Australian Defence Projects.",
					"Automatic Tracing of Decisions to Architecture and Implementation.",
					"Industrial Architectural Assessment Using TARA.",
					"Evaluation of the Use of Quality Attribute Scenarios in a Plug-In Hybrid Electric Vehicle Controls System - Industrial Case Study.",
					"The Boomeranged Software Architect.",
					"Quantifying the Analyzability of Software Architectures.",
					"SOFAS: A Lightweight Architecture for Software Analysis as a Service.",
					"Analysis and Management of Architectural Dependencies in Iterative Release Planning.",
					"Exploring Approaches of Integration Software Architecture Modeling with Quality Analysis Models.",
					"A Runtime Resource-Management Framework for Embedded Service-Oriented Systems.",
					"Evaluating Security Properties of Architectures in Unpredictable Environments: A Case for Cloud.",
					"A Supportability Framework.",
					"The Need for a Multilevel Context-Aware Software Architecture Analysis and Design Method with Enterprise and System Architecture Concerns as First Class Entities.",
					"Towards Automation of Performance Architectural Tactics Application.",
					"A-3: An Architectural Style for Coordinating Distributed Components.",
					"Handling Variability in Software Architecture: Problems and Implications.",
					"The Dutch Nationwide Electronic Health Record: Why the Centralised Services Architecture?",
					"ABE: An Agent-Based Software Architecture for a Multimodal Emotion Recognition Framework.",
					"Architecture Reconstruction and Analysis of Medical Device Software.",
					"An Architectural Approach to Support Online Updates of Software Product Lines.",
					"From Object-Oriented Applications to Component-Oriented Applications via Component-Oriented Architecture.",
					"Evaluating Simple Dependency Diagrams in Industry.",
					"Dominion: An Architecture-Driven Approach to Generating Efficient Constraint Solvers.",
					"An Architectural Style for Liquid Web Services.",
					"Patterns Transform Architectures.",
					"Software Architecture Documentation: The Road Ahead.",
					"Capturing Architecture Documentation Navigation Trails for Content Chunking and Sharing.",
					"Mature Architecting - A Survey about the Reasoning Process of Professional Architects.",
					"Architecturally Significant Requirements, Reference Architecture, and Metamodel for Knowledge Management in Information Technology Services.",
					"First International Workshop on Variability in Software Architecture (VARSA 2011).",
					"From Requirements to Architecture for Software Product Lines.",
					"Towards a Solution for Change Impact Analysis of Software Product Line Products.",
					"Challenges of Variability in Model-Driven and Transformational Approaches: A Systematic Survey.",
					"Feature Based Variability for Service Oriented Architectures.",
					"Architecting Cloud Computing Applications and Systems.",
					"Modeling and Reasoning about Design Alternatives of Software as a Service Architectures.",
					"The SPOSAD Architectural Style for Multi-tenant Software Applications.",
					"Assessing Suitability of Cloud Oriented Platforms for Application Development.",
					"Engineering Proprioception in SLA Management for Cloud Architectures.",
					"Architecture-Based Testing and System Validation - Workshop Summary.",
					"A Method for Evidence-Based Architecture Discovery.",
					"Workshop on Standards for (software) Architecture: An Assessment.",
					"Palladio Workbench: A Quality-Prediction Tool for Component-Based Architectures.",
					"PRIDE - An Environment for Component-Based Development of Distributed Real-Time Embedded Systems.",
					"SAVE: Software Architecture Environment for Modeling Views.",
					"KaitoroCap: A Document Navigation Capture and Visualisation Tool."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "8th WICSA / 3rd ECSA 2009",
		"info": "Cambridge, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2009",
				"sub_name": "Joint Working IEEE/IFIP Conference on Software Architecture 2009 and European Conference on Software Architecture 2009, WICSA/ECSA 2009, Cambridge, UK, 14-17 September 2009.",
				"count": 53,
				"papers": [
					"Defining execution viewpoints for a large and complex software-intensive system.",
					"Viewpoints for modeling choreographies in service-oriented architectures.",
					"Automated architectural component classification using concept lattices.",
					"Every architecture description needs a framework: Expressing architecture frameworks using ISO/IEC 42010.",
					"Open source based tools for sharing and reuse of software architectural knowledge.",
					"Ontology-driven visualization of architectural design decisions.",
					"The lonesome architect.",
					"Performance modeling evolving Enterprise Service Oriented Architectures.",
					"An exploratory study of architectural practices and challenges in using agile software development approaches.",
					"A case study of the Architecture Business Cycle for an in-vehicle software architecture.",
					"Evolutionary architecting of embedded automotive product lines: An industrial case study.",
					"Using architecture integration patterns to compose enterprise mashups.",
					"Towards a generic architecture for multi-level modeling.",
					"Evolution styles: Foundations and tool support for software architecture evolution.",
					"A classification of software reference architectures: Analyzing their success and effectiveness.",
					"Assisting the synchronization of UCM-based architectural documentation with implementation.",
					"PADL2Java: A Java code generator for process algebraic architectural descriptions.",
					"Architectural styles for runtime software adaptation.",
					"Self-Repairing systems modeling and verification using AGG.",
					"A pattern language for multi-agent systems.",
					"Feature model to product architectures: Applying MDE to Software Product Lines.",
					"A consumer-centred approach for service-oriented product line development.",
					"Plastic Partial Components: A solution to support variability in architectural components.",
					"Verifying architectural variabilities in software fault tolerance techniques.",
					"Weaving a network of architectural knowledge.",
					"On the need of architectural patterns in AOSD for software evolution.",
					"Exploring ontologies to support the establishment of reference architectures: An example on software testing.",
					"Modeling constraints improves software architecture design reasoning.",
					"RQ-Tech method for user-involved software development.",
					"Detecting architecture instabilities with concern traces: An exploratory study.",
					"Characterizing essential and incidental complexity in software architectures.",
					"From retrospect to prospect: Assessing modularity and stability from software architecture.",
					"Towards a Method for Analyzing Architectural Support Levels of Usability.",
					"An architecting method for distributed process-intensive systems.",
					"Self-optimizing architecture for ensuring Quality Attributes in the cloud.",
					"The anatomy and physiology of the grid revisited.",
					"On service-oriented architectural concerns and viewpoints.",
					"Architectural design decision: Existing models and tools.",
					"Integrating decision management with UML modeling concepts and tools.",
					"A model to represent architectural design rationale.",
					"Embedded design rationale in software architecture.",
					"Generate and test as a software architecture design approach.",
					"Introducing Aspect-oriented Space Containers for efficient publish/subscribe scenarios in Intelligent Transportation Systems.",
					"Layered architecture revisited - Comparison of research and practice.",
					"Interaction-sensitive synthesis of architectural tactics in connector designs.",
					"Reviewing architecture documents using question sets.",
					"Multiple viewpoints architecture extraction.",
					"The system context architectural viewpoint.",
					"Modeling architectural change: Architectural scripting and its applications to reconfiguration.",
					"Evaluation of dynamic adaptivity through metrics: an achievable target?",
					"Towards a formalization of mediating connectors for on the fly interoperability.",
					"An architectural style for optimizing system qualities in adaptive embedded systems using Multi-Objective Optimization.",
					"A model-based multi-level architectural reconfiguration applied to adaptability management in context-aware cooperative communication support systems."
				]
			},
			{
				"sub_name_abbr": "conf/wicsa/2009soar",
				"sub_name": "Self-Organizing Architectures, First International Workshop, SOAR 2009, Cambridge, UK, September 14, 2009, Revised Selected and Invited Papers.",
				"count": 13,
				"papers": [
					"Elements of Self-adaptive Systems - A Decentralized Architectural Perspective.",
					"Improving Architecture-Based Self-adaptation Using Preemption.",
					"Weaving the Fabric of the Control Loop through Aspects.",
					"Self-organisation for Survival in Complex Computer Architectures.",
					"Self-organising Sensors for Wide Area Surveillance Using the Max-sum Algorithm.",
					"Multi-policy Optimization in Self-organizing Systems.",
					"A Bio-inspired Algorithm for Energy Optimization in a Self-organizing Data Center.",
					"Towards a Pervasive Infrastructure for Chemical-Inspired Self-organising Services.",
					"Self-adaptive Architectures for Autonomic Computational Science.",
					"Modelling the Asynchronous Dynamic Evolution of Architectural Types.",
					"A Self-organizing Architecture for Traffic Management.",
					"On the Modeling, Refinement and Integration of Decentralized Agent Coordination.",
					"A Self-organizing Architecture for Pervasive Ecosystems."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "7th WICSA 2008",
		"info": "Vancouver, BC, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2008",
				"sub_name": "Seventh Working IEEE / IFIP Conference on Software Architecture (WICSA 2008), 18-22 February 2008, Vancouver, BC, Canada.",
				"count": 45,
				"papers": [
					"Software Architecture in Game Development.",
					"Software Architecture Challenges for Data Intensive Computing.",
					"An Economics-Driven Approach for Valuing Scalability in Distributed Architectures.",
					"Efficient Quality Impact Analyses for Iterative Architecture Construction.",
					"On the Quantitative Analysis of Architecture Stability in Aspectual Decompositions.",
					"An Integrated Lightweight Software Architecture for Mobile Business Applications.",
					"Component Model and Architecture of Smart Devices for Elderly.",
					"Media Player Software in a System of Subsystems.",
					"uDesign: End-User Design Applied to Monitoring and Control Applications for Smart Spaces.",
					"Analyzing the Evolution of Large-Scale Software Systems Using Design Structure Matrices and Design Rule Theory: Two Exploratory Cases.",
					"Interplay of Architecture, Business Goals, and Current Technology in the Evolution of Call Center Systems.",
					"The MeDICi Integration Framework: A Platform for High Performance Data Streaming Applications.",
					"Coordination Implications of Software Architecture in a Global Software Development Project.",
					"Teaching Software Architecture Design.",
					"A Just-In-Time Architectural Knowledge Sharing Portal.",
					"A Pattern-Based Approach to Development of Service Mediators for Protocol Mediation.",
					"Analysis of Architecture Pattern Usage in Legacy System Architecture Documentation.",
					"Combining Pattern Languages and Reusable Architectural Decision Models into a Comprehensive and Comprehensible Design Method.",
					"Introducing Recovery Style for Modeling and Analyzing System Recovery.",
					"Guiding Architectural Decisions with the Influencing Factors Method.",
					"Value-Based Design Decision Rationale Documentation: Principles and Empirical Feasibility Study.",
					"The Role of Dependency Links in Ensuring Architectural View Consistency.",
					"Using Types to Enforce Architectural Structure.",
					"Towards Automated Solution Synthesis and Rationale Capture in Decision-Centric Architecture Design.",
					"Architectural Effects on Requirements Decisions: An Exploratory Study.",
					"Developing Value Assessment for SW Architecture.",
					"Evaluating the Software Architecture Competence of Organizations.",
					"Importance of Software Architecture during Release Planning.",
					"Ready! Set! Go! An Action Research Agenda for Software Architecture Research.",
					"Can Styles Improve Architectural Pattern Reuse?",
					"Understanding Architectural Assets.",
					"Wishes and Boundaries for a Software Architecture Knowledge Community.",
					"A Framework for Estimating the Impact of a Distributed Software System's Architectural Style on its Energy Consumption.",
					"A Software Architecture for Cross-Layer Wireless Network Adaptations.",
					"Extraction of Component-Based Architecture from Object-Oriented Systems.",
					"Simulating Software Architectures for Functional Analysis.",
					"Towards Software Architecture Physiology: Identifying Vital Components.",
					"\"The 3+1 Views of Architecture (in 3D)\": An Amplification of the 4+1 Viewpoint Framework.",
					"Updating IEEE 1471: Architecture Frameworks and Other Topics.",
					"Defining Service-Oriented Software Architecture Models for a MDA-based Development Process at the PIM level.",
					"Effective Realization of Software Architectural Styles with Aspects.",
					"A Modifiable Agent-Based Software Architecture for Intelligent Virtual Environments for Training.",
					"Automatic Rule Derivation for Adaptive Architectures.",
					"Supporting the Evolution of Product Line Architectures with Variability Model Fragments.",
					"Towards a Formal Model for Reconfigurable Software Architectures by Bigraphs."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "6th WICSA 2007",
		"info": "Mumbai, Maharashtra, India",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2007",
				"sub_name": "Sixth Working IEEE / IFIP Conference on Software Architecture (WICSA 2007), 6-9 January 2005, Mumbai, Maharashtra, India.",
				"count": 43,
				"papers": [
					"Risk Themes Discovered through Architecture Evaluations.",
					"Assessing the Architectonics of Large, Software-Intensive Systems Using a Knowledge-Based Approach.",
					"Inside Architecture Evaluation: Analysis and Representation of Optimization Potential.",
					"Tool Support for Architectural Decisions.",
					"Do Architecture Design Methods Meet Architects' Needs?",
					"A Framework for the Assessment and Selection of Software Components and Connectors in COTS-Based Architectures.",
					"A Model-Driven Approach to Extract Views from an Architecture Description Language.",
					"Architecture Assessment Model for System Evolution.",
					"An Architectural Style for Ajax.",
					"Assessing a Multi-Site Development Organization for Architectural Compliance.",
					"Constructing a Reading Guide for Software Product Audits.",
					"A Comparison of Static Architecture Compliance Checking Approaches.",
					"An Integrated QoS-Aware Service Development and Management Framework.",
					"Flexible Software Development: From Software Architecture to Process.",
					"Adaptation and Distribution of Pipeline-Based Context-Aware Web Architectures.",
					"The Impact of Requirements Knowledge and Experience on Software Architecting: An Empirical Study.",
					"Architectural Misalignment: An Experience Report.",
					"Setting up Architect Team.",
					"Training Initiative for New Software/Enterprise Architects: An Ontological Approach.",
					"The Duties, Skills, and Knowledge of Software Architects.",
					"Middleware-Induced Architectural Style Modelling for Architecture Exploration.",
					"Decision-Oriented Modeling of Product Line Architectures.",
					"Requirements and Scenarios: Running Aspect-Oriented Software Architectures.",
					"The Architecture-Requirements Interaction.",
					"Non-Functional Modeling and Validation in Model-Driven Architecture.",
					"Architecting Pervasive Computing Systems for Privacy: A Survey.",
					"Working Session: Software Architecture Competence.",
					"Tackling Offshore Communication Challenges with Agile Architecture-Centric Development.",
					"What Makes Software Architecture-Based Testing Distinguishable.",
					"Designing Domain-Specific Software Architecture (DSSA): Towards a New Approach.",
					"Architecture Knowledge Management: Concepts, Technologies, Challenges.",
					"Integrating Architecture-Centric Methods into Object-Oriented Analysis and Design.",
					"Producing Software Architecture Documentation to Suit Your Needs.",
					"An Introduction to Effectively Evaluating Software Architectures.",
					"Architecture Design for Globally Distributed Projects.",
					"An Architectural Framework for Non Functional Requirements in Enterprise SOA Adoption.",
					"Refactoring Methods.",
					"Aligning Architectural Approaches towards an SOA-Based Enterprise Architecture.",
					"Performance Analysis of Distributed Software Systems: Approaches Based on Queueing Theory.",
					"Lightweight Dependency Models to Manage Software Architecture.",
					"Pattern Oriented Software Architecture: Patterns for Resource Management.",
					"Best Practices for Writing and Managing Performance, Reliability, and Availability Requirements.",
					"Architecting Fault Tolerant Systems."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "5th WICSA 2005",
		"info": "Pittsburgh, Pennsylvania, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2005",
				"sub_name": "Fifth Working IEEE / IFIP Conference on Software Architecture (WICSA 2005), 6-10 November 2005, Pittsburgh, Pennsylvania, USA.",
				"count": 76,
				"papers": [
					"5th Working IEEE/IFIP Conference on Software Architecture - Cover.",
					"5th Working IEEE/IFIP Conference on Software Architecture - Title.",
					"5th Working IEEE/IFIP Conference on Software Architecture - Copyright.",
					"5th Working IEEE/IFIP Conference on Software Architecture - TOC.",
					"Message from Chairs.",
					"Conference Committee.",
					"Program Committee.",
					"Quantitative Observation and Theoretical Construction in Software Architecture.",
					"What Architects Should Know About Reverse Engineering and Rengineering.",
					"Sparking Research Ideas from the Friction Between Doctrine and Reality.",
					"On the Meeting of Software Architecture and Reverse Engineering.",
					"Using Architectural Perspectives.",
					"Customized Benchmark Generation Using MDA.",
					"Extending the ATAM Architecture Evaluation to Product Line Architectures.",
					"GEAR: A Good Enough Architectural Requirements Process.",
					"Predicting Change Impact in Architecture Design with Bayesian Belief Networks.",
					"Generalizing a Model of Software Architecture Design from Five Industrial Approaches.",
					"A Survey of the Use and Documentation of Architecture Design Rationale.",
					"ACCA: An Architecture-Centric Concern Analysis Method.",
					"Software Architecture as a Set of Architectural Design Decisions.",
					"Preserving Architectural Choices throughout the Component-based Software Development Process.",
					"Mapping ADL Specifications to an Efficient and Reconfigurable Runtime Component Platform.",
					"How Does the Architect's Role Change as the Software Ages?.",
					"A Declarative Approach to Architectural Reflection.",
					"A Case Study in Incremental Architecture-Based Re-engineering of a Legacy Application.",
					"Generalizing Consistency Checking between Software Views.",
					"Working Session Reports.",
					"Software Architecture Education Session Report.",
					"Quality Session Report.",
					"Encapsulating Quality Attribute Knowledge.",
					"Classifying Software Architecture Quality Research.",
					"Octopus Architecture: A New Attempt to Achieve Reliable OS.",
					"Quality-Driven Software Architecture Model Transformation.",
					"Providing Support for Safe Software Architecture Transformations.",
					"Software Architecture Reliability Analysis Using Failure Scenarios.",
					"Change Propagation for Assessing Design Quality of Software Architectures.",
					"Architecting Session Report.",
					"Dynamic Memory Management for Software Product Family Architectures in Embedded Real-Time Systems.",
					"Case Study on Architecture-Centered Design for Monitoring Views at CERN.",
					"Integration Problems of Core Components in a Web Product Line.",
					"Breakable Objects: Building Blocks for Flexible Application Architectures.",
					"Coordination in Software Architectures: an Aspect-Oriented Approach.",
					"Reflection on Software Architecture Practices - What Works, What Remains to Be Seen, and What Are the Gaps.",
					"Feature-Guided Architecture Development for Embedded System Families.",
					"Software Architecture Evaluation and Analysis Session Report.",
					"Measuring Architecting Effort.",
					"Predicting Architectural Styles from Component Specifications.",
					"Introducing Ambient Calculus in Mobile Aspect-Oriented Software.",
					"Towards a Set of Application Independent Clustering Criteria within an Architecture Recovery Approach.",
					"Static Evaluation of Software Architectures - A Short Summary.",
					"Extending SPQR to Architectural Analysis by Semi-Automated Training.",
					"Architecture Description Languages in Practice Session Report.",
					"Mapping ADLs into UML 2.0 Using a Meta ADL.",
					"Intelligent Instrument Design With ArchWare ADL.",
					"DUALLY: Putting in Synergy UML 2.0 and ADLs.",
					"An MDA Approach for a Multi-Layered Satellite On-Board Software Architecture.",
					"Software Architecture Documentation in Practice Session Report.",
					"The ADOV Method: an Experience in Selecting the Relevant Views of an Architecture in a SME.",
					"Migration of Supervisory Machine Control Architectures.",
					"Bridging the Concrete and Logical Domains for Software Architecture Reconstruction.",
					"Semi-Automated Incremental Synchronization between Conceptual and Implementation Level Architectures.",
					"Components and Services Session Report.",
					"Service-Oriented Architecture for Deploying and Integrating Enterprise Applications.",
					"Architectural Concerns When Selecting an In-House Integration Strategy - Experiences from Industry.",
					"Adaptor Synthesis for Protocol-Enhanced Component Based Architectures.",
					"Software Components Services for Embedded Real-Time Systems.",
					"Establishing Connectors as Integration Services.",
					"Architectural Design Decisions Session Report.",
					"An Architecture and Its Rationale.",
					"Position on Ontology-Based Architecture.",
					"Building up and Exploiting Architectural Knowledge.",
					"Explicit Models for Dynamic Software.",
					"The Amigo Service Architecture for the Open Networked Home Environment.",
					"DMDA - A Dynamic Service Architecture for Scientific Computing.",
					"Successful Architecture for Short Message Service Center.",
					"Towards an Operational Framework for Architectural Prototyping."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "4th WICSA 2004",
		"info": "Oslo, Norway",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2004",
				"sub_name": "4th Working IEEE / IFIP Conference on Software Architecture (WICSA 2004), 12-15 June 2004, Oslo, Norway.",
				"count": 35,
				"papers": [
					"ASAAM: Aspectual Software Architecture Analysis Method.",
					"Architectural Prototyping: An Approach for Grounding Architectural Design and Learning.",
					"Mining Patterns to Support Software Architecture Evaluation.",
					"Compositional Generation of Software Architecture Performance QN Models.",
					"Understanding Tradeoffs among Different Architectural Modeling Approaches.",
					"Modeling Behavioral Patterns of Concurrent Software Architectures Using Petri Nets.",
					"Support for Evolving Software Architectures in the ArchWare ADL.",
					"Software Reconfiguration Patterns for Dynamic Evolution of Software Architectures.",
					"Component Replacement in a Long-Living Architecture: The 3RDBA Approach.",
					"Real World Influences on Software Architecture - Interviews with Industrial System Experts.",
					"Performance Optimization of Embedded Software Architecture - A Case Study.",
					"Symphony: View-Driven Software Architecture Reconstruction.",
					"Aspects and Constraints for Implementing Configurable Product-Line Architectures.",
					"Resolving Requirement Conflicts through Non-Functional Decomposition.",
					"Style-Based Refinement of Dynamic Software Architectures.",
					"Generating Well-Synchronized Multithreaded Programs from Software Architecture Descriptions.",
					"Systematic Development and Exploration of Service-Oriented Software Architectures.",
					"Establishing a Software Architecting Environment.",
					"Software Architecture for Mobile Distributed Computing.",
					"Reactive Types for Dataflow-Oriented Software Architectures.",
					"PACE: An Architectural Style for Trust Management in Decentralized Applications.",
					"The DiPS+ Software Architecture for Self-healing Protocol Stacks.",
					"An Architecture for Coordinating Multiple Self-Management Systems.",
					"Software Architecture for Large-Scale, Distributed, Data-Intensive Systems.",
					"A Scenario-Driven Approach for Value, Risk, and Cost Analysis in System Architecting for Innovation.",
					"Experience Using an Expert System to Assist an Architect in Designing for Modifiability.",
					"An Externalized Infrastructure for Self-Healing Systems.",
					"Applying Patterns to Develop a Product Line Architecture for Statistical Analysis Software.",
					"Evaluating the Portability and Maintainability of Software Product Family Architecture: Terminal Software Case Study.",
					"Attribute-Based Refinement of Software Architectures.",
					"An Architectural Approach to Mobility - The Handover Case Study.",
					"Heuristics for the Transition from Analysis to Software Architecture.",
					"The COMQUAD Component Container Architecture.",
					"A Network Architectural Style for Real-time Systems: NaSr.",
					"Real-time Collaboration in Activity-based Architectures."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "3rd WICSA 2002",
		"info": "Montréal, Québec, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2002",
				"sub_name": "Software Architecture: System Design, Development and Maintenance, IFIP 17th World Computer Congress - TC2 Stream / 3rd IEEE/IFIP Conference on Software Architecture (WICSA3), August 25-30, 2002, Montréal, Québec, Canada.",
				"count": 14,
				"papers": [
					"The Adaptive Object-Model Architectural Style.",
					"Aura: an Architectural Framework for User Mobility in Ubiquitous Computing Environments.",
					"Using Architectural Style as a Basis for System Self-repair.",
					"Modeling and Analyzing the Software Architecture of a Communication Protocol Using SAM.",
					"Dynamic Reconfigurable Software Architecture: Analysis and Evaluation.",
					"Understanding and Propagating Architecutural Changes.",
					"Practical Rationale for Describing Software Architecture.",
					"Documenting and Analyzing a Context-Sensitive Design Space.",
					"Introducing Reflection in Architecture Description Languages.",
					"Architecture Reconstruction in Practice.",
					"Introducing the Software Architectonic Viewpoint.",
					"A Component-Based Software Architecture for Industrial Control.",
					"Analyzing Commercial Component Models.",
					"A Family of Software Architecture Implementation Frameworks."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "2nd WICSA 2001",
		"info": "Amsterdam, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/2001",
				"sub_name": "2001 Working IEEE / IFIP Conference on Software Architecture (WICSA 2001), 28-31 August 2001, Amsterdam, The Netherlands.",
				"count": 20,
				"papers": [
					"Is Architecture a Product that Can Be Packaged and Sold?",
					"Towards Fault-tolerant Software Architectures.",
					"The Role of SW Architectures in Solving Fundamental Problems in Object-Oriented Development of Large Embedded SW Systems.",
					"An Object-Oriented RBAC Model for Distributed System.",
					"MAP - Mining Architectures for Product Line Evaluations.",
					"On the Notion of Variability in Software Product Lines.",
					"Techniques for Independent Deployment to Build Product Populations.",
					"SPIN-ning Software Architectures: A Method for Exploring Complex.",
					"Detecting Architectural Mismatches in Process Algebraic Descriptions of Software Systems.",
					"Statechart Simulator for Modeling Architectural Dynamics.",
					"When System Boundaries Dissolve: Research Opportunities in Software Architectures for Ubiquitous Computing and Communication.",
					"A Highly-Extensible, XML-Based Architecture Description Language.",
					"Interface-Centric Architecture Descriptions.",
					"Why We Need A Different View of Software Architecture.",
					"Layers, Decisions, Patterns, Styles, and Architectures.",
					"A Compositional Approach for Constructing Connectors.",
					"Collaboration-Based Design - Exemplified by the Internet Session Initiation Protocol (SIP).",
					"Annotating Reusable Software Architectures with Specialization Patterns.",
					"An Architecture for Distributing the Computation of Software Clustering Algorithms.",
					"Focus: A Light-Weight, Incremental Approach to Software Architecture Recovery and Evolution."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "1st WICSA 1999",
		"info": "San Antonio, TX, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/wicsa/1999",
				"sub_name": "Software Architecture, TC2 First Working IFIP Conference on Software Architecture (WICSA1), 22-24 February 1999, San Antonio, Texas, USA.",
				"count": 34,
				"papers": [
					"Architecture Design Recovery of a Family of Embedded Software Systems.",
					"A Software Architecture Reconstruction Method.",
					"Behaviour Analysis of Software Architectures.",
					"Rearchitecting Legacy System - Concepts and Case Study.",
					"Checking the Correctness of Architectural Transformation Steps via Proof-Carrying Architectures.",
					"Developing Dependable Systems Using Software Architecture.",
					"Specification and Refinement of Dynamic Software Architectures.",
					"Modeling Software Architecutes and Styles with Graph Grammars and Constraint Solving.",
					"Describing Software Architecture with UML.",
					"Assessing the Suitability of a Standard Design Method for Modeling Software Architectures.",
					"Software Architecture, Java Beans.",
					"Architectural Styles as Adaptors.",
					"Attribute-Based Architecture Styles.",
					"A Framework for Describing Software Architectures for Reuse.",
					"Modeling Software Architecture Using Domain-Specific Patterns.",
					"ImageBuilder Software.",
					"Event-Based Execution Architectures for Dynamic Software Systems.",
					"Evolution and Composition of Reusable Assets in Product-Line Architectures: A Case Study.",
					"Flexibility of the ComBAD Architectures.",
					"Domain-Specific Architectures and Product Families.",
					"Kaleidoscope: A Reference Architecture for Monitoring and Control Systems.",
					"Segregating the Layers of Business Information Systems.",
					"Security Issues with the Global Command and Control System (GCCS).",
					"Architecture for Software Construction by Unrelated Developers.",
					"Integration of Heterogeneous Software Architectures - An Experience Report.",
					"Structural Analysis of the Software Architecture - A Maintenance Assessment Case Study.",
					"Architectural Evolution.",
					"Building Systems from Parts in the Real World.",
					"Architectural Concerns in Automating Code Generation.",
					"The MBASE Life Cycle Architecture Milestone Package.",
					"Software Architecture at Siemens: The challenges, our approaches, and some open issues.",
					"Architectural Design to Meet Stakeholder Requirements.",
					"The Software Architect.",
					"Aspect Design with the Building Block Method."
				]
			}
		]
	}
]