[
    {
        "year": "2020",
        "name": "5th APWeb/WAIM 2020",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2021-1",
                "sub_name": "Web and Big Data - 5th International Joint Conference, APWeb-WAIM 2021, Guangzhou, China, August 23-25, 2021, Proceedings, Part I.",
                "count": 38,
                "papers": [
                    "Co-authorship Prediction Based on Temporal Graph Attention.",
                    "Degree-Specific Topology Learning for Graph Convolutional Network.",
                    "Simplifying Graph Convolutional Networks as Matrix Factorization.",
                    "GRASP: Graph Alignment Through Spectral Signatures.",
                    "FANE: A Fusion-Based Attributed Network Embedding Framework.",
                    "What Have We Learned from OpenReview?",
                    "Unsafe Driving Behavior Prediction for Electric Vehicles.",
                    "Resource Trading with Hierarchical Game for Computing-Power Network Market.",
                    "Analyze and Evaluate Database-Backed Web Applications with WTool.",
                    "Semi-supervised Variational Multi-view Anomaly Detection.",
                    "A Graph Attention Network Model for GMV Forecast on Online Shopping Festival.",
                    "Suicide Ideation Detection on Social Media During COVID-19 via Adversarial and Multi-task Learning.",
                    "An Efficient Bucket Logging for Persistent Memory.",
                    "Data Poisoning Attacks on Crowdsourcing Learning.",
                    "Dynamic Environment Simulation for Database Performance Evaluation.",
                    "LinKV: An RDMA-Enabled KVS for High Performance and Strict Consistency Under Skew.",
                    "Cheetah: An Adaptive User-Space Cache for Non-volatile Main Memory File Systems.",
                    "Chinese Word Embedding Learning with Limited Data.",
                    "Sparse Biterm Topic Model for Short Texts.",
                    "EMBERT: A Pre-trained Language Model for Chinese Medical Text Mining.",
                    "Self-supervised Learning for Semantic Sentence Matching with Dense Transformer Inference Network.",
                    "An Explainable Evaluation of Unsupervised Transfer Learning for Parallel Sentences Mining.",
                    "Leveraging Syntactic Dependency and Lexical Similarity for Neural Relation Extraction.",
                    "A Novel Capsule Aggregation Framework for Natural Language Inference.",
                    "Learning Modality-Invariant Features by Cross-Modality Adversarial Network for Visual Question Answering.",
                    "Difficulty-Controllable Visual Question Generation.",
                    "Incorporating Typological Features into Language Selection for Multilingual Neural Machine Translation.",
                    "Removing Input Confounder for Translation Quality Estimation via a Causal Motivated Method.",
                    "Learning Refined Features for Open-World Text Classification.",
                    "Emotion Classification of Text Based on BERT and Broad Learning System.",
                    "Improving Document-Level Sentiment Classification with User-Product Gated Network.",
                    "Integrating RoBERTa Fine-Tuning and User Writing Styles for Authorship Attribution of Short Texts.",
                    "Dependency Graph Convolution and POS Tagging Transferring for Aspect-Based Sentiment Classification.",
                    "DTWSSE: Data Augmentation with a Siamese Encoder for Time Series.",
                    "PT-LSTM: Extending LSTM for Efficient Processing Time Attributes in Time Series Prediction.",
                    "Loss Attenuation for Time Series Prediction Respecting Categories of Values.",
                    "PFL-MoE: Personalized Federated Learning Based on Mixture of Experts.",
                    "A New Density Clustering Method Using Mutual Nearest Neighbor."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2021-2",
                "sub_name": "Web and Big Data - 5th International Joint Conference, APWeb-WAIM 2021, Guangzhou, China, August 23-25, 2021, Proceedings, Part II.",
                "count": 36,
                "papers": [
                    "Unsupervised Deep Hashing via Adaptive Clustering.",
                    "FedMDR: Federated Model Distillation with Robust Aggregation.",
                    "Data Augmentation for Graph Convolutional Network on Semi-supervised Classification.",
                    "Generating Long and Coherent Text with Multi-Level Generative Adversarial Networks.",
                    "A Reasonable Data Pricing Mechanism for Personal Data Transactions with Privacy Concern.",
                    "A Probabilistic Inference Based Approach for Querying Associative Entities in Knowledge Graph.",
                    "BOUNCE: An Efficient Selective Enumeration Approach for Nested Named Entity Recognition.",
                    "PAIRPQ: An Efficient Path Index for Regular Path Queries on Knowledge Graphs.",
                    "A Hybrid Semantic Matching Model for Neural Collective Entity Linking.",
                    "Multi-space Knowledge Enhanced Question Answering over Knowledge Graph.",
                    "A Distribution-Aware Training Scheme for Learned Indexes.",
                    "AIR Cache: A Variable-Size Block Cache Based on Fine-Grained Management Method.",
                    "Learning an Index Advisor with Deep Reinforcement Learning.",
                    "SardineDB: A Distributed Database on the Edge of the Network.",
                    "DLSM: Distance Label Based Subgraph Matching on GPU.",
                    "Distributed Top-k Pattern Mining.",
                    "SQKT: A Student Attention-Based and Question-Aware Model for Knowledge Tracing.",
                    "Comparison Question Generation Based on Potential Compared Attributes Extraction.",
                    "Multimodal Encoders for Food-Oriented Cross-Modal Retrieval.",
                    "Data Cleaning for Indoor Crowdsourced RSSI Sequences.",
                    "A Behavior-Aware Graph Convolution Network Model for Video Recommendation.",
                    "GRHAM: Towards Group Recommendation Using Hierarchical Attention Mechanism.",
                    "Multi-interest Network Based on Double Attention for Click-Through Rate Prediction.",
                    "Self-residual Embedding for Click-Through Rate Prediction.",
                    "GCNNIRec: Graph Convolutional Networks with Neighbor Complex Interactions for Recommendation.",
                    "Velocity-Dependent Nearest Neighbor Query.",
                    "Finding Geo-Social Cohorts in Location-Based Social Networks.",
                    "Modeling Dynamic Spatial Influence for Air Quality Prediction with Atmospheric Prior.",
                    "Learning Cooperative Max-Pressure Control by Leveraging Downstream Intersections Information for Traffic Signal Control.",
                    "Privacy-Preserving Healthcare Analytics of Trajectory Data.",
                    "PARROT: An Adaptive Online Shopping Guidance System.",
                    "gStore-C: A Transactional RDF Store with Light-Weight Optimistic Lock.",
                    "Deep-gAnswer: A Knowledge Based Question Answering System.",
                    "ALMSS: Automatic Learned Index Model Selection System.",
                    "GPKRS: A GPU-Enhanced Product Knowledge Retrieval System.",
                    "Standard-Oriented Standard Knowledge Graph Construction and Applications System."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "4th APWeb/WAIM 2020",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2020-1",
                "sub_name": "Web and Big Data - 4th International Joint Conference, APWeb-WAIM 2020, Tianjin, China, September 18-20, 2020, Proceedings, Part I.",
                "count": 59,
                "papers": [
                    "Active Classification of Cold-Start Users in Large Sparse Datasets.",
                    "Instance-Aware Evaluation of Sensitive Columns in Tabular Dataset.",
                    "EPUR: An Efficient Parallel Update System over Large-Scale RDF Data.",
                    "Multiple Local Community Detection via High-Quality Seed Identification.",
                    "Partition-Oriented Subgraph Matching on GPU.",
                    "An Index Method for the Shortest Path Query on Vertex Subset for the Large Graphs.",
                    "Efficient Personalized Influential Community Search in Large Networks.",
                    "Leveraging Explicit Unsupervised Information for Robust Graph Convolutional Neural Network Learning.",
                    "Content Sharing Prediction for Device-to-Device (D2D)-based Offline Mobile Social Networks by Network Representation Learning.",
                    "LSimRank: Node Similarity in a Labeled Graph.",
                    "Fruited-Forest: A Reachability Querying Method Based on Spanning Tree Modelling of Reduced DAG.",
                    "Frequent Semantic Trajectory Sequence Pattern Mining in Location-Based Social Networks.",
                    "Aligning Users Across Social Networks via Intra and Inter Attentions.",
                    "NSTI-IC: An Independent Cascade Model Based on Neighbor Structures and Topic-Aware Interest.",
                    "Knowledge Graph Attention Network Enhanced Sequential Recommendation.",
                    "TKGFrame: A Two-Phase Framework for Temporal-Aware Knowledge Graph Completion.",
                    "An Ontology-Aware Unified Storage Scheme for Knowledge Graphs.",
                    "IterG: An Iteratively Learning Graph Convolutional Network with Ontology Semantics.",
                    "Fine-Grained Evaluation of Knowledge Graph Embedding Models in Downstream Tasks.",
                    "Learning to Answer Complex Questions with Evidence Graph.",
                    "Characterizing Robotic and Organic Query in SPARQL Search Sessions.",
                    "Tail Entity Recognition and Linking for Knowledge Graphs.",
                    "Natural Answer Generation via Graph Transformer.",
                    "Diversified Top-k Querying in Knowledge Graphs.",
                    "High Order Semantic Relations-Based Temporal Recommendation Model by Collaborative Knowledge Graph Learning.",
                    "Temporal Knowledge Graph Incremental Construction Model for Recommendation.",
                    "Few-Shot Representation Learning for Cold-Start Users and Items.",
                    "Long Short-Term Memory with Sequence Completion for Cross-Domain Sequential Recommendation.",
                    "IASR: An Item-Level Attentive Social Recommendation Model for Personalized Ranking.",
                    "Spatio-Temporal Self-Attention Network for Next POI Recommendation.",
                    "Joint Cooperative Content Caching and Recommendation in Mobile Edge-Cloud Networks.",
                    "Dual Role Neural Graph Auto-encoder for CQA Recommendation.",
                    "KGWD: Knowledge Graph Based Wide & Deep Framework for Recommendation.",
                    "Seamless Incorporation of Appointment-Based Requests on Taxi-Rider Match Scheduling.",
                    "FHAN: Feature-Level Hierarchical Attention Network for Group Event Recommendation.",
                    "KASR: Knowledge-Aware Sequential Recommendation.",
                    "Graph Attentive Network for Region Recommendation with POI- and ROI-Level Attention.",
                    "Generalized Collaborative Personalized Ranking for Recommendation.",
                    "Dynamic Multi-hop Reasoning.",
                    "Multi-hop Reading Comprehension Incorporating Sentence-Based Reasoning.",
                    "Author Contributed Representation for Scholarly Network.",
                    "Unsupervised Cross-Modal Retrieval by Coupled Dual Generative Adversarial Networks.",
                    "GSimRank: A General Similarity Measure on Heterogeneous Information Network.",
                    "Multi-task Learning for Low-Resource Second Language Acquisition Modeling.",
                    "Multi-view Clustering via Multiple Auto-Encoder.",
                    "A Method for Place Name Recognition in Tang Poetry Based on Feature Templates and Conditional Random Field.",
                    "MLND: A Weight-Adapting Method for Multi-label Classification Based on Neighbor Label Distribution.",
                    "meanNet: A Multi-layer Label Mean Based Semi-supervised Neural Network Approach for Credit Prediction.",
                    "Multi-task Attributed Graphical Lasso.",
                    "Hylo: Hybrid Layer-Based Optimization to Reduce Communication in Distributed Deep Learning.",
                    "Joint Reasoning of Events, Participants and Locations for Plot Relation Recognition.",
                    "FedSmart: An Auto Updating Federated Learning Optimization Mechanism.",
                    "Discriminative Multi-label Model Reuse for Multi-label Learning.",
                    "Global and Local Attention Embedding Network for Few-Shot Fine-Grained Image Classification.",
                    "Bayes Classifier Chain Based on SVM for Traditional Chinese Medical Prescription Generation.",
                    "A Spatial and Sequential Combined Method for Web Service Classification.",
                    "A Pruned DOM-Based Iterative Strategy for Approximate Global Optimization in Crowdsourcing Microtasks.",
                    "D-GHNAS for Joint Intent Classification and Slot Filling.",
                    "Index-Based Scheduling for Parallel State Machine Replication."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2020-2",
                "sub_name": "Web and Big Data - 4th International Joint Conference, APWeb-WAIM 2020, Tianjin, China, September 18-20, 2020, Proceedings, Part II.",
                "count": 46,
                "papers": [
                    "DHBFT: Dynamic Hierarchical Byzantine Fault-Tolerant Consensus Mechanism Based on Credit.",
                    "MaSRChain: A Trusted Manuscript Submission and Review System Based on Blockchain.",
                    "Enabling Efficient Multi-keyword Search Over Fine-Grained Authorized Healthcare Blockchain System.",
                    "Debiasing Learning to Rank Models with Generative Adversarial Networks.",
                    "An Effective Constraint-Based Anomaly Detection Approach on Multivariate Time Series.",
                    "A Method for Decompensation Prediction in Emergency and Harsh Situations.",
                    "Improved Brain Segmentation Using Pixel Separation and Additional Segmentation Features.",
                    "Evaluating Fault Tolerance of Distributed Stream Processing Systems.",
                    "Predicting Human Mobility with Self-attention and Feature Interaction.",
                    "Predicting Adverse Drug-Drug Interactions via Semi-supervised Variational Autoencoders.",
                    "Smarter Smart Contracts: Efficient Consent Management in Health Data Sharing.",
                    "Joint Learning-Based Anomaly Detection on KPI Data.",
                    "Parallel Variable-Length Motif Discovery in Time Series Using Subsequences Correlation.",
                    "Learning Ability Community for Personalized Knowledge Tracing.",
                    "LOCATE: Locally Anomalous Behavior Change Detection in Behavior Information Sequence.",
                    "Hyperthyroidism Progress Prediction with Enhanced LSTM.",
                    "DeepStyle: User Style Embedding for Authorship Attribution of Short Texts.",
                    "Densely-Connected Transformer with Co-attentive Information for Matching Text Sequences.",
                    "WEKE: Learning Word Embeddings for Keyphrase Extraction.",
                    "Contribution of Improved Character Embedding and Latent Posting Styles to Authorship Attribution of Short Texts.",
                    "Utilizing BERT Pretrained Models with Various Fine-Tune Methods for Subjectivity Detection.",
                    "A Framework for Learning Cross-Lingual Word Embedding with Topics.",
                    "Paperant: Key Elements Generation with New Ideas.",
                    "Turn-Level Recurrence Self-attention for Joint Dialogue Action Prediction and Response Generation.",
                    "Mining Affective Needs from Online Opinions for Design Innovation.",
                    "Multi-grained Cross-modal Similarity Query with Interpretability.",
                    "Efficient Semantic Enrichment Process for Spatiotemporal Trajectories in Geospatial Environment.",
                    "On the Vulnerability and Generality of K-Anonymity Location Privacy Under Continuous LBS Requests.",
                    "Fine-Grained Urban Flow Prediction via a Spatio-Temporal Super-Resolution Scheme.",
                    "Detecting Abnormal Congregation Through the Analysis of Massive Spatio-Temporal Data.",
                    "SSMDL: Semi-supervised Multi-task Deep Learning for Transportation Mode Classification and Path Prediction with GPS Trajectories.",
                    "GHSH: Dynamic Hyperspace Hashing on GPU.",
                    "A Unified Framework for Processing Exact and Approximate Top-k Set Similarity Join.",
                    "Quantitative Contention Generation for Performance Evaluation on OLTP Databases.",
                    "Pipelined Query Processing Using Non-volatile Memory SSDs.",
                    "Sorting-Based Interactive Regret Minimization.",
                    "Tool Data Modeling Method Based on an Object Deputy Model.",
                    "Unsupervised Deep Hashing with Structured Similarity Learning.",
                    "A New CPU-FPGA Heterogeneous gStore System.",
                    "Euge: Effective Utilization of GPU Resources for Serving DNN-Based Video Analysis.",
                    "Blockchain PG: Enabling Authenticated Query and Trace Query in Database.",
                    "PHR: A Personalized Hidden Route Recommendation System Based on Hidden Markov Model.",
                    "JoyDigit NexIoT: An Open IoT Data Platform for Senior Living.",
                    "Epidemic Guard: A COVID-19 Detection System for Elderly People.",
                    "Automatic Document Data Storage System Based on Machine Learning.",
                    "A Meta-Search Engine Ranking Based on Webpage Information Quality Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2020w",
                "sub_name": "Web and Big Data. APWeb-WAIM 2020 International Workshops - KGMA 2020, SemiBDMA 2020, DeepLUDA 2020, Tianjin, China, September 18-20, 2020, Revised Selected Papers.",
                "count": 13,
                "papers": [
                    "Neighborhood Query Processing and Surrounding Objects Retrieval in Spatial Databases: Applications and Algorithms.",
                    "Distributed Graph Processing: Techniques and Systems.",
                    "Method for Re-finding Mobile Phone Documents Based on Feature Knowledge Graph.",
                    "Knowledge Graph Embedding with Relation Constraint.",
                    "Knowledge-Driven Multi-dimensional Dialogue Rewriting Model.",
                    "Towards Knowledge Graphs Federations: Issues and Technologies.",
                    "A Learning Interests Oriented Model for Cold Start Recommendation.",
                    "A Composite Chain Structure Blockchain Storage Method Based on Blockchain Technology.",
                    "Curriculum-Oriented Multi-goal Agent for Adaptive Learning.",
                    "Distributed Storage and Query for Domain Knowledge Graphs.",
                    "Label Propagation Algorithm Based on Topological Potential.",
                    "LBNet: A Model for Judicial Reading Comprehension.",
                    "Deep Semantic Hashing for Large-Scale Image Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "3rd APWeb/WAIM 2019",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2019-1",
                "sub_name": "Web and Big Data - Third International Joint Conference, APWeb-WAIM 2019, Chengdu, China, August 1-3, 2019, Proceedings, Part I.",
                "count": 30,
                "papers": [
                    "A Framework for Image Dark Data Assessment.",
                    "Medical Treatment Migration Prediction in Healthcare via Attention-Based Bidirectional GRU.",
                    "WRL: A Combined Model for Short-Term Load Forecasting.",
                    "DeepAM: Deep Semantic Address Representation for Address Matching.",
                    "Drawing CoCo Core-Sets from Incomplete Relational Data.",
                    "Reducing Wrong Labels for Distant Supervision Relation Extraction with Selective Capsule Network.",
                    "Coupled Semi-supervised Clustering: Exploring Attribute Correlations in Heterogeneous Information Networks.",
                    "PrivBUD-Wise: Differentially Private Frequent Itemsets Mining in High-Dimensional Databases.",
                    "A Learning Approach for Topic-Aware Influence Maximization.",
                    "DeepDial: Passage Completion on Dialogs.",
                    "A Survival Certification Model Based on Active Learning over Medical Insurance Data.",
                    "A Novel Approach for Air Quality Inference and Prediction Based on DBU-LSTM.",
                    "Predictive Role Discovery of Research Teams Using Ordinal Factorization Machines.",
                    "Deep Learning for Online Display Advertising User Clicks and Interests Prediction.",
                    "In Pursuit of Social Capital: Upgrading Social Circle Through Edge Rewiring.",
                    "Distributed Landmark Selection for Lower Bound Estimation of Distances in Large Graphs.",
                    "AERIAL: An Efficient Randomized Incentive-Based Influence Maximization Algorithm.",
                    "Cider: Highly Efficient Processing of Densely Overlapped Communities in Big Graphs.",
                    "Time Optimal Profit Maximization in a Social Network.",
                    "Iterative Hypergraph Computation Based on Hyperedge-Connected Graphs.",
                    "How to Reach: Discovering Multi-resolution Paths on Large Scale Networks.",
                    "Analysis and Management to Hash-Based Graph and Rank.",
                    "Two-Encoder Pointer-Generator Network for Summarizing Segments of Long Articles.",
                    "Enhancing Joint Entity and Relation Extraction with Language Modeling and Hierarchical Attention.",
                    "An Unsupervised Learning Approach for NER Based on Online Encyclopedia.",
                    "Pseudo Topic Analysis for Boosting Pseudo Relevance Feedback.",
                    "Leveraging Domain Context for Question Answering over Knowledge Graph.",
                    "Leveraging Lexical Semantic Information for Learning Concept-Based Multiple Embedding Representations for Knowledge Graph Completion.",
                    "Efficient Distributed Knowledge Representation Learning for Large Knowledge Graphs.",
                    "Coherence and Salience-Based Multi-Document Relationship Mining."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2019-2",
                "sub_name": "Web and Big Data - Third International Joint Conference, APWeb-WAIM 2019, Chengdu, China, August 1-3, 2019, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Using Sentiment Representation Learning to Enhance Gender Classification for User Profiling.",
                    "Exploring Nonnegative and Low-Rank Correlation for Noise-Resistant Spectral Clustering.",
                    "FeatureBand: A Feature Selection Method by Combining Early Stopping and Genetic Local Search.",
                    "Supervised Hashing with Recurrent Scaling.",
                    "TRPN: Matrix Factorization Meets Recurrent Neural Network for Temporal Rating Prediction.",
                    "Improved Review Sentiment Analysis with a Syntax-Aware Encoder.",
                    "Who Is the Abnormal User: Anomaly Detection Framework based on the Graph Convolutional Networks.",
                    "I-mRMR: Incremental Max-Relevance, and Min-Redundancy Feature Selection.",
                    "ST-DCN: A Spatial-Temporal Densely Connected Networks for Crowd Flow Prediction.",
                    "Streaming Recommendation Algorithm with User Interest Drift Analysis.",
                    "Unified Group Recommendation Towards Multiple Criteria.",
                    "A Novel Ensemble Approach for Click-Through Rate Prediction Based on Factorization Machines and Gradient Boosting Decision Trees.",
                    "Latent Path Connected Space Model for Recommendation.",
                    "FreshJoin: An Efficient and Adaptive Algorithm for Set Containment Join.",
                    "Apara: Workload-Aware Data Partition and Replication for Parallel Databases.",
                    "Which Category Is Better: Benchmarking the RDBMSs and GDBMSs.",
                    "A Meta-Path-Based Recurrent Model for Next POI Prediction with Spatial and Temporal Contexts.",
                    "Discovering Attractive Segments in the User Generated Video Streams.",
                    "Spatial Temporal Trajectory Similarity Join.",
                    "Data Driven Charging Station Placement.",
                    "An Efficient Top-k Spatial Join Query Processing Algorithm on Big Spatial Data.",
                    "Multi-view Based Spatial-Keyword Query Processing for Real Estate.",
                    "PowerMonitor: Aspect Mining and Sentiment Analysis on Online Reviews.",
                    "Transformer and Multi-scale Convolution for Target-Oriented Sentiment Analysis.",
                    "A New Feature Selection Algorithm Based on Category Difference for Text Categorization.",
                    "Opinion-Aware Knowledge Embedding for Stance Detection.",
                    "History-Driven Entity Categorization.",
                    "MBMN: Multivariate Bernoulli Mixture Network for News Emotion Analysis.",
                    "FMQO: A Federated RDF System Supporting Multi-query Optimization.",
                    "DataServiceHatch: Generating and Composing Continuous Data Services.",
                    "A Mobile Phone Data Visualization Tool for People Flow Analysis.",
                    "NativeHelper: A Bilingual Sentence Search and Recommendation Engine for Academic Writing.",
                    "PKRS: A Product Knowledge Retrieve System.",
                    "DataSESec: Security Monitoring for Data Share and Exchange Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2019w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2019 International Workshops, KGMA and DSEA, Chengdu, China, August 1-3, 2019, Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "Distributed Query Evaluation over Large RDF Graphs.",
                    "Classification-Based Emoji Recommendation for User Social Networks.",
                    "Leveraging Context Information for Joint Entity and Relation Linking.",
                    "Community Detection in Knowledge Graph Network with Matrix Factorization Learning.",
                    "A Survey of Relation Extraction of Knowledge Graphs.",
                    "PEVR: Pose Estimation for Vehicle Re-Identification.",
                    "The Research of Chinese Ethnical Face Recognition Based on Deep Learning.",
                    "Model of Charging Stations Construction and Electric Vehicles Development Prediction.",
                    "Boundary Detector Encoder and Decoder with Soft Attention for Video Captioning."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "2nd APWeb/WAIM 2018",
        "info": "Macau, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2018-1",
                "sub_name": "Web and Big Data - Second International Joint Conference, APWeb-WAIM 2018, Macau, China, July 23-25, 2018, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "Abstractive Summarization with the Aid of Extractive Summarization.",
                    "Rank-Integrated Topic Modeling: A General Framework.",
                    "Multi-label Classification via Label-Topic Pairs.",
                    "Similarity Calculations of Academic Articles Using Topic Events and Domain Knowledge.",
                    "Sentiment Classification via Supplementary Information Modeling.",
                    "Training Set Similarity Based Parameter Selection for Statistical Machine Translation.",
                    "Identifying Scholarly Communities from Unstructured Texts.",
                    "A Hybrid Spectral Method for Network Community Detection.",
                    "Personalized Top-n Influential Community Search over Large Social Networks.",
                    "Matrix Factorization Meets Social Network Embedding for Rating Prediction.",
                    "An Estimation Framework of Node Contribution Based on Diffusion Information.",
                    "Multivariate Time Series Clustering via Multi-relational Community Detection in Networks.",
                    "NSPD: An N-stage Purchase Decision Model for E-commerce Recommendation.",
                    "Social Image Recommendation Based on Path Relevance.",
                    "Representation Learning with Depth and Breadth for Recommendation Using Multi-view Data.",
                    "Attentive and Collaborative Deep Learning for Recommendation.",
                    "Collaborative Probability Metric Learning.",
                    "UIContextListRank: A Listwise Recommendation Model with Social Contextual Information.",
                    "Diversified Keyword Expansion on Multi-labeled Graphs.",
                    "Distributed k-Nearest Neighbor Queries in Metric Spaces.",
                    "Efficient Grammar Generation for Inverted Indexes.",
                    "LIDH: An Efficient Filtering Method for Approximate k Nearest Neighbor Queries Based on Local Intrinsic Dimension.",
                    "Query Performance Prediction and Classification for Information Search Systems.",
                    "Aggregate Query Processing on Incomplete Data.",
                    "Travel Time Forecasting with Combination of Spatial-Temporal and Time Shifting Correlation in CNN-LSTM Neural Network.",
                    "DMDP^2 D M D P 2 : A Dynamic Multi-source Based Default Probability Prediction Framework.",
                    "Brain Disease Diagnosis Using Deep Learning Features from Longitudinal MR Images.",
                    "Attention-Based Recurrent Neural Network for Sequence Labeling.",
                    "Haze Forecasting via Deep LSTM.",
                    "Importance-Weighted Distance Aware Stocks Trend Prediction.",
                    "Jointly Modeling Structural and Textual Representation for Knowledge Graph Completion in Zero-Shot Scenario.",
                    "Neural Typing Entities in Chinese-Pedia.",
                    "Knowledge Graph Embedding by Learning to Connect Entity with Relation.",
                    "StarMR: An Efficient Star-Decomposition Based Query Processor for SPARQL Basic Graph Patterns Using MapReduce.",
                    "DAVE: Extracting Domain Attributes and Values from Text Corpus.",
                    "PRSPR: An Adaptive Framework for Massive RDF Stream Reasoning.",
                    "TSRS: Trip Service Recommended System Based on Summarized Co-location Patterns.",
                    "DFCPM: A Dominant Feature Co-location Pattern Miner.",
                    "CUTE: Querying Knowledge Graphs by Tabular Examples.",
                    "ALTAS: An Intelligent Text Analysis System Based on Knowledge Graphs.",
                    "SPARQLVis: An Interactive Visualization Tool for Knowledge Graphs.",
                    "PBR: A Personalized Book Resource Recommendation System."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2018-2",
                "sub_name": "Web and Big Data - Second International Joint Conference, APWeb-WAIM 2018, Macau, China, July 23-25, 2018, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Fuzzy Searching Encryption with Complex Wild-Cards Queries on Encrypted Database.",
                    "Towards Privacy-Preserving Travel-Time-First Task Assignment in Spatial Crowdsourcing.",
                    "Plover: Parallel In-Memory Database Logging on Scalable Storage Devices.",
                    "Inferring Regular Expressions with Interleaving from XML Data.",
                    "Efficient Query Reverse Engineering for Joins and OLAP-Style Aggregations.",
                    "DCA: The Advanced Privacy-Enhancing Schemes for Location-Based Services.",
                    "Discussion on Fast and Accurate Sketches for Skewed Data Streams: A Case Study.",
                    "Matching Consecutive Subpatterns over Streaming Time Series.",
                    "A Data Services Composition Approach for Continuous Query on Data Streams.",
                    "Discovering Multiple Time Lags of Temporal Dependencies from Fluctuating Events.",
                    "A Combined Model for Time Series Prediction in Financial Markets.",
                    "Location Prediction in Social Networks.",
                    "Efficient Longest Streak Discovery in Multidimensional Sequence Data.",
                    "Map Matching Algorithms: An Experimental Evaluation.",
                    "Predicting Passenger's Public Transportation Travel Route Using Smart Card Data.",
                    "Detecting Taxi Speeding from Sparse and Low-Sampled Trajectory Data.",
                    "Cloned Vehicle Behavior Analysis Framework.",
                    "An Event Correlation Based Approach to Predictive Maintenance.",
                    "Using Crowdsourcing for Fine-Grained Entity Type Completion in Knowledge Bases.",
                    "Improving Clinical Named Entity Recognition with Global Neural Attention.",
                    "Exploiting Implicit Social Relationship for Point-of-Interest Recommendation.",
                    "Spatial Co-location Pattern Mining Based on Density Peaks Clustering and Fuzzy Theory.",
                    "A Tensor-Based Method for Geosensor Data Forecasting.",
                    "Aggregate k Nearest Neighbor Queries in Metric Spaces.",
                    "Finding the K Nearest Objects over Time Dependent Road Networks.",
                    "Reverse Top-k Query on Uncertain Preference.",
                    "Keyphrase Extraction Based on Optimized Random Walks on Multiple Word Relations.",
                    "Answering Range-Based Reverse kNN Queries.",
                    "EarnCache: Self-adaptive Incremental Caching for Big Data Applications.",
                    "Storage and Recreation Trade-Off for Multi-version Data Management.",
                    "Decentralized Data Integrity Verification Model in Untrusted Environment.",
                    "Enabling Concurrency on Smart Contracts Using Multiversion Ordering.",
                    "ElasticChain: Support Very Large Blockchain by Reducing Data Redundancy.",
                    "A MapReduce-Based Approach for Mining Embedded Patterns from Large Tree Data."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2018w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2018 International Workshops: MWDA, BAH, KGMA, DMMOOC, DS, Macau, China, July 23-25, 2018, Revised Selected Papers.",
                "count": 31,
                "papers": [
                    "Hybrid Decision Based Chinese News Headline Classification.",
                    "A Self-representation Model for Robust Clustering of Categorical Sequences.",
                    "Diversified Spatial Keyword Query on Topic Coverage.",
                    "Sequence-As-Feature Representation for Subspace Classification of Multivariate Time Series.",
                    "Discovering Congestion Propagation Patterns by Co-location Pattern Mining.",
                    "Spectroscopy-Based Food Internal Quality Evaluation with XGBoost Algorithm.",
                    "Large Scale UAVs Collaborative Formation Simulation Based on Starlings' Flight Mechanism.",
                    "Measuring the Spatio-Temporal Similarity Between Users.",
                    "Gesture Recognition Based on Accelerometer and Gyroscope and Its Application in Medical and Smart Homes.",
                    "Smartphone-Based Human Activity Recognition Using CNN in Frequency Domain.",
                    "Text Classification Methods Based on SVD and FCM.",
                    "An Image Processing Method via OpenCL for Identification of Pulmonary Nodules.",
                    "Pulmonary Nodule Segmentation Method of CT Images Based on 3D-FCN.",
                    "Research on Video Recommendation Algorithm Based on Knowledge Reasoning of Knowledge Graph.",
                    "A Hybrid Framework for Query Processing and Data Analytics on Spark.",
                    "Improving Network-Based Top-N Recommendation with Background Knowledge from Linked Open Data.",
                    "A Web-Based Theme-Related Word Set Construction Algorithm.",
                    "Classifying Personal Photo Collections: An Event-Based Approach.",
                    "A Learning Analytic Model for Smart Classroom.",
                    "Understanding User Interests Acquisition in Personalized Online Course Recommendation.",
                    "A Learning Analytics System for Cognition Analysis in Online Learning Community.",
                    "A Semantic Role Mining and Learning Performance Prediction Method in MOOCs.",
                    "MOOC Guider: An End-to-End Dialogue System for MOOC Users.",
                    "AUnet: An Unsupervised Method for Answer Reliability Evaluation in Community QA Systems.",
                    "Model and Practice of Crowd-Based Education.",
                    "Exploring Business Models and Dynamic Pricing Frameworks for SPOC Services.",
                    "Speed-Up Algorithms for Happiness-Maximizing Representative Databases.",
                    "Multi-location Influence Maximization in Location-Based Social Networks.",
                    "Emotion Analysis for the Upcoming Response in Open-Domain Human-Computer Conversation.",
                    "A Recurrent Neural Network Language Model Based on Word Embedding.",
                    "Inferring Social Ties from Multi-view Spatiotemporal Co-occurrence."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "1st APWeb/WAIM 2017",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2017-1",
                "sub_name": "Web and Big Data - First International Joint Conference, APWeb-WAIM 2017, Beijing, China, July 7-9, 2017, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "Meta Paths and Meta Structures: Analysing Large Heterogeneous Information Networks.",
                    "TrajSpark: A Scalable and Efficient In-Memory Management System for Big Trajectory Data.",
                    "A Local-Global LDA Model for Discovering Geographical Topics from Social Media.",
                    "Team-Oriented Task Planning in Spatial Crowdsourcing.",
                    "Negative Survey with Manual Selection: A Case Study in Chinese Universities.",
                    "Element-Oriented Method of Assessing Landscape of Sightseeing Spots by Using Social Images.",
                    "Sifting Truths from Multiple Low-Quality Data Sources.",
                    "A Community-Aware Approach to Minimizing Dissemination in Graphs.",
                    "Time-Constrained Graph Pattern Matching in a Large Temporal Graph.",
                    "Efficient Compression on Real World Directed Graphs.",
                    "Keyphrase Extraction Using Knowledge Graphs.",
                    "Semantic-Aware Partitioning on RDF Graphs.",
                    "An Incremental Algorithm for Estimating Average Clustering Coefficient Based on Random Walk.",
                    "Deep Multi-label Hashing for Large-Scale Visual Search Based on Semantic Graph.",
                    "An Ontology-Based Latent Semantic Indexing Approach Using Long Short-Term Memory Networks.",
                    "Privacy-Preserving Collaborative Web Services QoS Prediction via Differential Privacy.",
                    "High-Utility Sequential Pattern Mining with Multiple Minimum Utility Thresholds.",
                    "Extracting Various Types of Informative Web Content via Fuzzy Sequential Pattern Mining.",
                    "Exploiting High Utility Occupancy Patterns.",
                    "Translation Language Model Enhancement for Community Question Retrieval Using User Adoption Answer.",
                    "Holographic Lexical Chain and Its Application in Chinese Text Summarization.",
                    "Authorship Identification of Source Codes.",
                    "DFDS: A Domain-Independent Framework for Document-Level Sentiment Analysis Based on RST.",
                    "Fast Follower Recovery for State Machine Replication.",
                    "Laser: Load-Adaptive Group Commit in Lock-Free Transaction Logging.",
                    "Detecting User Occupations on Microblogging Platforms: An Experimental Study.",
                    "Counting Edges and Triangles in Online Social Networks via Random Walk.",
                    "Fair Reviewer Assignment Considering Academic Social Network.",
                    "Viral Marketing for Digital Goods in Social Networks.",
                    "Change Detection from Media Sharing Community.",
                    "Measuring the Similarity of Nodes in Signed Social Networks with Positive and Negative Links.",
                    "Elastic Resource Provisioning for Batched Stream Processing System in Container Cloud.",
                    "An Adaptive Framework for RDF Stream Processing.",
                    "Investigating Microstructure Patterns of Enterprise Network in Perspective of Ego Network.",
                    "Neural Architecture for Negative Opinion Expressions Extraction.",
                    "Identifying the Academic Rising Stars via Pairwise Citation Increment Ranking.",
                    "Fuzzy Rough Incremental Attribute Reduction Applying Dependency Measures.",
                    "SET: Secure and Efficient Top-k Query in Two-Tiered Wireless Sensor Networks.",
                    "Top-k Pattern Matching Using an Information-Theoretic Criterion over Probabilistic Data Streams.",
                    "Sliding Window Top-K Monitoring over Distributed Data Streams.",
                    "Diversified Top-k Keyword Query Interpretation on Knowledge Graphs.",
                    "Group Preference Queries for Location-Based Social Networks.",
                    "A Formal Product Search Model with Ensembled Proximity.",
                    "Incorporating User Preferences Across Multiple Topics into Collaborative Filtering for Personalized Merchant Recommendation.",
                    "Joint Factorizational Topic Models for Cross-City Recommendation.",
                    "Aligning Gaussian-Topic with Embedding Network for Summarization Ranking.",
                    "Improving Document Clustering for Short Texts by Long Documents via a Dirichlet Multinomial Allocation Model.",
                    "Intensity of Relationship Between Words: Using Word Triangles in Topic Discovery for Short Texts.",
                    "Context-Aware Topic Modeling for Content Tracking in Social Media."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2017-2",
                "sub_name": "Web and Big Data - First International Joint Conference, APWeb-WAIM 2017, Beijing, China, July 7-9, 2017, Proceedings, Part II.",
                "count": 35,
                "papers": [
                    "Combining Node Identifier Features and Community Priors for Within-Network Classification.",
                    "An Active Learning Approach to Recognizing Domain-Specific Queries From Query Log.",
                    "Event2vec: Learning Representations of Events on Temporal Sequences.",
                    "Joint Emoji Classification and Embedding Learning.",
                    "Target-Specific Convolutional Bi-directional LSTM Neural Network for Political Ideology Analysis.",
                    "Boost Clickbait Detection Based on User Behavior Analysis.",
                    "A Novel Hybrid Friends Recommendation Framework for Twitter.",
                    "A Time and Sentiment Unification Model for Personalized Recommendation.",
                    "Personalized POI Groups Recommendation in Location-Based Social Networks.",
                    "Learning Intermediary Category Labels for Personal Recommendation.",
                    "Skyline-Based Recommendation Considering User Preferences.",
                    "Improving Topic Diversity in Recommendation Lists: Marginally or Proportionally?",
                    "Integrating Feedback-Based Semantic Evidence to Enhance Retrieval Effectiveness for Clinical Decision Support.",
                    "Reordering Transaction Execution to Boost High Frequency Trading Applications.",
                    "Bus-OLAP: A Bus Journey Data Management Model for Non-on-time Events Query.",
                    "Distributed Data Mining for Root Causes of KPI Faults in Wireless Networks.",
                    "Precise Data Access on Distributed Log-Structured Merge-Tree.",
                    "Cuttle: Enabling Cross-Column Compression in Distributed Column Stores.",
                    "Optimizing Window Aggregate Functions via Random Sampling.",
                    "Fast Log Replication in Highly Available Data Store.",
                    "New Word Detection in Ancient Chinese Literature.",
                    "Identifying Evolutionary Topic Temporal Patterns Based on Bursty Phrase Clustering.",
                    "Personalized Citation Recommendation via Convolutional Neural Networks.",
                    "A Streaming Data Prediction Method Based on Evolving Bayesian Network.",
                    "A Learning Approach to Hierarchical Search Result Diversification.",
                    "TeslaML: Steering Machine Learning Automatically in Tencent.",
                    "DPHSim: A Flexible Simulator for DRAM/PCM-Based Hybrid Memory.",
                    "CrowdIQ: A Declarative Crowdsourcing Platform for Improving the Quality of Web Tables.",
                    "OICPM: An Interactive System to Find Interesting Co-location Patterns Using Ontologies.",
                    "BioPW: An Interactive Tool for Biological Pathway Visualization on Linked Data.",
                    "ChargeMap: An Electric Vehicle Charging Station Planning System.",
                    "Topic Browsing System for Research Papers Based on Hierarchical Latent Tree Analysis.",
                    "A Tool of Benchmarking Realtime Analysis for Massive Behavior Data.",
                    "Interactive Entity Centric Analysis of Log Data.",
                    "A Tool for 3D Visualizing Moving Objects."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2017w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2017 International Workshops: MWDA, HotSpatial, GDMA, DDC, SDMA, MASS, Beijing, China, July 7-9, 2017, Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "Smooth Representation Clustering Based on Kernelized Random Walks.",
                    "A Joint Model for Water Scarcity Evaluation.",
                    "Efficient Stance Detection with Latent Feature.",
                    "Deep Analysis and Utilization of Malware's Social Relation Network for Its Detection.",
                    "An Adversarial Machine Learning Model Against Android Malware Evasion Attacks.",
                    "Word Similarity Computation with Extreme-Similar Method.",
                    "Measuring the Wellness Indices of the Elderly Using RFID Sensors Data in a Smart Nursing Home.",
                    "Using Jaccard Distance Measure for Unsupervised Activity Recognition with Smartphone Accelerometers.",
                    "Speech Emotion Recognition Using Multiple Classifiers.",
                    "Intelligent Taxi Dispatching Based on Improved Artificial Fish Swarm Algorithm.",
                    "Correction of Telecom Localization Errors by Context Knowledge.",
                    "Inferring Unmet Human Mobility Demand with Multi-source Urban Data.",
                    "A Hybrid Approach of HTTP Anomaly Detection.",
                    "TaxiCluster: A Visualization Platform on Clustering Algorithms for Taxi Trajectories.",
                    "Transformation of XML Data Sources for Sequential Path Mining.",
                    "Graph Summarization Based on Attribute-Connected Network.",
                    "Timely Detection of Temporal Relations in RDF Stream Processing Scenario.",
                    "Finding Optimal Team for Multi-skill Task in Spatial Crowdsourcing.",
                    "CI-Bot: A Hybrid Chatbot Enhanced by Crowdsourcing.",
                    "Group Formation Based on Crowdsourced Top-k Recommendation.",
                    "Taxi Call Prediction for Online Taxicab Platforms.",
                    "Data Gathering Framework Based on Fog Computing Paradigm in VANETs.",
                    "Automatic Text Generation via Text Extraction Based on Submodular.",
                    "Collaborative Heterogeneous Information Embedding for Recommender Systems.",
                    "Comparative Research for Social Recommendations on VK."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th APWeb 2016",
        "info": "Suzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2016-1",
                "sub_name": "Web Technologies and Applications - 18th Asia-Pacific Web Conference, APWeb 2016, Suzhou, China, September 23-25, 2016. Proceedings, Part I.",
                "count": 48,
                "papers": [
                    "Probabilistic Nearest Neighbor Query in Traffic-Aware Spatial Networks.",
                    "NERank: Bringing Order to Named Entities from Texts.",
                    "FTS: A Practical Model for Feature-Based Trajectory Synthesis.",
                    "Distributed Text Representation with Weighting Scheme Guidance for Sentiment Analysis.",
                    "A Real Time Wireless Interactive Multimedia System.",
                    "Mining Co-locations from Continuously Distributed Uncertain Spatial Data.",
                    "An Online Approach for Direction-Based Trajectory Compression with Error Bound Guarantee.",
                    "A Data Grouping CNN Algorithm for Short-Term Traffic Flow Forecasting.",
                    "Efficient Evaluation of Shortest Travel-Time Path Queries in Road Networks by Optimizing Waypoints in Route Requests Through Spatial Mashups.",
                    "Discovering Companion Vehicles from Live Streaming Traffic Data.",
                    "Time-Constrained Sequenced Route Query in Indoor Spaces.",
                    "Near-Duplicate Web Video Retrieval and Localization Using Improved Edit Distance.",
                    "Efficient Group Top-k Spatial Keyword Query Processing.",
                    "Learn to Recommend Local Event Using Heterogeneous Social Networks.",
                    "Top-k Temporal Keyword Query over Social Media Data.",
                    "When a Friend Online is More Than a Friend in Life: Intimate Relationship Prediction in Microblogs.",
                    "Community Inference with Bayesian Non-negative Matrix Factorization.",
                    "Maximizing the Influence Ranking Under Limited Cost in Social Network.",
                    "Towards Efficient Influence Maximization for Evolving Social Networks.",
                    "Detecting Community Pacemakers of Burst Topic in Twitter.",
                    "Dynamic User Attribute Discovery on Social Media.",
                    "The Competition of User Attentions Among Social Network Services: A Social Evolutionary Game Approach.",
                    "Mechanism Analysis of Competitive Information Synchronous Dissemination in Social Networks.",
                    "A Topic-Specific Contextual Expert Finding Method in Social Network.",
                    "Budget Minimization with Time and Influence Constraints in Social Network.",
                    "B-mine: Frequent Pattern Mining and Its Application to Knowledge Discovery from Social Networks.",
                    "An Efficient Online Event Detection Method for Microblogs via User Modeling.",
                    "Man-O-Meter: Modeling and Assessing the Evolution of Language Usage of Individuals on Microblogs.",
                    "Forecasting Career Choice for College Students Based on Campus Big Data.",
                    "Online Prediction for Forex with an Optimized Experts Selection Model.",
                    "Fast Rare Category Detection Using Nearest Centroid Neighborhood.",
                    "Latent Semantic Diagnosis in Traditional Chinese Medicine.",
                    "Correlation-Based Weighted K-Labelsets for Multi-label Classification.",
                    "Classifying Relation via Bidirectional Recurrent Neural Network Based on Local Information.",
                    "Psychological Stress Detection from Online Shopping.",
                    "Confidence-Learning Based Collaborative Filtering with Heterogeneous Implicit Feedbacks.",
                    "Star-Scan: A Stable Clustering by Statistically Finding Centers and Noises.",
                    "Aggregating Crowd Wisdom with Instance Grouping Methods.",
                    "CoDS: Co-training with Domain Similarity for Cross-Domain Image Sentiment Classification.",
                    "Feature Selection via Vectorizing Feature's Discriminative Information.",
                    "A Label Inference Method Based on Maximal Entropy Random Walk over Graphs.",
                    "An Adaptive kNN Using Listwise Approach for Implicit Feedback.",
                    "Quantifying the Effect of Sentiment on Topic Evolution in Chinese Microblog.",
                    "Measuring Directional Semantic Similarity with Multi-features.",
                    "Finding Latest Influential Research Papers Through Modeling Two Views of Citation Links.",
                    "Multi-label Chinese Microblog Emotion Classification via Convolutional Neural Network.",
                    "Mining Recent High Expected Weighted Itemsets from Uncertain Databases.",
                    "Context-Aware Chinese Microblog Sentiment Classification with Bidirectional LSTM."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2016-2",
                "sub_name": "Web Technologies and Applications - 18th Asia-Pacific Web Conference, APWeb 2016, Suzhou, China, September 23-25, 2016. Proceedings, Part II.",
                "count": 72,
                "papers": [
                    "Flexible and Adaptive Stream Join Algorithm.",
                    "Finding Frequent Items in Time Decayed Data Streams.",
                    "A Target-Dependent Sentiment Analysis Method for Micro-blog Streams.",
                    "Online Streaming Feature Selection Using Sampling Technique and Correlations Between Features.",
                    "Real-Time Anomaly Detection over ECG Data Stream Based on Component Spectrum.",
                    "A Workload-Driven Vertical Partitioning Approach Based on Streaming Framework.",
                    "Spica: A Path Bundling Model for Rational Route Recommendation.",
                    "FHSM: Factored Hybrid Similarity Methods for Top-N Recommender Systems.",
                    "Personalized Resource Recommendation Based on Regular Tag and User Operation.",
                    "Academic Paper Recommendation Based on Community Detection in Citation-Collaboration Networks.",
                    "Improving Recommendation Accuracy for Travelers by Exploiting POI Correlations.",
                    "A Context-Aware Method for Top-k Recommendation in Smart TV.",
                    "A Hybrid Method for POI Recommendation: Combining Check-In Count, Geographical Information and Reviews.",
                    "Improving Temporal Recommendation Accuracy and Diversity via Long and Short-Term Preference Transfer and Fusion Models.",
                    "An Approach for Cross-Community Content Recommendation: A Case Study on Docker.",
                    "Scalable Private Blocking Technique for Privacy-Preserving Record Linkage.",
                    "Repair Singleton IDs on the Fly.",
                    "Modeling for Noisy Labels of Crowd Workers.",
                    "Incomplete Data Classification Based on Multiple Views.",
                    "Fuzzy Keywords Query.",
                    "EPLA: Efficient Personal Location Anonymity.",
                    "A Secure and Robust Covert Channel Based on Secret Sharing Scheme.",
                    "Discovering Approximate Functional Dependencies from Distributed Big Data.",
                    "Making Cold Data Identification Efficient in Non-volatile Memory Systems.",
                    "Preference Join on Heterogeneous Data.",
                    "Accelerating Time Series Shapelets Discovery with Key Points.",
                    "An Adaptive Partition-Based Caching Approach for Efficient Range Queries on Key-Value Data.",
                    "Handling Estimation Inaccuracy in Query Optimization.",
                    "Practical Study of Subclasses of Regular Expressions in DTD and XML Schema.",
                    "Chinese Microblog Sentiment Analysis Based on Sentiment Features.",
                    "FVBM: A Filter-Verification-Based Method for Finding Top-k Closeness Centrality on Dynamic Social Networks.",
                    "Online Hot Topic Detection from Web News Based on Bursty Term Identification.",
                    "Grouped Team Formation in Social Networks.",
                    "Profit Maximizing Route Recommendation for Vehicle Sharing Requests.",
                    "Ontology-Based Interactive Post-mining of Interesting Co-location Patterns.",
                    "AALRSMF: An Adaptive Learning Rate Schedule for Matrix Factorization.",
                    "A Graph Clustering Algorithm for Citation Networks.",
                    "A Distributed Frequent Itemsets Mining Algorithm Using Sparse Boolean Matrix on Spark.",
                    "A Simple Stochastic Gradient Variational Bayes for the Correlated Topic Model.",
                    "Reasoning with Large Scale OWL 2 EL Ontologies Based on MapReduce.",
                    "Purchase and Redemption Prediction Based on Multi-task Gaussian Process and Dimensionality Reduction.",
                    "Similarity Recoverable, Format-Preserving String Encryption.",
                    "RORS: Enhanced Rule-Based OWL Reasoning on Spark.",
                    "A Hadoop-Based Database Querying Approach for Non-expert Users.",
                    "A Collaborative Join Scheme on a MIC-Based Heterogeneous Platform.",
                    "Pairwise Expansion: A New Topdown Search for mCK Queries Problem over Spatial Web.",
                    "Mentioning the Optimal Users in the Appropriate Time on Twitter.",
                    "Historical Geo-Social Query Processing.",
                    "WS-Rank: Bringing Sentences into Graph for Keyword Extraction.",
                    "Efficient Community Maintenance for Dynamic Social Networks.",
                    "Open Sesame! Web Authentication Cracking via Mobile App Analysis.",
                    "K-th Order Skyline Queries in Bicriteria Networks.",
                    "A K-Motifs Discovery Approach for Large Time-Series Data Analysis.",
                    "User Occupation Prediction on Microblogs.",
                    "Combo-Recommendation Based on Potential Relevance of Items.",
                    "OPGs-Rec: Organized-POI-Groups Based Recommendation.",
                    "A Demonstration of Encrypted Logistics Information System.",
                    "PCMiner: An Extensible System for Analysing and Detecting Protein Complexes.",
                    "MASM: A Novel Movie Analysis System Based on Microblog.",
                    "A Text Retrieval System Based on Distributed Representations.",
                    "A System for Searching Renting Houses Based on Relaxed Query Answering.",
                    "TagTour: A Personalized Tourist Resource Recommendation System.",
                    "A Chronic Disease Analysis System Based on Dirty Data Mining.",
                    "ADDS: An Automated Disease Diagnosis-Aided System.",
                    "Indoor Map Service System Based on Wechat Two-Dimensional Code.",
                    "Factorization Machine Based Business Credit Scoring by Leveraging Internet Data.",
                    "OICRM: An Ontology-Based Interesting Co-location Rule Miner.",
                    "CB-CAS: A CAS-Based Cross-Browser SSO System.",
                    "A Demonstration of QA System Based on Knowledge Base.",
                    "An Alarming and Prediction System for Infections Disease Based on Combined Models.",
                    "Co-location Detector: A System to Find Interesting Spatial Co-locating Relationships.",
                    "KEIPD: Knowledge Extraction and Inference System for Personal Documents."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2016w",
                "sub_name": "Web Technologies and Applications - APWeb 2016 Workshops, WDMA, GAP, and SDMA, Suzhou, China, September 23-25, 2016, Proceedings.",
                "count": 27,
                "papers": [
                    "Maximizing the Cooperative Influence Spread in a Social Network Oriented to Viral Marketing.",
                    "A Multi-Model Based Approach for Big Data Analytics: The Case on Education Grant Distribution.",
                    "Sentiment Target Extraction Based on CRFs with Multi-features for Chinese Microblog.",
                    "EMD-DSJoin: Efficient Similarity Join Over Probabilistic Data Streams Based on Earth Mover's Distance.",
                    "Sentiment Analysis on User Reviews Through Lexicon and Rule-Based Approach.",
                    "Social Link Prediction Based on the Users' Information Transfer.",
                    "An Improved ML-kNN Approach Based on Coupled Similarity.",
                    "A Novel Recommendation Method Based on User's Interest and Heterogeneous Information.",
                    "Knee Point-Driven Bottleneck Detection Algorithm for Cloud Service System.",
                    "Confirmatory Analysis on Influencing Factors When Mention Users in Twitter.",
                    "A Stock Recommendation Strategy Based on M-LDA Model.",
                    "Short-Term Forecasting and Application About Indoor Cooling Load Based on EDA-PSO-BP Algorithm.",
                    "Identifying Relevant Subgraphs in Large Networks.",
                    "User-Dependent Multi-relational Community Detection in Social Networks.",
                    "Compressing Streaming Graph Data Based on Triangulation.",
                    "Scene Classification in High Resolution Remotely Sensed Images Based on PCANet.",
                    "Finding Top- k Places for Group Social Activities.",
                    "Temporal Spatial-Keyword Search on Databases Using SQL.",
                    "Features of Rumor Spreading on WeChat Moments.",
                    "Distance-Based Continuous Skylines on Geo-Textual Data.",
                    "Improving Urban Traffic Evacuation Capability in Emergency Response by Using Smart Phones.",
                    "Context Enhanced Keyword Extraction for Sparse Geo-Entity Relation from Web Texts.",
                    "A Stacked Generalization Framework for City Traffic Related Geospatial Data Analysis.",
                    "Detection of Statistically Significant Bus Delay Aggregation by Spatial-Temporal Scanning.",
                    "Acquisition and Representation of Knowledge for Academic Field.",
                    "Using Learning Features to Find Similar Trajectories.",
                    "An Algorithm for Mining Moving Flock Patterns from Pedestrian Trajectories."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th APWeb 2015",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2015",
                "sub_name": "Web Technologies and Applications - 17th Asia-PacificWeb Conference, APWeb 2015, Guangzhou, China, September 18-20, 2015, Proceedings.",
                "count": 76,
                "papers": [
                    "On the Marriage of SPARQL and Keywords.",
                    "An Online Inference Algorithm for Labeled Latent Dirichlet Allocation.",
                    "Efficient Buffer Management for PCM-Enhanced Hybrid Memory Architecture.",
                    "Efficient Location-Dependent Skyline Queries in Wireless Broadcast Environments.",
                    "Distance and Friendship: A Distance-Based Model for Link Prediction in Social Networks.",
                    "Multi-Label Emotion Tagging for Online News by Supervised Topic Model.",
                    "Distinguishing Specific and Daily Topics.",
                    "Matching Reviews to Object Based on 2-Stage CRF.",
                    "Discovering Restricted Regular Expressions with Interleaving.",
                    "Efficient Algorithms for Distance-Based Representative Skyline Computation in 2D Space.",
                    "Trustworthy Collaborative Filtering through Downweighting Noise and Redundancy.",
                    "A Co-ranking Framework to Select Optimal Seed Set for Influence Maximization in Heterogeneous Network.",
                    "Hashtag Sense Induction Based on Co-occurrence Graphs.",
                    "Hybrid-LSH for Spatio-Textual Similarity Queries.",
                    "Sleep Quality Evaluation of Active Microblog Users.",
                    "An Ensemble Matchers Based Rank Aggregation Method for Taxonomy Matching.",
                    "Distributed XML Twig Query Processing Using MapReduce.",
                    "Sentiment Word Identification with Sentiment Contextual Factors.",
                    "Large-Scale Graph Classification Based on Evolutionary Computation with MapReduce.",
                    "Multiple Attribute Aware Personalized Ranking.",
                    "Knowledge Base Completion Using Matrix Factorization.",
                    "MATAR: Keywords Enhanced Multi-label Learning for Tag Recommendation.",
                    "Reverse Direction-Based Surrounder Queries.",
                    "Learning to Hash for Recommendation with Tensor Data.",
                    "Spare Part Demand Prediction Based on Context-Aware Matrix Factorization.",
                    "Location Sensitive Friend Recommendation in Social Network.",
                    "A Compression-Based Filtering Mechanism in Content-Based Publish/Subscribe System.",
                    "Sentiment Classification for Chinese Product Reviews Based on Semantic Relevance of Phrase.",
                    "Overlapping Schema Summarization Based on Multi-label Propagation.",
                    "Analysis of Subjective City Happiness Index Based on Large Scale Microblog Data.",
                    "Tree-Based Metric Learning for Distance Computation in Data Mining.",
                    "GSCS - Graph Stream Classification with Side Information.",
                    "A Supervised Parameter Estimation Method of LDA.",
                    "Learning Similarity Functions for Urban Events Detection by Mining Hotline Phone Records.",
                    "Answering Spatial Approximate Keyword Queries in Disks.",
                    "Hashing Multi-Instance Data from Bag and Instance Level.",
                    "A Multi-news Timeline Summarization Algorithm Based on Aging Theory.",
                    "Extended Strategies for Document Clustering with Word Co-occurrences.",
                    "A Lightweight Evaluation Framework for Table Layouts in MapReduce Based Query Systems.",
                    "An Extended Graph-Based Label Propagation Method for Readability Assessment.",
                    "Simple is Beautiful: An Online Collaborative Filtering Recommendation Solution with Higher Accuracy.",
                    "Random-Based Algorithm for Efficient Entity Matching.",
                    "A New Similarity Measure Between Semantic Trajectories Based on Road Networks.",
                    "Effective Citation Recommendation by Unbiased Reference Priority Recognition.",
                    "UserGreedy: Exploiting the Activation Set to Solve Influence Maximization Problem.",
                    "AILabel: A Fast Interval Labeling Approach for Reachability Query on Very Large Graphs.",
                    "Graph-Based Hybrid Recommendation Using Random Walk and Topic Modeling.",
                    "RDQS: A Relevant and Diverse Query Suggestion Generation Framework.",
                    "Minimizing the Cost to Win Competition in Social Network.",
                    "Ad Dissemination Game in Ephemeral Networks.",
                    "User Generated Content Oriented Chinese Taxonomy Construction.",
                    "Mining Weighted Frequent Itemsets with the Recency Constraint.",
                    "Boosting Explicit Semantic Analysis by Clustering Paragraph Vectors of Wikipedia Articles.",
                    "Research on Semantic Disambiguation in Treebank.",
                    "PDMA: A Probabilistic Framework for Diversifying Recommendation Lists.",
                    "User Behavioral Context-Aware Service Recommendation for Personalized Mashups in Pervasive Environments.",
                    "On Coherent Indented Tree Visualization of RDF Graphs.",
                    "Online Feature Selection Based on Passive-Aggressive Algorithm with Retaining Features.",
                    "Online Personalized Recommendation Based on Streaming Implicit User Feedback.",
                    "A Self-learning Rule-Based Approach for Sci-tech Compound Phrase Entity Recognition.",
                    "Batch Mode Active Learning for Geographical Image Classification.",
                    "A Multi-view Retweeting Behaviors Prediction in Social Networks.",
                    "Probabilistic Frequent Pattern Mining by PUH-Mine.",
                    "A Secure and Efficient Framework for Privacy Preserving Social Recommendation.",
                    "DistDL: A Distributed Deep Learning Service Schema with GPU Accelerating.",
                    "A Semi-supervised Solution for Cold Start Issue on Recommender Systems.",
                    "Hybrid Cloud Deployment of an ERP-Based Student Administration System.",
                    "A Benchmark Evaluation of Enterprise Cloud Infrastructure.",
                    "A Fast Data Ingestion and Indexing Scheme for Real-Time Log Analytics.",
                    "A Fair Data Market System with Data Quality Evaluation and Repairing Recommendation.",
                    "HouseIn: A Housing Rental Platform with Non-redundant Information Integrated from Multiple Sources.",
                    "ONCAPS: An Ontology-Based Car Purchase Guiding System.",
                    "A Multiple Trust Paths Selection Tool in Contextual Online Social Networks.",
                    "EPEMS: An Entity Matching System for E-Commerce Products.",
                    "PPS-POI-Rec: A Privacy Preserving Social Point-of-Interest Recommender System.",
                    "Incorporating Contextual Information into a Mobile Advertisement Recommender System."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2015w",
                "sub_name": "Web Technologies and Applications - APWeb 2015 Workshops, BSD, WDMA, and BDAT, Guangzhou, China, September 18, 2015, Revised Selected Papers.",
                "count": 15,
                "papers": [
                    "A Method of Text Classification Combining Naive Bayes and the Similarity Computing Algorithms.",
                    "An Empirical Study of a Large Scale Online Recommendation System.",
                    "Application of Big Data Processing Technology in the Intelligent Network Management System.",
                    "Estimating the Missing Traffic Speeds via Continuous Conditional Random Fields.",
                    "GPU-Based Parallel Processing Technology in DPI.",
                    "Mining the Discriminative Word Sets for Bag-of-Words Model Based on Distributional Similarity Graph.",
                    "Research of Botnet Situation Awareness Based on Big Data.",
                    "Research on Cloud Datacenter Interconnect Technology.",
                    "Summarization-Based Ensemble Learning Method for Sparsely Labeled Webpage Classification.",
                    "Collaborative Model for Predicting Retweeting Behaviors on Twitter.",
                    "Protecting Location Privacy in Spatial Crowdsourcing.",
                    "A Trajectory Prediction Method for Location-Based Services.",
                    "Cross-Lingual Entity Query from Large-Scale Knowledge Graphs.",
                    "Graph-Based Approach for Cross Domain Text Linking.",
                    "Multi-dimensional User Credibility Analysis on Review Content."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th APWeb 2014",
        "info": "Changsha, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2014",
                "sub_name": "Web Technologies and Applications - 16th Asia-Pacific Web Conference, APWeb 2014, Changsha, China, September 5-7, 2014. Proceedings.",
                "count": 68,
                "papers": [
                    "Recent Topics of Research around the YAGO Knowledge Base.",
                    "Big Data Cleaning.",
                    "Differentially Private Data Release: Improving Utility with Wavelets and Bayesian Networks.",
                    "A Top K Relative Outlier Detection Algorithm in Uncertain Datasets.",
                    "Identifying Users Based on Behavioral-Modeling across Social Media Sites.",
                    "An Effective Approach on Overlapping Structures Discovery for Co-clustering.",
                    "Group-Based Personalized Location Recommendation on Social Networks.",
                    "A Lexicon-Based Multi-class Semantic Orientation Analysis for Microblogs.",
                    "Discovering Urban Spatio-temporal Structure from Time-Evolving Traffic Networks.",
                    "A Novel Topical Authority-Based Microblog Ranking.",
                    "A Time-Based Group Key Management Algorithm Based on Proxy Re-encryption for Cloud Storage.",
                    "A Fragile Watermarking Scheme for Modification Type Characterization in 2D Vector Maps.",
                    "Technology Effect Phrase Extraction in Chinese Patent Abstracts.",
                    "Sharing-Aware Scheduling of Web Services.",
                    "A Taxonomy of Hyperlink Hiding Techniques.",
                    "Improving Recommendation Accuracy with Clustering-Based Social Regularization.",
                    "TS-IDS Algorithm for Query Selection in the Deep Web Crawling.",
                    "A Method for Fine-Grained Document Alignment Using Structural Information.",
                    "Acquiring Stored or Real Time Satellite Data via Natural Language Query.",
                    "EISA: An Efficient Information Theoretical Approach to Value Segmentation in Large Databases.",
                    "Learning to Compute Semantic Relatedness Using Knowledge from Wikipedia.",
                    "Discovering Condition-Combined Functional Dependency Rules.",
                    "Summarizing Relational Database Schema Based on Label Propagation.",
                    "Delta-K 2-tree for Compact Representation of Web Graphs.",
                    "An EMD-Based Similarity Measure for Multi-type Entities Using Type Hierarchy.",
                    "Optimizing Alignment Selection in Ontology Matching via Homomorphism Constraint.",
                    "Matrix Factorization Meets Cosine Similarity: Addressing Sparsity Problem in Collaborative Filtering Recommender System.",
                    "Recommendation Based on Frequent N-adic Concepts.",
                    "Refreshment Strategies for the Shortest Path Caching Problem with Changing Edge Weight.",
                    "Based on Citation Diversity to Explore Influential Papers for Interdisciplinarity.",
                    "Multi-constrained Optimal Path Search Algorithms.",
                    "SPKV: A Multi-dimensional Index System for Large Scale Key-Value Stores.",
                    "Popularity Prediction in Microblogging Network.",
                    "DivRec: A Framework for Top-N Recommendation with Diversification in E-commerce.",
                    "An Efficient Graph Processing System.",
                    "An Approximate Duplicate-Elimination in RFID Data Streams Based on d-Left Time Bloom Filter.",
                    "MOARLE: Matrix Operation Accelerator Based on Run-Length Encoding.",
                    "Measuring User Similarity with Trajectory Patterns: Principles and New Metrics.",
                    "Graph-Based Summarization without Redundancy.",
                    "Structural-Based Relevance Feedback in XML Retrieval.",
                    "Query Authentication over Cloud Data from Multiple Contributors.",
                    "TL: A High Performance Buffer Replacement Strategy for Read-Write Splitting Web Applications.",
                    "Nearest Keyword Search on Probabilistic XML Data.",
                    "An Adaptive Skew Insensitive Join Algorithm for Large Scale Data Analytics.",
                    "A LDA-Based Algorithm for Length-Aware Text Clustering.",
                    "Semi-supervised Nonnegative Matrix Factorization for Microblog Clustering Based on Term Correlation.",
                    "Users' Behavior Session: Integrate Passive Feedback into Microblog Recommendation.",
                    "Towards Efficient Path Query on Social Network with Hybrid RDF Management.",
                    "Discovery of Unique Column Combinations with Hadoop.",
                    "Efficient Processing Node Proximity via Random Walk with Restart.",
                    "LCAD: A Correlation Based Abnormal Pattern Detection Approach for Large Amount of Monitor Data.",
                    "Cost-Based Optimization of Logical Partitions for a Query Workload in a Hadoop Data Warehouse.",
                    "DPMFNeg: A Dynamically Integrated Model for Collaborative Filtering.",
                    "A Consistency-Based Dimensionality Reduction Algorithm in Incomplete Data.",
                    "An Efficient Method for Topic-Aware Influence Maximization.",
                    "Efficient Frequent Itemset Mining from Dense Data Streams.",
                    "A Frequent Term-Based Multiple Clustering Approach for Text Documents.",
                    "What to Tag Your Microblog: Hashtag Recommendation Based on Topic Analysis and Collaborative Filtering.",
                    "Trust Discounting and Trust Fusion in Online Social Networks.",
                    "Topic-Based Sentiment Analysis Incorporating User Interactions.",
                    "Relevance Measure in Large-Scale Heterogeneous Networks.",
                    "Query Dependent Time-Sensitive Ranking Model for Microblog Search.",
                    "A Social Trust Path Recommendation System in Contextual Online Social Networks.",
                    "CrowdCleaner: A Data Cleaning System Based on Crowdsourcing.",
                    "Prototype System for Visualizing Review Text Using Evaluative Expression Dictionaries.",
                    "MOOD: Moving Objects Outlier Detection.",
                    "WikiReviz: An Edit History Visualization for Wiki Systems.",
                    "TruthOrRumor: Truth Judgment from Web."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2014w",
                "sub_name": "Web Technologies and Applications - APWeb 2014 Workshops, SNA, NIS, and IoTS, Changsha, China, September 5, 2014. Proceedings.",
                "count": 36,
                "papers": [
                    "Sentiment Analysis Based Online Restaurants Fake Reviews Hype Detection.",
                    "A Hybrid Method of Sentiment Key Sentence Identification Using Lexical Semantics and Syntactic Dependencies.",
                    "Influence Maximization in Independent Cascade Model with Limited Propagation Distance.",
                    "Online Social Network Model Based on Local Preferential Attachment.",
                    "Temporal Curve Patterns Discovery of Information in BBS.",
                    "Understanding Popularity Evolution Patterns of Hot Topics Based on Time Series Features.",
                    "VxBPEL_ODE: A Variability Enhanced Service Composition Engine.",
                    "Predicting User Likes in Online Media Based on Conceptualized Social Network Profiles.",
                    "Demographic Prediction of Online Social Network Based on Epidemic Model.",
                    "Analysis on Chinese Microblog Sentiment Based on Syntax Parsing and Support Vector Machine.",
                    "A Parallel and Scalable Framework for Non-overlapping Community Detection Algorithms.",
                    "Microblog Sentiment Analysis Model Based on Emoticons.",
                    "Detect and Analyze Flu Outlier Events via Social Network.",
                    "An Advanced Spam Detection Technique Based on Self-adaptive Piecewise Hash Algorithm.",
                    "DNFStore: A Distributed Netflow Storage System Supports Fast Retrieval.",
                    "A Novel Road Topology-aware Routing in VANETs.",
                    "Toward Identifying and Understanding User-Agent Strings in HTTP Traffic.",
                    "Cloud-Oriented SAT Solver Based on Obfuscating CNF Formula.",
                    "The Improved AC High-Performance Pattern-Matching Algorithm for Intrusion Detection.",
                    "The Research of Partitioning Model Based on Virtual Identity Data.",
                    "Implemention of Cyber Security Situation Awareness Based on Knowledge Discovery with Trusted Computer.",
                    "NNSDS: Network Nodes' Social Attributes Discovery System Based on Netflow.",
                    "A Survey of Network Attacks Based on Protocol Vulnerabilities.",
                    "Evaluation Scheme for Traffic Classification Systems.",
                    "Winnowing Multihashing Structure with Wildcard Query.",
                    "Efficient IEEE 802.15.4 AHB Slave of Security Accelerator in Wireless Senor Networks.",
                    "A Survey of Role Mining Methods in Role-Based Access Control System.",
                    "A Modified-k-Anonymity Towards Spatial-Temporal Historical Data in Location-Based Social Network Service.",
                    "A General Framework of Nonleakage-Based Authentication Using CSP for the Internet of Things.",
                    "A Security Routing Mechanism against Sybil Attacks in Mobile Social Networks.",
                    "Attribute-Role-Based Hybrid Access Control in the Internet of Things.",
                    "A Dynamic Feature-Based Security Detector in Wireless Sensor Network Transceiver.",
                    "A Highly Adaptable Reputation System Based on Dirichlet Distribution.",
                    "Research on Covert Channels Based on Multiple Networks.",
                    "Detecting Insider Threat Based on Document Access Behavior Analysis.",
                    "Enhanced Sample Selection for SVM on Face Recognition."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th APWeb 2013",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2013",
                "sub_name": "Web Technologies and Applications - 15th Asia-Pacific Web Conference, APWeb 2013, Sydney, Australia, April 4-6, 2013. Proceedings.",
                "count": 80,
                "papers": [
                    "Understanding Short Texts.",
                    "Managing the Wisdom of Crowds on Social Media Services.",
                    "Search on Graphs: Theory Meets Engineering.",
                    "A Simple XSLT Processor for Distributed XML.",
                    "Ontology Usage Network Analysis Framework.",
                    "Energy Efficiency in W-Grid Data-Centric Sensor Networks via Workload Balancing.",
                    "Update Semantics for Interoperability among XML, RDF and RDB - A Case Study of Semantic Presence in CISCO's Unified Presence Systems.",
                    "GPU-Accelerated Bidirected De Bruijn Graph Construction for Genome Assembly.",
                    "K Hops Frequent Subgraphs Mining for Large Attribute Graph.",
                    "Privacy Preserving Graph Publication in a Distributed Environment.",
                    "Correlation Mining in Graph Databases with a New Measure.",
                    "Improved Parallel Processing of Massive De Bruijn Graph for Genome Assembly.",
                    "B3Clustering: Identifying Protein Complexes from Protein-Protein Interaction Network.",
                    "Detecting Event Rumors on Sina Weibo Automatically.",
                    "Uncertain Subgraph Query Processing over Uncertain Graphs.",
                    "Improving Keyphrase Extraction from Web News by Exploiting Comments Information.",
                    "A Two-Layer Multi-dimensional Trustworthiness Metric for Web Service Composition.",
                    "An Integrated Approach for Large-Scale Relation Extraction from the Web.",
                    "Multi-QoS Effective Prediction in Web Service Selection.",
                    "Accelerating Topic Model Training on a Single Machine.",
                    "Collusion Detection in Online Rating Systems.",
                    "A Recommender System Model Combining Trust with Topic Maps.",
                    "A Novel Approach to Large-Scale Services Composition.",
                    "The Consistency and Absolute Consistency Problems of XML Schema Mappings between Restricted DTDs.",
                    "Linking Entities in Unstructured Texts with RDF Knowledge Bases.",
                    "An Approach to Retrieving Similar Source Codes by Control Structure and Method Identifiers.",
                    "Complementary Information for Wikipedia by Comparing Multilingual Articles.",
                    "Identification of Sybil Communities Generating Context-Aware Spam on Online Social Networks.",
                    "Location-Based Emerging Event Detection in Social Networks.",
                    "Measuring Strength of Ties in Social Network.",
                    "Finding Diverse Friends in Social Networks.",
                    "Social Network User Influence Dynamics Prediction.",
                    "Credibility-Based Twitter Social Network Analysis.",
                    "Design and Evaluation of Access Control Model Based on Classification of Users' Network Behaviors.",
                    "Two Phase Extraction Method for Extracting Real Life Tweets Using LDA.",
                    "A Probabilistic Model for Diversifying Recommendation Lists.",
                    "A Probabilistic Data Replacement Strategy for Flash-Based Hybrid Storage System.",
                    "An Influence Strength Measurement via Time-Aware Probabilistic Generative Model for Microblogs.",
                    "A New Similarity Measure Based on Preference Sequences for Collaborative Filtering.",
                    "Visually Extracting Data Records from Query Result Pages.",
                    "Leveraging Visual Features and Hierarchical Dependencies for Conference Information Extraction.",
                    "Aggregation-Based Probing for Large-Scale Duplicate Image Detection.",
                    "User Interest Based Complex Web Information Visualization.",
                    "FIMO: A Novel WiFi Localization Method.",
                    "An Algorithm for Outlier Detection on Uncertain Data Stream.",
                    "Improved Spatial Keyword Search Based on IDF Approximation.",
                    "Efficient Location-Dependent Skyline Retrieval with Peer-to-Peer Sharing.",
                    "What Can We Get from Learning Resource Comments on Engineering Pathway.",
                    "Tuned X-HYBRIDJOIN for Near-Real-Time Data Warehousing.",
                    "Exploiting Interaction Features in User Intent Understanding.",
                    "Identifying Semantic-Related Search Tasks in Query Log.",
                    "Multi-verifier: A Novel Method for Fact Statement Verification.",
                    "An Efficient Privacy-Preserving RFID Ownership Transfer Protocol.",
                    "Fractal Based Anomaly Detection over Data Streams.",
                    "Preservation of Proximity Privacy in Publishing Categorical Sensitive Data.",
                    "S2MART: Smart Sql to Map-Reduce Translators.",
                    "MisDis: An Efficent Misbehavior Discovering Method Based on Accountability and State Machine in VANET.",
                    "A Scalable Approach for LRT Computation in GPGPU Environments.",
                    "ASAWA: An Automatic Partition Key Selection Strategy.",
                    "An Active Service Reselection Triggering Mechanism.",
                    "Linked Data Informativeness.",
                    "Harnessing the Wisdom of Crowds for Corpus Annotation through CAPTCHA.",
                    "A Framework for OLAP in Column-Store Database: One-Pass Join and Pushing the Materialization to the End.",
                    "A Self-healing Framework for QoS-Aware Web Service Composition via Case-Based Reasoning.",
                    "Workload-Aware Cache for Social Media Data.",
                    "Shortening the Tour-Length of a Mobile Data Collector in the WSN by the Method of Linear Shortcut.",
                    "Towards Fault-Tolerant Chord P2P System: Analysis of Some Replication Strategies.",
                    "A MapReduce-Based Method for Learning Bayesian Network from Massive Data.",
                    "Practical Duplicate Bug Reports Detection in a Large Web-Based Development Community.",
                    "Selecting a Diversified Set of Reviews.",
                    "Detecting Community Structures in Microblogs from Behavioral Interactions.",
                    "Towards a Novel and Timely Search and Discovery System Using the Real-Time Social Web.",
                    "GWMF: Gradient Weighted Matrix Factorisation for Recommender Systems.",
                    "Collaborative Ranking with Ranking-Based Neighborhood.",
                    "Probabilistic Top-k Dominating Query over Sliding Windows.",
                    "Distributed Range Querying Moving Objects in Network-Centric Warfare.",
                    "An Efficient Approach on Answering Top-k Queries with Grid Dominant Graph Index.",
                    "A Survey on Clustering Techniques for Situation Awareness.",
                    "Parallel k-Skyband Computation on Multicore Architecture.",
                    "Moving Distance Simulation for Electric Vehicle Sharing Systems for Jeju City Area."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th APWeb 2012",
        "info": "Kunming, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2012",
                "sub_name": "Web Technologies and Applications - 14th Asia-Pacific Web Conference, APWeb 2012, Kunming, China, April 11-13, 2012. Proceedings.",
                "count": 80,
                "papers": [
                    "Scalable Integrity-Guaranteed AJAX.",
                    "Security and Trust in the Web.",
                    "Estimate Unlabeled-Data-Distribution for Semi-supervised PU Learning.",
                    "Disputed Sentence Suggestion towards Credibility-Oriented Web Search.",
                    "Exploration and Visualization of Administrator Network in Wikipedia.",
                    "An Efficient Algorithm for Arbitrary Reverse Furthest Neighbor Queries.",
                    "Memory-Aware BWT by Segmenting Sequences to Support Subsequence Search.",
                    "Mining Frequent Association Tag Sequences for Clustering XML Documents.",
                    "Context-Aware Personalized Search Based on User and Resource Profiles in Folksonomies.",
                    "Distance-Based Outlier Detection on Uncertain Data of Gaussian Distribution.",
                    "Extracting Keyphrase Set with High Diversity and Coverage Using Structural SVM.",
                    "Discovering the Most Potential Stars in Social Networks with Infra-skyline Queries.",
                    "Feature Based Informative Model for Discriminating Favorite Items from Unrated Ones.",
                    "Search for Minority Information from Wikipedia Based on Similarity of Majority Information.",
                    "An Incremental Approach to Analyzing Temporal Constraints of Workflow Processes.",
                    "Keywords Filtering over Probabilistic XML Data.",
                    "H-Tree: A Hybrid Structure for Confidence Computation in Probabilistic Databases.",
                    "Predicting Online Auction Final Prices Using Time Series Splitting and Clustering.",
                    "Taxonomy-Oriented Recommendation towards Recommendation with Stage.",
                    "A GPU-Based Accelerator for Chinese Word Segmentation.",
                    "The Equi-Join Processing and Optimization on Ring Architecture Key/Value Database.",
                    "Efficient Probabilistic Image Retrieval Based on a Mixed Feature Model.",
                    "A Software Watermark Based Architecture for Cloud Security.",
                    "FindCredPg: A Novel Method to Find Credible Pages Based on Trust Web Graph.",
                    "Multiple Time Series Anomaly Detection Based on Compression and Correlation Analysis: A Medical Surveillance Case Study.",
                    "Energy-Based Metric for Ensemble Selection.",
                    "PUF-Based RFID Authentication Protocol against Secret Key Leakage.",
                    "Collective Viewpoint Identification of Low-Level Participation.",
                    "Leveraging Network Structure for Incremental Document Clustering.",
                    "Integrating Temporal Usage Pattern into Personalized Tag Prediction.",
                    "An Optimization Strategy for Mashups Performance Based on Relational Algebra.",
                    "Model-Based Similarity Measure in TimeCloud.",
                    "Guess What I Want: Inferring the Semantics of Keyword Queries Using Evidence Theory.",
                    "Re-ranking by Multi-modal Relevance Feedback for Content-Based Social Image Retrieval.",
                    "Towards Real Intelligent Web Exploration.",
                    "Continuous Min-Max Distance Bounded Query in Road Networks.",
                    "Improve Top-K Recommendation by Extending Review Analysis.",
                    "CDDTA-JOIN: One-Pass OLAP Algorithm for Column-Oriented Databases.",
                    "A Study of the Single Point Mutation Loci in the Hepatitis B Virus Sequences via Optimal Risk and Preventive Sets with Weights.",
                    "Enforcing Interaction and Cooperation in Content-Based Web3.0 Applications.",
                    "Adaptive Topic Community Tracking in Social Network.",
                    "Extracting Difference Information from Multilingual Wikipedia.",
                    "Multi-strategic Approach of Fast Composition of Web Services.",
                    "Collaborative Filtering via Temporal Euclidean Embedding.",
                    "Transfer Learning with Local Smoothness Regularizer.",
                    "Scalable Complex Event Processing on Top of MapReduce.",
                    "Learning to Recommend Based on Slope One Strategy.",
                    "Dataflow Optimization for Service-Oriented Applications.",
                    "Group-Scope Query and Its Access Method.",
                    "Introducing SaaS Capabilities to Existing Web-Based Applications Automatically.",
                    "Computing Resource Prediction for MapReduce Applications Using Decision Tree.",
                    "Who Resemble You Better, Your Friends or Co-visited Users.",
                    "P2P-Based Publication and Sharing of Axioms in OWL Ontologies for SPARQL Query Processing in Distributed Environment.",
                    "When Sparsity Meets Noise in Collaborative Filtering.",
                    "Data Sparsity: A Key Disadvantage of User-Based Collaborative Filtering?",
                    "Path Skyline for Moving Objects.",
                    "A Graphical Audit Facility for Data Processing and Its Evaluation with Users.",
                    "Efficient SPARQL Query Processing in MapReduce through Data Partitioning and Indexing.",
                    "An Entity Class Model Based Correlated Query Path Selection Method in Multiple Domains.",
                    "ℓ1-Graph Based Community Detection in Online Social Networks.",
                    "Improving Recommendation Based on Features' Co-occurrence Effects in Collaborative Tagging Systems.",
                    "Memory Performance Prediction of Web Server Applications Based on Grey System Theory.",
                    "Performance Optimization of Analysis Rules in Real-Time Active Data Warehouses.",
                    "Efficient Retrieval of Similar Workflow Models Based on Behavior.",
                    "Scalable Subspace Logistic Regression Models for High Dimensional Data.",
                    "Verifying Location-Based Services with Declassification Enforcement.",
                    "Single-Hop Friends Recommendation and Verification Based Incentive for BitTorrent.",
                    "A Compact XML Storage Scheme Supporting Efficient Path Querying.",
                    "Self-supervised Learning Approach for Extracting Citation Information on the Web.",
                    "Complete-Thread Extraction from Web Forums.",
                    "Characterizing Topic-Specific Hashtag Cascade in Twitter Based on Distributions of User Influence.",
                    "A Study on Modeling of Lightweight Scientific Workflow Systems Using XML Schema.",
                    "Hit Count Reliability: How Much Can We Trust Hit Counts?",
                    "A Topological Description Language for Agent Networks.",
                    "Sentiment Analysis for Effective Detection of Cyber Bullying.",
                    "Bizard: An Online Multi-dimensional Data Analysis Visualization Tool.",
                    "Jingwei+: A Distributed Large-Scale RDF Data Server.",
                    "Baby Careware: A Online Secured Health Consultant.",
                    "Mobile Applications towards Prevention and Management of Chronic Diseases.",
                    "A Healthcare Information System with Augmented Access Controls."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2012w",
                "sub_name": "Web Technologies and Applications - APWeb 2012 International Workshops: SenDe, IDP, IEKB, MBC, Kunming, China, April 11-13, 2012. Proceedings.",
                "count": 29,
                "papers": [
                    "Keynote Speech: Technological Breakthroughs in Environmental Sensor Networks.",
                    "A New Formal Description Model of Network Attacking and Defence Knowledge of Oil and Gas Field SCADA System.",
                    "An Efficient Overload Control Strategy in Cloud.",
                    "The Geological Disasters Defense Expert System of the Massive Pipeline Network SCADA System Based on FNN.",
                    "TDSC: A Two-phase Duplicate String Compression Algorithm.",
                    "Twig Pattern Matching Running on XML Streams.",
                    "A Novel Method for Extension Transformation Knowledge Discovering.",
                    "A Flexible Parallel Runtime for Large Scale Block-Based Matrix Multiplication.",
                    "Group Detection and Relation Analysis Research for Web Social Network.",
                    "Worm Propagation Control Based on Spatial Correlation in Wireless Sensor Network.",
                    "PointBurst: Towards a Trust-Relationship Framework for Improved Social Recommendations.",
                    "Analysis Framework for Electric Vehicle Sharing Systems Using Vehicle Movement Data Stream.",
                    "Research on Customer Segmentation Based on Extension Classification.",
                    "An Incremental Mining Algorithm for Association Rules Based on Minimal Perfect Hashing and Pruning.",
                    "LDA-Based Topic Modeling in Labeling Blog Posts with Wikipedia Entries.",
                    "The Correlation between Semantic Visual Similarity and Ontology-Based Concept Similarity in Effective Web Image Search.",
                    "An Adaptive Design Pattern for Invocation of Synchronous and Asynchronous Web Services in Autonomic Computing Systems.",
                    "Mining Tribe-Leaders Based on the Frequent Pattern of Propagation.",
                    "Research on Semantic Label Extraction of Domain Entity Relation Based on CRF and Rules.",
                    "Recognition of Chinese Personal Names Based on CRFs and Law of Names.",
                    "An Academic Search and Analysis Prototype for Specific Domain.",
                    "Learning Chinese Entity Attributes from Online Encyclopedia.",
                    "A Mathematical Model for Human Flesh Search Engine.",
                    "A New Dynamic ID-Based Remote User Authentication Scheme with Forward Secrecy.",
                    "Reconstructing Unsound Data Provenance View in Scientific Workflow.",
                    "A Process Distance Metric Based on Alignment of Process Structure Trees.",
                    "Adoption of Cloud Computing in Supply Chain Management Solutions: A SCOR-Aligned Assessment.",
                    "Exploiting Space-Time Status for Service Recommendation.",
                    "Invariant Analysis for Ordering Constraints of Multi-view Business Process Model."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th APWeb 2011",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2011",
                "sub_name": "Web Technologies and Applications - 13th Asia-Pacific Web Conference, APWeb 2011, Beijing, China, April 18-20, 2011. Proceedings.",
                "count": 53,
                "papers": [
                    "Information Networks Mining and Analysis.",
                    "iMiner: From Passive Searching to Active Pushing.",
                    "On the Querying for Places on the Mobile Web.",
                    "Music Review Classification Enhanced by Semantic Information.",
                    "Role Discovery for Graph Clustering.",
                    "Aggregate Distance Based Clustering Using Fibonacci Series-FIBCLUS.",
                    "Exploiting Explicit Semantics-Based Grouping for Author Interest Finding.",
                    "Top-K Probabilistic Closest Pairs Query in Uncertain Spatial Databases.",
                    "CkNN Query Processing over Moving Objects with Uncertain Speeds in Road Networks.",
                    "Discrete Trajectory Prediction on Mobile Data.",
                    "Cleaning Uncertain Streams for Query Improvement.",
                    "Personalized Web Search with User Geographic and Temporal Preferences.",
                    "Web User Profiling on Proxy Logs and Its Evaluation in Personalization.",
                    "Exploring Folksonomy and Cooking Procedures to Boost Cooking Recipe Recommendation.",
                    "Effective Hybrid Recommendation Combining Users-Searches Correlations Using Tensors.",
                    "Maintaining Internal Consistency of Report for Real-Time OLAP with Layer-Based View.",
                    "Efficient Approximate Top-k Query Algorithm Using Cube Index.",
                    "DVD: A Model for Event Diversified Versions Discovery.",
                    "Categorical Data Skyline Using Classification Tree.",
                    "Quality Evaluation of Wikipedia Articles through Edit History and Editor Groups.",
                    "Towards Improving Wikipedia as an Image-Rich Encyclopaedia through Analyzing Appropriateness of Images for an Article.",
                    "SDDB: A Self-Dependent and Data-Based Method for Constructing Bilingual Dictionary from the Web.",
                    "Measuring Similarity of Chinese Web Databases Based on Category Hierarchy.",
                    "Effective Term Weighting in ALT Text Prediction for Web Image Retrieval.",
                    "Layout Object Model for Extracting the Schema of Web Query Interfaces.",
                    "Tagging Image with Informative and Correlative Tags.",
                    "Let Other Users Help You Find Answers: A Collaborative Question-Answering Method with Continuous Markov Chain Model.",
                    "Hybrid Index Structures for Temporal-Textual Web Search.",
                    "Complex Event Processing over Unreliable RFID Data Streams.",
                    "A Graph Model Based Simulation Tool for Generating RFID Streaming Data.",
                    "Assisting the Design of XML Schema: Diagnosing Nondeterministic Content Models.",
                    "Improving Matching Process in Social Network Using Implicit and Explicit User Information.",
                    "Dynamic Network Motifs: Evolutionary Patterns of Substructures in Complex Networks.",
                    "Social Network Analysis on KAD and Its Application.",
                    "Modeling and Querying Probabilistic RDFS Data Sets with Correlated Triples.",
                    "A Tableau Algorithm for Paraconsistent and Nonmonotonic Reasoning in Description Logic-Based System.",
                    "Key Concepts Identification and Weighting in Search Engine Queries.",
                    "SecGuard: Secure and Practical Integrity Protection Model for Operating Systems.",
                    "A Traceable Certificateless Threshold Proxy Signature Scheme from Bilinear Pairings.",
                    "A Mashup Tool for Cross-Domain Web Applications Using HTML5 Technologies.",
                    "Change Tracer: A Protégé Plug-In for Ontology Recovery and Visualization.",
                    "Augmenting Traditional ER Method to Support Spatiotemporal Database Applications.",
                    "STOC: Extending Oracle to Support Spatiotemporal Data Management.",
                    "Preface to the 2nd International Workshop on Unstructured Data Management (USDM 2011).",
                    "ITEM: Extract and Integrate Entities from Tabular Data to RDF Knowledge Base.",
                    "Batch Text Similarity Search with MapReduce.",
                    "An Empirical Study of Massively Parallel Bayesian Networks Learning for Sentiment Extraction from Unstructured Text.",
                    "Preface of the 2nd International Workshop on XML Data Management.",
                    "XPath Rewriting Using Views: The More the Merrier.",
                    "OSD-DB: A Military Logistics Mobile Database.",
                    "Querying and Reasoning with RDF(S)/OWL in XQuery.",
                    "A Survey on XML Keyword Search.",
                    "Schema Mapping with Quality Assurance for Data Integration."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th APWeb 2010",
        "info": "Busan, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2010",
                "sub_name": "Advances in Web Technologies and Applications, Proceedings of the 12th Asia-Pacific Web Conference, APWeb 2010, Busan, Korea, 6-8 April 2010.",
                "count": 74,
                "papers": [
                    "The Negative Byproducts of the Internet.",
                    "Structured Data on the Web.",
                    "Aggregate Nearest Keyword Search in Spatial Databases.",
                    "StickViz: A New Visualization Tool for Phenomenon-Based k-Neighbors Searches in Geosocial Networking Services.",
                    "Moving K-Nearest Neighbor Query over Obstructed Regions.",
                    "A Hybrid Flash Memory SSD Scheme for Enterprise Database Applications.",
                    "HashTree: A New Hybrid Index for Flash Disks.",
                    "Using Index in the MapReduce Framework.",
                    "Suggesting Topic-Based Query Terms as You Type.",
                    "An Effective and High-quality Query Relaxation Solution on the Deep Web.",
                    "Applying Taxonomic Knowledge and Semantic Collaborative Filtering to Personalized Search: A Bayesian Belief Network Based Approach.",
                    "Service Collaboration Network: A Novel Mechanism for Web Service Management.",
                    "Retrieving Cultural Heritage Information with Google Earth.",
                    "Dynamically Analyzing Time Constraints in Workflow Systems with Fixed-Date Constraint.",
                    "Improving a News Recommendation System in Adapting to Interests of a User with Storage of a Constant Size.",
                    "Graph-Based Recommendation on Social Networks.",
                    "Recommendation for Movies and Stars Using YAGO and IMDB.",
                    "Effective Clustering of Dense and Concentrated Online Communities.",
                    "Multi-View Clustering with Web and Linguistic Features for Relation Extraction.",
                    "An Efficient Method for Incremental Mining of Share-Frequent Patterns.",
                    "Local Methods for Estimating SimRank Score.",
                    "A Space and Time Efficient Algorithm for SimRank Computation.",
                    "An Asymmetric Similarity Measure for Tag Clustering on Flickr.",
                    "Two Novel Adaptive Symbolic Representations for Similarity Search in Time Series Databases.",
                    "An Incremental Prefix Filtering Approach for the All Pairs Similarity Search Problem.",
                    "Efficient Peer-to-Peer Similarity Query Processing for High-dimensional Data.",
                    "Recording How-Provenance on Probabilistic Databases.",
                    "Query-Aware Complex Object Buffer Management in XML Information Retrieval.",
                    "Efficient Common Items Extraction from Multiple Sorted Lists.",
                    "Combining the Missing Link: An Incremental Topic Model of Document Content and Hyperlink.",
                    "Crawling Online Social Graphs.",
                    "Learning to Find Interesting Connections in Wikipedia.",
                    "Object Recognition via Adaptive Multi-level Feature Integration.",
                    "Efficient and Continuous Near-duplicate Video Detection.",
                    "Text-Aided Image Classification: Using Labeled Text from Web to Help Image Classification.",
                    "Efficient SLCA Computing Service for XML Filtering in IaaS.",
                    "Computing Large Skylines over Few Dimensions: The Curse of Anti-correlation.",
                    "A Query Processing Approach Based on Queuing Model for Cyber-Physical Systems.",
                    "Using Temporal Information to Improve Predictive Accuracy of Collaborative Filtering Algorithms.",
                    "Named Entity Resolution in Chinese News Comments on the Web.",
                    "ECON: An Approach to Extract Content from Web News Page.",
                    "ParaCube: A Scalable OLAP Model Based on Distributed Aggregate Computing with Sibling Cubes.",
                    "Partitioned Dimension: Modeling the Numerical Dimension in Data Warehouse.",
                    "OntLMS: An Ontology-Based Lifelog Management System.",
                    "Entity-Event Lifelog Ontology Model (EELOM) for LifeLog Ontology Schema Definition.",
                    "Classification-Based Skin Aging Analysis Scheme.",
                    "Recommended or Not Recommended? Review Classification through Opinion Extraction.",
                    "Multiple Continuous Queries Optimization for Processing RFID Streaming Data.",
                    "Skyline Minimum Vector.",
                    "Complex Event Detection in Probabilistic Stream.",
                    "Adaptive Top-k Algorithm in SLCA-Based XML Keyword Search.",
                    "MMIR: Mining Multi-scale Intervention Rules in Sub-Complex System.",
                    "Detect Events on Noisy Textual Datasets.",
                    "Mining Regular Patterns in Incremental Transactional Databases.",
                    "Host-IP Clustering Technique for Deep Web Characterization.",
                    "Implementation of Autonomous Pricing Mechanism in Grid Computing.",
                    "A Cluster-Based Group Key Management Scheme for Wireless Sensor Networks.",
                    "SOARWare: A Service Oriented Software Production and Running Environment.",
                    "A Metric for Measuring Members' Contribution to Information Propagation in Social Network Sites.",
                    "Optimizing Query Processing for the Hidden Web.",
                    "Aggregating, Operating, Sharing and Utilizing Internet-Based Services with the VINCA Approach.",
                    "Building Web Page Logical Structure Model towards Effective Metadata Extraction.",
                    "A Multi-Pattern Search Algorithm for Block Motion Estimation in Video Coding.",
                    "Continuous-tone Watermark Hiding in Halftone Images.",
                    "Multi-Factor Authentication Using Fingerprints and User-Specific Random Projection.",
                    "A Fast Implementation of Arithmetic Coding.",
                    "An O-FDP Framework in 3D Model Based Reconstruction.",
                    "laUD-MS: An Extensible System for Unstructured Data Management.",
                    "Managing a Large Shared Bank of Unstructured Data by Using Free-Table.",
                    "A Three Layer System Architecture for Web-Based Unstructured Data Management.",
                    "Towards Video Management over Relational Database.",
                    "Phosphor: A Cloud Based DRM Scheme with Sim Card.",
                    "Domain-oriented Deep Web Data Sources' Discovery and Identification.",
                    "A Heuristic Method for Unstructured Pattern Management over Data Streams."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th APWeb/WAIM 2009:\nSuzhou, China",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2009",
                "sub_name": "Advances in Data and Web Management, Joint International Conferences, APWeb/WAIM 2009, Suzhou, China, April 2-4, 2009, Proceedings.",
                "count": 70,
                "papers": [
                    "Distributed XML Processing.",
                    "Towards Multi-modal Extraction and Summarization of Conversations.",
                    "Simple but Effective Porn Query Recognition by k-NN with Semantic Similarity Measure.",
                    "Selective-NRA Algorithms for Top-k Queries.",
                    "Continuous K-Nearest Neighbor Query over Moving Objects in Road Networks.",
                    "Data Quality Aware Queries in Collaborative Information Systems.",
                    "Probabilistic Threshold Range Aggregate Query Processing over Uncertain Data.",
                    "Dynamic Data Migration Policies for Query-Intensive Distributed Data Environments.",
                    "C-Tree Indexing for Holistic Twig Joins.",
                    "Processing XML Keyword Search by Constructing Effective Structured Queries.",
                    "Representing Multiple Mappings between XML and Relational Schemas for Bi-directional Query Translation.",
                    "Finding Irredundant Contained Rewritings of Tree Pattern Queries Using Views.",
                    "IRank: A Term-Based Innovation Ranking System for Conferences and Scholars.",
                    "A Generalized Topic Modeling Approach for Maven Search.",
                    "Topic and Viewpoint Extraction for Diversity and Bias Analysis of News Contents.",
                    "Topic-Level Random Walk through Probabilistic Model.",
                    "Query-Focused Summarization by Combining Topic Model and Affinity Propagation.",
                    "Rank Aggregation to Combine QoS in Web Search.",
                    "Personalized Delivery of On-Line Search Advertisement Based on User Interests.",
                    "Automatic Web Image Annotation via Web-Scale Image Semantic Space Learning.",
                    "Representing and Inferring Causalities among Classes of Multidimensional Data.",
                    "Efficient Incremental Computation of CUBE in Multiple Versions What-If Analysis.",
                    "Incremental Computation for MEDIAN Cubes in What-If Analysis.",
                    "The Tradeoff of Delta Table Merging and Re-writing Algorithms in What-If Analysis Application.",
                    "Efficiently Clustering Probabilistic Data Streams.",
                    "Detecting Abnormal Trend Evolution over Multiple Data Streams.",
                    "Mining Interventions from Parallel Event Sequences.",
                    "Effective Similarity Analysis over Event Streams Based on Sharing Extent.",
                    "A Term-Based Driven Clustering Approach for Name Disambiguation.",
                    "Sentiment Clustering: A Novel Method to Explore in the Blogosphere.",
                    "Kernel-Based Transductive Learning with Nearest Neighbors.",
                    "An Improved Algorithm for Mining Non-Redundant Interacting Feature Subsets.",
                    "AutoPCS: A Phrase-Based Text Categorization System for Similar Texts.",
                    "A Probabilistic Approach for Mining Drifting User Interest.",
                    "Temporal Company Relation Mining from the Web.",
                    "StreetTiVo: Using a P2P XML Database System to Manage Multimedia Data in Your Living Room.",
                    "Qualitative Spatial Representation and Reasoning for Data Integration of Ocean Observational Systems.",
                    "Managing Hierarchical Information on Small Screens.",
                    "An Approach to Detect Collaborative Conflicts for Ontology Development.",
                    "Using Link-Based Content Analysis to Measure Document Similarity Effectively.",
                    "Parallel Load Balancing Strategies for Tree-Structured Peer-to-Peer Networks.",
                    "A Verification Mechanism for Secured Message Processing in Business Collaboration.",
                    "Semantic Service Discovery by Consistency-Based Matchmaking.",
                    "A Fast Heuristic Algorithm for the Composite Web Service Selection.",
                    "Intervention Events Detection and Prediction in Data Streams.",
                    "New Balanced Data Allocating and Online Migrating Algorithms in Database Cluster.",
                    "An Evaluation of Real-Time Transaction Services in Web Services E-Business Systems.",
                    "Formal Definition and Detection Algorithm for Passive Event in RFID Middleware.",
                    "Distributed Benchmarking of Relational Database Systems.",
                    "Optimizing Many-to-Many Data Aggregation in Wireless Sensor Networks.",
                    "Bag of Timestamps: A Simple and Efficient Bayesian Chronological Mining.",
                    "Efficient Hybrid Password-Based Authenticated Group Key Exchange.",
                    "Optimal K-Nearest-Neighbor Query in Data Grid.",
                    "A Routing Scheme with Localized Movement in Event-Driven Wireless Sensor Networks.",
                    "Short Text Clustering for Search Results.",
                    "Load Shedding for Shared Window Join over Real-Time Data Streams.",
                    "A Sliding-Window Approach for Finding Top-k Frequent Itemsets from Uncertain Streams.",
                    "A Novel ID-Based Anonymous Signcryption Scheme.",
                    "Pseudo Period Detection on Time Series Stream with Scale Smoothing.",
                    "An Affinity Path Based Wireless Broadcast Scheduling Approach for Multi-item Queries.",
                    "Lightweight Data Mining Based Database System Self-optimization: A Case Study.",
                    "Efficient Detection of Discords for Time Series Stream.",
                    "SLICE: A Novel Method to Find Local Linear Correlations by Constructing Hyperplanes.",
                    "Complete and Equivalent Query Rewriting Using Views.",
                    "Grubber: Allowing End-Users to Develop XML-Based Wrappers for Web Data Sources.",
                    "Performance Analysis of Group Handover Scheme for IEEE 802.16j-Enabled Vehicular Networks.",
                    "Directly Identify Unexpected Instances in the Test Set by Entropy Maximization.",
                    "Decentralized Orchestration of BPEL Processes with Execution Consistency.",
                    "Let Wiki Be More Powerful and Suitable for Enterprises with External Program.",
                    "DepRank: A Probabilistic Measure of Dependence via Heterogeneous Links."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2009w",
                "sub_name": "Advances in Web and Network Technologies, and Information Management, APWeb/WAIM 2009 International Workshops: WCMT 2009, RTBI 2009, DBIR-ENQOIR 2009, PAIS 2009, Suzhou, China, April 2-4, 2009, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "ScaMMDB: Facing Challenge of Mass Data Processing with MMDB.",
                    "A Data Distribution Strategy for Scalable Main-Memory Database.",
                    "Temporal Restriction Query Optimization for Event Stream Processing.",
                    "Video Object Segmentation Based on Disparity.",
                    "A Database Approach for Accelerate Video Data Access.",
                    "Medical Image Retrieval in Private Network Based on Dynamic Fuzzy Data Model and Wavelet Entropy.",
                    "Extension of OWL with Dynamic Fuzzy Logic.",
                    "ADEB: A Dynamic Alert Degree Evaluation Model for Blogosphere.",
                    "Data Warehouse Based Approach to the Integration of Semi-structured Data.",
                    "Towards Faceted Search for Named Entity Queries.",
                    "A Petri-Net-Based Approach to QoS Estimation of Web Service Choreographies.",
                    "Personalization Service Research of the E-Learning System Based on Clustering Coefficient Partition Algorithm.",
                    "Automatic Generation of Processes Based on Processes Semantic for Smartflow Pattern.",
                    "Easy Flow: New Generation Business Process Model.",
                    "User Feedback for Improving Question Categorization in Web-Based Question Answering Systems.",
                    "XTree: A New XML Keyword Retrieval Model.",
                    "Effective Top-k Keyword Search in Relational Databases Considering Query Semantics.",
                    "A Grid Index Based Method for Continuous Constrained Skyline Query over Data Stream.",
                    "Ontology Personalization: An Approach Based on Conceptual Prototypicality.",
                    "Ontology Evaluation through Text Classification.",
                    "Core-Tag Clustering for Web 2.0 Based on Multi-similarity Measurements.",
                    "Meta Galaxy: A Flexible and Efficient Cube Model for Data Retrieval in OLAP."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th APWeb 2008",
        "info": "Shenyang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2008",
                "sub_name": "Progress in WWW Research and Development, 10th Asia-Pacific Web Conference, APWeb 2008, Shenyang, China, April 26-28, 2008. Proceedings.",
                "count": 68,
                "papers": [
                    "Socio-Sense: A System for Analysing the Societal Behavior from Long Term Web Archive.",
                    "Building Web-Scale Data Mining Infrastructure for Search.",
                    "Aggregate Computation over Data Streams.",
                    "A Family of Optimization Based Data Mining Methods.",
                    "Web Evolution Management: Detection, Monitoring, and Mining.",
                    "Research and Practice in Data Quality.",
                    "Detecting Overlapping Community Structures in Networks with Global Partition and Local Expansion.",
                    "High Confidence Fragment-Based Classification Rule Mining for Imbalanced HIV Data.",
                    "Source Credibility Model for Neighbor Selection in Collaborative Web Content Recommendation.",
                    "The Layered World of Scientific Conferences.",
                    "Mining Maximal Frequent Subtrees with Lists-Based Pattern-Growth Method.",
                    "Mining the Web for Hyponymy Relations Based on Property Inheritance.",
                    "Detecting Outliers in Categorical Record Databases Based on Attribute Associations.",
                    "An Energy-Efficient Multi-agent Based Architecture in Wireless Sensor Network.",
                    "Task Migration Enabling Grid Workflow Application Rescheduling.",
                    "A Dependent Tasks Scheduling Model in Grid.",
                    "A Hierarchical Replica Location Approach Based on Cache Mechanism and Load Balancing in Data Grid.",
                    "Wireless Video-Based Sensor Networks for Surveillance of Residential Districts.",
                    "Trust Maintenance Toward Virtual Computing Environment in the Grid Service.",
                    "An Association Model of Sensor Properties for Event Diffusion Spotting Sensor Networks.",
                    "CROWNBench: A Grid Performance Testing System Using Customizable Synthetic Workload.",
                    "A Decision Procedure for XPath Satisfiability in the Presence of DTD Containing Choice.",
                    "Performance Analysis and Improvement for Transformation Operators in XML Data Integration.",
                    "Similarity Computation for XML Documents by XML Element Sequence Patterns.",
                    "Evolving Weighting Functions for Query Expansion Based on Relevance Feedback.",
                    "Ontology-Based Mobile Information Service Platform.",
                    "On Safety, Computability and Local Property of Web Queries.",
                    "Privacy Inference Attacking and Prevention on Multiple Relative K-Anonymized Microdata Sets.",
                    "Exposing Homograph Obfuscation Intentions by Coloring Unicode Strings.",
                    "On the Complexity of Restricted k-anonymity Problem.",
                    "An Efficient Electronic Marketplace Bidding Auction Protocol with Bid Privacy.",
                    "A Provable Secure Authentication Protocol Given Forward Secure Session Key.",
                    "A Secure Multi-dimensional Partition Based Index in DAS.",
                    "Multilateral Approaches to the Mobile RFID Security Problem Using Web Service.",
                    "Classifying Security Patterns.",
                    "Enhanced Mutual Authentication and Key Exchange Protocol for Wireless Communications.",
                    "Verification of the Security Against Inference Attacks on XML Databases.",
                    "Mining, Ranking, and Using Acronym Patterns.",
                    "A Method for Web Information Extraction.",
                    "Information Presentation on Mobile Devices: Techniques and Practices.",
                    "Pattern-Based Extraction of Addresses from Web Page Content.",
                    "An Effective Method Supporting Data Extraction and Schema Recognition on Deep Web.",
                    "The Experiments with the Linear Combination Data Fusion Method in Information Retrieval.",
                    "Squeezing Long Sequence Data for Efficient Similarity Search.",
                    "An Architecture for Distributed Controllable Networks and Manageable Node Based on Network Processor.",
                    "Building a Scalable P2P Network with Small Routing Delay.",
                    "ERASP: An Efficient and Robust Adaptive Superpeer Overlay Network.",
                    "Traceable P2P Record Exchange Based on Database Technologies.",
                    "ACORN : Towards Automating Domain Specific Ontology Construction Process.",
                    "Ontological Knowledge Management Through Hybrid Unsupervised Clustering Techniques.",
                    "Semantic-Enabled Organization of Web Services.",
                    "Rule Mining for Automatic Ontology Based Data Cleaning.",
                    "Towards Automatic Verification of Web-Based SOA Applications.",
                    "A Novel and Effective Method for Web System Tuning Based on Feature Selection.",
                    "Effective Data Distribution and Reallocation Strategies for Fast Query Response in Distributed Query-Intensive Data Environments.",
                    "A Novel Chi2 Algorithm for Discretization of Continuous Attributes.",
                    "Mining Multiple Time Series Co-movements.",
                    "Effective Spatio-temporal Analysis of Remote Sensing Data.",
                    "Supporting Top-K Aggregate Queries over Unequal Synopsis on Internet Traffic Streams.",
                    "ONOMATOPEDIA: Onomatopoeia Online Example Dictionary System Extracted from Data on the Web.",
                    "Connectivity of the Thai Web Graph.",
                    "On the Trustworthiness and Transparency of a Web Search Site Examined Using \"Gender-equal\" as a Search Keyword.",
                    "SemSearch: A Scalable Semantic Searching Algorithm for Unstructured P2P Network.",
                    "Web Image Annotation Based on Automatically Obtained Noisy Training Set.",
                    "An Effective Query Relaxation Solution for the Deep Web.",
                    "A Framework for Query Capabilities and Interface Design of Mediators on the Gulf of Mexico Data Sources.",
                    "Process Mediation Based on Triple Space Computing.",
                    "An Efficient Approach for Supporting Dynamic Evolutionary Change of Adaptive Workflow."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2008w",
                "sub_name": "Advanced Web and NetworkTechnologies, and Applications, APWeb 2008 International Workshops: BIDM, IWHDM, and DeWeb Shenyang, China, April 26-28, 2008. Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Moving Objects Databases Based on Dynamic Transportation Networks: Modeling, Indexing, and Implementation.",
                    "Approach to Detection of Community's Consensus and Interest.",
                    "A Comparative Empirical Study on the Margin Setting of Stock Index Futures Calendar Spread Trading.",
                    "A Study on Multi-word Extraction from Chinese Documents.",
                    "Discovering Interesting Classification Rules with Particle Swarm Algorithm.",
                    "Improving the Use, Analysis and Integration of Patient Health Data.",
                    "DM-Based Medical Solution and Application.",
                    "Learning-Function-Augmented Inferences of Causalities Implied in Health Data.",
                    "Support Vector Machine for Outlier Detection in Breast Cancer Survivability Prediction.",
                    "An Empirical Study of Combined Classifiers for Knowledge Discovery on Medical Data Bases.",
                    "Tracing the Application of Clinical Guidelines.",
                    "The Research on the Algorithms of Keyword Search in Relational Database.",
                    "An Approach to Monitor Scenario-Based Temporal Properties in Web Service Compositions.",
                    "Efficient Authentication and Authorization Infrastructure for Mobile Users.",
                    "An Effective Feature Selection Method Using the Contribution Likelihood Ratio of Attributes for Classification.",
                    "Unsupervised Text Learning Based on Context Mixture Model with Dirichlet Prior.",
                    "The Knowledge Discovery Research on User's Mobility of Communication Service Provider.",
                    "Protecting Information Sharing in Distributed Collaborative Environment.",
                    "Relevance Feedback Learning for Web Image Retrieval Using Soft Support Vector Machine.",
                    "Feature Matrix Extraction and Classification of XML Pages.",
                    "Tuning the Cardinality of Skyline.",
                    "An HMM Approach to Anonymity Analysis of Continuous Mixes."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9th APWeb/WAIM 2007",
        "info": "Huang Shan (Yellow Mountain), China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2007",
                "sub_name": "Advances in Data and Web Management, Joint 9th Asia-Pacific Web Conference, APWeb 2007, and 8th International Conference, on Web-Age Information Management, WAIM 2007, Huang Shan, China, June 16-18, 2007, Proceedings.",
                "count": 91,
                "papers": [
                    "Data Mining Using Fractals and Power Laws.",
                    "Exploring the Power of Links in Data Mining.",
                    "Community Systems: The World Online.",
                    "A New DBMS Architecture for DB-IR Integration.",
                    "Study on Efficiency and Effectiveness of KSORD.",
                    "Discovering Web Services Based on Probabilistic Latent Factor Model.",
                    "SCORE: Symbiotic Context Oriented Information Retrieval.",
                    "Process Aware Information Systems: A Human Centered Perspective.",
                    "IMCS: Incremental Mining of Closed Sequential Patterns.",
                    "Mining Time-Shifting Co-regulation Patterns from Gene Expression Data.",
                    "Tight Correlated Item Sets and Their Efficient Discovery.",
                    "Improved Prediction of Protein Secondary Structures Using Adaptively Weighted Profiles.",
                    "Framework for Building a High-Quality Web Page Collection Considering Page Group Structure.",
                    "Multi-document Summarization Using Weighted Similarity Between Topic and Clustering-Based Non-negative Semantic Feature.",
                    "A Fair Load Balancing Algorithm for Hypercube-Based DHT Networks.",
                    "LINP: Supporting Similarity Search in Unstructured Peer-to-Peer Networks.",
                    "Generation and Matching of Ontology Data for the Semantic Web in a Peer-to-Peer Framework.",
                    "Energy-Efficient Skyline Queries over Sensor Network Using Mapped Skyline Filters.",
                    "An Adaptive Dynamic Cluster-Based Protocol for Target Tracking in Wireless Sensor Networks.",
                    "Distributed, Hierarchical Clustering and Summarization in Sensor Networks.",
                    "A New Similarity Measure for Near Duplicate Video Clip Detection.",
                    "Efficient Algorithms for Historical Continuous k NN Query Processing over Moving Object Trajectories.",
                    "Effective Density Queries for Moving Objects in Road Networks.",
                    "An Efficient Spatial Search Method Based on SG-Tree.",
                    "Getting Qualified Answers for Aggregate Queries in Spatio-temporal Databases.",
                    "Dynamic Adaptation Strategies for Long-Term and Short-Term User Profile to Personalize Search.",
                    "Using Structured Tokens to Identify Webpages for Data Extraction.",
                    "Honto? Search: Estimating Trustworthiness of Web Information by Search Results Aggregation and Temporal Analysis.",
                    "A Probabilistic Reasoning Approach for Discovering Web Crawler Sessions.",
                    "An Exhaustive and Edge-Removal Algorithm to Find Cores in Implicit Communities.",
                    "Active Rules Termination Analysis Through Conditional Formula Containing Updatable Variable.",
                    "Computing Repairs for Inconsistent XML Document Using Chase.",
                    "An XML Publish/Subscribe Algorithm Implemented by Relational Operators.",
                    "Retrieving Arbitrary XML Fragments from Structured Peer-to-Peer Networks.",
                    "Combining Smooth Graphs with Semi-supervised Learning.",
                    "Extracting Trend of Time Series Based on Improved Empirical Mode Decomposition Method.",
                    "Spectral Edit Distance Method for Image Clustering.",
                    "Mining Invisible Tasks from Event Logs.",
                    "The Selection of Tunable DBMS Resources Using the Incremental/Decremental Relationship.",
                    "Hyperclique Pattern Based Off-Topic Detection.",
                    "An Energy Efficient Connected Coverage Protocol in Wireless Sensor Networks.",
                    "A Clustered Routing Protocol with Distributed Intrusion Detection for Wireless Sensor Networks.",
                    "Continuous Approximate Window Queries in Wireless Sensor Networks.",
                    "A Survey of Job Scheduling in Grids.",
                    "Relational Nested Optional Join for Efficient Semantic Web Query Processing.",
                    "Efficient Processing of Relational Queries with Sum Constraints.",
                    "A Theoretical Framework of Natural Computing - M Good Lattice Points (GLP) Method.",
                    "Building Data Synopses Within a Known Maximum Error Bound.",
                    "Exploiting the Structure of Update Fragments for Efficient XML Index Maintenance.",
                    "Improvements of HITS Algorithms for Spam Links.",
                    "Efficient Keyword Search over Data-Centric XML Documents.",
                    "Promotional Ranking of Search Engine Results: Giving New Web Pages a Chance to Prove Their Values.",
                    "Adaptive Scheduling Strategy for Data Stream Management System.",
                    "A QoS-Guaranteeing Scheduling Algorithm for Continuous Queries over Streams.",
                    "A Simple But Effective Event-Driven Model for Data Stream Queries.",
                    "Efficient Difference NN Queries for Moving Objects.",
                    "APCAS: An Approximate Approach to Adaptively Segment Time Series Stream.",
                    "Continuous k-Nearest Neighbor Search Under Mobile Environment.",
                    "Record Extraction Based on User Feedback and Document Selection.",
                    "Density Analysis of Winnowing on Non-uniform Distributions.",
                    "Error-Based Collaborative Filtering Algorithm for Top-N Recommendation.",
                    "A PLSA-Based Approach for Building User Profile and Implementing Personalized Recommendation.",
                    "CoXML: A Cooperative XML Query Answering System.",
                    "Concept-Based Query Transformation Based on Semantic Centrality in Semantic Peer-to-Peer Environment.",
                    "Mining Infrequently-Accessed File Correlations in Distributed File System.",
                    "Learning-Based Trust Model for Optimization of Selecting Web Services.",
                    "SeCED-FS: A New Approach for the Classification and Discovery of Significant Regions in Medical Images.",
                    "Context-Aware Search Inside e-Learning Materials Using Textbook Ontologies.",
                    "Activate Interaction Relationships Between Students Acceptance Behavior and E-Learning.",
                    "Semantic-Based Grouping of Search Engine Results Using WordNet.",
                    "Static Verification of Access Control Model for AXML Documents.",
                    "SAM: An Efficient Algorithm for F&B-Index Construction.",
                    "BUXMiner: An Efficient Bottom-Up Approach to Mining XML Query Patterns.",
                    "A Web Service Architecture for Bidirectional XML Updating.",
                    "(alpha, k)-anonymity Based Privacy Preservation by Lossy Join.",
                    "Achieving k -Anonymity Via a Density-Based Clustering Method.",
                    "k -Anonymization Without Q-S Associations.",
                    "Protecting and Recovering Database Systems Continuously.",
                    "Towards Web Services Composition Based on the Mining and Reasoning of Their Causal Relationships.",
                    "A Dynamically Adjustable Rule Engine for Agile Business Computing Environments.",
                    "A Formal Design of Web Community Interactivity.",
                    "Towards a Type-2 Fuzzy Description Logic for Semantic Search Engine.",
                    "A Type-Based Analysis for Verifying Web Application.",
                    "Homomorphism Resolving of XPath Trees Based on Automata.",
                    "An Efficient Overlay Multicast Routing Algorithm for Real-Time Multimedia Applications.",
                    "Novel NonGaussianity Measure Based BSS Algorithm for Dependent Signals.",
                    "HiBO: Mining Web's Favorites.",
                    "Frequent Variable Sets Based Clustering for Artificial Neural Networks Particle Classification.",
                    "Attributes Reduction Based on GA-CFS Method.",
                    "Towards High Performance and High Availability Clusters of Archived Stream.",
                    "Continuously Matching Episode Rules for Predicting Future Events over Event Streams."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2007w",
                "sub_name": "Advances in Web and Network Technologies, and Information Management, APWeb/WAIM 2007 International Workshops: DBMAN 2007, WebETrends 2007, PAIS 2007 and ASWAN 2007, Huang Shan, China, June 16-18, 2007, Proceedings.",
                "count": 76,
                "papers": [
                    "Cost Framework for a Heterogeneous Distributed Semi-structured Environment.",
                    "Cost-Based Vertical Fragmentation for XML.",
                    "Efficiently Crawling Strategy for Focused Searching Engine.",
                    "QoS-Guaranteed Ring Replication Management with Strong Consistency.",
                    "A Mobile Database Sharing Protocol to Increase Data Availability in Mobile Environments.",
                    "Mining Recent Frequent Itemsets over Data Streams with a Time-Sensitive Sliding Window.",
                    "Mining Web Transaction Patterns in an Electronic Commerce Environment.",
                    "Mining Purpose-Based Authorization Strategies in Database System.",
                    "RSP-DS: Real Time Sequential Pattern Analysis over Data Streams.",
                    "Investigative Queries in Sensor Networks.",
                    "A Taxonomy-Based Approach for Constructing Semantics-Based Super-Peer Networks.",
                    "A Comparative Study of Replica Placement Strategies in Data Grids.",
                    "A Workload Balancing Based Approach to Discourage Free Riding in Peer-to-Peer Network.",
                    "QoS-Based Services Selecting and Optimizing Algorithms on Grid.",
                    "Bayesian Method Based Trusted Overlay for Information Retrieval over Networks.",
                    "Managing a Geographic Database from Mobile Devices Through OGC Web Services.",
                    "Real-Time Creation Method of Personalized Mobile Web Contents for Ubiquitous Contents Access.",
                    "The Golden Mean Operator Scheduling Strategy in Data Stream Systems.",
                    "Continuous Skyline Tracking on Update Data Streams.",
                    "A Hybrid Algorithm for Web Document Clustering Based on Frequent Term Sets and k-Means.",
                    "OMSI-Tree: Power-Awareness Query Processing over Sensor Networks by Removing Overlapping Regions.",
                    "On Studying Front-Peer Attack-Resistant Trust and Reputation Mechanisms Based on Enhanced Spreading Activation Model in P2P Environments.",
                    "A Load Balancing Method Using Ring Network in the Grid Database.",
                    "Design and Implementation of a System for Environmental Monitoring Sensor Network.",
                    "Policy Based Scheduling for Resource Allocation on Grid.",
                    "Characterizing DSS Workloads from the Processor Perspective.",
                    "Exploiting Connection Relation to Compress Data Graph.",
                    "Indexing the Current Positions of Moving Objects on Road Networks.",
                    "DBMSs with Native XML Support: Towards Faster, Richer, and Smarter Data Management.",
                    "A Personalized Re-ranking Algorithm Based on Relevance Feedback.",
                    "An Investigation and Conceptual Models of Podcast Marketing.",
                    "A User Study on the Adoption of Location Based Services.",
                    "Email Community Detection Using Artificial Ant Colony Clustering.",
                    "EviRank: An Evidence Based Content Trust Model for Web Spam Detection.",
                    "A Novel Factoid Ranking Model for Information Retrieval.",
                    "Dynamic Composition of Web Service Based on Coordination Model.",
                    "An Information Retrieval Method Based on Knowledge Reasoning.",
                    "Research on Personalized Recommendation Algorithm in E-Supermarket System.",
                    "XML Normal Forms Based on Constraint-Tree-Based Functional Dependencies.",
                    "Untyped XQuery Canonization.",
                    "Web Search Tailored Ontology Evaluation Framework.",
                    "An Overview of the Business Process Maturity Model (BPMM).",
                    "Process Mining: Extending alpha -Algorithm to Mine Duplicate Tasks in Process Logs.",
                    "A Distributed Genetic Algorithm for Optimizing the Quality of Grid Workflow.",
                    "Safety Analysis and Performance Evaluation of Time WF-nets.",
                    "Dual Workflow Nets: Mixed Control/Data-Flow Representation for Workflow Modeling and Verification.",
                    "Bridging Organizational Structure and Information System Architecture Through Process.",
                    "Relation-Driven Business Process-Oriented Service Discovery.",
                    "Workflow Message Queue's Performance Effect Measurements on an EJB-Based Workflow Management System.",
                    "RFID Application Model and Performance for Postal Logistics.",
                    "An Organization and Task Based Access Control Model for Workflow System.",
                    "A Method of Web Services Composition Based on Service Alliance.",
                    "Toward a Lightweight Process-Aware Middleware.",
                    "Automatic Generation of Web Service Workflow Using a Probability Based Process-Semantic Repository.",
                    "A Three-Dimensional Customer Classification Model Based on Knowledge Discovery and Empirical Study.",
                    "QoS-Driven Global Optimization of Services Selection Supporting Services Flow Re-planning.",
                    "SOA-Based Collaborative Modeling Method for Cross-Organizational Business Process Integration.",
                    "Model Checking for BPEL4WS with Time.",
                    "A Version Management of Business Process Models in BPMS.",
                    "Research on Architecture and Key Technology for Service-Oriented Workflow Performance Analysis.",
                    "The Study on Internet-Based Face Recognition System Using Principal Component Analysis.",
                    "Semantic Representation of RTBAC: Relationship-Based Access Control Model.",
                    "A Code-Based Multi-match Packet Classification with TCAM.",
                    "Home Network Device Authentication: Device Authentication Framework and Device Certificate Profile.",
                    "P-IDC: Information Security and Consideration in Building Internet Data Centers for Pervasive Environment.",
                    "Improvement of an Authenticated Key Agreement Protocol.",
                    "A Mechanism for Securing Digital Evidences in Pervasive Environments.",
                    "A Secure Chaotic Hash-Based Biometric Remote User Authentication Scheme Using Mobile Devices.",
                    "Adapting Web Services Security Standards for Mobile and Wireless Environments.",
                    "Coexistence Proof Using Chain of Timestamps for Multiple RFID Tags.",
                    "A Design of Authentication Protocol for Multi-key RFID Tag.",
                    "An Efficient Fragile Watermarking for Web Pages Tamper-Proof.",
                    "Classification of Key Management Schemes for Wireless Sensor Networks.",
                    "An Efficient Algorithm for Proportionally Fault-Tolerant Data Mining.",
                    "SOGA: Fine-Grained Authorization for Self-Organizing Grid.",
                    "Permission-Centric Hybrid Access Control."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8th APWeb 2006",
        "info": "Harbin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2006",
                "sub_name": "Frontiers of WWW Research and Development - APWeb 2006, 8th Asia-Pacific Web Conference, Harbin, China, January 16-18, 2006, Proceedings.",
                "count": 138,
                "papers": [
                    "Applications Development for the Computational Grid.",
                    "Strongly Connected Dominating Sets in Wireless Sensor Networks with Unidirectional Links.",
                    "Mobile Web and Location-Based Services.",
                    "The Case of the Duplicate Documents Measurement, Search, and Science.",
                    "An Effective System for Mining Web Log.",
                    "Adapting K-Means Algorithm for Discovering Clusters in Subspaces.",
                    "Sample Sizes for Query Probing in Uncooperative Distributed Information Retrieval.",
                    "The Probability of Success of Mobile Agents When Routing in Faulty Networks.",
                    "Clustering Web Documents Based on Knowledge Granularity.",
                    "XFlat: Query Friendly Encrypted XML View Publishing.",
                    "Distributed Energy Efficient Data Gathering with Intra-cluster Coverage in Wireless Sensor Networks.",
                    "QoS-Driven Web Service Composition with Inter Service Conflicts.",
                    "An Agent-Based Approach for Cooperative Data Management.",
                    "Transforming Heterogeneous Messages Automatically in Web Service Composition.",
                    "User-Perceived Web QoS Measurement and Evaluation System.",
                    "An RDF Storage and Query Framework with Flexible Inference Strategy.",
                    "An Aspect-Oriented Approach to Declarative Access Control for Web Applications.",
                    "A Statistical Study of Today's Gnutella.",
                    "Automatically Constructing Descriptive Site Maps.",
                    "TWStream: Finding Correlated Data Streams Under Time Warping.",
                    "Supplier Categorization with K-Means Type Subspace Clustering.",
                    "Classifying Web Data in Directory Structures.",
                    "Semantic Similarity Based Ontology Cache.",
                    "In-Network Join Processing for Sensor Networks.",
                    "Transform BPEL Workflow into Hierarchical CP-Nets to Make Tool Support for Verification.",
                    "Identifying Agitators as Important Blogger Based on Analyzing Blog Threads.",
                    "Detecting Collusion Attacks in Security Protocols.",
                    "Role-Based Delegation with Negative Authorization.",
                    "Approximate Top-k Structural Similarity Search over XML Documents.",
                    "Towards Enhancing Trust on Chinese E-Commerce.",
                    "Flexible Deployment Models for Location-Aware Key Management in Wireless Sensor Networks.",
                    "A Diachronic Analysis of Gender-Related Web Communities Using a HITS-Based Mining Tool.",
                    "W3 Trust-Profiling Framework (W3TF) to Assess Trust and Transitivity of Trust of Web-Based Services in a Heterogeneous Web Environment.",
                    "Image Description Mining and Hierarchical Clustering on Data Records Using HR-Tree.",
                    "Personalized News Categorization Through Scalable Text Classification.",
                    "The Adaptability of English Based Web Search Algorithms to Chinese Search Engines.",
                    "A Feedback Based Framework for Semi-automic Composition of Web Services.",
                    "Fast Approximate Matching Between XML Documents and Schemata.",
                    "Mining Query Log to Assist Ontology Learning from Relational Database.",
                    "An Area-Based Collaborative Sleeping Protocol for Wireless Sensor Networks.",
                    "F@: A Framework of Group Awareness in Synchronous Distributed Groupware.",
                    "Adaptive User Profile Model and Collaborative Filtering for Personalized News.",
                    "Context Matcher: Improved Web Search Using Query Term Context in Source Document and in Search Results.",
                    "Weighted Ontology-Based Search Exploiting Semantic Similarity.",
                    "Determinants of Groupware Usability for Community Care Collaboration.",
                    "Automated Discovering of What is Hindering the Learning Performance of a Student.",
                    "Sharing Protected Web Resources Using Distributed Role-Based Modeling.",
                    "Concept Map Model for Web Ontology Exploration.",
                    "A Resource-Adaptive Transcoding Proxy Caching Strategy.",
                    "Optimizing Collaborative Filtering by Interpolating the Individual and Group Behaviors.",
                    "Extracting Semantic Relationships Between Terms from PC Documents and Its Applications to Web Search Personalization.",
                    "Detecting Implicit Dependencies Between Tasks from Event Logs.",
                    "Implementing Privacy Negotiations in E-Commerce.",
                    "A Community-Based, Agent-Driven, P2P Overlay Architecture for Personalized Web.",
                    "Providing an Uncertainty Reasoning Service for Semantic Web Application.",
                    "Indexing XML Documents Using Self Adaptive Genetic Algorithms for Better Retreival.",
                    "GCC: A Knowledge Management Environment for Research Centers and Universities.",
                    "Towards More Personalized Web: Extraction and Integration of Dynamic Content from the Web.",
                    "Supporting Relative Workflows with Web Services.",
                    "Text Based Knowledge Discovery with Information Flow Analysis.",
                    "Study on QoS Driven Web Services Composition.",
                    "Optimizing the Data Intensive Mediator-Based Web Services Composition.",
                    "Role of Triple Space Computing in Semantic Web Services.",
                    "Modified ID-Based Threshold Decryption and Its Application to Mediated ID-Based Encryption.",
                    "Materialized View Maintenance in Peer Data Management Systems.",
                    "Cubic Analysis of Social Bookmarking for Personalized Recommendation.",
                    "MAGMS: Mobile Agent-Based Grid Monitoring System.",
                    "A Computational Trust Model for Semantic Web Based on Bayesian Decision Theory.",
                    "Efficient Dynamic Traffic Navigation with Hierarchical Aggregation Tree.",
                    "A Color Bar Based Affective Annotation Method for Media Player.",
                    "Robin: Extracting Visual and Textual Features from Web Pages.",
                    "Generalized Projected Clustering in High-Dimensional Data Streams.",
                    "An Effective Web Page Layout Adaptation for Various Resolutions.",
                    "XMine: A Methodology for Mining XML Structure.",
                    "Multiple Join Processing in Data Grid.",
                    "A Novel Architecture for Realizing Grid Workflow Using Pi-Calculus Technology.",
                    "A Chord-Based Novel Mobile Peer-to-Peer File Sharing Protocol.",
                    "Web-Based Genomic Information Integration with Gene Ontology.",
                    "Table Detection from Plain Text Using Machine Learning and Document Structure.",
                    "Efficient Mining Strategy for Frequent Serial Episodes in Temporal Database.",
                    "Efficient and Provably Secure Client-to-Client Password-Based Key Exchange Protocol.",
                    "Effective Criteria for Web Page Changes.",
                    "WordRank-Based Lexical Signatures for Finding Lost or Related Web Pages.",
                    "A Scalable Update Management Mechanism for Query Result Caching Systems at Database-Driven Web Sites.",
                    "Building Content Clusters Based on Modelling Page Pairs.",
                    "IRFCF: Iterative Rating Filling Collaborative Filtering Algorithm.",
                    "A Method to Select the Optimum Web Services.",
                    "A New Methodology for Information Presentations on the Web.",
                    "Integration of Single Sign-On and Role-Based Access Control Profiles for Grid Computing.",
                    "An Effective Service Discovery Model for Highly Reliable Web Services Composition in a Specific Domain.",
                    "Using Web Archive for Improving Search Engine Results.",
                    "Closed Queueing Network Model for Multi-tier Data Stream Processing Center.",
                    "Optimal Task Scheduling Algorithm for Non-preemptive Processing System.",
                    "A Multi-agent Based Grid Service Discovery Framework Using Fuzzy Petri Net and Ontology.",
                    "Modeling Identity Management Architecture Within a Social Setting.",
                    "Ontological Engineering in Data Warehousing.",
                    "Mapping Ontology Relations: An Approach Based on Best Approximations.",
                    "Building a Semantic P2P Scientific References Sharing System with JXTA.",
                    "Named Graphs as a Mechanism for Reasoning About Provenance.",
                    "Discovery of Spatiotemporal Patterns in Mobile Environment.",
                    "Visual Description Conversion for Enhancing Search Engines and Navigational Systems.",
                    "Reusing Experiences for an Effective Learning in a Web-Based Context.",
                    "Collaboration Between China and Australia: An e-Water Workshop Report.",
                    "On Sensor Network Segmentation for Urban Water Distribution Monitoring.",
                    "Using the Shuffled Complex Evolution Global Optimization Method to Solve Groundwater Management Models.",
                    "Integrating Hydrological Data of Yellow River for Efficient Information Services.",
                    "Application and Integration of Information Technology in Water Resources Informatization.",
                    "An Empirical Study on Groupware Support for Water Resources Ontology Integration.",
                    "Ontology Mapping Approach Based on OCL.",
                    "Object Storage System for Mass Geographic Information.",
                    "The Service-Oriented Data Integration Platform for Water Resources Management.",
                    "Construction of Yellow River Digital Project Management System.",
                    "Study on the Construction and Application of 3D Visualization Platform for the Yellow River Basin.",
                    "A Light-Weighted Approach to Workflow View Implementation.",
                    "RSS Feed Generation from Legacy HTML Pages.",
                    "Ontology Driven Securities Data Management and Analysis.",
                    "Context Gallery: A Service-Oriented Framework to Facilitate Context Information Sharing.",
                    "A Service-Oriented Architecture Based Macroeconomic Analysis & Forecasting System.",
                    "A Web-Based Method for Building Company Name Knowledge Base.",
                    "Healthy Waterways: Healthy Catchments - An Integrated Research/Management Program to Understand and Reduce Impacts of Sediments and Nutrients on Waterways in Queensland, Australia.",
                    "Groundwater Monitoring in China.",
                    "The Digital Yellow River Programme.",
                    "Web Services Based State of the Environment Reporting.",
                    "COEDIG: Collaborative Editor in Grid Computing.",
                    "HVEM Grid: Experiences in Constructing an Electron Microscopy Grid.",
                    "WISE: A Prototype for Ontology Driven Development of Web Information Systems.",
                    "DSEC: A Data Stream Engine Based Clinical Information System.",
                    "SESQ: A Novel System for Building Domain Specific Web Search Engines.",
                    "Digital Map: Animated Mode.",
                    "Dynamic Voice User Interface Using VoiceXML and Active Server Pages.",
                    "WebVine Suite: A Web Services Based BPMS.",
                    "Adaptive Mobile Cooperation Model Based on Context Awareness.",
                    "An Integrated Network Management System.",
                    "Ichigen-San: An Ontology-Based Information Retrieval System.",
                    "A Database Monitoring and Disaster Recovery System.",
                    "IPVita: An Intelligent Platform of Virtual Travel Agency.",
                    "LocalRank: A Prototype for Ranking Web Pages with Database Considering Geographical Locality.",
                    "Automated Content Transformation with Adjustment for Visual Presentation Related to Terminal Types."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2006w",
                "sub_name": "Advanced Web and Network Technologies, and Applications, APWeb 2006 International Workshops: XRA, IWSN, MEGA, and ICSE, Harbin, China, January 16-18, 2006, Proceedings.",
                "count": 146,
                "papers": [
                    "Clustered Absolute Path Index for XML Document: On Efficient Processing of Twig Queries.",
                    "Positioning-Based Query Translation Between SQL and XQL with Location Counter.",
                    "Integrating XML Schema Language with Databases for B2B Collaborations.",
                    "Functional Dependencies in XML Documents.",
                    "Querying Composite Events for Reactivity on the Web.",
                    "Efficient Evaluation of XML Twig Queries.",
                    "Early Evaluating XML Trees in Object Repositories .",
                    "Caching Frequent XML Query Patterns.",
                    "Efficient Evaluation of Distance Predicates in XPath Full-Text Query.",
                    "A Web Classification Framework Based on XSLT.",
                    "Logic-Based Association Rule Mining in XML Documents.",
                    "XML Document Retrieval System Based on Document Structure and Image Content for Digital Museum.",
                    "Meta Modeling Approach for XML Based Data Integration.",
                    "XML and Knowledge Based Process Model Reuse and Management in Business Intelligence System.",
                    "Labeling XML Nodes in RDBMS.",
                    "Feature Extraction and XML Representation of Plant Leaf for Image Retrieval.",
                    "A XML-Based Workflow Event Logging Mechanism for Workflow Mining.",
                    "XML Clustering Based on Common Neighbor.",
                    "Modeling Dynamic Properties in the Layered View Model for XML Using XSemantic Nets.",
                    "VeriFLog: A Constraint Logic Programming Approach to Verification of Website Content.",
                    "Bandwidth Guaranteed Multi-tree Multicast Routing in Wireless Ad Hoc Networks.",
                    "Finding Event Occurrence Regions in Wireless Sensor Networks.",
                    "Energy Efficient Protocols for Information Dissemination in Wireless Sensor Networks.",
                    "Hierarchical Hypercube-Based Pairwise Key Establishment Schemes for Sensor Networks.",
                    "Key Establishment Between Heterogenous Nodes in Wireless Sensor and Actor Networks.",
                    "A Self-management Framework for Wireless Sensor Networks.",
                    "Behavior-Based Trust in Wireless Sensor Network.",
                    "Compromised Nodes in Wireless Sensor Network.",
                    "Reservation CSMA/CA for QoS Support in Mobile Ad-Hoc Networks.",
                    "On Studying Partial Coverage and Spatial Clustering Based on Jensen-Shannon Divergence in Sensor Networks.",
                    "Quasi-Bottleneck Nodes: A Potential Threat to the Lifetime of Wireless Sensor Networks.",
                    "Adaptive Data Transmission Algorithm for Event-Based Ad Hoc Query.",
                    "Determination of Aggregation Point Using Fermat's Point in Wireless Sensor Networks.",
                    "Inductive Charging with Multiple Charger Nodes in Wireless Sensor Networks.",
                    "SIR: A New Wireless Sensor Network Routing Protocol Based on Artificial Intelligence.",
                    "A Limited Flooding Scheme for Query Delivery in Wireless Sensor Networks.",
                    "Sampling Frequency Optimization in Wireless Sensor Network-Based Control System.",
                    "MIMO Techniques in Cluster-Based Wireless Sensor Networks.",
                    "An Energy Efficient Network Topology Configuration Scheme for Sensor Networks.",
                    "Robust Multipath Routing to Exploit Maximally Disjoint Paths for Wireless Ad Hoc Networks.",
                    "Energy Efficient Design for Window Query Processing in Sensor Networks.",
                    "A Novel Localization Scheme Based on RSS Data for Wireless Sensor Networks.",
                    "Threshold Authenticated Key Configuration Scheme Based on Multi-layer Clustering in Mobile Ad Hoc.",
                    "Connecting Sensor Networks with TCP/IP Network.",
                    "Key Establishment and Authentication Mechanism for Secure Sensor Networks.",
                    "Energy-Aware Routing Analysis in Wireless Sensors Network.",
                    "A Density-Based Self-configuration Scheme in Wireless Sensor Networks.",
                    "IPv6 Stateless Address Auto-configuration in Mobile Ad-Hoc Network.",
                    "Fast Collision Resolution MAC with Coordinated Sleeping for WSNs.",
                    "Energy-Efficient Deployment of Mobile Sensor Networks by PSO.",
                    "Object Finding System Based on RFID Technology.",
                    "Low Energy Consumption Security Method for Protecting Information of Wireless Sensor Network.",
                    "Process Scheduling Policy Based on Rechargeable Power Resource in Wireless Sensor Networks.",
                    "An Energy Efficient Cross-Layer MAC Protocol for Wireless Sensor Networks.",
                    "Power-Efficient Node Localization Algorithm in Wireless Sensor Networks.",
                    "A Residual Energy-Based MAC Protocol for Wireless Sensor Networks.",
                    "Processing Probabilistic Range Query over Imprecise Data Based on Quality of Result.",
                    "Dynamic Node Scheduling for Elimination Overlapping Sensing in Sensor Networks with Dense Distribution.",
                    "Grid-Enabled Medical Image Processing Application System Based on OGSA-DAI Techniques.",
                    "A QOS Evaluating Model for Computational Grid Nodes.",
                    "An Enterprize Workflow Grid/P2P Architecture for Massively Parallel and Very Large Scale Workflow Systems.",
                    "Grid-Enabled Metropolis Shared Research Platform.",
                    "Toolkits for Ontology Building and Semantic Annotation in UDMGrid.",
                    "DPGS: A Distributed Programmable Grid System.",
                    "Spatial Reasoning Based Spatial Data Mining for Precision Agriculture.",
                    "Distributed Group Membership Algorithm in Intrusion-Tolerant System.",
                    "Radio Frequency Identification (RFID) Based Reliable Applications for Enterprise Grid.",
                    "Predictive Grid Process Scheduling Model in Computational Grid.",
                    "A Dependable Task Scheduling Strategy for a Fault Tolerant Grid Model.",
                    "Multi-agent Web Text Mining on the Grid for Enterprise Decision Support.",
                    "Semantic Peer-to-Peer Overlay for Efficient Content Locating.",
                    "xDFT: An Extensible Dynamic Fault Tolerance Model for Cooperative System.",
                    "A Grid-Based Programming Environment for Remotely Sensed Data Processing.",
                    "Multicast for Multimedia Delivery in Wireless Network.",
                    "Model and Simulation on Enhanced Grid Security and Privacy System.",
                    "Performance Modeling and Analysis for Centralized Resource Scheduling in Metropolitan-Area Grids.",
                    "AGrIP: An Agent Grid Intelligent Platform for Distributed System Integration.",
                    "Scalable Backbone for Wireless Metropolitan Grid.",
                    "Research on Innovative Web Information System Based on Grid Environment.",
                    "A Framework and Survey of Knowledge Discovery Services on the OGSA-DAI.",
                    "A New Heartbeat Mechanism for Large-Scale Cluster.",
                    "Parallel Implementing of Road Situation Modeling with Floating GPS Data.",
                    "Research on a Generalized Die CAD System Architecture Based on SOA and Web Service.",
                    "Towards Building Intelligent Transportation Information Service System on Grid.",
                    "Design and Implementation of a Service-Oriented Manufacturing Grid System.",
                    "The Research of a Semantic Architecture in Meteorology Grid Computing.",
                    "The Design Method of a Video Delivery Grid.",
                    "A Secure Password-Authenticated Key Exchange Between Clients with Different Passwords.",
                    "A Fault-Tolerant Web Services Architecture.",
                    "A Grid-Based System for the Multi-reservoir Optimal Scheduling in Huaihe River Basin.",
                    "A Logic Foundation of Web Component.",
                    "A Public Grid Computing Framework Based on a Hierarchical Combination of Middleware.",
                    "A Workflow-Oriented Scripting Language Based on BPEL4WS.",
                    "Comments on Order-Based Deadlock Prevention Protocol with Parallel Requests in \"A Deadlock and Livelock Free Protocol for Decentralized Internet Resource Co-allocation\".",
                    "Dynamic Workshop Scheduling and Control Based on a Rule-Restrained Colored Petri Net and System Development Adopting Extended B/S/D Mode.",
                    "A Dynamic Web Service Composite Platform Based on QoS of Services.",
                    "Modeling Fetch-at-Most-Once Behavior in Peer-to-Peer File-Sharing Systems.",
                    "Application of a Modified Fuzzy ART Network to User Classification for Internet Content Provider.",
                    "IRIOS: Interactive News Announcer Robot System.",
                    "WIPI Mobile Platform with Secure Service for Mobile RFID Network Environment.",
                    "Tourism Guided Information System for Location-Based Services.",
                    "A New Bio-inspired Model for Network Security and Its Application.",
                    "Partner Selection System Development for an Agile Virtual Enterprise Based on Gray Relation Analysis.",
                    "RealTime-BestPoint-Based Compiler Optimization Algorithm.",
                    "A Framework of XML-Based Geospatial Metadata System.",
                    "Deployment of Web Services for Enterprise Application Integration (EAI) System.",
                    "A Distributed Information System for Healthcare Web Services.",
                    "The Research of Scientific Computing Environment on Scilab.",
                    "A Model of XML Access Control with Dual-Level Security Views.",
                    "A Web-Based System for Adaptive Data Transfer in Grid.",
                    "Optimal Search Strategy for Web-Based 3D Model Retrieval.",
                    "ParaView-Based Collaborative Visualization for the Grid.",
                    "ServiceBSP Model with QoS Considerations in Grids.",
                    "An Efficient SVM-Based Method to Detect Malicious Attacks for Web Servers.",
                    "Design and Implementation of a Workflow-Based Message-Oriented Middleware.",
                    "Consistency of User Interface Based on Petri-Net.",
                    "Research of Multilevel Transaction Schedule Algorithm Based on Transaction Segments.",
                    "Web Navigation Patterns Mining Based on Clustering of Paths and Pages Content.",
                    "Using Abstract State Machine in Architecture Design of Distributed Software Component Repository.",
                    "An Information Audit System Based on Bayes Algorithm.",
                    "Distortion Analysis of Component Composition and Web Service Composition.",
                    "A Semantic Web Approach to \"Request for Quote\" in E-Commerce.",
                    "An Effective XML Filtering Method for High-Performance Publish/Subscribe System.",
                    "A New Method for the Design of Stateless Transitive Signature Schemes.",
                    "A Web Service Composition Modeling and Evaluation Method Used Petri Net.",
                    "Multi-agent Negotiation Model for Resource Allocation in Grid Environment.",
                    "Discovery of Web Services Applied to Scientific Computations Based on QOS.",
                    "Common Program Analysis of Two-Party Security Protocols Using SMV.",
                    "An Integrated Web-Based Model for Management, Analysis and Retrieval of EST Biological Information.",
                    "A Category on the Cache Invalidation for Wireless Mobile Environments.",
                    "ESD: The Enterprise Semantic Desktop.",
                    "System Architecture of a Body Area Network and Its Web Service Based Data Publishing.",
                    "A Feature-Based Semantics Model of Reusable Component.",
                    "Mobile Agents for Network Intrusion Resistance.",
                    "Grid Service Based Parallel Debugging Environment.",
                    "Web-Based Three-Dimension E-Mail Traffic Visualization.",
                    "Component Composition Based on Web Service and Software Architecture.",
                    "Evaluation of Network Dependability Using Event Injection.",
                    "A New Automatic Intrusion Response Taxonomy and Its Application.",
                    "Hierarchical Web Structuring from the Web as a Graph Approach with Repetitive Cycle Proof.",
                    "The Vehicle Tracking System for Analyzing Transportation Vehicle Information.",
                    "Web-Based Cooperative Design for SoC and Improved Architecture Exploration Algorithm.",
                    "Research on Web Application of Struts Framework Based on MVC Pattern.",
                    "Grid-Based Multi-scale PCA Method for Face Recognition in the Large Face Database.",
                    "Grid-Based Parallel Elastic Graph Matching Face Recognition Method.",
                    "Web Service-Based Study on BPM Integrated Application for Aero-Manufacturing."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th APWeb 2005",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2005",
                "sub_name": "Web Technologies Research and Development - APWeb 2005, 7th Asia-Pacific Web Conference, Shanghai, China, March 29 - April 1, 2005, Proceedings.",
                "count": 110,
                "papers": [
                    "Databases and the Semantic Web: Data Semantics Revisited.",
                    "DSL Weaving for Distributed Information Flow Systems.",
                    "Broadening Vector Space Schemes for Improving the Quality of Information Retrieval.",
                    "A Neural Network Approach to Web Graph Processing.",
                    "Languages for the Net: From Presentation to Collaboration.",
                    "Some Issues for Fundamental Research on Information Sciences in China.",
                    "An Incremental Subspace Learning Algorithm to Categorize Large Scale Text Data.",
                    "Classifying Criminal Charges in Chinese for Web-Based Legal Services.",
                    "A Unified Probabilistic Framework for Clustering Correlated Heterogeneous Web Objects.",
                    "CLINCH: Clustering Incomplete High-Dimensional Data for Data Mining Application.",
                    "Topic Discovery from Document Using Ant-Based Clustering Combination.",
                    "A Pattern-Based Voting Approach for Concept Discovery on the Web.",
                    "A Similarity Reinforcement Algorithm for Heterogeneous Web Pages.",
                    "Constraint-Based Graph Mining in Large Database.",
                    "Estimating the Number of Substring Matches in Long String Databases.",
                    "An Efficient Topic-Specific Web Text Filtering Framework.",
                    "An Extension of UML Activity Diagram for Generation of XPDL Document.",
                    "Block-Based Language Modeling Approach Towards Web Search.",
                    "Level-Based Link Analysis.",
                    "A Formal Approach to Evaluate and Compare Internet Search Engines: A Case Study on Searching the Chinese Web.",
                    "IglooG: A Distributed Web Crawler Based on Grid Service.",
                    "An Updates Dissemination Protocol for Read-Only Transaction Processing in Mobile Real-Time Computing Environments.",
                    "Scalable and Fault Tolerant Multiple Tuple Space Architecture for Mobile Agent Communication.",
                    "LinkNet: A New Approach for Searching in a Large Peer-to-Peer System.",
                    "P2P-Based Web Text Information Retrieval.",
                    "LMIX: A Dynamic XML Index Method Using Line Model.",
                    "A New Sequential Mining Approach to XML Document Clustering*.",
                    "Labeling Scheme and Structural Joins for Graph-Structured XML Data.",
                    "Constructing Extensible XQuery Mappings for XML Data Sharing.",
                    "Towards Secure XML Document with Usage Control.",
                    "A Comparative Study of Functional Dependencies for XML.",
                    "Checking Multivalued Dependencies in XML.",
                    "Making DTD a Truly Powerful Schema Language.",
                    "An Algebra for Capability Object Interoperability of Heterogeneous Data Integration Systems.",
                    "DartGrid: RDF-Mediated Database Integration and Process Coordination Using Grid as the Platform.",
                    "Collaborative Web Application for Flood Control System of Reservoirs.",
                    "IWWS: A Reliability-Based WWW Collaborative Recommender System.",
                    "Transforming Non-covering Dimensions in OLAP.",
                    "Mining Frequent Trees Based on Topology Projection.",
                    "Mining Quantitative Associations in Large Database.",
                    "A Fast Algorithm for Mining Share-Frequent Itemsets.",
                    "Core: A Search and Browsing Tool for Semantic Instances of Web Sites.",
                    "An LOD Model for Graph Visualization and Its Application in Web Navigation.",
                    "Automatic Runtime Validation and Correction of the Navigational Design of Web Sites.",
                    "Summarizing Spatial Relations - A Hybrid Histogram.",
                    "Providing Geographic-Multidimensional Decision Support over the Web.",
                    "Spatial Selectivity Estimation Using Compressed Histogram Information.",
                    "Representation and Manipulation of Geospatial Objects with Indeterminate Extents.",
                    "A Pattern Restore Method for Restoring Missing Patterns in Server Side Clickstream Data.",
                    "Tree Structure Based Data Gathering for Maximum Lifetime in Wireless Sensor Networks.",
                    "Processing Frequent Items over Distributed Data Streams.",
                    "Distinct Estimate of Set Expressions over Sliding Windows.",
                    "An Extended Planning Mechanism to Increase Web Service Utilization.",
                    "Web Services Based Cross-Organizational Business Process Management.",
                    "Conversations for Web Services Composition.",
                    "A Framework of Web Service Composition for Distributed XML Query Evaluation.",
                    "An Agent-Based Compositional Framework.",
                    "Integrating Web Services into Ontology-Based Web Portal.",
                    "Knowledge-Level Management of Web Information.",
                    "Ontology Construction for Semantic Web: A Role-Based Collaborative Development Method.",
                    "Ontology-Based Matchmaking in e-Marketplace with Web Services.",
                    "An Empirical Study on the Change of Web Pages.",
                    "Using XML in Version Management of Chemical Process Models.",
                    "An Algorithm for Enumerating SCCs in Web Graph.",
                    "China Web Graph Measurements and Evolution.",
                    "PODWIS: A Personalized Tool for Ontology Development in Domain Specific Web Information System.",
                    "A Structured Approach to Personalize Websites Using the OO-H Personalization Framework.",
                    "Using Probabilistic Latent Semantic Analysis for Personalized Web Search.",
                    "Resource Management and Scheduling for High Performance Computing Application Based on WSRF.",
                    "Multiresolution Query Optimization in an Online Environment.",
                    "A Comparison of Advance Resource Reservation Bidding Strategies in Sequential Ascending Auctions.",
                    "An Efficient Web Page Allocation on a Server Using Adaptive Neural Networks.",
                    "An Implementation of the Client-Based Distributed Web Caching System.",
                    "Anycast-Based Cooperative Proxy Caching.",
                    "Semantic Caching for Web-Based Spatial Applications.",
                    "Neural Network Hot Spot Prediction Algorithm for Shared Web Caching System.",
                    "A Common Application-Centric QoS Model for Selecting Optimal Grid Services.",
                    "Temporal Dependency for Dynamic Verification of Fixed-Date Constraints in Grid Workflow Systems.",
                    "A New Method for Online Scheduling in Computational Grid Environments.",
                    "Influence of Performance Prediction Inaccuracy on Task Scheduling in Grid Environment.",
                    "Grid Accounting Information Gathering System with Access Control.",
                    "Neural Network Modeling of Transmission Rate Control Factor for Multimedia Transmission Using the Internet.",
                    "A Peer to Peer Proxy Patching Scheme for VOD Servers.",
                    "An Indexing Method for Two-D Pattern Matching with Applications to Digital Image Searches.",
                    "Indexing Text and Visual Features for WWW Images.",
                    "Chinese Named Entity Recognition with a Hybrid-Statistical Model.",
                    "Towards a Formal Framework for Distributed Identity Management.",
                    "Address Extraction: Extraction of Location-Based Information from the Web.",
                    "PlusDBG: Web Community Extraction Scheme Improving Both Precision and Pseudo-Recall.",
                    "Fuzzy Inference System with Probability Factor and Its Application in Data Mining.",
                    "Interactive Semantic-Based Visualization Environment for Traditional Chinese Medicine Information.",
                    "Components for Building Desktop-Application-Like Interface in Web Applications.",
                    "Supervised Semi-definite Embedding for Email Data Cleaning and Visualization.",
                    "Visual Mining for Customer Targeting.",
                    "On Designing a Novel PI Controller for AQM Routers Supporting TCP Flows.",
                    "Call Admission Control with Multiple Priorities Erlang B System.",
                    "ACDN: Active Content Distribution Network.",
                    "A Real-Time Multimedia Data Transmission Rate Control Using a Neural Network Prediction Algorithm.",
                    "Stratus: A Distributed Web Service Discovery Infrastructure Based on Double-Overlay Network.",
                    "ShanghaiGrid: A Grid Prototype for Metropolis Information Services.",
                    "Sentential Association Based Text Classification Systems.",
                    "Q-GSM: QoS Oriented Grid Service Management.",
                    "Skyhawk Grid System.",
                    "Cooperative Ontology Development Environment CODE and a Demo Semantic Web on Economics.",
                    "Dart Database Grid: A Dynamic, Adaptive, RDF-Mediated, Transparent Approach to Database Integration for Semantic Web.",
                    "Voice User Interface Design for a Telephone Application Using VoiceXML.",
                    "Content Browsing by Walking in Real and Cyber Spaces.",
                    "A Personal Web Bulletin Board with Autonomic Behaviors and Virtual Portal Function.",
                    "ImageAspect Finder/Difference-Amplifier: Focusing on Peripheral Information for Image Search and Browsing.",
                    "Tools for Media Conversion and Fusion of TV and Web Contents."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th APWeb 2004",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2004",
                "sub_name": "Advanced Web Technologies and Applications, 6th Asia-Pacific Web Conference, APWeb 2004, Hangzhou, China, April 14-17, 2004, Proceedings.",
                "count": 108,
                "papers": [
                    "Monitoring Continual Range Queries.",
                    "The Next Generation Messaging Technology ? Makes Web Services Effective.",
                    "Web Searching and S 2 Queries.",
                    "Secure Information Caching on the Web.",
                    "Multiresolution Spatial Databases: Making Web-Based Spatial Applications Faster.",
                    "A Query-Dependent Duplicate Detection Approach for Large Scale Search Engines.",
                    "A Semantic Approach for Web Indexing.",
                    "Semantic, Hierarchical, Online Clustering of Web Search Results.",
                    "SIMON: A Multi-strategy Classification Approach Resolving Ontology Heterogeneity on the Semantic Web.",
                    "Support Vector Machines Learning for Web-Based Adaptive and Active Information Retrieval.",
                    "Constructing User Profiles for Collaborative Recommender System.",
                    "Unloading Unwanted Information: From Physical Websites to Personalized Web Views.",
                    "iSurfer: A Focused Web Crawler Based on Incremental Learning from Positive Samples.",
                    "Identifying Parallel Web Documents by Filenames.",
                    "Reflective Web Interface Agent.",
                    "A Finite State Mobile Agent Computation Model.",
                    "Improving XML Query Performance Using Social Classes.",
                    "Answering XML Twig Queries with Automata.",
                    "Labeling and Querying Dynamic XML Trees.",
                    "Scalable XSLT Evaluation.",
                    "Algebraic Transformation and Optimization for XQuery.",
                    "Efficient Incremental Pattern Mining from Semi-structured Dataset.",
                    "Efficient Query Routing for XML Documents Retrieval in Unstructured Peer-to-Peer Networks.",
                    "Generalized Inclusion Dependencies in XML.",
                    "Graphical Representation of XML Schema.",
                    "MTrie: A Scalable Filtering Engine of Well-Structured XML Message Stream.",
                    "Issues in Cache-Answerability for XML Queries on the Web(.",
                    "Towards Adaptive Probabilistic Search in Unstructured P2P Systems.",
                    "Cell Abstract Indices for Content-Based Approximate Query Processing in Structured Peer-to-Peer Data Systems.",
                    "A Distributed Ranking Strategy in Peer-to-Peer Based Information Retrieval Systems.",
                    "PeerSDI: A Peer-to-Peer Information Dissemination System.",
                    "PWSD: A Scalable Web Service Discovery Architecture Based on Peer-to-Peer Overlay Network.",
                    "Efficient Community Management and Optimization Strategies of Web Services in Peer-to-Peer Environments.",
                    "Towards Load Balancing in Peer-to-Peer Environment of Web Services.",
                    "Research on Service Model of Content Delivery Grid.",
                    "Performance-Driven Task and Data Co-scheduling Algorithms for Data-Intensive Applications in Grid Computing.",
                    "On Analysis and Comparison Performance of TCP in Wireless Network.",
                    "Web Based Question Answering with Aggregation Strategy.",
                    "Web Query Refinement without Information Loss.",
                    "An Efficient Multidimensional Data Model for Web Usage Mining.",
                    "ANNE: An Efficient Framework on View Selection Problem.",
                    "Using Relational Database Constraints to Design Materialized Views in Data Warehouses.",
                    "Collaborative Filtering Algorithm Based on Mutual Information.",
                    "Clustering Data Streams On the Two-Tier Structure.",
                    "An Incremental Updating Method for Support Vector Machines.",
                    "Spatio-Temporal Reasoning Based Spatio-Temporal Information Management Middleware.",
                    "Inter-relevant Successive Trees Model and Its Implementation.",
                    "Predicting Typical User Preferences Using Entropy in Content based Collaborative filtering System.",
                    "UPnP Home Networking-Based IEEE1394 Digital Home Appliances Control.",
                    "A Simple Client-Based Hybrid Robust Hash Routing Web Caching System (2HRCS).",
                    "KGTutor: A Knowledge Grid Based Intelligent Tutoring System.",
                    "An Incremental Updating Technique for Discovering Frequent Traversal Patterns.",
                    "A Knowledge-Based Data Model and Query Algebra for the Next-Generation Web.",
                    "Conditional Evidence Theory and Its Application in Knowledge Discovery.",
                    "An Efficient Method for Quantitative Association Rules to Raise Reliance of Data.",
                    "Web Usage Mining: Sequential Pattern Extraction with a Very Low Support.",
                    "CS-Mine: An Efficient WAP-Tree Mining for Web Access Patterns.",
                    "Efficient Frequent Pattern Mining on Web Logs.",
                    "Mining the Predisposing Factor and Co-incident Factor among Numerical Dynamic Attributes in Time Series Data Set.",
                    "Query Modification by Discovering Topics from Web Page Structures.",
                    "Similarity Pattern Discovery Using Calendar Concept Hierarchy in Time Series Data.",
                    "Loss Minimization Based Keyword Distillation.",
                    "Using Maximum Entropy Model for Chinese Text Categorization.",
                    "A Comparative Study on Feature Weight in Text Categorization.",
                    "User-Focus Based Personalization Recommendation for Text Information Retrieval.",
                    "Topic-Structure Based Complementary Information Retrieval for Information Augmentation.",
                    "Similarity Retrieval of Web Documents Considering Both Text and Style.",
                    "Knowledge Retrieval Using Bayesian Associative Relation in the Three Dimensional Modular System.",
                    "User-Oriented Adaptive Web Information Retrieval Based on Implicit Observations.",
                    "High Availability with Clusters of Web Services.",
                    "Critical Points for Interactive Schema Matching.",
                    "Algorithm for Web Services Matching.",
                    "A Grid Middleware for Aggregating Scientific Computing Libraries and Parallel Programming Environments.",
                    "Safe Web Queries.",
                    "Specifying Role-Based Access Constraints with Object Constraint Language.",
                    "Engineering Safe and Efficient Shareability within Web Systems.",
                    "A Comparative Study of Web Application Design Models Using the Java Technologies.",
                    "On Reducing Dynamic Web Page Construction Times.",
                    "WIEAS: Helping to Discover Web Information Sources and Extract Data from Them.",
                    "Aspect Discovery: Web Contents Characterization by Their Referential Contexts.",
                    "Web Page Fragmentation and Content Manipulation for Constructing Personalized Portals.",
                    "Template-Based Runtime Invalidation for Database-Generated Web Contents.",
                    "Clipart Image Retrieval System Using Shape Information.",
                    "Coordinated En-Route Web Caching in Transcoding Proxies.",
                    "Indexing for Efficient Managing Current and Past Trajectory of Moving Object.",
                    "A Specification of a Moving Objects Query Language over GML for Location-Based Services.",
                    "Effective Visualisation of Workflow Enactment.",
                    "Verification of Temporal Constraints for Concurrent Workflows.",
                    "Research on Partner-Choosing and Web Services Composition for B2B E-commerce in Virtual Enterprises.",
                    "A Verification Model for Electronic Transaction Protocols.",
                    "An Ontology-Oriented Approach for Virtual Enterprises.",
                    "Customer Behavior Pattern Discovering with Web Mining.",
                    "DM-XIDS - An Application-Layer Router of Incoming XML Streams.",
                    "Developing a Main Memory Moving Objects DBMS for High-Performance Location-Based Services.",
                    "A Detection Model of Direction Relations for Spatial and Spatiotemporal Objects.",
                    "A Proactive Web Agent for Information Browsing and Extracting.",
                    "Effective Indexing of Web Images with Keyword Positioning.",
                    "Design and Simulation of Multicast Routing Protocol for Mobile Internet.",
                    "Java-Based Single Sign-On Library Supporting SAML (Security Assertion Markup Language) for Distributed Web Services.",
                    "Novel SVM Performance Estimators for Information Retrieval Systems.",
                    "Capturing Semantic Hierarchies to Perform Meaningful Integration in HTML Tables.",
                    "Viewing the Web as a Cube: The Vision and Approach.",
                    "Fuzzy K-Means Clustering on a High Dimensional Semantic Space.",
                    "N-SHOQ(D): A Nonmonotonic Extension of Description Logic SHOQ(D).",
                    "A Highly Adaptable Web Information Extractor Using Graph Data Model.",
                    "Mining Web Sequential Patterns Using Reinforcement Learning.",
                    "Early Experience in QoS-Based Service Grid Architecture.",
                    "A Multi-tier Structured Tool for Requirements Engineering Process Development."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5th APWeb 2003",
        "info": "Xian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2003",
                "sub_name": "Web Technologies and Applications, 5th Asian-Pacific Web Conference, APWeb 2003, Xian, China, April 23-25, 2002, Proceedings.",
                "count": 59,
                "papers": [
                    "Trends in Mobile Multimedia and Networks.",
                    "DB-Enabled Peers for Managing Distributed Data.",
                    "Functional Dependencies for XML.",
                    "On Transformation to Redundancy Free XML Schema from Relational Database Schema.",
                    "Constraint Preserving XML Updating.",
                    "ENAXS: Efficient Native XML Storage System.",
                    "A Fast Index for XML Document Version Management.",
                    "A Commit Scheduler for XML Databases.",
                    "An Efficient Path Index for Querying Semi-structured Data.",
                    "Integrating Path Index with Value Index for XML Data.",
                    "Automatic Layout Generation with XML Wrapping.",
                    "Efficient Evaluation in XML to XML Transformations.",
                    "Formalizing Semantics of XSLT Using Object-Z.",
                    "An XML-Based Context-Aware Transformation Framework for Mobile Execution Environments.",
                    "FIXT: A Flexible Index for XML Transformation.",
                    "Formal Foundation of Web Navigation Stereotypes and Their Transformation into XML.",
                    "Mining \"Hidden Phrase\" Definitions from the Web.",
                    "Extending a Web Browser with Client-Side Mining.",
                    "Real-Time Segmenting Time Series Data.",
                    "An Efficient Data Mining Algorithm for Discovering Web Access Patterns.",
                    "Applying Data Mining Techniques to Analyze Alert Data.",
                    "Web Page Clustering: A Hyperlink-Based Similarity and Matrix-Based Hierarchical Algorithms.",
                    "A Framework for Decentralized Ranking in Web Information Retrieval.",
                    "A Web User Profiling Approach.",
                    "A New Algorithm for Performing Ratings-Based Collaborative Filtering.",
                    "Architecture for a Component-Based, Plug-In Micro-payment System.",
                    "Verifying the Purchase Request in SET Protocol.",
                    "Self-organizing Coefficient for Semi-blind Watermarking.",
                    "Applying RBAC Providing Restricted Permission Inheritance to a Corporate Web Environment.",
                    "eSignature Verification on Web Using Statistical Mining Approach.",
                    "Deriving Architectures of Web-Based Applications.",
                    "A New Agent Framework with Behavior Delegation Using SOAP.",
                    "Improving the Web Presentation Layer Architecture.",
                    "An Event Based Approach to Web Service Design and Interaction.",
                    "Active Document Framework ADF: Concept and Method.",
                    "Goal-Oriented Analysis and Agent-Based Design of Agile Supply Chain.",
                    "Methodologies and Mechanism Design in Group Awareness Support for Internet-Based Real-Time Distributed Collaboration.",
                    "Statistics Based Predictive Geo-spatial Data Mining: Forest Fire Hazardous Area Mapping Application.",
                    "Knowledge Representation, Ontologies, and the Semantic Web.",
                    "Web Wrapper Validation.",
                    "Web-Based Image Retrieval with a Case Study.",
                    "Extracting Content Structure for Web Pages Based on Visual Representation.",
                    "XML Data Integration and Distribution in a Web-Based Object Video Server System.",
                    "Genetic Algorithm-Based QoS Multicast Routing for Uncertainty in Network Parameters.",
                    "Tagged Fragment Marking Scheme with Distance-Weighted Sampling for a Fast IP Traceback.",
                    "An Ant Algorithm Based Dynamic Routing Strategy for Mobile Agents.",
                    "Integration of Mobile IP and NHRP over ATM Networks.",
                    "e_SWDL: An XML Based Workflow Definition Language for Complicated Applications in Web Environments.",
                    "An Efficient User Task Handling Mechanism Based on Dynamic Load-Balance for Workflow Systems.",
                    "Exception Specification and Handling in Workflow Systems.",
                    "Key Issues and Experiences in Development of Distributed Workflow Management Systems.",
                    "Intelligent Search for Distributed Information Sources Using Heterogeneous Neural Networks.",
                    "A Localness-Filter for Searched Web Pages.",
                    "DEBIZ: A Decentralized Lookup Service for E-commerce.",
                    "Design of B+Tree-Based Predicate Index for Efficient Event Matching.",
                    "Data Replication at Web Proxies in Content Distribution Network.",
                    "A Hash-Based Collaborative Transcoding Proxy System.",
                    "Dynamic Materialized View Management Based on Predicates.",
                    "DPR: A Dynamic Partial Replication Protocol Based on Group Communication for a Web-Enable Database Cluster."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4th APWeb 2001",
        "info": "Changsha, China",
        "venues": []
    },
    {
        "year": "2000",
        "name": "3rd APWeb 2000",
        "info": "Xian, China",
        "venues": []
    },
    {
        "year": "1999",
        "name": "2nd APWeb 1999",
        "info": "Hong Kong, China",
        "venues": []
    },
    {
        "year": "1998",
        "name": "1st APWeb 1998",
        "info": "Beijing, China",
        "venues": []
    }
]