[
    {
        "year": "2021",
        "name": "11th CIDR 2021",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2021",
                "sub_name": "11th Conference on Innovative Data Systems Research, CIDR 2021, Virtual Event, January 11-15, 2021, Online Proceedings.",
                "count": 43,
                "papers": [
                    "Simplicity Done Right for Join Ordering.",
                    "Progressive Join Algorithms Considering User Preference.",
                    "Accelerating Complex Analytics using Speculation.",
                    "chainifyDB: How to get rid of your Blockchain and use your DBMS instead.",
                    "Fraud Buster: Tracking IRSF Using Blockchain While Protecting Business Confidentiality.",
                    "Contention and Space Management in B-Trees.",
                    "Putting Pandas in a Box.",
                    "Magpie: Python at Speed and Scale using Cloud Backends.",
                    "Leam: An Interactive System for In-situ Visual Text Analysis.",
                    "AnyDB: An Architecture-less DBMS for Any Workload.",
                    "VergeDB: A Database for IoT Analytics on Edge Devices.",
                    "Boxer: Data Analytics on Network-enabled Serverless Platforms.",
                    "Bootleg: Chasing the Tail with Self-Supervised Named Entity Disambiguation.",
                    "Semi-Supervised Data Cleaning with Raha and Baran.",
                    "Learned Approximate Query Processing: Make it Light, Accurate and Fast.",
                    "Snowflake Data Cloud.",
                    "New Directions in Cloud Programming.",
                    "Lakehouse: A New Generation of Open Platforms that Unify Data Warehousing and Advanced Analytics.",
                    "Challenges and Opportunities for Autonomous Vehicle Query Systems.",
                    "Interference-aware Micro-architectural Resource Manager for Hybrid Workloads.",
                    "White-Box OLAP Performance Modeling for the Cloud.",
                    "The Need for a New I/O Model.",
                    "Using Deep Learning Models to Replace Large Materialized Views in Relational Database.",
                    "Hamming Tree: The Case for Memory-Aware Bit Flipping Reduction for NVM Indexing.",
                    "Automating State Management in Computational Notebooks.",
                    "Cloud Observability: A MELTing Pot for Petabytes of Heterogenous Time Series.",
                    "Data Cleaning in the Era of Data Science: Challenges and Opportunities.",
                    "DataSense: Display-Agnostic Data Documentation.",
                    "Scaling Data Science does not mean Scaling Machines.",
                    "Accelerating Queries over Unstructured Data with ML.",
                    "The Case for Distance-Bounded Spatial Approximations.",
                    "Hist-Tree: Those Who Ignore It Are Doomed to Learn.",
                    "Everything is a Transaction: Unifying Logical Concurrency Control and Physical Data Structure Maintenance in Database Management Systems.",
                    "Integrity-based Attacks for Encrypted Databases and Implications.",
                    "Encrypted Databases: From Theory to Systems.",
                    "Sypse: Privacy-first Data Management through Pseudonymization and Partitioning.",
                    "\"Let the Data Flow!\".",
                    "Cerebro: A Layered Data Platform for Scalable Deep Learning.",
                    "Ease.ML: A Lifecycle Management System for Machine Learning.",
                    "Lightweight Inspection of Data Preprocessing in Native Machine Learning Pipelines.",
                    "Bridging the Chasm between Science and Reality.",
                    "Computational Storage: Where Are We Today?",
                    "Universal Layout Emulation for Long-Term Database Archival."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "10th CIDR 2020",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2020",
                "sub_name": "10th Conference on Innovative Data Systems Research, CIDR 2020, Amsterdam, The Netherlands, January 12-15, 2020, Online Proceedings.",
                "count": 49,
                "papers": [
                    "Big Data, AI and Banks - Uses Cases and Possibilities on the Ground.",
                    "Data Management for Enterprise Applications.",
                    "Compiling PL/SQL Away.",
                    "Shared Load(ing): Efficient Bulk Loading into Optimized Storage.",
                    "The Case for Deep Query Optimisation.",
                    "White-box Compression: Learning and Exploiting Compact Table Representations.",
                    "BitGourmet: Deterministic Approximation via Optimized Bit Selection.",
                    "Rethinking Data Management Systems for Disaggregated Data Centers.",
                    "The NebulaStream Platform for Data and Application Management in the Internet of Things.",
                    "Cloudy with high chance of DBMS: a 10-year prediction for Enterprise-Grade ML.",
                    "AnyLog: a Grand Unification of the Internet of Things.",
                    "Topology-aware Parallel Data Processing: Models, Algorithms and Systems at Scale.",
                    "Constructing Expressive Relational Queries with Dual-Specification Synthesis.",
                    "VisualWorldDB: A DBMS for the Visual World.",
                    "Your notebook is not crumby enough, REPLace it.",
                    "CrocodileDB: Efficient Database Execution through Intelligent Deferment.",
                    "Towards Autonomous, Hands-Free Data Exploration.",
                    "Exploiting Directly-Attached NVMe Arrays in DBMS.",
                    "Open-Channel SSD (What is it Good For).",
                    "GPU-accelerated data management under the test of time.",
                    "It Takes Two: Instrumenting the Interaction between In-Memory Databases and Solid-State Drives.",
                    "Enabling Rich Queries Over Heterogeneous Data From Diverse Sources In HealthCare.",
                    "View-Driven Optimization of Database-Backed Web Applications.",
                    "SystemDS: A Declarative Machine Learning System for the End-to-End Data Science Lifecycle.",
                    "Data Management for Data Science - Towards Embedded Analytics.",
                    "Extending Relational Query Processing with ML Inference.",
                    "alpha to omega: the G(r)eek Alphabet of Sampling.",
                    "Mosaic: A Sample-Based Database System for Open World Query Processing.",
                    "Is FPGA Useful for Hash Joins?",
                    "Hardware-Oblivious SIMD Parallelism for In-Memory Column-Stores.",
                    "Umbra: A Disk-Based System with In-Memory Performance.",
                    "Tackling Hardware/Software co-design from a database perspective.",
                    "Migrating a Privacy-Safe Information Extraction System to a Software 2.0 Design.",
                    "\"Amnesia\" - Machine Learning Models That Can Forget User Data Very Fast.",
                    "Overton: A Data System for Monitoring and Improving Machine-Learned Products.",
                    "DBMS Fitting: Why should we learn what we already know?",
                    "Dagger: A Data (not code) Debugger.",
                    "Aiming at real applications: Subsequence Outlier Detection on Mixed-Type Attributes Data in RDBMS.",
                    "Cross-Blockchain Transactions.",
                    "Fragment-Driven Natural Language Interaction with Databases.",
                    "A System for Studying Deep Network Training.",
                    "Parallel Traversal of Graphs Stored in RDBMSs.",
                    "Active Reinforcement Learning for Data Preparation: Learn2Clean with Human-In-The-Loop.",
                    "Making DBMSes Dependency-Aware.",
                    "Pixels: Multiversion Wide Table Store for Data Lakes.",
                    "When sweet and cute isn't enough anymore: Solving scalability issues in Python Pandas with Grizzly.",
                    "We do not have Systems for Analysing IoT Big-Data.",
                    "CAFE: Constraint-Aware Feature Extraction from Large Databases.",
                    "Efficient Hard Real-Time Transaction Processing - Unachievable in Software."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "9th CIDR 2019",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2019",
                "sub_name": "9th Biennial Conference on Innovative Data Systems Research, CIDR 2019, Asilomar, CA, USA, January 13-16, 2019, Online Proceedings.",
                "count": 50,
                "papers": [
                    "DNA Data Storage and Near-Molecule Processing for the Yottabyte Era.",
                    "OligoArchive: Using DNA in the DBMS storage hierarchy.",
                    "Hardware-conscious Query Processing in GPU-accelerated Analytical Engines.",
                    "The Case for Network Accelerated Query Processing.",
                    "DPI: The Data Processing Interface for Modern Networks.",
                    "Serverless Computing: One Step Forward, Two Steps Back.",
                    "Veritas: Shared Verifiable Databases and Tables in the Cloud.",
                    "Architecting a Differentially Private SQL Engine.",
                    "Exploiting Latent Information in Relational Databases via Word Embedding and Application to Degrees of Disclosure.",
                    "Thriving in the No Man's Land between Compilers and Databases.",
                    "The Role of Massively Multi-Task and Weak Supervision in Software 2.0.",
                    "ItemSuggest: A Data Management Platform for Machine Learned Ranking Services.",
                    "Design Continuums and the Path Toward Self-Designing Key-Value Stores that Know and Learn.",
                    "SageDB: A Learned Database System.",
                    "Using Bots, Machine Learning & Pipelines to create a modern data management environment.",
                    "Every Row Counts: Combining Sketches and Sampling for Accurate Group-By Result Estimates.",
                    "Learned Cardinalities: Estimating Correlated Joins with Deep Learning.",
                    "Towards a Hands-Free Query Optimizer through Deep Learning.",
                    "DeepLens: Towards a Visual Data Management System.",
                    "Challenges and Opportunities in DNN-Based Video Analytics: A Demonstration of the BlazeIt Video Query Engine.",
                    "Kyrix: Interactive Visual Data Exploration at Scale.",
                    "ARQuery: Hallucinating Analytics over Real-World Data using Augmented Reality.",
                    "Data Vocalization with CiceroDB.",
                    "DBChEx: Interactive Exploration of Data and Schema Change.",
                    "Dataset Relationship Management.",
                    "Demonstration of a Multiresolution Schema Mapping System.",
                    "Database-Agnostic Workload Management.",
                    "Data Partitioning for In-Memory Systems: Myths, Challenges, and Opportunities.",
                    "Automated Performance Management for the Big Data Stack.",
                    "Fixed It For You: Protocol Repair Using Lineage Graphs.",
                    "SQALPEL: A database performance platform.",
                    "Elastic In-Memory Transaction Processing for Multi-Tenant Database Systems.",
                    "Revisiting RISC-style Data Management System Design.",
                    "Selectivity Computation for In-Memory Query Optimization.",
                    "NullDB: Instantaneously Answering Any OLAP Query.",
                    "Query-Driven Data Cleaning for Exploratory Queries.",
                    "Bringing Databases up to Pocket-Scale.",
                    "Making Neural Network Optimizers Practical.",
                    "The End of the x86 Dominance in Databases?",
                    "Crazy Idea! Databases ⨝ Reinforcement-learning Research (CIDR2).",
                    "Decentralized Search on Decentralized Web.",
                    "Serverless Event-Stream Processing over Virtual Actors.",
                    "Diversity of LSM tree shapes.",
                    "Serverless Foundations for Elastic Database Systems.",
                    "The I's Have It: Identity, Immutability, Idempotence, and Interchangeability Form the Backbone of Distributed Computing.",
                    "Tools for Advanced Time Series Analytics: Enabling the Future.",
                    "Storing and Querying Social Graph Data on a Variety of Distributed Systems.",
                    "CryoDrill: Near-Data Processing in Deep and Cold Storage Hierarchies.",
                    "Calling a Server-Less Function from a Container-Based System: Why This Fad?",
                    "Data warehouses are dead, long live data warehousing!"
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "8th CIDR 2017",
        "info": "Chaminade, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2017",
                "sub_name": "8th Biennial Conference on Innovative Data Systems Research, CIDR 2017, Chaminade, CA, USA, January 8-11, 2017, Online Proceedings.",
                "count": 74,
                "papers": [
                    "Data Ingestion for the Connected World.",
                    "Evolving Databases for New-Gen Big Data Applications.",
                    "SnappyData: A Unified Cluster for Streaming, Transactions and Interactice Analytics.",
                    "Prioritizing Attention in Analytic Monitoring.",
                    "The Data Civilizer System.",
                    "Ground: A Data Context Service.",
                    "Adaptive Schema Databases.",
                    "The Case For Heterogeneous HTAP.",
                    "Cardinality Estimation Done Right: Index-Based Join Sampling.",
                    "Indexing in an Actor-Oriented Database.",
                    "Data Provenance at Internet Scale: Architecture, Experiences, and the Road Ahead.",
                    "The Myria Big Data Management and Analytics System and Cloud Services.",
                    "Demonstrating the BigDAWG Polystore System for Ocean Metagenomics Analysis.",
                    "Self-Driving Database Management Systems.",
                    "Fast-Forwarding to Desired Visualizations with Zenvisage.",
                    "Combining Design and Performance in a Data Visualization Management System.",
                    "Ava: From Data to Insights Through Conversations.",
                    "Dependency-Driven Analytics: A Compass for Uncharted Data Oceans.",
                    "Database Forensic Analysis with DBCarver.",
                    "A Model for Fine-Grained Data Citation.",
                    "Latch-free Synchronization in Database Systems: Silver Bullet or Fool's Gold?",
                    "Adaptive Concurrency Control: Despite the Looking Glass, One Concurrency Control Does Not Fit All.",
                    "My Weak Consistency is Strong.",
                    "Toward Sustainable Insights, or Why Polygamy is Bad for You.",
                    "SPOOF: Sum-Product Optimization and Operator Fusion for Large-Scale Machine Learning.",
                    "Janus: Transaction Processing of Navigation and Analytic Graph Queries on Many-core Servers.",
                    "A Common Runtime for High Performance Data Analysis.",
                    "A Database System with Amnesia.",
                    "Releasing Cloud Databases for the Chains of Performance Prediction Models.",
                    "Optimizing Space Amplification in RocksDB.",
                    "Cosette: An Automated Prover for SQL.",
                    "READY: Completeness is in the Eye of the Beholder.",
                    "CEREBRO: A System to Manage Deep Learning for Relational Data Analytics.",
                    "ExpoDB: An Exploratory Data Science Platform.",
                    "Snorkel: A System for Lightweight Extraction.",
                    "RLEX: Saftey and Data Quality in Reinforcement Learning-based and Adaptive Systems.",
                    "Active Database Learning.",
                    "MODELDB: A System for Machine Learning Model Management.",
                    "Predictive Provisioning: A Progress Report.",
                    "How to Talk to People at Conferences.",
                    "Dial M for Management: Next Generation NoSQL.",
                    "Neuromorphic Hardware As Database Co-Processors.",
                    "The Automatic Scientist will be a Data System.",
                    "GeneralStore: Declarative Programmable Storage.",
                    "Exploring a continuum between main-memory and disk-oriented OLTP systems.",
                    "What's Up with the Storage Hierarchy?",
                    "Event Evolution and Archiving.",
                    "Mike Franklin Spits Fire.",
                    "Reaching Mutual Understanding in a Society of Humans and Database Systems.",
                    "AgriBase: Status Labeling for IoT Systems.",
                    "Playing Information LEGO at Large Scale.",
                    "Elementary, dear Watson!",
                    "Towards Benchmarking Multi-Model Databases.",
                    "Secure Data Systems and Performance: Friends or Foe?",
                    "CIDR: Chat-oriented Innovations in Database Research.",
                    "We Are Boring.",
                    "Answer yes/no queries in search engines.",
                    "In Database We Trust?",
                    "What is the Population of Interest: Population Modeling for BayesDB.",
                    "Scalable In-Situ Exploration over Raw Data.",
                    "What is Our Agenda for Data Science?",
                    "NoSym: Non-Symbolic Databases for Data Decoupling.",
                    "Next Generation Consistency Enforcement.",
                    "Query processing for datacenter-scale computers.",
                    "Reprowd: Crowdsourced Data Processing Made Reproducible.",
                    "Density Peaks Clustering with Differential Privacy.",
                    "SQL for NoSQL Databases: Deja Vu (Part 2).",
                    "Casual Querying: Facilitating Information Dissemination in Ad-hoc Environments.",
                    "A Visual Cloud for Virtual Reality Applications.",
                    "Treating Microservices as a Unifed, Distributed Database.",
                    "Hybrid: A Large-scale In-memory Image Analytics Engine.",
                    "Stop the Truthiness and Just Be Wrong.",
                    "On the design of a Globally Distributed, Locally Compressed Knowledge Base System.",
                    "Representation Independent Data Analytics."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "7th CIDR 2015",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2015",
                "sub_name": "Seventh Biennial Conference on Innovative Data Systems Research, CIDR 2015, Asilomar, CA, USA, January 4-7, 2015, Online Proceedings.",
                "count": 60,
                "papers": [
                    "Just-In-Time Data Virtualization: Lightweight Data Management with ViDa.",
                    "Just-In-Time Data Structures.",
                    "Data Stream Warehousing In Tidalrace.",
                    "Liquid: Unifying Nearline and Offline Big Data Integration.",
                    "Impala: A Modern, Open-Source SQL Engine for Hadoop.",
                    "Hephaestus: Data Reuse for Accelerating Scientific Discovery.",
                    "DataHub: Collaborative Data Science & Dataset Version Management at Scale.",
                    "Building Highly-Optimized, Low-Latency Pipelines for Genomic Data Analysis.",
                    "Applying WebTables in Practice.",
                    "Finding Quality in Quantity: The Challenge of Discovering Valuable Sources for Integration.",
                    "Looking at Everything in Context.",
                    "Instant Recovery for Main Memory Databases.",
                    "Invisible Glue: Scalable Self-Tunning Multi-Stores.",
                    "Immutability Changes Everything.",
                    "Tracking Personal Data Use: Provenance and Trust.",
                    "XCloud: Extensible Performance Management for Cloud Data Services.",
                    "The Case for Small Data Management.",
                    "Modelling the Evolving World.",
                    "The Big Data - Same Humans Problem.",
                    "Smoothing non-uniform communication latencies for OLTP.",
                    "Synthesizing Data Programs.",
                    "Mastering Situation Awareness: The Next Frontier?",
                    "Breathing Life into Database Textbooks.",
                    "Big Data Space Fungus.",
                    "Heisenberg Was on the Write Track.",
                    "A Multicore Database is not a Distributed System.",
                    "Towards Generating Application-Specific Data Management Systems.",
                    "Robust Data Transformations.",
                    "Data Visualization Management Systems.",
                    "Data, Technology and the Challenges of Abundance.",
                    "Towards Systematic Data Center Design.",
                    "Desiderata for a Big Data Language.",
                    "The Case for Invariant-Based Concurrency Control.",
                    "Big Data Science Needs Big Data Middleware.",
                    "Verdict: A System for Stochastic Query Planning.",
                    "Specialized Evolution of the General Purpose CPU.",
                    "The Case Against Specialized Graph Analytics Engines.",
                    "FPGA-based Multithreading for In-Memory Hash Joins.",
                    "Raising Authorization Awareness in a DBMS.",
                    "Tupleware: \"Big\" Data, Big Analytics, Small Clusters.",
                    "Changing the Face of Database Cloud Services with Personalized Service Level Agreements.",
                    "Database Optimization in the Cloud: Where Costs, Partial Results, and Consumer Choice Meet.",
                    "WANalytics: Analytics for a Geo-Distributed Data-Intensive World.",
                    "High Performance Transactions in Deuteronomy.",
                    "An Information Provider's Wish List for a Next Generation Big Data End-to-End Information System.",
                    "Dataxformer: Leveraging the Web for Semantic Transformations.",
                    "Predictive Interaction for Data Transformation.",
                    "Management of Flexible Schema Data in RDBMSs - Opportunities and Limitations for NoSQL -.",
                    "Capturing the Laws of (Data) Nature.",
                    "Combining Databases and Signal Processing in Plato.",
                    "The Missing Piece in Complex Analytics: Low Latency, Scalable Model Management and Serving with Velox.",
                    "YAGO3: A Knowledge Base from Multilingual Wikipedias.",
                    "Managing General and Individual Knowledge in Crowd Mining Applications.",
                    "Data Wrangling: The Challenging Yourney from the Wild to the Lake.",
                    "Let's Rethink Join Optimization in Distributed Systems.",
                    "SQL for NoSQL Databases: Déjà Vu.",
                    "Poor Usability in Data Processing.",
                    "Faster Evaluation of Labor-Intensive Features.",
                    "Guided Clustering for Social Media Nowcasting.",
                    "Inner CALM: Concurrency control protocols through the looking glass."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "6th CIDR 2013",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2013",
                "sub_name": "Sixth Biennial Conference on Innovative Data Systems Research, CIDR 2013, Asilomar, CA, USA, January 6-9, 2013, Online Proceedings.",
                "count": 64,
                "papers": [
                    "QPPT: Query Processing on Prefix Trees.",
                    "Toward Progress Indicators on Steroids for Big Data Systems.",
                    "Differential Dataflow.",
                    "MLbase: A Distributed Machine-learning System.",
                    "SQLVM: Performance Isolation in Multi-Tenant Relational Database-as-a-Service.",
                    "Caravan: Provisioning for What-If Analysis.",
                    "How to Fit when No One Size Fits.",
                    "LogKV: Exploiting Key-Value Stores for Log Processing.",
                    "Executing Long-Running Transactions in Synchronization-Free Main Memory Database Systems.",
                    "Message Futures: Fast Commitment of Transactions in Multi-datacenter Environments.",
                    "Orthogonal Security with Cipherbase.",
                    "Scalable Social Coordination with Group Constraints using Enmeshed Queries.",
                    "BG: A Benchmark to Evaluate Interactive Social Networking Actions.",
                    "Asynchronous Large-Scale Graph Processing Made Easy.",
                    "VOGUE: Towards A Visual Interaction-aware Graph Query Processing Framework.",
                    "We Don't Need No Stinking Databases in Genomics.",
                    "Understanding the Structure of Ranked Data.",
                    "Using Fully Homomorphic Encryption to Enable Secure Database as a Service.",
                    "Solid State Storage & DBMS.",
                    "Unlocking Cool in Databases (and CS in general).",
                    "A Case for Thread Migration.",
                    "Keyboards, R.I.P.",
                    "Big Data Pipelines.",
                    "Pick-A-Crowd: Tell me what you like, and I'll tell you what to do.",
                    "Say No! No! and No!",
                    "A Science Fiction Talk.",
                    "HAT, not CAP: Highly Available Transactions for Everybody.",
                    "Big Data Complex Data.",
                    "A Probabilistic Knowledge Base System.",
                    "We are Under Attack; by the least publishable unit.",
                    "Quantcast File System (QFS).",
                    "Transactional Middleware Reconsidered.",
                    "Beating State-of-the-art By -10000%.",
                    "Managing Personal Goal Information.",
                    "Cache Augmented SQL (CASQL) Systems.",
                    "Data Publishing and Sharing using Fusion Tables.",
                    "The Informatics of Large Multisite Brain Mapping Projects.",
                    "Green Databases Through Integration of Renewable Energy.",
                    "How Achaeans Would Construct Columns in Troy.",
                    "StatusQuo: Making Familiar Abstractions Perform Using Program Analysis.",
                    "NUMA-aware algorithms: the case of data shuffling.",
                    "Understanding Local Structure in Ranked Datasets.",
                    "Brainwash: A Data System for Feature Engineering.",
                    "Mirror mirror on the wall, which query's fairest of them all?",
                    "A Social Network Database that Learns How to Answer Queries.",
                    "DBSeer: Resource and Performance Prediction for Building a Next Generation Database Cloud.",
                    "D-Hive: Data Bees Pollinating RDF, Text, and Time.",
                    "CrowdQ: Crowdsourced Query Understanding.",
                    "Query Steering for Interactive Data Exploration.",
                    "Abstraction without regret in data management systems.",
                    "The Necessary Death of the Block Device Interface.",
                    "WWHow! Freeing Data Storage from Cages.",
                    "The bionic DBMS is coming, but what will it look like?",
                    "Querying Without Keyboards.",
                    "Trusted Cells: A Sea Change for Personal Data Services.",
                    "Stop That Query! The Need for Managing Data Use.",
                    "dbTouch: Analytics at your Fingertips.",
                    "Arnold: Declarative Crowd-Machine Data Integration.",
                    "Data Integration and Data Exchange: It's Really About Time.",
                    "Quantum Databases.",
                    "Data Curation at Scale: The Data Tamer System.",
                    "COD: Database / Operating System Co-Design.",
                    "Meet Charles, big data query advisor.",
                    "Engagements: Building Eventually ACiD Business Transactions."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "5th CIDR 2011",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2011",
                "sub_name": "Fifth Biennial Conference on Innovative Data Systems Research, CIDR 2011, Asilomar, CA, USA, January 9-12, 2011, Online Proceedings.",
                "count": 39,
                "papers": [
                    "Flash Device Support for Database Management.",
                    "Hyder - A Transactional Record Manager for Shared Flash.",
                    "Rethinking Database Algorithms for Phase Change Memory.",
                    "SWissBox: An Architecture for Data Processing Appliances.",
                    "IQ: The Case for Iterative Querying for Knowledge.",
                    "DBease: Making Databases User-Friendly and Easily Accessible.",
                    "Here are my Data Files. Here are my Queries. Where are my Results?",
                    "The SQL-based all-declarative FORWARD web application development framework.",
                    "Managing Information Leakage.",
                    "eXO: Decentralized Autonomous Scalable Social Networking.",
                    "Database Access Control and Privacy: Is there a common ground?",
                    "Transactional Intent.",
                    "Consistency in a Stream Warehouse.",
                    "Deuteronomy: Transaction Support for Cloud Data.",
                    "Data Consistency Properties and the Trade-offs in Commercial Cloud Storage: the Consumers' Perspective.",
                    "Using Data for Systemic Financial Risk Management.",
                    "Computational Journalism: A Call to Arms to Database Researchers.",
                    "Ibis: A Provenance Manager for Multi-Layer Systems.",
                    "Answering Queries using Humans, Algorithms and Databases.",
                    "The Case for Predictive Database Systems: Opportunities and Challenges.",
                    "User Feedback as a First Class Citizen in Information Integration Systems.",
                    "Data Externality.",
                    "No bits left behind.",
                    "DBrev: Dreaming of a Database Revolution.",
                    "Towards a One Size Fits All Database Architecture.",
                    "Longitudinal Analytics on Web Archive Data: It's About Time!",
                    "Data in the First Mile.",
                    "Managing Structured Collections of Community Data.",
                    "Crowdsourced Databases: Query Processing with People.",
                    "Enabling Privacy in Provenance-Aware Workflow Systems.",
                    "The Schema-Independent Database UI: A Proposed Holy Grail and Some Suggestions.",
                    "Megastore: Providing Scalable, Highly Available Storage for Interactive Services.",
                    "Relational Cloud: a Database Service for the cloud.",
                    "Cloud Resource Orchestration: A Data-Centric Approach.",
                    "Consistency Analysis in Bloom: a CALM and Collected Approach.",
                    "Starfish: A Self-tuning System for Big Data Analytics.",
                    "Provenance for Generalized Map and Reduce Workflows.",
                    "DBToaster: Agile Views for a Dynamic Data Management System.",
                    "SciBORQ: Scientific data management with Bounds On Runtime and Quality."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "4th CIDR 2009",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2009",
                "sub_name": "Fourth Biennial Conference on Innovative Data Systems Research, CIDR 2009, Asilomar, CA, USA, January 4-7, 2009, Online Proceedings.",
                "count": 39,
                "papers": [
                    "Voyagers and Voyeurs: Supporting Social Data Analysis.",
                    "Social Systems: Can We Do More Than Just Poke Friends?",
                    "From Declarative Languages to Declarative Processing in Computer Games.",
                    "Declarative Reconfigurable Trust Management.",
                    "Interactive Data Integration through Smart Copy & Paste.",
                    "Search Driven Analysis of Heterogenous XML Data.",
                    "Qunits: queried units in database search.",
                    "Boosting XML filtering through a scalable FPGA-based architecture.",
                    "Capturing Data Uncertainty in High-Volume Stream Processing.",
                    "Inter-Operator Feedback in Data Stream Management Systems via Punctuation.",
                    "Remembrance: The Unbearable Sentience of Being Digital.",
                    "uFLIP: Understanding Flash IO Patterns.",
                    "Unbundling Transaction Services in the Cloud.",
                    "The Case for RodentStore: An Adaptive, Declarative Storage System.",
                    "Teaching an Old Elephant New Tricks.",
                    "Extracting and Querying a Comprehensive Web Database.",
                    "Interactive Analysis of Web-Scale Data.",
                    "Continuous Analytics: Rethinking Query Processing in a Network-Effect World.",
                    "A Scalable Data Platform for a Large Number of Small Applications.",
                    "The Role of Schema Matching in Large Enterprises.",
                    "A Case for A Collaborative Query Management System.",
                    "Do-It-Yourself custom forms-driven workflow applications.",
                    "Why Did My Query Slow Down.",
                    "Visualizing the robustness of query execution.",
                    "DBMSs Should Talk Back Too.",
                    "Building on Quicksand.",
                    "Principles for Inconsistency.",
                    "SCADS: Scale-Independent Storage for Social Computing Applications.",
                    "Harnessing the Deep Web: Present and Future.",
                    "The Case for a Structured Approach to Managing Unstructured Data.",
                    "SocialScope: Enabling Information Discovery on Social Content Sites.",
                    "Sailing the Information Ocean with Awareness of Currents: Discovery and Application of Source Dependence.",
                    "Internet-Scale Data Center Power Efficiency.",
                    "Energy Efficiency: The New Holy Grail of Data Management Systems Research.",
                    "Towards Eco-friendly Database Management Systems.",
                    "Data Management for High-Throughput Genomics.",
                    "LifeRaft: Data-Driven, Batch Processing for the Exploration of Scientific Databases.",
                    "Requirements for Science Data Bases and SciDB.",
                    "RIOT: I/O-Efficient Numerical Computing without SQL."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "3rd CIDR 2007",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2007",
                "sub_name": "Third Biennial Conference on Innovative Data Systems Research, CIDR 2007, Asilomar, CA, USA, January 7-10, 2007, Online Proceedings.",
                "count": 47,
                "papers": [
                    "SwissQM: Next Generation Data Processing in Sensor Networks.",
                    "Data-Driven Processing in Sensor Networks.",
                    "Rethinking Data Management for Storage-centric Sensor Networks.",
                    "Demaq: A Foundation for Declarative XML Message Processing.",
                    "Cache-Oblivious Query Processing.",
                    "A Black-Box Approach to Query Cardinality Estimation.",
                    "Database Cracking.",
                    "Database Servers on Chip Multiprocessors: Limitations and Opportunities.",
                    "The CompleteSearch Engine: Interactive, Efficient, and Towards IR& DB Integration.",
                    "Efficient and Flexible Information Retrieval using MonetDB/X100.",
                    "Predicate-based Indexing of Enterprise Web Applications.",
                    "Entity Search Engine: Towards Agile Best-Effort Information Integration over the Web.",
                    "A Dataspace Odyssey: The iMeMex Personal Dataspace Management System (Demo).",
                    "Turning Cluster Management into Data Management; A System Overview.",
                    "Life beyond Distributed Transactions: an Apostate's Opinion.",
                    "One table stores all: Enabling painless free-and-easy data publishing and sharing.",
                    "The Data Ring: Community Content Sharing.",
                    "P2P Web Search: Make It Light, Make It Fly (Demo).",
                    "DBLife: A Community Information Management Platform for the Database Research Community (Demo).",
                    "One Size Fits All? Part 2: Benchmarking Studies.",
                    "Smoothing the ROI Curve for Scientific Data Management Applications.",
                    "bdbms - A Database Management System for Biological Data.",
                    "Spatial Indexing of Large Multidimensional Databases.",
                    "Maitri Demonstration: Managing Large Scale Scientific Data (Demo).",
                    "Structured Querying of Web Text Data: A Technical Challenge.",
                    "Object-level Vertical Search.",
                    "MOMA - A Mapping-based Object Matching System.",
                    "XClean in Action (Demo).",
                    "QUIC: A System for Handling Imprecision & Incompleteness in Autonomous Databases (Demo).",
                    "Trio-One: Layering Uncertainty and Lineage on a Conventional DBMS (Demo).",
                    "Managing Query Compilation Memory Consumption to Improve DBMS Throughput.",
                    "Rethinking Choices for Multi-dimensional Point Indexing: Making the Case for the Often Ignored Quadtree.",
                    "Column Stores for Wide and Sparse Data.",
                    "Fragmentation in Large Object Repositories.",
                    "An Architecture for Modular Data Centers.",
                    "Isolation Support for Service-based Applications: A Position Paper.",
                    "Beyond Just Data Privacy.",
                    "Public Health for the Internet (PHI).",
                    "Community Systems: The World Online.",
                    "Web-Scale Data Integration: You can afford to Pay as You Go.",
                    "Impliance: A Next Generation Information Management Appliance.",
                    "Consistent Streaming Through Time: A Vision for Event Stream Processing.",
                    "Moirae: History-Enhanced Monitoring.",
                    "Securing history: Privacy and accountability in database systems.",
                    "The Case for a Signal-Oriented Data Stream Management System.",
                    "SASE: Complex Event Processing over Streams (Demo).",
                    "Cayuga: A General Purpose Event Monitoring System."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd CIDR 2005",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2005",
                "sub_name": "Second Biennial Conference on Innovative Data Systems Research, CIDR 2005, Asilomar, CA, USA, January 4-7, 2005, Online Proceedings.",
                "count": 27,
                "papers": [
                    "Integrating DB and IR Technologies: What is the Sound of One Hand Clapping?",
                    "Haystack: A General-Purpose Information Management Tool for End Users Based on Semistructured Data.",
                    "The Architecture of PIER: an Internet-Scale Query Processor.",
                    "Toward Large Scale Integration: Building a MetaQuerier over Databases on the Web.",
                    "A Scalability Service for Dynamic Web Applications.",
                    "Lessons Learned from Managing a Petabyte.",
                    "Automatic Performance Diagnosis and Tuning in Oracle.",
                    "Efficient Regression Tests for Database Applications.",
                    "ORCHESTRA: Rapid, Collaborative Sharing of Dynamic Data.",
                    "A Platform for Personal Information Management and Integration.",
                    "(Almost) Hands-Off Information Integration for the Life Sciences.",
                    "Data on the Outside Versus Data on the Inside.",
                    "When Database Systems Meet the Grid.",
                    "Deriving and Managing Data Products in an Environmental Observation and Forecasting System.",
                    "How can we support Grid Transactions? Towards Peer-to-Peer Transaction Processing.",
                    "Two Can Keep A Secret: A Distributed Architecture for Secure Database Services.",
                    "User Profile Management in Converged Networks (Episode II): \"Share your Data, Keep your Secrets\".",
                    "Cracking the Database Store.",
                    "MonetDB/X100: Hyper-Pipelining Query Execution.",
                    "Adaptive Query Processing in the Looking Glass.",
                    "Buffer-pool Aware Query Optimization.",
                    "Trio: A System for Integrated Management of Data, Accuracy, and Lineage.",
                    "The Design of the Borealis Stream Processing Engine.",
                    "Design Considerations for High Fan-In Systems: The HiFi Approach.",
                    "Action-Oriented Query Processing for Pervasive Computing.",
                    "Using Probabilistic Models for Data Management in Acquisitional Environments.",
                    "The Geek-Tones: An Experiment in Distributed, Real-time Musical Integration."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "1st CIDR 2003",
        "info": "Asilomar, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cidr/2003",
                "sub_name": "First Biennial Conference on Innovative Data Systems Research, CIDR 2003, Asilomar, CA, USA, January 5-8, 2003, Online Proceedings.",
                "count": 27,
                "papers": [
                    "Sorting And Indexing With Partitioned B-Trees.",
                    "Speculative Query Processing.",
                    "A Case for Staged Database Systems.",
                    "Active Server Availability Feedback.",
                    "Capacity Bound-free Web Warehouse.",
                    "The Database Machine: Old Story, New Slant?",
                    "The BINGO! System for Information Portal Generation and Expert Web Search.",
                    "XL: a platform for Web Services.",
                    "Automated Ranking of Database Query Results.",
                    "Towards High Performance Peer-to-Peer Content and Resource Sharing Systems.",
                    "Crossing the Structure Chasm.",
                    "Distributed Query Processing and Catalogs for Peer-to-Peer Systems.",
                    "Approximate Range Selection Queries in Peer-to-Peer Systems.",
                    "Enter Once, Share Everywhere: User Profile Management in Converged Networks.",
                    "Indexing Large Trajectory Data Sets With SETI.",
                    "Genomics Algebra: A New, Integrating Data Model, Language, and Tool for Processing and Querying Genomic Information.",
                    "SkyQuery: A Web Service Approach to Federate Databases.",
                    "The Virtual Data Grid: A New Model and Architecture for Data-Intensive Collaboration.",
                    "Applying Model Management to Classical Meta Data Problems.",
                    "AIMS: An Immersidata Management System.",
                    "Query Processing in Sensor Networks.",
                    "Query Processing, Approximation, and Resource Management in a Data Stream Management System.",
                    "Scalable Distributed Stream Processing.",
                    "TelegraphCQ: Continuous Dataflow Processing for an Uncertain World.",
                    "Architectural Issues and Solutions in the Development of Data-Intensive Web Applications.",
                    "Distributed Computing with BEA WebLogic Server.",
                    "Managing Expressions as Data in Relational Database Systems."
                ]
            }
        ]
    }
]