[
    {
        "year": "2021",
        "name": "26th DASFAA 2021",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2021-1",
                "sub_name": "Database Systems for Advanced Applications - 26th International Conference, DASFAA 2021, Taipei, Taiwan, April 11-14, 2021, Proceedings, Part I.",
                "count": 45,
                "papers": [
                    "Learning the Implicit Semantic Representation on Graph-Structured Data.",
                    "Multi-job Merging Framework and Scheduling Optimization for Apache Flink.",
                    "CIC-FL: Enabling Class Imbalance-Aware Clustered Federated Learning over Shifted Distributions.",
                    "vRaft: Accelerating the Distributed Consensus Under Virtualized Environments.",
                    "Secure and Efficient Certificateless Provable Data Possession for Cloud-Based Data Management Systems.",
                    "Dirty-Data Impacts on Regression Models: An Experimental Evaluation.",
                    "UniTest: A Universal Testing Framework for Database Management Systems.",
                    "Towards Generating HiFi Databases.",
                    "Modelling Entity Integrity for Semi-structured Big Data.",
                    "Label Contrastive Coding Based Graph Neural Network for Graph Classification.",
                    "Which Node Pair and What Status? Asking Expert for Better Network Embedding.",
                    "Keyword-Centric Community Search over Large Heterogeneous Information Networks.",
                    "KGSynNet: A Novel Entity Synonyms Discovery Framework with Knowledge Graph.",
                    "Iterative Reasoning over Knowledge Graph.",
                    "Spatial-Temporal Attention Network for Temporal Knowledge Graph Completion.",
                    "Ranking Associative Entities in Knowledge Graph by Graphical Modeling of Frequent Patterns.",
                    "A Novel Embedding Model for Knowledge Graph Completion Based on Multi-Task Learning.",
                    "Gaussian Metric Learning for Few-Shot Uncertain Knowledge Graph Completion.",
                    "Towards Entity Alignment in the Open World: An Unsupervised Approach.",
                    "Sequence Embedding for Zero or Low Resource Knowledge Graph Completion.",
                    "HMNet: Hybrid Matching Network for Few-Shot Link Prediction.",
                    "OntoCSM: Ontology-Aware Characteristic Set Merging for RDF Type Discovery.",
                    "EDKT: An Extensible Deep Knowledge Tracing Model for Multiple Learning Factors.",
                    "Fine-Grained Entity Typing via Label Noise Reduction and Data Augmentation.",
                    "DMSPool: Dual Multi-Scale Pooling for Graph Representation Learning.",
                    "A Parameter-Free Approach for Lossless Streaming Graph Summarization.",
                    "Expanding Semantic Knowledge for Zero-Shot Graph Embedding.",
                    "Online High-Cardinality Flow Detection over Big Network Data Stream.",
                    "SCSG Attention: A Self-centered Star Graph with Attention for Pedestrian Trajectory Prediction.",
                    "Time Period-Based Top-k Semantic Trajectory Pattern Query.",
                    "Optimal Sequenced Route Query with POI Preferences.",
                    "Privacy-Preserving Polynomial Evaluation over Spatio-Temporal Data on an Untrusted Cloud Server.",
                    "Exploiting Multi-source Data for Adversarial Driving Style Representation Learning.",
                    "MM-CPred: A Multi-task Predictive Model for Continuous-Time Event Sequences with Mixture Learning Losses.",
                    "Modeling Dynamic Social Behaviors with Time-Evolving Graphs for User Behavior Predictions.",
                    "Memory-Efficient Storing of Timestamps for Spatio-Temporal Data Management in Columnar In-Memory Databases.",
                    "Personalized POI Recommendation: Spatio-Temporal Representation Learning with Social Tie.",
                    "Missing POI Check-in Identification Using Generative Adversarial Networks.",
                    "Efficiently Discovering Regions of Interest with User-Defined Score Function.",
                    "An Attention-Based Bi-GRU for Route Planning and Order Dispatch of Bus-Booking Platform.",
                    "Top-k Closest Pair Queries over Spatial Knowledge Graph.",
                    "HIFI: Anomaly Detection for Multivariate Time Series with High-order Feature Interactions.",
                    "Incentive-aware Task Location in Spatial Crowdsourcing.",
                    "Efficient Trajectory Contact Query Processing.",
                    "STMG: Spatial-Temporal Mobility Graph for Location Prediction."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2021-2",
                "sub_name": "Database Systems for Advanced Applications - 26th International Conference, DASFAA 2021, Taipei, Taiwan, April 11-14, 2021, Proceedings, Part II.",
                "count": 53,
                "papers": [
                    "Multi-label Classification of Long Text Based on Key-Sentences Extraction.",
                    "Automated Context-Aware Phrase Mining from Text Corpora.",
                    "Keyword-Aware Encoder for Abstractive Text Summarization.",
                    "Neural Adversarial Review Summarization with Hierarchical Personalized Attention.",
                    "Generating Contextually Coherent Responses by Learning Structured Vectorized Semantics.",
                    "Latent Graph Recurrent Network for Document Ranking.",
                    "Discriminative Feature Adaptation via Conditional Mean Discrepancy for Cross-Domain Text Classification.",
                    "Discovering Protagonist of Sentiment with Aspect Reconstructed Capsule Network.",
                    "Discriminant Mutual Information for Text Feature Selection.",
                    "CAT-BERT: A Context-Aware Transferable BERT Model for Multi-turn Machine Reading Comprehension.",
                    "Unpaired Multimodal Neural Machine Translation via Reinforcement Learning.",
                    "Multimodal Named Entity Recognition with Image Attributes and Image Knowledge.",
                    "Multi-task Neural Shared Structure Search: A Study Based on Text Mining.",
                    "A Semi-structured Data Classification Model with Integrating Tag Sequence and Ngram.",
                    "Inferring Deterministic Regular Expression with Unorder and Counting.",
                    "MACROBERT: Maximizing Certified Region of BERT to Adversarial Word Substitutions.",
                    "A Diversity-Enhanced and Constraints-Relaxed Augmentation for Low-Resource Classification.",
                    "Neural Demographic Prediction in Social Media with Deep Multi-view Multi-task Learning.",
                    "An Interactive NL2SQL Approach with Reuse Strategy.",
                    "Consistency- and Inconsistency-Aware Multi-view Subspace Clustering.",
                    "Discovering Collective Converging Groups of Large Scale Moving Objects in Road Networks.",
                    "Efficient Mining of Outlying Sequential Behavior Patterns.",
                    "Clustering Mixed-Type Data with Correlation-Preserving Embedding.",
                    "Beyond Matching: Modeling Two-Sided Multi-Behavioral Sequences for Dynamic Person-Job Fit.",
                    "A Local Similarity-Preserving Framework for Nonlinear Dimensionality Reduction with Neural Networks.",
                    "AE-UPCP: Seeking Potential Membership Users by Audience Expansion Combining User Preference with Consumption Pattern.",
                    "Self Separation and Misseparation Impact Minimization for Open-Set Domain Adaptation.",
                    "Partial Modal Conditioned GANs for Multi-modal Multi-label Learning with Arbitrary Modal-Missing.",
                    "Cross-Domain Error Minimization for Unsupervised Domain Adaptation.",
                    "Unsupervised Domain Adaptation with Unified Joint Distribution Alignment.",
                    "Relation-Aware Alignment Attention Network for Multi-view Multi-label Learning.",
                    "BIRL: Bidirectional-Interaction Reinforcement Learning Framework for Joint Relation and Entity Extraction.",
                    "DFILAN: Domain-Based Feature Interactions Learning via Attention Networks for CTR Prediction.",
                    "Double Ensemble Soft Transfer Network for Unsupervised Domain Adaptation.",
                    "Attention-Based Multimodal Entity Linking with High-Quality Images.",
                    "Learning to Label with Active Learning and Reinforcement Learning.",
                    "Entity Resolution with Hybrid Attention-Based Networks.",
                    "MLSH: Mixed Hash Function Family for Approximate Nearest Neighbor Search in Multiple Fractional Metrics.",
                    "Quantum-Inspired Keyword Search on Multi-model Databases.",
                    "ZH-NER: Chinese Named Entity Recognition with Adversarial Multi-task Learning and Self-Attentions.",
                    "Drug-Drug Interaction Extraction via Attentive Capsule Network with an Improved Sliding-Margin Loss.",
                    "Span-Based Nested Named Entity Recognition with Pretrained Language Model.",
                    "Poetic Expression Through Scenery: Sentimental Chinese Classical Poetry Generation from Images.",
                    "SCHC: Incorporating Social Contagion and Hashtag Consistency for Topic-Oriented Social Summarization.",
                    "Image-Enhanced Multi-Modal Representation for Local Topic Detection from Social Media.",
                    "A Semi-supervised Framework with Efficient Feature Extraction and Network Alignment for User Identity Linkage.",
                    "Personality Traits Prediction Based on Sparse Digital Footprints via Discriminative Matrix Factorization.",
                    "A Reinforcement Learning Model for Influence Maximization in Social Networks.",
                    "A Multilevel Inference Mechanism for User Attributes over Social Networks.",
                    "Accurate Cardinality Estimation of Co-occurring Words Using Suffix Trees.",
                    "Shadow: Answering Why-Not Questions on Top-K Spatial Keyword Queries over Moving Objects.",
                    "DBL: Efficient Reachability Queries on Dynamic Graphs.",
                    "Towards Expectation-Maximization by SQL in RDBMS."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2021-3",
                "sub_name": "Database Systems for Advanced Applications - 26th International Conference, DASFAA 2021, Taipei, Taiwan, April 11-14, 2021, Proceedings, Part III.",
                "count": 54,
                "papers": [
                    "Gated Sequential Recommendation System with Social and Textual Information Under Dynamic Contexts.",
                    "SRecGAN: Pairwise Adversarial Training for Sequential Recommendation.",
                    "SSRGAN: A Generative Adversarial Network for Streaming Sequential Recommendation.",
                    "Topological Interpretable Multi-scale Sequential Recommendation.",
                    "SANS: Setwise Attentional Neural Similarity Method for Few-Shot Recommendation.",
                    "Semi-supervised Factorization Machines for Review-Aware Recommendation.",
                    "DCAN: Deep Co-Attention Network by Modeling User Preference and News Lifecycle for News Recommendation.",
                    "Considering Interaction Sequence of Historical Items for Conversational Recommender System.",
                    "Knowledge-Aware Hypergraph Neural Network for Recommender Systems.",
                    "Personalized Dynamic Knowledge-Aware Recommendation with Hybrid Explanations.",
                    "Graph Attention Collaborative Similarity Embedding for Recommender System.",
                    "Learning Disentangled User Representation Based on Controllable VAE for Recommendation.",
                    "DFCN: An Effective Feature Interactions Learning Model for Recommender Systems.",
                    "Tell Me Where to Go Next: Improving POI Recommendation via Conversation.",
                    "MISS: A Multi-user Identification Network for Shared-Account Session-Aware Recommendation.",
                    "VizGRank: A Context-Aware Visualization Recommendation Method Based on Inherent Relations Between Visualizations.",
                    "Deep User Representation Construction Model for Collaborative Filtering.",
                    "DiCGAN: A Dilated Convolutional Generative Adversarial Network for Recommender Systems.",
                    "RE-KGR: Relation-Enhanced Knowledge Graph Reasoning for Recommendation.",
                    "LGCCF: A Linear Graph Convolutional Collaborative Filtering with Social Influence.",
                    "Sirius: Sequential Recommendation with Feature Augmented Graph Neural Networks.",
                    "Combining Meta-path Instances into Layer-Wise Graphs for Recommendation.",
                    "GCAN: A Group-Wise Collaborative Adversarial Networks for Item Recommendation.",
                    "PEEP: A Parallel Execution Engine for Permissioned Blockchain Systems.",
                    "URIM: Utility-Oriented Role-Centric Incentive Mechanism Design for Blockchain-Based Crowdsensing.",
                    "PAS: Enable Partial Consensus in the Blockchain.",
                    "Redesigning the Sorting Engine for Persistent Memory.",
                    "ImputeRNN: Imputing Missing Values in Electronic Medical Records.",
                    "Susceptible Temporal Patterns Discovery for Electronic Health Records via Adversarial Attack.",
                    "A Decision Support System for Heart Failure Risk Prediction Based on Weighted Naive Bayes.",
                    "Inheritance-Guided Hierarchical Assignment for Clinical Automatic Diagnosis.",
                    "BPTree: An Optimized Index with Batch Persistence on Optane DC PM.",
                    "An Improved Dummy Generation Approach for Enhancing User Location Privacy.",
                    "LinkLouvain: Link-Aware A/B Testing and Its Application on Online Marketing Campaign.",
                    "An Enhanced Convolutional Inference Model with Distillation for Retrieval-Based QA.",
                    "Familia: A Configurable Topic Modeling Framework for Industrial Text Engineering.",
                    "Generating Personalized Titles Incorporating Advertisement Profile.",
                    "Parasitic Network: Zero-Shot Relation Extraction for Knowledge Graph Populating.",
                    "Graph Attention Networks for New Product Sales Forecasting in E-Commerce.",
                    "Transportation Recommendation with Fairness Consideration.",
                    "Constraint-Adaptive Rule Mining in Large Databases.",
                    "FedTopK: Top-K Queries Optimization over Federated RDF Systems.",
                    "Shopping Around: CoSurvey Helps You Make a Wise Choice.",
                    "IntRoute: An Integer Programming Based Approach for Best Bus Route Discovery.",
                    "NRCP-Miner: Towards the Discovery of Non-redundant Co-location Patterns.",
                    "ARCA: A Tool for Area Calculation Based on GPS Data.",
                    "LSTM Based Sentiment Analysis for Cryptocurrency Prediction.",
                    "SQL-Middleware: Enabling the Blockchain with SQL.",
                    "Loupe: A Visualization Tool for High-Level Execution Plans in SystemDS.",
                    "Algorithm Fairness Through Data Inclusion, Participation, and Reciprocity.",
                    "Performance Issues in Scheduling of Real-Time Transactions.",
                    "Semantic Integration of Heterogeneous and Complex Spreadsheet Tables.",
                    "Abstract Model for Multi-model Data.",
                    "User Preference Translation Model for Next Top-k Items Recommendation with Social Relations."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2021w",
                "sub_name": "Database Systems for Advanced Applications. DASFAA 2021 International Workshops - BDQM, GDMA, MLDLDSA, MobiSocial, and MUST, Taipei, Taiwan, April 11-14, 2021, Proceedings.",
                "count": 29,
                "papers": [
                    "ASQT: An Efficient Index for Queries on Compressed Trajectories.",
                    "ROPW: An Online Trajectory Compression Algorithm.",
                    "HTF: An Effective Algorithm for Time Series to Recover Missing Blocks.",
                    "LAA: Inductive Community Detection Algorithm Based on Label Aggregation.",
                    "Modeling and Querying Similar Trajectory in Inconsistent Spatial Data.",
                    "ESTI: Efficient k-Hop Reachability Querying over Large General Directed Graphs.",
                    "NREngine: A Graph-Based Query Engine for Network Reachability.",
                    "An Embedding-Based Approach to Repairing Question Semantics.",
                    "Hop-Constrained Subgraph Query and Summarization on Large Graphs.",
                    "Ad Click-Through Rate Prediction: A Survey.",
                    "An Attention-Based Approach to Rule Learning in Large Knowledge Graphs.",
                    "Multi-scale Gated Inpainting Network with Patch-Wise Spacial Attention.",
                    "An Improved CNNLSTM Algorithm for Automatic Detection of Arrhythmia Based on Electrocardiogram Signal.",
                    "Cross-Domain Text Classification Based on BERT Model.",
                    "Surface Defect Detection Method of Hot Rolling Strip Based on Improved SSD Model.",
                    "Continuous Keystroke Dynamics-Based User Authentication Using Modified Hausdorff Distance.",
                    "Deep Learning-Based Dynamic Community Discovery.",
                    "Deep Attributed Network Embedding Based on the PPMI.",
                    "Discovering Spatial Co-location Patterns with Dominant Influencing Features in Anomalous Regions.",
                    "Activity Organization Queries for Location-Aware Heterogeneous Information Network.",
                    "Combining Oversampling with Recurrent Neural Networks for Intrusion Detection.",
                    "Multi-head Attention with Hint Mechanisms for Joint Extraction of Entity and Relation.",
                    "Maximum (L, K)-Lasting Cores in Temporal Social Networks.",
                    "A Tablet-Based Game Tool for Cognition Training of Seniors with Mild Cognitive Impairment.",
                    "AntiPhiMBS-Auth: A New Anti-phishing Model to Mitigate Phishing Attacks in Mobile Banking System at Authentication Level.",
                    "BU-Trace: A Permissionless Mobile System for Privacy-Preserving Intelligent Contact Tracing.",
                    "A Novel Road Segment Representation Method for Travel Time Estimation.",
                    "Privacy Protection for Medical Image Management Based on Blockchain.",
                    "Approximate Nearest Neighbor Search Using Query-Directed Dense Graph."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "25th DASFAA 2020",
        "info": "Jeju, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2020-1",
                "sub_name": "Database Systems for Advanced Applications - 25th International Conference, DASFAA 2020, Jeju, South Korea, September 24-27, 2020, Proceedings, Part I.",
                "count": 54,
                "papers": [
                    "A Data-Driven Approach for GPS Trajectory Data Cleaning.",
                    "Heterogeneous Replicas for Multi-dimensional Data Management.",
                    "Latency-Aware Data Placements for Operational Cost Minimization of Distributed Data Centers.",
                    "Verify a Valid Message in Single Tuple: A Watermarking Technique for Relational Database.",
                    "WFApprox: Approximate Window Functions Processing.",
                    "BiSample: Bidirectional Sampling for Handling Missing Data with Local Differential Privacy.",
                    "PrivGMM: Probability Density Estimation with Local Differential Privacy.",
                    "A Progressive Approach for Computing the Earth Mover's Distance.",
                    "Predictive Transaction Scheduling for Alleviating Lock Thrashing.",
                    "Searchable Symmetric Encryption with Tunable Leakage Using Multiple Servers.",
                    "Completely Unsupervised Cross-Modal Hashing.",
                    "High Performance Design for Redis with Fast Event-Driven RDMA RPCs.",
                    "Efficient Source Selection for Error Detection via Matching Dependencies.",
                    "Dependency Preserved Raft for Transactions.",
                    "Adaptive Method for Discovering Service Provider in Cloud Composite Services.",
                    "Auction-Based Order-Matching Mechanisms to Maximize Social Welfare in Real-Time Ride-Sharing.",
                    "GDS: General Distributed Strategy for Functional Dependency Discovery Algorithms.",
                    "Efficient Group Processing for Multiple Reverse Top-k Geo-Social Keyword Queries.",
                    "C2TTE: Cross-city Transfer Based Model for Travel Time Estimation.",
                    "Migratable Paxos - Low Latency and High Throughput Consensus Under Geographically Shifting Workloads.",
                    "GDPC: A GPU-Accelerated Density Peaks Clustering Algorithm.",
                    "RS-store: A SkipList-Based Key-Value Store with Remote Direct Memory Access.",
                    "Balancing Exploration and Exploitation in the Memetic Algorithm via a Switching Mechanism for the Large-Scale VRPTW.",
                    "Game Recommendation Based on Dynamic Graph Convolutional Network.",
                    "From Code to Natural Language: Type-Aware Sketch-Based Seq2Seq Learning.",
                    "Coupled Graph Convolutional Neural Networks for Text-Oriented Clinical Diagnosis Inference.",
                    "Vector-Level and Bit-Level Feature Adjusted Factorization Machine for Sparse Prediction.",
                    "Cross-Lingual Transfer Learning for Medical Named Entity Recognition.",
                    "A Unified Adversarial Learning Framework for Semi-supervised Multi-target Domain Adaptation.",
                    "MTGCN: A Multitask Deep Learning Model for Traffic Flow Prediction.",
                    "SAEA: Self-Attentive Heterogeneous Sequence Learning Model for Entity Alignment.",
                    "TADNM: A Transportation-Mode Aware Deep Neural Model for Travel Time Estimation.",
                    "FedSel: Federated SGD Under Local Differential Privacy with Top-k Dimension Selection.",
                    "BiGCNN: Bidirectional Gated Convolutional Neural Network for Chinese Named Entity Recognition.",
                    "Dynamical User Intention Prediction via Multi-modal Learning.",
                    "Graph Convolutional Network Using a Reliability-Based Feature Aggregation Mechanism.",
                    "A Deep-Learning-Based Blocking Technique for Entity Linkage.",
                    "PersonaGAN: Personalized Response Generation via Generative Adversarial Networks.",
                    "Motif Discovery Using Similarity-Constraints Deep Neural Networks.",
                    "An Empirical Study on Bugs Inside TensorFlow.",
                    "Partial Multi-label Learning with Label and Feature Collaboration.",
                    "Optimal Trade Execution Based on Deep Deterministic Policy Gradient.",
                    "A Fast Automated Model Selection Approach Based on Collaborative Knowledge.",
                    "Attention with Long-Term Interval-Based Gated Recurrent Units for Modeling Sequential User Behaviors.",
                    "Latent Space Clustering via Dual Discriminator GAN.",
                    "Neural Pairwise Ranking Factorization Machine for Item Recommendation.",
                    "Reward-Modulated Adversarial Topic Modeling.",
                    "Link Inference via Heterogeneous Multi-view Graph Neural Networks.",
                    "SAST-GNN: A Self-Attention Based Spatio-Temporal Graph Neural Network for Traffic Prediction.",
                    "Enhancing Linear Time Complexity Time Series Classification with Hybrid Bag-Of-Patterns.",
                    "SentiMem: Attentive Memory Networks for Sentiment Classification in User Review.",
                    "AMTICS: Aligning Micro-clusters to Identify Cluster Structures.",
                    "Improved Representations for Personalized Document-Level Sentiment Classification.",
                    "Modeling Multi-aspect Relationship with Joint Learning for Aspect-Level Sentiment Classification."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2020-2",
                "sub_name": "Database Systems for Advanced Applications - 25th International Conference, DASFAA 2020, Jeju, South Korea, September 24-27, 2020, Proceedings, Part II.",
                "count": 48,
                "papers": [
                    "EPARS: Early Prediction of At-Risk Students with Online and Offline Learning Behaviors.",
                    "MRMRP: Multi-source Review-Based Model for Rating Prediction.",
                    "Discovering Real-Time Reachable Area Using Trajectory Connections.",
                    "Few-Shot Human Activity Recognition on Noisy Wearable Sensor Data.",
                    "Adversarial Generation of Target Review for Rating Prediction.",
                    "Hybrid Attention Based Neural Architecture for Text Semantics Similarity Measurement.",
                    "Instance Explainable Multi-instance Learning for ROI of Various Data.",
                    "Anomaly Detection in High-Dimensional Data Based on Autoregressive Flow.",
                    "Fine-Grained Entity Typing for Relation-Sparsity Entities.",
                    "Progressive Term Frequency Analysis on Large Text Collections.",
                    "Learning a Cost-Effective Strategy on Incomplete Medical Data.",
                    "Bus Frequency Optimization: When Waiting Time Matters in User Satisfaction.",
                    "Incorporating Boundary and Category Feature for Nested Named Entity Recognition.",
                    "Incorporating Concept Information into Term Weighting Schemes for Topic Models.",
                    "How to Generate Reasonable Texts with Controlled Attributes.",
                    "Keep You from Leaving: Churn Prediction in Online Games.",
                    "Point-of-Interest Demand Discovery Using Semantic Trajectories.",
                    "Learning from Heterogeneous Student Behaviors for Multiple Prediction Tasks.",
                    "A General Early-Stopping Module for Crowdsourced Ranking.",
                    "Guaranteed Delivery of Advertisements to Targeted Audiences Under Deduplication and Frequency Capping Constraints.",
                    "Efficient Parallel Cycle Search in Large Graphs.",
                    "Cross-Graph Representation Learning for Unsupervised Graph Alignment.",
                    "Predicting Hospital Readmission Using Graph Representation Learning Based on Patient and Disease Bipartite Graph.",
                    "Aspect-Level Attributed Network Embedding via Variational Graph Neural Networks.",
                    "Semantic Region Retrieval from Spatial RDF Data.",
                    "RE-GCN: Relation Enhanced Graph Convolutional Network for Entity Alignment in Heterogeneous Knowledge Graphs.",
                    "Efficient Graph Hierarchical Decomposition with User Engagement and Tie Strength.",
                    "Role-Oriented Graph Auto-encoder Guided by Structural Information.",
                    "Dynamic Graph Repartitioning: From Single Vertex to Vertex Group.",
                    "Modeling Heterogeneous Edges to Represent Networks with Graph Auto-Encoder.",
                    "AOT: Pushing the Efficiency Boundary of Main-Memory Triangle Listing.",
                    "Efficient Closeness Centrality Computation for Dynamic Graphs.",
                    "sf GQAsf RDF: A Graph-Based Approach Towards Efficient SPARQL Query Answering.",
                    "Efficient Closest Community Search over Large Graphs.",
                    "PDKE: An Efficient Distributed Embedding Framework for Large Knowledge Graphs.",
                    "Type Preserving Representation of Heterogeneous Information Networks.",
                    "Keyword Search over Federated RDF Systems.",
                    "Mutual Relation Detection for Complex Question Answering over Knowledge Graph.",
                    "DDSL: Efficient Subgraph Listing on Distributed and Dynamic Graphs.",
                    "DSP: Deep Sign Prediction in Signed Social Networks.",
                    "MinSR: Multi-level Interests Network for Session-Based Recommendation.",
                    "Efficient Core Maintenance of Dynamic Graphs.",
                    "Discovering Cliques in Signed Networks Based on Balance Theory.",
                    "Group Task Assignment with Social Impact-Based Preference in Spatial Crowdsourcing.",
                    "Finish Them on the Fly: An Incentive Mechanism for Real-Time Spatial Crowdsourcing.",
                    "An Evaluation of Modern Spatial Libraries.",
                    "Differentially Private Resource Auction in Distributed Spatial Crowdsourcing.",
                    "Spatial Dynamic Searchable Encryption with Forward Security."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2020-3",
                "sub_name": "Database Systems for Advanced Applications - 25th International Conference, DASFAA 2020, Jeju, South Korea, September 24-27, 2020, Proceedings, Part III.",
                "count": 59,
                "papers": [
                    "Sequential Multi-fusion Network for Multi-channel Video CTR Prediction.",
                    "Finding Attribute Diversified Communities in Complex Networks.",
                    "Business Location Selection Based on Geo-Social Networks.",
                    "SpEC: Sparse Embedding-Based Community Detection in Attributed Graphs.",
                    "MemTimes: Temporal Scoping of Facts with Memory Network.",
                    "Code2Text: Dual Attention Syntax Annotation Networks for Structure-Aware Code Translation.",
                    "Semantic Enhanced Top-k Similarity Search on Heterogeneous Information Networks.",
                    "STIM: Scalable Time-Sensitive Influence Maximization in Large Social Networks.",
                    "Unsupervised Hierarchical Feature Selection on Networked Data.",
                    "Aspect Category Sentiment Analysis with Self-Attention Fusion Networks.",
                    "A Partial Materialization-Based Approach to Scalable Query Answering in OWL 2 DL.",
                    "DeepQT : Learning Sequential Context for Query Execution Time Prediction.",
                    "DARS: Diversity and Distribution-Aware Region Search.",
                    "I/O Efficient Algorithm for c-Approximate Furthest Neighbor Search in High-Dimensional Space.",
                    "An Efficient Approximate Algorithm for Single-Source Discounted Hitting Time Query.",
                    "Path Query Processing Using Typical Snapshots in Dynamic Road Networks.",
                    "Dynamic Dimension Indexing for Efficient Skyline Maintenance on Data Streams.",
                    "SCALE: An Efficient Framework for Secure Dynamic Skyline Query Processing in the Cloud.",
                    "Authenticated Range Query Using SGX for Blockchain Light Clients.",
                    "Stargazing in the Dark: Secure Skyline Queries with SGX.",
                    "Increasing the Efficiency of GPU Bitmap Index Query Processing.",
                    "An Effective and Efficient Re-ranking Framework for Social Image Search.",
                    "HEGJoin: Heterogeneous CPU-GPU Epsilon Grids for Accelerated Distance Similarity Join.",
                    "String Joins with Synonyms.",
                    "Efficient Query Reverse Engineering Using Table Fragments.",
                    "Decentralized Embedding Framework for Large-Scale Networks.",
                    "SOLAR: Fusing Node Embeddings and Attributes into an Arbitrary Space.",
                    "Detection of Wrong Disease Information Using Knowledge-Based Embedding and Attention.",
                    "Tackling MeSH Indexing Dataset Shift with Time-Aware Concept Embedding Learning.",
                    "Semantic Disambiguation of Embedded Drug-Disease Associations Using Semantically Enriched Deep-Learning Approaches.",
                    "Heterogeneous Graph Embedding for Cross-Domain Recommendation Through Adversarial Learning.",
                    "Hierarchical Variational Attention for Sequential Recommendation.",
                    "Mutual Self Attention Recommendation with Gated Fusion Between Ratings and Reviews.",
                    "Modeling Periodic Pattern with Self-Attention Network for Sequential Recommendation.",
                    "Cross-Domain Recommendation with Adversarial Examples.",
                    "DDFL: A Deep Dual Function Learning-Based Model for Recommender Systems.",
                    "Zero-Injection Meets Deep Learning: Boosting the Accuracy of Collaborative Filtering in Top-N Recommendation.",
                    "DEAMER: A Deep Exposure-Aware Multimodal Content-Based Recommendation System.",
                    "Recurrent Convolution Basket Map for Diversity Next-Basket Recommendation.",
                    "Modeling Long-Term and Short-Term Interests with Parallel Attentions for Session-Based Recommendation.",
                    "Recommendation on Heterogeneous Information Network with Type-Sensitive Sampling.",
                    "Adaptive Loading Plan Decision Based upon Limited Transport Capacity.",
                    "Intention-Based Destination Recommendation in Navigation Systems.",
                    "Towards Accurate Retail Demand Forecasting Using Deep Neural Networks.",
                    "AuthQX: Enabling Authenticated Query over Blockchain via Intel SGX.",
                    "SuperQuery: Single Query Access Technique for Heterogeneous DBMS.",
                    "MDSE: Searching Multi-source Heterogeneous Material Data via Semantic Information Extraction.",
                    "BigARM: A Big-Data-Driven Airport Resource Management Engine and Application Tools.",
                    "S2AP: Sequential Senti-Weibo Analysis Platform.",
                    "An Efficient Secondary Index for Spatial Data Based on LevelDB.",
                    "A Trustworthy Evaluation System Based on Blockchain.",
                    "An Interactive System for Knowledge Graph Search.",
                    "STRATEGY: A Flexible Job-Shop Scheduling System for Large-Scale Complex Products.",
                    "Federated Acoustic Model Optimization for Automatic Speech Recognition.",
                    "EvsJSON: An Efficient Validator for Split JSON Documents.",
                    "GMDA: An Automatic Data Analysis System for Industrial Production.",
                    "An Intelligent Online Judge System for Programming Training.",
                    "WTPST: Waiting Time Prediction for Steel Logistical Queuing Trucks.",
                    "A System for Risk Assessment of Privacy Disclosure."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2020w",
                "sub_name": "Database Systems for Advanced Applications. DASFAA 2020 International Workshops - BDMS, SeCoP, BDQM, GDMA, and AIDE, Jeju, South Korea, September 24-27, 2020, Proceedings.",
                "count": 22,
                "papers": [
                    "Low Rank Communication for Federated Learning.",
                    "Question Answering over Knowledge Base with Symmetric Complementary Attention.",
                    "Supervised Learning for Human Action Recognition from Multiple Kinects.",
                    "Discovery of Chasing Patterns in Trajectory Data.",
                    "A Cloud-Based Platform for ECG Monitoring and Early Warning Using Big Data and Artificial Intelligence Technologies.",
                    "What Are MOOCs Learners' Concerns? Text Analysis of Reviews for Computer Science Courses.",
                    "A New Context-Aware Method Based on Hybrid Ranking for Community-Oriented Lexical Simplification.",
                    "Two-Level Convolutional Neural Network for Aspect Extraction.",
                    "Leveraging Statistic and Semantic Features for Similar Question Detection Using Fusion XGBoost.",
                    "Core Research Topics of Studies on Personalized Feedback in the Past Four Decades.",
                    "Maintenance Method of Logistics Vehicle Based on Data Science and Quality.",
                    "An Efficient and Metadata-Aware Big Data Storage Architecture.",
                    "Kernel Design of Intelligent Historical Database for Multi-objective Combustion Optimization.",
                    "Threshold Functional Dependencies for Time Series Data.",
                    "A Survey on Modularization of Chatbot Conversational Systems.",
                    "A Long Short-Term Memory Neural Network Model for Predicting Air Pollution Index Based on Popular Learning.",
                    "Domain Ontology Construction for Intelligent Anti-Telephone-Fraud Applications.",
                    "Improving Gaussian Embedding for Extracting Local Semantic Connectivity in Networks.",
                    "A Novel Shilling Attack Detection Method Based on T-Distribution over the Dynamic Time Intervals.",
                    "Long- and Short-Term Preference Model Based on Graph Embedding for Sequential Recommendation.",
                    "Event Detection on Literature by Utilizing Word Embedding.",
                    "User Sequential Behavior Classification for Click-Through Rate Prediction."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th DASFAA 2019",
        "info": "Chiang Mai, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2019-1",
                "sub_name": "Database Systems for Advanced Applications - 24th International Conference, DASFAA 2019, Chiang Mai, Thailand, April 22-25, 2019, Proceedings, Part I.",
                "count": 47,
                "papers": [
                    "Accelerating Real-Time Tracking Applications over Big Data Stream with Constrained Space.",
                    "A Frequency Scaling Based Performance Indicator Framework for Big Data Systems.",
                    "A Time-Series Sockpuppet Detection Method for Dynamic Social Relationships.",
                    "Accelerating Hybrid Transactional/Analytical Processing Using Consistent Dual-Snapshot.",
                    "HSDS: An Abstractive Model for Automatic Survey Generation.",
                    "PU-Shapelets: Towards Pattern-Based Positive Unlabeled Classification of Time Series.",
                    "Discovering Relationship Patterns Among Associated Temporal Event Sequences.",
                    "Efficient Mining of Event Periodicity in Data Series.",
                    "EPPADS: An Enhanced Phase-Based Performance-Aware Dynamic Scheduler for High Job Execution Performance in Large Scale Clusters.",
                    "Incremental Discovery of Order Dependencies on Tuple Insertions.",
                    "Multi-view Spectral Clustering via Multi-view Weighted Consensus and Matrix-Decomposition Based Discretization.",
                    "SIRCS: Slope-intercept-residual Compression by Correlation Sequencing for Multi-stream High Variation Data.",
                    "Fast Quorum-Based Log Replication and Replay for Fast Databases.",
                    "PDCS: A Privacy-Preserving Distinct Counting Scheme for Mobile Sensing.",
                    "Reinforced Reliable Worker Selection for Spatial Crowdsensing Networks.",
                    "SeqST-ResNet: A Sequential Spatial Temporal ResNet for Task Prediction in Spatial Crowdsourcing.",
                    "Towards Robust Arbitrarily Oriented Subspace Clustering.",
                    "Truthful Crowdsensed Data Trading Based on Reverse Auction and Blockchain.",
                    "Selective Matrix Factorization for Multi-relational Data Fusion.",
                    "Selectivity Estimation on Set Containment Search.",
                    "Typicality-Based Across-Time Mapping of Entity Sets in Document Archives.",
                    "Unsupervised Entity Alignment Using Attribute Triples and Relation Triples.",
                    "Combining Meta-Graph and Attention for Recommendation over Heterogenous Information Network.",
                    "Efficient Search of the Most Cohesive Co-located Community in Attributed Networks.",
                    "A Weighted Word Embedding Model for Text Classification.",
                    "Bipartite Network Embedding via Effective Integration of Explicit and Implicit Relations.",
                    "Enhancing Network Embedding with Implicit Clustering.",
                    "MDAL: Multi-task Dual Attention LSTM Model for Semi-supervised Network Embedding.",
                    "Net2Text: An Edge Labelling Language Model for Personalized Review Generation.",
                    "Understanding Information Diffusion via Heterogeneous Information Network Embeddings.",
                    "Distributed Parallel Structural Hole Detection on Big Graphs.",
                    "DynGraphGAN: Dynamic Graph Embedding via Generative Adversarial Networks.",
                    "Evaluating Mixed Patterns on Large Data Graphs Using Bitmap Views.",
                    "Heterogeneous Information Network Hashing for Fast Nearest Neighbor Search.",
                    "Learning Fine-Grained Patient Similarity with Dynamic Bayesian Network Embedded RNNs.",
                    "Towards Efficient k-TriPeak Decomposition on Large Graphs.",
                    "Evaluating the Choice of Tags in CQA Sites.",
                    "Fast Maximal Clique Enumeration for Real-World Graphs.",
                    "Leveraging Knowledge Graph Embeddings for Natural Language Question Answering.",
                    "Measuring Semantic Relatedness with Knowledge Association Network.",
                    "SINE: Side Information Network Embedding.",
                    "A Knowledge Graph Enhanced Topic Modeling Approach for Herb Recommendation.",
                    "Knowledge Base Error Detection with Relation Sensitive Embedding.",
                    "Leon: A Distributed RDF Engine for Multi-query Processing.",
                    "MathGraph: A Knowledge Graph for Automatically Solving Mathematical Exercises.",
                    "Multi-hop Path Queries over Knowledge Graphs with Neural Memory Networks.",
                    "Sentiment Classification by Leveraging the Shared Knowledge from a Sequence of Domains."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2019-2",
                "sub_name": "Database Systems for Advanced Applications - 24th International Conference, DASFAA 2019, Chiang Mai, Thailand, April 22-25, 2019, Proceedings, Part II.",
                "count": 45,
                "papers": [
                    "An Approach Based on Bayesian Networks for Query Selectivity Estimation.",
                    "An Exploration of Cross-Modal Retrieval for Unseen Concepts.",
                    "Continuous Patient-Centric Sequence Generation via Sequentially Coupled Adversarial Learning.",
                    "DMMAM: Deep Multi-source Multi-task Attention Model for Intensive Care Unit Diagnosis.",
                    "Learning k-Occurrence Regular Expressions with Interleaving.",
                    "Learning from User Social Relation for Document Sentiment Classification.",
                    "Reinforcement Learning to Diversify Top-N Recommendation.",
                    "Retweeting Prediction Using Matrix Factorization with Binomial Distribution and Contextual Information.",
                    "Sparse Gradient Compression for Distributed SGD.",
                    "STDR: A Deep Learning Method for Travel Time Estimation.",
                    "Using Fractional Latent Topic to Enhance Recurrent Neural Network in Text Similarity Modeling.",
                    "Efficiently Mining Maximal Diverse Frequent Itemsets.",
                    "Efficient Local Search for Minimum Dominating Sets in Large Graphs.",
                    "Multi-level Graph Compression for Fast Reachability Detection.",
                    "Multiple Privacy Regimes Mechanism for Local Differential Privacy.",
                    "Privacy Preserving Elastic Stream Processing with Clouds Using Homomorphic Encryption.",
                    "Select the Best for Me: Privacy-Preserving Polynomial Evaluation Algorithm over Road Network.",
                    "AdaCML: Adaptive Collaborative Metric Learning for Recommendation.",
                    "Adaptive Attention-Aware Gated Recurrent Unit for Sequential Recommendation.",
                    "Attention and Convolution Enhanced Memory Network for Sequential Recommendation.",
                    "Attention-Based Neural Tag Recommendation.",
                    "Density Matrix Based Preference Evolution Networks for E-Commerce Recommendation.",
                    "Multi-source Multi-net Micro-video Recommendation with Hidden Item Category Discovery.",
                    "Incorporating Task-Oriented Representation in Text Classification.",
                    "Music Playlist Recommendation with Long Short-Term Memory.",
                    "Online Collaborative Filtering with Implicit Feedback.",
                    "Subspace Ensemble-Based Neighbor User Searching for Neighborhood-Based Collaborative Filtering.",
                    "Towards both Local and Global Query Result Diversification.",
                    "Structured Spectral Clustering of PurTree Data.",
                    "Dynamic Stochastic Block Model with Scale-Free Characteristic for Temporal Complex Networks.",
                    "In Good Company: Efficient Retrieval of the Top-k Most Relevant Event-Partner Pairs.",
                    "Local Experts Finding Across Multiple Social Networks.",
                    "SBRNE: An Improved Unified Framework for Social and Behavior Recommendations with Network Embedding.",
                    "User Intention-Based Document Summarization on Heterogeneous Sentence Networks.",
                    "A Hierarchical Index Structure for Region-Aware Spatial Keyword Search with Edit Distance Constraint.",
                    "Collective POI Querying Based on Multiple Keywords and User Preference.",
                    "DPSCAN: Structural Graph Clustering Based on Density Peaks.",
                    "Efficient Processing of Spatial Group Preference Queries.",
                    "Reverse-Auction-Based Competitive Order Assignment for Mobile Taxi-Hailing Systems.",
                    "Top-K Spatio-Topic Query on Social Media Data.",
                    "A Frequency-Aware Spatio-Temporal Network for Traffic Flow Prediction.",
                    "Efficient Algorithms for Solving Aggregate Keyword Routing Problems.",
                    "Perceiving Topic Bubbles: Local Topic Detection in Spatio-Temporal Tweet Stream.",
                    "Real-Time Route Planning and Online Order Dispatch for Bus-Booking Platforms.",
                    "STL: Online Detection of Taxi Trajectory Anomaly Based on Spatial-Temporal Laws."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2019w",
                "sub_name": "Database Systems for Advanced Applications - 24th International Conference, DASFAA 2019, Chiang Mai, Thailand, April 22-25, 2019, Proceedings, Part III, and DASFAA 2019 International Workshops: BDMS, BDQM, and GDMA, Chiang Mai, Thailand, April 22-25, 2019, Proceedings.",
                "count": 91,
                "papers": [
                    "A Probabilistic Approach for Inferring Latent Entity Associations in Textual Web Contents.",
                    "UHRP: Uncertainty-Based Pruning Method for Anonymized Data Linear Regression.",
                    "Meta-path Based MiRNA-Disease Association Prediction.",
                    "Medical Question Retrieval Based on Siamese Neural Network and Transfer Learning Method.",
                    "An Adaptive Kalman Filter Based Ocean Wave Prediction Model Using Motion Reference Unit Data.",
                    "ASLM: Adaptive Single Layer Model for Learned Index.",
                    "SparseMAAC: Sparse Attention for Multi-agent Reinforcement Learning.",
                    "Identifying Reference Relationship of Desktop Files Based on Access Logs.",
                    "Visualization of Photo Album: Selecting a Representative Photo of a Specific Event.",
                    "Data Quality Management in Institutional Research Output Data Center.",
                    "Generalized Bayesian Structure Learning from Noisy Datasets.",
                    "ANDMC: An Algorithm for Author Name Disambiguation Based on Molecular Cross Clustering.",
                    "Graph Based Aspect Extraction and Rating Classification of Customer Review Data.",
                    "Streaming Massive Electric Power Data Analysis Based on Spark Streaming.",
                    "Deletion-Robust k-Coverage Queries.",
                    "Episodic Memory Network with Self-attention for Emotion Detection.",
                    "Detecting Suicidal Ideation with Data Protection in Online Communities.",
                    "Hierarchical Conceptual Labeling.",
                    "Anomaly Detection in Time-Evolving Attributed Networks.",
                    "A Multi-task Learning Framework for Automatic Early Detection of Alzheimer's.",
                    "Top-k Spatial Keyword Quer with Typicality and Semantics.",
                    "Align Reviews with Topics in Attention Network for Rating Prediction.",
                    "PSMSP: A Parallelized Sampling-Based Approach for Mining Top-k Sequential Patterns in Database Graphs.",
                    "Value-Oriented Ranking of Online Reviews Based on Reviewer-Influenced Graph.",
                    "Ancient Chinese Landscape Painting Composition Classification by Using Semantic Variational Autoencoder.",
                    "Learning Time-Aware Distributed Representations of Locations from Spatio-Temporal Trajectories.",
                    "Hyper2vec: Biased Random Walk for Hyper-network Embedding.",
                    "Privacy-Preserving and Dynamic Spatial Range Aggregation Query Processing in Wireless Sensor Networks.",
                    "Adversarial Discriminative Denoising for Distant Supervision Relation Extraction.",
                    "Nonnegative Spectral Clustering for Large-Scale Semi-supervised Learning.",
                    "Distributed PARAFAC Decomposition Method Based on In-memory Big Data System.",
                    "GPU-Accelerated Dynamic Graph Coloring.",
                    "Relevance-Based Entity Embedding.",
                    "An Iterative Map-Trajectory Co-optimisation Framework Based on Map-Matching and Map Update.",
                    "Exploring Regularity in Traditional Chinese Medicine Clinical Data Using Heterogeneous Weighted Networks Embedding.",
                    "AGREE: Attention-Based Tour Group Recommendation with Multi-modal Data.",
                    "Random Decision DAG: An Entropy Based Compression Approach for Random Forest.",
                    "Generating Behavior Features for Cold-Start Spam Review Detection.",
                    "TCL: Tensor-CNN-LSTM for Travel Time Prediction with Sparse Trajectory Data.",
                    "A Semi-supervised Classification Approach for Multiple Time-Varying Networks with Total Variation.",
                    "Multidimensional Skylines over Streaming Data.",
                    "A Domain Adaptation Approach for Multistream Classification.",
                    "Gradient Boosting Censored Regression for Winning Price Prediction in Real-Time Bidding.",
                    "Deep Sequential Multi-task Modeling for Next Check-in Time and Location Prediction.",
                    "SemiSync: Semi-supervised Clustering by Synchronization.",
                    "Neural Review Rating Prediction with Hierarchical Attentions and Latent Factors.",
                    "MVS-match: An Efficient Subsequence Matching Approach Based on the Series Synopsis.",
                    "Spatial-Temporal Recommendation for On-demand Cinemas.",
                    "Finding the Key Influences on the House Price by Finite Mixture Model Based on the Real Estate Data in Changchun.",
                    "Semi-supervised Clustering with Deep Metric Learning.",
                    "Spatial Bottleneck Minimum Task Assignment with Time-Delay.",
                    "A Mimic Learning Method for Disease Risk Prediction with Incomplete Initial Data.",
                    "Hospitalization Behavior Prediction Based on Attention and Time Adjustment Factors in Bidirectional LSTM.",
                    "Modeling Item Categories for Effective Recommendation.",
                    "Distributed Reachability Queries on Massive Graphs.",
                    "Edge-Based Shortest Path Caching in Road Networks.",
                    "Extracting Definitions and Hypernyms with a Two-Phase Framework.",
                    "Tag Recommendation by Word-Level Tag Sequence Modeling.",
                    "A New Statistics Collecting Method with Adaptive Strategy.",
                    "Word Sense Disambiguation with Massive Contextual Texts.",
                    "Learning DMEs from Positive and Negative Examples.",
                    "Serial and Parallel Recurrent Convolutional Neural Networks for Biomedical Named Entity Recognition.",
                    "DRGAN: A GAN-Based Framework for Doctor Recommendation in Chinese On-Line QA Communities.",
                    "Attention-Based Abnormal-Aware Fusion Network for Radiology Report Generation.",
                    "LearningTour: A Machine Learning Approach for Tour Recommendation Based on Users' Historical Travel Experience.",
                    "TF-Miner: Topic-Specific Facet Mining by Label Propagation.",
                    "Fast Raft Replication for Transactional Database Systems over Unreliable Networks.",
                    "Parallelizing Big De Bruijn Graph Traversal for Genome Assembly on GPU Clusters.",
                    "GScan: Exploiting Sequential Scans for Subgraph Matching.",
                    "SIMD Accelerates the Probe Phase of Star Joins in Main Memory Databases.",
                    "A Deep Recommendation Model Incorporating Adaptive Knowledge-Based Representations.",
                    "BLOMA: Explain Collaborative Filtering via Boosted Local Rank-One Matrix Approximation.",
                    "Spatiotemporal-Aware Region Recommendation with Deep Metric Learning.",
                    "On the Impact of the Length of Subword Vectors on Word Embeddings.",
                    "Using Dilated Residual Network to Model Distantly Supervised Relation Extraction.",
                    "Modeling More Globally: A Hierarchical Attention Network via Multi-Task Learning for Aspect-Based Sentiment Analysis.",
                    "A Scalable Sparse Matrix-Based Join for SPARQL Query Processing.",
                    "Change Point Detection for Streaming High-Dimensional Time Series.",
                    "Distributed Query Engine for Multiple-Query Optimization over Data Stream.",
                    "Adding Value by Combining Business and Sensor Data: An Industry 4.0 Use Case.",
                    "AgriKG: An Agricultural Knowledge Graph and Its Applications.",
                    "KGVis: An Interactive Visual Query Language for Knowledge Graphs.",
                    "OperaMiner: Extracting Character Relations from Opera Scripts Using Deep Neural Networks.",
                    "GparMiner: A System to Mine Graph Pattern Association Rules.",
                    "A Data Publishing System Based on Privacy Preservation.",
                    "Privacy as a Service: Publishing Data and Models.",
                    "Dynamic Bus Route Adjustment Based on Hot Bus Stop Pair Extraction.",
                    "DHDSearch: A Framework for Batch Time Series Searching on MapReduce.",
                    "Bus Stop Refinement Based on Hot Spot Extraction.",
                    "Adaptive Transaction Scheduling for Highly Contended Workloads.",
                    "IMOptimizer: An Online Interactive Parameter Optimization System Based on Big Data."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd DASFAA 2018",
        "info": "Gold Coast, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2018-1",
                "sub_name": "Database Systems for Advanced Applications - 23rd International Conference, DASFAA 2018, Gold Coast, QLD, Australia, May 21-24, 2018, Proceedings, Part I.",
                "count": 60,
                "papers": [
                    "Enhancing Network Embedding with Auxiliary Information: An Explicit Matrix Factorization Perspective.",
                    "Attributed Network Embedding with Micro-meso Structure.",
                    "An Efficient Exact Nearest Neighbor Search by Compounded Embedding.",
                    "BASSI: Balance and Status Combined Signed Network Embedding.",
                    "Geographical Relevance Model for Long Tail Point-of-Interest Recommendation.",
                    "Exploiting Context Graph Attention for POI Recommendation in Location-Based Social Networks.",
                    "Restricted Boltzmann Machine Based Active Learning for Sparse Recommendation.",
                    "Discrete Binary Hashing Towards Efficient Fashion Recommendation.",
                    "Learning Dual Preferences with Non-negative Matrix Tri-Factorization for Top-N Recommender System.",
                    "Low-Rank and Sparse Cross-Domain Recommendation Algorithm.",
                    "Cross-Domain Recommendation for Cold-Start Users via Neighborhood Based Feature Mapping.",
                    "K-Connected Cores Computation in Large Dual Networks.",
                    "Graph Clustering with Local Density-Cut.",
                    "External Topological Sorting in Large Graphs.",
                    "Finding All Nearest Neighbors with a Single Graph Traversal.",
                    "Towards Efficient Path Skyline Computation in Bicriteria Networks.",
                    "Answering Why-Not Questions on Structural Graph Clustering.",
                    "SSRW: A Scalable Algorithm for Estimating Graphlet Statistics Based on Random Walk.",
                    "Multi-metric Graph Query Performance Prediction.",
                    "A Privacy-Preserving Framework for Subgraph Pattern Matching in Cloud.",
                    "Adaptive and Parallel Data Acquisition from Online Big Graphs.",
                    "Answering the Why-Not Questions of Graph Query Autocompletion.",
                    "Exploiting Reshaping Subgraphs from Bilateral Propagation Graphs.",
                    "Sample Location Selection for Efficient Distance-Aware Influence Maximization in Geo-Social Networks.",
                    "Identifying Topical Opinion Leaders in Social Community Question Answering.",
                    "Personalized Geo-Social Group Queries in Location-Based Social Networks.",
                    "Tracking Dynamic Magnet Communities: Insights from a Network Perspective.",
                    "Discovering Strong Communities with User Engagement and Tie Strength.",
                    "Functional-Oriented Relationship Strength Estimation: From Online Events to Offline Interactions.",
                    "Incremental and Adaptive Topic Detection over Social Media.",
                    "Incorporating User Grouping into Retweeting Behavior Modeling.",
                    "Maximizing Social Influence for the Awareness Threshold Model.",
                    "A Time-Aware Path-Based Publish/Subscribe Framework.",
                    "Direction Recovery in Undirected Social Networks Based on Community Structure and Popularity.",
                    "Detecting Top-k Active Inter-Community Jumpers in Dynamic Information Networks.",
                    "Distributed In-Memory Analytics for Big Temporal Data.",
                    "Scalable Active Constrained Clustering for Temporal Data.",
                    "Nearest Subspace with Discriminative Regularization for Time Series Classification.",
                    "Efficient Approximate Subsequence Matching Using Hybrid Signatures.",
                    "MDTK: Bandwidth-Saving Framework for Distributed Top-k Similar Trajectory Query.",
                    "Modeling Travel Behavior Similarity with Trajectory Embedding.",
                    "MaxBRkNN Queries for Streaming Geo-Data.",
                    "Free-Rider Episode Screening via Dual Partition Model.",
                    "Maximize Spatial Influence of Facility Bundle Considering Reverse k Nearest Neighbors.",
                    "A Road-Aware Neural Network for Multi-step Vehicle Trajectory Prediction.",
                    "Secure Data Aggregation with Integrity Verification in Wireless Sensor Networks.",
                    "A Parallel Spatial Co-location Pattern Mining Approach Based on Ordered Clique Growth.",
                    "Multi-query Optimization in Federated RDF Systems.",
                    "Distributed Efficient Provenance-Aware Regular Path Queries on Large RDF Graphs.",
                    "Discovering Graph Patterns for Fact Checking in Knowledge Graphs.",
                    "KAT: Keywords-to-SPARQL Translation Over RDF Graphs.",
                    "A Scalable Framework for Stylometric Analysis of Multi-author Documents.",
                    "Is a Common Phrase an Entity Mention or Not? Dual Representations for Domain-Specific Named Entity Recognition.",
                    "Recognizing Textual Entailment with Attentive Reading and Writing Operations.",
                    "Interpreting Fine-Grained Categories from Natural Language Queries of Entity Search.",
                    "Improving Short Text Modeling by Two-Level Attention Networks for Sentiment Classification.",
                    "Efficient and Scalable Mining of Frequent Subgraphs Using Distributed Graph Processing Systems.",
                    "Efficient Infrequent Itemset Mining Using Depth-First and Top-Down Lattice Traversal.",
                    "Online Subset Topic Modeling for Interactive Documents Exploration.",
                    "Main Point Generator: Summarizing with a Focus."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2018-2",
                "sub_name": "Database Systems for Advanced Applications - 23rd International Conference, DASFAA 2018, Gold Coast, QLD, Australia, May 21-24, 2018, Proceedings, Part II.",
                "count": 57,
                "papers": [
                    "Personalized Prescription for Comorbidity.",
                    "Modeling Patient Visit Using Electronic Medical Records for Cost Profile Estimation.",
                    "Learning the Representation of Medical Features for Clinical Pathway Analysis.",
                    "Domain Supervised Deep Learning Framework for Detecting Chinese Diabetes-Related Topics.",
                    "Publishing Graph Node Strength Histogram with Edge Differential Privacy.",
                    "PrivTS: Differentially Private Frequent Time-Constrained Sequential Pattern Mining.",
                    "Secure Range Query over Encrypted Data in Outsourced Environments.",
                    "TRQED: Secure and Fast Tree-Based Private Range Queries over Encrypted Cloud.",
                    "iExplore: Accelerating Exploratory Data Analysis by Predicting User Intention.",
                    "Coverage-Oriented Diversification of Keyword Search Results on Graphs.",
                    "Novel Approaches to Accelerating the Convergence Rate of Markov Decision Process for Search Result Diversification.",
                    "Structures or Texts? A Dynamic Gating Method for Expert Finding in CQA Services.",
                    "Collusion-Resistant Processing of SQL Range Predicates.",
                    "Interactive Transaction Processing for In-Memory Database System.",
                    "An Adaptive Eviction Framework for Anti-caching Based In-Memory Databases.",
                    "Efficient Complex Social Event-Participant Planning Based on Heuristic Dynamic Programming.",
                    "Repairing Data Violations with Order Dependencies.",
                    "Multi-Worker-Aware Task Planning in Real-Time Spatial Crowdsourcing.",
                    "MT-MCD: A Multi-task Cognitive Diagnosis Framework for Student Assessment.",
                    "Towards Adaptive Sensory Data Fusion for Detecting Highway Traffic Conditions in Real Time.",
                    "On the Interaction of Functional and Inclusion Dependencies with Independence Atoms.",
                    "Source Selection for Inconsistency Detection.",
                    "Effective Solution for Labeling Candidates with a Proper Ration for Efficient Crowdsourcing.",
                    "Handling Unreasonable Data in Negative Surveys.",
                    "Multi-view Proximity Learning for Clustering.",
                    "Extracting Label Importance Information for Multi-label Classification.",
                    "Exploiting Instance Relationship for Effective Extreme Multi-label Learning.",
                    "Exploiting Ranking Consistency Principle in Representation Learning for Location Promotion.",
                    "Patent Quality Valuation with Deep Learning Models.",
                    "Learning Distribution-Matched Landmarks for Unsupervised Domain Adaptation.",
                    "Factorization Meets Memory Network: Learning to Predict Activity Popularity.",
                    "Representation Learning for Large-Scale Dynamic Networks.",
                    "Multi-view Discriminative Learning via Joint Non-negative Matrix Factorization.",
                    "Efficient Discovery of Embedded Patterns from Large Attributed Trees.",
                    "Classification Learning from Private Data in Heterogeneous Settings.",
                    "Fusing Satellite Data and Urban Data for Business Location Selection: A Neural Approach.",
                    "Index and Retrieve Multimedia Data: Cross-Modal Hashing by Learning Subspace Relation.",
                    "Deep Sparse Informative Transfer SoftMax for Cross-Domain Image Classification.",
                    "Sitcom-Stars Oriented Video Advertising via Clothing Retrieval.",
                    "Efficient Snapshot Isolation in Paxos-Replicated Database Systems.",
                    "Proof of Reputation: A Reputation-Based Consensus Protocol for Peer-to-Peer Network.",
                    "Incremental Materialized View Maintenance on Distributed Log-Structured Merge-Tree.",
                    "CDSFM: A Circular Distributed SGLD-Based Factorization Machines.",
                    "An Industrial-Scale System for Heterogeneous Information Card Ranking in Alipay.",
                    "A Twin-Buffer Scheme for High-Throughput Logging.",
                    "Qualitative Instead of Quantitative: Towards Practical Data Analysis Under Differential Privacy.",
                    "Client Churn Prediction with Call Log Analysis.",
                    "Unpack Local Model Interpretation for GBDT.",
                    "Cost-Sensitive Churn Prediction in Fund Management Services.",
                    "A Movie Search System with Natural Language Queries.",
                    "EventSys: Tracking Event Evolution on Microblogging Platforms.",
                    "AdaptMX: Flexible Join-Matrix Streaming System for Distributed Theta-Joins.",
                    "A System for Spatial-Temporal Trajectory Data Integration and Representation.",
                    "SLIND: Identifying Stable Links in Online Social Networks.",
                    "MusicRoBot: Towards Conversational Context-Aware Music Recommender System.",
                    "HDUMP: A Data Recovery Tool for Hadoop.",
                    "Modeling and Evaluating MID1 ICAL Pipeline on Spark."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2018w",
                "sub_name": "Database Systems for Advanced Applications - DASFAA 2018 International Workshops: BDMS, BDQM, GDMA, and SeCoP, Gold Coast, QLD, Australia, May 21-24, 2018, Proceedings.",
                "count": 23,
                "papers": [
                    "Convolutional Neural Networks for Text Classification with Multi-size Convolution and Multi-type Pooling.",
                    "Schema-Driven Performance Evaluation for Highly Concurrent Scenarios.",
                    "Time-Based Trajectory Data Partitioning for Efficient Range Query.",
                    "Evaluating Review's Quality Based on Review Content and Reviewer's Expertise.",
                    "Tensor Factorization Based POI Category Inference.",
                    "ALO-DM: A Smart Approach Based on Ant Lion Optimizer with Differential Mutation Operator in Big Data Analytics.",
                    "A High Precision Recommendation Algorithm Based on Combination Features.",
                    "Secure Computation of Pearson Correlation Coefficients for High-Quality Data Analytics.",
                    "Enabling Temporal Reasoning for Fact Statements: A Web-Based Approach.",
                    "Time Series Cleaning Under Variance Constraints.",
                    "Entity Resolution in Big Data Era: Challenges and Applications.",
                    "Filtering Techniques for Regular Expression Matching in Strings.",
                    "Extracting Schemas from Large Graphs with Utility Function and Parallelization.",
                    "FedQL: A Framework for Federated Queries Processing on RDF Stream and Relational Data.",
                    "A Comprehensive Study for Essentiality of Graph Based Distributed SPARQL Query Processing.",
                    "Developing Knowledge-Based Systems Using Data Mining Techniques for Advising Secondary School Students in Field of Interest Selection.",
                    "Template-Based SPARQL Query and Visualization on Knowledge Graphs.",
                    "A Corpus-Based Study on Collocation and Semantic Prosody in China's English Media: The Case of the Verbs of Publicity.",
                    "Location Dependent Information System's Queries for Mobile Environment.",
                    "Shapelets-Based Intrusion Detection for Protection Traffic Flooding Attacks.",
                    "Tuple Reconstruction.",
                    "A Cost-Sensitive Loss Function for Machine Learning.",
                    "Top-N Trustee Recommendation with Binary User Trust Feedback."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22. DASFAA 2017",
        "info": "Suzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2017-1",
                "sub_name": "Database Systems for Advanced Applications - 22nd International Conference, DASFAA 2017, Suzhou, China, March 27-30, 2017, Proceedings, Part I.",
                "count": 41,
                "papers": [
                    "A General Fine-Grained Truth Discovery Approach for Crowdsourced Data Aggregation.",
                    "Learning the Structures of Online Asynchronous Conversations.",
                    "A Question Routing Technique Using Deep Neural Network for Communities of Question Answering.",
                    "Category-Level Transfer Learning from Knowledge Base to Microblog Stream for Accurate Event Detection.",
                    "AngleCut: A Ring-Based Hashing Scheme for Distributed Metadata Management.",
                    "An Efficient Bulk Loading Approach of Secondary Index in Distributed Log-Structured Data Stores.",
                    "Performance Comparison of Distributed Processing of Large Volume of Data on Top of Xen and Docker-Based Virtual Clusters.",
                    "An Adaptive Data Partitioning Scheme for Accelerating Exploratory Spark SQL Queries.",
                    "Semi-Supervised Network Embedding.",
                    "CirE: Circular Embeddings of Knowledge Graphs.",
                    "PPNE: Property Preserving Network Embedding.",
                    "HINE: Heterogeneous Information Network Embedding.",
                    "DT-KST: Distributed Top-k Similarity Query on Big Trajectory Streams.",
                    "A Distributed Multi-level Composite Index for KNN Processing on Long Time Series.",
                    "Outlier Trajectory Detection: A Trajectory Analytics Based Approach.",
                    "Clustering Time Series Utilizing a Dimension Hierarchical Decomposition Approach.",
                    "Fast Extended One-Versus-Rest Multi-label SVM Classification Algorithm Based on Approximate Extreme Points.",
                    "Efficiently Discovering Most-Specific Mixed Patterns from Large Data Trees.",
                    "Max-Cosine Matching Based Neural Models for Recognizing Textual Entailment.",
                    "An Intelligent Field-Aware Factorization Machine Model.",
                    "Beyond Skylines: Explicit Preferences.",
                    "Optimizing Window Aggregate Functions in Relational Database Systems.",
                    "Query Optimization on Hybrid Storage.",
                    "Efficient Batch Grouping in Relational Datasets.",
                    "Memory-Enhanced Latent Semantic Model: Short Text Understanding for Sentiment Analysis.",
                    "Supervised Intensive Topic Models for Emotion Detection over Short Text.",
                    "Leveraging Pattern Associations for Word Embedding Models.",
                    "Multi-Granularity Neural Sentence Model for Measuring Short Text Similarity.",
                    "Leveraging Kernel Incorporated Matrix Factorization for Smartphone Application Recommendation.",
                    "Preference Integration in Context-Aware Recommendation.",
                    "Jointly Modeling Heterogeneous Temporal Properties in Location Recommendation.",
                    "Location-Aware News Recommendation Using Deep Localized Semantic Analysis.",
                    "Review-Based Cross-Domain Recommendation Through Joint Tensor Factorization.",
                    "A Local-Clustering-Based Personalized Differential Privacy Framework for User-Based Collaborative Filtering.",
                    "Fast Multi-dimensional Range Queries on Encrypted Cloud Databases.",
                    "When Differential Privacy Meets Randomized Perturbation: A Hybrid Approach for Privacy-Preserving Recommender System.",
                    "Supporting Cost-Efficient Multi-tenant Database Services with Service Level Objectives (SLOs).",
                    "Recovering Missing Values from Corrupted Spatio-Temporal Sensory Data via Robust Low-Rank Tensor Completion.",
                    "Group-Level Influence Maximization with Budget Constraint.",
                    "Correlating Stressor Events for Social Network Based Adolescent Stress Prediction.",
                    "Emotion Detection in Online Social Network Based on Multi-label Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2017-2",
                "sub_name": "Database Systems for Advanced Applications - 22nd International Conference, DASFAA 2017, Suzhou, China, March 27-30, 2017, Proceedings, Part II.",
                "count": 45,
                "papers": [
                    "HIMM: An HMM-Based Interactive Map-Matching System.",
                    "HyMU: A Hybrid Map Updating Framework.",
                    "Multi-objective Spatial Keyword Query with Semantics.",
                    "RSkycube: Efficient Skycube Computation by Reusing Principle.",
                    "Similarity Search Combining Query Relaxation and Diversification.",
                    "An Unsupervised Approach for Low-Quality Answer Detection in Community Question-Answering.",
                    "Approximate OLAP on Sustained Data Streams.",
                    "Hierarchical Semantic Representations of Online News Comments for Emotion Tagging Using Multiple Information Sources.",
                    "Towards a Query-Less News Search Framework on Twitter.",
                    "Semantic Definition Ranking.",
                    "An Improved Approach for Long Tail Advertising in Sponsored Search.",
                    "Locating Longest Common Subsequences with Limited Penalty.",
                    "Top-k String Auto-Completion with Synonyms.",
                    "Efficient Regular Expression Matching on Compressed Strings.",
                    "Mining Top-k Distinguishing Temporal Sequential Patterns from Event Sequences.",
                    "Soft Quorums: A High Availability Solution for Service Oriented Stream Systems.",
                    "StroMAX: Partitioning-Based Scheduler for Real-Time Stream Processing System.",
                    "Partition-Based Clustering with Sliding Windows for Data Streams.",
                    "CBP: A New Parallelization Paradigm for Massively Distributed Stream Processing.",
                    "Measuring and Maximizing Influence via Random Walk in Social Activity Networks.",
                    "Adaptive Overlapping Community Detection with Bayesian NonNegative Matrix Factorization.",
                    "A Unified Approach for Learning Expertise and Authority in Digital Libraries.",
                    "Efficient Local Clustering Coefficient Estimation in Massive Graphs.",
                    "Efficient Processing of Growing Temporal Graphs.",
                    "Effective k-Vertex Connected Component Detection in Large-Scale Networks.",
                    "Efficient Landmark-Based Candidate Generation for kNN Queries on Road Networks.",
                    "MinSum Based Optimal Location Query in Road Networks.",
                    "Efficiently Mining High Utility Co-location Patterns from Spatial Data Sets with Instance-Specific Utilities.",
                    "Supporting Real-Time Analytic Queries in Big and Fast Data Environments.",
                    "Boosting Moving Average Reversion Strategy for Online Portfolio Selection: A Meta-learning Approach.",
                    "Continuous Summarization over Microblog Threads.",
                    "Drawing Density Core-Sets from Incomplete Relational Data.",
                    "Co-training an Improved Recurrent Neural Network with Probability Statistic Models for Named Entity Recognition.",
                    "EtherQL: A Query Layer for Blockchain System.",
                    "Optimizing Scalar User-Defined Functions in In-Memory Column-Store Database Systems.",
                    "GPS-Simulated Trajectory Detection.",
                    "Predicting Academic Performance via Semi-supervised Learning with Constructed Campus Social Network.",
                    "Social User Profiling: A Social-Aware Topic Modeling Perspective.",
                    "Cost-Effective Data Partition for Distributed Stream Processing System.",
                    "A Graph-Based Push Service Platform.",
                    "Edge Influence Computation in Dynamic Graphs.",
                    "DKGBuilder: An Architecture for Building a Domain Knowledge Graph from Scratch.",
                    "CLTR: Collectively Linking Temporal Records Across Heterogeneous Sources.",
                    "PhenomenaAssociater: Linking Multi-domain Spatio-Temporal Datasets.",
                    "VisDM-A Data Stream Visualization Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2017w",
                "sub_name": "Database Systems for Advanced Applications - DASFAA 2017 International Workshops: BDMS, BDQM, SeCoP, and DMMOOC, Suzhou, China, March 27-30, 2017, Proceedings.",
                "count": 37,
                "papers": [
                    "Automatically Classify Chinese Judgment Documents Utilizing Machine Learning Algorithms.",
                    "A Partitioning Scheme for Big Dynamic Trees.",
                    "Optimization Factor Analysis of Large-Scale Join Queries on Different Platforms.",
                    "Which Mapping Service Should We Select in China?",
                    "An Online Prediction Framework for Dynamic Service-Generated QoS Big Data.",
                    "Discovering Interesting Co-location Patterns Interactively Using Ontologies.",
                    "LFLogging: A Latch-Free Logging Scheme for PCM-Based Big Data Management Systems.",
                    "RTMatch: Real-Time Location Prediction Based on Trajectory Pattern Matching.",
                    "Online Formation of Large Tree-Structured Team.",
                    "Cell-Based DBSCAN Algorithm Using Minimum Bounding Rectangle Criteria.",
                    "Time-Aware and Topic-Based Reviewer Assignment.",
                    "Adaptive Bayesian Network Structure Learning from Big Datasets.",
                    "A Novel Approach for Author Name Disambiguation Using Ranking Confidence.",
                    "Capture Missing Values with Inference on Knowledge Base.",
                    "Weakly-Supervised Named Entity Extraction Using Word Representations.",
                    "RDF Data Assessment Based on Metrics and Improved PageRank Algorithm.",
                    "Efficient Web-Based Data Imputation with Graph Model.",
                    "A New Schema Design Method for Multi-tenant Database.",
                    "Reader's Choice - A Recommendation Platform.",
                    "Accelerating Convolutional Neural Networks Using Fine-Tuned Backpropagation Progress.",
                    "A Personalized Learning Strategy Recommendation Approach for Programming Learning.",
                    "Wikipedia Based Short Text Classification Method.",
                    "An Efficient Boolean Expression Index by Compression.",
                    "MOOCon: A Framework for Semi-supervised Concept Extraction from MOOC Content.",
                    "What Decides the Dropout in MOOCs?",
                    "Exploring N-gram Features in Clickstream Data for MOOC Learning Achievement Prediction.",
                    "Predicting Student Examinee Rate in Massive Open Online Courses.",
                    "Task Assignment of Peer Grading in MOOCs.",
                    "Predicting Honors Student Performance Using RBFNN and PCA Method.",
                    "DKG: An Expanded Knowledge Base for Online Course.",
                    "Towards Economic Models for MOOC Pricing Strategy Design.",
                    "Using Pull-Based Collaborative Development Model in Software Engineering Courses: A Case Study.",
                    "A Method of Constructing the Mapping Knowledge Domains in Chinese Based on the MOOCs.",
                    "Social Friendship-Aware Courses Arrangement on MOOCs.",
                    "Quality-Aware Crowdsourcing Curriculum Recommendation in MOOCs.",
                    "Crowdsourcing Based Teaching Assistant Arrangement for MOOC.",
                    "Quantitative Analysis of Learning Data in a Programming Course."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21. DASFAA 2016",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2016-1",
                "sub_name": "Database Systems for Advanced Applications - 21st International Conference, DASFAA 2016, Dallas, TX, USA, April 16-19, 2016, Proceedings, Part I.",
                "count": 33,
                "papers": [
                    "Cost Minimization and Social Fairness for Spatial Crowdsourcing Tasks.",
                    "Crowdsourced Query Processing on Microblogs.",
                    "Effective Result Inference for Context-Sensitive Tasks in Crowdsourcing.",
                    "CrowdAidRepair: A Crowd-Aided Interactive Data Repairing Method.",
                    "Crowdsourcing-Enhanced Missing Values Imputation Based on Bayesian Network.",
                    "One-Pass Inconsistency Detection Algorithms for Big Data.",
                    "Domain-Specific Entity Linking via Fake Named Entity Detection.",
                    "CTextEM: Using Consolidated Textual Data for Entity Matching.",
                    "Entity Matching Across Multiple Heterogeneous Data Sources.",
                    "Probabilistic Maximal Frequent Itemset Mining Over Uncertain Databases.",
                    "Anytime OPTICS: An Efficient Approach for Hierarchical Density-Based Clustering.",
                    "Efficiently Mining Homomorphic Patterns from Large Data Trees.",
                    "CITPM: A Cluster-Based Iterative Topical Phrase Mining Framework.",
                    "Deep Convolutional Neural Network Based Regression Approach for Estimation of Remaining Useful Life.",
                    "Multiple-Instance Learning with Evolutionary Instance Selection.",
                    "Exploiting Human Mobility Patterns for Gas Station Site Selection.",
                    "Exploring the Procrastination of College Students: A Data-Driven Behavioral Perspective.",
                    "Joint User Attributes and Item Category in Factor Models for Rating Prediction.",
                    "Expert Recommendation in Time-Sensitive Online Shopping.",
                    "Temporal Recommendation via Modeling Dynamic Interests with Inverted-U-Curves.",
                    "Point-Of-Interest Recommendation Using Temporal Orientations of Users and Locations.",
                    "TGTM: Temporal-Geographical Topic Model for Point-of-Interest Recommendation.",
                    "Modeling User Mobility via User Psychological and Geographical Behaviors Towards Point of-Interest Recommendation.",
                    "Local Weighted Matrix Factorization for Implicit Feedback Datasets.",
                    "Exploring the Choice Under Conflict for Social Event Participation.",
                    "PBA: Partition and Blocking Based Alignment for Large Knowledge Bases.",
                    "Knowledge Graph Completion via Local Semantic Contexts.",
                    "Cross-Lingual Type Inference.",
                    "Benchmarking Semantic Capabilities of Analogy Querying Algorithms.",
                    "Deep Learning Based Topic Identification and Categorization: Mining Diabetes-Related Topics on Chinese Health Websites.",
                    "An Adaptive Approach of Approximate Substring Matching.",
                    "Joint Probability Consistent Relation Analysis for Document Representation.",
                    "Automated Table Understanding Using Stub Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2016-2",
                "sub_name": "Database Systems for Advanced Applications - 21st International Conference, DASFAA 2016, Dallas, TX, USA, April 16-19, 2016, Proceedings, Part II.",
                "count": 28,
                "papers": [
                    "When Peculiarity Makes a Difference: Object Characterisation in Heterogeneous Information Networks.",
                    "STH-Bass: A Spatial-Temporal Heterogeneous Bass Model to Predict Single-Tweet Popularity.",
                    "Closeness and Structure of Friends Help to Estimate User Locations.",
                    "Efficient Influence Maximization in Weighted Independent Cascade Model.",
                    "ListMerge: Accelerating Top-k Aggregation Queries Over Large Number of Lists.",
                    "Approximate Iceberg Cube on Heterogeneous Dimensions.",
                    "Pre-computed Region Guardian Sets Based Reverse kNN Queries.",
                    "HaCube: Extending MapReduce for Efficient OLAP Cube Materialization and View Maintenance.",
                    "TSCluWin: Trajectory Stream Clustering over Sliding Window.",
                    "On Efficient Spatial Keyword Querying with Semantics.",
                    "Approximation-Based Efficient Query Processing with the Earth Mover's Distance.",
                    "Effective Similarity Search on Indoor Moving-Object Trajectories.",
                    "Towards Neighborhood Window Analytics over Large-Scale Graphs.",
                    "Bitruss Decomposition of Bipartite Graphs.",
                    "An I/O-Efficient Buffer Batch Replacement Policy for Update-Intensive Graph Databases.",
                    "Parallelizing Maximal Clique Enumeration Over Graph Data.",
                    "Hyrise-NV: Instant Recovery for In-Memory Databases Using Non-Volatile Memory.",
                    "Triangle-Based Representative Possible Worlds of Uncertain Graphs.",
                    "Efficient Query Processing with Mutual Privacy Protection for Location-Based Services.",
                    "Semantic-Aware Location Privacy Preservation on Road Networks.",
                    "An Efficient Location-Aware Top-k Subscription Matching for Publish/Subscribe with Boolean Expressions.",
                    "Predicting the Popularity of DanMu-enabled Videos: A Multi-factor View.",
                    "Integrating Human Mobility and Social Media for Adolescent Psychological Stress Detection.",
                    "Collaborative Learning Team Formation: A Cognitive Modeling Perspective.",
                    "Popular Route Planning with Travel Cost Estimation.",
                    "ETCPS: An Effective and Scalable Traffic Condition Prediction System.",
                    "Species Distribution Modeling via Spatial Bagging of Multiple Conditional Random Fields.",
                    "Real-Time Personalized Taxi-Sharing."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2016w",
                "sub_name": "Database Systems for Advanced Applications - DASFAA 2016 International Workshops: BDMS, BDQM, MoI, and SeCoP, Dallas, TX, USA, April 16-19, 2016, Proceedings.",
                "count": 32,
                "papers": [
                    "Weibo Mood Towards Stock Market.",
                    "Improving Diversity of User-Based Two-Step Recommendation Algorithm with Popularity Normalization.",
                    "Followee Recommendation in Event-Based Social Networks.",
                    "SBTM: Topic Modeling over Short Texts.",
                    "Similarity-Based Classification for Big Non-Structured and Semi-Structured Recipe Data.",
                    "An Approach of Fuzzy Relation Equation and Fuzzy-Rough Set for Multi-label Emotion Intensity Analysis.",
                    "Features Extraction Based on Neural Network for Cross-Domain Sentiment Classification.",
                    "Personalized Medical Reading Recommendation: Deep Semantic Approach.",
                    "A Highly Effective Hybrid Model for Sentence Categorization.",
                    "Improved Automatic Keyword Extraction Given More Semantic Knowledge.",
                    "Generating Computational Taxonomy for Business Models of the Digital Economy.",
                    "How to Use the Social Media Data in Assisting Restaurant Recommendation.",
                    "A Combined Collaborative Filtering Model for Social Influence Prediction in Event-Based Social Networks.",
                    "Learning Manifold Representation from Multimodal Data for Event Detection in Flickr-Like Social Media.",
                    "Deep Neural Network for Short-Text Sentiment Classification.",
                    "VMPSP: Efficient Skyline Computation Using VMP-Based Space Partitioning.",
                    "Real-Time Event Detection with Water Sensor Networks Using a Spatio-Temporal Model.",
                    "Bayesian Network Structure Learning from Big Data: A Reservoir Sampling Based Ensemble Method.",
                    "Correlation Feature of Big Data in Smart Cities.",
                    "Nearly Optimal Probabilistic Coverage for Roadside Data Dissemination in Urban VANETs.",
                    "OCC: Opportunistic Crowd Computing in Mobile Social Networks.",
                    "Forest of Distributed B+Tree Based on Key-Value Store for Big-Set Problem.",
                    "An Efficient Schema Matching Approach Using Previous Mapping Result Set.",
                    "A Distributed Load Balance Algorithm of MapReduce for Data Quality Detection.",
                    "A Formal Taxonomy to Improve Data Defect Description.",
                    "ISSA: Efficient Skyline Computation for Incomplete Data.",
                    "Join Query Processing in Data Quality Management.",
                    "Similarity Search on Massive Data Based on FPGA.",
                    "Skyline Join Query Processing over Multiple Relations.",
                    "Detect Redundant RDF Data by Rules.",
                    "Behavior-Based Twitter Overlapping Community Detection.",
                    "Versatile Safe-Region Generation Method for Continuous Monitoring of Moving Objects in the Road Network Distance."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20. DASFAA 2015",
        "info": "Hanoi, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2015-1",
                "sub_name": "Database Systems for Advanced Applications - 20th International Conference, DASFAA 2015, Hanoi, Vietnam, April 20-23, 2015, Proceedings, Part I.",
                "count": 36,
                "papers": [
                    "Leveraging Homomorphisms and Bitmaps to Enable the Mining of Embedded Patterns from Large Data Trees.",
                    "Cold-Start Expert Finding in Community Question Answering via Graph Regularization.",
                    "Mining Itemset-based Distinguishing Sequential Patterns with Gap Constraint.",
                    "Mining Correlations on Massive Bursty Time Series Collections.",
                    "Adaptive Grid-Based k-median Clustering of Streaming Data with Accuracy Guarantee.",
                    "Grouping Methods for Pattern Matching in Probabilistic Data Streams.",
                    "Fast Similarity Search of Multi-Dimensional Time Series via Segment Rotation.",
                    "Measuring the Influence from User-Generated Content to News via Cross-dependence Topic Modeling.",
                    "SASS: A High-Performance Key-Value Store Design for Massive Hybrid Storage.",
                    "An Efficient Design and Implementation of Multi-level Cache for Database Systems.",
                    "A Cost-aware Buffer Management Policy for Flash-based Storage Devices.",
                    "The Gaussian Bloom Filter.",
                    "Detecting Hotspots from Trajectory Data in Indoor Spaces.",
                    "On Efficient Passenger Assignment for Group Transportation.",
                    "Effective and Efficient Predictive Density Queries for Indoor Moving Objects.",
                    "Efficient Trip Planning for Maximizing User Satisfaction.",
                    "Accelerating Search of Protein Sequence Databases using CUDA-Enabled GPU.",
                    "Fast Subgraph Matching on Large Graphs using Graphics Processors.",
                    "On Longest Repeat Queries Using GPU.",
                    "Process-driven Configuration of Federated Cloud Resources.",
                    "An Integrated Tag Recommendation Algorithm Towards Weibo User Profiling.",
                    "An Efficient Approach of Overlapping Communities Search.",
                    "A Comparative Study of Team Formation in Social Networks.",
                    "Inferring Diffusion Networks with Sparse Cascades by Structure Transfer.",
                    "Scalable Inclusion Dependency Discovery.",
                    "Repairing Functional Dependency Violations in Distributed Data.",
                    "GB-JER: A Graph-Based Model for Joint Entity Resolution.",
                    "Provenance-Aware Entity Resolution: Leveraging Provenance to Improve Quality.",
                    "A Chip Off the Old Block - Extracting Typical Attributes for Entities Based on Family Resemblance.",
                    "Tag-Based Paper Retrieval: Minimizing User Effort with Diversity Awareness.",
                    "Feedback Model for Microblog Retrieval.",
                    "Efficient String Similarity Search: A Cross Pivotal Based Approach.",
                    "Authentication of Top-k Spatial Keyword Queries in Outsourced Databases.",
                    "Privacy-Preserving Top-k Spatial Keyword Queries over Outsourced Database.",
                    "Bichromatic Reverse Nearest Neighbor Query without Information Leakage.",
                    "Authentication of Reverse k Nearest Neighbor Query."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2015-2",
                "sub_name": "Database Systems for Advanced Applications - 20th International Conference, DASFAA 2015, Hanoi, Vietnam, April 20-23, 2015, Proceedings, Part II.",
                "count": 39,
                "papers": [
                    "Scalable Learning Technologies for Big Data Mining.",
                    "Large Scale Video Management Using Spatial Metadata and Their Applications.",
                    "Querying Web Data.",
                    "A Synthetic Minority Oversampling Method Based on Local Densities in Low-Dimensional Space for Imbalanced Learning.",
                    "Fast and Scalable Outlier Detection with Approximate Nearest Neighbor Ensembles.",
                    "Rare Category Exploration on Linear Time Complexity.",
                    "FP-CPNNQ: A Filter-Based Protocol for Continuous Probabilistic Nearest Neighbor Query.",
                    "Efficient Queries Evaluation on Block Independent Disjoint Probabilistic Databases.",
                    "Parallel Top-k Query Processing on Uncertain Strings Using MapReduce.",
                    "Tracing Errors in Probabilistic Databases Based on the Bayesian Network.",
                    "Mining Frequent Spatial-Textual Sequence Patterns.",
                    "Effective and Interpretable Document Classification Using Distinctly Labeled Dirichlet Process Mixture Models of von Mises-Fisher Distributions.",
                    "MPTM: A Topic Model for Multi-Part Documents.",
                    "Retaining Rough Diamonds: Towards a Fairer Elimination of Low-Skilled Workers.",
                    "Skyline Trips of Multiple POIs Categories.",
                    "Keyword-Aware Dominant Route Search for Various User Preferences.",
                    "Spatial Keyword Range Search on Trajectories.",
                    "TOF: A Throughput Oriented Framework for Spatial Queries Processing in Multi-core Environment.",
                    "Identifying and Caching Hot Triples for Efficient RDF Query Processing.",
                    "History-Pattern Implementation for Large-Scale Dynamic Multidimensional Datasets and Its Evaluations.",
                    "Scalagon: An Efficient Skyline Algorithm for All Seasons.",
                    "Towards Order-Preserving SubMatrix Search and Indexing.",
                    "Large-Scale Multi-party Counting Set Intersection Using a Space Efficient Global Synopsis.",
                    "Improved Weighted Bloom Filter and Space Lower Bound Analysis of Algorithms for Approximated Membership Querying.",
                    "Tree Contraction for Compressed Suffix Arrays on Modern Processors.",
                    "Scalable Top- k Spatial Image Search on Road Networks.",
                    "An Efficient Method to Find the Optimal Social Trust Path in Contextual Social Graphs.",
                    "Pricing Strategies for Maximizing Viral Advertising in Social Networks.",
                    "Boosting Financial Trend Prediction with Twitter Mood Based on Selective Hidden Markov Models.",
                    "k-Consistent Influencers in Network Data.",
                    "Analyzing Electric Vehicle Energy Consumption Using Very Large Data Sets.",
                    "Interactive, Flexible, and Generic What-If Analyses Using In-Memory Column Stores.",
                    "Energy Efficient Scheduling of Fine-Granularity Tasks in a Sensor Cloud.",
                    "Invariant Event Tracking on Social Networks.",
                    "EmoTrend: Emotion Trends for Events.",
                    "A Restaurant Recommendation System by Analyzing Ratings and Aspects in Reviews.",
                    "ENRS: An Effective Recommender System Using Bayesian Model.",
                    "EPSCS: Simulating and Measuring Energy Proportionality of Server Clusters.",
                    "MAVis: A Multiple Microblogs Analysis and Visualization Tool."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2015w",
                "sub_name": "Database Systems for Advanced Applications - DASFAA 2015 International Workshops, SeCoP, BDMS, and Posters, Hanoi, Vietnam, April 20-23, 2015, Revised Selected Papers.",
                "count": 34,
                "papers": [
                    "A Novel Method for Clustering Web Search Results with Wikipedia Disambiguation Pages.",
                    "Integrating Opinion Leader and User Preference for Recommendation.",
                    "Learning Trend Analysis and Prediction Based on Knowledge Tracing and Regression Analysis.",
                    "Intensive Maximum Entropy Model for Sentiment Classification of Short Text.",
                    "Maintaining Ranking Lists in Dynamic Virtual Environments.",
                    "Knowledge Communication Analysis Based on Clustering and Association Rules Mining.",
                    "Sentiment Detection of Short Text via Probabilistic Topic Modeling.",
                    "Schema Matching Based on Source Codes.",
                    "A Quota-Based Energy Consumption Management Method for Organizations Using Nash Bargaining Solution.",
                    "Entity Relation Mining in Large-Scale Data.",
                    "A Collaborative Filtering Model for Personalized Retweeting Prediction.",
                    "Finding Paraphrase Facts Based on Coordinate Relationships.",
                    "Emergency Situation Awareness During Natural Disasters Using Density-Based Adaptive Spatiotemporal Clustering.",
                    "Distributed Data Managing in Health Care Social Network Based on Mobile P2P.",
                    "Survey of MOOC Related Research.",
                    "Modeling Large Time Series for Efficient Approximate Query Processing.",
                    "Personalized User Value Model and Its Application.",
                    "Flexible Aggregation on Heterogeneous Information Networks.",
                    "Discovering Organized POI Groups in a City.",
                    "Multi-roles Affiliation Model for General User Profiling.",
                    "Needle in a Haystack: Max/Min Online Aggregation in the Cloud.",
                    "FFD-Index: An Efficient Indexing Scheme for Star Subgraph Matching on Large RDF Graphs.",
                    "Leveraging Interactive Knowledge and Unlabeled Data in Gender Classification with Co-training.",
                    "Interactive Gender Inference in Social Media.",
                    "Joint Sentiment and Emotion Classification with Integer Linear Programming.",
                    "Mining Wikileaks Data to Identify Sentiment Polarities in International Relationships.",
                    "Extracting Indoor Spatial Objects from CAD Models: A Database Approach.",
                    "Incremental Class Discriminant Analysis on Interval-Valued Emitter Signal Parameters.",
                    "Visualization Tool for Boundary Image Matching Based on Time-Series Data.",
                    "Performance Analysis of Hadoop-Based SQL and NoSQL for Processing Log Data.",
                    "SVIS: Large Scale Video Data Ingestion into Big Data Platform.",
                    "A ^3 3 SAR: Context-Aware Spatial Augmented Reality for Anywhere, Anyone, and Analysis.",
                    "Semi-supervised Clustering Method for Multi-density Data.",
                    "Towards a Pattern-Based Query Language for Document Databases."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19. DASFAA 2014",
        "info": "Bali, Indonesia",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2014-1",
                "sub_name": "Database Systems for Advanced Applications - 19th International Conference, DASFAA 2014, Bali, Indonesia, April 21-24, 2014. Proceedings, Part I.",
                "count": 33,
                "papers": [
                    "Challenges for Dataset Search.",
                    "Secure Computation on Outsourced Data: A 10-year Retrospective.",
                    "Online Indexing and Distributed Querying Model-View Sensor Data in the Cloud.",
                    "Discovery of Areas with Locally Maximal Confidence from Location Data.",
                    "Multi-way Theta-Join Based on CMD Storage Method.",
                    "MIGSOM: A SOM Algorithm for Large Scale Hyperlinked Documents Inspired by Neuronal Migration.",
                    "Scalable Numerical Queries by Algebraic Inequality Transformations.",
                    "SAQR: An Efficient Scheme for Similarity-Aware Query Refinement.",
                    "Concurrent Execution of Mixed Enterprise Workloads on In-Memory Databases.",
                    "On Data Partitioning in Tree Structure Metric-Space Indexes.",
                    "Improving Performance of Graph Similarity Joins Using Selected Substructures.",
                    "Linear Path Skyline Computation in Bicriteria Networks.",
                    "Label and Distance-Constraint Reachability Queries in Uncertain Graphs.",
                    "Privacy-Preserving Reachability Query Services.",
                    "SKY R-tree: An Index Structure for Distance-Based Top-k Query.",
                    "Causal Structure Discovery for Spatio-temporal Data.",
                    "Efficient Processing of Which-Edge Questions on Shortest Path Queries.",
                    "Reconciling Multiple Categorical Preferences with Double Pareto-Based Aggregation.",
                    "CARIC-DA: Core Affinity with a Range Index for Cache-Conscious Data Access in a Multicore Environment.",
                    "Approximating an Energy-Proportional DBMS by a Dynamic Cluster of Nodes.",
                    "APSkyline: Improved Skyline Computation for Multicore Architectures.",
                    "Greedy Filtering: A Scalable Algorithm for K-Nearest Neighbor Graph Construction.",
                    "On Mining Proportional Fault-Tolerant Frequent Itemsets.",
                    "An Efficient K-means Clustering Algorithm on MapReduce.",
                    "Efficient Mining of Density-Aware Distinguishing Sequential Patterns with Gap Constraints.",
                    "Identifying Top k Dominating Objects over Uncertain Data.",
                    "Probabilistic Reverse Top-k Queries.",
                    "Monitoring Probabilistic Threshold SUM Query Processing in Uncertain Streams.",
                    "Efficient Processing of Probabilistic Group Nearest Neighbor Query on Uncertain Data.",
                    "Popularity Tendency Analysis of Ranking-Oriented Collaborative Filtering from the Perspective of Loss Function.",
                    "Rating Propagation in Web Services Reputation Systems: A Fast Shapley Value Approach.",
                    "CLUSM: An Unsupervised Model for Microblog Sentiment Analysis Incorporating Link Information.",
                    "Location Oriented Phrase Detection in Microblogs."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2014-2",
                "sub_name": "Database Systems for Advanced Applications - 19th International Conference, DASFAA 2014, Bali, Indonesia, April 21-24, 2014. Proceedings, Part II.",
                "count": 41,
                "papers": [
                    "Ensemble Pruning: A Submodular Function Maximization Perspective.",
                    "Identify and Trace Criminal Suspects in the Crowd Aided by Fast Trajectories Retrieval.",
                    "Multi-Output Regression with Tag Correlation Analysis for Effective Image Tagging.",
                    "The Ranking Based Constrained Document Clustering Method and Its Application to Social Event Detection.",
                    "A Skylining Approach to Optimize Influence and Cost in Location Selection.",
                    "Geo-Social Skyline Queries.",
                    "Reverse-Nearest Neighbor Queries on Uncertain Moving Object Trajectories.",
                    "Selectivity Estimation of Reverse k-Nearest Neighbor Queries.",
                    "Efficient Sampling Methods for Shortest Path Query over Uncertain Graphs.",
                    "Exploiting Transitive Similarity and Temporal Dynamics for Similarity Search in Heterogeneous Information Networks.",
                    "Top-k Similarity Matching in Large Graphs with Attributes.",
                    "On Perspective-Aware Top-k Similarity Search in Multi-relational Networks.",
                    "ρ-uncertainty Anonymization by Partial Suppression.",
                    "Access Control for Data Integration in Presence of Data Dependencies.",
                    "Thwarting Passive Privacy Attacks in Collaborative Filtering.",
                    "Privacy-Preserving Schema Reuse.",
                    "Any Suggestions? Active Schema Support for Structuring Web Information.",
                    "ADI: Towards a Framework of App Developer Inspection.",
                    "Novel Community Recommendation Based on a User-Community Total Relation.",
                    "User Interaction Based Community Detection in Online Social Networks.",
                    "Object Semantics for XML Keyword Search.",
                    "Large-Scale Similarity Join with Edit-Distance Constraints.",
                    "Topical Presentation of Search Results on Database.",
                    "An Efficient Approach for Mining Top-k High Utility Specialized Query Expansions on Social Tagging Systems.",
                    "Novel Techniques to Reduce Search Space in Periodic-Frequent Pattern Mining.",
                    "Inferring Road Type in Crowdsourced Map Services.",
                    "Rights Protection for Trajectory Streams.",
                    "Efficient Detection of Emergency Event from Moving Object Data Streams.",
                    "Cost Reduction for Web-Based Data Imputation.",
                    "Incremental Quality Inference in Crowdsourcing.",
                    "Repair Diversification for Functional Dependency Violations.",
                    "BigOP: Generating Comprehensive Big Data Workloads as a Benchmarking Framework.",
                    "A*DAX: A Platform for Cross-Domain Data Linking, Sharing and Analytics.",
                    "Optimizing Database Load and Extract for Big Data Era.",
                    "Web Page Centered Communication System Based on a Physical Property.",
                    "TaxiHailer: A Situation-Specific Taxi Pick-Up Points Recommendation System.",
                    "Camel: A Journey Group T-Pattern Mining System Based on Instagram Trajectory Data.",
                    "Harbinger: An Analyzing and Predicting System for Online Social Network Users' Behavior.",
                    "Cloud-Scale Transaction Processing with ParaDB System: A Demonstration.",
                    "BSMA-Gen: A Parallel Synthetic Data Generator for Social Media Timeline Structures.",
                    "A Mobile Log Data Analysis System Based on Multidimensional Data Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2014w",
                "sub_name": "Database Systems for Advanced Applications - 19th International Conference, DASFAA 2014, International Workshops: BDMA, DaMEN, SIM - 3 - , UnCrowd; Bali, Indonesia, April 21-24, 2014, Revised Selected Papers.",
                "count": 32,
                "papers": [
                    "Meme Media and Knowledge Federation for Exploratory Visual Analytics of Big Data.",
                    "Online Data Clustering Using Variational Learning of a Hierarchical Dirichlet Process Mixture of Dirichlet Distributions.",
                    "Distributed Skyline Computation of Vertically Splitted Databases by Using MapReduce.",
                    "Short-Term Speed Prediction on Urban Highways by Ensemble Learning with Feature Subset Selection.",
                    "Graph Summarization Using Word Correlation Analysis on Large Set of Documents.",
                    "Distributed K-Distance Indexing Approach for Efficient Shortest Path Discovery on Large Graphs.",
                    "Customized Information Interface with Web Applications.",
                    "Leveraging Enterprise Application Characteristics to Optimize Incremental Aggregate Maintenance in a Columnar In-Memory Database.",
                    "MaiterStore: A Hot-Aware, High-Performance Key-Value Store for Graph Processing.",
                    "Vertical Bit-Packing: Optimizing Operations on Bit-Packed Vectors Leveraging SIMD Instructions.",
                    "Efficient Streaming Detection of Hidden Clusters in Big Data Using Subspace Stream Clustering.",
                    "A Comparison of Systems to Large-Scale Data Access.",
                    "A Framework to Measure Storage Utilization in Cloud Storage Systems.",
                    "Personalized Recommendation via Relevance Propagation on Social Tagging Graph.",
                    "Optimizing Pipelined Execution for Distributed In-Memory OLAP System.",
                    "Hash ^ed -Join: Approximate String Similarity Join with Hashing.",
                    "Minimizing Explanations of Why-Not Questions.",
                    "HadoopM: A Message-Enabled Data Processing System on Large Clusters.",
                    "AntiqueData: A Proxy to Maintain Computational Transparency in Cloud.",
                    "Monitoring Query Processing in Mobile Robot Databases.",
                    "Efficiently Evaluating Range-Constrained Spatial Keyword Query on Road Networks.",
                    "A Spatial-Temporal Analysis of Users' Geographical Patterns in Social Media: A Case Study on Microblogs.",
                    "Solving Multiple Bichromatic Mutual Nearest Neighbor Queries with the GPU.",
                    "A Kernel Density Method for Aggregating Boundary Collision Data into Areal Units.",
                    "Integrated Indoor Positioning with Mobile Devices for Location-Based Service Applications.",
                    "A Hybrid Scale-Out Cloud-Based Data Service for Worldwide Sensors.",
                    "Uncertainty in Crowd Data Sourcing Under Structural Constraints.",
                    "Integration of Web Sources Under Uncertainty and Dependencies Using Probabilistic XML.",
                    "Skill Ontology-Based Model for Quality Assurance in Crowdsourcing.",
                    "ProbKS: Keyword Search on Probabilistic Spatial Data.",
                    "Towards Mobile Sensor-Aware Crowdsourcing: Architecture, Opportunities and Challenges.",
                    "Conditioning Probabilistic Relational Data with Referential Constraints."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18. DASFAA 2013",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2013-1",
                "sub_name": "Database Systems for Advanced Applications, 18th International Conference, DASFAA 2013, Wuhan, China, April 22-25, 2013. Proceedings, Part I.",
                "count": 35,
                "papers": [
                    "Data Overload: What Can We Do?",
                    "Can We Predict User Intents from Queries?",
                    "Record Linkage: A 10-Year Retrospective.",
                    "Finding Rising Stars in Social Networks.",
                    "Expertise Ranking of Users in QA Community.",
                    "Community Expansion in Social Network.",
                    "Similarity Joins on Item Set Collections Using Zero-Suppressed Binary Decision Diagrams.",
                    "Keyword-Matched Data Skyline in Peer-to-Peer Systems.",
                    "Adaptive Query Scheduling in Key-Value Data Stores.",
                    "Near-Optimal Partial Linear Scan for Nearest Neighbor Search in High-Dimensional Space.",
                    "AVR-Tree: Speeding Up the NN and ANN Queries on Location Data.",
                    "Top-k Neighborhood Dominating Query.",
                    "OptRegion: Finding Optimal Region for Bichromatic Reverse Nearest Neighbors.",
                    "Generalization-Based Private Indexes for Outsourced Databases.",
                    "Distributed AH-Tree Based Index Technology for Multi-channel Wireless Data Broadcast.",
                    "MVP Index: Towards Efficient Known-Item Search on Large Graphs.",
                    "Indexing Reverse Top-k Queries in Two Dimensions.",
                    "Beyond Click Graph: Topic Modeling for Search Engine Query Log Analysis.",
                    "Continuous Topically Related Queries Grouping and Its Application on Interest Identification.",
                    "Efficient Responsibility Analysis for Query Answers.",
                    "Minimizing Explanations for Missing Answers to Queries on Databases.",
                    "A Compact and Efficient Labeling Scheme for XML Documents.",
                    "Querying Semi-structured Data with Mutual Exclusion.",
                    "XReason: A Semantic Approach That Reasons with Patterns to Answer XML Keyword Queries.",
                    "History-Offset Implementation Scheme of XML Documents and Its Evaluations.",
                    "On the Complexity of t-Closeness Anonymization and Related Problems.",
                    "Distributed Anonymization for Multiple Data Providers in a Cloud System.",
                    "Subscription Privacy Protection in Topic-Based Pub/Sub.",
                    "Feel Free to Check-in: Privacy Alert against Hidden Location Inference Attacks in GeoSNs.",
                    "Differentially Private Set-Valued Data Release against Incremental Updates.",
                    "Consistent Query Answering Based on Repairing Inconsistent Attributes with Nulls.",
                    "On Efficient k-Skyband Query Processing over Incomplete Data.",
                    "Mining Frequent Patterns from Uncertain Data with MapReduce for Big Data Analytics.",
                    "Efficient Probabilistic Reverse k-Nearest Neighbors Query Processing on Uncertain Data.",
                    "Efficient Querying of Correlated Uncertain Data with Cached Results."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2013-2",
                "sub_name": "Database Systems for Advanced Applications, 18th International Conference, DASFAA 2013, Wuhan, China, April 22-25, 2013. Proceedings, Part II.",
                "count": 41,
                "papers": [
                    "Shortest Path Computation over Disk-Resident Large Graphs Based on Extended Bulk Synchronous Parallel Methods.",
                    "Fast SimRank Computation over Disk-Resident Graphs.",
                    "S-store: An Engine for Large RDF Graph Integrating Spatial Information.",
                    "Physical Column Organization in In-Memory Column Stores.",
                    "Semantic Data Warehouse Design: From ETL to Deployment à la Carte.",
                    "A Specific Encryption Solution for Data Warehouses.",
                    "NameNode and DataNode Coupling for a Power-Proportional Hadoop Distributed File System.",
                    "Mapping Entity-Attribute Web Tables to Web-Scale Knowledge Bases.",
                    "ServiceBase: A Programming Knowledge-Base for Service Oriented Development.",
                    "On Leveraging Crowdsourcing Techniques for Schema Matching Networks.",
                    "MFSV: A Truthfulness Determination Approach for Fact Statements.",
                    "A Mechanism for Stream Program Performance Recovery in Resource Limited Compute Clusters.",
                    "Event Relationship Analysis for Temporal Event Search.",
                    "Dynamic Label Propagation in Social Networks.",
                    "MAKM: A MAFIA-Based k-Means Algorithm for Short Text in Social Networks.",
                    "Detecting User Preference on Microblog.",
                    "MustBlend: Blending Visual Multi-Source Twig Query Formulation and Query Processing in RDBMS.",
                    "Efficient SPARQL Query Evaluation via Automatic Data Partitioning.",
                    "Content Based Retrieval for Lunar Exploration Image Databases.",
                    "Searching Desktop Files Based on Access Logs.",
                    "An In-Memory/GPGPU Approach to Query Processing for Aspect-Oriented Data Management.",
                    "On Efficient Graph Substructure Selection.",
                    "Parallel Triangle Counting over Large Graphs.",
                    "Document Summarization via Self-Present Sentence Relevance Model.",
                    "Active Semi-supervised Community Detection Algorithm with Label Propagation.",
                    "Computing the Split Points for Learning Decision Tree in MapReduce.",
                    "FP-Rank: An Effective Ranking Approach Based on Frequent Pattern Analysis.",
                    "A Hybrid Framework for Product Normalization in Online Shopping.",
                    "Staffing Open Collaborative Projects Based on the Degree of Acquaintance.",
                    "Who Will Follow Your Shop? Exploiting Multiple Information Sources in Finding Followers.",
                    "Performance of Serializable Snapshot Isolation on Multicore Servers.",
                    "A Hybrid Approach for Relational Similarity Measurement.",
                    "Subspace MOA:  Subspace Stream Clustering Evaluation Using the MOA Framework.",
                    "Symbolic Trajectories in SECONDO: Pattern Matching and Rewriting.",
                    "ReTweet  p : Modeling and Predicting Tweets Spread Using an Extended Susceptible-Infected- Susceptible Epidemic Model.",
                    "TwiCube: A Real-Time Twitter Off-Line Community Analysis Tool.",
                    "TaskCardFinder: An Aviation Enterprise Search Engine for Bilingual MRO Task Cards.",
                    "EntityManager: An Entity-Based Dirty Data Management System.",
                    "RelRec: A Graph-Based Triggering Object Relationship Recommender System.",
                    "IndoorDB: Extending Oracle to Support Indoor Moving Objects Management.",
                    "HITCleaner: A Light-Weight Online Data Cleaning System."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2013w",
                "sub_name": "Database Systems for Advanced Applications - 18th International Conference, DASFAA 2013, International Workshops: BDMA, SNSM, SeCoP, Wuhan, China, April 22-25, 2013. Proceedings.",
                "count": 19,
                "papers": [
                    "From Big Data to Big Data Mining: Challenges, Issues, and Opportunities.",
                    "An Economical Query Cost Model in the Cloud.",
                    "BC-BSP: A BSP-Based Parallel Iterative Processing System for Big Data on Cloud Architecture.",
                    "DNA Encoding for Splice Site Prediction in Large DNA Sequence.",
                    "Using a Pipeline Approach to Build Data Cube for Large XML Data Streams.",
                    "A Study on MapReduce Processing for Multi-dimensional Continuous Query.",
                    "Measuring Proximity in a Graph of Spatial Data (ZIP Codes).",
                    "An Efficient Data Access Method Exploiting Quadtrees on MapReduce Frameworks.",
                    "Optimized Adaptive Hybrid Indexing for In-memory Column Stores.",
                    "Influence Maximization Algorithm Using Markov Clustering.",
                    "An Approximate Approach for Batch Update of Common Preference Group.",
                    "A Probabilistic Approach for Events Identification from Social Media RSS Feeds.",
                    "A Method of Pre-detecting Privacy Leak in Social Network Service Using Collaborative Filtering.",
                    "The Strategies for Supporting Query Specialization and Query Generalization in Social Tagging Systems.",
                    "Extracting Relations among Search Properties Based on the Operational Context of Geographical Information Retrieval Systems.",
                    "The Media Feature Analysis of Microblog Topics.",
                    "Web Service Based Algorithm Management Framework for Stream Data Processing.",
                    "Research on Petri Net and IDEF1X Based Production Scheduling Modeling Method.",
                    "Product Feature Summarization by Incorporating Domain Information."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17. DASFAA 2012",
        "info": "Busan, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2012-1",
                "sub_name": "Database Systems for Advanced Applications - 17th International Conference, DASFAA 2012, Busan, South Korea, April 15-19, 2012, Proceedings, Part I.",
                "count": 41,
                "papers": [
                    "Enabling Real Time Data Analysis.",
                    "A New Paradigm of Thinking and Architecture for Real-Time Information Processing at Fingertips.",
                    "Improving the Accuracy of Histograms for Geographic Data Objects.",
                    "Improving Online Aggregation Performance for Skewed Data Distribution.",
                    "A Relational-Based Approach for Aggregated Search in Graph Databases.",
                    "Discovery of Keys from SQL Tables.",
                    "A Framework for Realizing Artifact-Centric Business Processes in Service-Oriented Architecture.",
                    "Appearance-Order-Based Schema Matching.",
                    "Fast Result Enumeration for Keyword Queries on XML Data.",
                    "Stars on Steroids: Fast Evaluation of Multi-source Star Twig Queries in RDBMS.",
                    "Updating Typical XML Views.",
                    "Partitioned Indexes for Entity Search over RDF Knowledge Bases.",
                    "SINBAD: Towards Structure-Independent Querying of Common Neighbors in XML Databases.",
                    "Top-Down SLCA Computation Based on List Partition.",
                    "Efficiently Identifying Contributors for XML Keyword Search.",
                    "Semi-supervised Clustering of Graph Objects: A Subgraph Mining Approach.",
                    "Plink-LDA: Using Link as Prior Information in Topic Modeling.",
                    "AnyOut: Anytime Outlier Detection on Streaming Data.",
                    "Ensemble Based Positive Unlabeled Learning for Time Series Classification.",
                    "Efficient Mining Regularly Frequent Patterns in Transactional Databases.",
                    "Fast Tree-Based Mining of Frequent Itemsets from Uncertain Data.",
                    "On the Decidability and Complexity of Identity Knowledge Representation.",
                    "Privacy Preserving Mining Maximal Frequent Patterns in Transactional Databases.",
                    "Data Privacy against Composition Attack.",
                    "Protecting Sensitive Relationships against Inference Attacks in Social Networks.",
                    "You Can Walk Alone: Trajectory Privacy-Preserving through Significant Stays Protection.",
                    "Semi-Edge Anonymity: Graph Publication when the Protection Algorithm Is Available.",
                    "On-the-Fly Generation of Facets as Navigation Signs for Web Objects.",
                    "Searching for Quality Microblog Posts: Filtering and Ranking Based on Content Analysis and Implicit Links.",
                    "HotDigg: Finding Recent Hot Topics from Digg.",
                    "Assessing Web Article Quality by Harnessing Collective Intelligence.",
                    "Context Sensitive Tag Expansion with Information Inference.",
                    "Efficient Subgraph Similarity All-Matching.",
                    "Efficient Algorithm for Mining Correlated Protein-DNA Binding Cores.",
                    "A Novel Approach for Finding Alternative Clusterings Using Feature Selection.",
                    "General Spatial Skyline Operator.",
                    "Top-k Similarity Join over Multi-valued Objects.",
                    "Indexing Network Voronoi Diagrams.",
                    "On Efficient Reverse k-Skyband Query Processing.",
                    "Co-spatial Searcher: Efficient Tag-Based Collaborative Spatial Search on Geo-social Network.",
                    "Traffic Aware Route Planning in Dynamic Road Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2012-2",
                "sub_name": "Database Systems for Advanced Applications - 17th International Conference, DASFAA 2012, Busan, South Korea, April 15-19, 2012, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Top-k Best Probability Queries on Probabilistic Data.",
                    "Probabilistic Reverse Skyline Query Processing over Uncertain Data Stream.",
                    "Malleability-Aware Skyline Computation on Linked Open Data.",
                    "Effective Next-Items Recommendation via Personalized Sequential Pattern Mining.",
                    "Scalable Top-k Keyword Search in Relational Databases.",
                    "Composition and Efficient Evaluation of Context-Aware Preference Queries.",
                    "An Automaton-Based Index Scheme for On-Demand XML Data Broadcast.",
                    "Colored Range Searching on Internal Memory.",
                    "Circle of Friend Query in Geo-Social Networks.",
                    "A Power Saving Storage Method That Considers Individual Disk Rotation.",
                    "ComMapReduce: An Improvement of MapReduce with Lightweight Communication Mechanisms.",
                    "Halt or Continue: Estimating Progress of Queries in the Cloud.",
                    "Towards a Scalable, Performance-Oriented OLAP Storage Engine.",
                    "Highly Scalable Speech Processing on Data Stream Management System.",
                    "EVIS: A Fast and Scalable Episode Matching Engine for Massively Parallel Data Streams.",
                    "Real-Time Analysis of ECG Data Using Mobile Data Stream Management System.",
                    "A Main Memory Based Spatial DBMS: Kairos.",
                    "Study on the International Standardization for the Semantic Metadata Mapping Procedure.",
                    "Semantics and Usage Statistics for Multi-dimensional Query Expansion.",
                    "Hierarchy-Based Update Propagation in Decision Support Systems.",
                    "An Experiment with Asymmetric Algorithm: CPU Vs. GPU.",
                    "Tag Association Based Graphical Password Using Image Feature Matching.",
                    "Acarp: Author-Centric Analysis of Research Papers.",
                    "iParticipate: Automatic Tweet Generation from Local Government Data.",
                    "gRecs: A Group Recommendation System Based on User Clustering.",
                    "PEACOD: A Platform for Evaluation and Comparison of Database Partitioning Schemes.",
                    "Stream Data Mining Using the MOA Framework.",
                    "Shot Classification Using Domain Specific Features for Movie Management.",
                    "PA-Miner: Process Analysis Using Retrieval, Modeling, and Prediction.",
                    "Data Management Challenges and Opportunities in Cloud Computing.",
                    "Detecting Clones, Copying and Reuse on the Web (DASFAA 2012 Tutorial).",
                    "Query Processing over Uncertain and Probabilistic Databases.",
                    "Tutorial: Data Stream Mining and Its Applications.",
                    "Storing, Querying, Summarizing, and Comparing Molecular Networks: The State-of-the-Art."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2012w",
                "sub_name": "Database Systems for Advanced Applications - 17th International Conference, DASFAA 2012, International Workshops: FlashDB, ITEMS, SNSM, SIM3, DQDI, Busan, South Korea, April 15-19, 2012. Proceedings.",
                "count": 32,
                "papers": [
                    "Commercial SSD Products - Status Quo and Next.",
                    "Improving Database Performance Using a Flash-Based Write Cache.",
                    "h-Buffer: An Adaptive Buffer Management Scheme for Flash-Based Storage Devices.",
                    "A Study of Space Reclamation on Flash-Based Append-only Storage Management.",
                    "A Dual-Grained FTL for Flash Memory.",
                    "Impact of Storage Technology on the Efficiency of Cluster-Based High-Dimensional Index Creation.",
                    "Implementation of the Aggregated R-Tree over Flash Memory.",
                    "A Flash-Based Decomposition Storage Model.",
                    "The Contribution of Bayesian Networks to Manage Risks of Maritime Piracy against Oil Offshore Fields.",
                    "A Scalable Object Based Discovery Service for Global Tracing of RFID Products.",
                    "On Smart and Accurate Contextual Advertising.",
                    "Review Summarization Based on Linguistic Knowledge.",
                    "Finding Related Micro-blogs Based on WordNet.",
                    "An Efficient Path Nearest Neighbor Query Processing Scheme for Location Based Services.",
                    "Social Community Based Blog Search Framework.",
                    "LSA as Ground Truth for Recommending \"Flickr-Aware\" Representative Tags.",
                    "Adaptive Access Control Enforcement in Social Network Using Aspect Weaving.",
                    "Exploring Reflection of Urban Society through Cyber-Physical Crowd Behavior on Location-Based Social Network.",
                    "Mining Social Networks for Significant Friend Groups.",
                    "Ranking Structural Parameters for Social Networks.",
                    "Collaborative Similarity Measure for Intra Graph Clustering.",
                    "A Grid-Based Index and Queries for Large-Scale Geo-tagged Video Collections.",
                    "Indexing Partial History Trajectory and Future Position of Moving Objects Using HTPR*-Tree.",
                    "A Linear Broadcast Indexing Scheme in Road Environments with Sensor Networks.",
                    "Spatial Keyword Queries.",
                    "Evaluating Spatial Keyword Queries under the MapReduce Framework.",
                    "Detection of High-Risk Zones and Potential Infected Neighbors from Infectious Disease Monitoring Data.",
                    "Bayesian Network-Based Probabilistic XML Keywords Filtering.",
                    "Provenance Based Conflict Handling Strategies.",
                    "Incomplete Databases: Missing Records and Missing Values.",
                    "User Interface Design Guidelines Arrangement in a Recommender System with Frame Ontology.",
                    "Assessing Information Quality by Six Sigma Method."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16. DASFAA 2011",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2011-1",
                "sub_name": "Database Systems for Advanced Applications - 16th International Conference, DASFAA 2011, Hong Kong, China, April 22-25, 2011, Proceedings, Part I.",
                "count": 41,
                "papers": [
                    "Smarter Planet: Empower People with Information Insights.",
                    "Database Scalability, Elasticity, and Autonomy in the Cloud - (Extended Abstract).",
                    "What Have We Learnt from Deductive Object-Oriented Database Research?",
                    "ECODE: Event-Based Community Detection from Social Networks.",
                    "A User Similarity Calculation Based on the Location for Social Network Services.",
                    "Modeling User Expertise in Folksonomies by Fusing Multi-type Features.",
                    "Identifying Topic Experts and Topic Communities in the Blogspace.",
                    "Utility-Oriented K-Anonymization on Social Networks.",
                    "Distributed Privacy Preserving Data Collection.",
                    "Privacy Preserving Query Processing on Secret Share Based Data Storage.",
                    "Node Protection in Weighted Social Networks.",
                    "An Unbiased Distance-Based Outlier Detection Approach for High-Dimensional Data.",
                    "A Relational View of Pattern Discovery.",
                    "Efficient Incremental Mining of Frequent Sequence Generators.",
                    "An Alternative Interestingness Measure for Mining Periodic-Frequent Patterns.",
                    "A Framework of Mining Semantic Regions from Trajectories.",
                    "STS: Complex Spatio-Temporal Sequence Mining in Flickr.",
                    "Mining High Utility Mobile Sequential Patterns in Mobile Commerce Environments.",
                    "Reasoning about Dynamic Delegation in Role Based Access Control Systems.",
                    "Robust Ranking of Uncertain Data.",
                    "Probabilistic Image Tagging with Tags Expanded By Text-Based Search.",
                    "Removing Uncertainties from Overlay Network.",
                    "Probabilistic and Interactive Retrieval of Chinese Calligraphic Character Images Based on Multiple Features.",
                    "Real-Time Diameter Monitoring for Time-Evolving Graphs.",
                    "Handling ER-topk Query on Uncertain Streams.",
                    "Seamless Event and Data Stream Processing: Reconciling Windows and Consumption Modes.",
                    "Querying Moving Objects with Uncertainty in Spatio-Temporal Databases.",
                    "A Novel Hash-Based Streaming Scheme for Energy Efficient Full-Text Search in Wireless Data Broadcast.",
                    "Efficient Topological OLAP on Information Networks.",
                    "An Edge-Based Framework for Fast Subgraph Matching in a Large Graph.",
                    "Context-Sensitive Query Expansion over the Bipartite Graph Model for Web Service Search.",
                    "BMC: An Efficient Method to Evaluate Probabilistic Reachability Queries.",
                    "Improving XML Data Quality with Functional Dependencies.",
                    "Identifying Relevant Matches with NOT Semantics over XML Documents.",
                    "Evaluating Contained Rewritings for XPath Queries on Materialized Views.",
                    "XStreamCluster: An Efficient Algorithm for Streaming XML Data Clustering.",
                    "Efficient Evaluation of NOT-Twig Queries in Tree-Unaware Relational Databases.",
                    "A Hybrid Algorithm for Finding Top-k Twig Answers in Probabilistic XML.",
                    "Optimizing Incremental Maintenance of Minimal Bisimulation of Cyclic Graphs.",
                    "Social Based Layouts for the Increase of Locality in Graph Operations.",
                    "Generating Random Graphic Sequences."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2011-2",
                "sub_name": "Database Systems for Advanced Applications - 16th International Conference, DASFAA 2011, Hong Kong, China, April 22-25, 2011, Proceedings, Part II.",
                "count": 43,
                "papers": [
                    "Efficient Histogram-Based Similarity Search in Ultra-High Dimensional Space.",
                    "A Retrieval Strategy Using the Integrated Knowledge of Similarity and Associations.",
                    "PG-Skip: Proximity Graph Based Clustering of Long Strings.",
                    "An Effective Approach for Searching Closest Sentence Translations from the Web.",
                    "Finding the Sites with Best Accessibilities to Amenities.",
                    "Audio Lifelog Search System Using a Topic Model for Reducing Recognition Errors.",
                    "Towards Web Search by Sentence Queries: Asking the Web for Query Substitutions.",
                    "The DISTARNET Approach to Reliable Autonomic Long-Term Digital Preservation.",
                    "A Unified Algorithm for Continuous Monitoring of Spatial Queries.",
                    "Real-Time Monitoring of Moving Objects Using Frequently Used Routes.",
                    "wNeighbors: A Method for Finding k Nearest Neighbors in Weighted Regions.",
                    "Aggregate Farthest-Neighbor Queries over Spatial Data.",
                    "Querying Business Process Models Based on Semantics.",
                    "Discovering Implicit Categorical Semantics for Schema Matching.",
                    "Expressive Power of Query Languages for Constraint Complex Value Databases.",
                    "Scaling Up Query Allocation in the Presence of Autonomous Participants.",
                    "Generating Preview Instances for the Face Validation of Entity-Relationship Schemata: The Acyclic Case.",
                    "Dynamic Skylines Considering Range Queries.",
                    "EcoTop: An Economic Model for Dynamic Processing of Top-k Queries in Mobile-P2P Networks.",
                    "REQUEST: Region-Based Query Processing in Sensor Networks.",
                    "Efficient Distributed Top-k Query Processing with Caching.",
                    "Exploiting Correlation to Rank Database Query Results.",
                    "LinearDB: A Relational Approach to Make Data Warehouse Scale Like MapReduce.",
                    "Genetic Algorithm Based QoS-Aware Service Compositions in Cloud Computing.",
                    "Energy-Efficient Tree-Based Indexing Schemes for Information Retrieval in Wireless Data Broadcast.",
                    "Buffer Cache De-duplication for Query Dispatch in Replicated Databases.",
                    "Indexing for Vector Projections.",
                    "Assessment of Cardiovascular Disease Risk Prediction Models: Evaluation Methods.",
                    "Visual Analysis of Implicit Social Networks for Suspicious Behavior Detection.",
                    "Compositional Information Extraction Methodology from Medical Reports.",
                    "A Framework for Semantic Recommendations in Situational Applications.",
                    "Storage and Use of Provenance Information for Relational Database Queries.",
                    "MRQSim: A Moving Range Query Simulation Platform in Spatial Networks.",
                    "DWOBS: Data Warehouse Design from Ontology-Based Sources.",
                    "AUCWeb: A Prototype for Analyzing User-Created Web Data.",
                    "Blending OLAP Processing with Real-Time Data Streams.",
                    "AutoBayesian: Developing Bayesian Networks Based on Text Mining.",
                    "Classify Uncertain Data with Decision Tree.",
                    "StreamFitter: A Real Time Linear Regression Analysis System for Continuous Data Streams.",
                    "Challenges in Managing and Mining Large, Heterogeneous Data.",
                    "Managing Social Image Tags: Methods and Applications.",
                    "Web Search and Browse Log Mining: Challenges, Methods, and Applications.",
                    "Searching, Analyzing and Exploring Databases."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2011w",
                "sub_name": "Database Systems for Adanced Applications - 16th International Conference, DASFAA 2011, International Workshops: GDB, SIM3, FlashDB, SNSMW, DaMEN, DQIS, Hong Kong, China, April 22-25, 2011. Proceedings.",
                "count": 51,
                "papers": [
                    "Privacy-Preserved Network Data Publishing.",
                    "Towards Efficient Subgraph Search in Cloud Computing Environments.",
                    "Latency-Optimal Walks in Replicated and Partitioned Graphs.",
                    "Graph-Based Matching of Composite OWL-S Services.",
                    "Design Non-recursive and Redundant-Free XML Conceptual Schema with Hypergraph (Extended Abstract).",
                    "Classifying Graphs Using Theoretical Metrics: A Study of Feasibility.",
                    "A GML Documents Stream Compressor.",
                    "A Query-Friendly Compression for GML Documents.",
                    "Storing GML Documents: A Model-Mapping Based Approach.",
                    "GML Data Management: Framework and Prototype.",
                    "An Efficient Multi-layer Grid Method for Skyline Queries in Distributed Environments.",
                    "3D Indoor Route Planning for Arbitrary-Shape Objects.",
                    "A Web-Based Visualisation Tool for Analysing Mouse Movements to Support Map Personalisation.",
                    "On the Requirements for User-Centric Spatial Data Warehousing and SOLAP.",
                    "Optimal Bandwidth Selection for Density-Based Clustering.",
                    "Developing an Oracle-Based Spatio-Temporal Information Management System.",
                    "Some Research Directions in FlashDB.",
                    "Page-Level Log Mapping: From Many-to-Many Mapping to One-to-One Mapping.",
                    "A Novel Method to Extend Flash Memory Lifetime in Flash-Based DBMS.",
                    "Log-Compact R-Tree: An Efficient Spatial Index for SSD.",
                    "An FTL-Agnostic Layer to Improve Random Write on Flash Memory.",
                    "Energy Efficiency Is Not Enough, Energy Proportionality Is Needed!",
                    "Flash-Based Database Systems: Experiences from the FlashDB Project.",
                    "Trading Memory for Performance and Energy.",
                    "Design of Embedded Database Based on Hybrid Storage of PRAM and NAND Flash Memory.",
                    "Hybrid Storage with Disk Based Write Cache.",
                    "An Analysis of Network Structure and Post Content for Blog Post Recommendation.",
                    "Extracting Local Community Structure from Local Cores.",
                    "On Summarizing Graph Homogeneously.",
                    "Expansion Properties of Large Social Graphs.",
                    "Text Representation Using Dependency Tree Subgraphs for Sentiment Analysis.",
                    "A Local Information Passing Clustering Algorithm for Tagging Systems.",
                    "What's in a Name: A Study of Names, Gender Inference, and Gender Behavior in Facebook.",
                    "Realtime Social Sensing of Support Rate for Microblogging.",
                    "Searching Consultants in Web Forum.",
                    "Comparing Similarity of HTML Structures and Affiliate IDs in Splog Analysis.",
                    "Crowd-Powered TV Viewing Rates: Measuring Relevancy between Tweets and TV Programs.",
                    "GreenOrbs: Lessons Learned from Extremely Large Scale Sensor Network Deployment.",
                    "Adapting Skyline Computation to the MapReduce Framework: Algorithms and Experiments.",
                    "Efficient Event Stream Processing: Handling Ambiguous Events and Patterns with Negation.",
                    "Effective Keyword Search for Candidate Fragments of XML Documents.",
                    "Optimized Data Placement for Column-Oriented Data Store in the Distributed Environment.",
                    "Two-Step Joint Scheduling Scheme for Road Side Units (RSUs)-Based Vehicular Ad Hoc Networks (VANETs).",
                    "A Content-Aware Adaptive Storage Approach for XML in PXRDB.",
                    "The Flamingo Software Package on Approximate String Queries.",
                    "A Framework for Data Quality Aware Query Systems.",
                    "SemGen - Towards a Semantic Data Generator for Benchmarking Duplicate Detectors.",
                    "Estimating a Transit Passenger Trip Origin-Destination Matrix Using Automatic Fare Collection System.",
                    "An Approach to Assess the Quality of Web Pages in the Deep Web.",
                    "Using Machine Learning to Support Resource Quality Assessment: An Adaptive Attribute-Based Approach for Health Information Portals.",
                    "Grid-Based Probabilistic Skyline Retrieval on Distributed Uncertain Data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15. DASFAA 2010",
        "info": "Tsukuba, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2010-1",
                "sub_name": "Database Systems for Advanced Applications, 15th International Conference, DASFAA 2010, Tsukuba, Japan, April 1-4, 2010, Proceedings, Part I.",
                "count": 48,
                "papers": [
                    "Knowledge on the Web: Robust and Scalable Harvesting of Entity-Relationship Facts.",
                    "Cloud Data Management @ Yahoo!",
                    "Distributed Cache Indexing for Efficient Subspace Skyline Computation in P2P Networks.",
                    "iDISQUE: Tuning High-Dimensional Similarity Queries in DHT Networks.",
                    "Adaptive Ensemble Classification in P2P Networks.",
                    "Mining Rare Association Rules in the Datasets with Widely Varying Items' Frequencies.",
                    "CAMLS: A Constraint-Based Apriori Algorithm for Mining Long Sequences.",
                    "PGP-mc: Towards a Multicore Parallel Approach for Mining Gradual Patterns.",
                    "Generalised Rule Mining.",
                    "An Effective Object-Level XML Keyword Search.",
                    "Effectively Inferring the Search-for Node Type in XML Keyword Search.",
                    "Matching Top-k Answers of Twig Patterns in Probabilistic XML.",
                    "NOVA: A Novel and Efficient Framework for Finding Subgraph Isomorphism Mappings in Large Graphs.",
                    "Efficiently Answering Probability Threshold-Based Shortest Path Queries over Uncertain Graphs.",
                    "Discovering Burst Areas in Fast Evolving Graphs.",
                    "Answering Top-k Similar Region Queries.",
                    "Efficient Approximate Visibility Query in Large Dynamic Environments.",
                    "The Objects Interaction Matrix for Modeling Cardinal Directions in Spatial Databases.",
                    "Efficient Algorithms to Monitor Continuous Constrained k Nearest Neighbor Queries.",
                    "Chasing Tree Patterns under Recursive DTDs.",
                    "Efficient Label Encoding for Range-Based Dynamic XML Labeling Schemes.",
                    "An Efficient Parallel PathStack Algorithm for Processing XML Twig Queries on Multi-core Systems.",
                    "Keyword Search on Hybrid XML-Relational Databases Using XRjoin.",
                    "Efficient Database-Driven Evaluation of Security Clearance for Federated Access Control of Dynamic XML Documents.",
                    "Speeding Up Complex Video Copy Detection Queries.",
                    "Efficient Skyline Maintenance for Streaming Data with Partially-Ordered Domains.",
                    "A Simple, Yet Effective and Efficient, Sliding Window Sampling Algorithm.",
                    "Detecting Leaders from Correlated Time Series.",
                    "Mining Outliers with Ensemble of Heterogeneous Detectors on Random Subspaces.",
                    "Mining Diversity on Networks.",
                    "Mining Regular Patterns in Data Streams.",
                    "k-ARQ: k-Anonymous Ranking Queries.",
                    "QSQL: Incorporating Logic-Based Retrieval Conditions into SQL.",
                    "k-Selection Query over Uncertain Data.",
                    "Analysis of Implicit Relations on Wikipedia: Measuring Strength through Mining Elucidatory Objects.",
                    "Summarizing and Extracting Online Public Opinion from Blog Search Results.",
                    "Cloud as Virtual Databases: Bridging Private Databases and Web Services.",
                    "Temporal Top-k Search in Social Tagging Sites Using Multiple Social Networks.",
                    "Air-Indexing on Error Prone Communication Channels.",
                    "Content-Based Multipath Routing for Sensor Networks.",
                    "Evaluating Continuous Probabilistic Queries Over Imprecise Sensor Data.",
                    "BPMN Process Views Construction.",
                    "Active Duplicate Detection.",
                    "FlexTable: Using a Dynamic Relation Model to Store RDF Data.",
                    "An MDL Approach to Efficiently Discover Communities in Bipartite Network.",
                    "Fires on the Web: Towards Efficient Exploring Historical Web Graphs.",
                    "Identifying Community Structures in Networks with Seed Expansion.",
                    "Dynamic Agglomerative-Divisive Clustering of Clickthrough Data for Collaborative Web Search."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2010-2",
                "sub_name": "Database Systems for Advanced Applications, 15th International Conference, DASFAA 2010, Tsukuba, Japan, April 1-4, 2010, Proceedings, Part II.",
                "count": 58,
                "papers": [
                    "Bs-tree: A Self-tuning Index of Moving Objects.",
                    "Privacy-Preserving Location Publishing under Road-Network Constraints.",
                    "Incremental Clustering for Trajectories.",
                    "NNCluster: An Efficient Clustering Algorithm for Road Network Trajectories.",
                    "Dynamic Skyline Queries in Large Graphs.",
                    "Top-k Combinatorial Skyline Queries.",
                    "Extract Interesting Skyline Points in High Dimension.",
                    "Transitivity-Preserving Skylines for Partially Ordered Domains.",
                    "Finding the Most Desirable Skyline Objects.",
                    "Multiple Sensitive Association Protection in the Outsourced Database.",
                    "A Semantic Information Loss Metric for Privacy Preserving Publication.",
                    "On t-Closeness with KL-Divergence and Semantic Privacy.",
                    "Competitive Privacy: Secure Analysis on Integrated Sequence Data.",
                    "Privacy-Preserving Publishing Data with Full Functional Dependencies.",
                    "Scalable Splitting of Massive Data Streams.",
                    "Constraint-Aware Complex Event Pattern Detection over Streams.",
                    "Attribute Outlier Detection over Data Streams.",
                    "ISIS: A New Approach for Efficient Similarity Search in Sparse Databases.",
                    "Highly Scalable Multiprocessing Algorithms for Preference-Based Database Retrieval.",
                    "IO3: Interval-Based Out-of-Order Event Processing in Pervasive Computing.",
                    "Peer-to-Peer Similarity Search Based on M-Tree Indexing.",
                    "Update Migration: An Efficient B+ Tree for Flash Storage.",
                    "Optimizing Write Performance for Read Optimized Databases.",
                    "Towards an Algebraic Framework for Querying Inductive Databases.",
                    "Efficient Aggregate Licenses Validation in DRM.",
                    "Development Procedure of the Cloud-Based Applications.",
                    "Rapid Development of Web Applications by Introducing Database Systems with Web APIs.",
                    "A General Maturity Model and Reference Architecture for SaaS Service.",
                    "Lazy View Maintenance for Social Networking Applications.",
                    "Birds Bring Flues? Mining Frequent and High Weighted Cliques from Birds Migration Networks.",
                    "Performance Improvement of OpenJPA by Query Dependency Analysis.",
                    "Chimera: Stream-Oriented XML Filtering/Querying Engine.",
                    "Privacy and Anonymization as a Service: PASS.",
                    "Visual Evaluation of Outlier Detection Models.",
                    "ADERIS: Adaptively Integrating RDF Data from SPARQL Endpoints.",
                    "Outline of Community-Type Content Based on Wikipedia.",
                    "BISCAY: Extracting Riding Context from Bike Ride Data.",
                    "SERPWatcher: A SERP Mining Tool as a Novel Social Survey Method in Sociology.",
                    "Corona: Energy-Efficient Multi-query Processing in Wireless Sensor Networks.",
                    "Aquiba: An Energy-Efficient Mobile Sensing System for Collaborative Human Probes.",
                    "A Shoes-Integrated Sensing System for Context-Aware Human Probes.",
                    "DigestJoin: Expediting Joins on Solid-State Drives.",
                    "A Large Scale Key-Value Store Based on Range-Key Skip Graph and Its Applications.",
                    "Answering Range-Aggregate Queries over Objects Generating Data Streams.",
                    "Real-Time Log Analysis Using Hitachi uCosminexus Stream Data Platform.",
                    "Anddy: A System for Author Name Disambiguation in Digital Library.",
                    "A System for Keyword Search on Hybrid XML-Relational Databases Using XRjoin.",
                    "MediaMatrix: A Video Stream Retrieval System with Mechanisms for Mining Contexts of Query Examples.",
                    "Application Developments in Mashup Framework for Selective Browsing.",
                    "Retrieving System of Presentation Contents Based on User's Operations and Semantic Contexts.",
                    "Fuzzy Keyword Search on Spatial Data.",
                    "Adaptive Recommendation for Preferred Information and Browsing Action Based on Web-Browsing Behavior.",
                    "BIDEL: An XML-Based System for Effective Fast Change Detection of Genomic and Proteomic Data.",
                    "DISTRO: A System for Detecting Global Outliers from Distributed Data Streams with Privacy Protection.",
                    "Introduction to Social Computing.",
                    "Mining Moving Object, Trajectory and Traffic Data.",
                    "Querying Large Graph Databases.",
                    "Future Directions of Innovative Integration between Multimedia Information Services and Ubiquitous Computing Technologies."
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2010w",
                "sub_name": "Database Systems for Advanced Applications, 15th International Conference, DASFAA 2010, International Workshops: GDM, BenchmarX, MCIS, SNSMW, DIEW, UDM, Tsukuba, Japan, April 1-4, 2010, Revised Selected Papers.",
                "count": 46,
                "papers": [
                    "GDM2010 Workshop Organizers' Message.",
                    "On-Line Preferential Nearest Neighbor Browsing in Large Attributed Graphs.",
                    "Mining Useful Time Graph Patterns on Extensively Discussed Topics on the Web - (Position Paper).",
                    "Querying Graph-Based Repositories of Business Process Models.",
                    "SGDB - Simple Graph Database Optimized for Activation Spreading Computation.",
                    "Introduction to the Data Intensive e-Science Workshop (DIEW) 2010.",
                    "WISE-CAPS: Web-Based Interactive Secure Environment for Collaborative Analysis of Planetary Science.",
                    "Towards Large-Scale Scientific Dataspaces for e-Science Applications.",
                    "Providing Constructed Buildings Information by ASTER Satellite DEM Images and Web Contents.",
                    "Gfdnavi, Web-Based Data and Knowledge Server Software for Geophysical Fluid Sciences, Part I: Rationales, Stand-Alone Features, and Supporting Knowledge Documentation Linked to Data.",
                    "Gfdnavi, Web-Based Data and Knowledge Server Software for Geophysical Fluid Sciences, Part II: RESTful Web Services and Object-Oriented Programming Interface.",
                    "MCIS2010 Workshop Organizers' Message.",
                    "Checking Structural Integrity for Metadata Repository Systems by Means of Description Logics.",
                    "On Memory and I/O Efficient Duplication Detection for Multiple Self-clean Data Sources.",
                    "Top-K Generation of Mediated Schemas over Multiple Data Sources.",
                    "A Graphical Method for Reference Reconciliation.",
                    "BenchmarX'10 Workshop Organizers' Message.",
                    "Benchmarking Holistic Approaches to XML Tree Pattern Query Processing - (Extended Abstract of Invited Talk).",
                    "Benchmarking the Compression of XML Node Streams.",
                    "Generation of Synthetic XML for Evaluation of Hybrid XML Systems.",
                    "Benchmarking Publish/Subscribe-Based Messaging Systems.",
                    "An Experimental Evaluation of Relational RDF Storage and Querying Techniques.",
                    "Analyzer: A Framework for File Analysis.",
                    "SNSMW 2010 Workshop Organizers' Message.",
                    "Task-Oriented User Modeling Method and Its Application to Service Navigation on the Web.",
                    "Tag Disambiguation through Flickr and Wikipedia.",
                    "Measuring Attention Intensity to Web Pages Based on Specificity of Social Tags.",
                    "SQL as a Mashup Tool: Design and Implementation of a Web Service Integration Approach Based on the Concept of Extensible Relational Database Management Systems.",
                    "Design of Impression Scales for Assessing Impressions of News Articles.",
                    "An Evaluation Framework for Analytical Methods of Integrating Electronic Word-of-Mouth Information: Position Paper.",
                    "A Framework for Finding Community in Complex Networks.",
                    "C&C: An Effective Algorithm for Extracting Web Community Cores.",
                    "Extracting Local Web Communities Using Lexical Similarity.",
                    "An Improved Algorithm for Extracting Research Communities from Bibliographic Data.",
                    "Proposal of Deleting Plots from the Reviews to the Items with Stories.",
                    "Basic Study on a Recommendation Method Considering Region-Restrictedness of Spots.",
                    "A Hybrid Recommendation Method with Double SVD Reduction.",
                    "Monitoring Geo-social Activities through Micro-blogging Sites.",
                    "UDM2010 Workshop Organizers' Message.",
                    "Distributed SLCA-Based XML Keyword Search by Map-Reduce.",
                    "FVC: A Feature-Vector-Based Classification for XML Dissemination.",
                    "An Object-Field Perspective Data Model for Moving Geographic Phenomena.",
                    "GRAMS3: An Efficient Framework for XML Structural Similarity Search.",
                    "An Asynchronous Message-Based Knowledge Communication in a Ubiquitous Environment.",
                    "Providing Scalable Data Services in Ubiquitous Networks.",
                    "On-Demand Data Broadcasting for Data Items with Time Constraints on Multiple Broadcast Channels."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14. DASFAA 2009",
        "info": "Brisbane, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2009",
                "sub_name": "Database Systems for Advanced Applications, 14th International Conference, DASFAA 2009, Brisbane, Australia, April 21-23, 2009. Proceedings.",
                "count": 75,
                "papers": [
                    "Dependability, Abstraction, and Programming.",
                    "The Challenge of Assuring Data Trustworthiness.",
                    "Integrating Australia's Water Data.",
                    "Probabilistic Inverse Ranking Queries over Uncertain Data.",
                    "Consistent Top-k Queries over Time.",
                    "Effective Fuzzy Keyword Search over Uncertain Data.",
                    "Adaptive Safe Regions for Continuous Spatial Queries over Moving Objects.",
                    "Optimization on Data Object Compression and Replication in Wireless Multimedia Sensor Networks.",
                    "An Effective and Efficient Method for Handling Transmission Failures in Sensor Networks.",
                    "Query Allocation in Wireless Sensor Networks with Multiple Base Stations.",
                    "GraphREL: A Decomposition-Based and Selectivity-Aware Relational Framework for Processing Sub-graph Queries.",
                    "A Uniform Framework for Ad-Hoc Indexes to Answer Reachability Queries on Large Graphs.",
                    "Ricochet: A Family of Unconstrained Algorithms for Graph Clustering.",
                    "Top-K Correlation Sub-graph Search in Graph Databases.",
                    "Efficient RFID Data Imputation by Analyzing the Correlations of Monitored Objects.",
                    "A Reprocessing Model Based on Continuous Queries for Writing Data to RFID Tag Memory.",
                    "QoS-Oriented Multi-query Scheduling over Data Streams.",
                    "An EM-Based Algorithm for Clustering Data Streams in Sliding Windows.",
                    "Two-Dimensional Retrieval in Synchronized Media Streams.",
                    "Eager Evaluation of Partial Tree-Pattern Queries on XML Streams.",
                    "Energy-Efficient Evaluation of Multiple Skyline Queries over a Wireless Sensor Network.",
                    "Dominant and K Nearest Probabilistic Skylines.",
                    "Predictive Skyline Queries for Moving Objects.",
                    "Efficient Algorithms for Skyline Top-K Keyword Queries on XML Streams.",
                    "Searching for Rising Stars in Bibliography Networks.",
                    "Hash Join Optimization Based on Shared Cache Chip Multi-processor.",
                    "Traverse: Simplified Indexing on Large Map-Reduce-Merge Clusters.",
                    "\"Pay-as-You-Go\" Processing for Tracing Queries in a P2P Record Exchange System.",
                    "Update Propagation Strategies Considering Degree of Data Update in Peer-to-Peer Networks.",
                    "XML Data Integration Using Fragment Join.",
                    "An Adaptive Method for the Efficient Similarity Calculation.",
                    "Periodic Pattern Analysis in Time Series Databases.",
                    "Multi-level Frequent Pattern Mining.",
                    "Mining Entropy l-Diversity Patterns.",
                    "Query Optimization for Complex Path Queries on XML Data.",
                    "Containment between Unions of XPath Queries.",
                    "FlexBench: A Flexible XML Query Benchmark.",
                    "Consistent Answers from Integrated XML Data.",
                    "Optimal Privacy-Aware Path in Hippocratic Databases.",
                    "Privacy-Preserving Clustering with High Accuracy and Low Time Complexity.",
                    "Efficient and Anonymous Online Data Collection.",
                    "Decomposition: Privacy Preservation for Multiple Sensitive Attributes.",
                    "Privacy-Preserving Queries for a DAS Model Using Encrypted Bloom Filter.",
                    "Hash-Search: An Efficient SLCA-Based Keyword Search Algorithm on XML Documents.",
                    "MCN: A New Semantics Towards Effective XML Keyword Search.",
                    "On the Discovery of Conserved XML Query Patterns for Evolution-Conscious Caching.",
                    "ValidMatch: Retrieving More Reasonable SLCA-Based Result for XML Keyword Search.",
                    "Efficient Data Structure for XML Keyword Search.",
                    "WS-BPEL Business Process Abstraction and Concretisation.",
                    "Quality Evaluation of Search Results by Typicality and Speciality of Terms Extracted from Wikipedia.",
                    "A Ranking Method for Web Search Using Social Bookmarks.",
                    "Fractional PageRank Crawler: Prioritizing URLs Efficiently for Crawling Important Pages Early.",
                    "Selectivity Estimation for Exclusive Query Translation in Deep Web Data Integration.",
                    "Detecting Aggregate Incongruities in XML.",
                    "Materialized View Selection in XML Databases.",
                    "Implementing and Optimizing Fine-Granular Lock Management for XML Document Trees.",
                    "On Multidimensional Wavelet Synopses for Maximum Error Bounds.",
                    "A Revisit of Query Expansion with Different Semantic Levels.",
                    "A Unified Indexing Structure for Efficient Cross-Media Retrieval.",
                    "Dimension-Specific Search for Multimedia Retrieval.",
                    "Application of Information Retrieval Techniques for Source Code Authorship Attribution.",
                    "In the Search of NECTARs from Evolutionary Trees.",
                    "Reducing Space Requirements for Disk Resident Suffix Arrays.",
                    "A Right-Time Refresh for XML Data Warehouses.",
                    "Demonstrating Effective Ranked XML Keyword Search with Meaningful Result Display.",
                    "In-Page Logging B-Tree for Flash Memory.",
                    "Supporting Execution-Level Business Process Modeling with Semantic Technologies.",
                    "Video Annotation System Based on Categorizing and Keyword Labelling.",
                    "TRUSTER: TRajectory Data Processing on ClUSTERs.",
                    "SUITS: Faceted User Interface for Constructing Structured Queries from Keywords.",
                    "Demonstration of a Peer-to-Peer Approach for Spatial Queries.",
                    "Techniques for Efficiently Searching in Spatial, Temporal, Spatio-temporal, and Multimedia Databases.",
                    "Knowledge Discovery over the Deep Web, Semantic Web and XML.",
                    "Top-k Algorithms and Applications.",
                    "Information Services: Myth or Silver Bullet?"
                ]
            },
            {
                "sub_name_abbr": "conf/dasfaa/2009w",
                "sub_name": "Database Systems for Advanced Applications, DASFAA 2009 International Workshops: BenchmarX, MCIS, WDPP, PPDA, MBC, PhD, Brisbane, Australia, April 20-23, 2009.",
                "count": 33,
                "papers": [
                    "Workshop Organizers' Message.",
                    "Current Approaches to XML Benchmarking.",
                    "TJDewey - On the Efficient Path Labeling Scheme Holistic Approach.",
                    "The XMLBench Project: Comparison of Fast, Multi-platform XML libraries.",
                    "A Synthetic, Trend-Based Benchmark for XPath.",
                    "An Empirical Evaluation of XML Compression Tools.",
                    "Benchmarking Performance-Critical Components in a Native XML Database System.",
                    "On Benchmarking Transaction Managers.",
                    "Workshop Organizers' Message.",
                    "Data Provenance Support in Relational Databases for Stored Procedures.",
                    "A Vision and Agenda for Theory Provenance in Scientific Publishing.",
                    "Probabilistic Ranking in Uncertain Vector Spaces.",
                    "Logical Foundations for Similarity-Based Databases.",
                    "Tailoring Data Quality Models Using Social Network Preferences.",
                    "The Effect of Data Quality Tag Values and Usable Data Quality Tags on Decision-Making.",
                    "Predicting Timing Failures in Web Services.",
                    "A Two-Tire Index Structure for Approximate String Matching with Block Moves.",
                    "Workshop Organizers' Message.",
                    "Privacy Risk Diagnosis: Mining l-Diversity.",
                    "Towards Preference-Constrained k-Anonymisation.",
                    "Privacy FP-Tree.",
                    "Classification with Meta-learning in Privacy Preserving Data Mining.",
                    "Importance of Data Standardization in Privacy-Preserving K-Means Clustering.",
                    "Workshop Organizers' Message.",
                    "A Decomposition Approach with Invariant Analysis for Workflow Coordination.",
                    "An Efficient P2P Range Query Processing Approach for Multi-dimensional Uncertain Data.",
                    "Flexibility as a Service.",
                    "Concept Shift Detection for Frequent Itemsets from Sliding Windows over Data Streams.",
                    "A Framework for Mining Stochastic Model of Business Process in Mobile Environments.",
                    "Workshop Organizers' Message.",
                    "Encryption over Semi-trusted Database.",
                    "Integration of Domain Knowledge for Outlier Detection in High Dimensional Space.",
                    "Towards a Spreadsheet-Based Service Composition Framework."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13. DASFAA 2008",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2008",
                "sub_name": "Database Systems for Advanced Applications, 13th International Conference, DASFAA 2008, New Delhi, India, March 19-21, 2008. Proceedings.",
                "count": 69,
                "papers": [
                    "Storage and Index Design for Community Systems.",
                    "Self-tuning Database Systems: Past, Present and Future.",
                    "The Business of Managing Data: Implications for Research.",
                    "Holistic Constraint-Preserving Transformation from Relational Schema into XML Schema.",
                    "An Optimized Two-Step Solution for Updating XML Views.",
                    "Even an Ant Can Create an XSD.",
                    "A User Driven Data Mining Process Model and Learning System.",
                    "Efficient Mining of Recurrent Rules from a Sequence Database.",
                    "Uniqueness Mining.",
                    "Discovering Spatial Interaction Patterns.",
                    "Topological Relationships between Map Geometries.",
                    "MBR Models for Uncertainty Regions of Moving Objects.",
                    "Summarization Graph Indexing: Beyond Frequent Structure-Based Approach.",
                    "Bulk-Loading the ND-Tree in Non-ordered Discrete Data Spaces.",
                    "An Incremental Maintenance Scheme of Data Cubes.",
                    "A Data Partition Based Near Optimal Scheduling Algorithm for Wireless Multi-channel Data Broadcast.",
                    "A Test Paradigm for Detecting Changes in Transactional Data Streams.",
                    "Teddies: Trained Eddies for Reactive Stream Processing.",
                    "Flood Little, Cache More: Effective Result-Reuse in P2P IR Systems.",
                    "Load Balancing for Moving Object Management in a P2P Network.",
                    "Serializable Executions with Snapshot Isolation: Modifying Application Code or Mixing Isolation Levels?",
                    "SemanticTwig: A Semantic Approach to Optimize XML Query Processing.",
                    "Approximate XML Query Answers in DHT-Based P2P Networks.",
                    "Efficient Top-k Search Across Heterogeneous XML Data Sources.",
                    "Example-Based Robust DB-Outlier Detection for High Dimensional Data.",
                    "A Novel Fingerprint Matching Method by Excluding Elastic Distortion.",
                    "Approximate Clustering of Time Series Using Compact Model-Based Descriptions.",
                    "An Approach for Extracting Bilingual Terminology from Wikipedia.",
                    "Cost-Effective Web Search in Bootstrapping for Named Entity Recognition.",
                    "Learning Bayesian Network Structure from Incomplete Data without Any Assumption.",
                    "Ranking Database Queries with User Feedback: A Neural Network Approach.",
                    "Supporting Keyword Queries on Structured Databases with Limited Search Interfaces.",
                    "Automated Data Discovery in Similarity Score Queries.",
                    "Efficient Algorithms for Node Disjoint Subgraph Homeomorphism Determination.",
                    "The Chronon Based Model for Temporal Databases.",
                    "Main Memory Commit Processing: The Impact of Priorities.",
                    "Association Rules Induced by Item and Quantity Purchased.",
                    "An Indexed Trie Approach to Incremental Mining of Closed Frequent Itemsets Based on a Galois Lattice Framework.",
                    "Mining Frequent Patterns in an Arbitrary Sliding Window over Data Streams.",
                    "Index-Supported Similarity Search Using Multiple Representations.",
                    "Distance Based Feature Selection for Clustering Microarray Data.",
                    "Knowledge Transferring Via Implicit Link Analysis.",
                    "Exploiting ID References for Effective Keyword Search in XML Documents.",
                    "Storage Techniques for Multi-versioned XML Documents.",
                    "Twig'n Join: Progressive Query Processing of Multiple XML Streams.",
                    "TwigBuffer: Avoiding Useless Intermediate Solutions Completely in Twig Joins.",
                    "An Approach for XML Similarity Join Using Tree Serialization.",
                    "A Holistic Algorithm for Efficiently Evaluating Xtwig Joins.",
                    "Redundant Array of Inexpensive Nodes for DWS.",
                    "Load-Balancing for WAN Warehouses.",
                    "Enabling Privacy-Preserving e-Payment Processing.",
                    "Managing and Correlating Historical Events Using an Event Timeline Datatype.",
                    "Online Collaborative Stock Control and Selling Among E-Retailers.",
                    "Mining Automotive Warranty Claims Data for Effective Root Cause Analysis.",
                    "A Similarity Search of Trajectory Data Using Textual Information Retrieval Techniques.",
                    "Constrained k-Nearest Neighbor Query Processing over Moving Object Trajectories.",
                    "Location Update Strategies for Network-Constrained Moving Objects.",
                    "A P2P Meta-index for Spatio-temporal Moving Object Databases.",
                    "An Update Propagation Strategy Considering Access Frequency in Peer-to-Peer Networks.",
                    "Towards Automated Analysis of Connections Network in Distributed Stream Processing System.",
                    "RAIN: Always on Data Warehousing.",
                    "Data Compression for Incremental Data Cube Maintenance.",
                    "A Bilingual Dictionary Extracted from the Wikipedia Link Structure.",
                    "A Search Engine for Browsing the Wikipedia Thesaurus.",
                    "An Interactive Predictive Data Mining System for Informed Decision.",
                    "Analysis of Time Series Using Compact Model-Based Descriptions.",
                    "Collecting Data Streams from a Distributed Radio-Based Measurement System.",
                    "A Web Visualization Tool for Historical Analysis of Geo-referenced Multidimensional Data.",
                    "Is There really Anything Beyond Frequent Patterns, Classification and Clustering in Data Mining?"
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12. DASFAA 2007",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2007",
                "sub_name": "Advances in Databases: Concepts, Systems and Applications, 12th International Conference on Database Systems for Advanced Applications, DASFAA 2007, Bangkok, Thailand, April 9-12, 2007, Proceedings.",
                "count": 113,
                "papers": [
                    "'Socio Sense' and 'Cyber Infrastructure' for Information Explosion Era': Projects in Japan.",
                    "Is (Your) Database Research Having Impact?",
                    "Improving Quality and Convergence of Genetic Query Optimizers.",
                    "Cost-Based Query Optimization for Multi Reachability Joins.",
                    "A Path-Based Approach for Efficient Structural Join with Not-Predicates.",
                    "RRPJ: Result-Rate Based Progressive Relational Join.",
                    "GChord: Indexing for Multi-Attribute Query in P2P System with Low Maintenance Cost.",
                    "ITREKS: Keyword Search over Relational Database by Indexing Tuple Relationship.",
                    "An MBR-Safe Transform for High-Dimensional MBRs in Similar Sequence Matching.",
                    "Mining Closed Frequent Free Trees in Graph Databases.",
                    "Mining Time-Delayed Associations from Discrete Event Datasets.",
                    "A Comparative Study of Ontology Based Term Similarity Measures on PubMed Document Clustering.",
                    "An Adaptive and Efficient Unsupervised Shot Clustering Algorithm for Sports Video.",
                    "A Robust Feature Normalization Scheme and an Optimized Clustering Method for Anomaly-Based Intrusion Detection System.",
                    "Detection and Visualization of Subspace Cluster Hierarchies.",
                    "Correlation-Based Detection of Attribute Outliers.",
                    "An Efficient Histogram Method for Outlier Detection.",
                    "Efficient k -Anonymization Using Clustering Techniques.",
                    "Privacy Preserving Data Mining of Sequential Patterns for Network Traffic Data.",
                    "Privacy Preserving Clustering for Multi-party.",
                    "Privacy-Preserving Frequent Pattern Sharing.",
                    "KnBest - A Balanced Request Allocation Method for Distributed Information Systems.",
                    "The Circular Two-Phase Commit Protocol.",
                    "Towards Timely ACID Transactions in DBMS.",
                    "BioDIFF: An Effective Fast Change Detection Algorithm for Biological Annotations.",
                    "An Efficient Implementation for MOLAP Basic Data Structure and Its Evaluation.",
                    "Monitoring Heterogeneous Nearest Neighbors for Moving Objects Considering Location-Independent Attributes.",
                    "Similarity Joins of Text with Incomplete Information Formats.",
                    "Self-tuning in Graph-Based Reference Disambiguation.",
                    "Probabilistic Nearest-Neighbor Query on Uncertain Objects.",
                    "Making the Most of Cache Groups.",
                    "Construction of Tree-Based Indexes for Level-Contiguous Buffering Support.",
                    "A Workload-Driven Unit of Cache Replacement for Mid-Tier Database Caching.",
                    "J+-Tree: A New Index Structure in Main Memory.",
                    "CST-Trees: Cache Sensitive T-Trees.",
                    "Specifying Access Control Policies on Data Streams.",
                    "Protecting Individual Information Against Inference Attacks in Data Publishing.",
                    "Quality Aware Privacy Protection for Location-Based Services.",
                    "Implementation of Bitmap Based Incognito and Performance Evaluation.",
                    "Prioritized Active Integrity Constraints for Database Maintenance.",
                    "Using Redundant Bit Vectors for Near-Duplicate Image Detection.",
                    "OLYBIA: Ontology-Based Automatic Image Annotation System Using Semantic Inference Rules.",
                    "OntoDB: An Ontology-Based Database for Data Intensive Applications.",
                    "Continuously Maintaining Sliding Window Skylines in a Sensor Network.",
                    "Bayesian Reasoning for Sensor Group-Queries and Diagnosis.",
                    "Telescope: Zooming to Interesting Skylines.",
                    "Eliciting Matters - Controlling Skyline Sizes by Incremental Integration of User Preferences.",
                    "Optimizing Moving Queries over Moving Object Data Streams.",
                    "MIME: A Dynamic Index Scheme for Multi-dimensional Query in Mobile P2P Networks.",
                    "Interval-Focused Similarity Search in Time Series Databases.",
                    "Adaptive Distance Measurement for Time Series Databases.",
                    "Clustering Moving Objects in Spatial Networks.",
                    "The Tornado Model: Uncertainty Model for Continuously Changing Data.",
                    "ClusterSheddy : Load Shedding Using Moving Clusters over Spatio-temporal Data Streams.",
                    "Evaluating MAX and MIN over Sliding Windows with Various Size Using the Exemplary Sketch.",
                    "CLAIM: An Efficient Method for Relaxed Frequent Closed Itemsets Mining over Stream Data.",
                    "Capture Inference Attacks for K-Anonymity with Privacy Inference Logic.",
                    "Schema Mapping in P2P Networks Based on Classification and Probing.",
                    "ABIDE: A Bid-Based Economic Incentive Model for Enticing Non-cooperative Peers in Mobile-P2P Networks.",
                    "An Efficient Encoding and Labeling for Dynamic XML Data.",
                    "An Original Semantics to Keyword Queries for XML Using Structural Patterns.",
                    "Lightweight Model Bases and Table-Driven Modeling.",
                    "An Efficient Index Lattice for XML Query Evaluation.",
                    "A Development of Hash-Lookup Trees to Support Querying Streaming XML.",
                    "Efficient Integration of Structure Indexes of XML.",
                    "Efficient Support for Ordered XPath Processing in Tree-Unaware Commercial Relational Databases.",
                    "On Label Stream Partition for Efficient Holistic Twig Join.",
                    "Efficient XML Query Processing in RDBMS Using GUI-Driven Prefetching in a Single-User Environment.",
                    "Efficient Holistic Twig Joins in Leaf-to-Root Combining with Root-to-Leaf Way.",
                    "TwigList : Make Twig Pattern Matching Fast.",
                    "CircularTrip: An Effective Algorithm for Continuous k NN Queries.",
                    "Optimizing Multiple In-Network Aggregate Queries in Wireless Sensor Networks.",
                    "Visible Nearest Neighbor Queries.",
                    "On Query Processing Considering Energy Consumption for Broadcast Database Systems.",
                    "Mining Vague Association Rules.",
                    "An Optimized Process Neural Network Model.",
                    "Clustering XML Documents Based on Structural Similarity.",
                    "The Multi-view Information Bottleneck Clustering.",
                    "Web Service Composition Based on Message Schema Analysis.",
                    "SQORE: A Framework for Semantic Query Based Ontology Retrieval.",
                    "Graph Structure of the Korea Web.",
                    "EasyQuerier: A Keyword Based Interface for Web Database Integration System.",
                    "Anomalies Detection in Mobile Network Management Data.",
                    "Security-Conscious XML Indexing.",
                    "Framework for Extending RFID Events with Business Rule.",
                    "Approximate Similarity Search over Multiple Stream Time Series.",
                    "WT-Heuristics: A Heuristic Method for Efficient Operator Ordering.",
                    "An Efficient and Scalable Management of Ontology.",
                    "Estimating Missing Data in Data Streams.",
                    "AB-Index: An Efficient Adaptive Index for Branching XML Queries.",
                    "Semantic XPath Query Transformation: Opportunities and Performance.",
                    "TGV: A Tree Graph View for Modeling Untyped XQuery.",
                    "Indexing Textual XML in P2P Networks Using Distributed Bloom Filters.",
                    "Towards Adaptive Information Merging Using Selected XML Fragments.",
                    "LAPIN: Effective Sequential Pattern Mining Algorithms by Last Position Induction for Dense Databases.",
                    "Spatial Clustering Based on Moving Distance in the Presence of Obstacles.",
                    "Tracing Data Transformations: A Preliminary Report.",
                    "QuickCN: A Combined Approach for Efficient Keyword Search over Databases.",
                    "Adaptive Join Query Processing in Data Grids: Exploring Relation Partial Replicas and Load Balancing.",
                    "Efficient Semantically Equal Join on Strings.",
                    "Integrating Similarity Retrieval and Skyline Exploration Via Relevance Feedback.",
                    "An Image-Semantic Ontological Framework for Large Image Databases.",
                    "Flexible Selection of Wavelet Coefficients for Continuous Data Stream Reduction.",
                    "Versioned Relations: Support for Conditional Schema Changes and Schema Versioning.",
                    "Compatibility Analysis and Mediation-Aided Composition for BPEL Services.",
                    "Expert Finding in a Social Network.",
                    "Efficient Reasoning About XFDs with Pre-image Semantics.",
                    "Context RBAC/MAC Access Control for Ubiquitous Environment.",
                    "Extending PostgreSQL to Support Distributed/Heterogeneous Query Processing.",
                    "Geo-WDBMS: An Improved DBMS with the Function of Watermarking Geographical Data.",
                    "TinTO: A Tool for the View-Based Analysis of Streams of Stock Market Data.",
                    "Danaïdes: Continuous and Progressive Complex Queries on RSS Feeds.",
                    "OntoDB: It Is Time to Embed Your Domain Ontology in Your Database."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11. DASFAA 2006",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2006",
                "sub_name": "Database Systems for Advanced Applications, 11th International Conference, DASFAA 2006, Singapore, April 12-15, 2006, Proceedings.",
                "count": 68,
                "papers": [
                    "Dataspaces: A New Abstraction for Information Management.",
                    "Dissemination of Dynamic Data: Semantics, Algorithms, and Performance.",
                    "Geo-Enabled, Mobile Services-A Tale of Routes, Detours, and Dead Ends.",
                    "Processing Multiple Aggregation Queries in Geo-Sensor Networks.",
                    "In-Network Processing of Nearest Neighbor Queries for Wireless Sensor Networks.",
                    "Associated Load Shedding Strategies for Computing Multi-joins in Sensor Networks.",
                    "Using Multiple Indexes for Efficient Subsequence Matching in Time-Series Databases.",
                    "DAPSS: Exact Subsequence Matching for Data Streams.",
                    "An Efficient Approach for Mining Top-K Fault-Tolerant Repeating Patterns.",
                    "Querying Multi-granular Compact Representations.",
                    "The COST Benchmark-Comparison and Evaluation of Spatio-temporal Indexes.",
                    "Efficient Maintenance of Ephemeral Data.",
                    "Mining Outliers in Spatial Networks.",
                    "Summarizing Frequent Patterns Using Profiles.",
                    "Mining Spatio-temporal Association Rules, Sources, Sinks, Stationary Regions and Thoroughfares in Object Mobility Databases.",
                    "Document Decomposition for XML Compression: A Heuristic Approach.",
                    "An Efficient Co-operative Framework for Multi-query Processing over Compressed XML Data.",
                    "Adaptively Indexing Dynamic XML.",
                    "TwigStackList-: A Holistic Twig Join Algorithm for Twig Query with Not-Predicates on XML Data.",
                    "Efficient Schemes of Executing Star Operators in XPath Query Expressions.",
                    "Exploit Sequencing to Accelerate XML Twig Query Answering.",
                    "Probabilistic Similarity Join on Uncertain Data.",
                    "Handling Uncertainty and Ignorance in Databases: A Rule to Combine Dependent Data.",
                    "PMJoin: Optimizing Distributed Multi-way Stream Joins by Stream Partitioning.",
                    "Clustering Peers Based on Contents for Efficient Similarity Search.",
                    "Optimizing Peer Virtualization and Load Balancing.",
                    "Distributed Network Querying with Bounded Approximate Caching.",
                    "Type-Level Access Pattern View: A Technique for Enhancing Prefetching Performance.",
                    "The Dynamic Sweep Scheme Using Slack Time in the Zoned Disk.",
                    "Authentication of Outsourced Databases Using Signature Aggregation and Chaining.",
                    "A Practitioner's Approach to Normalizing XQuery Expressions.",
                    "Hidden Conditioned Homomorphism for XPath Fragment Containment.",
                    "Efficient Query Processing for Streamed XML Fragments.",
                    "An Efficient Algorithm for Computing Range-Groupby Queries.",
                    "Ag-Tree: A Novel Structure for Range Queries in Data Warehouse Environments.",
                    "An XML Document Warehouse Model.",
                    "An Evaluation of Concurrency Control Protocols for Web Services Oriented E-Commerce.",
                    "COWES: Clustering Web Users Based on Historical Web Sessions.",
                    "A Precise Metric for Measuring How Much Web Pages Change.",
                    "Similarity Search in Transaction Databases with a Two-Level Bounding Mechanism.",
                    "RAF: An Activation Framework for Refining Similarity Queries Using Learning Techniques.",
                    "Query Optimization for a Graph Database with Visual Queries.",
                    "A Four Dimensional Petri Net Approach for Workflow Management.",
                    "Containment of Conjunctive Queries over Conceptual Schemata.",
                    "Data Tables with Similarity Relations: Functional Dependencies, Complete Rules and Non-redundant Bases.",
                    "Reuse or Never Reuse the Deleted Labels in XML Query Processing Based on Labeling Schemes.",
                    "Fast Reachability Query Processing.",
                    "Relation-Based Document Retrieval for Biomedical Literature Databases.",
                    "Effective Keyword Search in XML Documents Based on MIU.",
                    "Assessing the Completeness of Sensor Data.",
                    "Intelligent Statistics Management in Sybase ASE 15.0.",
                    "Holistic Schema Mappings for XML-on-RDBMS.",
                    "Semi-supervised Classification Based on Smooth Graphs.",
                    "Compacting XML Data.",
                    "Fast Structural Join with a Location Function.",
                    "Adapting Prime Number Labeling Scheme for Directed Acyclic Graphs.",
                    "KEYNOTE: Keyword Search by Node Selection for Text Retrieval on DHT-Based P2P Networks.",
                    "How to BLAST Your Database - A Study of Stored Procedures for BLAST Searches.",
                    "DTD-Diff: A Change Detection Algorithm for DTDs.",
                    "Mining Models of Composite Web Services for Performance Analysis.",
                    "Modeling Multimedia Data Semantics with MADS.",
                    "STIL: An Extended Resource Description Framework and an Advanced Query Language for Metadatabases.",
                    "Communication-Efficient Implementation of Range-Joins in Sensor Networks.",
                    "Efficient k-Nearest Neighbor Searches for Parallel Multidimensional Index Structures.",
                    "Efficient Non-Blocking Top-k Query Processing in Distributed Networks.",
                    "Continuous Expansion: Efficient Processing of Continuous Range Monitoring in Mobile Environments.",
                    "Effective Low-Latency K-Nearest Neighbor Search Via Wireless Data Broadcast.",
                    "Nearest Neighbor Queries for R-Trees: Why Not Bottom-Up?"
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10. DASFAA 2005",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2005",
                "sub_name": "Database Systems for Advanced Applications, 10th International Conference, DASFAA 2005, Beijing, China, April 17-20, 2005, Proceedings.",
                "count": 85,
                "papers": [
                    "Data Stream Mining and Resource Adaptive Computation.",
                    "Purpose Based Access Control for Privacy Protection in Database Systems.",
                    "Complex Networks and Network Data Mining.",
                    "Indexing DNA Sequences Using q-Grams.",
                    "PADS: Protein Structure Alignment Using Directional Shape Signatures.",
                    "LinkageTracker: A Discriminative Pattern Tracking Approach to Linkage Disequilibrium Mapping.",
                    "Query Optimization in Encrypted Database Systems.",
                    "Watermarking Spatial Trajectory Database.",
                    "Effective Approaches for Watermarking XML Data.",
                    "A Unifying Framework for Merging and Evaluating XML Information.",
                    "Efficient Evaluation of Partial Match Queries for XML Documents Using Information Retrieval Techniques.",
                    "PathStack : A Holistic Path Join Algorithm for Path Query with Not-Predicates on XML Data.",
                    "An Improved Prefix Labeling Scheme: A Binary String Approach for Dynamic Ordered XML.",
                    "Efficiently Coding and Indexing XML Document.",
                    "XQuery-Based TV-Anytime Metadata Management.",
                    "Effective Database Transformation and Efficient Support Computation for Mining Sequential Patterns.",
                    "Mining Succinct Systems of Minimal Generators of Formal Concepts.",
                    "A General Approach to Mining Quality Pattern-Based Clusters from Microarray Data.",
                    "Real Datasets for File-Sharing Peer-to-Peer Systems.",
                    "SemEQUAL: Multilingual Semantic Matching in Relational Systems.",
                    "A Metropolis Sampling Method for Drawing Representative Samples from Large Databases.",
                    "Stay Current and Relevant in Data Mining Research.",
                    "An Efficient Approach to Extracting Approximate Repeating Patterns in Music Databases.",
                    "On Efficient Music Genre Classification.",
                    "Effectiveness of Note Duration Information for Music Retrieval.",
                    "A Self-Adaptive Model to Improve Average Response Time of Multiple-Event Filtering for Pub/Sub System.",
                    "Filter Indexing: A Scalable Solution to Large Subscription Based Systems.",
                    "Caching Strategies for Push-Based Broadcast Considering Consecutive Data Accesses with Think-Time.",
                    "XDO2: A Deductive Object-Oriented Query Language for XML.",
                    "Extending XML with Nonmonotonic Multiple Inheritance.",
                    "Database Design with Equality-Generating Dependencies.",
                    "WDEE: Web Data Extraction by Example.",
                    "Concept-Based Retrieval of Alternate Web Services.",
                    "WSQuery: XQuery for Web Services Integration.",
                    "A New Indexing Method for High Dimensional Dataset.",
                    "BM+-Tree: A Hyperplane-Based Index Method for High-Dimensional Metric Spaces.",
                    "Approaching the Efficient Frontier: Cooperative Database Retrieval Using High-Dimensional Skylines.",
                    "False-Negative Frequent Items Mining from Data Streams with Bursting.",
                    "Adaptively Detecting Aggregation Bursts in Data Streams.",
                    "Communication-Efficient Implementation of Join in Sensor Networks.",
                    "Zoned-RAID for Multimedia Database Servers.",
                    "Randomized Data Allocation in Scalable Streaming Architectures.",
                    "Trace System of iSCSI Storage Access and Performance Improvement.",
                    "CoCache: Query Processing Based on Collaborative Caching in P2P Systems.",
                    "Multi-represented kNN-Classification for Large Class Sets.",
                    "Enhancing SNNB with Local Accuracy Estimation and Ensemble Techniques.",
                    "MMPClust: A Skew Prevention Algorithm for Model-Based Document Clustering.",
                    "Designing and Using Views to Improve Performance of Aggregate Queries (Extended Abstract).",
                    "Large Relations in Node-Partitioned Data Warehouses.",
                    "Mining Frequent Tree-Like Patterns in Large Datasets.",
                    "An Efficient Approach for Mining Fault-Tolerant Frequent Patterns Based on Bit Vector Representations.",
                    "NNF: An Effective Approach in Medicine Paring Analysis of Traditional Chinese Medicine Prescriptions.",
                    "From XML to Semantic Web.",
                    "A Hybrid Approach for Refreshing Web Page Repositories.",
                    "Schema Driven and Topic Specific Web Crawling.",
                    "Towards Optimal Utilization of Main Memory for Moving Object Indexing.",
                    "Aqua: An Adaptive QUery-Aware Location Updating Scheme for Mobile Objects.",
                    "A Spatial Index Using MBR Compression and Hashing Technique for Mobile Map Service.",
                    "Indexing and Querying Constantly Evolving Data Using Time Series Analysis.",
                    "Mining Generalized Spatio-Temporal Patterns.",
                    "Exploiting Temporal Correlation in Temporal Data Warehouses.",
                    "Semantic Characterization of Real World Events.",
                    "Learning Tree Augmented Naive Bayes for Ranking.",
                    "Finding Hidden Semantics Behind Reference Linkages : An Ontological Approach for Scientific Digital Libraries.",
                    "Xandy: Detecting Changes on Large Unordered XML Documents Using Relational Databases.",
                    "FASST Mining: Discovering Frequently Changing Semantic Structure from Versions of Unordered XML Documents.",
                    "Mining Positive and Negative Association Rules from XML Query Patterns for Caching.",
                    "Distributed Intersection Join of Complex Interval Sequences.",
                    "Using Prefix-Trees for Efficiently Computing Set Joins.",
                    "Maintaining Semantics in the Design of Valid and Reversible SemiStructured Views.",
                    "DCbot: Finding Spatial Information on the Web.",
                    "Improving Space-Efficiency in Temporal Text-Indexing.",
                    "Nearest Neighbours Search Using the PM-Tree.",
                    "Deputy Mechanism for Workflow Views.",
                    "Automatic Data Extraction from Data-Rich Web Pages.",
                    "Customer Information Visualization via Customer Map.",
                    "Finding and Analyzing Database User Sessions.",
                    "Time-Cognizant Recovery Processing for Embedded Real-Time Databases.",
                    "An Efficient Phantom Protection Method for Multi-dimensional Index Structures.",
                    "CMC: Combining Multiple Schema-Matching Strategies Based on Credibility Prediction.",
                    "Translating XQuery to SQL Based on Query Forests.",
                    "A New Indexing Structure to Speed Up Processing XPath Queries.",
                    "Translate Graphical XML Query Language to SQLX.",
                    "GTree: An Efficient Grid-Based Index for Moving Objects.",
                    "Adaptive Multi-level Hashing for Moving Objects."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9. DASFAA 2004",
        "info": "Jeju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2004",
                "sub_name": "Database Systems for Advances Applications, 9th International Conference, DASFAA 2004, Jeju Island, Korea, March 17-19, 2004, Proceedings.",
                "count": 80,
                "papers": [
                    "Genomic and Proteomic Databases and Applications: A Challenge for Database Technology.",
                    "Emergent Semantics Principles and Issues.",
                    "Index Clustering for High-Performance Sequential Index Access.",
                    "SF-Tree: An Efficient and Flexible Structure for Estimating Selectivity of Simple Path Expressions with Statistical Accuracy Guarantee.",
                    "UB-Tree Based Efficient Predicate Index with Dimension Transform for Pub/Sub System.",
                    "Approximate Counting of Frequent Query Patterns over XQuery Stream.",
                    "Counting Relaxed Twig Matches in a Tree.",
                    "XTree for Declarative XML Querying.",
                    "On Addressing Efficiency Concerns in Privacy-Preserving Mining.",
                    "Efficient Execution of Aggregation Queries over Encrypted Relational Databases.",
                    "A MAC-Based Service Bundle Authentication Mechanism in the OSGi Service Platform.",
                    "S-COI : The Secure Conflicts of Interest Model for Multilevel Secure Database Systems.",
                    "Modeling Temporally Variable Transportation Networks.",
                    "Statistic Driven Acceleration of Object-Relational Space-Partitioning Index Structures.",
                    "Path-Based Range Query Processing Using Sorted Path and Rectangle Intersection Approach.",
                    "Efficient Processing of Spatiotemporal Joins.",
                    "Skipping Strategies for Efficient Structural Joins.",
                    "Scaling SDI Systems via Query Clustering and Aggregation.",
                    "A Lightweight XML Repository Supporting Dynamic Partial Update of XML Data.",
                    "On View Transformation Support for a Native XML DBMS.",
                    "Similarity Search for Interval Time Sequences.",
                    "Discovering Geographical Features for Location-Based Services.",
                    "Polygon and Polyline Join Using Raster Filters.",
                    "Searching Proper Replications in Mapping XML into Relations.",
                    "A Semantics-Based Versioning Scheme for Multimedia Data.",
                    "DiffXML: Change Detection in XML Data.",
                    "Adaptive Quantization of the High-Dimensional Data for Efficient KNN Processing.",
                    "Indexing Iconic Image Database for Interactive Spatial Similarity Retrieval.",
                    "Concurrent Updating of Large Spatial Objects.",
                    "A Cost Model for Spatial Intersection Queries on RI-Trees.",
                    "Template-Based Proxy Caching for Table-Valued Functions.",
                    "On Improving Website Connectivity by Using Web-Log Data Streams.",
                    "Ontological and Pragmatic Knowledge Management for Web Service Composition.",
                    "Web Page Grouping Based on Parameterized Connectivity.",
                    "Reducing Communication Cost in a Privacy Preserving Distributed Association Rule Mining.",
                    "A Novel Representation of Sequence Data Based on Structural Information for Effective Music Retrieval.",
                    "Managing and Mining Clinical Outcomes.",
                    "An Efficient Approach for Maintaining Association Rules Based on Adjusting FP-Tree Structures1.",
                    "A Collaborative Recommendation Based on Neural Networks.",
                    "On Incorporating Iceberg Queries in Query Processors.",
                    "A Multiple Continuous Query Optimization Method Based on Query Execution Pattern Analysis.",
                    "An Efficient Approach for Partial-Sum Queries in Data Cubes Using Hamming-Based Codes.",
                    "Optimising Mediator Queries to Distributed Engineering Systems.",
                    "Automatic Generation of SQLX View Definitions from ORA-SS Views.",
                    "Semi-supervised Text Classification Using Partitioned EM.",
                    "FMACA: A Fuzzy Cellular Automata Based Pattern Classifier.",
                    "Music Classification Using Significant Repeating Patterns.",
                    "Applying Co-training to Clickthrough Data for Search Engine Adaptation.",
                    "Visual Interface for Evaluating Internet Search Results.",
                    "A Meta-search Method with Clustering and Term Correlation.",
                    "SUDEPHIC: Self-Tuning Density-Based Partitioning and Hierarchical Clustering.",
                    "Classification of Bio-medical Images Using Neuro Fuzzy Approach.",
                    "Optimized Fuzzy Classification for Data Mining.",
                    "Supporting Exploratory Queries in Databases.",
                    "A Web Page Scoring Method for Local Web Search Engines.",
                    "Discovering Aspects of Web Pages from Their Referential Contexts in the Web.",
                    "A Log-Based Cache Consistency Control of Spatial Databases in Mobile Computing Environments.",
                    "Improving Concurrency Control in Mobile Databases.",
                    "Just-in-Time Recommendation Using Multi-agents for Context-Awareness in Ubiquitous Computing Environment.",
                    "LFU-K: An Effective Buffer Management Replacement Algorithm.",
                    "Data Declustering with Replications.",
                    "Efficient Declustering of Non-uniform Multidimensional Data Using Shifted Hilbert Curves.",
                    "Efficient and Flexible Bitmap Indexing for Complex Similarity Queries.",
                    "Multimedia Data Integration and Navigation through MediaView: Implementation, Evolution and Utilization.",
                    "Union and Intersection of Filtering Functions for Information Filtering.",
                    "Efficient Transaction Processing in Mobile Data Broadcast Environments.",
                    "GBL: Group-Based Location Updating in Mobile Environment.",
                    "A Moving Point Indexing Using Projection Operation for Location Based Services.",
                    "EGA: An Algorithm for Automatic Semi-structured Web Documents Extraction.",
                    "An Automated Algorithm for Extracting Website Skeleton.",
                    "Ontologies on the MOVE.",
                    "Incremental Maintenance of Discovered Mobile User Maximal Moving Sequential Patterns.",
                    "Similarity Search and Dimensionality Reduction: Not All Dimensions Are Equally Useful.",
                    "Relative Queries and the Relative Cluster-Mapping Method.",
                    "Improving Query Effectiveness for Large Image Databases with Multiple Visual Feature Combination.",
                    "Dynamic Data Replication Using Aperiodic Updates in Mobile Adhoc Networks.",
                    "Stream Selection Policies for Transcoding Multimedia Presentations Composed of Multiple Streams to Play on Mobile Terminals.",
                    "Efficient Group Pattern Mining Using Data Summarization.",
                    "A Cost Effective Cache Consistency Method for Mobile Clients in Wireless Environment.",
                    "Supporting Benefit-Oriented Retrieval for Data on Air."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8. DASFAA 2003",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2003",
                "sub_name": "Eighth International Conference on Database Systems for Advanced Applications (DASFAA '03), March 26-28, 2003, Kyoto, Japan.",
                "count": 41,
                "papers": [
                    "A Survey of New Directions in Database System.",
                    "Similarity Join for Low-and High-Dimensional Data.",
                    "Spatial Query Processing for High Resolutions.",
                    "Effective Similarity Search on Voxelized CAD Object.",
                    "Discovering Direct and Indirect Matches for Schema Elements.",
                    "Gangam: A Transformation Modeling Framework.",
                    "Securing Your Data in Agent-Based P2P Systems.",
                    "Ascending Frequency Ordered Prefix-tree: Efficient Mining of Frequent Patterns.",
                    "An Efficient Sliding Window Algorithm for Detection of Sequential Pattern.",
                    "Caucus-based Transaction Clustering.",
                    "TAX-PQ: Dynamic Taxonomy Probing and Query Modification for Topic-Focused Web Searc.",
                    "Finding a Web Community by Maximum Flow Algorithm with HITS Score Based Capacity.",
                    "Scalable View Expansion in a Peer Mediator System.",
                    "Mining Emerging Substrings.",
                    "Fast Text Classification: A Training-Corpus Pruning Based Approac.",
                    "Efficient Record Linkage in Large Data Sets.",
                    "Maintenance of Partial-Sum-Based Histograms.",
                    "Selectivity Estimation Using Orthogonal Series.",
                    "Error Minimization for Approximate Computation of Range Aggregate.",
                    "Q+Rtree: Efficient Indexing for Moving Object Database.",
                    "Efficient Index Update for Moving Objects with Future Trajectories.",
                    "Prefetching for Visual Data Exploratio.",
                    "Freshness-driven Adaptive Caching for Dynamic Content.",
                    "Time-Stratified Sampling for Approximate Answers to Aggregate Queries.",
                    "The BofS Solution to Limitations of Approximate Summaries.",
                    "An Efficient and Interactive A*-Algorithm with Pruning Power: Materialized View Selection Revisited.",
                    "Supporting Selection-Projection XQuery Processing Based on Encoding Paths.",
                    "Fast and Versatile ath Index for Querying Semi-Structured Data.",
                    "PathGuide: An Efficient Clustering Based Indexing Method for XML Path Expressions.",
                    "Indexing High-Dimensional Data for Content-Based Retrieval in Large Databases.",
                    "Search: Mining Retrieval History for Content-Based Image Retrieval.",
                    "M-Kernel Merging: Towards Density Estimation over Data Streams.",
                    "Composition of Filtering Functions.",
                    "Approximate String Matching in DNA Sequences.",
                    "An Efficient Index-based Protein Structure Database Searching Method.",
                    "Integrating, Managing and Analyzing Protein Structures with XML Databases.",
                    "Clustering Method for Comparative Analysis between Genomes and Pathways.",
                    "Cost-Driven Storage Schema Selection for XML.",
                    "Performance Enhancement through Structural Redundancy in Mapping XML into Relations.",
                    "Mining Frequent Quer Patterns from XML Queries.",
                    "GLASS: A Graphical Query Language for Semi-Structured Data."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7. DASFAA 2001",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/2001",
                "sub_name": "Database Systems for Advanced Applications, Proceedings of the 7th International Conference on Database Systems for Advanced Applications (DASFAA 2001), 18-20 April 2001 - Hong Kong, China.",
                "count": 54,
                "papers": [
                    "Web Data and the Resurrection of Database Theory.",
                    "Integrating Web Based Applications - Challenges and Opportunities.",
                    "A Rule-Based Query Language for HTML.",
                    "Modeling and Manipulating Multidimensional Data in Semistructured Databases.",
                    "A New Query Processing Technique for XML Based on Signature.",
                    "'1 + 1 > 2': Merging Distance and Density Based Clustering.",
                    "A Similarity-Based Soft Clustering Algorithm for Documents.",
                    "Gradual Clustering Algorithms.",
                    "A Binary-Categorization Approach for Classifying Multiple-Record Web Documents Using Application Ontologies and a Probabilistic Model.",
                    "SOM-Based Methodology for Building Large Text Archives.",
                    "PAGE CUBE: A Model for Storage and Retrieval of Documents Relevant to a Document Production Workflow in an Office.",
                    "An Empirical Study on the Visual Cluster Validation Method with Fastmap.",
                    "Distance Courseware Discrimination Based on Representative Sentence Assaying.",
                    "Encapsulating Classification in an OODBMS for Data Mining Applications.",
                    "Introducing Cooperation and Actions in Amalgamated Knowledge Bases.",
                    "A Logical Foundation for Deductive Object-Oriented Databases.",
                    "Multi-Cube Computation.",
                    "ADODA: A Desktop Online Data Analyzer.",
                    "A Process of Abstracting T-RBAC Aspects from Enterprise Environment.",
                    "Analyzing the Critical Path for the Well-Formed Workflow Schema.",
                    "Facilitating Workflow Evolution in an Advanced Object Environment.",
                    "Conceptual Graphs as Schemas for Semi-structured Databases.",
                    "Improving the Fairness of Timely Refresh of Web Views.",
                    "Mining Small Databases by Collecting Knowledge.",
                    "Fractionalized View Materialization in Data Cubes.",
                    "Predicate-based Caching in Mobile Clients for Continuous Partial Match Queries.",
                    "Integration of Spatial Information Sources Based on Source Description Framework.",
                    "FBDA: A Filtering Mechanism Based on Distance Approximation.",
                    "WebCarrousel: Restructuring Web Search Results for Passive Viewing in Mobile Environments.",
                    "A Unified Retrieval Method of Multimedia Documents.",
                    "Content-Based Retrieval using Trajectories of Moving Objects in Video Databases.",
                    "An Architecture of Personalized Sports Digest System with Scenario Templates.",
                    "The ANN-tree: An Index for Efficient Approximate Nearest Neighbor Search.",
                    "SOM-Based R*-tree for Similarity Retrieval.",
                    "RING: A Strategy for Minimizing the Cost of Online Data Placement Reorganization for Btree Indexed Database over Shared-nothing Machines.",
                    "An Enhanced Concurrency Control Scheme for Multi-Dimensional Index Structures.",
                    "A Data Delivery Strategy in Ubiquitous Computing Systems.",
                    "An Efficient Method for Generating Location Updates for Processing of Location-Dependent Continuous Queries.",
                    "Using Remote Joins for the Processing of Distributed Mobile Queries.",
                    "A Novel Conflict Detection and Resolution Strategy Based on TLRSP in Replicated Mobile Database Systems.",
                    "Toward a Query Language on Simulation Mesh Data: An Object-oriented Approach.",
                    "Comparison of Parallel Algorithms for Path Expression Query in Object Database Systems.",
                    "Modeling Workflows with a Process-View Approach.",
                    "Options: A Way for Achieving Failure Atomicity in the WorkMan System.",
                    "Improving Backward Recovery in Workflow Systems.",
                    "About Precision and Integrity in Visual Query Languages for Spatial Databases.",
                    "Design and Implementation of a Multi-modal User Interface of the Virtual World Database System (VWDB).",
                    "Querying Multiple Perspective Video by Camera Metaphor.",
                    "An Efficient Method for Queries Execution in a Multi-User Environment.",
                    "Histogram Methods in Query Optimization: The Relation between Accuracy and Optimality.",
                    "Optimization for Queries with Holistic Functions.",
                    "Ensuring Data Consistency in Large Network Systems.",
                    "Algebraic Service Specification and Rule Generation for Integrating Multiple Dissemination-Based Information Sources.",
                    "Concurrency Control and Data Replication Strategies for Large-scale and Wide-distributed Databases."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "ADBIS-DASFAA 2000",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/adbis/2000",
                "sub_name": "Current Issues in Databases and Information Systems, East-European Conference on Advances in Databases and Information Systems Held Jointly with International Conference on Database Systems for Advanced Applications, ADBIS-DASFAA 2000, Prague, Czech Republic, September 5-8, 2000, Proceedings.",
                "count": 34,
                "papers": [
                    "An Advanced Processing Environment for Managing the Continuous and Semistructured Features of Multimedia Content.",
                    "Database Systems as Middleware-Events, Notification, Messages.",
                    "Managing Schemata for Semistructured Databases Using Constraints.",
                    "Caching for Mobile Communication.",
                    "Efficient Cache Management Protocol Based on Data Locality in Mobile DBMSs.",
                    "Algorithms for Rewriting Aggregate Queries Using Views.",
                    "A New High-Dimensional Index Structure Using a Cell-Based Filtering Technique.",
                    "Active System for Heterogeneous ODBMS Using Mobile Rule Codes.",
                    "2-D Spatial Indexing Scheme in Optimal Time.",
                    "Mining around Association and Representative Rules.",
                    "A New Algorithm for Page Access Sequencing in Join Processing.",
                    "Data Organization Issues for Location-Dependent Queries in Mobile Computing.",
                    "Towards Intelligent Information Retrieval Engines: A Multi-agent Approach.",
                    "Design and Implementation of a Novel Approach to Keyword Searching in Relational Databases.",
                    "A Rule-Oriented Architecture to Incorporate Dissemination-Based Information Delivery into Information Integration Environments.",
                    "Hierarchical Materialisation of Method Results in Object-Oriented Views.",
                    "Finding Generalized Path Patterns for Web Log Data Mining.",
                    "Size Estimation of the Intersection Join between Two Line Segment Datasets.",
                    "Distributed Searching of k-Dimensional Data with Almost Constant Costs.",
                    "X2QL: An eXtensible XML Query Language Supporting User-Defined Foreign Functions.",
                    "Decision Committee Learning with Dynamic Integration of Classifiers.",
                    "Multiversion Linear Quadtree for Spatio-Temporal Data.",
                    "On the Analysis of On-Line Database Reorganization.",
                    "Systematization of Approaches to Equality-Generating Constraints.",
                    "Efficient Region Query Processing by Optimal Page Ordering.",
                    "On Deploying and Executing Data-Intensive Code on SMart Autonomous Storage (SmAS) Disks.",
                    "An Efficient Storage Manager.",
                    "A Timeout-Based Mobile Transaction Commitment Protocol.",
                    "Flexible Integration of Optimistic and Pessimistic Concurrency Control in Mobile Environments.",
                    "An Analysis of Alternative Methods for Storing Semistructured Data in Relations.",
                    "Main-Memory Management in Temporal Object Database Systems.",
                    "Design Issues in Transaction-Time Temporal Object Database Systems.",
                    "Mobile Transaction Management in Mobisnap.",
                    "How to Manage Evolution in OODB?"
                ]
            },
            {
                "sub_name_abbr": "conf/adbis/2000s",
                "sub_name": "Proceedings of Chalenges, 2000 ADBIS-DASFAA Symposium on Advances in Databases and Information Systems, Enlarged Fourth East-European Conference on Advances in Databases and Information Systems, Prague, Czech Republic, September 5-8, 2000.",
                "count": 27,
                "papers": [
                    "Keyword Assignment to Images Using Sliding Windows.",
                    "Agent-Based Traveling.",
                    "A New Technique to Speedup Queries in Data Warehousing.",
                    "Transformation of UML Models into XML.",
                    "Association Rule Discovery in Highly-Correlated Data: a Case Study in Web Usage Mining.",
                    "User Adapted Queries for Automated Selection and Sequencing of Learning Resources.",
                    "Spatial-match Iconic Image Representation Schemes Supporting Ranking for Indexing and Querying in Visual Databases.",
                    "Drill-Across Based on Association Rules.",
                    "MARS: A Retrieval Service for Multimedia Authoring Environments.",
                    "Active and Nomadic Transactions in Mobile Databases.",
                    "The System DIKE: Towards the Semi-Automatic Synthesis of Cooperative Information Systems and Data Warehouses.",
                    "Combining Content-Based and Collaborative Filtering.",
                    "An Object Data Warehousing Approach: a Web Site Repository.",
                    "A Benchmarking Technique for DBMS's with Advanced Data Models.",
                    "Integration of Web Information Sources by Mobile Users: Navigational Style of Integration and System Architecture.",
                    "Integrating Bibliographical Data from Heterogeneous Digital Libraries.",
                    "GeoQA: a Visual Query and Analysis Tool for Geographic Information System Applications.",
                    "Using XML and Regular Expressions in the Syntactic Analysis of Inflectional Language.",
                    "Modelling the Modification Component of an Information Service.",
                    "Discovering Frequent Episodes in Sequences of Complex Events.",
                    "HASH-MINE: A New Frameword for Discovery of Frequent Itemsets.",
                    "Designing an Object-Relational Data Warehousing System: Project ORDAWA.",
                    "Database and Information Systems Research in Yugoslavia.",
                    "Database Research Activities in Russia: a Brief Overview.",
                    "Database Research and Development in Japan.",
                    "Database Research in Czech Republic.",
                    "Computing Science Research Activities at the Faculty of Electrical Engineering, Computer Science and Informatics."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6. DASFAA 1999",
        "info": "Taiwan, ROC",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/99",
                "sub_name": "Database Systems for Advanced Applications, Proceedings of the Sixth International Conference on Database Systems for Advanced Applications (DASFAA), April 19-21, Hsinchu, Taiwan.",
                "count": 40,
                "papers": [
                    "Research and Development of Advanced Database Systems for Integration of Media and User Environments.",
                    "Data Mining and Personalization Technologies.",
                    "Supporting Web-Based Database Application Development.",
                    "Adaptive and Incremental Query Expansion for Cluster-based Browsing.",
                    "An Interactive Classification of Web Documents by Self-Organizing Maps and Search Engines.",
                    "Mining Exception Instances to Facilitate Workflow Exception Handling.",
                    "Specifying Complex Process Control Aspects in Workflows for Exception Handling.",
                    "An Approach for Generating File Interfaces.",
                    "WebView: A Tool for Retrieving Internal Structures and Extracting Information from HTML Documents.",
                    "Design and Implementation of a Structured Information Retrieval System for SGML Documents.",
                    "Index Design for Structured Documents Based on Abstraction.",
                    "Visualization of Path Expressions in a Virtual Object-Oriented Database Query Language.",
                    "Video Description Model Based on Prototype-Instance Model.",
                    "A Fuzzy Object Query Language (FOQL) for Image Databases.",
                    "Real-Time Transaction Management in Mobile Computing Systems.",
                    "QEM: A Scheduling Method for Wireless Broadcast Data.",
                    "An Active Replication Scheme for Mobile Data Management.",
                    "Spatial Presentation and Aggregation of Georeferenced Data.",
                    "Early Separation of Filter and Refinement Steps in Spatial Query Optimization.",
                    "Development of Multi-step Filtering Processor.",
                    "An Effective Boolean Algorithm for Mining Association Rules in Large Databases.",
                    "Summary Grids: Building Accurate Multidimensional Histograms.",
                    "Feature Reduction for Neural Network Based Text Categorization.",
                    "Discover Relaxed Periodicity in Temporal Databases.",
                    "Approximation Techniques for Indexing Two-Dimensional Constraint Databases.",
                    "P-Tree: A B-Tree Index for Lists.",
                    "A Restructuring Method for the Concurrent B+-Tree Based on Semantic Consistency.",
                    "Parallel R-Tree Search Algorithm on DSVM.",
                    "Materialized View Evolution Support in Data Warehouse Environment.",
                    "Pi-Web Join in a Web Warehouse.",
                    "Materialized View Maintenance Using Version Numbers.",
                    "Design and Implementation of a CORBA Query Service Accessing EXPRESS-based Data.",
                    "FRAGTIQUE: An OO Distribution Design Methodology.",
                    "Change Management with Roles.",
                    "A Design and Implementation of Savepoints and Partial Rollbacks Considering Transaction Isolation Levels of SQL2.",
                    "Recovery in Distributed Extended Long-lived Transaction Models.",
                    "An Adaptable Constrained Locking Protocol for High Data Contention Environments.",
                    "Multiple Dynamic View Support for Cooperative Work.",
                    "Maintenance of Placement Dependency in Distributed Multidatabase Systems.",
                    "A Middleware Implementation of Active Rules for ODBMS."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5. DASFAA 1997",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/97",
                "sub_name": "Database Systems for Advanced Applications '97, Proceedings of the Fifth International Conference on Database Systems for Advanced Applications (DASFAA), Melbourne, Australia, April 1-4, 1997.",
                "count": 57,
                "papers": [
                    "Title, Preface, PC Chairperson's Introduction, Organization, Program Committee, Referees.",
                    "A Cost Model for Parallel Navigational Access in Complex-Object DBMSs.",
                    "Cost-Driven Evaluation of Vertical Class Partitioning in Object-Oriented Databases.",
                    "Query Optimization Techniques Utilizing Path Indexes in Object-Oriented Database Systems.",
                    "Classifying Network Architectures for Locating Information Sources.",
                    "Server Ranking for Distributed Text Retrieval Systems on the Internet.",
                    "Attribute-Based Automatic Network Map Scaling.",
                    "Supporting Object Migration in Distributed Systems.",
                    "Modelling Moving Objects in Multimedia Databases.",
                    "Failure Handling in CORBAflow: A CORBA-Based Transactional Workflow Architecture.",
                    "A Graph-Theoretic Model for Optimizing Large Join Queries.",
                    "Query Size Estimation Using Machine Learning.",
                    "Supporting Distributed Query Processing in a Heterogeneous Environment.",
                    "Duplicate-Free Generation of Alternatives in Transformation-Based Optimizers.",
                    "An Indexing Scheme for Structured Documents and its Implementation.",
                    "Client-Server Optimization for Multimedia Document Exchange.",
                    "A Data Modelling and Query Processing Scheme for Integration of Structured Document Repositories and Relational Databases.",
                    "Use of a Persistent Graph Abstract Data Type for Representing CASE Tools Repositories.",
                    "A Break for Workaholics: Energy-Efficient Selective Tuning Mechanisms for Demand-Driven-Based Wireless Environment.",
                    "Increasing Concurrency in Object-Oriented Databases for Software Engineering Environments.",
                    "A General Incremental Technique for Maintaining Discovered Association Rules.",
                    "Reduction of Update Propagation Overhead for Data Warehousing Incorporating OODBs.",
                    "A SOM-Based Information Organizer for Text and Video Data.",
                    "Performance in Practice of String Hashing Functions.",
                    "Optimal Type Hierarchy Linearization for Queries in OODB.",
                    "MIN-Entropy: A New Signature File Declustering Algorithm for Intra-Query Parallelism.",
                    "An Integration Methodology for Autonomous Taxonomy Databases Using Priorities.",
                    "A Redundancy-Based Optimization Approach for Aggregation in Multidimensional Scientific and Atatistical Databases.",
                    "The Cube-Query-Languages (CQL) for Multidimensional Statistical and Scientific Database Systems.",
                    "Language Constructs for Reliable Distributed Real-Time Transaction Processing.",
                    "Database Transactions in a Purely Declarative Logic Programming Language.",
                    "Mini-Savepoints: Firewalls for Atomic Updates.",
                    "A Boolean Algebra Approach for Class Hierarchy Normalization.",
                    "Using Security Methods to Enforce Mandatory and Discretionary Access Control in an Object Database.",
                    "Schema Versions in Object-Oriented Database Systems.",
                    "A Multimedia Query Language for Handling Multi-Structure Information.",
                    "Modelling an Engineering Design Application Using Extended Object-Oriented Concepts.",
                    "A Unified Approach to Representations, Synchronization and Storage of Temporal Multimedia Objects Based on Time Interval Logic.",
                    "Modelling Valid Time: An Efficient Representation.",
                    "Layered Temporal DBMS: Concepts and Techniques.",
                    "Implementing Temporal Databases in Object-Oriented Systems.",
                    "Efficient View Maintenance in a Multidatabase Environment.",
                    "A Methodology of Integrating Fuzzy Relational Databases in a Multidatabase System.",
                    "Restructuring Class Hierarchies for Schema Integration.",
                    "Combining Multiple Evidence from Different Relevant Feedback Networks.",
                    "A Wrapping Architecture for IR Systems to Mediate External Structured Document Sources.",
                    "Distributed Query Processing for Clustered and Bibliographic Databases.",
                    "An Effective Tutoring Technique for fast Condition Evaluation in Active Databases.",
                    "Analysis of Cassette Migration Activities in Scalable Tape Archiver.",
                    "Implementation and Evaluation of the Bucket Flattening Omega Network of the Parallel Relational Database Server SDC-II.",
                    "Virtual Batching: A New Scheduling Technique for Video-on-Demand Servers.",
                    "On Video-on-Demand sSrvers with Hierarchical Storage.",
                    "Supporting Dynamic Relocation of Video Data in Disk-Array-Based Video Servers.",
                    "A Parallel Execution Model for Database Transactions.",
                    "Distributed Resource Management in Workflow Environments.",
                    "Achieving High Degree of Concurrency in Multidatabase Transaction Scheduling.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4. DASFAA 1995",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/95",
                "sub_name": "Database Systems for Advanced Applications '95, Proceedings of the 4th International Conference on Database Systems for Advanced Applications (DASFAA), Singapore, April 11-13, 1995.",
                "count": 56,
                "papers": [
                    "Title, Preface, PC Chairperson's Message, Organization, Program Committee, Referees.",
                    "Object Deputy Model and Its Applications.",
                    "The Management of Interdependent Asynchronous Transactions in Heterogeneous Database Environments.",
                    "Object-Oriented Views of Relational Databases Incorporating Behaviour.",
                    "Maintaining Schemata Consistency for Interoperable Database Systems.",
                    "An Extension of SQL for Relations of History Expressions.",
                    "An Event Algebra for Specifying and Scheduling Workflows.",
                    "Hyper-Agenda: A System to Organize and Realize Tasks.",
                    "An Approach to Intelligent Software Library Management.",
                    "Continuous Media Sharing in Multimedia Database Systems.",
                    "Cost Efficient Adaptive Protocol with Buffering for Advanced Mobile Database Applications.",
                    "Gaming-Simulations of Multi-Agent Information Systems using Large Databases: The Concept and Database Algorithms.",
                    "Combining Indexing Technique with Path Dictionary for Nested Object Queries.",
                    "A New Algorithm for Processing Joins Using the Multilevel Grid File.",
                    "Signature False Drops due to Combinatorial Error.",
                    "On Marrying Relations and Objects: Relation-Centric and Object-Centric Perspectives.",
                    "A Query Interface Truly for Chinese Users.",
                    "A Visual Representation of Complex Relationships for Object-Oriented Databases.",
                    "Multimedia Application Programming Interface Framework.",
                    "On the Issues of Expressiveness and Portability of Chiql.",
                    "A Deductive Database Solution to Intelligent Information Retrieval from Legacy Databases.",
                    "DatalogA: Array Manipulations in a Deductive Database Language.",
                    "Set-Term Matching in a Logic Database Language.",
                    "Modeling, Chaining and Fusion of Uncertain Knowledge.",
                    "OODB Support for Real-Time Open-Architecture Controllers.",
                    "Real-Time Replication Control for Distributed Database Systems: Algorithms and Their Performance.",
                    "Real-Time Multiversion Concurrency Control Using Precedence Relationship.",
                    "Data Compression Management Mechanism for Real-Time Main Memory Database Systems.",
                    "Batch Query Processing in Shared-Nothing Multiprocessors.",
                    "Dynamic Join Product Skew Handling for Hash-Joins in Shared-Nothing Database Systems.",
                    "Load Balancing in Distributed Query Processing.",
                    "Implementing Dynamic Code Assembly for Client-Based Query Processing.",
                    "The ODMG Standard for Object Databases.",
                    "Evolution Features of the F2 OODBMS.",
                    "Object Migration in ISA Hierarchies.",
                    "Transform More Semantics from Relational Databases into Object-Oriented Semantics Databases.",
                    "Formally Speaking About Schemata, Bases, Classes and Objects.",
                    "Extensible Data Modeling for Statistical Databases.",
                    "Intelligent Mathematical Databases.",
                    "Genetic Sequence Annotation within Biological Databases.",
                    "Spatial Database Querying with Logic Languages.",
                    "Incorporating Flexible and Expressive Rule Control in a Graph-Based Transaction Framework.",
                    "Synchronization Attributes and Rules of Active Object-Oriented Database for Multimedia Presentation.",
                    "An Efficient Algorithm for Deriving Compact Rules from Databases.",
                    "On Foundations of Constraint Optimization.",
                    "A Two-Phase Approach to Data Allocation in Distributed Databases.",
                    "Performance Evaluation of Replica Control Algorithms in a Locally Distributed Database System.",
                    "An Efficient Representation of Distributed Fragments of Recursive Relations.",
                    "Trading Operation Consistency for Concurrency.",
                    "Archiving Techniques for Temporal Databases.",
                    "Temporal Object-Oriented Data Model for the Schema Modification.",
                    "A Temporal Expansion to the Multimedia Object Model in OMEGA.",
                    "Object-Oriented Modeling and Quering of Hypermedia Documents.",
                    "A Formal Model for Databases of Structured Text.",
                    "Incremental Data Organization for Ancient Document Databases.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "3. DASFAA 1993",
        "info": "Daejeon, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/93",
                "sub_name": "Proceedings of the 3rd International Conference on Database Systems for Advanced Applications (DASFAA), Daejeon, Korea, April 6-8, 1993.",
                "count": 53,
                "papers": [
                    "Title, Preface, PC Chairperson's Message, OC Chairperson's Message, Organization, Referees.",
                    "Towards Dynamics Animation on Object-Oriented Animation Database System \"MOVE\".",
                    "Relational Query Formulation by Pseudonatural Language Text Manipulation.",
                    "Similarity Retrieval on Pictorial Databases Based upon Module Operation.",
                    "Efficient Global Transaction Management in Multidatabase Systems.",
                    "Schema Transformation Processors for Federated Objectbases.",
                    "Determining Schema Interdependencies in Object-Oriented Multidatabase Systems.",
                    "PINOL: A Persistent Inferential Object Oriented Language for Databases.",
                    "Object-Oriented Database with Rule-Based Query Interface for Genomic Computation.",
                    "LRU-S: A New Buffer Allocation Approach for OODBMS.",
                    "Enhanced Tree Quorum Algorithm for Replicated Distributed Databases.",
                    "Data Fragmentation and Allocation for PC-Based Distributed Database Design.",
                    "Strategies for Selection from Heterogeneous Relations.",
                    "Information Integration through Contract.",
                    "The DiNG - A Parallel Multiattribute File System for Deductive Database Machines.",
                    "Database User Interface Design Editor.",
                    "An Object-Centered Data Model for Engineering Design Databases.",
                    "Conceptual Layers in an Object Oriented Database. An Unified Model.",
                    "Generating Object-Oriented Views from an ER-Based Conceptual Schema.",
                    "A Parallel Pattern Search Algorithm for Processing Object-Oriented Databases in a Cellular Array Architecture.",
                    "Evaluation of a Parallel Database Machine for Caller Dependent Routing.",
                    "A Design of a Transparent Backup System Using a Main Memory Database.",
                    "Abstract Indexing Mechanism of the Extensible DBMS Modus.",
                    "A New Indexing and Text Ranking Method for Japanese Text Databases Using Simple-Word Compounds as Keywords.",
                    "B-Tree Concurrency Control Algorithm for Nested Transaction Systems.",
                    "Scheduling and Concurrency Control for Real-Time Database Systems.",
                    "A Protocol for Consistent Checkpointing Recovery for Time-Critical Distributed Database Systems.",
                    "A Token-Based Synchronization Scheme Using Epsilon-Serializability and Its Performance for Real-Time Distributed Database Systems.",
                    "Query Processing Techniques in the Team-Oriented Database Query Language.",
                    "Distributive Join Algorithm for Cube-Connected Multiprocessors.",
                    "Optimization of Chain Queries.",
                    "Database Updates Using Active Rules: A Unified Approach for Consistency Maintenance.",
                    "A Database Rule Language Compiler Supporting Parallelism.",
                    "A Knowledge Based System Converting ER Model into an Object-Oriented Database Schema.",
                    "Design of Historical Databases Using the 3-D Relational Data Model.",
                    "Offstage Objects and their Renovations in the Temporal Object System TOS.",
                    "Logical Data Independence Via Views: A Misapprehension?",
                    "Optimizing Distributed Integrity Constraints.",
                    "On Deriving Specialization Constraints over Complex Objects.",
                    "Improving Integrity Checking for Exists-Constraints.",
                    "On Exclusive Disjunctions in Deductive Database.",
                    "A Fuzzification of the Relational Data Model.",
                    "Enhancing the Fuzzy Set Model with Positively Compensatory Operators.",
                    "A Pessimistic Concurrency Control Algorithm in Multidatabase Systems.",
                    "An Optimistic Concurrency Control Protocol for Real-Time Database Systems.",
                    "New Disk Scheduling Algorithms for Reduced Rotational Latency.",
                    "Applying Intensional Query Processing Techniques to Object-Oriented Database Systems.",
                    "Heterogeneous Query Optimization Using Maximal Sub-Queries.",
                    "Temporal Query Processing for Scene Retrieval in Motion Image Databases.",
                    "Efficient Processing of Time-Joins in Temporal Data Bases.",
                    "Qualitative Behavior Modeling of Information Processing Components.",
                    "A Multimedia Database for an Advanced Teleshopping Application.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2. DASFAA 1991",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/91",
                "sub_name": "Database Systems for Advanced Applications '91, Proceedings of the Second International Symposium on Database Systems for Advanced Applications, Tokyo, Japan, April 2-4, 1991.",
                "count": 67,
                "papers": [
                    "Title, Preface, PC Chairperson's Message, Sponsors, Organization, Referees.",
                    "Query Processing in OODB.",
                    "Semantic Query Processing in Object-Oriented Database Systems.",
                    "Answering Queries in Temporal Object-Oriented Databases.",
                    "A Hierarchical Export/Import Scheme for Data Sharing in a Federated Distributed Database System.",
                    "The PCTE+'s OMS, A Software Engineering Distributed Database System for supporting Large-Scale Software Development Environments.",
                    "Implementing a Distributed Real-Time Database Manager.",
                    "Desktop Schema Evolution - Editing Schema.",
                    "A Visual User Interface for a Personal Information Base using a Concept Network.",
                    "SMILE: A Visual Query Interface for an Engineering Database.",
                    "A Universal Relation Database Interface for Knowledge Based Systems.",
                    "A Query Algebra for an Extended Object-Oriented Database Model.",
                    "Performance of Query Optimization Heuristics in Object-Oriented Databases.",
                    "PC++: An Object-Oriented Database System for C++ Applications.",
                    "Translation of SQL Queries Containing Nested Predicated into Pseudonatural Language.",
                    "A Multi-Environment Cost Evaluator for Parallel Database Systems.",
                    "Restricting Is-A Related Groupings Using Object Equivalence.",
                    "Real-Time Database Scheduling: Design, Implementation, and Performance Evaluation.",
                    "Design and Implementation of the Multiuser Index-based Data Access System.",
                    "Improved Overflow Handling with Linear Hashing.",
                    "An Object Behavior Modeling Augmented with Modeling Integrity Constraints.",
                    "Expanding the Notion of Operations in an Object-Oriented Database.",
                    "Controlling Concurrent Accesses in an Object-Oriented Environment.",
                    "The Aditi Deductive Database System (Extented Abstract).",
                    "Evaluation of Extended Recursive Queries in Deductive Databases.",
                    "LOLA - A Logic Language for Deductive Databases and its Implementation.",
                    "Massively Parallel Relational Database Processing on the Connection Machine CM-2.",
                    "Realization of Continuously Backed-up RAMs for High-Speed Database Recovery.",
                    "Acceleration of Join Operations by a Relational Database Processor, RINDA.",
                    "Indefinite Information with Certainty Factors for Object-Oriented Databases.",
                    "A View Environment to Reuse Class Hierarchies in an Object-Oriented Database System.",
                    "A View Class Mechanism for Object-Oriented Database Systems.",
                    "A Data Model for Design Objects.",
                    "Clustering of Composite Objects for CAD Databases.",
                    "Papyrus: A Structured History Database for VLSI Design Flow Management.",
                    "Design of a Large-scale Customer Information Database: Reconstruction of Integrated Customer Information System at Kansai Electric Power Co., Inc.",
                    "Reflective Viewing and Interactive Synchronization in Hypermedia Editing.",
                    "Object-Oriented Multimedia Annotation for Large-Scale Mapping System.",
                    "MOOD: A Knowledgebase System with Objectoriented Deduction.",
                    "ACTROB: An Actice Robotic Knowledge Base.",
                    "TANGUY: Integrating Database, Rule-based and Object-Oriented Paradigms.",
                    "AUTO-QUIZ: An Automatic ACCESS Statement Generator for QUIZ Query.",
                    "Syntactic Query Processing: Dealing with Structure and Time.",
                    "Optimization of Queries Including ADT Functions.",
                    "MegaLog - A platform for developing Knowledge Base Management Systems.",
                    "The Implementation of DBMS for the Specific Field.",
                    "ATENA: A Distributed Name Guide Server in Electronic Mail System.",
                    "The Object-Oriented Relationship System for Managing Complex Relationships.",
                    "An Entity-Relationship Enhanced Logic System.",
                    "The LAURE Model for Object-Oriented Logic Databases.",
                    "Applications of Object-oriented Databases to Publishing Systems.",
                    "DAVID Universal Books Management System.",
                    "Office Work Coordination Using a Distributed Database System.",
                    "Designing Natural Language Objects.",
                    "The Multilevel Grid File - A Dynamic Hierarchical Multidimensional File Structure.",
                    "A New Grid Version Storage Technique.",
                    "A Superimposed Codeword Indexing Scheme for Handling Sets in Prolog Databases.",
                    "INTERVISION: A New Hypermedia System Focusing on Dynamic Media.",
                    "A HyperNet Model for Large Hypertext Systems.",
                    "Performance Evaluation of Automatic Name Placement Functions for Geographical Database Systems.",
                    "Automatic Transformation of linear Text into Hypertext.",
                    "A Heuristic Method for Document Ranking.",
                    "A Cooperative Transaction Model Handling Multiple Correctness Levels.",
                    "A Framework for Version-based Cooperation Control.",
                    "An Open Data Management Architecture for Groupware Applications.",
                    "Advanced Applications and Future Research Issues of OODBs.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "1. DASFAA 1989",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/dasfaa/89",
                "sub_name": "International Symposium on Database Systems for Advanced Applications, Seoul, Korea, April 10-12, 1989.",
                "count": 49,
                "papers": [
                    "Title, Sponsors, Preface, Foreword, Organization, Referees.",
                    "The Architecture of Future Information Systems (Abstract).",
                    "Supporting the Character Sets of Japanese Kanji and Korean Hangul in the ADABAS/NATURAL System.",
                    "Map-Oriented Visual Language: MOL.",
                    "HistoryChart: A Visual Language for Historical Databases.",
                    "Navigation in the Visual Information Database World.",
                    "Case-Based Evolutionary World Model for Electronic Secretaries.",
                    "A Logical Summary-Data Model for Macro Statistical Databases.",
                    "Design and Evaluation of a High-Speed Extended Relational Database Engine, XRDB.",
                    "Knowledge Base for Database Design.",
                    "Impacts of Advanced Applications on Databases (Panel Abstract).",
                    "Design Methodology for Computer Animation Database Systems.",
                    "Functional Approach to Chemical Structure Databases.",
                    "Design of Database Schemata for Logic Design Education System LODES.",
                    "A Multi-Level Transaction Model for Engineering Applications.",
                    "Knowledge Base System in a Logic Programming Paradigm.",
                    "An Enhanced RETE Algorithm for Large Scale Data Access.",
                    "Some Properties of Knowledge Information Inferred by Two Interactive Default Reasoning Systems.",
                    "A Knowledge/Based Approach to Multiple Query Processing.",
                    "GIONS: Games Information Online Network System.",
                    "A Table Driven User-Friendly Interface for Relational Databases.",
                    "ILRCS - Interactive Library Resources Circulation System.",
                    "REAM: An SQL Based and Extensible Relational Database Management System.",
                    "Multi-Media Database Language SL/B5 based on Screen Flow.",
                    "Alternative Objects in Object-oriented Databases.",
                    "An Object-Oriented Approach to Multimedia Database Orgenization and Management.",
                    "Adapting Object-Oriented CAD Database Concepts for Computer Aided Software Engineering (CASE).",
                    "Multikey Access Scheme Based on Term Discrimination and Signature Clustering.",
                    "Multikey Sorting as a File Organization Scheme When Queries Are Not Equally Likely.",
                    "Partial-match Retrieval using Multiple-Key Hashing with Multiple File Copies.",
                    "View Maintenance for Multiple Updates.",
                    "Funtional Disk System as a High Performance Relational Storage.",
                    "Distributed Real-Time Database Systems: Prototyping and Performance Evaluation.",
                    "A Protocol for Consistent Surveillance of a Partitioned Network for Distributed Database Systems.",
                    "Implementation and Experiments of an Extensible Parallel Processing System Supporting User Defined Database Operations.",
                    "Approaches to Design of Real-Time Database Systems.",
                    "Asynchronous Chain Recursions.",
                    "A Comparison of I/O Performance of Some Linear Recursive Query Processing Methods.",
                    "A Framework for the Parallel Evaluation of Recursive Queries in Deductive Databases.",
                    "A New Recursive Query Evaluation Strategy Using Search History Information.",
                    "An Extension of Counting Method for Efficient Processing of the Cyclic Data.",
                    "On the Integration of Lexical and Spatial Data in a Unified High-Level Model.",
                    "Similarity Retrieval of Iconic Images Based on 2D String Longest Common Subsequence.",
                    "An Experimental Multi-Media Database System: MANDRILL - Its Architecture and Language.",
                    "On Using ODA for Multimedia Database Applications.",
                    "The Physical Machine of NICEBD, an Object Oriented DBMS.",
                    "Advanced Features of Integrated DB/DC System \"XDM\".",
                    "Transaction Supporting Realtime File System in a Distributed Environment.",
                    "RINDA - A Relational Database Processor for Non-Indexed Queries."
                ]
            }
        ]
    }
]