[
    {
        "name": "DPD",
        "year": "2022",
        "info": "2022: Volume 40",
        "count": 9,
        "papers": [
            "Introduction to the special issue on self‑managing and hardware‑optimized database systems 2020.",
            "Self-adapting data migration in the context of schema evolution in NoSQL databases.",
            "On the necessity of explicit cross-layer data formats in near-data processing systems.",
            "Selective caching: a persistent memory approach for multi-dimensional index structures.",
            "Deep multilayer percepted policy attribute Lamport certificateless signcryption for secure data access and sharing in cloud.",
            "Hybridization of immune with particle swarm optimization in task scheduling on smart devices.",
            "A framework for discovering popular paths using transactional modeling and pattern mining.",
            "HTD: heterogeneous throughput-driven task scheduling algorithm in MapReduce.",
            "MISS: finding optimal sample sizes for approximate analytics."
        ]
    },
    {
        "name": "DPD",
        "year": "2021",
        "info": "2021: Volume 39",
        "count": 32,
        "papers": [
            "Holistic evaluation in multi-model databases benchmarking.",
            "Secrecy and performance models for query processing on outsourced graph data.",
            "An improved query optimization process in big data using ACO-GA algorithm and HDFS map reduce technique.",
            "Collusion-resistant protocols for private processing of aggregated queries in distributed databases.",
            "A data distribution model for RDF.",
            "Pruning techniques for parallel processing of reverse top-k queries.",
            "A survey on novel classification of deduplication storage systems.",
            "GPS spoofed or not? Exploiting RSSI and TSS in crowdsourced air traffic control data.",
            "Location prediction: a deep spatiotemporal learning from external sensors data.",
            "Mining patterns in graphs with multiple weights.",
            "Summarizing and linking electronic health records.",
            "TPStream: low-latency and high-throughput temporal pattern matching on event streams.",
            "Special issue on Data-driven Science.",
            "A framework for dependency estimation in heterogeneous data streams.",
            "Workload-aware wavelet synopses for sliding window aggregates.",
            "CHiSEL: a user-oriented framework for simplifing database evolution.",
            "In-memory parallelization of join queries over large ontological hierarchies.",
            "A kernel discriminant analysis for spatially dependent data.",
            "Influential facilities placement over moving objects.",
            "MISCELA: discovering simultaneous and time-delayed correlated attribute patterns.",
            "Stratified random sampling from streaming and stored data.",
            "A simplified variant of tabled asymmetric numeral systems with a smaller look-up table.",
            "Algorithms for processing the group K nearest-neighbor query on distributed frameworks.",
            "Sensitive attribute privacy preservation of trajectory data publishing based on l-diversity.",
            "An efficient sampling-based visualization technique for big data clustering with crisp partitions.",
            "PatchIndex: exploiting approximate constraints in distributed databases.",
            "Prefetched wald adaptive boost classification based Czekanowski similarity MapReduce for user query processing with bigdata.",
            "An intelligent surveillance video analytics framework using NACT-Hadoop/MapReduce on cloud services.",
            "Semantic-based Big Data integration framework using scalable distributed ontology matching strategy.",
            "Parallel query processing in a polystore.",
            "Finding the most profitable candidate product by dynamic skyline and parallel processing.",
            "Distributed arrays: an algebra for generic distributed query processing."
        ]
    },
    {
        "name": "DPD",
        "year": "2020",
        "info": "2020: Volume 38",
        "count": 36,
        "papers": [
            "An investigation of big graph partitioning methods for distribution of graphs in vertex-centric systems.",
            "Scaling sparse matrix-matrix multiplication in the accumulo database.",
            "Parallel computation of PDFs on big spatial data using Spark.",
            "Logless one-phase commit made possible for highly-available datastores.",
            "DistriPlan: an optimized join execution framework for geo-distributed scientific data.",
            "Multi-model Z-compression for high speed data streaming and low-power wireless sensor networks.",
            "Schema matching based on SQL statements.",
            "Enabling efficient process mining on large data sets: realizing an in-database process mining operator.",
            "High-dimensional similarity searches using query driven dynamic quantization and distributed indexing.",
            "Efficient and non-blocking agreement protocols.",
            "A cost-based storage format selector for materialized results in big data frameworks.",
            "Cost-based job scheduling strategy in cloud computing environments.",
            "Effective social-context based message delivery using ChitChat in sparse delay tolerant networks.",
            "BBoxDB: a distributed and highly available key-bounding-box-value store.",
            "A survey of current challenges in partitioning and processing of graph-structured data in parallel and distributed systems.",
            "A MapReduce approach for spatial co-location pattern mining via ordered-clique-growth.",
            "Introduction to spatio-temporal data driven urban computing.",
            "Hybrid route recommendation with taxi and shared bicycles.",
            "On accurate POI recommendation via transfer learning.",
            "Social-aware spatial keyword top-k group query.",
            "Multi-objective spatial keyword query with semantics: a distance-owner based approach.",
            "An efficient algorithm for spatio-textual location matching.",
            "Privacy-preserving spatial keyword location-to-trajectory matching.",
            "LSTM-based deep learning for spatial-temporal software testing.",
            "ForeXGBoost: passenger car sales prediction based on XGBoost.",
            "A parameter-level parallel optimization algorithm for large-scale spatio-temporal data mining.",
            "Introduction to the special issue on Self-managing and Hardware-Optimized Database Systems 2019.",
            "Revisiting hash join on graphics processors: a decade later.",
            "Self-driving database systems: a conceptual approach.",
            "A gray-box modeling methodology for runtime prediction of Apache Spark jobs.",
            "Speeding up AutoTuning of the Memory Management Options in Data Analytics.",
            "Initial experience with 3D XPoint main memory.",
            "Architectural assessment of NoSQL and NewSQL systems.",
            "A social network approach for recommending interoperable Web services.",
            "Dissecting GeoSparkSim: a scalable microscopic road network traffic simulator in Apache Spark.",
            "One size does not fit all: accelerating OLAP workloads with GPUs."
        ]
    },
    {
        "name": "DPD",
        "year": "2019",
        "info": "2019: Volume 37",
        "count": 27,
        "papers": [
            "Special issue on scientific and statistical data management.",
            "On effective and efficient graph edge labeling.",
            "Detecting global hyperparaboloid correlated clusters: a Hough-transform based multicore algorithm.",
            "MDCUT2: a multi-density clustering algorithm with automatic detection of density variation in data with noise.",
            "High-throughput publish/subscribe on top of LSM-based storage.",
            "Incrementally updating unary inclusion dependencies in dynamic data.",
            "PLI $$^+$$ + : efficient clustering of cloud databases.",
            "DeStager: feature guided in-situ data management in distributed deep memory hierarchies.",
            "Guest editorial: special issue on data management and analytics for healthcare.",
            "Scalable and flexible management of medical image big data.",
            "MaReIA: a cloud MapReduce based high performance whole slide image analysis framework.",
            "On-demand big data integration - A hybrid ETL approach for reproducible scientific research.",
            "Concept acquisition and improved in-database similarity analysis for medical data.",
            "A special issue in extending data warehouses to big data analytics.",
            "Scalable machine learning computing a data summarization matrix with a parallel array DBMS.",
            "DataSynapse: A Social Data Curation Foundry.",
            "Optimization of data flow execution in a parallel environment.",
            "Abstract cost models for distributed data-intensive computations.",
            "Horizontal fragmentation for fuzzy querying databases.",
            "Main-memory foreign key joins on advanced processors: design and re-evaluations for OLAP workloads.",
            "Efficient OLAP algorithms on GPU-accelerated Hadoop clusters.",
            "A FCA framework for inference control in data integration systems.",
            "Algorithms and framework for computing 2-body statistics on GPUs.",
            "A memory-optimal many-to-many semi-stream join.",
            "Optimizing data-flow implementations for inter-organizational processes.",
            "A framework for parallel map-matching at scale using Spark.",
            "IHP: improving the utility in differential private histogram publication."
        ]
    },
    {
        "name": "DPD",
        "year": "2018",
        "info": "2018: Volume 36",
        "count": 25,
        "papers": [
            "Appreciation to distributed and parallel databases reviewers.",
            "Guest editorial: large-scale data curation and metadata management.",
            "Crowd enabled curation and querying of large and noisy text mined protein interaction data.",
            "Web-scale provenance reconstruction of implicit information diffusion on social media.",
            "AUDIT: approving and tracking updates with dependencies in collaborative databases.",
            "COACT: a query interface language for collaborative databases.",
            "MetaStore: an adaptive metadata management framework for heterogeneous metadata models.",
            "A statistically-based ontology matching tool.",
            "P-PIF: a ProvONE provenance interoperability framework for analyzing heterogeneous workflow specifications and provenance traces.",
            "Executable schema mappings for statistical data processing.",
            "Flexible partitioning for selective binary theta-joins in a massively parallel setting.",
            "An adaptive multi-objective evolutionary algorithm for constrained workflow scheduling in Clouds.",
            "How to exploit high performance computing in population-based metaheuristics for solving association rule mining problem.",
            "Multi-join query optimization in bucket-based encrypted databases using an enhanced ant colony optimization algorithm.",
            "Editorial note: special issue on big data and intelligent computing.",
            "Scalable datacenter multicast using in-packet bitmaps.",
            "An accurate estimation algorithm for big data streams.",
            "Online multi-view subspace learning via group structure analysis for visual object tracking.",
            "Information flow control on encrypted data for service composition among multiple clouds.",
            "Energy-aware task scheduling in mobile cloud computing.",
            "Distributed computing connected components with linear communication cost.",
            "An effective weighted rule-based method for entity resolution.",
            "A fast and low idle time method for mining frequent patterns in distributed and many-task computing environments.",
            "A K-way spectral partitioning of an ontology for ontology matching.",
            "Monitoring distributed fragmented skylines."
        ]
    },
    {
        "name": "DPD",
        "year": "2017",
        "info": "2017: Volume 35",
        "count": 17,
        "papers": [
            "Distributed data possession provable in cloud.",
            "Distributed block formation and layout for disk-based management of large-scale graphs.",
            "M-Grid: a distributed framework for multidimensional indexing and querying of location based data.",
            "Editorial Note.",
            "TAPER: query-aware, partition-enhancement for large, heterogenous graphs.",
            "Tuning the granularity of parallelism for distributed graph processing.",
            "Efficient MapReduce algorithms for triangle listing in billion-scale graphs.",
            "An I/O-efficient and adaptive fault-tolerant framework for distributed graph computations.",
            "Distributed secondo: an extensible and scalable database management system.",
            "HiNode: an asymptotically space-optimal storage model for historical queries on graphs.",
            "Service recommendation based on parallel graph computing.",
            "Resolving Entity on A Large scale: DEtermining Linked Entities and Grouping similar Attributes represented in assorted TErminologies.",
            "Special issue on in-database analytics.",
            "Scalable parallel graph algorithms with matrix-vector multiplication evaluated with queries.",
            "Privacy-preserving of SVM over vertically partitioned with imputing missing data.",
            "A parallel computation of skyline using multiple regression analysis-based filtering on MapReduce.",
            "An efficient distributed search solution for federated cloud."
        ]
    },
    {
        "name": "DPD",
        "year": "2016",
        "info": "2016: Volume 34",
        "count": 21,
        "papers": [
            "Guest Editorial: Large-scale Data Management for Mobile Applications.",
            "Physical design for distributed RFID-based supply chain management.",
            "Managing big data experiments on smartphones.",
            "SODA: A framework for spatial observation data analysis.",
            "Merging sub-networks in self-managed vehicular ad-hoc networks.",
            "Detecting common subexpressions for multiple query optimization over loosely-coupled heterogeneous data sources.",
            "A view-based monitoring for usage control in web services.",
            "Performance analysis of data intensive cloud systems based on data management and replication: a survey.",
            "MELOC-X: extended memory and location optimized caching for large mobile ad hoc networks of UAVs.",
            "Probabilistic nearest neighbor query processing on distributed uncertain data.",
            "Guest Editorial: A Special Issue in Physical Design for Big Data Warehousing and Mining.",
            "Chronos: a NoSQL system on flash memory for industrial process data.",
            "On visualizing large multidimensional datasets with a multi-threaded radial approach.",
            "Benchmarking SQL on MapReduce systems using large astronomy databases.",
            "Scalable graph-based OLAP analytics over process execution data.",
            "Spatial data warehouses and spatial OLAP come towards the cloud: design and performance.",
            "CloudMdsQL: querying heterogeneous cloud data stores with a common language.",
            "Access control aware data retrieval for secret sharing based database outsourcing.",
            "Sliding window top-k dominating query processing over distributed data streams.",
            "Uncertain top-k query processing in distributed environments.",
            "Identifying defective nodes in wireless sensor networks."
        ]
    },
    {
        "name": "DPD",
        "year": "2015",
        "info": "2015: Volume 33",
        "count": 24,
        "papers": [
            "Guest Editorial: Special Issue on Databases and Crowdsourcing.",
            "An abstract formal basis for digital crowds.",
            "Enabling community-driven information integration through clustering.",
            "Quality based dynamic incentive tagging.",
            "Crowdsourcing large scale wrapper inference.",
            "Mobile crowdsourcing: four experiments on platforms and tasks.",
            "Guest Editorial: Data Management and Analysis in Location-Based Social Networks.",
            "A road network modeling method for map matching on lightweight mobile devices.",
            "LinkNet: capturing temporal dependencies among spatial regions.",
            "Discovering pattern-aware routes from trajectories.",
            "Efficient route search on hierarchical dynamic road networks.",
            "A privacy-enhancing model for location-based personalized recommendations.",
            "Formal representation of the SS-DB benchmark and experimental evaluation in EXTASCID.",
            "A privacy-aware monitoring algorithm for moving k-nearest neighbor queries in road networks.",
            "Locality-aware allocation of multi-dimensional correlated files on the cloud platform.",
            "Efficient top-(k, l) range query processing for uncertain data based on multicore architectures.",
            "Special issue on data management on modern hardware.",
            "Parallel outlier detection on uncertain data for GPUs.",
            "Optimizing B+-tree for hybrid storage systems.",
            "Guest Editorial: Special Issue on Managing and Mining Massive Graphs.",
            "The G* graph database: efficiently managing large distributed dynamic graphs.",
            "Analysis of schema structures in the Linked Open Data graph based on unique subject URIs, pay-level domains, and vocabulary usage.",
            "Approximate querying of RDF graphs via path alignment.",
            "Intra graph clustering using collaborative similarity measure."
        ]
    },
    {
        "name": "DPD",
        "year": "2014",
        "info": "2014: Volume 32",
        "count": 21,
        "papers": [
            "Special issue on secure and privacy-aware data management.",
            "A generic and distributed privacy preserving classification method with a worst-case privacy guarantee.",
            "MILo-DB: a personal, secure and portable database machine.",
            "Towards practical private processing of database queries over public data.",
            "Anonymizing continuous queries with delay-tolerant mix-zones over road networks.",
            "An efficient privacy-preserving multi-keyword search over encrypted cloud data with ranking.",
            "Detecting and predicting privacy violations in online social networks.",
            "METAP: revisiting Privacy-Preserving Data Publishing using secure devices.",
            "Dynamic delegation framework for role based access control in distributed data management systems.",
            "An efficient location reporting and indexing framework for urban road moving objects.",
            "Scalable data summarization on big data.",
            "A unifying framework for ℓ 0-sampling algorithms.",
            "PF-OLA: a high-performance framework for parallel online aggregation.",
            "PCA for large data sets with parallel data summarization.",
            "Scalable entity-based summarization of web search results using MapReduce.",
            "Set similarity join on massive probabilistic data using MapReduce.",
            "Editor's Note: Special Section on Scalable Data Management.",
            "OATS: online aggregation with two-level sharing strategy in cloud.",
            "Efficient integrity verification of replicated data in cloud using homomorphic encryption.",
            "Quality-aware schedulers for weak consistency key-value data stores.",
            "LSShare: an efficient multiple query optimization system in the cloud."
        ]
    },
    {
        "name": "DPD",
        "year": "2013",
        "info": "2013: Volume 31",
        "count": 18,
        "papers": [
            "Enhancing traceability of persistent data access flows in process-driven SOAs.",
            "Personalized ranking in web databases: establishing and utilizing an appropriate workload.",
            "ART: sub-logarithmic decentralized range query processing with probabilistic guarantees.",
            "Guest editorial: special issue on mobile data management.",
            "Intelligent search in social communities of smartphone users.",
            "On compressing data in wireless sensor networks for energy efficiency and real time delivery.",
            "Managing concurrent execution of transactions in mobile ad-hoc network database systems: an energy-efficient approach.",
            "QS-STT: QuadSection clustering and spatial-temporal trajectory model for location prediction.",
            "SMashQ: spatial mashup framework for k-NN queries in time-dependent road networks.",
            "$\\mathcal{MD}$ -HBase: design and implementation of an elastic data infrastructure for cloud-scale location services.",
            "Adaptive data acquisition strategies for energy-efficient, smartphone-based, continuous processing of sensor streams.",
            "CAST: Context-Aware Security and Trust framework for Mobile Ad-hoc Networks using policies.",
            "Efficiently repairing and measuring replica consistency in distributed databases.",
            "A Hierarchical Grid Index (HGI), spatial queries in wireless data broadcasting.",
            "Data-driven and automated prediction of service level agreement violations in service compositions.",
            "Decomposing Petri nets for process mining: A generic approach.",
            "Entity resolution for distributed probabilistic data.",
            "Automatic optimization of stream programs via source program operator graph transformations."
        ]
    },
    {
        "name": "DPD",
        "year": "2012",
        "info": "2012: Volume 30",
        "count": 18,
        "papers": [
            "Satisfaction-based query replication - An automatic and self-adaptable approach for replicating queries in the presence of autonomous participants.",
            "Pattern-based event detection in sensor networks.",
            "Business process model abstraction: a definition, catalog, and survey.",
            "A new landscape for distributed and parallel data management.",
            "Fast business process similarity search.",
            "Dynamic routing of data stream tuples among parallel query plan running on multi-core processors.",
            "Guest Editor's editorial: ranking in databases.",
            "Combining CPU and GPU architectures for fast similarity search.",
            "On optimality-ratio and coverage in ranking of joined search results.",
            "Distributed top-k query processing by exploiting skyline summaries.",
            "Distributed top-k full-text content dissemination.",
            "Special issue for data intensive eScience.",
            "Data-intensive architecture for scientific knowledge discovery.",
            "ROARS: a robust object archival system for data intensive scientific computing.",
            "MTCProv: a practical provenance query framework for many-task scientific computing.",
            "Data challenges of time domain astronomy.",
            "High-performance short sequence alignment with GPU acceleration.",
            "High-throughput query scheduling with spatial clustering based on distributed exponential moving average."
        ]
    },
    {
        "name": "DPD",
        "year": "2011",
        "info": "2011: Volume 29",
        "count": 16,
        "papers": [
            "Query processing in sensor networks.",
            "Efficient tracking of 2D objects with spatiotemporal properties in wireless sensor networks.",
            "SNEE: a query processor for wireless sensor networks.",
            "In-network data acquisition and replication in mobile sensor networks.",
            "Power efficiency through tuple ranking in wireless sensor network monitoring.",
            "Stream engines meet wireless sensor networks: cost-based planning and processing of complex queries in AnduIN.",
            "ASTERIX: towards a scalable, semistructured data platform for evolving-world models.",
            "Irregularity in high-dimensional space-filling curves.",
            "Quantifying the trustworthiness of social media content.",
            "A decentralized deadlock detection and resolution algorithm for generalized model in distributed systems.",
            "SEPL - a domain-specific language and execution environment for protocols of stateful Web services.",
            "CorPN: managing instance correspondence in collaborative business processes.",
            "A human-centric runtime framework for mixed service-oriented systems.",
            "Quality of experience in distributed databases.",
            "RFID enabled traceability networks: a survey.",
            "Scaling XML query processing: distribution, localization and pruning."
        ]
    },
    {
        "name": "DPD",
        "year": "2010",
        "info": "2010: Volumes\n27, 28",
        "count": 16,
        "papers": [
            "A graph theoretic approach to authorization delegation and conflict resolution in decentralised systems.",
            "A preference-based approach for interactive weight learning: learning weights within a logic-based query language.",
            "On performance evaluation and design of atomic commit protocols for mobile transactions.",
            "Maintenance of top-k materialized views.",
            "Understanding provenance black boxes.",
            "Modeling and querying provenance by extending CIDOC CRM.",
            "Distributed stream join query processing with semijoins.",
            "Backward validation of communicating complex state machines in web services environments.",
            "Beyond soundness: on the verification of semantic business process models.",
            "E-ARL: An Economic incentive scheme for Adaptive Revenue-Load-based dynamic replication of data in Mobile-P2P networks.",
            "Fault-tolerant query processing in structured P2P-systems.",
            "MG-join: detecting phenomena and their correlation in high dimensional data streams.",
            "Parallel processing of continuous queries over data streams.",
            "Cardinality estimation and dynamic length adaptation for Bloom filters.",
            "DYFRAM: dynamic fragmentation and replica management in distributed database systems.",
            "Replicating data objects in large distributed database systems: an axiomatic game theoretic mechanism design approach."
        ]
    },
    {
        "name": "DPD",
        "year": "2009",
        "info": "2009: Volumes\n25, 26",
        "count": 22,
        "papers": [
            "Guest editorial: special issue on physical data warehouse design.",
            "Revelation on demand.",
            "Data warehouse access using multi-agent system.",
            "Partitioning methods for multi-version XML data warehouses.",
            "Model and procedure for performance and availability-wise parallel warehouses.",
            "Parallel OLAP query processing in database clusters with data replication.",
            "Adaptive workload allocation in query processing in autonomous heterogeneous environments.",
            "Blocking reduction for distributed transaction processing within MANETs.",
            "Log-based transactional workflow mining.",
            "Guest editorial: special issue on ranking in databases.",
            "Distributed top-k aggregation queries at large.",
            "Continuously monitoring top-k uncertain data streams: a probabilistic threshold method.",
            "Semantics and evaluation of top-k queries in probabilistic databases.",
            "Ranking strategies and threats: a cost-based pareto optimization approach.",
            "Guest editorial: special issue on data management in peer-to-peer systems.",
            "Efficient range query processing in metric spaces over highly distributed data.",
            "Rewiring strategies for semantic overlay networks.",
            "Linking identical neighborly partitions for efficient high-dimensional similarity search in unstructured peer-to-peer systems.",
            "Maintenance strategies for routing indexes.",
            "Multi-dimensional data density estimation in P2P networks.",
            "DHTJoin: processing continuous join queries using DHT networks.",
            "A cross-layer atomic commit protocol implementation for transaction processing in mobile ad-hoc networks."
        ]
    },
    {
        "name": "DPD",
        "year": "2008",
        "info": "2008: Volumes\n23, 24",
        "count": 12,
        "papers": [
            "Self-adapting recovery nets for policy-driven exception handling in business processes.",
            "Indexing views to route queries in a PDMS.",
            "Two approaches to the integration of heterogeneous data warehouses.",
            "PnP: sequential, external memory, and parallel iceberg cube computation.",
            "Distributed real time database systems: background and literature review.",
            "Query optimization via contention space partitioning and cost error controlling for dynamic multidatabase systems.",
            "Movement-based checkpointing and logging for failure recovery of database applications in mobile environments.",
            "A cache invalidation scheme for continuous partial match queries in mobile computing environments.",
            "A survey on the history of transaction management: from flat to grid transactions.",
            "Scalable and topology-aware reconciliation on P2P networks.",
            "Dynamic composition and optimization of Web services.",
            "Integrating semantically heterogeneous aggregate views of distributed databases."
        ]
    },
    {
        "name": "DPD",
        "year": "2007",
        "info": "2007: Volumes\n21, 22",
        "count": 20,
        "papers": [
            "Preface - Context-aware Web services.",
            "Context-based matching for Web service composition.",
            "Context-aware agents for user-oriented web services discovery and execution.",
            "Context-based caching and routing for P2P web service discovery.",
            "Sharing hierarchical context for mobile web services.",
            "Special issue on high density data centers.",
            "General-purpose blade infrastructure for configurable system architectures.",
            "Real time asset tracking in the data center.",
            "Optimizing thermal design of data center cabinets with a new multi-objective genetic algorithm.",
            "Modeling of data center airflow and heat transfer: State of the art and future trends.",
            "Thermo-Fluids Provisioning of a High Performance High Density Data Center.",
            "Disseminating dependent data in wireless broadcast environments.",
            "Managing real-time database transactions in mobile ad-hoc networks.",
            "A decentralized execution model for inter-organizational workflows.",
            "Efficient algorithms for distortion and blocking techniques in association rule hiding.",
            "Welcome to Prof. Amit Sheth.",
            "Semantics based customization of UBL document schemas.",
            "Adaptive processing of historical spatial range queries in peer-to-peer sensor networks.",
            "A transaction model and multiversion concurrency control for mobile database systems.",
            "General-purpose blade infrastructure for configurable system architectures."
        ]
    },
    {
        "name": "DPD",
        "year": "2006",
        "info": "2006: Volumes\n19, 20",
        "count": 16,
        "papers": [
            "Incremental click-stream tree model: Learning from new users for web page prediction.",
            "The cgmCUBE project: Optimizing parallel data cube generation for ROLAP.",
            "Reducing network traffic in unstructured P2P systems using Top-k queries.",
            "A novel approach to resource scheduling for parallel query processing on computational grids.",
            "Efficient retrieval of replicated data.",
            "An object replication algorithm for real-time distributed databases.",
            "Exploiting sequential access when declustering data over disks and MEMS-based storage.",
            "Analysis of dependencies in advanced transaction models.",
            "SWIFT-A new real time commit protocol.",
            "Exploring spatial datasets with histograms.",
            "Integration of transient Web services into a virtual peer to peer Web service registry.",
            "Efficient parallel processing of range queries through replicated declustering.",
            "Data warehousing and data mining techniques for intrusion detection systems.",
            "Efficient processing of aggregation queries in sensor networks.",
            "GRACE-based joins on active storage devices.",
            "Parallel Bifold: Large-scale parallel pattern mining with constraints."
        ]
    },
    {
        "name": "DPD",
        "year": "2005",
        "info": "2005: Volumes\n17, 18",
        "count": 20,
        "papers": [
            "Facilitating the Rapid Development and Scalable Orchestration of Composite Web Services.",
            "Efficient Processing of Client Transactions in Real-Time.",
            "Optimal Data-Space Partitioning of Spatial Data for Parallel I/O.",
            "The PN-Tree: A Parallel and Distributed Multidimensional Index.",
            "Web Service Composition Using a Deductive XML Rule Language.",
            "A Dynamic Foundational Architecture for Semantic Web Services.",
            "An Indexing Method for Answering Queries on Moving Objects.",
            "Living with Database Conflicts: A Temporal Branching Technique.",
            "A Systematic Approach for Configuring Web-Based Information Systems.",
            "Introduction.",
            "Enhancing ebXML Registries to Make them OWL Aware.",
            "Using Semantics for Policy-Based Web Service Composition.",
            "Resolution and Constraint Propagation for Semantic Web Services Discovery.",
            "A Trust-Based Context-Aware Access Control Model for Web-Services.",
            "EFSOC: A Layered Framework for Developing Secure Interactions between Web-Services.",
            "A View Based Analysis on Web Service Registries.",
            "Stream Cube: An Architecture for Multi-Dimensional Analysis of Data Streams.",
            "An Efficient Algorithm for Near Optimal Data Allocation on Multiple Broadcast Channels.",
            "Preventive Replication in a Database Cluster.",
            "Performance Comparison of Mirrored Disk Scheduling Methods with a Shared Non-Volatile Cache."
        ]
    },
    {
        "name": "DPD",
        "year": "2004",
        "info": "2004: Volumes\n15, 16",
        "count": 19,
        "papers": [
            "Guest Editor's Introduction.",
            "Teamware: An Evaluation of Key Technologies and Open Problems.",
            "Caramba - A Process-Aware Collaboration System Supporting Ad hoc and Collaborative Processes in Virtual Teams.",
            "The ToxicFarm Integrated Cooperation Framework for Virtual Teams.",
            "Edison: Database-Supported Synchronization for PDAs.",
            "Main Memory Evaluation of Monitoring Queries Over Moving Objects.",
            "An Adaptive Data-Shipping Architecture for Client Caching Data Management Systems.",
            "Query Processing and Optimization on the Web.",
            "Parallel ROLAP Data Cube Construction on Shared-Nothing Multiprocessors.",
            "Query Size Estimation for Joins Using Systematic Sampling.",
            "Selective-Splitting and Cache-Maintenance Algorithms for Associative-Client Caches.",
            "A Distribution Design Methodology for Object DBMS.",
            "Flexible Support of Team Processes by Adaptive Workflow Systems.",
            "Main Memory-Based Algorithms for Efficient Parallel Aggregation for Temporal Databases.",
            "\"Cache and Carry\" for Location Management in Mobile Information Systems.",
            "A Survey of Mobile Transactions.",
            "A Comprehensive and Automated Approach to Intelligent Business Processes Execution Analysis.",
            "The Design, Implementation and Evaluation of an ODMG Compliant, Parallel Object Database Server.",
            "Frequent Pattern Mining on Message Passing Multiprocessor Systems."
        ]
    },
    {
        "name": "DPD",
        "year": "2003",
        "info": "2003: Volumes\n13, 14",
        "count": 21,
        "papers": [
            "Introduction to the Special Issue on Bioinformatics.",
            "A Computational Biology Database Digest: Data, Data Analysis, and Data Management.",
            "IntelliGEN: A Distributed Workflow System for Discovering Protein-Protein Interactions.",
            "VizCluster and its Application on Classifying Gene Expression Data.",
            "Database Allocation Strategies for Parallel BLAST Evaluation on Clusters.",
            "Improving Data Quality in Practice: A Case Study in the Italian Public Administration.",
            "On Using a Warehouse to Analyze Web Logs.",
            "Fully Dynamic Partitioning: Handling Data Skew in Parallel Data Cube Computation.",
            "Replication for Load Balancing and Hot-Spot Relief on Proxy Web Caches with Hash Routing.",
            "Distributed Enforcement of Integrity Constraints.",
            "Modelling Parallel Oracle for Performance Prediction.",
            "Exception Handling for Conflict Resolution in Cross-Organizational Workflows.",
            "Workflow Patterns.",
            "Consensus Methods for Solving Inconsistency of Replicated Data in Distributed Systems.",
            "The Database State Machine Approach.",
            "Disk Allocation for Fast Range and Nearest-Neighbor Queries.",
            "Cross-Organizational Transaction Support for E-Services in Virtual Enterprises.",
            "An Adaptive Recommendation System without Explicit Acquisition of User Relevance Feedback.",
            "Analyzing User-Perceived Dependability and Performance Characteristics of Voting Algorithms for Managing Replicated Data.",
            "CubiST++: Evaluating Ad-Hoc CUBE Queries Using Statistics Trees.",
            "Optimal Scheduling Algorithms for Tertiary Storage."
        ]
    },
    {
        "name": "DPD",
        "year": "2002",
        "info": "2002: Volumes\n11, 12",
        "count": 22,
        "papers": [
            "Evolutionary Algorithms for Allocating Data in Distributed Database Systems.",
            "Workflow Architecture for Interactive Video Management Systems.",
            "Light-Weight Currency Management Mechanisms in Mobile and Weakly-Connected Environments.",
            "HiCoMo: High Commit Mobile Transactions.",
            "Evolutionary Techniques for Web Caching.",
            "Introduction: Recent Developments in Parallel and Distributed Data Mining.",
            "Shared State for Distributed Interactive Data Mining Applications.",
            "RACHET: An Efficient Cover-Based Merging of Clustering Hierarchies from Distributed Datasets.",
            "Parallelizing the Data Cube.",
            "Boosting Algorithms for Parallel and Distributed Learning.",
            "Dictatorial Transaction Processing: Atomic Commitment Without Veto Right.",
            "Temporal Reasoning in Workflow Systems.",
            "Query Decomposition for a Distributed Object-Oriented Mediator System.",
            "Parallel Mining of Outliers in Large Database.",
            "An Object Algebra Approach to Multidatabase Query Decomposition in Donají.",
            "A Taxonomy of Indexing Schemes for Parallel Database Systems.",
            "Guest Editorial.",
            "What's in a Service?",
            "An Overview of Standards and Related Technology in Web Services.",
            "The Application of Workflow Technology in Semantic B2B Integration.",
            "Workflow View Based E-Contracts in a Cross-Organizational E-Services Environment.",
            "A Reference Architecture for the Certification of E-Services in a Digital Government Infrastructure."
        ]
    },
    {
        "name": "DPD",
        "year": "2001",
        "info": "2001: Volumes\n9, 10",
        "count": 18,
        "papers": [
            "Time Constrained Push Strategies in Client-Server Databases.",
            "Revisiting Transaction Management in Multidatabase Systems.",
            "Distributed Processing of Similarity Queries.",
            "An Adaptive Algorithm for Mining Association Rules on Shared-Memory Parallel Machines.",
            "Effective Data Placement for Wireless Broadcast.",
            "A Hybrid Index Technique for Power Efficient Data Broadcast.",
            "The Bengal Database Replication System.",
            "GeMDA: A Multidimensional Data Partitioning Technique for Multiprocessor Database Systems.",
            "Replica Consistency in Lazy Master Replicated Databases.",
            "Client-Server Caching with Expiration Timestamps.",
            "A Framework for Cache Management for Mobile Databases: Design and Evaluation.",
            "An Architecture for Supply Chain Integration and Automation on the Internet.",
            "Window Query Processing in Linear Quadtrees.",
            "A Transaction Model to Improve Data Availability in Mobile Computing.",
            "Logically Clustered Architectures for Networked Databases.",
            "A Graphical Approach to Allocating Class Fragments in Distributed Objectbase Systems.",
            "A Low-Cost Checkpointing Technique for Distributed Databases.",
            "A Hypergraph Based Approach to Declustering Problems."
        ]
    },
    {
        "name": "DPD",
        "year": "2000",
        "info": "Volume 8, 2000",
        "count": 15,
        "papers": [
            "Security of Data and Transaction Processing - Guest Editor's Introduction.",
            "Rewriting Histories: Recovering from Malicious Transactions.",
            "Secure Concurrency Control in Firm Real-Time Database Systems.",
            "A Secure Agent-based Framework for Internet Trading in Mobile Computing Environments.",
            "Providing Security and Interoperation of Heterogeneous Systems.",
            "Algorithms and Support for Horizontal Class Partitioning in Object-Oriented Databases.",
            "Semantic Based Concurrency Control of Open Nested Transactions in Active Object Oriented Database Management Systems.",
            "OBSERVER: An Approach for Query Processing in Global Information Systems Based on Interoperation Across Pre-Existing Ontologies.",
            "Workfile Disk Management for Concurrent Mergesorts in a Multiprocessor Database System.",
            "An ASN.1 Model and Integration Approach for Structured Text.",
            "A Framework for Class Partitioning in Object-Oriented Databases.",
            "Ontological Approach for Information Discovery in Internet Databases.",
            "Flexible Transaction Dependencies in Database Systems.",
            "Secure Electronic Payments Based on Mobile Agents.",
            "Diamond Quorum Consensus for High Capacity and Efficiency in a Replicated Database System."
        ]
    },
    {
        "name": "DPD",
        "year": "1999",
        "info": "Volume 7, 1999",
        "count": 18,
        "papers": [
            "Guest Editor's Introduction.",
            "Ontologies are not the Panacea in Data Integration: A Flexible Coordinator to Mediate Context Construction.",
            "Controlled Vocabularies in OODBs: Modeling Issues and Implementation.",
            "A Discovery-Based Approach to Database Ontology Design.",
            "Load Balancing for Parallel Query Execution on NUMA Multiprocessors.",
            "Guest Editor's Introduction.",
            "A Brokerage Framework for Internet Commerce.",
            "EMP - A Database-Driven Electronic Market Place for Business-to-Business Commerce on the Internet.",
            "Distributed Print on Demand Systems in the Xpect Framework.",
            "Formalization of Workflows and Correctness Issues in the Presence of Concurrency.",
            "Guest Editorial.",
            "Updating and Querying Databases that Track Mobile Units.",
            "Mobility and Extensibility in the StratOSphere Framework.",
            "Experiences of Using Generative Communications to Support Adaptive Mobile Applications.",
            "MODEC: A Multi-Granularity Mobile Object-Oriented Database Caching Mechanism, Prototype and Performance.",
            "Intensive Data Management in Parallel Systems: A Survey.",
            "A New Algorithm for the Decentralized Aggregation Problem.",
            "Storage System and Multimedia: Classification and Extensions."
        ]
    },
    {
        "name": "DPD",
        "year": "1998",
        "info": "Volume 6, 1998",
        "count": 13,
        "papers": [
            "Guest Editors' Introduction.",
            "Consistency Algorithms for Multi-Source Warehouse View Maintenance.",
            "Distributed Multi-Level Recovery in Main-Memory Databases.",
            "Capabilities-Based Query Rewriting in Mediator Systems.",
            "Snowball: Scalable Storage on Networks of Workstations with Balanced Load.",
            "The Performance of Two Phase Commit Protocols in the Presence of Site Failures.",
            "Query Optimization in Multidatabase Systems.",
            "Dynamic Query Operator Scheduling for Wide-Area Remote Access.",
            "Graph-Based Parallel Query Processing and Optimization Strategies for Object-Oriented Databases.",
            "Incremental View Maintenance By Base Relation Tagging in Distributed Databases.",
            "Distributed Object Based Design: Vertical Fragmentation of Classes.",
            "Energy-Efficient Mobile Cache Invalidation.",
            "Solving Local Cost Estimation Problem for Global Query Optimization in Multidatabase Systems."
        ]
    },
    {
        "name": "DPD",
        "year": "1997",
        "info": "Volume 5, 1997",
        "count": 12,
        "papers": [
            "Adaptive Join Algorithms in Dynamic Distributed Databases.",
            "Bounded Inconsistency for Type-Specific Concurrency Control.",
            "Multidatabase Query Optimization.",
            "Specification and Management of Interdependent Data in Operational Systems and Data Warehouses.",
            "An Adaptive Object-Oriented Approach to Integration and Access of Heterogeneous Information Sources.",
            "The Carnot Heterogeneous Database Project: Implemented Applications.",
            "Adaptive Algorithms for Join Processing in Distributed Database Systems.",
            "Dynamic Data Reallocation for Skew Management in Shared-Nothing Parallel Databases.",
            "A Survey of Distributed Database Checkpointing.",
            "Protocols for Integrity Constraint Checking in Federated Databases.",
            "Application Specific Transaction Management in Multidatabase Systems.",
            "A Parallel Scheme Using the Divide-and-Conquer Method."
        ]
    },
    {
        "name": "DPD",
        "year": "1996",
        "info": "Volume 4, 1996",
        "count": 15,
        "papers": [
            "Modelling Test Data for Performance Evaluation of Large Parallel Database Machines.",
            "Transaction Decomposition Using Transaction Semantics.",
            "A Query Processing Algorithm for a System of Heterogeneous Distributed Databases.",
            "Extending a Multi-Set Relational Algebra to a Parallel Environment.",
            "Implementation and Evaluation of Parallel Query Processing Algorithms and Data Partitioning Heuristics in Object-Oriented Databases.",
            "Identifying Object Isomerism in Multidatabase Systems.",
            "ObjectFlow: Towards a Process Management Infrastructure.",
            "Guest Editors' Introduction.",
            "Using Signature Techniques for Information Filtering in Wireless and Mobile Environments.",
            "Exotica/FMDC: A Workflow Management System for Mobile and Disconnected Clients.",
            "Supporting Mobile Database Access through Query by Icons.",
            "A Mobility-Aware Dynamic Database Caching Scheme for Wireless Mobile Computing and Communications.",
            "A Performance Model of a Design for a Minimally Replicated Distributed Database for Database-Driven Telecommunications Services.",
            "Load Control in Scalable Distributed File Structures.",
            "Bounding the Effects of Compensation under Relaxed Multi-level Serializability."
        ]
    },
    {
        "name": "DPD",
        "year": "1995",
        "info": "Volume 3, 1995",
        "count": 14,
        "papers": [
            "Partitioned Data Objects in Distributed Databases.",
            "A Load-Balanced Parallel Sorting Algorithm for Shared-Nothing Architectures.",
            "An Efficient Processing of a Chain Join with the Minimum Communication Cost in Distributed Database Systems.",
            "Divergence Control for Distributed Database Systems.",
            "Guest Editors' Introduction.",
            "An Overview of Workflow Management: From Process Modeling to Workflow Automation Infrastructure.",
            "Managing Hetergeneous Multi-system Tasks to Support Enterprise-Wide Operations.",
            "General Purpose Work Flow Languages.",
            "Independent Updates and Incremental Agreement in Replicated Databases.",
            "A Comprehensive Approach to Horizontal Class Fragmentation in a Distributed Object Based System.",
            "An Algebraic Transformation Framework for Multidatabase Queries.",
            "Analysis of File Usage in Personal Computer Environments.",
            "Two-Phase Commit Optimizations in a Commercial Distributed Environment.",
            "Correctness Issues for Distributed Relational Database Design."
        ]
    },
    {
        "name": "DPD",
        "year": "1994",
        "info": "Volume 2, 1994",
        "count": 16,
        "papers": [
            "Guest Editors' Introduction.",
            "A Non-Restrictive Concurrency Control Protocol for Object Oriented Databases.",
            "Concurrent Behavior: A Construct to Specify the External Behavior of Objects in Object Databases.",
            "Performance Analysis of Parallel Object-Oriented Query Processing Algorithms.",
            "Schema Evolution and Integration.",
            "Sparing for Redundant Disk Arrays.",
            "Transaction Recovery in Federated Autonomous Databases.",
            "An Objective Function for Vertically Partitioning Relations in Distributed Databases and its Analysis.",
            "Integration of Commit Protocols in Hetergeneous Databases.",
            "Guest Editor's Introduction.",
            "Performance and Design Evaluation of the RAID-II Storage Server.",
            "Performance of RAID5 Disk Arrays with Read and Write Caching.",
            "Architectures and Algorithms for On-Line Failure Recovery in Redundant Disk Arrays.",
            "Applications of Object-Oriented Technology to the Integration of Heterogeneous Database Systems.",
            "Page-Query Compaction of Secondary Memory Auxilliary Databases.",
            "Processing Real-Time Transactions in a Replicated Database System."
        ]
    },
    {
        "name": "DPD",
        "year": "1993",
        "info": "Volume 1, 1993",
        "count": 19,
        "papers": [
            "Editorial.",
            "Guest Editors' Introduction.",
            "Optimization of Parallel Query Execution Plans in XPRS.",
            "Practical Prefetching Techniques for Multiprocessor File Systems.",
            "A Performance Study of Three High Available Data Replication Strategies.",
            "Distored Mapping Techniques to Achieve High Performance in Mirrored Disk Systems.",
            "Dataflow Query Execution in a Parallel Main-memory Environment.",
            "Guest Editor's Introduction.",
            "Parallel Database Systems: Open Problems and New Issues.",
            "The Performance of Disk Arrays in Shared-Memory Database Machines.",
            "Real-Time Databases.",
            "Concurrent Frame Signature Files.",
            "On Resolving Schematic Heterogeneity in Multidatabase Systems.",
            "Answering Heterogeneous Database Queries with Degrees of Uncertainty.",
            "An Approach for Building an Integrated Environment for Molecular Biology Databases.",
            "Editorial.",
            "A Survey of Parallel Execution Strategies for Transitive Closure and Logic Programs.",
            "Coordinator Log Transaction Execution Protocol.",
            "Effective Utilization of Copies in a Transparent Distributed Environment."
        ]
    }
]