[
    {
        "year": "2021",
        "name": "43rd ECIR 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2021-1",
                "sub_name": "Advances in Information Retrieval - 43rd European Conference on IR Research, ECIR 2021, Virtual Event, March 28 - April 1, 2021, Proceedings, Part I.",
                "count": 50,
                "papers": [
                    "Stay on Topic, Please: Aligning User Comments to the Content of a News Article.",
                    "An E-Commerce Dataset in French for Multi-modal Product Categorization and Cross-Modal Retrieval.",
                    "FedeRank: User Controlled Feedback with Federated Recommender Systems.",
                    "Active Learning for Entity Alignment.",
                    "Exploring Classic and Neural Lexical Translation Models for Information Retrieval: Interpretability, Effectiveness, and Efficiency Benefits.",
                    "Coreference Resolution in Research Papers from Multiple Domains.",
                    "How Do Simple Transformations of Text and Image Features Impact Cosine-Based Semantic Match?",
                    "An Enhanced Evaluation Framework for Query Performance Prediction.",
                    "Open-Domain Conversational Search Assistant with Transformers.",
                    "Complement Lexical Retrieval Model with Semantic Residual Embeddings.",
                    "Classifying Scientific Publications with BERT - Is Self-attention a Feature Selection Method?",
                    "Valuation of Startups: A Machine Learning Perspective.",
                    "Disparate Impact in Item Recommendation: A Case of Geographic Imbalance.",
                    "You Get What You Chat: Using Conversations to Personalize Search-Based Recommendations.",
                    "Joint Autoregressive and Graph Models for Software and Developer Social Networks.",
                    "Mitigating the Position Bias of Transformer Models in Passage Re-ranking.",
                    "Exploding TV Sets and Disappointing Laptops: Suggesting Interesting Content in News Archives Based on Surprise Estimation.",
                    "Label Definitions Augmented Interaction Model for Legal Charge Prediction.",
                    "A Study of Distributed Representations for Figures of Research Articles.",
                    "Answer Sentence Selection Using Local and Global Context in Transformer Models.",
                    "An Argument Extraction Decoder in Open Information Extraction.",
                    "Using the Hammer only on Nails: A Hybrid Method for Representation-Based Evidence Retrieval for Question Answering.",
                    "Evaluating Multilingual Text Encoders for Unsupervised Cross-Lingual Retrieval.",
                    "Diagnosis Ranking with Knowledge Graph Convolutional Networks.",
                    "Studying Catastrophic Forgetting in Neural Ranking Models.",
                    "Extracting Search Tasks from Query Logs Using a Recurrent Deep Clustering Architecture.",
                    "Modeling User Search Tasks with a Language-Agnostic Unsupervised Approach.",
                    "DSMER: A Deep Semantic Matching Based Framework for Named Entity Recognition.",
                    "Predicting User Engagement Status for Online Evaluation of Intelligent Assistants.",
                    "Drug and Disease Interpretation Learning with Biomedical Entity Representation Transformer.",
                    "CEQE: Contextualized Embeddings for Query Expansion.",
                    "Pattern-Aware and Noise-Resilient Embedding Models.",
                    "TLS-Covid19: A New Annotated Corpus for Timeline Summarization.",
                    "A Multi-task Approach to Neural Multi-label Hierarchical Patent Classification Using Transformers.",
                    "Weakly-Supervised Open-Retrieval Conversational Question Answering.",
                    "A Deep Analysis of an Explainable Retrieval Model for Precision Medicine Literature Search.",
                    "A Transparent Logical Framework for Aspect-Oriented Product Ranking Based on User Reviews.",
                    "On the Instability of Diminishing Return IR Measures.",
                    "Studying the Effectiveness of Conversational Search Refinement Through User Simulation.",
                    "Causality-Aware Neighborhood Methods for Recommender Systems.",
                    "User Engagement Prediction for Clarification in Search.",
                    "Sentiment-Oriented Metric Learning for Text-to-Image Retrieval.",
                    "Metric Learning for Session-Based Recommendations.",
                    "Machine Translation Customization via Automatic Training Data Selection from the Web.",
                    "GCE: Global Contextual Information for Knowledge Graph Embedding.",
                    "Consistency and Coherency Enhanced Story Generation.",
                    "A Hierarchical Approach for Joint Extraction of Entities and Relations.",
                    "A Zero Attentive Relevance Matching Network for Review Modeling in Recommendation System.",
                    "Utilizing Local Tangent Information for Word Re-embedding.",
                    "Content Selection Network for Document-Grounded Retrieval-Based Chatbots."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2021-2",
                "sub_name": "Advances in Information Retrieval - 43rd European Conference on IR Research, ECIR 2021, Virtual Event, March 28 - April 1, 2021, Proceedings, Part II.",
                "count": 87,
                "papers": [
                    "Cross-Domain Retrieval in the Legal and Patent Domains: A Reproducibility Study.",
                    "A Critical Assessment of State-of-the-Art in Entity Alignment.",
                    "System Effect Estimation by Sharding: A Comparison Between ANOVA Approaches to Detect Significant Differences.",
                    "Reliability Prediction for Health-Related Content: A Replicability Study.",
                    "An Empirical Comparison of Web Page Segmentation Algorithms.",
                    "Re-assessing the \"Classify and Count\" Quantification Method.",
                    "Reproducibility, Replicability and Beyond: Assessing Production Readiness of Aspect Based Sentiment Analysis in the Wild.",
                    "Robustness of Meta Matrix Factorization Against Strict Privacy Constraints.",
                    "Textual Characteristics of News Title and Body to Detect Fake News: A Reproducibility Study.",
                    "Federated Online Learning to Rank with Evolution Strategies: A Reproducibility Study.",
                    "Comparing Score Aggregation Approaches for Document Retrieval with Pretrained Transformers.",
                    "Transformer-Based Approach Towards Music Emotion Recognition from Lyrics.",
                    "BiGBERT: Classifying Educational Web Resources for Kindergarten-12th Grades.",
                    "How Do Users Revise Zero-Hit Product Search Queries?",
                    "Query Performance Prediction Through Retrieval Coherency.",
                    "From the Beatles to Billie Eilish: Connecting Provider Representativeness and Exposure in Session-Based Recommender Systems.",
                    "Bayesian System Inference on Shallow Pools.",
                    "Exploring Gender Biases in Information Retrieval Relevance Judgement Datasets.",
                    "Assessing the Benefits of Model Ensembles in Neural Re-ranking for Passage Retrieval.",
                    "Event Detection with Entity Markers.",
                    "Simplified TinyBERT: Knowledge Distillation for Document Retrieval.",
                    "Improving Cold-Start Recommendation via Multi-prior Meta-learning.",
                    "A White Box Analysis of ColBERT.",
                    "Diversity Aware Relevance Learning for Argument Search.",
                    "SQE-GAN: A Supervised Query Expansion Scheme via GAN.",
                    "Rethink Training of BERT Rerankers in Multi-stage Retrieval Pipeline.",
                    "Should I Visit This Place? Inclusion and Exclusion Phrase Mining from Reviews.",
                    "Dynamic Cross-Sentential Context Representation for Event Detection.",
                    "Transfer Learning and Augmentation for Word Sense Disambiguation.",
                    "Cross-modal Memory Fusion Network for Multimodal Sequential Learning with Missing Values.",
                    "Social Media Popularity Prediction of Planned Events Using Deep Learning.",
                    "Right for the Right Reasons: Making Image Classification Intuitively Explainable.",
                    "Weakly Supervised Label Smoothing.",
                    "Neural Feature Selection for Learning to Rank.",
                    "Exploring the Incorporation of Opinion Polarity for Abstractive Multi-document Summarisation.",
                    "Multilingual Evidence Retrieval and Fact Verification to Combat Global Disinformation: The Power of Polyglotism.",
                    "How Do Active Reading Strategies Affect Learning Outcomes in Web Search?",
                    "Fine-Tuning BERT for COVID-19 Domain Ad-Hoc IR by Using Pseudo-qrels.",
                    "Windowing Models for Abstractive Summarization of Long Texts.",
                    "Towards Dark Jargon Interpretation in Underground Forums.",
                    "Multi-span Extractive Reading Comprehension Without Multi-span Supervision.",
                    "Textual Complexity as an Indicator of Document Relevance.",
                    "A Comparison of Question Rewriting Methods for Conversational Passage Retrieval.",
                    "Predicting Question Responses to Improve the Performance of Retrieval-Based Chatbot.",
                    "Multi-head Self-attention with Role-Guided Masks.",
                    "PGT: Pseudo Relevance Feedback Using a Graph-Based Transformer.",
                    "Clustering-Augmented Multi-instance Learning for Neural Relation Extraction.",
                    "Detecting and Forecasting Misinformation via Temporal and Geometric Propagation Patterns.",
                    "Deep Query Likelihood Model for Information Retrieval.",
                    "Tweet Length Matters: A Comparative Analysis on Topic Detection in Microblogs.",
                    "repro_eval: A Python Interface to Reproducibility Measures of System-Oriented IR Experiments.",
                    "Signal Briefings: Monitoring News Beyond the Brand.",
                    "Time-Matters: Temporal Unfolding of Texts.",
                    "An Extensible Toolkit of Query Refinement Methods and Gold Standard Dataset Generation.",
                    "CoralExp: An Explainable System to Support Coral Taxonomy Research.",
                    "AWESSOME: An Unsupervised Sentiment Intensity Scoring Framework Using Neural Word Embeddings.",
                    "HSEarch: Semantic Search System for Workplace Accident Reports.",
                    "Multi-view Conversational Search Interface Using a Dialogue-Based Agent.",
                    "LogUI: Contemporary Logging Infrastructure for Web-Based Experiments.",
                    "LEMONS: Listenable Explanations for Music recOmmeNder Systems.",
                    "Aspect-Based Passage Retrieval with Contextualized Discourse Vectors.",
                    "News Monitor: A Framework for Querying News in Real Time.",
                    "Chattack: A Gamified Crowd-Sourcing Platform for Tagging Deceptive & Abusive Behaviour.",
                    "PreFace++: Faceted Retrieval of Prerequisites and Technical Data.",
                    "Brief Description of COVID-SEE: The Scientific Evidence Explorer for COVID-19 Related Research.",
                    "Overview of PAN 2021: Authorship Verification, Profiling Hate Speech Spreaders on Twitter, and Style Change Detection - Extended Abstract.",
                    "Overview of Touché 2021: Argument Retrieval - Extended Abstract.",
                    "Text Simplification for Scientific Information Access - CLEF 2021 SimpleText Workshop.",
                    "CLEF eHealth Evaluation Lab 2021.",
                    "LifeCLEF 2021 Teaser: Biodiversity Identification and Prediction Challenges.",
                    "ChEMU 2021: Reaction Reference Resolution and Anaphora Resolution in Chemical Patents.",
                    "The 2021 ImageCLEF Benchmark: Multimedia Retrieval in Medical, Nature, Internet and Social Media Applications.",
                    "BioASQ at CLEF2021: Large-Scale Biomedical Semantic Indexing and Question Answering.",
                    "Advancing Math-Aware Search: The ARQMath-2 Lab at CLEF 2021.",
                    "The CLEF-2021 CheckThat! Lab on Detecting Check-Worthy Claims, Previously Fact-Checked Claims, and Fake News.",
                    "eRisk 2021: Pathological Gambling, Self-harm and Depression Challenges.",
                    "Living Lab Evaluation for Life and Social Sciences Search Platforms - LiLAS at CLEF 2021.",
                    "Automated Multi-document Text Summarization from Heterogeneous Data Sources.",
                    "Background Linking of News Articles.",
                    "Multidimensional Relevance in Task-Specific Retrieval.",
                    "Deep Semantic Entity Linking.",
                    "Deep Learning System for Biomedical Relation Extraction Combining External Sources of Knowledge.",
                    "Second International Workshop on Algorithmic Bias in Search and Recommendation (BIAS@ECIR2021).",
                    "The 4th International Workshop on Narrative Extraction from Texts: Text2Story 2021.",
                    "Bibliometric-Enhanced Information Retrieval: 11th International BIR Workshop.",
                    "MICROS: Mixed-Initiative ConveRsatiOnal Systems Workshop.",
                    "ROMCIR 2021: Reducing Online Misinformation through Credible Information Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/birws/2021",
                "sub_name": "Proceedings of the 11th International Workshop on Bibliometric-enhanced Information Retrieval co-located with 43rd European Conference on Information Retrieval (ECIR 2021), Lucca, Italy (online only), April 1st, 2021.",
                "count": 10,
                "papers": [
                    "Preface to the 11th Workshop on Bibliometric-enhanced Information Retrieval at ECIR 2021.",
                    "Self-Supervised Learning for Visual Summary Identification in Scientific Publications.",
                    "Argumentation Mining in Scientific Literature: From Computational Linguistics to Biomedicine.",
                    "Preprint Abstracts in Times of Crisis: a Comparative Study with the Pre-pandemic Period.",
                    "Expertise Based Institutional Recommendation in Different Thematic Areas.",
                    "A Select and Rewrite Approach to the Generation of Related Work Reports.",
                    "Bibliometric Indicators and Relevance Criteria - An Online Experiment.",
                    "Improving Reference Mining in Patents with BERT.",
                    "PatentQuest: A User-Oriented Tool for Integrated Patent Search.",
                    "\"This research is funded by...\": Named Entity Recognition of Financial Information in Research Papers."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2021text2story",
                "sub_name": "Proceedings of Text2Story - Fourth Workshop on Narrative Extraction From Texts held in conjunction with the 43rd European Conference on Information Retrieval (ECIR 2021), Lucca, Italy, April 1, 2021 (online event due to Covid-19 outbreak).",
                "count": 13,
                "papers": [
                    "Storytelling Through Infographics.",
                    "How Wikimedia Understands the Text2Narrative Process.",
                    "A Pilot Study on Annotating Scenes in Narrative Text using SceneML.",
                    "A Different Story: How Conservative Narratives Diverge Between Twitter and Parler.",
                    "A Model of Interpretation of Embedded Stories.",
                    "Stories from Blogs: Computational Extraction and Visualization of Narratives.",
                    "Which entities are relevant for the story?",
                    "Brat2Viz: a Tool and Pipeline for Visualizing Narratives from Annotated Texts.",
                    "Demonstrating Narrative Bindings: Linking Discourses to Knowledge Repositories.",
                    "The Nectar of Missing Position Prediction for Story Completion.",
                    "THEaiTRE 1.0: Interactive Generation of Theatre Play Scripts.",
                    "Narrative Trends of COVID-19 Misinformation.",
                    "Modeling Social Media Narratives about Caste-related News Stories."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2021romcir",
                "sub_name": "Proceedings of the workshop Reducing Online Misinformation Through Credible Information Retrieval (ROMCIR 2021) co-located with 43rd European Conference on Information Retrieval (ECIR 2021), Lucca, Italy (On-line), April 1, 2021.",
                "count": 6,
                "papers": [
                    "Improving Authorship Verification using Linguistic Divergence.",
                    "Bias and truth in science evaluation: a simulation model of grant review panel discussions.",
                    "Consumption of Hate Speech on Twitter: A Topical Approach to Capture Networks of Hateful Users.",
                    "On the Feasibility of Using GANs for Claim Verification- Experiments and Analysis.",
                    "Supporting verification of news articles with automated search for semantically similar articles.",
                    "Sharing retrieved information using Linked Credibility Reviews."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "42nd ECIR 2020",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2020-1",
                "sub_name": "Advances in Information Retrieval - 42nd European Conference on IR Research, ECIR 2020, Lisbon, Portugal, April 14-17, 2020, Proceedings, Part I.",
                "count": 55,
                "papers": [
                    "Seed-Guided Deep Document Clustering.",
                    "Improving Knowledge Graph Embedding Using Locally and Globally Attentive Relation Paths.",
                    "ReadNet: A Hierarchical Transformer Framework for Web Article Readability Analysis.",
                    "Variational Recurrent Sequence-to-Sequence Retrieval for Stepwise Illustration.",
                    "A Hierarchical Model for Data-to-Text Generation.",
                    "Context-Guided Learning to Rank Entities.",
                    "Graph-Embedding Empowered Entity Retrieval.",
                    "Learning Advanced Similarities and Training Features for Toponym Interlinking.",
                    "Patch-Based Identification of Lexical Semantic Relations.",
                    "Joint Word and Entity Embeddings for Entity Retrieval from a Knowledge Graph.",
                    "Evaluating the Effectiveness of the Standard Insights Extraction Pipeline for Bantu Languages.",
                    "Axiomatic Analysis of Contact Recommendation Methods in Social Networks: An IR Perspective.",
                    "Recommending Music Curators: A Neural Style-Aware Approach.",
                    "Joint Geographical and Temporal Modeling Based on Matrix Factorization for Point-of-Interest Recommendation.",
                    "Semantic Modelling of Citation Contexts for Context-Aware Citation Recommendation.",
                    "TransRev: Modeling Reviews as Translations from Users to Items.",
                    "Domain-Independent Extraction of Scientific Concepts from Research Articles.",
                    "Leveraging Schema Labels to Enhance Dataset Search.",
                    "Moving from Formal Towards Coherent Concept Analysis: Why, When and How.",
                    "Beyond Modelling: Understanding Mental Disorders in Online Social Media.",
                    "Learning Based Methods for Code Runtime Complexity Prediction.",
                    "Inductive Document Network Embedding with Topic-Word Attention.",
                    "Multi-components System for Automatic Arabic Diacritization.",
                    "A Mixed Semantic Features Model for Chinese NER with Characters and Words.",
                    "VGCN-BERT: Augmenting BERT with Graph Embedding for Text Classification.",
                    "A Computational Approach for Objectively Derived Systematic Review Search Strategies.",
                    "You Can Teach an Old Dog New Tricks: Rank Fusion applied to Coordination Level Matching for Ranking in Systematic Reviews.",
                    "Counterfactual Online Learning to Rank.",
                    "A Framework for Argument Retrieval - Ranking Argument Clusters by Frequency and Specificity.",
                    "Relevance Ranking Based on Query-Aware Context Analysis.",
                    "Multimodal Entity Linking for Tweets.",
                    "MEMIS: Multimodal Emergency Management Information System.",
                    "Interactive Learning for Multimedia at Large.",
                    "Visual Re-Ranking via Adaptive Collaborative Hypergraph Learning for Image Retrieval.",
                    "Motion Words: A Text-Like Representation of 3D Skeleton Sequences.",
                    "Reinforced Rewards Framework for Text Style Transfer.",
                    "Recognizing Semantic Relations: Attention-Based Transformers vs. Recurrent Models.",
                    "Early Detection of Rumours on Twitter via Stance Transfer Learning.",
                    "Learning to Rank Images with Cross-Modal Graph Convolutions.",
                    "Diagnosing BERT with Retrieval Heuristics.",
                    "Generation of Synthetic Query Auto Completion Logs.",
                    "What Can Task Teach Us About Query Reformulations?",
                    "A Regularised Intent Model for Discovering Multiple Intents in E-Commerce Tail Queries.",
                    "Utilising Information Foraging Theory for User Interaction with Image Query Auto-Completion.",
                    "Using Image Captions and Multitask Learning for Recommending Query Reformulations.",
                    "Curriculum Learning Strategies for IR.",
                    "Accelerating Substructure Similarity Search for Formula Retrieval.",
                    "Quantum-Like Structure in Multidimensional Relevance Judgements.",
                    "Temporal Latent Space Modeling for Community Prediction.",
                    "KvGR: A Graph-Based Interface for Explorative Sequential Question Answering on Heterogeneous Information Sources.",
                    "Answering Event-Related Questions over Long-Term News Article Archives.",
                    "bias goggles: Graph-Based Computation of the Bias of Web Domains Through the Eyes of Users.",
                    "Biconditional Generative Adversarial Networks for Multiview Learning with Missing Views.",
                    "Semantic Path-Based Learning for Review Volume Prediction.",
                    "An Attention Model of Customer Expectation to Improve Review Helpfulness Prediction."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2020-2",
                "sub_name": "Advances in Information Retrieval - 42nd European Conference on IR Research, ECIR 2020, Lisbon, Portugal, April 14-17, 2020, Proceedings, Part II.",
                "count": 89,
                "papers": [
                    "Knowledge Graph Entity Alignment with Graph Convolutional Networks: Lessons Learned.",
                    "The Effect of Content-Equivalent Near-Duplicates on the Evaluation of Search Engines.",
                    "From MAXSCORE to Block-Max Wand: The Story of How Lucene Significantly Improved Query Evaluation Performance.",
                    "Which BM25 Do You Mean? A Large-Scale Reproducibility Study of Scoring Variants.",
                    "The Unfairness of Popularity Bias in Music Recommendation: A Reproducibility Study.",
                    "Reproducibility is a Process, Not an Achievement: The Replicability of IR Reproducibility Experiments.",
                    "On the Replicability of Combining Word Embeddings and Retrieval Models.",
                    "Influence of Random Walk Parametrization on Graph Embeddings.",
                    "Calling Attention to Passages for Biomedical Question Answering.",
                    "Neural Embedding-Based Metrics for Pre-retrieval Query Performance Prediction.",
                    "A Latent Model for Ad Hoc Table Retrieval.",
                    "Hybrid Semantic Recommender System for Chemical Compounds.",
                    "Assessing the Impact of OCR Errors in Information Retrieval.",
                    "Towards Query Logs for Privacy Studies: On Deriving Search Queries from Questions.",
                    "Machine-Actionable Data Management Plans: A Knowledge Retrieval Approach to Automate the Assessment of Funders' Requirements.",
                    "Session-Based Path Prediction by Combining Local and Global Content Preferences.",
                    "Unsupervised Ensemble of Ranking Models for News Comments Using Pseudo Answers.",
                    "Irony Detection in a Multilingual Context.",
                    "Document Network Projection in Pretrained Word Embedding Space.",
                    "Supervised Learning Methods for Diversification of Image Search Results.",
                    "ANTIQUE: A Non-factoid Question Answering Benchmark.",
                    "Neural Query-Biased Abstractive Summarization Using Copying Mechanism.",
                    "Distant Supervision for Extractive Question Summarization.",
                    "Text-Image-Video Summary Generation Using Joint Integer Linear Programming.",
                    "Domain Adaptation via Context Prediction for Engineering Diagram Search.",
                    "Crowdsourcing Truthfulness: The Impact of Judgment Scale and Assessor Bias.",
                    "Novel and Diverse Recommendations by Leveraging Linear Models with User and Item Embeddings.",
                    "A Multi-task Approach to Open Domain Suggestion Mining Using Language Model for Text Over-Sampling.",
                    "MedLinker: Medical Entity Linking with Neural Representations and Dictionary Matching.",
                    "Ranking Significant Discrepancies in Clinical Reports.",
                    "Teaching a New Dog Old Tricks: Resurrecting Multilingual Retrieval Using Zero-Shot Learning.",
                    "Semi-supervised Extractive Question Summarization Using Question-Answer Pairs.",
                    "Utilizing Temporal Psycholinguistic Cues for Suicidal Intent Estimation.",
                    "PMD: An Optimal Transportation-Based User Distance for Recommender Systems.",
                    "On Biomedical Named Entity Recognition: Experiments in Interlingual Transfer for Clinical and Social Media Texts.",
                    "SlideImages: A Dataset for Educational Image Classification.",
                    "Rethinking Query Expansion for BERT Reranking.",
                    "Personalized Video Summarization Based Exclusively on User Preferences.",
                    "SentiInc: Incorporating Sentiment Information into Sentiment Transfer Without Parallel Data.",
                    "Dualism in Topical Relevance.",
                    "Keyphrase Extraction as Sequence Labeling Using Contextualized Embeddings.",
                    "Easing Legal News Monitoring with Learning to Rank and BERT.",
                    "Generating Query Suggestions for Cross-language and Cross-terminology Health Information Retrieval.",
                    "Identifying Notable News Stories.",
                    "BERT for Evidence Retrieval and Claim Verification.",
                    "BiOnt: Deep Learning Using Multiple Biomedical Ontologies for Relation Extraction.",
                    "On the Temporality of Priors in Entity Linking.",
                    "Contextualized Embeddings in Named-Entity Recognition: An Empirical Study on Generalization.",
                    "DAKE: Document-Level Attention for Keyphrase Extraction.",
                    "Understanding Depression from Psycholinguistic Patterns in Social Media Texts.",
                    "Predicting the Size of Candidate Document Set for Implicit Web Search Result Diversification.",
                    "Aspect-Based Academic Search Using Domain-Specific KB.",
                    "Dynamic Heterogeneous Graph Embedding Using Hierarchical Attentions.",
                    "DSR: A Collection for the Evaluation of Graded Disease-Symptom Relations.",
                    "A Web-Based Platform for Mining and Ranking Association Rules.",
                    "Army ANT: A Workbench for Innovation in Entity-Oriented Search.",
                    "A Search Engine for Police Press Releases to Double-Check the News.",
                    "Neural-IR-Explorer: A Content-Focused Tool to Explore Neural Re-ranking Results.",
                    "Revisionista.PT: Uncovering the News Cycle Using Web Archives.",
                    "MathSeer: A Math-Aware Search Interface with Intuitive Formula Editing, Reuse, and Lookup.",
                    "NLPExplorer: Exploring the Universe of NLP Papers.",
                    "Personal Research Assistant for Online Exploration of Historical News.",
                    "QISS: An Open Source Image Similarity Search Engine.",
                    "EveSense: What Can You Sense from Twitter?",
                    "CheckThat! at CLEF 2020: Enabling the Automatic Identification and Verification of Claims in Social Media.",
                    "Shared Tasks on Authorship Analysis at PAN 2020.",
                    "Touché: First Shared Task on Argument Retrieval.",
                    "Introducing the CLEF 2020 HIPE Shared Task: Named Entity Recognition and Linking on Historical Newspapers.",
                    "ImageCLEF 2020: Multimedia Retrieval in Lifelogging, Medical, Nature, and Internet Applications.",
                    "LifeCLEF 2020 Teaser: Biodiversity Identification and Prediction Challenges.",
                    "BioASQ at CLEF2020: Large-Scale Biomedical Semantic Indexing and Question Answering.",
                    "eRisk 2020: Self-harm and Depression Challenges.",
                    "Finding Old Answers to New Math Questions: The ARQMath Lab at CLEF 2020.",
                    "ChEMU: Named Entity Recognition and Event Extraction of Chemical Reactions from Patents.",
                    "Living Labs for Academic Search at CLEF 2020.",
                    "CLEF eHealth Evaluation Lab 2020.",
                    "Reproducible Online Search Experiments.",
                    "Graph-Based Entity-Oriented Search: A Unified Framework in Information Retrieval.",
                    "Graph Databases for Information Retrieval.",
                    "Towards a Better Contextualization of Web Contents via Entity-Level Analytics.",
                    "Incremental Approach for Automatic Generation of Domain-Specific Sentiment Lexicon.",
                    "Time-Critical Geolocation for Social Good.",
                    "Bibliometric-Enhanced Legal Information Retrieval.",
                    "International Workshop on Algorithmic Bias in Search and Recommendation (Bias 2020).",
                    "Bibliometric-Enhanced Information Retrieval 10th Anniversary Workshop Edition.",
                    "The 3rd International Workshop on Narrative Extraction from Texts: Text2Story 2020.",
                    "Proposal of the First International Workshop on Semantic Indexing and Information Retrieval for Health from Heterogeneous Content Types and Languages (SIIRH).",
                    "Principle-to-Program: Neural Methods for Similar Question Retrieval in Online Communities.",
                    "Text Meets Space: Geographic Content Extraction, Resolution and Information Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/birws/2020",
                "sub_name": "Proceedings of the 10th International Workshop on Bibliometric-enhanced Information Retrieval co-located with 42nd European Conference on Information Retrieval, BIR@ECIR 2020, Lisbon, Portugal, April 14th, 2020 [online only].",
                "count": 19,
                "papers": [
                    "Preface to the 10th Workshop on Bibliometric-enhanced Information Retrieval at ECIR 2020.",
                    "Metrics and Trends in Assessing the Scientific Impact.",
                    "New Datasets and a Benchmark of Document Network Embedding Methods for Scientific Expert Finding.",
                    "Conference Indexing in Digital Libraries: A Ranking Model and Case Study on dblp.",
                    "Usage and Citation Metrics for Ranking Algorithms in Legal Information Retrieval Systems.",
                    "Browsing Citation Clusters for Academic Literature Search: A Simulation Study with Systematic Reviews.",
                    "Neural Citation Recommendation: A Reproducibility Study.",
                    "Learning to Rank Research Articles: A Case Study of Collaborative Filtering and Learning to Rank in ScienceDirect.",
                    "Evaluating Pretrained Transformer Models for Citation Recommendation.",
                    "Relations Between Relevance Assessments, Bibliometrics and Altmetrics.",
                    "Building Bridges.",
                    "Why we Need Another Ten Years of Bibliometric-enhanced Information Retrieval.",
                    "BIR: A Time and a Place to Envision Concepts and Tools around Bibliometrics.",
                    "Some Questions for Information Science Arising from the History and Philosophy of Science.",
                    "Remembering Don Swanson: Link to Bibliometric-enhanced Information Retrieval.",
                    "Bibliometrics-aided Retrieval: A Success Story.",
                    "BIR and BIRNDL: A Marathon towards a Congregation of Scientific Document Processing Community.",
                    "Anniversary Statement.",
                    "Intrication between Information Retrieval and Bibliometrics: the Case of Scientific Domain Delineation."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2020text2story",
                "sub_name": "Proceedings of Text2Story - Third Workshop on Narrative Extraction From Texts co-located with 42nd European Conference on Information Retrieval, Text2Story@ECIR 2020, Lisbon, Portugal, April 14th, 2020 [online only].",
                "count": 15,
                "papers": [
                    "Tailoring Media Monitoring with User Feedback.",
                    "Recent Advances in Narrative Natural Language Processing.",
                    "Teargas, Water Cannons and Twitter: A case study on detecting protest repression events in Turkey 2013.",
                    "Measuring Narrative Fluency by Analyzing Dynamic Interaction Networks in Textual Narratives.",
                    "Breaking the Subtopic Barrier in Cross-Document Event Coreference Resolution.",
                    "Time-centric Exploration of Court Documents.",
                    "Incorporating Context and Knowledge for Better Sentiment Analysis of Narrative Text.",
                    "Scene Linking Annotation and Automatic Scene Characterization in TV Series.",
                    "Batch Clustering for Multilingual News Streaming.",
                    "A Framework towards Computational Narrative Analysis on Blogs.",
                    "Temporal Embeddings and Transformer Models for Narrative Text Understanding.",
                    "Eve2Sign: Creating Signed Networks of News Events.",
                    "Towards a Cross-article Narrative Comparison of News.",
                    "The Need to Move beyond Triples.",
                    "Timelines: Entity-centric Event Extraction from Online News."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2020siirh",
                "sub_name": "Proceedings of the Workshop on Semantic Indexing and Information Retrieval for Health from heterogeneous content types and languages co-located with 42nd European Conference on Information Retrieval, SIIRH@ECIR 2020, Lisbon, Portugal, April 14, 2020.",
                "count": 10,
                "papers": [
                    "CoronaTracker: A Framework for Managing and Tracking Data during Crisis - Abstract.",
                    "The COVID-19 Open Research Dataset - Abstract.",
                    "BioASQ: The challenge and the Community of Biomedical Semantic Indexing and Question Answering - Abstract.",
                    "First Steps Towards Patient-Friendly Presentation of Dutch Radiology Reports.",
                    "Enriching Consumer Health Vocabulary Using Enhanced GloVe Word Embedding.",
                    "SmokPro: Towards Tobacco Product Identification in Social Media Text.",
                    "Twitter goes to the Doctor: Detecting Medical Tweets using Machine Learning and BERT.",
                    "Biomedical Question Answering using Extreme Multi-Label Classification and Ontologies in the Multilingual Panorama.",
                    "Towards a Multilingual Corpus for Named Entity Linking Evaluation in the Clinical Domain.",
                    "Report of the First International Workshop on Semantic Indexing and Information Retrieval for Health from heterogeneous content types and languages."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "41st ECIR 2019",
        "info": "Cologne, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2019-1",
                "sub_name": "Advances in Information Retrieval - 41st European Conference on IR Research, ECIR 2019, Cologne, Germany, April 14-18, 2019, Proceedings, Part I.",
                "count": 64,
                "papers": [
                    "Learning Lexical-Semantic Relations Using Intuitive Cognitive Links.",
                    "Relationship Prediction in Dynamic Heterogeneous Information Networks.",
                    "Retrieving Relationships from a Knowledge Graph for Question Answering.",
                    "Embedding Geographic Locations for Modelling the Natural Environment Using Flickr Tags and Structured Data.",
                    "Recognising Summary Articles.",
                    "Towards Content Expiry Date Determination: Predicting Validity Periods of Sentences.",
                    "Dynamic Ensemble Selection for Author Verification.",
                    "Structural Similarity Search for Formulas Using Leaf-Root Paths in Operator Subtrees.",
                    "PRIN: A Probabilistic Recommender with Item Priors and Neural Models.",
                    "Information Retrieval Models for Contact Recommendation in Social Networks.",
                    "Conformative Filtering for Implicit Feedback Data.",
                    "Binarized Knowledge Graph Embeddings.",
                    "A Supervised Keyphrase Extraction System Based on Graph Representation Learning.",
                    "Comparison of Sentiment Analysis and User Ratings in Venue Recommendation.",
                    "AntRS: Recommending Lists Through a Multi-objective Ant Colony System.",
                    "Automated Early Leaderboard Generation from Comparative Tables.",
                    "Predicting the Topic of Your Next Query for Just-In-Time IR.",
                    "Identifying Unclear Questions in Community Question Answering Websites.",
                    "Local and Global Query Expansion for Hierarchical Complex Topics.",
                    "Word Embeddings for Entity-Annotated Texts.",
                    "Vectors of Pairwise Item Preferences.",
                    "Compressing Inverted Indexes with Recursive Graph Bisection: A Reproducibility Study.",
                    "An Experimental Study of Index Compression and DAAT Query Processing Methods.",
                    "Reproducing and Generalizing Semantic Term Matching in Axiomatic Information Retrieval.",
                    "Optimizing Ranking Models in an Online Setting.",
                    "Simple Techniques for Cross-Collection Relevance Feedback.",
                    "A Comparative Study of Summarization Algorithms Applied to Legal Case Judgments.",
                    "Replicating Relevance-Ranked Synonym Discovery in a New Language and Domain.",
                    "On Cross-Domain Transfer in Venue Recommendation.",
                    "The Effect of Algorithmic Bias on Recommender Systems for Massive Open Online Courses.",
                    "Domain Adaptive Neural Sentence Compression by Tree Cutting.",
                    "An Axiomatic Approach to Diagnosing Neural IR Models.",
                    "Term Selection for Query Expansion in Medical Cross-Lingual Information Retrieval.",
                    "Zero-Shot Language Transfer for Cross-Lingual Sentence Retrieval Using Bidirectional Attention Model.",
                    "QRFA: A Data-Driven Model of Information-Seeking Dialogues.",
                    "Iterative Relevance Feedback for Answer Passage Retrieval with Passage-Level Semantic Match.",
                    "LICD: A Language-Independent Approach for Aspect Category Detection.",
                    "Topic Grouper: An Agglomerative Clustering Approach to Topic Modeling.",
                    "Meta-evaluation of Dynamic Search: How Do Metrics Capture Topical Relevance, Diversity and User Effort?",
                    "A Markovian Approach to Evaluate Session-Based IR Systems.",
                    "Correlation, Prediction and Ranking of Evaluation Metrics in Information Retrieval.",
                    "Modeling User Actions in Job Search.",
                    "Automated Semantic Annotation of Species Names in Handwritten Texts.",
                    "Tangent-V: Math Formula Image Search Using Line-of-Sight Graphs.",
                    "Figure Retrieval from Collections of Research Articles.",
                    "\"Is This an Example Image?\" - Predicting the Relative Abstractness Level of Image and Text.",
                    "End-to-End Neural Relation Extraction Using Deep Biaffine Attention.",
                    "Social Relation Inference via Label Propagation.",
                    "Wikipedia Text Reuse: Within and Without.",
                    "Stochastic Relevance for Crowdsourcing.",
                    "Exploiting a More Global Context for Event Detection Through Bootstrapping.",
                    "Faster BlockMax WAND with Longer Skipping.",
                    "A Hybrid Modeling Approach for an Automated Lyrics-Rating System for Adolescents.",
                    "Evaluating Similarity Metrics for Latent Twitter Topics.",
                    "On Interpretability and Feature Representations: An Analysis of the Sentiment Neuron.",
                    "Image Tweet Popularity Prediction with Convolutional Neural Network.",
                    "Enriching Word Embeddings for Patent Retrieval with Global Context.",
                    "Incorporating External Knowledge to Boost Machine Comprehension Based Question Answering.",
                    "Impact of Training Dataset Size on Neural Answer Selection Models.",
                    "Unsupervised Explainable Controversy Detection from Online News.",
                    "Extracting Temporal Event Relations Based on Event Networks.",
                    "Dynamic-Keyword Extraction from Social Media.",
                    "Local Popularity and Time in top-N Recommendation.",
                    "Multiple Keyphrase Generation Model with Diversity."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2019-2",
                "sub_name": "Advances in Information Retrieval - 41st European Conference on IR Research, ECIR 2019, Cologne, Germany, April 14-18, 2019, Proceedings, Part II.",
                "count": 55,
                "papers": [
                    "Open-Set Web Genre Identification Using Distributional Features and Nearest Neighbors Distance Ratio.",
                    "Exploiting Global Impact Ordering for Higher Throughput in Selective Search.",
                    "Cross-Domain Recommendation via Deep Domain Adaptation.",
                    "It's only Words and Words Are All I Have.",
                    "Modeling User Return Time Using Inhomogeneous Poisson Process.",
                    "Inductive Transfer Learning for Detection of Well-Formed Natural Language Search Queries.",
                    "Towards Spatial Word Embeddings.",
                    "Asymmetry Sensitive Architecture for Neural Text Matching.",
                    "QGraph: A Quality Assessment Index for Graph Clustering.",
                    "A Neural Approach to Entity Linking on Wikidata.",
                    "Self-attentive Model for Headline Generation.",
                    "Can Image Captioning Help Passage Retrieval in Multimodal Question Answering?",
                    "A Simple Neural Approach to Spatial Role Labelling.",
                    "Neural Diverse Abstractive Sentence Compression Generation.",
                    "Fully Contextualized Biomedical NER.",
                    "DeepTagRec: A Content-cum-User Based Tag Recommendation Framework for Stack Overflow.",
                    "Document Performance Prediction for Automatic Text Classification.",
                    "Misleading Metadata Detection on YouTube.",
                    "A Test Collection for Passage Retrieval Evaluation of Spanish Health-Related Resources.",
                    "On the Impact of Storing Query Frequency History for Search Engine Result Caching.",
                    "AspeRa: Aspect-Based Rating Prediction Model.",
                    "Heterogeneous Edge Embedding for Friend Recommendation.",
                    "Public Sphere 2.0: Targeted Commenting in Online News Media.",
                    "An Extended CLEF eHealth Test Collection for Cross-Lingual Information Retrieval in the Medical Domain.",
                    "An Axiomatic Study of Query Terms Order in Ad-Hoc Retrieval.",
                    "Deep Neural Networks for Query Expansion Using Word Embeddings.",
                    "Online Evaluations for Everyone: Mr. DLib's Living Lab for Scholarly Recommendations.",
                    "StyleExplorer: A Toolkit for Textual Writing Style Visualization.",
                    "MedSpecSearch: Medical Specialty Search.",
                    "Contender: Leveraging User Opinions for Purchase Decision-Making.",
                    "Rethinking 'Advanced Search': A New Approach to Complex Query Formulation.",
                    "node-indri: Moving the Indri Toolkit to the Modern Web Stack.",
                    "PaperHunter: A System for Exploring Papers and Citation Contexts.",
                    "Interactive System for Automatically Generating Temporal Narratives.",
                    "Early Detection of Risks on the Internet: An Exploratory Campaign.",
                    "CLEF eHealth 2019 Evaluation Lab.",
                    "LifeCLEF 2019: Biodiversity Identification and Prediction Challenges.",
                    "CENTRE@CLEF 2019.",
                    "A Decade of Shared Tasks in Digital Text Forensics at PAN.",
                    "ImageCLEF 2019: Multimedia Retrieval in Lifelogging, Medical, Nature, and Security Applications.",
                    "CheckThat! at CLEF 2019: Automatic Identification and Verification of Claims.",
                    "A Task Set Proposal for Automatic Protest Information Collection Across Multiple Countries.",
                    "Exploring Result Presentation in Conversational IR Using a Wizard-of-Oz Study.",
                    "Keyword Search on RDF Datasets.",
                    "Learning User and Item Representations for Recommender Systems.",
                    "Improving the Annotation Efficiency and Effectiveness in the Text Domain.",
                    "Logic-Based Models for Social Media Retrieval.",
                    "Adapting Models for the Case of Early Risk Prediction on the Internet.",
                    "Integration of Images into the Patent Retrieval Process.",
                    "Dialogue-Based Information Retrieval.",
                    "Dynamic Diversification for Interactive Complex Search.",
                    "The Influence of Backstories on Queries with Varying Levels of Intent in Task-Based Specialised Information Retrieval.",
                    "Proposal for the 1st Interdisciplinary Workshop on Algorithm Selection and Meta-Learning in Information Retrieval (AMIR).",
                    "The 2nd International Workshop on Narrative Extraction from Text: Text2Story 2019.",
                    "Bibliometric-Enhanced Information Retrieval: 8th International BIR Workshop."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2019bir",
                "sub_name": "Proceedings of the 8th International Workshop on Bibliometric-enhanced Information Retrieval (BIR 2019) co-located with the 41st European Conference on Information Retrieval (ECIR 2019), Cologne, Germany, April 14, 2019.",
                "count": 15,
                "papers": [
                    "Editorial for the 8th Bibliometric-enhanced Information Retrieval Workshop at ECIR 2019.",
                    "Beyond Metadata: the New Challenges in Mining Scientific Papers.",
                    "Bibliometric-Enhanced arXiv: A Data Set for Paper-Based and Citation-Based Tasks.",
                    "Discovering Seminal Works with Marker Papers.",
                    "Citation Metrics for Legal Information Retrieval Systems.",
                    "Optimal Citation Context Window Sizes for Biomedical Retrieval.",
                    "How do Computer Scientists Use Google Scholar?: A Survey of User Interest in Elements on SERPs and Author Profile Pages.",
                    "An Interactive Visual Tool for Scientific Literature Search: Proposal and Algorithmic Specification.",
                    "Feature Selection and Graph Representation for an Analysis of Science Fields Evolution: An Application to the Digital Library ISTEX.",
                    "Mining Intellectual Influence Associations.",
                    "A \"Searchable\" Space with Routes for Querying Scientific Information.",
                    "A Preliminary Study to Compare Deep Learning with Rule-based Approaches for Citation Classification.",
                    "Finding Temporal Trends of Scientific Concepts.",
                    "Improving Scientific Article Visibility by Neural Title Simplification.",
                    "Recommending Multimedia Educational Resources on the MOVING Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2019text2story",
                "sub_name": "Proceedings of Text2Story - 2nd Workshop on Narrative Extraction From Texts, co-located with the 41st European Conference on Information Retrieval, Text2Story@ECIR 2019, Cologne, Germany, April 14th, 2019.",
                "count": 12,
                "papers": [
                    "Claim Validation by Humans and Machines: Where We Are and the Road Ahead.",
                    "Automatic Media Analysis: From Monitoring to Insights.",
                    "Extracting Evidence Summaries from Detective Novels.",
                    "Automated Event Extraction Model for Linked Portuguese Documents.",
                    "Narrative Detection in Online Patient Communities.",
                    "NOVEL2GRAPH: Visual Summaries of Narrative Text Enhanced by Machine Learning.",
                    "Textual Analysis for Radicalisation Narratives Aligned with Social Sciences Perspectives.",
                    "Dense vs. Sparse Representations for News Stream Clustering.",
                    "Steps Towards a System to Extract Formal Narratives from Text.",
                    "Semantic Storytelling: Towards Identifying Storylines in Large Amounts of Text Content.",
                    "Towards the Automatic Analysis of the Structure of News Stories.",
                    "Automatic Recognition of Narrative Drama Units: A Structured Learning Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2019amir",
                "sub_name": "Proceedings of the 1st Interdisciplinary Workshop on Algorithm Selection and Meta-Learning in Information Retrieval co-located with the 41st European Conference on Information Retrieval (ECIR 2019), Cologne, Germany, April 14, 2019.",
                "count": 9,
                "papers": [
                    "Preface: The 1st Interdisciplinary Workshop on Algorithm Selection and Meta-Learning in Information Retrieval (AMIR).",
                    "Automated Algorithm Selection - Predict which algorithm to use!",
                    "Algorithm Selection with Librec-auto.",
                    "Investigating Retrieval Method Selection with Axiomatic Features.",
                    "Augmenting the DonorsChoose.org Corpus for Meta-Learning.",
                    "RARD II: The 94 Million Related-Article Recommendation Dataset.",
                    "An Extensive Checklist for Building AutoML Systems.",
                    "Hands-On Session with ASlib.",
                    "Hands-On Automated Machine Learning Tools: Auto-Sklearn and Auto-PyTorch."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "40th ECIR 2018",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2018",
                "sub_name": "Advances in Information Retrieval - 40th European Conference on IR Research, ECIR 2018, Grenoble, France, March 26-29, 2018, Proceedings.",
                "count": 83,
                "papers": [
                    "Entity-Centric Topic Extraction and Exploration: A Network-Based Approach.",
                    "Predicting Topics in Scholarly Papers.",
                    "Topic Lifecycle on Social Networks: Analyzing the Effects of Semantic Continuity and Social Communities.",
                    "Medical Forum Question Classification Using Deep Learning.",
                    "Multi-task Learning for Extraction of Adverse Drug Reaction Mentions from Tweets.",
                    "Choices in Knowledge-Base Retrieval for Consumer Health Search.",
                    "An Adversarial Joint Learning Model for Low-Resource Language Semantic Textual Similarity.",
                    "Reproducing a Neural Question Answering Architecture Applied to the SQuAD Benchmark Dataset: Challenges and Lessons Learned.",
                    "Bringing Back Structure to Free Text Email Conversations with Recurrent Neural Networks.",
                    "A Hybrid Embedding Approach to Noisy Answer Passage Retrieval.",
                    "Deep Learning for Detecting Cyberbullying Across Multiple Social Media Platforms.",
                    "Affective Neural Response Generation.",
                    "Web2Text: Deep Structured Boilerplate Removal.",
                    "Attention-Based Neural Text Segmentation.",
                    "Modelling Randomness in Relevance Judgments and Evaluation Measures.",
                    "Information Scent, Searching and Stopping - Modelling SERP Level Stopping Behaviour.",
                    "Investigating Result Usefulness in Mobile Search.",
                    "A Comparative Study of Native and Non-native Information Seeking Behaviours.",
                    "Indiscriminateness in Representation Spaces of Terms and Documents.",
                    "On the Reproducibility and Generalisation of the Linear Transformation of Word Embeddings.",
                    "Discriminative Path-Based Knowledge Graph Embedding for Precise Link Prediction.",
                    "Spherical Paragraph Model.",
                    "Aggregating Neural Word Embeddings for Document Representation.",
                    "Unsupervised Sentiment Analysis of Twitter Posts Using Density Matrix Representation.",
                    "Explicit Modelling of the Implicit Short Term User Preferences for Music Recommendation.",
                    "Benefits of Using Symmetric Loss in Recommender Systems.",
                    "Time-Aware Novelty Metrics for Recommender Systems.",
                    "Employing Document Embeddings to Solve the \"New Catalog\" Problem in User Targeting, and Provide Explanations to the Users.",
                    "Statistical Stemmers: A Reproducibility Study.",
                    "Cross-Lingual Document Retrieval Using Regularized Wasserstein Distance.",
                    "T-Shaped Mining: A Novel Approach to Talent Finding for Agile Software Teams.",
                    "Modeling Relevance Judgement Inspired by Quantum Weak Measurement.",
                    "Active Learning Strategies for Technology Assisted Sensitivity Review.",
                    "Authorship Verification in the Absence of Explicit Features and Thresholds.",
                    "Efficient Context-Aware K-Nearest Neighbor Search.",
                    "An Optimization Approach for Sub-event Detection and Summarization in Twitter.",
                    "Spatial Statistics of Term Co-occurrences for Location Prediction of Tweets.",
                    "Learning to Leverage Microblog Information for QA Retrieval.",
                    "Biomedical Question Answering via Weighted Neural Network Passage Retrieval.",
                    "Topical Stance Detection for Twitter: A Two-Phase LSTM Model Using Attention.",
                    "A Neural Passage Model for Ad-hoc Document Retrieval.",
                    "On the Cost of Negation for Dynamic Pruning.",
                    "A Meta-Evaluation of Evaluation Methods for Diversified Search.",
                    "Co-training for Extraction of Adverse Drug Reaction Mentions from Tweets.",
                    "Concept Embedding for Information Retrieval.",
                    "Patient-Age Extraction for Clinical Reports Retrieval.",
                    "Inverted List Caching for Topical Index Shards.",
                    "ALF-200k: Towards Extensive Multimodal Analyses of Music Tracks and Playlists.",
                    "Proposing Contextually Relevant Quotes for Images.",
                    "To Cite, or Not to Cite? Detecting Citation Contexts in Text.",
                    "Automated Assistance in E-commerce: An Approach Based on Category-Sensitive Retrieval.",
                    "Neural Multi-step Reasoning for Question Answering on Semi-structured Tables.",
                    "Document Ranking Applied to Second Language Learning.",
                    "Generating High-Quality Query Suggestion Candidates for Task-Based Search.",
                    "An Incremental Approach for Collaborative Filtering in Streaming Scenarios.",
                    "Collection-Document Summaries.",
                    "Towards an Understanding of Entity-Oriented Search Intents.",
                    "Towards Measuring Content Coordination in Microblogs.",
                    "Long-Span Language Models for Query-Focused Unsupervised Extractive Text Summarization.",
                    "Topic-Association Mining for User Interest Detection.",
                    "A Study of an Automatic Stopping Strategy for Technologically Assisted Medical Reviews.",
                    "Improving Deep Learning for Multiple Choice Question Answering with Candidate Contexts.",
                    "A Text Feature Based Automatic Keyword Extraction Method for Single Documents.",
                    "Simplified Hybrid Approach for Detection of Semantic Orientations in Economic Texts.",
                    "Towards Maximising Openness in Digital Sensitivity Review Using Reviewing Time Predictions.",
                    "Towards a Unified Supervised Approach for Ranking Triples of Type-Like Relations.",
                    "ParsTime: Rule-Based Extraction and Normalization of Persian Temporal Expressions.",
                    "Active Search for High Recall: A Non-stationary Extension of Thompson Sampling.",
                    "Classifying Short Descriptions of Past Events.",
                    "Stopword Detection for Streaming Content.",
                    "Generating Adversarial Text Samples.",
                    "Controlling Information Aggregation for Complex Question Answering.",
                    "Local Is Good: A Fast Citation Recommendation Approach.",
                    "On Refining Twitter Lists as Ground Truth Data for Multi-community User Classification.",
                    "Entity Retrieval via Type Taxonomy Aware Smoothing.",
                    "A Data Collection for Evaluating the Retrieval of Related Tweets to News Articles.",
                    "Content Based Weighted Consensus Summarization.",
                    "NOA: A Search Engine for Reusable Scientific Images Beyond the Life Sciences.",
                    "A Micromodule Approach for Building Real-Time Systems with Python-Based Models: Application to Early Risk Detection of Depression on Social Media.",
                    "YAKE! Collection-Independent Automatic Keyword Extractor.",
                    "SIREN - Security Information Retrieval and Extraction eNgine.",
                    "CITEWERTs: A System Combining Cite-Worthiness with Citation Recommendation.",
                    "Elastic ChatNoir: Search Engine for the ClueWeb and the Common Crawl."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2018bir",
                "sub_name": "Proceedings of the 7th International Workshop on Bibliometric-enhanced Information Retrieval (BIR 2018) co-located with the 40th European Conference on Information Retrieval (ECIR 2018), Grenoble, France, March 26, 2018.",
                "count": 10,
                "papers": [
                    "Editorial for the 7th Bibliometric-enhanced Information Retrieval Workshop at ECIR 2018.",
                    "Trends in Gaming Indicators: On Failed Attempts at Deception and their Computerised Detection.",
                    "Integrating and Exploiting Public Metadata Sources in a Bibliographic Information System.",
                    "Testing a Citation and Text-Based Framework for Retrieving Publications for Literature Reviews.",
                    "BIBLME RecSys: Harnessing Bibliometric Measures for a Scholarly Paper Recommender System.",
                    "Local Word Embeddings for Query Expansion Based on Co-Authorship and Citations.",
                    "InTeReC: In-text Reference Corpus for Applying Natural Language Processing to Bibliometrics.",
                    "Users are not Influenced by High Impact and Core Journals while Searching.",
                    "All for One or One for All? Analyzing Collaboration Patterns in Research Environments.",
                    "A Generic Framework to Perform Comprehensive Analysis of Tweets."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2018brodyn",
                "sub_name": "Proceedings of the First International Workshop on Analysis of Broad Dynamic Topics over Social Media (BroDyn 2018) co-located with the 40th European Conference on Information Retrieval (ECIR 2018), Grenoble, France, March 26, 2018.",
                "count": 4,
                "papers": [
                    "BroDyn'18: Workshop on Analysis of Broad Dynamic Topics over Social Media.",
                    "Contradiction in Reviews: Is it Strong or Low?",
                    "Real-Time Collection of Reliable and Representative Tweets Datasets Related to News Events.",
                    "Social Media based Analysis of Refugees in Turkey."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2018newsir",
                "sub_name": "Proceedings of the Second International Workshop on Recent Trends in News Information Retrieval co-located with 40th European Conference on Information Retrieval (ECIR 2018), Grenoble, France, March 26, 2018.",
                "count": 12,
                "papers": [
                    "A Plan for Ancillary Copyright: Original Snippets.",
                    "Visualizing Polarity-based Stances of News Websites.",
                    "Shaping the Information Nutrition Label.",
                    "Estimating Credibility of News Authors from their WIKI Validated Predictions.",
                    "Social Media and Information Consumption Diversity.",
                    "Cross-Reading News.",
                    "Qlusty: Quick and Dirty Generation of Event Videos from Written Media Coverage.",
                    "Named Entity Recognition for Telugu News Articles using Naïve Bayes Classifier.",
                    "Exploring Significant Interactions in Live News.",
                    "Neural Content-Collaborative Filtering for News Recommendation.",
                    "On Temporally Sensitive Word Embeddings for News Information Retrieval.",
                    "TREC 2018 News Track."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2018text2story",
                "sub_name": "Proceedings of the First Workshop on Narrative Extraction From Text (Text2Story 2018) co-located with 40th European Conference on Information Retrieval (ECIR 2018), Grenoble, France, March 26, 2018.",
                "count": 6,
                "papers": [
                    "IREvent2Story: A Novel Mediation Ontology and Narrative Generation.",
                    "Gossip is More than Just Story Telling Topic Modelling and Quantitative Analysis on a Spontaneous Speech Corpus.",
                    "Text Network Analysis and Visualization of Hungarian, Communist-era Political Reports.",
                    "Analyzing Shift in Narratives Regarding Migrants in Europe via Blogosphere.",
                    "Measuring Character-based Story Similarity by Analyzing Movie Scripts.",
                    "Job Recommendation Based on Job Seeker Skills: An Empirical Study."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "39th ECIR 2017",
        "info": "Aberdeen, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2017",
                "sub_name": "Advances in Information Retrieval - 39th European Conference on IR Research, ECIR 2017, Aberdeen, UK, April 8-13, 2017, Proceedings.",
                "count": 80,
                "papers": [
                    "Entity Linking to One Thousand Knowledge Bases.",
                    "Where Do All These Search Terms Come From? - Two Experiments in Domain-Specific Search.",
                    "Using Query Performance Predictors to Reduce Spoken Queries.",
                    "Entity Linking in Queries: Efficiency vs. Effectiveness.",
                    "Cross-Lingual Sentiment Relation Capturing for Cross-Lingual Sentiment Analysis.",
                    "Hierarchical Re-estimation of Topic Models for Measuring Topical Diversity.",
                    "Collective Entity Linking in Tweets Over Space and Time.",
                    "Simple Personalized Search Based on Long-Term Behavioral Signals.",
                    "The Effects of Search Task Determinability on Search Behavior.",
                    "Inferring User Interests for Passive Users on Twitter by Leveraging Followee Biographies.",
                    "Fusion of Bag-of-Words Models for Image Classification in the Medical Domain.",
                    "Do Topic Shift and Query Reformulation Patterns Correlate in Academic Search?",
                    "Learning to Re-rank Medical Images Using a Bayesian Network-Based Thesaurus.",
                    "A Part-of-Speech Enhanced Neural Conversation Model.",
                    "\"Are Machines Better Than Humans in Image Tagging?\" - A User Study Adds to the Puzzle.",
                    "Utterance Retrieval Based on Recurrent Surface Text Patterns.",
                    "How Do Order and Proximity Impact the Readability of Event Summaries?",
                    "Sentiment Propagation for Predicting Reputation Polarity.",
                    "Transitivity, Time Consumption, and Quality of Preference Judgments in Crowdsourcing.",
                    "Exploring Time-Sensitive Variational Bayesian Inference LDA for Social Media Data.",
                    "E-Government and the Digital Divide: A Study of English-as-a-Second-Language Users' Information Behaviour.",
                    "A Task Completion Engine to Enhance Search Session Support for Air Traffic Work Tasks.",
                    "Personalized Keyword Boosting for Venue Suggestion Based on Multiple LBSNs.",
                    "Feature-Oriented Analysis of User Profile Completion Problem.",
                    "Generating Descriptions of Entity Relationships.",
                    "Language Influences on Tweeter Geolocation.",
                    "Human-Based Query Difficulty Prediction.",
                    "Fixed-Cost Pooling Strategies Based on IR Evaluation Measures.",
                    "A Formal and Empirical Study of Unsupervised Signal Combination for Textual Similarity Tasks.",
                    "Paper2vec: Combining Graph and Text Information for Scientific Paper Representation.",
                    "Exploration of a Threshold for Similarity Based on Uncertainty in Word Embedding.",
                    "Ancient Roman Coin Retrieval: A Systematic Examination of the Effects of Coin Grade.",
                    "A Systematic Analysis of Sentence Update Detection for Temporal Summarization.",
                    "A Multiple-Instance Learning Approach to Sentence Selection for Question Ranking.",
                    "Enhancing Sensitivity Classification with Semantic Features Using Word Embeddings.",
                    "Predicting Users' Future Interests on Twitter.",
                    "A New Scheme for Scoring Phrases in Unsupervised Keyphrase Extraction.",
                    "JustEvents: A Crowdsourced Corpus for Event Validation with Strict Temporal Constraints.",
                    "Dimension Projection Among Languages Based on Pseudo-Relevant Documents for Query Translation.",
                    "Labeling Topics with Images Using a Neural Network.",
                    "Leveraging Site Search Logs to Identify Missing Content on Enterprise Webpages.",
                    "LTRo: Learning to Route Queries in Clustered P2P IR.",
                    "Faster K-Means Cluster Estimation.",
                    "Predicting Emotional Reaction in Social Networks.",
                    "Irony Detection with Attentive Recurrent Neural Networks.",
                    "We Used Neural Networks to Detect Clickbaits: You Won't Believe What Happened Next!",
                    "Learning to Classify Inappropriate Query-Completions.",
                    "Counteracting Novelty Decay in First Story Detection.",
                    "Predicting Genre Preferences from Cultural and Socio-Economic Factors for Music Retrieval.",
                    "Batch Incremental Shared Nearest Neighbor Density Based Clustering Algorithm for Dynamic Datasets.",
                    "Improving Tweet Representations Using Temporal and User Context.",
                    "Personalized Parsimonious Language Models for User Modeling in Social Bookmaking Systems.",
                    "A Novel Word Embedding Based Stemming Approach for Microblog Retrieval During Disasters.",
                    "Search Personalization with Embeddings.",
                    "Do Easy Topics Predict Effectiveness Better Than Difficult Topics?",
                    "Named Entity Classification Using Search Engine's Query Suggestions.",
                    "\"When Was This Picture Taken?\" - Image Date Estimation in the Wild.",
                    "Low-Cost Preference Judgment via Ties.",
                    "Using Section Headings to Compute Cross-Lingual Similarity of Wikipedia Articles.",
                    "Learning to Rank for Consumer Health Search: A Semantic Approach.",
                    "Matrix Factorisation with Word Embeddings for Rating Prediction on Location-Based Social Networks.",
                    "Word Similarity Based Model for Tweet Stream Prospective Notification.",
                    "Negative Feedback in the Language Modeling Framework for Text Recommendation.",
                    "Plagiarism Detection in Texts Obfuscated with Homoglyphs.",
                    "Iterative Estimation of Document Relevance Score for Pseudo-Relevance Feedback.",
                    "Design Patterns for Fusion-Based Object Retrieval.",
                    "On the Long-Tail Entities in News.",
                    "Search Costs vs. User Satisfaction on Mobile.",
                    "On the Efficiency of Selective Search.",
                    "Does Online Evaluation Correspond to Offline Evaluation in Query Auto Completion?",
                    "A Neural Attention Model for Categorizing Patient Safety Events.",
                    "Promoting Understandability in Consumer Health Information Search.",
                    "A Social Framework for Set Recommendation in Group Recommender Systems.",
                    "Pyndri: A Python Interface to the Indri Search Engine.",
                    "\"Hey, vitrivr!\" - A Multimodal UI for Video Retrieval.",
                    "FairScholar: Balancing Relevance and Diversity for Scientific Paper Recommendation.",
                    "The SENSEI Overview of Newspaper Readers' Comments.",
                    "Temporal Semantic Analysis of Conference Proceedings.",
                    "QweetFinder: Real-Time Finding and Filtering of Question Tweets.",
                    "Integration of the Scientific Recommender System Mr. DLib into the Reference Manager JabRef."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2017bir",
                "sub_name": "Proceedings of the Fifth Workshop on Bibliometric-enhanced Information Retrieval (BIR) co-located with the 39th European Conference on Information Retrieval (ECIR 2017), Aberdeen, UK, April 9th, 2017.",
                "count": 13,
                "papers": [
                    "Editorial for the 5th Bibliometric-enhanced Information Retrieval Workshop at ECIR 2017.",
                    "Real-World Recommender Systems for Academia: The Pain and Gain in Building, Operating, and Researching them.",
                    "Manuscript Matcher: A Content and Bibliometrics-based Scholarly Journal Recommendation System.",
                    "Use of Locality Sensitive Hashing (LSH) Algorithm to Match Web of Science and SCOPUS.",
                    "Academic Search in Response to Major Scientific Events.",
                    "Exploring Choice Overload in Related-Article Recommendations in Digital Libraries.",
                    "Computing Interdisciplinarity of Scholarly Objects using an Author-Citation-Text Model.",
                    "Detecting Automatically Generated Sentences with Grammatical Structure Similarity.",
                    "Apache Lucene as Content-Based-Filtering Recommender System: 3 Lessons Learned.",
                    "Extending Scientific Literature Search by Including the Author's Writing Style.",
                    "Drakkar: a graph based All-Nearest Neighbour Search Algorithm for Bibliographic Coupling.",
                    "Extending a Research-Paper Recommendation System with Bibliometric Measures.",
                    "Semantic Embedding for Information Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2017smerp",
                "sub_name": "Proceedings of the First International Workshop on Exploitation of Social Media for Emergency Relief and Preparedness co-located with European Conference on Information Retrieval, SMERP@ECIR 2017, Aberdeen, UK, April 9, 2017.",
                "count": 14,
                "papers": [
                    "Weakly Supervised Classification of Tweets for Disaster Management.",
                    "Identification of Disaster-implicated Named Entities.",
                    "Microblog Retrieval in a Disaster Situation: A New Test Collection for Evaluation.",
                    "Situational Awareness for Low Resource Languages: the LORELEI Situation Frame Annotation Task.",
                    "Microblog Retrieval for Disaster Relief: How To Create Ground Truths?",
                    "USI Participation at SMERP 2017 Text Retrieval Task.",
                    "Comparative Evaluation of Query Expansion Methods for Enhanced Search on Microblog Data: DCU ADAPT @ SMERP 2017 Workshop Data Challenge.",
                    "Extracting Humanitarian Information from Tweets.",
                    "Information Extraction from Microblog for Disaster Related Event.",
                    "Sensing Microblog for Effective Information Extractions.",
                    "USI Participation at SMERP 2017 Text Summarization Task.",
                    "Summarizing Microblogs for Emergency Relief and Preparedness.",
                    "Summarizing Disaster Related Event from Microblog.",
                    "Multilingual Microblog Summarization."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2017somepeas",
                "sub_name": "Proceedings of the Workshop on Social Media for Personalization and Search co-located with 39th European Conference on Information Retrieval, SoMePeAS@ECIR 2017, Aberdeen, Scotland, UK, April 9, 2017.",
                "count": 5,
                "papers": [
                    "Recommending Doctors and Health Facilities in the HealthNet Social Network.",
                    "Neural Feature Embedding for User Response Prediction in Real-Time Bidding (RTB).",
                    "Capturing Users' Information and Communication Needs for the Press Officers.",
                    "ISIS in the Eyes of the Dutch.",
                    "Smoking Cessation Causes: Contrasting Evidence from Social Media and Online Forums."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "38th ECIR 2016",
        "info": "Padua, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2016",
                "sub_name": "Advances in Information Retrieval - 38th European Conference on IR Research, ECIR 2016, Padua, Italy, March 20-23, 2016. Proceedings.",
                "count": 89,
                "papers": [
                    "SoRTESum: A Social Context Framework for Single-Document Summarization.",
                    "A Graph-Based Approach to Topic Clustering for Online Comments to News.",
                    "Leveraging Semantic Annotations to Link Wikipedia and News Archives.",
                    "Deep Learning over Multi-field Categorical Data - - A Case Study on User Response Prediction.",
                    "Supervised Local Contexts Aggregation for Effective Session Search.",
                    "An Empirical Study of Skip-Gram Features and Regularization for Learning on Sentiment Analysis.",
                    "Multi-task Representation Learning for Demographic Prediction.",
                    "Large-Scale Kernel-Based Language Learning Through the Ensemble Nystr đdoto o ¨ m Methods.",
                    "Beyond Factoid QA: Effective Methods for Non-factoid Answer Sentence Retrieval.",
                    "Supporting Human Answers for Advice-Seeking Questions in CQA Sites.",
                    "Does Selective Search Benefit from WAND Optimization?",
                    "Efficient AUC Optimization for Information Ranking Applications.",
                    "Modeling User Interests for Zero-Query Ranking.",
                    "Adaptive Effort for Search Evaluation Metrics.",
                    "Evaluating Memory Efficiency and Robustness of Word Embeddings.",
                    "Characterizing Relevance on Mobile and Desktop.",
                    "Probabilistic Local Expert Retrieval.",
                    "Probabilistic Topic Modelling with Semantic Graph.",
                    "Estimating Probability Density of Content Types for Promoting Medical Records Search.",
                    "The Curious Incidence of Bias Corrections in the Pool.",
                    "Understandability Biased Evaluation for Information Retrieval.",
                    "The Relationship Between User Perception and User Behaviour in Interactive Information Retrieval Evaluation.",
                    "Using Query Performance Predictors to Improve Spoken Queries.",
                    "Fusing Web and Audio Predictors to Localize the Origin of Music Pieces for Geospatial Retrieval.",
                    "Key Estimation in Electronic Dance Music.",
                    "Evaluating Text Summarization Systems with a Fair Baseline from Multiple Reference Summaries.",
                    "Multi-document Summarization Based on Atomic Semantic Events and Their Temporal Relationships.",
                    "Tweet Stream Summarization for Online Reputation Management.",
                    "Who Wrote the Web? Revisiting Influential Author Identification Research Applicable to Information Retrieval.",
                    "Toward Reproducible Baselines: The Open-Source IR Reproducibility Challenge.",
                    "Experiments in Newswire Summarisation.",
                    "On the Reproducibility of the TAGME Entity Linking System.",
                    "Correlation Analysis of Reader's Demographics and Tweet Credibility Perception.",
                    "Topic-Specific Stylistic Variations for Opinion Retrieval on Twitter.",
                    "Inferring Implicit Topical Interests on Twitter.",
                    "Topics in Tweets: A User Study of Topic Coherence Metrics for Twitter Data.",
                    "Supporting Scholarly Search with Keyqueries.",
                    "Pseudo-Query Reformulation.",
                    "VODUM: A Topic Model Unifying Viewpoint, Topic and Opinion Discovery.",
                    "Harvesting Training Images for Fine-Grained Object Categories Using Visual Descriptions.",
                    "Do Your Social Profiles Reveal What Languages You Speak? Language Inference from Social Media Profiles.",
                    "Retrieving Hierarchical Syllabus Items for Exam Question Analysis.",
                    "Implicit Look-Alike Modelling in Display Ads - Transfer Collaborative Filtering to CTR Estimation.",
                    "Efficient Pseudo-Relevance Feedback Methods for Collaborative Filtering Recommendation.",
                    "Language Models for Collaborative Filtering Neighbourhoods.",
                    "Adaptive Collaborative Filtering with Extended Kalman Filters and Multi-armed Bandits.",
                    "A Business Zone Recommender System Based on Facebook and Urban Planning Data.",
                    "On the Evaluation of Tweet Timeline Generation Task.",
                    "Finding Relevant Relations in Relevant Documents.",
                    "Probabilistic Multileave Gradient Descent.",
                    "Real-World Expertise Retrieval: The Information Seeking Behaviour of Recruitment Professionals.",
                    "Compressing and Decoding Term Statistics Time Series.",
                    "Feedback or Research: Separating Pre-purchase from Post-purchase Consumer Reviews.",
                    "Inferring the Socioeconomic Status of Social Media Users Based on Behaviour and Language.",
                    "Two Scrolls or One Click: A Cost Model for Browsing Search Results.",
                    "Determining the Optimal Session Interval for Transaction Log Analysis of an Online Library Catalogue.",
                    "A Comparison of Deep Learning Based Query Expansion with Pseudo-Relevance Feedback and Mutual Information.",
                    "A Full-Text Learning to Rank Dataset for Medical Information Retrieval.",
                    "Multi-label, Multi-class Classification Using Polylingual Embeddings.",
                    "Learning Word Embeddings from Wikipedia for Content-Based Recommender Systems.",
                    "Tracking Interactions Across Business News, Social Media, and Stock Fluctuations.",
                    "Subtopic Mining Based on Three-Level Hierarchical Search Intentions.",
                    "Cold Start Cumulative Citation Recommendation for Knowledge Base Acceleration.",
                    "Cross Domain User Engagement Evaluation.",
                    "An Empirical Comparison of Term Association and Knowledge Graphs for Query Expansion.",
                    "Deep Learning to Predict Patient Future Diseases from the Electronic Health Records.",
                    "Improving Document Ranking for Long Queries with Nested Query Segmentation.",
                    "Sketching Techniques for Very Large Matrix Factorization.",
                    "Diversifying Search Results Using Time - An Information Retrieval Method for Historians.",
                    "On Cross-Script Information Retrieval.",
                    "LExL: A Learning Approach for Local Expert Discovery on Twitter.",
                    "Clickbait Detection.",
                    "Informativeness for Adhoc IR Evaluation: A Measure that Prevents Assessing Individual Documents.",
                    "What Multimedia Sentiment Analysis Says About City Liveability.",
                    "Scenemash: Multimodal Route Summarization for City Exploration.",
                    "Exactus Like: Plagiarism Detection in Scientific Texts.",
                    "Jitter Search: A News-Based Real-Time Twitter Search Interface.",
                    "TimeMachine: Entity-Centric Search and Visualization of News Archives.",
                    "OPMES: A Similarity Search Engine for Mathematical Content.",
                    "SHAMUS: UFAL Search and Hyperlinking Multimedia System.",
                    "Industry Day Overview.",
                    "Bibliometric-Enhanced Information Retrieval: 3rd International BIR Workshop.",
                    "MultiLingMine 2016: Modeling, Learning and Mining for Cross/Multilinguality.",
                    "Proactive Information Retrieval: Anticipating Users' Information Need.",
                    "First International Workshop on Recent Trends in News Information Retrieval (NewsIR'16).",
                    "Collaborative Information Retrieval: Concepts, Models and Evaluation.",
                    "Group Recommender Systems: State of the Art, Emerging Aspects and Techniques, and Research Challenges.",
                    "Living Labs for Online Evaluation: From Theory to Practice.",
                    "Real-Time Bidding Based Display Advertising: Mechanisms and Algorithms."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2016bir",
                "sub_name": "Proceedings of the Third Workshop on Bibliometric-enhanced Information Retrieval co-located with the 38th European Conference on Information Retrieval (ECIR 2016), Padova, Italy, March 20, 2016.",
                "count": 9,
                "papers": [
                    "Editorial for the 3rd Bibliometric-Enhanced Information Retrieval Workshop at ECIR 2016.",
                    "Bibliometrics in Online Book Discussions: Lessons for Complex Search Tasks.",
                    "Weak Links and Strong Meaning: The Complex Phenomenon of Negational Citations.",
                    "Towards a More Fine Grained Analysis of Scientific Authorship: Predicting the Number of Authors Using Stylometric Features.",
                    "The References of References: Enriching Library Catalogs via Domain-Specific Reference Mining.",
                    "Bibliometrics: a Publication Analysis Tool.",
                    "Engineering a Tool to Detect Automatically Generated Papers.",
                    "Bag of Works Retrieval: TF*IDF Weighting of Co-cited Works.",
                    "On the Need for and Provision for an 'IDEAL' Scholarly Information Retrieval Test Collection."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2016newsir",
                "sub_name": "Proceedings of the First International Workshop on Recent Trends in News Information Retrieval co-located with 38th European Conference on Information Retrieval (ECIR 2016), Padua, Italy, March 20, 2016.",
                "count": 14,
                "papers": [
                    "Recent Advances in Information Access at Thomson Reuters R&D: News and Beyond.",
                    "Monitoring Reputation in the Wild Online West.",
                    "Boolean Queries for News Monitoring: Suggesting New Query Terms to Expert Users.",
                    "An Analysis of Novelty Dynamics in News Media Coverage.",
                    "Detecting Attention Dominating Moments Across Media Types.",
                    "Semi-Supervised Events Clustering in News Retrieval.",
                    "Cross-Lingual Trends Detection for Named Entities in News Texts with Dynamic Neural Embedding Models.",
                    "Using News Articles for Real-time Cross-Lingual Event Detection and Filtering.",
                    "Temporal Random Indexing: a Tool for Analysing Word Meaning Variations in News.",
                    "What do a Million News Articles Look like?",
                    "Exploring a Large News Collection Using Visualization Tools.",
                    "Exploiting News to Categorize Tweets: Quantifying the Impact of Different News Collections.",
                    "Visualising the Propagation of News on the Web.",
                    "Comparative Analysis of GDELT Data Using the News Site Contrast System."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2016mlm",
                "sub_name": "Proceedings of the First Workshop on Modeling, Learning and Mining for Cross/Multilinguality (MultiLingMine 2016) co-located with the 38th European Conference on Information Retrieval (ECIR 2016), Padova, Italy, March 20, 2016.",
                "count": 6,
                "papers": [
                    "Identification of Disease Symptoms in Multilingual Sentences: An Ontology-Driven Approach.",
                    "Deep Level Lexical Features for Cross-lingual Authorship Attribution.",
                    "Profile-based Translation in Multilingual Expertise Retrieval.",
                    "Extending Automatic Discourse Segmentation for Texts in Spanish to Catalan.",
                    "A New Image Analysis Framework for Latin and Italian Language Discrimination.",
                    "The First Cross-Script Code-Mixed Question Answering Corpus."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "37th ECIR 2015",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2015",
                "sub_name": "Advances in Information Retrieval - 37th European Conference on IR Research, ECIR 2015, Vienna, Austria, March 29 - April 2, 2015. Proceedings.",
                "count": 100,
                "papers": [
                    "Towards Query Level Resource Weighting for Diversified Query Expansion.",
                    "Exploring Composite Retrieval from the Users' Perspective.",
                    "Improving Aggregated Search Coherence.",
                    "On-topic Cover Stories from News Archives.",
                    "Multi-emotion Detection in User-Generated Reviews.",
                    "Classification of Historical Notary Acts with Noisy Labels.",
                    "ConceptFusion: A Flexible Scene Classification Framework.",
                    "An Audio-Visual Approach to Music Genre Classification through Affective Color Features.",
                    "Multi-modal Correlated Centroid Space for Multi-lingual Cross-Modal Retrieval.",
                    "A Discourse Search Engine Based on Rhetorical Structure Theory.",
                    "Knowledge-Based Representation for Transductive Multilingual Document Classification.",
                    "Distributional Correspondence Indexing for Cross-Language Text Categorization.",
                    "Adaptive Caching of Fresh Web Search Results.",
                    "Approximating Weighted Hamming Distance by Probabilistic Selection for Multiple Hash Tables.",
                    "Graph Regularised Hashing.",
                    "Approximate Nearest-Neighbour Search with Inverted Signature Slice Lists.",
                    "A Discriminative Approach to Predicting Assessor Accuracy.",
                    "WHOSE - A Tool for Whole-Session Analysis in IIR.",
                    "Looking for Books in Social Media: An Analysis of Complex Search Requests.",
                    "How Do Gain and Discount Functions Affect the Correlation between DCG and User Satisfaction?",
                    "Different Rankers on Different Subcollections.",
                    "Retrievability and Retrieval Bias: A Comparison of Inequality Measures.",
                    "Judging Relevance Using Magnitude Estimation.",
                    "Retrieving Time from Scanned Books.",
                    "A Noise-Filtering Approach for Spatio-temporal Event Detection in Social Media.",
                    "Timeline Summarization from Relevant Headlines.",
                    "A Self-training CRF Method for Recognizing Product Model Mentions in Web Forums.",
                    "Information Extraction Grammars.",
                    "Target-Based Topic Model for Problem Phrase Extraction.",
                    "On Identifying Phrases Using Collection Statistics.",
                    "MIST: Top-k Approximate Sub-string Mining Using Triplet Statistical Significance.",
                    "Active Learning Applied to Rating Elicitation for Incentive Purposes.",
                    "Entity-Centric Stream Filtering and Ranking: Filtering and Unfilterable Documents.",
                    "Generating Music Playlists with Hierarchical Clustering and Q-Learning.",
                    "Time-Sensitive Collaborative Filtering through Adaptive Matrix Completion.",
                    "Toward the New Item Problem: Context-Enhanced Event Recommendation in Event-Based Social Networks.",
                    "On the Influence of User Characteristics on Music Recommendation Algorithms.",
                    "A Study of Smoothing Methods for Relevance-Based Language Modelling of Recommender Systems.",
                    "The Power of Contextual Suggestion.",
                    "Exploiting Semantic Annotations for Domain-Specific Entity Search.",
                    "Reachability Analysis of Graph Modelled Collections.",
                    "Main Core Retention on Graph-of-Words for Single-Document Keyword Extraction.",
                    "Entity Linking for Web Search Queries.",
                    "Beyond Sentiment Analysis: Mining Defects and Improvements from Customer Feedback.",
                    "Measuring User Influence, Susceptibility and Cynicalness in Sentiment Diffusion.",
                    "Automated Controversy Detection on the Web.",
                    "Learning Sentiment Based Ranked-Lexicons for Opinion Retrieval.",
                    "Topic-Dependent Sentiment Classification on Twitter.",
                    "Learning Higher-Level Features with Convolutional Restricted Boltzmann Machines for Sentiment Analysis.",
                    "Towards Deep Semantic Analysis of Hashtags.",
                    "Chalk and Cheese in Twitter: Discriminating Personal and Organization Accounts.",
                    "Handling Topic Drift for Topic Tracking in Microblogs.",
                    "Detecting Location-Centric Communities Using Social-Spatial Links with Temporal Constraints.",
                    "Using Subjectivity Analysis to Improve Thread Retrieval in Online Forums.",
                    "Selecting Training Data for Learning-Based Twitter Search.",
                    "Content-Based Similarity of Twitter Users.",
                    "A Corpus of Realistic Known-Item Topics with Associated Web Pages in the ClueWeb09.",
                    "Designing States, Actions, and Rewards for Using POMDP in Session Search.",
                    "Retrieving Medical Literature for Clinical Decision Support.",
                    "PatNet: A Lexical Database for the Patent Domain.",
                    "Learning to Rank Aggregated Answers for Crossword Puzzles.",
                    "Diagnose This If You Can - On the Effectiveness of Search Engines in Finding Medical Self-diagnosis Information.",
                    "Sources of Evidence for Automatic Indexing of Political Texts.",
                    "Automatically Assessing Wikipedia Article Quality by Exploiting Article-Editor Networks.",
                    "Long Time, No Tweets! Time-aware Personalised Hashtag Suggestion.",
                    "Temporal Multinomial Mixture for Instance-Oriented Evolutionary Clustering.",
                    "Temporal Latent Topic User Profiles for Search Personalisation.",
                    "Document Priors Based On Time-Sensitive Social Signals.",
                    "Prediction of Venues in Foursquare Using Flipped Topic Models.",
                    "Geographical Latent Variable Models for Microblog Retrieval.",
                    "Nonparametric Topic Modeling Using Chinese Restaurant Franchise with Buddy Customers.",
                    "A Hierarchical Tree Model for Update Summarization.",
                    "Document Boltzmann Machines for Information Retrieval.",
                    "Effective Healthcare Advertising Using Latent Dirichlet Allocation and Inference Engine.",
                    "User Simulations for Interactive Search: Evaluating Personalized Query Suggestion.",
                    "The Impact of Query Interface Design on Stress, Workload and Performance.",
                    "Detecting Spam URLs in Social Media via Behavioral Analysis.",
                    "Predicting Re-finding Activity and Difficulty.",
                    "User Behavior in Location Search on Mobile Devices.",
                    "Detecting the Eureka Effect in Complex Search.",
                    "Twitter Sentiment Detection via Ensemble Classification Using Averaged Confidence Scores.",
                    "Reproducible Experiments on Lexical and Temporal Feedback for Tweet Search.",
                    "Rank-Biased Precision Reloaded: Reproducibility and Generalization.",
                    "Knowledge Journey Exhibit: Towards Age-Adaptive Search User Interfaces.",
                    "PopMeter: Linked-Entities in a Sentiment Graph.",
                    "Adaptive Faceted Ranking for Social Media Comments.",
                    "Signal: Advanced Real-Time Information Filtering.",
                    "The iCrawl Wizard - Supporting Interactive Focused Crawl Specification.",
                    "Linguistically-Enhanced Search over an Open Diachronic Corpus.",
                    "From Context-Aware to Context-Based: Mobile Just-In-Time Retrieval of Cultural Heritage Objects.",
                    "Visual Analytics for Information Retrieval Evaluation (VAIRË 2015).",
                    "A Tutorial on Measuring Document Retrievability.",
                    "A Formal Approach to Effectiveness Metrics for Information Access: Retrieval, Filtering, and Clustering.",
                    "Statistical Power Analysis for Sample Size Estimation in Information Retrieval Experiments with Users.",
                    "Join the Living Lab: Evaluating News Recommendations in Real-Time.",
                    "5th Workshop on Context-Awareness in Retrieval and Recommendation.",
                    "Workshop Multimodal Retrieval in the Medical Domain (MRMD) 2015.",
                    "Second International Workshop on Gamification for Information Retrieval (GamifIR'15).",
                    "Supporting Complex Search Tasks - ECIR 2015 Workshop.",
                    "Bibliometric-Enhanced Information Retrieval: 2nd International BIR Workshop."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2015gamifir",
                "sub_name": "Proceedings of the Second International Workshop on Gamification for Information Retrieval co-located with the 37th European Conference on Information Retrieval (ECIR 2015), Vienna, Austria, March 29, 2015.",
                "count": 9,
                "papers": [
                    "Human Intelligence in Search and Retrieval.",
                    "A Game of Search.",
                    "IR Game: How well do you Know Information Retrieval Papers?",
                    "A Game with a Purpose to Access Europe's Cultural Treasure.",
                    "High Quality Photo Collection via Gamification.",
                    "Scientific Hangman: Gamifying Scientific Evidence for General Public.",
                    "Playing Around the Eye Tracker - A Serious Game Based Dataset.",
                    "Enhancing Crowdsourced Applications via Incorporated Practice Sessions.",
                    "Crowdpinion: Motivating People to Share their Momentary Opinion."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2015bir",
                "sub_name": "Proceedings of the Second Workshop on Bibliometric-enhanced Information Retrieval co-located with the 37th European Conference on Information Retrieval (ECIR 2015), Vienna, Austria, March 29th, 2015.",
                "count": 7,
                "papers": [
                    "Editorial for the 2nd Bibliometric-Enhanced Information Retrieval Workshop at ECIR 2015.",
                    "In Praise of Interdisciplinary Research through Scientometrics.",
                    "Exploiting Citation Contexts for Physics Retrieval.",
                    "Factorial Correspondence Analysis Applied to Citation Contexts.",
                    "An Experimental Platform for Scholarly Article Recommendation.",
                    "Extending Search Facilities via Bibliometric-Enhanced Stratagems.",
                    "Polyrepresentative Clustering: A Study of Simulated User Strategies and Representations."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2015scst",
                "sub_name": "Proceedings of the First International Workshop on Supporting Complex Search Tasks co-located with the 37th European Conference on Information Retrieval (ECIR 2015), Vienna, Austria, March 29, 2015.",
                "count": 9,
                "papers": [
                    "First Workshop on Supporting Complex Search Tasks.",
                    "When Effort Exceeds Expectations: A Theory of Search Task Difficulty (keynote).",
                    "Navigating Controversy as a Complex Search Task.",
                    "Applied Distributed Information Retrieval in Enterprise Search.",
                    "Task-completion Engines: A Vision with a Plan.",
                    "Just Looking Around: Supporting Casual Users Initial Encounters with Digital Cultural Heritage.",
                    "Shaken, Not Steered: The Value of Shaking Up the Search Process.",
                    "Complex Tools for Complex Tasks.",
                    "Online Evaluation of Point-Of-Interest Recommendation Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2015mrdm",
                "sub_name": "Multimodal Retrieval in the Medical Domain - First International Workshop, MRMD 2015, Vienna, Austria, March 29, 2015, Revised Selected Papers.",
                "count": 14,
                "papers": [
                    "Overview of the First Workshop of Muldimodal Retrieval in the Medical Domain (MRMD 2015).",
                    "Semantic Retrieval of Radiological Images with Relevance Feedback.",
                    "BioASQ: A Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering.",
                    "Rewriting Natural Language Queries Using Patterns.",
                    "Content-Based Retrieval of Brain Diffusion Magnetic Resonance Image.",
                    "The Application of KAZE Features to the Classification Echocardiogram Videos.",
                    "Multi-modal Indexing and Retrieval Using an LSA-Based Kernel.",
                    "Semi-supervised Learning for Image Modality Classification.",
                    "Annotation of Chest Radiology Reports for Indexing and Retrieval.",
                    "Overview of the VISCERAL Retrieval Benchmark 2015.",
                    "Multimodal Medical Case-Based Retrieval on the Radiology Image and Report: SNUMedinfo at VISCERAL Retrieval Benchmark.",
                    "Medical Case-Based Retrieval of Patient Records Using the RadLex Hierarchical Lexicon.",
                    "USYD/HES-SO in the VISCERAL Retrieval Benchmark.",
                    "RadLex Terms and Local Texture Features for Multimodal Medical Case Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "36th ECIR 2014",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2014",
                "sub_name": "Advances in Information Retrieval - 36th European Conference on IR Research, ECIR 2014, Amsterdam, The Netherlands, April 13-16, 2014. Proceedings.",
                "count": 105,
                "papers": [
                    "Reducing Reliance on Relevance Judgments for System Comparison by Using Expectation-Maximization.",
                    "Best and Fairest: An Empirical Analysis of Retrieval System Bias.",
                    "Tackling Biased Baselines in the Risk-Sensitive Evaluation of Retrieval Systems.",
                    "Content + Attributes: A Latent Factor Model for Recommending Scientific Papers in Heterogeneous Academic Networks.",
                    "Real-Time News Recommendation Using Context-Aware Ensembles.",
                    "A Personalised Recommendation System for Context-Aware Suggestions.",
                    "Optimizing Base Rankers Using Clicks - A Case Study Using BM25.",
                    "Predicting Search Task Difficulty.",
                    "Crawling Policies Based on Web Page Popularity Prediction.",
                    "Measuring the Effectiveness of Gamesourcing Expert Oil Painting Annotations.",
                    "Relevance-Ranked Domain-Specific Synonym Discovery.",
                    "Towards Generating Text Summaries for Entity Chains.",
                    "Tolerance of Effectiveness Measures to Relevance Judging Errors.",
                    "Evaluation of IR Applications with Constrained Real Estate.",
                    "Dissimilarity Based Query Selection for Efficient Preference Based IR Evaluation.",
                    "Blending Vertical and Web Results - A Case Study Using Video Intent.",
                    "Personalizing Aggregated Search.",
                    "HetPathMine: A Novel Transductive Classification Algorithm on Heterogeneous Information Networks.",
                    "Leveraging Dynamic Query Subtopics for Time-Aware Search Result Diversification.",
                    "A Study of Query Term Deletion Using Large-Scale E-commerce Search Logs.",
                    "Detecting Missing Content Queries in an SMS-Based HIV/AIDS FAQ Retrieval System.",
                    "Cross-Language Pseudo-Relevance Feedback Techniques for Informal Text.",
                    "Hierarchical Multi-label Conditional Random Fields for Aspect-Oriented Opinion Mining.",
                    "Generating Pseudo-ground Truth for Predicting New Concepts in Social Streams.",
                    "Thumbnail Summarization Techniques for Web Archives.",
                    "CiteSeer x : A Scholarly Big Dataset.",
                    "\"User Reviews in the Search Index? That'll Never Work!\".",
                    "A Scalable Gibbs Sampler for Probabilistic Entity Linking.",
                    "Effective Kernelized Online Learning in Language Processing Tasks.",
                    "On Inverted Index Compression for Search Engine Efficiency.",
                    "Exploring the Space of IR Functions.",
                    "Metric Spaces for Temporal Information Retrieval.",
                    "Local Linear Matrix Factorization for Document Modeling.",
                    "Video Clip Retrieval by Graph Matching.",
                    "EDIUM: Improving Entity Disambiguation via User Modeling.",
                    "A Comparison of Approaches for Measuring Cross-Lingual Similarity of Wikipedia Articles.",
                    "Challenges on Combining Open Web and Dataset Evaluation Results: The Case of the Contextual Suggestion Track.",
                    "Integrating Multiple Resources for Diversified Query Expansion.",
                    "Facet-Based User Modeling in Social Media for Personalized Ranking.",
                    "Spot the Ball: Detecting Sports Events on Twitter.",
                    "Exploiting Result Diversification Methods for Feature Selection in Learning to Rank.",
                    "Boilerplate Detection and Recoding.",
                    "A Two-level Approach for Subtitle Alignment.",
                    "Analyzing Discussions on Twitter: Case Study on HPV Vaccinations.",
                    "Automatically Retrieving Explanatory Analogies from Webpages.",
                    "Geo-spatial Domain Expertise in Microblogs.",
                    "The Impact of Semantic Document Expansion on Cluster-Based Fusion for Microblog Search.",
                    "Towards a Classifier for Digital Sensitivity Review.",
                    "Unsupervised Approach for Identifying Users' Political Orientations.",
                    "User Perception of Information Credibility of News on Twitter.",
                    "Sentiment Analysis and the Impact of Employee Satisfaction on Firm Earnings.",
                    "Entity Tracking in Real-Time Using Sub-topic Detection on Twitter.",
                    "Time-Aware Focused Web Crawling.",
                    "Temporal Expertise Profiling.",
                    "Assessing Quality of Unsupervised Topics in Song Lyrics.",
                    "An Information Retrieval-Based Approach to Determining Contextual Opinion Polarity of Words.",
                    "Query Term Suggestion in Academic Search.",
                    "The Impact of Future Term Statistics in Real-Time Tweet Search.",
                    "Exploring Adaptive Window Sizes for Entity Retrieval.",
                    "Score Normalization Using Logistic Regression with Expected Parameters.",
                    "More Informative Open Information Extraction via Simple Inference.",
                    "Learning a Theory of Marriage (and Other Relations) from a Web Corpus.",
                    "Learning from User Interactions for Recommending Content in Social Media.",
                    "Towards an Entity-Based Automatic Event Validation.",
                    "Query Expansion with Temporal Segmented Texts.",
                    "On Clustering and Polyrepresentation.",
                    "Effects of Position Bias on Click-Based Recommender Evaluation.",
                    "Bringing Information Retrieval into Crowdsourcing: A Case Study.",
                    "Quality-Based Automatic Classification for Presentation Slides.",
                    "Context of Seasonality in Web Search.",
                    "On the Effect of Locality in Compressing Social Networks.",
                    "Cross-Domain Collaborative Filtering with Factorization Machines.",
                    "Improvements to Suffix Tree Clustering.",
                    "Deep Learning for Character-Based Information Extraction.",
                    "Text-Image Topic Discovery for Web News Data.",
                    "Detecting Event Visits in Urban Areas via Smartphone GPS Data.",
                    "A Case for Hubness Removal in High-Dimensional Multimedia Retrieval.",
                    "Multi-evidence User Group Discovery in Professional Image Search.",
                    "Analyzing Tweets to Aid Situational Awareness.",
                    "Query-Dependent Contextualization of Streaming Data.",
                    "An Exploration of Tie-Breaking for Microblog Retrieval.",
                    "Efficiently Estimating Retrievability Bias.",
                    "A Language Modeling Approach to Personalized Search Based on Users' Microblog Behavior.",
                    "Using Hand Gestures for Specifying Motion Queries in Sketch-Based Video Retrieval.",
                    "Page Retrievability Calculator.",
                    "ORMA: A Semi-automatic Tool for Online Reputation Monitoring in Twitter.",
                    "My First Search User Interface.",
                    "Needle Custom Search - Recall-Oriented Search on the Web Using Semantic Annotations.",
                    "Khresmoi Professional: Multilingual, Multimodal Professional Medical Search.",
                    "DAIKnow: A Gamified Enterprise Bookmarking System.",
                    "Search Maps - Enhancing Traceability and Overview in Collaborative Information Seeking.",
                    "A Visual Interactive Environment for Making Sense of Experimental Data.",
                    "TripBuilder: A Tool for Recommending Sightseeing Tours.",
                    "GTE-Cluster: A Temporal Search Interface for Implicit Temporal Queries.",
                    "SQX-Lib: Developing a Semantic Query Expansion System in a Media Group.",
                    "EntEXPO: An Interactive Search System for Entity-Bearing Queries.",
                    "Column Stores as an IR Prototyping Tool.",
                    "CroSeR: Cross-language Semantic Retrieval of Open Government Data.",
                    "Bibliometric-Enhanced Information Retrieval.",
                    "4th Workshop on Context-Awareness in Retrieval and Recommendation.",
                    "Workshop on Gamification for Information Retrieval (GamifIR'14).",
                    "Information Access in Smart Cities (i-ASC).",
                    "Designing Search Usability.",
                    "Text Quantification.",
                    "The Cluster Hypothesis in Information Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2014bir",
                "sub_name": "Proceedings of the First Workshop on Bibliometric-enhanced Information Retrieval co-located with 36th European Conference on Information Retrieval (ECIR 2014), Amsterdam, The Netherlands, April 13, 2014.",
                "count": 7,
                "papers": [
                    "Editorial.",
                    "A Study of Lexical Distribution in Citation Contexts through the IMRaD Standard.",
                    "Systematic Retrieval of Scientific Literature based on Citation Relations: Introducing the CitNetExplorer Tool.",
                    "Exploiting Information Needs and Bibliographics for Polyrepresentative Document Clustering.",
                    "Language Model Document Priors based on Citation and Co-citation Analysis.",
                    "On the Connection Between Citation-based and Topical Relevance Ranking: Results of a Pretest using iSearch.",
                    "{{citation needed}}: Filling in Wikipedia's Citation Shaped Holes."
                ]
            },
            {
                "sub_name_abbr": "conf/ecir/2014gamifir",
                "sub_name": "Proceedings of the First International Workshop on Gamification for Information Retrieval, GamifIR@ECIR '14, Amsterdam, The Netherlands, April 13, 2014.",
                "count": 15,
                "papers": [
                    "Information reconstruction: unpicking the GamifIR call for papers.",
                    "Creating Zombilingo, a game with a purpose for dependency syntax annotation.",
                    "On the application of game mechanics in information retrieval.",
                    "The annotation-validation (AV) model: rewarding contribution using retrospective agreement.",
                    "The beauty contest revisited: measuring consensus rankings of relevance using a game.",
                    "People recognition using gamified ambiguous feedback.",
                    "Incentive design to mould online behavior: a game mechanics perspective.",
                    "Gamification of private digital data archive management.",
                    "PageFetch 2: gamification the sequel.",
                    "Enhancing collaborative search systems engagement through gamification.",
                    "The game of search: what is the fun in that?",
                    "Studying user browsing behavior through gamified search tasks.",
                    "Crowd-powered experts: helping surgeons interpret breast cancer images.",
                    "PictureSort: gamification of image ranking.",
                    "Moody closet: exploring intriguing new views on wardrobe recommendation."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "35th ECIR 2013",
        "info": "Moscow, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2013",
                "sub_name": "Advances in Information Retrieval - 35th European Conference on IR Research, ECIR 2013, Moscow, Russia, March 24-27, 2013. Proceedings.",
                "count": 110,
                "papers": [
                    "Using Intent Information to Model User Behavior in Diversified Search.",
                    "Understanding Relevance: An fMRI Study.",
                    "An Exploratory Study of Sensemaking in Collaborative Information Seeking.",
                    "Exploiting User Comments for Audio-Visual Content Indexing and Retrieval.",
                    "An Evaluation of Labelling-Game Data for Video Retrieval.",
                    "Multimodal Re-ranking of Product Image Search Results.",
                    "Predicting Information Diffusion in Social Networks Using Content and User's Profiles.",
                    "How Tagging Pragmatics Influence Tag Sense Discovery in Social Annotation Systems.",
                    "A Unified Framework for Monolingual and Cross-Lingual Relevance Modeling Based on Probabilistic Topic Models.",
                    "Semantic Search Log k-Anonymization with Generalized k-Cores of Query Concept Graph.",
                    "A Joint Classification Method to Integrate Scientific and Social Networks.",
                    "Using Document-Quality Measures to Predict Web-Search Effectiveness.",
                    "Training Efficient Tree-Based Models for Document Ranking.",
                    "DTD Based Costs for Tree-Edit Distance in Structured Information Retrieval.",
                    "Ranked Accuracy and Unstructured Distributed Search.",
                    "Learning to Rank from Structures in Hierarchical Text Classification.",
                    "Folktale Classification Using Learning to Rank.",
                    "Open-Set Classification for Automated Genre Identification.",
                    "Semantic Tagging of Places Based on User Interest Profiles from Online Social Networks.",
                    "Sponsored Search Ad Selection by Keyword Structure Analysis.",
                    "Intent-Based Browse Activity Segmentation.",
                    "Extracting Event-Related Information from Article Updates in Wikipedia.",
                    "Using WordNet Hypernyms and Dependency Features for Phrasal-Level Event Recognition and Type Classification.",
                    "Aggregating Evidence from Hospital Departments to Improve Medical Records Search.",
                    "An N-Gram Topic Model for Time-Stamped Documents.",
                    "Influence of Timeline and Named-Entity Components on User Engagement.",
                    "Cognitive Temporal Document Priors.",
                    "Combining Recency and Topic-Dependent Temporal Variation for Microblog Search.",
                    "Subjectivity Annotation of the Microblog 2011 Realtime Adhoc Relevance Judgments.",
                    "Geo-spatial Event Detection in the Twitter Stream.",
                    "A Versatile Tool for Privacy-Enhanced Web Search.",
                    "Exploiting Novelty and Diversity in Tag Recommendation.",
                    "Example Based Entity Search in the Web of Data.",
                    "A Fast Generative Spell Corrector Based on Edit Distance.",
                    "Being Confident about the Quality of the Predictions in Recommender Systems.",
                    "Two-Stage Learning to Rank for Information Retrieval.",
                    "Hybrid Query Scheduling for a Replicated Search Engine.",
                    "Latent Factor BlockModel for Modelling Relational Data.",
                    "Estimation of the Collection Parameter of Information Models for IR.",
                    "Increasing Stability of Result Organization for Session Search.",
                    "Updating Users about Time Critical Events.",
                    "Comparing Crowd-Based, Game-Based, and Machine-Based Approaches in Initial Query and Query Refinement Tasks.",
                    "Reducing the Uncertainty in Resource Selection.",
                    "Exploiting Time in Automatic Image Tagging.",
                    "Using Text-Based Web Image Search Results Clustering to Minimize Mobile Devices Wasted Space-Interface.",
                    "Discovery and Analysis of Evolving Topical Social Discussions on Unstructured Microblogs.",
                    "Web Credibility: Features Exploration and Credibility Prediction.",
                    "Query Suggestions for Textual Problem Solution Repositories.",
                    "Improving ESA with Document Similarity.",
                    "Ontology-Based Word Sense Disambiguation for Scientific Literature.",
                    "A Language Modeling Approach for Extracting Translation Knowledge from Comparable Corpora.",
                    "Content-Based Re-ranking of Text-Based Image Search Results.",
                    "Encoding Local Binary Descriptors by Bag-of-Features with Hamming Distance for Visual Object Categorization.",
                    "Recommending High Utility Query via Session-Flow Graph.",
                    "URL Redirection Accounting for Improving Link-Based Ranking Methods.",
                    "Lo mejor de dos idiomas - Cross-Lingual Linkage of Geotagged Wikipedia Articles.",
                    "A Pilot Study on Using Profile-Based Summarisation for Interactive Search Assistance.",
                    "Exploring Patent Passage Retrieval Using Nouns Phrases.",
                    "Characterizing Health-Related Community Question Answering.",
                    "Topic Models Can Improve Domain Term Extraction.",
                    "A Topic Person Multi-polarization Method Using Friendship Network Analysis.",
                    "Improving Cyberbullying Detection with User Context.",
                    "Snippet-Based Relevance Predictions for Federated Web Search.",
                    "Designing Human-Readable User Profiles for Search Evaluation.",
                    "Sentiment Classification Based on Phonetic Characteristics.",
                    "Cross-Language Plagiarism Detection Using a Multilingual Semantic Network.",
                    "Classification of Opinion Questions.",
                    "Tempo of Search Actions to Modeling Successful Sessions.",
                    "Near-Duplicate Detection for Online-Shops Owners: An FCA-Based Approach.",
                    "Incremental Reranking for Hierarchical Text Classification.",
                    "Topic Model for User Reviews with Adaptive Windows.",
                    "Time Based Feedback and Query Expansion for Twitter Search.",
                    "Is Intent-Aware Expected Reciprocal Rank Sufficient to Evaluate Diversity?",
                    "Late Data Fusion for Microblog Search.",
                    "A Task-Specific Query and Document Representation for Medical Records Search.",
                    "On CORI Results Merging.",
                    "Detecting Friday Night Party Photos: Semantics for Tag Recommendation.",
                    "Optimizing nDCG Gains by Minimizing Effect of Label Inconsistency.",
                    "Least Square Consensus Clustering: Criteria, Methods, Experiments.",
                    "Domain Adaptation of Statistical Machine Translation Models with Monolingual Data for Cross Lingual Information Retrieval.",
                    "Text Summarization while Maximizing Multiple Objectives with Lagrangian Relaxation.",
                    "Towards Detection of Child Sexual Abuse Media: Categorization of the Associated Filenames.",
                    "Leveraging Latent Concepts for Retrieving Relevant Ads for Short Text.",
                    "Robust PLSA Performs Better Than LDA.",
                    "WANTED: Focused Queries for Focused Retrieval.",
                    "Exploiting Click Logs for Adaptive Intranet Navigation.",
                    "Leveraging Microblogs for Spatiotemporal Music Information Retrieval.",
                    "Topic-Focused Summarization of Chat Conversations.",
                    "Risk Ranking from Financial Reports.",
                    "An Initial Investigation on the Relationship between Usage and Findability.",
                    "Sub-sentence Extraction Based on Combinatorial Optimization.",
                    "ADRTrace: Detecting Expected and Unexpected Adverse Drug Reactions from User Reviews on Social Media Sites.",
                    "The Impact of Temporal Intent Variability on Diversity Evaluation.",
                    "Re-leashed! The PuppyIR Framework for Developing Information Services for Children, Adults and Dogs.",
                    "A Web Mining Tool for Assistance with Creative Writing.",
                    "DS4: A Distributed Social and Semantic Search System.",
                    "Serelex: Search and Visualization of Semantically Related Words.",
                    "SIAM: Social Interaction Analysis for Multimedia.",
                    "Exploratory Search on Social Media.",
                    "VisNavi: Citation Context Visualization and Navigation.",
                    "Face-Based People Searching in Videos.",
                    "Political Hashtag Trends.",
                    "OPARS: Objective Photo Aesthetics Ranking System.",
                    "Distributed Information Retrieval and Applications.",
                    "Searching the Web of Data.",
                    "Monolingual and Cross-Lingual Probabilistic Topic Models and Their Applications in Information Retrieval.",
                    "Practical Online Retrieval Evaluation.",
                    "Integrating IR Technologies for Professional Search - (Full-Day Workshop).",
                    "From Republicans to Teenagers - Group Membership and Search (GRUMPS).",
                    "Doctoral Consortium at ECIR 2013."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "34th ECIR 2012",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2012",
                "sub_name": "Advances in Information Retrieval - 34th European Conference on IR Research, ECIR 2012, Barcelona, Spain, April 1-5, 2012. Proceedings.",
                "count": 72,
                "papers": [
                    "Explaining Query Modifications - An Alternative Interpretation of Term Addition and Removal.",
                    "Modeling Transactional Queries via Templates.",
                    "Exploring Query Patterns in Email Search.",
                    "Interactive Search Support for Difficult Web Queries.",
                    "Predicting the Future Impact of News Events.",
                    "Detection of News Feeds Items Appropriate for Children.",
                    "Comparing Tweets and Tags for URLs.",
                    "Geo-Location Estimation of Flickr Images: Social Web Based Enrichment.",
                    "A Field Relevance Model for Structured Document Retrieval.",
                    "Relation Based Term Weighting Regularization.",
                    "A New Approach to Answerer Recommendation in Community Question Answering Services.",
                    "On the Modeling of Entities for Ad-Hoc Entity Search in the Web of Data.",
                    "Result Disambiguation in Web People Search.",
                    "On Smoothing Average Precision.",
                    "New Metrics for Meaningful Evaluation of Informally Structured Speech Retrieval.",
                    "On Aggregating Labels from Multiple Crowd Workers to Infer Relevance of Documents.",
                    "How Random Walks Can Help Tourism.",
                    "Retrieving Candidate Plagiarised Documents Using Query Expansion.",
                    "Reliability Prediction of Webpages in the Medical Domain.",
                    "Automatic Foldering of Email Messages: A Combination Approach.",
                    "A Log-Logistic Model-Based Interpretation of TF Normalization of BM25.",
                    "Score Transformation in Linear Combination for Multi-criteria Relevance Ranking.",
                    "Axiomatic Analysis of Translation Language Model for Information Retrieval.",
                    "An Information-Based Cross-Language Information Retrieval Model.",
                    "Extended Expectation Maximization for Inferring Score Distributions.",
                    "Top-k Retrieval Using Facility Location Analysis.",
                    "An Interactive Paper and Digital Pen Interface for Query-by-Sketch Image Retrieval.",
                    "Image Abstraction in Crossmedia Retrieval for Text Illustration.",
                    "A Latent Variable Ranking Model for Content-Based Retrieval.",
                    "Language Modelling of Constraints for Text Clustering.",
                    "A Framework for Unsupervised Spam Detection in Social Networking Sites.",
                    "Classification of Short Texts by Deploying Topical Annotations.",
                    "Cluster Labeling for Multilingual Scatter/Gather Using Comparable Corpora.",
                    "Adaptive Time-to-Live Strategies for Query Result Caching in Web Search Engines.",
                    "Intra-query Concurrent Pipelined Processing for Distributed Full-Text Retrieval.",
                    "Usefulness of Sentiment Analysis.",
                    "Modeling Static Caching in Web Search Engines.",
                    "Integrating Interactive Visualizations in the Search Process of Digital Libraries and IR Systems.",
                    "On Theoretically Valid Score Distributions in Information Retrieval.",
                    "Adaptive Temporal Query Modeling.",
                    "The Design of a Visual History Tool to Help Users Refind Information within a Website.",
                    "Analyzing the Polarity of Opinionated Queries.",
                    "Semi-automatic Document Classification: Exploiting Document Difficulty.",
                    "Investigating Summarization Techniques for Geo-Tagged Image Indexing.",
                    "Handling OOV Words in Indian-language - English CLIR.",
                    "Using a Medical Thesaurus to Predict Query Difficulty.",
                    "Studying a Personality Coreference Network in a News Stories Photo Collection.",
                    "Phrase Pair Classification for Identifying Subtopics.",
                    "Full and Mini-batch Clustering of News Articles with Star-EM.",
                    "Assessing and Predicting Vertical Intent for Web Queries.",
                    "Predicting IMDB Movie Ratings Using Social Media.",
                    "Squeezing the Ensemble Pruning: Faster and More Accurate Categorization for News Portals.",
                    "A General Framework for People Retrieval in Social Media with Multiple Roles.",
                    "Analysis of Query Reformulations in a Search Engine of a Local Web Site.",
                    "Temporal Pseudo-relevance Feedback in Microblog Retrieval.",
                    "Learning Adaptive Domain Models from Click Data to Bootstrap Interactive Web Search.",
                    "A Little Interaction Can Go a Long Way: Enriching the Query Formulation Process.",
                    "Learning to Rank from Relevance Feedback for e-Discovery.",
                    "When Simple is (more than) Good Enough: Effective Semantic Search with (almost) no Semantics.",
                    "Evaluating Personal Information Retrieval.",
                    "Applying Power Graph Analysis to Weighted Graphs.",
                    "An Investigation of Term Weighting Approaches for Microblog Retrieval.",
                    "On the Size of Full Element-Indexes for XML Keyword Search.",
                    "Combining Probabilistic Language Models for Aspect-Based Sentiment Retrieval.",
                    "In Praise of Laziness: A Lazy Strategy for Web Information Extraction.",
                    "LiveTweet: Monitoring and Predicting Interesting Microblog Posts.",
                    "A User Interface for Query-by-Sketch Based Image Retrieval with Color Sketches.",
                    "Crisees: Real-Time Monitoring of Social Media Streams to Support Crisis Management.",
                    "A Mailbox Search Engine Using Query Multi-modal Expansion and Community-Based Smoothing.",
                    "EmSe: Supporting Children's Information Needs within a Hospital Environment.",
                    "Retro: Time-Based Exploration of Product Reviews.",
                    "Querium: A Session-Based Collaborative Search System."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "33rd ECIR 2011",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2011",
                "sub_name": "Advances in Information Retrieval - 33rd European Conference on IR Research, ECIR 2011, Dublin, Ireland, April 18-21, 2011. Proceedings.",
                "count": 95,
                "papers": [
                    "IR Research: Systems, Interaction, Evaluation and Theories.",
                    "Ad Retrieval Systems in vitro and in vivo: Knowledge-Based Approaches to Computational Advertising.",
                    "The Value of User Feedback.",
                    "Text Classification for a Large-Scale Taxonomy Using Dynamically Mixed Local and Global Models for a Node.",
                    "User-Related Tag Expansion for Web Document Clustering.",
                    "A Comparative Experimental Assessment of a Threshold Selection Algorithm in Hierarchical Text Categorization.",
                    "Improving Tag-Based Recommendation by Topic Diversification.",
                    "A Joint Model of Feature Mining and Sentiment Analysis for Product Review Rating.",
                    "Modeling Answerer Behavior in Collaborative Question Answering Systems.",
                    "Clash of the Typings - Finding Controversies and Children's Topics Within Queries.",
                    "Are Semantically Related Links More Effective for Retrieval?",
                    "Caching for Realtime Search.",
                    "Enhancing Deniability against Query-Logs.",
                    "On the Contributions of Topics to System Evaluation.",
                    "A Methodology for Evaluating Aggregated Search Results.",
                    "Design and Implementation of Relevance Assessments Using Crowdsourcing.",
                    "In Search of Quality in Crowdsourcing for Search Engine Evaluation.",
                    "Summarizing a Document Stream.",
                    "A Link Prediction Approach to Recommendations in Large-Scale User-Generated Content Systems.",
                    "Topic Classification in Social Media Using Metadata from Hyperlinked Objects.",
                    "Peddling or Creating? Investigating the Role of Twitter in News Reporting.",
                    "Latent Sentiment Model for Weakly-Supervised Cross-Lingual Sentiment Classification.",
                    "Fractional Similarity: Cross-Lingual Feature Selection for Search.",
                    "Is a Query Worth Translating: Ask the Users!",
                    "Balancing Exploration and Exploitation in Learning to Rank Online.",
                    "ReFER: Effective Relevance Feedback for Entity Ranking.",
                    "The Limits of Retrieval Effectiveness.",
                    "Learning Conditional Random Fields from Unaligned Data for Natural Language Understanding.",
                    "Subspace Tracking for Latent Semantic Analysis.",
                    "Text Retrieval Methods for Item Ranking in Collaborative Filtering.",
                    "Classifying with Co-stems - A New Representation for Information Filtering.",
                    "Interactive Trademark Image Retrieval by Fusing Semantic and Visual Content.",
                    "Dynamic Two-Stage Image Retrieval from Large Multimodal Databases.",
                    "Comparing Twitter and Traditional Media Using Topic Models.",
                    "Exploiting Thread Structures to Improve Smoothing of Language Models for Forum Post Retrieval.",
                    "Incorporating Query Expansion and Quality Indicators in Searching Microblog Posts.",
                    "Discovering Fine-Grained Sentiment with Latent Variable Structured Prediction Models.",
                    "Combining Global and Local Semantic Contexts for Improving Biomedical Information Retrieval.",
                    "Smoothing Click Counts for Aggregated Vertical Search.",
                    "Automatic People Tagging for Expertise Profiling in the Enterprise.",
                    "Text Classification: A Sequential Reading Approach.",
                    "Domain Adaptation for Text Categorization by Feature Labeling.",
                    "TEMPER: A Temporal Relevance Feedback Method.",
                    "Terms of a Feather: Content-Based News Recommendation and Discovery Using Twitter.",
                    "Topical and Structural Linkage in Wikipedia.",
                    "An Analysis of Time-Instability in Web Search Results.",
                    "Rules of Thumb for Information Acquisition from Large and Redundant Data.",
                    "Bringing Why-QA to Web Search.",
                    "The Power of Peers.",
                    "Introducing the User-over-Ranking Hypothesis.",
                    "Second Chance: A Hybrid Approach for Dynamic Result Caching in Search Engines.",
                    "Learning Models for Ranking Aggregates.",
                    "Efficient Compressed Inverted Index Skipping for Disjunctive Text-Queries.",
                    "Within-Document Term-Based Index Pruning with Statistical Hypothesis Testing.",
                    "SkipBlock: Self-indexing for Block-Based Inverted List.",
                    "Weight-Based Boosting Model for Cross-Domain Relevance Ranking Adaptation.",
                    "What Makes Re-finding Information Difficult? A Study of Email Re-finding.",
                    "A User-Oriented Model for Expert Finding.",
                    "Simulating Simple and Fallible Relevance Feedback.",
                    "AutoEval: An Evaluation Methodology for Evaluating Query Suggestions Using Query Logs.",
                    "To Seek, Perchance to Fail: Expressions of User Needs in Internet Video Search.",
                    "Passage Reranking for Question Answering Using Syntactic Structures and Answer Types.",
                    "An Iterative Approach to Text Segmentation.",
                    "Improving Query Focused Summarization Using Look-Ahead Strategy.",
                    "A Generalized Method for Word Sense Disambiguation Based on Wikipedia.",
                    "Representing Document Lengths with Identifiers.",
                    "Free-Text Search versus Complex Web Forms.",
                    "Multilingual Log Analysis: LogCLEF.",
                    "A Large-Scale System Evaluation on Component-Level.",
                    "Should MT Systems Be Used as Black Boxes in CLIR?",
                    "Video Retrieval Based on Words-of-Interest Selection.",
                    "Classic Children's Literature - Difficult to Read?",
                    "Applying Machine Learning Diversity Metrics to Data Fusion in Information Retrieval.",
                    "Reranking Collaborative Filtering with Multiple Self-contained Modalities.",
                    "How Far Are We in Trust-Aware Recommendation?",
                    "Re-ranking for Multimedia Indexing and Retrieval.",
                    "Combining Query Translation Techniques to Improve Cross-Language Information Retrieval.",
                    "Back to the Roots: Mean-Variance Analysis of Relevance Estimations.",
                    "A Novel Re-ranking Approach Inspired by Quantum Measurement.",
                    "Simple vs. Sophisticated Approaches for Patent Prior-Art Search.",
                    "Towards Quantum-Based DB+IR Processing Based on the Principle of Polyrepresentation.",
                    "ATTention: Understanding Authors and Topics in Context of Temporal Evolution.",
                    "Role of Emotional Features in Collaborative Recommendation.",
                    "The Importance of the Depth for Text-Image Selection Strategy in Learning-To-Rank.",
                    "Personal Blog Retrieval Using Opinion Features.",
                    "Processing Queries in Session in a Quantum-Inspired IR Framework.",
                    "Towards Predicting Relevance Using a Quantum-Like Framework.",
                    "Fusion vs. Two-Stage for Multimodal Retrieval.",
                    "Combination of Feature Selection Methods for Text Categorisation.",
                    "Time-Surfer: Time-Based Graphical Access to Document Content.",
                    "ARES: A Retrieval Engine Based on Sentiments - Sentiment-Based Search Result Annotation and Diversification.",
                    "Web Search Query Assistance Functionality for Young Audiences.",
                    "Conversation Retrieval from Twitter.",
                    "Finding Useful Users on Twitter: Twittomender the Followee Recommender.",
                    "Visual Exploration of Health Information for Children."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "32nd ECIR 2010",
        "info": "Milton Keynes, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2010",
                "sub_name": "Advances in Information Retrieval, 32nd European Conference on IR Research, ECIR 2010, Milton Keynes, UK, March 28-31, 2010. Proceedings.",
                "count": 76,
                "papers": [
                    "Recent Developments in Information Retrieval.",
                    "Web Search Futures: Personal, Collaborative, Social.",
                    "IR, NLP, and Visualization.",
                    "Image and Natural Language Processing for Multimedia Information Retrieval.",
                    "A Language Modeling Approach for Temporal Information Needs.",
                    "Analyzing Information Retrieval Methods to Recover Broken Web Links.",
                    "Between Bags and Trees - Constructional Patterns in Text Used for Attitude Identification.",
                    "Improving Medical Information Retrieval with PICO Element Detection.",
                    "The Role of Query Sessions in Extracting Instance Attributes from Web Search Queries.",
                    "Transliteration Equivalence Using Canonical Correlation Analysis.",
                    "Explicit Search Result Diversification through Sub-queries.",
                    "Interpreting User Inactivity on Search Results.",
                    "Learning to Select a Ranking Function.",
                    "Mining Anchor Text Trends for Retrieval.",
                    "Predicting Query Performance via Classification.",
                    "A Case for Automatic System Evaluation.",
                    "Aggregation of Multiple Judgments for Evaluating Ordered Lists.",
                    "Evaluation and User Preference Study on Spatial Diversity.",
                    "News Comments: Exploring, Modeling, and Online Prediction.",
                    "Query Performance Prediction: Evaluation Contrasted with Effectiveness.",
                    "A Framework for Evaluating Automatic Image Annotation Algorithms.",
                    "BASIL: Effective Near-Duplicate Image Detection Using Gene Sequence Alignment.",
                    "Beyond Shot Retrieval: Searching for Broadcast News Items Using Language Models of Concepts.",
                    "Ranking Fusion Methods Applied to On-Line Handwriting Information Retrieval.",
                    "Improving Query Correctness Using Centralized Probably Approximately Correct (PAC) Search.",
                    "Learning to Distribute Queries into Web Search Nodes.",
                    "Text Clustering for Peer-to-Peer Networks with Probabilistic Guarantees.",
                    "XML Retrieval Using Pruned Element-Index Files.",
                    "Category-Based Query Modeling for Entity Search.",
                    "Maximum Margin Ranking Algorithms for Information Retrieval.",
                    "Query Aspect Based Term Weighting Regularization in Information Retrieval.",
                    "Using the Quantum Probability Ranking Principle to Rank Interdependent Documents.",
                    "Wikipedia-Based Semantic Smoothing for the Language Modeling Approach to Information Retrieval.",
                    "A Performance Prediction Approach to Enhance Collaborative Filtering Performance.",
                    "Collaborative Filtering: The Aim of Recommender Systems and the Significance of User Ratings.",
                    "Goal-Driven Collaborative Filtering - A Directional Error Based Approach.",
                    "Personalizing Web Search with Folksonomy-Based User and Document Profiles.",
                    "Tripartite Hidden Topic Models for Personalised Tag Suggestion.",
                    "Extracting Multilingual Topics from Unaligned Comparable Corpora.",
                    "Improving Retrievability of Patents in Prior-Art Search.",
                    "Mining OOV Translations from Mixed-Language Web Pages for Cross Language Information Retrieval.",
                    "On Foreign Name Search.",
                    "Promoting Ranking Diversity for Biomedical Information Retrieval Using Wikipedia.",
                    "Temporal Shingling for Version Identification in Web Archives.",
                    "Biometric Response as a Source of Query Independent Scoring in Lifelog Retrieval.",
                    "Enabling Interactive Query Expansion through Eliciting the Potential Effect of Expansion Terms.",
                    "Evaluation of an Adaptive Search Suggestion System.",
                    "How Different Are Language Models andWord Clouds?",
                    "Colouring the Dimensions of Relevance.",
                    "On Improving Pseudo-Relevance Feedback Using Pseudo-Irrelevant Documents.",
                    "Laplacian Co-hashing of Terms and Documents.",
                    "Query Difficulty Prediction for Contextual Image Retrieval.",
                    "Estimating Translation Probabilities from the Web for Structured Queries on CLIR.",
                    "Using Weighted Tagging to Facilitate Enterprise Search.",
                    "An Empirical Study of Query Specificity.",
                    "Semantically Enhanced Term Frequency.",
                    "Crowdsourcing Assessments for XML Ranked Retrieval.",
                    "Evaluating Server Selection for Federated Search.",
                    "A Comparison of Language Identification Approaches on Short, Query-Style Texts.",
                    "Filtering Documents with Subspaces.",
                    "User's Latent Interest-Based Collaborative Filtering.",
                    "Evaluating the Potential of Explicit Phrases for Retrieval Quality.",
                    "Developing a Test Collection for the Evaluation of Integrated Search.",
                    "Retrieving Customary Web Language to Assist Writers.",
                    "Enriching Peer-to-Peer File Descriptors Using Association Rules on Query Logs.",
                    "Cross-Language High Similarity Search: Why No Sub-linear Time Bound Can Be Expected.",
                    "Exploiting Result Consistency to Select Query Expansions for Spoken Content Retrieval.",
                    "Statistics of Online User-Generated Short Documents.",
                    "Mining Neighbors' Topicality to Better Control Authority Flow.",
                    "Finding Wormholes with Flickr Geotags.",
                    "Enhancing N-Gram-Based Summary Evaluation Using Information Content and a Taxonomy.",
                    "NEAT: News Exploration Along Time.",
                    "Opinion Summarization of Web Comments.",
                    "EUROGENE: Multilingual Retrieval and Machine Translation Applied to Human Genetics.",
                    "Netspeak - Assisting Writers in Choosing Words.",
                    "A Data Analysis and Modelling Framework for the Evaluation of Interactive Information Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "31th ECIR 2009",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2009",
                "sub_name": "Advances in Information Retrieval, 31th European Conference on IR Research, ECIR 2009, Toulouse, France, April 6-9, 2009. Proceedings.",
                "count": 94,
                "papers": [
                    "Query Evolution.",
                    "Searching User Generated Content: What's Next?.",
                    "Upcoming Industrial Needs for Search.",
                    "Mean-Variance Analysis: A New Document Ranking Theory in Information Retrieval.",
                    "Risk-Aware Information Retrieval.",
                    "A Comparative Study of Utilizing Topic Models for Information Retrieval.",
                    "Synchronous Collaborative Information Retrieval: Techniques and Evaluation.",
                    "Movie Recommender: Semantically Enriched Unified Relevance Model for Rating Prediction in Collaborative Filtering.",
                    "Revisiting IR Techniques for Collaborative Search Strategies.",
                    "Active Sampling for Rank Learning via Optimizing the Area under the ROC Curve.",
                    "Regression Rank: Learning to Meet the Opportunity of Descriptive Queries.",
                    "Active Learning Strategies for Multi-Label Text Classification.",
                    "Joint Ranking for Multilingual Web Search.",
                    "Diversity, Assortment, Dissimilarity, Variety: A Study of Diversity Measures Using Low Level Features for Video Retrieval.",
                    "Bayesian Mixture Hierarchies for Automatic Image Annotation.",
                    "XML Multimedia Retrieval: From Relevant Textual Information to Relevant Multimedia Fragments.",
                    "Effectively Searching Maps in Web Documents.",
                    "Enhancing Expert Finding Using Organizational Hierarchies.",
                    "A Vector Space Model for Ranking Entities and Its Application to Expert Search.",
                    "Sentiment-Oriented Contextual Advertising.",
                    "Lexical Graphs for Improved Contextual Ad Recommendation.",
                    "A Probabilistic Retrieval Model for Semistructured Data.",
                    "Model Fusion in Conceptual Language Modeling.",
                    "Graded-Inclusion-Based Information Retrieval Systems.",
                    "Multidimensional Relevance: A New Aggregation Criterion.",
                    "Using Multiple Query Aspects to Build Test Collections without Human Relevance Judgments.",
                    "If I Had a Million Queries.",
                    "The Combination and Evaluation of Query Performance Prediction Methods.",
                    "Investigating Learning Approaches for Blog Post Opinion Retrieval.",
                    "Integrating Proximity to Subjective Sentences for Blog Opinion Retrieval.",
                    "Adapting Naive Bayes to Domain Adaptation for Sentiment Analysis.",
                    "PathRank: Web Page Retrieval with Navigation Path.",
                    "Query Expansion Using External Evidence.",
                    "Selective Application of Query-Independent Features in Web Information Retrieval.",
                    "Measuring the Search Effectiveness of a Breadth-First Crawl.",
                    "Using Contextual Information to Improve Search in Email Archives.",
                    "Part of Speech Based Term Weighting for Information Retrieval.",
                    "Word Particles Applied to Information Retrieval.",
                    "\"They Are Out There, If You Know Where to Look\": Mining Transliterations of OOV Query Terms for Cross-Language Information Retrieval.",
                    "E-Mail Classification for Phishing Defense.",
                    "Multi-facet Rating of Product Reviews.",
                    "Exploiting Surface Features for the Prediction of Podcast Preference.",
                    "A Topic-Based Measure of Resource Description Quality for Distributed Information Retrieval.",
                    "Simple Adaptations of Data Fusion Algorithms for Source Selection.",
                    "Document Compaction for Efficient Query Biased Snippet Generation.",
                    "Organizing Suggestions in Autocompletion Interfaces.",
                    "Building a Graph of Names and Contextual Patterns for Named Entity Classification.",
                    "Combination of Documents Features Based on Simulated Click-through Data.",
                    "Discovering Association Rules on Experiences from Large-Scale Blog Entries.",
                    "Extracting Geographic Context from the Web: GeoReferencing in MyMoSe.",
                    "What Else Is There? Search Diversity Examined.",
                    "Using Second Order Statistics to Enhance Automated Image Annotation.",
                    "Classifying and Characterizing Query Intent.",
                    "Design and Evaluation of a University-Wide Expert Search Engine.",
                    "A Study of the Impact of Index Updates on Distributed Query Processing for Web Search.",
                    "Generic and Spatial Approaches to Image Search Results Diversification.",
                    "Studying Query Expansion Effectiveness.",
                    "Correlation of Term Count and Document Frequency for Google N-Grams.",
                    "A Cost-Aware Strategy for Query Result Caching in Web Search Engines.",
                    "Quality-Oriented Search for Depression Portals.",
                    "Evaluation of Text Clustering Algorithms with N-Gram-Based Document Fingerprints.",
                    "Exploiting Flickr Tags and Groups for Finding Landmark Photos.",
                    "Refining Keyword Queries for XML Retrieval by Combining Content and Structure.",
                    "Cover Coefficient-Based Multi-document Summarization.",
                    "A Practitioner's Guide for Static Index Pruning.",
                    "Revisiting N-Gram Based Models for Retrieval in Degraded Large Collections.",
                    "A Simple Linear Ranking Algorithm Using Query Dependent Intercept Variables.",
                    "Measurement Techniques and Caching Effects.",
                    "On Automatic Plagiarism Detection Based on n-Grams Comparison.",
                    "Exploiting Visual Concepts to Improve Text-Based Image Retrieval.",
                    "Choosing the Best MT Programs for CLIR Purposes - Can MT Metrics Be Helpful?",
                    "Entropy-Based Static Index Pruning.",
                    "Representing User Navigation in XML Retrieval with Structural Summaries.",
                    "ESUM: An Efficient System for Query-Specific Multi-document Summarization.",
                    "Using WordNet's Semantic Relations for Opinion Detection in Blogs.",
                    "Improving Opinion Retrieval Based on Query-Specific Sentiment Lexicon.",
                    "Automatically Maintained Domain Knowledge: Initial Findings.",
                    "A Framework of Evaluation for Question-Answering Systems.",
                    "Combining Content and Context Similarities for Image Retrieval.",
                    "Investigating the Global Semantic Impact of Speech Recognition Error on Spoken Content Collections.",
                    "Supervised Semantic Indexing.",
                    "Split and Merge Based Story Segmentation in News Videos.",
                    "Encoding Ordinal Features into Binary Features for Text Classification.",
                    "Topic and Trend Detection in Text Collections Using Latent Dirichlet Allocation.",
                    "Measuring Similarity of Geographic Regions for Geographic Information Retrieval.",
                    "Towards the Selection of Induced Syntactic Relations.",
                    "DiffPost: Filtering Non-relevant Content Based on Content Difference between Two Consecutive Blog Posts.",
                    "An Unsupervised Approach to Product Attribute Extraction.",
                    "Workshop on Contextual Information Access, Seeking and Retrieval Evaluation.",
                    "Workshop on Information Retrieval over Social Networks.",
                    "Workshop on Geographic Information on the Internet Workshop (GIIW).",
                    "Current Developments in Information Retrieval Evaluation.",
                    "Information Extraction and Linking in a Retrieval Context.",
                    "Mining Query Logs."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "30th ECIR 2008",
        "info": "Glasgow, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2008",
                "sub_name": "Advances in Information Retrieval , 30th European Conference on IR Research, ECIR 2008, Glasgow, UK, March 30-April 3, 2008. Proceedings.",
                "count": 87,
                "papers": [
                    "Some(What) Grand Challenges for Information Retrieval.",
                    "Web Search: Challenges and Directions.",
                    "You Are a Document Too: Web Mining and IR for Next-Generation Information Literacy.",
                    "Discounted Cumulated Gain Based Evaluation of Multiple-Query IR Sessions.",
                    "Here or There.",
                    "Using Clicks as Implicit Judgments: Expectations Versus Observations.",
                    "Clustering Template Based Web Documents.",
                    "Effective Pre-retrieval Query Performance Prediction Using Similarity and Variability Evidence.",
                    "iCluster: A Self-organizing Overlay Network for P2P Information Retrieval.",
                    "Labeling Categories and Relationships in an Evolving Social Network.",
                    "Automatic Construction of an Opinion-Term Vocabulary for Ad Hoc Retrieval.",
                    "A Comparison of Social Bookmarking with Traditional Search.",
                    "Effects of Aligned Corpus Quality and Size in Corpus-Based CLIR.",
                    "Exploring the Effects of Language Skills on Multilingual Web Search.",
                    "A Novel Implementation of the FITE-TRT Translation Method.",
                    "The BNB Distribution for Text Modeling.",
                    "Utilizing Passage-Based Language Models for Document Retrieval.",
                    "A Statistical View of Binned Retrieval Models.",
                    "Video Corpus Annotation Using Active Learning.",
                    "Use of Implicit Graph for Recommending Relevant Videos: A Simulated Evaluation.",
                    "Using Terms from Citations for IR: Some First Results.",
                    "Automatic Extraction of Domain-Specific Stopwords from Labeled Documents.",
                    "Book Search Experiments: Investigating IR Methods for the Indexing and Retrieval of Books.",
                    "Using a Task-Based Approach in Evaluating the Usability of BoBIs in an E-book Environment.",
                    "Exploiting Locality of Wikipedia Links in Entity Ranking.",
                    "The Importance of Link Evidence in Wikipedia.",
                    "High Quality Expertise Evidence for Expert Search.",
                    "Associating People and Documents.",
                    "Modeling Documents as Mixtures of Persons for Expert Finding.",
                    "Ranking Users for Intelligent Message Addressing.",
                    "Facilitating Query Decomposition in Query Language Modeling by Association Rule Mining Using Multiple Sliding Windows.",
                    "Viewing Term Proximity from a Different Perspective.",
                    "Extending Probabilistic Data Fusion Using Sliding Windows.",
                    "Semi-supervised Document Classification with a Mislabeling Error Model.",
                    "Improving Term Frequency Normalization for Multi-topical Documents and Application to Language Modeling Approaches.",
                    "Probabilistic Document Length Priors for Language Models.",
                    "Applying Maximum Entropy to Known-Item Email Retrieval.",
                    "Computing Information Retrieval Performance Measures Efficiently in the Presence of Tied Scores.",
                    "Towards Characterization of Actor Evolution and Interactions in News Corpora.",
                    "The Impact of Semantic Class Identification and Semantic Role Labeling on Natural Language Answer Extraction.",
                    "Improving Complex Interactive Question Answering with Wikipedia Anchor Text.",
                    "A Cluster-Sensitive Graph Model for Query-Oriented Multi-document Summarization.",
                    "Evaluating Text Representations for Retrieval of the Best Group of Documents.",
                    "Enhancing Relevance Models with Adaptive Passage Retrieval.",
                    "Ontology Matching Using Vector Space.",
                    "Accessibility in Information Retrieval.",
                    "Semantic Relationships in Multi-modal Graphs for Automatic Image Annotation.",
                    "Conversation Detection in Email Systems.",
                    "Efficient Multimedia Time Series Data Retrieval Under Uniform Scaling and Normalisation.",
                    "Integrating Structure and Meaning: A New Method for Encoding Structure for Text Classification.",
                    "A Wikipedia-Based Multilingual Retrieval Model.",
                    "Filaments of Meaning in Word Space.",
                    "Finding the Best Picture: Cross-Media Retrieval of Content.",
                    "Robust Query-Specific Pseudo Feedback Document Selection for Query Expansion.",
                    "Expert Search Evaluation by Supporting Documents.",
                    "Ranking Categories for Web Search.",
                    "Key Design Issues with Visualising Images Using Google Earth.",
                    "Methods for Augmenting Semantic Models with Structural Information for Text Classification.",
                    "Use of Temporal Expressions in Web Search.",
                    "Towards an Automatically Generated Music Information System Via Web Content Mining.",
                    "Investigating the Effectiveness of Clickthrough Data for Document Reordering.",
                    "Analysis of Link Graph Compression Techniques.",
                    "An Evaluation and Analysis of Incorporating Term Dependency for Ad-Hoc Retrieval.",
                    "An Evaluation Measure for Distributed Information Retrieval Systems.",
                    "Optimizing Language Models for Polarity Classification.",
                    "Improving Web Image Retrieval Using Image Annotations and Inference Network.",
                    "Slide-Film Interface: Overcoming Small Screen Limitations in Mobile Web Search.",
                    "A Document-Centered Approach to a Natural Language Music Search Engine.",
                    "Collaborative Topic Tracking in an Enterprise Environment.",
                    "Graph-Based Profile Similarity Calculation Method and Evaluation.",
                    "The Good, the Bad, the Difficult, and the Easy: Something Wrong with Information Retrieval Evaluation?.",
                    "Hybrid Method for Personalized Search in Digital Libraries.",
                    "Exploiting Session Context for Information Retrieval - A Comparative Study.",
                    "Structural Re-ranking with Cluster-Based Retrieval.",
                    "Automatic Vandalism Detection in Wikipedia.",
                    "Evaluating Paragraph Retrieval for .",
                    "Revisit of Nearest Neighbor Test for Direct Evaluation of Inter-document Similarities.",
                    "A Comparison of Named Entity Patterns from a User Analysis and a System Analysis.",
                    "Query-Based Inter-document Similarity Using Probabilistic Co-relevance Model.",
                    "Using Coherence-Based Measures to Predict Query Difficulty.",
                    "Efficient Processing of Category-Restricted Queries for Web Directories.",
                    "Focused Browsing: Providing Topical Feedback for Link Selection in Hypertext Browsing.",
                    "The Impact of Named Entity Normalization on Information Retrieval for Question Answering.",
                    "Efficiency Issues in Information Retrieval Workshop.",
                    "Exploiting Semantic Annotations in Information Retrieval.",
                    "Workshop on Novel Methodologies for Evaluation in Information Retrieval.",
                    "ECIR 2008 Tutorials."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "29th ECIR 2007",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2007",
                "sub_name": "Advances in Information Retrieval, 29th European Conference on IR Research, ECIR 2007, Rome, Italy, April 2-5, 2007, Proceedings.",
                "count": 85,
                "papers": [
                    "The Next Generation Web Search and the Demise of the Classic IR Model.",
                    "The Last Half-Century: A Perspective on Experimentation in Information Retrieval.",
                    "Learning in Hyperlinked Environments.",
                    "A Parameterised Search System.",
                    "Similarity Measures for Short Segments of Text.",
                    "Multinomial Randomness Models for Retrieval with Document Fields.",
                    "On Score Distributions and Relevance.",
                    "Modeling Term Associations for Ad-Hoc Retrieval Performance Within Language Modeling Framework.",
                    "Static Pruning of Terms in Inverted Files.",
                    "Efficient Indexing of Versioned Document Sequences.",
                    "Light Syntactically-Based Index Pruning for Information Retrieval.",
                    "Sorting Out the Document Identifier Assignment Problem.",
                    "Efficient Construction of FM-index Using Overlapping Block Processing for Large Scale Texts.",
                    "Performance Comparison of Clustered and Replicated Information Retrieval Systems.",
                    "A Study of a Weighting Scheme for Information Retrieval in Hierarchical Peer-to-Peer Networks.",
                    "A Decision-Theoretic Model for Decentralised Query Routing in Hierarchical Peer-to-Peer Networks.",
                    "Central-Rank-Based Collection Selection in Uncooperative Distributed Information Retrieval.",
                    "Results Merging Algorithm Using Multiple Regression Models.",
                    "Segmentation of Search Engine Results for Effective Data-Fusion.",
                    "Query Hardness Estimation Using Jensen-Shannon Divergence Among Multiple Scoring Functions.",
                    "Query Reformulation and Refinement Using NLP-Based Sentence Clustering.",
                    "Automatic Morphological Query Expansion Using Analogy-Based Machine Learning.",
                    "Advanced Structural Representations for Question Classification and Answer Re-ranking.",
                    "Incorporating Diversity and Density in Active Learning for Relevance Feedback.",
                    "Relevance Feedback Using Weight Propagation Compared with Information-Theoretic Query Expansion.",
                    "A Retrieval Evaluation Methodology for Incomplete Relevance Assessments.",
                    "Evaluating Query-Independent Object Features for Relevancy Prediction.",
                    "The Utility of Information Extraction in the Classification of Books.",
                    "Combined Syntactic and Semantic Kernels for Text Classification.",
                    "Fast Large-Scale Spectral Clustering by Sequential Shrinkage Optimization.",
                    "A Probabilistic Model for Clustering Text Documents with Multiple Fields.",
                    "Personalized Communities in a Distributed Recommender System.",
                    "Information Recovery and Discovery in Collaborative Web Search.",
                    "Collaborative Filtering Based on Transitive Correlations Between Items.",
                    "Entropy-Based Authorship Search in Large Document Collections.",
                    "Use of Topicality and Information Measures to Improve Document Representation for Story Link Detection.",
                    "Ad Hoc Retrieval of Documents with Topical Opinion.",
                    "Probabilistic Models for Expert Finding.",
                    "Using Relevance Feedback in Expert Search.",
                    "Using Topic Shifts for Focussed Access to XML Repositories.",
                    "Feature- and Query-Based Table of Contents Generation for XML Documents.",
                    "Setting Per-field Normalisation Hyper-parameters for the Named-Page Finding Search Task.",
                    "Combining Evidence for Relevance Criteria: A Framework and Experiments in Web Retrieval.",
                    "Classifier Fusion for SVM-Based Multimedia Semantic Indexing.",
                    "Search of Spoken Documents Retrieves Well Recognized Transcripts.",
                    "Natural Language Processing for Usage Based Indexing of Web Resources.",
                    "Harnessing Trust in Social Search.",
                    "How to Compare Bilingual to Monolingual Cross-Language Information Retrieval.",
                    "Multilingual Text Classification Using Ontologies.",
                    "Using Visual-Textual Mutual Information and Entropy for Inter-modal Document Indexing.",
                    "A Study of Global Inference Algorithms in Multi-document Summarization.",
                    "Document Representation Using Global Association Distance Model.",
                    "Sentence Level Sentiment Analysis in the Presence of Conjuncts Using Linguistic Analysis.",
                    "PageRank: When Order Changes.",
                    "Model Tree Learning for Query Term Weighting in Question Answering.",
                    "Examining Repetition in User Search Behavior.",
                    "Popularity Weighted Ranking for Academic Digital Libraries.",
                    "Naming Functions for the Vector Space Model.",
                    "Effective Use of Semantic Structure in XML Retrieval.",
                    "Searching Documents Based on Relevance and Type.",
                    "Investigation of the Effectiveness of Cross-Media Indexing.",
                    "Improve Ranking by Using Image Information.",
                    "N -Step PageRank for Web Search.",
                    "Authorship Attribution Via Combination of Evidence.",
                    "Cross-Document Entity Tracking.",
                    "Enterprise People and Skill Discovery Using Tolerant Retrieval and Visualization.",
                    "Experimental Results of the Signal Processing Approach to Distributional Clustering of Terms on Reuters-21578 Collection.",
                    "Overall Comparison at the Standard Levels of Recall of Multiple Retrieval Methods with the Friedman Test.",
                    "Building a Desktop Search Test-Bed.",
                    "Hierarchical Browsing of Video Key Frames.",
                    "Active Learning with History-Based Query Selection for Text Categorisation.",
                    "Fighting Link Spam with a Two-Stage Ranking Strategy.",
                    "Improving Naive Bayes Text Classifier Using Smoothing Methods.",
                    "Term Selection and Query Operations for Video Retrieval.",
                    "An Effective Threshold-Based Neighbor Selection in Collaborative Filtering.",
                    "Combining Multiple Sources of Evidence in XML Multimedia Documents: An Inference Network Incorporating Element Language Models.",
                    "Language Model Based Query Classification.",
                    "Integration of Text and Audio Features for Genre Classification in Music Information Retrieval.",
                    "Retrieval Method for Video Content in Different Format Based on Spatiotemporal Features.",
                    "Combination of Document Priors in Web Information Retrieval.",
                    "Enhancing Expert Search Through Query Modeling.",
                    "A Hierarchical Consensus Architecture for Robust Document Clustering.",
                    "Summarisation and Novelty: An Experimental Investigation.",
                    "A Layered Approach to Context-Dependent User Modelling.",
                    "A Bayesian Approach for Learning Document Type Relevance."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "28th ECIR 2006",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2006",
                "sub_name": "Advances in Information Retrieval, 28th European Conference on IR Research, ECIR 2006, London, UK, April 10-12, 2006, Proceedings.",
                "count": 69,
                "papers": [
                    "Progress in Information Retrieval.",
                    "Enterprise Search - The New Frontier?",
                    "Frequentist and Bayesian Approach to Information Retrieval.",
                    "Using Proportional Transportation Distances for Measuring Document Similarity.",
                    "A User-Item Relevance Model for Log-Based Collaborative Filtering.",
                    "Generating Search Term Variants for Text Collections with Historic Spellings.",
                    "Efficient Phrase Querying with Common Phrase Index.",
                    "Document Length Normalization Using Effective Level of Term Frequency in Large Collections.",
                    "Beyond the Web: Retrieval in Social Information Spaces.",
                    "Evaluating Web Search Result Summaries.",
                    "Measuring the Complexity of a Collection of Documents.",
                    "Sentence Retrieval with LSI and Topic Identification.",
                    "Ranking Web News Via Homepage Visual Layout and Cross-Site Voting.",
                    "Clustering-Based Searching and Navigation in an Online News Source.",
                    "Mobile Clustering Engine.",
                    "Improving Quality of Search Results Clustering with Approximate Matrix Factorisations.",
                    "Adapting the Naive Bayes Classifier to Rank Procedural Texts.",
                    "The Effects of Relevance Feedback Quality and Quantity in Interactive Relevance Feedback: A Simulation Based on User Modeling.",
                    "Using Query Profiles for Clarification.",
                    "Lexical Entailment for Information Retrieval.",
                    "A Hybrid Approach to Index Maintenance in Dynamic Text Retrieval Systems.",
                    "Efficient Parallel Computation of PageRank.",
                    "Comparing Different Architectures for Query Routing in Peer-to-Peer Networks.",
                    "Automatic Document Organization in a P2P Environment.",
                    "Exploring URL Hit Priors for Web Search.",
                    "A Study of Blog Search.",
                    "A Comparative Study of the Effectiveness of Search Result Presentation on the Web.",
                    "Bricks: The Building Blocks to Tackle Query Formulation in Structured Document Retrieval.",
                    "Structural Feedback for Keyword-Based XML Retrieval.",
                    "Machine Learning Ranking for Structured Information Retrieval.",
                    "Generating and Retrieving Text Segments for Focused Access to Scientific Documents.",
                    "Browsing Personal Images Using Episodic Memory (Time + Location).",
                    "An Information Retrieval System for Motion Capture Data.",
                    "Can a Workspace Help to Overcome the Query Formulation Problem in Image Retrieval?.",
                    "A Fingerprinting Technique for Evaluating Semantics Based Indexing.",
                    "A Cross-Language Approach to Historic Document Retrieval.",
                    "Automatic Acquisition of Chinese-English Parallel Corpus from the Web.",
                    "Fast Discovery of Similar Sequences in Large Genomic Collections.",
                    "Using Concept-Based Indexing to Improve Language Modeling Approach to Genomic IR.",
                    "The Effects on Topic Familiarity on Online Search Behaviour and Use of Relevance Criteria.",
                    "PERC: A Personal Email Classifier.",
                    "Influence Diagrams for Contextual Information Retrieval.",
                    "Morphological Variation of Arabic Queries.",
                    "Combining Short and Long Term Audio Features for TV Sports Highlight Detection.",
                    "Object-Based Access to TV Rushes Video.",
                    "An Efficient Computation of the Multiple-Bernoulli Language Model.",
                    "Title and Snippet Based Result Re-ranking in Collaborative Web Search.",
                    "A Classification of IR Effectiveness Metrics.",
                    "Experiments on Average Distance Measure.",
                    "Phrase Clustering Without Document Context.",
                    "Rapid Development of Web-Based Monolingual Question Answering Systems.",
                    "Filtering Obfuscated Email Spam by means of Phonetic String Matching.",
                    "Sprinkling: Supervised Latent Semantic Indexing.",
                    "Web-Based Multiple Choice Question Answering for English and Arabic Questions.",
                    "Authoritative Re-ranking of Search Results.",
                    "Readability Applied to Information Retrieval.",
                    "Automatic Determination of Feature Weights for Multi-feature CBIR.",
                    "Towards Automatic Retrieval of Album Covers.",
                    "Clustering Sentences for Discovering Events in News Articles.",
                    "Specificity Helps Text Classification.",
                    "A Declarative DB-Powered Approach to IR.",
                    "Judging the Spatial Relevance of Documents for GIR.",
                    "Probabilistic Score Normalization for Rank Aggregation.",
                    "Learning Links Between a User's Calendar and Information Needs.",
                    "Supporting Relevance Feedback in Video Search.",
                    "Intrinsic Plagiarism Detection.",
                    "Investigating Biometric Response for Information Retrieval Applications.",
                    "Relevance Feedback Using Weight Propagation.",
                    "Context-Specific Frequencies and Discriminativeness for the Retrieval of Structured Documents."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "27th ECIR 2005",
        "info": "Santiago de Compostela, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2005",
                "sub_name": "Advances in Information Retrieval, 27th European Conference on IR Research, ECIR 2005, Santiago de Compostela, Spain, March 21-23, 2005, Proceedings.",
                "count": 53,
                "papers": [
                    "A Probabilistic Logic for Information Retrieval.",
                    "Applications of Web Query Mining.",
                    "BuddyNet: History-Based P2P Search.",
                    "A Suite of Testbeds for the Realistic Evaluation of Peer-to-Peer Information Retrieval Systems.",
                    "Federated Search of Text-Based Digital Libraries in Hierarchical Peer-to-Peer Networks.",
                    "'Beauty' of the World Wide Web-Cause, Goal, or Principle.",
                    "sPLMap: A Probabilistic Approach to Schema Matching.",
                    "Encoding XML in Vector Spaces.",
                    "Features Combination for Extracting Gene Functions from MEDLINE.",
                    "Filtering for Profile-Biased Multi-document Summarization.",
                    "Automatic Text Summarization Based on Word-Clusters and Ranking Algorithms.",
                    "Comparing Topiary-Style Approaches to Headline Generation.",
                    "Improving Retrieval Effectiveness by Using Key Terms in Top Retrieved Documents.",
                    "Evaluating Relevance Feedback Algorithms for Searching on Small Displays.",
                    "Term Frequency Normalisation Tuning for BM25 and DFR Models.",
                    "Improving the Context-Based Influence Diagram Model for Structured Document Retrieval: Removing Topological Restrictions and Adding New Evaluation Methods.",
                    "Knowing-Aboutness: Question-Answering Using a Logic-Based Framework.",
                    "Modified LSI Model for Efficient Search by Metric Access Methods.",
                    "PIRE: An Extensible IR Engine Based on Probabilistic Datalog.",
                    "Data Fusion with Correlation Weights.",
                    "Using Restrictive Classification and Meta Classification for Junk Elimination.",
                    "On Compression-Based Text Classification.",
                    "Ontology as a Search-Tool: A Study of Real Users' Query Formulation With and Without Conceptual Support.",
                    "An Analysis of Query Similarity in Collaborative Web Search.",
                    "A Probabilistic Interpretation of Precision, Recall and F-Score, with Implication for Evaluation.",
                    "Exploring Cost-Effective Approaches to Human Evaluation of Search Engine Relevance.",
                    "Document Identifier Reassignment Through Dimensionality Reduction.",
                    "Scalability Influence on Retrieval Models: An Experimental Methodology.",
                    "The Role of Multi-word Units in Interactive Information Retrieval.",
                    "Dictionary-Based CLIR Loses Highly Relevant Documents.",
                    "Football Video Segmentation Based on Video Production Strategy.",
                    "Fractional Distance Measures for Content-Based Image Retrieval.",
                    "Combining Visual Semantics and Texture Characterizations for Precision-Oriented Automatic Image Retrieval.",
                    "Applying Associative Relationship on the Clickthrough Data to Improve Web Search.",
                    "Factors Affecting Web Page Similarity.",
                    "Boosting Web Retrieval Through Query Operations.",
                    "Terrier Information Retrieval Platform.",
                    "Físréal: A Low Cost Terabyte Search Engine.",
                    "Query Formulation for Answer Projection.",
                    "Network Analysis for Distributed Information Retrieval Architectures.",
                    "SnapToTell: A Singapore Image Test Bed for Ubiquitous Information Access from Camera.",
                    "Acquisition of Translation Knowledge of Syntactically Ambiguous Named Entity.",
                    "IR and OLAP in XML Document Warehouses.",
                    "Manipulating the Relevance Models of Existing Search Engines.",
                    "Enhancing Web Search Result Lists Using Interaction Histories.",
                    "An Evaluation of Gisting in Mobile Search.",
                    "Video Shot Classification Using Lexical Context.",
                    "Age Dependent Document Priors in Link Structure Analysis.",
                    "Improving Image Representation with Relevance Judgements from the Searchers.",
                    "Temporal Shot Clustering Analysis for Video Concept Detection.",
                    "IRMAN: Software Framework for IR in Mobile Social Cyberspaces.",
                    "Assigning Geographical Scopes To Web Pages.",
                    "AP-Based Borda Voting Method for Feature Extraction in TRECVID-2004."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "26th ECIR 2004",
        "info": "Sunderland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2004",
                "sub_name": "Advances in Information Retrieval, 26th European Conference on IR Research, ECIR 2004, Sunderland, UK, April 5-7, 2004, Proceedings.",
                "count": 30,
                "papers": [
                    "From Information Retrieval to Information Interaction.",
                    "IR and AI: Traditions of Representation and Anti-representation in Information Processing.",
                    "A User-Centered Approach to Evaluating Topic Models.",
                    "A Study of User Interaction with a Concept-Based Interactive Query Expansion Support Tool.",
                    "Searcher's Assessments of Task Complexity for Web Searching.",
                    "Evaluating Passage Retrieval Approaches for Question Answering.",
                    "Identification of Relevant and Novel Sentences Using Reference Corpus.",
                    "Answer Selection in a Multi-stream Open Domain Question Answering System.",
                    "A Bidimensional View of Documents for Text Categorisation.",
                    "Query Difficulty, Robustness, and Selective Application of Query Expansion.",
                    "Combining CORI and the Decision-Theoretic Approach for Advanced Resource Selection.",
                    "Predictive Top-Down Knowledge Improves Neural Exploratory Bottom-Up Clustering.",
                    "Contextual Document Clustering.",
                    "Complex Linguistic Features for Text Classification: A Comprehensive Study.",
                    "Eliminating High-Degree Biased Character Bigrams for Dimensionality Reduction in Chinese Text Categorization.",
                    "Broadcast News Gisting Using Lexical Cohesion Analysis.",
                    "From Text Summarisation to Style-Specific Summarisation for Broadcast News.",
                    "Relevance Feedback for Cross Language Image Retrieval.",
                    "NNk Networks for Content-Based Image Retrieval.",
                    "Integrating Perceptual Signal Features within a Multi-facetted Conceptual Model for Automatic Image Retrieval.",
                    "Improving Retrieval Effectiveness by Reranking Documents Based on Controlled Vocabulary.",
                    "A Study of the Assessment of Relevance for the INEX'02 Test Collection.",
                    "A Simulated Study of Implicit Feedback Models.",
                    "Cross-Language Information Retrieval Using EuroWordNet and Word Sense Disambiguation.",
                    "Fault-Tolerant Fulltext Information Retrieval in Digital Multilingual Encyclopedias with Weighted Pattern Morphing.",
                    "Measuring a Cross Language Image Retrieval System.",
                    "An Optimistic Model for Searching Web Directories.",
                    "Content-Aware DataGuides: Interleaving IR and DB Indexing Techniques for Efficient Retrieval of Textual XML Data.",
                    "Performance Analysis of Distributed Architectures to Index One Terabyte of Text.",
                    "Applying the Divergence from Randomness Approach for Content-Only Search in XML Documents."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "25th ECIR 2003",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2003",
                "sub_name": "Advances in Information Retrieval, 25th European Conference on IR Research, ECIR 2003, Pisa, Italy, April 14-16, 2003, Proceedings.",
                "count": 49,
                "papers": [
                    "Document Retrieval: Shallow Data, Deep Theories; Historical Reflections, Potential Directions.",
                    "Annotation and Retrieval of Structured Video Documents.",
                    "Improving the Evaluation of Web Search Systems.",
                    "When Are Links Useful? Experiments in Text Classification.",
                    "Hierarchical Classification of HTML Documents with WebClassII.",
                    "Hierarchical Indexing and Flexible Element Retrieval for Structured Document.",
                    "Construction of a Test Collection for the Focussed Retrieval of Structured Documents.",
                    "User Behaviour in the Context of Structured Documents.",
                    "Attaining Fast and Successful Searches in E-commerce Environments.",
                    "Learning User Similarity and Rating Style for Collaborative Recommendation.",
                    "Spoken Information Extraction from Italian Broadcast News.",
                    "Taming Wild Phrases.",
                    "Stemming and Decompounding for German Text Retrieval.",
                    "Question Answering System for Incomplete and Noisy Data.",
                    "Term Proximity Scoring for Keyword-Based Retrieval Systems.",
                    "Propositional Logic Representations for Documents and Queries: A Large-Scale Evaluation.",
                    "From Uncertain Inference to Probability of Relevance for Advanced IR Applications.",
                    "Topic Detection and Tracking with Spatio-Temporal Evidence.",
                    "Clustering and Visualization in a Multi-lingual Multi-document Summarization System.",
                    "A Hybrid Relevance-Feedback Approach to Text Retrieval.",
                    "Experiments with Document Archive Size Detection.",
                    "Using Kullback-Leibler Distance for Text Categorization.",
                    "Discretizing Continuous Attributes in AdaBoost for Text Categorization.",
                    "Combining Naive Bayes and n-Gram Language Models for Text Classification.",
                    "WebDocBall: A Graphical Visualization Tool for Web Search Results.",
                    "Relevance Feedback for Content-Based Image Retrieval: What Can Three Mouse Clicks Achieve?",
                    "Query-Based Document Skimming: A User-Centred Evaluation of Relevance Profiling.",
                    "Representative Sampling for Text Classification Using Support Vector Machines.",
                    "Chinese Text Categorization Based on the Binary Weighting Model with Non-binary Smoothing.",
                    "A Study on Optimal Parameter Tuning for Rocchio Text Classifier.",
                    "Optimization of Restricted Searches in Web Directories Using Hybrid Data Structures.",
                    "Similarity Join in Metric Spaces.",
                    "An Efficient Compression Code for Text Databases.",
                    "Compressing Semistructured Text Databases.",
                    "Vertical Searching in Juridical Digital Libraries.",
                    "Corpus-Based Thesaurus Construction for Image Retrieval in Specialist Domains.",
                    "Generating Extracts with Genetic Algorithms.",
                    "The ITC-irst News on Demand Platform.",
                    "Evaluating Peer-to-Peer Networking for Information Retrieval within the Context of Meta-searching.",
                    "Parallel Computing for Term Selection in Routing/Filtering.",
                    "A Weighting Scheme for Star-Graphs.",
                    "Phrase-Based Hierarchical Clustering of Web Search Results.",
                    "Aggregated Feature Retrieval for MPEG-7.",
                    "Document Retrieval in the Context of Question Answering.",
                    "A Study of the Usefulness of Institutions' Acronyms as Web Queries.",
                    "Building a Hierarchy of Events and Topics for Newspaper Digital Libraries.",
                    "A Machine Learning Approach for the Curation of Biomedical Literature.",
                    "Automatic Construction of Theme Melody Index from Music Database for Fast Content-Based Retrievals.",
                    "A Personalized Information Search Process Based on Dialoguing Agents and User Profiling."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "24th ECIR 2002",
        "info": "Glasgow, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/2002",
                "sub_name": "Advances in Information Retrieval, 24th BCS-IRSG European Colloquium on IR Research Glasgow, UK, March 25-27, 2002 Proceedings.",
                "count": 23,
                "papers": [
                    "Evaluating a Melody Extraction Engine.",
                    "Organising and Searching Partially Indexed Image Databases.",
                    "Combining Features for Content-Based Sketch Retrieval - A Comparative Evaluation of Retrieval Performance.",
                    "Combining Web Document Representations in a Bayesian Inference Network Model Using Link and Content-Based Evidence.",
                    "An Improved Computation of the PageRank Algorithm.",
                    "Serving Enhanced Hypermedia Information.",
                    "The Use of Implicit Evidence for Relevance Feedback in Web Retrieval.",
                    "Subject Knowledge, Source of Terms, and Term Selection in Query Expansion: An Analytical Study.",
                    "Automatic Profile Reformulation Using a Local Document Analysis.",
                    "A Study on Using Genetic Niching for Query Optimisation in Document Retrieval.",
                    "Concept Based Adaptive IR Model Using FCA-BAM Combination for Concept Representation and Encoding.",
                    "A Layered Bayesian Network Model for Document Retrieval.",
                    "Term Frequency Normalization via Pareto Distributions.",
                    "Optimal Mixture Models in IR.",
                    "Text Categorization: An Experiment Using Phrases.",
                    "A Hierarchical Model for Clustering and Categorising Documents.",
                    "Uncertainty-Based Noise Reduction and Term Selection in Text Categorization.",
                    "A Graphical User Interface for Structured Document Retrieval.",
                    "The Accessibility Dimension for Structured Document Retrieval.",
                    "Building Bilingual Dictionaries from Parallel Web Documents.",
                    "Translation-Based Indexing for Cross-Language Retrieval.",
                    "A Retrospective Evaluation Method for Exact-Match and Best-Match Queries Applying an Interactive Query Performance Analyser.",
                    "Genre Classification and Domain Transfer for Information Filtering."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "22nd IRSG 2000",
        "info": "Cambridge, UK",
        "venues": []
    },
    {
        "year": "1999",
        "name": "21th BCS-IRSG Annual Colloquium on IR Research 1999",
        "info": "Newcastle upon Tyne, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/1999",
                "sub_name": "Challenge of Image Retrieval, Newcastle upon Tyne, UK. 25-26 February 1999.",
                "count": 13,
                "papers": [
                    "Sequence Models for Automatic Highlighting and Surface Information Extraction.",
                    "An Empirical Study of Memory and Information Retrieval with a Spatial User Interface.",
                    "Virtual WWW Documents: a Concept to Explicit the Structure of WWW Sites.",
                    "A Two-time Model for Video Content Representation and Retrieval.",
                    "Document Clustering for Mediated Information Access.",
                    "Knowledge Management and Information Retrieval: Some New Challenges.",
                    "User Interface Issues for Browsing Digital Video.",
                    "Normalization and Matching in the DORO System.",
                    "Clustering Information Retrieval Search Outputs.",
                    "Improving Index Structures for Structured Document Retrieval.",
                    "The Automatic Generation of Templates for Automatic Abstracting.",
                    "How Do People Organise Their Photographs?.",
                    "IR and the Dialectic of Meaning."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "20th BCS-IRSG Annual Colloquium on IR Research 1998",
        "info": "Autrans, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/1998",
                "sub_name": "20th Annual BCS-IRSG Colloquium on IR, Autrans, France. 25th-27th March 1998.",
                "count": 16,
                "papers": [
                    "NHS: A Tool for the Automatic Construction of News Hypertext.",
                    "Text-Image Interaction for Image Retrieval and Semi-Automatic Indexing.",
                    "Content Based Annotation and Retrieval in RAIDER.",
                    "Social and Cognitive Factors in the Design and Evaluation of Multimedia Systems.",
                    "German Indexing and Retrieval Test Data Base (GIRT) - Some Results of the Pre-test.",
                    "Combining Information Retrieval with Information Extraction for Efficient Retrieval of Calls for Papers.",
                    "Evaluation of Interfaces for IRS: Modelling End-User Searching Behaviour.",
                    "Effective and Efficient Relational Query Processing Using Conceptual Graphs.",
                    "Modeling Information Retrieval with Probabilistic Argumentation Systems.",
                    "An Architecture for Efficient Document Clustering and Retrieval on a Dynamic Collection of Newspaper Texts.",
                    "User-Chosen Phrases in Interactive Query Formulation for Information Retrieval.",
                    "Independence of Contributing Retrieval Strategies in Data Fusion for Effective Information Retrieval.",
                    "A Dempster-Shafer Model for Document Retrieval using Noun Phrases.",
                    "The Relationship between IR and Multimedia Databases.",
                    "Agents in Cyberspace - Towards a Framework for Multi-Agent Systems in Information Discovery.",
                    "Coupled Hierarchical IR and Stochastic Models for Surface Information Extraction."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "19th BCS-IRSG Annual Colloquium on IR Research 1997",
        "info": "Aberdeen, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ecir/1997",
                "sub_name": "19th Annual BCS-IRSG Colloquium on IR Aberdeen, UK. 8th-9th April 1997.",
                "count": 13,
                "papers": [
                    "Evaluation of a Trademark Image Retrieval System.",
                    "Text-Level Structure of Research Papers: Implications for Text-Based Information Processing Systems.",
                    "Automatic Phrase Recognition and Extraction from Text.",
                    "A Community of Autonomous Agents for the Search and Distribution of Information in Networks.",
                    "Where the Linked Dependence Assumption Fails and How to Move Beyond It.",
                    "Feature Selection: A Useful Preprocessing Step.",
                    "A Logical Relational Approach for Information Retrieval Indexing.",
                    "On the Marriage of Information Retrieval and Information Extraction.",
                    "Retrieving Complex Objects with HySpirit.",
                    "User Profiling Techniques: A Critical Review.",
                    "The User Interface and Content-Based Image Retrieval Systems.",
                    "Using Combination of Evidence for Term Expansion.",
                    "Towards an Agent-Based Retrieval Engine (Profile Information Filtering Project)."
                ]
            }
        ]
    }
]