[
    {
        "year": "2021",
        "name": "40th ER 2021",
        "info": "St. John's, NL, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2021",
                "sub_name": "Conceptual Modeling - 40th International Conference, ER 2021, Virtual Event, October 18-21, 2021, Proceedings.",
                "count": 32,
                "papers": [
                    "Conceptualizing Bots in Robotic Process Automation.",
                    "Freezing Sub-models During Incremental Process Discovery.",
                    "Modeling Adaptive Data Analysis Pipelines for Crowd-Enhanced Processes.",
                    "Ontology-Based Process Modelling - Will We Live to See It?",
                    "Process Model Forecasting Using Time Series Analysis of Event Sequence Data.",
                    "Structural and Behavioral Biases in Process Comparison Using Models and Logs.",
                    "Top-Down Versus Operational-Only Business Process Modeling: An Experimental Evaluation of the Approach Leading to Higher Quality Representations.",
                    "An Empirical Study of (Multi-) Database Models in Open-Source Projects.",
                    "An Empirical Study on the \"Usage of Not\" in Real-World JSON Schema Documents.",
                    "Conceptual Modeling of Hybrid Polystores.",
                    "Dependency Rule Modeling for Multiple Aspects Trajectories.",
                    "Forward Engineering Relational Schemas and High-Level Data Access from Conceptual Models.",
                    "Remaining in Control of the Impact of Schema Evolution in NoSQL Databases.",
                    "Temporal Keyword Search with Aggregates and Group-By.",
                    "Towards a Taxonomy of Schema Changes for NoSQL Databases: The Orion Language.",
                    "Quantitative Alignment of Enterprise Architectures with the Business Model.",
                    "Towards Graph-Based Analysis of Enterprise Architecture Models.",
                    "Towards Improvement of IT Service Adoption in Multi-Business Organizations.",
                    "Goal-Oriented Models for Teaching and Understanding Data Structures.",
                    "Model-Based Knowledge Searching.",
                    "Trustworthiness Requirements: The Pix Case Study.",
                    "A Conceptual Model for Digital Shadows in Industry and Its Application.",
                    "A Conceptual Modelling Approach for the Discovery and Management of Platoon Routes.",
                    "Semantics for Connectivity Management in IoT Sensing.",
                    "Consolidating Economic Exchange Ontologies for Corporate Reporting Standard Setting.",
                    "Empirically Evaluating the Semantic Qualities of Language Vocabularies.",
                    "Mining Tag Relationships in CQA Sites.",
                    "Ontological Unpacking as Explanation: The Case of the Viral Conceptual Model.",
                    "Type or Individual? Evidence of Large-Scale Conceptual Disarray in Wikidata.",
                    "A Sustainability Requirements Catalog for the Social and Technical Dimensions.",
                    "Conceptual Modeling of Gender-Inclusive Requirements.",
                    "Usability of Open Data Datasets."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2021d",
                "sub_name": "Proceedings of the ER Demos and Posters 2021 co-located with 40th International Conference on Conceptual Modeling (ER 2021), St. John's, NL, Canada, October 18-21, 2021.",
                "count": 9,
                "papers": [
                    "Multilevel Modeling with ConceptBase.",
                    "MORTAL: A Tool of Automatically Designing Relational Storage Schemas for Multi-model Data through Reinforcement Learning.",
                    "Conceptual Modelling of Log Files: From a UML-based Design to JSON Files.",
                    "A Test Suite for JSON Schema Containment.",
                    "Automated Assistance for Data Modelers combining Natural Language Processing and Data Modeling Heuristics: A Prototype Demonstration.",
                    "Towards the Comparison of Blockchain-based Applications Using Enterprise Modeling.",
                    "Towards Automated Schema Optimization.",
                    "Just-In-Time Modeling with DataMingler.",
                    "Initial Concepts for Augmented and Virtual Reality-based Enterprise Modeling."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2021w",
                "sub_name": "Advances in Conceptual Modeling - ER 2021 Workshops CoMoNoS, EmpER, CMLS, St. John's, NL, Canada, October 18-21, 2021, Proceedings.",
                "count": 11,
                "papers": [
                    "Mapping Multidimensional Schemas to Property Graph Models.",
                    "Designing Document Databases: A Comprehensive Requirements Perspective.",
                    "An Integrated Approach for Column-Oriented Database Application Evolution Using Conceptual Models.",
                    "Athena: A Database-Independent Schema Definition Language.",
                    "Articulating Conceptual Modeling Research Contributions.",
                    "Inter-Generational Family Reconstitution with Enriched Ontologies.",
                    "Towards AI Assisted Domain Modeling.",
                    "The Notion of \"System\" as a Core Conceptual Modeling Construct for Life Sciences.",
                    "Characterization and Treatment of the Temporal Dimension of Genomic Variations: A Conceptual Model-Based Approach.",
                    "Extension of the Genomic Conceptual Model to Integrate Genome-Wide Association Studies.",
                    "Design of an Adaptable mHealth System Supporting a Psycho-educational Program for Pregnant Women with SGA Foetuses."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "39th ER 2020",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2020",
                "sub_name": "Conceptual Modeling - 39th International Conference, ER 2020, Vienna, Austria, November 3-6, 2020, Proceedings.",
                "count": 44,
                "papers": [
                    "A Refinement Calculus for Requirements Engineering Based on Argumentation Theory.",
                    "Neo4j Keys.",
                    "Past Trends and Future Prospects in Conceptual Modeling - A Bibliometric Analysis.",
                    "Bot Log Mining: Using Logs from Robotic Process Automation for Process Mining.",
                    "Discovering Data Models from Event Logs.",
                    "Semi-automated Time-Granularity Detection for Data-Driven Simulation Using Process Mining and System Dynamics.",
                    "Identifying Cohorts: Recommending Drill-Downs Based on Differences in Behaviour for Process Mining.",
                    "Sensemaking in Dual Artefact Tasks - The Case of Business Process Models and Business Rules.",
                    "Do Declarative Process Models Help to Reduce Cognitive Biases Related to Business Rules?",
                    "Modeling Behavioral Deontic Constraints Using UML and OCL.",
                    "Defining Instance Spanning Constraint Patterns for Business Processes Based on Proclets.",
                    "Contribution of Conceptual Modeling to Enhancing Historians' Intuition - Application to Prosopography.",
                    "A Code-Efficient Process Scripting Language.",
                    "Assessing the Compliance of Business Process Models with Regulatory Documents.",
                    "Model-Driven Chatbot Development.",
                    "Supporting Collaborative Modeling via Natural Language Processing.",
                    "Automatic Generation of Chatbots for Conversational Web Browsing.",
                    "Modeling Narrative Structures in Logical Overlays on Top of Knowledge Repositories.",
                    "Towards a Conceptual Model for Data Narratives.",
                    "Subcontracting, Assignment, and Substitution for Legal Contracts in Symboleo.",
                    "Towards a Reference Ontology for Digital Platforms.",
                    "An Ontological Analysis of the Notion of Treatment.",
                    "Transformation of Ontology-Based Conceptual Models into Relational Schemas.",
                    "Towards an Ontology Network on Human-Computer Interaction.",
                    "Ontology-Based Modeling and Analysis of Trustworthiness Requirements: Preliminary Results.",
                    "Upper-Level Types of Occurrent Based on the Principle of Ontological Conservation.",
                    "A Core Ontology for Economic Exchanges.",
                    "Towards a Model-Driven Architecture for Interactive Digital Twin Cockpits.",
                    "Empowering Virus Sequence Research Through Conceptual Modeling.",
                    "Modeling Interactive Smart Spaces.",
                    "The Conceptual Schema of Ethereum.",
                    "Towards Privacy Policy Conceptual Modeling.",
                    "An Empirical Study on the Design and Evolution of NoSQL Database Schemas.",
                    "A Study on the Effect of a Table's Involvement in Foreign Keys to its Schema Evolution.",
                    "A Workload-Driven Document Database Schema Recommender (DBSR).",
                    "Quantifying the Impact of EER Modeling on Relational Database Success: An Experimental Investigation.",
                    "Modeling Difficulties in Data Modeling - Similarities and Differences Between Experienced and Non-experienced Modelers.",
                    "Towards a Framework for Empirical Measurement of Conceptualization Qualities.",
                    "Deep Temporal Multi-Graph Convolutional Network for Crime Prediction.",
                    "A Conceptual Framework for Dynamic Planning of Alternative Routes in Road Networks.",
                    "EER$\\rightarrow $MLN: EER Approach for Modeling, Mapping, and Analyzing Complex Data Using Multilayer Networks (MLNs).",
                    "Modeling and Analysis of Boundary Objects and Methodological Islands in Large-Scale Systems Development.",
                    "Structural and Computational Properties of Possibilistic Armstrong Databases.",
                    "Trust-Aware Curation of Linked Open Data Logs."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2020f",
                "sub_name": "ER Forum, Demo and Posters 2020 co-located with 39th International Conference on Conceptual Modeling (ER 2020), Vienna, Austria, November 3-6, 2020.",
                "count": 18,
                "papers": [
                    "A Domain Specific Modeling Language for Model-Based Design of Voice User Interfaces.",
                    "Modeling Platform Ecosystems.",
                    "Conceptual Modeling of Legal Case Insights for Stakeholder Decision Making.",
                    "Towards a Multi-Objective Modularization Approach for Entity-Relationship Models.",
                    "Accountable Data Analytics Start with Accountable Data: The LiQuID Metadata Model.",
                    "Impact of Data Quality in Real-Time Big Data Systems.",
                    "A Toolbox for the Internet of Things - Easing the Setup of IoT Applications.",
                    "Characterization of Bottom-up Microservice Composition Evolution. An Approach Based on the Choreography of BPMN Fragments.",
                    "The Missing Concept? - A Short Postulation About the Need for Human Understanding and an Often Only Implicitly Given, Fundamental Aspect of Modeling Efforts.",
                    "Introducing GSO: A General Systemist Ontology.",
                    "Modeling Observational Crowdsourcing.",
                    "A Toolchain Transforming Descriptive Domain-Specific Models into Executable Browser-Based Applications.",
                    "MonstER Park - The Entity-Relationship-Diagram Learning Game.",
                    "IMAS: An Intelligent Medical Analysis System Based on Concept Graph.",
                    "Identifying Cohorts that Differ in their Behaviour: Tool Support.",
                    "Supporting the Generation of Data Narratives.",
                    "A Process Scripting and Execution Environment.",
                    "TOOL - A Modeling Observatory & Tool for Studying Individual Modeling Processes."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2020w",
                "sub_name": "Advances in Conceptual Modeling - ER 2020 Workshops CMAI, CMLS, CMOMM4FAIR, CoMoNoS, EmpER, Vienna, Austria, November 3-6, 2020, Proceedings.",
                "count": 21,
                "papers": [
                    "How to Induce Trust in Medical AI Systems.",
                    "Towards Automated Support for Conceptual Model Diagnosis and Repair.",
                    "Superimposition: Augmenting Machine Learning Outputs with Conceptual Models for Explainable AI.",
                    "Evaluating Tree Explanation Methods for Anomaly Reasoning: A Case Study of SHAP TreeExplainer and TreeInterpreter.",
                    "The Importance of the Temporal Dimension in Identifying Relevant Genomic Variants: A Case Study.",
                    "Towards the Generation of a Species-Independent Conceptual Schema of the Genome.",
                    "Conceptual Human Emotion Modeling (HEM).",
                    "Towards an Ontology for Tertiary Bioinformatics Research Process.",
                    "Using BioPAX-Parser (BiP) to Annotate Lists of Biological Entities with Pathway Data.",
                    "Relational Text-Type for Biological Sequences.",
                    "Mapping the Web Ontology Language to the OpenAPI Specification.",
                    "Evaluating FAIRness of Genomic Databases.",
                    "Reusable FAIR Implementation Profiles as Accelerators of FAIR Convergence.",
                    "Deimos: A Model-Based NoSQL Data Generation Language.",
                    "Managing Physical Schemas in MongoDB Stores.",
                    "JSON Schema Inference Approaches.",
                    "Empirical Evaluation of a New DEMO Modelling Tool that Facilitates Model Transformations.",
                    "Acquiring and Sharing the Monopoly of Legitimate Naming in Organizations, an Application in Conceptual Modeling.",
                    "Replicability and Reproducibility of a Schema Evolution Study in Embedded Databases.",
                    "Challenges in Checking JSON Schema Containment over Evolving Real-World Schemas.",
                    "Experimental Practices for Measuring the Intuitive Comprehensibility of Modeling Constructs: An Example Design."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "38th ER 2019",
        "info": "Salvador, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2019",
                "sub_name": "Conceptual Modeling - 38th International Conference, ER 2019, Salvador, Brazil, November 4-7, 2019, Proceedings.",
                "count": 46,
                "papers": [
                    "Data Management in the Era of Digitalization.",
                    "Keyword Search over RDF Datasets - (Extended Abstract).",
                    "OOC-O: A Reference Ontology on Object-Oriented Code.",
                    "Relations in Ontology-Driven Conceptual Modeling.",
                    "Capturing Multi-level Models in a Two-Level Formal Modeling Technique.",
                    "An SQL ^o Front-End for Non-monotonic Inheritance and De-referencing.",
                    "Modeling Data Lakes with Data Vault: Practical Experiences, Assessment, and Lessons Learned.",
                    "Requirements-Driven Visualizations for Big Data Analytics: A Model-Driven Approach.",
                    "Don't Tune Twice: Reusing Tuning Setups for SQL-on-Hadoop Queries.",
                    "A Graph Model for Taxi Ride Sharing Supported by Graph Databases.",
                    "Comprehensive Process Drift Detection with Visual Analytics.",
                    "A Probabilistic Approach to Event-Case Correlation for Process Mining.",
                    "DCR-KiPN a Hybrid Modeling Approach for Knowledge-Intensive Processes.",
                    "Exploring the Modeling of Declarative Processes Using a Hybrid Approach.",
                    "Negation in Relational Keyword Search.",
                    "Answering GPSJ Queries in a Polystore: A Dataspace-Based Approach.",
                    "Ontology-Schema Based Query by Example.",
                    "Query Rewriting for Continuously Evolving NoSQL Databases.",
                    "Relaxed Functional Dependency Discovery in Heterogeneous Data Lakes.",
                    "An Ontological Perspective for Database Tuning Heuristics.",
                    "SkipSJoin: A New Physical Design for Distributed Big Data Warehouses in Hadoop.",
                    "Learning k-Occurrence Regular Expressions from Positive and Negative Samples.",
                    "What Rocks Are Made of: Towards an Ontological Pattern for Material Constitution in the Geological Domain.",
                    "Role-Based Clustering for Collaborative Recommendations in Crowdsourcing System.",
                    "A Reference Conceptual Model for Virtual Network Function Online Marketplaces.",
                    "Intuitive Understanding of Domain-Specific Modeling Languages: Proposition and Application of an Evaluation Technique.",
                    "A Unifying Model of Legal Smart Contracts.",
                    "Formal Specification of Environmental Aspects of a Railway Interlocking System Based on a Conceptual Model.",
                    "From a Conceptual Model to a Knowledge Graph for Genomic Datasets.",
                    "Decision-Making in Knowledge-intensive Processes: The Case of Value Ascription and Goal Processing.",
                    "Conceptualization, Design, and Implementation of EconBPC - A Software Artifact for the Economic Analysis of Business Process Compliance.",
                    "DEMOS: A Participatory Design Approach for Democratic Empowerment of IS Users.",
                    "Finding Preferred Objects with Taxonomies.",
                    "Generic Negative Scenarios for the Specification of Collaborative Cyber-Physical Systems.",
                    "HIKE: A Step Beyond Data Exchange.",
                    "Unified Management of Multi-model Data - (Vision Paper).",
                    "Schema Validation and Evolution for Graph Databases.",
                    "Grounding for an Enterprise Computing Nomenclature Ontology.",
                    "Events as Entities in Ontology-Driven Conceptual Modeling.",
                    "Parallel Clique-Like Subgraph Counting and Listing.",
                    "Modal Schema Graphs for Graph Databases.",
                    "A Systematic Approach to Generate Diverse Instantiations for Conceptual Schemas.",
                    "Factors Affecting Comprehension of Contribution Links in Goal Models: An Experiment.",
                    "iStar-p: A Modelling Language for Requirements Prioritization.",
                    "On the Use of Requirement Patterns to Analyse Request for Proposal Documents.",
                    "iStar4RationalAgents: Modeling Requirements of Multi-agent Systems with Rational Agents."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2019w",
                "sub_name": "Advances in Conceptual Modeling - ER 2019 Workshops FAIR, MREBA, EmpER, MoBiD, OntoCom, and ER Doctoral Symposium Papers, Salvador, Brazil, November 4-7, 2019, Proceedings.",
                "count": 24,
                "papers": [
                    "Towards a Core Ontology for Scientific Research Activities.",
                    "Aligning DMBOK and Open Government with the FAIR Data Principles.",
                    "Exploring Reproducibility and FAIR Principles in Data Science Using Ecological Niche Modeling as a Case Study.",
                    "Realizing Traceability from the Business Model to Enterprise Architecture.",
                    "Creation of Multiple Conceptual Models from User Stories - A Natural Language Processing Approach.",
                    "Towards a Catalog of Goals for Strategic Coopetition.",
                    "Early Identification of Potential Distributed Ledger Technology Business Cases Using e3value Models.",
                    "Exploiting Conceptual Modeling for Searching Genomic Metadata: A Quantitative and Qualitative Empirical Study.",
                    "What Are Real JSON Schemas Like? - An Empirical Analysis of Structural Properties.",
                    "Getting to Win-Win in Inter-organizational Relationships Through Customer Segmentation.",
                    "Facilitating Data Exploration in Industry 4.0.",
                    "Towards Understanding Aggressive Behavior in Residential Care Facilities Using Process Mining.",
                    "On Complex Value Relations in Hive.",
                    "Data Capture and Analyses from Conversational Devices in the Homes of the Elderly.",
                    "GORO 2.0: Evolving an Ontology for Goal-Oriented Requirements Engineering.",
                    "Using Ontologies for Comparing Modeling Techniques: Experience Report.",
                    "Domain Ontology for Digital Marketplaces.",
                    "Exploring Semantics in Clinical Data Interoperability.",
                    "Framework for Construction and Incremental Maintenance of High-Quality Linked Data Mashup.",
                    "A Reference Architecture for Customizable Marketplaces.",
                    "Keyword Search Algorithm over Large RDF Datasets.",
                    "Representing the Filter Bubble: Towards a Model to Diversification in News.",
                    "The OntoOO-Method: An Ontology-Driven Conceptual Modeling Approach for Evolving the OO-Method.",
                    "Stochastic Models to Improve E-News Recommender Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2019f",
                "sub_name": "Proceedings of the ER Forum and Poster & Demos Session 2019 on Publishing Papers with CEUR-WS co-located with 38th International Conference on Conceptual Modeling (ER 2019), Salvador, Brazil, November 4, 2019.",
                "count": 17,
                "papers": [
                    "Towards Checking Dynamic Controllability of Processes with Temporal Loops.",
                    "A Conceptual Vision Toward the Management of Machine Learning Models.",
                    "Integration and Analysis of Clinical and Genomic Data of Neuroblastoma applying Conceptual Modeling.",
                    "LabDER - Relational Database Virtual Learning Environment.",
                    "Using the Fractal Enterprise Model for Inter-organizational Business Processes.",
                    "Towards Goal Modeling and Analysis for Networks of Collaborative Cyber-Physical Systems.",
                    "Inferring Structure for Design: An Inductive Approach to Ontology Generation.",
                    "Exploring the Concept of \"Tiers-Lieu\" for Information Services: The Value of Conceptual Modeling.",
                    "Comprehensive Process Drift Analysis with the Visual Drift Detection Tool.",
                    "chor-js: A Modeling Framework for BPMN 2.0 Choreography Diagrams.",
                    "DejaVu: Recycling Tuning Setups in Hive Query Compilation.",
                    "ER4ML: An ER Modeling Tool to Represent Data Transformations in Data Science.",
                    "Crumbs4Cube: Turning Breadcrumbs into Smart Enriched Data Cubes.",
                    "Toward Creating a General Ontology for Research Validity.",
                    "Let's Automate! Making Use of a Learning Ontology for Conceptual Data Modelling.",
                    "OntoVal: A Tool for Ontology Evaluation by Domain Specialists.",
                    "Virtualized Ontology Query By Example."
                ]
            },
            {
                "sub_name_abbr": "conf/istar/2019",
                "sub_name": "Proceedings of the 12th International i* Workshop co-located with 38th International Conference on Conceptual Modeling (ER 2019), Salvador, Brazil, November 4th, 2019.",
                "count": 16,
                "papers": [
                    "Using GORO to Provide Ontological Interpretations of iStar Constructs.",
                    "iStar2.0-OWL: an Operational Ontology for iStar.",
                    "Algebraic Definition of iStar2.0 Models.",
                    "Using i* to Reason about Employee Behavior on Public Social Media.",
                    "On the Meaning and Use of Contribution Links.",
                    "Addressing Symbol Redundancy Representations in iStar Extensions.",
                    "A Critical View Over iStar Visual Constructs.",
                    "Using the iStar Framework for Planning and Monitoring Sprints in Scrum Projects: An Experience Report.",
                    "Towards the Analysis of Components Interoperability by Means of i.",
                    "Analyzing Psychological Goals in Gamified Applications Using i.",
                    "Challenges in Modeling Non-Functional Requirements Collaboratively.",
                    "Aplying Modelling Techniques for the Development of a Strategic Plan in a Large Corporation.",
                    "A Metamodel for iStar-p: Requirements Prioritization with Goal Models.",
                    "The JGOOSE Tool.",
                    "iStar for Safety-Critical Systems.",
                    "Creating Modelling Tools for i* Language Extensions."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "37th ER 2018",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2018",
                "sub_name": "Conceptual Modeling - 37th International Conference, ER 2018, Xi'an, China, October 22-25, 2018, Proceedings.",
                "count": 46,
                "papers": [
                    "Towards Conceptual Models for Machine Learning Computations.",
                    "Recent Trends of Big Data Platforms and Applications.",
                    "Conceptual Modeling on Tencent's Distributed Database Systems.",
                    "A Reference Framework for Conceptual Modeling.",
                    "Empirical Comparison of Model Consistency Between Ontology-Driven Conceptual Modeling and Traditional Conceptual Modeling.",
                    "A Conceptual Framework for Supporting Deep Exploration of Business Process Behavior.",
                    "An In-Depth Benchmarking Study on Bill of Materials for High-End Manufacturing.",
                    "Towards Data Visualisation Based on Conceptual Modelling.",
                    "Ontological Deep Data Cleaning.",
                    "Automatic Generation of Security Compliant (Virtual) Model Views.",
                    "The Common Ontology of Value and Risk.",
                    "Endurant Types in Ontology-Driven Conceptual Modeling: Towards OntoUML 2.0.",
                    "Reification and Truthmaking Patterns.",
                    "Conceptual Modeling of Legal Relations.",
                    "Inferring Deterministic Regular Expression with Counting.",
                    "Towards Quality Analysis for Document Oriented Bases.",
                    "A Holistic Approach for Soundness Verification of Decision-Aware Process Models.",
                    "Conceptual Modeling of Processes and Data: Connecting Different Perspectives.",
                    "Interactive Data-Driven Process Model Construction.",
                    "Efficient Multi-range Query Processing on Trajectories.",
                    "A Volunteer Design Methodology of Data Warehouses.",
                    "Using a Conceptual Model to Transform Road Networks from OpenStreetMap to a Graph Database.",
                    "Modeling Conceptual Characteristics of Virtual Machines for CPU Utilization Prediction.",
                    "Towards the Design of a Scalable Business Process Management System Architecture in the Cloud.",
                    "Towards an Ontology of Software Defects, Errors and Failures.",
                    "TemporalEMF: A Temporal Metamodeling Framework.",
                    "A Semantic Framework for Designing Temporal SQL Databases.",
                    "Nested Schema Mappings for Integrating JSON.",
                    "Multi-level Conceptual Modeling: From a Formal Theory to a Well-Founded Language.",
                    "Increasing the Semantic Transparency of the KAOS Goal Model Concrete Syntax.",
                    "Using Contextual Goal Models for Constructing Situational Methods.",
                    "Multi-perspective Comparison of Business Process Variants Based on Event Logs.",
                    "Managing Polyglot Systems Metadata with Hypergraphs.",
                    "Renormalization of NoSQL Database Schemas.",
                    "Modeling Strategies for Storing Data in Distributed Heterogeneous NoSQL Databases.",
                    "How the Conceptual Modelling Improves the Security on Document Databases.",
                    "Leveraging the Dynamic Changes from Items to Improve Recommendation.",
                    "Mining Rules with Constants from Large Scale Knowledge Bases.",
                    "Concepts in Quality Assessment for Machine Learning - From Test Data to Arguments.",
                    "Inductive Discovery by Machine Learning for Identification of Structural Models.",
                    "Realtime Event Summarization from Tweets with Inconsistency Detection.",
                    "CRAN: A Hybrid CNN-RNN Attention-Based Model for Text Classification.",
                    "Learning Restricted Regular Expressions with Interleaving from XML Data.",
                    "A Method to Identify Relevant Genome Data: Conceptual Modeling for the Medicine of Precision.",
                    "Experiences Applying \\hbox e^3 Value Modeling in a Cross-Company Study.",
                    "Event-Context-Feedback Control Through Bridge Workflows for Smart Solutions."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2018w",
                "sub_name": "Advances in Conceptual Modeling - ER 2018 Workshops Emp-ER, MoBiD, MREBA, QMMQ, SCME, Xi'an, China, October 22-25, 2018, Proceedings.",
                "count": 37,
                "papers": [
                    "Implementation of Bus Value-Added Service Platform via Crowdsourcing Incentive.",
                    "SEED V3: Entity-Oriented Exploratory Search in Knowledge Graphs on Tablets.",
                    "MobiDis: Relationship Discovery of Mobile Users from Spatial-Temporal Trajectories.",
                    "Crowd-Type: A Crowdsourcing-Based Tool for Type Completion in Knowledge Bases.",
                    "Attribute Value Matching by Maximizing Benefit.",
                    "Towards Real-Time Analysis of ID-Associated Data.",
                    "Phenomenological Ontology Guided Conceptual Modeling for Enterprise Information Systems.",
                    "Using Clustering Labels to Supervise Mashup Service Classification.",
                    "A Multi-Constrained Temporal Path Query System.",
                    "ACCDS: A Criminal Community Detection System Based on Evolving Social Graphs.",
                    "A Prototype for Generating Meaningful Layout of iStar Models.",
                    "MDBF: A Tool for Monitoring Database Files.",
                    "CusFinder: An Interactive Customer Ranking Query System.",
                    "Multiple Data Quality Evaluation and Data Cleaning on Imprecise Temporal Data.",
                    "An Active Workflow Method for Entity-Oriented Data Collection.",
                    "Visual Non-verbal Social Cues Data Modeling.",
                    "Dependency-Based Query/View Synchronization upon Schema Evolutions.",
                    "Knowledge Graph Embedding via Relation Paths and Dynamic Mapping Matrix.",
                    "Expressiveness of Temporal Constraints for Process Models.",
                    "Thoroughly Modern Accounting: Shifting to a De Re Conceptual Pattern for Debits and Credits.",
                    "Evaluation of the Cognitive Effectiveness of the CORAS Modelling Language.",
                    "Teaching Physical Database Design.",
                    "The Simple Enterprise Architecture Framework: Giving Alignment to IT Decisions.",
                    "Towards an Empirical Evaluation of Imperative and Declarative Process Mining.",
                    "Artifact Sampling in Experimental Conceptual Modeling Research.",
                    "Design of an Empirical Study for Evaluating an Automatic Layout Tool.",
                    "Representing and Analyzing Enterprise Capabilities as Specialized Actors - A BPM Example.",
                    "An Approach Toward the Economic Assessment of Business Process Compliance.",
                    "Visual Representation of the TOGAF Requirements Management Process.",
                    "Technology-Transfer Requirements Engineering (TTRE) - on the Value of Conceptualizing Alternatives.",
                    "Conceptual Modeling to Support Pivoting - An Example from Twitter.",
                    "SQL or NoSQL? Which Is the Best Choice for Storing Big Spatio-Temporal Climate Data?",
                    "UDBMS: Road to Unification for Multi-model Data Management.",
                    "Extracting Conflict Models from Interaction Traces in Virtual Collaborative Work.",
                    "Data Quality Evaluation in Document Oriented Data Stores.",
                    "Genomic Data Management in Big Data Environments: The Colorectal Cancer Case.",
                    "Domain Specific Models as System Links."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "36th ER 2017",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2017",
                "sub_name": "Conceptual Modeling - 36th International Conference, ER 2017, Valencia, Spain, November 6-9, 2017, Proceedings.",
                "count": 39,
                "papers": [
                    "The Universal Ontology: A Vision for Conceptual Modeling and the Semantic Web (Invited Paper).",
                    "CE-SIB: A Modelling Method Plug-in for Managing Standards in Enterprise Architectures.",
                    "A Catalogue of Reusable Context Model Elements Based on the i* Framework.",
                    "Modelling Processes with Time-Dependent Control Structures.",
                    "Towards Rearchitecting Meta-Models into Multi-level Models.",
                    "Mining Goal Refinement Patterns: Distilling Know-How from Data.",
                    "Goal-Oriented Regulatory Intelligence: How Can Watson Analytics Help?",
                    "An Alternative Approach to Metainformation Conceptualisation and Use.",
                    "Schema Evolution and Foreign Keys: Birth, Eviction, Change and Absence.",
                    "Conceptual Modelling of Autonomous Multi-cloud Interaction with Reflective Semantics.",
                    "Querying Graph Databases: What Do Graph Patterns Mean?",
                    "Scaffolding Relational Schemas and APIs from Content in Web Mockups.",
                    "SourceVote: Fusing Multi-valued Data via Inter-source Agreements.",
                    "Level-Aware Ecosystem Transformations for Industrial Lifecycle Interoperability.",
                    "Conceptual Modeling: Enhancement Through Semiotics.",
                    "Towards an Ontology for Privacy Requirements via a Systematic Literature Review.",
                    "What Happens to Intentional Concepts in Requirements Engineering if Intentional States Cannot Be Known?",
                    "Goal Models for Acceptance Requirements Analysis and Gamification Design.",
                    "Modeling Regulatory Ambiguities for Requirements Analysis.",
                    "An Experimental Evaluation of the Understanding of Safety Compliance Needs with Models.",
                    "Cardinality Constraints with Probabilistic Intervals.",
                    "Contextual Keys.",
                    "A Comprehensive Formal Theory for Multi-level Conceptual Modeling.",
                    "Alignment-Based Trace Clustering.",
                    "The Conceptual Modelling of Dynamic Teams for Autonomous Systems.",
                    "Conceptual Modeling for Genomics: Building an Integrated Repository of Open Data.",
                    "Towards Thinking Manufacturing and Design Together: An Aeronautical Case Study.",
                    "OCLUNIV: Expressive UML/OCL Conceptual Schemas for Finite Reasoning.",
                    "Goal Orchestrations: Modelling and Mining Flexible Business Processes.",
                    "Configurable and Executable Task Structures Supporting Knowledge-Intensive Processes.",
                    "Various Notions of Soundness for Decision-Aware Business Processes.",
                    "Data, Control, and Process Flow Modeling for IoT Driven Smart Solutions.",
                    "Determining the Preferred Representation of Temporal Constraints in Conceptual Models.",
                    "User Perception of Numeric Contribution Semantics for Goal Models: An Exploratory Experiment.",
                    "On the Impact of the Model-Based Representation of Inconsistencies to Manual Reviews - Results from a Controlled Experiment.",
                    "On the Semantics of Ongoing and Future Occurrence Identifiers.",
                    "Ontological Evolutionary Encoding to Bridge Machine Learning and Conceptual Models: Approach and Industrial Evaluation.",
                    "The OntoREA© Accounting and Finance Model: Ontological Conceptualization of the Accounting and Finance Domain.",
                    "Teleologies: Objects, Actions and Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2017w",
                "sub_name": "Advances in Conceptual Modeling - ER 2017 Workshops AHA, MoBiD, MREBA, OntoCom, and QMMQ, Valencia, Spain, November 6-9, 2017, Proceedings.",
                "count": 22,
                "papers": [
                    "Behavior Ontology to Model Collective Behavior of Emergency Medical Systems.",
                    "Data Modelling for Dynamic Monitoring of Vital Signs: Challenges and Perspectives.",
                    "Towards Care Systems Using Model-Driven Adaptation and Monitoring of Autonomous Multi-clouds.",
                    "Clustering Event Traces by Behavioral Similarity.",
                    "Goal-Based Selection of Visual Representations for Big Data Analytics.",
                    "A Four V's Design Approach of NoSQL Graph Databases.",
                    "Towards Efficient and Informative Omni-Channel Customer Relationship Management.",
                    "Stream Clustering of Chat Messages with Applications to Twitch Streams.",
                    "Towards Consistent Demarcation of Enterprise Design Domains.",
                    "Goal-Oriented Requirements Analysis Meets a Creativity Technique.",
                    "Towards an Ontology for Strategic Decision Making: The Case of Quality in Rapid Software Development Projects.",
                    "Detecting Bad Smells of Refinement in Goal-Oriented Requirements Analysis.",
                    "Requirements Engineering for Data Warehouses (RE4DW): From Strategic Goals to Multidimensional Model.",
                    "Towards Formal Strategy Analysis with Goal Models and Semantic Web Technologies.",
                    "Assisting Process Modeling by Identifying Business Process Elements in Natural Language Texts.",
                    "Using Multidimensional Concepts for Detecting Problematic Sub-KPIs in Analysis Systems.",
                    "Automatically Annotating Business Process Models with Ontology Concepts at Design-Time.",
                    "OPL-ML: A Modeling Language for Representing Ontology Pattern Languages.",
                    "Evaluating Quality Issues in BPMN Models by Extending a Technical Debt Software Platform.",
                    "Utility-Driven Data Management for Data-Intensive Applications in Fog Environments.",
                    "Assessing the Positional Planimetric Accuracy of DBpedia Georeferenced Resources.",
                    "Assessing the Completeness Evolution of DBpedia: A Case Study."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2017f",
                "sub_name": "Proceedings of the ER Forum 2017 and the ER 2017 Demo Track co-located with the 36th International Conference on Conceptual Modelling (ER 2017), Valencia, Spain, - November 6-9, 2017.",
                "count": 28,
                "papers": [
                    "The Role of Tangibility and Iconicity in Collaborative Modelling Tasks.",
                    "Reusing Conceptual Models: Language and Extensible Compiler.",
                    "Beyond Participatory Design: Towards a Model for Teaching Seniors Application Design.",
                    "Towards a Model-based Collaborative Framework for Calibrating Database Cost Models.",
                    "Measuring Maintainability of DPRA Models: A Pragmatic Approach.",
                    "Exploring the Visualization of Schemas for Aggregate-Oriented NoSQL Databases.",
                    "Keyword Search over Federated RDF Datasets.",
                    "On the Automated Transformation of Domain Models into Tabular Datasets.",
                    "TARS: An Array Model with Rich Semantics for Multidimensional Data.",
                    "Metamodeling Lightweight Data Compression Algorithms and its Application Scenarios.",
                    "Attribute Lattices: A Schema-free Unified Framework for Data Semantics.",
                    "A Multi-level Approach for Supporting Configurations: A New Perspective on Software Product Line Engineering.",
                    "Domain-Specific Data Management for Platform-Independent Process Governance.",
                    "TracyML - A Modeling Language for Social Impacts of Product Life Cycles.",
                    "A User Model to Support User Interface Navigation Adaptation Patterns in Web Applications.",
                    "Context Modeling for Active Assistance.",
                    "Domain Modeling for the Semantic Web: Assessing the Pragmatics of Ontologies.",
                    "An Improvement on Data Interoperability with Large-Scale Conceptual Model and Its Application in Industry.",
                    "Institution Aware Conceptual Modelling.",
                    "Using ALF within the CoSTest process for Validation of UML-based Conceptual Schemas.",
                    "On the Influence of Models-to-Natural-Language Transformation in Traceability Link Recovery among Requirements and Conceptual Models.",
                    "A Metamodel for GDPR-based Privacy Level Agreements.",
                    "Automatic Classification to Matching Patterns for Process Model Matching Evaluation.",
                    "A Comprehensive Reference Model for Blockchain-based Distributed Ledger Technology.",
                    "The Construction and Interrogation of Actor Based Simulation Histories.",
                    "[εm] - Process Analysis using a Meta Modeling Tool.",
                    "Exploiting IBM Watson Analytics to Visualize and Analyze Data from Goal-Based Conceptual Models.",
                    "Semantic Consistency in Enterprise Models - Through Seamless Modelling and Execution Support."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2017scme",
                "sub_name": "Proceedings of the 5th Symposium on Conceptual Modeling Education and the 2nd International iStar Teaching Workshop co-located with the 36th International Conference on Conceptual Modeling (ER 2017), Valencia, Spain, November 6-9, 2017.",
                "count": 6,
                "papers": [
                    "Reusing Cases for Teaching Enterprise Modelling - Feasibility Study and Reality Check.",
                    "A Model-based Approach to Gamify the Learning of Modeling.",
                    "Visualizing Code Variabilities for Supporting Reuse Decisions.",
                    "Teaching Goal Modeling to Engineering Professionals - An Experience Report.",
                    "Using Conceptual Models in Research Methods Courses: An experience using iStar 2.0.",
                    "Using Goal Models to Visualize and Prioritize Requirements for Learning Management Systems."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "35th ER 2016",
        "info": "Gifu, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2016",
                "sub_name": "Conceptual Modeling - 35th International Conference, ER 2016, Gifu, Japan, November 14-17, 2016, Proceedings.",
                "count": 43,
                "papers": [
                    "Improving the Correctness of Some Database Research Using ORA-Semantics.",
                    "Conceptual Modeling of Life: Beyond the Homo Sapiens.",
                    "A Conceptual Modeling Framework for Business Analytics.",
                    "NOSQL Design for Analytical Workloads: Variability Matters.",
                    "Translating Bayesian Networks into Entity Relationship Models.",
                    "Key Performance Indicator Elicitation and Selection Through Conceptual Modelling.",
                    "Insights on the Use and Application of Ontology and Conceptual Modeling Languages in Ontology-Driven Conceptual Modeling.",
                    "An Ontological Approach for Identifying Software Variants: Specialization and Template Instantiation.",
                    "The Role of Ontology Design Patterns in Linked Data Projects.",
                    "Bridging the IT and OT Worlds Using an Extensible Modeling Language.",
                    "Possibilistic Cardinality Constraints and Functional Dependencies.",
                    "Exploring Views for Goal-Oriented Requirements Comprehension.",
                    "Keys with Probabilistic Intervals.",
                    "On Referring Expressions in Information Systems Derived from Conceptual Modelling.",
                    "DeepTelos: Multi-level Modeling with Most General Instances.",
                    "Pragmatic Quality Assessment for Automatically Extracted Data.",
                    "UnifiedOCL: Achieving System-Wide Constraint Representations.",
                    "Building Large Models of Law with NómosT.",
                    "An Efficient and Simple Graph Model for Scientific Article Cold Start Recommendation.",
                    "Keyword Queries over the Deep Web.",
                    "Sensor Observation Service Semantic Mediation: Generic Wrappers for In-Situ and Remote Devices.",
                    "Probabilistic Evaluation of Process Model Matching Techniques.",
                    "Context-Aware Workflow Execution Engine for E-Contract Enactment.",
                    "Annotating and Mining for Effects of Processes.",
                    "Automated Discovery of Structured Process Models: Discover Structured vs. Discover and Structure.",
                    "Detecting Drift from Event Streams of Unpredictable Business Processes.",
                    "Modeling Structured and Unstructured Processes: An Empirical Evaluation.",
                    "MetaScience: An Holistic Approach for Research Modeling.",
                    "Comparison and Synergy Between Fact-Orientation and Relation Extraction for Domain Model Generation in Regulatory Compliance.",
                    "Development of a Modeling Language for Capability Driven Development: Experiences from Meta-modeling.",
                    "Applying Conceptual Modeling to Better Understand the Human Genome.",
                    "Data Analytics: From Conceptual Modelling to Logical Representation.",
                    "UMLtoGraphDB: Mapping Conceptual Schemas to Graph Databases.",
                    "Facilitating Data-Metadata Transformation by Domain Specialists in a Web-Based Information System Using Simple Correspondences.",
                    "Visualizing User Story Requirements at Multiple Granularity Levels via Semantic Relatedness.",
                    "User Progress Modelling in Counselling Systems: An Application to an Adaptive Virtual Coach.",
                    "Stepwise Refinement of Software Development Problem Analysis.",
                    "Tailoring User Interfaces to Include Gesture-Based Interaction with gestUI.",
                    "Unlocking Visual Understanding: Towards Effective Keys for Diagrams.",
                    "MEMO GoalML: A Context-Enriched Modeling Language to Support Reflective Organizational Goal Planning and Decision Processes.",
                    "Can Goal Reasoning Techniques Be Used for Strategic Decision-Making?",
                    "Requirements Evolution and Evolution Requirements with Constrained Goal Models.",
                    "RationalGRL: A Framework for Rationalizing Goal Models Using Argument Diagrams."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2016w",
                "sub_name": "Advances in Conceptual Modeling - ER 2016 Workshops, AHA, MoBiD, MORE-BI, MReBA, QMMQ, SCME, and WM2SP, Gifu, Japan, November 14-17, 2016, Proceedings.",
                "count": 21,
                "papers": [
                    "A Capability-Driven Development Approach for Requirements and Business Process Modeling.",
                    "Grounding for Ontological Architecture Quality: Metaphysical Choices.",
                    "A Model-Driven Engineering Approach for the Well-Being of Ageing People.",
                    "The Cultural Background and Support for Smart Web Information Systems.",
                    "Walmart Online Grocery Personalization: Behavioral Insights and Basket Recommendations.",
                    "Searching for Optimal Configurations Within Large-Scale Models: A Cloud Computing Domain.",
                    "A Link-Density-Based Algorithm for Finding Communities in Social Networks.",
                    "Searching for Patterns in Sequential Data: Functionality and Performance Assessment of Commercial and Open-Source Systems.",
                    "Analysis of Natural and Technogenic Safety of the Krasnoyarsk Region Based on Data Mining Techniques.",
                    "From Design to Visualization of Spatial OLAP Applications: A First Prototyping Methodology.",
                    "Bridging User Story Sets with the Use Case Model.",
                    "A Study on Tangible Participative Enterprise Modelling.",
                    "Bridging the Requirements Engineering and Business Analysis Toward a Unified Knowledge Framework.",
                    "An Exploratory Analysis on the Comprehension of 3D and 4D Ontology-Driven Conceptual Models.",
                    "Data Quality Problems When Integrating Genomic Information.",
                    "The Design of a Core Value Ontology Using Ontology Patterns.",
                    "YASQLT - Yet Another SQL Tutor - A Pragmatic Approach.",
                    "Human Factors in the Adoption of Model-Driven Engineering: An Educator's Perspective.",
                    "Learning Pros and Cons of Model-Driven Development in a Practical Teaching Experience.",
                    "Towards Provable Security of Dynamic Source Routing Protocol and Its Applications.",
                    "A Tool for Analyzing Variability Based on Functional Requirements and Testing Artifacts."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "34th ER 2015",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2015",
                "sub_name": "Conceptual Modeling - 34th International Conference, ER 2015, Stockholm, Sweden, October 19-22, 2015, Proceedings.",
                "count": 47,
                "papers": [
                    "Why Philosophize; Why not Just Model?",
                    "Methodologies for Semi-automated Conceptual Data Modeling from Requirements.",
                    "Aligning Business Goals and Risks in OSS Adoption.",
                    "Pragmatic Requirements for Adaptive Systems: A Goal-Driven Modeling and Analysis Approach.",
                    "Stress Testing Strategic Goals with SWOT Analysis.",
                    "A Method to Align Goals and Business Processes.",
                    "Detecting the Effects of Changes on the Compliance of Cross-Organizational Business Processes.",
                    "Enhancing Aspect-Oriented Business Process Modeling with Declarative Rules.",
                    "Extending the Foundations of Ontology-Based Conceptual Modeling with a Multi-level Theory.",
                    "Logical Design Patterns for Information System Development Problems.",
                    "A Middle-Level Ontology for Context Modelling.",
                    "An Ontology Design Pattern to Represent False-Results.",
                    "Ontology Engineering by Combining Ontology Patterns.",
                    "Towards a Service Ontology Pattern Language.",
                    "Incremental Checking of OCL Constraints with Aggregates Through SQL.",
                    "Probabilistic Cardinality Constraints.",
                    "SQL Data Profiling of Foreign Keys.",
                    "From Web Tables to Concepts: A Semantic Normalization Approach.",
                    "Toward RDF Normalization.",
                    "Design Dimensions for Business Process Architecture.",
                    "A Conceptual Framework for Large-scale Ecosystem Interoperability.",
                    "Flexible Data Management across XML and Relational Models: A Semantic Approach.",
                    "EMF Views: A View Mechanism for Integrating Heterogeneous Models.",
                    "Gitana: A SQL-Based Git Repository Inspector.",
                    "Near Real-Time Collaborative Conceptual Modeling on the Web.",
                    "Dynamic Capabilities for Sustainable Enterprise IT - A Modeling Framework.",
                    "A Working Model for Uncertain Data with Lineage.",
                    "Capturing Variability in Adaptation Spaces: A Three-Peaks Approach.",
                    "Taming Software Variability: Ontological Foundations of Variability Mechanisms.",
                    "Personalized Knowledge Visualization in Twitter.",
                    "A Multi-dimensional Approach to Crowd-Consensus Modeling and Evaluation.",
                    "Principles for Modeling User-Generated Content.",
                    "Ranking Friendly Result Composition for XML Keyword Search.",
                    "How is Life for a Table in an Evolving Relational Schema? Birth, Death and Everything in Between.",
                    "Inferring Versioned Schemas from NoSQL Databases and Its Applications.",
                    "Schema Discovery in RDF Data Sources.",
                    "Learning Relationships Between the Business Layer and the Application Layer in ArchiMate Models.",
                    "Mining Process Task Post-Conditions.",
                    "Conceptual Modeling for Financial Investment with Text Mining.",
                    "Breaking the Recursivity: Towards a Model to Analyse Expert Finders.",
                    "Static Weaving in Aspect Oriented Business Process Management.",
                    "Tangible Modelling to Elicit Domain Knowledge: An Experiment and Focus Group.",
                    "The REA Accounting Model: Enhancing Understandability and Applicability.",
                    "A Schema-Less Data Model for the Web.",
                    "An Analysis and Characterisation of Publicly Available Conceptual Models.",
                    "An Extended ER Algebra to Support Semantically Richer Queries in ERDBMS.",
                    "Enhancing Entity-Relationship Schemata for Conceptual Database Structure Models."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2015w",
                "sub_name": "Advances in Conceptual Modeling - ER 2015 Workshops, AHA, CMS, EMoV, MoBiD, MORE-BI, MReBA, QMMQ, and SCME Stockholm, Sweden, October 19-22, 2015, Proceedings.",
                "count": 34,
                "papers": [
                    "PersonLink: An Ontology Representing Family Relationships for the CAPTAIN MEMO Memory Prosthesis.",
                    "A Semantic Model for Proactive Home Care Systems.",
                    "Understanding Care Work and the Coordination of Care Process Conglomerations.",
                    "A Method to Analyze, Diagnose and Propose Innovations for Complex Ecosystems: The InnoServ Project.",
                    "A Conceptual Model for Services.",
                    "A Use and Exchange Perspective for Explicating the Notion of Service.",
                    "Integration and Exchangeability of External Security-Critical Web Services in a Model-Driven Approach.",
                    "Providing Ontology-Based Privacy-Aware Data Access Through Web Services.",
                    "Production Process Monitoring Using Model-Driven Event Processing Networks.",
                    "A Study of Different Visualizations for Visualizing Differences in Process Models.",
                    "Bitemporal Support for Business Process Contingency Management.",
                    "Towards an Extended Metamodel of Event-Driven Process Chains to Model Complex Event Patterns.",
                    "Models for NoSQL Databases: A Contradiction?",
                    "A Food Recommendation System Based on Semantic Annotations and Reference Prescriptions.",
                    "Obtaining Key Performance Indicators by Using Data Mining Techniques.",
                    "Big Data Normalization for Massively Parallel Processing Databases.",
                    "I8K|DQ-BigData: I8K Architecture Extension for Data Quality in Big Data.",
                    "Research on Big Data - Characterizing the Field and Its Dimensions.",
                    "A First Framework for Top-K Cubes Queries.",
                    "Model-Based Requirements Engineering for Data Warehouses: From Multidimensional Modelling to KPI Monitoring.",
                    "Towards Ontology-Driven RDF Analytics.",
                    "Invited Keynote: Facilitation and Management of Modeling Projects: Experiences and Outlook.",
                    "Towards a Socio-Institutional Ontology for Conceptual Modelling of Information Systems.",
                    "Modeling and Utilizing Security Knowledge for Eliciting Security Requirements.",
                    "Towards the Derivation of Secure Business Process Designs.",
                    "Goal-Oriented Requirement Engineering Support for Business Continuity Planning.",
                    "Data Currency Assessment Through Data Mining.",
                    "Evaluating the Gap Between an RDF Dataset and Its Schema.",
                    "Modeling Stories for Conceptual Model Assessment.",
                    "Improving Model Quality Through Foundational Ontologies: Two Contrasting Approaches to the Representation of Roles.",
                    "Challenges in Teaching Conceptual Modeling for Systems Architecting.",
                    "Effects of Simulation on Novices' Understanding of the Concept of Inheritance in Conceptual Modeling.",
                    "Reuse of Simulated Cases in Teaching Enterprise Modelling.",
                    "The Importance of Teaching Systematic Analysis for Conceptual Models: An Experience Report."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "33rd ER 2014",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2014",
                "sub_name": "Conceptual Modeling - 33rd International Conference, ER 2014, Atlanta, GA, USA, October 27-29, 2014. Proceedings.",
                "count": 40,
                "papers": [
                    "A Semiotic Approach to Conceptual Modelling.",
                    "Ontological Patterns, Anti-Patterns and Pattern Languages for Next-Generation Conceptual Modeling.",
                    "A Computer-Guided Approach to Website Schema.org Design.",
                    "On Designing Archiving Policies for Evolving RDF Datasets on the Web.",
                    "Ontology-Based Spelling Suggestion for RDF Keyword Search.",
                    "Schema-Independence in XML Keyword Search.",
                    "Mapping Heterogeneous XML Document Collections to Relational Databases.",
                    "MKStream: An Efficient Algorithm for Processing Multiple Keyword Queries over XML Streams.",
                    "Cardinality Constraints for Uncertain Data.",
                    "TopCrowd - Efficient Crowd-enabled Top-k Retrieval on Incomplete Data.",
                    "Web Services Composition in the Presence of Uncertainty.",
                    "Domain Ontology As Conceptual Model for Big Data Management: Application in Biomedical Informatics.",
                    "Network Analytics ER Model - Towards a Conceptual View of Network Analytics.",
                    "Model-Driven Design of Graph Databases.",
                    "Utility-Friendly Heterogenous Generalization in Privacy Preserving Data Publishing.",
                    "From Conceptual Models to Safety Assurance.",
                    "A New Approach for N-ary Relationships in Object Databases.",
                    "Database Design for NoSQL Systems.",
                    "Fixing Up Non-executable Operations in UML/OCL Conceptual Schemas.",
                    "Generic Data Manipulation in a Mixed Global/Local Conceptual Model.",
                    "Evaluating Modeling Languages: An Example from the Requirements Domain.",
                    "Nòmos 3: Legal Compliance of Roles and Requirements.",
                    "Towards an XBRL Ontology Extension for Management Accounting.",
                    "Representing Hierarchical Relationships in INM.",
                    "Providing Foundation for User Feedback Concepts by Extending a Communication Ontology.",
                    "Towards a Conceptual Framework and Metamodel for Context-Aware Personal Cross-Media Information Management Systems.",
                    "Software as a Social Artifact: A Management and Evolution Perspective.",
                    "Modelling Risks in Open Source Software Component Selection.",
                    "Modelling and Applying OSS Adoption Strategies.",
                    "Detection, Simulation and Elimination of Semantic Anti-patterns in Ontology-Driven Conceptual Models.",
                    "Recall of Concepts and Relationships Learned by Conceptual Models: The Impact of Narratives, General-Purpose, and Pattern-Based Conceptual Grammars.",
                    "Visual Maps for Data-Intensive Ecosystems.",
                    "A Framework for a Business Intelligence-Enabled Adaptive Enterprise Architecture.",
                    "Modeling Organizational Alignment.",
                    "Compliance with Multiple Regulations.",
                    "CSRML4BI: A Goal-Oriented Requirements Approach for Collaborative Business Intelligence.",
                    "Embracing Pragmatics.",
                    "From Needs to Services: Delivering Personalized Water Assurance Services in Urban Africa.",
                    "Modeling Claim-Making Process in Democratic Deliberation.",
                    "Creating Quantitative Goal Models: Governmental Experience."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2014w",
                "sub_name": "Advances in Conceptual Modeling - ER 2014 Workshops, ENMO, MoBiD, MReBA, QMMQ, SeCoGIS, WISM, and ER Demos, Atlanta, GA, USA, October 27-29, 2014. Proceedings.",
                "count": 33,
                "papers": [
                    "Model Based Enterprise Simulation and Analysis - A Pragmatic Approach Reducing the Burden on Experts.",
                    "3D vs. 4D Ontologies in Enterprise Modeling.",
                    "Applications of Ontologies in Enterprise Modelling: A Systematic Mapping Study.",
                    "A Semi-clustering Scheme for High Performance PageRank on Hadoop.",
                    "Energy Consumption Prediction by Using an Integrated Multidimensional Modeling Approach and Data Mining Techniques with Big Data.",
                    "Benchmarking Performance for Migrating a Relational Application to a Parallel Implementation.",
                    "A Data Quality in Use Model for Big Data - (Position Paper).",
                    "Business Intelligence and Big Data in the Cloud: Opportunities for Design-Science Researchers.",
                    "From Business Intelligence to Semantic Data Stream Management.",
                    "Understandability of Goal Concepts by Requirements Engineering Experts.",
                    "On the Definition of Self-service Systems.",
                    "Semantic Monitoring and Compensation in Socio-technical Processes.",
                    "Modeling Regulatory Compliance in Requirements Engineering.",
                    "Automated Completeness Check in KAOS.",
                    "Practical Goal Modeling for Enterprise Change Context: A Problem Statement.",
                    "A Superstructure for Models of Quality.",
                    "A Quality Management Workflow Proposal for a Biodiversity Data Repository.",
                    "Applying a Data Quality Model to Experiments in Software Engineering.",
                    "Towards Indicators for HCI Quality Evaluation Support.",
                    "Towards a Qualitative Representation of Movement.",
                    "Lagrangian Xgraphs: A Logical Data-Model for Spatio-Temporal Network Data: A Summary.",
                    "Efficient Reverse kNN Query Algorithm on Road Network Distances Using Partitioned Subgraphs.",
                    "Using the Model-Driven Architecture Approach for Geospatial Databases Design of Ecological Niches and Potential Distributions.",
                    "OMT-G Designer: A Web Tool for Modeling Geographic Databases in OMT-G.",
                    "A Model of Aggregate Operations for Data Analytics over Spatiotemporal Objects.",
                    "Natural Language Processing for Linking Online News and Open Government Data.",
                    "Enterprise Linked Data: A Systematic Mapping Study.",
                    "Ontology Population from Web Product Information.",
                    "Service Adaptability Analysis across Semantics and Behavior Levels Based on Model Transformation.",
                    "Prioritizing Consumer-Centric NFPs in Service Selection.",
                    "Personal eHealth Knowledge Spaces though Models, Agents and Semantics.",
                    "Lightweight Semantic Prototyper for Conceptual Modeling.",
                    "SQTime: Time-Enhanced Social Search Querying."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "32nd ER 2013",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2013",
                "sub_name": "Conceptual Modeling - 32th International Conference, ER 2013, Hong-Kong, China, November 11-13, 2013. Proceedings.",
                "count": 46,
                "papers": [
                    "Big Data - Conceptual Modeling to the Rescue.",
                    "What's Up in Business Intelligence? A Contextual and Knowledge-Based Perspective.",
                    "Modeling and Reasoning with Decision-Theoretic Goals.",
                    "TBIM: A Language for Modeling and Reasoning about Business Plans.",
                    "Automated Reasoning for Regulatory Compliance.",
                    "Is Traditional Conceptual Modeling Becoming Obsolete?",
                    "Cognitive Mechanisms of Conceptual Modelling - How Do People Do It?",
                    "A Semantic Analysis of Shared References.",
                    "Are Conceptual Models Concept Models?",
                    "Visual Modeling of Business Process Compliance Rules with the Support of Multiple Perspectives.",
                    "Deciding Data Object Relevance for Business Process Model Abstraction.",
                    "Matching Business Process Models Using Positional Passage-Based Language Models.",
                    "Towards an Empirically Grounded Conceptual Model for Business Process Compliance.",
                    "Improving Business Process Intelligence with Object State Transition Events.",
                    "A Conceptual Model of Intended Learning Outcomes Supporting Curriculum Development.",
                    "Cost-Informed Operational Process Support.",
                    "Automating the Adaptation of Evolving Data-Intensive Ecosystems.",
                    "sonSchema: A Conceptual Schema for Social Networks.",
                    "Minimizing Human Effort in Reconciling Match Networks.",
                    "Effective Recognition and Visualization of Semantic Requirements by Perfect SQL Samples.",
                    "A Semantic Approach to Keyword Search over Relational Databases.",
                    "Semantic-Based Mappings.",
                    "Managing Security Requirements Conflicts in Socio-Technical Systems.",
                    "Optimising Conceptual Data Models through Profiling in Object Databases.",
                    "Skyline Queries over Incomplete Data - Error Models for Focused Crowd-Sourcing.",
                    "Toward an Ontology-Driven Unifying Metamodel for UML Class Diagrams, EER, and ORM2.",
                    "Towards Ontological Foundations for the Conceptual Modeling of Events.",
                    "Baquara: A Holistic Ontological Framework for Movement Analysis Using Linked Data.",
                    "From Structure-Based to Semantics-Based: Towards Effective XML Keyword Search.",
                    "Combining Personalization and Groupization to Enhance Web Search.",
                    "Colored Petri Nets for Integrating the Data Perspective in Process Audits.",
                    "Former Students' Perception of Improvement Potential of Conceptual Modeling in Practice.",
                    "Conceptual Modeling for Ambient Assistance.",
                    "Empirical Evaluation of the Quality of Conceptual Models Based on User Perceptions: A Case Study in the Transport Domain.",
                    "Towards the Effective Use of Traceability in Model-Driven Engineering Projects.",
                    "Modeling Citizen-Centric Services in Smart Cities.",
                    "Representing and Elaborating Quality Requirements: The QRA Approach.",
                    "Towards a Strategy-Oriented Value Modeling Language: Identifying Strategic Elements of the VDML Meta-model.",
                    "Ontological Distinctions between Means-End and Contribution Links in the i* Framework.",
                    "Applying the Principles of an Ontology-Based Approach to a Conceptual Schema of Human Genome.",
                    "Ontologies for International Standards for Software Engineering.",
                    "On the Symbiosis between Enterprise Modelling and Ontology Engineering.",
                    "sonSQL: An Extensible Relational DBMS for Social Network Start-Ups.",
                    "OntoDBench: Interactively Benchmarking Ontology Storage in a Database.",
                    "Specifying and Reasoning over Socio-Technical Security Requirements with STS-Tool.",
                    "Lightweight Conceptual Modeling for Crowdsourcing."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2013w",
                "sub_name": "Advances in Conceptual Modeling - ER 2013 Workshops, LSAWM, MoBiD, RIGiM, SeCoGIS, WISM, DaSeM, SCME, and PhD Symposium, Hong Kong, China, November 11-13, 2013, Revised Selected Papers.",
                "count": 30,
                "papers": [
                    "Glocal News: An Attempt to Visualize the Discovery of Localized Top Local News, Globally.",
                    "Identifying Personality-Based Communities in Social Networks.",
                    "Towards a Domain-Specific Conceptual Modeling Approach of Open Source CMS.",
                    "Challenges and Opportunities in the Evolving Data Web.",
                    "Improving Massive Open Online Courses Analysis by Applying Modeling and Text Mining: A Case Study.",
                    "Functionality for Business Indicators in Data Warehouse Requirements Engineering.",
                    "Requirements Engineering in Business Analytics for Innovation and Product Lifecycle Management.",
                    "Modeling the Impact of Non-functional Requirements on Functional Requirements.",
                    "A Framework for Business Rules.",
                    "Integration of Heterogeneous Spatial Databases for Disaster Management.",
                    "An Ontology for Submarine Feature Representation on Charts.",
                    "A Human-Enhanced Framework for Assessing Open Geo-spatial Data.",
                    "Supporting Disaster Management with Real-Time-CPAR Platform.",
                    "A Semantic Web Approach for Geodata Discovery.",
                    "Mob-Warehouse: A Semantic Approach for Mobility Analysis with a Trajectory Data Warehouse.",
                    "Situation-Aware Smart Environment Modeling.",
                    "Semantic Web-Based Product Search.",
                    "News Recommendation Using Semantics with the Bing-SF-IDF Approach.",
                    "An Exploratory Study on Websites Quality Assessment.",
                    "A Hybrid Approach to Web Information System Modularization.",
                    "Using Fixed-Price Auctions for Selection in Communities of Web Services.",
                    "Products Competitive Relationships Mining.",
                    "Exploring Set Recommendation from a Financial Perspective.",
                    "Exploring Users' Preference on Mobile Based on Customer Features.",
                    "Former Students' Views on the Usefulness of Conceptual Modeling Education.",
                    "Teaching Conceptual Design Capture.",
                    "A Semantic DBMS Prototype.",
                    "Towards a Domain Specific Modeling Language for Agent-Based Modeling of Land Use/Cover Change.",
                    "The Role Concept for Relational Database Management Systems.",
                    "Store Review Spammer Detection Based on Review Relationship."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "31st ER 2012",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2012",
                "sub_name": "Conceptual Modeling - 31st International Conference ER 2012, Florence, Italy, October 15-18, 2012. Proceedings.",
                "count": 49,
                "papers": [
                    "Mega-modeling for Big Data Analytics.",
                    "Spatial Keyword Querying.",
                    "Of Cubes, DAGs and Hierarchical Correlations: A Novel Conceptual Model for Analyzing Social Media Data.",
                    "Understanding Constraint Expressions in Large Conceptual Schemas by Automatic Filtering.",
                    "Understanding Understandability of Conceptual Models - What Are We Actually Talking about?",
                    "Rules from Cognition for Conceptual Modelling.",
                    "Using Domain Ontologies as Semantic Dimensions in Data Warehouses.",
                    "Sliced Column-Store (SCS): Ontological Foundations and Practical Implications.",
                    "Schema Decryption for Large Extract-Transform-Load Systems.",
                    "Fast Group Recommendations by Applying User Clustering.",
                    "Understanding Tables on the Web.",
                    "Bridging the Gaps towards Advanced Data Discovery over Semi-structured Data.",
                    "Towards Discovering Conceptual Models behind Web Sites.",
                    "A Distance-Based Spelling Suggestion Method for XML Keyword Search.",
                    "Cross-Language Hybrid Keyword and Semantic Search.",
                    "Mapping Semantic Widgets to Web-Based, Domain-Specific Collections.",
                    "Evaluation Measures for Similarity Search Results in Process Model Repositories.",
                    "The MOSKitt4ME Approach: Providing Process Support in a Method Engineering Context.",
                    "Extending Conceptual Data Model for Dynamic Environment.",
                    "Contracts + Goals = Roles?",
                    "Specialization in i* Strategic Rationale Diagrams.",
                    "Conceptualizing and Specifying Key Performance Indicators in Business Strategy Models.",
                    "Data Support in Process Model Abstraction.",
                    "Synthesizing Object Life Cycles from Business Process Models.",
                    "Conceptual Modeling for Systems Integration.",
                    "Ontology Evolution: Assisting Query Migration.",
                    "Ontology of Dynamic Entities.",
                    "A Supervised Method for Lexical Annotation of Schema Labels Based on Wikipedia.",
                    "Optimising Schema Evolution Operation Sequences in Object Databases for Data Evolution.",
                    "Capturing Variability of Law with Nómos 2.",
                    "Deriving Variability Patterns in Software Product Lines by Ontological Considerations.",
                    "A Preference-Aware Query Model for Data Web Services.",
                    "User Feedback Based Query Refinement by Exploiting Skyline Operator.",
                    "A NFR-Based Framework for User-Centered Adaptation.",
                    "Concept-Based Web Search.",
                    "A Linear Algebra Technique for (de)Centralized Processing of SPARQL Queries.",
                    "Non-binary Evaluation for Schema Matching.",
                    "An Integrated Conceptual Model to Incorporate Information Tasks in Workflow Models.",
                    "A Method for the Definition and Treatment of Conceptual Schema Quality Issues.",
                    "EERMM: A Metamodel for the Enhanced Entity-Relationship Model.",
                    "Introducing Usability in a Conceptual Modeling-Based Software Development Process.",
                    "Conceptualizing Data in Multinational Enterprises: Model Design and Application.",
                    "A Metadata-based Approach to Leveraging the Information Supply of Business Intelligence Systems.",
                    "SPIDER-Graph: A Model for Heterogeneous Graphs Extracted from a Relational Database.",
                    "Exploiting Data Dependencies with Null Values for Ontology Extraction.",
                    "Partial Multi-dimensional Schema Merging in Heterogeneous Data Warehouses.",
                    "Knowlog: A Declarative Language for Reasoning about Knowledge in Distributed Systems.",
                    "A Framework for Populating Ontological Models from Semi-structured Web Documents.",
                    "Data Management in a Modern ITS: Problems and Solutions."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2012w",
                "sub_name": "Advances in Conceptual Modeling - ER 2012 Workshops CMS, ECDM-NoCoDA, MoDIC, MORE-BI, RIGiM, SeCoGIS, WISM, Florence, Italy, October 15-18, 2012. Proceedings.",
                "count": 49,
                "papers": [
                    "Third International Workshop on Conceptual Modelling of Services (CMS 2012).",
                    "A Rule Based Approach for Mapping Sensor Data to Ontological Models in AAL Environments.",
                    "Parameters for Service Level Agreements Generation in Cloud Computing - A Client-Centric Vision.",
                    "Resource, Process, and Use - Views on Service Modeling.",
                    "A Client-Centric ASM-Based Approach to Identity Management in Cloud Computing.",
                    "International Workshop on Evolution and Change in Data Management and on Non Conventional Data Access (ECDM - NoCoDa 2012).",
                    "The Telic/Atelic Distinction in Temporal Databases.",
                    "Static Analysis of XML Document Adaptations.",
                    "Supporting Database Provenance under Schema Evolution.",
                    "An in-Browser Microblog Ranking Engine.",
                    "Contextual Recommendations for Groups.",
                    "First International Workshop on Modeling for Data-Intensive Computing.",
                    "A Scientific Hypothesis Conceptual Model.",
                    "An Integrated Multidimensional Modeling Approach to Access Big Data in Business Intelligence Platforms.",
                    "A Comprehensive Model for Provenance.",
                    "Towards Discovering Ontological Models from Big RDF Data.",
                    "Towards Scalable Information Modeling of Requirements Architectures.",
                    "Preface to MORE-BI 2012.",
                    "OLAP-Like Analysis of Time Point-Based Sequential Data.",
                    "Multi-dimensional Navigation Modeling Using BI Analysis Graphs.",
                    "Ontology Alignment for Semantic Data Integration through Foundational Ontologies.",
                    "Preface to the Fourth International Workshop on Requirements, Intentions, and Goals in Conceptual Modeling (RIGiM 2012).",
                    "Where Did the Requirements Come from? A Retrospective Case Study.",
                    "Requirements, Intentions, Goals and Applicable Norms.",
                    "Towards Advanced Goal Model Analysis with jUCMNav.",
                    "Sixth International Workshop on Semantic and Conceptual Issues in GIS (SeCoGIS 2012).",
                    "Key Ingredients for Your Next Semantics Elevator Talk.",
                    "Towards a Spatio-temporal Form of Entropy.",
                    "The Similarity Jury: Combining Expert Judgements on Geographic Concepts.",
                    "Enriching SQWRL Queries in Support of Geospatial Data Retrieval from Multiple and Complementary Sources.",
                    "From Polygons and Timestamps to Dynamic Geographic Features: Grounding a Spatio-temporal Geo-ontology.",
                    "User View of Spatial Networks in Spatial Database Systems.",
                    "A Collaborative User-Centered Approach to Fine-Tune Geospatial Database Design.",
                    "Using the DBV Model to Maintain Versions of Multi-scale Geospatial Data.",
                    "Multi-scale Windowing over Trajectory Streams.",
                    "A Geographic Standards Based Metamodel to Formalize Spatio-temporal Knowledge in Remote Sensing Applications.",
                    "A Fuzzy Spatio-temporal-Based Approach for Activity Recognition.",
                    "Ninth International Workshop on Web Information Systems Modeling (WISM 2012).",
                    "Lightweight Semantics over Web Information Systems Content Employing Knowledge Tags.",
                    "Investigating the Relation between Users' Cognitive Style and Web Navigation Behavior with K-means Clustering.",
                    "Web Navigation via Semantic Annotations.",
                    "Using the Web to Monitor a Customized Unified Financial Portfolio.",
                    "Financial Events Recognition in Web News for Algorithmic Trading.",
                    "Alf-Verifier: An Eclipse Plugin for Verifying Alf/UML Executable Models.",
                    "A Web-Based Filtering Engine for Understanding Event Specifications in Large Conceptual Schemas.",
                    "An Eclipse Plugin for Improving the Quality of UML Conceptual Schemas.",
                    "Requirement-Driven Creation and Deployment of Multidimensional and ETL Designs.",
                    "STS-Tool: Using Commitments to Specify Socio-Technical Security Requirements.",
                    "CAWE DW Documenter: A Model-Driven Tool for Customizable ETL Documentation Generation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "30th ER 2011",
        "info": "Brussels, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2011",
                "sub_name": "Conceptual Modeling - ER 2011, 30th International Conference, ER 2011, Brussels, Belgium, October 31 - November 3, 2011. Proceedings.",
                "count": 44,
                "papers": [
                    "The Role of Conceptual Modeling in Managing and Changing the Business.",
                    "Adding Meaning to Your Steps (Keynote Paper).",
                    "Best-Effort Modeling of Structured Data on the Web.",
                    "CSRML: A Goal-Oriented Approach to Model Requirements for Collaborative Systems.",
                    "Establishing Regulatory Compliance for Software Requirements.",
                    "Making Explicit Some Implicit i* Language Decisions.",
                    "The Impact of Perceived Cognitive Effectiveness on Perceived Usefulness of Visual Conceptual Modeling Languages.",
                    "Effects of External Conceptual Models and Verbal Explanations on Shared Understanding in Small Groups.",
                    "Sociotechnical Trust: An Architectural Approach.",
                    "Generating SPARQL Executable Mappings to Integrate Ontologies.",
                    "Enterprise Monitoring Ontology.",
                    "Multilingual Ontologies for Cross-Language Information Extraction and Semantic Search.",
                    "Querying Conceptual Schemata with Expressive Equality Constraints.",
                    "A Precious Class of Cardinality Constraints for Flexible XML Data Processing.",
                    "Formal Semantics and Ontological Analysis for Understanding Subsetting, Specialization and Redefinition of Associations in UML.",
                    "Developing RFID Database Models for Analysing Moving Tags in Supply Chain Management.",
                    "Semi-automatic Conceptual Data Modeling Using Entity and Relationship Instance Repositories.",
                    "Impact of MDE Approaches on the Maintainability of Web Applications: An Experimental Evaluation.",
                    "From Pattern-Based User Interfaces to Conceptual Schemas and Back.",
                    "Automatically Mapping and Integrating Multiple Data Entry Forms into a Database.",
                    "External Variability of Software: Classification and Ontological Foundations.",
                    "Context Schema Evolution in Context-Aware Data Management.",
                    "Modeling the Propagation of User Preferences.",
                    "Towards a Theory of Refinement for Data Migration.",
                    "Design by Selection: A Reuse-Based Approach for Business Process Modeling.",
                    "System Identification for Adaptive Software Systems: A Requirements Engineering Perspective.",
                    "Using UML Profiles for Sector-Specific Tailoring of Safety Evidence Information.",
                    "Merging Relational Views: A Minimization Approach.",
                    "Ontology Evolution in Data Integration: Query Rewriting to the Rescue.",
                    "Object-Oriented XML Keyword Search.",
                    "A Hidden Markov Model Approach to Keyword-Based Search over Relational Databases.",
                    "A Modularization Proposal for Goal-Oriented Analysis of Data Warehouses Using I-Star.",
                    "Strategic Models for Business Intelligence.",
                    "Evolving Requirements in Socio-Technical Systems: Concepts and Practice.",
                    "Composite Indicators for Business Intelligence.",
                    "Incorporating Traceability in Conceptual Models for Data Warehouses by Using MDA.",
                    "Lightweight Verification of Executable Models.",
                    "Towards a Model of Services Based on Co-creation, Abstraction and Restriction.",
                    "A Semantic Oriented Method for Conceptual Data Modeling in OntoUML Based on Linguistic Concepts.",
                    "Content-Based Validation of Business Process Modifications.",
                    "Visual Change Tracking for Business Process Models.",
                    "An Empirical Analysis of Human Performance and Error in Process Model Development.",
                    "Panel: New Directions for Conceptual Modeling.",
                    "Panel: Modeling for the Future Internet."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2011w",
                "sub_name": "Advances in Conceptual Modeling. Recent Developments and New Directions - ER 2011 Workshops FP-UML, MoRE-BI, Onto-CoM, SeCoGIS, Variability@ER, WISM, Brussels, Belgium, October 31 - November 3, 2011. Proceedings.",
                "count": 56,
                "papers": [
                    "Preface to WISM 2011.",
                    "Academic Social Networks.",
                    "Conceptual Modelling for Web Information Systems: What Semantics Can Be Shared?",
                    "A Goal-Oriented Approach for Optimizing Non-functional Requirements in Web Applications.",
                    "Yet Another BPEL Extension for User Interactions.",
                    "Semantics-Enabled Web API Organization and Recommendation.",
                    "Preface to MORE-BI 2011.",
                    "Formal Concept Analysis for Qualitative Data Analysis over Triple Stores.",
                    "Semantic Cockpit: An Ontology-Driven, Interactive Business Intelligence Tool for Comparative Data Analysis.",
                    "A Model-Driven Approach for Enforcing Summarizability in Multidimensional Modeling.",
                    "Repairing Dimension Hierarchies under Inconsistent Reclassification.",
                    "GrHyMM: A Graph-Oriented Hybrid Multidimensional Model.",
                    "Ontologies and Functional Dependencies for Data Integration and Reconciliation.",
                    "A Comprehensive Framework on Multidimensional Modeling.",
                    "Preface to Variability@ER'11.",
                    "ISO Initiatives on Software Product Line Engineering: Vision and Current Status Invited Talk for Variability@ER2011.",
                    "Feature Modeling Tools: Evaluation and Lessons Learned.",
                    "Service Variability Patterns.",
                    "An Overview of Techniques for Detecting Software Variability Concepts in Source Code.",
                    "Variability in Multi-tenant Environments: Architectural Design Patterns from Industry.",
                    "Preface to Onto.Com 2011.",
                    "Experimental Evaluation of an Ontology-Driven Enterprise Modeling Language.",
                    "Levels for Conceptual Modeling.",
                    "Principled Pragmatism: A Guide to the Adaptation of Ideas from Philosophical Disciplines to Conceptual Modeling.",
                    "Ontological Usage Schemes - A Working Proposal for the Ontological Foundation of Language Use.",
                    "Gene Ontology Based Automated Annotation: Why It Isn't Working.",
                    "Formal Ontologies, Exemplars, Prototypes.",
                    "Unintended Consequences of Class-Based Ontological Commitment.",
                    "Preface to SeCoGIS 2011.",
                    "Referring Expressions in Location Based Services: The Case of the 'Opposite' Relation.",
                    "Cognitive Adequacy of Topological Consistency Measures.",
                    "The Neighborhood Configuration Model: A Framework to Distinguish Topological Relationships between Complex Volumes.",
                    "Reasoning with Complements.",
                    "Towards Modeling Dynamic Behavior with Integrated Qualitative Spatial Relations.",
                    "Transforming Conceptual Spatiotemporal Model into Object Model with Semantic Keeping.",
                    "Preface to FP-UML 2011.",
                    "On Automated Generation of Associations in Conceptual Database Model.",
                    "Specification and Utilization of Core Assets: Feature-Oriented vs. UML-Based Methods.",
                    "Actor-eUML for Concurrent Programming.",
                    "Preface to the Posters and Demonstrations.",
                    "An Eclipse Plugin for Validating Names in UML Conceptual Schemas.",
                    "KEYRY: A Keyword-Based Search Engine over Relational Databases Based on a Hidden Markov Model.",
                    "VirtualEMF: A Model Virtualization Tool.",
                    "Towards a Model-Driven Framework for Web Usage Warehouse Development.",
                    "CRESCO: Construction of Evidence Repositories for Managing Standards Compliance.",
                    "Modeling Approach for Business Networks with an Integration and Business Perspective.",
                    "Mosto: Generating SPARQL Executable Mappings between Ontologies.",
                    "The CSTL Processor: A Tool for Automated Conceptual Schema Testing.",
                    "A Tool for Filtering Large Conceptual Schemas.",
                    "Preface to the Industrial Track.",
                    "QBX: A CASE Tool for Data Mart Design.",
                    "The Meta-Morphing Model Used in TARGIT BI Suite.",
                    "Tool Support for Technology Scouting Using Online Sources.",
                    "Governance Issues on Heavy Models in an Industrial Context.",
                    "High Quality Technical Documentation for Large Industrial Plants Using an Enterprise Engineering and Conceptual Modeling Based Software Solution.",
                    "Publishing Open Data and Services for the Flemish Research Information Space."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "29th ER 2010",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2010",
                "sub_name": "Conceptual Modeling - ER 2010, 29th International Conference on Conceptual Modeling, Vancouver, BC, Canada, November 1-4, 2010. Proceedings.",
                "count": 39,
                "papers": [
                    "Meronymy-Based Aggregation of Activities in Business Process Models.",
                    "Leveraging Business Process Models for ETL Design.",
                    "Adaptation in Open Systems: Giving Interaction Its Rightful Place.",
                    "Information Use in Solving a Well-Structured IS Problem: The Roles of IS and Application Domain Knowledge.",
                    "Finding Solutions in Goal Models: An Interactive Backward Reasoning Approach.",
                    "The Model Role Level - A Vision.",
                    "Establishing Regulatory Compliance for Information System Requirements: An Experience Report from the Health Care Domain.",
                    "Decision-Making Ontology for Information System Engineering.",
                    "Reasoning with Optional and Preferred Requirements.",
                    "A Conceptual Approach to Database Applications Evolution.",
                    "Automated Co-evolution of Conceptual Models, Physical Databases, and Mappings.",
                    "A SchemaGuide for Accelerating the View Adaptation Process.",
                    "Complexity of Reasoning over Temporal Data Models.",
                    "Using Preaggregation to Speed Up Scaling Operations on Massive Spatio-temporal Data.",
                    "Situation Prediction Nets - Playing the Token Game for Ontology-Driven Situation Awareness.",
                    "Granularity in Conceptual Modelling: Application to Metamodels.",
                    "Feature Assembly: A New Feature Modeling Technique.",
                    "A Method for Filtering Large Conceptual Schemas.",
                    "Measuring the Quality of an Integrated Schema.",
                    "Contextual Factors in Database Integration - A Delphi Study.",
                    "Building Dynamic Models of Service Compositions with Simulation of Provision Resources.",
                    "Maintaining Consistency of Probabilistic Databases: A Linear Programming Approach.",
                    "Full Satisfiability of UML Class Diagrams.",
                    "On Enabling Data-Aware Compliance Checking of Business Process Models.",
                    "Query Answering under Expressive Entity-Relationship Schemata.",
                    "SQOWL: Type Inference in an RDBMS.",
                    "Querying Databases with Taxonomies.",
                    "What Is Wrong with Digital Documents? A Conceptual Model for Structural Cross-Media Content Composition and Reuse.",
                    "Classification of Index Partitions to Boost XML Query Performance.",
                    "Specifying Aggregation Functions in Multidimensional Models with OCL.",
                    "The CARD System.",
                    "AuRUS: Automated Reasoning on UML/OCL Schemas.",
                    "How the Structuring of Domain Knowledge Helps Casual Process Modelers.",
                    "SPEED: A Semantics-Based Pipeline for Economic Event Detection.",
                    "Prediction of Business Process Model Quality Based on Structural Metrics.",
                    "Modelling Functional Requirements in Spatial Design.",
                    "Business Processes Contextualisation via Context Analysis.",
                    "A Generic Perspective Model for the Generation of Business Process Views.",
                    "Extending Organizational Modeling with Business Services Concepts: An Overview of the Proposed Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2010w",
                "sub_name": "Advances in Conceptual Modeling - Applications and Challenges, ER 2010 Workshops ACM-L, CMLSA, CMS, DE@ER, FP-UML, SeCoGIS, WISM, Vancouver, BC, Canada, November 1-4, 2010. Proceedings.",
                "count": 35,
                "papers": [
                    "4th International Workshop on Semantic and Conceptual Issues in GIS (SeCoGIS 2010).",
                    "W-Ray: A Strategy to Publish Deep Web Geographic Data.",
                    "G-Map Semantic Mapping Approach to Improve Semantic Interoperability of Distributed Geospatial Web Services.",
                    "MGsP: Extending the GsP to Support Semantic Interoperability of Geospatial Datacubes.",
                    "Range Queries over a Compact Representation of Minimum Bounding Rectangles.",
                    "A Sensor Observation Service Based on OGC Specifications for a Meteorological SDI in Galicia.",
                    "Third International Workshop on Conceptual Modelling for Life Sciences Applications (CMLSA 2010).",
                    "Provenance Management in BioSciences.",
                    "Ontology-Based Agri-Environmental Planning for Whole Farm Plans.",
                    "First International Workshop on Conceptual Modelling of Service (CMS 2010).",
                    "A Formal Model for Service Mediators.",
                    "Reusing Legacy Systems in a Service-Oriented Architecture: A Model-Based Analysis.",
                    "Intelligent Author Identification.",
                    "Abstraction, Restriction, and Co-creation: Three Perspectives on Services.",
                    "The Resource-Service-System Model for Service Science.",
                    "Third International Workshop on Active Conceptual Modeling of Learning (ACM-L 2010).",
                    "Towards a Framework for Emergent Modeling.",
                    "When Entities Are Types: Effectively Modeling Type-Instantiation Relationships.",
                    "KBB: A Knowledge-Bundle Builder for Research Studies.",
                    "7th International Workshop on Web Information Systems Modeling (WISM 2010).",
                    "Integration of Dialogue Patterns into the Conceptual Model of Storyboard Design.",
                    "Model-Driven Development of Multidimensional Models from Web Log Files.",
                    "Integrity Assurance for RESTful XML.",
                    "Collaboration Recommendation on Academic Social Networks.",
                    "Mining Economic Sentiment Using Argumentation Structures.",
                    "Third Workshop on Domain Engineering (DE@ER 2010).",
                    "Evaluating Domain-Specific Modelling Solutions.",
                    "Towards a Reusable Unified Basis for Representing Business Domain Knowledge and Development Artifacts in Systems Engineering.",
                    "DaProS: A Data Property Specification Tool to Capture Scientific Sensor Data Properties.",
                    "6th International Workshop on Foundations and Practices of UML (FP-UML 2010).",
                    "Incorporating UML Class and Activity Constructs into UEML.",
                    "Data Modeling Is Important for SOA.",
                    "Representing Collectives and Their Members in UML Conceptual Models: An Ontological Analysis.",
                    "UML Activities at Runtime - Experiences of Using Interpreters and Running Generated Code.",
                    "Model-Driven Data Migration."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "28th ER 2009",
        "info": "Gramado, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2009",
                "sub_name": "Conceptual Modeling - ER 2009, 28th International Conference on Conceptual Modeling, Gramado, Brazil, November 9-12, 2009. Proceedings.",
                "count": 37,
                "papers": [
                    "Thirty Years of ER Conferences: Milestones, Achievements, and Future Directions.",
                    "A Frame Manipulation Algebra for ER Logical Stage Modelling.",
                    "Conceptual Modeling in the Time of the Revolution: Part II.",
                    "Data Auditor: Analyzing Data Quality Using Pattern Tableaux.",
                    "Schema AND Data: A Holistic Approach to Mapping, Resolution and Fusion in Information Integration.",
                    "A Generic Set Theory-Based Pattern Matching Approach for the Analysis of Conceptual Models.",
                    "An Empirical Study of Enterprise Conceptual Modeling.",
                    "Formalizing Linguistic Conventions for Conceptual Models.",
                    "Monitoring and Diagnosing Malicious Attacks with Autonomic Software.",
                    "A Modeling Ontology for Integrating Vulnerabilities into Security Requirements Conceptual Foundations.",
                    "Modeling Domain Variability in Requirements Engineering with Contexts.",
                    "Information Networking Model.",
                    "Towards an Ontological Modeling with Dependent Types: Application to Part-Whole Relations.",
                    "Inducing Metaassociations and Induced Relationships.",
                    "Tractable Query Answering over Conceptual Schemata.",
                    "Query-By-Keywords (QBK): Query Formulation Using Semantics and Feedback.",
                    "Cluster-Based Exploration for Effective Keyword Search over Semantic Datasets.",
                    "Geometrically Enhanced Conceptual Modelling.",
                    "Anchor Modeling.",
                    "Evaluating Exceptions on Time Slices.",
                    "A Strategy to Revise the Constraints of the Mediated Schema.",
                    "Schema Normalization for Improving Schema Matching.",
                    "Extensible User-Based XML Grammar Matching.",
                    "Modeling Associations through Intensional Attributes.",
                    "Modeling Concept Evolution: A Historical Perspective.",
                    "FOCIH: Form-Based Ontology Creation and Information Harvesting.",
                    "Specifying Valid Compound Terms in Interrelated Faceted Taxonomies.",
                    "Conceptual Modeling in Disaster Planning Using Agent Constructs.",
                    "Modelling Safe Interface Interactions in Web Applications.",
                    "A Conceptual Modeling Approach for OLAP Personalization.",
                    "Creating User Profiles Using Wikipedia.",
                    "Hosted Universal Composition: Models, Languages and Infrastructure in mashArt.",
                    "From Static Methods to Role-Driven Service Invocation - A Metamodel for Active Content in Object Databases.",
                    "Business Process Modeling: Perceived Benefits.",
                    "Designing Law-Compliant Software Requirements.",
                    "A Knowledge-Based and Model-Driven Requirements Engineering Approach to Conceptual Satellite Design.",
                    "Virtual Business Operating Environment in the Cloud: Conceptual Architecture and Challenges."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2009w",
                "sub_name": "Advances in Conceptual Modeling - Challenging Perspectives, ER 2009 Workshops CoMoL, ETheCoM, FP-UML, MOST-ONISW, QoIS, RIGiM, SeCoGIS, Gramado, Brazil, November 9-12, 2009. Proceedings.",
                "count": 41,
                "papers": [
                    "Preface to CoMoL 2009.",
                    "Semantic Service Design for Collaborative Business Processes in Internetworked Enterprises.",
                    "Algebraic Meta-structure Handling of Huge Database Schemata.",
                    "On Computing the Importance of Entity Types in Large Conceptual Schemas.",
                    "Preface to ETheCoM 2009.",
                    "Is It Important to Explain a Theorem? A Case Study on UML and ALCQI\\mathcal{ALCQI}.",
                    "Towards a Theory of Conceptual Modelling.",
                    "Assessing Modal Aspects of OntoUML Conceptual Models in Alloy.",
                    "First-Order Types and Redundant Relations in Relational Databases.",
                    "On Matrix Representations of Participation Constraints.",
                    "Toward Formal Semantics for Data and Schema Evolution in Data Stream Management Systems.",
                    "XML Machines.",
                    "Preface to FP-UML 2009.",
                    "Applying AUML and UML 2 in the Multi-agent Systems Project.",
                    "A Collaborative Support Approach on UML Sequence Diagrams for Aspect-Oriented Software.",
                    "Applying a UML Extension to Build Use Cases Diagrams in a Secure Mobile Grid Application.",
                    "The MP (Materialization Pattern) Model for Representing Math Educational Standards.",
                    "XMI2USE: A Tool for Transforming XMI to USE Specifications.",
                    "Preface to MOST-ONISW 2009.",
                    "Analysis Procedure for Validation of Domain Class Diagrams Based on Ontological Analysis.",
                    "Ontology for Imagistic Domains: Combining Textual and Pictorial Primitives.",
                    "Using a Foundational Ontology for Reengineering a Software Enterprise Ontology.",
                    "Multi-level Conceptual Modeling and OWL.",
                    "Preface to QoIS 2009.",
                    "Completeness in Databases with Maybe-Tuples.",
                    "Modeling, Measuring and Monitoring the Quality of Information.",
                    "Evaluating the Functionality of Conceptual Models.",
                    "Qbox-Services: Towards a Service-Oriented Quality Platform.",
                    "Preface to RIGiM 2009.",
                    "A Comparison of Goal-Oriented Approaches to Model Software Product Lines Variability.",
                    "A Lightweight GRL Profile for i* Modeling.",
                    "From User Goals to Service Discovery and Composition.",
                    "ITGIM: An Intention-Driven Approach for Analyzing the IT Governance Requirements.",
                    "Adapting the i* Framework for Software Product Lines.",
                    "Preface to SeCoGIS 2009.",
                    "A New Point Access Method Based on Wavelet Trees.",
                    "A Reference System for Topological Relations between Compound Spatial Objects.",
                    "A Model for Geographic Knowledge Extraction on Web Documents.",
                    "A Semantic Approach to Describe Geospatial Resources.",
                    "An Ontology-Based Framework for Geographic Data Integration.",
                    "A Semantic Approach for the Modeling of Trajectories in Space and Time."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2009phd",
                "sub_name": "Proceedings of the ER 2009 PhD Colloquium, affiliated to the 28th International Conference on Conceptual Modeling (ER-2009), Gramado, Brazil, November 9, 2009.",
                "count": 8,
                "papers": [
                    "A Model for Data Curation and Transformation, with Provenance.",
                    "Mobile Web Usability Standards Compliance Service.",
                    "Screenography - Systematic and Adaptive Layout Development.",
                    "A Complete Definition of the Inheritance Construct in i.",
                    "A Methodology for the Design, Verification, and Validation of Business Processes in B2B Collaborations.",
                    "How Tacit Is Tacit Knowledge?",
                    "An Ontology-based Approach for Software Measurement and Suitability Measurement Repository Evaluation to Apply Statistical Software Process Control in High Maturity Organizations.",
                    "A Quality Based Approach for the Analysis and Design of Information Systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "27th ER 2008",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2008",
                "sub_name": "Conceptual Modeling - ER 2008, 27th International Conference on Conceptual Modeling, Barcelona, Spain, October 20-24, 2008. Proceedings.",
                "count": 54,
                "papers": [
                    "Conceptual Modeling Meets the Human Genome.",
                    "Relationship Web: Spinning the Web from Trailblazing to Semantic Analytics.",
                    "PIM Meets Web 2.0.",
                    "Developing Preference Band Model to Manage Collective Preferences.",
                    "A Conceptual Modeling Framework for Expressing Observational Data Semantics.",
                    "Towards a Compositional Semantic Account of Data Quality Attributes.",
                    "A Formal Model of Fuzzy Ontology with Property Hierarchy and Object Membership.",
                    "What's in a Relationship: An Ontological Analysis.",
                    "An Upper Level Ontological Model for Engineering Design Performance Domain.",
                    "A Multi-level Methodology for Developing UML Sequence Diagrams.",
                    "Content Ontology Design Patterns as Practical Building Blocks for Web Ontologies.",
                    "Quality Patterns for Conceptual Modelling.",
                    "Automating the Extraction of Rights and Obligations for Regulatory Compliance.",
                    "Location-Based Software Modeling and Analysis: Tropos-Based Approach.",
                    "Risk Evaluation for Personal Identity Management Based on Privacy Attribute Ontology.",
                    "Beyond Control-Flow: Extending Business Process Configuration to Roles and Objects.",
                    "Value-Driven Coordination Process Design Using Physical Delivery Models.",
                    "Relaxed Compliance Notions in Adaptive Process Management Systems.",
                    "On Measuring Process Model Similarity Based on High-Level Change Operations.",
                    "Recommendation Based Process Modeling Support: Method and User Experience.",
                    "On the Formal Semantics of Change Patterns in Process-Aware Information Systems.",
                    "Modeling and Querying E-Commerce Data in Hybrid Relational-XML DBMSs.",
                    "Approximate Probabilistic Query Answering over Inconsistent Databases.",
                    "Conjunctive Query Containment under Access Limitations.",
                    "Automatic Extraction of Structurally Coherent Mini-Taxonomies.",
                    "Analysis and Reuse of Plots Using Similarity and Analogy.",
                    "Discovering Semantically Similar Associations (SeSA) for Complex Mappings between Conceptual Models.",
                    "An Adverbial Approach for the Formal Specification of Topological Constraints Involving Regions with Broad Boundaries.",
                    "Capturing Temporal Constraints in Temporal ER Models.",
                    "Temporal Constraints in Non-temporal Data Modelling Languages.",
                    "Integrated Model-Driven Development of Goal-Oriented Data Warehouses and Data Marts.",
                    "Design Metrics for Data Warehouse Evolution.",
                    "A Domain Engineering Approach for Situational Method Engineering.",
                    "Retune: Retrieving and Materializing Tuple Units for Effective Keyword Search over Relational Databases.",
                    "Model Driven Specification of Ontology Translations.",
                    "Dealing with Usability in Model Transformation Technologies.",
                    "Ontology Coordination: The iCoord Project Demonstration.",
                    "Designing Similarity Measures for XML.",
                    "SESQ: A Model-Driven Method for Building Object Level Vertical Search Engines.",
                    "HealthSense: An Application for Querying Raw Sensor Data.",
                    "Visual SQL: Towards ER-Based Object-Relational Database Querying.",
                    "SAMSTAR: An Automatic Tool for Generating Star Schemas from an Entity-Relationship Diagram.",
                    "Constraint-Aware XSLT Evaluation.",
                    "A Quality Circle Tool for Software Models.",
                    "Generating and Optimizing Graphical User Interfaces for Semantic Service Compositions.",
                    "REMM-Studio+: Modeling Variability to Enable Requirements Reuse.",
                    "A Conceptual-Model-Based Computational Alembic for a Web of Knowledge.",
                    "MDBE: Automatic Multidimensional Modeling.",
                    "Oryx - Sharing Conceptual Models on the Web.",
                    "Providing Top-K Alternative Schema Matchings with .",
                    "Role and Request Based Conceptual Modeling - A Methodology and a CASE Tool.",
                    "AutoMed Model Management.",
                    "QUINST: A Metamodeling Tool.",
                    "An Implementation of a Query Language with Generalized Quantifiers."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2008w",
                "sub_name": "Advances in Conceptual Modeling - Challenges and Opportunities, ER 2008 Workshops CMLSA, ECDM, FP-UML, M2AS, RIGiM, SeCoGIS, WISM, Barcelona Spain, October 20-23, 2008. Proceedings.",
                "count": 53,
                "papers": [
                    "Preface to CMLSA 2008.",
                    "Models of the Human Metabolism.",
                    "Designing Privacy-Aware Personal Health Record Systems.",
                    "Linking Biological Databases Semantically for Knowledge Discovery.",
                    "Integration of Genomic, Proteomic and Biomedical Information on the Semantic Web.",
                    "Domain Knowledge Integration and Semantical Quality Management -A Biology Case Study-.",
                    "Towards a Scientific Model Management System.",
                    "Preface to ECDM 2008.",
                    "Time Versus Standards: A Tale of Temporal Databases.",
                    "Modeling Transformations between Versions of a Temporal Data Warehouse.",
                    "Managing the History of Metadata in Support for DB Archiving and Schema Evolution.",
                    "Towards a Dynamic Inconsistency-Tolerant Schema Maintenance.",
                    "Preface to FP-UML 2008.",
                    "Using Object Concepts and UML for Conceptual Modeling.",
                    "Towards Obtaining Analysis-Level Class and Use Case Diagrams from Business Process Models.",
                    "Improving Automatic UML2 Profile Generation for MDA Industrial Development.",
                    "A UML Profile for Modelling Measurable Requirements.",
                    "A Comprehensive Aspect-Oriented Use Case Method for Modeling Complex Business Requirements.",
                    "Exploiting the Complementary Relationship between Use Case Models and Activity Diagrams for Developing Quality Requirements Specifications.",
                    "Preface to M2AS 2008.",
                    "A Dynamically Extensible, Service-Based Infrastructure for Mobile Applications.",
                    "The Situation Lens: Looking into Personal Service Composition.",
                    "A System for Dynamically Generating User Centric Interfaces for Mobile Applications and Services.",
                    "Multimodal Mobile Virtual Blackboard.",
                    "Personalized Mobile Multimodal Services: CHAT Project Experiences.",
                    "A General-Purpose Context Modeling Architecture for Adaptive Mobile Services.",
                    "Barcode Scanning from Mobile-Phone Camera Photos Delivered Via MMS: Case Study.",
                    "A Qualitative Study of the Applicability of Technology Acceptance Models to Senior Mobile Phone Users.",
                    "Visualising the Dynamics of Unfolding Interactions on Mobile Devices.",
                    "Preface to RIGiM 2008.",
                    "Reflective Analysis of the Syntax and Semantics of the i* Framework.",
                    "Modeling Strategic Alignment Using INSTAL.",
                    "Requirements Engineering for Distributed Development Using Software Agents.",
                    "Integrating Business Domain Ontologies with Early Requirements Modelling.",
                    "Goal-Oriented Authoring Approach and Design of Learning Systems.",
                    "Timing Nonfunctional Requirements.",
                    "Preface to SeCoGIS 2008.",
                    "Projective Relations on the Sphere.",
                    "Life and Motion Configurations: A Basis for Spatio-temporal Generalized Reasoning Model.",
                    "A Semantic and Language-Based Model of Landscape Scenes.",
                    "An Ontology-Based Approach for the Semantic Modelling and Reasoning on Trajectories.",
                    "Administrative Units, an Ontological Perspective.",
                    "A Modular Data Infrastructure for Location-Based Services.",
                    "A Method to Derivate SOAP Interfaces and WSDL Metadata from the OGC Web Processing Service Mandatory Interfaces.",
                    "Managing Sensor Data on Urban Traffic.",
                    "Retrieving Documents with Geographic References Using a Spatial Index Structure Based on Ontologies.",
                    "Preface to WISM 2008.",
                    "Abstract State Services.",
                    "A Meta-model Approach to the Management of Hypertexts in Web Information Systems.",
                    "An Approach to Creating Design Methods for the Implementation of Product Software: The Case of Web Information Systems.",
                    "Semantic Verification of Web System Contents.",
                    "Identifying Users Stereotypes with Semantic Web Mining.",
                    "On Temporal Cardinality in the Context of the TOWL Language."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "26th ER 2007",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2007",
                "sub_name": "Conceptual Modeling - ER 2007, 26th International Conference on Conceptual Modeling, Auckland, New Zealand, November 5-9, 2007, Proceedings.",
                "count": 40,
                "papers": [
                    "Modeling Workflow Patterns from First Principles.",
                    "Heart Modeling, Computational Physiology and the IUPS Physiome Project.",
                    "Conceptual Schemas and Ontologies for Database Access: Myths and Challenges.",
                    "Multidimensional Data Modeling for Business Process Analysis.",
                    "Mining Hesitation Information by Vague Association Rules.",
                    "A Model Driven Modernization Approach for Automatically Deriving Multidimensional Models in Data Warehouses.",
                    "Cost-Based Fragmentation for Distributed Complex Value Databases.",
                    "From Business Models to Service-Oriented Design: A Reference Catalog Approach.",
                    "Teaching a Schema Translator to Produce O/R Views.",
                    "Building a Tool for Cost-Based Design of Object-Oriented Database Schemas.",
                    "Generic Schema Mappings.",
                    "Relational Data Tailoring Through View Composition.",
                    "On the Discovery of Preferred Work Practice Through Business Process Variants.",
                    "Towards Automated Reasoning on ORM Schemes.",
                    "From Declarative to Imperative UML/OCL Operation Specifications.",
                    "An Ontological Metamodel of Classifiers and Its Application to Conceptual Modelling and Database Design.",
                    "Handling Inconsistency of Vague Relations with Functional Dependencies.",
                    "Querying Incomplete Data with Logic Programs: ER Strikes Back.",
                    "Prioritized Preferences and Choice Constraints.",
                    "Reasoning over Extended ER Models.",
                    "On Order Dependencies for the Semantic Web.",
                    "Collection Type Constructors in Entity-Relationship Modeling.",
                    "Schema Exchange: A Template-Based Approach to Data and Metadata Translation.",
                    "A Conceptual Modeling Methodology Based on Niches and Granularity.",
                    "As We May Link: A General Metamodel for Hypermedia Systems.",
                    "A Goal Oriented Approach for Modeling and Analyzing Security Trade-Offs.",
                    "Rapid Business Process Discovery ( R- BPD).",
                    "Ontology-Driven Business Modelling: Improving the Conceptual Representation of the REA Ontology.",
                    "A Comparison of Two Approaches to Safety Analysis Based on Use Cases.",
                    "Using Unified Modeling Language for Conceptual Modelling of Knowledge-Based Systems.",
                    "Tracing the Rationale Behind UML Model Change Through Argumentation.",
                    "Exploring Alternatives for Representing and Accessing Design Knowledge About Enterprise Integration.",
                    "Mining and Re-engineering Transactional Workflows for Reliable Executions.",
                    "Cross: An OWL Wrapper for Reasoning on Relational Databases.",
                    "Augmenting Traditional Conceptual Models to Accommodate XML Structural Constructs.",
                    "VERT: A Semantic Approach for Content Search and Content Extraction in XML Query Processing.",
                    "A Conceptual Model for Multidimensional Analysis of Documents.",
                    "Automatic Hidden-Web Table Interpretation by Sibling Page Comparison.",
                    "A Fine-Grained XML Structural Comparison Approach.",
                    "Fine-Grained Compatibility and Replaceability Analysis of Timed Web Service Protocols."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2007w",
                "sub_name": "Advances in Conceptual Modeling - Foundations and Applications, ER 2007 Workshops CMLSA, FP-UML, ONISW, QoIS, RIGiM,SeCoGIS, Auckland, New Zealand, November 5-9, 2007, Proceedings.",
                "count": 47,
                "papers": [
                    "Preface to CMLSA 2007.",
                    "Pattern Recognition of Single-Molecule Force Spectroscopy Data.",
                    "Massive Protein Structural Property Explorations Using New Indexing Mechanism.",
                    "Data Access and Management in ACGT: Tools to Solve Syntactic and Semantic Heterogeneities Between Clinical and Image Databases.",
                    "Ontology-Based Data Integration in Data Logistics Workflows.",
                    "Model-Driven Development Based Transformation of Stereotyped Class Diagrams to XML Schemas in a Healthcare Context.",
                    "An Extendable System for Conceptual Modeling and Simulation of Signal Transduction Pathways.",
                    "Toward an Ontological Database for Subcellular Neuroanatomy.",
                    "Seed-Based Generation of Personalized Bio-ontologies for Information Extraction.",
                    "Preface to FP-UML 2007.",
                    "Developing State Diagrams Using a State Specialization Technique.",
                    "Quality Dependencies Among Use Case Models and Sequence Diagrams Developed by Novice Systems Analysts.",
                    "M-BPSec: A Method for Security Requirement Elicitation from a UML 2.0 Business Process Specification.",
                    "Applying Model Transformation By-Example on Business Process Modeling Languages.",
                    "Extending OCL to Ensure Model Transformations.",
                    "A UML Profile for Modeling Data Warehouse Usage.",
                    "Preface to ONISW 2007.",
                    "A Method for Semi-automatic Creation of Ontologies Based on Texts.",
                    "Enriching OWL with Instance Recognition Semantics for Automated Semantic Annotation.",
                    "Making Web Users' Domain Models Explicit by Applying Ontologies.",
                    "Provability-Based Semantic Interoperability Via Translation Graphs.",
                    "Preface to QoIS 2007.",
                    "PQM vs. BPQM: Studying the Tailoring of a General Quality Model to a Specific Domain.",
                    "An Ontological Approach for the Quality Assessment of Computer Science Conferences.",
                    "Using Practitioners for Assessing the Understandability of UML Statechart Diagrams with Composite States.",
                    "Preface to RIGiM 2007.",
                    "An Ontology for Requirements.",
                    "GOORE : Goal-Oriented and Ontology Driven Requirements Elicitation Method.",
                    "Early Prioritisation of Goals.",
                    "Goal-Aligned Requirements Generation.",
                    "A Model-Driven Goal-Oriented Requirement Engineering Approach for Data Warehouses.",
                    "Visually Effective Goal Models Using KAOS.",
                    "Agent Based Executable Conceptual Models Using i* and CASO.",
                    "Achieving, Satisficing, and Excelling.",
                    "On the Adequacy of i* Models for Representing and Analyzing Software Architectures.",
                    "Extending Argumentation to Goal-Oriented Requirements Engineering.",
                    "Preface to SeCoGIS 2007.",
                    "Modeling Historical and Future Spatio-temporal Relationships of Moving Objects in Databases.",
                    "Towards a Semantic Spatial Model for Pedestrian Indoor Navigation.",
                    "Modeling Collaborative Semantics with a Geographic Recommender.",
                    "Dynamically Traveling Web Service Clustering Based on Spatial and Temporal Aspects.",
                    "A Graph-Oriented Model and Query Language for Events.",
                    "PLR Partitions: A Conceptual Model of Maps.",
                    "A Conceptual Framework to Support Semantic Interoperability of Geospatial Datacubes.",
                    "On Languages for the Specification of Integrity Constraints in Spatial Conceptual Models.",
                    "Approximate Queries by Relaxing Structural Constraints in GIS.",
                    "Ensuring the Semantic Correctness of Complex Regions."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2007tppi",
                "sub_name": "Challenges in Conceptual Modelling. Tutorials, posters, panels and industrial contributions at the 26th International Conference on Conceptual Modeling - ER 2007. Auckland, New Zealand, November 5-9, 2007. Proceedings.",
                "count": 32,
                "papers": [
                    "Conceptual Modeling for Virtual Reality.",
                    "Know your Limits: Enhanced XML Modeling with Cardinality Constraints.",
                    "Modeling and Engineering Adaptive Complex Systems.",
                    "Selfish-brain Theory: Challenges in the Top-down Analysis of Metabolic Supply Chains.",
                    "The CIDOC Conceptual Reference Model - A New Standard for Knowledge Sharing.",
                    "flashWeb: Graphical Modeling of Web Applications for Data Management.",
                    "SAT & ZB: Novel Tools to Acquire and Browse Conceptual Schemas from Public Online Databases for Biomedical Applications.",
                    "SimEval - A Tool for Evaluating the Quality of Similarity Functions.",
                    "2D Visualisation of SMFS Data on Membrane Proteins.",
                    "A Framework Supporting the Utilization of Domain Knowledge Embedded in Software.",
                    "A Methodology and Toolkit for Deploying Contract Documents as E-contracts.",
                    "A Taxonomy of Customer Relationship Management Analyses for Data Warehousing.",
                    "Active Meta Modeling Support for Evolving E-contracts.",
                    "An Abstract Interaction Model for a MDA Software Production Method.",
                    "An e-Process Selection Model.",
                    "An Unified Dynamic Description Logic Model for Databases: Relational Data, Relational Operations and Queries.",
                    "Business Process and Business Rule Modeling Languages for Compliance Management: A Representational Analysis.",
                    "Capturing Users' Everyday, Implicit Information Integration Decisions.",
                    "Clarifying Goal Models.",
                    "Concept Instance Sketching and Design for a Biological Database Framework.",
                    "Dynamic Modeling of Trajectory Patterns using Data Mining and Reverse Engineering.",
                    "Exploiting Semantics of Inter-Process Dependencies to Instantiate Predefined Integration Patterns.",
                    "Improving Environmental Decision-making: Bridging the Gap between Conceptual Modelling and Quantitative Analyses with Quasta.",
                    "Metamodeling Integration Architecture for Open Biomedical Ontologies: The GO Extensions' Case Study.",
                    "On the Correlation between Process Model Metrics and Errors.",
                    "Ontological Semantics for the Use of UML in Conceptual Modeling.",
                    "Perceived vs. Measured Quality of Conceptual Schemas: An Experimental Comparison.",
                    "Providing Semantically Equivalent, Complete Views for Multilingual Access to Integrated Data.",
                    "Semantic Interoperability via Category Theory.",
                    "Towards Active Conceptual Modelling for Sudden Events.",
                    "Update XML Data by Using Graphical Languages.",
                    "Using Attributed Goal Graphs for Software Component Selection: An Application of Goal-Oriented Analysis to Decision Making."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "25th ER 2006",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2006",
                "sub_name": "Conceptual Modeling - ER 2006, 25th International Conference on Conceptual Modeling, Tucson, AZ, USA, November 6-9, 2006, Proceedings.",
                "count": 52,
                "papers": [
                    "Suggested Research Directions for a New Frontier - Active Conceptual Modeling.",
                    "From Conceptual Modeling to Requirements Engineering.",
                    "A Context Model for Semantic Mediation in Web Services Composition.",
                    "Modeling Service Compatibility with Pi-calculus for Choreography.",
                    "The DeltaGrid Abstract Execution Model: Service Composition and Process Interference Handling.",
                    "Evaluating Quality of Conceptual Models Based on User Perceptions.",
                    "Representation Theory Versus Workflow Patterns - The Case of BPMN.",
                    "Use Case Modeling and Refinement: A Quality-Based Approach.",
                    "Ontology with Likeliness and Typicality of Objects in Concepts.",
                    "In Defense of a Trope-Based Ontology for Conceptual Modeling: An Example with the Foundations of Attributes, Weak Entities and Datatypes.",
                    "Explicitly Representing Superimposed Information in a Conceptual Model.",
                    "Preference Functional Dependencies for Managing Choices.",
                    "Modeling Visibility in Hierarchical Systems.",
                    "A Model for Anticipatory Event Detection.",
                    "A Framework for Integrating XML Transformations.",
                    "Oxone: A Scalable Solution for Detecting Superior Quality Deltas on Ordered Large XML Documents.",
                    "Schema-Mediated Exchange of Temporal XML Data.",
                    "A Quantitative Summary of XML Structures.",
                    "Database to Semantic Web Mapping Using RDF Query Languages.",
                    "Representing Transitive Propagation in OWL.",
                    "On Generating Content and Structural Annotated Websites Using Conceptual Modeling.",
                    "A More Expressive Softgoal Conceptualization for Quality Requirements Analysis.",
                    "Conceptualizing the Co-evolution of Organizations and Information Systems: An Agent-Oriented Perspective.",
                    "Towards a Theory of Genericity Based on Government and Binding.",
                    "Concept Modeling by the Masses: Folksonomy Structure and Interoperability.",
                    "Method Chunks for Interoperability.",
                    "Domain Analysis for Supporting Commercial Off-the-Shelf Components Selection.",
                    "A Formal Framework for Reasoning on Metadata Based on CWM.",
                    "A Set of QVT Relations to Assure the Correctness of Data Warehouses by Using Multidimensional Normal Forms.",
                    "Design and Use of ER Repositories: Methodologies and Experiences in eGovernment Initiatives.",
                    "Notes for the Conceptual Design of Interfaces.",
                    "The User Interface Is the Conceptual Model.",
                    "Towards a Holistic Conceptual Modelling-Based Software Development Process.",
                    "A Multi-perspective Framework for Organizational Patterns.",
                    "Deriving Concepts for Modeling Business Actions.",
                    "Towards a Reference Ontology for Business Models.",
                    "Reasoning on UML Class Diagrams with OCL Constraints.",
                    "On the Use of Association Redefinition in UML Class Diagrams.",
                    "Optimising Abstract Object-Oriented Database Schemas.",
                    "Experimental Research on Conceptual Modeling: What Should We Be Doing and Why?",
                    "Eliciting Data Semantics Via Top-Down and Bottom-Up Approaches: Challenges and Opportunities.",
                    "The ADO.NET Entity Framework: Making the Conceptual Level Real.",
                    "XMeta Repository and Services.",
                    "IBM Industry Models: Experience, Management and Challenges.",
                    "Community Semantics for Ultra-Scale Information Management.",
                    "Managing Data in High Throughput Laboratories: An Experience Report from Proteomics.",
                    "Policy Models for Data Sharing.",
                    "Protocol Analysis for Exploring the Role of Application Domain in Conceptual Schema Understanding.",
                    "Auto-completion of Underspecified SQL Queries.",
                    "iQL: A Query Language for the Instance-Based Data Model.",
                    "Designing Under the Influence of Speech Acts: A Strategy for Composing Enterprise Integration Solutions.",
                    "Geometry of Concepts."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2006w",
                "sub_name": "Advances in Conceptual Modeling - Theory and Practice, ER 2006 Workshops BP-UML, CoMoGIS, COSS, ECDM, OIS, QoIS, SemWAT, Tucson, AZ, USA, November 6-9, 2006, Proceedings.",
                "count": 52,
                "papers": [
                    "Conceptual Modeling for Emerging Web Application Technologies.",
                    "State-of-the-Art in Modeling and Deployment of Electronic Contracts.",
                    "Preface to BP-UML 2006.",
                    "Extending the UML 2 Activity Diagram with Business Process Goals and Performance Measures and the Mapping to BPEL.",
                    "UN/CEFACT'S Modeling Methodology (UMM): A UML Profile for B2B e-Commerce.",
                    "Capturing Security Requirements in Business Processes Through a UML 2.0 Activity Diagrams Profile.",
                    "Finite State History Modeling and Its Precise UML-Based Semantics.",
                    "A UML Profile for Modeling Schema Mappings.",
                    "Model to Text Transformation in Practice: Generating Code from Rich Associations Specifications.",
                    "Preface for CoMoGIS 2006.",
                    "Large-Scale Earth Science Services: A Case for Databases.",
                    "Time-Aggregated Graphs for Modeling Spatio-temporal Networks.",
                    "An ISO TC 211 Conformant Approach to Model Spatial Integrity Constraints in the Conceptual Design of Geographical Databases.",
                    "Access Control in Geographic Databases.",
                    "VTPR-Tree: An Efficient Indexing Method for Moving Objects with Frequent Updates.",
                    "New Query Processing Algorithms for Range and k-NN Search in Spatial Network Databases.",
                    "A ONCE-Updating Approach on Moving Objects.",
                    "A Progressive Transmission Scheme for Vector Maps in Low-Bandwidth Environments Based on Device Rendering.",
                    "Map2Share - A System Exploiting Metadata to Share Geographical Information.",
                    "Preface for CoSS 2006.",
                    "Building Semantic Web Services Based on a Model Driven Web Engineering Method.",
                    "Choreographies as Federations of Choreographies and Orchestrations.",
                    "Designing Web Services for Supporting User Tasks: A Model Driven Approach.",
                    "Designing Service-Based Applications: Teaching the Old Dogs New Tricks ...or Is It the Other Way Around?",
                    "Preface for ECDM 2006.",
                    "Reduce, Reuse, Recycle: Practical Approaches to Schema Integration, Evolution and Versioning.",
                    "A DAG Comparison Algorithm and Its Application to Temporal Data Warehousing.",
                    "Handling Changes of Database Schemas and Corresponding Ontologies.",
                    "Evolving the Implementation of ISA Relationships in EER Schemas.",
                    "Schema Change Operations for Versioning Complex Objects Hierarchy in OODBs.",
                    "Representing Versions in XML Documents Using Versionstamp.",
                    "Preface for OIS 2006.",
                    "XBRL Taxonomies and OWL Ontologies for Investment Funds.",
                    "A Semantic Transformation Approach for ISO 15926.",
                    "Modeling Considerations for Product Ontology.",
                    "Ontologizing EDI Semantics.",
                    "WSDL RDF Mapping: Developing Ontologies from Standardized XML Languages.",
                    "Preface for QoIS 2006.",
                    "Information Quality, System Quality and Information System Effectiveness: Introduction to QoIS'06.",
                    "Quality-Driven Automatic Transformation of Object-Oriented Navigational Models.",
                    "HIQM: A Methodology for Information Quality Monitoring, Measurement, and Improvement.",
                    "Evaluating the Productivity and Reproducibility of a Measurement Procedure.",
                    "Quality of Material Master Data and Its Effect on the Usefulness of Distributed ERP Systems.",
                    "Towards Automatic Evaluation of Learning Object Metadata Quality.",
                    "Expressing and Processing Timeliness Quality Aware Queries: The DQ2L Approach.",
                    "Preface for SemWAT 2006.",
                    "Combining Declarative and Procedural Knowledge to Automate and Represent Ontology Mapping.",
                    "Visual Ontology Alignment for Semantic Web Applications.",
                    "Automatic Creation of Web Services from Extraction Ontologies.",
                    "An Architecture for Emergent Semantics.",
                    "Semantic Web Techniques for Personalization of eGovernment Services.",
                    "Query Graph Model for SPARQL."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2006acml",
                "sub_name": "Active Conceptual Modeling of Learning, Next Generation Learning-Base System Development [1st International ACM-L Workshop, November 8, 2006, during ER 2006, Tucson, Arizona, USA].",
                "count": 17,
                "papers": [
                    "Overview of Papers in 2006 Active Conceptual Modeling of Learning (ACM-L) Workshop.",
                    "Architecture for Active Conceptual Modeling of Learning.",
                    "Understanding the Semantics of Data Provenance to Support Active Conceptual Modeling.",
                    "Adaptive and Context-Aware Reconciliation of Reactive and Pro-active Behavior in Evolving Systems.",
                    "A Common Core for Active Conceptual Modeling for Learning from Surprises.",
                    "Actively Evolving Conceptual Models for Mini-World and Run-Time Environment Changes.",
                    "Achievements and Problems of Conceptual Modelling.",
                    "Metaphor Modeling on the Semantic Web.",
                    "Schema Changes and Historical Information in Conceptual Models in Support of Adaptive Systems.",
                    "Using Active Modeling in Counterterrorism.",
                    "To Support Emergency Management by Using Active Modeling: A Case of Hurricane Katrina.",
                    "Using Ontological Modeling in a Context-Aware Summarization System to Adapt Text for Mobile Devices.",
                    "Accommodating Streams to Support Active Conceptual Modeling of Learning from Surprises.",
                    "Approaches to the Active Conceptual Modelling of Learning.",
                    "Spatio-temporal and Multi-representation Modeling: A Contribution to Active Conceptual Modeling.",
                    "Postponing Schema Definition: Low Instance-to-Entity Ratio ( LItER ) Modelling.",
                    "Research Issues in Active Conceptual Modeling of Learning: Summary of Panel Discussions in Two Workshops (May 2006) and (November 2006)."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "24th ER 2005",
        "info": "Klagenfurt, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2005",
                "sub_name": "Conceptual Modeling - ER 2005, 24th International Conference on Conceptual Modeling, Klagenfurt, Austria, October 24-28, 2005, Proceedings.",
                "count": 31,
                "papers": [
                    "Conceptual Modeling of Structure and Behavior with UML - The Top Level Object-Oriented Framework (TLOOF) Approach.",
                    "How to Manage Uniformly Software Architecture at Different Abstraction Levels.",
                    "Schema Integration Based on Uncertain Semantic Mappings.",
                    "Combining Intention-Oriented and State-Based Process Modeling.",
                    "Pattern-Based Analysis of the Control-Flow Perspective of UML Activity Diagrams.",
                    "A Three-Layered XML View Model: A Practical Approach.",
                    "Modeling Group-Based Education.",
                    "Learning Process Models as Mediators Between Didactical Practice and Web Support.",
                    "A Fundamental View on the Process of Conceptual Modeling.",
                    "How to Tame a Very Large ER Diagram (Using Link Analysis and Force-Directed Drawing Algorithms).",
                    "A Multilevel Dictionary for Model Management.",
                    "A MOF-Compliant Approach to Software Quality Modeling.",
                    "Conceptual Modeling Based on Transformation Linguistic Patterns.",
                    "Applying Modular Method Engineering to Validate and Extend the RESCUE Requirements Process.",
                    "Security Patterns Meet Agent Oriented Software Engineering: A Complementary Solution for Developing Secure Information Systems.",
                    "Kuaba Ontology: Design Rationale Representation and Reuse in Model-Based Designs.",
                    "Ontology Creation: Extraction of Domain Knowledge from Web Documents.",
                    "Choosing Appropriate Method Guidelines for Web-Ontology Building.",
                    "Conceptual Model Based Semantic Web Services.",
                    "Automatically Grounding Semantically-Enriched Conceptual Models to Concrete Web Services.",
                    "Transforming Web Requirements into Navigational Models: AN MDA Based Approach.",
                    "Accelerating Workflows with Fixed Date Constraints.",
                    "Workflow Data Patterns: Identification, Representation and Tool Support.",
                    "Actor-Oriented Design of Scientific Workflows.",
                    "Blueprints and Measures for ETL Workflows.",
                    "Vague Sets or Intuitionistic Fuzzy Sets for Handling Vague Data: Which One Is Better?",
                    "A Semantic Approach to Query Rewriting for Integrated XML Data.",
                    "A Taxonomy of Inaccurate Summaries and Their Management in OLAP Systems.",
                    "XCM: Conceptual Modeling for Dynamic Domains.",
                    "Precise Modeling and Verification of Topological Integrity Constraints in Spatial Databases: From an Expressive Power Study to Code Generation Principles.",
                    "Topological Relationships Between Complex Lines and Complex Regions."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2005w",
                "sub_name": "Perspectives in Conceptual Modeling, ER 2005 Workshops AOIS, BP-UML, CoMoGIS, eCOMO, and QoIS, Klagenfurt, Austria, October 24-28, 2005, Proceedings.",
                "count": 54,
                "papers": [
                    "Preface to BP-UML 2005.",
                    "Current Practices in the Use of UML.",
                    "An Empirical Study of the Nesting Level of Composite States Within UML Statechart Diagrams.",
                    "Utilizing a Multimedia UML Framework for an Image Database Application.",
                    "Object Class or Association Class? Testing the User Effect on Cardinality Interpretation.",
                    "Organizing and Managing Use Cases.",
                    "A Comparative Analysis of Use Case Relationships.",
                    "Applying Transformations to Model Driven Development of Web Applications.",
                    "A Precise Approach for the Analysis of the UML Models Consistency.",
                    "A UML 2 Profile for Business Process Modelling.",
                    "Preface to AOIS 2005.",
                    "Agent Oriented Data Integration.",
                    "AOSE and Organic Computing - How Can They Benefit from Each Other? Position Paper.",
                    "Modeling Dynamic Engineering Design Processes in PSI.",
                    "Preliminary Basis for an Ontology-Based Methodological Approach for Multi-agent Systems.",
                    "DDEMAS: A Domain Design Technique for Multi-agent Domain Engineering.",
                    "An Agent-Oriented Meta-model for Enterprise Modelling.",
                    "An Approach to Broaden the Semantic Coverage of ACL Speech Acts.",
                    "Normative Pragmatics for Agent Communication Languages.",
                    "Experimental Comparison of Rational Choice Theory, Norm and Rights Based Multi Agent Systems.",
                    "Preface to CoMoGIS 2005.",
                    "Map Algebra Extended with Functors for Temporal Data.",
                    "A Formal Model for Representing Point Trajectories in Two-Dimensional Spaces.",
                    "A Logical Approach for Modeling Spatio-temporal Objects and Events.",
                    "Conceptual Neighbourhood Diagrams for Representing Moving Objects.",
                    "A Refined Line-Line Spatial Relationship Model for Spatial Conflict Detection.",
                    "Assessing Topological Consistency for Collapse Operation in Generalization of Spatial Databases.",
                    "Spatial Relations for Semantic Similarity Measurement.",
                    "Approximate Continuous K Nearest Neighbor Queries for Continuous Moving Objects with Pre-defined Paths.",
                    "Spatio-temporal Similarity Analysis Between Trajectories on Road Networks.",
                    "Using Data Mining for Modeling Personalized Maps.",
                    "3D Scene Modeling for Activity Detection.",
                    "SAMATS - Edge Highlighting and Intersection Rating Explained.",
                    "Applying Semantic Web Technologies for Geodata Integration and Visualization.",
                    "Preface to eCOMO 2005.",
                    "Bargaining in E-Business Systems.",
                    "Conceptual Content Management for Enterprise Web Services.",
                    "Verifying Web Services Composition.",
                    "Towards Amplifying Business Process Reuse.",
                    "Preface to QoIS 2005.",
                    "Measuring the Perceived Semantic Quality of Information Models.",
                    "Situated Support for Choice of Representation for a Semantic Web Application.",
                    "Towards Systematic Model Assessment.",
                    "A Fuzzy Based Approach to Measure Completeness of an Entity-Relationship Model.",
                    "Managing Information Quality in e-Science: A Case Study in Proteomics.",
                    "Tool Support and Specification Quality: Experimental Validation of an RE-Tool Evaluation Framework.",
                    "Improving Object-Oriented Micro Architectural Design Through Knowledge Systematization.",
                    "Tutorial 1: eduWeaver - The Courseware Modeling Tool.",
                    "Tutorial 2: FOOM - Functional and Object Oriented Methodology: An Integrated Approach.",
                    "Tutorial 3: Domain Engineering - Using Domain Concepts to Guide Software Design.",
                    "Tutorial 4: Reasoning About Web Information Systems.",
                    "Tutorial 5: Schema and Data Translation.",
                    "Tutorial 6: Modeling and Simulation of Dynamic Engineering Design Processes.",
                    "Tutorial 7: Modeling Enterprise Applications."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "23rd ER 2004",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2004",
                "sub_name": "Conceptual Modeling - ER 2004, 23rd International Conference on Conceptual Modeling, Shanghai, China, November 2004, Proceedings.",
                "count": 75,
                "papers": [
                    "Entity Resolution: Overview and Challenges.",
                    "Towards a Statistically Semantic Web.",
                    "The Application and Prospect of Business Intelligence in Metallurgical Manufacturing Enterprises in China.",
                    "Conceptual Modelling - What and Why in Current Practice.",
                    "Entity-Relationship Modeling Re-revisited.",
                    "Modeling Functional Data Sources as Relations.",
                    "Roles as Entity Types: A Conceptual Modelling Pattern.",
                    "Modeling Default Induction with Conceptual Structures.",
                    "Reachability Problems in Entity-Relationship Schema Instances.",
                    "A Reference Methodology for Conducting Ontological Analyses.",
                    "Pruning Ontologies in the Development of Conceptual Schemas of Information Systems.",
                    "Definition of Events and Their Effects in Object-Oriented Conceptual Modeling Languages.",
                    "Enterprise Modeling with Conceptual XML.",
                    "Graphical Reasoning for Sets of Functional Dependencies.",
                    "ER-Based Software Sizing for Data-Intensive Systems.",
                    "Data Mapping Diagrams for Data Warehouse Design with UML.",
                    "Informational Scenarios for Data Warehouse Requirements Elicitation.",
                    "Extending UML for Designing Secure Data Warehouses.",
                    "Data Integration with Preferences Among Sources.",
                    "Resolving Schematic Discrepancy in the Integration of Entity-Relationship Schemas.",
                    "Managing Merged Data by Vague Functional Dependencies.",
                    "Merging of XML Documents.",
                    "Schema-Based Web Wrapping.",
                    "Web Taxonomy Integration Using Spectral Graph Transducer.",
                    "Contextual Probability-Based Classification.",
                    "Improving the Performance of Decision Tree: A Hybrid Approach.",
                    "Understanding Relationships: Classifying Verb Phrase Semantics.",
                    "Fast Mining Maximal Frequent ItemSets Based on FP-Tree.",
                    "Multi-phase Process Mining: Building Instance Graphs.",
                    "A New XML Clustering for Structural Retrieval.",
                    "Link Patterns for Modeling Information Grids and P2P Networks.",
                    "Information Retrieval Aware Web Site Modelling and Generation.",
                    "Expressive Profile Specification and Its Semantics for a Web Monitoring System.",
                    "On Modelling Cooperative Retrieval Using an Ontology-Based Query Refinement Process.",
                    "Load-Balancing Remote Spatial Join Queries in a Spatial GRID.",
                    "Expressing and Optimizing Similarity-Based Queries in SQL.",
                    "XSLTGen: A System for Automatically Generating XML Transformations via Semantic Mappings.",
                    "Efficient Recursive XML Query Processing in Relational Database Systems.",
                    "Situated Preferences and Preference Repositories for Personalized Database Applications.",
                    "Analysis and Management of Web Service Protocols.",
                    "Semantic Interpretation and Matching of Web Services.",
                    "Intentional Modeling to Support Identity Management.",
                    "WUML: A Web Usage Manipulation Language for Querying Web Log Data.",
                    "An Agent-Based Approach for Interleaved Composition and Execution of Web Services.",
                    "A Probabilistic QoS Model and Computation Framework for Web Services-Based Workflows.",
                    "Lossless Conditional Schema Evolution.",
                    "Ontology-Guided Change Detection to the Semantic Web Data.",
                    "Schema Evolution in Data Warehousing Environments - A Schema Transformation-Based Approach.",
                    "Metaprogramming for Relational Databases.",
                    "Incremental Navigation: Providing Simple and Generic Access to Heterogeneous Structures.",
                    "Agent Patterns for Ambient Intelligence.",
                    "Modeling the Semantics of 3D Protein Structures.",
                    "Risk-Driven Conceptual Modeling of Outsourcing Decisions.",
                    "A Pattern and Dependency Based Approach to the Design of Process Models.",
                    "Use of Tabular Analysis Method to Construct UML Sequence Diagrams.",
                    "An Approach to Formalizing the Semantics of UML Statecharts.",
                    "Applying the Application-Based Domain Modeling Approach to UML Structural Views.",
                    "A Model Driven Approach for XML Database Development.",
                    "On the Updatability of XML Views Published over Relational Data.",
                    "XBiT: An XML-Based Bitemporal Data Model.",
                    "Enterprise Cockpit for Business Operation Management.",
                    "Modeling Autonomous Catalog for Electronic Commerce.",
                    "GiSA: A Grid System for Genome Sequences Assembly.",
                    "Analytical View of Business Data: An Example.",
                    "Ontological Approaches to Enterprise Applications.",
                    "FASTAXON: A System for FAST (and Faceted) TAXONomy Design.",
                    "CLOVE: A Framework to Design Ontology Views.",
                    "iRM: An OMG MOF Based Repository System with Querying Capabilities.",
                    "Visual Querying for the Semantic Web.",
                    "Query Refinement by Relevance Feedback in an XML Retrieval System.",
                    "Semantics Modeling for Spatiotemporal Databases.",
                    "Temporal Information Management Using XML.",
                    "SVMgr: A Tool for the Management of Schema Versioning.",
                    "GENNERE: A Generic Epidemiological Network for Nephrology and Rheumatology.",
                    "Beyond Webservices - Conceptual Modelling for Service Oriented Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2004w",
                "sub_name": "Conceptual Modeling for Advanced Application Domains, ER 2004 Workshops CoMoGIS, COMWIM, ECDM, CoMoA, DGOV, and ECOMO, Shanghai, China, November 8-12, 2004, Proceedings.",
                "count": 62,
                "papers": [
                    "Preface to CoMoGIS 2004.",
                    "A Conceptual Model for Supporting Multiple Representations and Topology Management.",
                    "Modeling Geospatial Databases with Plug-Ins for Visual Languages: A Pragmatic Approach and the Impacts of 16 Years of Research and Experimentations on Perceptory.",
                    "Representing Ecological Niches in a Conceptual Model.",
                    "A CASE Tool for Geographic Database Design Supporting Analysis Patterns.",
                    "GML Storage: A Spatial Database Approach.",
                    "TPKDB-Tree: An Index Structure for Efficient Retrieval of Future Positions of Moving Objects.",
                    "Moving Point Indexing for Future Location Query.",
                    "Topological Consistency for Collapse Operation in Multi-scale Databases.",
                    "Symbolization of Mobile Object Trajectories with the Support to Motion Data Mining.",
                    "Representing and Reasoning About Spatial Knowledge Based on Spatial Relevant Logic.",
                    "Towards System Architecture of Spatial Information Grid and Service-Based Collaboration.",
                    "Geo Web Services Based on Semantic.",
                    "A Scaleless Data Model for Direct and Progressive Spatial Query Processing.",
                    "Querying Heterogeneous Spatial Databases: Combining an Ontology with Similarity Functions.",
                    "Retrieval of Heterogeneous Geographical Information Using Concept Brokering and Upper Level Ontology.",
                    "A New Quick Point Location Algorithm.",
                    "Preface to CoMWIM 2004.",
                    "Checking Semantic Integrity Constraints on Integrated Web Documents.",
                    "X2S: Translating XPath into Efficient SQL Queries.",
                    "On Aggregation Operators for Fuzzy Information Sources.",
                    "CL2: A Multi-dimensional Clustering Approach in Sensor Networks.",
                    "TCMiner: A High Performance Data Mining System for Multi-dimensional Data Analysis of Traditional Chinese Medicine Prescriptions.",
                    "Association Rule Mining Based on the Multiple-Dimensional Item Attributes.",
                    "OWL-Based Semantic Conflicts Detection and Resolution for Data Interoperability.",
                    "From Ontology to Relational Databases.",
                    "A New Dynamic Indexing Structure for Searching Time-Series Patterns.",
                    "Automatic Location and Separation of Records: A Case Study in the Genealogical Domain.",
                    "Research and Implementation of CORBA Web Services.",
                    "Grammar Based Interface Processing in Web Service Composition.",
                    "Query Rewriting for Extracting Data Behind HTML Forms.",
                    "Preface to ECDM 2004.",
                    "Automatic Integrity Constraint Evolution due to Model Subtract Operations.",
                    "An Ontological Framework for Evolutionary Model Management.",
                    "Elementary Translations: The Seesaws for Achieving Traceability Between Database Schemata.",
                    "Towards the Managment of Time in Data-Intensive Web Sites.",
                    "Evolution of XML-Based Mediation Queries in a Data Integration System.",
                    "Schema Versioning in Data Warehouses.",
                    "Facilitating Database Attribute Domain Evolution Using Mesodata.",
                    "Multitemporal Conditional Schema Evolution.",
                    "Preface to CoMoA 2004.",
                    "A Sociological Framework for Multi-agent Systems Validation and Verification.",
                    "Spatio-temporal Relevant Logic as the Logical Basis for Specifying, Verifying, and Reasoning About Mobile Multi-agent Systems.",
                    "Towards an Ontology for Agent Mobility.",
                    "Subjective Trust Inferred by Kalman Filtering vs. a Fuzzy Reputation.",
                    "Conceptual Model of BDI Agents within an ITS.",
                    "Model-Driven Agent-Based Web Services IDE.",
                    "AFDM: A UML-Based Methodology for Engineering Intelligent Agents .",
                    "Preface to DGOV 2004.",
                    "IECS: An Integrated E-Community System for Management, Decision and Service.",
                    "WebDG - A Platform for E-Government Web Services.",
                    "A Study on Camera-Detector System for Traffic Control in Korea.",
                    "Ontology-Based Models of Legal Knowledge.",
                    "Aspects of Regulatory and Legal Implications on e-Voting.",
                    "Architecture for Implementing the Mobile Government Services in Korea.",
                    "Preface to eCOMO 2004.",
                    "Modeling Business Strategy in E-Business Systems Requirements Engineering.",
                    "A Method and Tool for Wide Audience Requirements Elicitation and Rapid Prototyping for Mobile Systems.",
                    "Methodology for the Development of a Sectoral Standard for EDI.",
                    "Classification of Business Process Correspondences and Associated Integration Operators.",
                    "On Behavioural Model Transformation in Web Services.",
                    "Model-Driven Planning and Development of Infrastructures for E-Commerce."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "22nd ER 2003",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2003",
                "sub_name": "Conceptual Modeling - ER 2003, 22nd International Conference on Conceptual Modeling, Chicago, IL, USA, October 13-16, 2003, Proceedings.",
                "count": 49,
                "papers": [
                    "Semantic Web Application Modeling.",
                    "Oh, so That Is What You Meant! The Interplay of Data Quality and Data Semantics.",
                    "Enterprise Information Integration ? XML to the Rescue!",
                    "Workflow Using AUML and Agents.",
                    "Statistical Analysis as Methodological Framework for Data(base) Integration.",
                    "QoM: Qualitative and Quantitative Schema Match Measure.",
                    "The Uni-level Description: A Uniform Framework for Representing Information in Multiple Data Models.",
                    "Temporal Conceptual Modelling of Workflows.",
                    "Towards a Logical Model for Patterns.",
                    "Designing Foundational Ontologies: The Object-Centered High-Level Reference Ontology OCHRE as a Case Study.",
                    "An OPM-Based Metamodel of System Development Process.",
                    "A Unified Approach for Software Policy Modeling: Incorporating Implementation into a Modeling Methodology.",
                    "Deriving Use Cases from Business Process Models.",
                    "Order-Sensitive View Maintenance of Materialized XQuery Views.",
                    "Automatic Generation of XQuery View Definitions from ORA-SS Views.",
                    "Automaton Meets Query Algebra: Towards a Unified Model for XQuery Evaluation over XML Data Streams.",
                    "Querying Heterogeneous XML Sources through a Conceptual Schema.",
                    "Analysis of Web Services Composition Languages: The Case of BPEL4WS.",
                    "Extending Conceptual Models for Web Based Applications.",
                    "Development of Web Applications from Web Enhanced Conceptual Schemas.",
                    "Extending Hypertext Conceptual Models with Process-Oriented Primitives.",
                    "Requirement Engineering Meets Security: A Case Study on Modelling Secure Electronic Transactions by VISA and Mastercard.",
                    "Goal-Based Business Modeling Oriented towards Late Requirements Generation.",
                    "Strategy for Database Application Evolution: The DB-MAIN Approach.",
                    "A UML Based Approach for Modeling ETL Processes in Data Warehouses.",
                    "A General Model for Online Analytical Processing of Complex Data.",
                    "An Interpolated Volume Model for Databases.",
                    "Integrity Constraints Definition in Object-Oriented Conceptual Modeling Languages.",
                    "Conceptual Treatment of Multivalued Dependencies.",
                    "Entity Types Derived by Symbol-Generating Rules.",
                    "DAISY, an RER Model Based Interface for RDB to ILP.",
                    "Context-Based Data Mining Using Ontologies.",
                    "Mining Typical Preferences of Collaborative User Groups.",
                    "Conceptual Modeling of Concurrent Systems through Stepwise Abstraction and Refinement Using Petri Net Morphisms.",
                    "Taxonomy-Based Conceptual Modeling for Peer-to-Peer Networks.",
                    "EITH - A Unifying Representation for Database Schema and Application Code in Enterprise Knowledge Extraction.",
                    "A Heuristic-Based Methodology for Semantic Augmentation of User Queries on the Web.",
                    "On Analysing Query Ambiguity for Query Refinement: The Librarian Agent Approach.",
                    "A Declarative XML-RL Update Language.",
                    "Resolving Structural Conflicts in the Integration of XML Schemas: A Semantic Approach.",
                    "Operators and Classification for Data Mapping in Semantic Integration.",
                    "Querying and Integrating Ontologies Viewed as Conceptual Schemas.",
                    "A Comparison of Frameworks for Enterprise Architecture Modeling.",
                    "Bless the ODS.",
                    "Modeling Reactive Behavior in ORM.",
                    "Developing Complex Systems with Object-Process Methodology Using OPCAT.",
                    "Conceptual Data Models for Engineering Information Modeling and Formal Transformation of EER and EXPRESS-G.",
                    "AXIS: A XML Schema Integration System.",
                    "Episode-Based Conceptual Mining of Large Health Collections."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2003w",
                "sub_name": "Conceptual Modeling for Novel Application Domains, ER 2003 Workshops ECOMO, IWCMQ, AOIS, and XSDM, Chicago, IL, USA, October 13, 2003, Proceedings.",
                "count": 39,
                "papers": [
                    "Preface to eCOMO 2003.",
                    "Managing Evolving Business Workflows through the Capture of Descriptive Information.",
                    "The Benefits of Rapid Modelling for E-business System Development.",
                    "Prediction of Consumer Preference through Bayesian Classification and Generating Profile.",
                    "Developing Web Applications from Conceptual Models. A Web Services Approach.",
                    "A Framework for Business Rule Driven Web Service Composition.",
                    "Virtual Integration of the Tile Industry (VITI).",
                    "Preface to IWCMQ 2003.",
                    "Multiperspective Evaluation of Reference Models - Towards a Framework.",
                    "On the Acceptability of Conceptual Design Models for Web Applications.",
                    "Consistency by Construction: The Case of MERODE.",
                    "Defining Metrics for UML Statechart Diagrams in a Methodological Way.",
                    "Visual SQL ? High-Quality ER-Based Query Treatment.",
                    "Multidimensional Schemas Quality: Assessing and Balancing Analyzability and Simplicity.",
                    "Conceptual Modeling of Accounting Information Systems: A Comparative Study of REA and ER Diagrams.",
                    "Preface to AOIS 2003.",
                    "Bringing Multi-agent Systems into Human Organizations: Application to a Multi-agent Information System.",
                    "Reconciling Physical, Communicative, and Social/Institutional Domains in Agent Oriented Information Systems ? A Unified Framework.",
                    "An Agent-Based Active Portal Framework.",
                    "Agent-Oriented Modeling and Agent-Based Simulation.",
                    "REF: A Practical Agent-Based Requirement Engineering Framework.",
                    "Patterns for Motivating an Agent-Based Approach.",
                    "Using Scenarios for Contextual Design in Agent-Oriented Information Systems.",
                    "Dynamic Matchmaking between Messages and Services in Multi-agent Information Systems.",
                    "Preface to XSDM 2003.",
                    "A Sufficient and Necessary Condition for the Consistency of XML DTDs.",
                    "Index Selection for Efficient XML Path Expression Processing.",
                    "CX-DIFF: A Change Detection Algorithm for XML Content and Change Presentation Issues for WebVigiL.",
                    "Storing and Querying XML Documents Using a Path Table in Relational Databases.",
                    "Improving Query Performance Using Materialized XML Views: A Learning-Based Approach.",
                    "A Framework for Management of Concurrent XML Markup.",
                    "Object Oriented XML Query by Example.",
                    "Automatic Generation of XML from Relations: The Nested Relation Approach.",
                    "Toward the Automatic Derivation of XML Transformations.",
                    "VACXENE: A User-Friendly Visual Synthetic XML Generator.",
                    "A New Inlining Algorithm for Mapping XML DTDs to Relational Schemas.",
                    "From XML DTDs to Entity-Relationship Schemas.",
                    "Extracting Relations from XML Documents.",
                    "Extending XML Schema with Nonmonotonic Inheritance."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "21st ER 2002",
        "info": "Tampere, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2002",
                "sub_name": "Conceptual Modeling - ER 2002, 21st International Conference on Conceptual Modeling, Tampere, Finland, October 7-11, 2002, Proceedings.",
                "count": 41,
                "papers": [
                    "Conceptual Modelling and Ontology: Possibilities and Pitfalls.",
                    "An Ontology for m-Business Models.",
                    "Modeling Dynamics of Business Processes: Key for Building Next Generation of Business Information Systems.",
                    "Ontology-Driven Conceptual Modelling.",
                    "Advanced OO Modelling: Metamodels and Notations for the New Millennium.",
                    "Ontology-Driven Conceptual Modelling: Advanced Concepts.",
                    "Workflow Management in Electronic Commerce.",
                    "Do We Need an Ontology of Ontologies?",
                    "Development of a Conceptual Data Model for Digital Spatio-Temporal Geographical Information, with Application to Several Themes and GIS.",
                    "Using Semantic Rules Database to Dynamically Set up the ICSpace Virtual Building.",
                    "On the Transformation of Object Oriented Conceptual Models to Logical Theories: From EROOS to ID-Logic.",
                    "Component Construction of Database Schemes.",
                    "Multirelational Semantics for ExtendedEntity-Relationship Schemata with Applications.",
                    "A Meta-model for e-Contract Template Variable Dependencies Facilitating e-Negotiation.",
                    "On the General Ontological Foundations of Conceptual Modeling.",
                    "Finding and Characterizing Changes in Ontologies.",
                    "Superimposed Schematics: Introducing E-R Structure for In-Situ Information Selections.",
                    "Web Extensions to UML: Using the MVC Triad.",
                    "Wiccap Data Model: Mapping Physical Websites to Logical Views.",
                    "Representing and Querying Semistructured Web Data Using Nested Tables with Structural Variants.",
                    "On the Transformation of Object-Oriented Conceptual Models to Logical Theories.",
                    "Reasoning with Goal Models.",
                    "Registering Scientific Information Sources for Semantic Mediation.",
                    "Multidimensional Modeling with UML Package Diagrams.",
                    "Comparative Evaluation of Large Data Model Representation Methods: The Analyst's Perspective.",
                    "Extracting Conceptual Relationships from Specialized Documents.",
                    "A Transactional Model for Data Warehouse Maintenance.",
                    "The Account Data Model.",
                    "A Semantic Model for Hypertext Data Caching.",
                    "Understanding and Simulating Narratives in the Context of Information Systems.",
                    "Global Schema Generation Using Formal Ontologies.",
                    "Automatically Extracting Ontologically Specified Data from HTML Tables of Unknown Structure.",
                    "On the Expressive Power of Data Integration Systems.",
                    "Property-Based Semantic Reconciliation of Heterogeneous Information Sources.",
                    "Conceptual Integration of Multiple Partial Geometric Models.",
                    "Evaluating the Quality of Process Models: Empirical Testing of a Quality Framework.",
                    "Data Quality in Web Information Systems.",
                    "Conceptual Modeling Quality - From EER to UML Schemas Evaluation.",
                    "Conceptual Modeling for Customized XML Schemas.",
                    "A Flexible Cost Model for Abstract Object-Oriented Database Schemas.",
                    "Designing Valid XML Views."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2002w",
                "sub_name": "Advanced Conceptual Modeling Techniques, ER 2002 Workshops: ECDM, MobIMod, IWCMQ, and eCOMO, Tampere, Finland, October 7-11, 2002, Revised Papers.",
                "count": 38,
                "papers": [
                    "Change Management for a Temporal Versioned Object-Oriented Database.",
                    "Towards Temporal Information in Workflow Systems.",
                    "Preserving and Querying Histories of XML-Published Relational Databases.",
                    "A Lightweight XML Constraint Check and Update Framework.",
                    "Change Discovery in Ontology-Based Knowledge Management Systems.",
                    "An Architecture for Managing Database Evolution.",
                    "Reifying Design Patterns to Facilitate Systems Evolution.",
                    "Managing Configuration with Evolving Constraints in Design Databases.",
                    "Intentions of Operations - Characterization and Preservation.",
                    "An Active Approach to Model Management for Evolving Information Systems.",
                    "Mobile Information Systems - Research Challenges on the Conceptual and Logical Level.",
                    "A Cooperation Model for Personalised and Situation Dependent Services in Mobile Networks.",
                    "Sequence Diagrams for Mobility.",
                    "A Pattern-Based Approach to Mobile Information Systems Conceptual Architecture.",
                    "Support of Integrated Wireless Web Access through Media Types.",
                    "Domain-Specific Modelling for Cross-Platform Product Families.",
                    "Dynamic Database Generation for Mobile Applications.",
                    "m-WOnDA: The \"Write Once 'n' Deliver Anywhere\" Model for Mobile Users.",
                    "Basic User Requirements for Mobile Work Support Systems - Three Easy Steps.",
                    "Accounting and Billing of Wireless Internet Services in the Third Generation Networks.",
                    "Keynote Speech: Theoretical and Practical Issues in Evaluating the Quality of Conceptual Models.",
                    "Quality in Conceptual Modeling - New Research Directions.",
                    "Evaluation Framework of Requirements Engineering Tools for Verification and Validation.",
                    "Hierarchical ER Diagrams (HERD) - The Method and Experimental Evaluation.",
                    "Detection of Redundant Arcs in Entity Relationship Conceptual Models.",
                    "Assessing Object-Oriented Conceptual Models Maintainability.",
                    "Validation of UML Classes through Animation.",
                    "Building Quality into Learning Management Systems - An Architecture-Centric Approach.",
                    "Towards the Quality Evaluation of Functional Aspects of Operative Web Applications.",
                    "A Model and an XSL Framework for Analyzing the Quality of WebML Conceptual Schemas.",
                    "Quality of Interactive Models.",
                    "Process Models and Business Models - A Unified Framework.",
                    "Behavior-Consistent Composition of Business Processes from Internal and External Services.",
                    "Process-Oriented, Flexible Composition of Web Services with UML.",
                    "Extracting Data behind Web Forms.",
                    "Managing Unstructured E-commerce Information.",
                    "Modelling Web-Based Banking Systems: Story Boarding and User Profiling.",
                    "Communication: Key to Success on the Web."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "20th ER 2001",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2001",
                "sub_name": "Conceptual Modeling - ER 2001, 20th International Conference on Conceptual Modeling, Yokohama, Japan, November 27-30, 2001, Proceedings.",
                "count": 49,
                "papers": [
                    "Conceptual Modeling for Collaborative E-business Processes.",
                    "\"i-mode\", Now & Future.",
                    "The Role of Research in the New Economy.",
                    "Semantic B2B Integration: Is Modeling the Superior Approach over Programming?",
                    "Modeling Topological Constraints in Spatial Part-Whole Relationships.",
                    "Source Description-Based Approach for the Modeling of Spatial Information Integration.",
                    "Topological Relationships of Complex Points and Complex Regions.",
                    "DISTIL: A Design Support Environment for Conceptual Modeling of Spatio-temporal Requirements.",
                    "Tripod: A Comprehensive Model for Spatial and Aspatial Historical Objects.",
                    "A Design of Topological Predicates for Complex Crisp and Fuzzy Regions.",
                    "A Semantic Approach to XML-based Data Integration.",
                    "A Rule-Based Conversion of a DTD to a Conceptual Schema.",
                    "Semantic Data Modeling Using XML Schemas.",
                    "Modelling Strategic Actor Relationships to Support Intellectual Property Management.",
                    "SiteLang: Conceptual Modeling of Internet Sites.",
                    "A Frame Work for Modeling Electronic Contracts.",
                    "CASE Tool Support for Temporal Database Design.",
                    "Domain-Specific Metadata a Key for Building Semantically-Rich Schema Models.",
                    "Coping with Inconsistent Constraint Specifications.",
                    "Integration of Biological Data and Quality-Driven Source Negotiation.",
                    "Accessing Data Integration Systems through Conceptual Schemas.",
                    "Resolving Conflicts and Handling Replication during Integration of Multiple Databases by Object Deputy Model.",
                    "Efficient Execution of Range-Aggregate Queries in Data Warehouse Environments.",
                    "A Pragmatic Approach to Conceptual Modeling of OLAP Security.",
                    "A Randomized Approach for the Incremental Design of an Evolving Data Warehouse.",
                    "Semantics of Stereotypes for Type Specification in UML: Theory and Practice.",
                    "Towards Ontologically Based Semantics for UML Constructs.",
                    "Developing Sequence Diagrams in UML.",
                    "Translation of a High-Level Temporal Model into Lower Level Models: Impact of Modelling at Different Description Levels.",
                    "Relationship Type Refinement in Conceptual Models with Multiple Classification.",
                    "A Metamodel for Part - Whole Relationships for Reasoning on Missing Parts and Reconstruction.",
                    "Developing XML Documents with Guaranteed \"Good\" Properties.",
                    "Dimension Hierarchies Design from UML Generalizations and Aggregations.",
                    "Minimize Mark-Up ! Natural Writing Should Guide the Design of Textual Modeling Frontends.",
                    "An Approach for Method Reengineering.",
                    "Modeling and Structuring Multiple Perspective Video for Browsing.",
                    "Modeling Dynamic Objects in Video Databases: A Logic Based Approach.",
                    "Pockets of Flexibility in Workflow Specification.",
                    "Agent-Oriented Enterprise Modeling Based on Business Rules.",
                    "A Three-Layer Model for Workflow Semantic Recovery in an Object-Oriented Environment.",
                    "Recognizing Ontology-Applicable Multiple-Record Web Documents.",
                    "Querying Web Information Systems.",
                    "A Conceptual Modelling Framework for Standards-Driven Web-Based Distance Learning.",
                    "XML-schema Dynamic Mapped Multimedia Content Description Tool.",
                    "Constructing a Data Map of Korea Telecom.",
                    "Competency of Set Analysis in CRM Closed Loop Marketing.",
                    "XML-based E2E Test Report Management.",
                    "A Framework for Reusing Business Objects by Multilevel Object Patterns.",
                    "A Mediation System Based on Universal Relation Modeling."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2001w",
                "sub_name": "ER 2001 Workshops, HUMACS, DASWIS, ECOMO, and DAMA, Yokohama Japan, November 27-30, 2001, Revised Papers.",
                "count": 37,
                "papers": [
                    "Participation: The Key to Intelligent Manufacturing Improvement.",
                    "Challenges in Dealing with Human Factors Issues in Manufacturing Activities.",
                    "Extracting E-R Models from Collaboration Analysis Methods, MCM, and CLM.",
                    "Living Manufacturing Systems with Living Organizations.",
                    "A Study on Human-Centric Real-Time Scheduling for PWB Assembly Line.",
                    "The E/S Tool IT-Support for Ergonomic and Sociotechnical System Design.",
                    "Construction of Virtual Working Environment and Evaluation of the Workers.",
                    "Human Models and Data in the Ubiquitous Information Infrastructure.",
                    "Motion Simulation of the Human Workers for the Integrated Computer-Aided Manufacturing Process Simulation Based on Info-Ergonomics Concept.",
                    "Human-Body Motion Simulation Using Bone-Based Human Model and Construction of Motion Database.",
                    "Ontological Commitment for Participative Simulation.",
                    "Dynamic Management Architecture for Human Oriented Production System.",
                    "GeoCosm: A Semantics-Based Approach for Information Integration of Geospatial Data.",
                    "Imposing Modeling Rules on Industrial Applications through Meta-modeling.",
                    "Modelling Ubiquitous Web Applications - The WUML Approach.",
                    "Structuring Web Sites Using Audience Class Hierarchies.",
                    "On the Automatic Extraction of Data from the Hidden Web.",
                    "MIDAS/BD: A Methodological Framework for Web Database Design.",
                    "Translating XQuery into XSLT.",
                    "Web Site Evaluation: Methodology and Case Study.",
                    "Automatic Web Information Extraction in the ROADRUNNER System.",
                    "Querying Relational Databases without Explicit Joins.",
                    "NF-SS: A Normal Form for Semistructured Schema.",
                    "A Formal Analysis of the Lightweight Directory Access Protocol.",
                    "An XML Document Retrieval System Supporting Structure- and Content-Based Queries.",
                    "Extraction of Partial XML Documents Using IR-Based Structure and Contents Analysis.",
                    "XDoC-WFMS: A Framework for Document Centric Workflow Management System.",
                    "Active XML Schemas.",
                    "Behavior Abstraction in Semantic B2B Integration.",
                    "OIL Ontologies for Collaborative Task Performance in Coalitions of Self-Interested Actors.",
                    "A Multi-perspective Methodology for Modelling Inter-enterprise Business Processes.",
                    "Process Patterns to Generate E-commerce Systems.",
                    "Formalising Feasibility and Correctness of Distributed Business Processes.",
                    "Modeling Products for Versatile E-commerce Platforms - Essential Requirements and Generic Design Alternatives.",
                    "Seamless Personalization of E-commerce Applications.",
                    "Discovery of User Preference through Genetic Algorithm and Bayesian Categorization for Recommendation.",
                    "Using the Quantum Data Model to Develop Shareable Definitions."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "19th ER 2000",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/2000",
                "sub_name": "Conceptual Modeling - ER 2000, 19th International Conference on Conceptual Modeling, Salt Lake City, Utah, USA, October 9-12, 2000, Proceedings.",
                "count": 48,
                "papers": [
                    "Data Warehouse Scenarios for Model Management.",
                    "Reflections on Computer Science and Information Systems Research.",
                    "From Entities and Relationships to Social Actors and Dependencies.",
                    "A Pragmatic Method for the Integration of Higher-Order Entity-Relationship Schemata.",
                    "Explicit Modeling of the Semantics of Large Multi-layered Object-Oriented Databases.",
                    "Declarative Mediation in Distributed Systems.",
                    "Temporal Constraints for Object Migration and Behavior Modeling Using Colored Petri Nets.",
                    "SQLST: A Spatio-Temporal Data Model and Query Language.",
                    "TBE: Trigger-By-Example.",
                    "Decomposition by Pivoting and Path Cardinality Constraints.",
                    "IS=DBS+Interaction: Towards Principles of Information System Design.",
                    "A Viewpoint-Based Framework for Discussing the Use of Multiple Modelling Representations.",
                    "Practical Approach to Selecting Data Warehouse Views Using Data Dependencies.",
                    "Semantic Analysis Patterns.",
                    "Tool Support for Reuse of Analysis Patterns - A Case Study.",
                    "Ontological Analysis of Taxonomic Relationships.",
                    "A Conceptual Model for the Web.",
                    "Adapting Materialized Views after Redefinition in Distributed Environments.",
                    "On Warehousing Historical Web Information.",
                    "On Business Process Model Transformations.",
                    "Toward Use Case and Conceptual Models through Business Modeling.",
                    "A Conceptual Modeling Framework for Multi-agent Information Systems.",
                    "Object Role Modelling and XML-Schema.",
                    "Constraints-Preserving Transformation from XML Document Type Definition to Relational Schema.",
                    "X-Ray - Towards Integrating XML and Relational Database Systems.",
                    "A Conceptual Model for Remote Data Acquisition Systems.",
                    "A Modeling Language for Design Processes in Chemical Engineering.",
                    "VideoGraph: A Graphical Object-Based Model for Representing and Querying Video Data.",
                    "Object-Oriented Modelling in Practice: Class Model Perceptions in the ERM Context.",
                    "ROVER: A Framework for the Evolution of Relationships.",
                    "Improving the Reuse Possibilities of the Behavioral Aspects of Object-Oriented Domain Models.",
                    "Algebraic Database Migration to Object Technology.",
                    "A Layered Software Specification Architecture.",
                    "A Reuse-Based Object-Oriented Framework Towards Easy Formulation of Complex Queries.",
                    "Evaluating the Quality of Reference Models.",
                    "Measures for Assessing Dynamic Complexity Aspects of Object-Oriented Conceptual Schemes.",
                    "Measuring the Quality of Entity Relationship Diagrams.",
                    "Behavior Consistent Inheritance in UML.",
                    "The Viewpoint Abstraction in Object-Oriented Modeling and the UML.",
                    "XML Conceptual Modeling Using UML.",
                    "Metadata Engineering for Corporate Portals Using XML.",
                    "The Role of Information Resource Management in Managing a Corporate Portal.",
                    "The Five-Tier Five-Schema Concept.",
                    "Documenting Meta Data Transformations.",
                    "Advanced Data Model Patterns.",
                    "Information Quality at Every Stage of the Information Chain.",
                    "A Fact-Oriented Approach to Business Rules.",
                    "Personalized Digests of Sports Programs Using Intuitive Retrieval and Semantic Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/er/2000w",
                "sub_name": "Conceptual Modeling for E-Business and the Web, ER 2000 Workshops on Conceptual Modeling Approaches for E-Business and The World Wide Web and Conceptual Modeling, Salt Lake City, Utah, USA, October 9-12, 2000, Proceedings.",
                "count": 15,
                "papers": [
                    "Towards Ontology-Based Harmonization of Web Content Standards.",
                    "The M*-COMPLEX Approach to Enterprise Modeling, Engineering, and Integration.",
                    "Conceptual Design of Electronic Product Catalogs Using Object-Oriented Hypermedia Modeling Techniques.",
                    "Generic Linear Business Process Modeling.",
                    "Business Modelling Is Not Process Modelling.",
                    "Modeling Electronic Workflow Markets.",
                    "Building Multi-device, Content-Centric Applications Using WebML and the W3I3 Tool Suite.",
                    "Abstraction and Reuse Mechanisms in Web Application Models.",
                    "From Web Sites to Web Applications: New Issues for Conceptual Modeling.",
                    "Using Webspaces to Model Document Collections on the Web.",
                    "Modeling Interactions and Navigation in Web Applications.",
                    "A General Methodological Framework for the Development of Web-Based Information Systems.",
                    "Managing RDF Metadata for Community Webs.",
                    "An Example-Based Environment for Wrapper Generation.",
                    "Flexible Category Structure for Supporting WWW Retrieval."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "18th ER 1999",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/er/99",
                "sub_name": "Conceptual Modeling - ER '99, 18th International Conference on Conceptual Modeling, Paris, France, November, 15-18, 1999, Proceedings.",
                "count": 36,
                "papers": [
                    "Three Levels of Reuse for Supporting the Evolution in Object Databases.",
                    "A Unified Framework for Supporting Dynamic Schema Evolution in Object Databases.",
                    "An Incremental and Semi-automatic Method Inheritance Graph Hierarchy Construction.",
                    "Developing an Object-Oriented Video Database System with Spatio-Temporal Reasoning Capabilities.",
                    "Entity Evolution in ISA Hierarchies.",
                    "Temporal ER Modeling with Description Logics.",
                    "Automatic Migration and Wrapping of Database Applications - A Schema Transformation Approach.",
                    "A Methodology for Clustering Entity Relationship Models - A Human Information Processing Approach.",
                    "Designing Good Semi-Structured Databases and Conceptual Modeling.",
                    "Building Views over Semistructured Data Sources.",
                    "Modeling and Maintaining Multi-View Data Warehouses.",
                    "Object Views through Search Views of Web Datasources.",
                    "Understanding and Modelling Business Processes with DEMO.",
                    "A Methodology for Building a Repository of Object-Oriented Design Fragments.",
                    "An Algorithm to Extract IS-A Inheritance Hierarchies from a Relational Database.",
                    "DOTS: a Generic Infrastructure for Decision-Oriented Task Support.",
                    "Dockets: A Model for Adding Value to Content.",
                    "Workflow Specification in TRAMs.",
                    "From CASE to CARE (Computer-Aided Requirements Engineering).",
                    "Solving the Problem of Semantic Heterogeneity in Defining Mediator Update Translators.",
                    "A Method for Requirements Elicitation and Formal Specification.",
                    "Dealing with Semantic Heterogeneity During Data Integration.",
                    "Detecting Redundancy in Data Warehouse Evolution.",
                    "Modelling Data Warehouses and OLAP Applications by Means of Dialogue Objects.",
                    "Resolving the \"Weak Status\" of Weak Entity Types in Entity-Relationships Schemas.",
                    "A Taxonomy of Recursive Relationships and Their Structural Validity in ER Modeling.",
                    "Extending Functional Dependencies in Indefinite Sequence Relations.",
                    "View Integration of Object Life-Cycles in Object-Oriented Design.",
                    "Towards an Automatic Integration of Statecharts.",
                    "Design Support for Database Federations.",
                    "Operational Characterization of Genre in Literary and Real-life Domains.",
                    "Contextualization as an Abstraction Mechanism for Conceptual Modelling.",
                    "Architectures for Evaluating the Quality of Information Models - a Meta and an Object Level Comparison.",
                    "XML-based Components for Federating Multiple Heterogeneous Data Sources.",
                    "A Process-Integrated Conceptual Design Environment for Chemical Engineering.",
                    "ER Model, XML and the Web."
                ]
            },
            {
                "sub_name_abbr": "conf/er/99w",
                "sub_name": "Advances in Conceptual Modeling: ER '99 Workshops on Evolution and Change in Data Management, Reverse Engineering in Information Systems, and the World Wide Web and Conceptual Modeling, Paris, France, November 15-18, 1999, Proceedings.",
                "count": 30,
                "papers": [
                    "Handling Evolving Data Through the Use of a Description Driven Systems Architecture.",
                    "Evolution of Schema and Individuals of Configurable Products.",
                    "Updates and Application Migration Support in an ODMG Temporal Extension.",
                    "ODMG Language Extensions for Generalised Schema Versioning Support.",
                    "Transposed Storage of an Object Database to Reduce the Cost of Schema Changes.",
                    "A Survey of Current Methods for Integrity Constraint Maintenance and View Updating.",
                    "Specification and Implementation of Temporal Databases in a Bitemporal Event Calculus.",
                    "Schema Versioning for Archives in Database Systems.",
                    "Modeling Cyclic Change.",
                    "On the Ontological Expressiveness of Temporal Extensions to the Entity-Relationship Model.",
                    "Semantical Change Patterns in the Conceptual Schema.",
                    "The BRIDGE: A Toolkit Approach to Reverse Engineering System Metadata in Support of Migration to Entreprise Software.",
                    "Data Structure Extraction in Database Reverse Engineering.",
                    "Documenting Legacy Relational Databases.",
                    "Relational Database Reverse Engineering: Elicitation of Generalization Hierarchies.",
                    "A Tool to Reengineer Legacy Systems to Object-Oriented Systems.",
                    "CAPPLES - A Capacity Planning and Performance Analysis Method for the Migration of Legacy Systems.",
                    "Reuse of Database Design Decisions.",
                    "Modeling Interactive Web Sources for Information Mediation.",
                    "Web Application Models Are More Than Conceptual Models.",
                    "E/R Based Scenario Modeling for Rapid Prototyping of Web Information Services.",
                    "Models for Superimposed Information.",
                    "Formalizing the Specification of Web Applications.",
                    "\"Modeling-by-Patterns\" of Web Applications.",
                    "A Unified Framework for Wrapping, Mediating and Restructuring Information from the Web.",
                    "Semantically Accessing Documents Using Conceptual Model Descriptions.",
                    "Knowledge Discovery for Automatic Query Expansion on the World-Wide Web.",
                    "KnowCat: A Web Application for Knowledge Organization.",
                    "Metamodeling for Web-Based Teachware Management.",
                    "Data Warehouse Design for E-Commerce Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/er/1997cm",
                "sub_name": "Conceptual Modeling, Current Issues and Future Directions, Selected Papers from the Symposium on Conceptual Modeling, Los Angeles, California, USA, held before ER'97.",
                "count": 23,
                "papers": [
                    "Current Issues of Conceptual Modeling: A Summary of Selective Active Research Topics.",
                    "Conceptual Design of Parallel Systems.",
                    "Conceptual Modeling Challenges for Model-Based Architecting and Software Engineering (MBASE).",
                    "Deriving Global Conceptual Views from Multiple Information Sources.",
                    "From Ancient Egyptian Language to Future Conceptual Modeling.",
                    "Breaking the Database out of the Box: Models for Superimposed Information (Position Paper).",
                    "Narratives and Temporal Databases: An Interdisciplinary Perspective.",
                    "Using Conceptual Modeling and Intelligent Agents to Integrate Semi-structured Documents in Federated Databases.",
                    "Supporting the User: Conceptual Modeling & Knowledge Discovery.",
                    "Are Global Understanding, Communication, and Information Management in Information Systems Possible?",
                    "Enterprise Knowledge Management and Conceptual Modelling.",
                    "Semantic Modeling in Accounting Education, Practice, and Research: Some Progress and Impediments.",
                    "Perspectives in Modeling: Simulation, Database, and Workflow.",
                    "The Challenges of Modeling Biological Information for Genome Databases.",
                    "Trends and Scale-Up for Data Administration.",
                    "Conceptual Modeling for Multiagent Systems: Applying Interaction-Oriented Programming.",
                    "Data and What They Refer to.",
                    "The Strength of ER Modeling.",
                    "Interaction as a Framework for Modeling.",
                    "A Summary of the ER'97 Workshop on Behavioral modeling.",
                    "What Is the Role of Cognition in Conceptual Modeling? A Report on the First Workshop on Cognition and Conceptual Modeling.",
                    "Conceptual Modeling in Multimedia Information Seeking.",
                    "Future Directions of Conceptual Modeling."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "17th ER 1998",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/er/98",
                "sub_name": "Conceptual Modeling - ER '98, 17th International Conference on Conceptual Modeling, Singapore, November 16-19, 1998, Proceedings.",
                "count": 36,
                "papers": [
                    "The Rise, Fall and Return of Software Industry in Japan.",
                    "Conceptual Design and Development of Information Services.",
                    "An EER-Based Conceptual Model and Query Language for Time-Series Data.",
                    "Chrono: A Conceptual Design Framework for Temporal Entities.",
                    "Designing Well-Structured Websites: Lessons to Be Learned from Database Schema Methodology.",
                    "Formalizing the Informational Content of Database User Interfaces.",
                    "A Conceptual-Modeling Approach to Extracting Data from the Web.",
                    "Information Coupling in Web Databases.",
                    "Structure-Based Queries over the World Wide Web.",
                    "Integrated Approach for Modelling of Semantic and Pragmatic Dependencies of Information Systems.",
                    "Inference of Aggregate Relationships through Database Reverse Engineering.",
                    "On the Consistency of Int-cardinality Constraints.",
                    "Realizing Next Generation Internet Applications: Are There Genuine Research Problems, Or Is It Advanced Product Development? (Panel).",
                    "Web Sites Need Models and Schemes.",
                    "ARTEMIS: A Process Modeling and Analysis Tool Environment.",
                    "From Object Oriented Conceptual Modeling to Automated Programming in Java.",
                    "An Evaluation of Two Approaches to Exploiting Real-World Knowledge by Intelligent Database Design Models.",
                    "Metrics for Evaluating the Quality of Entity Relationship Models.",
                    "A Transformational Approach to Correct Schema Refinements.",
                    "The Guidelines of Modeling - An Approach to Enhance the Quality in Information Models.",
                    "Improving the Quality of Entity Relationship Models - Experience in Research and Practice.",
                    "The TROLL Approach to Conceptual Modeling: Syntax, Semantics and Tools.",
                    "Process Failure in a Rapidly Changing High-Tech Organisation: A System Dynamics View.",
                    "ROL2: A Real Deductive Object-Oriented Database Language.",
                    "Multiobjects to Ease Schema Evolution in an OODBMS.",
                    "Implementation of Automatic Lock Determination in C++-based OODBMSs.",
                    "Do We Need Information Modeling for the Information Highway? (Panel).",
                    "Design and Analysis of Quality Information for Data Warehouses.",
                    "Data Warehouse Schema and Instance Design.",
                    "Reducing Algorithms for Materialized View Updates.",
                    "Reengineering Conventional Data and Process Models with Business Object Models: A Case Study Based on SAP R/3 and UML.",
                    "An Active Conceptual Model for Fixed Income Securities Analysis for Multiple Financial Institutions.",
                    "An Entomological Collections Database Model for INPA.",
                    "A Global Object Model for Accommodating Instance Heterogeneities.",
                    "On Formalizing the UML Object Constraint Language OCL.",
                    "Derived Horizontal Class Partitioning in OODBs: Design Strategies, Analytical Model and Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/er/98w",
                "sub_name": "Advances in Database Technologies, ER '98 Workshops on Data Warehousing and Data Mining, Mobile Data Access, and Collaborative Work Support and Spatio-Temporal Data Management, Singapore, November 19-20, 1998, Proceedings.",
                "count": 51,
                "papers": [
                    "A Fuzzy Attribute-Oriented Induction Method for Knowledge Discovery in Relational Databases.",
                    "Fast Methods with Magic Sampling for Knowledge Discovery in Deductive Databases with Large Deduction Results.",
                    "A Heuristic Method for Correlating Attribute Group Pairs in Data Mining.",
                    "Incremental Meta-Mining from Large Temporal Data Sets.",
                    "On the Suitability of Genetic-Based Algorithms for Data Mining.",
                    "Data Visualization in a Web Warehouse.",
                    "Recent Advances and Research Problems in Data Warehousing.",
                    "Web Warehousing: Design and Issues.",
                    "Extending the E/R Model for the Multidimensional Paradigm.",
                    "Numerical Aspects in the Data Model of Conceptual Information Systems.",
                    "Nested Data Cubes for OLAP (Extended Abstract).",
                    "Data Warehousing and Data Mining: Are We Working on the Right Things?",
                    "The Design of an Engineering Data Warehouse Based on Meta-Object Structures.",
                    "Two Version Concurrency Control Algorithm with Query Locking for Decision Support.",
                    "An Efficient View Maintenance Algorithm for Data Warehousing.",
                    "Adaptive Cache Validation for Mobile File Systems.",
                    "Broadcast Strategies to Maintain Cached Data for Mobile Computing System.",
                    "Web Content Delivery to Heterogeneous Mobile Platforms.",
                    "Dynamic Data Delivery in Wireless Communication Environments.",
                    "Scalable Invalidation-Based Processing of Queries in Broadcast Push Delivery.",
                    "Timestamps to Detect R-W Conflicts in Mobile Computing.",
                    "Rumor: Mobile Data Access Through Optimistic Peer-to-Peer Replication.",
                    "A Copy Update Mechanism for a Mobile Information Announcement System.- Transmitting Non-storage Type Resources with Redundancy -.",
                    "Toward Optimal Replication for Hierarchical Location Management in Wireless Systems.",
                    "Distributed Control of Mobile ATM Networks Using CORBA.",
                    "New Thoughts on Effects of TCP Slow Start and FEC Coding in WATM Access Networks.",
                    "A Centralised Cellular Database to Support Network Management Process.",
                    "Security of Current Mobile IP Solutions.",
                    "An Active Database Framework for Adaptive Mobile Data Access.",
                    "Design and Implementation of a Mobile Application Support System.",
                    "Proposition of an Identification Service on a Hybrid WLAN with Mobiles Stations.",
                    "A Dynamic Navigation System Based on User's Geographical Situation.",
                    "Summary of Panel Discussion: Future of Mobile Computing - Convergence of Research and Applications.",
                    "A Web Solution to Concurrency Awareness in Shared Data Spaces.",
                    "Structured Message Management for Group Interaction.",
                    "Group Activity Database for Groupware Evolution.",
                    "Supporting Collaborative Work by Process-Based Transaction Model.",
                    "A Cooperative Distributed Text Database Management Method Unifying Search and Compression Based on the Burrows-Wheeler Transformation.",
                    "Constructing Structured Document Views.",
                    "Temporal Objects for Spatio-Temporal Data Models and a Comparison of Their Representations.",
                    "The Temporal Set-Theory, Tropology and Their Application in Spatiotemporal Modelling.",
                    "TimeCube-Efficient Storage, Access and Analysis of Temporal (Historical) Data.",
                    "Proposal of Spatio-Temporal Indexing Methods for Moving Objects.",
                    "Spatio-Temporal Data Management for Moving Objects Using the PMD-Tree.",
                    "Implementing Sequoia 2000 Benchmark on Shusse-Uo and Its Performance.",
                    "A Spatiotemporal Query Processor Based on Simplicial Representation.",
                    "Implementing Class Library and Index for Managing Spatio-Temporal Data.",
                    "A Spatiotemporal Data Management Method Using Inverse Differential Script.",
                    "Extracting Event Semantics from Video Data Based on Real World Database.",
                    "Structured Modeling for Video Databases.",
                    "Applying Unsupervised Fuzzy C-Prototypes Clustering in Motion-Based Segmentation."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "16th ER 1997",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/97",
                "sub_name": "Conceptual Modeling - ER '97, 16th International Conference on Conceptual Modeling, Los Angeles, California, USA, November 3-5, 1997, Proceedings.",
                "count": 36,
                "papers": [
                    "From Conceptual Modeler to University President.",
                    "An Ontology for Database Design Automation.",
                    "Exploiting Domain Knowledge During the Automated Design of Object-Oriented Databases.",
                    "Intelligent Support for Retrieval and Synthesis of Patterns for Object-Oriented Design.",
                    "A Conceptual Development Framework for Temporal Information Systems.",
                    "Temporal Features of Class Populations and Attributes in Conceptual Models.",
                    "Managing Schema Evolution Using a Temporal Object Model.",
                    "Distributed Object Repositories: Concepts and Standards.",
                    "Extended SQL Support for Uncertain Data.",
                    "Conceptual Queries Using ConQuer-II.",
                    "Transaction-Based Specification of Database Evolution.",
                    "Well-Behaving Rule Systems for Entity-Relationship and Object-Oriented Models.",
                    "Behavior Consistent Refinement of Object Life Cycles.",
                    "ActivityFlow: Towards Incremental Specification and Flexible Coordination of Workflow Activities.",
                    "Silver Bullet Shy on Legacy Mountain: When Neat Technology Just Doesn't Work - or - Miracles to Save the Realm: Faustian Bargains or Noble Pursuits.",
                    "A Multi-Level Architecture for Representing Enterprise Data Models.",
                    "A Data Model for Customizing DB Schemas Based on Business Policies.",
                    "Explaining Conceptual Models - An Architecture and Design Principles.",
                    "Extending an Object-Oriented Model: Multiple Class Objects.",
                    "A Formal Approach to Metamodeling: A Generic Object-Oriented Perspective.",
                    "Associations and Roles in Object-Oriented Modeling.",
                    "Property Covering: A Powerful Construct for Schema Derivations.",
                    "Inheritance Graph Hierarchy Construction Using Rectangular Decomposition of a Binary Relation and Designer Feedback.",
                    "Towards an Object Database Approach for Managing Concept Lattices.",
                    "An Experience of Integration of Conceptual Schemas in the Italian Public Administration.",
                    "Application-Oriented Design of Behavior: A Transformational Approach Using RADD.",
                    "A Java-Based Framework for Processing Distributed Objects.",
                    "Fragmentation Techniques for Distributing Object-Oriented Databases.",
                    "An Agent-Based Mobile System.",
                    "Successful Practices in Developing a Complex Information Model.",
                    "Resolving Constraint Conflicts in the Integration of Entity-Relationship Schemas.",
                    "A Formal Framework for ER Schema Transformation.",
                    "A Generative Approach to Database Federation.",
                    "A Virtual Reality Interface to an Enterprise Metadatabase.",
                    "A Fully Flexible CAME in a CASE Environment.",
                    "A Rapid Development Model for Meta-CASE Tool Design."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "15th ER 1996",
        "info": "Cottbus, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/er/96",
                "sub_name": "Conceptual Modeling - ER'96, 15th International Conference on Conceptual Modeling, Cottbus, Germany, October 7-10, 1996, Proceedings.",
                "count": 32,
                "papers": [
                    "Impact of Object Oriented Thinking on ER Modeling.",
                    "Translation Schemes and the Fundamental Problem of Database Design.",
                    "Schema Design and Knowledge Discovery (Abstract).",
                    "Decomposition of Relationships through Pivoting.",
                    "Understanding Implementations of IS-A Relations.",
                    "Deductive Object Oriented Schemas.",
                    "Verification Problems in Conceptual Workflow Specifications.",
                    "Process Knowledge Modeling.",
                    "The Conceptual Database Design Optimizer CoDO - Concepts, Implementation, Application.",
                    "ConQuer: A Conceptual Query Language.",
                    "Using Structural Recursion as Query Mechanism for Data Models with References.",
                    "A Modular Design Strategy for a Flexible Graphical Database Design Environment: An Experimental Study.",
                    "Graph Based Modeling and Implementation with EER / GRAL.",
                    "On the Applicability of Schema Integration Techniques to Database Interoperation.",
                    "Integration of Inheritance Trees as Part of View Generation For Database Federations.",
                    "A Formal Basis for Dynamic Schema Integration.",
                    "Graphical Entity Relationship Models: Towards a More User Understandable Representation of Data.",
                    "Benefits and Quality of Data Modelling - Results of an Empirical Analysis.",
                    "Normative Language Approach - A Framework for Understanding.",
                    "Improving Quality in Conceptual Modelling by the Use of Schema Transformations.",
                    "An Approach to Maintaining Optimized Relational Representations of Entity-Relationship Schemas.",
                    "Transforming Conceptual Models to Object-Oriented Database Designs: Practicalities, Properties, and Peculiarities.",
                    "Representing Partial Spatial Information in Databases.",
                    "Specification of Calendars and Time Series for Temporal Databases.",
                    "View-Centered Conceptual Modelling - An Object-Oriented Approach.",
                    "Reverse Engineering of Relational Database Physical Schema.",
                    "Extracting N-ary Relationships Through Database Reverse Engineering.",
                    "Inheritance as a Conceptual Primitive.",
                    "iO2 - An Algorithmic Method for Building Inheritance Graphs in Object Database Design.",
                    "Workflow Evolution.",
                    "A Model for Classification Structures with Evolution Control.",
                    "Integrating Versions in the OMT Models."
                ]
            },
            {
                "sub_name_abbr": "conf/er/96w1",
                "sub_name": "Proccedings of the Workshop ER CASE Tools, Research Track, 15th International Conference on Conceptual Modeling, Cottbus, Germany, October 10, 1996.",
                "count": 6,
                "papers": [
                    "Title, Table of Contents.",
                    "Impact of Object Oriented Thinking on ER Data Modeling.",
                    "Conceptual Modeling in KARL and G-KARL.",
                    "Managing Large Entity-Relationship Diagrams.",
                    "A Tool for Mapping Binary Relationship Diagrams to Object Oriented Database Schemas.",
                    "Entwurf einer objektorientierten Anfragesprache und deren Tramsformation in SQL-Anweisungen."
                ]
            },
            {
                "sub_name_abbr": "conf/er/96w2",
                "sub_name": "Proccedings of the Workshop Challenges of Application and Challenges of Design, 15th International Conference on Conceptual Modeling, Cottbus, Germany, October 9, 1996.",
                "count": 15,
                "papers": [
                    "Title, Table of Contents.",
                    "Spreadsheet-Based Model Building and Multiple Criteria Group Evaluation Support.",
                    "A Concept-Case Knowledge Model for Conceptual Database Design.",
                    "NIAM/OR Modeling: Student and Expert Solutions.",
                    "Structural Report and Structural Editor - Information Systems in Civil Engineering.",
                    "CUP Architecture for Developing Information Services.",
                    "A Generalized Model for Data: A Nested Relational Approach.",
                    "Self-Stabilization in Database Consistency Maintenance.",
                    "On Using Enterprise Models in Resource Discovery.",
                    "On Semantics of Context in Functional Constraints.",
                    "Modeling Consensus Knowledge from Multiple Sources Based on Semantics of Concepts.",
                    "Taxinomic Reasoning in Schema Translation.",
                    "Functional Data Model and a Query Language for Multimedia Databases.",
                    "Toward a Methodology for a Totally Supported Knowledge Elicitation through Human-Machine Interaction.",
                    "Global Cardinality Constraints."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "14th OO-ER 1995",
        "info": "Bond University, Gold Coast, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/er/95",
                "sub_name": "OOER'95: Object-Oriented and Entity-Relationship Modelling, 14th International Conference, Gold Coast, Australia, December 12-15, 1995, Proceedings.",
                "count": 45,
                "papers": [
                    "Modelling and System Maintenance.",
                    "Adaptive Schema Design and Evaluation in an Object-Oriented Information System.",
                    "Assertion of Consistency Within a Complex Object Database Using a Relationship Construct.",
                    "A Cryptographic Mechanism for Object-Instance-Based Authorization in Object-Oriented Database Systems.",
                    "Unifying Modelling and Programming through an Active, Object-Oriented, Model-Equivalent Programming Language.",
                    "A Declarative Query Approach to Object Identification.",
                    "Versatile Querying Facilities for a Dynamic Object Clustering Model.",
                    "Reverse Engineering of Relational Database Applications.",
                    "A Rigorous Approach to Schema Restructuring.",
                    "Managing Schema Changes in Object-Relationship Databases.",
                    "Behavioural Constraints Using Events.",
                    "Behavior Consistent Extension of Object Life Cycles.",
                    "COLOR-X Event Model: Integrated Specification of the Dynamics of Individual Objects.",
                    "Database Design with Behavior and Views Using Parameterized Petri Nets.",
                    "SEER: Security Enhanced Entity-Relationship Model for Modeling and Integrating Secure Database Environments.",
                    "Neural Network Technology to Support View Integration.",
                    "Database Schema Transformation and Optimization.",
                    "Mapping an Extended Entity-Relationship Schema into a Schema of Complex Objects.",
                    "Binary Representations of Ternary Relationships in ER Conceptual Modelling.",
                    "Variable Sets and Functions Framework for Conceptual Modeling: Integrating ER and OO via Sketches with Dynamic Markers.",
                    "A Logic Framework for a Semantics of Object-Oriented Data Modeling.",
                    "Object-Oriented Meta Modelling.",
                    "A Conceptual Model for Business Re-Engineering Methods and Tools.",
                    "Data Model Evolution as Basis of Business Process Management.",
                    "Re-Engineering Processes in Public Administration.",
                    "Uniqueness Conditions for ER Representations.",
                    "Rapid Prototyping: An Integrated CASE Based Approach.",
                    "Integrating and Supporting Entity Relationship and Object Role Models.",
                    "From Object Specification towards Agent Design.",
                    "Conceptual Modelling of WorkFlows.",
                    "An object oriented approach for CSCW system design.",
                    "Semantics of Time-Varying Attributes and their Use for Temporal Database Design.",
                    "Handling Change Management using Temporal Active Repositories.",
                    "A Visual Query Editor for Temporal Databases.",
                    "Managing Object Identity in Federated Database Systems.",
                    "Management of Inconsistent Information in Federated Systems.",
                    "Resolving Structural Conflicts in the Integration of Entity Relationship Schemas.",
                    "Use and Control of Data Models: A Repository Approach.",
                    "The Seven Habits of Highly Effective Data Modelers (and Object Modelers).",
                    "Object responsibility categories in Support of Top-Down Object Discovery.",
                    "Denormalisation as an OO Extension.",
                    "Development of Financial Markets Analytical Product: A MOSES Case Study.",
                    "The Practice of Nuclear Integrated Design and Enginerring Database Establishment using OO DBMS.",
                    "Application of \"Consistency Dependency\" to Corporate and Project Information Models.",
                    "The Use of Agglomerative Categorisation to Build a Conceptual View of Statistical Data."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "13th ER 1994",
        "info": "Manchester, U.K.",
        "venues": [
            {
                "sub_name_abbr": "conf/er/94",
                "sub_name": "Entity-Relationship Approach - ER'94, Business Modelling and Re-Engineering, 13th International Conference on the Entity-Relationship Approach, Manchester, UK, December 13-16, 1994, Proceedings.",
                "count": 34,
                "papers": [
                    "Reflections on the Relationship Between BPR and Software Process Modelling.",
                    "Specifying Business Processes over Objects.",
                    "Deriving Complex Structured Object Types for Business Process Modelling.",
                    "Business Process Modelling in the Workflow-Management Environment Leu.",
                    "An Assisting Method for Enterprise-wide Conceptual Data Modelling using the Bottom-up Approach.",
                    "Organisational and Information System Modelling for Information Systems Requirement Determination.",
                    "What Makes a Good Data Model? Evaluating the Quality of Entity Relationship Models.",
                    "Database Evolution: the DB-Main Approach.",
                    "Database Schema Evolution through the Specification and Maintenance of Changes on Entities and Relationships.",
                    "Method Restructuring and Consistency Checking for Object-Oriented Schemas.",
                    "State-Conditioned Semantics in Databases.",
                    "Modelling Constraints with Exceptions in Object-Oriented Databases.",
                    "Declarative Specification of Constraint Maintenance.",
                    "On the Representation of Objects with Polymorphic Shape and Behaviour.",
                    "A Normal Form Object-Oriented Entity Relationship Diagram.",
                    "COMan - Coexistence of Object-Oriented and Relational Technology.",
                    "Cardinality Consistency of Derived Objects in DOOD Systems.",
                    "Conceptual Modelling and Manipulation of Temporal Databases.",
                    "Process Repositories: Models and Experiences.",
                    "A Formal Software Specification Tool Using the Entity-Relationship Model.",
                    "An Overview of the Lawrence Berkeley Laboratory Extended Entity-Relationship Database Tools.",
                    "A Generic Data Model for the Support of Multiple User Interaction Facilities.",
                    "Using Queries to Improve Database Reverse Engineering.",
                    "Reconstruction of ER Schema from Database Applications: a Cognitive Approach.",
                    "Extracting an Entity Relationship Schema from a Relational Database through Reverse Engineering.",
                    "Levelled Entity Relationship Model.",
                    "Formalised Conceptual Models as a Foundation of Information Systems Development.",
                    "Abstraction Levels for Entity-Relationship Schemas.",
                    "Coordination System Modelling.",
                    "Virtual Structures - A Technique for Supporting Scientific Database Applications.",
                    "Resolving Fragmentation Conflicts in Schema Integration.",
                    "An Executable Meta Model for Re-Engineering of Database Schemas.",
                    "From E-R to \"A-R\" - Modelling Strategic Actor Relationships for Business Process Reengineering.",
                    "Standard-Driven Re-Engineering of Entity-Relationship Schemas."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "12th ER 1993",
        "info": "Arlington, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/93",
                "sub_name": "Entity-Relationship Approach - ER'93, 12th International Conference on the Entity-Relationship Approach, Arlington, Texas, USA, December 15-17, 1993, Proceedings.",
                "count": 41,
                "papers": [
                    "The Object Flow Model: A Formal Framework for Describing the Dynamic Construction, Destruction and Interaction of Complex Objects.",
                    "On Complex Objects and Versioning in Complex Environments.",
                    "Application and System Prototyping Via an Extensible Object-Oriented Environment.",
                    "Reflection in a Uniform Behavioral Object Model.",
                    "Relative Constraints in ER Data Models.",
                    "Design and Implementation of Derived Entities.",
                    "Searching for Compositions in ER Schemes.",
                    "Enhancing the Quality of Conceptual Database Specifications through Validation.",
                    "Functional Dependencies Generalized for Temporal Databases that Include Object-Identity.",
                    "Temporal Extensions to a Uniform Behavioral Object Model.",
                    "TOOSQL - A Temporal Object-Oriented Query Language.",
                    "A Taxonomy for Schema Versioning Based on the Relational and Entity Relationship Models.",
                    "Neighborhood/Conceptual Query Answering with Imprecise/Incomplete Data.",
                    "The Entity-Relationship Model for Multilevel Security.",
                    "HDM2: Extending the E-R Approach to Hypermedia Application Design.",
                    "Database Schema Design: A Perspective From Natural Language Techniques to Validation and View Integration.",
                    "Transformation of Requirement Specifications Expressed in Natural Language into an EER Model.",
                    "A Commonsense Reasoning Facility Based on the Entity-Relationship Model.",
                    "DETERM: Deterministic Event-Tuned Entity-Relationship Modeling.",
                    "A Semantic Comparison of the Modelling Capabilities of the ER and NIAM Models.",
                    "From Entity-Relationship Models to Role-Attribute Models.",
                    "Analysis of Binary Relationships within Ternary Relationships in ER Modeling.",
                    "Using Conceptual Graph Theory to Support Schema Integration.",
                    "Integration of Heterogeneous Object Schemas.",
                    "The Role of Metamodels in Federating System Modelling Techniques.",
                    "Multilevel Schema Integration.",
                    "Reuse of Object-Oriented Requirements Specifications.",
                    "Performance Evaluation of Reverse Engineering Relational Databases into Extended Entity-Relationship Models.",
                    "Schema Transformation Techniques for Database Reverse Engineering.",
                    "Integrating the ER Approach in an OO Environment.",
                    "An Extended Entity-Relationship Approach to Data Management in Object-Oriented Systems.",
                    "On Mapping ER Models into OO Schemas.",
                    "A Repository Meta Model for Interactive Systems.",
                    "ER-based Information Retrieval in a Mixed Database Environment.",
                    "Framework For Automatic Clustering of Semantic Models.",
                    "Extending ER Model Clustering by Relationship Clustering.",
                    "Semantic Interoperability of Multitemporal Relational Databases.",
                    "Modeling Time: Adequacy of Three Distinct Time Concepts for Temporal Databases.",
                    "Towards a Unifying Logic Formalism for Semantic Data Models.",
                    "Knowledge-Based Approach for Abstracting Hierarchical and Network Schema Semantics.",
                    "A State-Space Approach for Database Redesign."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "11th ER 1992",
        "info": "Karlsruhe, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/er/92",
                "sub_name": "Entity-Relationship Approach - ER'92, 11th International Conference on the Entity-Relationship Approach, Karlsruhe, Germany, October 7-9, 1992, Proceedings.",
                "count": 26,
                "papers": [
                    "ER vs. OO.",
                    "The Next Ten Years of Modeling, Methodologies, and Tools.",
                    "Fundamentals of Cardinality Constraints.",
                    "Evaluation of Complex Cardinality Constraints.",
                    "Local Referential Integrity.",
                    "Entity Tree Clustering - A Method for Simplifying ER Designs.",
                    "A Temporal Statistical Model for Entity-Relationship Schemas.",
                    "Semantic Similarity Relations in Schema Integration.",
                    "Classifying and Reusing Conceptual Schemas.",
                    "Embedding Data Modelling in a Gerneral Architecture for Integrated Information Systems.",
                    "The Use of a Lexicon to Interpret ER-Diagrams: A LIKE project.",
                    "An Entity-Relationship-Based Methodology for Distributed Database Design: An Integrated Approach Towards Combined Logical and Distribution Designs.",
                    "A Specification-Based Data Model.",
                    "Data Dictionary Design: A Logic Programming Approach.",
                    "Nesting Quantification in a Visual Data Manipulation Language.",
                    "An EER Prototyping Environment and its Implemetation in a Datalog Language.",
                    "A Theory for Entity-Relationship View Updates.",
                    "Transforming Conceptual Data Models into an Object Model.",
                    "Meta Object Management and its Application to Database Evolution.",
                    "Modelling of Audio/Video Data.",
                    "SUPER - Visual Interaction with an Object-Based ER Model.",
                    "Natural Language Restatement of Queries Expressed in a Graphical Language.",
                    "A Temporal Query Language Based on Conceptual Entities and Roles.",
                    "A Design Methodology for Object Oriented Databases.",
                    "\"Part\" Relations for Object-Oriented Databases.",
                    "Unified Class Evolution by Object-Oriented Views."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "10th ER 1991",
        "info": "San Mateo, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/91",
                "sub_name": "Proceedings of the 10th International Conference on Entity-Relationship Approach (ER'91), 23-25 October, 1991, San Mateo, California, USA.",
                "count": 40,
                "papers": [
                    "Cardinality Constraints in Entity-Relationship Modeling.",
                    "The ORAC Model: A Unified View of Data Abstraction.",
                    "ER-R: An Enhanced ER Model with Situation-Action Rules to Capture Application Semantics.",
                    "Commonsense Reasoning in Database Design.",
                    "Rapid Prototyping of Conceptual Database Design on a Relational Database Management System.",
                    "Creative Data Modelling - Encouraging Innovation in Data Design.",
                    "Abbreviation Techniques in Entity-Relationship Query Languages.",
                    "A Logic Based Approach to Schema Integration.",
                    "Towards Temporal Extensions to the Entity-Relationship Model.",
                    "The Entity-Relationship Time Model and the Conceptual Rule Language.",
                    "TOODM - A Temporal Object-Oriented Data Model with Temporal Constraints.",
                    "An Algorithm Converting Relational Schemas to Nested Entity-Relationship Schemas.",
                    "ER-T Diagrams: An Approach to Specifying Database Transactions.",
                    "Semantic Modelling of an Accounting Universe of Discourse: The Usefulness of Inter-Relation Constraints.",
                    "Cooperation Contracts.",
                    "Language Features for Object-Oriented Conceptual Modelling.",
                    "Semantic Modelling and Object-Oriented Modelling: Two Complementary Paradigms.",
                    "On the Notion of Concept.",
                    "Representation and Processing of Uncertain Information in Relational Databases.",
                    "A Language for Specifying Static and Dynamic Integrity Constraints.",
                    "Schema Conversion Rules Between EER and NIAM Models.",
                    "Bridging the Gap Between O-O and E-R.",
                    "From Entity-Relationship Diagram to an Object-Oriented Database.",
                    "A View Integration Approach for the Design of Multilevel Security.",
                    "A Transaction Architecture for a General Purpose Semantic Data Model.",
                    "Progessive Fragment Allocation.",
                    "Drafting Extended Entity-Relationship Schemas with QUEER.",
                    "A Prolog Implementation of an Entity-Relationship Based Database Management System.",
                    "Cooperative Behavior Through Request Modification.",
                    "An Analysis of Table Constraints in SQL2 Based on the Entity-Relationship Model.",
                    "Entity-Generating Schema Transformations for Entity-Relationship Models.",
                    "Mapping of 2-D Temporal Extended ER Models into Temporal Nested Relational Models.",
                    "An Extended Conceptual Modelling Language for Objects and Rules.",
                    "The Framework Rules and Objects.",
                    "Database Management Systems: Paradigm Shift or Changing Paradigm.",
                    "Database Reverse Engineering: Models, Techniques, and Strategies.",
                    "Importance of Using The Proper Level of Model.",
                    "Active, Real-Time, and Heterogenous Database Systems.",
                    "The Information Modeler as Facilitator.",
                    "A Seven Layer Data Architecture for Business Understanding and Database Implementation."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "9th ER 1990",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/er/90",
                "sub_name": "Proceedings of the 9th International Conference on Entity-Relationship Approach (ER'90), 8-10 October, 1990, Lausanne, Switzerland.",
                "count": 34,
                "papers": [
                    "Knowledge Representation, Semantic Data Modelling: What's the Difference?",
                    "Conceptual Design for Non-Database Experts with an Interactive Schema Tailoring Tool.",
                    "GraphOR: A Meta Design Tool.",
                    "Configurable Data Modelling Systems.",
                    "Entity-Relationship Models: Formal Specification and Comparision.",
                    "Extensional/Intensional Database Systems.",
                    "Incorporating a Model Hierarchy into the ER Paradigm.",
                    "Abstraction of Object-Oriented Data Models.",
                    "OSCAR: An Object-Oriented Database System with a Nested Relational Kernel.",
                    "Advanced Entity-Relationship Databases.",
                    "Behavior Modelling by Stepwise Refining Behavior Diagrams.",
                    "System Analysis for Deductive Database Environments: An Enhanced Role for Aggregate Entities.",
                    "Inter-Relationship Links in the E-R Model.",
                    "A Knowledge-Based System and an ER Query Language for Accessing Relational Databases.",
                    "Formal Semantics of an Entity-Relationship-Based Query Language.",
                    "Two Explanation Facilities for the Deductive Database Management System DeDEx.",
                    "ISO Database Standards - A Summary and Review of Status.",
                    "Why Using Events in a High-Level Specification.",
                    "Plan and Schedule Generation over Temporal Databases.",
                    "Semantics of Temporal Data in an Extended ER Model.",
                    "Knowledge and Data Engineering of a Telecommunications Network.",
                    "Autonomy over Ubiquity: Coping with the Complexity of a Distributed World.",
                    "Active and Heterogenous Database Systems.",
                    "MOLOC: Using Prolog for Conceptual Modelling.",
                    "Constructing Layouts for ER-Diagrams from Visibility-Representations.",
                    "SESAME: An Application of Entity-Relationship Models to a Natural Language User Interface.",
                    "Software Reverse Engineering from a Currently Existing IMS Database to an Entity-Relationship Model.",
                    "Algorithms for Designing and Maintaining Optimized Relational Representations of Entity-Relationship Schemas.",
                    "A Graph Grammar Driven ER Case Environment.",
                    "ER Modelling for Urban Data Management.",
                    "ER Standards Proposal.",
                    "View Integration by Semantic Unification and Transformation of Data Structures.",
                    "Schema Translation during Design and Integration of Databases.",
                    "Object-Oriented Modelling and Reasoning."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "8th ER 1989",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/er/89",
                "sub_name": "Entity-Relationship Approach to Database Design and Querying, Proceedings of the Eight International Conference on Enity-Relationship Approach, Toronto, Canada, 18-20 October, 1989.",
                "count": 25,
                "papers": [
                    "The Leading Edge of Database Technology.",
                    "Some Findings on the Intuitivness of Entity-Relationship Constructs.",
                    "A Proposal for Formalizing and Extending the Generalization and Subset Abstractions in the Entity-Relationship Model.",
                    "The Nested Entity-Relationship Model.",
                    "Valences: A new Relationship Concept for the Entity-Relationship Model.",
                    "Name Assignment Techniques for Relational Schemas Representing Extended Entity-Relationship Schemas.",
                    "Modeling Semantics with Concept Abstraction in the EARL Data Model.",
                    "Synergistic Database Design with an Extended Entity-Relationship Model.",
                    "E2R Model and Object-Oriented Representation for Data Management, Process Modeling, and Decision Support.",
                    "The E-R Editor: an Editor for Database Conceptual Schema Design based on E-R Model.",
                    "Interactive Specification and Integration of User Views Using Forms.",
                    "Database Design Tools: Combining Theory, Guesswork, and User Interaction.",
                    "An Expert System for Conceptual Data Modelling.",
                    "A Rule-Based System Tool for Automated ER Model Clustering.",
                    "Modeling with KRISYS: the Design Process of DB Applications Reviewed.",
                    "KORTEX: An Expert Database System Shell for a Knowledge-Based Enity Relationship Model.",
                    "A Method for Translating Relational Schemas into Conceptual Schemas.",
                    "An Integrity System for a Relational Database Architecture.",
                    "Automatic Transformation of an Entity-Relationship Query Language into SQL.",
                    "Abbreviated Query Interpretation in Extended Entity-Relationship Oriented Databases.",
                    "Building Natural Language Interface to an ER Database.",
                    "An ER Calculus for the Entity-Relationship Complex Model.",
                    "Schema Independent Query Formulation.",
                    "A Graphical Query Language Based on an Extended E-R Model.",
                    "Ergonomic Schema Design and Browsing with More Semantics in the Pasta-3 Interface for E-R DBMSs."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "7th ER 1988",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/er/88",
                "sub_name": "Entity-Relationship Approach: A Bridge to the User, Proceedings of the Seventh International Conference on Enity-Relationship Approach, Rome, Italy, November 16-18, 1988.",
                "count": 28,
                "papers": [
                    "The Entity-Relationship Approach and the Information Resource Dictionary System Standard.",
                    "Panel and Tutorial Sessions - Introduction.",
                    "Interfaces for Advanced Data Base Systems: Iconic, Graphical, Natural Language Oriented - Panel.",
                    "Data Bases and Knowledge Bases: Which Approach is Good for What? - Panel.",
                    "Design Methodologies and Standards in Governamental Organizations - Panel.",
                    "The CASE Boom: Decadence or Renaissance of Methodologies? - Panel.",
                    "Industrial Session - Introduction, Foundation, Information Engineering Workbench, Excelerator, ECASET, GENOS, PAPICS, ASA, LOGISCOPE, TASIS-CASE, Mega CASE Tools, The MastER System, SECSI, DAFNE Methodology, Software through Pictures, Olivetti Open Architecture, PREDICT CASE, easyFIND, ER-Modeler.",
                    "A Calculus for an Extended Entity-Relationship Model Incorporating Arbitrary Data Operations and Aggregate Functions.",
                    "A Semantic Analysis of the Collection Concept.",
                    "A Function: Unifying Mechanism for Entity-Oriented Database Models.",
                    "OOER: Toward Making the E-R Approach Object-Oriented.",
                    "Object Modeling Based on Logic.",
                    "An Expert System Approach to View Definition and Integration.",
                    "Definition Libraries for Conceptual Modelling.",
                    "SICON, an Iconic Presentation Module For an E-R Database.",
                    "Query by Diagramm: A Graphic Query System.",
                    "A Behaviour Integrated Entity-Relationship Approach for the Design of Object-Oriented Databases.",
                    "Acyclic Query Processing in Object-Oriented Databases.",
                    "ERDDS: The Intelligent E-R-Based Database Design System.",
                    "OPTIM_ER: An Automated Tool for Supporting the Logical Design Within a Complete CASE Environment.",
                    "Inferring Database Requirements from Examples in Forms.",
                    "Implementing Abstraction Hierarchies.",
                    "The ER Approach Extended with the Action Concept as a Conceptual Modelling Tool.",
                    "On Taxonomic Reasoning in E/R Environment.",
                    "Using a Semantic Knowledge Base to Support a Natural Language Interface to a Text Database.",
                    "Abstraction Concepts: The Basis for Data and Knowledge Modeling.",
                    "External Schemas of Entity-Relationship Based Data Base Management Systems.",
                    "A Description of Rules through Occurring/Synthetic Cardinalities."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "6th ER 1987",
        "info": "New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/87",
                "sub_name": "Entity-Relationship Approach, Proceedings of the Sixth International Conference on Entity-Relationship Approach, New York, USA, November 9-11, 1987.",
                "count": 41,
                "papers": [
                    "Information Architectures and Data Modelling: Cornerstone for Succeeding in the Information Society (Abstract of Keynote Address).",
                    "A Framework for Information Systems Architecture (Abstract of Tutorial).",
                    "Transforming Data Plans into Data Models (Abstract of Tutorial).",
                    "European Methodologies for Information System Development (Abstract of Tutorial).",
                    "Automated Support for Database Design (Abstract of Tutorial).",
                    "BLUES: Better Logic Using Expert Software.",
                    "Products from Chen & Associates.",
                    "A Representation System for the Design of Computer Integrated Organizations (CIO).",
                    "ZIM - The Entity-Relationship 4GL/DBMS Semantic Clarity in Applications Development.",
                    "An Information Engineering Methodology Utilizing MAST_ER, an Integrated Computer-Aided Design Tool.",
                    "Which is the \"Right\" Data Model for a given Problem? (Panel).",
                    "Introducing Data Administration into a Business Organization.",
                    "ER versus Relational: What are the Differences? (Panel).",
                    "E-R Modeling versus Binary Modeling (Panel).",
                    "ER Modeling in CAD/CAM and Object Oriented Applications.",
                    "Data modeling as a Tool for Data System Planning: Can Data Modeling Accurately Reflect the Enterprise ? (Panel).",
                    "A Foundation for the Entity Relationship Approach: How and Why.",
                    "Theoretically Sound Transformations for Practical Database Design.",
                    "Knowledge Representation and Modeling Support in Knowledge-Based Systems.",
                    "Specifying a Semantically Adequate Structure for Information Systems and Databases.",
                    "Typing Information in a Software Engineering Environment.",
                    "A Three Level Schema Architecture ER-based Data Base Management System.",
                    "A Conceptual Model for Physical and Logical Time.",
                    "An Entity/Relationship View of Time.",
                    "Modelling Requirements of a Manufacturing Design Application Using an E/R Schema.",
                    "Converting A Relational Database Model into an Entity-Relationship Model.",
                    "From Minimal Cover to Entity-Relationship Diagram.",
                    "Abstracting Relational and Hierarchical Data with a Semantic Data Model.",
                    "An Approach to Computation Specification for an Entity-Relationship Query Language.",
                    "Entity-Relationship Database User Interfaces.",
                    "Translating ERROL, a High Level, ER, Structured English Languages for DBTG Databases.",
                    "Data Manipulation in NETUL.",
                    "Top-Down Database Planning.",
                    "Information Architecture and Entity-Relationship Approach.",
                    "Designing Data Entity Naming Conventions.",
                    "General Dynamics' Entity-Relationship Approach.",
                    "Entity-Relationship Approach and Decision Support.",
                    "Entity/Relationship Models in a Structured Development Environment: A Case Study.",
                    "TSER: A Data Modeling System Using the Two-Stage Entity-Relationship Approach.",
                    "The CHRIS Consultant.",
                    "An Extended Entity-Relationship (E²R) Database Specification and its Automatic Verification and Transformation into the Logical Relational Design."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "5th ER 1986",
        "info": "Dijon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/er/86",
                "sub_name": "Entity-Relationship Approach: Ten Years of Experience in Information Modeling, Proceedings of the Fifth International Conference on Entity-Relationship Approach, Dijon, France, November 17-19, 1986.",
                "count": 31,
                "papers": [
                    "Opening Address.",
                    "The Integration of Data and Knowledge Base Systems: Activities in ESPRIT.",
                    "Knowledge and Data: A Survey in the Margin of the IFIP DS-2 Conference.",
                    "A Conceptual Modelling Expert System.",
                    "Object-Oriented Database Systems - A Workshop Report.",
                    "Modelling and Manipulating Objects in Geoscientific Databases.",
                    "Modeling Complex Objects for Multimedia Databases.",
                    "Entities from a Systems Point of View.",
                    "The Use of E-R Data Models in Capability Schemas.",
                    "BIER - The Behaviour Integrated Entity Realtionship Approach.",
                    "Extending the Entity-Relationship Approach for Dynamic Modeling Purposes.",
                    "Applying Entity-Relationship Concepts to Executable Specifications.",
                    "Semantics of Query Languages for the Entity-Relationship Model.",
                    "The Lattice Structure of Entity Set.",
                    "ER-Based Access Modeling.",
                    "Translation of an Extended Entity-Relationship Model into the Universal Relation with Inclusions Formalism.",
                    "SCRABBLE: A Local Database Management System.",
                    "The Semantics of Relational Database Functions.",
                    "Design and Implementation of an Extended Entity-Relationship Data Base Management System (ECRINS/86).",
                    "VERS - A Vector Based Entity Relationship Management System.",
                    "A Database Designer's Workbench.",
                    "Acquisition and Use of Contextual Knowledge in a Form-Driven Database Design Methodology.",
                    "SA-ER: A Methodology that Links Structured Analysis and Entity-Relationship Modeling for Database Design.",
                    "Extending a Dynamic Modelling Method Using Data Modelling Capabilities: The Case of JSD.",
                    "Complex Entities for Engineering Applications.",
                    "Some Practices with the E/R Model: A Software Workshop in Econometrics.",
                    "User Experience with the ER Approach: report on the Panel Session.",
                    "The Database Design Process, Tutorial.",
                    "MERISE, an Information System Design and Development Methodology, Tutorial.",
                    "Contribution of the Entity-Relationship Approach to Object Management in an Information System Design Workbench.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "4th ER 1985",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/85",
                "sub_name": "Entity-Relationship Approach: The Use of ER Concept in Knowledge Representation, Proceedings of the Fourth International Conference on Entity-Relationship Approach, Chicago, Illinois, USA, 29-30 October 1985.",
                "count": 36,
                "papers": [
                    "KPSP: A Knowledge Programming System based on Prolog.",
                    "FAIM, the Formal Association Inference Model, a Means for the Formal definition of Coceptual Meta Schemas.",
                    "Applications of the Entity-Relationship Approach to Similarity-Driven Pictorial Database Systems.",
                    "A Normal Form For Entity-Relationship Diagrams.",
                    "Automatic Database Navigation: Towards a High Level User Interface.",
                    "Data Definition Facilities of Critias.",
                    "Structured Database System Analysis and Design through Entity Relationship Approach.",
                    "A Computer-Aid for E-R Modeling.",
                    "SESPATH: An ER Manipulation Language.",
                    "Lambda: An Entity-Relationship Based Query Language for the Retrieval of Structured Documents.",
                    "A Relationally Complete Query Language for an Entity-Relationship Model.",
                    "Mapping Specifications to Formalisms - Panel Session.",
                    "Easy ER - An Integrated System for the Design and Documentation of Data Base Applications.",
                    "The Information Resource Dictionary System.",
                    "The Entity-Relationship Approach as a Tool for Application Analysis.",
                    "Management Database Study.",
                    "A Specification Model for Information Systems.",
                    "A Methodology for Translating a Conventional File System into an Entity-Relationship Model.",
                    "Executable E-R Specifications for Database Schema Design.",
                    "The Translation of a Cobol Data Structure to an Entity-Relationship Type Conceptual Schema.",
                    "Conceptual Data Modelling of an Expert System.",
                    "Representing Rules through Modelling Entity Behaviour.",
                    "Expert System for Translating an E-R Diagram into Databases.",
                    "A Universal Relation Assumption Based on Entities and Relationships.",
                    "The F1 Formalism: An Extension of the Entity-Relationship Model Using the First Order Logic.",
                    "The Use of E-R Abstractions for Knowledge Representation.",
                    "A Graphical Query Facility for ER Databases.",
                    "The Data Model of IDE: A Value Network.",
                    "Translation of SQL/DS Data Access/Update into Entity-Relationship Data Access/Update.",
                    "SERM: Semantic Entity-Relationship Model.",
                    "Modelling the Time Dimension in an Entity-Relationship Diagram.",
                    "Integrity Constraints in the Conceptual Schema Language SYSDOC.",
                    "The Design and Implementation of an Integrity Subsystem for the Relational DBMS RAP.",
                    "New Layout Techniques for Entity-Relationship Diagrams.",
                    "What is a Good Diagram? A Pragmatic Approach.",
                    "A Schema Methodology for Large Entity-Relationship Diagrams."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "3rd ER 1983",
        "info": "Anaheim, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/83",
                "sub_name": "Proceedings of the 3rd Int. Conf. on Entity-Relationship Approach (ER'83), Anaheim, California, USA.",
                "count": 53,
                "papers": [
                    "Fact-Based Data Analysis and Design.",
                    "The Structuring Capabilities of the Molecular Data Model.",
                    "Derivation of Element-Relation-Attribute Data Base Requirements by Decomposition of System Functions.",
                    "ER - A Historical Perspective and Future Directions.",
                    "A Mathematical Basis for Entity Analysis.",
                    "Entity Sets and their Description.",
                    "A Method for Entity-Relationship Behavior Modeling.",
                    "Phases, Methods and Tools - A Triad of System Development.",
                    "Entity-Relationship Approach to Logical Database Design.",
                    "Distributed Database Design Using the Entity-Relationship Model.",
                    "What is the Binary Relationship Approach?",
                    "A Methodology for Database Schema Mapping from Extended Entity-Relationship Models into the Hierarchical Model.",
                    "On the Representation of Relational Structures by Entity-Relationship Diagrams.",
                    "Designing Entity-Relationship Schemes for Conventional Information Systems.",
                    "On Universal and Representative Instances for Inconsistent Databases.",
                    "HIQUEL: An Interactive Query Language to Define and Use Hierarchies.",
                    "A Modified Relational Algebra and its Use in an Entity-Relationship Environment.",
                    "ERROL: An Entity-Relationship, Role Oriented, Query Language.",
                    "Defining External Schemas for an Entity-Relationship Database.",
                    "ID: An Intelligent Information Dictionary System.",
                    "Integrating Database and Program Description Using an ER-Data Dictionary.",
                    "An Implementation of a Data Dictionary to Support Databases Designed Using the Entity-Relationship Approach.",
                    "A Methodology for Data Schema Integration in the Entity-Relationship Model.",
                    "An Algorithm for Automatic Layout of Entity-Relationship Diagrams.",
                    "A Graphical Query Language for Entity-Relationship Databases.",
                    "INCOD (A System for Interactive Conceptual Design) Revisited - After the Implementation of a Prototype.",
                    "ISMOS: A System Based on the ER Model and its Application to Database-Oriented Tool Generation.",
                    "Tools for the Creation of IMS Database Designs from Entity-Relationship Diagrams.",
                    "UPM: A Formal Tool for Expressing Database Update Semantics.",
                    "Cardinality Constraints in the Entity-Relationship Model.",
                    "Integrity Checking in a Logic-Oriented ER Model.",
                    "Further Development of the Occurrences Structure Concept: The EROS Approach.",
                    "Integration of Data, Schema and Meta-Schema in the Context of Self-Documenting Data Models.",
                    "An Extended EAR Approach for Information System Specification.",
                    "View Constructs for the Specification and Design of External Schemas.",
                    "SOFSPEC: A Pragmatic Approach to Automated Specification Verification.",
                    "A View of Database Management Systems as Abstract Data Types.",
                    "The Use of EPAS/IPSO Approach for Integrating Entity-Relationship Concepts and Software Engineering Techniques.",
                    "Specifying Distributed Systems Requirements Using SREM.",
                    "Analysis of Version and Configuration Control in a Software Engineering Environment.",
                    "The Use of the Entity-Relationship Model as a Schema for Organizing the Data Processing Activities.",
                    "Applications of ER Concepts to Data Administration.",
                    "A Modeling Foundation for a Second Generation System Engineering Tool.",
                    "An Entity-Relationship Approach to Modelling Petroleum Engineering Database.",
                    "Cost Analysis of Selected Database Restoration Techniques.",
                    "Issues in Multiple Database Environmemnts (Panel).",
                    "Data Management: A Practical View (Panel).",
                    "Introduction to the Session on Automatic Microcode Generation.",
                    "HOL-to-Microcode Compilers: An Air Force Perspective.",
                    "An Automatically Retargetable Microcode Compiler.",
                    "Automated Development of Special Purpose Hardware.",
                    "Microcode Support for Operating System Functions: Issues and Examples.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "2nd ER 1981",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/81",
                "sub_name": "Entity-Relationship Approach to Information Modeling and Analysis, Proceedings of the Second International Conference on the Entity-Relationship Approach (ER'81), Washington, DC, USA, October 12-14, 1981.",
                "count": 28,
                "papers": [
                    "Applications of the Entity-Relationship Approach.",
                    "A Preliminary Framework for Entity-Relationship Models.",
                    "The ER and EAS Formalisms for System Modelling, and the EAS-E Language.",
                    "GORDAS: A Formal High-Level Query Language for the Entity-Relationship Model.",
                    "The Occurrence Structure Concept: An Approach to Structural Integrity Constraints in the Entity-Relationship Model, with Application to Realationship Decomposition and Metamodel Achievement.",
                    "Completeness of Query Languages for the Entity-Relationship Model.",
                    "Verification and Testing of S-ER Representations.",
                    "A Decomposition of Relations Using the Entity-Relationship Approach.",
                    "An Extended Entity-Relationship Model and Its Use on a Defense Project.",
                    "Declarative and Procedural Features of a CODASYL Accounting System.",
                    "Item Tracking Entity-Relationship Models.",
                    "Using the Entity-Relationship Model for Implementing Multi-Model Database Systems.",
                    "View Processing in MULTIBASE, A Heterogeneous Database System.",
                    "A Unifying Approach for Conceptual Schema to Support Multiple Data Models.",
                    "Conceptual Representation of Data and Logical IMS Design.",
                    "Design of Data Models for the ADABAS System Using the Entity-Relationship Approach.",
                    "Schema Translation Using the Entity-Relationship Approach.",
                    "Entity-Relationship Model in the ANSI/SPARC Framework.",
                    "INCOD: A System for Conceptual Design of Data and Transactions in the Entity-Relationship Model.",
                    "A Development of a Conceptual Schema Design Aid in the Entity-Relationship Model.",
                    "An Interactive Query and Definition Facility for Semantic Dictionaries.",
                    "An Extended Entity-Relationship Model with Multi Level External Views.",
                    "TERM: An Approach to Include Time Dimension in the Entity-Relationship Model.",
                    "Database Views Using Data Abstraction.",
                    "Design and Implementation of an E-R Data Base Management System.",
                    "The Fact Database: An Entity-Based System Using Inference.",
                    "Implementing a Self-Defining Entity-Relationship Model to Hold Conceptual View Information.",
                    "Association: A Database Abstraction for Semantic Modelling."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "1st ER 1979",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/er/79",
                "sub_name": "Entity-Relationship Approach to Systems Analysis and Design. Proc. 1st International Conference on the Entity-Relationship Approach, Los Angeles, California, USA, 1979.",
                "count": 51,
                "papers": [
                    "The Challenge of Systems Analysis and Design.",
                    "Recent Literature on the Entity-Relationship Approach.",
                    "Entity-Relationship Diagrams and English Sentence Structure.",
                    "Application of the Entity-Relationship Approach to Information Processing Systems Modelling.",
                    "Entity-Relationship Views over Uninterpreted Enterprise Schemas.",
                    "A Unified Approach to the Logical Design of a Hierarchical Data Model.",
                    "The Measurement of Usability.",
                    "A Data Type Approach to the Entity-Relationship Approach.",
                    "Abstraction Capabilities and Invariant Properties Modelling within the Entity-Relationship Approach.",
                    "An Approach to Designing an Entity-Relationship Schema.",
                    "An Approach to Designing an Entity-Relationship Schema (Abstract).",
                    "Some Considerations on the Entity-Relationship Model.",
                    "On the Semantics of the Entity-Relationship Data Model.",
                    "A Semantic Association Model for Conceptual Design.",
                    "Applying a Semantic Data Model.",
                    "A Formal Definition of Entity-Relationship Models.",
                    "Extending the Entity-Relationship Approach to Take in Account Historical Aspects of Systems.",
                    "The Structural Model for Database Design.",
                    "Database Conceptual Modelling.",
                    "Decomposition of Relations and Synthesis of Entity-Relationship Diagrams.",
                    "A Graphical Database Design Aid using the Entity-Relationship Model.",
                    "Logical Design and Schema Conversion for Relational and DBTG Databases.",
                    "Top-Down Design in the Entity-Relationship Model.",
                    "Information Resource Specification and Design Language.",
                    "A Method, a Formalism and Tools for Database Design - Three Years of Experimental Practice.",
                    "An Entity-Relationship Model based on Linked Relations.",
                    "A Contribution to the Definition of Concepts for Expressing Users' Information Systems Requirements.",
                    "Systematic Derivation of Software Requirements.",
                    "Information Requirements Analysis using an Entity-Attribute-Relationship Approach.",
                    "The Concept and Practice of ERA Information Modelling.",
                    "Domains and Data Types in ERA Information Model.",
                    "A Relational Data Base Foundation for Process Specification.",
                    "An Implementation Methodology for Semantic Data Base Models.",
                    "A DML for Entity-Relationship Models.",
                    "Evaluation of an E-R Query Language.",
                    "CABLE: A Chain-Based Language for the Entity-Relationship Model.",
                    "A Data Base Management System with an E-R Conceptual Model.",
                    "A Translator to Convert the DDL of ERM to the DDL of System 2000.",
                    "Design of the WELL System.",
                    "A Conceptual Design of a Database Machine based on a New Data Model.",
                    "Some Propositions of the Entity-Relationship Model.",
                    "The SIRIUS-DELTA Distributed DBMS.",
                    "Distributed Multi-Database Environment with a Supervisory Data Dictionary Database.",
                    "A Hierarchical Conceptual Data Model Data Translation in a Heterogeneous Database System.",
                    "The E-R Model in a Heterogeneous Data Base Management System Network Architecture.",
                    "Enterprise Schema - An Approach to IMS Logical Database Design.",
                    "The Application of Data Analysis - Experience with the Entity-Relationship Approach.",
                    "Database Design Experience.",
                    "Construction and Use of Integrated Accounting Systems with Entity-Relationship Modelling.",
                    "Case Studies Demonstrating Applicability of Conceptual Information Models to MIS Planning Efforts.",
                    "Mechanized Analysis of Entity-Relationship Design Databases."
                ]
            }
        ]
    }
]