[
    {
        "year": "2021",
        "name": "ESWC 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2021",
                "sub_name": "The Semantic Web - 18th International Conference, ESWC 2021, Virtual Event, June 6-10, 2021, Proceedings.",
                "count": 43,
                "papers": [
                    "Streaming Partitioning of RDF Graphs for Datalog Reasoning.",
                    "Parallelised ABox Reasoning and Query Answering with Expressive Description Logics.",
                    "Analysing Large Inconsistent Knowledge Graphs Using Anti-patterns.",
                    "Processing SPARQL Property Path Queries Online with Web Preemption.",
                    "Ontology-Based Map Data Quality Assurance.",
                    "Applying Grammar-Based Compression to RDF.",
                    "HDT Bitmap Triple Indices for Efficient RDF Data Exploration.",
                    "Programming and Debugging with Semantically Lifted States.",
                    "Do Embeddings Actually Capture Knowledge Graph Semantics?",
                    "A Semantic Framework to Support AI System Accountability and Audit.",
                    "Comparison Table Generation from Knowledge Bases.",
                    "Incremental Schema Discovery at Scale for RDF Data.",
                    "HTTP Extensions for the Management of Highly Dynamic Data Resources.",
                    "Expressibility of OWL Axioms with Patterns.",
                    "Refining Transitive and Pseudo-Transitive Relations at Web Scale.",
                    "Data Reliability and Trustworthiness Through Digital Transmission Contracts.",
                    "Neural Knowledge Base Repairs.",
                    "Natural Language Inference over Tables: Enabling Explainable Data Exploration on Data Lakes.",
                    "Grounding Dialogue Systems via Knowledge Graph Aware Decoding with Pre-trained Transformers.",
                    "WEB-SOBA: Word Embeddings-Based Semi-automatic Ontology Building for Aspect-Based Sentiment Classification.",
                    "Context Transformer with Stacked Pointer Networks for Conversational Question Answering over Knowledge Graphs.",
                    "Neural Multi-hop Reasoning with Logical Rules on Biomedical Knowledge Graphs.",
                    "Augmenting Ontology Alignment by Semantic Embedding and Distant Supervision.",
                    "Convolutional Complex Knowledge Graph Embeddings.",
                    "RETRA: Recurrent Transformers for Learning Temporally Contextualized Knowledge Graph Embeddings.",
                    "Injecting Background Knowledge into Embedding Models for Predictive Tasks on Knowledge Graphs.",
                    "Structured Semantic Modeling of Scientific Citation Intents.",
                    "Discovering Research Hypotheses in Social Science Using Knowledge Graph Embeddings.",
                    "Towards a Linked Open Code.",
                    "A Polyvocal and Contextualised Semantic Web.",
                    "The WASABI Dataset: Cultural, Lyrics and Audio Analysis Metadata About 2 Million Popular Commercially Released Songs.",
                    "RuBQ 2.0: An Innovated Russian Question Answering Dataset.",
                    "A Knowledge Organization System for the United Nations Sustainable Development Goals.",
                    "RSP4J: An API for RDF Stream Processing.",
                    "WasmTree: Web Assembly for the Semantic Web.",
                    "ParaQA: A Question Answering Dataset with Paraphrase Responses for Single-Turn Conversation.",
                    "kgbench: A Collection of Knowledge Graph Datasets for Evaluating Relational and Multimodal Machine Learning.",
                    "The SLOGERT Framework for Automated Log Knowledge Graph Construction.",
                    "P2P-O: A Purchase-To-Pay Ontology for Enabling Semantic Invoices.",
                    "KOBE: Cloud-Native Open Benchmarking Engine for Federated Query Processors.",
                    "CSKG: The CommonSense Knowledge Graph.",
                    "A Knowledge Graph-Based Approach for Situation Comprehension in Driving Scenarios.",
                    "Pay-as-you-go Population of an Automotive Signal Knowledge Graph."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2021s",
                "sub_name": "The Semantic Web: ESWC 2021 Satellite Events - Virtual Event, June 6-10, 2021, Revised Selected Papers.",
                "count": 38,
                "papers": [
                    "BiodivOnto: Towards a Core Ontology for Biodiversity.",
                    "scikit-learn Pipelines Meet Knowledge Graphs - The Python kgextension Package.",
                    "SLURP: An Interactive SPARQL Query Planner.",
                    "Towards Easy Vocabulary Drafts with Neologism 2.0.",
                    "Dataset Generation Patterns for Evaluating Knowledge Graph Construction.",
                    "National Library of Latvia Subject Headings as Linked Open Data.",
                    "Automatic Skill Generation for Knowledge Graph Question Answering.",
                    "Converting UML-Based Ontology Conceptualizations to OWL with Chowlk.",
                    "Monetising Resources on a SoLiD Pod Using Blockchain Transactions.",
                    "Towards Scientific Data Synthesis Using Deep Learning and Semantic Web.",
                    "RaiseWikibase: Fast Inserts into the BERD Instance.",
                    "Do Judge an Entity by Its Name! Entity Typing Using Language Models.",
                    "Towards a Domain-Agnostic Computable Policy Tool.",
                    "Towards an Evaluation Framework for Expressive Stream Reasoning.",
                    "Schema-Backed Visual Queries over Europeana and Other Linked Data Resources.",
                    "CLiT: Combining Linking Techniques for Everyone.",
                    "SANTé: A Light-Weight End-to-End Semantic Search Framework for RDF Data.",
                    "Coverage-Based Summaries for RDF KBs.",
                    "Named Entity Recognition as Graph Classification.",
                    "Exploiting Transitivity for Entity Matching.",
                    "The Nuremberg Address Knowledge Graph.",
                    "SaGe-Path: Pay-as-you-go SPARQL Property Path Queries Processing Using Web Preemption.",
                    "Ontology for Informatics Research Artifacts.",
                    "Non-named Entities - The Silent Majority.",
                    "Unsupervised Relation Extraction Using Sentence Encoding.",
                    "evoKGsim+: A Framework for Tailoring Knowledge Graph-Based Similarity for Supervised Learning.",
                    "Extraction of Union and Intersection Axioms from Biomedical Text.",
                    "Implementing Informed Consent with Knowledge Graphs.",
                    "Improving Decision Making Using Semantic Web Technologies.",
                    "Ontological Formalisation of Mathematical Equations for Phenomic Data Exploitation.",
                    "Identifying Events from Streams of RDF-Graphs Representing News and Social Media Messages.",
                    "Towards Visually Intelligent Agents (VIA): A Hybrid Approach.",
                    "Using Knowledge Graphs for Machine Learning in Smart Home Forecasters.",
                    "Stigmergic Multi-Agent Systems in the Semantic Web of Things.",
                    "Towards an Ontology for Propaganda Detection in News Articles.",
                    "A Virtual Knowledge Graph for Enabling Defect Traceability and Customer Service Analytics.",
                    "Constructing Micro Knowledge Graphs from Technical Support Documents.",
                    "Use Case: Ontologies and RDF-Star for Knowledge Management."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2021deepontonlp",
                "sub_name": "Joint Proceedings of the 2nd International Workshop on Deep Learning meets Ontologies and Natural Language Processing (DeepOntoNLP 2021) & 6th International Workshop on Explainable Sentiment Mining and Emotion Detection (X-SENTIMENT 2021) co-located with co-located with 18th Extended Semantic Web Conference 2021, Hersonissos, Greece, June 6th - 7th, 2021 (moved online).",
                "count": 10,
                "papers": [
                    "Predicting Themes within Complex Unstructured Texts: A Case Study on Safeguarding Reports.",
                    "Supporting Ontology Maintenance with Contextual Word Embeddings and Maximum Mean Discrepancy.",
                    "Mitigating the Impact of out of Vocabulary Words in a Neural-Machine-Translation-based Question Answering System.",
                    "Thesaurus Enhanced Extraction of Hohfeld's Relations from Spanish Labour Law.",
                    "Semantic Data Transformation.",
                    "Key Information Extraction From Documents: Evaluation And Generator.",
                    "Ontology Clustering with OWL2Vec.",
                    "Extractive Summarization for Explainable Sentiment Analysis using Transformers.",
                    "Deep Learning Enhanced with Graph Knowledge for Sentiment Analysis.",
                    "Explaining Sentiment from Lexicon."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2021kgcw",
                "sub_name": "Proceedings of the 2nd International Workshop on Knowledge Graph Construction co-located with 18th Extended Semantic Web Conference (ESWC 2021), Online, June 6, 2021.",
                "count": 13,
                "papers": [
                    "Everything for the Users, Nothing by the Users: Lessons Learnt from a Heterogeneous Data Mapping Languages User Study.",
                    "A ShExML Perspective on Mapping Challenges: Already Solved Ones, Language Modifications and Future Required Actions.",
                    "Mapping Spreadsheets to RDF: Supporting Excel in RML.",
                    "Demo: Knowledge Graph-Based Housing Market Analysis.",
                    "JenTab: A Toolkit for Semantic Table Annotations.",
                    "Stratified Data Integration.",
                    "Collaborative-AI Knowledge Graph Generation: Taxonomization of IATE, the EU Terminology.",
                    "Embedding-Assisted Entity Resolution for Knowledge Graphs.",
                    "Integrating Nested Data into Knowledge Graphs with RML Fields.",
                    "Open Drug Knowledge Graph.",
                    "Knowledge Graph Construction with R2RML and RML: An ETL System-based Overview.",
                    "Knowledge Graph Lifecycle: Building and Maintaining Knowledge Graphs.",
                    "Experiences of Using WDumper to Create Topical Subsets from Wikidata."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2021geold",
                "sub_name": "Proceedings of the 4th International Workshop on Geospatial Linked Data (GeoLD) Co-located with the 18th Extended Semantic Web Conference (ESWC 2021), Virtual event (instead of Hersonissos, Greece), June 7th, 2021.",
                "count": 14,
                "papers": [
                    "Semantic Integration of Raster Data for Earth Observation on Territorial Units.",
                    "Demo: GeoDataWizard for Linked Spatial Data Creation (short paper).",
                    "Interoperability and Integration: An Updated Approach to Linked Data Publication at the Dutch Land Registry (short paper).",
                    "GeoSPARQL 1.1: an almost decadal update to the most important geospatial LOD standard (short paper).",
                    "Models for Space Unite! The Need and Opportunities for Domain-transcendent Modelling of Spatial Data (short paper).",
                    "L4DR: A 2nd-gen, national GeoLD system (short paper).",
                    "Assessing quality of R2RML mappings for OSi's Linked Open Data portal (short paper).",
                    "Reusable SHACL Constraint Components for Validating Geospatial Linked Data (short paper).",
                    "From EO Change Rasters to Knowledge Graphs: An approach Based on Regions of Interest.",
                    "Navigating spatial relationships between datasets using reified links (short paper).",
                    "A SKOS Taxonomy of the UN Global Geospatial Information Management Data Themes (short paper).",
                    "Connecting Granular and Topological Relations through Description Logics (short paper).",
                    "Establishing a Linked Data Infrastructure for the OGC Body of Knowledge (short paper).",
                    "Geospatial Reasoning with Shapefiles for Supporting Policy Decisions (short paper)."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ESWC 2020",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2020",
                "sub_name": "The Semantic Web - 17th International Conference, ESWC 2020, Heraklion, Crete, Greece, May 31-June 4, 2020, Proceedings.",
                "count": 39,
                "papers": [
                    "Handling Impossible Derivations During Stream Reasoning.",
                    "Modular Graphical Ontology Engineering Evaluated.",
                    "Fast and Exact Rule Mining with AMIE 3.",
                    "A Simple Method for Inducing Class Taxonomies in Knowledge Graphs.",
                    "Hybrid Reasoning Over Large Knowledge Bases Using On-The-Fly Knowledge Extraction.",
                    "Partial Domain Adaptation for Relation Extraction Based on Adversarial Learning.",
                    "SASOBUS: Semi-automatic Sentiment Domain Ontology Building Using Synsets.",
                    "Keyword Search over RDF Using Document-Centric Information Retrieval Systems.",
                    "Entity Linking and Lexico-Semantic Patterns for Ontology Learning.",
                    "Estimating Characteristic Sets for RDF Dataset Profiles Based on Sampling.",
                    "SchemaTree: Maximum-Likelihood Property Recommendation for Wikidata.",
                    "Hyperbolic Knowledge Graph Embeddings for Knowledge Base Completion.",
                    "Unsupervised Bootstrapping of Active Learning for Entity Resolution.",
                    "Processing SPARQL Aggregate Queries with Web Preemption.",
                    "Embedding-Based Recommendations on Scholarly Knowledge Graphs.",
                    "Investigating Software Usage in the Social Sciences: A Knowledge Graph Approach.",
                    "Fostering Scientific Meta-analyses with Knowledge Graphs: A Case-Study.",
                    "SAShA: Semantic-Aware Shilling Attacks on Recommender Systems Exploiting Knowledge Graphs.",
                    "Entity Extraction from Wikipedia List Pages.",
                    "The Knowledge Graph Track at OAEI - Gold Standards, Baselines, and the Golden Hammer Bias.",
                    "Detecting Synonymous Properties by Shared Data-Driven Definitions.",
                    "Entity Summarization with User Feedback.",
                    "Incremental Multi-source Entity Resolution for Knowledge Graph Completion.",
                    "Building Linked Spatio-Temporal Data from Vectorized Historical Maps.",
                    "QAnswer KG: Designing a Portable Question Answering System over RDF Data.",
                    "Equivalent Rewritings on Path Views with Binding Patterns.",
                    "A Knowledge Graph for Industry 4.0.",
                    "MetaLink: A Travel Guide to the LOD Cloud.",
                    "Astrea: Automatic Generation of SHACL Shapes from Ontologies.",
                    "SemTab 2019: Resources to Benchmark Tabular Data to Knowledge Graph Matching Systems.",
                    "VQuAnDa: Verbalization QUestion ANswering DAtaset.",
                    "ESBM: An Entity Summarization BenchMark.",
                    "GEval: A Modular and Extensible Evaluation Framework for Graph Embedding Techniques.",
                    "YAGO 4: A Reason-able Knowledge Base.",
                    "On Modeling the Physical World as a Collection of Things: The W3C Thing Description Ontology.",
                    "Applying Knowledge Graphs as Integrated Semantic Information Model for the Computerized Engineering of Building Automation Systems.",
                    "Supporting Complex Decision Making by Semantic Technologies.",
                    "Piveau: A Large-Scale Open Data Management Platform Based on Semantic Web Technologies.",
                    "StreamPipes Connect: Semantics-Based Edge Adapters for the IIoT."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020s",
                "sub_name": "The Semantic Web: ESWC 2020 Satellite Events - ESWC 2020 Satellite Events, Heraklion, Crete, Greece, May 31 - June 4, 2020, Revised Selected Papers.",
                "count": 47,
                "papers": [
                    "Towards a Core Ontology for Hierarchies of Hypotheses in Invasion Biology.",
                    "Towards Cost-Model-Based Query Execution over Hybrid Linked Data Fragments Interfaces.",
                    "How Good Is This Merged Ontology?",
                    "CoMerger: A Customizable Online Tool for Building a Consistent Quality-Assured Merged Ontology.",
                    "Semi-automatic RDFization Using Automatically Generated Mappings.",
                    "Pini Language and PiniTree Ontology Editor: Annotation and Verbalisation for Atomised Journalism.",
                    "Semantic Artificial Neural Networks.",
                    "Market and Technology Monitoring Driven by Knowledge Graphs.",
                    "A Collection of Benchmark Data Sets for Knowledge Graph-Based Similarity in the Biomedical Domain.",
                    "REWARD: Ontology for Reward Schemes.",
                    "STILTool: A Semantic Table Interpretation evaLuation Tool.",
                    "A Parthood Approach for Modeling Tangible Objects' Composition TOC - An Application on Cultural Heritage.",
                    "LandCover2RDF: An API for Computing the Land Cover of a Geographical Area and Generating the RDF Graph.",
                    "N3X: Notation3 with SPARQL Expressions.",
                    "CounQER: A System for Discovering and Linking Count Information in Knowledge Bases.",
                    "EventKG+BT: Generation of Interactive Biography Timelines from a Knowledge Graph.",
                    "Toward OWL Restriction Reconciliation in Merging Knowledge.",
                    "Linked Data Creation with ExcelRDF.",
                    "Publishing and Using Legislation and Case Law as Linked Open Data on the Semantic Web.",
                    "cqp4rdf: Towards a Suite for RDF-Based Corpus Linguistics.",
                    "Elas4RDF: Multi-perspective Triple-Centered Keyword Search over RDF Using Elasticsearch.",
                    "Answering Controlled Natural Language Questions over RDF Clinical Data.",
                    "Training NER Models: Knowledge Graphs in the Loop.",
                    "ABECTO: An ABox Evaluation and Comparison Tool for Ontologies.",
                    "LinkedPipes Applications - Automated Discovery of Configurable Linked Data Applications.",
                    "MedTable: Extracting Disease Types from Web Tables.",
                    "Can a Transformer Assist in Scientific Writing? Generating Semantic Web Paper Snippets with GPT-2.",
                    "Assessing the Quality of RDF Mappings with EvaMap.",
                    "$\\mathtt{LODsyndesis}_{IE}$: Entity Extraction from Text and Enrichment Using Hundreds of Linked Datasets.",
                    "How Many Stars Do You See in This Constellation?",
                    "A Study About the Use of OWL 2 Semantics in RDF-Based Knowledge Graphs.",
                    "Visual Analysis of Ontology Matching Results with the MELT Dashboard.",
                    "WarVictimSampo 1914-1922: A Semantic Portal and Linked Data Service for Digital Humanities Research on War History.",
                    "An HTTP/RDF-Based Agent Infrastructure for Manufacturing Using Stigmergy.",
                    "Entity Typing Based on RDF2Vec Using Supervised and Unsupervised Methods.",
                    "Automatic Annotation Service APPI: Named Entity Linking in Legal Domain.",
                    "Towards Transforming Tabular Datasets into Knowledge Graphs.",
                    "Enabling Web-Scale Knowledge Graphs Querying.",
                    "Semantic Parsing of Textual Requirements.",
                    "Domain-Specific Knowledge Graph Construction for Semantic Analysis.",
                    "Explicable Question Answering.",
                    "Towards Matching of Domain-Specific Schemas Using General-Purpose External Background Knowledge.",
                    "Evolving Meaning for Supervised Learning in Complex Biomedical Domains Using Knowledge Graphs.",
                    "Knowledge Graph-Based Legal Search over German Court Cases.",
                    "Enabling Digital Business Transformation Through an Enterprise Knowledge Graph.",
                    "Enabling FAIR Clinical Data Standards with Linked Data.",
                    "Semantic Data Integration for the SMT Manufacturing Process Using SANSA Stack."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020iot4safe",
                "sub_name": "Proceedings of the Workshop on IOT Infrastructures for Safety in Pervasive Environments (IOT4SAFE 2020) co-located with 17th Extended Semantic Web Conference (ESWC 2020), Herakleion, Greece, June 2, 2020.",
                "count": 6,
                "papers": [
                    "Invited keynote on IOT4SAFE 2020: Semantic Web Technologies in Fighting Crime and Terrorism: The CONNEXIONs Approach.",
                    "An IoT Approach for Optimizing Routing and Safety.",
                    "Private Incident Reporting Using Onion Networks.",
                    "Ontology-based Reasoning for Critical Incidents in Public Events.",
                    "A Survey on the Available Blockchain Platforms and Protocols for Supply Chain Management.",
                    "A Framework for Handling Internet of Things Data with Confidentiality and Blockchain Support."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020cleopatra",
                "sub_name": "Proceedings of the 1st International Workshop on Cross-lingual Event-centric Open Analytics co-located with the 17th Extended Semantic Web Conference (ESWC 2020), Heraklion, Crete, Greece, June 3, 2020 (online event due to COVID-19 outbreak).",
                "count": 7,
                "papers": [
                    "State-of-the-Art and Challenges in Timeline Summarization.",
                    "Exploration of Approaches to Arabic Named Entity Recognition.",
                    "A Neural-based model to Predict the Future Natural Gas Market Price through Open-domain Event Extraction.",
                    "EventKG+Click: A Dataset of Language-specific Event-centric User Interaction Traces.",
                    "A Feature Analysis for Multimodal News Retrieval.",
                    "Training Multimodal Systems for Classification with Multiple Objectives.",
                    "UNER: Universal Named-Entity Recognition Framework."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020whise",
                "sub_name": "Proceedings of the Third Workshop on Humanities in the Semantic Web (WHiSe 2020) co-located with 15th Extended Semantic Web Conference (ESWC 2020), Heraklion, Greece, June 2, 2020 (online).",
                "count": 8,
                "papers": [
                    "Modeling and Publishing Finnish Person Names as a Linked Open Data Ontology.",
                    "The Challenges of German Archival Document Categorization on Insufficient Labeled Data.",
                    "Enabling Ontology-Based Data Access to Project Gutenberg.",
                    "FindSampo Platform for Reporting and Studying Archaeological Finds Using Citizen Science.",
                    "Converting Asturian Notaries Public deeds to Linked Data Using TEI and ShExML.",
                    "Linking Dutch Civil Certificates.",
                    "Towards the Modeling of Polarity in a Latin Knowledge Base.",
                    "Challenges of Knowledge Graph Evolution from an NLP Perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020dl4kg",
                "sub_name": "Proceedings of the Workshop on Deep Learning for Knowledge Graphs (DL4KG2020) co-located with the 17th Extended Semantic Web Conference 2020 (ESWC 2020), Heraklion, Greece, June 02, 2020 - moved online.",
                "count": 7,
                "papers": [
                    "Towards Exploiting Implicit Human Feedback for Improving RDF2vec Embeddings.",
                    "DeepLENS: Deep Learning for Entity Summarization.",
                    "Conditional Constraints for Knowledge Graph Embeddings.",
                    "Entity Type Prediction in Knowledge Graphs using Embeddings.",
                    "Probing a Semantic Dependency Parser for Translational Relation Embeddings.",
                    "Semantic Entity Enrichment by Leveraging Multilingual Descriptions for Link Prediction.",
                    "Affinity Dependent Negative Sampling for Knowledge Graph Embeddings."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2020sedit",
                "sub_name": "Proceedings of the International Workshop on Semantic Digital Twins co-located with the 17th Extended Semantic Web Conference, SeDiT@ESWC 2020, Heraklion, Greece, June 3, 2020.",
                "count": 6,
                "papers": [
                    "Cognitive Digital Twins: Challenges and Opportunities for Semantic Technologies (Keynote).",
                    "Towards Integrated Data Control for Digital Twins in Industry 4.0.",
                    "A Reference Architecture for Smart Building Digital Twin.",
                    "Mechanical Testing Ontology for Digital-Twins: a Roadmap Based on EMMO.",
                    "Digital Twins and Semantic Data Fusion for Security in a Healthcare Environment.",
                    "Towards Actionable Cognitive Digital Twins for Manufacturing."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ESWC 2019",
        "info": "Portorož, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2019",
                "sub_name": "The Semantic Web - 16th International Conference, ESWC 2019, Portorož, Slovenia, June 2-6, 2019, Proceedings.",
                "count": 39,
                "papers": [
                    "A Decentralized Architecture for Sharing and Querying Semantic Data.",
                    "Reformulation-Based Query Answering for RDF Graphs with RDFS Ontologies.",
                    "A Hybrid Graph Model for Distant Supervision Relation Extraction.",
                    "Retrieving Textual Evidence for Knowledge Graph Facts.",
                    "Boosting DL Concept Learners.",
                    "Link Prediction in Knowledge Graphs with Concepts of Nearest Neighbours.",
                    "Disclosing Citation Meanings for Augmented Research Retrieval and Exploration.",
                    "Injecting Domain Knowledge in Electronic Medical Records to Improve Hospitalization Prediction.",
                    "Explore and Exploit. Dictionary Expansion with Human-in-the-Loop.",
                    "Aligning Biomedical Metadata with Ontologies Using Clustering and Embeddings.",
                    "Generating Semantic Aspects for Queries.",
                    "A Recommender System for Complex Real-World Applications with Nonlinear Dependencies and Knowledge Graph Context.",
                    "Learning URI Selection Criteria to Improve the Crawling of Linked Open Data.",
                    "Deontic Reasoning for Legal Ontologies.",
                    "Incorporating Joint Embeddings into Goal-Oriented Dialogues with Multi-task Learning.",
                    "Link Prediction Using Multi Part Embeddings.",
                    "Modelling the Compatibility of Licenses.",
                    "GConsent - A Consent Ontology Based on the GDPR.",
                    "Latent Relational Model for Relation Extraction.",
                    "Mini-ME Swift: The First Mobile OWL Reasoner for iOS.",
                    "Validation of SHACL Constraints over KGs with OWL 2 QL Ontologies via Rewriting.",
                    "An Ontology-Based Interactive System for Understanding User Queries.",
                    "Knowledge-Based Short Text Categorization Using Entity and Category Embedding.",
                    "A Hybrid Approach for Aspect-Based Sentiment Analysis Using a Lexicalized Domain Ontology and Attentional Neural Models.",
                    "Predicting Entity Mentions in Scientific Literature.",
                    "AYNEC: All You Need for Evaluating Completion Techniques in Knowledge Graphs.",
                    "RVO - The Research Variable Ontology.",
                    "EVENTSKG: A 5-Star Dataset of Top-Ranked Events in Eight Computer Science Communities.",
                    "CORAL: A Corpus of Ontological Requirements Annotated with Lexico-Syntactic Patterns.",
                    "MMKG: Multi-modal Knowledge Graphs.",
                    "BeSEPPI: Semantic-Based Benchmarking of Property Path Implementations.",
                    "QED: Out-of-the-Box Datasets for SPARQL Query Evaluation.",
                    "ToCo: An Ontology for Representing Hybrid Telecommunication Networks.",
                    "A Software Framework and Datasets for the Analysis of Graph Measures on RDF Graphs.",
                    "The Location Index: A Semantic Web Spatial Data Infrastructure.",
                    "Legislative Document Content Extraction Based on Semantic Web Technologies - A Use Case About Processing the History of the Law.",
                    "BiographySampo - Publishing and Enriching Biographies on the Semantic Web for Digital Humanities Research.",
                    "Tinderbook: Fall in Love with Culture.",
                    "Using Shape Expressions (ShEx) to Share RDF Data Models and to Guide Curation with Rigorous Validation."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2019s",
                "sub_name": "The Semantic Web: ESWC 2019 Satellite Events - ESWC 2019 Satellite Events, Portorož, Slovenia, June 2-6, 2019, Revised Selected Papers.",
                "count": 48,
                "papers": [
                    "Semantic Export Module for Close Range Photogrammetry.",
                    "Mining Scholarly Publications for Scientific Knowledge Graph Construction.",
                    "Republishing OpenStreetMap's Roads as Linked Routable Tiles.",
                    "MantisTable: A Tool for Creating Semantic Annotations on Tabular Data.",
                    "Clustering Pipelines of Large RDF POI Data.",
                    "Demonstration of a Stream Reasoning Platform on Low-End Devices to Enable Personalized Real-Time Cycling Feedback.",
                    "The Function Hub: An Implementation-Independent Read/Write Function Description Repository.",
                    "Knowledge Extraction from a Small Corpus of Unstructured Safeguarding Reports.",
                    "An Overview of the Festo Semantic Platform.",
                    "Semantic Relatedness as an Inter-facet Metric for Facet Selection over Knowledge Graphs.",
                    "How to Validate Ontologies with Themis.",
                    "The Magic of Semantic Enrichment and NLP for Medical Coding.",
                    "An Ontology of Finnish Historical Occupations.",
                    "Information Extraction in Editorial Setting. A Tale of PDFs.",
                    "An Open Source Dataset and Ontology for Product Footprinting.",
                    "IEDM: An Ontology for Irradiation Experiments Data Management.",
                    "CALVADOS: A Tool for the Semantic Analysis and Digestion of Web Contents.",
                    "Efficient Retrieval of Knowledge Graph Fact Evidences.",
                    "SAD Generator: Eating Our Own Dog Food to Generate KGs and Websites for Academic Events.",
                    "OECM: A Cross-Lingual Approach for Ontology Enrichment.",
                    "How Diverse Are Federated Query Execution Plans Really?",
                    "Open Data Chatbot.",
                    "Question Answering for Link Prediction and Verification.",
                    "Extracting Genealogical Networks of Linked Data from Biographical Texts.",
                    "Entity Embedding Analogy for Implicit Link Discovery.",
                    "A License-Based Search Engine.",
                    "HistorEx: Exploring Historical Text Corpora Using Word and Document Embeddings.",
                    "Ordia: A Web Application for Wikidata Lexemes.",
                    "Towards Cataloguing Potential Derivations of Personal Data.",
                    "DAFO: An Ontological Database System with Faceted Queries.",
                    "A Configurable Evaluation Framework for Node Embedding Techniques.",
                    "Querying the Edit History of Wikidata.",
                    "A New Tool for Linked Data Visualization and Exploration in 3D/VR Space.",
                    "Open Cultural Heritage Data in University Programming Courses.",
                    "Using an Existing Website as a Queryable Low-Cost LOD Publishing Interface.",
                    "A Tagger for Glossary of Terms Extraction from Ontology Competency Questions.",
                    "I Know Where to Find What You Want: Semantic Data Map from Silos.",
                    "Extensible Visualizations of Ontologies in OWLGrEd.",
                    "Developing a Knowledge Graph for a Question Answering System to Answer Natural Language Questions on German Grammar.",
                    "Quality-Driven Query Processing over Federated RDF Data Sources.",
                    "Efficient High-Level Semantic Enrichment of Undocumented Enterprise Data.",
                    "Knowledge-Based Dataless Text Categorization.",
                    "Methodology for Biomedical Ontology Matching.",
                    "Challenges of Constructing a Railway Knowledge Graph.",
                    "NOVA: A Knowledge Base for the Node-RED IoT Ecosystem.",
                    "Using Knowledge Graphs to Search an Enterprise Data Lake.",
                    "LiteMat, an Encoding Scheme with RDFS++ and Multiple Inheritance Support.",
                    "Building Knowledge Graphs from Survey Data: A Use Case in the Social Sciences (Extended Version)."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2019dl4kg",
                "sub_name": "Proceedings of the Workshop on Deep Learning for Knowledge Graphs (DL4KG2019) Co-located with the 16th Extended Semantic Web Conference 2019 (ESWC 2019), Portoroz, Slovenia, June 2, 2019.",
                "count": 8,
                "papers": [
                    "Loss Functions in Knowledge Graph Embedding Models.",
                    "Graph-Convolution-Based Classification for Ontology Alignment Change Prediction.",
                    "Mining Scholarly Data for Fine-Grained Knowledge Graph Construction.",
                    "A Comprehensive Survey of Knowledge Graph Embeddings with Literals: Techniques and Applications.",
                    "Iterative Entity Alignment with Improved Neural Attribute Embedding.",
                    "Knowledge Reconciliation with Graph Convolutional Networks: Preliminary Results.",
                    "End-to-End Learning for Answering Structured Queries Directly over Text.",
                    "Can Knowledge Graphs and Deep Learning Approaches help in Representing, Detecting and Interpreting Metaphors?"
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2019kgb",
                "sub_name": "Joint Proceedings of the 1st International Workshop on Knowledge Graph Building and 1st International Workshop on Large Scale RDF Analytics co-located with 16th Extended Semantic Web Conference (ESWC 2019), Portorož, Slovenia, June 3, 2019.",
                "count": 8,
                "papers": [
                    "Building Knowledge Graphs from Survey Data: A Use Case in the Social Sciences.",
                    "Building a Knowledge Graph for Products and Solutions in the Automation Industry.",
                    "Leveraging Ontologies for Knowledge Graph Schemas.",
                    "Mapping Languages: Analysis of Comparative Characteristics.",
                    "RocketRML - A NodeJS Implementation of a Use Case Specific RML Mapper.",
                    "Extending LiteMat toward RDFS++.",
                    "Unsupervised Hierarchical Grouping of Knowledge Graph Entities.",
                    "Towards Enforceable Usage Policies for Industry 4.0."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ESWC 2018",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2018",
                "sub_name": "The Semantic Web - 15th International Conference, ESWC 2018, Heraklion, Crete, Greece, June 3-7, 2018, Proceedings.",
                "count": 48,
                "papers": [
                    "Analyzing the Evolution of Vocabulary Terms and Their Impact on the LOD Cloud.",
                    "GSP (Geo-Semantic-Parsing): Geoparsing and Geotagging with Machine Learning on Top of Linked Data.",
                    "LDP-DL: A Language to Define the Design of Linked Data Platforms.",
                    "Empirical Analysis of Ranking Models for an Adaptable Dataset Search.",
                    "sameAs.cc: The Closure of 500M owl: sameAs Statements.",
                    "Modeling and Preserving Greek Government Decisions Using Semantic Web Technologies and Permissionless Blockchains.",
                    "Towards a Binary Object Notation for RDF.",
                    "User-Centric Ontology Population.",
                    "Using Ontology-Based Data Summarization to Develop Semantics-Aware Recommender Systems.",
                    "PageRank and Generic Entity Summarization for RDF Knowledge Bases.",
                    "Answering Multiple-Choice Questions in Geographical Gaokao with a Concept Graph.",
                    "TweetsKB: A Public and Large-Scale RDF Corpus of Annotated Tweets.",
                    "HDTQ: Managing RDF Datasets in Compressed Space.",
                    "Answers Partitioning and Lazy Joins for Efficient Query Relaxation and Application to Similarity Search.",
                    "Evaluation of Schema.org for Aggregation of Cultural Heritage Metadata.",
                    "Dynamic Planning for Link Discovery.",
                    "A Dataset for Web-Scale Knowledge Base Population.",
                    "EventKG: A Multilingual Event-Centric Temporal Knowledge Graph.",
                    "Semantic Concept Discovery over Event Databases.",
                    "Smart Papers: Dynamic Publications on the Blockchain.",
                    "Mind the (Language) Gap: Generation of Multilingual Wikipedia Summaries from Wikidata for ArticlePlaceholders.",
                    "What Does an Ontology Engineering Community Look Like? A Systematic Analysis of the schema.org Community.",
                    "FERASAT: A Serendipity-Fostering Faceted Browser for Linked Data.",
                    "Classifying Crises-Information Relevancy with Semantics.",
                    "Efficient Temporal Reasoning on Streams of Events with DOTR.",
                    "Intelligent Clients for Replicated Triple Pattern Fragments.",
                    "Knowledge Guided Attention and Inference for Describing Images Containing Unseen Objects.",
                    "Benchmarking of a Novel POS Tagging Based Semantic Similarity Approach for Job Description Similarity Computation.",
                    "A Tri-Partite Neural Document Language Model for Semantic Information Retrieval.",
                    "Multiple Models for Recommending Temporal Aspects of Entities.",
                    "GDPRtEXT - GDPR as a Linked Data Resource.",
                    "Transfer Learning for Item Recommendations and Knowledge Graph Completion in Item Related Domains via a Co-Factorization Model.",
                    "Modeling and Summarizing News Events Using Semantic Triples.",
                    "GNIS-LD: Serving and Visualizing the Geographic Names Information System Gazetteer as Linked Data.",
                    "Event-Enhanced Learning for KG Completion.",
                    "Exploring Enterprise Knowledge Graphs: A Use Case in Software Engineering.",
                    "Using Link Features for Entity Clustering in Knowledge Graphs.",
                    "Modeling Relational Data with Graph Convolutional Networks.",
                    "Ontology-Driven Sentiment Analysis of Product and Service Aspects.",
                    "Frankenstein: A Platform Enabling Reuse of Question Answering Components.",
                    "Querying APIs with SPARQL: Language and Worst-Case Optimal Algorithms.",
                    "Task-Oriented Complex Ontology Alignment: Two Alignment Evaluation Sets.",
                    "Where is My URI?",
                    "Optimizing Semantic Reasoning on Memory-Constrained Platforms Using the RETE Algorithm.",
                    "Efficient Ontology-Based Data Integration with Canonical IRIs.",
                    "Formal Query Generation for Question Answering over Knowledge Bases.",
                    "A LOD Backend Infrastructure for Scientific Search Portals.",
                    "Detecting Hate Speech on Twitter Using a Convolution-GRU Based Deep Neural Network."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018s",
                "sub_name": "The Semantic Web: ESWC 2018 Satellite Events - ESWC 2018 Satellite Events, Heraklion, Crete, Greece, June 3-7, 2018, Revised Selected Papers.",
                "count": 61,
                "papers": [
                    "Finding Unexplainable Triples in an RDF Graph.",
                    "ATU-DSS: Knowledge-Driven Data Integration and Reasoning for Sustainable Subsurface Inter-asset Management.",
                    "Deep Learning and Sentiment Analysis for Human-Robot Interaction.",
                    "Pseudo-Random ALC Syntax Generation.",
                    "A Protégé Plug-In for Annotating OWL Ontologies with OPLa.",
                    "An Editor that Uses a Block Metaphor for Representing Semantic Mappings in Linked Data.",
                    "A Diagrammatic Approach for Visual Question Answering over Knowledge Graphs.",
                    "Simplified SPARQL REST API - CRUD on JSON Object Graphs via URI Paths.",
                    "Hate Speech Detection on Twitter: Feature Engineering v.s. Feature Selection.",
                    "Incremental Data Partitioning of RDF Data in SPARK.",
                    "Developing an Ontology for Curriculum and Syllabus.",
                    "Computer-Assisted Ontology Construction System: Focus on Bootstrapping Capabilities.",
                    "Matching Offerings and Queries on an Internet of Things Marketplace.",
                    "Exploiting Equivalence to Infer Type Subsumption in Linked Graphs.",
                    "Speleothem - An Information System for Caves Based on Semantic Web Technologies.",
                    "M-CREAM: A Tool for Creative Modelling of Emergency Scenarios in Smart Cities.",
                    "Context Spaces as the Cornerstone of a Near-Transparent and Self-reorganizing Semantic Desktop.",
                    "SeGoFlow: A Semantic Governance Workflow Tool.",
                    "Image User Profiling with Knowledge Graph and Computer Vision.",
                    "reboting.com: Towards Geo-search and Visualization of Austrian Open Data.",
                    "Demoing Platypus - A Multilingual Question Answering Platform for Wikidata.",
                    "Knowledge Graph Embeddings with node2vec for Item Recommendation.",
                    "REDI: A Linked Data-Powered Research Networking Platform.",
                    "Combining P-Plan and the REPRODUCE-ME Ontology to Achieve Semantic Enrichment of Scientific Experiments Using Interactive Notebooks.",
                    "A Scalable Consent, Transparency and Compliance Architecture.",
                    "Enabling Conversational Tourism Assistants Through Schema.org Mapping.",
                    "A Workflow for Generation of LDP.",
                    "Supporting Sustainable Publishing and Consuming of Live Linked Time Series Streams.",
                    "TagTheWeb: Using Wikipedia Categories to Automatically Categorize Resources on the Web.",
                    "ViziQuer: A Web-Based Tool for Visual Diagrammatic Queries Over RDF Data.",
                    "EventKG+TL: Creating Cross-Lingual Timelines from an Event-Centric Knowledge Graph.",
                    "ABSTAT 1.0: Compute, Manage and Share Semantic Profiles of RDF Knowledge Graphs.",
                    "Entity Linking in 40 Languages Using MAG.",
                    "Ulysses: An Intelligent Client for Replicated Triple Pattern Fragments.",
                    "Bridging Web APIs and Linked Data with SPARQL Micro-Services.",
                    "Grasping Metaphors: Lexical Semantics in Metaphor Analysis.",
                    "The Unified Code for Units of Measure in RDF: cdt: ucum and other UCUM Datatypes.",
                    "Deep Linking Desktop Resources.",
                    "VocRec: An Automated Vocabulary Recommender Tool.",
                    "Declarative Rules for Linked Data Generation at Your Fingertips!",
                    "Modeling and Reasoning over Data Licenses.",
                    "Recommending Spatial Classes for Entity Interlinking in the Web of Data.",
                    "Ontology ABox Comparison.",
                    "Modeling and Querying Versioned Source Code in RDF.",
                    "Linkflows: Enabling a Web of Linked Semantic Publishing Workflows.",
                    "Adaptive Anomaly Detection and Root Cause Analysis by Fusing Semantics and Machine Learning.",
                    "Question Answering over Knowledge Bases.",
                    "Semantic Query Federation for Scalable Security Log Analysis.",
                    "Assessing the Quality of owl: sameAs Links.",
                    "SHARK: A Test-Driven Framework for Design and Evolution of Ontologies.",
                    "Using Linked Open Geo Boundaries for Adaptive Delineation of Functional Urban Areas.",
                    "A Study of the Similarities of Entity Embeddings Learned from Different Aspects of a Knowledge Base for Item Recommendations.",
                    "MAS: A Corpus of Tweets for Marketing in Spanish.",
                    "Benchmarking Commercial RDF Stores with Publications Office Dataset.",
                    "Such a Wonderful Place: Extracting Sense of Place from Twitter.",
                    "IoT Semantic Interoperability with Device Description Shapes.",
                    "Exploring Linked Data for the Automatic Enrichment of Historical Archives.",
                    "nlGis: A Use Case in Linked Historic Geodata.",
                    "Distributed RDF Archives Querying with Spark.",
                    "Assessing FAIR Data Principles Against the 5-Star Open Data Principles.",
                    "Translational Models for Item Recommendation."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018dl4kgs",
                "sub_name": "Proceedings of the First Workshop on Deep Learning for Knowledge Graphs and Semantic Technologies (DL4KGS) co-located with the 15th Extended Semantic Web Conerence (ESWC 2018), Heraklion, Crete, Greece, June 4, 2018.",
                "count": 9,
                "papers": [
                    "A Study of the Similarities of Entity Embeddings Learned from Different Aspects of a Knowledge Base for Item Recommendations.",
                    "An Empirical Comparison of Knowledge Graph Embeddings for Item Recommendation.",
                    "Not Just About Size - A Study on the Role of Distributed Word Representations in the Analysis of Scientific Publications.",
                    "Time-Aware and Corpus-Specific Entity Relatedness.",
                    "RDF2Vec-based Classification of Ontology Alignment Changes.",
                    "Wikipedia Infobox Type Prediction Using Embeddings.",
                    "Inferring Visual Semantic Similarity with Deep Learning and Wikidata: Introducing imagesim-353*.",
                    "Fast and Scalable Learning of Neuro-Symbolic Representations of Biomedical Knowledge.",
                    "Type Vector Representations from Text: An Empirical Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018geold",
                "sub_name": "Proceedings of the 3rd International Workshop on Geospatial Linked Data and the 2nd Workshop on Querying the Web of Data co-located with 15th Extended Semantic Web Conference (ESWC 2018), Heraklion, Greece, June 3, 2018.",
                "count": 7,
                "papers": [
                    "Using Linked Open Geo Boundaries for Adaptive Delineation of Functional Urban Areas.",
                    "License and Template Access Control for Geospatial Linked Data.",
                    "Geospatial data and Scholia.",
                    "On the Overlooked Challenges of Link Discovery.",
                    "Towards a Semantic Message-driven Microservice Platform for Geospatial and Sensor Data.",
                    "Benchmarking Commercial RDF Stores with Publications Office Dataset.",
                    "Heuristics-based Query Reordering for Federated Queries in SPARQL 1.1 and SPARQL-LD."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018emsasw",
                "sub_name": "Proceedings of 4th Workshop on Sentic Computing, Sentiment Analysis, Opinion Mining, and Emotion Detection (EMSASW 2018) Co-located with the 15th Extended Semantic Web Conference 2018 (ESWC 2018), Heraklion, Greece, June 4, 2018.",
                "count": 8,
                "papers": [
                    "Spanish Corpus of Tweets for Marketing.",
                    "Supervised Topic-Based Message Polarity Classification using Cognitive Computing.",
                    "On Finding the Relevant User Reviews for Advancing Conversational Faceted Search.",
                    "What Does it Mean to be a Wutbürger? A First Exploration.",
                    "A Dataset for Detecting Irony in Hindi-English Code-Mixed Social Media Text.",
                    "Leveraging Cognitive Computing for Gender and Emotion Detection.",
                    "In Search for Lost Emotions: Deep Learning for Opinion Taxonomy Induction.",
                    "Detecting Truthful and Useful Consumer Reviews for Products using Opinion Mining."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018semwebeval",
                "sub_name": "Semantic Web Challenges - 5th SemWebEval Challenge at ESWC 2018, Heraklion, Greece, June 3-7, 2018, Revised Selected Papers.",
                "count": 18,
                "papers": [
                    "MOCHA2018: The Mighty Storage Challenge at ESWC 2018.",
                    "Versioned Querying with OSTRICH and Comunica in MOCHA 2018.",
                    "Benchmarking Virtuoso 8 at the Mighty Storage Challenge 2018: Challenge Results.",
                    "Open Knowledge Extraction Challenge 2018.",
                    "Relation Extraction for Knowledge Base Completion: A Supervised Approach.",
                    "The Scalable Question Answering Over Linked Data (SQA) Challenge 2018.",
                    "On the scalability of the QA System WDAqua-core1.",
                    "GQA: Grammatical Question Answering for RDF Data.",
                    "A Language Adaptive Method for Question Answering on French and English.",
                    "Semantic Sentiment Analysis Challenge at ESWC2018.",
                    "Domain-Aware Sentiment Classification with GRUs and CNNs.",
                    "Fine-Tuning of Word Embeddings for Semantic Sentiment Analysis.",
                    "The KABSA System at ESWC-2018 Challenge on Semantic Sentiment Analysis.",
                    "The IRMUDOSA System at ESWC-2018 Challenge on Semantic Sentiment Analysis.",
                    "The CLAUSY System at ESWC-2018 Challenge on Semantic Sentiment Analysis.",
                    "The NeuroSent System at ESWC-2018 Challenge on Semantic Sentiment Analysis.",
                    "The FeatureSent System at ESWC-2018 Challenge on Semantic Sentiment Analysis.",
                    "Evaluating Quality of Word Embeddings with Sentiment Polarity Identification Task."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2018sw4ch",
                "sub_name": "Proceedings of the Third International Workshop on Semantic Web for Cultural Heritage co-located with the 15th Extended Semantic Web Conference, SW4CH@ESWC 2018, Heraklion, Crete, Greece, June 3, 2018.",
                "count": 8,
                "papers": [
                    "A Vocabulary of Culturally Relevant Relationships to Interlink Digital Heritage Objects over the Web Using LOD Technologies.",
                    "VisTA: Visual Terminology Alignment Tool for Factual Knowledge Aggregation.",
                    "Exploring Linked Data for the Automatic Enrichment of Historical Archives.",
                    "nlGis: A Use Case in Linked Historic Geodata.",
                    "Semantic Preventive Conservation of Cultural Heritage Collections.",
                    "Cultural Mapping of Villages in India Using CIDOC-CRM.",
                    "Efficient & Expressive Semantic Information Push for Cultural Heritage Applications.",
                    "Clustering over the Cultural Heritage Linked Open Dataset: Xlendi Shipwreck."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ESWC 2017",
        "info": "Portorož, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2017-1",
                "sub_name": "The Semantic Web - 14th International Conference, ESWC 2017, Portorož, Slovenia, May 28 - June 1, 2017, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "Traffic Analytics for Linked Data Publishers.",
                    "Explaining Graph Navigational Queries.",
                    "A SPARQL Extension for Generating RDF from Heterogeneous Formats.",
                    "Exploiting Source-Object Networks to Resolve Object Conflicts in Linked Data.",
                    "Methods for Intrinsic Evaluation of Links in the Web of Data.",
                    "Entity Deduplication on ScholarlyData.",
                    "Wombat - A Generalization Approach for Automatic Link Discovery.",
                    "Actively Learning to Rank Semantic Associations for Personalized Contextual Exploration of Knowledge Graphs.",
                    "Synthesizing Knowledge Graphs for Link and Type Prediction Benchmarking.",
                    "Online Relation Alignment for Linked Datasets.",
                    "Tuning Personalized PageRank for Semantics-Aware Recommendations Based on Linked Open Data.",
                    "Terminological Cluster Trees for Disjointness Axiom Discovery.",
                    "Embedding Learning for Declarative Memories.",
                    "Spatial Ontology-Mediated Query Answering over Mobility Streams.",
                    "Optimizing the Performance of Concurrent RDF Stream Processing Queries.",
                    "AGACY Monitoring: A Hybrid Model for Activity Recognition and Uncertainty Handling.",
                    "Mapping Natural Language to Description Logic.",
                    "Harnessing Diversity in Crowds and Machines for Better NER Performance.",
                    "All that Glitters Is Not Gold - Rule-Based Curation of Reference Datasets for Named Entity Recognition and Entity Linking.",
                    "Semantic Annotation of Data Processing Pipelines in Scientific Publications.",
                    "Combining Word and Entity Embeddings for Entity Linking.",
                    "Beyond Time: Dynamic Context-Aware Entity Recommendation.",
                    "Patterns for Heterogeneous TBox Mappings to Bridge Different Modelling Decisions.",
                    "Exploring Importance Measures for Summarizing RDF/S KBs.",
                    "Data-Driven Joint Debugging of the DBpedia Mappings and Ontology - Towards Addressing the Causes Instead of the Symptoms of Data Quality in DBpedia.",
                    "Rule-Based OWL Modeling with ROWLTab Protégé Plugin.",
                    "Chaudron: Extending DBpedia with Measurement.",
                    "SM4MQ: A Semantic Model for Multidimensional Queries.",
                    "Using Insights from Psychology and Language to Improve How People Reason with Description Logics.",
                    "Updating Wikipedia via DBpedia Mappings and SPARQL.",
                    "Learning Commonalities in RDF.",
                    "Lean Kernels in Description Logics.",
                    "Linked Data Notifications: A Resource-Centric Communication Protocol.",
                    "Crowdsourced Affinity: A Matter of Fact or Experience.",
                    "A Semantic Graph-Based Approach for Radicalisation Detection on Social Media.",
                    "Modeling and Querying Greek Legislation Using Semantic Web Technologies.",
                    "Self-Enforcing Access Control for Encrypted RDF.",
                    "Removing Barriers to Transparency: A Case Study on the Use of Semantic Technologies to Tackle Procurement Data Inconsistency.",
                    "NdFluents: An Ontology for Annotated Statements with Inference Preservation.",
                    "Adopting Semantic Technologies for Effective Corporate Transparency."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017-2",
                "sub_name": "The Semantic Web - 14th International Conference, ESWC 2017, Portorož, Slovenia, May 28 - June 1, 2017, Proceedings, Part II.",
                "count": 21,
                "papers": [
                    "Applying Semantic Web Technologies to Assess Maintenance Tasks from Operational Interruptions: A Use-Case at Airbus.",
                    "Modeling Company Risk and Importance in Supply Graphs.",
                    "Declarative Data Transformations for Linked Data Generation: The Case of DBpedia.",
                    "BalOnSe: Temporal Aspects of Dance Movement and Its Ontological Representation.",
                    "Reasoning on Engineering Knowledge: Applications and Desired Features.",
                    "A Compressed, Inference-Enabled Encoding Scheme for RDF Stream Processing.",
                    "From Data to City Indicators: A Knowledge Graph for Supporting Automatic Generation of Dashboards.",
                    "Ontology-Driven Unified Governance in Software Engineering: The PoolParty Case Study.",
                    "A Hypercat-Enabled Semantic Internet of Things Data Hub.",
                    "ArmaTweet: Detecting Events by Semantic Tweet Analysis.",
                    "smartAPI: Towards a More Intelligent Network of Web APIs.",
                    "Automating the Dynamic Interactions of Self-governed Components in Distributed Architectures.",
                    "Building and Processing a Knowledge-Graph for Legal Data.",
                    "Ontology Matching Algorithms for Data Model Alignment in Big Data.",
                    "Ontology-Based Data Access Mapping Generation Using Data, Schema, Query, and Mapping Knowledge.",
                    "Engaging Librarians in the Process of Interlinking RDF Resources.",
                    "A Knowledge-Based Framework for Improving Accessibility of Web Sites.",
                    "Iterative Approach for Information Extraction and Ontology Learning from Textual Aviation Safety Reports.",
                    "Integrative Data Management for Reproducibility of Microscopy Experiments.",
                    "Towards an Open Extensible Framework for Empirical Benchmarking of Data Management Solutions: LITMUS.",
                    "Enhancing White-Box Machine Learning Processes by Incorporating Semantic Background Knowledge."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017s",
                "sub_name": "The Semantic Web: ESWC 2017 Satellite Events - ESWC 2017 Satellite Events, Portorož, Slovenia, May 28 - June 1, 2017, Revised Selected Papers.",
                "count": 45,
                "papers": [
                    "Ontology-Based Photogrammetric Survey in Underwater Archaeology.",
                    "Assessing the Completeness of Entities in Knowledge Bases.",
                    "Unsupervised Open Relation Extraction.",
                    "REPRODUCE-ME: Ontology-Based Data Access for Reproducibility of Microscopy Experiments.",
                    "Leveraging Cognitive Computing for Multi-class Classification of E-learning Videos.",
                    "The datAcron Ontology for Semantic Trajectories.",
                    "Dynamic Semantic Music Notation - Using Linked Data to Enhance Music Performance.",
                    "Towards Learning Commonalities in SPARQL.",
                    "AMR2FRED, A Tool for Translating Abstract Meaning Representation to Motif-Based Linguistic Knowledge Graphs.",
                    "Trill: A Reusable Front-End for QA Systems.",
                    "KBox: Distributing Ready-to-Query RDF Knowledge Graphs.",
                    "Verbalising OWL Ontologies in IsiZulu with Python.",
                    "ComSem: Digitization and Semantic Annotation of Comic Books.",
                    "Live Storage and Querying of Versioned Datasets on the Web.",
                    "\\mu μ RDF Store: Towards Extending the Semantic Web to Embedded Devices.",
                    "Introducing Feedback in Qanary: How Users Can Interact with QA Systems.",
                    "Juma: An Editor that Uses a Block Metaphor to Facilitate the Creation and Editing of R2RML Mappings.",
                    "Automated UML-Based Ontology Generation in OSLO2.",
                    "Honey Bee Versus Apis Mellifera: A Semantic Search for Biological Data.",
                    "EvoRDF: A Framework for Exploring Ontology Evolution.",
                    "Rendering OWL in Description Logic Syntax.",
                    "MappingPedia: A Collaborative Environment for R2RML Mappings.",
                    "TDDonto2: A Test-Driven Development Plugin for Arbitrary TBox and ABox Axioms.",
                    "Ladda: SPARQL Queries in the Fog of Browsers.",
                    "Talking Open Data.",
                    "YAM++ Online: A Web Platform for Ontology and Thesaurus Matching and Mapping Validation.",
                    "SPARQL2Git: Transparent SPARQL and Linked Data API Curation via Git.",
                    "Eaglet - a Named Entity Recognition and Entity Linking Gold Standard Checking Tool.",
                    "Framework for Live Synchronization of RDF Views of Relational Data.",
                    "JedAI: The Force Behind Entity Resolution.",
                    "Context-Aware and Self-learning Dynamic Transport Scheduling in Hospitals.",
                    "RML and FnO: Shaping DBpedia Declaratively.",
                    "Parallelizing Federated SPARQL Queries in Presence of Replicated Data.",
                    "Biomedical Semantic Resources for Drug Discovery Platforms.",
                    "SHARP: Harmonizing and Bridging Cross-Workflow Provenance.",
                    "Scholia, Scientometrics and Wikidata.",
                    "SLD Revolution: A Cheaper, Faster yet More Accurate Streaming Linked Data Framework.",
                    "From Conditional Random Field (CRF) to Rhetorical Structure Theory(RST): Incorporating Context Information in Sentiment Analysis.",
                    "Making Sense of Indoor Spaces Using Semantic Web Mining and Situated Robot Perception.",
                    "TRiC: Terms, RIghts and Conditions Semantic Descriptors for Smart Contracts.",
                    "Towards the Temporal Streaming of Graph Data on Distributed Ledgers.",
                    "A Linked Data Profiling Service for Quality Assessment.",
                    "Predicting Relations Between RDF Entities by Deep Neural Network.",
                    "ELMDist: A Vector Space Model with Words and MusicBrainz Entities.",
                    "Linked Death - Representing, Publishing, and Using Second World War Death Records as Linked Open Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017mepdaw",
                "sub_name": "Joint proceedings of the 3rd Workshop on Managing the Evolution and Preservation of the Data Web (MEPDaW 2017) and the 4th Workshop on Linked Data Quality (LDQ 2017) co-located with 14th European Semantic Web Conference (ESWC 2017), Portorož, Slovenia, May 28th-29th, 2017.",
                "count": 9,
                "papers": [
                    "Versioned Triple Pattern Fragments: A Low-cost Linked Data Interface Feature for Web Archives.",
                    "Exploring the Evolution and Provenance of Git Versioned RDF Data.",
                    "Time Travel Queries in RDF Archives.",
                    "Computing Changesets for RDF Views of Relational Data.",
                    "Cross-domain Semantic Drift Measurement in Ontologies Using the SemaDrift Tool and Metrics.",
                    "Temporal Evolution of Entity Relatedness using Wikipedia and DBpedia.",
                    "A Linked Data Profiling Service for Quality Assessment.",
                    "Towards Ontology Quality Assessment.",
                    "An Ontology-based Validation Approach to Resolve Conflicts in the Manufacturing Design Process."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017rsp",
                "sub_name": "Joint Proceedings of the 2nd RDF Stream Processing (RSP 2017) and the Querying the Web of Data (QuWeDa 2017) Workshops co-located with 14th ESWC 2017 (ESWC 2017), Portoroz, Slovenia, May 28th - to - 29th, 2017.",
                "count": 6,
                "papers": [
                    "SLD Revolution: A Cheaper, Faster yet more Accurate Streaming Linked Data Framework.",
                    "C-GeoSPARQL: Streaming GeoSPARQL Support on C-SPARQL.",
                    "Towards a Benchmark for Expressive Stream Reasoning.",
                    "PeNeLoop: Parallelizing Federated SPARQL Queries in Presence of Replicated Fragments.",
                    "Demonstration of Using a Domain-Specific Visual Modeler for Building Semantic Queries.",
                    "JPA Criteria Queries over RDF Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017emsasw",
                "sub_name": "Proceedings of the 3rd International Workshop at ESWC on Emotions, Modality, Sentiment Analysis and the Semantic Web co-located with 14th ESWC 2017, Portroz, Slovenia, May 28, 2017.",
                "count": 6,
                "papers": [
                    "To Parse or Not to Parse: An Experimental Comparison of RNTNs and CNNs for Sentiment Analysis.",
                    "Bearish-Bullish Sentiment Analysis on Financial Microblogs.",
                    "MORE SENSE: MOvie REviews SENtiment analysis boosted with SEmantics.",
                    "Exploiting Polarity Features for Developing Sentiment Analysis Tool.",
                    "Extracting Linguistic Features From Opinion Data Streams For Multi-Domain Sentiment Analysis.",
                    "A Branching Strategy For Unsupervised Aspect-based Sentiment Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017answer",
                "sub_name": "Proceedings of the 1st International Workshop on Application of Semantic Web technologies in Robotics co-located with 14th Extended Semantic Web Conference (ESWC 2017), Portoroz, Slovenia, May 29th, 2017.",
                "count": 7,
                "papers": [
                    "Frame Instance Extraction and Clustering for Default Knowledge Building.",
                    "Exploiting Context and Semantics for UAV Path-finding in an Urban Setting.",
                    "Personalized Robotic Intervention Strategy by Using Semantics for People with Dementia in Nursing Homes.",
                    "Making Sense of Indoor Spaces Using Semantic Web Mining and Situated Robot Perception.",
                    "Autonomous Comprehensive Geriatric Assessment.",
                    "A Knowledge Management System for Assistive Robotics.",
                    "Knowledge-driven Support for Reminiscence on Companion Robots."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017sewebmeda",
                "sub_name": "Proceedings of the Workshop on Semantic Web Solutions for Large-scale Biomedical Data Analytics co-located with 14th Extended Semantic Web Conference, SeWeBMeDA@ESWC 2017, Portoroz, Slovenia, May 28, 2017.",
                "count": 7,
                "papers": [
                    "An Approach for Discovering and Exploring Semantic Relationships between Genes.",
                    "Federated Query Formulation and Processing through BioFed.",
                    "Exploiting Cognitive Computing and Frame Semantic Features for Biomedical Document Clustering.",
                    "A Deep Learning Approach to Genomics Data for Population Scale Clustering and Ethnicity Prediction.",
                    "SHARP: Harmonizing Cross-workflow Provenance.",
                    "Quantifying the Content of Biomedical Semantic Resources as a Core for Drug Discovery Platforms.",
                    "SHARP: Harmonizing Galaxy and Taverna Workflow Provenance."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2017semwebeval",
                "sub_name": "Semantic Web Challenges - 4th SemWebEval Challenge at ESWC 2017, Portoroz, Slovenia, May 28 - June 1, 2017, Revised Selected Papers.",
                "count": 15,
                "papers": [
                    "MOCHA2017: The Mighty Storage Challenge at ESWC 2017.",
                    "Challenge Accepted: QUAD Meets MOCHA2017.",
                    "MOCHA 2017 as a Challenge for Virtuoso.",
                    "Open Knowledge Extraction Challenge 2017.",
                    "ADEL@OKE 2017: A Generic Method for Indexing Knowledge Bases for Entity Linking.",
                    "7th Open Challenge on Question Answering over Linked Data (QALD-7).",
                    "End-to-End Representation Learning for Question Answering with Weak Supervision.",
                    "WDAqua-core0: A Question Answering Component for the Research Community.",
                    "AMAL: Answering French Natural Language Questions Using DBpedia.",
                    "Semantic Sentiment Analysis Challenge at ESWC2017.",
                    "Fine-Grained Sentiment Analysis on Financial Microblogs and News Headlines.",
                    "Language Independent Sentiment Analysis of the Shukran Social Network Using Apache Spark.",
                    "Aspect-Based Opinion Mining Using Knowledge Bases.",
                    "The IRMUDOSA System at ESWC-2017 Challenge on Semantic Sentiment Analysis.",
                    "Opinion Mining with a Clause-Based Approach."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ESWC 2016",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2016",
                "sub_name": "The Semantic Web. Latest Advances and New Domains - 13th International Conference, ESWC 2016, Heraklion, Crete, Greece, May 29 - June 2, 2016, Proceedings.",
                "count": 57,
                "papers": [
                    "Detecting Similar Linked Datasets Using Topic Modelling.",
                    "Heuristics for Connecting Heterogeneous Knowledge via FrameBase.",
                    "Dataset Recommendation for Data Linking: An Intensional Approach.",
                    "From Queriability to Informativity, Assessing \"Quality in Use\" of DBpedia and YAGO.",
                    "Normalized Semantic Web Distance.",
                    "Gleaning Types for Literals in RDF Triples with Application to Entity Summarization.",
                    "TermPicker: Enabling the Reuse of Vocabulary Terms by Exploiting Data from the Linked Open Data Cloud.",
                    "Implicit Entity Linking in Tweets.",
                    "Fast Approximate A-Box Consistency Checking Using Machine Learning.",
                    "Enriching Product Ads with Metadata from HTML Annotations.",
                    "Iterative Entity Navigation via Co-clustering Semantic Links and Entity Classes.",
                    "DoSeR - A Knowledge-Base-Agnostic Framework for Entity Disambiguation Using Semantic Embeddings.",
                    "Embedding Mapping Approaches for Tensor Factorization and Knowledge Graph Modelling.",
                    "Comparing Vocabulary Term Recommendations Using Association Rules and Learning to Rank: A User Study.",
                    "Full-Text Support for Publish/Subscribe Ontology Systems.",
                    "Heaven: A Framework for Systematic Comparative Research Approach for RSP Engines.",
                    "Bridging the Gap Between Formal Languages and Natural Languages with Zippers.",
                    "Towards Monitoring of Novel Statements in the News.",
                    "AskNow: A Framework for Natural Language Query Formalization in SPARQL.",
                    "Knowledge Extraction for Information Retrieval.",
                    "Efficient Graph-Based Document Similarity.",
                    "Semantic Topic Compass - Classification Based on Unsupervised Feature Ambiguity Gradation.",
                    "Supporting Arbitrary Custom Datatypes in RDF and SPARQL.",
                    "Handling Inconsistencies Due to Class Disjointness in SPARQL Updates.",
                    "A Contextualised Semantics for owl: sameAs.",
                    "The Lazy Traveling Salesman - Memory Management for Large-Scale Link Discovery.",
                    "RDF Query Relaxation Strategies Based on Failure Causes.",
                    "CyCLaDEs: A Decentralized Cache for Triple Pattern Fragments.",
                    "LOTUS: Adaptive Text Search for Big Linked Data.",
                    "Query Rewriting in RDF Stream Processing.",
                    "Linking Data, Services and Human Know-How.",
                    "VOLT: A Provenance-Producing, Transparent SPARQL Proxy for the On-Demand Computation of Linked Data and its Application to Spatiotemporally Dependent Data.",
                    "Learning to Classify Spatiotextual Entities in Maps.",
                    "Supporting Geo-Ontology Engineering Through Spatial Data Analytics.",
                    "Provenance Management for Evolving RDF Datasets.",
                    "Private Record Linkage: Comparison of Selected Techniques for Name Matching.",
                    "An Ontology-Driven Approach for Semantic Annotation of Documents with Specific Concepts.",
                    "Qanary - A Methodology for Vocabulary-Driven Open Question Answering Systems.",
                    "Test-Driven Development of Ontologies.",
                    "Semantically Enhanced Quality Assurance in the JURION Business Use Case.",
                    "Adaptive Linked Data-Driven Web Components: Building Flexible and Reusable Semantic Web Interfaces - Building Flexible and Reusable Semantic Web Interfaces.",
                    "Building the Seshat Ontology for a Global History Databank.",
                    "RMLEditor: A Graph-Based Mapping Editor for Linked Data Mappings.",
                    "Enriching a Small Artwork Collection Through Semantic Linking.",
                    "Ontology-Based Data Access for Maritime Security.",
                    "WarSampo Data Service and Semantic Portal for Publishing Linked Open Data About the Second World War History.",
                    "Predicting Drug-Drug Interactions Through Large-Scale Similarity-Based Link Prediction.",
                    "Semantics Driven Human-Machine Computation Framework for Linked Islamic Knowledge Engineering.",
                    "Towards Scalable Federated Context-Aware Stream Reasoning.",
                    "Machine-Crowd Annotation Workflow for Event Understanding Across Collections and Domains.",
                    "Distributed Context-Aware Applications by Means of Web of Things and Semantic Web Technologies.",
                    "On Learnability of Constraints from RDF Data.",
                    "A Knowledge-Based Framework for Events Representation and Reuse from Historical Archives.",
                    "Unsupervised Conceptualization and Semantic Text Indexing for Information Extraction.",
                    "Continuously Self-Updating Query Results over Dynamic Heterogeneous Linked Data.",
                    "Exploiting Disagreement Through Open-Ended Tasks for Capturing Interpretation Spaces.",
                    "A Semantic Approach for Process Annotation and Similarity Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016s",
                "sub_name": "The Semantic Web - ESWC 2016 Satellite Events, Heraklion, Crete, Greece, May 29 - June 2, 2016, Revised Selected Papers.",
                "count": 55,
                "papers": [
                    "Moving Real-Time Linked Data Query Evaluation to the Client.",
                    "Building a General Knowledge Base of Physical Objects for Robots.",
                    "Some Thoughts on OWL-Empowered SPARQL Query Optimization.",
                    "Edinburgh Associative Thesaurus as RDF and DBpedia Mapping.",
                    "Erratum to: Edinburgh Associative Thesaurus as RDF and DBpedia Mapping.",
                    "StaRe: Statistical Reasoning Tool for 5G Network Management.",
                    "Dem@Home: Ambient Monitoring and Clinical Support for People Living with Dementia.",
                    "Pattern-Based Keyword Search on RDF Data.",
                    "Connecting the Dots: Explaining Relationships Between Unconnected Entities in a Knowledge Graph.",
                    "Iterative TempoWordNet.",
                    "An Ontology to Semantically Declare and Describe Functions.",
                    "Context Sensitive Entity Linking of Search Queries in Enterprise Knowledge Graphs.",
                    "Incorporating Functions in Mappings to Facilitate the Uplift of CSV Files into RDF.",
                    "Automatic Extraction of Axioms from Wikipedia Using SPARQL.",
                    "Towards a Platform for Curation Technologies: Enriching Text Collections with a Semantic-Web Layer.",
                    "Towards Entity Summarisation on Structured Web Markup.",
                    "Taking Advantage of Discursive Properties for Validating Hierarchical Semantic Relations from Parallel Enumerative Structures.",
                    "Separating Wheat from the Chaff - A Relationship Ranking Algorithm.",
                    "Semantic Web Conference Ontology - A Refactoring Solution.",
                    "Semantic Context Consolidation and Rule Learning for Optimized Transport Assignments in Hospitals.",
                    "LinkedPipes ETL: Evolved Linked Data Preparation.",
                    "DataGraft: Simplifying Open Data Publishing.",
                    "Link++: A Flexible and Customizable Tool for Connecting RDF Data Sources.",
                    "LinkedPipes Visualization: Simple Useful Linked Data Visualization Use Cases.",
                    "ADA - Automated Data Architecture - Creating User Journeys Through Content Using Linked Data.",
                    "Graph-Based Editing of Linked Data Mappings Using the RMLEditor.",
                    "SPARQL Query Recommendations by Example.",
                    "Tabular Data Cleaning and Linked Data Generation with Grafterizer.",
                    "SentiCircles: A Platform for Contextual and Conceptual Sentiment Analysis.",
                    "PepeSearch: Easy to Use and Easy to Install Semantic Data Search.",
                    "AutoRDF - Using OWL as an Object Graph Mapping (OGM) Specification Language.",
                    "JOPA: Efficient Ontology-Based Information System Design.",
                    "A Visual Query System for Stream Data Access over Ontologies.",
                    "Extending RapidMiner with Data Search and Integration Capabilities.",
                    "Smart City Artifacts Web Portal.",
                    "Workflow Supporting Toolset for Diagram-Based Collaborative Ontology Development Implemented in the Open Budget Domain.",
                    "Qanary - The Fast Track to Creating a Question Answering System with Linked Data Technology.",
                    "Computing Linked Data On-Demand Using the VOLT Proxy.",
                    "The Song Remains the Same: Lossless Conversion and Streaming of MIDI to RDF and Back.",
                    "An Empirical, Quantitative Analysis of the Differences Between Sarcasm and Irony.",
                    "Polarity Classification for Target Phrases in Tweets: A Word2Vec Approach.",
                    "PageRank on Wikipedia: Towards General Importance Scores for Entities.",
                    "Increasing Quality of Austrian Open Data by Linking Them to Linked Data Sources: Lessons Learned.",
                    "Anno4j - Idiomatic Access to the W3C Web Annotation Data Model.",
                    "Continuous Client-Side Query Evaluation over Dynamic Linked Data.",
                    "Assessing Trust with PageRank in the Web of Data.",
                    "The Generation of a Corpus for Clinical Sentiment Analysis.",
                    "Modeling and Composing Uncertain Web Resources.",
                    "grlc Makes GitHub Taste Like Linked Data APIs.",
                    "Dem@Home: Ambient Intelligence for Clinical Support of People Living with Dementia.",
                    "The Resource Action Language: Towards Designing Reactive RDF Stores.",
                    "ABSTAT: Ontology-Driven Linked Data Summaries with Pattern Minimalization.",
                    "Text Encoder and Annotator: An All-in-one Editor for Transcribing and Annotating Manuscripts with RDF.",
                    "Extending the Lemon Model for a Dictionary of Old Occitan Medico-Botanical Terminology.",
                    "An Ecosystem for Linked Humanities Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016profiles",
                "sub_name": "Proceedings of the 3rd International Workshop on Dataset PROFIling and fEderated Search for Linked Data (PROFILES '16) co-located with the 13th ESWC 2016 Conference, Anissaras, Greece, May 30, 2016.",
                "count": 6,
                "papers": [
                    "Qualitative Analysis of Vocabulary Evolution on the Linked Open Data Cloud.",
                    "Information-theoretic Analysis of Entity Dynamics on the Linked Open Data Cloud.",
                    "Position Paper: Dataset profling for un-Linked Data.",
                    "UPSP: Unique Predicate-based Source Selection for SPARQL Endpoint Federation.",
                    "Assessing Trust with PageRank in the Web of Data.",
                    "Federated Query Processing: Challenges and Opportunities."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016emsa",
                "sub_name": "Joint Proceedings of the 2th Workshop on Emotions, Modality, Sentiment Analysis and the Semantic Web and the 1st International Workshop on Extraction and Processing of Rich Semantics from Medical Texts co-located with ESWC 2016, Heraklion, Greece, May 29, 2016.",
                "count": 7,
                "papers": [
                    "Emotion Level Sentiment Analysis: The Affective Opinion Evaluation.",
                    "Towards Unsupervised Approaches For Aspects Extraction.",
                    "Fuzzy Synsets, and Lexicon-Based Sentiment Analysis.",
                    "Extraction and Processing of Rich Semantics from Medical Texts.",
                    "Medical Text Processing for SMDA project.",
                    "A Task-based Comparison of Linguistic and Semantic Document Retrieval Methods in the Medical Domain.",
                    "Towards Integrated Information Extraction and Facetted Search Applications in Nephrology."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016knowlod",
                "sub_name": "Joint Proceedings of the 5th Workshop on Data Mining and Knowledge Discovery meets Linked Open Data and the 1st International Workshop on Completing and Debugging the Semantic Web (Know@LOD-2016, CoDeS-2016) co-located with 13th ESWC 2016, Heraklion, Greece, May 30th, 2016.",
                "count": 9,
                "papers": [
                    "Extending FrameNet to Machine Learning Domain.",
                    "PageRank on Wikipedia: Towards General Importance Scores for Entities.",
                    "Learning Semantic Rules for Intelligent Transport Scheduling in Hospitals.",
                    "The Linked Data Mining Challenge 2016.",
                    "Not-So-Linked Solution to the Linked Data Mining Challenge 2016.",
                    "A Hybrid Method for Rating Prediction Using Linked Data Features and Text Reviews.",
                    "Can You Judge a Music Album by its Cover?",
                    "Finding and Avoiding Bugs in Enterprise Ontologies.",
                    "A Two-Fold Quality Assurance Approach for Dynamic Knowledge Bases: The 3cixty Use Case."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016mepdaw",
                "sub_name": "Joint Proceedings of the 2nd Workshop on Managing the Evolution and Preservation of the Data Web (MEPDaW 2016) and the 3rd Workshop on Linked Data Quality (LDQ 2016) co-located with 13th European Semantic Web Conference (ESWC 2016), Heraklion, Crete, Greece, May 30th, 2016.",
                "count": 7,
                "papers": [
                    "Continuously Updating Query Results over Real-Time Linked Data.",
                    "Transaction-Time Queries in Dydra.",
                    "The EvoGen Benchmark Suite for Evolving RDF Data.",
                    "Toward Semantic Sensor Data Archives on the Web.",
                    "Increasing Quality of Austrian Open Data by Linking them to Linked Data Sources: Lessons Learned.",
                    "Describing Reasoning Results with RVO, the Reasoning Violations Ontology.",
                    "Towards Sustainable Extract-Transform-Load Fusion of Company Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016semper",
                "sub_name": "Proceedings of the 1st Workshop on Semantic Web Technologies for Mobile and Pervasive Environments co-located with the 13th Extended Semantic Web Conference (ESWC 2016), Heraklion, Greece, May 29, 2016.",
                "count": 6,
                "papers": [
                    "Self-Service Ambient Intelligence Using Web of Things Technologies.",
                    "Domain Experts Surfing on Stream Sensor Data over Ontologies.",
                    "Detection of Hypoglycemic Events through Wearable Sensors.",
                    "Dem@Home: Ambient Intelligence for Clinical Support of People Living with Dementia.",
                    "Combining Ontologies and Markov Logic Networks for Statistical Relational Mobile Network Analysis.",
                    "The Resource Action Language (ReAL): Towards Designing Reactive RDF Stores."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016swash",
                "sub_name": "Proceedings of the Second International Workshop on Semantic Web for Scientific Heritage co-located with 13th Extended Semantic Web Conference (ESWC 2016), Heraklion, Greece, May 30th, 2016.",
                "count": 8,
                "papers": [
                    "Ontologies and the Cultural Heritage. The case of GO!",
                    "Atλaς, a Gazetteer Linking Archaeological Collections.",
                    "A Lexicon for Old Occitan Medico-Botanical Terminology in Lemon.",
                    "Representing Polysemy and Diachronic Lexico-Semantic Data on the Semantic Web ?",
                    "Modeling the Hebrew Bible: Potential of Topic Modeling Techniques for Semantic Annotation and Historical Analysis.",
                    "Text Encoder and Annotator: an all-in-one Editor for Transcribing and Annotating Manuscripts with RDF.",
                    "Semantic Categorization of Segments of Ancient and Mediaeval Zoological Texts.",
                    "Summa Philosophiae: a Semantic Wiki for Professional Philosophers."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016sumpre",
                "sub_name": "Proceedings of the 2nd International Workshop on Summarizing and Presenting Entities and Ontologies (SumPre 2016) co-located with the 13th Extended Semantic Web Conference (ESWC 2016), Anissaras, Greece, May 30, 2016.",
                "count": 8,
                "papers": [
                    "ELLIS: Interactive Exploration of Linked Data on the Level of Induced Schema Patterns.",
                    "Ontology Search by Categorization Power.",
                    "ABSTAT: Ontology-driven Linked Data Summaries with Pattern Minimalization.",
                    "A New Metric To Evaluate Ontology Modularization.",
                    "DBtrends: Publishing and Benchmarking RDF Ranking Functions.",
                    "Results of the 2016 ENtity Summarization Evaluation Campaign (ENSEC 2016).",
                    "CD at ENSEC 2016: Generating Characteristic and Diverse Entity Summaries.",
                    "A Common Property and Special Property Entity Summarization Approach Based on Statistical Distribution."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016whise",
                "sub_name": "Proceedings of the 1st Workshop on Humanities in the Semantic Web co-located with 13th ESWC Conference 2016 (ESWC 2016), Anissaras, Greece, May 29th, 2016.",
                "count": 10,
                "papers": [
                    "Linked Death - representing, publishing, and using Second World War death records as Linked Open Data.",
                    "Managing metadata for science, technology and innovation studies: The RISIS case.",
                    "Case study: towards a linked digital collection of Latvian cultural heritage.",
                    "Linking data in digital libraries: the case of Puglia Digital Library.",
                    "Linked Data brokering service for historical places and maps.",
                    "Data repositories in the Humanities and the Semantic Web: modelling, linking, visualising.",
                    "Ontology-based representation of context of use in digital preservation.",
                    "A linked research network that is Transforming Musicology.",
                    "On the description of process in digital scholarship.",
                    "An ecosystem for Linked Humanities Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016lime",
                "sub_name": "Joint Proceedings of the 4th International Workshop on Linked Media and the 3rd Developers Hackshop co-located with the 13th Extended Semantic Web Conference ESWC 2016, Heraklion, Crete, Greece, May 30, 2016.",
                "count": 9,
                "papers": [
                    "A Workflow for Cross Media Recommendations based on Linked Data Analysis.",
                    "The LinkedTV Platform -Towards a Reactive Linked Media Management System.",
                    "Lifting Media Fragment URIs to the next Level.",
                    "The MICO Broker: An Orchestration Framework for Linked Data Extractors.",
                    "Idiomatic Persistence and Querying for the W3C Web Annotation Data Model.",
                    "Creating Semantic Mind Maps from Linked Data with AutoMind Creator.",
                    "DataGraft: A Platform for Open Data Publishing.",
                    "Linked Data Reactor: a Framework for Building Reactive Linked Data Applications.",
                    "SPARQL Faceter - Client-side Faceted Search Based on SPARQL."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016salad",
                "sub_name": "Proceedings of the 4th Workshop on Services and Applications over Linked APIs and Data co-located with the 13th Extended Semantic Web Conference (ESWC 2016), Crete, Greece, May 29, 2016.",
                "count": 7,
                "papers": [
                    "Towards Definition and Composition of Uncertain RESTful Resources.",
                    "Cross-Fertilizing Data through Web of Things APIs with JSON-LD.",
                    "Smart Web Services for Big Spatio-Temporal Data in Geographical Information Systems.",
                    "State-of-the-art Web Applications using Microservices and Linked Data.",
                    "Cognitive Process Designer - An Open-Source Tool to Capture Processes according to the Linked Data Principles.",
                    "Personal Web API Recommendation Using Network-based Inference.",
                    "grlc Makes GitHub Taste Like Linked Data APIs."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2016semwebeval",
                "sub_name": "Semantic Web Challenges - Third SemWebEval Challenge at ESWC 2016, Heraklion, Crete, Greece, May 29 - June 2, 2016, Revised Selected Papers.",
                "count": 24,
                "papers": [
                    "The Second Open Knowledge Extraction Challenge.",
                    "Enhancing Entity Linking by Combining NER Models.",
                    "Collective Disambiguation and Semantic Annotation for Entity Linking and Typing.",
                    "DWS at the 2016 Open Knowledge Extraction Challenge: A Hearst-Like Pattern-Based Approach to Hypernym Extraction and Class Induction.",
                    "Entity Typing and Linking Using SPARQL Patterns and DBpedia.",
                    "Challenge on Fine-Grained Sentiment Analysis Within ESWC2016.",
                    "App2Check Extension for Sentiment Analysis of Amazon Products Reviews.",
                    "Sentiment Polarity Detection from Amazon Reviews: An Experimental Study.",
                    "Exploiting Propositions for Opinion Mining.",
                    "The IRMUDOSA System at ESWC-2016 Challenge on Semantic Sentiment Analysis.",
                    "A Knowledge-Based Approach for Aspect-Based Opinion Mining.",
                    "Aspect-Based Sentiment Analysis Using a Two-Step Neural Network Architecture.",
                    "6th Open Challenge on Question Answering over Linked Data (QALD-6).",
                    "SPARKLIS on QALD-6 Statistical Questions.",
                    "Top-K Shortest Paths in Large Typed RDF Datasets Challenge.",
                    "Top-k Shortest Paths in Directed Labeled Multigraphs.",
                    "Modified MinG Algorithm to Find Top-K Shortest Paths from large RDF Graphs.",
                    "Using Triple Pattern Fragments to Enable Streaming of Top-k Shortest Paths via the Web.",
                    "Semantic Publishing Challenge - Assessing the Quality of Scientific Output in Its Ecosystem.",
                    "Reconstructing the Logical Structure of a Scientific Publication Using Machine Learning.",
                    "Automatically Identify and Label Sections in Scientific Journals Using Conditional Random Fields.",
                    "ACM: Article Content Miner for Assessing the Quality of Scientific Output.",
                    "Information Extraction from PDF Sources Based on Rule-Based System Using Integrated Formats.",
                    "An Automatic Workflow for the Formalization of Scholarly Articles' Structural and Semantic Elements."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ESWC 2015",
        "info": "Portorož, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2015",
                "sub_name": "The Semantic Web. Latest Advances and New Domains - 12th European Semantic Web Conference, ESWC 2015, Portoroz, Slovenia, May 31 - June 4, 2015. Proceedings.",
                "count": 54,
                "papers": [
                    "Requirements for and Evaluation of User Support for Large-Scale Ontology Alignment.",
                    "RODI: A Benchmark for Automatic Mapping Generation in Relational-to-Ontology Data Integration.",
                    "VocBench: A Web Application for Collaborative Development of Multilingual Thesauri.",
                    "Leveraging and Balancing Heterogeneous Sources of Evidence in Ontology Learning.",
                    "A Context-Based Semantics for SPARQL Property Paths Over the Web.",
                    "Distributed and Scalable OWL EL Reasoning.",
                    "Large Scale Rule-Based Reasoning Using a Laptop.",
                    "RDF Digest: Efficient Summarization of RDF/S KBs.",
                    "A Comparison of Data Structures to Manage URIs on the Web of Data.",
                    "Heuristics for Fixing Common Errors in Deployed schema.org Microdata.",
                    "Using @Twitter Conventions to Improve #LOD-Based Named Entity Disambiguation.",
                    "Knowledge Enabled Approach to Predict the Location of Twitter Users.",
                    "A Compact In-Memory Dictionary for RDF Data.",
                    "Quality Assessment of Linked Datasets Using Probabilistic Approximation.",
                    "Cooperative Techniques for SPARQL Query Relaxation in RDF Databases.",
                    "HDT-MR: A Scalable Solution for RDF Compression with HDT and MapReduce.",
                    "Processing Aggregate Queries in a Federation of SPARQL Endpoints.",
                    "A Survey of HTTP Caching Implementations on the Open Semantic Web.",
                    "Query Execution Optimization for Clients of Triple Pattern Fragments.",
                    "LIME: The Metadata Module for OntoLex.",
                    "Learning a Cross-Lingual Semantic Representation of Relations Expressed in Text.",
                    "HAWK - Hybrid Question Answering Using Linked Data.",
                    "Automating RDF Dataset Transformation and Enrichment.",
                    "Semi-supervised Instance Matching Using Boosted Classifiers.",
                    "Assigning Semantic Labels to Data Sources.",
                    "Inductive Classification Through Evidence-Based Models and Their Ensembles.",
                    "Standardized and Efficient RDF Encoding for Constrained Embedded Networks.",
                    "SPSC: Efficient Composition of Semantic Services in Unstructured P2P Networks.",
                    "Linked Data-as-a-Service: The Semantic Web Redeployed.",
                    "Gagg: A Graph Aggregation Operator.",
                    "FrameBase: Representing N-Ary Relations Using Semantic Frames.",
                    "Towards Hybrid NER: A Study of Content and Crowdsourcing-Related Performance Factors.",
                    "Ranking Entities in the Age of Two Webs, an Application to Semantic Snippets.",
                    "Troubleshooting and Optimizing Named Entity Resolution Systems in the Industry.",
                    "Using Ontologies for Modeling Virtual Reality Scenarios.",
                    "Supporting Open Collaboration in Science Through Explicit and Linked Semantic Description of Processes.",
                    "Crowdmapping Digital Social Innovation with Linked Data.",
                    "Desperately Searching for Travel Offers? Formulate Better Queries with Some Help from Linked Data.",
                    "Towards the Russian Linked Culture Cloud: Data Enrichment and Publishing.",
                    "From Symptoms to Diseases - Creating the Missing Link.",
                    "Using Semantic Web Technologies for Enterprise Architecture Analysis.",
                    "PADTUN - Using Semantic Technologies in Tunnel Diagnosis and Maintenance Domain.",
                    "Crowdsourcing Disagreement for Collecting Semantic Annotation.",
                    "Ontology Change in Ontology-Based Information Integration Systems.",
                    "Creating Learning Material from Web Resources.",
                    "The Design and Implementation of Semantic Web-Based Architecture for Augmented Reality Browser.",
                    "Information Extraction for Learning Expressive Ontologies.",
                    "A Scalable Adaptive Method for Complex Reasoning Over Semantic Data Streams.",
                    "Sequential Decision Making with Medical Interpretation Algorithms in the Semantic Web.",
                    "Towards Linked Open Data Enabled Data Mining - Strategies for Feature Generation, Propositionalization, Selection, and Consolidation.",
                    "Semantic Support for Recording Laboratory Experimental Metadata: A Study in Food Chemistry.",
                    "Exploiting Semantics from Ontologies to Enhance Accuracy of Similarity Measures.",
                    "e-Document Standards as Background Knowledge in Context-Based Ontology Matching.",
                    "Semantics-Enabled User Interest Mining."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015s",
                "sub_name": "The Semantic Web: ESWC 2015 Satellite Events - ESWC 2015 Satellite Events Portorož, Slovenia, May 31 - June 4, 2015, Revised Selected Papers.",
                "count": 56,
                "papers": [
                    "3XL News: A Cross-lingual News Aggregator and Reader.",
                    "Towards Scalable Visual Exploration of Very Large RDF Graphs.",
                    "SmartKeepers: A Decentralized, Secure, and Flexible Social Platform for Coworkers.",
                    "How to Stay Ontop of Your Data: Databases, Ontologies and More.",
                    "This 'Paper' is a Demo.",
                    "Improving Semantic Relatedness in Paths for Storytelling with Linked Data on the Web.",
                    "Dataset Summary Visualization with LODSight.",
                    "The ProtégéLOV Plugin: Ontology Access and Reuse for Everyone.",
                    "Controlling and Monitoring Crisis.",
                    "FAGI-gis: A Tool for Fusing Geospatial RDF Data.",
                    "A Semantic, Task-Centered Collaborative Framework for Science.",
                    "QueryVOWL: Visual Composition of SPARQL Queries.",
                    "Merging and Enriching DCAT Feeds to Improve Discoverability of Datasets.",
                    "Minimally Supervised Instance Matching: An Alternate Approach.",
                    "Discovering Types in RDF Datasets.",
                    "Supporting Real-Time Monitoring in Criminal Investigations.",
                    "FOODpedia: Russian Food Products as a Linked Data Dataset.",
                    "SentiML++: An Extension of the SentiML Sentiment Annotation Scheme.",
                    "Analysis of Companies' Non-financial Disclosures: Ontology Learning by Topic Modeling.",
                    "Curating a Document Collection via Crowdsourcing with Pundit 2.0.",
                    "SemNaaS: Add Semantic Dimension to the Network as a Service.",
                    "LIDSEARCH: A SPARQL-Driven Framework for Searching Linked Data and Semantic Web Services.",
                    "The Russian Museum Culture Cloud.",
                    "DataOps: Seamless End-to-End Anything-to-RDF Data Integration.",
                    "ABSTAT: Linked Data Summaries with ABstraction and STATistics.",
                    "DaCENA: Serendipitous News Reading with Data Contexts.",
                    "Visual Analysis of Statistical Data on Maps Using Linked Open Data.",
                    "Keyword Search on RDF Graphs: It Is More Than Just Searching for Keywords.",
                    "Collaborative Development of Multilingual Thesauri with VocBench (System Description and Demonstrator).",
                    "Distributed Linked Data Business Communication Networks: The LUCID Endpoint.",
                    "Evaluating Entity Annotators Using GERBIL.",
                    "Interactive Comparison of Triple Pattern Fragments Query Approaches.",
                    "Rubya: A Tool for Generating Rules for Incremental Maintenance of RDF Views.",
                    "Time-Aware Entity Search in DBpedia.",
                    "Templating the Semantic Web via RSLT.",
                    "Developing a Sustainable Platform for Entity Annotation Benchmarks.",
                    "A Diagnosis and Repair Framework for DL-LiteA KBs.",
                    "Sorted Neighborhood for Schema-Free RDF Data.",
                    "The Triplex Approach for Recognizing Semantic Relations from Noun Phrases, Appositions, and Adjectives.",
                    "What's up LOD Cloud? - Observing the State of Linked Open Data Cloud Metadata.",
                    "A Bottom-Up Approach for Licences Classification and Selection.",
                    "One Ontology to Bind Them All: The META-SHARE OWL Ontology for the Interoperability of Linguistic Datasets on the Web.",
                    "Applying the OntoLex Model to a Multilingual Terminological Resource.",
                    "What SPARQL Query Logs Tell and Do Not Tell About Semantic Relatedness in LOD - Or: The Unsuccessful Attempt to Improve the Browsing Experience of DBpedia by Exploiting Query Logs.",
                    "The \"Peer-to-Peer\" Economy and Social Ontology: Legal Issues and Theoretical Perspectives.",
                    "Roomba: An Extensible Framework to Validate and Build Dataset Profiles.",
                    "The Role of RDF Stream Processing in an Smart City ICT Infrastructure - The Aspern Smart City Use Case.",
                    "Towards a Unified Language for RDF Stream Query Processing.",
                    "Web API Management Meets the Internet of Things.",
                    "A RESTful Approach for Developing Medical Decision Support Systems.",
                    "QueryVOWL: A Visual Query Notation for Linked Data.",
                    "Studying the History of Pre-modern Zoology by Extracting Linked Zoological Data from Mediaeval Texts and Reasoning on It.",
                    "SemanticHPST: Applying Semantic Web Principles and Technologies to the History and Philosophy of Science and Technology.",
                    "dbpedia's Triple Pattern Fragments: Usage Patterns and Insights.",
                    "Applying Semantic Technology to Film Production.",
                    "Reactive Processing of RDF Streams of Events."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015salad",
                "sub_name": "Proceedings of the Third Workshop on Services and Applications over Linked APIs and Data co-located with the 12th Extended Semantic Web Conference (ESWC 2015), Portorož, Slovenia, June 1, 2015.",
                "count": 6,
                "papers": [
                    "Web API Management Meets the Internet of Things.",
                    "Building REST APIs for the Robot Operating System-Mapping Concepts, Interaction.",
                    "Linked Data Wrappers atop Yahoo's YQL.",
                    "A BASILar Approach for Building Web APIs on Top of SPARQL Endpoints.",
                    "Describing LDP Applications with the Hydra Core Vocabulary.",
                    "A RESTful Approach for Developing Medical Decision Support Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015dev",
                "sub_name": "Proceedings of the ESWC Developers Workshop 2015 co-located with the 12th Extended Semantic Web Conference (ESWC 2015), Portorož, Slovenia, May 31, 2015.",
                "count": 10,
                "papers": [
                    "HyLAR: Hybrid Location-Agnostic Reasoning.",
                    "RSLT: R. D. F. Stylesheet Language Transformations.",
                    "Linked Data in Action: Personalized Museum Tours on Mobile Devices.",
                    "WordLift: Meaningful Navigation Systems and Content Recommendation for News Sites running WordPress.",
                    "Developing a Sustainable Platform for Entity Annotation Benchmarks.",
                    "Programmatic Access to Crowdsourced Human Computation for Designing and Enhancing Interlinking.",
                    "Low-cost Open Data As-a-Service in the Cloud.",
                    "Frank: Algorithmic Access to the LOD Cloud.",
                    "Scalable and Reactive Programming for Semantic Web Developers.",
                    "Consuming RDF Data the OOP-way."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015sw4sh",
                "sub_name": "Proceedings of the First International Workshop Semantic Web for Scientific Heritage at the 12th ESWC 2015 Conference, Portorož, Slovenia, June 1st, 2015.",
                "count": 9,
                "papers": [
                    "Studying the History of Pre-Modern Zoology with Linked Data and Vocabularies.",
                    "Towards a Shared Reference Thesaurus for Studies on History of Zoology, Archaeozoology and Conservation Biology.",
                    "Towards a Better Understanding of Critiques about Ancient Texts using Argumentation.",
                    "What Terms to Express the Categories of Natural Sciences in the Dictionary of Medieval Scientific French?",
                    "Biblissima's Prototype on Medieval Manuscript Illuminations and their Context.",
                    "SemanticWeb for BIBLIMOS.",
                    "Semiotic Issues and Perspectives on Modeling Cultural Artifacts Revisiting 1970's French Criticisms on 'New archaeologies'.",
                    "SemanticHPST: Applying Semantic Web Principles and Technologies to the History and Philosophy of Science and Technology.",
                    "Semantic Web based Named Entity Linking for Digital Humanities and Heritage Texts."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015knowlod",
                "sub_name": "Proceedings of the 4th Workshop on Knowledge Discovery and Data Mining Meets Linked Open Data co-located with 12th Extended Semantic Web Conference (ESWC 2015), Portoroz, Slovenia, May 31, 2015.",
                "count": 13,
                "papers": [
                    "Sorted Neighborhood for Schema-free RDF Data.",
                    "Discovering and Querying Hybrid Linked Data.",
                    "Open City Data Pipeline - Collecting, Integrating, and Predicting Open City Data.",
                    "On Discovering Deterministic Relationships in Multi-Label Learning via Linked Open Data.",
                    "Finding, Assessing, and Integrating Statistical Sources for Data Mining.",
                    "The Triplex Approach for Recognizing Semantic Relations from Noun Phrases, Appositions, and Adjectives.",
                    "Towards a Semantic Clinical Data Warehouse: A Case Study of Discovering Similar Genes.",
                    "Entity Recommendations Using Hierarchical Knowledge Bases.",
                    "Computing Geo-Spatial Motives from Linked Data for Search-driven Applications.",
                    "The Linked Data Mining Challenge 2015.",
                    "A Linked Data-Based Decision Tree Classifier to Review Movies.",
                    "Predicting Metacritic Film Reviews Using Linked Open Data and Semantic Technologies.",
                    "Utilizing the Open Movie Database API for Predicting the Review Class of Movies."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015derive",
                "sub_name": "Proceedings of the 4th International Workshop on Detection, Representation, and Exploitation of Events in the Semantic Web (DeRiVE 2015) Co-located with the 12th Extended Semantic Web Conference (ESWC 2015), Protoroz, Slovenia, May 31, 2015.",
                "count": 6,
                "papers": [
                    "Reactive Processing of RDF Streams of Events.",
                    "COLINDA: Modeling, Representing and Using Scientific Events in the Web of Data.",
                    "Toward Real Event Detection.",
                    "Towards Open Domain Event Extraction from Twitter: REVEALing Entity Relations.",
                    "A Contextual Framework for Reasoning on Events.",
                    "Representing Specialized Events with FrameBase."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015profiles",
                "sub_name": "Joint Proceedings of the 5th International Workshop on Using the Web in the Age of Data (USEWOD '15) and the 2nd International Workshop on Dataset PROFIling and fEderated Search for Linked Data (PROFILES '15) co-located with the 12th European Semantic Web Conference (ESWC 2015), Portorož, Slovenia, May 31 - June 1, 2015.",
                "count": 8,
                "papers": [
                    "Initial Usage Analysis of DBpedia's Triple Pattern Fragments.",
                    "An Ecosystem of User-facing Microservices Supported by Semantic Models.",
                    "Roomba: An Extensible Framework to Validate and Build Dataset Profiles.",
                    "Constructing Subsumption Hierarchies of Web Queries.",
                    "HDL - Towards a Harmonized Dataset Model for Open Data Portals.",
                    "On Requirements for Federated Data Integration as a Compilation Process.",
                    "Towards Entity-Centric Preservation for Web Archive Enrichment.",
                    "What the Adoption of schema.org Tells About Linked Open Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015diachron",
                "sub_name": "Proceedings of the First DIACHRON Workshop on Managing the Evolution and Preservation of the Data Web co-located with 12th European Semantic Web Conference (ESWC 2015), Portorož, Slovenia, May 31, 2015.",
                "count": 6,
                "papers": [
                    "A Diagnosis and Repair Framework for DL-LiteA KBs.",
                    "An Archiving System for Managing Evolution in the Data Web.",
                    "Collecting and Analysing Personal Information Management Data.",
                    "Supporting Complex Changes in RDF(S) Knowledge Bases.",
                    "Towards Efficient Archiving of Dynamic Linked Open Data.",
                    "Towards capturing and preserving changes on the Web of Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015ldq",
                "sub_name": "Proceedings of the 2nd Workshop on Linked Data Quality co-located with 12th Extended Semantic Web Conference (ESWC 2015), Portorož, Slovenia, June 1, 2015.",
                "count": 7,
                "papers": [
                    "A Linkset Quality Metric Measuring Multilingual Gain in SKOS Thesauri.",
                    "Certifying the Interoperability of RDF Database Systems.",
                    "Ontology Consistency and Instance Checking for Real World Linked Data.",
                    "Towards Linked Data Fact Validation through Measuring Consensus.",
                    "On Redundancy in Linked Geospatial Data.",
                    "Scalable Semantic Version Control for Linked Data Management.",
                    "What's up LOD Cloud? Observing The State of Linked Open Data Cloud Metadata."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015noise",
                "sub_name": "Proceedings of the Workshop on Negative or Inconclusive Results in Semantic Web, NoISE 2015, Co-located with the 12th Extended Semantic Web Conference (ESWC 2015), Portoroz, Slovenia, June 1st, 2015.",
                "count": 8,
                "papers": [
                    "Negative Results in Computer Science Evaluations.",
                    "How Can Scientific Methods Provide Guidance for Semantic Web Research and Development?",
                    "What SPARQL Query Logs Tell and Do Not Tell about Semantic Relatedness in LOD Or: The Unsuccessful Attempt to Improve the Browsing Experience of DBpedia by Exploiting Query Logs.",
                    "Named-Entity-based Linking and Exploration of News Using an Adapted Jaccard Metric.",
                    "Towards Linked Data Update Notifications Reviewing and Generalizing the SparqlPuSH Approach.",
                    "The Role of Negative Results for Choosing an Evaluation Approach - A Recommender Systems Case Study.",
                    "Are We Really Standing on the Shoulders of Giants?",
                    "Breaking the Paper Barrier and Publishing At the Speed of Thought."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015msw",
                "sub_name": "Proceedings of the Fourth Workshop on the Multilingual Semantic Web (MSW4) co-located with 12th Extended Semantic Web Conference (ESWC 2015), Portorož, Slovenia, June 1, 2015.",
                "count": 6,
                "papers": [
                    "A Language-Aware Web will Give us a Bigger and Better Semantic Web.",
                    "Roadmap for a Multilingual BioPortal.",
                    "Applying the OntoLex Model to a Multilingual Terminological Resource.",
                    "One Ontology to Bind Them All: The META-SHARE OWL Ontology for the Interoperability of Linguistic Datasets on the Web.",
                    "Towards Multilingual eLexicography by Means of Linked (Open) Data.",
                    "Introducing FREME: Deploying Linguistic Linked Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015sumpre-hswi",
                "sub_name": "Joint Proceedings of the 1st International Workshop on Summarizing and Presenting Entities and Ontologies and the 3rd International Workshop on Human Semantic Web Interfaces (SumPre 2015, HSWI 2015) co-located with the 12th Extended Semantic Web Conference (ESWC 2015), Portoroz, Slovenia, June 1, 2015.",
                "count": 6,
                "papers": [
                    "OOSP: Ontological Benchmarks Made on the Fly.",
                    "Sematch: Semantic Entity Search from Knowledge Graph.",
                    "RDF Knowledge Graph Visualization From a Knowledge Extraction System.",
                    "FRanCo - A Ground Truth Corpus for Fact Ranking Evaluation.",
                    "Did you mean A or B? Supporting Clarification Dialog for Entity Disambiguation.",
                    "Visual Querying of Linked Data with QueryVOWL."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2015semwebeval",
                "sub_name": "Semantic Web Evaluation Challenges - Second SemWebEval Challenge at ESWC 2015, Portorož, Slovenia, May 31 - June 4, 2015, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Open Knowledge Extraction Challenge.",
                    "CETUS - A Baseline Approach to Type Extraction.",
                    "A Hybrid Approach for Entity Recognition and Linking.",
                    "Using FRED for Named Entity Resolution, Linking and Typing for Knowledge Base Population.",
                    "Exploiting Linked Open Data to Uncover Entity Types.",
                    "Semantic Publishing Challenge - Assessing the Quality of Scientific Output by Information Extraction and Interlinking.",
                    "Information Extraction from Web Sources Based on Multi-aspect Content Analysis.",
                    "Extracting Contextual Information from Scientific Literature Using CERMINE System.",
                    "Machine Learning Techniques for Automatically Extracting Contextual Information from Scientific Publications.",
                    "MACJa: Metadata and Citations Jailbreaker.",
                    "Automatic Construction of a Semantic Knowledge Base from CEUR Workshop Proceedings.",
                    "CEUR-WS-LOD: - Conversion of CEUR-WS Workshops to Linked Data.",
                    "Metadata Extraction from Conference Proceedings Using Template-Based Approach.",
                    "Semantically Annotating CEUR-WS Workshop Proceedings with RML.",
                    "On the Automated Generation of Scholarly Publishing Linked Datasets: The Case of CEUR-WS Proceedings.",
                    "The Schema-Agnostic Queries (SAQ-2015) Semantic Web Challenge: Task Description.",
                    "UMBC_Ebiquity-SFQ: Schema Free Querying System.",
                    "ESWC 15 Challenge on Concept-Level Sentiment Analysis.",
                    "The Benefit of Concept-Based Features for Sentiment Analysis.",
                    "An Information Retrieval-Based System for Multi-domain Sentiment Analysis.",
                    "Detecting Sentiment Polarities with Sentilo.",
                    "Supervised Opinion Frames Detection with RAID."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ESWC 2014",
        "info": "Anissaras, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2014",
                "sub_name": "The Semantic Web: Trends and Challenges - 11th International Conference, ESWC 2014, Anissaras, Crete, Greece, May 25-29, 2014. Proceedings.",
                "count": 63,
                "papers": [
                    "Programming the Semantic Web.",
                    "The CLOCK Data-Aware Eviction Approach: Towards Processing Linked Data Streams with Limited Resources.",
                    "Plan-Based Semantic Enrichment of Event Streams.",
                    "Error-Tolerant RDF Subgraph Matching for Adaptive Presentation of Linked Data on Mobile.",
                    "RDSZ: An Approach for Lossless RDF Stream Compression.",
                    "Linked USDL: A Vocabulary for Web-Scale Service Trading.",
                    "SentiCircles for Contextual and Conceptual Semantic Sentiment Analysis of Twitter.",
                    "User Interests Identification on Twitter Using a Hierarchical Knowledge Base.",
                    "Identifying Diachronic Topic-Based Research Communities by Clustering Shared Research Trajectories.",
                    "Pay-as-you-go Approximate Join Top-k Processing for the Web of Data.",
                    "A Framework for Iterative Signing of Graph Data on the Web.",
                    "Perplexity of Index Models over Evolving Linked Data.",
                    "HiBISCuS: Hypergraph-Based Source Selection for SPARQL Endpoint Federation.",
                    "Generating Synthetic RDF Data with Connected Blank Nodes for Benchmarking.",
                    "Distributed Keyword Search over RDF via MapReduce.",
                    "NLP Data Cleansing Based on Linguistic Ontology Constraints.",
                    "Using Semantic and Domain-Based Information in CLIR Systems.",
                    "These Are Your Rights - A Natural Language Processing Approach to Automated RDF Licenses Generation.",
                    "Scaling Parallel Rule-Based Reasoning.",
                    "A Probabilistic Approach for Integrating Heterogeneous Knowledge Sources.",
                    "WaterFowl: A Compact, Self-indexed and Inference-Enabled Immutable RDF Store.",
                    "Ontology-Based Data Access Using Rewriting, OWL 2 RL Systems and Repairing.",
                    "Dedalo: Looking for Clusters Explanations in a Labyrinth of Linked Data.",
                    "A Knowledge Based Approach for Tackling Mislabeled Multi-class Big Social Data.",
                    "Providing Alternative Declarative Descriptions for Entity Sets Using Parallel Concept Lattices.",
                    "Unsupervised Link Discovery through Knowledge Base Repair.",
                    "Trusty URIs: Verifiable, Immutable, and Permanent Digital Artifacts for Linked Data.",
                    "Erratum: Trusty URIs: Verifiable, Immutable, and Permanent Digital Artifacts for Linked Data.",
                    "Leveraging Distributed Human Computation and Consensus Partition for Entity Coreference.",
                    "SPARQL Query Verbalization for Explaining Semantic Search Engine Queries.",
                    "Optimising Linked Data Queries in the Presence of Co-reference.",
                    "Survey on Common Strategies of Vocabulary Reuse in Linked Open Data Modeling.",
                    "Generating and Summarizing Explanations for Linked Data.",
                    "Hybrid Acquisition of Temporal Scopes for RDF Data.",
                    "Detecting Incorrect Numerical Data in DBpedia.",
                    "A Scalable Approach for Efficiently Generating Structured Dataset Topic Profiles.",
                    "Facilitating Human Intervention in Coreference Resolution with Comparative Entity Summaries.",
                    "The Usability of Description Logics - Understanding the Cognitive Difficulties Presented by Description Logics.",
                    "NL-Graphs: A Hybrid Approach toward Interactively Querying Semantic Data.",
                    "Evaluating Citation Functions in CiTO: Cognitive Issues.",
                    "Accepting the XBRL Challenge with Linked Data for Financial Data Integration.",
                    "Predicting Severity of Road Traffic Congestion Using Semantic Web Technologies.",
                    "conTEXT - Lightweight Text Analytics Using Linked Data.",
                    "PCS2OWL: A Generic Approach for Deriving Web Ontologies from Product Classification Systems.",
                    "Seeding Structured Data by Default via Open Source Library Systems.",
                    "How to Best Find a Partner? An Evaluation of Editing Approaches to Construct R2RML Mappings.",
                    "Towards Portable Shopping Histories: Using GoodRelations to Expose Ownership Information to E-Commerce Sites.",
                    "\"Semantics Inside!\" But Let's Not Tell the Data Miners: Intelligent Support for Data Mining.",
                    "MatWare : Constructing and Exploiting Domain Specific Warehouses by Aggregating Semantic Data.",
                    "Object Property Matching Utilizing the Overlap between Imported Ontologies.",
                    "Towards Competency Question-Driven Ontology Authoring.",
                    "Identifying Change Patterns of Concept Attributes in Ontology Evolution.",
                    "On the Discovery of Relational Patterns in Semantically Similar Annotated Linked Data.",
                    "Predicting SPARQL Query Performance and Explaining Linked Data.",
                    "Metrics-Driven Framework for LOD Quality Assessment.",
                    "Harvesting and Structuring Social Data in Music Information Retrieval.",
                    "Route Planning Using Linked Open Data.",
                    "Automatic Detection and Semantic Formalisation of Business Rules.",
                    "Combining Linked Data and Statistical Information Retrieval - Next Generation Information Systems.",
                    "Searching Linked Data and Services with a Single Query.",
                    "Semantic Information Extraction on Domain Specific Data Sheets.",
                    "Towards a Data Warehouse Fed with Web Services.",
                    "Designing an Integrated Semantic Framework for Structured Opinion Summarization."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014s",
                "sub_name": "The Semantic Web: ESWC 2014 Satellite Events - ESWC 2014 Satellite Events, Anissaras, Crete, Greece, May 25-29, 2014, Revised Selected Papers.",
                "count": 77,
                "papers": [
                    "Ontology Design Patterns: Improving Findability and Composition.",
                    "Lessons Learned - The Case of CROCUS: Cluster-Based Ontology Data Cleansing.",
                    "Entity-Based Data Source Contextualization for Searching the Web of Data.",
                    "Setting the Course of Emergency Vehicle Routing Using Geolinked Open Data for the Municipality of Catania.",
                    "Adapting Sentiment Lexicons Using Contextual Semantics for Sentiment Analysis of Twitter.",
                    "RESTful or RESTless - Current State of Today's Top Web APIs.",
                    "Ornithology Based on Linking Bird Observations with Weather Data.",
                    "Protégé4US: Harvesting Ontology Authoring Data with Protégé.",
                    "Survey of Semantic Media Annotation Tools for the Web: Towards New Media Applications with Linked Media.",
                    "First Experiments in Cultural Alignment Repair (Extended Version).",
                    "Amending RDF Entities with New Facts.",
                    "Predicting the Impact of Central Bank Communications on Financial Market Investors' Interest Rate Expectations.",
                    "Enriching Live Event Participation with Social Network Content Analysis and Visualization.",
                    "Linked Widgets Platform: Lowering the Barrier for Open Data Exploration.",
                    "Annotating Ontologies with Descriptions of Vagueness.",
                    "What Are the Important Properties of an Entity? - Comparing Users and Knowledge Graph Point of View.",
                    "RuQAR: Reasoning Framework for OWL 2 RL Ontologies.",
                    "An Investigation of HTTP Header Information for Detecting Changes of Linked Open Data Sources.",
                    "A Semantic Approach to Support Cross Border e-Justice.",
                    "Rapid Deployment of a RESTful Service for Data Collected by Oceanographic Research Cruises.",
                    "TMR: A Semantic Recommender System Using Topic Maps on the Items' Descriptions.",
                    "The Normalized Freebase Distance.",
                    "Predicting SPARQL Query Performance.",
                    "Linked Data Finland: A 7-star Model and Platform for Publishing and Re-using Linked Datasets.",
                    "Data Cleansing Consolidation with PatchR.",
                    "SPARQL-MM - Extending SPARQL to Media Fragments.",
                    "A Companion Screen Application for TV Broadcasts Annotated with Linked Open Data.",
                    "A Semantic Web Based Core Engine to Efficiently Perform Sentiment Analysis.",
                    "Balloon Synopsis: A Modern Node-Centric RDF Viewer and Browser for the Web.",
                    "Ranking Entities in a Large Semantic Network.",
                    "Improving the Online Visibility of Touristic Service Providers by Using Semantic Annotations.",
                    "LiFR: A Lightweight Fuzzy DL Reasoner.",
                    "LUMO: The LinkedTV User Model Ontology.",
                    "Making Use of Linked Data for Generating Enhanced Snippets.",
                    "Durchblick - A Conference Assistance System for Augmented Reality Devices.",
                    "Publication of RDF Streams with Ztreamy.",
                    "rdf: SynopsViz - A Framework for Hierarchical Linked Data Visual Exploration and Analysis.",
                    "Boosting QAKiS with Multimedia Answer Visualization.",
                    "Painless URI Dereferencing Using the DataTank.",
                    "CORNER: A Completeness Reasoner for SPARQL Queries Over RDF Data Sources.",
                    "AnnoMarket - Multilingual Text Analytics at Scale on the Cloud.",
                    "Modelling OWL Ontologies with Graffoo.",
                    "Graphium Chrysalis: Exploiting Graph Database Engines to Analyze RDF Graphs.",
                    "SemLAV: Querying Deep Web and Linked Open Data with SPARQL.",
                    "Towards a Semantic Web Platform for Finite Element Simulations.",
                    "A Demonstration of a Natural Language Query Interface to an Event-Based Semantic Web Triplestore.",
                    "Kuphi - an Investigation Tool for Searching for and via Semantic Relations.",
                    "FAGI-tr: A Tool for Aligning Geospatial RDF Vocabularies.",
                    "SparqlFilterFlow: SPARQL Query Composition for Everyone.",
                    "Visualizing RDF Data Cubes Using the Linked Data Visualization Model.",
                    "Prod-Trees: Semantic Search for Earth Observation Products.",
                    "UnifiedViews: An ETL Framework for Sustainable RDF Data Processing.",
                    "SmarT INsiGhts (STING) - An Intelligence Application for Querying Heterogeneous Databases.",
                    "OLAP4LD - A Framework for Building Analysis Applications Over Governmental Statistics.",
                    "The ProtégéVOWL Plugin: Ontology Visualization for Everyone.",
                    "A Rule-Based System for Monitoring of Microblogging Disease Reports.",
                    "LinkZoo: A Linked Data Platform for Collaborative Management of Heterogeneous Resources.",
                    "TRTML - A Tripleset Recommendation Tool Based on Supervised Learning Algorithms.",
                    "morph-LDP: An R2RML-Based Linked Data Platform Implementation.",
                    "Combining a REST Lexical Analysis Web Service with SPARQL for Mashup Semantic Annotation from Text.",
                    "Aether - Generating and Viewing Extended VoID Statistical Descriptions of RDF Datasets.",
                    "SPARQL SAHA, a Configurable Linked Data Editor and Browser as a Service.",
                    "LinkLion: A Link Repository for the Web of Data.",
                    "Big, Linked and Open Data: Applications in the German Aerospace Center.",
                    "VideoLecturesMashup: Using Media Fragments and Semantic Annotations to Enable Topic-Centred e-Learning.",
                    "Securing Access to Sensitive RDF Data.",
                    "SCS Connector - Quantifying and Visualising Semantic Paths Between Entity Pairs.",
                    "Distant Supervision for Relation Extraction Using Ontology Class Hierarchy-Based Features.",
                    "Augmenting TV Newscasts via Entity Expansion.",
                    "Geographic Summaries from Crowdsourced Data.",
                    "Dendro: Collaborative Research Data Management Built on Linked Open Data.",
                    "Analyzing Linked Data Quality with LiQuate.",
                    "Collaborative Semantic Management and Automated Analysis of Scientific Literature.",
                    "di.me: Ontologies for a Pervasive Information System.",
                    "IDE Integrated RDF Exploration, Access and RDF-Based Code Typing with LITEQ.",
                    "Browsing DBpedia Entities with Summaries.",
                    "Using Semantic Technologies for Scalable Multi-channel Communication."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014knowlod",
                "sub_name": "Proceedings of the 3rd Workshop on Knowledge Discovery and Data Mining Meets Linked Open Data co-located with 11th Extended Semantic Web Conference (ESWC 2014), Crete, Greece, May 25, 2014.",
                "count": 7,
                "papers": [
                    "Simplifying RDF Data for Graph-Based Machine Learning.",
                    "Parallel Search Through Statistical Semantic Spaces Leveraging Linked Open Data.",
                    "Amending RDF Entities with New Facts.",
                    "Interlinking English and Chinese RDF Data Sets Using Machine Translation.",
                    "Link Prediction in Very Large Directed Graphs: Exploiting Hierarchical Properties in Parallel.",
                    "The Linked Data Mining Challenge 2014: Results and Experiences.",
                    "Development of Prediction Model for Linked Data based on the Decision Tree."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014wodoom",
                "sub_name": "Proceedings of the Third International Workshop on Debugging Ontologies and Ontology Mappings, WoDOOM 2014, co-located with 11th Extended Semantic Web Conference (ESWC 2014), Anissaras/Hersonissou, Greece, May 26, 2014.",
                "count": 7,
                "papers": [
                    "Foundations for Revising Networks of Ontologies.",
                    "First Experiments in Cultural Alignment Repair.",
                    "Repairing Learned Ontologies.",
                    "Identifying Wrong Links between Datasets by Multi-dimensional Outlier Detection.",
                    "Interactive Ontology Debugging using Direct Diagnosis.",
                    "A System for Debugging Missing Is-a Structure in EL Ontologies.",
                    "B-Annot: Supplying Background Model Annotations for Ontology Coherence Testing."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014sepublica",
                "sub_name": "Proceedings of the 4th Workshop on Semantic Publishing co-located with the 11th Extended Semantic Web Conference (ESWC 2014), Anissaras, Greece, May 25th, 2014.",
                "count": 7,
                "papers": [
                    "What's in the proceedings? Combining publisher's and researcher's perspectives.",
                    "Ornithology Based on Linking Bird Observations with Weather Data.",
                    "Supporting Researchers with a Semantic Literature Management Wiki.",
                    "SMART Research using Linked Data - Sharing Research Data for Integrated Water Resources Management in the Lower Jordan Valley.",
                    "Describing bibliographic references in RDF.",
                    "Supporting Information Sharing for Re-Use and Analysis of Scientific Research Publication Data.",
                    "A review of ontologies for describing scholarly and scientific documents."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014salad",
                "sub_name": "Proceedings of the Second Workshop on Services and Applications over Linked APIs and Data co-located with the 10th Extended Semantic Web Conference (ESWC 2014), Crete, Greece, May 26, 2014.",
                "count": 7,
                "papers": [
                    "Publishing Data for Maximized Reuse.",
                    "Towards Semantic Resource Mashups.",
                    "Ricochet: Context and Complementarity-Aware, Ontology-based POIs Recommender System.",
                    "Understanding Personal Data as a Space - Learning from Dataspaces to Create Linked Personal Data.",
                    "Semantic RESTful APIs for Dynamic Data Sources.",
                    "A Data API With Security and Graph-Level Access Control.",
                    "RESTful or RESTless - Current State of Today's Top Web APIs."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014wasabi",
                "sub_name": "Joint Proceedings of the Second International Workshop on Semantic Web Enterprise Adoption and Best Practice and Second International Workshop on Finance and Economics on the Semantic Web Co-located with 11th European Semantic Web Conference, WaSABi-FEOSW@ESWC 2014, Anissaras, Greece, May 26, 2014.",
                "count": 10,
                "papers": [
                    "Crossing the Chasm with Semantic Technologies.",
                    "CROCUS: Cluster-based Ontology Data Cleansing.",
                    "IRIS: A Protégé Plug-in to Extract and Serialize Product Attribute Name-Value Pairs.",
                    "Ontology Design Patterns: Adoption Challenges and Solutions.",
                    "Mapping Representation based on Meta-data and SPIN for Localization Workflows.",
                    "WaSABi 2014: Breakout Brainstorming Session Summary.",
                    "A Linked Data Approach to Sentiment and Emotion Analysis of Twitter in the Financial Domain.",
                    "Analyzing Stock Market Fraud Cases Using a Linguistics-Based Text Mining Approach.",
                    "Predicting the impact of central bank communications on financial market investors' interest rate expectations.",
                    "Predicting stocks returns correlations based on unstructured data sources."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014aimashup",
                "sub_name": "Proceedings of the AI Mashup Challenge 2014 co-located with 11th Extended Semantic Web Conference (ESWC 2014), Crete, Greece, May 27, 2014.",
                "count": 6,
                "papers": [
                    "Questioning Mashups.",
                    "An Approach for Incremental Entity Resolution at the Example of Social Media Data.",
                    "Open Linked Widgets Mashup Platform.",
                    "SEMashup: Making Use of Linked Data for Generating Enhanced Snippets.",
                    "Augmented Participation to Live Events through Social Network Content Enrichment.",
                    "conTEXT - A Mashup Platform for Lightweight Text Analytics."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014semwebeval",
                "sub_name": "Semantic Web Evaluation Challenge - SemWebEval 2014 at ESWC 2014, Anissaras, Crete, Greece, May 25-29, 2014, Revised Selected Papers.",
                "count": 27,
                "papers": [
                    "ESWC'14 Challenge on Concept-Level Sentiment Analysis.",
                    "A Fuzzy System for Concept-Level Sentiment Analysis.",
                    "Unsupervised Fine-Grained Sentiment Analysis System Using Lexicons and Concepts.",
                    "Semantic Lexicon Expansion for Concept-Based Aspect-Aware Sentiment Analysis.",
                    "Dependency Tree-Based Rules for Concept-Level Aspect-Based Sentiment Analysis.",
                    "Sinica Semantic Parser for ESWC'14 Concept-Level Semantic Analysis Challenge.",
                    "Polarity Detection of Online Reviews Using Sentiment Concepts: NCU IISR Team at ESWC-14 Challenge on Concept-Level Sentiment Analysis.",
                    "Semantic Publishing Challenge - Assessing the Quality of Scientific Output.",
                    "ROHub - A Digital Library of Research Objects Supporting Scientists Towards Reproducible Science.",
                    "Semantify CEUR-WS Proceedings: Towards the Automatic Generation of Highly Descriptive Scholarly Publishing Linked Datasets.",
                    "A Template-Based Information Extraction from Web Sites with Unstable Markup.",
                    "Linkitup: Semantic Publishing of Research Data.",
                    "Understanding Research Dynamics.",
                    "Semantic Facets for Scientific Information Retrieval.",
                    "Extraction and Semantic Annotation of Workshop Proceedings in HTML Using RML.",
                    "Extraction and Characterization of Citations in Scientific Papers.",
                    "Linked Open Data-Enabled Recommender Systems: ESWC 2014 Challenge on Book Recommendation.",
                    "Hybrid Recommending Exploiting Multiple DBPedia Language Editions.",
                    "A Hybrid Multi-strategy Recommender System Using Linked Open Data.",
                    "Exploring Semantic Features for Producing Top-N Recommendation Lists from Binary User Feedback.",
                    "Content-Based Recommender Systems + DBpedia Knowledge = Semantics-Aware Recommender Systems.",
                    "SemStim at the LOD-RecSys 2014 Challenge.",
                    "Popular Books and Linked Data: Some Results for the ESWC'14 RecSys Challenge.",
                    "A Semantic Pattern-Based Recommender.",
                    "Increasing Top-20 Diversity Through Recommendation Post-processing.",
                    "Hybrid Model Rating Prediction with Linked Open Data for Recommender Systems.",
                    "Deep Learning of Semantic Word Representations to Implement a Content-Based Recommender for the RecSys Challenge'14."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014profiles",
                "sub_name": "Proceedings of the 1st International Workshop on Dataset PROFIling & fEderated Search for Linked Data co-located with the 11th Extended Semantic Web Conference, PROFILES@ESWC 2014, Anissaras, Crete, Greece, May 26, 2014.",
                "count": 8,
                "papers": [
                    "Entity-based Data Source Contextualization for Searching the Web of Data.",
                    "Towards Analytics and Collaborative Exploration of Social and linked Media for Technology-Enchanced Learning Scenarios.",
                    "From Changes to Dynamics: Dynamics Analysis of Linked Open Data Sources.",
                    "Towards Semantic Dataset Profiling.",
                    "Towards a Framework for Managing Evolving Information Resources on the Data Web.",
                    "Of Sampling and Smoothing: Approximating Distributions over Linked Open Data.",
                    "LODOP - Multi-Query Optimization for Linked Data Profiling Queries.",
                    "Extending VoID for Expressing Connectivity Metrics of a Semantic Warehouse."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2014ssa-smile",
                "sub_name": "Joint Proceedings of the 1th Workshop on Semantic Sentiment Analysis (SSA2014), and the Workshop on Social Media and Linked Data for Emergency Response (SMILE 2014) co-located with 11th European Semantic Web Conference (ESWC 2014), Crete, Greece, May 25th, 2014.",
                "count": 8,
                "papers": [
                    "Adapting Sentiment Lexicons using Contextual Semantics for Twitter Sentiment Analysis.",
                    "Usage of Abstract Features in Semantic Sentiment Analysis.",
                    "Sentiment Analysis for Dynamic User Preference Inference in Spoken Dialogue Systems.",
                    "Semantic Web-based Sentiment Analysis.",
                    "Towards emergency vehicle routing using Geolinked Open Data: the case study of the Municipality of Catania.",
                    "Visualisation of User-Generated Event Information: Towards Geospatial Situation Awareness Using Hierarchical Granularity Levels.",
                    "An Ontology-Based Approach to Social Media Mining for Crisis Management.",
                    "Visual Analysis of Real-time Social Media for Emergency Response."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ESWC 2013",
        "info": "Montpellier, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2013",
                "sub_name": "The Semantic Web: Semantics and Big Data, 10th International Conference, ESWC 2013, Montpellier, France, May 26-30, 2013. Proceedings.",
                "count": 59,
                "papers": [
                    "A Unified Approach for Aligning Taxonomies and Debugging Taxonomies and Their Alignments.",
                    "Opening the Black Box of Ontology Matching.",
                    "Towards Evaluating Interactive Ontology Matching Tools.",
                    "A Session-Based Approach for Aligning Large Ontologies.",
                    "Organizing Ontology Design Patterns as Ontology Pattern Languages.",
                    "An Ontology Design Pattern for Cartographic Map Scaling.",
                    "Locking for Concurrent Transactions on Ontologies.",
                    "Predicting the Understandability of OWL Inferences.",
                    "Detecting SPARQL Query Templates for Data Prefetching.",
                    "Synonym Analysis for Predicate Expansion.",
                    "Instance-Based Ontological Knowledge Acquisition.",
                    "Logical Linked Data Compression.",
                    "Access Control for HTTP Operations on Linked Data.",
                    "Bio2RDF Release 2: Improved Coverage, Interoperability and Provenance of Life Science Linked Data.",
                    "Observing Linked Data Dynamics.",
                    "A Systematic Investigation of Explicit and Implicit Schema Information on the Linked Open Data Cloud.",
                    "Lightweight Spatial Conjunctive Query Answering Using Keywords.",
                    "Representation and Querying of Valid Time of Triples in Linked Geospatial Data.",
                    "When to Reach for the Cloud: Using Parallel Hardware for Link Discovery.",
                    "No Size Fits All - Running the Star Schema Benchmark with SPARQL and RDF Aggregate Views.",
                    "Seven Commandments for Benchmarking Semantic Flow Processing Systems.",
                    "Graph-Based Ontology Classification in OWL 2 QL.",
                    "RDFS with Attribute Equations via SPARQL Rewriting.",
                    "A Comparison of Knowledge Extraction Tools for the Semantic Web.",
                    "Constructing a Focused Taxonomy from a Document Collection.",
                    "Semantic Multimedia Information Retrieval Based on Contextual Descriptions.",
                    "Automatic Expansion of DBpedia Exploiting Wikipedia Cross-Language Information.",
                    "A Support Framework for Argumentative Discussions Management in the Web.",
                    "A Multilingual Semantic Wiki Based on Attempto Controlled English and Grammatical Framework.",
                    "COALA - Correlation-Aware Active Learning of Link Specifications.",
                    "Transductive Inference for Class-Membership Propagation in Web Ontologies.",
                    "Measuring the Topical Specificity of Online Communities.",
                    "Broadening the Scope of Nanopublications.",
                    "The Wisdom of the Audience: An Empirical Study of Social Semantics in Twitter Streams.",
                    "Collecting Links between Entities Ranked by Human Association Strengths.",
                    "Personalized Concept-Based Search and Exploration on the Web of Data Using Results Categorization.",
                    "Combining a Co-occurrence-Based and a Semantic Measure for Entity Linking.",
                    "Publishing Bibliographic Records on the Web of Data: Opportunities for the BnF (French National Library).",
                    "Hafslund Sesam - An Archive on Semantics.",
                    "Connecting the Smithsonian American Art Museum to the Linked Data Cloud.",
                    "Guiding the Evolution of a Multilingual Ontology in a Concrete Setting.",
                    "Using BMEcat Catalogs as a Lever for Product Master Data on the Semantic Web.",
                    "Ontology-Supported Document Ranking for Novelty Search.",
                    "Semantic Web for the Humanities.",
                    "Maintaining Mappings Valid between Dynamic KOS.",
                    "Automatic Argumentation Extraction.",
                    "Guided Composition of Tasks with Logical Information Systems - Application to Data Analysis Workflows in Bioinformatics.",
                    "Storing and Provisioning Linked Data as a Service.",
                    "Interlinking Cross-Lingual RDF Data Sets.",
                    "Trusting Semi-structured Web Data.",
                    "Augmented Reality Supported by Semantic Web Technologies.",
                    "Search Result Ontologies for Digital Libraries.",
                    "Semantically Assisted Workflow Patterns for the Social Web.",
                    "An Architecture to Aggregate Heterogeneous and Semantic Sensed Data.",
                    "Linked Data Interfaces for Non-expert Users.",
                    "Event Matching Using Semantic and Spatial Memories.",
                    "Incremental SPARQL Query Processing.",
                    "Knowledge Point-Based Approach to Interlink Open Education Resources.",
                    "A Linked Data Reasoner in the Cloud."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2013s",
                "sub_name": "The Semantic Web: ESWC 2013 Satellite Events - ESWC 2013 Satellite Events, Montpellier, France, May 26-30, 2013, Revised Selected Papers.",
                "count": 60,
                "papers": [
                    "A Summary of the Workshop and Tutorial Program at ESWC 2013.",
                    "ParlBench: A SPARQL Benchmark for Electronic Publishing Applications.",
                    "I See a Car Crash: Real-Time Detection of Small Scale Incidents in Microblogs.",
                    "Ontology Adaptation upon Updates.",
                    "Caching and Prefetching Strategies for SPARQL Queries.",
                    "Characterising Citations in Scholarly Documents: The CiTalO Framework.",
                    "YASGUI: Not Just Another SPARQL Client.",
                    "A Case-Study of Ontology-Driven Semantic Mediation of Flower-Visiting Data from Heterogeneous Data-Stores in Three South African Natural History Collections.",
                    "Mapping Keywords to Linked Data Resources for Automatic Query Expansion.",
                    "Finding Fault: Detecting Issues in a Versioned Ontology.",
                    "Optique: Towards OBDA Systems for Industry.",
                    "Summary of the Demonstration and Poster Track.",
                    "LODatio: A Schema-Based Retrieval System for Linked Open Data at Web-Scale.",
                    "Payola: Collaborative Linked Data Analysis and Visualization Framework.",
                    "A System for Aligning Taxonomies and Debugging Taxonomies and Their Alignments.",
                    "ALASKA for Ontology Based Data Access.",
                    "Multilingual MoKi: How to Manage Multilingual Ontologies in a Wiki.",
                    "SAIM - One Step Closer to Zero-Configuration Link Discovery.",
                    "Linked Data Query Wizard: A Tabular Interface for the Semantic Web.",
                    "Facilitating Music Information Research with Shared Open Vocabularies.",
                    "Exploratory Search on the Top of DBpedia Chapters with the Discovery Hub Application.",
                    "Applying SPARQL-DQP for Federated SPARQL Querying over Google Fusion Tables.",
                    "Querying Multilingual DBpedia with QAKiS.",
                    "LDtogo: A Data Querying and Mapping Frameworkfor Linked Data Applications.",
                    "Exploring the Linked University Data with Visualization Tools.",
                    "Sextant: Browsing and Mapping the Ocean of Linked Geospatial Data.",
                    "A Distributional Semantic Search Infrastructure for Linked Dataspaces.",
                    "XSPARQL-Viz: A Mashup-Based Visual Query Editor for XSPARQL.",
                    "LinDA: A Service Infrastructure for Linked Data Analysis and Provision of Data Statistics.",
                    "Identifying Functions of Citations with CiTalO.",
                    "Graphia: Extracting Contextual Relation Graphs from Text.",
                    "Cross-Lingual Querying and Comparison of Linked Financial and Business Data.",
                    "R2RML by Assertion: A Semi-automatic Tool for Generating Customised R2RML Mappings.",
                    "Tìpalo: A Tool for Automatic Typing of DBpedia Entities.",
                    "Tracking and Analyzing The 2013 Italian Election.",
                    "FRED: From Natural Language Text to RDF and OWL in One Click.",
                    "Trusted Facts: Triplifying Primary Research Data Enriched with Provenance Information.",
                    "Semantic Hyperlocal Search for Parlance Mobile Spoken Dialogue System.",
                    "Representation of Complex Expressions in RDF.",
                    "Representing and Querying Negative Knowledge in RDF.",
                    "The Semantic Evolution of General and Specific Communities.",
                    "Experiments Varying Semantic Similarity Measures and Reference Ontologies for Ontology Alignment.",
                    "Market-Based SPARQL Brokerage: Towards Economic Incentives for Linked Data Growth.",
                    "A Shared Vocabulary for Audio Features.",
                    "Exploratory Search on the Top of DBpedia Chapters with the Discovery Hub Application.",
                    "The Finnish Law as a Linked Data Service.",
                    "A Distributed Entity Directory.",
                    "Optique: OBDA Solution for Big Data.",
                    "Linked Open Ontology Cloud KOKO - Managing a System of Cross-Domain Lightweight Ontologies.",
                    "A Semantic-Enabled Engine for Mobile Social Networks.",
                    "The Birds of the World Ontology AVIO.",
                    "Exploring the Dynamics of Linked Data.",
                    "Mad Swan: A Semantic Web Service Composition System.",
                    "Longitudinal Queries over Linked Census Data.",
                    "Deciphering Location Context - A Semantic Web Approach.",
                    "Comparative Classifier Evaluation for Web-Scale Taxonomies Using Power Law.",
                    "NERITS - A Machine Translation Mashup System Using Wikimeta and DBpedia.",
                    "SNARC - An Approach for Aggregating and Recommending Contextualized Social Content.",
                    "Twindex Fuorisalone: Social Listening of Milano during Fuorisalone 2013.",
                    "DataConf: A Full Client-Side Web Mashup for Scientific Conferences."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2013knowlod",
                "sub_name": "Proceedings of the Second International Workshop on Knowledge Discovery and Data Mining Meets Linked Open Data, Montpellier, France, May 26, 2013.",
                "count": 6,
                "papers": [
                    "Statistical Relational Learning using ProbLog.",
                    "Nell2RDF: Read the Web, and Turn it into RDF.",
                    "Mapping Keywords to Linked Data Resources for Automatic Query Expansion.",
                    "Cross-language Semantic Matching for Discovering Links to e-gov Services in the LOD Cloud.",
                    "Addressing Streaming and Historical Data in OBDA Systems: Optique's Approach.",
                    "Towards a Benchmark for LOD-Enhanced Knowledge Discovery from Structured Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2013wodoom",
                "sub_name": "Proceedings of the Second International Workshop on Debugging Ontologies and Ontology Mappings, Montpellier, France, May 27, 2013.",
                "count": 7,
                "papers": [
                    "Debugging weighted ontologies.",
                    "Finding fault: detecting issues in a versioned ontology.",
                    "Optique System: towards ontology and mapping management in OBDA solutions.",
                    "Repairing missing is-a structure in ontologies is an abductive reasoning problem.",
                    "Antipattern detection: how to debug an ontology without a reasoner.",
                    "Ontology adaptation upon updates.",
                    "Checking and repairing ontological naming patterns using ORE and PatOMat."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2013sepublica",
                "sub_name": "Proceedings of the 3rd Workshop on Semantic Publishing, Montpellier, France, May 26th, 2013.",
                "count": 8,
                "papers": [
                    "How do we make Scholarship Semantic?",
                    "Twenty-Five Shades of Greycite: Semantics for Referencing and Preservation.",
                    "Systematic Reviews as an Interface to the Web of (Trial) Data: using PICO as an Ontology for Knowledge Synthesis in Evidence-based Healthcare Research.",
                    "Towards Linked Research Data: an Institutional Approach.",
                    "Repurposing Benchmark Corpora for Reconstructing Provenance.",
                    "Connections across Scientific Publications based on Semantic Annotations.",
                    "Towards the Automatic Identification of the Nature of Citations.",
                    "How Reliable is Your Workflow: Monitoring Decay in Scholarly Publications."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2013salad",
                "sub_name": "Proceedings of the First Workshop on Services and Applications over Linked APIs and Data co-located with the 10th Extended Semantic Web Conference (ESWC 2013), Montpellier, France, May 26, 2013.",
                "count": 7,
                "papers": [
                    "YASGUI: Not Just Another SPARQL Client.",
                    "RDF-REST: A Unifying Framework for Web APIs and Linked Data.",
                    "Future Challenges for Linked APIs.",
                    "Comparing Major Web Service Paradigms.",
                    "Lived happily ever after: Combing a dynamic CMS front-end with Semantic Mashup Personalization features.",
                    "Currency Conversion the Linked Data Way.",
                    "Knowledge Discovery meets Linked APIs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ESWC 2012",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2012",
                "sub_name": "The Semantic Web: Research and Applications - 9th Extended Semantic Web Conference, ESWC 2012, Heraklion, Crete, Greece, May 27-31, 2012. Proceedings.",
                "count": 73,
                "papers": [
                    "Semantic Web/LD at a Crossroads: Into the Garbage Can or To Theory?",
                    "New Audiences for Ontologies: Dealing with Complexity in Business Processes.",
                    "Bringing (Web) Databases to the Masses.",
                    "Large Scale Learning at Twitter.",
                    "Musubi: A Decentralized Mobile Social Web.",
                    "Data Value Chain in Europe.",
                    "Cutting through the Noise: How to Shape Public Perception, Frame the Debate and Effectively Engage Your Audience in the Digital Age.",
                    "SPARQL for a Web of Linked Data: Semantics and Computability.",
                    "Linked Data-Based Concept Recommendation: Comparison of Different Methods in Open Innovation Scenario.",
                    "Finding Co-solvers on Twitter, with a Little Help from Linked Data.",
                    "Top-k Linked Data Query Processing.",
                    "Preserving Information Content in RDF Using Bounded Homomorphisms.",
                    "Assessing Linked Data Mappings Using Network Measures.",
                    "A Novel Concept-Based Search for the Web of Data Using UMBEL and a Fuzzy Retrieval Model.",
                    "Unsupervised Learning of Link Discovery Configuration.",
                    "Graph Kernels for RDF Data.",
                    "EAGLE: Efficient Active Learning of Link Specifications Using Genetic Programming.",
                    "Combining Information Extraction, Deductive Reasoning and Machine Learning for Relation Prediction.",
                    "Automatic Configuration Selection Using Ontology Matching Task Profiling.",
                    "TELIX: An RDF-Based Model for Linguistic Annotation.",
                    "LODifier: Generating Linked Data from Unstructured Text.",
                    "POWLA: Modeling Linguistic Corpora in OWL/DL.",
                    "Representing Mereotopological Relations in OWL Ontologies with OntoPartS.",
                    "Evaluation of the Music Ontology Framework.",
                    "The Current State of SKOS Vocabularies on the Web.",
                    "The ISOcat Registry Reloaded.",
                    "SCHEMA - An Algorithm for Automated Product Taxonomy Mapping in E-commerce.",
                    "Voting Theory for Concept Detection.",
                    "Modelling Structured Domains Using Description Graphs and Logic Programming.",
                    "Extending Description Logic Rules.",
                    "Prexto: Query Rewriting under Extensional Constraints in DL - Lite.",
                    "Semi-automatically Mapping Structured Sources into the Semantic Web.",
                    "Castor: A Constraint-Based SPARQL Engine with Active Filter Processing.",
                    "A Structural Approach to Indexing Triples.",
                    "Domain Specific Data Retrieval on the Semantic Web.",
                    "Exchange and Consumption of Huge RDF Data.",
                    "Impact of Using Relationships between Ontologies to Enhance the Ontology Search Results.",
                    "Enhancing OLAP Analysis with Web Cubes.",
                    "Query-Independent Learning to Rank for RDF Entity Search.",
                    "COV4SWS.KOM: Information Quality-Aware Matchmaking for Semantic Services.",
                    "Automatic Identification of Best Answers in Online Enquiry Communities.",
                    "Characterising Emergent Semantics in Twitter Lists.",
                    "Crowdsourcing Taxonomies.",
                    "Generating Possible Interpretations for Statistics from Linked Open Data.",
                    "Green-Thumb Camera: LOD Application for Field IT.",
                    "Assembling Rule Mashups in the Semantic Web.",
                    "Product Customization as Linked Data.",
                    "From Web 1.0 to Social Semantic Web: Lessons Learnt from a Migration to a Medical Semantic Wiki.",
                    "Semantics Visualization for Fostering Search Result Comprehension.",
                    "Evaluating Scientific Hypotheses Using the SPARQL Inferencing Notation.",
                    "Declarative Representation of Programming Access to Ontologies.",
                    "Clinical Trial and Disease Search with Ad Hoc Interactive Ontology Alignments.",
                    "Towards Fuzzy Query-Relaxation for RDF.",
                    "Learning Driver Preferences of POIs Using a Semantic Web Knowledge System.",
                    "An Approach for Named Entity Recognition in Poorly Structured Data.",
                    "Supporting Linked Data Production for Cultural Heritage Institutes: The Amsterdam Museum Case Study.",
                    "Curate and Storyspace: An Ontology and Web-Based Environment for Describing Curatorial Narratives.",
                    "Bringing Mathematics to the Web of Data: The Case of the Mathematics Subject Classification.",
                    "A Publishing Pipeline for Linked Government Data.",
                    "Achieving Interoperability through Semantic Technologies in the Public Administration.",
                    "Tackling Incompleteness in Information Extraction - A Complementarity Approach.",
                    "A Framework for Ontology Usage Analysis.",
                    "Formal Specification of Ontology Networks.",
                    "Leveraging Linked Data Analysis for Semantic Recommender Systems.",
                    "Sharing Statistics for SPARQL Federation Optimization, with Emphasis on Benchmark Quality.",
                    "A Reuse-Based Lightweight Method for Developing Linked Data Ontologies and Vocabularies.",
                    "Optimising XML-RDF Data Integration - A Formal Approach to Improve XSPARQL Efficiency.",
                    "Software Architectures for Scalable Ontology Networks.",
                    "Identifying Complex Semantic Matches.",
                    "Data Linking with Ontology Alignment.",
                    "A Semantic Policy Sharing Infrastructure for Pervasive Communities.",
                    "Involving Domain Experts in Ontology Construction: A Template Based Approach.",
                    "Quality Assurance in Collaboratively Created Web Vocabularies."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2012s",
                "sub_name": "The Semantic Web: ESWC 2012 Satellite Events - ESWC 2012 Satellite Events, Heraklion, Crete, Greece, May 27-31, 2012. Revised Selected Papers.",
                "count": 49,
                "papers": [
                    "Finding Concept Coverings in Aligning Ontologies of Linked Data.",
                    "Extraction of Historical Events from Wikipedia.",
                    "Capturing Interactive Data Transformation Operations Using Provenance Workflows.",
                    "Representing Interoperable Provenance Descriptions for ETL Workflows.",
                    "Using SPIN to Formalise XBRL Accounting Regulations on the Semantic Web.",
                    "An Ontology-Based Opinion Mining Approach for the Financial Domain.",
                    "Interacting with Statistical Linked Data via OLAP Operations.",
                    "Linguistic Modeling of Linked Open Data for Question Answering.",
                    "SPARTIQULATION: Verbalizing SPARQL Queries.",
                    "Multilingual Ontology Matching Evaluation - A First Report on Using MultiFarm.",
                    "Evaluating Semantic Search Systems to Identify Future Directions of Research.",
                    "The DyKOSMap Approach for Analyzing and Supporting the Mapping Maintenance Problem in Biomedical Knowledge Organization Systems.",
                    "Effective Composition of Mappings for Matching Biomedical Ontologies.",
                    "Semantic Interoperability Between Clinical Research and Healthcare: The PONTE Approach.",
                    "A Linked Data Framework for Android.",
                    "The Web of Radios - Introducing African Community Radio as an Interface to the Web of Data.",
                    "Social Media Matrix Matching Corporate Goals with External Social Media Activities.",
                    "Knowledge Modeling of On-line Value Management.",
                    "Online Open Neuroimaging Mass Meta-Analysis with a Wiki.",
                    "Linked Data and Linked APIs: Similarities, Differences, and Challenges.",
                    "Hyperdata: Update APIs for RDF Data Sources (Vision Paper).",
                    "Enabling Semantic Search in Large Open Source Communities.",
                    "An Approach for Efficiently Combining Real-Time and Past Events for Ubiquitous Business Processing.",
                    "Context Management in Event Marketplaces.",
                    "SDDS Based Hierarchical DHT Systems for an Efficient Resource Discovery in Data Grid Systems.",
                    "FaCETa: Backward and Forward Recovery for Execution of Transactional Composite WS.",
                    "Sgvizler: A JavaScript Wrapper for Easy Visualization of SPARQL Result Sets.",
                    "Exploring History Through Newspaper Archives.",
                    "Semantic Content Management with Apache Stanbol.",
                    "RDFaCE-Lite: A WYSIWYM Editor for User-Friendly Semantic Text Authoring.",
                    "ParkJamJAM: Crowdsourcing Parking Availability Information with Linked Data (Demo).",
                    "Nobody Wants to Live in a Cold City Where No Music Has Been Recorded - Analyzing Statistics with Explain-a-LOD.",
                    "ScienceWISE: A Web-Based Interactive Semantic Platform for Paper Annotation and Ontology Editing.",
                    "Developing an Incomplete Reasoner in Five Minutes: The Large Knowledge Collider in Action.",
                    "Did You Validate Your Ontology? OOPS!",
                    "Does It Fit? KOS Evaluation Using the ICE-Map Visualization.",
                    "A Demo for Efficient Human Attention Detection Based on Semantics and Complex Event Processing.",
                    "Domain-Specific OWL Ontology Visualization with OWLGrEd.",
                    "Product Customization as Linked Data: Demonstration.",
                    "Karma: A System for Mapping Structured Sources into the Semantic Web.",
                    "Personalized Environmental Service Configuration and Delivery Orchestration: The PESCaDO Demonstrator.",
                    "Supporting Rule Generation and Validation on Environmental Data in EnStreaM.",
                    "Linked Open Data University of Münster - Infrastructure and Applications.",
                    "OntoPartS: A Tool to Select Part-Whole Relations in OWL Ontologies.",
                    "Hubble: Linked Data Hub for Clinical Decision Support.",
                    "Confomaton: A Conference Enhancer with Social Media from the Cloud.",
                    "OBA: Supporting Ontology-Based Annotation of Natural Language Resources.",
                    "HadoopSPARQL: A Hadoop-Based Engine for Multiple SPARQL Query Answering.",
                    "DEFENDER: A DEcomposer for quEries agaiNst feDERations of Endpoints."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2012knowlod",
                "sub_name": "Proceedings of the First International Workshop on Knowledge Discovery and Data Mining Meets Linked Open Data, Heraklion, Greece, May 27, 2012.",
                "count": 6,
                "papers": [
                    "Finding Concept Coverings in Aligning Ontologies of Linked Data.",
                    "Towards Rule Learning Approaches to Instance-based Ontology Matching.",
                    "Combining Data Mining and Ontology Engineering to Enrich Ontologies and Linked Data.",
                    "Extraction of Historical Events from Wikipedia.",
                    "Towards Enriching Linked Open Data via Open Information Extraction.",
                    "Mining Wikipedia's Snippets Graph - First Step to Build a New Knowledge Base."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2012ild",
                "sub_name": "Proceedings of the Workshop on Interacting with Linked Data, Heraklion, Greece, May 28, 2012.",
                "count": 9,
                "papers": [
                    "Putting Linked Data to Use in a Large Higher-Education Organisation.",
                    "Facets and Pivoting for Flexible and Usable Linked Data Exploration.",
                    "Interacting with Statistical Linked Data via OLAP Operations.",
                    "SPARTIQULATION: Verbalizing SPARQL Queries.",
                    "Improving Semantic Search Using Query Log Analysis.",
                    "Linguistic Modeling of Linked Open Data for Question Answering.",
                    "QAKiS @ QALD-2.",
                    "A System Description of Natural Language Query over DBpedia.",
                    "TypeCraft: Collaborative Databasing and Resource Sharing for Linguists."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2012sepublica",
                "sub_name": "Proceedings of the 2nd Workshop on Semantic Publishing, co-located with the 9th Extended Semantic Web Conference, SePublica@ESWC 2012, Hersonissos, Crete, Greece, May 28, 2012.",
                "count": 8,
                "papers": [
                    "Workflow-Centric Research Objects: A First Class Citizen in the Scholarly Discourse.",
                    "Using annotations to model discourse: an extension to the Annotation Ontology.",
                    "Three Steps to Heaven: Semantic Publishing in a Real World Workflow.",
                    "Online open neuroimaging mass meta-analysis.",
                    "Uncovering impacts: a case study in using altmetrics tools.",
                    "Semantic Publishing of Knowledge about Amino Acids.",
                    "Linked Data for the Natural Sciences: Two Use Cases in Chemistry and Biology.",
                    "Automated Assembly of Custom Narratives from Modular Content using Semantic Representations of Real-world Domains and Audiences."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2012swpm",
                "sub_name": "Proceedings of the Workshop on Semantic Web for Provenance Management, SWPM@ESWC 2012, Heraklion, Greece, May 28, 2012.",
                "count": 6,
                "papers": [
                    "Capturing Interactive Data Transformation Operations using Provenance Workflows.",
                    "Evolution of Workflow Provenance Information in the Presence of Custom Inference Rules.",
                    "Capturing provenance information with a workflow monitoring extension for the Kieker framework.",
                    "Representing Interoperable Provenance Descriptions for ETL Workflows.",
                    "Automatic Metadata Annotation through Reconstructing Provenance.",
                    "Towards Semantic Provenance in CRISTAL."
                ]
            },
            {
                "sub_name_abbr": "conf/red/2012",
                "sub_name": "Resource Discovery - 5th International Workshop, RED 2012, Co-located with the 9th Extended Semantic Web Conference, ESWC 2012, Heraklion, Greece, May 27, 2012, Revised Selected Papers.",
                "count": 7,
                "papers": [
                    "Techniques for the Identification of Semantically-Equivalent Online Identities.",
                    "Modeling Snapshot of Composite WS Execution by Colored Petri Nets.",
                    "A Game Theoretic Approach for Resource Usage.",
                    "LiQuate-Estimating the Quality of Links in the Linking Open Data Cloud.",
                    "Web Service Composition Based on Petri Nets: Review and Contribution.",
                    "Medical Image Rendering and Description Driven by Semantic Annotations.",
                    "Towards an Efficient Datalog Based Evaluation of the FSAQL Query Language."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ESWC 2011",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2011-1",
                "sub_name": "The Semantic Web: Research and Applications - 8th Extended Semantic Web Conference, ESWC 2011, Heraklion, Crete, Greece, May 29-June 2, 2011, Proceedings, Part I.",
                "count": 28,
                "papers": [
                    "Interactive Exploration of Fuzzy RDF Knowledge Bases.",
                    "A Structured Semantic Query Interface for Reasoning-Based Search and Retrieval.",
                    "Distributed Human Computation Framework for Linked Data Co-reference Resolution.",
                    "Relational Kernel Machines for Learning from Graph-Structured RDF Data.",
                    "AutoSPARQL: Let Users Query Your Knowledge Base.",
                    "Contextual Ontology Alignment of LOD with an Upper Ontology: A Case Study with Proton.",
                    "Hide the Stack:  Toward Usable Linked Data.",
                    "Linked Data Metrics for Flexible Expert Search on the Open Web.",
                    "Statistical Schema Induction.",
                    "SIHJoin: Querying Remote and Local Linked Data.",
                    "Zero-Knowledge Query Planning for an Iterator Implementation of Link Traversal Based Query Execution.",
                    "Integrating Linked Data and Services with Linked Data Services.",
                    "OntoWiki Mobile - Knowledge Management in Your Pocket.",
                    "Weaving a Distributed, Semantic Social Network for Mobile Users.",
                    "Automatic Semantic Subject Indexing of Web Documents in Highly Inflected Languages.",
                    "FootbOWL: Using a Generic Ontology of Football Competition for Planning Match Summaries.",
                    "Linking Lexical Resources and Ontologies on the Semantic Web with Lemon.",
                    "Elimination of Redundancy in Ontologies.",
                    "Evaluating the Stability and Credibility of Ontology Matching Methods.",
                    "How Matchable Are Four Thousand Ontologies on the Semantic Web.",
                    "Understanding an Ontology through Divergent Exploration.",
                    "The Use of Foundational Ontologies in Ontology Development: An Empirical Assessment.",
                    "Using Pseudo Feedback to Improve Cross-Lingual Ontology Mapping.",
                    "Automatic Identification of Ontology Versions Using Machine Learning Techniques.",
                    "A Tableaux-Based Algorithm for SHIQ\\mathcal{SHIQ} with Transitive Closure of Roles in Concept and Role Inclusion Axioms.",
                    "SPARQL Query Answering over OWL Ontologies.",
                    "Epistemic Querying of OWL Knowledge Bases.",
                    "A Practical Approach for Computing Generalization Inferences in EL\\mathcal{EL}."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2011-2",
                "sub_name": "The Semanic Web: Research and Applications - 8th Extended Semantic Web Conference, ESWC 2011, Heraklion, Crete, Greece, May 29 - June 2, 2011, Proceedings, Part II.",
                "count": 46,
                "papers": [
                    "Semantics and Optimization of the SPARQL 1.1 Federation Extension.",
                    "Grr: Generating Random RDF.",
                    "High-Performance Computing Applied to Semantic Databases.",
                    "An Intermediate Algebra for Optimizing RDF Graph Pattern Matching on MapReduce.",
                    "Query Relaxation for Entity-Relationship Search.",
                    "Optimizing Query Shortcuts in RDF Databases.",
                    "RDFS Update: From Theory to Practice.",
                    "Benchmarking Matching Applications on the Semantic Web.",
                    "Efficiently Evaluating Skyline Queries on RDF Databases.",
                    "The Design and Implementation of Minimal RDFS Backward Reasoning in 4store.",
                    "miKrow: Semantic Intra-enterprise Micro-Knowledge Management System.",
                    "A Faceted Ontology for a Semantic Geo-Catalogue.",
                    "SoKNOS - Using Semantic Technologies in Disaster Management Software.",
                    "Semantic Technologies for Describing Measurement Data in Databases.",
                    "Ontology-Driven Guidance for Requirements Elicitation.",
                    "The Semantic Public Service Portal (S-PSP).",
                    "DataFinland - A Semantic Portal for Open and Linked Datasets.",
                    "Biological Names and Taxonomies on the Semantic Web - Managing the Change in Scientific Conception.",
                    "An Approach for More Efficient Energy Consumption Based on Real-Time Situational Awareness.",
                    "Ontology-Driven Complex Event Processing in Heterogeneous Sensor Networks.",
                    "A Semantically Enabled Service Architecture for Mashups over Streaming and Stored Data.",
                    "Zhi# - OWL Aware Compilation.",
                    "Lightweight Semantic Annotation of Geospatial RESTful Services.",
                    "Towards Custom Cloud Services - Using Semantic Technology to Optimize Resource Configuration.",
                    "One Tag to Bind Them All: Measuring Term Abstractness in Social Metadata.",
                    "Semantic Enrichment of Twitter Posts for User Profile Construction on the Social Web.",
                    "Improving Categorisation in Social Media Using Hyperlinks to Structured Data Sources.",
                    "Predicting Discussions on the Social Semantic Web.",
                    "Mining for Reengineering: An Application to Semantic Wikis Using Formal and Relational Concept Analysis.",
                    "SmartLink: A Web-Based Editor and Search Environment for Linked Services.",
                    "ViziQuer: A Tool to Explore and Query SPARQL Endpoints.",
                    "EasyApp: Goal-Driven Service Flow Generator with Semantic Web Service Technologies.",
                    "Who's Who - A Linked Data Visualisation Tool for Mobile Environments.",
                    "OntosFeeder - A Versatile Semantic Context Provider for Web Content Authoring.",
                    "wayOU - Linked Data-Based Social Location Tracking in a Large, Distributed Organisation.",
                    "SeaFish: A Game for Collaborative and Visual Image Annotation and Interlinking.",
                    "The Planetary System: Executable Science, Technology, Engineering and Math Papers.",
                    "Semantic Annotation of Images on Flickr.",
                    "FedX: A Federation Layer for Distributed Query Processing on Linked Open Data.",
                    "Reasoning in Expressive Extensions of the RDF Semantics.",
                    "Personal Semantics: Personal Information Management in the Web with Semantic Technologies.",
                    "Reasoning with Noisy Semantic Data.",
                    "Extracting and Modeling Historical Events to Enhance Searching and Browsing of Digital Cultural Heritage Collections.",
                    "Enriching Ontologies by Learned Negation - Or How to Teach Ontologies Vegetarianism.",
                    "Optimizing Query Answering over OWL Ontologies.",
                    "Hybrid Search Ranking for Structured and Unstructured Data."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2011w",
                "sub_name": "The Semantic Web: ESWC 2011 Workshops - ESWC 2011 Workshops, Heraklion, Greece, May 29-30, 2011, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Linking Knowledge for Simulation Learning.",
                    "Generating Educational Assessment Items from Linked Open Data: The Case of DBpedia.",
                    "Using Linked Data to Reduce Learning Latency for e-Book Readers.",
                    "The OU Linked Open Data: Production and Consumption.",
                    "RDFPath: Path Query Processing on Large RDF Graphs with MapReduce.",
                    "A Novel Metric for Information Retrieval in Semantic Networks.",
                    "Towards BOTTARI: Using Stream Reasoning to Make Sense of Location-Based Micro-posts.",
                    "Automatic Detection of Political Opinions in Tweets.",
                    "The Pragmatics of Political Messages in Twitter Communication.",
                    "A Knowledge Dashboard for Manufacturing Industries.",
                    "FREyA: An Interactive Way of Querying Linked Data Using Natural Language.",
                    "Ontology-Based User-Defined Rules and Context-Aware Service Composition System.",
                    "Random Indexing for Finding Similar Nodes within Large RDF Graphs.",
                    "Reconciling Provenance Policy Conflicts by Inventing Anonymous Nodes.",
                    "Information Resource Recommendation in Knowledge Processes.",
                    "Service Adaptation Recommender in the Event Marketplace: Conceptual View.",
                    "Authoring and Publishing Units and Quantities in Semantic Documents.",
                    "Policy Intelligence in the Era of Social Computing: Towards a Cross-Policy Decision Support System.",
                    "XHTML with RDFa as a Semantic Document Format for CCTS Modelled Documents and Its Application for Social Services.",
                    "Balancing System Expressivity and User Cognitive Load in Semantically Enhanced Policy Modelling.",
                    "Sensing Presence (PreSense) Ontology: User Modelling in the Semantic Sensor Web.",
                    "TUMS: Twitter-Based User Modeling Service."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2011sepublica",
                "sub_name": "Proceedings of the 1st Workshop on Semantic Publishing 2011, Hersonissos, Crete, Greece, May 30, 2011.",
                "count": 7,
                "papers": [
                    "Authoring and Publishing of Units and Quantities in Semantic Documents.",
                    "Exploring the Generation and Integration of Publishable Scientific Facts Using the Concept of Nano-publications.",
                    "A Framework for Semantic Publishing of Modular Content Objects.",
                    "BauDenkMalNetz - Creating a Semantically Annotated Web Resource of Historical Buildings.",
                    "Sustainability of Evaluations Presented in Research Publications.",
                    "A Semantic Model for Scholarly Electronic Publishing.",
                    "Towards New Scholarly Communication: A Case Study of the 4A Framework."
                ]
            },
            {
                "sub_name_abbr": "conf/msm/2011",
                "sub_name": "Proceedings of the ESWC2011 Workshop on 'Making Sense of Microposts': Big things come in small packages, Heraklion, Crete, Greece, May 30, 2011.",
                "count": 10,
                "papers": [
                    "Citation Analysis in Twitter: Approaches for Defining and Measuring Information Flows within Tweets during Scientific Conferences.",
                    "Making Sense of Location-based Micro-posts Using Stream Reasoning.",
                    "DEMO: Polemical Video Annotation by Twitter.",
                    "Extracting Semantic Entities and Events from Sports Tweets.",
                    "Follow Me: Capturing Entity-Based Semantics Emerging from Personal Awareness Streams.",
                    "Does Size Matter? When Small is Good Enough.",
                    "Discovering the Dynamics of Terms' Semantic Relatedness through Twitter.",
                    "The Pragmatics of Political Messages in Twitter Communication.",
                    "Automatic Detection of Political Opinions in Tweets.",
                    "A New ANEW: Evaluation of a Word List for Sentiment Analysis in Microblogs."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2011ll",
                "sub_name": "Proceedings of Linked Learning 2011: the 1st International Workshop on eLearning Approaches for the Linked Data Age, Linked Learning@ESWC 2011, Heraklion, Greece, May 29, 2011.",
                "count": 13,
                "papers": [
                    "The OU Linked Open Data: Production and Consumption.",
                    "Using Linked Data to Reduce Learning Latency for e-Book Readers.",
                    "A Linked Knowledge Base for Simulation Learning.",
                    "Connecting Medical Educational Resources to the Linked Data Cloud: the mEducator RDF Schema, Store and API.",
                    "Educational Semantic Wikis in the Linked Data Age: the case of MSc Web Science Program at Aristotle University of Thessaloniki.",
                    "A Linked Data-driven & Service-oriented Architecture for Sharing Educational Resources.",
                    "Zenaminer: driving the SCORM Standard towards the Web of Data.",
                    "Developing controlled Vocabularies for educational Resources Sharing: a Case Study.",
                    "Applying and Extending Semantic Wikis for Semantic Web Courses.",
                    "Navigating learning Resources through Linked Data: a preliminary Report on the Re-Design of Organic.Edunet.",
                    "Educational Resources as Social Objects in Semantic Social Networks.",
                    "Generating educational Assessment Items from Linked Open Data: the Case of DBpedia.",
                    "A Mobile and Adaptive Language Learning Environment based on Linked Data."
                ]
            },
            {
                "sub_name_abbr": "conf/red/2011",
                "sub_name": "Proceedings of the Fourth International Workshop on REsource Discovery, RED@ESWC 2011, Heraklion, Greece, May 30, 2011.",
                "count": 9,
                "papers": [
                    "Scalable Discovery of Linked Services.",
                    "Ontology-based User-defined Rules and Context-aware Service Composition System.",
                    "Random Indexing for Finding Similar Nodes within Large RDF graphs.",
                    "An Organizational Environment for in Silico Experiments in Molecular Biology.",
                    "A Directory of Heterogeneous Services.",
                    "A Framework for Resource Annotation and Classification in Bioinformatics.",
                    "LDM: Link Discovery Method for new Resource Integration.",
                    "Repairing Provenance Policy Violations by Inventing Non-Functional Nodes.",
                    "C-Set: a Commutative Replicated Data Type for Semantic Stores."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ESWC 2010",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2010-1",
                "sub_name": "The Semantic Web: Research and Applications, 7th Extended Semantic Web Conference, ESWC 2010, Heraklion, Crete, Greece, May 30 - June 3, 2010, Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "Incremental Reasoning on Streams and Rich Background Knowledge.",
                    "Mobile Semantic-Based Matchmaking: A Fuzzy DL Approach.",
                    "Replication and Versioning of Partial RDF Graphs.",
                    "Finding Your Way through the Rijksmuseum with an Adaptive Mobile Museum Guide.",
                    "A Hybrid Model and Computing Platform for Spatio-semantic Trajectories.",
                    "Reactive Policies for the Semantic Web.",
                    "Categorize by: Deductive Aggregation of Semantic Web Query Results.",
                    "Natural Language Interfaces to Ontologies: Combining Syntactic Analysis and Ontology-Based Lookup through the User Interaction.",
                    "GeoWordNet: A Resource for Geo-spatial Applications.",
                    "Assessing the Safety of Knowledge Patterns in OWL Ontologies.",
                    "Entity Reference Resolution via Spreading Activation on RDF-Graphs.",
                    "A Generic Approach for Correcting Access Restrictions to a Consequence.",
                    "Dealing with Inconsistency When Combining Ontologies and Rules Using DL-Programs.",
                    "Aligning Large SKOS-Like Vocabularies: Two Case Studies.",
                    "OWL Reasoning with WebPIE: Calculating the Closure of 100 Billion Triples.",
                    "Efficiently Joining Group Patterns in SPARQL Queries.",
                    "Reasoning-Based Patient Classification for Enhanced Medical Image Annotation.",
                    "Facilitating Dialogue - Using Semantic Web Technology for eParticipation.",
                    "Implementing Archaeological Time Periods Using CIDOC CRM and SKOS.",
                    "Facet Graphs: Complex Semantic Querying Made Easy.",
                    "Interactive Relationship Discovery via the Semantic Web.",
                    "Put in Your Postcode, Out Comes the Data: A Case Study.",
                    "Taking OWL to Athens.",
                    "Generating Innovation with Semantically Enabled TasLab Portal.",
                    "Context-Driven Semantic Enrichment of Italian News Archive.",
                    "A Pragmatic Approach to Semantic Repositories Benchmarking.",
                    "A Web-Based Repository Service for Vocabularies and Alignments in the Cultural Heritage Domain.",
                    "Ontology Management in an Event-Triggered Knowledge Network.",
                    "Modeling and Querying Metadata in the Semantic Sensor Web: The Model stRDF and the Query Language stSPARQL."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2010-2",
                "sub_name": "The Semantic Web: Research and Applications, 7th Extended Semantic Web Conference, ESWC 2010, Heraklion, Crete, Greece, May 30 - June 3, 2010, Proceedings, Part II.",
                "count": 51,
                "papers": [
                    "A Model of User Preferences for Semantic Services Discovery and Ranking.",
                    "Towards Practical Semantic Web Service Discovery.",
                    "iSeM: Approximated Reasoning for Adaptive Hybrid Selection of Semantic Services.",
                    "Measures for Benchmarking Semantic Web Service Matchmaking Correctness.",
                    "Efficient Semantic Event Processing: Lessons Learned in User Interface Integration.",
                    "Usage Policies for Document Compositions.",
                    "The Impact of Multifaceted Tagging on Learning Tag Relations and Search.",
                    "OKBook: Peer-to-Peer Community Formation.",
                    "Acquiring Thesauri from Wikis by Exploiting Domain Models and Lexical Substitution.",
                    "Efficient Semantic-Aware Detection of Near Duplicate Resources.",
                    "Guarding a Walled Garden - Semantic Privacy Preferences for the Social Web.",
                    "Using Social Media for Ontology Enrichment.",
                    "Representing Distributed Groups with dgFOAF.",
                    "Semantics, Sensors, and the Social Web: The Live Social Semantics Experiments.",
                    "LESS - Template-Based Syndication and Presentation of Linked Data.",
                    "Hierarchical Link Analysis for Ranking Web Data.",
                    "A Node Indexing Scheme for Web Entity Retrieval.",
                    "Object Link Structure in the Semantic Web.",
                    "ExpLOD: Summary-Based Exploration of Interlinking and RDF Usage in the Linked Open Data Cloud.",
                    "Combining Query Translation with Query Answering for Efficient Keyword Search.",
                    "Improving the Performance of Semantic Web Applications with SPARQL Query Caching.",
                    "An Unsupervised Approach for Acquiring Ontologies and RDF Data from Online Life Science Databases.",
                    "Leveraging Terminological Structure for Object Reconciliation.",
                    "Usability of Keyword-Driven Schema-Agnostic Search.",
                    "Collaborative Semantic Points of Interests.",
                    "Publishing Math Lecture Notes as Linked Data.",
                    "GoNTogle: A Tool for Semantic Annotation and Search.",
                    "A Software Tool for Visualizing, Managing and Eliciting SWRL Rules.",
                    "A Knowledge Infrastructure for the Dutch Immigration Office.",
                    "Verifying and Validating Multi-layered Models with OWL FA Toolkit.",
                    "What's New in WSMX?",
                    "OntoFrame S3: Semantic Web-Based Academic Research Information Portal Service Empowered by STAR-WIN.",
                    "Rapid Prototyping a Semantic Web Application for Cultural Heritage: The Case of MANTIC.",
                    "Hey! Ho! Let's Go! Explanatory Music Recommendations with dbrec.",
                    "PossDL - A Possibilistic DL Reasoner for Uncertainty Reasoning and Inconsistency Handling.",
                    "PoolParty: SKOS Thesaurus Management Utilizing Linked Data.",
                    "DSMW: Distributed Semantic MediaWiki.",
                    "TrOWL: Tractable OWL 2 Reasoning Infrastructure.",
                    "Making the Semantic Data Web Easily Writeable with RDFauthor.",
                    "BioNav: An Ontology-Based Framework to Discover Semantic Links in the Cloud of Linked Data.",
                    "StarLion: Auto-configurable Layouts for Exploring Ontologies.",
                    "Concept Extraction Applied to the Task of Expert Finding.",
                    "Towards Trust in Web Content Using Semantic Web Technologies.",
                    "The Semantic Gap of Formalized Meaning.",
                    "A Contextualized Knowledge Framework for Semantic Web.",
                    "Computational and Crowdsourcing Methods for Extracting Ontological Structure from Folksonomy.",
                    "Debugging the Missing Is-A Structure of Networked Ontologies.",
                    "Global Semantic Graph as an Alternative Information and Collaboration Infrastructure.",
                    "Scalable and Parallel Reasoning in the Semantic Web.",
                    "Exploring the Wisdom of the Tweets: Towards Knowledge Acquisition from Social Awareness Streams.",
                    "Two Phase Description Logic Reasoning for Efficient Information Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2010sbpm",
                "sub_name": "Proceedings of the 5th International Workshop on Semantic Business Process Management SBPM 2010, held in conjunction with the European Semantic Web Conference (ESWC 2010), Heraklion, Greece, May 31, 2010.",
                "count": 8,
                "papers": [
                    "Linking Heterogeneous Conceptual Models through a Unifying Modeling Concepts Ontology.",
                    "Ontology Based Patterns for Collaborative Process Management.",
                    "MEMOS: A Methodology for Modeling Services.",
                    "Semantic Mediation of Information Flow in Cross-Organizational Business Process Modeling.",
                    "Shaken not Stirred: Mixing Semantics into XPDL.",
                    "Agile Process Execution with Kissmir.",
                    "An Approach for the Semantic Contextualization of the Web Advertisement Process.",
                    "Logic-based ad-hoc Business Process Management: Concepts and Challenges."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2010sfsw",
                "sub_name": "Proceedings of the Sixth Workshop on Scripting and Development for the Semantic Web, Crete, Greece, May 31, 2010.",
                "count": 6,
                "papers": [
                    "Expressing and Aggregating Rich Event Descriptions.",
                    "iQvoc - Open Source SKOS(XL) Maintenance and Publishing Tool.",
                    "Semantic Annotation of Web APIs with SWEET.",
                    "One Click Annotation.",
                    "Update Strategies for DBpedia Live.",
                    "sparqlPuSH: Proactive Notification of Data Updates in RDF Stores Using PubSubHubbub."
                ]
            },
            {
                "sub_name_abbr": "conf/semwiki/2010",
                "sub_name": "Proceedings of the 5th Workshop on Semantic Wikis, Hersonissos, Heraklion, Crete, Greece, May 31st, 2010.",
                "count": 19,
                "papers": [
                    "PEST: Term-Propagation over Wiki-Structures as Eigenvector Computation.",
                    "Jump-starting a Body-of-Knowledge with a Semantic Wiki on a Discipline Ontology.",
                    "TasTicWiki: A Semantic Wiki with Content Recommendation.",
                    "Ideator - a collaborative enterprise idea management tool powered by KiWi.",
                    "Towards Meta-Engineering for Semantic Wikis.",
                    "Access and Annotation of Archaeological Corpus via a SemanticWiki.",
                    "Collaborative Editing and Linking of Astronomy Vocabularies Using Semantic Mediawiki.",
                    "A Wiki-Oriented On-line Dictionary for Human and Social Sciences.",
                    "Automating Content Generation for Large-scale Virtual Learning Environments using Semantic Web Services.",
                    "Lab Service Wiki: a wiki-based data management solution for protein production service.",
                    "OpenDrugWiki - Using a Semantic Wiki for Consolidating, Editing and Reviewing of Existing Heterogeneous Drug Data.",
                    "Enhancing MediaWiki Talk pages with Semantics for Better Coordination - A Proposal.",
                    "Semantic Wiki Refactoring. A strategy to assist Semantic Wiki evolution.",
                    "DSMW: Distributed Semantic MediaWiki.",
                    "Annotation component for a Semantic Wiki.",
                    "A Perfect Match for Reasoning, Explanation, and Reason Maintenance: OWL 2 RL and Semantic Wikis.",
                    "Connecting Semantic Mediawiki to different Triple Stores Using RDF2Go.",
                    "Human-machine Collaboration for Enriching Semantic Wikis using Formal Concept Analysis.",
                    "Prototyping a Browser for a Listed Buildings Database with Semantic MediaWiki."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ESWC 2009",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2009",
                "sub_name": "The Semantic Web: Research and Applications, 6th European Semantic Web Conference, ESWC 2009, Heraklion, Crete, Greece, May 31-June 4, 2009, Proceedings.",
                "count": 89,
                "papers": [
                    "Tonight's Dessert: Semantic Web Layer Cakes.",
                    "Discovering and Building Semantic Models of Web Sources.",
                    "Video Semantics and the Sensor Web.",
                    "Keys, Money and Mobile Phone.",
                    "Querying Trust in RDF Data with tSPARQL.",
                    "RadSem: Semantic Annotation and Retrieval for Medical Images.",
                    "Semanta - Semantic Email Made Easy.",
                    "The Sile Model - A Semantic File System Infrastructure for the Desktop.",
                    "Who the Heck Is the Father of Bob?.",
                    "Benchmarking Fulltext Search Performance of RDF Stores.",
                    "A Heuristics Framework for Semantic Subscription Processing.",
                    "Towards Linguistically Grounded Ontologies.",
                    "Frame Detection over the Semantic Web.",
                    "Word Sense Disambiguation for XML Structure Feature Generation.",
                    "Improving Ontology Matching Using Meta-level Learning.",
                    "Ontology Integration Using Mappings: Towards Getting the Right Logical Consequences.",
                    "Using Partial Reference Alignments to Align Ontologies.",
                    "Semantic Matching Using the UMLS.",
                    "Embedding Knowledge Patterns into OWL.",
                    "A Core Ontology of Knowledge Acquisition.",
                    "ONTOCOM Revisited: Towards Accurate Cost Predictions for Ontology Development Projects.",
                    "Ranking Approximate Answers to Semantic Web Queries.",
                    "Tempus Fugit.",
                    "Representing, Querying and Transforming Social Networks with RDF/SPARQL.",
                    "Applied Temporal RDF: Efficient Temporal Querying of RDF Data with SPARQL.",
                    "ReduCE: A Reduced Coulomb Energy Network Method for Approximate Classification.",
                    "Hybrid Reasoning with Forest Logic Programs.",
                    "SIM-DLA: A Novel Semantic Similarity Measure for Description Logics Reducing Inter-concept to Inter-instance Similarity.",
                    "Decidability of SHI with Transitive Closure of Roles.",
                    "FO(ID) as an Extension of DL with Rules.",
                    "A Tableau Algorithm for Handling Inconsistency in OWL.",
                    "How to Trace and Revise Identities.",
                    "Concept Search.",
                    "Semantic Wiki Search.",
                    "Applying Semantic Social Graphs to Disambiguate Identity References.",
                    "Middleware for Automated Implementation of Security Protocols.",
                    "Can RDB2RDF Tools Feasibily Expose Large Science Archives for Data Integration?.",
                    "A Flexible API and Editor for SKOS.",
                    "An Ontology of Resources: Solving the Identity Crisis.",
                    "Mining Semantic Descriptions of Bioinformatics Web Resources from the Literature.",
                    "Hybrid Adaptive Web Service Selection with SAWSDL-MX and WSDL-Analyzer.",
                    "Enhancing Service Selection by Semantic QoS.",
                    "Towards an Agent Based Approach for Verification of OWL-S Process Models.",
                    "Leveraging Semantic Web Service Descriptions for Validation by Automated Functional Testing.",
                    "Neighborhood-Based Tag Prediction.",
                    "User Evaluation Study of a Tagging Approach to Semantic Mapping.",
                    "Fuzzy Annotation of Web Data Tables Driven by a Domain Ontology.",
                    "An Integrated Approach to Extracting Ontological Structures from Folksonomies.",
                    "Reducing Ambiguity in Tagging Systems with Folksonomy Search Expansion.",
                    "Ontology-Based Service Discovery Front-End Interface for GloServ.",
                    "A Resource List Management Tool for Undergraduate Students Based on Linked Open Data Principles.",
                    "SCOVO: Using Statistics on the Web of Data.",
                    "Media Meets Semantic Web - How the BBC Uses DBpedia and Linked Data to Make Connections.",
                    "Creating Digital Resources from Legacy Documents: An Experience Report from the Biosystematics Domain.",
                    "Collaborative Ocean Resource Interoperability: Multi-use of Ocean Data on the Semantic Web.",
                    "ONKI SKOS Server for Publishing and Utilizing SKOS Vocabularies and Ontologies as Services.",
                    "Ontology Libraries for Production Use: The Finnish Ontology Library Service ONKI.",
                    "SAscha: Supporting the Italian Public Cooperation System with a Rich Internet Application for Semantic Web Services.",
                    "Folksonomy Enrichment and Search.",
                    "K-Tools: Towards Semantic Knowledge Management.",
                    "The XMediaBox: Sensemaking through the Use of Knowledge Lenses.",
                    "Controlled Natural Language for Semantic Annotation.",
                    "Multilingual and Localization Support for Ontologies.",
                    "WSMX 1.0: A Further Step toward a Complete Semantic Execution Environment.",
                    "MoKi: The Enterprise Modelling Wiki.",
                    "The Personal Knowledge Workbench of the NEPOMUK Semantic Desktop.",
                    "Utilizing Semantics in the Production of iTV Shows.",
                    "Knowledge Applications for Life Events: How the Dutch Government Informs the Public about Rights and Duties in the Netherlands.",
                    "CultureSampo: A National Publication System of Cultural Heritage on the Semantic Web 2.0.",
                    "A Rule System for Querying Persistent RDFS Data.",
                    "RaDON - Repair and Diagnosis in Ontology Networks.",
                    "Supporting the Reuse of Global Unique Identifiers for Individuals in OWL/RDF Knowledge Bases.",
                    "Modeling and Enforcement of Business Policies on Process Models with Maestro.",
                    "A Reasoning-Based Support Tool for Ontology Mapping Evaluation.",
                    "Semanta - Semantic Email in Action.",
                    "KiWi - A Platform for Semantic Social Software (Demonstration).",
                    "Pattern-Based Annotation of HTML-Streams.",
                    "OntoComP: A Protégé Plugin for Completing OWL Ontologies.",
                    "Demo: HistoryViz - Visualizing Events and Relations Extracted from Wikipedia.",
                    "Ontology Evolution with Evolva.",
                    "Cupboard - A Place to Expose Your Ontologies to Applications and the Community.",
                    "Effects of Using a Research Context Ontology for Query Expansion.",
                    "Towards a Semantic Infrastructure for User Generated Mobile Services.",
                    "Relational Databases as Semantic Web Endpoints.",
                    "The Relevance of Reasoning and Alignment Incoherence in Ontology Matching.",
                    "Towards a Semantic Service Broker for Business Grid.",
                    "Evolva: A Comprehensive Approach to Ontology Evolution.",
                    "A Context-Aware Approach for Integrating Semantic Web Technologies onto Mobile Devices.",
                    "Dealing with Inconsistencies in DL-Lite Ontologies."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2009spot",
                "sub_name": "Proceedings of the ESWC2009 Workshop on Trust and Privacy on the Social and Semantic Web (SPOT2009) Heraklion, Greece, June 1, 2009.",
                "count": 11,
                "papers": [
                    "Trust and Privacy on the Social and Semantic Web (SPOT 2009).",
                    "A Comparison of Terminological and Rule-based Policy Languages.",
                    "QUATRO Plus: Quality You Can Trust?",
                    "Assessing Trust: Contextual Accountability.",
                    "Ontology Driven Community Access Control.",
                    "Using Natural Language Policies for Privacy Control in Social Platforms.",
                    "FOAF+TLS: RESTful Authentication for the Social Web.",
                    "A scalable architecture for peer privacy on the Web.",
                    "Privacy Concerns of FOAF-Based Linked Data.",
                    "Data Republishing on the Social Semantic Web.",
                    "Provenance: The Missing Component of the Semantic Web."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2009sfsw",
                "sub_name": "Proceedings of the Fifth Workshop on Scripting and Development for the Semantic Web , co-located with 6th European Semantic Web Conference, SFSW@ESWC 2009, Heraklion, Greece, May 31, 2009.",
                "count": 16,
                "papers": [
                    "Tal4Rdf: Lightweight Presentation for the Semantic Web.",
                    "A Pattern for Domain Specific Editing Interfaces Using Embedded RDFa and HTML Manipulation Tools.",
                    "Experiments with Wikipedia Cross-Language Data Fusion.",
                    "Converging Web and Desktop Data with Konduit.",
                    "Ontology-Based Query Expansion Widget for Information Retrieval.",
                    "Krextor - An Extensible XML->RDF Extraction Framework.",
                    "RDFa in Drupal: Bringing Cheese to the Web of Data.",
                    "Macros vs. Scripting in VPOET.",
                    "SKUA - Retrofitting Semantics.",
                    "Ozone Browser: Augmenting the Web with Semantic Overlays.",
                    "Linked Data for Building a Map of Researchers.",
                    "RDF Schema Rendering.",
                    "AJAX Widget for Semantic Query Expansion.",
                    "Colibrary: Linking Communities of Readers on the Social Semantic Web.",
                    "Practical Semantic Works - a Bridge from the Users' Web to the Semantic Web.",
                    "SPARCool: SPARQL made easy."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2009sbpm",
                "sub_name": "Proceedings of the 4th International Workshop on Semantic Business Process Management, SBPM '09, Heraklion, Greece, June 1, 2009.",
                "count": 11,
                "papers": [
                    "Unary RDF-annotated petri nets: a formalism for the modeling and validation of business processes with semantic information.",
                    "Towards the ontology-based transformation of business process models.",
                    "The business process modelling ontology.",
                    "Semantic-based enterprise attention management systems.",
                    "Semantic web service engineering for semantic business process management.",
                    "Semantic enabled complex event language for business process monitoring.",
                    "Organizational ontologies to support semantic business process management.",
                    "Ontology-based metrics computation for business process analysis.",
                    "Ontology design patterns for the semantic business processes.",
                    "Model-based domain ontology engineering.",
                    "Enhancing telecommunication business process representation and integration with ontologised industry standards."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ESWC 2008",
        "info": "Tenerife, Canary Islands, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2008",
                "sub_name": "The Semantic Web: Research and Applications, 5th European Semantic Web Conference, ESWC 2008, Tenerife, Canary Islands, Spain, June 1-5, 2008, Proceedings.",
                "count": 79,
                "papers": [
                    "From Capturing Semantics to Semantic Search: A Virtuous Cycle.",
                    "Foundations of RDF Databases.",
                    "Garlik: Semantic Technology for the Consumer.",
                    "Semantic Web Technology for Agent Communication Protocols.",
                    "xOperator - Interconnecting the Semantic Web and Instant Messaging Networks.",
                    "An Ontology for Software Models and Its Practical Implications for Semantic Web Reasoning.",
                    "A Core Ontology for Business Process Analysis.",
                    "Assisting Pictogram Selection with Semantic Interpretation.",
                    "KonneXSALT: First Steps Towards a Semantic Claim Federation Infrastructure.",
                    "Building a National Semantic Web Ontology and Ontology Service Infrastructure -The FinnONTO Approach.",
                    "Creating and Using Geospatial Ontology Time Series in a Semantic Cultural Heritage Portal.",
                    "Semantic Email as a Communication Medium for the Social Semantic Desktop.",
                    "IVEA: An Information Visualization Tool for Personalized Exploratory Document Collection Analysis.",
                    "Building a Semantic Web Image Repository for Biological Research Images.",
                    "Mapping Validation by Probabilistic Reasoning.",
                    "Safe and Economic Re-Use of Ontologies: A Logic-Based Methodology and Tool Support.",
                    "dRDF: Entailment for Domain-Restricted RDF.",
                    "Finite Model Reasoning in DL-Lite.",
                    "Module Extraction and Incremental Classification: A Pragmatic Approach for Ontologies.",
                    "Forgetting Concepts in DL-Lite.",
                    "An Entity Name System (ENS) for the Semantic Web.",
                    "A Functional Semantic Web Architecture.",
                    "Query Answering and Ontology Population: An Inductive Approach.",
                    "Instance Based Clustering of Semantic Web Resources.",
                    "Conceptual Clustering and Its Application to Concept Drift and Novelty Detection.",
                    "Enriching an Ontology with Multilingual Information.",
                    "Rabbit: Developing a Control Natural Language for Authoring Ontologies.",
                    "A Natural Language Query Interface to Structured Information.",
                    "Distinguishing between Instances and Classes in the Wikipedia Taxonomy.",
                    "Two Variations on Ontology Alignment Evaluation: Methodological Issues.",
                    "Putting Ontology Alignment in Context: Usage Scenarios, Deployment and Evaluation in a Library Case.",
                    "CSR: Discovering Subsumption Relations for the Alignment of Ontologies.",
                    "XSPARQL: Traveling between the XML and RDF Worlds - and Avoiding the XSLT Pilgrimage.",
                    "Streaming SPARQL - Extending SPARQL to Process Data Streams.",
                    "The Creation and Evaluation of iSPARQL Strategies for Matchmaking.",
                    "Adding Data Mining Support to SPARQL Via Statistical Relational Learning Methods.",
                    "A Semantic Web Middleware for Virtual Data Integration on the Web.",
                    "Graph Summaries for Subgraph Frequency Estimation.",
                    "Querying Distributed RDF Data Sources with SPARQL.",
                    "Improving Interoperability Using Query Interpretation in Semantic Vector Spaces.",
                    "Hybrid Search: Effectively Combining Keywords and Semantic Searches.",
                    "Combining Fact and Document Retrieval with Spreading Activation for Semantic Desktop Search.",
                    "Q2Semantic: A Lightweight Keyword Interface to Semantic Search.",
                    "Conceptual Situation Spaces for Semantic Situation-Driven Processes.",
                    "Combining SAWSDL, OWL-DL and UDDI for Semantically Enhanced Web Service Discovery.",
                    "Web Service Composition with User Preferences.",
                    "Enhancing Workflow with a Semantic Description of Scientific Intent.",
                    "WSMO Choreography: From Abstract State Machines to Concurrent Transaction Logic.",
                    "WSMO-Lite Annotations for Web Services.",
                    "Semantic Sitemaps: Efficient and Flexible Access to Datasets on the Semantic Web.",
                    "On Storage Policies for Semantic Web Repositories That Support Versioning.",
                    "Semantic Reasoning: A Path to New Possibilities of Personalization.",
                    "An User Interface Adaptation Architecture for Rich Internet Applications.",
                    "OntoGame: Weaving the Semantic Web by Online Games.",
                    "SWING: An Integrated Environment for Geospatial Semantic Web Services.",
                    "Semantic Annotation and Composition of Business Processes with Maestro.",
                    "Learning Highly Structured Semantic Repositories from Relational Databases: .",
                    "Cicero: Tracking Design Rationale in Collaborative Ontology Engineering.",
                    "xOperator - An Extensible Semantic Agent for Instant Messaging Networks.",
                    "LabelTranslator - A Tool to Automatically Localize an Ontology.",
                    "RKBExplorer.com: A Knowledge Driven Infrastructure for Linked Data Providers.",
                    "Semantic Browsing with PowerMagpie.",
                    "Tagster - Tagging-Based Distributed Content Sharing.",
                    "The Web Service Modeling Toolkit.",
                    "Mymory: Enhancing a Semantic Wiki with Context Annotations.",
                    "Pronto: A Non-monotonic Probabilistic Description Logic Reasoner.",
                    "User Profiling for Semantic Browsing in Medical Digital Libraries.",
                    "SWiM - A Semantic Wiki for Mathematical Knowledge Management.",
                    "Integrating Open Sources and Relational Data with SPARQL.",
                    "Previewing Semantic Web Pipes.",
                    "Demo: Visual Programming for the Semantic Desktop with Konduit.",
                    "SCARLET: SemantiC RelAtion DiscoveRy by Harvesting OnLinE OnTologies.",
                    "ODEWiki: A Semantic Wiki That Interoperates with the ODESeW Semantic Portal.",
                    "Simplifying Access to Large-Scale Health Care and Life Sciences Datasets.",
                    "GRISINO - An Integrated Infrastructure for Semantic Web Services, Grid Computing and Intelligent Objects.",
                    "SemSearch: Refining Semantic Search.",
                    "The Combination of Techniques for Automatic Semantic Image Annotation Generation in the IMAGINATION Application.",
                    "WSMX: A Solution for B2B Mediation and Discovery Scenarios.",
                    "Conceptual Spaces in ViCoS."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2008p",
                "sub_name": "Proceedings of the Poster Track of the 5th European Semantic Web Conference (ESWC2008) Tenerife (Spain), 01 - 05 June 2008.",
                "count": 20,
                "papers": [
                    "Service-Finder: Web Scale Semantic Discovery.",
                    "A Benefit Estimation Model for Ontologies.",
                    "A User Centered Annotation Methodology for Multimedia Content.",
                    "ROO: A Tool to Assist Domain Experts with Ontology Construction.",
                    "PervasIve Nursing And docToral Assistant (PINATA).",
                    "QuiKey.",
                    "Interlinking of Resources with Semantics.",
                    "CultureSampo - Finnish Culture on the Semantic Web.",
                    "An Infrastructure for Managing URI Synonymity on the Semantic Web.",
                    "Materialized views in mining ontology instances.",
                    "Development of a Conceptual Map Generation Tool for Exploring Ontologies.",
                    "OPOSSum - An Online Portal to Collect and Share Semantic Service Descriptions.",
                    "A Semantic Web middleware for Virtual Data Integration on the Web.",
                    "Automatic Tag Suggestion Based on Resource Contents.",
                    "MOAT: A Quadripartite Model for Tagging.",
                    "Observational Calculi - Tool for Semantic Web.",
                    "Untangling Domain Concepts in Ontology Design Patterns.",
                    "A Cost-based Optimizer for SPARQL Queries.",
                    "KiWi - Knowledge in a Wiki.",
                    "KOSO: A Metadata Ontology for Knowledge Organization Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2008semma",
                "sub_name": "First International Workshop on Semantic Metadata Management and Applications, SeMMA 2008, Located at the Fifth European Semantic Web Conference (ESWC 2008), Tenerife, Spain, June 2nd, 2008. Proceedings.",
                "count": 7,
                "papers": [
                    "Semantic Hubs for Geological Projects.",
                    "Contextual and Metadata-based Approach for the Semantic Annotation of Heterogeneous Documents.",
                    "Simplifying the Web Service Discovery Process.",
                    "Semantic Metadata Instantiation and Consolidation within an Ontology-based Multimedia Document Management System.",
                    "Combining Context Navigation with Semantic Autocompletion to Solve Problems in Concept Selection.",
                    "Viewing and Querying Topic Maps in terms of RDF.",
                    "Numeric reasoning in the Semantic Web."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2008semsearch",
                "sub_name": "Proceedings of the Workshop on Semantic Search (SemSearch 2008) at the 5th European Semantic Web Conference (ESWC 2008), Tenerife, Spain, June 2nd, 2008.",
                "count": 10,
                "papers": [
                    "Resolving Lexical Ambiguities in Folksonomy Based Search Systems through Common Sense and Personalization.",
                    "Integration of Semantic, Metadata and Image Search Engines with a Text Search Engine for Patent Retrieval.",
                    "Enhancing Semantic Search using N-Levels Document Representation.",
                    "The Interaction Between Automatic Annotation and Query Expansion: a Retrieval Experiment on a Large Cultural Heritage Archive.",
                    "Wikipedia Link Structure and Text Mining for Semantic Relation Extraction.",
                    "QuiKey.",
                    "Microsearch: An Interface for Semantic Search.",
                    "Exploring the Knowledge in Semi Structured Data Sets with Rich Queries.",
                    "Search, Natural Language Generation and Record Display Configuration: Research Directions Stemming From a Digital Library Application Development Experience (Discussion Paper).",
                    "Concept Search: Semantics Enabled Syntactic Search."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2008irsw",
                "sub_name": "Proceedings of the 1st IRSW2008 International Workshop on Identity and Reference on the Semantic Web, Tenerife, Spain, June 2, 2008.",
                "count": 10,
                "papers": [
                    "Entity Coreference Resolution Services in Sindice.com: Identification on the Current Web of Data.",
                    "Handling Instance Coreferencing in the KnoFuss Architecture.",
                    "Managing URI Synonymity to Enable Consistent Reference on the Semantic Web.",
                    "Ontology-based Disambiguation of Spatiotemporal Locations.",
                    "Why URI Declarations? A Comparison of Architectural Approaches.",
                    "Automatic Identity Recognition in The Semantic Web.",
                    "Entity Lifecycle Management for OKKAM.",
                    "The Principle of Self-Description: Identity Through Linking.",
                    "What's the Intention Behind Your Query? A few Observations From a Large Developer Community.",
                    "Entity Identifiers for Lineage Preservation."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ESWC 2007",
        "info": "Innsbruck, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2007",
                "sub_name": "The Semantic Web: Research and Applications, 4th European Semantic Web Conference, ESWC 2007, Innsbruck, Austria, June 3-7, 2007, Proceedings.",
                "count": 60,
                "papers": [
                    "Emerging Sciences of the Internet: Some New Opportunities.",
                    "Design Abstractions for Innovative Web Applications: The Case of the SOA Augmented with Semantics.",
                    "The Lixto Systems Applications in Business Intelligence and Semantic Web.",
                    "Ways to Develop Human-Level Web Intelligence: A Brain Informatics Perspective.",
                    "Empowering Software Maintainers with Semantic Web Technologies.",
                    "Minimal Deductive Systems for RDF.",
                    "Web Service Contracting: Specification and Reasoning with SCIFF.",
                    "Dynamic Service Discovery Through Meta-interactions with Service Providers.",
                    "Two-Phase Web Service Discovery Based on Rich Functional Descriptions.",
                    "A Reasoning Framework for Rule-Based WSML.",
                    "GenTax: A Generic Methodology for Deriving OWL and RDF-S Ontologies from Hierarchical Classifications, Thesauri, and Inconsistent Taxonomies.",
                    "SPARQLeR: Extended Sparql for Semantic Association Discovery.",
                    "Simple Algorithms for Predicate Suggestions Using Similarity and Co-occurrence.",
                    "Learning Disjointness.",
                    "Developing Ontologies for Collaborative Engineering in Mechatronics.",
                    "Media, Politics and the Semantic Web.",
                    "SEEMP: An Semantic Interoperability Infrastructure for e-Government Services in the Employment Sector.",
                    "Combining RDF Vocabularies for Expert Finding.",
                    "Extracting Social Networks Among Various Entities on the Web.",
                    "Towards Semantic Social Networks.",
                    "Knowledge Sharing on the Semantic Web.",
                    "Real-World Reasoning with OWL.",
                    "How to Design Better Ontology Metrics.",
                    "Measuring Inconsistencies in Ontologies.",
                    "Squirrel: An Advanced Semantic Search and Browse Facility.",
                    "User-Centric Faceted Search for Semantic Portals.",
                    "An Approach for Identification of User's Intentions During the Navigation in Semantic Websites.",
                    "A Novel Combination of Answer Set Programming with Description Logics for the Semantic Web.",
                    "Algorithms for Paraconsistent Reasoning with OWL.",
                    "Vague Knowledge Bases for Matchmaking in P2P E-Marketplaces.",
                    "Symbol Grounding for the Semantic Web.",
                    "Ontology-Driven Semantic Ranking for Natural Language Disambiguation in the OntoNL Framework.",
                    "Web-Annotations for Humans and Machines.",
                    "PANTO: A Portable Natural Language Interface to Ontologies.",
                    "Mining the Web Through Verbs: A Case Study.",
                    "What Have Innsbruck and Leipzig in Common? Extracting Semantics from Wiki Content.",
                    "SALT - Semantically Annotated LaTeX for Scientific Publications.",
                    "Annotating Relationships Between Multiple Mixed-Media Digital Objects by Extending Annotea.",
                    "Describing Ontology Applications.",
                    "The SPARQL Query Graph Model for Query Optimization.",
                    "A Unified Approach to Retrieving Web Documents and Semantic Web Data.",
                    "Distributed Knowledge Representation on the Social Semantic Desktop: Named Graphs, Views and Roles in NRL.",
                    "Semantic Process Retrieval with iSPARQL.",
                    "Integrating Folksonomies with the Semantic Web.",
                    "IdentityRank: Named Entity Disambiguation in the Context of the NEWS Project.",
                    "A Study in Empirical and 'Casuistic' Analysis of Ontology Mapping Results.",
                    "Acquisition of OWL DL Axioms from Lexical Resources.",
                    "On Enriching Ajax with Semantics: The Web Personalization Use Case.",
                    "A Semantic Web Service Oriented Framework for Adaptive Learning Environments.",
                    "Semantic Composition of Lecture Subparts for a Personalized e-Learning.",
                    "Caravela: Semantic Content Management with Automatic Information Integration and Categorization (System Description).",
                    "The NExT System: Towards True Dynamic Adaptations of Semantic Web Service Compositions.",
                    "WSMO Studio - A Semantic Web Services Modelling Environment for WSMO.",
                    "An Annotation Tool for Semantic Documents.",
                    "SWHi System Description: A Case Study in Information Retrieval, Inference, and Visualization in the Semantic Web.",
                    "Semantic Turkey : A Semantic Bookmarking Tool (System Description).",
                    "The Web Service Modeling Toolkit - An Integrated Development Environment for Semantic Web Services.",
                    "Understanding Large Volumes of Interconnected Individuals by Visual Exploration.",
                    "System Description: An Orienteering Strategy to Browse Semantically-Enhanced Educational Wiki Pages.",
                    "Efficient Content Creation on the Semantic Web Using Metadata Schemas with Domain Ontology Services (System Description)."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2007sbpm",
                "sub_name": "Proceedings of the Workshop on Semantic Business Process and Product Lifecycle Management SBPM 2007, held in conjunction with the 3rd European Semantic Web Conference (ESWC 2007), Innsbruck, Austria, June 7, 2007.",
                "count": 14,
                "papers": [
                    "Semantic Business Process Management: A Lifecycle Based Requirements Analysis.",
                    "A Survey on Workflow Annotation & Composition Approaches.",
                    "Putting Business Intelligence into Documents.",
                    "Ontology-based Representation of Compliance Requirements for Service Processes.",
                    "A Model-driven Approach for Internal Controls Compliance in Business Processes.",
                    "Semantic Business Process Analysis.",
                    "KISS - Knowledge-Intensive Service Support for Agile Process Management.",
                    "An Ontology for Executable Business Processes.",
                    "Semantic EPC: Enhancing Process Modeling Using Ontology Languages.",
                    "Towards an Ontology for Process Monitoring and Mining.",
                    "Semantically enhanced Business Process Modelling Notation.",
                    "Semantic Business Process Repository.",
                    "A BPMO Based Semantic Business Process Modelling Environment.",
                    "An Ontology-based Modelling Tool for Knowledge-intensive Services."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2007sfsw",
                "sub_name": "Proceedings of the ESWC'07 Workshop on Scripting for the Semantic Web, SFSW 2007, Innsbruck, Austria, May 30, 2007.",
                "count": 17,
                "papers": [
                    "The Web Mashup Scripting Language Profile.",
                    "A Performance and Scalability Metric for Virtual RDF Graphs.",
                    "Explorative Debugging for Rapid Rule Base Development.",
                    "The RDF Book Mashup: From Web APIs to a Web of Data.",
                    "Rapid Ontology-based Web Application Development with JSTL.",
                    "Leveraging Existing Web Frameworks for a SIOC Explorer to Browse Online Social Communities.",
                    "Extensible SPARQL Functions with Embedded Javascript.",
                    "A Lookup Index for Semantic Web Resources.",
                    "JAWS: A Javascript API for the Efficient Testing and Integration of Semantic Web Services.",
                    "Functional Programs as Linked Data.",
                    "An Architecture to Discover and Query Decentralized RDF Data.",
                    "Empowering Moodle with Rules and Semantics.",
                    "A User-friendly Interface to Browse and Find DOAP Project with Doap: store.",
                    "Scripting a SIOC Explorer.",
                    "Ripple: Functional Programs as Linked Data.",
                    "A lookup index for Semantic Web resources.",
                    "Integrating SPARQL Endpoints into Directory Services."
                ]
            },
            {
                "sub_name_abbr": "conf/esws/2007kwepsy",
                "sub_name": "Proceedings of the KWEPSY 2007 Knowledge Web PhD Symposium 2007, Innsbruck, Austria, June 6, 2007.",
                "count": 30,
                "papers": [
                    "Foreword: Title, Preface, Sponsors.",
                    "Caching for Semantic Web Services.",
                    "Towards Novel Techniques for Reasoning in Expressive Description Logics based on Binary Decision Diagrams.",
                    "Process Mediation in Semantic Web Services.",
                    "Scalable Web Service Composition with Partial Matches.",
                    "Improving Email Conversation Efficiency by Enhancing Email with Semantics.",
                    "Towards Distributed Ontologies with Description Logics.",
                    "A Framework for Distributed Reasoning on the Semantic Web Based on Open Answer Set Programming.",
                    "Logic as a Power Tool to Model Negotiation Mechanisms in the Semantic Web Era.",
                    "Improving the Usability of Large Ontologies by Modularization.",
                    "Inferential Ontology Learning.",
                    "Imprecise SPARQL: Towards a Unified Framework for Similarity-Based Semantic Web Tasks.",
                    "Semiautomatic Creation of Semantic Networks.",
                    "Towards Cross-Media Document Annotation.",
                    "Semantic Business Process Modeling.",
                    "Towards Open Ontology Engineering.",
                    "Ontology-based Virtual Data Integration for E-Science Girds.",
                    "Research on Collaborative Information Sharing Systems.",
                    "On the Communication and Coordination Issues of Semantic Web Services using Triple Space Compunting.",
                    "Reasoning with Large Data Sets.",
                    "Towards a Semantic Wiki for Science.",
                    "Ontology-Driven Management of Space Middleware.",
                    "Intelligent Search in a Collection of Video Lectures.",
                    "A Collaborative Semantic Space for Enterprise.",
                    "A Directed Hypergraph Model for RDF.",
                    "Applying Semantic Technologies to the Design of Open Serivce-oriented Architectures for Geospatial Applications.",
                    "Pattern-based Ontology Construction.",
                    "Semantic Group Formation.",
                    "Combining HTN-DL Planning and CBR to compound Semantic Web Services.",
                    "Ontology Mapping Specification Language."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ESWC 2006",
        "info": "Budva, Montenegro",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2006",
                "sub_name": "The Semantic Web: Research and Applications, 3rd European Semantic Web Conference, ESWC 2006, Budva, Montenegro, June 11-14, 2006, Proceedings.",
                "count": 51,
                "papers": [
                    "Where Does It Break? or: Why the Semantic Web Is Not Just \"Research as Usual\".",
                    "Toward Large-Scale Shallow Semantics for Higher-Quality NLP.",
                    "Usability and the Semantic Web.",
                    "Matching Hierarchical Classifications with Attributes.",
                    "An Iterative Algorithm for Ontology Mapping Capable of Using Training Data.",
                    "Community-Driven Ontology Matching.",
                    "Reconciling Concepts and Relations in Heterogeneous Ontologies.",
                    "Empirical Merging of Ontologies - A Proposal of Universal Uncertainty Representation Framework.",
                    "Encoding Classifications into Lightweight Ontologies.",
                    "A Method to Convert Thesauri to SKOS.",
                    "Ontology Engineering Revisited: An Iterative Case Study.",
                    "Towards a Complete OWL Ontology Benchmark.",
                    "Modelling Ontology Evaluation and Validation.",
                    "Benchmark Suites for Improving the RDF(S) Importers and Exporters of Ontology Development Tools.",
                    "Repairing Unsatisfiable Concepts in OWL Ontologies.",
                    "Winnowing Ontologies Based on Application Use.",
                    "Resolving Inconsistencies in Evolving Ontologies.",
                    "Automatic Extraction of Hierarchical Relations from Text.",
                    "An Infrastructure for Acquiring High Quality Semantic Metadata.",
                    "Extracting Instances of Relations from Web Documents Using Redundancy.",
                    "Toward Multi-viewpoint Reasoning with OWL Ontologies.",
                    "Effective Integration of Declarative Rules with External Evaluations for Semantic-Web Reasoning.",
                    "Variable-Strength Conditional Preferences for Ranking Objects in Ontologies.",
                    "A Metamodel and UML Profile for Rule-Extended OWL DL Ontologies.",
                    "Visual Ontology Cleaning: Cognitive Principles and Applicability.",
                    "Rules with Contextually Scoped Negation.",
                    "Beagle++: Semantically Enhanced Searching and Ranking on the Desktop.",
                    "RDFBroker: A Signature-Based High-Performance RDF Store.",
                    "Towards Distributed Information Retrieval in the Semantic Web: Query Reformulation Using the oMAP Framework.",
                    "PowerAqua: Fishing the Semantic Web.",
                    "Information Retrieval in Folksonomies: Search and Ranking.",
                    "DEMO - Design Environment for Metadata Ontologies.",
                    "An Environment for Semi-automatic Annotation of Ontological Knowledge with Linguistic Content.",
                    "Turning the Mouse into a Semantic Device: The seMouse Experience.",
                    "Managing Information Quality in e-Science Using Semantic Web Technology.",
                    "Annotated RDF.",
                    "A Multilingual/Multimedia Lexicon Model for Ontologies.",
                    "Semantic Network Analysis of Ontologies.",
                    "Content Aggregation on Knowledge Bases Using Graph Clustering.",
                    "Dynamic Assembly of Personalized Learning Content on the Semantic Web.",
                    "Interactive Ontology-Based User Knowledge Acquisition: A Case Study.",
                    "Matching Semantic Service Descriptions with Local Closed-World Reasoning.",
                    "The Web Service Modeling Language WSML: An Overview.",
                    "On the Semantics of Functional Descriptions of Web Services.",
                    "A Minimalist Approach to Semantic Annotations for Web Processes Compositions.",
                    "Protocol Mediation for Adaptation in Semantic Web Services.",
                    "Ideas and Improvements for Semantic Wikis.",
                    "WikiFactory: An Ontology-Based Application for Creating Domain-Oriented Wikis.",
                    "Using Semantics to Enhance the Blogging Experience.",
                    "WSTO: A Classification-Based Ontology for Managing Trust in Semantic Web Services.",
                    "Semantic Web Policies - A Discussion of Requirements and Research Issues."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ESWC 2005",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2005",
                "sub_name": "The Semantic Web: Research and Applications, Second European Semantic Web Conference, ESWC 2005, Heraklion, Crete, Greece, May 29 - June 1, 2005, Proceedings.",
                "count": 50,
                "papers": [
                    "Automatic Location of Services.",
                    "Feta: A Light-Weight Architecture for User Oriented Semantic Service Discovery.",
                    "Optimally Distributing Interactions Between Composed Semantic Web Services.",
                    "A POP-Based Replanning Agent for Automatic Web Service Composition.",
                    "Process-Level Composition of Executable Web Services: \"On-the-fly\" Versus \"Once-for-all\" Composition.",
                    "The OWL-S Editor - A Development Tool for Semantic Web Services.",
                    "Temporal RDF.",
                    "Multilingual RDF and OWL.",
                    "RDFSculpt: Managing RDF Schemas Under Set-Like Semantics.",
                    "REDD: An Algorithm for Redundancy Detection in RDF Models.",
                    "OWL-Eu: Adding Customised Datatypes into OWL.",
                    "Towards a Fuzzy Description Logic for the Semantic Web (Preliminary Report).",
                    "Consistent Evolution of OWL Ontologies.",
                    "Extending HCONE-Merge by Approximating the Intended Meaning of Ontology Concepts Iteratively.",
                    "Soundness of Schema Matching Methods.",
                    "Debugging and Semantic Clarification by Pinpointing.",
                    "An Argumentation Ontology for DIstributed, Loosely-controlled and evolvInG Engineering processes of oNTologies (DILIGENT).",
                    "Towards an Ontology-Based Distributed Architecture for Paid Content.",
                    "Efficient Semantic Matching.",
                    "Ontology-Based Policy Specification and Management.",
                    "Web Explanations for Semantic Heterogeneity Discovery.",
                    "Approximating Description Logic Classification for Semantic Web Reasoning.",
                    "AIS and Semantic Query.",
                    "Querying RDF Data from a Graph Database Perspective.",
                    "DRAGO: Distributed Reasoning Architecture for the Semantic Web.",
                    "Dually Structured Concepts in the Semantic Web: Answer Set Programming Approach.",
                    "Nonmonotonic Ontological and Rule-Based Reasoning with Extended Conceptual Logic Programs.",
                    "Product Information Meta-search Framework for Electronic Commerce Through Ontology Mapping.",
                    "Multiple Vehicles for a Semantic Navigation Across Hyper-environments.",
                    "Activity Based Metadata for Semantic Desktop Search.",
                    "An Ontology-Based Information Retrieval Model.",
                    "Knowledge Sharing by Information Retrieval in the Semantic Web.",
                    "Collaborative and Usage-Driven Evolution of Personal Ontologies.",
                    "Towards Semantically-Interlinked Online Communities.",
                    "The Personal Publication Reader: Illustrating Web Data Extraction, Personalization and Reasoning for the Semantic Web.",
                    "Generating Tailored Textual Summaries from Ontologies.",
                    "AquaLog: An Ontology-Portable Question Answering System for the Semantic Web.",
                    "Lexically Evaluating Ontology Triples Generated Automatically from Texts.",
                    "Pedro Ontology Services: A Framework for Rapid Ontology Markup.",
                    "Semantic Annotation of Images and Videos for Multimedia Analysis.",
                    "RELFIN - Topic Discovery for Ontology Enhancement and Annotation.",
                    "Semantic Web-Based Document: Editing and Browsing in AktiveDoc.",
                    "Semantic-Based Automated Composition of Distributed Learning Objects for Personalized E-Learning.",
                    "Orchestration of Semantic Web Services for Large-Scale Document Annotation.",
                    "Monitoring Research Collaborations Using Semantic Web Technologies.",
                    "Enabling Real World Semantic Web Applications Through a Coordination Middleware.",
                    "A Semantic Service Environment: A Case Study in Bioinformatics.",
                    "Towards B2B Integration in Telecommunications with Semantic Web Services.",
                    "SWebB: Semantic Web Browsing.",
                    "The Semantic Grid: Past, Present and Future."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ESWS 2004",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esws/2004",
                "sub_name": "The Semantic Web: Research and Applications, First European Semantic Web Symposium, ESWS 2004, Heraklion, Crete, Greece, May 10-12, 2004, Proceedings.",
                "count": 33,
                "papers": [
                    "Towards On-the-Fly Ontology Construction - Focusing on Ontology Quality Improvement.",
                    "OntoEdit Empowering SWAP: a Case Study in Supporting DIstributed, Loosely-Controlled and evolvInG Engineering of oNTologies (DILIGENT).",
                    "A Protégé Plug-In for Ontology Extraction from Text Based on Linguistic Analysis.",
                    "Formal Support for Representing and Automating Semantic Interoperability.",
                    "S-Match: an Algorithm and an Implementation of Semantic Matching.",
                    "Ontology Mapping - An Integrated Approach.",
                    "Application of Ontology Techniques to View-Based Semantic Search and Browsing.",
                    "Active Ontologies for Data Source Queries.",
                    "Knowledge Discovery in an Agents Environment.",
                    "The HCONE Approach to Ontology Merging.",
                    "Question Answering Towards Automatic Augmentations of Ontology Instances.",
                    "The SCAM Framework: Helping Semantic Web Applications to Store and Access Metadata.",
                    "Publish/Subscribe for RDF-based P2P Networks.",
                    "Streaming OWL DL.",
                    "Mathematics on the (Semantic) NET.",
                    "Approaches to Semantic Web Services: an Overview and Comparisons.",
                    "OWL-S Semantics of Security Web Services: a Case Study.",
                    "Directory Services for Incremental Service Integration.",
                    "A Framework for Automated Service Composition in Service-Oriented Architectures.",
                    "Reusing Petri Nets Through the Semantic Web.",
                    "Methods for Porting Resources to the Semantic Web.",
                    "Learning to Harvest Information for the Semantic Web.",
                    "Reverse Engineering of Relational Databases to Ontologies.",
                    "No Registration Needed: How to Use Declarative Policies and Negotiation to Access Sensitive Resources on the Semantic Web.",
                    "Semantic Annotation Support in the Absence of Consensus.",
                    "Uncertainty in Knowledge Provenance.",
                    "Collaborative Semantic Web Browsing with Magpie.",
                    "Toward a Framework for Semantic Organizational Information Portal.",
                    "CS AKTiveSpace: Building a Semantic Web Application.",
                    "Cultural Heritage and the Semantic Web.",
                    "Neptuno: Semantic Web Technologies for a Digital Newspaper Archive.",
                    "MIKSI - A Semantic and Service Oriented Integration Platform.",
                    "Semantic Web Technologies for Economic and Financial Information Management."
                ]
            }
        ]
    }
]