[
    {
        "name": "I&M",
        "year": "2022",
        "info": "Volume 59: 2022",
        "count": 28,
        "papers": [
            "Guanxi circles and light entrepreneurship in social commerce: The roles of mass entrepreneurship climate and technology affordances.",
            "Antecedents and consequences of explicit and implicit attitudes toward digital piracy.",
            "An assimilation maturity model for IT governance and auditing.",
            "Psychological empowerment and user satisfaction: Investigating the influences of online brand community participation.",
            "Scratch my back and I'll scratch yours: The impact of user effort and recommendation agent effort on perceived recommendation agent quality.",
            "IS diffusion: A dynamic control and stakeholder perspective.",
            "Should we teach in hybrid mode or fully online? A theory and empirical investigation on the service-profit chain in MBAs.",
            "A neo-institutional perspective on the establishment of information security knowledge sharing practices.",
            "Beyond adaptive security coping behaviors: Theory and empirical evidence.",
            "Online information privacy and price: A theoretical model and empirical tests.",
            "The impact of E-commerce capabilities on online retailer performance: Examining the role of timing of adoption.",
            "Deliberate news consumption through the quantified self and the self-regulatory process.",
            "Discovering the interplay between defensive avoidance and continued use intention of anti-malware software among experienced home users: A moderated mediation model.",
            "Predicting aspect-based sentiment using deep learning and information visualization: The impact of COVID-19 on the airline industry.",
            "How are social and mass media different in relation to the stock market? A study on topic coverage and predictive value.",
            "The impact of IT spillovers on technical efficiency: The role of IT intensity and supply chain relationships.",
            "Impact of digital leadership capability on innovation performance: The role of platform digitization capability.",
            "Linguistic understandability, signal observability, funding opportunities, and crowdfunding campaigns.",
            "Legacy information system replacement: Pursuing quality design of operational information systems.",
            "From the Side of Both Relationship Initiator and Responder: The Importance of Look and Geographical Distance in Online Dating.",
            "How Can Our Tweets Go Viral? Point-Process Modelling of Brand Content.",
            "Can people experience romantic love for artificial intelligence? An empirical study of intelligent assistants.",
            "The Effect of Similarity and Dissimilarity on Information Network Formation and Their Implications in Accurate Information Identification.",
            "The effect of TV drama piracy: An analysis of digital piracy users, internet buzz, and TV drama viewership.",
            "Abusive supervision and cyberloafing: A moderated moderation model of moral disengagement and negative reciprocity beliefs.",
            "Managing digital piracy under consumer valuation uncertainty: The roles of product demonstrations and antipiracy measures.",
            "Applying cognitive evaluation theory to analyze the impact of gamification mechanics on user engagement in resource recycling.",
            "A growing or depreciating love? Linking time with customer satisfaction through online reviews."
        ]
    },
    {
        "name": "I&M",
        "year": "2021",
        "info": "Volume 58: 2021",
        "count": 121,
        "papers": [
            "A resource-based perspective of value generation through enterprise architecture management.",
            "Mitigating resource dependence on internet visibility providers: Exploring complementarity effects in the positioning of small hotels on online intermediaries.",
            "The role of perceived integration in WeChat usages for seeking information and sharing comments: A social capital perspective.",
            "How does scarcity promotion lead to impulse purchase in the online market? A field experiment.",
            "The effect of Fair information practices and data collection methods on privacy-related behaviors: A study of Mobile apps.",
            "Why do citizens participate on government social media accounts during crises? A civic voluntarism perspective.",
            "Mediation role of business value and strategy in firm performance of organizations using software-as-a-service enterprise applications.",
            "How does IT identity affect individuals' use behaviors associated with personal health devices (PHDs)? An empirical study.",
            "DATA BREACH MANAGEMENT: AN INTEGRATED RISK MODEL.",
            "How shall we meet? Understanding the importance of meeting mode capabilities for different meeting objectives.",
            "Trust calibration of automated security IT artifacts: A multi-domain study of phishing-website detection tools.",
            "Engagement in online health communities: Channel expansion and social exchanges.",
            "Enterprise social media and cyber-slacking: A Kahn's model perspective.",
            "Privacy and the Internet of Things-An experiment in discrete choice.",
            "Effects of emotional attachment on mobile health-monitoring service usage: An affect transfer perspective.",
            "No trespassing: exploring privacy boundaries in personalized advertisement and its effects on ad attitude and purchase intentions on social media.",
            "Enhancing healthcare professional and caregiving staff informedness with data analytics for chronic disease management.",
            "Heroes, contracts, cooperation, and processes: Changes in collaboration in a large enterprise systems project.",
            "The effect of content depth and deviation on online review helpfulness: Evidence from double-hurdle model.",
            "Zooming in the impacts of merchants' participation in transformation from online flash sale to mixed sale e-commerce platform.",
            "The interplay between brand relationship norms and ease of sharing on electronic word-of-mouth and willingness to pay.",
            "Cyberbullying on social networking sites: A literature review and future research directions.",
            "A quantitative and qualitative study of the link between business process management and digital innovation.",
            "Cross-fertilization for routine reconfiguration in IT-enabled organizational transformation.",
            "The association between excessive social media use and distraction: An eye movement tracking study.",
            "Understanding trust in ms-commerce: The roles of reported experience, linguistic style, profile photo, emotional, and cognitive trust.",
            "Activity awareness, social presence, and motivation in distributed virtual teams.",
            "Understanding the emotional and informational influence on customer knowledge contribution through quantitative content analysis.",
            "DNCP: An attention-based deep learning approach enhanced with attractiveness and timeliness of News for online news click prediction.",
            "Enacting formal controls in information system development: Process guidance and goal importance.",
            "Distributed ledger technology: Its evolutionary path and the road ahead.",
            "Role stressors, job satisfaction, and employee creativity: The cross-level moderating role of social media use within teams.",
            "The role of deterrability for the effect of multi-level sanctions on information security policy compliance: Results of a multigroup analysis.",
            "The role of informational mechanisms in the adoption of Green IS to achieve eco-sustainability in municipalities.",
            "Short-term rental and its regulations on the home-sharing platform.",
            "Which factors affect the scientific impact of review papers in IS research? A scientometric study.",
            "Telecommuting and job outcomes: A moderated mediation model of system use, software quality, and social Exchange.",
            "Artificial intelligence capability: Conceptualization, measurement calibration, and empirical study on its impact on organizational creativity and firm performance.",
            "The path to people's responses to native advertising in social media: A perspective of self-presentational desire.",
            "The impact of Mobile ICT on national productivity in developed and developing countries.",
            "A framework of blockchain technology adoption: An investigation of challenges and expected value.",
            "Calling out fake online reviews through robust epistemic belief.",
            "Post-purchase warranty and knowledge monetization: Evidence from a paid-knowledge platform.",
            "Good for use, but better for choice: A relative model of competing social networking services.",
            "Identifying comparable entities from online question-answering contents.",
            "Can financial incentives help with the struggle for security policy compliance?",
            "Streams of digital data and competitive advantage: The mediation effects of process efficiency and product effectiveness.",
            "Online social games: The effect of social comparison elements on continuance behaviour.",
            "Intention to reuse AR-based apps: The combined role of the sense of immersion, product presence and perceived realism.",
            "Coping behaviors in short message service (SMS)-based disaster alert systems: From the lens of protection motivation theory as elaboration likelihood.",
            "Personalizing 3D virtual fashion stores: Exploring modularity with a typology of atmospherics based on user input.",
            "Social media use and work efficiency: Insights from the theory of communication visibility.",
            "Value creation and appropriation of software vendors: A digital innovation model for cloud computing.",
            "Contextualizing the relationship between Gender and Computer Self-efficacy: An Empirical study from India.",
            "Effect of an agency's resources on the implementation of open government data.",
            "Between online and offline markets: A structural estimation of consumer demand.",
            "Portfolio effects of knowledge management strategies on firm performance: Complementarity or substitutability?",
            "The platform executive: Technology shaping of executive cognition during digital service innovation.",
            "What drives consumers to adopt a sharing platform: An integrated model of value-based and transaction cost theories.",
            "Influence of self-efficacy on execution discrepancy and decision performance.",
            "Animation as a dynamic visualization technique for improving process model comprehension.",
            "How do Virtual Badges Incentivize Voluntary Contributions to Online Communities?",
            "Preventing relapse to information technology addiction through weakening reinforcement: A self-regulation perspective.",
            "A study of social networking site use from a three-pronged security and privacy threat assessment perspective.",
            "Understanding value co-creation in virtual communities: The key role of complementarities and trade-offs.",
            "BRM: A methodology for improving the practical relevance of belief-based information technology usage theories.",
            "Influence of content and creator characteristics on sharing disaster-related information on social media.",
            "Choosing Response Strategies in Social Media Crisis Communication: An Evolutionary Game Theory Perspective.",
            "Examining gifting behavior on live streaming platforms: An identity-based motivation model.",
            "Building dynamic capabilities by leveraging big data analytics: The role of organizational inertia.",
            "The strategic role of CIOs in IT controls: IT control weaknesses and CIO turnover.",
            "Information technology and service diversification: A cross-level study in different innovation environments.",
            "What facilitates and constrains value co-creation in online communities: A sociomateriality perspective.",
            "How online health community participation affects physicians' performance in hospitals: Empirical evidence from China.",
            "Investigating perceived risks and benefits of information privacy disclosure in IT-enabled ride-sharing.",
            "PACIS 2019: Emerging technology, business, and application in digital economy.",
            "The effect of different social media marketing channels and events on movie box office: An elaboration likelihood model perspective.",
            "Local learning from municipal ransomware attacks: A geographically weighted analysis.",
            "Predicting product adoption intentions: An integrated behavioral model-inspired multiview learning approach.",
            "Construing online consumers' information privacy decisions: The impact of psychological distance.",
            "Pathways to individual performance: Examining the interplay between knowledge bases and repository kms use.",
            "Informational cues or content? Examining project funding decisions by crowdfunders.",
            "When does social desirability become a problem? Detection and reduction of social desirability bias in information systems research.",
            "Impact of enjoyment on the usage continuance intention of video-on-demand services.",
            "What results in more sample downloads? The role of social learning and individual learning with software category.",
            "Acceptance of technological agency: Beyond the perception of utilitarian value.",
            "Platform-based mechanisms, institutional trust, and continuous use intention: The moderating role of perceived effectiveness of sharing economy institutional mechanisms.",
            "The Paradox of Word-of-Mouth in Social Commerce: Exploring the Juxtaposed Impacts of Source Credibility and Information Quality on SWOM Spreading.",
            "Informing cybersecurity strategic commitment through top management perceptions: The role of institutional pressures.",
            "Live streaming commerce and consumers' purchase intention: An uncertainty reduction perspective.",
            "An appraisal mechanism for a social marketplace.",
            "A Dual-role Trust Model for Social Commerce: A Guanxi Perspective.",
            "Decisional guidance for detecting discriminatory data analytics recommendations.",
            "Intra-platform competition: the role of innovative and refinement evolution in app success.",
            "Control choices and enactments in IS development projects: Implications for legitimacy perceptions and compliance intentions.",
            "Online channel expansion strategy: An empirical investigation.",
            "Medical practitioner's adoption of intelligent clinical diagnostic decision support systems: A mixed-methods study.",
            "Constructing information technology (IT) portfolios to achieve enterprise strategic goals in multi-business unit firms.",
            "Herd behavior in information security decision-making.",
            "Understanding the bi-directional message diffusion mechanism in the context of IT trends and current social issues.",
            "The devil is in the details: The effect of nonverbal cues on crowdfunding success.",
            "The role of legitimacy and reputation judgments in users' selection of service providers on sharing economy platforms.",
            "The coordination of workarounds: Insights from responses to misfits between local realities and a mandated global enterprise system.",
            "The value of local sporting clubs' websites.",
            "When products receive reviews across platforms: Studying the platform concentration of electronic word-of-mouth.",
            "Absorbed in technology but digitally overloaded: Interplay effects on gig workers' burnout and creativity.",
            "Appropriation of accounting information system use under the new IFRS: Impacts on accounting process performance.",
            "Balance cues of online-offline channel integration: Considering the moderating role of customer's showrooming motivation.",
            "A social investing approach for portfolio recommendation.",
            "A cross-country analysis of the determinants of customer recommendation intentions for over-the-top (OTT) platforms.",
            "Regulating new digital market and its effects on the incumbent market: Investigation of online peer-to-peer short-term rental.",
            "Information technology issues and challenges of the globe: the world IT project.",
            "No Rose without a thorn: Board IT competence and market reactions to operational IT failures.",
            "Understanding how the semantic features of contents influence the diffusion of government microblogs: Moderating role of content topics.",
            "Generativity and the paradox of stability and flexibility in a platform architecture: A case of the Oracle Cloud Platform.",
            "Does certainty tone matter? Effects of review certainty, reviewer characteristics, and organizational niche width on review usefulness.",
            "Catch them all: Impacts of location-based augmented reality mobile applications on local businesses.",
            "Developing augmented reality business models for SMEs in tourism.",
            "The effects of the format of two-sided online reviews: A linguistic perspective.",
            "Calculus interdependency, personality contingency, and causal asymmetry: Toward a configurational privacy calculus model of information disclosure.",
            "Explore for a day? Generating personalized itineraries that fit spatial heterogeneity of tourist attractions."
        ]
    },
    {
        "name": "I&M",
        "year": "2020",
        "info": "Volume 57: 2020",
        "count": 115,
        "papers": [
            "Big data and business analytics: A research agenda for realizing business value.",
            "'Big time': An examination of temporal complexity and business value in analytics.",
            "Business analytics for strategic management: Identifying and assessing corporate challenges via topic modeling.",
            "Business value of big data analytics: A systems-theoretic approach and empirical test.",
            "Acceptance of text-mining systems: The signaling role of information quality.",
            "Leveraging internet of things and big data analytics initiatives in European and American firms: Is data quality a way to extract business value?",
            "Factors influencing effective use of big data: A research framework.",
            "Actualizing big data analytics affordances: A revelatory case study.",
            "Dissecting emotion and user influence in social media communities: An interaction modeling approach.",
            "How do knowledge management resources and capabilities pay off in short term and long term?",
            "Toward a refined conceptualization of IS discontinuance: Reflection on the past and a way forward.",
            "How to perform and report an impactful analysis using partial least squares: Guidelines for confirmatory and explanatory IS research.",
            "Exploring the relationship between big data analytics capability and competitive performance: The mediating roles of dynamic and operational capabilities.",
            "Do (how) digital natives adopt a new technology differently than digital immigrants? A longitudinal study.",
            "An elaboration likelihood model of consumer respond action to facebook second-hand marketplace: Impulsiveness as a moderator.",
            "Building social translucence in a crowdsourcing process: A case study of Miui.com.",
            "Machines as teammates: A research agenda on AI in team collaboration.",
            "The relation between BPM culture, BPM methods, and process performance: Evidence from quantitative field studies.",
            "How behaviors on social network sites and online social capital influence social commerce intentions.",
            "Corrigendum to \"Deploying internal knowledge portals: Three major challenges\" [Inf. Manage. 54(4) 491-505].",
            "Corrigendum to \"On the time lag of the effect of network position on service performance in software service networks\" [Inf. Manage. 56(7) (2015) 103149].",
            "The effect of intention analysis-based fraud detection systems in repeated supply Chain quality inspection: A context of learning and contract.",
            "Manipulating user resistance to large-scale information systems through influence tactics.",
            "What drives public agencies to participate in open government data initiatives? an innovation resource perspective.",
            "Anger or fear? Effects of discrete emotions on employee's computer-related deviant behavior.",
            "Examining the effects of social influence in pre-adoption phase and initial post-adoption phase in the healthcare context.",
            "Social media-based innovation: A review of trends and a research agenda.",
            "Service quality, perceived value, and citizens' continuous-use intention regarding e-government: Empirical evidence from China.",
            "IT centrality, IT management model, and contribution of the IT function to organizational performance: A study in Canadian hospitals.",
            "Disentangling utilitarian and hedonic consumption behavior in online shopping: An expectation disconfirmation perspective.",
            "How social-media-enabled co-creation between customers and the firm drives business value? The perspective of organizational learning and social Capital.",
            "Evolution of information systems research: Insights from topic modeling.",
            "Exploring the conditions of success in e-libraries in the higher education context through the lens of the social learning theory.",
            "Hierarchical business value of information technology: Toward a digital innovation value chain.",
            "Looking at both sides of relationship dynamics in virtual communities: A social exchange theoretical lens.",
            "Tacit knowledge sharing in IT R&D teams: Nonlinear evolutionary theoretical perspective.",
            "Effects of sanctions, moral beliefs, and neutralization on information security policy violations across cultures.",
            "Development and evaluation of a software-mediated process assessment method for IT service management.",
            "Mutual influences between message volume and emotion intensity on emerging infectious diseases: An investigation with microblog data.",
            "Mapping Sentiments to Themes of Customer reactions on Social Media during a Security Hack: A Justice Theory Perspective.",
            "A text analytics framework for automated communication pattern analysis.",
            "Recognizing CEO personality and its impact on business performance: Mining linguistic cues from social media.",
            "How mood affects the stock market: Empirical evidence from microblogs.",
            "Industry classification with online resume big data: A design science approach.",
            "To outsource or not: The impact of information leakage risk on information security strategy.",
            "Robot acceptance model for care (RAM-care): A principled approach to the intention to use care robots.",
            "Experiencing immersive virtual reality in museums.",
            "Online service qualities in the multistage process and patients' compliments: A transaction cycle perspective.",
            "Managers' noticing of new organizational IT and influences of IT attributes.",
            "Physician voice characteristics and patient satisfaction in online health consultation.",
            "Pathways to being CIO: The role of background revisited.",
            "Effects of the design of mobile security notifications and mobile app usability on users' security perceptions and continued use intention.",
            "Strategy archetypes for digital transformation: Defining meta objectives using business process management.",
            "What drives the sales of paid knowledge products? A two-phase approach.",
            "IT vendors' legitimation strategies and market share: The case of EMR systems.",
            "Tribute to Professor Edgar H. Sibley and his contributions to the IS discipline.",
            "Editorial on International Conference on Information Resources Management 2018.",
            "Outsourcing success in the eye of the beholder: Examining the impact of expectation confirmation theory on IT outsourcing.",
            "Understanding users' dynamic behavior in a free trial of IT services: A three-stage model.",
            "Gaming the system: The effects of social capital as a resource for virtual team members.",
            "Inadequate Information Systems and Organizational Citizenship Behavior.",
            "Examining end users' ability to select business services: A conceptual framework and an empirical study.",
            "Variation in the effect of system usage and individual impact: A meta-regression of empirical findings.",
            "Online review manipulation by asymmetrical firms: Is a firm's manipulation of online reviews always detrimental to its competitor?",
            "What Are We Talking About When We Talk About Technology Pivots? - A Delphi Study.",
            "Understanding How People Select Social Networking Services: Media Trait, Social Influences and Situational Factors.",
            "See now, act now: How to interact with customers to enhance social commerce engagement?",
            "Does the source of external knowledge matter? Examining the role of customer co-creation and partner sourcing in knowledge creation and innovation.",
            "Cybersecurity vulnerability management: A conceptual ontology and cyber intelligence alert system.",
            "Risk factors of enterprise internal control under the internet of things governance: A qualitative research approach.",
            "Task support of electronic patient care report (ePCR) systems in emergency medical services: An elaboration likelihood model lens.",
            "Complements and substitutes in online product recommendations: The differential effects on consumers' willingness to pay.",
            "Better the devil you know: Inter-organizational information technology and network social capital in coopetition networks.",
            "Resolving paradoxes in IT success through IT ambidexterity: The moderating role of uncertain environments.",
            "\"What can I(S) do for you?\": How technology enables service providers to elicit customers' preferences and deliver personalized service.",
            "Customers' learning process during product customization: The case of online configuration tool kits.",
            "One size does not fit all: Rethinking recognition system design for behaviorally heterogeneous online communities.",
            "A social recommendation approach for reward-based crowdfunding campaigns.",
            "Market reaction to the announcement of an information technology investment: Evidence from Indonesia.",
            "Moral obligation in online social interaction: Clicking the \"like\" button.",
            "What drives trust transfer from web to mobile payment services? The dual effects of perceived entitativity.",
            "How does social network diversity affect users' lurking intention toward social network services? A role perspective.",
            "Impact of a firm's physical and knowledge capital intensities on its selection of a cloud computing deployment model.",
            "Impact of IT integration on the firm's knowledge absorption and desorption.",
            "An examination of the diffusion of prepaid mobile telephony in selected emerging markets and developing economies.",
            "Discovering event episodes from sequences of online news articles: A time-adjoining frequent itemset-based clustering method.",
            "What reveals about depression level? The role of multimodal features at the level of interview questions.",
            "The differential impact of types of app innovation on customer evaluation.",
            "Assessing the product review helpfulness: Affective-Cognitive evaluation and the moderating effect of feedback mechanism.",
            "The role of information governance in big data analytics driven innovation.",
            "Firm actions, user engagement, and firm performance: A mediated model with evidences from internet service firms.",
            "Big data and firm performance: The roles of market-directed capabilities and business strategy.",
            "The impact of psychological contract under- and over-fulfillment on client citizenship behaviors in Enterprise systems projects: From the client's perspective.",
            "Research on radical innovation implementation through knowledge reuse based on knowledge flow: A case study on academic teams.",
            "An imposed etic approach with Schwartz polar dimensions to explore cross-cultural use of social network services.",
            "Designing scalability in required in-class introductory college courses.",
            "Impact of technostress on productivity from the theoretical perspective of appraisal and coping processes.",
            "Dual effects of social support seeking in patient-centric online healthcare communities: A longitudinal study.",
            "Back to the future: Actualizing technology affordances to transform Emperor Qin's terracotta warriors Museum.",
            "Can online user reviews be more helpful? Evaluating and improving ranking approaches.",
            "Information Management Challenges and the Adverse Consequences of Using Reverse Auctions.",
            "Competitive Pricing Strategies for Software and SaaS Products.",
            "The bittersweet escape to information technology: An investigation of the stress paradox of social network sites.",
            "Assessing cloud computing value in firms through socio-technical determinants.",
            "Herd behavior in social media: The role of Facebook likes, strength of ties, and expertise.",
            "Disentangling the effects of efficacy-facilitating informational support on health resilience in online health communities based on phrase-level text analysis.",
            "Managerial responses to online reviews under budget constraints: Whom to target and how.",
            "EHR application portfolio and hospital performance: Effects across hospitals with varying administrative scale and clinical complexity.",
            "The emergence of a Fintech Ecosystem: A case study of the Vizag Fintech Valley in India.",
            "Supply chain information integration and its impact on the operational performance of manufacturing firms in Malaysia.",
            "Predicting shareholder litigation on insider trading from financial text: An interpretable deep learning approach.",
            "Gazing at the stars is not enough, look at the specific word entropy, too!",
            "The dual role of IT capabilities in the development of digital products and services.",
            "Omnichannel retailing: The role of situational involvement in facilitating consumer experiences.",
            "Does it pay to align a firm's competitive strategy with its industry IT strategic role?"
        ]
    },
    {
        "name": "I&M",
        "year": "2019",
        "info": "Volume 56: 2019",
        "count": 85,
        "papers": [
            "A theoretical framework to improve the quality of manually acquired data.",
            "Framing norms in online communities.",
            "Do reviewers' words affect predicting their helpfulness ratings? Locating helpful reviewers by linguistics styles.",
            "Gamification: A key determinant of massive open online course (MOOC) success.",
            "A study of IS assets, IS ambidexterity, and IS alignment: the dynamic managerial capability perspective.",
            "Why funders invest in crowdfunding projects: Role of trust from the dual-process perspective.",
            "Understanding the impact of perceived visual aesthetics on user evaluations: An emotional perspective.",
            "Understanding brand fan page followers' discontinuance motivations: A mixed-method study.",
            "Impact of anonymity on roles of personal and group identities in online communities.",
            "Managing the e-commerce disruption with IT-based innovations: Insights from strategic renewal perspectives.",
            "Social Commerce and Social Media: Behaviors in the New Service Economy.",
            "Product engagement and identity signaling: The role of likes in social commerce for fashion products.",
            "How do social commerce-IT capabilities influence firm performance? Theory and empirical evidence.",
            "The effect of online reviews on product sales: A joint sentiment-topic analysis.",
            "Product recommendation in online social networking communities: An empirical study of antecedents and a mediator.",
            "A dynamic model of electric vehicle adoption: The role of social commerce in new transportation.",
            "Understanding the interplay of social commerce affordances and swift guanxi: An empirical study.",
            "With a little help from my friends: Cultivating serendipity in online shopping environments.",
            "How do product recommendations affect impulse buying? An empirical study on WeChat social commerce.",
            "Integrative qualities and dimensions of social commerce: Toward a unified view.",
            "The cultural impact on social commerce: A sentiment analysis on Yelp ethnic restaurant reviews.",
            "Information sharing and the impact of shutdown policy in a supply chain with market disruption risk in the social media era.",
            "Understanding the role of technology attractiveness in promoting social commerce engagement: Moderating effect of personal interest.",
            "A longitudinal study of leader influence in sustaining an online community.",
            "Moderating effects of time pressure on the relationship between perceived value and purchase intention in social E-commerce sales promotion: Considering the impact of product involvement.",
            "An empirical study of payment technologies, the psychology of consumption, and spending behavior in a retailing context.",
            "Exploring vendor capabilities in the cloud environment: A case study of Alibaba Cloud Computing.",
            "Does culture influence m-banking use and individual performance?",
            "Reconceptualizing knowledge networks for enterprise systems implementation: incorporating domain expertise of knowledge sources and knowledge flow intensity.",
            "An app a day keeps a customer connected: Explicating loyalty to brands and branded applications through the lens of affordance and service-dominant logic.",
            "Examining business value of customer relationship management systems: IT usage and two-stage model perspectives.",
            "A systematic review on cross-cultural information systems research: Evidence from the last decade.",
            "Scores vs. stars: A regression discontinuity study of online consumer reviews.",
            "\"The more options, the better?\" Investigating the impact of the number of options on backers' decisions in reward-based crowdfunding projects.",
            "Organizational readiness for digital innovation: Development and empirical calibration of a construct.",
            "Modeling online user behaviors with competitive interactions.",
            "Human Flesh Search: what did we find?",
            "Decisional factors leading to the reuse of an on-demand ride service.",
            "Configuration information system architecture: Insights from applied action design research.",
            "Information technologies and downsizing: Examining their impact on economic performance.",
            "Using discussion logic in analyzing online group discussions: A text mining approach.",
            "Examination of community identification and interpersonal trust on continuous use intention: Evidence from experienced online community members.",
            "A chronological review of empirical research on personal information privacy concerns: An analysis of contexts and research constructs.",
            "The mediating role of artifacts in position practice at work: Examples from a project-based context.",
            "Effective organizational improvisation in information systems development: Insights from the Tencent messaging system development.",
            "Using social power and influence to mobilise the supply chain into knowledge sharing: A case in insurance.",
            "Understanding the success of strategic IT benchmarking - Exploring the role of the individual level.",
            "A dual-attitude model of system use: The effect of explicit and implicit attitudes.",
            "The faster the better? Innovation speed and user interest in open source software.",
            "Information security breaches and IT security investments: Impacts on competitors.",
            "Falsifying and withholding: exploring individuals' contextual privacy-related decision-making.",
            "Predicting web site audience demographics using content and design cues.",
            "The Acceptance of Justifications among Shadow IT Users and Nonusers - An Empirical Analysis.",
            "Smartphone use during the leisure theme park visit experience: The role of contextual factors.",
            "Espoused cultural values as antecedents of individuals' threat and coping appraisal toward protective information technologies: Study of U.S. and Ghana.",
            "Do IT freelancers increase their entrepreneurial behavior and performance by using IT self-efficacy and social capital? Evidence from Bangladesh.",
            "Refining and extending task-technology fit theory: Creation of two task-technology fit scales and empirical clarification of the construct.",
            "Role of big data management in enhancing big data decision-making capability and quality among Chinese firms: A dynamic capabilities view.",
            "How social media usage affects employees' job satisfaction and turnover intention: An empirical study in China.",
            "Enterprise system programs: Goal setting and cooperation in the integration team.",
            "Digital natives' coping with loneliness: Facebook or face-to-face?",
            "Alone or together? Exploring the role of desire for online group gaming in players' social game addiction.",
            "The effects of business systems leveraging on supply chain performance: Process innovation and uncertainty as moderators.",
            "Espoused organizational culture values as antecedents of internet technology adoption in an emerging economy.",
            "Recommendation strategies in personalization applications.",
            "The mechanism through which members with reconstructed identities become satisfied with a social network community: A contingency model.",
            "The influence of role stress on self-disclosure on social networking sites: A conservation of resources perspective.",
            "Is online multiple-stores cooperative promotion better than single-store promotion? Misprediction from evaluation mode.",
            "On the time lag of the effect of network position on service performance in software service networks.",
            "Easy come or easy go? Empirical evidence on switching behaviors in mobile payment applications.",
            "Predicting employee information security policy compliance on a daily basis: The interplay of security-related stress, emotions, and neutralization.",
            "Harnessing business analytics value through organizational absorptive capacity.",
            "Does \"Being There\" Matter? The Impact of Web-Based and Virtual World's Shopping Experiences on Consumer Purchase Attitudes.",
            "Perceived fit between green IS and green SCM: Does it matter?",
            "Do perceived use contexts influence usage behavior? An instrument development of perceived use context.",
            "Enabling knowledge diversity to benefit cross-functional project teams: Joint roles of knowledge leadership and transactive memory system.",
            "Perceived argument quality's effect on threat and coping appraisals in fear appeals: An experiment and exploration of realism check heuristics.",
            "Competition matters! Self-efficacy, effort, and performance in crowdsourcing teams.",
            "Promoting crowdfunding with lottery: The impact on campaign performance.",
            "Impact of the usage of social media in the workplace on team and employee performance.",
            "Conceptualizing task-technology fit and the effect on adoption - A case study of a digital textbook service.",
            "Impacts of case-based health knowledge system in hospital management: The mediating role of group effectiveness.",
            "Motivation crowding in online product reviewing: A qualitative study of amazon reviewers.",
            "Should firms invest in social commerce? An integrative perspective.",
            "Enterprise social networking usage as a moderator of the relationship between work stressors and employee creativity: A multilevel study."
        ]
    },
    {
        "name": "I&M",
        "year": "2018",
        "info": "Volume 55: 2018",
        "count": 80,
        "papers": [
            "Can consumers be persuaded on brand microblogs? An empirical study.",
            "Sources and impacts of social influence from online anonymous user reviews.",
            "Don't believe strangers: Online consumer reviews and the role of social psychological distance.",
            "Explaining resistance to system usage in the PharmaCloud: A view of the dual-factor model.",
            "An integrated big data analytics-enabled transformation model: Application to health care.",
            "IT managers' vs. IT auditors' perceptions of risks: An actor-observer asymmetry perspective.",
            "A comprehensive framework of information system design to provide organizational creativity support.",
            "Unveiling the dark side of social networking sites: Personal and work-related consequences of social networking site addiction.",
            "Evolution of the impact of e-business technology on operational competence and firm profitability: A panel data investigation.",
            "IT-enabled knowledge ambidexterity and innovation performance in small U.S. firms: The moderator role of social media capability.",
            "Using ontology-based clustering to understand the push and pull factors for British tourists visiting a Mediterranean coastal destination.",
            "ICT for socio-economic development: A citizens' perspective.",
            "Information systems action research: Debunking myths and overcoming barriers.",
            "Regional ICT access and entrepreneurship: Evidence from China.",
            "Biophilia and biophobia in website design: Improving internet information dissemination.",
            "An information supply chain system view for managing rare infectious diseases: The need to improve timeliness.",
            "Interpersonal knowledge exchange in China: The impact of guanxi and social media.",
            "Gatekeepers' innovative use of IT: An absorptive capacity model at the unit level.",
            "Effects of entrepreneurship and IT fashion on SMEs' transformation toward cloud service through mediation of trust.",
            "Community engagement and online word of mouth: An empirical investigation.",
            "Differential effects of formal and self-control in mobile platform ecosystems: Multi-method findings on third-party developers' continuance intentions and application quality.",
            "An investigation into the antecedents of prepurchase online search.",
            "Understanding the role of technology in service innovation: Comparison of three theoretical perspectives.",
            "Understanding the impact of social media usage among organizations.",
            "Have your cake and eat it too? Simultaneously pursuing the knowledge-sharing benefits of agile and traditional development approaches.",
            "The power of a thumbs-up: Will e-commerce switch to social commerce?",
            "Self-control, organizational context, and rational choice in Internet abuses at work.",
            "Explaining IT governance disclosure through the constructs of IT governance maturity and IT strategic role.",
            "Opening the black box: Managers' perceptions of IS project success mechanisms.",
            "Strategic effort allocation in online innovation tournaments.",
            "Understanding the role of competition in video gameplay satisfaction.",
            "Real-Time business data acquisition: How frequent is frequent enough?",
            "Online customer reviews and consumer evaluation: The role of review font.",
            "Effects of group arguments on rumor belief and transmission in online communities: An information cascade and group polarization perspective.",
            "Extending the model of internet standards adoption: A cross-country comparison of IPv6 adoption.",
            "Modelling continued use of information systems from a forward-looking perspective: Antecedents and consequences of hope and anticipated regret.",
            "Connecto ergo sum! an exploratory study of the motivations behind the usage of connected objects.",
            "Health information privacy concerns, antecedents, and information disclosure intention in online health communities.",
            "Cyberbullying impacts on victims' satisfaction with information and communication technologies: The role of Perceived Cyberbullying Severity.",
            "How information technology influences opportunity exploration and exploitation firm's capabilities.",
            "Information technology capability and firm performance: Role of industry.",
            "Knowledge sharing in a global logistics provider: An action research project.",
            "Managing online wait: Designing effective waiting screens across cultures.",
            "Exploring ideation and implementation openness in open innovation projects: IT-enabled absorptive capacity perspective.",
            "Effects of model eye gaze direction on consumer visual processing: Evidence from China and America.",
            "Interactive effects of individual- and group-level variables on virtual purchase behavior in online communities.",
            "Psychological paradox of game software trial.",
            "The role of social media in enhancing guanxi and perceived effectiveness of E-commerce institutional mechanisms in online marketplace.",
            "Data analytics and firm performance: An empirical study in an online B2C platform.",
            "Business analytics and business value: A comparative case study.",
            "OSPM: A design methodology for open strategic planning.",
            "Precursors of trust in virtual health communities: A hierarchical investigation.",
            "Understanding employee competence, operational IS alignment, and organizational agility - An ambidexterity perspective.",
            "System 1 and System 2 cognition in the decision to adopt and use a new technology.",
            "Are there any relationships between technology and cultural values? A country-level trend study of the association between information communication technology and cultural values.",
            "Criteria for Selecting Cloud Service Providers: A Delphi Study of Quality-of-Service Attributes.",
            "Understanding indirect system use of junior employees in the context of healthcare.",
            "What motivates health information exchange in social media? The roles of the social cognitive theory and perceived interactivity.",
            "My words for your pizza: An analysis of persuasive narratives in online crowdfunding.",
            "The evolutionary trajectory of an ICT ecosystem: A network analysis based on media users' data.",
            "Using the elaboration likelihood model to examine online persuasion through website design.",
            "Enabling firm performance through business intelligence and analytics: A dynamic capabilities perspective.",
            "When and how authoritarian leadership and leader renqing orientation influence tacit knowledge sharing intentions.",
            "From improper to acceptable: How perpetrators neutralize workplace bullying behaviors in the cyber world.",
            "Consumer loyalty toward smartphone brands: The determining roles of deliberate inertia and cognitive lock-in.",
            "Technology executives in the changing accounting information environment: Impact of IFRS adoption on CIO compensation.",
            "Not all posts are treated equal: An empirical investigation of post replying behavior in an online travel community.",
            "Third-party apps (TPAs) and software platform performance: The moderating role of competitive entry.",
            "Perceived information transparency in B2C e-commerce: An empirical investigation.",
            "Are we ready for cyberterrorist attacks? - Examining the role of individual resilience.",
            "Trust and commitment within a virtual brand community: The mediating role of brand relationship quality.",
            "Consumer perceptions of information helpfulness and determinants of purchase intention in online consumer reviews of services.",
            "Uncertainty in cloud service relationships: Uncovering the differential effect of three social influence processes on potential and current users.",
            "Understanding affective commitment in social virtual worlds: The role of cultural tightness.",
            "How to regulate individuals' privacy boundaries on social network sites: A cross-cultural comparison.",
            "A Janus-faced matter - The role of user anonymity for communication persuasiveness in online discussions.",
            "Skewing users' rational risk considerations in social commerce: An empirical examination of the role of social identification.",
            "Sanction severity and employees' information security policy compliance: Investigating mediating, moderating, and control variables.",
            "Effects of review spam in a firm-initiated virtual brand community: Evidence from smartphone customers.",
            "Investigating illusions of agreement in group requirements determination."
        ]
    },
    {
        "name": "I&M",
        "year": "2017",
        "info": "Volume 54: 2017",
        "count": 82,
        "papers": [
            "How Do Mobile ICTs Enable Organizational Fluidity: Toward a Theoretical Framework.",
            "Here we go again! The impact of website ad repetition on recall, intrusiveness, attitudes, and site revisit intentions.",
            "Beyond likes and tweets: Consumer engagement behavior and movie box office in social media.",
            "Business intelligence and organizational learning: An empirical investigation of value creation processes.",
            "Influence of mechanism of patient-accessible hospital information system implementation on doctor-patient relationships: A service fairness perspective.",
            "Technology-induced anxiety: Manifestations, cultural influences, and its effect on the adoption of sensor-based technology in German and Australian hospitals.",
            "Mobile instant messaging use and social capital: Direct and indirect associations with employee outcomes.",
            "Catch me if you can: Online protests on sites powered by user-generated content.",
            "Optimal experience of flow enhanced by telepresence: Evidence from social media use.",
            "Digital work in a digitally challenged organization.",
            "On the contingent value of IT-based capabilities for the competitive advantage of SMEs: Mechanisms and empirical evidence.",
            "Perceived online community support, member relations, and commitment: Differences between posters and lurkers.",
            "RubE: Rule-based methods for extracting product features from online consumer reviews.",
            "Digitally enabled crime-fighting communities: Harnessing the boundary spanning competence of social media for civic engagement.",
            "Breaking free from the limitations of classical test theory: Developing and measuring information systems scales using item response theory.",
            "The state of online impulse-buying research: A literature analysis.",
            "A decade plus long introspection of research published in Information & Management.",
            "An influence framework on product word-of-mouth (WoM) measurement.",
            "Field effects of social media platforms on information-sharing continuance: Do reach and richness matter?",
            "When do I profit? Uncovering boundary conditions on reputation effects in online auctions.",
            "A social referral appraising mechanism for the e-marketplace.",
            "The agent bidding habit and use model (ABHUM) and its validation in the Taobao online auction context.",
            "IT-enabled operational agility: An interdependencies perspective.",
            "Boundary permeability and online-offline hybrid organization: A case study of Suning, China.",
            "The role of media dependency in predicting continuance intention to use ubiquitous media systems.",
            "Remarkable advocates: An investigation of geographic distance and social capital for crowdfunding.",
            "The role of institutional work in the transformation of the IT function: A longitudinal case study in the healthcare sector.",
            "Exploring software developers' work practices: Task differences, participation, engagement, and speed of task resolution.",
            "Understanding factors affecting users' social networking site continuance: A gender difference perspective.",
            "Effect of multi-vendor outsourcing on organizational learning: A social relation perspective.",
            "A longitudinal study of e-government maturity.",
            "Privacy calculus and its utility for personalization services in e-commerce: An analysis of consumer decision-making.",
            "Using information systems to achieve complementarity in SME innovation networks.",
            "Information security concerns in IT outsourcing: Identifying (in) congruence between clients and vendors.",
            "Impact of interactive technologies on stimulating learning experiences in a museum.",
            "Virtual team effectiveness: The role of knowledge sharing and trust.",
            "Deploying internal knowledge portals: Three major challenges.",
            "Who needs to be more visible online? The value implications of web visibility and firm heterogeneity.",
            "Factors affecting active participation in B2B online communities: An empirical investigation.",
            "Finding competitive keywords from query logs to enhance search engine advertising.",
            "Animated conversational agents and e-consumer productivity: The roles of agents and individual characteristics.",
            "Relational affordances of information processing on Facebook.",
            "Roles and politeness behavior in community-based free/libre open source software development.",
            "Expectations of patient-centred care: Investigating IS-related and other antecedents.",
            "Dynamic sales impacts of online physical product sampling.",
            "Weekdays or weekends: Exploring the impacts of microblog posting patterns on gratification and addiction.",
            "Applying network analysis to investigate interpersonal influence of information security behaviours in the workplace.",
            "A diffusion planning mechanism for social marketing.",
            "Factors influencing online shoppers' repurchase intentions: The roles of satisfaction and regret.",
            "How do you feel about your friends? Understanding situational envy in online social networks.",
            "Smart tourism: Traveler, business, and organizational perspectives.",
            "Effects of tourism information quality in social media on destination image formation: The case of Sina Weibo.",
            "Social media analytics and value creation in urban smart tourism ecosystems.",
            "Shared experience in pretrip and experience sharing in posttrip: A survey of Airbnb users.",
            "The effect of user-controllable filters on the prediction of online hotel reviews.",
            "How small hotels can drive value their way in infomediation. The case of 'Italian hotels vs. OTAs and TripAdvisor'.",
            "Smart tourism technologies in travel planning: The role of exploration and exploitation.",
            "A Big Data Analytics Method for Tourist Behaviour Analysis.",
            "Content mining framework in social media: A FIFA world cup 2014 case analysis.",
            "Toward a holistic understanding of continued use of social networking tourism: A mixed-methods approach.",
            "Explaining travellers online information satisfaction: A complexity theory approach on information needs, barriers, sources and personal characteristics.",
            "Likes - The key to my happiness: The moderating effect of social influence on travel experience.",
            "How attachment influences users' willingness to donate to content creators in social media: A socio-technical systems perspective.",
            "Exposing others' information on online social networks (OSNs): Perceived shared risk, its determinants, and its influence on OSN privacy control use.",
            "Expert or peer? Understanding the implications of virtual advisor identity on emergency rescuer empowerment in mobile psychological self-help services.",
            "Determinants of early conformance with information security policies.",
            "Impact of top management leadership styles on ERP assimilation and the role of organizational learning.",
            "Reflexivity: A third essential 'R' to enhance interpretive field studies.",
            "Decision support system (DSS) use and decision performance: DSS motivation and its antecedents.",
            "An analytical framework for online privacy research: What is missing?",
            "The impact of mobile Internet on mobile voice usage: A two-level analysis of mobile communications customers in a GCC country.",
            "Design patterns for emergency management: An exercise in reflective practice.",
            "Exploring the inhibitors of online health service use intention: A status quo bias perspective.",
            "Conceptualizing and measuring quality of experience of the internet of things: Exploring how quality is perceived by users.",
            "Resolving the privacy paradox: Toward a cognitive appraisal and emotion approach to online privacy behaviors.",
            "A new perspective on neutralization and deterrence: Predicting shadow IT usage.",
            "Role of local presence in online impulse buying.",
            "Strategic risk analysis for information technology outsourcing in hospitals.",
            "From traditional education technologies to student satisfaction in Management education: A theory of the role of social media applications.",
            "Whose recommendations do you follow? An investigation of tie strength, shopping stage, and deal scarcity.",
            "Healthcare financialisation and the digital divide in the European Union: Narrative and numbers.",
            "Analyzing consumer goal structure in online group buying: A means-end chain approach."
        ]
    },
    {
        "name": "I&M",
        "year": "2016",
        "info": "Volume 53: 2016",
        "count": 79,
        "papers": [
            "Do context and personality matter? Trust and privacy concerns in disclosing private information online.",
            "Empirical studies of geographically distributed agile development communication challenges: A systematic review.",
            "Reciprocity norms and information-sharing behavior in online consumption communities: An empirical investigation of antecedents and moderators.",
            "Self-disclosure in Chinese micro-blogging: A social exchange theory perspective.",
            "Knowledge sourcing from repositories: The role of system characteristics and psychological climate.",
            "Alignments between the depth and breadth of inter-organizational systems deployment and their impact on firm performance.",
            "A model of emotion and computer abuse.",
            "Assessing the values of EC and IT separately and simultaneously and inputs substitution and complement: The CES-based stochastic frontier approaches.",
            "How the user liaison's understanding of development processes moderates the effects of user-related and project management risks on IT project performance.",
            "Home location profiling for users in social media.",
            "Using interactive systems for knowledge sharing: The impact of individual contextual preferences in China.",
            "Using interpretive structural modeling and fuzzy analytical process to identify and prioritize the interactive barriers of e-commerce implementation.",
            "Crowd intelligence: Analyzing online product reviews for preference measurement.",
            "Information systems control alignment: Complementary and conflicting systems development controls.",
            "Early mover advantage in e-commerce platforms with low entry barriers: The role of customer relationship management capabilities.",
            "Modeling signal-based decisions in online search environments: A non-recursive forward-looking approach.",
            "IT outsourcing research from 1992 to 2013: A literature review based on main path analysis.",
            "A Cognitive-Affective Model of Perceived User Satisfaction (CAMPUS): The complementary effects and interdependence of usability and aesthetics in IS design.",
            "An empirical study of the cross-channel effects between web and mobile shopping channels.",
            "Promoting online learners' continuance intention: An integrated flow framework.",
            "Innovation research in information systems: A commentary on contemporary trends and issues.",
            "An integrated model of innovation drivers for smaller software firms.",
            "The role of users and customers in digital innovation: Insights from B2B manufacturing firms.",
            "Mobile environments and innovation co-creation processes & ecosystems.",
            "Disruptive information technology innovations and the cost of equity capital: The moderating effect of CEO incentives and institutional pressures.",
            "Understanding behavioral intention to use a cloud computing classroom: A multiple model comparison approach.",
            "Innovating with enterprise systems and digital platforms: A contingent resource-based theory view.",
            "The impact of social information system governance, utilization, and capabilities on absorptive capacity and innovation: A case of Austrian SMEs.",
            "Integrating open innovation and business process innovation: Insights from a large-scale study on a transition economy.",
            "Innovation in IT firms: An investigation of intramural and extramural R&D activities and their impact.",
            "The impact of the frequency of usage of IT artifacts on predevelopment performance in the NPD process.",
            "Duration, frequency, and diversity of knowledge contribution: Differential effects of job characteristics.",
            "Exploring the path to success: A review of the strategic IT benchmarking literature.",
            "The moderating role of information load on online product presentation.",
            "The impact of e-retail characteristics on initiating mobile retail services: A modular innovation perspective.",
            "Conceptualizing organizational innovation: The case of the Brazilian software industry.",
            "E-learning continuance: The impact of interactivity and the mediating role of imagery, presence and flow.",
            "Computer-Related Task Performance: A new perspective.",
            "Determinants of negative word-of-mouth communication using social networking sites.",
            "Alignment's nomological network: Theory and evaluation.",
            "Retaining customers by utilizing technology-facilitated chat: Mitigating website anxiety and task complexity.",
            "Applying institutional theory to the adoption of electronic health records in the U.S.",
            "Electronic medical record system avoidance in a turbulent environment.",
            "Articulation of work process models for organizational alignment and informed information system design.",
            "How do bidders' organism reactions mediate auction stimuli and bidder loyalty in online auctions? The case of Taobao in China.",
            "The stickiness intention of group-buying websites: The integration of the commitment-trust theory and e-commerce success model.",
            "Knowledge sharing in online health communities: A social exchange theory perspective.",
            "Complementary IT resources for enabling technological opportunism.",
            "A study on the impact of design attributes on E-payment service utility.",
            "The impact of legitimacy-based motives on IS adoption success: An institutional theory perspective.",
            "Decomposing perceived playfulness: A contextual examination of two social networking sites.",
            "Assessing the success of e-government systems: An employee perspective.",
            "Investigating decision factors in mobile application purchase: A mixed-methods approach.",
            "Continuance usage of corporate SNS pages: A communicative ecology perspective.",
            "Multi-homing on SNSs: The role of optimum stimulation level and perceived complementarity in need gratification.",
            "Process innovation as creative problem solving: An experimental study of textual descriptions and diagrams.",
            "A pragmatic multi-method investigation of discrepant technological events: Coping, attributions, and 'accidental' learning.",
            "The role of creation mode and social networking mode in knowledge creation performance: Mediation effect of creation process.",
            "Mobile business application for service and maintenance processes: Using ex post evaluation by end-users as input for iterative design.",
            "Guest editorial.",
            "Stock analysts vs. the crowd: Mutual prediction and the drivers of crowd wisdom.",
            "Using wikis in team collaboration: A media capability perspective.",
            "Judging online peer-to-peer lending behavior: A comparison of first-time and repeated borrowing requests.",
            "The effects of general privacy concerns and transactional privacy concerns on Facebook apps usage.",
            "Developing business analytic capabilities for combating e-commerce identity fraud: A study of Trustev's digital verification solution.",
            "Modelling the impact of study behaviours on academic performance to inform the design of a persuasive system.",
            "Do you get tired of socializing? An empirical explanation of discontinuous usage behaviour in social network services.",
            "Adoption of software as a service in Indonesia: Examining the influence of organizational factors.",
            "Big data commerce.",
            "SocoTraveler: Travel-package recommendations leveraging social influence of different relationship types.",
            "Mining customer requirements from online reviews: A product improvement perspective.",
            "A method for real-time trajectory monitoring to improve taxi service using GPS big data.",
            "Social emotion classification of short text via topic-level maximum entropy model.",
            "User opinion classification in social media: A global consistency maximization approach.",
            "The different impacts of news-driven and self-initiated search volume on stock prices.",
            "The dynamic predictive power of company comparative networks for stock sector performance.",
            "The promising future of healthcare services: When big data analytics meets wearable technology.",
            "Value co-creation between firms and customers: The role of big data-based cooperative assets.",
            "Toward the development of a big data analytics capability."
        ]
    },
    {
        "name": "I&M",
        "year": "2015",
        "info": "Volume 52: 2015",
        "count": 78,
        "papers": [
            "The influence of website dimensionality on customer experiences, perceptions and behavioral intentions: An exploration of 2D vs. 3D web design.",
            "The nature, dimensionality, and effects of perceptions of community governance.",
            "Understanding commitment in business process outsourcing relationships.",
            "e-Shopping acceptance: A qualitative and meta-analytic review.",
            "Integrating social networking support for dyadic knowledge exchange: A study in a virtual community of practice.",
            "The role of the Internet in changing industry competition.",
            "What drives knowledge sharing in software development teams: A literature review and classification framework.",
            "Investigating the antecedents of organizational task crowdsourcing.",
            "Information technology and organizational learning in knowledge alliances and networks: Evidence from U.S. pharmaceutical industry.",
            "A system dynamics model for information security management.",
            "Investigating factors influencing local government decision makers while adopting integration technologies (IntTech).",
            "The impacts of social trust on open and closed B2B e-commerce: A Europe-based study.",
            "Choice decision of e-learning system: Implications from construal level theory.",
            "To monitor or not to monitor: Effectiveness of a cyberloafing countermeasure.",
            "Synthesizing information systems knowledge: A typology of literature reviews.",
            "Developing focal capabilities for e-commerce adoption: A resource orchestration perspective.",
            "Factors affecting adoption of online banking: A meta-analytic structural equation modeling study.",
            "Detecting the migration of mobile service customers using fuzzy clustering.",
            "A method for identifying journals in a discipline: An application to information systems.",
            "Antecedents and consequences of collective empathy in software development project teams.",
            "Determinants of mobile value-added service continuance: The mediating role of service experience.",
            "An empirical study of the motivations for content contribution and community participation in Wikipedia.",
            "Dealing with self-report bias in mobile Internet acceptance and usage studies.",
            "Antecedents and consequences of mobile phone usability: Linking simplicity and interactivity to satisfaction, trust, and brand loyalty.",
            "Examining the moderating role of sense of membership in online review evaluations.",
            "Within-study measurement invariance of the UTAUT instrument: An assessment with user technology engagement variables.",
            "The influence of data theft on the share prices and systematic risk of consumer electronics companies.",
            "Information technology and open innovation: A strategic alignment perspective.",
            "The assimilation of enterprise information system: An interpretation systems perspective.",
            "Exploring the relationship between receiving and offering online social support: A dual social support model.",
            "Institutional pressures in security management: Direct and indirect influences on organizational investment in information security control resources.",
            "Examining how firms leverage IT to achieve firm productivity: RBV and dynamic capabilities perspectives.",
            "Massively multiplayer online game addiction: Instrument development and validation.",
            "Evaluation of knowledge management performance: An organic approach.",
            "Examining the pre-adoption stages of healthcare IT: A case study of vital signs monitoring systems.",
            "The impacts of technological environments and co-creation experiences on customer participation.",
            "Reconceptualizing trust: A non-linear Boolean model.",
            "The impact of interactivity of electronic word of mouth systems and E-Quality on decision support in the context of the e-marketplace.",
            "Learning to cope with information security risks regarding mobile device loss or theft: An empirical examination.",
            "A qualitative study of business-to-business electronic commerce adoption within the Indonesian grocery industry: A multi-theory perspective.",
            "Career commitment of information technology professionals: The investment model perspective.",
            "Learning for healthy outcomes: Exploration and exploitation with electronic medical records.",
            "When innovation fails: An institutional perspective of the (non)adoption of boundary spanning IT innovation.",
            "Customer participation in virtual brand communities: The self-construal perspective.",
            "Antecedents of consumers' intention to revisit an online group-buying website: A transaction cost perspective.",
            "The role of formal controls in facilitating information system diffusion.",
            "The attitude cube - A three-dimensional model of situational factors in IS adoption and their impact on the attitude-behavior relationship.",
            "The assimilation of RFID technology by Chinese companies: A technology diffusion perspective.",
            "IT capabilities and product innovation performance: The roles of corporate entrepreneurship and competitive intensity.",
            "Does IT team climate matter? An empirical study of the impact of co-workers and the Confucian work ethic on deviance behavior.",
            "Applying flow theory to booking experiences: An integrated model in an online service context.",
            "Leveraging e-business process for business value: A layered structure perspective.",
            "Knowing about your food from the farm to the table: Using information systems that reduce information asymmetry and health risks in retail contexts.",
            "An integrated framework for theories of individual attitudes toward technology.",
            "The effect of IT and relationship commitment on supply chain coordination: A contingency and configuration approach.",
            "Exploring information privacy regulation, risks, trust, and behavior.",
            "Novel applications of social media analytics.",
            "Understanding News 2.0: A framework for explaining the number of comments from readers on online news.",
            "Emotion recognition and affective computing on vocal social media.",
            "Personalized recommendations based on time-weighted overlapping community detection.",
            "A novel social media competitive analytics framework with sentiment benchmarks.",
            "The deeper, the better? Effect of online brand community activity on customer purchase frequency.",
            "Effectiveness of corporate social media activities in increasing relational outcomes.",
            "Why users contribute knowledge to online communities: An empirical study of an online social Q&A community.",
            "EXPRS: An extended pagerank method for product feature extraction from online consumer reviews.",
            "Subjective well-being measurement based on Chinese grassroots blog text sentiment analysis.",
            "Reading behavior on intra-organizational blogging systems: A group-level analysis through the lens of social capital theory.",
            "An empirical analysis of users' privacy disclosure behaviors on social network sites.",
            "A dual privacy decision model for online social networks.",
            "Leveraging IT resources, embeddedness, and dependence: A supplier's perspective on appropriating benefits with powerful buyers.",
            "Assessing ERP post-implementation success at the individual level: Revisiting the role of service quality.",
            "Inter-firm dependence, inter-firm trust, and operational performance: The mediating effect of e-business integration.",
            "Creative participation: Collective sentiment in online co-creation communities.",
            "Online information quality and consumer satisfaction: The moderating roles of contextual factors - A meta-analysis.",
            "A social endorsing mechanism for target advertisement diffusion.",
            "Information technology and interorganizational learning: An investigation of knowledge exploration and exploitation processes.",
            "Dysfunctional information system behaviors are not all created the same: Challenges to the generalizability of security-based research.",
            "Can music improve e-behavioral intentions by enhancing consumers' immersion and experience?"
        ]
    },
    {
        "name": "I&M",
        "year": "2014",
        "info": "Volume 51: 2014",
        "count": 90,
        "papers": [
            "Exploring top managers' innovative IT (IIT) championing behavior: Integrating the personal and technical contexts.",
            "Sources of conflict between developers and testers in software development.",
            "Exploring the role of customer relationship management (CRM) systems in customer knowledge creation.",
            "Development and validation of an instrument to measure organizational cultures' support of Business Process Management.",
            "Critical information technology issues in Turkish healthcare.",
            "Information systems security policy compliance: An empirical study of the effects of socialisation, influence, and cognition.",
            "Imaginal and emotional experiences in pleasure-oriented IT usage: A hedonic consumption perspective.",
            "Proactive privacy practices in transition: Toward ubiquitous services.",
            "Elucidating the role of IT/IS assessment and resource allocation in IT/IS performance in hospitals.",
            "The impact of organizational efforts on consumer concerns in an online context.",
            "G2G information sharing among government agencies.",
            "Effects of cognitive and social factors on system utilization and performance outcomes.",
            "Incident-centered information security: Managing a strategic balance between prevention and response.",
            "Toward an understanding of the nature and conceptualization of outsourcing success.",
            "A different approach to information management by exceptions (toward the prevention of another Enron).",
            "Knowledge transfer and utilization in IT outsourcing partnerships: A preliminary model of antecedents and outcomes.",
            "Internal control framework for a compliant ERP system.",
            "Vertical IS standards deployment and integration: A study of antecedents and benefits.",
            "Employees' adherence to information security policies: An exploratory field study.",
            "Contained nomadic information environments: Technology, organization, and environment influences on adoption of hospital RFID patient tracking.",
            "Why do users switch to a disruptive technology? An empirical study based on expectation-disconfirmation theory.",
            "The adoption of software measures: A technology acceptance model (TAM) perspective.",
            "Aligning RFID applications with supply chain strategies.",
            "Routine reconfiguration in traditional companies' e-commerce strategy implementation: A trajectory perspective.",
            "Coping knowledge boundaries between information system and business disciplines: An intellectual capital perspective.",
            "Understanding group maintenance behavior in Free/Libre Open-Source Software projects: The case of Fire and Gaim.",
            "Post-implementation practices of ERP systems and their relationship to financial performance.",
            "The impact of IT outsourcing on information systems success.",
            "The association between the mandatory adoption of XBRL and the performance of listed state-owned enterprises and non-state-owned enterprises in China.",
            "Exploring neuroticism and extraversion in flow and user generated content consumption.",
            "Effective website design for experience-influenced environments: The case of high culture museums.",
            "Determinants of e-consumer productivity in product retrieval on a commercial website: An experimental approach.",
            "Is more always better? Investigating the task-technology fit theory in an online user context.",
            "Understanding the effect of knowledge management strategies on knowledge management performance: A contingency perspective.",
            "Information technology and knowledge in software development teams: The role of project uncertainty.",
            "Enhancing e-learning effectiveness using an intelligent agent-supported personalized virtual learning environment: An empirical investigation.",
            "Understanding knowledge contributors' satisfaction in transactional virtual communities: A cost-benefit trade-off perspective.",
            "Predicting personal information system adoption using an integrated diffusion model.",
            "Do too many goals impede a program? A case study of enterprise system implementation with multiple interdependent projects.",
            "Toward a deeper understanding of IT adoption: A multilevel analysis.",
            "The role of multidimensional social capital in crowdfunding: A comparative study in China and US.",
            "Assessing the determinants of cloud computing adoption: An analysis of the manufacturing and services sectors.",
            "If it's fair, I'll share: The effect of perceived knowledge validation justice on contributions to an organizational knowledge repository.",
            "Virtual goods, real goals: Exploring means-end goal structures of consumers in social virtual worlds.",
            "Developing a competitive edge in electronic markets via institutional and social based quality signaling mechanisms.",
            "The mediating role of knowledge transfer and the effects of client-consultant mutual trust on the performance of enterprise implementation projects.",
            "Bridging the divide: A qualitative comparison of information security thought patterns between information security professionals and ordinary organizational insiders.",
            "How to facilitate inter-organizational knowledge sharing: The impact of trust.",
            "Proposing the Affect-Trust Infusion Model (ATIM) to explain and predict the influence of high and low affect infusion on Web vendor trust.",
            "Determinants of users' continuance of social networking sites: A self-regulation perspective.",
            "Job performance through mobile enterprise systems: The role of organizational agility, location independence, and task characteristics.",
            "Defining decision making process performance: Conceptualization and validation of an index.",
            "Trust transfer in the continued usage of public e-services.",
            "Store selection criteria and sales prediction in virtual worlds.",
            "Market perception on cloud computing initiatives in organizations: An extended resource-based view.",
            "Information technology customer aggression: The importance of an organizational climate of support.",
            "How does e-mail use affect perceived control of time?",
            "Investigating the relationship between perceived risks in communication and ICT-enabled communicative behaviors.",
            "The continuity of underperforming ICT projects in the public sector.",
            "Efficiency analysis of information technology and online social networks management: An integrated DEA-model assessment.",
            "Discourse cues to deception in the case of multiple receivers.",
            "Revisiting the Task-Media Fit Circumflex: A further examination of negotiation tasks.",
            "The firm's continuance intentions to use inter-organizational ICTs: The influence of contingency factors and perceptions.",
            "Digital systems and competitive responsiveness: The dynamics of IT business value.",
            "Gratifications and social network service usage: The mediating role of online experience.",
            "A cross-national analysis of eHealth in the European Union: Some policy and research directions.",
            "Preface.",
            "A set of ethical principles for design science research in information systems.",
            "From computer ethics to responsible research and innovation in ICT: The transition of reference discourses informing ethics-related research in information systems.",
            "The ethical and social implications of personalization technologies for e-learning.",
            "Exploring the linkages between perceived information accessibility and microblog stickiness: The moderating role of a sense of community.",
            "A domain-feature enhanced classification model for the detection of Chinese phishing e-Business websites.",
            "The impact of technological, organizational and environmental characteristics on electronic collaboration and relationship performance in international customer-supplier relationships.",
            "Investigating the effects of IS strategic leadership on organizational benefits from the perspective of CIO strategic roles.",
            "Corrigendum to \"Job performance through mobile enterprise systems: The role of organizational agility, location independence, and task characteristics\" [Information & Management 51 (2014) 605-617].",
            "Strategic role of IT and its impact on organizations.",
            "Do we order product review information display? How?",
            "Developing a maturity model for service systems in heavy equipment manufacturing enterprises.",
            "An exploratory study using inexpensive electroencephalography (EEG) to understand flow experience in computer-based instruction.",
            "Can intrafirm IT skills benefit interfirm integration and performance?",
            "Task-driven learning: The antecedents and outcomes of internal and external knowledge sourcing.",
            "An exploratory study of buyers' participation intentions in reputation systems: The relationship quality perspective.",
            "Experimental evaluation of sequential bias in online customer reviews.",
            "When do sellers bifurcate from Electronic Multisided Platforms? The effects of customer demand, competitive intensity, and service differentiation.",
            "Conceptualizing the dynamics of rhetorical practice and technological frame in the context of technology diffusion and adoption.",
            "Design-to-lure in the e-shopping environment: A landscape preference approach.",
            "Effects of national culture on e-government diffusion - A global study of 55 countries.",
            "What motivates customers to participate in social commerce? The impact of technological environments and virtual customer experiences.",
            "Paving the way for CRM success: The mediating role of knowledge management and organizational commitment.",
            "Understanding post-adoption behaviors of e-service users in the context of online travel services."
        ]
    },
    {
        "name": "I&M",
        "year": "2013",
        "info": "Volume 50: 2013",
        "count": 61,
        "papers": [
            "A model of consumers' perceptions of the invasion of information privacy.",
            "Business intelligence success: The roles of BI capabilities and decision environments.",
            "Conceptualizing means-end chains of user goals as networks.",
            "Cue consistency and page value perception: Implications for web-based catalog design.",
            "A multidimensional analysis of data quality for credit risk management: New insights and challenges.",
            "A study of the institutional forces influencing the adoption intention of RFID by suppliers.",
            "The impact of Business Intelligence systems on stock return volatility.",
            "Nurturing employee market knowledge absorptive capacity through unified internal communication and integrated information technology.",
            "The effects of IS resources, capabilities, and qualities on organizational performance: An integrated approach.",
            "Service with an e-smile: Employee authenticity and customer use of web-based support services.",
            "The organizational citizenship behavior of IS personnel: Does organizational justice matter?",
            "Reconceptualizing rhetorical practices in organizations: The impact of social media on internal communications.",
            "A heuristic-systematic model of end-user information processing when encountering IS exceptions.",
            "The complexities of electronic services implementation and institutionalisation in the public sector.",
            "Trust and knowledge sharing in diverse global virtual teams.",
            "An empirical test of three mediation models for the relationship between personal innovativeness and user acceptance of technology.",
            "The perspective of a revised TRAM on social capital building: The case of Facebook usage.",
            "Effects of collaborative online shopping on shopping experience through social and relational perspectives.",
            "Development and validation of an instrument to measure user perceived service quality of mHealth.",
            "How cues of what can be done in a virtual world influence learning: An affordance perspective.",
            "A systematic assessment of rigor in information systems ranking-type Delphi studies.",
            "Model-driven disaster management.",
            "Information provision for challenging markets: The case of the accessibility requiring market in the context of tourism.",
            "The impact of website content dimension and e-trust on e-marketing effectiveness: The case of Iranian commercial saffron corporations.",
            "Consumers' adoption of information services.",
            "Knowledge seekers' and contributors' reactions to recommendation mechanisms in knowledge management systems.",
            "Interactive and diagnostic uses of management control systems in IS projects: Antecedents and their impact on performance.",
            "Outsourcing capabilities, organizational structure and performance quality monitoring: Toward a fit model.",
            "Adapting domain ontology for personalized knowledge search and recommendation.",
            "Exploitative and exploratory learning in transactive memory systems and project performance.",
            "Bidding strategies in online single-unit auctions: Their impact and satisfaction.",
            "Using the theory of interpersonal behavior to explain non-work-related personal use of the Internet at work.",
            "Examining the role of information technology in cultivating firms' dynamic marketing capabilities.",
            "Success of electronic commerce Web sites: A comparative study in two countries.",
            "Do the allocation and quality of intellectual assets affect the reputation of open source software projects?",
            "Data quality assessment: The Hybrid Approach.",
            "A hybrid fuzzy group ANP-TOPSIS framework for assessment of e-government readiness from a CiRM perspective.",
            "Understanding the most critical skills for managing IT projects: A Delphi study of IT project managers.",
            "Exploring the interaction effects of social capital.",
            "Senior managers' perception on green information systems (IS) adoption and environmental performance: Results from a field survey.",
            "Building trust online: Interactions among trust building mechanisms.",
            "A value-based approach to the ex-ante evaluation of IT enabled business process improvement projects.",
            "Information technology adoption and continuance: A longitudinal study of individuals' behavioral intentions.",
            "Choosing the right business process maturity model.",
            "Understanding the impact of business cases on IT investment decisions: An analysis of municipal e-government projects.",
            "Is social capital effective for online learning?",
            "The interplay of conscious and automatic mechanisms in the context of routine use: An integrative and comparative study of contrasting mechanisms.",
            "A research case study: Difficulties and recommendations when using a textual data mining tool.",
            "Using balanced scorecards for the evaluation of \"Software-as-a-service\".",
            "An empirical study of information contribution to online feedback systems: A motivation perspective.",
            "Why do users continue using social networking sites? An exploratory study of members in the United States and Taiwan.",
            "Job burnout of the information technology worker: Work exhaustion, depersonalization, and personal accomplishment.",
            "The importance of the CobiT framework IT processes for effective internal control over financial reporting in organizations: An international survey.",
            "Theorizing the concept and role of assurance in information systems security.",
            "Introduction.",
            "Intention to purchase on social commerce websites across cultures: A cross-regional study.",
            "User expertise in contemporary information systems: Conceptualization, measurement and application.",
            "Examining the relationships among e-government maturity, corruption, economic prosperity and environmental degradation: A cross-country analysis.",
            "Investigating the effects of business process orientation on organizational innovation performance.",
            "The influence of user interaction and participation in social media on the consumption intention of niche products.",
            "Managing organizational identity in the e-commerce industry: An ambidexterity perspective."
        ]
    },
    {
        "name": "I&M",
        "year": "2012",
        "info": "Volume 49: 2012",
        "count": 36,
        "papers": [
            "The effects of peer intrinsic and extrinsic motivation on MMOG game-based collaborative learning.",
            "Exploring barriers to knowledge flow at different knowledge management maturity stages.",
            "A knowledge based component/service repository to enhance analysts' domain knowledge for requirements analysis.",
            "A comprehensive study of the relationship between enterprise resource planning selection criteria and enterprise resource planning system success.",
            "Enterprise applications diffusion within organizations: A social learning perspective.",
            "Information sharing and business systems leveraging in supply chains: An empirical investigation of one web-based application.",
            "Knowledge sharing - A key role in the downstream supply chain.",
            "Consumer acceptance of service bundles: An empirical investigation in the context of broadband triple play.",
            "Willingness to share information in a supply chain: A partnership-data-process perspective.",
            "Applying an extended model of deterrence across cultures: An investigation of information systems misuse in the U.S. and South Korea.",
            "Positive and negative aspects of online community cultivation: Implications for online stores' relationship management.",
            "Transactive directories of organizational memory: Towards a working data model.",
            "How managers interpret scanning information.",
            "Assimilation of Internet-based purchasing applications within medical practices.",
            "The synergistic effects of IT-enabled resources on organizational capabilities and firm performance.",
            "Data modeling: Description or design?",
            "User acceptance and corporate intranet quality: An evaluation with iQual.",
            "Investigating the moderating role of uncertainty avoidance cultural values on multidimensional online trust.",
            "The influence of interfirm codevelopment competency on e-service innovation.",
            "Motivating IS security compliance: Insights from Habit and Protection Motivation Theory.",
            "An analysis of IT/IS outsourcing provider selection for small- and medium-sized enterprises in Taiwan.",
            "It is not for fun: An examination of social network site usage.",
            "A meta-analysis of relationships between organizational characteristics and IT innovation adoption in organizations.",
            "Framework for user acceptance: Clustering for fine-grained results.",
            "Signaling theory and information asymmetry in online commerce.",
            "The dimensions and directionality of trust and their roles in the development of shared business-IS understanding.",
            "Leadership characteristics and developers' motivation in open source software development.",
            "The effect of CRM use on internal sales management control: An alternative mechanism to realize CRM benefits.",
            "Digital divide across the European Union.",
            "The impact of online community position on online game continuance intention: Do game knowledge and community size matter?",
            "A meta-analysis of the consequences of virtualness on team functioning.",
            "Career anchors and disturbances in job turnover decisions - A case study of IT professionals in Taiwan.",
            "The effects of multilevel sanctions on information security violations: A mediating model.",
            "User switching of information technology: A theoretical synthesis and empirical test.",
            "New insights into the problem of software piracy: The effects of neutralization, shame, and moral beliefs.",
            "Functional quality and hedonic quality: A study of the dimensions of e-service quality in online travel agencies."
        ]
    },
    {
        "name": "I&M",
        "year": "2011",
        "info": "Volume 48: 2011",
        "count": 44,
        "papers": [
            "An international comparison of technology adoption: Testing the UTAUT model.",
            "Social capital and individual motivations on knowledge sharing: Participant involvement as a moderator.",
            "Dr. Jekyll vis-à-vis Mr. Hyde: Personality variation between virtual and real worlds.",
            "Online government advisory service innovation through Intelligent Support Systems.",
            "Communicative practices in an online financial forum during abnormal stock market behavior.",
            "The role of IT human capability in the knowledge transfer process in IT outsourcing context.",
            "Should I e-collaborate with this group? A multilevel model of usage intentions.",
            "The choice of governance mode in ICT alliances: A property rights approach.",
            "Information technology and productivity: Empirical evidence from the Chinese electronics industry.",
            "Family and work-related consequences of addiction to organizational pervasive technologies.",
            "Effects of initial and ongoing trust in IT outsourcing: A bilateral perspective.",
            "Knowledge reuse through electronic repositories: A study in the context of customer service support.",
            "IT investments disclosure, information quality, and factors influencing managers' choices.",
            "Psychological climate and decision-making performance in a GDSS context.",
            "An empirical study of the effectiveness of multimedia disclosure of informed consent: A technology mediated learning perspective.",
            "IT management capability and its impact on the performance of a CIO.",
            "A complexity perspective on collaborative decision making in organizations: The ecology of group-performance.",
            "Consumer feelings and behaviours towards well designed websites.",
            "Understanding Web 2.0 service models: A knowledge-creating perspective.",
            "Consumer's decision to shop online: The moderating role of positive informational social influence.",
            "Repurchase intention in B2C e-commerce - A relationship quality perspective.",
            "Satisfaction with virtual worlds: An integrated model of experiential value.",
            "Generating quality open content: A functional group perspective based on the time, interaction, and performance theory.",
            "Principal component case-based reasoning ensemble for business failure prediction.",
            "Investigating the intention to purchase digital items in social networking communities: A customer value perspective.",
            "Plural: A decentralized business process modeling method.",
            "Assessing the importance of industry in the adoption and assimilation of IT: Evidence from Italian enterprises.",
            "Creating a performance-oriented e-learning environment: A design science approach.",
            "How does leadership affect information systems success? The role of transformational leadership.",
            "The effect of intellectual capital on employees' satisfaction and retention.",
            "A longitudinal experimental study on the interaction effects of persuasion quality, user training, and first-hand use on user perceptions of new information technology.",
            "Out of fear or desire? Toward a better understanding of employees' motivation to follow IS security policies.",
            "Purchase behavior in virtual worlds: An empirical investigation in Second Life.",
            "Understanding use continuance in virtual worlds: Empirical test of a research model.",
            "The influence of online store beliefs on consumer online impulse buying: A model and empirical application.",
            "How organizations motivate users to participate in support upgrades of customized packaged software.",
            "Assessing the impact of recommender agents on on-line consumer unplanned purchase behavior.",
            "A feedback control approach to maintain consumer information load in online shopping environments.",
            "Organizational information systems competences in small and medium-sized enterprises.",
            "Exploring the influence of personal schema on trust transfer and switching costs in brick-and-click bookstores.",
            "Analysis of keyword networks in MIS research and implications for predicting knowledge evolution.",
            "Stocks and flows underlying organizations' knowledge management capability: Synergistic versus contingent complementarities over time.",
            "Dynamics between the trust transfer process and intention to use mobile payment services: A cross-environment perspective.",
            "Search advertising placement strategy: Exploring the efficacy of the conventional wisdom."
        ]
    },
    {
        "name": "I&M",
        "year": "2010",
        "info": "Volume 47: 2010",
        "count": 42,
        "papers": [
            "Project preparedness and the emergence of implementation problems in ERP projects.",
            "Business-IT alignment maturity of companies in China.",
            "A contingency model for estimating success of strategic information systems planning.",
            "Transitioning to a business rule management service model: Case studies from the property and casualty insurance industry.",
            "Assessing the impact of knowledge management strategies announcements on the market value of firms.",
            "User acceptance of hedonic digital artifacts: A theory of consumption values perspective.",
            "How does the application of an IT service innovation affect firm performance? A theoretical framework and empirical analysis on e-commerce.",
            "A model of customer relationship management and business intelligence systems for catalogue and online retailers.",
            "Situated DSS for personal finance management: Design and evaluation.",
            "The role played by interdependences in ERP implementations: An empirical analysis of critical factors that minimize elapsed time.",
            "An investigation of the word-processing software market war in South Korea: A game-theoretic approach.",
            "Who owns enterprise information? Data ownership rights in Europe and the U.S.",
            "Online customers' cognitive differences and their impact on the success of recommendation agents.",
            "Investigating online information disclosure: Effects of information relevance, trust and risk.",
            "Identifying the ideal fit between mobile work and mobile work support.",
            "CEO/CIO mutual understanding, strategic alignment, and the contribution of IS to the organization.",
            "The influence of extro/introversion on the intention to pay for social networking sites.",
            "Strategic alignment of ERP implementation stages: An empirical investigation.",
            "The strategic choice to continue outsourcing, switch vendors, or backsource: Do switching costs matter?",
            "Market reaction to application service provider (ASP) adoption: An empirical investigation.",
            "Withholding effort in knowledge contribution: The role of social exchange and social cognitive on project teams.",
            "Exploratory factor analysis revisited: How robust methods support the detection of hidden multivariate data structures in IS research.",
            "The effects of data model representation method on task performance.",
            "Designing an evaluation framework for IT service management.",
            "To give or to receive? Factors influencing members' knowledge sharing and community promotion in professional virtual communities.",
            "Governing the data commons: Policy, practice, and the advancement of science.",
            "An alternative measure of the ICT-Opportunity Index.",
            "Determinants of RFID adoption intention: Evidence from Taiwanese retail chains.",
            "Adoption of e-procurement and participation of e-marketplace on firm performance: Trust as a moderator.",
            "Exploring the relationship between organizational culture and software process improvement deployment.",
            "A strategic framework for website evaluation based on a review of the literature from 1995-2006.",
            "Determinants of success in IS offshoring projects: Results from an empirical study of German companies.",
            "Antecedents and determinants of information technology habit.",
            "Impact of quality antecedents on taxpayer satisfaction with online tax-filing systems - An empirical study.",
            "Explaining usage of process modeling grammars: Comparing three theoretical models in the study of two grammars.",
            "Cross-bidding in simultaneous online auctions: Antecedents and consequences.",
            "Strategic impacts of IT-enabled consumer power: Insight from Internet distribution in the U.S. lodging industry.",
            "Building and leveraging information in dynamic environments: The role of IT infrastructure flexibility as enabler of organizational responsiveness and competitive advantage.",
            "Ranking web sites using domain ontology concepts.",
            "Identifying key factors affecting transnational knowledge transfer.",
            "An investigation of moderators of the link between technology use in the supply chain and supply chain performance.",
            "Total quality in software development: An empirical study of quality drivers and benefits in Indian software projects."
        ]
    },
    {
        "name": "I&M",
        "year": "2009",
        "info": "Volume 46: 2009",
        "count": 57,
        "papers": [
            "Managing knowledge sharing: Emergent and engineering approaches.",
            "Virtual organizational learning in open source software development projects.",
            "Determinants of customer acceptance of multi-service network: An implication for IP-based technologies.",
            "Situation-based shifts in consumer web site benefit importance: The joint role of cognition and affect.",
            "Designing usable online stores: A landscape preference perspective.",
            "Strategic Out-Tasking: Creating \"win-win\" outsourcing partnerships.",
            "A study of the service quality of general portals.",
            "A comparative study of important risk factors involved in offshore and domestic outsourcing of software development projects: A two-panel Delphi study.",
            "Self-efficacy, overconfidence, and the negative effect on subsequent performance: A field study.",
            "Online purchase intentions: A multi-channel store image perspective.",
            "The effectiveness of synchronous computer-mediated communication for solving hidden-profile problems: Further empirical evidence.",
            "Exploring the perceived business value of the flexibility enabled by information technology infrastructure.",
            "An e-commerce performance assessment model: Its development and an initial test on e-commerce applications in the retail sector of China.",
            "Factors affecting cross-hospital exchange of Electronic Medical Records.",
            "Inferring comprehensible business/ICT alignment rules.",
            "Do web sites change customers' beliefs? A study of prior-posterior beliefs in e-commerce.",
            "IT non-conformity in institutional environments: E-marketplace adoption in the government sector.",
            "Volunteers' involvement in online community based software development.",
            "A meta-analytic assessment of the DeLone and McLean IS success model: An examination of IS success at the individual level.",
            "Which reduces IT turnover intention the most: Workplace characteristics or job characteristics?",
            "Social relationship and its role in knowledge management systems usage.",
            "IT capabilities and firm performance: A contingency analysis of the role of industry and IT capability type.",
            "The impact of use context on mobile services acceptance: The case of mobile ticketing.",
            "The moderating effect of gender on relationship quality and loyalty toward Internet service providers.",
            "Managing e-government implementation in China: A process perspective.",
            "The role of trust in e-commerce relational exchange: A unified model.",
            "Cognitive engagement with a multimedia ERP training tool: Assessing computer self-efficacy and technology acceptance.",
            "Improving retention strategies for IT professionals working in the public sector.",
            "The acceptance and diffusion of the innovative smart phone use: A case study of a delivery service company in logistics.",
            "Risks and benefits of business process outsourcing: A study of transaction services in the German banking industry.",
            "Achieving it consultant objectives through client project success.",
            "Information security management standards: Problems and solutions.",
            "Relation of CIO background, IT infrastructure, and economic performance.",
            "Revisiting feedback systems: Trust building in digital markets.",
            "Using search theory to determine an applications selection strategy.",
            "The effects of national culture values on consumer acceptance of e-commerce: Online shoppers in China.",
            "Understanding the product information inference process in electronic word-of-mouth: An objectivity-subjectivity dichotomy perspective.",
            "B2B e-commerce supply chain integration and performance: A contingency fit perspective on the role of environment.",
            "CIO roles and responsibilities: Twenty-five years of evolution and change.",
            "Understanding the consequences of information systems service quality on IS service reuse.",
            "An intelligent multi-agent e-services method - An international telecommunication example.",
            "Extending technology usage to work settings: The role of perceived work compatibility in ERP implementation.",
            "Classification of RFID adoption: An expected benefits approach.",
            "A design methodology for form-based knowledge reuse and representation.",
            "Keeping up-to-date with information technology: Testing a model of technological knowledge renewal effectiveness for IT professionals.",
            "Antecedents and consequences of team memory in software development projects.",
            "The measurement of user satisfaction with question answering systems.",
            "Estimating the market impact of security breach announcements on firm values.",
            "Consumer perception of interface quality, security, and loyalty in electronic commerce.",
            "Mind your E-manners: Impact of cyber incivility on employees' work attitude and behavior.",
            "The impact of information and communication technology (ICT), education and regulation on economic freedom in Islamic Middle Eastern countries.",
            "Institutional pressures and mindful IT management: The case of a container terminal in China.",
            "Impact of ATM intensity on cost efficiency: An empirical evaluation in Taiwan.",
            "Psychological reactance to online recommendation services.",
            "Situated DSS for personal finance management: Design and evaluation.",
            "IT outsourcing and firm-level performance: A transaction cost perspective.",
            "Corrigendum to \"An intelligent multi-agent e-services method - An international telecommunication example\" [Inform. Manage. 46(2009) 342-350]."
        ]
    },
    {
        "name": "I&M",
        "year": "2008",
        "info": "Volume 45: 2008",
        "count": 62,
        "papers": [
            "The effects of perceived risk and technology type on users' acceptance of technologies.",
            "A coordination-theoretic investigation of the impact of electronic integration on logistics performance.",
            "The complexity of richness: Media, message, and communication outcomes.",
            "Analyzing the impact of a firm's capability on outsourcing success: A process perspective.",
            "The effect of positive mood on intention to use computerized decision aids.",
            "Determinants of accepting wireless mobile data services in China.",
            "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation.",
            "Exploring the absorptive capacity to innovation/productivity link for individual engineers engaged in IT enabled work.",
            "Trust in consumer-to-consumer electronic commerce.",
            "Developing a knowledge-based perspective on coordination: The case of global software projects.",
            "An empirical investigation of anti-spyware software adoption: A multitheoretical perspective.",
            "Explaining non-work-related computing in the workplace: A comparison of alternative models.",
            "Cultural diversity and information and communication technology impacts on global virtual teams: An exploratory study.",
            "Evaluating leadership, IT quality, and net benefits in an e-government environment.",
            "Managing emerging technology and organizational transformation: An acculturative analysis.",
            "Integrating the voice of customers through call center emails into a decision support system for churn prediction.",
            "Exploring the relationship between software project duration and risk exposure: A cluster analysis.",
            "The impact of price decreases on telephone and cell phone diffusion.",
            "Understanding Web-based learning continuance intention: The role of subjective task value.",
            "The impacts of user review on software responsiveness: Moderating requirements uncertainty.",
            "A cross-cultural analysis of the end-user computing satisfaction instrument: A multi-group invariance analysis.",
            "New product development team intelligence: Antecedents and consequences.",
            "Understanding information systems continuance: The case of Internet-based learning technologies.",
            "ERP and SCM systems integration: The case of a valve manufacturer in China.",
            "A study of B2B e-market in China: E-commerce process perspective.",
            "Exploring the effects of direct experience on IT use: An organizational field study.",
            "IT governance for enterprise resource planning supported by the DeLone-McLean model of information systems success.",
            "Assessment of process improvement from organizational change.",
            "Perceptions and use of electronic media: Testing the relationship between organizational interpretation differences and media richness.",
            "Self-regulated learning strategies and software training.",
            "Organizational competence for harnessing IT: A case study.",
            "Value creation in information-based industries through convergence: A study of U.S. mergers and acquisitions between 1993 and 2005.",
            "An auditing protocol for spreadsheet models.",
            "The e-commerce value matrix and use case model: A goal-driven methodology for eliciting B2C application requirements.",
            "An exploratory model of knowledge flow barriers within healthcare organizations.",
            "Training as regulation and development: An exploration of the needs of enterprise systems users.",
            "The effect of decision support system expertise on system use behavior and performance.",
            "An assessment of advanced mobile services acceptance: Contributions from TAM and diffusion theory models.",
            "Reuse of knowledge assets from repositories: A mixed methods study.",
            "Examining the effects of information system characteristics and perceived usefulness on post adoption usage of information systems.",
            "Moderating effects of Job Relevance and Experience on mobile wireless technology acceptance: Adoption of a smartphone by individuals.",
            "Do organizational citizenship behaviors lead to information system success?: Testing the mediation effects of integration climate and project management.",
            "A systematic approach for improving the quality of official statistics: Case of Korean information and telecommunication industry.",
            "Understanding knowledge management system usage antecedents: An integration of social cognitive theory and task technology fit.",
            "Information systems continuance intention of web-based applications customers: The case of online banking.",
            "Adopting organizational virtualization in B2B firms: An empirical study in Singapore.",
            "The effects of change control and management review on software flexibility and project performance.",
            "Inter-organizational relationships and the flow of information through value chains.",
            "Internet messaging: An examination of the impact of attitudinal, normative, and control belief systems.",
            "Social network, social trust and shared goals in organizational knowledge sharing.",
            "Exploring the potential effects of emoticons.",
            "The role of readiness for change in ERP implementation: Theoretical bases and empirical validation.",
            "Vendors' perspectives on trust and control in offshore information systems outsourcing.",
            "The atmospheric factors of online storefront environment design: An empirical experiment in Taiwan.",
            "The potential of synchronous communication to enhance participation in online discussions: A case study of two e-learning courses.",
            "Leadership and justice: Increasing non participating users' assessment of an IT through passive participation.",
            "Why people benefit from e-learning differently: The effects of psychological processes on e-learning outcomes.",
            "Determinants of successful virtual communities: Contributions from system characteristics and social factors.",
            "Determinants of ERP implementation knowledge transfer.",
            "Measuring e-government readiness.",
            "Contextual determinants and performance implications of information systems strategy planning within South African firms.",
            "Factors impacting the perceived organizational support of IT employees."
        ]
    },
    {
        "name": "I&M",
        "year": "2007",
        "info": "Volume 44: 2007",
        "count": 57,
        "papers": [
            "A profile of information systems research published in Information & Management.",
            "Public grid computing participation: An exploratory study of determinants.",
            "An industry-level knowledge management model - a study of information-related industry in Taiwan.",
            "The impact of context-aware fisheye models on understanding business processes: An empirical study of data flow diagrams.",
            "How interfirm collaboration benefits IT innovation.",
            "User acceptance of wireless short messaging services: Deconstructing perceived value.",
            "The use and impact of human resource information systems on human resource management professionals.",
            "A meta-analysis of the technology acceptance model: Investigating subjective norm and moderation effects.",
            "A comparison of Magal's service quality instrument with SERVPERF.",
            "How can the Web help build customer relationships?: An empirical study on e-tailing.",
            "The effects of optimistic and pessimistic biasing on software project status reporting.",
            "Advancement, voluntary turnover and women in IT: A cognitive study of work-family conflict.",
            "Evolution of e-commerce Web sites: A conceptual framework and a longitudinal study.",
            "An empirical investigation of socio-cultural factors of information sharing in China.",
            "Trust transference in brick and click retailers: An investigation of the before-online-visit phase.",
            "Discrepancies between desired and perceived measures of performance of IS professionals: Views of the IS professionals themselves and the users.",
            "The linkage between reporting quality and performance in IS projects.",
            "The effect of service employees' technology readiness on technology acceptance.",
            "Procedural coordination and offshored software tasks: Lessons from two case studies.",
            "Determinants of e-repurchase intentions: An integrative model of quadruple retention drivers.",
            "Investigating recognition-based performance in an open content community: A social capital perspective.",
            "An empirical analysis of open source software developers' motivations and continuance intentions.",
            "The impact of Web quality and playfulness on user acceptance of online retailing.",
            "Determinants of adoption of mobile games under mobile broadband wireless access environment.",
            "Process and technology challenges in swift-starting virtual teams.",
            "Perceived absorptive capacity of individual users in performance of Enterprise Resource Planning (ERP) usage: The case for Korean firms.",
            "Situational influences on ethical decision-making in an IT context.",
            "Exploring knowledge contribution from an OCB perspective.",
            "Business-to-business adoption of eCommerce in China.",
            "Internet anxiety: An empirical study of the effects of personality, beliefs, and social support.",
            "An empirical investigation of competency factors affecting e-business success in European SMEs.",
            "Web Acceptance Model (WAM): Moderating effects of user experience.",
            "The IT sales cycle as a source of context in IS implementation theory.",
            "A path model linking organizational knowledge attributes, information processing capabilities, and perceived usability.",
            "ERP systems adoption: An exploratory study of the organizational factors and impacts of ERP success.",
            "Evaluating healthcare information systems through an \"enterprise\" perspective.",
            "An alternative perspective on citation classics: Evidence from the first 10 years of the European Conference on Information Systems.",
            "Students' participation intention in an online discussion forum: Why is computer-mediated interaction attractive?",
            "Adoption of Technology-Mediated Distance Education: A longitudinal analysis.",
            "Threats and countermeasures for information system security: A cross-industry study.",
            "A contingency model for the allocation of media content in publishing companies.",
            "Equity perceptions as a deterrent to software piracy behavior.",
            "Post-adoption behavior of users of Internet Service Providers.",
            "Evaluating the supply chain performance of IT-based inter-enterprise collaboration.",
            "Effects of individuals' psychological states on their satisfaction with the GSS process.",
            "Risk management in ERP project introduction: Review of the literature.",
            "Assessing the strategic value of Information Technology: An analysis on the insurance sector.",
            "A Delphi study of knowledge management systems: Scope and requirements.",
            "Exploiting organizational knowledge in developing IS project cost and schedule estimates: An empirical study.",
            "A multi-level analysis of factors affecting software developers' intention to reuse software assets: An empirical investigation.",
            "Rethinking ERP success: A new perspective from knowledge management and continuous improvement.",
            "Mediators between coordination and IS project performance.",
            "Antecedents and consequences of team potency in software development projects.",
            "Are MIS research instruments stable? An exploratory reconsideration of the computer playfulness scale.",
            "A methodology for ERP misfit analysis.",
            "Information technology (IT) in Saudi Arabia: Culture and the acceptance and use of IT.",
            "Erratum to \"A multi-level analysis of factors affecting software developers' intention to reuse software assets: An empirical investigation\" [Inform. Manage. 44(2007) 613-625]."
        ]
    },
    {
        "name": "I&M",
        "year": "2006",
        "info": "Volume 43: 2006",
        "count": 80,
        "papers": [
            "The role played by perceived usability, satisfaction and consumer trust on website loyalty.",
            "Instructional video in e-learning: Assessing the impact of interactive video on learning effectiveness.",
            "Deployment of systems development methodologies: Perceptual congruence between IS managers and systems developers.",
            "An empirical investigation of the effects of data warehousing on decision performance.",
            "A decision model for managing software development projects.",
            "Analyzing the structure of expert knowledge.",
            "How involvement, IS management effectiveness, and end-user computing impact IS performance in manufacturing firms.",
            "Acceptance of electronic tax filing: A study of taxpayer intentions.",
            "What do we know about mobile Internet adopters? A cluster analysis.",
            "Knowledge sourcing methods.",
            "User satisfaction from commercial web sites: The effect of design and use.",
            "From process logic to business logic - A cognitive approach to business process management.",
            "Sticking to standards; technical and other isomorphic pressures in deploying ERP-systems.",
            "Migrating to internet-based e-commerce: Factors affecting e-commerce adoption and migration at the firm level.",
            "Internet market strategies: Antecedents and implications.",
            "Information technology personnel layoffs in US organizations: An exploratory investigation.",
            "A resource-based view of electronic commerce.",
            "STP technology: An overview and a conceptual framework.",
            "An examination of the determinants of customer loyalty in mobile commerce contexts.",
            "Agent-based buddy-finding methodology for knowledge sharing.",
            "Selection priority of process areas based on CMMI continuous representation.",
            "The leveraging influence of strategic alignment on IT investment: An empirical examination.",
            "An examination of the concern for information privacy in the New Zealand regulatory context.",
            "Assimilation patterns in the use of electronic procurement innovations: A cluster analysis.",
            "Understanding information technology acceptance by individual professionals: Toward an integrative view.",
            "A hybrid performance measure system for e-business investments in high-tech manufacturing: An empirical study.",
            "Experience effects on the accuracy of self-assessed user competence.",
            "Critical success factors of inter-organizational information systems - A case study of Cisco and Xiao Tong in China.",
            "Erratum to \"Efficiency analysis of controls in EDI applications\" [Information & Management 42 (2005) 425-439].",
            "A model for exploring the impact of purchasing strategies on user requirements determination of e-SRM.",
            "Interorganizational and organizational determinants of planning effectiveness for Internet-based interorganizational systems.",
            "The role of pleasure in web site success.",
            "Resources, dynamic capabilities and performance in a dynamic environment: Perceptions in Taiwanese IT enterprises.",
            "Strategic profiles and Internet Performance: An empirical investigation into the development of a strategic Internet system.",
            "The role of exogenous factors in technology acceptance: The case of object-oriented technology.",
            "The effectiveness of strategic information systems planning under environmental uncertainty.",
            "A study of the roles of trusts and risks in information-oriented online legal services using an integrated model.",
            "Sampling and pooling of decision-relevant information: Comparing the efficiency of face-to-face and GSS supported groups.",
            "Adaptive processes for knowledge creation in complex systems: The case of a global IT consulting firm.",
            "A contingency model of computer and Internet self-efficacy.",
            "Application of KM measures to the impact of a specialized groupware system on corporate productivity and operations.",
            "Delineating the effects of general and system-specific computer self-efficacy beliefs on IS acceptance.",
            "e-Service enhancement priority matrix: The case of an IC foundry company.",
            "Competing in the Brazilian real-time financial information services industry: Commitment and adaptation.",
            "Agent-mediated architecture for reputation-based electronic tourism systems: A neural network approach.",
            "Sharing and access right delegation for confidential documents: A practical solution.",
            "A procedure to design a structural and measurement model of Intellectual Capital: An exploratory study.",
            "B2C web site quality and emotions during online shopping episodes: An empirical study.",
            "An empirical study of software piracy among tertiary institutions in Singapore.",
            "Supporting dynamic group decision and negotiation processes: A traceability augmented peer-to-peer network approach.",
            "Success factors for information technology supported international technology transfer: Finding expert consensus.",
            "Segmenting online customers to manage business resources: A study of the impacts of sales channel strategies on consumer preferences.",
            "Testing the accuracy of the IT stereotype: Profiling IT managers' personality and behavioural characteristics.",
            "The mediation of external variables in the technology acceptance model.",
            "E-business differentiation through value-based trust.",
            "Measuring KMS success: A respecification of the DeLone and McLean's model.",
            "A meta-analysis of the technology acceptance model.",
            "A multivariate framework for the analysis of the digital divide: Evidence for the European Union-15.",
            "Data triangulation and web quality metrics: A case study in e-government.",
            "Separating the effects of knowledge construction and group collaboration in learning outcomes of web-based courses.",
            "Can technology build organizational social capital? The case of a global IT consulting firm.",
            "Compliance to the fair information practices: How are the Fortune 500 handling online privacy disclosures?",
            "Information systems outsourcing: A literature analysis.",
            "Deciding the financial health of dot-coms using rough sets.",
            "Determinants of adoption of High Speed Data Services in the business market: Evidence for a combined technology acceptance model with task technology fit model.",
            "Market reactions to E-business outsourcing announcements: An event study.",
            "Deriving managerial benefit from knowledge search: A paradigm shift?",
            "A study of factors that affect user intentions toward email service switching.",
            "Clarifying the effects of Internet monitoring on job attitudes: The mediating role of employee trust.",
            "Parametric search engines: What makes them effective when shopping online for differentiated products?",
            "Winner's curse and parallel sales channels - Online auctions linked within e-tail websites.",
            "The impact of role stress fit and self-esteem on the job attitudes of IT professionals.",
            "Strategy, IT applications for planning and control, and firm performance: The impact of impediments to IT implementation.",
            "Design aesthetics leading to m-loyalty in mobile commerce.",
            "Understanding the failure of internal knowledge markets: A framework for diagnosis and improvement.",
            "Organizational size and IT innovation adoption: A meta-analysis.",
            "A comparison of the behavior of different customer clusters towards Internet bookstores.",
            "A time-based assessment of the influences, uses and benefits of intermediary website adoption.",
            "Management of information systems: Insights from accounting research.",
            "Erratum to \"A study of factors that affect user intentions toward email service switching\" [Information & Management 43 (2006) 884-893]."
        ]
    },
    {
        "name": "I&M",
        "year": "2004",
        "info": "Volume 42: 2004/2005",
        "count": 80,
        "papers": [
            "Exploring the relationship between information technology investments and firm performance using regression splines analysis.",
            "The Delphi method as a research tool: an example, design considerations and applications.",
            "A group decision support approach to evaluating journals.",
            "Strategies for global information systems development.",
            "An exploratory study of object-oriented software component size determinants and the application of regression tree forecasting models.",
            "Modeling the planning process in advanced planning systems.",
            "Adopters and non-adopters of business-to-business electronic commerce in Singapore.",
            "Electronic coordination and collective action: use and effects of electronic calendaring and scheduling.",
            "Understanding software project risk: a cluster analysis.",
            "Beyond concern: a privacy-trust-behavioral intention model of electronic commerce.",
            "What influences IT ethical behavior intentions - planned behavior, reasoned action, perceived importance, or individual characteristics?",
            "Psychological antecedents of institution-based consumer trust in e-retailing.",
            "A framework for evaluating economics of knowledge management systems.",
            "Electronic commerce adoption: an empirical study of small and medium US businesses.",
            "Improving the quality of online presence through interactivity.",
            "An exploratory study of information technology evaluation and benefits management practices of SMEs in the construction industry.",
            "How political processes shaped the IT adopted by a small make-to-order company: a case study in the insulated wire and cable industry.",
            "The impact of IS sourcing type on service quality and maintenance efforts.",
            "Exploratory analysis on the halo effect of strategic goals on IOS effectiveness evaluation.",
            "Beyond concern - a privacy-trust-behavioral intention model of electronic commerce.",
            "The impact of presentation media on decision making: does multimedia improve the effectiveness of feedback?",
            "The impact of cognitive absorption on perceived usefulness and perceived ease of use in on-line learning: an extension of the technology acceptance model.",
            "Virtual fab: an enabling framework and dynamic manufacturing service provision mechanism.",
            "A spatio-temporal geometry-based model for digital documentation of historical living systems.",
            "Bullying on the net: adverse behavior on e-mail and its impact.",
            "Technology acceptance model for internet banking: an invariance analysis.",
            "Integrating AHP and data mining for product recommendation based on customer lifetime value.",
            "Extrinsic versus intrinsic motivations for consumers to shop on-line.",
            "Activity-based justification of IT investments.",
            "Efficiency analysis of controls in EDI applications.",
            "A case study of an inter-enterprise workflow-supported supply chain management system.",
            "Applying means-end chain theory to eliciting system requirements and understanding users perceptual orientations.",
            "KMPI: measuring knowledge management performance.",
            "Planning for IS applications: a practical, information theoretical method and case study in mobile financial services.",
            "The impact of partnership attributes on EDI implementation success.",
            "Using a fuzzy multi-criteria decision making approach to evaluate alternative licensing mechanisms.",
            "An empirical investigation of IT outsourcing versus quasi-outsourcing in France and Germany.",
            "Literature derived reference models for the adoption of online shopping.",
            "The language of quarterly reports as an indicator of change in the company's financial status.",
            "Development and validation of an instrument to measure user perceived service quality of information presenting Web portals.",
            "Implementation of a group decision support system utilizing collective memory.",
            "A transactional-cycle approach to evidence management for dispute resolution.",
            "Information technology Alignment Planning - a case study.",
            "Information Technology Alignment Planning - a case study.",
            "An intra- and inter-industry analysis of e-business effectiveness.",
            "Something for nothing: management rejection of open source software in Australia's top firms.",
            "Integrating perceived playfulness into expectation-confirmation model for web portal context.",
            "An experimental investigation of the impact of aggregation on the performance of data mining with logistic regression.",
            "Data warehouse-in-practice: exploring the function of expectations in organizational outcomes.",
            "What drives mobile commerce?: An empirical evaluation of the revised technology acceptance model.",
            "Evaluating the role and effectiveness of an intranet in facilitating knowledge management: a case study at Surrey County Council.",
            "A multi-group analysis of structural invariance: an illustration using the technology acceptance model.",
            "An empirical evaluation of stages of strategic information systems planning: patterns of process design and effectiveness.",
            "Does information technology provide banks with profit?",
            "Information technology productivity: in search of a definite observation.",
            "Web-based expert systems: benefits and challenges.",
            "Information transfer in B2B procurement: an empirical analysis and measurement.",
            "The relationship between information technology acceptance and organizational agility in Malaysia.",
            "Web performance scale.",
            "The state of CRM adoption by the financial services in the UK: an empirical investigation.",
            "Marketplace and technology standards for B2B e-commerce: progress, challenges, and the state of the art.",
            "eCommerce adoption in developing countries: a model and instrument.",
            "IS outsourcing management competence dimensions: instrument development and relationship exploration.",
            "Web services and flexible business processes: towards the adaptive enterprise.",
            "Identifying knowledge agents in a KM strategy: the use of the structural influence index.",
            "The enigma of evaluation: benefits, costs and risks of IT in Australian small-medium-sized enterprises.",
            "Extending the TAM for a t-commerce.",
            "Building user commitment to implementing a knowledge management strategy.",
            "Information technology investments and firm value.",
            "Time series analysis in the assessment of ICT impact at the aggregate level - lessons and implications for the new economy.",
            "An electronic commerce strategic typology: insights from case studies.",
            "Individual, social and situational determinants of telecommuter productivity.",
            "A discrete-event simulation and continuous software evaluation on a systemic quality model: An oil industry case.",
            "An exploratory study into factors of service quality for application service providers.",
            "Prevalence, perceived seriousness, justification and regulation of cyberloafing in Singapore: An exploratory study.",
            "Acceptance of Internet-based learning medium: the role of extrinsic and intrinsic motivation.",
            "Knowledge networks in new product development projects: A transactive memory perspective.",
            "The impact of service level on the acceptance of application service oriented medical records.",
            "Publication patterns concerning the role of teams/groups in the information systems literature from 1990 to 1999.",
            "Erratum to \"KMPI: Measuring knowledge management performance\" [Information & Management 42 (2005) 469-482]."
        ]
    },
    {
        "name": "I&M",
        "year": "2003",
        "info": "Volume 41: 2003/2004",
        "count": 74,
        "papers": [
            "Understanding senior management's behavior in promoting the strategic role of IT in process reengineering: use of the theory of reasoned action.",
            "The practice of IS/IT benefits management in large Australian organizations.",
            "A case study in the design of BTO/CTO shop floor control system.",
            "Modeling virtual exploratory and shopping dynamics: an environmental psychology approach.",
            "The impact of inadequacies in the treatment of organizational issues on information systems development projects.",
            "Strategic contributions of game rooms to knowledge management: some prelimenary insights.",
            "Assessment of learner satisfaction with asynchronous electronic learning systems.",
            "Active e-document framework ADF: model and tool.",
            "De-escalation of commitment in software projects: Who matters? What matters?",
            "A system implementation study: management commitment to project management.",
            "Automated facilitation of electronic meetings.",
            "The impact of partnership attributes on EDI implementation success.",
            "The IS risk analysis based on a business model.",
            "Barriers to adoption of software reuse: A qualitative study.",
            "The impact of enterprise application integration on information system lifecycles.",
            "Effects of multimedia on document browsing and navigation: an exploratory empirical investigation.",
            "A process for post-implementation IT benchmarking.",
            "Nstar: an interactive tool for local web search.",
            "Examining technology acceptance by school teachers: a longitudinal study.",
            "Examining possible antecedents of IT impact on the supply chain and its effect on firm performance.",
            "A taxonomy of players and activities across the ERP project life cycle.",
            "An exploration of the relationship between software development process maturity and project performance.",
            "User interface features influencing overall ease of use and personalization.",
            "Impact of heterogeneity and collaborative conflict management style on the performance of synchronous global virtual teams.",
            "Social support and leaving intention among computer professionals.",
            "Team structure and team performance in IS development: a social network perspective.",
            "An empirical study on predicting user acceptance of e-shopping on the Web.",
            "The development of initial trust in an online company by new customers.",
            "Integrating nominal group technique and joint application development for improved systems requirements determination.",
            "Developing a set of management needs for IS managers: a study of necessary managerial activities and skills.",
            "Understanding the local-level costs and benefits of ERP through organizational information processing theory.",
            "Knowledge management through the development of information schema.",
            "A model for Web adoption.",
            "Employees' opportunities, preferences, and practices in telecommuting adoption.",
            "Functional characteristics of commercial web sites: a longitudinal study in Hong Kong.",
            "Centralization as a design consideration for the management of call centers.",
            "Trust-building mechanisms utilized in outsourced IS development projects: a case study.",
            "Measuring the impact of organizational constraints on the success of business-to-business e-commerce efforts: a transactional focus.",
            "The conceptualization and empirical validation of web site user satisfaction.",
            "Digital signature: use and modification to achieve success in next generational e-business processes.",
            "Re-examining the measurement models of success for Internet commerce.",
            "Exploring the relationship between information technology and business process reengineering.",
            "Why there aren't more information security research studies.",
            "Online store image: conceptual foundations and empirical measurement.",
            "Dimensional hierarchy of retail website quality.",
            "Dimensions of power and IS implementation.",
            "Effectiveness of vendor-managed inventory in the electronics industry: determinants and outcomes.",
            "Structured modeling group support systems: a product design theory.",
            "The consideration of cultural differences in the design of information systems.",
            "The antecedents of consumers' loyalty toward Internet Service Providers.",
            "An exploratory study to identify the critical factors affecting the decision to establish Internet-based interorganizational information systems.",
            "An integrative model of computer abuse based on social control and general deterrence theories.",
            "Extended technology acceptance model of Internet utilization behavior.",
            "An extension of the technology acceptance model in an ERP implementation environment.",
            "Predicting consumer intentions to use on-line shopping: the case for an augmented technology acceptance model.",
            "The use of computer-based information systems by German managers to support decision making.",
            "Architectures in context: on the evolution of business, application software, and ICT platform architectures.",
            "Factors affecting engineers' acceptance of asynchronous e-learning systems in high-tech companies.",
            "eAirlines: strategic and tactical use of ICTs in the airline industry.",
            "Likelihood to abort an online transaction: influences from cognitive evaluations, attitudes, and behavioral variables.",
            "A multiple criteria evaluation of high-tech industries for the science-based industrial park in Taiwan.",
            "Why do people play on-line games? An extended TAM with social influences and flow experience.",
            "Antecedents of perceived playfulness: an exploratory study on user acceptance of general information-searching websites.",
            "Pluralistic multi-agent decision support system: a framework and an empirical test.",
            "The impact of industry contextual factors on IT focus and the use of IT for competitive advantage.",
            "A transaction cost model of IT outsourcing.",
            "Information technology as a facilitator for enhancing dynamic capabilities through knowledge management.",
            "Perceptions about the quality of web sites: a survey amongst students at Northeastern University and Erasmus University.",
            "A specification pattern for use cases.",
            "A theory of application service provider (ASP) use from a client perspective.",
            "Ideal patterns of strategic alignment and business performance.",
            "IS planning autonomy in US subsidiaries of multinational firms.",
            "A reversed context analysis of software piracy issues in Singapore.",
            "The role of communication values in swift starting action teams: IT insights from flight crew experience."
        ]
    },
    {
        "name": "I&M",
        "year": "2002",
        "info": "Volume 40: 2002/2003",
        "count": 63,
        "papers": [
            "Predicting customer behavior in the market-space: a study of Rayport and Sviokla's framework.",
            "Information systems evaluation: navigating through the problem domain.",
            "The critical success factors for ERP implementation: an organizational fit perspective.",
            "EIS evolution in large Spanish businesses.",
            "Perception gaps between IS academics and IS practitioners: an exploratory study.",
            "Managing risks in IT projects: an options perspective.",
            "Richness, power cues and email text.",
            "An innovation - diffusion view of implementation of enterprise resource planning (ERP) systems and development of a research model.",
            "Having expectations of information systems benefits that match received benefits: does it really matter?",
            "AIMQ: a methodology for information quality assessment.",
            "Modelling policies and decisions: A case study in mineral extraction.",
            "Your time and my time: a temporal approach to groupware calendar systems.",
            "Towards integrating hypermedia and information systems on the web.",
            "Expert versus novice use of the executive support systems: an empirical study.",
            "Why do people use information technology? A critical review of the technology acceptance model.",
            "Global corporate web sites: an empirical investigation of content and design.",
            "The impact of IS department organizational environments upon project team performances.",
            "Computer playfulness and anxiety: positive and negative mediators of the system experience effect on perceived ease of use.",
            "Selection of web sites for online advertising using the AHP.",
            "Performance measure of information systems (IS) in evolving computing environments: an empirical investigation.",
            "The effect of environmental uncertainty and strategic applications of IS on a firm's performance.",
            "Understanding it adoption decisions in small business: integrating current theories.",
            "Factors affecting information systems planning effectiveness: organizational contexts and planning systems dimensions.",
            "Diversification and performance of Japanese IT subsidiaries: a resource-based view.",
            "Satisfaction/dissatisfaction: are users predisposed?",
            "DSS implementation in the UK retail organisations: a GIS perspective.",
            "Development and evaluation of dynamic virtual object catalogs.",
            "Decision making performance of interacting groups: an experimental investigation of the effects of task type and communication mode.",
            "Perceived career incentives and intent to leave.",
            "Group decision support for public policy planning.",
            "UK executives' vision on business environment for information scanning: A cross industry study.",
            "An assessment of the relationship between ISD leadership characteristics and IS innovation adoption in organizations.",
            "An empirical investigation of KM styles and their effect on corporate performance.",
            "Workflow- and agent-based cognitive flow management for distributed team Cooperation.",
            "Mining inter-organizational retailing knowledge for an alliance formed by competitive firms.",
            "The influence of software developers' creative style on their attitudes to and assimilation of a software process innovation.",
            "CIO influence behaviors: the impact of technical background.",
            "Strategic information and strategic decision making: the EIS/CEO interface in smaller manufacturing companies.",
            "Learning style, learning patterns, and learning performance in a WebCT-based MIS course.",
            "Speech recognition in the human-computer interface.",
            "Beliefs and attitudes affecting intentions to share information in an organizational setting.",
            "Technology and knowledge: bridging a \"generating\" gap.",
            "Factors influencing the usage of websites: the case of a generic portal in The Netherlands.",
            "The concept of contingency beyond \"It depends\": illustrations from IS research stream.",
            "An assessment of EDI use and other channel communications on trading behavior and trading partner knowledge.",
            "E-business development for competitive advantages: a case study.",
            "An empirical study of smart card technology.",
            "Measures of perceived end-user computing skills.",
            "Improving searching and reading performance: the effect of highlighting and text color coding.",
            "Theory and support for process frameworks of knowledge discovery and data mining from ERP systems.",
            "A project management quality cost information system for the construction industry.",
            "E-commerce and corporate strategy: an executive perspective.",
            "The impact of software process improvement on quality: in theory and practice.",
            "The effect of task uncertainty, decentralization and AIS characteristics on the performance of AIS: an empirical case in Taiwan.",
            "Does the market recognize IT-enabled competitive advantage?",
            "An experimental investigation of electronic focus groups.",
            "Estimating the development cost of custom software.",
            "IS journal review process: a survey on IS research practices and journal review issues.",
            "Quality and effectiveness in Web-based customer support systems.",
            "Business process integration as a solution to the implementation of supply chain management systems.",
            "Escalating commitment to information system projects: findings from two simulated experiments.",
            "Quality management metrics for software development.",
            "Using a case study to test the role of three key social enablers in ERP implementation."
        ]
    },
    {
        "name": "I&M",
        "year": "2001",
        "info": "Volume 39: 2001",
        "count": 55,
        "papers": [
            "Determinants of the intention to use Internet/WWW at work: a confirmatory study.",
            "The role of GSS in participatory policy analysis: A field experiment.",
            "The joint impact of internal and external career anchors on entry-level IS career satisfaction.",
            "An exploratory examination of the relationship between flexible IT infrastructure and competitive advantage.",
            "Extending the effectiveness of simulation-based DSS through genetic algorithms.",
            "Assessing the impact of using the Internet for competitive intelligence.",
            "The impact of IT on decision structure and firm performance: evidence from the textile and apparel industry.",
            "Requirements acquisition for rapid applications development.",
            "Criticality of data quality as exemplified in two disasters.",
            "Forums for information systems scholars: III.",
            "A survey of business process reengineering practices in Singapore.",
            "Two conflict potentials during IS development.",
            "Using protocol analysis to evaluate the usability of a commercial web site.",
            "A model of Internet adoption by SMEs.",
            "Designing systems that support learning and use: a customer-centered approach.",
            "Modeling the business value of information technology.",
            "Business data mining - a machine learning perspective.",
            "Determinants of website development: a study of electronic commerce in Singapore.",
            "Collaborative assessment in education: an application of a fuzzy GSS.",
            "An action research report on the Korean national digital library.",
            "A new framework for interorganizational systems based on the linkage of participants' roles.",
            "A multiple-case design methodology for studying MRP success and CSFs.",
            "Internet-based e-banking and consumer attitudes: an empirical study.",
            "Investigating healthcare professionals' decisions to accept telemedicine technology: an empirical test of competing theories.",
            "A model for implementing BPR based on strategic perspectives: an empirical study.",
            "A federation-agent-workflow simulation framework for virtual organisation development.",
            "Real options analysis of the timing of IS investment decisions.",
            "Supply chain reengineering using a core process analysis matrix and object-oriented simulation.",
            "Using a spatial decision support system for solving the vehicle routing problem.",
            "Coping with client-based 'people-problems': the theories-of-action of experienced IS/software project managers.",
            "Technical efficiency analysis of information technology investments: a two-stage empirical investigation.",
            "Global information technology: a meta analysis of key issues.",
            "A literature review and classification of electronic commerce research.",
            "Effect of store design on consumer purchases: an empirical study of on-line bookstores.",
            "Preparing to work in the virtual organization.",
            "Key dimensions of business-to-consumer web sites.",
            "Developing and validating an instrument for measuring user-perceived web quality.",
            "Knowledge manipulation activities: results of a Delphi study.",
            "The benefits of data warehousing: why some organizations realize exceptional payoffs.",
            "A validation of the end-user computing satisfaction instrument in Taiwan.",
            "The impact of organizational commitment, senior management involvement, and team involvement on strategic information systems planning.",
            "A comparative study of business practices of North American and European on-line companies.",
            "The role of communication in organizational change: an empirical investigation.",
            "Computer monitoring: benefits and pitfalls facing management.",
            "A domain-driven approach to improving search effectiveness in traditional online catalogs.",
            "Electronic commerce in China: emerging success stories.",
            "A case of data warehousing project management.",
            "Task difficulty, task variability and satisfaction with management support systems.",
            "A model of computerization of manufacturing systems: an international study.",
            "Improving information requirements determination: a cognitive perspective.",
            "Specification of a capability-based IT classification framework.",
            "The relationship between information and communication technologies adoption and management.",
            "Cognitive style may mitigate the impact of communication mode.",
            "ODE: a tool for distributing object-oriented applications.",
            "Enticing online consumers: an extended technology acceptance perspective."
        ]
    },
    {
        "name": "I&M",
        "year": "2000",
        "info": "Volume 38: 2000/2001",
        "count": 40,
        "papers": [
            "Data mining for customer service support.",
            "Opportunities to enhance a commercial website.",
            "Exploring the factors associated with Web site success in the context of electronic commerce.",
            "Effects of downsizing policies on IS survivors' attitude and career management.",
            "Knowledge creation in focus groups: can group technologies help?",
            "Citation classics from the information systems literature.",
            "A comparative analysis of critical issues facing Canadian information systems personnel: a national and global perspective.",
            "User evaluations of IS as surrogates for objective performance.",
            "Does successful investment in information technology solve the productivity paradox?",
            "Implementation in a world of workstations and networks.",
            "The autistic society.",
            "Quality metrics for intranet applications.",
            "A process model cognitive biasing effects in information systems development and usage.",
            "The impact of emerging practices on IS specialists: perceptions, attitudes and role changes in Hong Kong.",
            "Output-driven information system planning: a case study.",
            "Patterns in the organization of transnational information systems.",
            "Extending the TAM for a World-Wide-Web context.",
            "Assessment of HIV/AIDS-related health performance using an artificial neural network.",
            "Surges and sediments: shaping the reception of reengineering.",
            "Issues of international information systems management: a perspective of affiliates.",
            "A confirmatory factor analysis of IS employee motivation and retention.",
            "Technological innovations: a framework for communicating diffusion effects.",
            "The AHP approach for selecting an automobile purchase model.",
            "Internet-based e-shopping and consumer attitudes: an empirical study.",
            "Marketing information systems in Fortune 500 companies: a longitudinal analysis of 1980, 1990, and 2000.",
            "The impact of knowledge sharing, organizational capability and partnership quality on IS outsourcing success.",
            "Factors influencing corporate web site adoption: a time-based assessment.",
            "Exploring the relationship between total quality management and information systems development.",
            "Emerging factors in user evaluation of the World Wide Web.",
            "A framework for developing Web information systems plans: illustration with Samsung Heavy Industries Co., Ltd.",
            "Diagnosing information systems success: importance-performance maps in the health club industry.",
            "A multiple criteria assessment of decision technology system journal quality.",
            "The assimilation of computer-aided marketing activities.",
            "Early project estimation in the formal communication protocol development.",
            "Valuation of mergers and acquisitions in the telecommunications industry: a study on diversification and firm size.",
            "Revenue streams and digital content providers: an empirical investigation.",
            "Security threats to Internet: a Korean multi-industry investigation.",
            "IS service performance: self-perceptions and user perceptions.",
            "A perception-based model for EDI adoption in small businesses using a technology-organization-environment framework.",
            "An empirical study of best practices in virtual teams."
        ]
    },
    {
        "name": "I&M",
        "year": "2000",
        "info": "Volume 37: 2000",
        "count": 28,
        "papers": [
            "Using a structured design approach to reduce risks in end user spreadsheet development.",
            "Management tradeoffs in anti-virus strategies.",
            "User resistance and strategies for promoting acceptance across system types.",
            "Fuzzy cognitive map for the design of EDI controls.",
            "SWAM - a structured WWW access model.",
            "Loosely coupled interorganizational workflows: : modeling and analyzing workflows crossing organizational boundaries.",
            "A model of end user attitudes and intentions toward alternative sources of support.",
            "An abductive model of group support systems.",
            "Flaming among first-time group support system users.",
            "Measuring user satisfaction with data warehouses: an exploratory study.",
            "Enhancing functionality in an enterprise software package.",
            "The content and design of web sites: an empirical study.",
            "Toward an empirical understanding of computer simulation implementation success.",
            "Customer relationships and the small software firm: A framework for understanding challenges faced in marketing.",
            "The effect of task complexity and conflict handling styles on computer-supported negotiations.",
            "Computer attitudes of non-computing academics: a study of technical colleges in Brunei Darussalam.",
            "An analysis of research in information systems (1981-1997).",
            "A comparison of the views of business and IT management on success factors for strategic alignment.",
            "Toward a holistic model of task design for IS professionals.",
            "Organizational adoption of open systems: a 'technology-push, need-pull' perspective.",
            "An empirical study of EDI trading partner selection criteria in customer-supplier relationships.",
            "What small business executives have learned about managing information technology.",
            "Methodological and practical aspects of data mining.",
            "The relationship between user participation and system success: a simultaneous contingency approach.",
            "Research issues in testing business components.",
            "Lessons learned from three interorganizational health care information systems.",
            "Developing a framework for analyzing IS sourcing.",
            "The effects of development process modeling and task uncertainty on development quality performance."
        ]
    },
    {
        "name": "I&M",
        "year": "1999",
        "info": "Volume 36: 1999",
        "count": 26,
        "papers": [
            "A system planning method based on templates for large-scale manufacturing information systems.",
            "Extending the technology acceptance model with task-technology fit constructs.",
            "Antidotes for high complexity and ambiguity in software development.",
            "The evolution of CASE usage in Finland between 1993 and 1996.",
            "Decision support system for conflict diagnosis in personnel selection.",
            "Project selection criteria by strategic orientation.",
            "Implementation predictors of strategic information systems plans.",
            "An exploratory field study of differences in information technology use between more- and less-innovative middle managers.",
            "EUCS test-retest reliability in representational model decision support systems.",
            "A scenario-based object-oriented hypermedia design methodology.",
            "Task and technology fit: a comparison of two technologies for synchronous and asynchronous group communication.",
            "Evaluation models of information technology in Spanish companies: a cluster analysis.",
            "Enterprise knowledge development: the process view.",
            "The influence of attitudes on personal computer utilization among knowledge workers: the case of Saudi Arabia.",
            "Post-merger systems integration: the impact on IS capabilities.",
            "Personal information privacy: implications for MIS managers.",
            "Software selection: a case study of the application of the analytical hierarchical process to the selection of a multimedia authoring system.",
            "Topics of interest in IS: evolution of themes and differences between research and practice.",
            "Assessing information systems strategy development frameworks in SMEs.",
            "Risks to different aspects of system success.",
            "Leadership behavior and business process reengineering (BPR) outcomes: An empirical analysis of 30 BPR projects.",
            "Facilitating implementation of total quality management through information technology.",
            "Competence and impact of tools for BPR.",
            "An examination of the decision styles of project managers: Evidence of significant diversity.",
            "An instrument for measuring meeting success: revalidation and modification.",
            "Communication media choice by workers in distributed environment."
        ]
    },
    {
        "name": "I&M",
        "year": "1999",
        "info": "Volume 35: 1999",
        "count": 27,
        "papers": [
            "Expert systems diffusion in British banking: Diffusion models and media factor.",
            "An exploratory study of small business Internet commerce issues.",
            "Understanding corporate data models.",
            "Four models for a decision support system.",
            "Information technology and firm performance: Linking with environmental, strategic and managerial contexts.",
            "Managing information technology (IT) for one-to-one customer interaction.",
            "Leading the development and implementation of collaborative interorganizational systems.",
            "The initiation and adoption of client-server technology in organizations.",
            "Adoption and implementation of CASE tools in Taiwan.",
            "Knowledge-based systems and knowledge management: Friends or foes?",
            "An examination of the IT satisfaction of small-business users.",
            "Workers' propensity to telecommute: An empirical study.",
            "Requirements-driven data engineering.",
            "Self-directed teams in IS: correlates for improved systems development work outcomes.",
            "Compensating effects of GSS on group performance.",
            "System usage behavior as a proxy for user satisfaction: an empirical investigation.",
            "On the use of construct reliability in MIS research: a meta-analysis.",
            "The effect of user engagement on system success: A meta-analytical integration of research findings.",
            "The psychological origins of perceived usefulness and ease-of-use.",
            "Managing user performance for a corporate network.",
            "Planning for information technology in a federated organization.",
            "A software reuse measure: Monitoring an enterprise-level model driven development process.",
            "Impact of communication medium on task performance and satisfaction: an examination of media-richness theory.",
            "Patterns of senior executives' personal use of computers.",
            "Surveying object technology usage and benefits: A test of conventional wisdom.",
            "Information technology for collaborative advantage in healthcare revisited.",
            "A neural networks-based approach for strategic planning."
        ]
    },
    {
        "name": "I&M",
        "year": "1998",
        "info": "Volume 34: 1998",
        "count": 31,
        "papers": [
            "Software development cost estimation: Integrating neural network with cluster analysis.",
            "The relation between user satisfaction, usage of information systems and performance.",
            "Using object concepts to match artificial intelligence techniques to problem types.",
            "Decision support with neural networks in the management of research and development: Concepts and application to cost estimation.",
            "An application of the cusp catastrophe model to user information satisfaction.",
            "Information acquisition in group decision making.",
            "Electronic data interchange: a multi-industry investigation using grounded theory.",
            "Symbolic rule extraction from neural networks: An application to identifying organizations adopting IT.",
            "Managing information technology in modernizing 'against the odds': Lessons from an organization in a less-developed country.",
            "A comprehensive approach to assess the value of EDI.",
            "Neural network applications in finance: A review and analysis of literature (1990-1996).",
            "The influence of information technology diffusion and business process change on perceived productivity: The IS executive's perspective.",
            "Acceptable protection of software intellectual property: a survey of software developers and lawyers.",
            "Competitor and vendor influence on the adoption of innovative applications in electronic commerce.",
            "The effects of user participation on the design of accounting information systems.",
            "Case study: The effect of IS maturity on information systems strategic planning.",
            "Applying CSCW technology to overcome traditional barriers in group interactions.",
            "Beyond the interface: Ease of use and task/technology fit.",
            "An eight experiment sequence to determine reading equality.",
            "Complex document search for decision making.",
            "Perceived task complexity as a criterion for information support.",
            "Matching client/server processing architectures with information processing requirements: A contingency study.",
            "Attitudes toward computers: when do they predict computer use?",
            "A survey study of the current IS usage in the Chinese manufacturing industry.",
            "Can communication medium limitations foster better group outcomes? An action research study.",
            "Effect of GSS on knowledge acquisition.",
            "An empirical investigation into the adoption of systems development methodologies.",
            "Participation in videoconferenced meetings: user disposition and meeting context.",
            "An empirical study of adoptors and non-adopters of the Internet in Singapore.",
            "Impact of information technology on users' work environment: A case of computer aided design (CAD) system implementation.",
            "Opportunities of effective integration of EDI for small businesses in the automotive industry."
        ]
    },
    {
        "name": "I&M",
        "year": "1997",
        "info": "Volume 33: 1997/1998",
        "count": 26,
        "papers": [
            "Testing the technology acceptance model across cultures: A three country study.",
            "The state of strategic IS planning practices in Singapore.",
            "A comparison of synchronous and virtual legislative session groups faced with an idea generation task.",
            "Information systems variables and management productivity.",
            "Understanding and measuring user competence.",
            "Information technology investments in purchasing: An empirical study of dimensions and antecedents.",
            "The effect of EDI on market channel relationships in retailing.",
            "Critical factors of ISDN implementation: An exploratory study.",
            "Strategic planning for data warehousing.",
            "Material matters: Assessing the effectiveness of materials management IS.",
            "The impacts of presentation visuals on persuasion.",
            "Impact of task uncertainty, end-user involvement, and competence on the success of end-user computing.",
            "Rho: A decision support system for pricing in law firms.",
            "Developing a multidimensional measure of system-use in an organizational context.",
            "Process reverse engineering for BPR: A form-based approach.",
            "Environmental scanning and information systems in relation to success in introducing new products.",
            "A feedback model to understand information system usage.",
            "Identifying early adopters of new IT products: A case of Windows 95.",
            "Group decision support systems and incentive structures.",
            "Beyond the information center: An instrument to measure end-user computing support from multiple sources.",
            "An empirical assessment of a multimedia executive support system.",
            "Management of emerging technologies: Experiences and lessons learned at US West.",
            "A graph-based approach for rule integrity and maintainability in expert system maintenance.",
            "GSS participation: A cultural examination.",
            "Data management in executive information systems.",
            "Examining the conflicting results of GDSS research."
        ]
    },
    {
        "name": "I&M",
        "year": "1997",
        "info": "Volume 32: 1997",
        "count": 25,
        "papers": [
            "Dynamic process modeling for BPR: A computerized simulation approach.",
            "Perceived importance of information system success factors: A meta analysis of group differences.",
            "Misplaced resources? Factors associated with computer literacy among end-users.",
            "Managing natural resources using GIS: Experiences in India.",
            "User participation in knowledge update of expert systems.",
            "On human cognition and the design of information systems.",
            "An examination of executive information system (EIS) users.",
            "Differences in end-user computing support and control across user departments.",
            "Lessons from notebook/mobile computing.",
            "The consequences of information technology acceptance on subsequent individual performance.",
            "An examination of designer and user perceptions of JAD and the traditional IS design methodology.",
            "Evaluating security threats in mainframe and client/server environments.",
            "A conceptual model for virtual markets.",
            "An instrument for measuring meeting success.",
            "Chargeback systems in client/server environments.",
            "Exploring the research in information technology implementation.",
            "The relationships between management styles, user participation, and system success over MIS growth stages.",
            "Management information systems in the Chinese business culture: An explanatory theory.",
            "Developing a model of the global and strategic impact of information technology.",
            "The impact of e-mail on the evolution of a virtual community during a strike.",
            "User information satisfaction, job satisfaction and computer background: An exploratory study.",
            "ISO 9000 versus CMM: Standardization and certification of IS development.",
            "The acceptance of visual information in management.",
            "Information systems integration in mergers and acquisitions: A normative model.",
            "Modeling information architecture for the organization."
        ]
    },
    {
        "name": "I&M",
        "year": "1996",
        "info": "Volume 31: 1996/1997",
        "count": 27,
        "papers": [
            "Key issues in information systems management: A Delphi study in Slovenia.",
            "A framework for studying computer support of organizational infrastructure.",
            "Exploring factors underlying effective office information systems.",
            "Diffusion of E-mail: An organisational learning perspective.",
            "Inductive machine learning for instrument development.",
            "IS project team performance: An empirical assessment.",
            "Determination of an implementation order for IS projects.",
            "Electronic publishing: A product architecture perspective.",
            "Identifying the value and importance of an information system application.",
            "An expanded instrument for evaluating information system success.",
            "The use of spreadsheets in organizations: Determinants and consequences.",
            "Standardization, requirements uncertainty and software project performance.",
            "A model and instrument for measuring small business user satisfaction with information technology.",
            "Offshore outsourcing of software development and maintenance: A framework for issues.",
            "Information systems effectiveness: The construct space and patters of application.",
            "Before and after CASE adoption.",
            "Corporate mergers and the problems of IS integration.",
            "The impact and benefits of a DSS: The case of FleetManager.",
            "An empirical investigation of the contribution of IS to manufacturing productivity.",
            "A hypermedia database to manage World-Wide-Web documents.",
            "IT process designs for improving information quality and reducing exception handling: A simulation experiment.",
            "Software piracy and its legal implications.",
            "Changing information technology and information technology management.",
            "Desktop video conferencing in the organisation.",
            "Centralization/decentralization cycles in computing: Market evidence.",
            "Managing EDI for corporate advantage: A longitudinal study.",
            "Web sites of the Fortune 500 companies: Facing customers through home pages."
        ]
    },
    {
        "name": "I&M",
        "year": "1996",
        "info": "Volume 30: 1996",
        "count": 28,
        "papers": [
            "Comparison of end-user computing characteristics in the U.S., Israel and Taiwan.",
            "Expert systems adoption. An analytical study of managerial issues and concerns.",
            "Mode and gender effects on survey data quality.",
            "Exploring the effects of some display and task factors on GSS user groups.",
            "Electronic focus groups: A framework for exploration.",
            "A transaction cost approach to outsourcing behavior: Some empirical evidence.",
            "A structural model of end user computing satisfaction and user performance.",
            "The temporal nature of IS benefits: A longitudinal study.",
            "The effects of information systems integration and organizational culture on a firm's effectiveness.",
            "A comparison of two electronic idea generation techniques.",
            "Life in the middle: An analysis of information centers from the perspective of their major stakeholders.",
            "Trends in computer use in collective bargaining.",
            "Factors important to expert systems success a field test.",
            "Swords and plowshares: Information technology for collaborative advantage.",
            "FDA import automation: Serious management and systems development problems persist.",
            "Some empirical evidence on IS Strategy Alignment in banking.",
            "Toward IT support for coordination in network organizations.",
            "Critical success factors in data management.",
            "Copyrighting computer software: The \"look and feel\" controversy and beyond.",
            "Expert systems: A survey of their use in UK business.",
            "Case-based reasoning for intelligent support of construction negotiation.",
            "IT divergence in reengineering support: Performance expectations vs. perceptions.",
            "Key information management issues in Taiwan and the US.",
            "An empirical investigation on factors affecting the acceptance of CASE by systems developers.",
            "The effects of a group decision support system on culturally diverse and culturally homogeneous group decision making.",
            "The importance of salary on job and career attitudes of information systems professionals.",
            "Key issues in the management of information systems: A Hong Kong perspective.",
            "Assessing the impact of integrating business planning and IS planning."
        ]
    },
    {
        "name": "I&M",
        "year": "1995",
        "info": "Volume 29: 1995",
        "count": 31,
        "papers": [
            "The evolution of information systems in small firms.",
            "Developing a prototype job evaluation expert system: A compensation management application.",
            "MIS research: Journal status assessment and analysis.",
            "An experimental investigation of factors influencing predicted success in DSS implementation.",
            "Re-engineering the executive: The 4th generation of EIS.",
            "Critical success factors in implementing MRP and government assistance: A Singapore context.",
            "Factors used in the selection of packaged software in small businesses: Views of owners and managers.",
            "Cognitive evaluation of system representation diagrams.",
            "Executive information systems: A study and comparative analysis.",
            "Using an object-oriented approach to the development of a relational database application system.",
            "The CEO/CIO relationship revisited: An empirical assessment of satisfaction with IS.",
            "ISDN implementation in the United States and Germany: A cross-country assessment.",
            "Expert system applications in business: A review and analysis of the literature (1977-1993).",
            "Determinates of EIS acceptance.",
            "Application of a matrix approach to estimate project skill requirements.",
            "Decision variables for selecting prototyping in information systems development: A Delphi study of MIS managers.",
            "An assessment of the job prospects of MIS doctoral students in the academic marketplace.",
            "Intelligent database design using the unifying semantic model.",
            "An empirical examination of the impact of computer information systems on users.",
            "Computer-aided software engineering: The determinants of an effective implementation strategy.",
            "Why do individuals use computer technology? A Finnish case study.",
            "Job orientation, perceptions, and satisfaction a study of information technology professionals in Singapore.",
            "Total Quality Management. Are information systems managers ready?",
            "A dialectic view of information systems outsourcing: Pros and cons.",
            "Managing software quality in a very large development project.",
            "PC software industry lost $8.08 billion to pirates in 1994 piracy rate in the US declines.",
            "An objective, entropy-based approach to evaluating migration issues in computer IS.",
            "A neural network approach to forecasting model selection.",
            "Information technology use by managers in Greece to support decision making: Amount, perceived value, and satisfaction.",
            "Using interdependence as a predictor of data standards. Theoretical and measurement issues.",
            "Object-oriented task analysis."
        ]
    },
    {
        "name": "I&M",
        "year": "1995",
        "info": "Volume 28: 1995",
        "count": 31,
        "papers": [
            "Comparing IS development tools and methods: Using speech act theory.",
            "Marketing information systems in the top U.S. companies: A longitudinal analysis.",
            "A study of the strategic planning practices in Singapore.",
            "Multilevel security for information retrieval systems - II.",
            "Extraversion and introversion in electronically-supported meetings.",
            "An examination of organizational strategies for supporting DSS.",
            "Interorganizational information systems and the structure and climate of seller-buyer relationships.",
            "The differential use of written, computer-based and verbal information in an organizational context An empirical exploration.",
            "Conceptual framework and guidelines for the implementation of mass information systems.",
            "Investment in information systems and the financial performance of the firm.",
            "Attitudes of end-users towards information technology in manufacturing and service industries.",
            "Minimizing maintenance anomalies in expert systems.",
            "Reaping EDI benefits through a pro-active approach.",
            "A process-oriented framework for the evaluation of managerial support systems.",
            "A case study of a mass information system.",
            "Commercializing public information: A critical issue for governmental IS professionals.",
            "Increasing staff education: Effects on the use of information sources.",
            "Promoting consensus in small decision making groups.",
            "A design and implementation model for life cycle cost management system.",
            "Empirical studies in software development projects: Field survey and OS/400 study.",
            "System development effectiveness: An agency theory perspective.",
            "Knowledge-based portfolio analysis for project evaluation.",
            "A Korean group decision support system.",
            "User participation in system development revisited.",
            "Comparison of object-oriented and traditional systems development issues in distributed environments.",
            "Robots: A boon for working man?",
            "Pre-physical data base design heuristics.",
            "An investigation of a cost-effective solution for multimedia medical information management.",
            "Experiences and expectations with CASE technology - An example from Slovenia.",
            "Decision support for \"messy\" problems.",
            "Expert systems reliability: A life cycle approach."
        ]
    },
    {
        "name": "I&M",
        "year": "1994",
        "info": "Volume 27: 1994",
        "count": 30,
        "papers": [
            "DFQL: Dataflow query language for relational databases.",
            "The inertial impact of culture on IT implementation.",
            "A descriptive study on the outsourcing of information systems functions.",
            "An empirical investigation into decision support systems capabilities: A proposed taxonomy.",
            "The ten most valuable components of an information systems education.",
            "Facilitators and inhibitors for the strategic use of information technology.",
            "Expert systems shell benchmarks: The missing comparison factor.",
            "The effect of information presentation on decision making: A cost-benefit analysis.",
            "A morphological approach to generating information technology product ideas.",
            "The CIO's chief concern: Communication.",
            "Electronic brainstorming in small and large groups.",
            "Effects of computer system components on the price of notebook computers.",
            "Determinants of computing in very small businesses.",
            "Prototyping: A metaphor for cross-cultural transfer and implementation of IS applications.",
            "Systems analysis: A decision approach.",
            "Decision making under time pressure: A model for information systems research.",
            "User information satisfaction: IS implementability and effectiveness.",
            "Using knowledge-based systems for strategic market assessment.",
            "Traditionally-moderated versus computer supported brainstorming: a comparative study.",
            "Marketing and technology strategy in a \"medium-tech\" startup.",
            "MIS planning: A methodology for systems prioritization.",
            "Deep structures: Real information requirements determination.",
            "Effect of IS variables on information acquisition modes: An experimental investigation.",
            "Artificial neural networks and their business applications.",
            "Managing information systems within Japanese companies in Europe: An empirical study.",
            "A comparison of three computer cursor control devices: pen on horizontal tablet, mouse and keyboard.",
            "Video conferencing human-machine interface: A field study.",
            "National infrastructure diffusion and the U.S. information super highway.",
            "Managerial use of video conferencing.",
            "Can information technology improve managerial problem finding?"
        ]
    },
    {
        "name": "I&M",
        "year": "1994",
        "info": "Volume 26: 1994",
        "count": 30,
        "papers": [
            "Building an IS architecture: Collective wisdom from the field.",
            "Measurement: A blueprint for theory-building in MIS.",
            "The test-retest reliability of user involvement instruments.",
            "Managing organizational DSS development in small manufacturing enterprise.",
            "Tying critical success factors to systems development.",
            "Electronic data interchange: Characteristics of users and nonusers.",
            "A model of ISDN (integrated services digital network) adoption in U.S. corporations.",
            "Allocating data files over a wide area network: Goal setting and compromise design.",
            "Knowledge acquisition skills and traits: A self-assessment of knowledge engineers.",
            "An investigation of the relative presentation efficiency of computer-displayed graphs.",
            "Is user satisfaction a valid measure of system effectiveness?",
            "Exploring the relationship between IC success and company performance.",
            "A framework for information security evaluation.",
            "A group decision support system for multilingual groups.",
            "Factors affecting the implementation outcome of a mainframe software package: A longitudinal study.",
            "Firms that choose outsourcing: A profile.",
            "The effect of group size on group performance in computer-supported decision making.",
            "An asynchronous distributed algorithm for real-time payments-processing in a partially-connected network of banks.",
            "Turnover and remuneration of information technology professionals in Singapore.",
            "Electronic messaging and communication effectiveness in an ongoing work group.",
            "Predictors of intention of IS professionals to stay with the organization in South Africa.",
            "Interorganizational information systems: New approaches to global economic development.",
            "Strategic information technology plan: A vital component in the corporate strategies of banks.",
            "Implementing information technology for competitive advantage: Risk management issues.",
            "Impacts of problem structure and computerized decision aids on decision attitudes and behaviors.",
            "A survey of rural small business computer use: Success factors and decision support.",
            "Benchmarking human resource information systems in Canada and Hong Kong.",
            "Managing new information technologies: Lessons from Singapore's experience with EDI.",
            "The evaluation of strategic information system planning.",
            "Information systems management issues in the Republic of China for the 1990s."
        ]
    },
    {
        "name": "I&M",
        "year": "1993",
        "info": "Volume 25: 1993",
        "count": 30,
        "papers": [
            "User involvement and user satisfaction: An exploratory contingency model.",
            "A comparative review of CASE shells: A preliminary framework and research outcomes.",
            "The effects of dialectical inquiry, devil's advocacy, and consensus inquiry methods in a GSS environment.",
            "Analysis and improvement of software engineering processes.",
            "A multinomial project evaluation and review technique for information systems analysis and design.",
            "Information systems development and communicative action theory.",
            "A field examination of system life cycle techniques and methodologies.",
            "Advantages and disadvantages of electronic data interchange an industry perspective.",
            "A method for CASE tool evaluation.",
            "The impact of purchasing policy on electronic markets and electronic heirarchies.",
            "A framework for studying human error behavior in conceptual database modeling.",
            "Quality control in software documentation: Measurement of text comprehensibility.",
            "Determining information system usage: Some issues and examples.",
            "Chargeback and maturity of IS use.",
            "Reducing bias in user's evaluations of information systems.",
            "An assessment of electronic meeting systems in a corporate setting.",
            "Strategic information systems and competitiveness: Are firms ready for an IST-driven competitive challenge?",
            "Information technology and organizational performance: A critical evaluation of Computerworld's index of information systems effectiveness.",
            "Expert systems and organizational decision-making.",
            "Measuring and aligning information systems with the organization: A case study.",
            "A citation analysis of business computing research journals.",
            "End-user control environments and the accounting managers' perceived quality of the applications.",
            "A cognitive engineering-based approach to designing hypermedia applications.",
            "An organizational communications perspective on knowledge-based mail systems.",
            "Evaluating cost/utilization of organizations' information systems and users.",
            "Technology: toys or tools?: Results of a Dutch Delphi study.",
            "Developing end-users' systems development competence: An exploratory study.",
            "Knowledge workers' use of support software in Saudi Arabia.",
            "Lessons from the 80s: The tale of one MIS department.",
            "Identifying the causes of resistance to IS implementation: A change theory perspective."
        ]
    },
    {
        "name": "I&M",
        "year": "1993",
        "info": "Volume 24: 1993",
        "count": 30,
        "papers": [
            "Experimentation with a back-propagation neural network: An application to planning end user system development.",
            "A comparative evaluation of the impact of electronic and voice mail on organizational communication.",
            "The career decision of information systems people.",
            "Offshore systems development.",
            "Structured development techniques for user-developed systems.",
            "An investigation of keypad interface security.",
            "Current practices in management information systems.",
            "Improving quality, speed and confidence in decision-making: Measuring expert systems benefits.",
            "Application areas and added value of knowledge base systems.",
            "Multilevel security for information retrieval systems.",
            "The evolution of empirical research in IS: A study in IS maturity.",
            "An investigation into knowledge acquisition using a group decision support system.",
            "Using information technology effectively: Organizational preparedness models.",
            "The place and value of documentation in end-user computing.",
            "Forecasting with neural networks: An application using bankruptcy data.",
            "An empirical study of computer capacity planning in U.S. universities.",
            "A comparison of business school computer usage in Europe and North America.",
            "An evaluation method for the availability of a distributed database management system.",
            "Selecting expert system development techniques.",
            "Variations in users' definitions of an information system.",
            "The stage hypothesis revisited: An EDP professionals' point of view.",
            "Customer information systems: Approaching a new field in information systems from a new perspective.",
            "Purchasing software systems: Managing the risk.",
            "Financial risk and financial risk management technology (RMT): Issues and advances.",
            "A management information system for a Chinese university.",
            "Supercomputing in corporate America: A sample survey.",
            "Analyzing methodological rigor of MIS survey research from 1980-1989.",
            "Information systems planning and the challenge of shifting priorities.",
            "Organized and strategic utilization of information technology: A nationwide approach.",
            "On the nationality balance of authors and references in selected MIS journals."
        ]
    },
    {
        "name": "I&M",
        "year": "1992",
        "info": "Volume 23: 1992",
        "count": 30,
        "papers": [
            "Creativity software and DSS: Cautionary findings.",
            "Developing informatics policies.",
            "Electronic data interchange in an industrial sector: The case of The Netherlands' building industry.",
            "Expert systems for organizational and managerial tasks.",
            "An experimental study of the efficacy of tables versus bar graphs with respect to type of task.",
            "Group decision support systems: Towards a conceptual foundation.",
            "A case study of a tactical information system.",
            "Facilitating the adoption of information technology in a developing country.",
            "Executive information systems: A critical perspective.",
            "Communication technologies and collaboration systems: Common domains, problems and solutions.",
            "A classification of advanced office systems to aid in their development.",
            "Downsizing at CBS/FOX video.",
            "Streamlining information science research and education.",
            "Human and machine roles in team product reviews: A prescription for change.",
            "Patterns of structural control in high and low computer user organizations.",
            "An investigation of satisfaction when using a voice-synchronous GDSS in dispersed meetings.",
            "Software tasks: Intellectual or clerical?",
            "Software piracy and software security measures in business schools.",
            "Computer infectors: Prevention, detection, and recovery.",
            "The factors affecting strategic information systems applications: An empirical assessment.",
            "An examination of DBMS adoption and success in American organizations.",
            "Selection of a good expert system shell for instructional purposes in business.",
            "Effects of computer experience and task complexity on attitudes of managers.",
            "The effects of information centers on the growth of end user computing.",
            "Diagnosis of an information system failure: A framework and interpretive process.",
            "The reasons for turnover of information systems personnel.",
            "Integrating information systems technologies to support consultation in an information center.",
            "Capital budgeting in information systems development.",
            "Factors affecting decision support system benefits.",
            "An automated idea consolidation tool for computer supported cooperative work."
        ]
    },
    {
        "name": "I&M",
        "year": "1992",
        "info": "Volume 22: 1992",
        "count": 31,
        "papers": [
            "A model of end-user computing policy: Context, process, content and compliance.",
            "An examination of microcomputer usage in Taiwan.",
            "An experimental comparison of abstract and concrete representations in systems analysis.",
            "Data processing aspects of the integrated circuit and magnetic stripe cards.",
            "Computerization and management: A study of conflict and change.",
            "Editorial.",
            "Task uncertainty and the use of computer technology.",
            "A causal path model of the overall user attitudes toward the MIS function: The case of user information satisfaction.",
            "The relationship between procedural formalization in MIS development and MIS success: A contingent analysis.",
            "Are information centers responsive to end user needs?",
            "Rethinking the effectiveness measures of decision support systems.",
            "Factors that affect user-friendliness in interactive computer programs.",
            "Attitudes and intentions of information center personnel.",
            "IT structures for the 1990s: organisation of IT functions in large companies: A survey.",
            "Post-divestiture telecommunications: Priorities, issues and concerns.",
            "Electronic meeting systems as innovation: A study of the innovation process.",
            "Current status of DSS use in Taiwan.",
            "An examination of end-user types.",
            "Effects of information system education and training on user satisfaction: An empirical evaluation.",
            "The use of expert systems in the healthcare industry.",
            "Estimation of information systems development efforts: A pilot study.",
            "A framework for effective data collection, usage and maintenance of DSS.",
            "Motivating IT professionals: The Hong Kong challenge.",
            "A measure for determining the strategic relevance of IS to the organization.",
            "Personal DSS success in small enterprises.",
            "Impact of consultants on computerization success in small businesses.",
            "Self-improving expert systems: An architecture and implementation.",
            "Organizational hurdles to distributed database management systems (DDBMS) adoption.",
            "A structural analysis of database management system technology with some Japanese experience.",
            "Accounting for information technology in corporate acquisitions.",
            "AUTOREF: A deductive database for automatic referee selection."
        ]
    },
    {
        "name": "I&M",
        "year": "1991",
        "info": "Volume 21: 1991",
        "count": 25,
        "papers": [
            "Usability of knowledge-based systems: Beyond technical feasibility.",
            "A comparison of perceptions about information center success.",
            "An information system profile of U.S. companies.",
            "On the use of software cost models.",
            "A framework for data communication design using a knowledge based approach.",
            "Linear regression and information systems: An exploratory study.",
            "Organization and management of information systems functions: Comparative study of selected organizations in Bahrain.",
            "A DSS approach for implementing an online retail banking system: A case study.",
            "Identifying organizational culture clash in MIS implementation: When is it worth the effort?",
            "Multinational issues in information technology: A perspective from less developed countries.",
            "Security-related behavior of PC users in organizations.",
            "Success factors for strategic information systems.",
            "Decision conferencing for systems planning.",
            "Critical success factor analysis for information systems performance measurement and enhancement: A case study in the university environment.",
            "A knowledge-based approach for improving information and decision making in a small business.",
            "IT: running fast and standing still?",
            "Strategic planning for office automation.",
            "On end-user computing productivity: Results of controlled experiments.",
            "Performance evaluation of a knowledge-based system: A validation study.",
            "Information as inventory: A new conceptual view.",
            "Managing information technology in the nineties.",
            "The role of prototyping in executive decision systems.",
            "Managing J. Pierrepont Finch: Should he be given a PC?, .",
            "Artificial intelligence based simulation in the design of a GDSS idea generation tool.",
            "Selecting a requirement determination methodology-contingency approach revisited."
        ]
    },
    {
        "name": "I&M",
        "year": "1991",
        "info": "Volume 20: 1991",
        "count": 30,
        "papers": [
            "Major IS concerns of entrepreneurial organizations.",
            "Security concerns of system users: A study of perceptions of the adequacy of security.",
            "The status of marketing information systems, decision support systems and expert systems in the marketing function of U.S. firms.",
            "The information loop as a general analytic view.",
            "Draining the swamp: Defining strategic use of the information systems resource.",
            "Technology diffusion in a centralized MIS environment: Experiences at Carrier.",
            "The effect of computerized decision aids on decision time and decision quality.",
            "Consultant engagement for computer system selection: A pro-active client role in small businesses.",
            "Object-oriented databases and their impact on future business database applications.",
            "An alternative to emulation for micro-mainframe data exchange.",
            "Social worlds, individual differences, and implementation: Predicting attitudes toward a medical information system.",
            "An assessment of DSS performance: The impact of utilization and closure.",
            "Information technology and global competition: A framework for analysis.",
            "Price/performance of desktop computers in the U.S. computer industry.",
            "Training needs of novices and experts with referent experience and task domain knowledge.",
            "Towards a theory of strategic use of information resources: An inductive approach.",
            "Key issues in information systems management: An international perspective.",
            "Hospital information systems and DRG reimbursement: The adaptation of large transactions processing systems to radical rule changes.",
            "The management and control of written information: Growing concern amid the failure of traditional methods.",
            "Distributed application development: SDLC revisited.",
            "Managing new MIS professionals.",
            "Module base design for a portfolio of institutional decision support systems.",
            "An object-oriented approach to planning and managing software development projects.",
            "Staffing, planning, and control of information systems in charitable nonprofit organizations.",
            "The opportunities and constraints affecting an informatics policy: The India experience.",
            "Hospital information systems in Arab Gulf countries: Characteristics of adopters.",
            "Using the analytic hierarchy process and goal programming for information system project selection.",
            "Productivity measures for information systems.",
            "Organizing for computer integrated manufacturing.",
            "Using a DSS to incorporate expert opinion in strategic product development funding decisions."
        ]
    },
    {
        "name": "I&M",
        "year": "1990",
        "info": "Volume 19: 1990",
        "count": 29,
        "papers": [
            "Managerial ratings of written compositions: Impact of information technology on the persuasiveness of communications.",
            "What is being done to measure user satisfaction with EDP/MIS.",
            "Determining documentation requirements for user-developed applications.",
            "Effects of computer aided quality circles on organizational productivity and satisfaction.",
            "Support systems for high level policy making: What makes them special.",
            "Organizational learning curve in software installation: An empirical investigation.",
            "Group processes and the development of information systems: A social psychological perspective.",
            "Correlates of user satisfaction with end user computing: An exploratory study.",
            "Task characteristics, decentralization, and the success of hospital information systems.",
            "Sources of software and levels of satisfaction for small business computer applications.",
            "Using logic programming for formal specification and validation of data models.",
            "Managing expert systems: a framework and case study.",
            "Managing for results: An examination of professional group perceptions of organizational practices.",
            "Pragmatic issues in conversions of database applications.",
            "A manager's guide to the strategic potential of information systems.",
            "System development methodology and project success: An assessment of situational approaches.",
            "A comparative analysis of successful and unsuccessful information centers.",
            "A process-oriented method for the evaluation of decision support system generators.",
            "Factors associated with attitudes towards telecommuting.",
            "Knowledge, skills and abilities of information systems professionals: past, present, and future.",
            "MIS professionals: Education and performance.",
            "Information support for sales and marketing: A case study at a small grocery manufacturer.",
            "Reorganization of the work system for successful information systems implementation: A case study.",
            "With or without microcomputers: A dilemma.",
            "Simulation as a DSS modelling technique.",
            "Converting SQL queries into relational algebra.",
            "The design of an organization information system: Intelligent artifacts for complex organizations.",
            "Work flow methodology: A proposed approach for analysis and conceptual design of large scale computer based information systems.",
            "ISSPSS: A decision support system for information systems strategic planning."
        ]
    },
    {
        "name": "I&M",
        "year": "1990",
        "info": "Volume 18: 1990",
        "count": 25,
        "papers": [
            "Enhancing Computer-Mediated Communication: An experimental investigation into the use of a Group Decision Support System for face-to-face versus remote meetings.",
            "Group Decision Support System impact: Multi-methodological exploration.",
            "Information Systems strategy formulation.",
            "Commonalities in motivating environments for programmer/analysts in Austria, Israel, Singapore, and the U.S.A.",
            "Effect of the quality of user documentation on user satisfaction with information systems.",
            "Toward a comprehensive conceptual framework for computer integrated manufacturing.",
            "What readers mean by 'good documentation'.",
            "Determination of optimal resource allocation for software development - An application of a software equation.",
            "Using the analytic hierarchy process for information system project selection.",
            "Distinguishing characteristics of organizations using computers.",
            "Bringing automated support to large groups: The Burr-Brown experience.",
            "The status of business ethics education in business school curricula.",
            "Cost comparison for the development and maintenance of application systems in 3rd and 4th generation languages.",
            "Ethical attitudes of entry-level MIS personnel.",
            "Decision Support Systems in Singapore: Issues in their management and their beneficial contributions.",
            "An industry survey of emerging prototyping methodologies.",
            "A comparison of information management issues in the United States of America and the Republic of China.",
            "Software piracy and responsibilities of educational institutions.",
            "Management expert systems for competitive advantage in business.",
            "Validation of a user satisfaction instrument for office automation success.",
            "Utilizing GDSS technology: Final report on a recent empirical study.",
            "Software methodologies for decision support.",
            "Need for \"flexibility\" in a conceptual model.",
            "A study of personal computer utilization by managers.",
            "Choosing a software cost estimation model for your organization: A case study."
        ]
    },
    {
        "name": "I&M",
        "year": "1989",
        "info": "Volume 17: 1989",
        "count": 25,
        "papers": [
            "Examining the duality role of I.S. executives: A study of I.S. issues.",
            "Utilizing high technology: Computer-aided-design and user performance.",
            "Logical design of data base systems.",
            "Impact of prototyping on user information satisfaction during the IS specification phase.",
            "DSS software selection: A multiple criteria decision methodology.",
            "Integrating a knowledge-based component into a physical database design system.",
            "Using information and information technology for sustainable competitive advantage: Some empirical evidence.",
            "Information systems for development management in developing countries.",
            "A field observation study of an expert system prototype development.",
            "Methodology for end user computing in development administration.",
            "Identifying MIS research issues using a research framework.",
            "The Cloze procedure: An assessment of the understandability of data processing texts.",
            "Assessing the impact of IS executives' critical success factors on the performance of IS organizations.",
            "A model for designing distributed database systems.",
            "New communication technologies: The impact on intra-organizational dynamics.",
            "Effect of end-user computing on job satisfaction: An exploratory study.",
            "Globalization of the software industry: Trends and strategies.",
            "A model-based decision support system for locating banks.",
            "The evaluation of decision-aiding systems: Guidelines and methods.",
            "The organizational and cultural context of systems implementation: Case experience from Latin America.",
            "Expert system problem selection: A domain characteristics approach.",
            "Key issues in telecommunications planning.",
            "The coming of ISDN.",
            "Corporate productivity and shared information technology.",
            "An information age opportunity - Providing information for customers."
        ]
    },
    {
        "name": "I&M",
        "year": "1989",
        "info": "Volume 16: 1989",
        "count": 25,
        "papers": [
            "The impact of information technology on organisational structures.",
            "A prototyping language for decision support systems design.",
            "Communications costs under alternative distributed database configurations.",
            "Experimental techniques for information requirements analysis.",
            "A decision support system for real estate investment portfolio management.",
            "Business graphics trends, two years later.",
            "Aligning MIS with the business goals.",
            "Organization design strategies to enhance information resource management.",
            "Group decision support systems: Factors in a software implementation.",
            "Information systems for security trading.",
            "Definitional distinctions and implications for managing end user computing.",
            "The use, operation, and control of the small business computer.",
            "Decision support systems for workers: A bridge to advancing productivity.",
            "Opportunity determination for office information systems.",
            "Microcomputer adoption - The impact of organizational size and structure.",
            "The implementation of information systems for workers: A structural equation model.",
            "Microcomputer applications: An empirical look at usage.",
            "Assessing DSS effectiveness using evaluation research methods.",
            "Results of an asset engineering program.",
            "Automatic information processing activities and operational decision making: A case study of consequence.",
            "An analysis of research in information systems from the IS executive's perspective.",
            "An analysis of human and computer decision-making capabilities.",
            "The evolution of information resource management.",
            "Information technology's strategic impact on the American air travel service industry.",
            "Successful application of communication techniques to improve the systems development process."
        ]
    },
    {
        "name": "I&M",
        "year": "1988",
        "info": "Volume 15: 1988",
        "count": 28,
        "papers": [
            "Information Resource Management: Is it sensible and can it work?",
            "Is today's office receiving full value from its computers?",
            "Competition and cooperation in information systems innovation.",
            "Information Resource Management - A cross-cultural perspective.",
            "A case study of business and technical issues in mixed-vendor technology implementation.",
            "Competitive information systems in Australian retail banking.",
            "The dual role of information centers: An assessment of end user computing management strategies.",
            "Setting the scene for I.R.M.",
            "Information resource management in the public sector.",
            "IRM as a coordinating mechanism: A study in large Japanese firms.",
            "Inter-organizational information systems as company resources.",
            "An entity - relationship framework for information resource management.",
            "Information systems policy setting: Top management participation.",
            "Integrated project support environments.",
            "Information management approach and support to decision-making.",
            "Sensitivity of the physical database design to changes in underlying factors.",
            "Computer systems selection: The graphical cost-benefit approach.",
            "An object-oriented approach to the design of a mail system for a heterogeneous environment.",
            "An empirical study of the use of business expert systems.",
            "Factors facilitating the use of Information Technology for competitive advantage: An exploratory study.",
            "Evolutionary database design and development in very large scale MIS.",
            "An assessment of CASE technology for software design.",
            "Expert systems for small businesses.",
            "A status report of the use of computer-based information systems in PRC.",
            "Database accuracy: Results from a survey of database vendors.",
            "The basics of a successful system.",
            "Data processing for earthquake victims in Greece.",
            "An information processing framework for understanding success and failure of MIS development methodologies."
        ]
    },
    {
        "name": "I&M",
        "year": "1988",
        "info": "Volume 14: 1988",
        "count": 25,
        "papers": [
            "Characteristics and implementation of decision support systems.",
            "An empirical investigation of DSS usage and the user's perception of DSS training.",
            "Structured prototyping: Integrating prototyping into structured system development.",
            "Differences in analyst's attitudes towards information systems development: Evidence and implications.",
            "Expectation failure concept and systems analysts' view of information system failures: Results of an exploratory study.",
            "The changing data processing environment in Saudi Arabia.",
            "Information and modeling resources for decision support in global environments.",
            "End user - IS design professional interaction - information exchange for firm profit or end user satisfaction?",
            "The impact of fourth generation languages on systems development.",
            "Designing and managing local area networks: A survey of LAN personnel.",
            "The management of the end-user environment: An empirical investigation.",
            "Variance tracking MIS in interdependent manufacturing contexts: An initial examination.",
            "Computer conferencing and task-oriented decisions: Implications for group decision support.",
            "Information systems user-designer communication problems.",
            "Recognizing the politics of MIS.",
            "Key human resource issues in IS in the 1990s: Views of IS executives versus human resource executives.",
            "Local area networks: The network managers' perspective.",
            "Informatics and municipalities: The Greek approach.",
            "Company-wide documentation planning.",
            "The influence of new technology in organization and management.",
            "Use of office automation by managers - how much, and to what purpose?",
            "The feasibility study in information systems: an analysis of criteria and contents.",
            "The case for speech synthesis: An experiment in human engineering.",
            "A model to facilitate costing, pricing and budgeting of computer services.",
            "A study of the effects of three commonly used software engineering strategies on software enhancement productivity."
        ]
    },
    {
        "name": "I&M",
        "year": "1987",
        "info": "Volume 13: 1987",
        "count": 25,
        "papers": [
            "On the portability of quantitative software estimation models.",
            "Advanced tools for data conversion and database cost modelling.",
            "Encouraging user management participation in systems design.",
            "Security and integrity controls for microcomputers: A summary analysis.",
            "A DSS generator for district planning.",
            "Blueprints: Adopting a construction trade approach in designing large scale management information systems.",
            "Structure and function of information centers: Case studies of six organizations.",
            "End-user computing environments - Finding a balance between productivity and control.",
            "A systems architecture for supporting senior managers' messy tasks.",
            "The information center approach for developing computer-based information systems.",
            "What does information technology \"do\" to business communications?: Two empirical studies.",
            "An attribution model of decision support systems (DSS) usage.",
            "Logic-based decision support for computer capacity planning.",
            "The applicability of software engineering in information systems development.",
            "An integrated framework for group decision support systems design, .",
            "Presenting uncertainty in expert systems: An issue in information portrayal.",
            "Examining the industry comparative traits of hardware and software manufacturers.",
            "The management, control, and evaluation of a telecommuting project: A case study.",
            "A preliminary specification of an on-line expert help system.",
            "Implementing computer-mediated communication technologies: A technoacceptance approach to critical mass utilization.",
            "Designing for creativity: Considerations for DSS development.",
            "Concurrency control in multi-user microcomputer database management systems.",
            "Managing information systems for effectiveness and humanity: Applying research on organizational behavior.",
            "Measuring implementation outcome: beyond success and failure.",
            "The development of telecommunications: The outcome of an ecology of games."
        ]
    },
    {
        "name": "I&M",
        "year": "1987",
        "info": "Volume 12: 1987",
        "count": 22,
        "papers": [
            "Strategies for managing user developed systems.",
            "Two views of information modeling.",
            "Top management perspectives on decision support systems.",
            "A large-scale goal programming model-based decision support for formulating global financing strategy.",
            "Management support systems for multinational business.",
            "COD - A dynamic data flow analysis system for Cobol.",
            "The quality of user documentation.",
            "The evaluation of DSS groups.",
            "Computer-family selection methodology for organizational information systems.",
            "Models for computer system evaluation and selection.",
            "On building expert systems for strategic planners: A knowledge engineer's experience.",
            "An empirical evaluation of process alternatives for developing strategic information.",
            "Microcomputer based multiple criteria decision support system for strategic planning.",
            "Validating and applying user satisfaction as a measure of MIS success in small organizations.",
            "User interface design for decision support systems: A self-adaptive approach.",
            "Instructional technology: A key to successful information systems.",
            "Treasury management information systems and the contribution of information technology.",
            "An investigation of microcomputer policies in large organizations.",
            "Management-by-exception reporting: An empirical investigation.",
            "Design of a decision support system for detailed scheduling.",
            "Relationships between demographics, training, etc. in a DSS environment.",
            "Information systems planning: Lessons from strategic planning."
        ]
    },
    {
        "name": "I&M",
        "year": "1986",
        "info": "Volume 11: 1986",
        "count": 20,
        "papers": [
            "Tenth anniversary editorial.",
            "Electronic banking and telecommunications.",
            "Integrating systems into the organization.",
            "The use of financial modelling in strategic planning.",
            "Do computer systems really pay-off?",
            "Design and implementation of a decision support system for academic scheduling.",
            "Obstacle coping during systems implementation.",
            "Effect of computer characteristics on price in the U.S. computer industry.",
            "An exploratory contingency model of user participation and MIS use.",
            "TOAM: A transportable office analysis methodology for the design of synthetic data base systems.",
            "DSS, information systems and management games.",
            "Information systems for sustainable competitive advantage.",
            "Establishing user-centered criteria for information systems: A software ergonomics perspective.",
            "Job roles of systems analysts in the \"profit\" vs the \"not for profit\" sectors.",
            "Information resource management in Singapore: The state of the art.",
            "Implementation and structural variables.",
            "Strategy of information management (?).",
            "One view of the future of industrial control.",
            "Every manager is an information systems manager now, or, managing user-controlled information systems.",
            "Information - organization - decision: Some strange loops."
        ]
    },
    {
        "name": "I&M",
        "year": "1986",
        "info": "Volume 10: 1986",
        "count": 20,
        "papers": [
            "Networking and information management: Its use by the project planning function.",
            "The feature chart: A tool for communicating the analysis for a decision support system.",
            "Role of data dictionaries in information resource management.",
            "A critical view of factors affecting successful application of normative and socio-technical systems development approaches.",
            "Office automation benefits: A framework.",
            "Determinants of the effectiveness of personal decision support systems.",
            "The development of a disaster management support system through prototyping.",
            "Information system FOLKLORE: A new technique for system documentation.",
            "Mainframe and microcomputer-based business graphics: What satisfies users?",
            "Acceptance of management science recommendations: The role of cognitive styles and dogmatism.",
            "A conceptual architecture for DSS generators.",
            "Don't hang up: Organizational diffusion of the intelligent telephone.",
            "The success of DP charge-back systems from a user's perception.",
            "An assessment of alternative application development approaches.",
            "Applying a pilot system and prototyping approach to systems development and implementation.",
            "Tax administration - Information on IRS' Philadelphia service center.",
            "Issues in information systems planning.",
            "On program development effort and productivity.",
            "A survey of information technology in the U.K. service sector.",
            "Insights on the implementation of a computer-based message system."
        ]
    },
    {
        "name": "I&M",
        "year": "1985",
        "info": "Volume 9: 1985",
        "count": 21,
        "papers": [
            "A survey of data processing steering committees.",
            "Accounting and billing software and user reactions: An interactive diagnostic audit trail.",
            "The nature of inter-phase relationships in application system development.",
            "Model management in organizations.",
            "Perceptions of equity, job satisfaction, and intention to quit among data processing personnel.",
            "An empirical study of occupational stress, attitudes and health among information systems personnel.",
            "A laboratory study of user characteristics and decision-making performance in end-user computing.",
            "Videotex: Anatomy of a failure.",
            "Introducing microcomputers to managers in the people's Republic of China.",
            "Impact of design methods on decision support systems success: An empirical assessment.",
            "Information systems research centers: An initial survey.",
            "Developing an intervention strategy to promote enhanced public service performance by agent institutions.",
            "Managerial considerations in participative design of MIS/DSS.",
            "Power: A critical systems development factor.",
            "Decision support in a guaranteed student loan program: Design and implementation of a model-based system.",
            "Social security administration's computer equipment procurement: Report by the comptroller general of the USA.",
            "OASI conference and workshop for office professionals.",
            "Personal computing vs. personal computers.",
            "Change, attitude to change, and decision support system success.",
            "Distributed computer system design: An interactive procedure.",
            "Social security administration's progress in modernizing its computer operations."
        ]
    },
    {
        "name": "I&M",
        "year": "1985",
        "info": "Volume 8: 1985",
        "count": 22,
        "papers": [
            "Editorial.",
            "Mapping situations within a system development project.",
            "Decision support systems and expert systems: A comparison.",
            "Structured systems analysis using SPSL/SPSA.",
            "Investigating the buying process for the introduction of data processing in small and medium-sized firms.",
            "The evolving factory of the future: Integrating manufacturing and information systems.",
            "Problem-solving strategies for DSS design.",
            "An empirical study of users as application developers.",
            "Computer usage in developing countries: Case study Kuwait.",
            "Effective information management: by Robert I. Tricker Published by Gower Publ. Comp. (Beaumont Executive Press, c/o The Technical Press), UK ISBN: 0-946065004, 204 pp, £5.95 (UK).",
            "Decision support for marketing research and corporate planning.",
            "Re-examining the proprietary software protection issue in the U.S.A. for the 1980s.",
            "Assessing the organizational climate for OA implementation.",
            "End-user computing: The MIS managers' perspective.",
            "Using database machines in embedded computer systems.",
            "An examination of decision-makers' utilization of decision support system output.",
            "Executive workstations: Issues and requirements.",
            "Documenting information systems for management: A key to maintaining user satisfaction.",
            "NEGO - Group decision support system.",
            "Systems analysis in a complex environment: An interactive educational approach.",
            "Managing the microcomputer movement on campus.",
            "An IS* case: The closed loop scenario."
        ]
    },
    {
        "name": "I&M",
        "year": "1984",
        "info": "Volume 7: 1984",
        "count": 24,
        "papers": [
            "STROBE: A structured approach to observation of the decision-making environment.",
            "Project management: Have we applied all that we know?",
            "An experiment in applying the adaptive design approach to DSS development.",
            "Levels of sophistication of information management systems and their upgrading.",
            "A descriptive model of success for computer-based information systems.",
            "A user evaluation of information characteristics related to demand deposit systems: An empirical analysis.",
            "Empirical investigation of systems development practices and results.",
            "The impact of requirements analysis upon user satisfaction with packaged software.",
            "A systems life cycle for office automation projects.",
            "A framework for systems analysis for decision support systems.",
            "Attitudes toward telecommuting: Implications for work-at-home programs.",
            "The impact of DSS on organizational communication.",
            "The relevance of microcomputers to health improvement in developing countries.",
            "An effective database formation for decision support systems.",
            "Office automation in British rail - On delivering value to end users.",
            "Effects of individual characteristics, organizational factors and task characteristics on computer programmer productivity and job satisfaction.",
            "A synopsis of present day practices concerning decision support systems.",
            "Productive capacity of a system for software development.",
            "The evolution of a distributed processing network.",
            "A survey of applications systems prototyping in industry.",
            "The evolution of intellectual technologies: Applying product life-cycle models to MIS implementation.",
            "Management applications of expert systems.",
            "Microcomputer selection process for organizational information management.",
            "A preliminary investigation of information systems team structures."
        ]
    },
    {
        "name": "I&M",
        "year": "1983",
        "info": "Volume 6: 1983",
        "count": 27,
        "papers": [
            "The software revolution and the management of railways.",
            "Three stage model of MIS planning.",
            "Human factors aspects of a modern data base system.",
            "Alternative date entry technologies and settings: Impact on worker attitudes and behavior.",
            "Software reflected: Robert L. Baber; 1982; North-Holland Publishing Company; Amsterdam, New York, Oxford; 192 pages; hardback; ISBN: 0 444 86372 9.",
            "Third conference on automation of bank operations in the eighties: Preface.",
            "Decision support for manufacturing management.",
            "Methods of system development in Finland.",
            "The human side of systems: an experiential approach.",
            "Knowledge engineering concepts for decision support system design and implementation.",
            "Processes and tools for decision support.",
            "Management implications of job control language standardisation.",
            "MERISE: An information system design and development methodology.",
            "On the assimilation of laboratory data by general medical practitioners.",
            "The relationship between computerization and performance: A strategy for maximizing the economic benefits of computerization.",
            "The role of the champion in DSS implementation.",
            "Physical database design: A DSS approach.",
            "Functional requirements for the development and use of a software-cost database.",
            "Learning to apply interactive graphics in computer-aided design - some UK user experience.",
            "Impact of information systems on customers.",
            "Going outside for MIS implementation.",
            "A methodological framework for formulating information policy.",
            "An empirical analysis of the computerization of interactive software evaluation systems.",
            "Information independent evaluation of information systems.",
            "Assessing participative systems design: Some conclusions from an exploratory study.",
            "The incremental benefits of changes in the timeliness of information.",
            "Computer-aided system for the database storage structure design."
        ]
    },
    {
        "name": "I&M",
        "year": "1982",
        "info": "Volume 5: 1982",
        "count": 26,
        "papers": [
            "Acquisition of a computer: Legal pitfalls.",
            "An effective architecture for Decision Support Systems.",
            "Decision-making styles of MIS managers: A comparative evaluation.",
            "Conditions affecting chargeback effectiveness.",
            "Adapting to changing user requirements.",
            "Logical data base design: A management-oriented approach.",
            "Liability implications in electronic fund transfers.",
            "A framework for multinational information systems planning.",
            "Human factors in user documentation.",
            "The Delphi Method as a tool for information requirements specification.",
            "On-line terminal response time: The effects of background activity.",
            "Towards better software management through careful analysis of current application systems.",
            "Implementation of the key to successful information systems: by Henry C. Lucas, Jr Columbia University Press, 1981 ISBN: 0-231-04434-8.",
            "Observations on the use of behavioral models in Information Systems research and practice.",
            "Standardization of hospital applications and the problems.",
            "Information Systems as aids to achieving organizational integration.",
            "A dialogue generator and its use in DSS design.",
            "Project Management Systems.",
            "A methodology for supporting system architects during preliminary design.",
            "External information services: A survey of behavioral aspects of demand.",
            "Information systems: Emergence of a new organizational function.",
            "Computer-aided modeling and analysis techniques for determining business information systems requirements.",
            "On the use of a structured technique in facilitating systems interventions.",
            "A management framework for systems users.",
            "MIS research strategies.",
            "User interfaces."
        ]
    },
    {
        "name": "I&M",
        "year": "1981",
        "info": "Volume 4: 1981",
        "count": 32,
        "papers": [
            "Managing and controlling EDP in the 80's.",
            "Using the computer for audit.",
            "Corporate management's role in system development.",
            "Confidentiality of information.",
            "Interaction between modern society and EDP.",
            "Information as a corporate asset.",
            "Training E.D.P. auditors.",
            "Advances in computer programming management: Edited by Thomas A. Rullo, Heyden and Sons, Inc., Philadelphia, 1980, 238 pages.",
            "Legal aspects of information systems.",
            "A critical review of proprietary software protection.",
            "Life cycle management.",
            "A data-base application design language.",
            "Management report design considerations.",
            "From files to data base: A tutorial.",
            "The potential of commercial intelligence in the ocean shipping industry.",
            "A framework for decision support systems evaluation.",
            "The value of information in information analysis.",
            "Some issues in the measurement and control of programming productivity.",
            "Information integration within the church of England.",
            "User involvement in system design: An empirical test of alternative approaches.",
            "Managing the development of database systems.",
            "Software psychology: Winthrop Publishers. Appr. $22. ISBN: 0-87626-816-5.",
            "The 'orientation' of the organization's computer-based systems: Is it appropriate?",
            "Information System Planning: A case review.",
            "Computers, management and organization: Reflections on a pilot study.",
            "Decision impelling differences: An investigation of management by exception reporting.",
            "Fourteenth Annual Simulation Symposium.",
            "Motivating and managing computer personnel: by J. D. Cougar and R. A. Zawacki (New York; Wiley 1980).",
            "Fundamentals of integrated dictionary/ directory systems.",
            "Teaching information systems to small business management.",
            "Treating data privacy in distributed systems.",
            "Design considerations for MIS in an Executive MBA program."
        ]
    },
    {
        "name": "I&M",
        "year": "1980",
        "info": "Volume 3: 1980",
        "count": 25,
        "papers": [
            "Editorial.",
            "Hardware options, evaluation metrics, and a design sequence for interactive information systems.",
            "Organizational arrangements for MIS units.",
            "An information producing system that integrates stand-alone word-processing units and EDP resources.",
            "An empirical investigation and analysis of the current state of information systems evolution.",
            "A tribute to John William Mauchly.",
            "Isolating periodicities to refine the organization's control system: an analysis of four methods.",
            "The impact of an information system on a regional blood service.",
            "A case in MIS education: Attitude changes among MBA's.",
            "Models, metrics, and management of IS development.",
            "On the use of a synthetic online/batch workload for computer selection.",
            "Countdown services: Fire and its aftermath in a computer bureau.",
            "Computer usage in business and accounting.",
            "A critical view of some recent assertions about MIS and DBMS.",
            "Data processing people - Are they really different?",
            "Factors challenging information technology applications in developing countries.",
            "Database design practices for inverted files.",
            "Strategic planning of information systems at the corporate level.",
            "Transystem tracing arrays: A macroflow analysis technique.",
            "Input output analysis & the Australian information economy.",
            "Increasing the degree of information system integration and developing an integrated information system.",
            "Data processing people - Are they satisfied/dissatisfied with their jobs?",
            "Information systems curricula: Business versus academic viewpoints.",
            "Attitude study of on-line terminal operators on work-station arrangements.",
            "Data quality in information systems."
        ]
    },
    {
        "name": "I&M",
        "year": "1979",
        "info": "Volume 2: 1979",
        "count": 25,
        "papers": [
            "The need for research in information science.",
            "Needed: Executive awareness of information resources.",
            "Some cautions in large-scale system design and implementation.",
            "Considerations for determining the degrees of centralization or decentralization in the computing environment.",
            "Planning costs and revenues in a multi-product environment.",
            "Strategic planning for MIS: Ephraim R. McLean and John V. Soden, Wiley Interscience 1977, 489 pages.",
            "Automatic console operation as a tool for systems management.",
            "An on-line customer information system at a gas-utility company.",
            "Computer usage by small and medium sized European firms: An empirical study.",
            "Legal considerations affecting information management.",
            "The functions of a decision support system.",
            "Cryptographic transformation of data relationships.",
            "A survey of primary and secondary keys through a case study.",
            "Letters to the editor.",
            "Editorial.",
            "Is there a best MIS department location?",
            "The X-Y chart: A tool for systems designers.",
            "Strategic intelligence systems.",
            "The future of organizational privacy.",
            "Zero-based budgeting: An alternative to chargeout systems.",
            "A definition and design framework for management information.",
            "The state of the art of distributed databases.",
            "A partial implementation of a relational data-base management system as an extension to FORTRAN.",
            "Data access in distributed data base management systems.",
            "A case study of user evaluation of information characteristics for systems improvement."
        ]
    },
    {
        "name": "I&M",
        "year": "1977",
        "info": "Volume 1: 1977/1978",
        "count": 34,
        "papers": [
            "A forecast of the future of computation.",
            "Marketing the MIS.",
            "A prototype approach to information system design and development.",
            "An inter-related processing network architecture.",
            "An investigation of information system utilization.",
            "Management information and control systems: by R. I. Tricker.",
            "Software metrics: by T. Gilb.",
            "Organizational structure of a complex data processing department.",
            "Information for strategic planning: An analysis.",
            "A conceptual model of an interfunctional data base system.",
            "An inter-related processing network architecture: II. The functional architecture.",
            "Review of \"modelling in data base management systems\": by G. M. Nijssen, North-Holland Publishing Company, Amsterdam, The Netherlands, 418 pages, US $35.00.",
            "Letters to the editor.",
            "National and international interests in information policy issues.",
            "The social implications of information processing.",
            "Distributed database technology: An assessment.",
            "Centralization, decentralization and management information systems.",
            "Planning MIS investment and expense levels.",
            "Computer applications: A short course for non-EDP managers: by R. L. Sisson and R. G. Canning; John Wiley & Sons Ltd., Chichester, England. £23.25, $42.05. ISBN: 0 471 79349 3.",
            "Future systems: (Volume 1: Analysis and bibliography, 286 pages and volume 2: Invited papers, 420 pages). Published by Infotech International Limited, Nicholson House, Maidenhead, Berkshire, England, 1977.",
            "Letter to the editor.",
            "Privacy protection in record-keeping systems.",
            "Generally applicable data-file software.",
            "Information policy issues: selecting a policy framework and defining the schema horizon.",
            "Measuring information output: A communication systems approach.",
            "On the nature of a data base and its use in inquiry - a tutorial.",
            "Fair shares for bureau users.",
            "Designing information systems for organizational control: The use of psychological tests.",
            "User department technology and information design.",
            "A survey of distributed data base management.",
            "A DBMS architecture for prudent managers.",
            "Evaluation of the suitability of data base management systems: a case study at the US Forest Service.",
            "A note on interpersonal information system use.",
            "Systems in Action: A managerial and social approach: Joseph Allen and Bennet P. Lientz."
        ]
    }
]