[
    {
        "year": "2022",
        "name": "25th ICDT / 25th EDBT 2022",
        "info": "Edinburgh, UK (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2022",
                "sub_name": "25th International Conference on Database Theory, ICDT 2022, March 29 to April 1, 2022, Edinburgh, UK (Virtual Conference).",
                "count": 20,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "On an Information Theoretic Approach to Cardinality Estimation (Invited Talk).",
                    "Counting the Solutions to a Query (Invited Talk).",
                    "Answering Unions of Conjunctive Queries with Ideal Time Guarantees (Invited Talk).",
                    "On the Hardness of Category Tree Construction.",
                    "Linear Programs with Conjunctive Queries.",
                    "Certifiable Robustness for Nearest Neighbor Classifiers.",
                    "Improved Approximation and Scalability for Fair Max-Min Diversification.",
                    "Rewriting with Acyclic Queries: Mind Your Head.",
                    "Parallel Acyclic Joins with Canonical Edge Covers.",
                    "Splitting Spanner Atoms: A Tool for Acyclic Core Spanners.",
                    "Practical Relational Calculus Query Evaluation.",
                    "Characterising Fixed Parameter Tractability for Query Evaluation over Guarded TGDs.",
                    "Tuple-Generating Dependencies Capture Complex Values.",
                    "Inference of Shape Graphs for Graph Databases.",
                    "Expressiveness of SHACL Features.",
                    "Robustness Against Read Committed for Transaction Templates with Functional Constraints.",
                    "A Dyadic Simulation Approach to Efficient Range-Summability.",
                    "Discovering Event Queries from Traces: Laying Foundations for Subsequence-Queries with Wildcards and Gap-Size Constraints.",
                    "Streaming Enumeration on Nested Documents."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "24th ICDT / 24th EDBT 2021",
        "info": "Nicosia, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2021",
                "sub_name": "24th International Conference on Database Theory, ICDT 2021, March 23-26, 2021, Nicosia, Cyprus.",
                "count": 23,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Explainability Queries for ML Models and its Connections with Data Management Problems (Invited Talk).",
                    "Comparing Apples and Oranges: Fairness and Diversity in Ranking (Invited Talk).",
                    "Box Covers and Domain Orderings for Beyond Worst-Case Join Processing.",
                    "A Purely Regular Approach to Non-Regular Core Spanners.",
                    "Ranked Enumeration of Conjunctive Query Results.",
                    "Towards Optimal Dynamic Indexes for Approximate (and Exact) Triangle Counting.",
                    "Grammars for Document Spanners.",
                    "Input-Output Disjointness for Forward Expressions in the Logic of Information Flows.",
                    "Conjunctive Queries: Unique Characterizations and Exact Learnability.",
                    "The Complexity of Aggregates over Extractions by Regular Expressions.",
                    "Answer Counting Under Guarded TGDs.",
                    "Maximum Coverage in the Data Stream Model: Parameterized and Generalized.",
                    "Diverse Data Selection under Fairness Constraints.",
                    "Enumeration Algorithms for Conjunctive Queries with Projection.",
                    "The Shapley Value of Inconsistency Measures for Functional Dependencies.",
                    "Database Repairing with Soft Functional Dependencies.",
                    "Uniform Reliability of Self-Join-Free Conjunctive Queries.",
                    "Efficient Differentially Private F₀ Linear Sketching.",
                    "Fine-Grained Complexity of Regular Path Queries.",
                    "Ranked Enumeration of MSO Logic on Words.",
                    "Approximate Similarity Search Under Edit Distance Using Locality-Sensitive Hashing.",
                    "Locality-Aware Distribution Schemes."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2021w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2021 Joint Conference, Nicosia, Cyprus, March 23, 2021.",
                "count": 43,
                "papers": [
                    "BigDataVoyant: Automated Profiling of Large Geospatial Data.",
                    "Browsing Internet Content in Multiple Dimensions.",
                    "SenseBoard: Sensor Monitoring for Air Quality Experts.",
                    "Real-time visualization of profiling metadata upon data insertions.",
                    "Graph Cities: Their Buildings, Waves, and Fragments.",
                    "Visual Analysis of Player Interactions in Soccer Games.",
                    "Local Anomaly Detection In Maritime Traffic Using Visual Analytics.",
                    "A Denoising Hybrid Model for Anomaly Detection in Trajectory Sequences.",
                    "Online trajectory analysis with scalable event recognition.",
                    "A tutorial on network-wide multi-horizon traffic forecasting with deep learning.",
                    "Micro-environment Recognition in the context of Environmental Crowdsensing.",
                    "City Indicators for Mobility Data Mining.",
                    "Notebook-based Visual Analysis of Large Tracking Datasets.",
                    "Multiple aspect trajectories: a case study on fishing vessels in the Northern Adriatic sea.",
                    "Online Co-movement Pattern Prediction in Mobility Data.",
                    "Needle in a haystack queries in cloud data lakes.",
                    "Profiling industrial vehicle duties using CAN bus signal segmentation and clustering.",
                    "Trust-empowered, IoT-driven Legitimate Data Offloading.",
                    "Managing Data in a Big Financial Institution: Conclusions from a R&D Project.",
                    "Automating Bronchoconstriction Analysis based on U-Net.",
                    "The impact of Auto-Sklearn's Learning Settings: Meta-learning, Ensembling, Time Budget, and Search Space Size.",
                    "Double-Step deep learning framework to improve wildfire severity classification.",
                    "Conversational Question Answering Using a Shift of Context.",
                    "Towards human in the loop based query rewriting for exploring datasets.",
                    "Enhancing the friendliness of data analytics tasks: an automated methodology.",
                    "Emotion and sentiment analysis of tweets using BERT.",
                    "Data Wrangling for Fair Classification.",
                    "The impact of rewriting on coverage constraint satisfaction.",
                    "NOAH: Creating Data Integration Pipelines over Continuously Extracted Web Data.",
                    "FAIR-DB: FunctionAl DependencIes to discoveR Data Bias.",
                    "Data Challenges in Disinformation Diffusion Analysis.",
                    "The Many Facets of Data Equity.",
                    "What's Mine is Yours, What's Yours is Mine: Simplifying Significance Testing With Big Data.",
                    "Scale-independent Data Analysis with Database-backed Dataframes: a Case Study.",
                    "Speculative Execution of Similarity Queries: Real-Time Parameter Optimization through Visual Exploration.",
                    "Weighted Load Balancing Mechanisms over Streaming Big Data for Online Machine Learning.",
                    "An Empirical Evaluation of Early Time-Series Classification Algorithms.",
                    "Easy Spark.",
                    "Storage Management in Smart Data Lake.",
                    "Simplifying Impact Prediction for Scientific Articles.",
                    "MRbox: Simplifying Working with Remote Heterogeneous Analytics and Storage Services via Localised Views.",
                    "Multi-Attribute Similarity Search for Interactive Data Exploration.",
                    "Simplifying p-value calculation for the unbiased microRNAenrichment analysis, using ML-techniques."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd ICDT / 23rd EDBT 2020",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2020",
                "sub_name": "23rd International Conference on Database Theory, ICDT 2020, March 30-April 2, 2020, Copenhagen, Denmark.",
                "count": 26,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Facets of Probabilistic Databases (Invited Talk).",
                    "What Makes a Variant of Query Determinacy (Un)Decidable? (Invited Talk).",
                    "Current Challenges in Graph Databases (Invited Talk).",
                    "Executable First-Order Queries in the Logic of Information Flows.",
                    "A Dichotomy for Homomorphism-Closed Queries on Probabilistic Graphs.",
                    "On the Expressiveness of LARA: A Unified Language for Linear and Relational Algebra.",
                    "Random Sampling and Size Estimation Over Cyclic Joins.",
                    "Weight Annotation in Information Extraction.",
                    "Containment of UC2RPQ: The Hard and Easy Cases.",
                    "On Equivalence and Cores for Incomplete Databases in Open and Closed Worlds.",
                    "Dynamic Complexity of Document Spanners.",
                    "When Can Matrix Query Languages Discern Matrices?",
                    "Distribution Constraints: The Chase for Distributed Data.",
                    "Towards Streaming Evaluation of Queries with Correlation in Complex Event Processing.",
                    "On the Expressiveness of Languages for Complex Event Recognition.",
                    "Infinite Probabilistic Databases.",
                    "Coordination-Free Byzantine Replication with Minimal Communication Costs.",
                    "Integrity Constraints Revisited: From Exact to Approximate Implication.",
                    "Datalog with Negation and Monotonicity.",
                    "The Shapley Value of Tuples in Query Answering.",
                    "Optimal Joins Using Compact Data Structures.",
                    "The Space Complexity of Inner Product Filters.",
                    "A Family of Centrality Measures for Graph Data Based on Subgraphs.",
                    "Reverse Prevention Sampling for Misinformation Mitigation in Social Networks.",
                    "A Simple Parallel Algorithm for Natural Joins on Binary Relations."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2020w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2020 Joint Conference, Copenhagen, Denmark, March 30, 2020.",
                "count": 53,
                "papers": [
                    "Preface.",
                    "Big Data Visualization and Analytics: Future Research Challenges and Emerging Applications.",
                    "Exploration of Anomalies in Cyclic Multivariate Industrial Time Series Data for Condition Monitoring.",
                    "Exploring the Evolution of Science with Pivot Topic Graphs.",
                    "Visualizing Dependencies during Incremental Discovery Processes.",
                    "The new Spanish political scenario: Twitter graph and opinion analysis with an interactive visualisation.",
                    "Graph Waves.",
                    "Web-based Scalable Visual Exploration of Large Multidimensional Data Using Human-in-the-Loop Edge Bundling in Parallel Coordinates.",
                    "Providing Effective Visualizations over Big Linked Data.",
                    "A task-based evaluation methodology for visual representation of dynamic networks.",
                    "On Measuring Popularity Bias in Collaborative Filtering Data.",
                    "A GUI Design for Composition Discovery of View Interestingness.",
                    "Dynamic Wi-Fi RSSI normalization in unmapped locations.",
                    "Data-Driven Location Annotation for Fleet Mobility Modeling.",
                    "Self-Adapting Trajectory Segmentation.",
                    "BR2: A Travel Behavioral Approach to Personalized Route Recommendation Based on GPS Trajectories.",
                    "Uncovering vessel movement patterns from AIS data with graph evolution analysis.",
                    "A novel spatio-temporal clustering technique to study the bike sharing system in Lyon.",
                    "Exploration of Interesting Dense Regions on Spatial Data.",
                    "MOBI-AID: A Big Data Platform for Real-Time Analysis of On Board Unit Data.",
                    "Towards In-Memory Sub-Trajectory Similarity Search.",
                    "Cross-Lingual Propagation of Sentiment Information Based on Bilingual Vector Space Alignment.",
                    "Culture-aware Point-of-Interest Category Completion in a Global Location-Based Social Network Database without Access to User Data.",
                    "Reddit Mining to Understand Gendered Movements.",
                    "AdsISee: Advertisement Detection and Tracking for Sponsorship Evaluation in Soccer Matches.",
                    "Evaluating espresso coffee quality by means of time-series feature engineering.",
                    "A Cognitive Automation Approach for a Smart Lending and Early Warning Application.",
                    "Regular Pattern and Anomaly Detection on Corporate Transaction Time Series.",
                    "Data-driven vs knowledge-driven inference of health outcomes in the ageing population: a case study.",
                    "Machine Learning Supported Next-Maintenance Prediction for Industrial Vehicles.",
                    "Reddit Mining to Understand Women's Issues in STEM.",
                    "Exploring the Auto Model Competition Patterns in China's Auto Market based on Complex Networks Theory.",
                    "Forecasting Corporate Financial Time Series using Multi-phase Attention Recurrent Neural Networks.",
                    "GooDBye: a Good Graph Database Benchmark - an Industry Experience.",
                    "A Balanced Solution for the Partition-based Spatial Merge Join in MapReduce.",
                    "Question Answering on OLAP-like Data Sources.",
                    "Interpretable Nearest Neighbor Queries for Tree-Structured Data in Vector Databases of Graph-Neural Network Embeddings.",
                    "Causality based explanations in multi-stakeholder recommendations.",
                    "Explainable AI through Rule-based Interactive Conversation.",
                    "Towards Unsupervised Data Quality Validation on Dynamic Data.",
                    "Putting the Human Back in the AutoML Loop.",
                    "Exploiting Latent Information in Databases via Database Embedding: technology, applications, ethics.",
                    "Futility of a Right to Explanation.",
                    "Knowledge Graph Embeddings: Are Relation-Learning Models Learning Relations?",
                    "Ontology-based explanation of classifiers.",
                    "Coverage-based Rewriting for Data Preparation.",
                    "Promoting Data Provenance Tracking in the Archaeological Interpretation Process.",
                    "Active Learning for Spreadsheet Cell Classification.",
                    "FacetX: Dynamic Facet Generation for Advanced Information Filtering of Search Results.",
                    "Toward Visual Interactive Exploration of Heterogeneous Graphs.",
                    "Data Virtual Machines: Data-Driven Conceptual Modeling of Big Data Infrastructures.",
                    "REMA: Graph Embeddings-based Relational Schema Matching.",
                    "Optimizing Federated Queries Based on the Physical Design of a Data Lake."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd ICDT / 22nd EDBT 2019",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2019",
                "sub_name": "22nd International Conference on Database Theory, ICDT 2019, March 26-28, 2019, Lisbon, Portugal.",
                "count": 25,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Learning Models over Relational Databases (Invited Talk).",
                    "The Power of Relational Learning (Invited Talk).",
                    "The Power of the Terminating Chase (Invited Talk).",
                    "Counting Triangles under Updates in Worst-Case Optimal Time.",
                    "A Formal Framework for Complex Event Processing.",
                    "A Formal Framework for Probabilistic Unclean Databases.",
                    "On the Expressive Power of Linear Algebra on Graphs.",
                    "Fragments of Bag Relational Algebra: Expressiveness and Certain Answers.",
                    "Categorical Range Reporting with Frequencies.",
                    "Approximating Distance Measures for the Skyline.",
                    "Index-Based, High-Dimensional, Cosine Threshold Querying with Optimality Guarantees.",
                    "An Experimental Study of the Treewidth of Real-World Graph Data.",
                    "Recursive Programs for Document Spanners.",
                    "Parallel-Correctness and Parallel-Boundedness for Datalog Programs.",
                    "The First Order Truth Behind Undecidability of Regular Path Queries Determinacy.",
                    "Datalog: Bag Semantics via Set Semantics.",
                    "Oblivious Chase Termination: The Sticky Case.",
                    "A Single Approach to Decide Chase Termination on Linear Existential Rules.",
                    "Additive First-Order Queries.",
                    "Characterizing Tractability of Simple Well-Designed Pattern Trees with Projection.",
                    "Boolean Tensor Decomposition for Conjunctive Queries with Negation.",
                    "Constant-Delay Enumeration for Nondeterministic Document Spanners.",
                    "Consistent Query Answering for Primary Keys in Logspace.",
                    "Learning Definable Hypotheses on Trees."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2019w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2019 Joint Conference, EDBT/ICDT 2019, Lisbon, Portugal, March 26, 2019.",
                "count": 34,
                "papers": [
                    "ViewSeeker: An Interactive View Recommendation Tool.",
                    "Exploring energy performance certificates through visualization.",
                    "A User Centric Visual Analytics Framework for News Discussions.",
                    "Processing Satellite Imagery for Decision-Making in Precision Agriculture.",
                    "Progressive Similarity Search on Time Series Data.",
                    "Speeding up RDF Aggregate Discovery through Sampling.",
                    "Visualizing Implicit RDF Schema with the Help of Embeddings.",
                    "PySnippet: Accelerating Exploratory Data Analysis in Jupyter Notebook through Facilitated Access to Example Code.",
                    "VESEL: VisuaL Exploration of Schema Evolution using Provenance Queries.",
                    "A Cloud-to-edge Architecture for Predictive Analytics.",
                    "In-memory Caching for Multi-query Optimization of Data-intensive Scalable Computing Workloads.",
                    "Structural Change Point Detection Using A Large Random Matrix and Sparse Modeling.",
                    "Privacy-Preserving Data Analysis Workflows for eScience.",
                    "Dynamic Estimation for Medical Data Management in a Cloud Federation.",
                    "Exploring Task-agnostic, ShapeNet-based Object Recognition for Mobile Robots.",
                    "Gender Differences in Science and Engineering: A Data Mining Approach.",
                    "Method for Comparing Long-term Daily Life using Long-duration Episodes.",
                    "Time Series Similarity Search for Streaming Data in Distributed Systems.",
                    "Transparently Mining Data from a Medium-voltage Distribution Network: A Prognostic-diagnostic Analysis.",
                    "Data Slice Search for Local Outlier View Detection: A Case Study in Fashion EC.",
                    "Heterogeneous Industrial Vehicle Usage Predictions: A Real Case.",
                    "Adaptive Hierarchical Clustering for Petrographic Image Analysis.",
                    "Integration of Mobility Data with Weather Information.",
                    "Towards A Semantic Indoor Trajectory Model.",
                    "Performance Evaluation of MongoDB and PostgreSQL for Spatio-temporal Data.",
                    "A Trajectory Segmentation Algorithm Based on Interpolation-based Change Detection Strategies.",
                    "A Network Abstraction of Multi-vessel Trajectory Data for Detecting Anomalies.",
                    "On Feature Selection and Evaluation of Transportation Mode Prediction Strategies.",
                    "Generic Data Imputation and Feature Extraction for Signals from Multifunctional Printers.",
                    "Towards a Hierarchical Approach for Outlier Detection in Industrial Production Settings.",
                    "Trusted and Auditable Decision Aids.",
                    "Gaussian Processes for Anomaly Description in Production Environments.",
                    "Ensemble-Based Prediction of Business Processes Bottlenecks With Recurrent Concept Drifts.",
                    "Analyzing Knowledge Graph Embedding Methods from a Multi-Embedding Interaction Perspective."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st ICDT / 21st EDBT 2018",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2018",
                "sub_name": "21st International Conference on Database Theory, ICDT 2018, March 26-29, 2018, Vienna, Austria.",
                "count": 21,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Fine-grained Algorithms and Complexity.",
                    "Join Algorithms: From External Memory to the BSP.",
                    "An Update on Dynamic Complexity Theory.",
                    "Rewriting Guarded Existential Rules into Small Datalog Programs.",
                    "Enumeration on Trees under Relabelings.",
                    "Connecting Width and Structure in Knowledge Compilation.",
                    "A More General Theory of Static Approximations for Conjunctive Queries.",
                    "Answering UCQs under Updates and in the Presence of Integrity Constraints.",
                    "Expressivity and Complexity of MongoDB Queries.",
                    "On the Expressive Power of Query Languages for Matrices.",
                    "Enumeration Complexity of Conjunctive Queries with Functional Dependencies.",
                    "Preserving Constraints with the Stable Chase.",
                    "Fast Sketch-based Recovery of Correlation Outliers.",
                    "Satisfiability for SCULPT-Schemas for CSV-Like Data.",
                    "Querying the Unary Negation Fragment with Regular Path Expressions.",
                    "Covers of Query Results.",
                    "Distribution Policies for Datalog.",
                    "Parallel-Correctness and Transferability for Conjunctive Queries under Bag Semantics.",
                    "Evaluation and Enumeration Problems for Regular Path Queries.",
                    "Massively Parallel Entity Matching with Linear Classification in Low Dimensional Space."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2018w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2018 Joint Conference (EDBT/ICDT 2018), Vienna, Austria, March 26, 2018.",
                "count": 20,
                "papers": [
                    "Community Detection and Correlated Attribute Cluster Analysis on Multi-Attributed Graphs.",
                    "Classifying Land Cover from Satellite Images Using Time Series Analytics.",
                    "Data Analytics to Improve Co-Operative Education.",
                    "Recommendation of Job Offers Using Random Forests and Support Vector Machines.",
                    "Sensitive Attribute Prediction for Social Networks Users.",
                    "MLNET - Machine Learning Models for Network Analytics.",
                    "Unsupervised Video Semantic Partitioning Using IBM Watson and Topic Modelling.",
                    "Study of the Applicability of an Itemset-Based Portfolio Planner in a Multi-Market Context.",
                    "Mining Implicit Data Association from Tripadvisor Hotel Reviews.",
                    "Using a NoSQL Graph Oriented Database to Store Accessible Transport Routes.",
                    "Guided Query Composition with Semantic OLAP Patterns.",
                    "Enabling Hierarchical Exploration for Large-Scale Multidimensional Data with Abstract Parallel Coordinates.",
                    "Finding the Needle in a Haystack: Entropy Guided Exploration of Very Large Graph Cubes.",
                    "Map-Based Visual Exploration of Geolocated Time Series.",
                    "An Interactive 3D Visualization for the LOD Cloud.",
                    "Topic-aware Network Visualisation to Explore Large Email Corpora.",
                    "A Distributed Online Learning Approach for Pattern Prediction over Movement Event Streams with Apache Flink.",
                    "Mining Vessel Trajectory Data for Patterns of Search and Rescue.",
                    "DiStRDF: Distributed Spatio-temporal RDF Queries on Spark.",
                    "Short-Term Traffic Forecasting: A Dynamic ST-KNN Model Considering Spatial Heterogeneity and Temporal Non-Stationarity."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th ICDT / 20th EDBT 2017",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2017",
                "sub_name": "20th International Conference on Database Theory, ICDT 2017, March 21-24, 2017, Venice, Italy.",
                "count": 23,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization, List of Authors.",
                    "Rewritability in Monadic Disjunctive Datalog, MMSNP, and Expressive Description Logics (Invited Talk).",
                    "Graphs, Hypergraphs, and the Complexity of Conjunctive Database Queries (Invited Talk).",
                    "The Smart Crowd - Learning from the Ones Who Know (Invited Talk).",
                    "GYM: A Multiround Distributed Join Algorithm.",
                    "Top-k Querying of Unknown Values under Order Constraints.",
                    "Combined Tractability of Query Evaluation via Tree Automata and Cycluits.",
                    "The Complexity of Reverse Engineering Problems for Conjunctive Queries.",
                    "Answering FO+MOD Queries Under Updates on Bounded Degree Databases.",
                    "How Many Variables Are Needed to Express an Existential Positive Query?.",
                    "Expressive Power of Entity-Linking Frameworks.",
                    "k-Regret Minimizing Set: Efficient Algorithms and Hardness.",
                    "The Design of Arbitrage-Free Data Pricing Schemes.",
                    "A Logic for Document Spanners.",
                    "Distributed Query Monitoring through Convex Analysis: Towards Composable Safe Zones.",
                    "Entropy Bounds for Conjunctive Queries with Functional Dependencies.",
                    "On the Automated Verification of Web Applications with Embedded SQL.",
                    "Detecting Ambiguity in Prioritized Database Repairing.",
                    "Compression of Unordered XML Trees.",
                    "Dynamic Complexity under Definable Changes.",
                    "Constant Delay Enumeration for FO Queries over Databases with Local Bounded Expansion.",
                    "m-tables: Representing Missing Data.",
                    "Better Streaming Algorithms for the Maximum Coverage Problem."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2017w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2017 Joint Conference (EDBT/ICDT 2017), Venice, Italy, March 21-24, 2017.",
                "count": 38,
                "papers": [
                    "Message from the EDBT Workshops Chairs.",
                    "Traffic Prediction using a Deep Learning Paradigm.",
                    "The Effect of Weather on User-Generated Big Geo Data in Mobile Phone Networks.",
                    "Privacy Preservation of Semantic Trajectory Databases using Query Auditing Techniques.",
                    "MAIME: A Maintenance Manager for ETL Processes.",
                    "An Integration-Oriented Ontology to Govern Evolution in Big Data Ecosystems.",
                    "Secondary Indexing Techniques for Key-Value Stores: Two Rings To Rule Them All.",
                    "Performance Evaluation of Analytical Queries on a Standalone and Sharded Document Store.",
                    "Enabling Self-Service BI on Document Stores.",
                    "MapReduce Performance Models for Hadoop 2.x.",
                    "Optimization of Percentage Cube Queries.",
                    "Detecting Fraudulent Advertisements on a Large E-Commerce Platform.",
                    "Efficient Data Slice Search for Exceptional View Detection.",
                    "A Pareto-Dominant Clustering Approach for Pareto-Frontiers.",
                    "Detecting and Diagnosing Syntactic and Semantic Errors in SPARQL Queries.",
                    "Evaluating Reputation in VGI-Enabled Applications.",
                    "Consensus-Based Techniques for Range-Task Resolution in Crowdsourcing Systems.",
                    "Graph Queries: Generation, Evaluation and Learning (Invited Talk).",
                    "On the Performance of Analytical and Pattern Matching Graph Queries in Neo4j and a Relational Database.",
                    "A Role for Chordless Cycles in the Representation and Retrieval of Information.",
                    "A Join Operator for Property Graphs.",
                    "Backlogs and Interval Timestamps: Building Blocks for Supporting Temporal Queries in Graph Databases.",
                    "Towards Hybrid Methods for Graph Pattern Queries.",
                    "Using Patterns for Keyword Search in RDF Graphs.",
                    "Ensuring Consistency in Graph Cache for Graph-Pattern Queries.",
                    "Recurring Retrieval Needs in Diverse and Dynamic Dataspaces: Issues and Reference Framework.",
                    "Towards Open-Source Shared Implementations of Keyword-Based Access Systems to Relational Data.",
                    "Challenges for Industrial-Strength Information Retrieval on Databases.",
                    "Close and Loose Associations in Keyword Search from Structural Data.",
                    "eSPAK: Top-K Spatial Keyword Query Processing in Directed Road Networks.",
                    "Bigg Data Management Challenges and Solutions in the Context of European Projects - Workshop Introduction.",
                    "STREAMLINE - Streamlined Analysis of Data at Rest and Data in Motion.",
                    "Big Data Management and Analytics for Mobility Forecasting in datAcron.",
                    "PROTEUS: Scalable Online Machine Learning for Predictive Analytics and Real-Time Interactive Visualization.",
                    "MHMD: My Health, My Data.",
                    "Big Data Europe.",
                    "Big Data Management Challenges in SUPERSEDE.",
                    "Scouting Big Data Campaigns using TOREADOR Labs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th ICDT / 19th EDBT 2016",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2016",
                "sub_name": "19th International Conference on Database Theory, ICDT 2016, Bordeaux, France, March 15-18, 2016.",
                "count": 24,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization, External Reviewers, List of Authors.",
                    "The ICDT 2016 Test of Time Award Announcement.",
                    "Scale Independence: Using Small Data to Answer Queries on Big Data (Invited Talk).",
                    "Top-k Indexes Made Small and Sweet (Invited Talk).",
                    "New Algorithms for Heavy Hitters in Data Streams (Invited Talk).",
                    "Beyond Well-designed SPARQL.",
                    "A Framework for Estimating Stream Expression Cardinalities.",
                    "Declarative Probabilistic Programming with Datalog.",
                    "Worst-Case Optimal Algorithms for Parallel Query Processing.",
                    "Parallel-Correctness and Containment for Conjunctive Queries with Union and Negation.",
                    "A Formal Study of Collaborative Access Control in Distributed Datalog.",
                    "It's All a Matter of Degree: Using Degree Information to Optimize Multiway Joins.",
                    "Filtering With the Crowd: CrowdScreen Revisited.",
                    "Streaming Partitioning of Sequences and Trees.",
                    "Dynamic Graph Queries.",
                    "Verification of Evolving Graph-structured Data under Expressive Path Constraints.",
                    "Query Stability in Monotonic Data-Aware Business Processes.",
                    "Document Spanners: From Expressive Power to Decision Problems.",
                    "Algorithms for Provisioning Queries and Analytics.",
                    "Limits of Schema Mappings.",
                    "Reasoning About Integrity Constraints for Tree-Structured Data.",
                    "Complexity of Repair Checking and Consistent Query Answering.",
                    "On the Complexity of Enumerating the Answers to Well-designed Pattern Trees.",
                    "A Practically Efficient Algorithm for Generating Answers to Keyword Search Over Data Graphs."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2016w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2016 Joint Conference, EDBT/ICDT Workshops 2016, Bordeaux, France, March 15, 2016.",
                "count": 45,
                "papers": [
                    "Leveraging Reconfigurable Computing in Distributed Real-time Computation Systems.",
                    "Impact-minimizing Runtime Switching of Distributed Stream Processing Algorithms.",
                    "Which is Better for kNN Query Processing in the Cloud: Sequential or Parallel.",
                    "Unlock the Stock: User Topic Modeling for Stock Market Analysis.",
                    "MCSS: A Model for Car-Sharing System.",
                    "Efficient Cube Construction for Smart City Data.",
                    "Open Issues and Challenges on Time Series Forecasting for Water Consumption.",
                    "The Origin of Heterogeneity in Human Mobility Ranges.",
                    "EvoGen: a Generator for Synthetic Versioned RDF.",
                    "Finding and Fixing Type Mismatches in the Evolution of Object-NoSQL Mappings.",
                    "Understanding Ontology Evolution Beyond Deltas.",
                    "Biomedical Ontology Evolution in the EMBL-EBI Ontology Lookup Service.",
                    "Towards Publish/Subscribe Functionality on Graphs.",
                    "Efficient Incremental Smart Grid Data Analytics.",
                    "Characterizing Thermal Energy Consumption through Exploratory Data Mining Algorithms.",
                    "Data Management System for Energy Analytics and its Application to Forecasting.",
                    "DeMand: A Tool for Evaluating and Comparing Device-Level Demand and Supply Forecast Models.",
                    "Template-based Time Series Generation with Loom.",
                    "Temporal Social Network: Storage, Indexing and Query Processing.",
                    "Virtual Documents and Answer Priors in Keyword Search over Data Graphs.",
                    "Time Traveling in Graphs using a Graph Database.",
                    "DIONYSUS: Towards Query-aware Distributed Processing of RDF Graph Streams.",
                    "A Distributed Implementation of GXPath.",
                    "An Algebra and Equivalences to Transform Graph Patterns in Neo4j.",
                    "PageRank Revisited: On the Relationship between Node Degrees and Node Significances in Different Applications.",
                    "Workload-aware Streaming Graph Partitioning.",
                    "Extraction Algorithms for Hierarchical Header Structures from Spreadsheets.",
                    "Exploration and Visualization in the Web of Big Linked Data: A Survey of the State of the Art.",
                    "Looking for the Best Historical Window for Assessing Semantic Similarity Using Human Literature.",
                    "The Data Management Entity: A Simple Abstraction to Facilitate Big Data Systems Interoperability.",
                    "Weighted Sum Model for Multi-Objective Query Optimization for Mobile-Cloud Database Environments.",
                    "Operator and Workflow Optimization for High-Performance Analytics.",
                    "Large Scale Sentiment Analysis on Twitter with Spark.",
                    "MELOGRAPH: Multi-Engine WorkfLOw Graph Processing.",
                    "Optimizing, Planning and Executing Analytics Workflows over Multiple Engines.",
                    "Towards an Analytics Query Engine.",
                    "A Relational Approach to Complex Dataflows.",
                    "Polystore Query Rewriting: The Challenges of Variety.",
                    "Towards Privacy-preserving Mobile Location Analytics.",
                    "A Comprehensive Sanitization Approach for Workflow Provenance Graphs.",
                    "Using Robust Estimation Theory to Design Efficient Secure Multiparty Linear Regression.",
                    "Formal Models for Privacy.",
                    "Using Randomized Response for Differential Privacy Preserving Data Collection.",
                    "Access Pattern Confidentiality-Preserving Relational Databases: Deployment Concept and Efficiency Evaluation.",
                    "Big Data Provenance: State-Of-The-Art Analysis and Emerging Research Challenges."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th ICDT / 18th EDBT 2015",
        "info": "Brussels, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2015",
                "sub_name": "18th International Conference on Database Theory, ICDT 2015, March 23-27, 2015, Brussels, Belgium.",
                "count": 26,
                "papers": [
                    "Title, Table of Contents, Preface, ICDT 2015 Test of Time Award, Organization, External Reviewers, List of Authors.",
                    "The Confounding Problem of Private Data Release (Invited Talk).",
                    "Using Locality for Efficient Query Evaluation in Various Computation Models (Invited Talk).",
                    "Large-Scale Similarity Joins With Guarantees (Invited Talk).",
                    "A Declarative Framework for Linking Entities.",
                    "Asymptotic Determinacy of Path Queries using Union-of-Paths Views.",
                    "Games for Active XML Revisited.",
                    "Answering Conjunctive Queries with Inequalities.",
                    "SQL's Three-Valued Logic and Certain Answers.",
                    "A Trichotomy in the Complexity of Counting Answers to Conjunctive Queries.",
                    "Learning Tree Patterns from Example Graphs.",
                    "Characterizing XML Twig Queries with Examples.",
                    "The Product Homomorphism Problem and Applications.",
                    "Regular Queries on Graph Databases.",
                    "Complexity and Expressiveness of ShEx for RDF.",
                    "CONSTRUCT Queries in SPARQL.",
                    "Separability by Short Subsequences and Subwords.",
                    "Process-Centric Views of Data-Driven Business Artifacts.",
                    "On The I/O Complexity of Dynamic Distinct Counting.",
                    "Shared-Constraint Range Reporting.",
                    "Optimal Broadcasting Strategies for Conjunctive Queries over Distributed Data.",
                    "Datalog Queries Distributing over Components.",
                    "Distributed Streaming with Finite Memory.",
                    "From Causes for Database Queries to Repairs and Model-Based Diagnosis and Back.",
                    "On the Relationship between Consistent Query Answering and Constraint Satisfaction Problems.",
                    "On the Data Complexity of Consistent Query Answering over Graph Databases."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2015w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2015 Joint Conference (EDBT/ICDT), Brussels, Belgium, March 27th, 2015.",
                "count": 43,
                "papers": [
                    "Jedi: A Storage Manager for SIMD-aware, Worst-case Optimal Join Processing.",
                    "Bounds for Overlapping Interval Join on MapReduce.",
                    "Cuneiform: a Functional Language for Large Scale Scientific Data Analysis.",
                    "A Spark-based Workflow for Probabilistic Record Linkage of Healthcare Data.",
                    "Communication Cost in Parallel Query Processing.",
                    "Assignment of Different-Sized Inputs in MapReduce.",
                    "Lower Bounds on the Communication of XPath Queries in MapReduce.",
                    "Computing NFA Intersections in Map-Reduce.",
                    "Declarative Query Processing in Imperative Managed Runtimes.",
                    "Local vs. Global Optimization: Operator Placement Strategies in Heterogeneous Environments.",
                    "Massively Parallel Analysis of Similarity Matrices on Heterogeneous Hardware.",
                    "Enhancing Energy Awareness Through the Analysis of Thermal Energy Consumption.",
                    "Hybrid Multidimensional Design for Heterogeneous Data Supported by Ontological Analysis: an Application Case in the Brazilian Electric System Operation.",
                    "Measuring and Comparing Energy Flexibilities.",
                    "What's Wrong with my Solar Panels: a Data-Driven Approach.",
                    "What are the Most Important Research Challenges in Energy Data Management? (panel).",
                    "Challenges from Industrial Data Analytics.",
                    "Complex Event Processing Under Uncertainty: A Short Survey.",
                    "Extending Event-Driven Architecture for Proactive Systems.",
                    "Towards Flexible Event Processing in Distributed Data Streams.",
                    "Latent Fault Detection With Unbalanced Workloads.",
                    "What You See Is What You Do: Applying Ecological Interface Design to Visual Analytics.",
                    "Using Graph Traversal in Scientific Data Interpolation.",
                    "A Parallel Tree Pattern Query Processing Algorithm for Graph Databases using a GPGPU.",
                    "Implementing Flexible Operators for Regular Path Queries.",
                    "Beta-Algebra: Towards a Relational Algebra for Graph Analysis.",
                    "Graph Search of Software Models Using Multidimensional Scaling.",
                    "Graph Data Exchange with Target Constraints.",
                    "Topic Detection Using a Critical Term Graph on News-Related Tweets.",
                    "Graph Databases and Railway Operations Research Requirements.",
                    "An Extensible Framework for Query Optimization on TripleT-based RDF Stores.",
                    "Towards an RDF Validation Language Based on Regular Expression Derivatives.",
                    "RDF Constraint Checking.",
                    "Peer-to-Peer Semantic Integration of Linked Data.",
                    "Interpreting Linked Data Search Results Using Markov Logic.",
                    "TripleGeo-CSW: A Middleware for Exposing Geospatial Catalogue Services on the Semantic Web.",
                    "Frequent Subgraph Mining from Streams of Linked Graph Structured Data.",
                    "Transparency and Disclosure Risk in Data Privacy.",
                    "Privacy-Integrated Graph Clustering Through Differential Privacy.",
                    "Big Graph Privacy.",
                    "Opening up Government Data while Maintaining Data Privacy.",
                    "Private Computation of the Longest Increasing Subsequence in Data Streams.",
                    "Efficient Sanitization of Unsafe Data Correlations."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th ICDT / 17th EDBT 2014",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2014",
                "sub_name": "Proc. 17th International Conference on Database Theory (ICDT), Athens, Greece, March 24-28, 2014.",
                "count": 27,
                "papers": [
                    "Database Theory - ICDT 2014.",
                    "Remaining CALM in Declarative Networking.",
                    "Links between Join Processing and Convex Geometry.",
                    "Search Joins with the Web.",
                    "Anchor-Points Algorithms for Hamming and Edit Distances Using MapReduce.",
                    "On the Complexity of Mining Itemsets from the Crowd Using Taxonomies.",
                    "Oblivious Query Processing.",
                    "Dynamic Conjunctive Queries.",
                    "Basic Model Theory of XPath on Data Trees.",
                    "Synthesizing transformations from XML schema mappings.",
                    "Reasoning about XML Constraints based on XML-to-relational mappings.",
                    "Deciding Correctness with Fairness for Simple Transducer Networks.",
                    "Triejoin: A Simple, Worst-Case Optimal Join Algorithm.",
                    "Datalog Rewritings of Regular Path Queries using Views.",
                    "Conjunctive Context-Free Path Queries.",
                    "Containment of Data Graph Queries.",
                    "Deduction with Contradictions in Datalog.",
                    "Counting Database Repairs that Satisfy Conjunctive Queries with Self-Joins.",
                    "A Dichotomy on the Complexity of Consistent Query Answering for Atoms with Simple Keys.",
                    "Counting of Query Expressions: Limitations of Propositional Methods.",
                    "The Theory of Zeta Graphs with an Application to Random Networks.",
                    "Circuits for Datalog Provenance.",
                    "On Load Shedding in Complex Event Processing.",
                    "Dynamic Processing of Dominating Queries with Performance Guarantees.",
                    "The Complexity of Width Minimization for Existential Positive Queries.",
                    "Principles of Guarded Structural Indexing.",
                    "The ICDT 2014 Test of Time Award."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2014w",
                "sub_name": "Proceedings of the Workshops of the EDBT/ICDT 2014 Joint Conference (EDBT/ICDT 2014), Athens, Greece, March 28, 2014.",
                "count": 70,
                "papers": [
                    "Scheduling MapReduce Jobs on Unrelated Processors.",
                    "Binary Theta-Joins using MapReduce: Efficiency Analysis and Improvements.",
                    "On the design space of MapReduce ROLLUP aggregates.",
                    "Determining the k in k-means with MapReduce.",
                    "Tagged Dataflow: a Formal Model for Iterative Map-Reduce.",
                    "Processing Regular Path Queries on Giraph.",
                    "Graph-Parallel Entity Resolution using LSH & IMM.",
                    "Modular Data Clustering - Algorithm Design beyond MapReduce.",
                    "Preface to the Third International Workshop on Bidirectional Transformations.",
                    "Implementing a Bidirectional Model Transformation Language as an Internal DSL in Scala.",
                    "Towards a Framework for Multidirectional Model Transformations.",
                    "Formalizing Semantic Bidirectionalization with Dependent Types.",
                    "BenchmarX.",
                    "Towards a Repository of Bx Examples.",
                    "Intersection Schemas as a Dataspace Integration Technique.",
                    "Bidirectional Transformations in Database Evolution: A Case Study \"At Scale\".",
                    "Entangled State Monads.",
                    "Spans of lenses.",
                    "Pipeline Production Data Model.",
                    "Renewable Energy Data Sources in the Semantic Web with OpenWatt.",
                    "A Generic Ontology for Prosumer-Oriented Smart Grid.",
                    "Computing Electricity Consumption Profiles from Household Smart Meter Data.",
                    "ECAST: A Benchmark Framework for Renewable Energy Forecasting Systems.",
                    "Energy Data Management: Where Are We Headed? (panel).",
                    "Exploratory Search in Databases and the Web.",
                    "Exploring Big Data using Visual Analytics.",
                    "On the Suitability of Skyline Queries for Data Exploration.",
                    "Hippalus: Preference-enriched Faceted Exploration.",
                    "The DisC Diversity Model.",
                    "Exploring RDF/S Evolution using Provenance Queries.",
                    "Skyline Ranking à la IR.",
                    "Multi-Engine Search and Language Translation.",
                    "An Event-Driven Approach for Querying Graph-Structured Data Using Natural Language.",
                    "GraphMCS: Discover the Unknown in Large Data Graphs.",
                    "Graph-driven Exploration of Relational Databases for Efficient Keyword Search.",
                    "Implementing Iterative Algorithms with SPARQL.",
                    "A Map-Reduce algorithm for querying linked data based on query decomposition into stars.",
                    "Performance optimization for querying social network data.",
                    "Frequent Pattern Mining from Dense Graph Streams.",
                    "Quantifying the Connectivity of a Semantic Warehouse.",
                    "Scalable Numerical SPARQL Queries over Relational Databases.",
                    "Similarity Recognition in the Web of Data.",
                    "Mining of Diverse Social Entities from Linked Data.",
                    "TripleGeo: an ETL Tool for Transforming Geospatial Data into RDF Triples.",
                    "Social Data and Multimedia Analytics for News and Events Applications.",
                    "Event Identification and Tracking in Social Media Streaming Data.",
                    "Recommendation of Multimedia Objects for Social Network Applications.",
                    "Estimating Completeness in Streaming Graphs.",
                    "Mining Trajectory Data for Discovering Communities of Moving Objects.",
                    "Mobile Sensing Data for Urban Mobility Analysis: A Case Study in Preprocessing.",
                    "Crowd Density Estimation for Public Transport Vehicles.",
                    "Traffic Incident Detection Using Probabilistic Topic Model.",
                    "Predictive Trip Planning - Smart Routing in Smart Cities.",
                    "Addressing the Sparsity of Location Information on Twitter.",
                    "Efficient Dissemination of Emergency Information using a Social Network.",
                    "Crowdsourcing turning restrictions for OpenStreetMap.",
                    "Big data analytics for smart mobility: a case study.",
                    "Smart Applications for Smart City: a Contribution to Innovation.",
                    "Analysis of Relationships Between Road Traffic Volumes and Weather: Exploring Spatial Variation.",
                    "SiCi Explorer: Situation Monitoring of Cities in Social Media Streaming Data.",
                    "A Cascading Wavelet-Feed Forward Neural Network Approach for Forecasting Traffic Flow.",
                    "Combining a Gauss-Markov model and Gaussian process for traffic prediction in Dublin city center.",
                    "Sensing Urban Soundscapes.",
                    "A Hybrid Approach for Privacy-preserving Record Linkage.",
                    "Clustering-based Multidimensional Sequence Data Anonymization.",
                    "Efficient Multi-User Indexing for Secure Keyword Search.",
                    "Community Detection in Anonymized Social Networks.",
                    "Secure Multi-Party linear Regression.",
                    "Data Anonymization: The Challenge from Theory to Practice.",
                    "A Privacy Preserving Model for Ownership Indexing in Distributed Storage Systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th ICDT / 16th EDBT 2013",
        "info": "Genoa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2013",
                "sub_name": "Joint 2013 EDBT/ICDT Conferences, ICDT '13 Proceedings, Genoa, Italy, March 18-22, 2013.",
                "count": 25,
                "papers": [
                    "The DNA query language DNAQL.",
                    "Enumerating with constant delay the answers to a query.",
                    "A personal perspective on keyword search over data graphs.",
                    "A theory of pricing private data.",
                    "Fast learning of restricted regular expressions and DTDs.",
                    "Which DTDs are streaming bounded repairable?",
                    "XML compression via DAGs.",
                    "Structural tractability of counting of solutions to conjunctive queries.",
                    "Recursive queries on trees and data trees.",
                    "On optimum left-to-right strategies for active context-free games.",
                    "Walk logic as a framework for path query languages on graph databases.",
                    "Querying graph databases with XPath.",
                    "Definability problems for graph query languages.",
                    "Algebraic structures for capturing the provenance of SPARQL queries.",
                    "A propagation model for provenance views of public/private workflows.",
                    "Annotations are relative.",
                    "Schema mappings and data exchange for graph databases.",
                    "Containment of pattern-based queries over data trees.",
                    "Access patterns and integrity constraints revisited.",
                    "Using the crowd for top-k and group-by queries.",
                    "Certain and possible XPath answers.",
                    "Extracting minimum-weight tree patterns from a schema with neighborhood constraints.",
                    "On optimal differentially private mechanisms for count-range queries.",
                    "Optimal error of query sets under the differentially-private matrix mechanism.",
                    "Private decayed predicate sums on streams."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2013w",
                "sub_name": "Joint 2013 EDBT/ICDT Conferences, EDBT/ICDT '13, Genoa, Italy, March 22, 2013, Workshop Proceedings.",
                "count": 64,
                "papers": [
                    "Data warehouse testing.",
                    "A declarative approach to customize workflow provenance.",
                    "Multidimensional process mining: a flexible analysis approach for health services research.",
                    "Towards efficient and practical solutions for ontology-based data management.",
                    "Database support for processing complex aggregate queries over data streams.",
                    "Discovery querying in linked open data.",
                    "Mining irregularities in maritime container itineraries.",
                    "Assessing linkset quality for complementing third-party datasets.",
                    "Structure inference for linked data sources using clustering.",
                    "Improving geo-spatial linked data with the wisdom of the crowds.",
                    "Linked data classification: a feature-based approach.",
                    "Semantic question answering system over linked data using relational patterns.",
                    "LOVER: support for modeling data using linked open vocabularies.",
                    "Community evolution detection in time-evolving information networks.",
                    "Supporting range queries in XML keyword search.",
                    "A flexible framework for context-aware recommendations in the social commerce domain.",
                    "Efficient tree pattern queries on encrypted XML documents.",
                    "Design and implementation of privacy-preserving reconciliation protocols.",
                    "A privacy framework: indistinguishable privacy.",
                    "A theoretical model for obfuscating web navigation trails.",
                    "Anonymizing sequential releases under arbitrary updates.",
                    "Secure multiparty aggregation with differential privacy: a comparative study.",
                    "Monitoring and recommending privacy settings in social networks.",
                    "Biometric access control for e-health records in pre-hospital care.",
                    "A privacy preserving model bridging data provider and collector preferences.",
                    "A trustworthy database for privacy-preserving video surveillance.",
                    "What we talk about when we talk about graphs.",
                    "Towards query model integration: topology-aware, IR-inspired metrics for declarative graph querying.",
                    "Performance of graph query languages: comparison of cypher, gremlin and native access in Neo4j.",
                    "A similarity measure for approximate querying over RDF data.",
                    "On implementing provenance-aware regular path queries with relational query engines.",
                    "Dynamic multi-version ontology-based personalization.",
                    "Finding nearest neighbors in road networks: a tree decomposition method.",
                    "Symbolic representation of smart meter data.",
                    "Visualizing complex energy planning objects with inherent flexibilities.",
                    "Towards ontological foundations of knowledge related to the emissions trading system.",
                    "Optimized renewable energy forecasting in local distribution networks.",
                    "Towards the automated extraction of flexibilities from electricity time series.",
                    "Research challenges for energy data management (panel).",
                    "Towards design support for provenance awareness: a classification of provenance questions.",
                    "Capturing and querying workflow runtime provenance with PROV: a practical approach.",
                    "Provenance from log files: a BigData problem.",
                    "WebLab PROV: computing fine-grained provenance links for XML artifacts.",
                    "Provenance for seismological processing pipelines in a distributed streaming workflow.",
                    "Enhancing and abstracting scientific workflow provenance for data publishing.",
                    "Using provenance to analyse agent-based simulations.",
                    "VisTrails provenance traces for benchmarking.",
                    "Provenance traces of the swift parallel scripting system.",
                    "Extracting PROV provenance traces from Wikipedia history pages.",
                    "A workflow PROV-corpus based on taverna and wings.",
                    "PROV-O provenance traces from agent-based social simulation.",
                    "Cross-platform provenance.",
                    "Provenance traces from Chiron parallel workflow engine.",
                    "Provenance in streamflow forecasting.",
                    "Efficient parallel partition-based algorithms for similarity search and join with edit distance constraints.",
                    "Trying to outperform a well-known index with a sequential scan.",
                    "Efficient high-similarity string comparison: the waterfall algorithm.",
                    "WallBreaker: overcoming the wall effect in similarity search.",
                    "Scalable string similarity search/join with approximate seeds and multiple backtracking.",
                    "Efficient edit distance based string similarity search using deletion neighborhoods.",
                    "Approximate string matching by position restricted alignment.",
                    "Trie-based similarity search and join.",
                    "FPI: a novel indexing method using frequent patterns for approximate string searches.",
                    "Cache-aware parallel approximate matching and join algorithms using BWT."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th ICDT / 15th EDBT 2012",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2012",
                "sub_name": "15th International Conference on Database Theory, ICDT '12, Berlin, Germany, March 26-29, 2012.",
                "count": 23,
                "papers": [
                    "Graph pattern matching revised for social network analysis.",
                    "On the data complexity of consistent query answering.",
                    "Validating XML documents in the streaming model with external memory.",
                    "Highly expressive query languages for unordered data trees.",
                    "Deciding twig-definability of node selecting tree automata.",
                    "Regular path queries on graphs with data.",
                    "Deciding eventual consistency for a simple class of relational transducer networks.",
                    "Win-move is coordination-free (sometimes).",
                    "A normal form for preventing redundant tuples in relational databases.",
                    "Finding optimal probabilistic generators for XML collections.",
                    "Learning twig and path queries.",
                    "Bounded repairability for regular tree languages.",
                    "On the complexity of query answering over incomplete XML documents.",
                    "Learning schema mappings.",
                    "Combining dependent annotations for relational algebra.",
                    "Representation systems for data exchange.",
                    "Computing universal models under guarded TGDs.",
                    "Dynamic definability.",
                    "On the tractability of query compilation and bounded treewidth.",
                    "Equivalence and minimization of conjunctive queries under combined semantics.",
                    "Parallel skyline queries.",
                    "Factorised representations of query results: size bounds and readability.",
                    "Differentially private summaries for sparse data."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2012w",
                "sub_name": "Proceedings of the 2012 Joint EDBT/ICDT Workshops, Berlin, Germany, March 30, 2012.",
                "count": 37,
                "papers": [
                    "Informing observers: quality-driven filtering and composition of web 2.0 sources.",
                    "Analysis of social metrics in dynamic networks: measuring the influence with FRINGE.",
                    "Business intelligence on complex graph data.",
                    "High-recall extraction of acronym-definition pairs with relevance feedback.",
                    "A quality aware service-oriented web warehouse platform.",
                    "Product characteristic weighting for designer from online reviews: an ordinal classification approach.",
                    "FunSQL: it is time to make SQL functional.",
                    "Cost models for view materialization in the cloud.",
                    "Stormy: an elastic and highly available streaming service in the cloud.",
                    "RDF data management in the Amazon cloud.",
                    "Challenges and approaches for distributed workflow-driven analysis of large-scale biological data: vision paper.",
                    "Effects on performance and energy reduction by file relocation based on file-access correlations.",
                    "A semantic approach to life cycle assessment applied on energy environmental impact data management.",
                    "Data management in the MIRABEL smart grid system.",
                    "Leveraging gamification in demand dispatch systems.",
                    "Towards a decentralised hierarchical architecture for smart grids.",
                    "Sieve: linked data quality assessment and fusion.",
                    "LODifying personal content sharing.",
                    "Probabilistic pattern queries over complex probabilistic graphs.",
                    "Classification rule learning for data linking.",
                    "Tailoring linked data exploration through inCloud filtering.",
                    "Open business intelligence: on the importance of data quality awareness in user-friendly data mining.",
                    "An evolutionary optimization approach for categorical data protection.",
                    "The application of differential privacy to health data.",
                    "A differentially private estimator for the stochastic Kronecker graph model.",
                    "Privacy preserving distributed DBSCAN clustering.",
                    "Efficient and secure ranked multi-keyword search on encrypted cloud data.",
                    "Integrated privacy modeling and validation for business process models.",
                    "Differentially-private learning and information theory.",
                    "n-confusion: a generalization of k-anonymity.",
                    "Privacy-preserving ranking over vertically partitioned data.",
                    "Towards a theory for privacy preserving distributed OLAP.",
                    "Access control in social networks: a reachability-based approach.",
                    "Towards measuring test data quality.",
                    "Diagnosing faults in embedded queries in database applications.",
                    "Validating cluster structures in data mining tasks.",
                    "Towards scalable data integration under constraints."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th ICDT / 14th EDBT 2011",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2011",
                "sub_name": "Database Theory - ICDT 2011, 14th International Conference, Uppsala, Sweden, March 21-24, 2011, Proceedings.",
                "count": 25,
                "papers": [
                    "Tractability in probabilistic databases.",
                    "On provenance and privacy.",
                    "The PADS project: an overview.",
                    "Efficient reasoning about data trees via integer linear programming.",
                    "Generating, sampling and counting subclasses of regular tree languages.",
                    "View update translation for XML.",
                    "Querying probabilistic business processes for sub-flows.",
                    "Artifact systems with data dependencies and arithmetic.",
                    "Comparing workflow specification languages: a matter of views.",
                    "Relaxed notions of schema mapping equivalence revisited.",
                    "Solutions in XML data exchange.",
                    "Simplifying schema mappings.",
                    "On the equivalence of distributed systems with queries and communication.",
                    "Two-variable logic and key constraints on data words.",
                    "Satisfiability algorithms for conjunctive queries over trees.",
                    "Knowledge compilation meets database theory: compiling queries to decision diagrams.",
                    "On the optimal approximation of queries using tractable propositional languages.",
                    "(Approximate) uncertain skylines.",
                    "Relative expressive power of navigational querying on graphs.",
                    "Complexity of higher-order queries.",
                    "Conjunctive queries determinacy and rewriting.",
                    "Faster query answering in probabilistic databases using read-once functions.",
                    "The complexity of evaluating tuple generating dependencies.",
                    "Detecting and exploiting near-sortedness for efficient relational query evaluation.",
                    "Data cleaning and query answering with matching dependencies and matching functions."
                ]
            },
            {
                "sub_name_abbr": "conf/edbt/2011phd",
                "sub_name": "Proceedings of the 2011 Joint EDBT/ICDT Ph.D. Workshop, Uppsala, Sweden, March 25, 2011.",
                "count": 8,
                "papers": [
                    "Regression on evolving multi-relational data streams.",
                    "Disclosure detection over data streams in database publishing.",
                    "Users tracking and roles mining in web-based applications.",
                    "Access control to materialized views: an inference-based approach.",
                    "Service-oriented information extraction.",
                    "Efficient query evaluation over probabilistic XML with long-distance dependencies.",
                    "On the tractability and intractability of consistent conjunctive query answering.",
                    "Efficient querying of distributed linked data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th ICDT / 13th EDBT 2010",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2010",
                "sub_name": "Database Theory - ICDT 2010, 13th International Conference, Lausanne, Switzerland, March 23-25, 2010, Proceedings.",
                "count": 23,
                "papers": [
                    "Increasing representational power and scaling reasoning in probabilistic databases.",
                    "From polynomial time queries to graph structure theory.",
                    "Provenance for database transformations.",
                    "Foundations of SPARQL query optimization.",
                    "Efficient processing of 3-sided range queries with probabilistic guarantees.",
                    "A theoretical study of 'Snapshot Isolation'.",
                    "Aggregate queries for discrete and continuous probabilistic XML.",
                    "Querying parse trees of stochastic context-free grammars.",
                    "Probabilistic data exchange.",
                    "Synthesizing view definitions from data.",
                    "k-jump strategy for preserving privacy in micro-data disclosure.",
                    "Bag equivalence of XPath queries.",
                    "Composition with target constraints.",
                    "Answering non-monotonic queries in relational data exchange.",
                    "On the tradeoff between mapping and querying power in XML data exchange.",
                    "The complexity of rooted phylogeny problems.",
                    "A greedy algorithm for constructing a low-width generalized hypertree decomposition.",
                    "Static analysis of schema-mappings ensuring oblivious termination.",
                    "Mapping polymorphism.",
                    "Composing local-as-view mappings: closure and applications.",
                    "Data correspondence, exchange and repair.",
                    "Forward-XPath and extended register automata on data-trees.",
                    "On the aggregation problem for synthesized web services."
                ]
            },
            {
                "sub_name_abbr": "conf/edbtw/2010",
                "sub_name": "Proceedings of the 2010 EDBT/ICDT Workshops, Lausanne, Switzerland, March 22-26, 2010.",
                "count": 43,
                "papers": [
                    "Flexible Dataspace Management Through Model Management.",
                    "A multi-agent approach for generating ontologies and composing services into executable workflows.",
                    "Semantic search using modular ontology learning and case-based reasoning.",
                    "SPARQL query rewriting for implementing data integration over linked data.",
                    "XML secure views using semantic access control.",
                    "Research challenges for cloud intelligence: invited talk.",
                    "Leveraging web streams for contractual situational awareness in operational BI.",
                    "Using web-based personalization on spatial data warehouses.",
                    "Building data warehouses with semantic data.",
                    "Model driven development of secure XML data warehouses: a case study.",
                    "A decision support system to improve e-learning environments.",
                    "ODBIS: towards a platform for on-demand business intelligence services.",
                    "An architecture for ad-hoc and collaborative business intelligence.",
                    "Text-to-query: dynamically building structured analytics to illustrate textual content.",
                    "The benefits of the interaction between data warehouses and question answering.",
                    "Ontology-based news recommendation.",
                    "Analysis of declarative updates: invited talk.",
                    "Regular tree patterns: a uniform formalism for update queries and functional dependencies in XML.",
                    "Reasoning about client-side web programs: invited talk.",
                    "The view update problem for XML.",
                    "EXup: an engine for the evolution of XML schemas and associated documents.",
                    "Updating probabilistic XML.",
                    "Desirable properties for XML update mechanisms.",
                    "Updating relational data via SPARQL/update.",
                    "Updates, consistency, and the art of running XQuery in the cloud: invited talk.",
                    "Definitions matter: reconciling differential and adversarial privacy: invited talk.",
                    "A practice-oriented framework for measuring privacy and utility in data sanitization systems.",
                    "A method for evaluating marketer re-identification risk.",
                    "Expressing privacy metrics as one-symbol information.",
                    "Protecting data privacy in outsourcing scenarios: invited talk.",
                    "Collaborative data privacy for the web.",
                    "Analysis of social networking privacy policies.",
                    "Quantile-based bootstrap methods to generate continuous synthetic data.",
                    "Key escrow schemes with sliding window for privacy-aware anomaly detection system.",
                    "Hiding co-occurring sensitive patterns in progressive databases.",
                    "Toward a software development methodology for anonymity applications.",
                    "Enabling knowledge-based complex event processing.",
                    "Enabling ontology evolution in data integration.",
                    "Integration and evolution of XML data via common data model.",
                    "Biochemical network matching and composition.",
                    "Declarative scheduling in highly scalable systems.",
                    "A small-world DHT built on generalized network coordinates.",
                    "Using visual pages analysis for optimizing web archiving."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th ICDT / 12th EDBT 2009",
        "info": "Saint-Petersburg, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2009",
                "sub_name": "Database Theory - ICDT 2009, 12th International Conference, St. Petersburg, Russia, March 23-25, 2009, Proceedings.",
                "count": 27,
                "papers": [
                    "Automatic verification of database-driven systems: a new frontier.",
                    "Datalog±: a unified approach to ontologies and integrity constraints.",
                    "Repair checking in inconsistent databases: algorithms and complexity.",
                    "Consistent query answering under primary keys: a characterization of tractable queries.",
                    "On approximating optimum repairs for functional dependency violations.",
                    "Structural characterizations of schema-mapping languages.",
                    "Query languages for data exchange: beyond unions of conjunctive queries.",
                    "Querying data sources that export infinite sets of views.",
                    "Optimal splitters for database partitioning with size bounds.",
                    "Efficient data structures for range-aggregate queries on trees.",
                    "Faster join-projects and sparse matrix multiplications.",
                    "A compositional query algebra for second-order logic and uncertain databases.",
                    "A logical account of uncertain databases based on linear logic.",
                    "A compositional framework for complex queries over uncertain data.",
                    "Incremental XPath evaluation.",
                    "Efficient asymmetric inclusion between regular expression types.",
                    "How big must complete XML query languages be?",
                    "Towards a theory of search queries.",
                    "Reconcilable differences.",
                    "Automatic construction of simple artifact-based business processes.",
                    "TOP-K projection queries for probabilistic business processes.",
                    "Automatic verification of data-centric business processes.",
                    "Tight results for clustering and summarizing data streams.",
                    "Analysis of sampling techniques for association rule mining.",
                    "The average-case complexity of counting distinct elements.",
                    "Containment of conjunctive queries on annotated relations.",
                    "Optimizing user views for workflows."
                ]
            },
            {
                "sub_name_abbr": "conf/edbtw/2009",
                "sub_name": "Proceedings of the 2009 EDBT/ICDT Workshops, Saint-Petersburg, Russia, March 22, 2009.",
                "count": 26,
                "papers": [
                    "Leveraging communities in social content sites.",
                    "Database replication in large scale systems: optimizing the number of replicas.",
                    "Towards access control aware P2P data management systems.",
                    "BlobSeer: how to enable efficient versioning for large object storage under heavy access concurrency.",
                    "Optimizing peer-to-peer backup using lifetime estimations.",
                    "Distributed processing of continuous join queries using DHT networks.",
                    "Locaware: index caching in unstructured P2P-file sharing systems.",
                    "P2P based hosting system for scalable replicated databases.",
                    "BPI: XML query evaluation using bitmapped path indices.",
                    "Generic and updatable XML value indices covering equality and range lookups.",
                    "iPIXSAR: incremental clustering of indexed XML data.",
                    "Mining flexible association rules from XML.",
                    "Synopsis based load shedding in XML streams.",
                    "An XQuery-based version extension of an XML native database.",
                    "A Bayesian approach for on-line max auditing of dynamic statistical databases.",
                    "Hiding co-occurring frequent itemsets.",
                    "Measuring risk and utility of anonymized data using information theory.",
                    "A conceptual framework for specification, analysis, and design of anonymity services.",
                    "COP: privacy-preserving multidimensional partition in DAS paradigm.",
                    "Security of social information from query analysis in DaaS.",
                    "BlueS: query processing in ubiquitous environments: service discovery vs. information exchange.",
                    "Towards an Algebraic foundation for business planning.",
                    "Entity-aware query processing for heterogeneous data with uncertainty and correlations.",
                    "Affinity analysis of coded data sets.",
                    "Preserving SQL access control policies over published XML data.",
                    "A flexible framework for multisensor data fusion using data stream management technologies."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11th ICDT 2007",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2007",
                "sub_name": "Database Theory - ICDT 2007, 11th International Conference, Barcelona, Spain, January 10-12, 2007, Proceedings.",
                "count": 28,
                "papers": [
                    "Consistent Query Answering: Five Easy Pieces.",
                    "Ask a Better Question, Get a Better Answer A New Approach to Private Data Analysis.",
                    "Beauty and the Beast: The Theory and Practice of Information Integration.",
                    "Approximate Data Exchange.",
                    "Determinacy and Rewriting of Conjunctive Queries Using Views: A Progress Report.",
                    "Compact Samples for Data Dissemination.",
                    "Privacy in GLAV Information Integration.",
                    "Unlocking Keys for XML Trees.",
                    "Characterization of the Interaction of XML Functional Dependencies with DTDs.",
                    "Axiomatizing the Logical Core of XPath 2.0.",
                    "Query Evaluation on a Database Given by a Random Graph.",
                    "The Limits of Querying Ontologies.",
                    "Complexity of Consistent Query Answering in Databases Under Cardinality-Based and Incremental Repair Semantics.",
                    "World-Set Decompositions: Expressiveness and Efficient Algorithms.",
                    "On the Expressiveness of Implicit Provenance in Query and Update Languages.",
                    "Trajectory Databases: Data Models, Uncertainty and Complete Query Languages.",
                    "Complexity of Typechecking XML Views of Relational Databases.",
                    "Exact XML Type Checking in Polynomial Time.",
                    "Optimizing Schema Languages for XML: Numerical Constraints and Interleaving.",
                    "Database Query Processing Using Finite Cursor Machines.",
                    "Constant-Memory Validation of Streaming XML Documents Against DTDs.",
                    "Preferentially Annotated Regular Path Queries.",
                    "Combining Incompleteness and Ranking in Tree Queries.",
                    "Structural Recursion on Ordered Trees and List-Based Complex Objects.",
                    "Combining Temporal Logics for Querying XML Documents.",
                    "Commutativity Analysis in XML Update Languages.",
                    "Containment of Conjunctive Queries over Databases with Null Values.",
                    "Some Algorithmic Improvements for the Containment Problem of Conjunctive Queries with Negation."
                ]
            },
            {
                "sub_name_abbr": "conf/icdt/2007erow",
                "sub_name": "Proceedings of the 1st Workshop on Emerging Research Opportunities for Web Data Management (EROW 2007) Collocated with the 11th International Conference on Database Theory (ICDT 2007), Barcelona, Spain, January 13, 2007.",
                "count": 9,
                "papers": [
                    "Integrating XQuery and P2P in MonetDB/XQuery*.",
                    "Scalable Query Dissemination in XPeer.",
                    "Optimization of Query Plans in the presence of Access Limitations.",
                    "Coupling Fragments of XPath with XML Indexing and Query Decomposition.",
                    "Hierarchical Summarizing and Evaluating for Web Pages.",
                    "Finding K Optimum Edit Scripts between an XML Document and a RegularTree Grammar.",
                    "Updating Views Over Recursive XML.",
                    "Representing Data as Resources in RDF and OWL.",
                    "XML Schema Mappings in the Presence of Key Constraints and Value Dependencies."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th ICDT 2005",
        "info": "Edinburgh, Scotland",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2005",
                "sub_name": "Database Theory - ICDT 2005, 10th International Conference, Edinburgh, UK, January 5-7, 2005, Proceedings.",
                "count": 27,
                "papers": [
                    "Model Checking for Database Theoreticians.",
                    "The Design Space of Type Checkers for XML Transformation Languages.",
                    "Semantics of Data Streams and Operators.",
                    "Conjunctive Query Evaluation by Search Tree Revisited.",
                    "Which XML Schemas Admit 1-Pass Preorder Typing?",
                    "The Pipelined Set Cover Problem.",
                    "Well-Definedness and Semantic Type-Checking in the Nested Relational Calculus and XQuery Extended Abstract.",
                    "First Order Paths in Ordered Trees.",
                    "An Abstract Framework for Generating Maximal Answers to Queries.",
                    "Optimal Distributed Declustering Using Replication.",
                    "When Is Nearest Neighbors Indexable?",
                    "Nonmaterialized Motion Information in Transport Networks.",
                    "Algorithms for the Database Layout Problem.",
                    "Approximately Dominating Representatives.",
                    "On Horn Axiomatizations for Sequential Data.",
                    "Privacy in Database Publishing.",
                    "Anonymizing Tables.",
                    "Authorization Views and Conditional Query Containment.",
                    "PTIME Queries Revisited.",
                    "Asymptotic Conditional Probabilities for Conjunctive Queries.",
                    "Magic Sets and Their Application to Data Integration.",
                    "View-Based Query Processing: On the Relationship Between Rewriting, Answering and Losslessness.",
                    "First-Order Query Rewriting for Inconsistent Databases.",
                    "Rewriting Queries Using Views with Access Patterns Under Integrity Constraints.",
                    "Optimal Workload-Based Weighted Wavelet Synopses.",
                    "Selecting and Using Views to Compute Aggregate Queries (Extended Abstract).",
                    "Efficient Computation of Frequent and Top-k Elements in Data Streams."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th ICDT 2003",
        "info": "Siena, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2003",
                "sub_name": "Database Theory - ICDT 2003, 9th International Conference, Siena, Italy, January 8-10, 2003, Proceedings.",
                "count": 29,
                "papers": [
                    "Open Problems in Data-Sharing Peer-to-Peer Systems.",
                    "Approximations in Database Systems.",
                    "Bioinformatics Adventures in Database Research.",
                    "Incremental Validation of XML Documents.",
                    "Typechecking Top-Down Uniform Unranked Tree Transducers.",
                    "Structural Properties of XPath Fragments.",
                    "On Reasoning about Structural Equality in XML: A Description Logic Approach.",
                    "Containment of Aggregate Queries.",
                    "Auditing Sum Queries.",
                    "CRB-Tree: An Efficient Indexing Scheme for Range-Aggregate Queries.",
                    "Optimal Range Max Datacube for Fixed Dimensions.",
                    "Processing XML Streams with Deterministic Automata.",
                    "Deciding Termination of Query Evaluation in Transitive-Closure Logics for Constraint Databases.",
                    "Data Exchange: Semantics and Query Answering.",
                    "Reformulation of XML Queries and Constraints.",
                    "New Rewritings and Optimizations for Regular Path Queries.",
                    "Database Interrogation Using Conjunctive Queries.",
                    "On the Difficulty of Finding Optimal Relational Decompositions for XML Workloads: A Complexity Theoretic Perspective.",
                    "Generating Relations from XML Documents.",
                    "Containment for XPath Fragments under DTD Constraints.",
                    "XPath Containment in the Presence of Disjunction, DTDs, and Variables.",
                    "Decidable Containment of Recursive Queries.",
                    "Containment of Conjunctive Queries with Safe Negation.",
                    "Probabilistic Interval XML.",
                    "Condensed Representation of Database Repairs for Consistent Query Answering.",
                    "Typing Graph-Manipulation Operations.",
                    "Characterizing the Temporal and Semantic Coherency of Broadcast-Based Data Dissemination.",
                    "An Efficient Indexing Scheme for Multi-dimensional Moving Objects.",
                    "Nearest Neighbors Can Be Found Efficiently If the Dimension Is Small Relative to the Input Size."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th ICDT 2001",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/2001",
                "sub_name": "Database Theory - ICDT 2001, 8th International Conference, London, UK, January 4-6, 2001, Proceedings.",
                "count": 28,
                "papers": [
                    "Expressive Power of SQL.",
                    "Query Evaluation via Tree-Decompositions.",
                    "Scalar Aggregation in FD-Inconsistent Databases.",
                    "On Decidability and Complexity of Description Logics with Uniqueness Constraints.",
                    "Expressiveness Issues and Decision Problems for Active Database Event Queries.",
                    "A Theory of Transactions on Recoverable Search Trees.",
                    "Minimizing View Sets without Losing Query-Answering Power.",
                    "Cost Based Data Dissemination in Broadcast Networks with Disconnection.",
                    "Parallelizing the Data Cube.",
                    "Asymptotically Optimal Declustering Schemes for Range Queries.",
                    "Flexible Data Cubes for Online Aggregation.",
                    "Mining for Empty Rectangles in Large Data Sets.",
                    "FUN: An Efficient Algorithm for Mining Functional and Embedded Dependencies.",
                    "Axiomatization of Frequent Sets.",
                    "On Answering Queries in the Presence of Limited Access Patterns.",
                    "The Dynamic Complexity of Transitive Closure Is In DynTC0.",
                    "Query Languages for Constraint Databases: First-Order Logic, Fixed-Points, and Convex Hulls.",
                    "A Semi-monad for Semi-structured Data.",
                    "Algebraic Rewritings for Optimizing Regular Path Queries.",
                    "Why and Where: A Characterization of Data Provenance.",
                    "Subsumption for XML types.",
                    "Towards Aggregated Answers for Semistructured Data.",
                    "Orthogonal Range Queries in OLAP.",
                    "Reasoning about Summarizability in Heterogeneous Multidimensional Schemas.",
                    "Estimating Range Queries Using Aggregate Data with Integrity Constraints: A Probabilistic Approach.",
                    "Constraint-based clustering in large databases.",
                    "On the Surprising Behavior of Distance Metrics in High Dimensional Spaces.",
                    "On Optimizing Nearest Neighbor Queries in High-Dimensional Data Spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/icdt/2001webdyn",
                "sub_name": "Proceedings of the First International Workshop on Web Dynamics, WebDyn@ICDT 2001, London, UK, January 3, 2001.",
                "count": 10,
                "papers": [
                    "Hubs and Authorities: Spreading Out and Zooming In.",
                    "A Web Site Navigation Engine.",
                    "Toward a Structured Information Retrieval System on the Web: Automatic Structure Extraction of Web Pages.",
                    "Learning of Ontologies from the Web: the Analysis of Existent Approaches.",
                    "Fast Search & Transfer ASA.",
                    "An Active Web-based Distributed Database System for E-Commerce.",
                    "Dynamics of Web Rings.",
                    "Logics for Mobility.",
                    "A Probabilistic Approach to Model Adaptive Hypermedia Systems.",
                    "Run-time Management Policies for Data Intensive Web Sites."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th ICDT 1999",
        "info": "Jerusalem, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/99",
                "sub_name": "Database Theory - ICDT '99, 7th International Conference, Jerusalem, Israel, January 10-12, 1999, Proceedings.",
                "count": 29,
                "papers": [
                    "Issues Raised by Three Years of Developing PJama: An Orthogonally Persistent Platform for Java.",
                    "Novel Computational Approaches to Information Retrieval and Data Mining (Abstract).",
                    "Description Logics and Their Relationships with Databases.",
                    "An Equational Chase for Path-Conjunctive Queries, Constraints, and Views.",
                    "Adding For-Loops to First-Order Logic.",
                    "Definability and Descriptive Complexity on Databases of Bounded Tree-Width.",
                    "Decidability of First-Order Logic Queries over Views.",
                    "Urn Models and Yao's Formula.",
                    "On the Generation of 2-Dimensional Index Workloads.",
                    "Increasing the Expressiveness of Analytical Performance Models for Replicated Databases.",
                    "Transactions in Stack, Fork, and Join Composite Systems.",
                    "Databases for Tracking Mobile Units in Real Time.",
                    "On Capturing First-Order Topological Properties of Planar Spatial Databases.",
                    "On the Orthographic Dimension of Constraint Databases.",
                    "When Is ''Nearest Neighbor'' Meaningful?",
                    "On Rectangular Partitionings in Two Dimensions: Algorithms, Complexity, and Applications.",
                    "Optimal Dynamic Range Searching in Non-replicating Index Structures.",
                    "Index Structures for Path Expressions.",
                    "Schemas for Integration and Translation of Structured and Semi-structured Data.",
                    "In Search of the Lost Schema.",
                    "Tableau Techniques for Querying Information Sources through Global Schemas.",
                    "Optimizing Large Join Queries in Mediation Systems.",
                    "Incremental FO(+, <) Maintenance of All-Pairs Shortest Paths for Undirected Graphs after Insertions and Deletions.",
                    "A Framework for the Investigation of Aggregate Functions in Database Queries.",
                    "Discovering Frequent Closed Itemsets for Association Rules.",
                    "View Disassembly.",
                    "Answering Queries Using Materialized Views with Disjunctions.",
                    "Selection of Views to Materialize Under a Maintenance Cost Constraint.",
                    "The Data Warehouse of Newsgroups."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th ICDT 1997",
        "info": "Delphi, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/97",
                "sub_name": "Database Theory - ICDT '97, 6th International Conference, Delphi, Greece, January 8-10, 1997, Proceedings.",
                "count": 32,
                "papers": [
                    "Querying Semi-Structured Data.",
                    "Information Integration Using Logical Views.",
                    "Methods and Problems in Data Mining.",
                    "Conjunctive Query Containment Revisited.",
                    "Semantics and Containment with Internal and External Conjunctions.",
                    "Efficient Complete Local Tests for Conjunctive Query Constraints with Negation.",
                    "Selection of Views to Materialize in a Data Warehouse.",
                    "Total and Partial Well-Founded Datalog Coincide.",
                    "Fine Hierarchies of Generic Computation.",
                    "Local Properties of Query Languages.",
                    "Expressiveness and Complexity of Active Databases.",
                    "A Model Theoretic Approach to Update Rule Programs.",
                    "Abstract Interpretation of Active Rules and its Use in Termination Analysis.",
                    "Structural Issues in Active Rule Systems.",
                    "Discovering All Most Specific Sentences by Randomized Algorithms.",
                    "A Formal Foundation for Distributed Workflow Execution Based on State Charts.",
                    "Incorporating User Preferences in Multimedia Queries.",
                    "Queries and Computation on the Web.",
                    "The Complexity of Iterated Belief Revision.",
                    "Expressive Power of Unary Counters.",
                    "Concurrency Control Theory for Deferred Materialized Views.",
                    "Serializability of Nested Transactions in Multidatabases.",
                    "Adding Structure to Unstructured Data.",
                    "Correspondence and Translation for Heterogeneous Data.",
                    "Type-Consistency Problems for Queries in Object-Oriented Databases.",
                    "Object-Oriented Database Evolution.",
                    "Performance of Nearest Neighbor Queries in R-Trees.",
                    "Optimal Allocation of Two-Dimensional Data.",
                    "Efficient Indexing for Constraint and Temporal Databases.",
                    "On Topological Elementary Equivalence of Spatial Databases.",
                    "Model-Theoretic Minimal Chenge Operators for Constraint Databases.",
                    "Tractable Iteration Mechanisms for Bag Languages."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th ICDT 1995",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/95",
                "sub_name": "Database Theory - ICDT'95, 5th International Conference, Prague, Czech Republic, January 11-13, 1995, Proceedings.",
                "count": 33,
                "papers": [
                    "Data on Air - What's in it for the Database Theorist.",
                    "Spatial Databases, The Final Frontier.",
                    "Tutorial on Parallel Database Systems.",
                    "Languages for Polynomial-Time Queries - An Ongoing Quest.",
                    "Distributed Query Optimization in Loosly Coupled Multidatabase Systems.",
                    "On the Complexity of Generating Optimal Left-Deep Processing Trees with Cross Products.",
                    "Querying Disjunctive Database Through Nonmonotonic Logics.",
                    "DATALOG Queries with Stratified Negation and Choice: from P to DP.",
                    "On the Kolmogorov Expressive Power of Boolean Query Languages.",
                    "On Two Forms of Structural Recursion.",
                    "Delta-Languages for Sets and sub-PTIME Graphs Transformers.",
                    "Partial Strictness in Two-Phase Locking.",
                    "Unified Transaction Model for Semantically Rich Operations.",
                    "The Dynamic Two Phase Commitment (D2PC) Protocol.",
                    "Domain-Independent Queries on Databases with External Functions.",
                    "An Algebra for Pomsets.",
                    "On the Power of Stratified Logic Programs with Value Invention for Expressing Database Transformations.",
                    "A Stable Model Semantics for Behavioral Inheritance in Deductive Object Oriented Languages.",
                    "A Rewriting Technique for the Analysis and the Optimization of Active Databases.",
                    "Sorted HiLog: Sorts in Higher-Order Logic Data Languages.",
                    "The Average Length of Keys and Functional Dependencies in (Random) Databases.",
                    "Uniformly-Distributed Random Generation of Join Orders.",
                    "A Probabilistic View of Datalog Parallelization.",
                    "A First Step Towards Implementing Dynamic Algebraic Dependencies.",
                    "Constraint-Generating Dependencies.",
                    "Optimization Using Tuple Subsumption.",
                    "Deterministic and Non-Deterministic Stable Model Semantics for Unbound DATALOG Queries.",
                    "Revision Programming, Database Updates and Integrity Constraints.",
                    "Some Positive Results for Boundedness of Multiple Recursive Rules.",
                    "Increment Boundedness and Nonrecursive Incremental Evaluation of Datalog Queries.",
                    "Approximation in Databases.",
                    "Datalog Queries of Set Constraint Databases.",
                    "Space Usage in Functional Query Languages."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "4th ICDT 1992",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/92",
                "sub_name": "Database Theory - ICDT'92, 4th International Conference, Berlin, Germany, October 14-16, 1992, Proceedings.",
                "count": 29,
                "papers": [
                    "Combinatorial and Algebraic Results for Database Relations.",
                    "Semantics of Disjunctive Deductive Databases.",
                    "Database Theory in Russia (1979-1991) (an overview).",
                    "On the Composition and Decomposition of Attributes and Tuples.",
                    "Approximate Dependency Inference from Relations.",
                    "Views and Decompositions of Databases from a Categorical Perspective.",
                    "Computing with Infinitary Logic.",
                    "Query Languages with Counters.",
                    "Naturally Embedded Query Languages.",
                    "Optimizing Incremental Computation of Datalog Programs with Non-deterministic Semantics.",
                    "Optimizing Active Databases using the Split Technique.",
                    "Updating Atomic Information in Labelled Database Systems.",
                    "Context-Specific Synchronization for Atomic Data Types.",
                    "Hybrid Atomicity for Nested Transactions.",
                    "Model and Verification of a Data Manager Based on ARIES.",
                    "Minimizing Indefinite Information in Disjunctive Deductive Databases.",
                    "Well Founded Semantics and Stable Semantics of Semi-Strict Programs.",
                    "On Finding Extensions of Default Theories.",
                    "Incremental Evaluation of Datalog Queries.",
                    "Decidability and Undecidability of Equivalence for Linear Datalog with Applications to Normal-Form Optimizations.",
                    "A Paradox in Database Theory.",
                    "A Hierarchy of Faithful Set Creation in Pure OODB's.",
                    "Identification, Genericity and Consistency in Object-Oriented Databases.",
                    "Subsumption for Complex Object Data Models.",
                    "Semantic Information Connected with Data.",
                    "Declarative Foundations of Secure Deductive Databases.",
                    "On Materializing Views and On-Line Queries.",
                    "Maintaining Dictionaries: Space-Saving Modifications of B-Trees.",
                    "Set-Term Matching in Logic Programming."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "3rd ICDT 1990",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/90",
                "sub_name": "ICDT'90, Third International Conference on Database Theory, Paris, France, December 12-14, 1990, Proceedings.",
                "count": 33,
                "papers": [
                    "Finite-Model Theory - a Personal Perspective.",
                    "Playing Games with Objects.",
                    "Representing Object Identity in a Pure Functional Language.",
                    "A Class Abstraction for a Hierarchical Type System.",
                    "Algebraic Optimization of Object-Oriented Query Languages.",
                    "A Relational Object Model.",
                    "Maintaining Bounded Disorder Files in Multiprocessor Multi-Disk Environments.",
                    "An Evaluation Model for Clustering Strategies in the O2 Object-Oriented Database System.",
                    "Efficient Algorithms for Managing the History of Evolving Databases.",
                    "Logic and Databases: An Assessment.",
                    "A Closed Form for Datalog Queries with Integer Order.",
                    "On The Expressive Power of the Relational Calculus with Arithmetic Constraints.",
                    "Conjectures and Refutations in Database Design and Dependency Theory.",
                    "A Theory of Specialization Constraints for Complex Objects.",
                    "Removing Redundancy and Updating Databases.",
                    "Improving the Concurrency of Integrity Checks and Write Operations.",
                    "A Flexible and Adaptable Tool Kit Approach for Concurrency Control in Non Standard Database Systems.",
                    "A Comparative Analysis of Two-Phase-Commit Protocols.",
                    "Efficient Voting Protocols with Witnesses.",
                    "Voting and Relocation Strategies Preserving Consistency among Replicated Files.",
                    "WELL!: An Evaluation Procedure for All Logic Programs.",
                    "Beginnings of a Theory of General Database Completions.",
                    "Recursively Indefinite Databases.",
                    "Low Complexity Aggregation in GraphLog and Datalog.",
                    "Deciding Boundedness for Uniformly Connected Datalog Programs.",
                    "The Revised Gärdenfors Postulates and Update Semantics.",
                    "Foundations of Canonical Update Support for Closed Database Views.",
                    "Drawing Updates From Derivations.",
                    "Optimizatioin of a Subclass of Conjunctive Queries.",
                    "Complex Transitive Closure Queries on a Fragmented Graph.",
                    "Multiple SIP Strategies and Bottom-Up Adorning in Logic Query Optimization.",
                    "On Estimating the Size of Projections.",
                    "Static Estimation of Query Sizes in Horn Programs."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "2nd ICDT 1988",
        "info": "Bruges, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/88",
                "sub_name": "ICDT'88, 2nd International Conference on Database Theory, Bruges, Belgium, August 31 - September 2, 1988, Proceedings.",
                "count": 26,
                "papers": [
                    "Updates, A New Frontier.",
                    "Data Models and Languages for Databases.",
                    "A Theory of Atomic Transactions.",
                    "Improving Integrity Constraint Checking in Deductive Databases.",
                    "On the Composition and Decomposition of Datalog Program Mappings.",
                    "On the Semantics of Rule-Based Expert Systems with Uncertainty.",
                    "Efficient Consistency Control in Deductive Databases.",
                    "Idempotent Single-Predicate Horn Clauses.",
                    "Hypothetical Datalog: Complexity and Expressiblity.",
                    "On Using Conditional Rotation Operations to Adaptively Structure Binary Search Trees.",
                    "On O(N²) Equivalence Algorithm for Fan-Out Free Queries.",
                    "Two-Way Join Optimization in Partitioned Database Systems.",
                    "Deciding Whether a Production Rule is Relational Computable.",
                    "Modeling Inheritance and Genericity in Object Oriented-Databases.",
                    "Semantics of Types for Database Objects.",
                    "Towards Abstracting Complex Database Objects: Generalization, Reduction and Unification of Set-type Objects (Extended Abstract).",
                    "On the Complexity of Queries in the Logical Data Model (Extended Abstract).",
                    "On Domain Independent Disjunctive Databases.",
                    "Update in Hierarchical Data Bases.",
                    "Parallel Update Transactions (Extended Abstract).",
                    "Transformation of Dynamic Integrity Constraints into Transaction Specifications.",
                    "View Update Translation via Deduction and Annotation.",
                    "Conceptual Level Concurrency Control of Relational Update Transactions.",
                    "Version Consistency and Serializability in Design Databases.",
                    "Object-History and Spreadsheet P-Simulation.",
                    "Efficient Management of Replicated Data."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "1st ICDT 1986",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icdt/86",
                "sub_name": "ICDT'86, International Conference on Database Theory, Rome, Italy, September 8-10, 1986, Proceedings.",
                "count": 26,
                "papers": [
                    "Logic Programming and Parallel Complexity.",
                    "The Generalized Counting Method for Recursive Logic Queries.",
                    "Restructuring of Complex Objects and Office Forms.",
                    "Set Containment Inference.",
                    "A Domain Theoretic Approach to Higher-Order Relations.",
                    "On the Desirability of gamma-Acyclic BCNF Database Schemes.",
                    "Update Semantics under the Domain Closure Assumption.",
                    "Unsolvable Problems Related To The View Integration Approach.",
                    "Horizontal Decompositions Based on Functional-Dependency-Set-Implications.",
                    "Update Serializability in Locking.",
                    "Filtering Data Flow in Deductive Databases.",
                    "Multidimensional Order Preserving Linear Hashing with Partial Expansions.",
                    "Split-Freedom and MVD-Intersection: A New Characterization of Multivalued Dependencies Having Conflict-Free Covers.",
                    "Towards Online Schedulers Based on Pre-Analysis Locking.",
                    "Query Processing in Incomplete Logical Databases.",
                    "Introduction to the Theory of Nested Transactions.",
                    "Entity-Relationship Consistency for Relational Schemas.",
                    "Modelling Large Bases of Categorial Data With Acyclic Schemes.",
                    "Some Extensions to the Closed World Assumption in Databases.",
                    "Expedient Stochastic Move-to-Front and optimal Move-to-Rear List Organizing Strategies.",
                    "The Cost of Locking.",
                    "Theoretical Foundation of Algebraic Optimization Utilizing Unnormalized Relations.",
                    "A Polynomial-Time Join Dependency Implication Algorithm for Multi-Valued Dependencies.",
                    "Interaction-Free Multivalued Dependency Sets.",
                    "Updating Logical Databases Containing Null Values.",
                    "A New Characterization of Distributed Deadlock in Databases."
                ]
            }
        ]
    }
]