[
    {
        "name": "IJCIS",
        "year": "2020",
        "info": "Volume 29, 2020",
        "count": 20,
        "papers": [
            "EgoVis: A Visual Analysis System for Social Networks Based on Egocentric Research.",
            "A Multi-Attention Matching Model for Multiple-Choice Reading Comprehension.",
            "Guest Editorial: Special Issue on Collaborative Computing and Crowd Intelligence.",
            "A Graph and Clustering-Based Framework for Efficient XACML Policy Evaluation.",
            "Distributing UAVs as Wireless Repeaters in Disaster Relief via Group Role Assignment.",
            "An Improved Artificial Bee Colony Algorithm for the Flexible Integrated Scheduling Problem Using Networked Devices Collaboration.",
            "Interplay between Constraints and Rewards in Innovation Tournaments: Implications for Participation.",
            "A Long-Term Quality Perception Incentive Strategy for Crowdsourcing Environments with Budget Constraints.",
            "A Grid-Based Secure Product Data Exchange for Cloud-Based Collaborative Design.",
            "Traffic Sign Identification Using a Partially Cooperative Strategy in a Convolutional Neural Network.",
            "A Process Migration Oriented Multi-Shop Integrated Scheduling Algorithm for Double Objectives.",
            "Towards Better Crowdsourced Software Testing Process.",
            "MVPP-Based Materialized View Selection in Data Warehouses Using Simulated Annealing.",
            "Information System Services Generation of Business Services Specification and Based on a System-of-Services Logical Architecture Pattern.",
            "Research on Optimized Online Allocation of Scope Spatial Crowdsourcing Tasks.",
            "A Graph-Based Tag Recommendation for Just Abstracted Scientific Articles Tagging.",
            "Web Accessibility Assessment Through Multi-Agent Support for Visually Impaired Users.",
            "A Cross-Domain Comparative Study of Big Data Architectures.",
            "Governance Mechanism and Structural Power Fit: Evidence from an Information System Development Project.",
            "Assessing Process Attribute Visualization and Interaction Approaches Based on a Controlled Experiment."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2019",
        "info": "Volume 28, 2019",
        "count": 13,
        "papers": [
            "Materialized View Maintenance: Issues, Classification, and Open Challenges.",
            "XML Template Functional and Multivalued Dependencies Validation.",
            "Interoperability Frameworks for Networked Information Systems: A Comparative Analysis and Discussion.",
            "Object-Specific Role-Based Access Control.",
            "A Customer Confusion Environment in Telecommunication Networks: Analysis and Policy Impact.",
            "XVSM Micro-Room Process Modeler.",
            "A Collaboratory for the Distributed Collaborations Within a Biosecurity Laboratory and Across Different Organizations.",
            "Trajectory Privacy Protection Based on Location Semantic Perception.",
            "Business Process Model Abstraction Based on Fuzzy Clustering Analysis.",
            "A User Profile Awareness Service Collaborative Recommendation Algorithm Under LBSN Environment.",
            "Distributed Nash Equilibrium Seeking for Quadratic Games with Security.",
            "Overlapping Community Discovery Based on the Combination of Node Influence and β-Connected Neighbors.",
            "Emergence of Middleware to Mitigate the Challenges of Multi-Cloud Solutions onto Mobile Devices."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2018",
        "info": "Volume 27, 2018",
        "count": 16,
        "papers": [
            "Guest Editorial.",
            "An Approach to Modeling and Analyzing Human-Centric Systems and Its Application.",
            "A Method to Review Expert Recommendation Using Topic Relevance and Expert Relationship.",
            "An Efficient Optimization Approach for Top-k Queries on Uncertain Data.",
            "A Social-Based DTN Routing in Cooperative Vehicular Sensor Networks.",
            "An Efficient Particle Swarm Optimization for Large-Scale Hardware/Software Co-Design System.",
            "A Government-Run Online Community to Support Recipients of Welfare Payments.",
            "Statistical Verification of Process Model Conformance to Execution Log Considering Model Abstraction.",
            "Measuring Understandability of Organizational Policies: A Metric Based Approach.",
            "A Biometric-Secured Neighborhood Vector Relational Coefficient Framework for Social Network Communication.",
            "Differentially Private Outlier Detection in a Collaborative Environment.",
            "Personalized Trajectory Privacy Protection Method Based on User-Requirement.",
            "A Comprehensive Query Language for Provenance Information.",
            "Media Cloud Service Scheduling Optimization for Resource-Intensive Mobile Application.",
            "Information Processing and Security Analysis of Shared System Resource Based Architectures.",
            "A Situational Method for Creating Shared Understanding on Requirements for an Enterprise Architecture."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2017",
        "info": "Volume 26, 2017",
        "count": 15,
        "papers": [
            "A Survey on Lightweight Authentication Schemes in Vertical Handoff.",
            "A Schema-Based Approach to Enable Data Integration on the Fly.",
            "QABPEM: Quality-Aware Business Process Engineering Method.",
            "Editorial.",
            "Semantic Analysis of RESTful APIs for the Detection of Linguistic Patterns and Antipatterns.",
            "Correlation Miner: Mining Business Process Models and Event Correlations Without Case Identifiers.",
            "rSLA: An Approach for Managing Service Level Agreements in Cloud Environments.",
            "Conceptual Model of Enterprise Architecture Management.",
            "Optimal Dynamic Placement of Virtual Machines in Geographically Distributed Cloud Data Centers.",
            "Toward a Faster Fault Tolerant Consensus to Maintain Data Consistency in Collaborative Environments.",
            "Enterprise Architecture: What Did We Study?",
            "Multi-Factor Synthesis Decision-Making for Trust-Based Access Control on Cloud.",
            "An Auto-Scaling Framework for Heterogeneous Hadoop Systems.",
            "Dynamic Service Provisioning and Selection for Satisfying Cloud Applications and Cloud Providers in Hybrid Cloud.",
            "Erratum: \"An Efficient Particle Swarm Optimization for Large-Scale Hardware/Software Co-Design System\"."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2016",
        "info": "Volume 25, 2016",
        "count": 16,
        "papers": [
            "Framework for Automatic Semantic Annotation of Arabic Websites.",
            "Application of Dynamic Instance Queuing to Activity Sequences in Cooperative Business Process Scenarios.",
            "Reasoning About Policies in Security-Aware Service Discovery Using Answer Set Programming.",
            "Corrigendum: \"Designing Redundancy-Free XML Schema : A Smallest Closure Approach\".",
            "Guest Editorial: Enterprise Computing.",
            "Exception Handling in Message-Based Integration Systems and Modeling Using BPMN.",
            "Reference Modeling for Data Analysis: The BIRD Approach.",
            "Relating Business Intelligence and Enterprise Architecture - A Method for Combining Operational Data with Architectural Metadata.",
            "Template-Based Bitmap View Selection for Optimizing Queries Over Tree Data.",
            "Decidability and Complexity of Web Service Business Protocol Synthesis.",
            "Acentric Scheduling Strategy for SLA-Based Multi-Tenant Queries.",
            "Guest Editorial: Cooperative Information Systems in the Digital Age.",
            "Reusable Coordination Components: Reliable Development of Cooperative Information Systems.",
            "Automatic Business Process Test Case Selection: Coverage Metrics, Algorithms, and Performance Optimizations.",
            "A Robust and Versatile Multi-View Learning Framework for the Detection of Deviant Business Process Instances.",
            "Information Governance in Dynamic Networked Business Process Management."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2015",
        "info": "Volume 24, 2015",
        "count": 14,
        "papers": [
            "Artifact Lifecycle Discovery.",
            "Guest Editorial.",
            "Social Context as a Service: Managing Adaptation in Collaborative Pervasive Applications.",
            "Change Propagation and Conflict Resolution for the Co-Evolution of Business Processes.",
            "A Distributed Infrastructure for Earth-Science Big Data Retrieval.",
            "Evaluating a Stream of Relational KNN Queries by a Knowledge Base.",
            "A Stitch in Time Saves Nine: Early Improving Code-First Web Services Discoverability.",
            "Guest Editors' Introduction.",
            "Compensation and Convergence - Comparing and Combining Deployment Automation Approaches.",
            "Evaluating Cloud Service Elasticity Behavior.",
            "Change Propagation Analysis and Prediction in Process Choreographies.",
            "Designing Redundancy-Free XML Schema: A Smallest Closure Approach.",
            "Mapping Discovery Over Revealing Schemas.",
            "Blending Ad Hoc and Formal Workflow Models in Support of Different Stakeholders Needs."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2014",
        "info": "Volume 23, 2014",
        "count": 19,
        "papers": [
            "Preface.",
            "Quality Dimensions in Process Discovery: The Importance of Fitness, Precision, Generalization and Simplicity.",
            "Interest Aware Consistency for Cooperative Editing in Heterogeneous Environments.",
            "Using Timed Automata for a Priori Warnings and Planning for Timed Declarative Process Models.",
            "Preface.",
            "A Perspective of Evolution After Five Years: A Large-Scale Study of Web Spam Evolution.",
            "Gamification for Online Communities: A Case Study for Delivering Government Services.",
            "Recommending Talks at Research Conferences Using Users' Social Networks.",
            "Privacy-Preserving Assessment of Social Network Data Trustworthiness.",
            "Process Flexibility in Service Orchestration: A Systematic Literature Review.",
            "A Survey on Energy Efficiency in Information Systems.",
            "Effective Cooperations Through Non-Monetary Exchanges: A Computational Framework.",
            "Dynamic Transaction Aware Web Service Selection.",
            "The Formal Semantics of a Domain-Specific Modeling Language for Semantic Web Enabled Multi-Agent Systems.",
            "Decision-Making Support for the Correctness of Input Data at Runtime in Business Processes.",
            "Preferential Resource Allocation in Stream Processing Systems.",
            "Formal Specification of the Assurance Point Web Service Composition Model.",
            "Architecture Support for Flexible Business Chain Integration Using Protocol Adaptors.",
            "Strategic Reorganization in Multi-Agent Systems: Inspired by Intelligent Human Organizations."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2013",
        "info": "Volume 22, 2013",
        "count": 23,
        "papers": [
            "A Cooperative Model for Preference-Based Information Sharing in Narrow Bandwidth Networks.",
            "Toward a Quality Framework for Business Process Models.",
            "A Semantic Security Framework for Systems of Systems.",
            "Concept Location Modeling through Business Process Views.",
            "An Efficient Entity Resolution Method for Large Relations.",
            "Supplementing Enterprise Architecture Approaches with Support for Executing Collaborative Tasks - a Case of TOGAF ADM.",
            "Model for Integrated Monitoring of BPEL Business Processes.",
            "Automatic Generation of Optimized Business Process Models from Constraint-Based Specifications.",
            "A B2B Architecture and Protocol for researchers Cooperation.",
            "Enhancing the System Dynamics Modeling Process with a Domain Modeling Method.",
            "Editorial - Advances in Collective Intelligence and Social Media.",
            "Enhancing Quality of IT Services Delivery using Enterprise Crowdsourcing.",
            "From Collective Intelligence to Collective Intelligence Systems: Definitions and a Semi-Structured Model.",
            "Value Creation potential of Web 2.0 for SME - Insights and Lessons Learnt from a European Producer of Consumer Electronics.",
            "Engineering Innovation-Related Knowledge: How a Core Ontology Makes Innovations Retrievable for Innovation Seekers.",
            "Workshop Process Optimization Based on the Collective Intelligence of Workshop Employees involved in after-Sales Intelligence of Mercedes-Benz Cars.",
            "Evolution of the Software-as-a-Service Innovation System through Collective Intelligence.",
            "Funding from the Crowd: an Internet-Based crowdfunding Platform to Support Business Set-UPS from Universities.",
            "Guest Editors' Introduction.",
            "Efficient Large-Scale Service Clustering via Sparse Functional Representation and Accelerated Optimization.",
            "Collective Problem Solving using Social Compute Units.",
            "Conceptualizing and Programming Hybrid Services in the Cloud.",
            "Soa Antipatterns: an Approach for their Specification and Detection."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2012",
        "info": "Volume 21, 2012",
        "count": 14,
        "papers": [
            "Guest Editors' Introduction.",
            "Dynamic and Goal-Based Quality Management for Human-Based Electronic Services.",
            "Using Patterns for the Analysis and Resolution of Compliance Violations.",
            "Business Process Model Abstraction Based on Synthesis from Well-Structured Behavioral Profiles.",
            "Timed Privacy-Aware Business Protocols.",
            "Verification of Conjunctive Artifact-Centric Services.",
            "Continuous Multiple OLAP Queries for Data Streams.",
            "Secure Collaborative Integrity Verification for Hybrid Cloud Environments.",
            "Collaboratecom Special Issue Analyzing Distributed Whiteboard Interactions.",
            "A Contract-Extended Push-Pull-Clone Model for Multi-Synchronous Collaboration.",
            "Supporting End-User Articulations in Evolving Business Processes: a Case Study to Explore Intuitive Notations and Interaction Designs.",
            "Discovering and Managing Social Compositions in Collaborative Enterprise Crowdsourcing Systems.",
            "An Event-Driven Architecture for Integrating Information, Processes and Services in a Plastic toys Supply Chain.",
            "Information Overlap in Multilingual Wikipedia and Summarization."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2011",
        "info": "Volume 20, 2011",
        "count": 13,
        "papers": [
            "Enhancing Business Collaborations with Client-Oriented Process Control.",
            "Optimizing Acquaintance Selection in a PDMS.",
            "Definition and Validation of Requirements for Collaborative Decision-Making in Enterprise Architecture Creation.",
            "Guest Editors' Introduction.",
            "A Domain-Specific Language to Design Enterprise Application Integration Solutions.",
            "Unified Modeling of Service Logic with User Interfaces.",
            "A Model-Driven Approach to Weave Architectural Styles into Service-Oriented Architectures.",
            "Spiℂa's Multi-Party Negotiation Protocol: Implementation Using YAWL.",
            "Schema Mediation in Peer Data Management Systems.",
            "Moving Applications to the Cloud: an Approach Based on Application Model Enrichment.",
            "Process Model Ontology-Based Matchmaking of Semantic Web Services.",
            "Monitoring and Analysis Concerns in Workflow Applications: from Conceptual Specifications to Concrete Implementations.",
            "Tailorable Groupware Design Based on the 3C Model."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2010",
        "info": "Volume 19, 2010",
        "count": 6,
        "papers": [
            "Web Service Choreography Conformance Verification through the PIX-Model.",
            "Interoperable Supply-Chain Applications: Message Metamodel-Based Semantic Reconciliation of B2B Messages.",
            "Modeling and Exploiting Context for Adaptive Collaboration.",
            "General Strategy Support in Soft E-Business Process Negotiation.",
            "The Minadept Clustering Approach for Discovering Reference Process Models Out of Process Variants.",
            "Strategies for Reducing Inter-Domain Presence Traffic: an Analytical Study."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2009",
        "info": "Volume 18, 2009",
        "count": 12,
        "papers": [
            "Web Service Composition as a Composition of Valid and Robust Semantic Links.",
            "Synchronization and Cancelation in Workflows Based on Reset Nets.",
            "Providing Integrated Life Cycle Support in Process-Aware Information Systems.",
            "Specification and Verification of Dynamics in Agent Models.",
            "A Medical Knowledge Service System for Cross-Organizational Healthcare Collaboration.",
            "Towards a Service-Oriented MDA-Based Approach to the Alignment of Business Processes with IT Systems: from the Business Model to a Web Service Composition Model.",
            "Model Driven Development of Semantic Web Enabled Multi-Agent Systems.",
            "Composing Services into Structured Processes.",
            "Update Processing in Instance-Mapped P2P Data Sharing Systems.",
            "A Procedure for the Allocation of Two-Dimensional Resources in a Multiagent System.",
            "Towards Agent-Based Modeling and Verification of Collaborative Business Processes: an Approach Centered on Interactions and Behaviors.",
            "A Cooperative Hypermedia Approach to Flexible Process Support for Managing Distributed Projects."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2008",
        "info": "Volume 17, 2008",
        "count": 20,
        "papers": [
            "Identification and Management of Sessions Generated by Instant Messaging and Peer-to-Peer Systems.",
            "An Open Service Architecture for the Hyperion Peer Database System.",
            "Scalable Catalog Infrastructure for Managing Access Costs and Source Selection in Wide Area Networks.",
            "A Service-Oriented Approach for Integrating Heterogeneous Spatial Data Sources Realization of a Virtual Geo-Data Repository.",
            "Comparing Collaborative and Process Semantics for Cooperative Information Systems.",
            "Configurable Workflow Models.",
            "Service-Oriented Computing: a Research Roadmap.",
            "Guest Editors' Introduction.",
            "Maintaining Data Dependencies across BPEL Process Fragments.",
            "Grid Application Fault Diagnosis Using Wrapper Services and Machine Learning.",
            "Service Licensing Composition and Compatibility Analysis.",
            "Ontology- and Behavior-Aware Discovery of Web Service Compositions.",
            "Efficient Approach for Web Services Selection with Multi-QOS Constraints.",
            "Ws-Contract Establishment with QoS: an Approach Based on Feature Modeling.",
            "Guest Editors' Introduction.",
            "Collaboration and Coordination in Hospital Work through Activity-Aware Computing.",
            "Evolving a Social Visualization Design Aimed at Increasing Participation in a Class-Based Online Community.",
            "Towards an Enhanced Adaptability and Usability of Web-Based Collaborative Systems.",
            "Collaborative Web Search Based on User Interest Similarity.",
            "A Peer-to-Peer Communication Infrastructure for Groupware Applications."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2007",
        "info": "Volume 16, 2007",
        "count": 20,
        "papers": [
            "Guest Editors' Introduction.",
            "A Formal Holonic Framework with Proved Self-Organizing Capabilities.",
            "On the Formal Analysis of the Dynamics of Simulated Agent Societies.",
            "Altruism among Simple and Smart Vampires.",
            "Institutional Reality and Norms: Specifying and Monitoring Agent Organizations.",
            "Norm Negotiation in Multiagent Systems.",
            "Knowledge-Driven Interactions across Mobile Ad Hoc Networks.",
            "Re-Configuring Workflow Management Systems to Facilitate a \"smooth Flow of Work\".",
            "Approximate Query Processing Using Multilayered Data Model to Handle Environmental Constraints, Privacy and Avoiding Inferences.",
            "Typing and Transformational Effects in Complex Information Supply.",
            "Towards a Theory for Multiparty Proactive Communication in Agent Teams.",
            "A Flexible Mediation Process for Large Distributed Information Systems.",
            "Guest Editors' Introduction.",
            "Pattern-Based Exploration of Design Alternatives for the Evolution of Software Architectures.",
            "Fiesta: a Generic Framework for Integrating New Functionalities into Software Architectures.",
            "Applying MDE to the Development of Flexible and Reusable Wireless Sensor Networks.",
            "Eagle: Effective Tool Support for Sharing Architectural Knowledge.",
            "The Art and Science of Software Architecture.",
            "Supporting Distributed Event-Condition-Action Rules in a Multidatabase Environment.",
            "Discovering Patterns for Inter-Organizational Business Process Collaboration."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2006",
        "info": "Volume 15, 2006",
        "count": 27,
        "papers": [
            "Semantic Interoperability and Information Fluidity.",
            "Poseidon: a Framework to Assist Web Process Design Based on Business Cases.",
            "Applying Orchestration and Choreography of Web Services on Dynamic Virtual Marketplaces.",
            "A Taxonomy of Transactional Workflow Support.",
            "Agent-enhanced Collaborative Activity in Organized Settings.",
            "Foreword.",
            "Analyzing and Designing the Group Cognition Experience.",
            "A Case Study of Information Systems Decision-making: Process Characteristics and Collaboration Technology Support.",
            "A Collaborative Software Code Inspection: the Design and Evaluation of a Repeatable Collaboration Process in the Field.",
            "Supporting Multi-synchronous Groupware: Data Management Problems and a Solution.",
            "Using Patterns to Empower End-users - the Oregon Software Development Process for Groupware.",
            "Guest Editors' Introduction.",
            "Semantics-Based Dynamic Web Service Composition.",
            "Non-Intrusive Monitoring of Service-Based Systems.",
            "Monitoring Assertion-Based Business Processes.",
            "A Layered Framework for Connecting Client Objectives and Resource Capabilities.",
            "Concrete Solutions for Web Services Adaptability Using Policies and Aspects.",
            "A Service-Oriented Approach to Enforce Grid Resource Allocations.",
            "Flash Memory Lock Management for Portable Information Systems.",
            "Guest Editors' Introduction.",
            "An Integrated Life Cycle for Workflow Management Based on Learning and Planning.",
            "Dealing with Semantic Application Integration within Large and Dynamic Enterprises.",
            "Developing Distributed Services Using an Aspect Oriented Model Driven Framework.",
            "Design and Implementation of Web Services Middleware to Support Fair Non-Repudiable Interactions.",
            "Model-Driven Design, Refinement and Transformation of Abstract Interactions.",
            "Verification and Prediction of Timed Probabilistic Properties over the Dmtf CIM.",
            "A Formal Analysis of a Business Contract Language."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2005",
        "info": "Volume 14, 2005",
        "count": 19,
        "papers": [
            "A Flexible Failure-Recovery Model for Workflow Management Systems.",
            "Integrating Legacy Sites into Web Services with WebXcript.",
            "Cooperative Modelling Evaluated.",
            "Guest editors' introduction.",
            "Automating support for e-business contracts.",
            "Using the event calculus for tracking the normative state of contracts.",
            "Extending choreography with business contract constraints.",
            "Representing business contracts in RuleML.",
            "Transforming agreements into contracts.",
            "Counteracting shill bidding in online english auction.",
            "Preserving trade secrets between competitors in b2b interactions.",
            "Applying the 3C model to groupware development.",
            "Guest Editors' Introduction.",
            "Automatic Service Composition Based on Behavioral Descriptions.",
            "Peer-to-peer Execution of (transactional) Processes.",
            "Structural and Semantic Matching for Assessing Web-service Similarity.",
            "Improving the Automatic Procurement of Web Services Using Constraint Programming.",
            "Improving User Experience through Rule-based Service Customization.",
            "Set-based Analysis of Structured Workflow Definition."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2004",
        "info": "Volume 13, 2004",
        "count": 19,
        "papers": [
            "Coordination And Collaboration Activities In Cooperative Information Systems.",
            "A Software Engineering Approach For Coordination Policies Elicitation.",
            "An Extensible Architecture-Based Framework For Coordination Languages.",
            "Data-Driven Coordination In Peer-To-Peer Information Systems.",
            "Synchronization Analysis For Decentralizing Composite Web Services.",
            "Webbis: An Infrastructure For Agile Integration Of Web Services.",
            "Cemap: Cost-Effective Mobile Agent Planning.",
            "An Automata-Based Approach To Cscw Verification.",
            "Editor's Introduction.",
            "Enterprise Architecture: Enabling Integration, Agility And Change.",
            "Project Graal: Towards Operational Architecture Alignment.",
            "Concepts For Modeling Enterprise Architectures.",
            "Bridging The Gap Between Business Models And Workflow Specifications.",
            "Guest Editors' Introduction: Service Oriented Modeling.",
            "Service-Oriented Design: A Multi-Viewpoint Approach.",
            "Modeling Cooperation in Virtual Districts: A Methodology for E-Service Design.",
            "Abstracting and Enforcing Web Service Protocols.",
            "A Framework for Dynamic Semantic Web Services Management.",
            "A Flexible Transaction Framework for Dynamic Collaboration of Agents - with an Online Travel Application."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2003",
        "info": "Volume 12, 2003",
        "count": 18,
        "papers": [
            "A Reuse-Oriented Workflow Definition Language.",
            "Adaptive Agents for Effective Information Monitoring.",
            "Models of and Experiments with E-Markets for Electric Utilities.",
            "Clustering of Client-Sites in Three-Tier Database Architectures.",
            "Trust Management Through Fuzzy Reputation.",
            "On Using Remote User Defined Functions as Wrappers for Biological Database Interoperability.",
            "A Suite of Daml+Oil Ontologies to Describe Bioinformatics Web Services and Data.",
            "A Case Study: Development of an Organism-Specific Protein Interaction Database and Its Associated Tools.",
            "ATUCG - An Agent-Based Environment for Automatic Annotation of Genomes.",
            "An Ontology for Semantic Integration of Life Science Web Databases.",
            "Intra-Subnet Load Balancing in Distributed Workflow Management Systems.",
            "Universal Data Warehousing Based on a Meta-Data Modeling Approach.",
            "The Case Handling Case.",
            "Semantic Similarity of an Object as a Function of the Context (SSOFC) in a Heterogeneous Environment.",
            "A Fully Distributed Architecture for Large Scale Workflow Enactment.",
            "A Feature Selection and Classification Technique for Text Categorization.",
            "W-RBAC - A Workflow Security Model Incorporating Controlled Overriding of Constraints.",
            "A Three-Level Framework for Process and Data Management of Complex E-Services."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2002",
        "info": "Volume 11, 2002",
        "count": 17,
        "papers": [
            "Constructing a Personal Web Map with Anytime-Control of Web Robots.",
            "A Multiple Granularity Locking Protocol for CSCW.",
            "Compositional Verification of Multi-Agent Systems: A Formal Analysis of Pro-activeness and Reactiveness.",
            "A Formal Yet Practical Approach to Electronic Commerce.",
            "Selectively Materializing Data in Mediators by Analyzing User Queries.",
            "Awareness Provisioning in Collaboration Management.",
            "Coherence Maintainance in Cooperative Information Systems: The Access Key Warehouse Approach.",
            "Cooperative Information Agents: Best Papers of CIA 2001 Guest Editors' Introduction.",
            "Intelligent Agents for Mobile and Embedded Devices.",
            "Ubiquitous Information Agents.",
            "Context Aware Personal Information Agents.",
            "BioMAS: A Multi-Agent System for Genomic Annotation.",
            "Momis: Exploiting Agents to Support Information Integration.",
            "Optimal Bidding in Multiple Concurrent Auctions.",
            "Problem-Solving Methods and Cooperative Information Agents.",
            "Virtual Enterprises and Workflow Management As Agent Coordination Issues.",
            "The Social Nature of Information and the Role of Trust."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2001",
        "info": "Volume 10, 2001",
        "count": 23,
        "papers": [
            "Formalization and Proof of Correctness of the Crash Recovery Algorithm for an Open and Safe Nested Transaction Model.",
            "Information Agents: Theory and Applications - Guest Editor's Introduction.",
            "Belief Revision for Adaptive Information Filtering Agents.",
            "Multi-Agent Learning in Recommender Systems for Information Filtering on the Internet.",
            "Introduction to POS: A Protocol Operational Semantics.",
            "Arbitration Protocols for Competing Software Agents.",
            "The Ariadne Approach to Web-Based Information Integration.",
            "Kraft: An Agent Architecture for Knowledge Fusion.",
            "Cooperative Information Agents for Digital Cities.",
            "Computers as Tools or as Social Actors? - The Users' Perspective on Anthropomorphic Agents.",
            "Special Issue on Design and Management of Data Warehouses.",
            "Data Integration in Data Warehousing.",
            "Metadata Management for Data Warehousing: An Overview.",
            "Data Currency Quality Satisfaction in the Design of a Data Warehouse.",
            "Speeding Up Materialized View Selection in Data Warehouses Using a Randomized Algorithm.",
            "Tree Based Indexes Versus Bitmap Indexes: A Performance Study.",
            "An Architecture for Data Warehousing Supporting Data Independence and Interoperability.",
            "Cooperating System in the 21st Century: CoopIS'2000 (Special Issue Editors).",
            "An Evaluation of the Java-based Approaches to Web Database Access.",
            "An Extensible Business Communication Language.",
            "Proclets: A Framework for Lightweight Interacting Workflow Processes.",
            "Formalizing and Reasoning About the Requirements Specifications of Workflow Systems.",
            "Deadline Allocation in a Time-Constrained Workflow."
        ]
    },
    {
        "name": "IJCIS",
        "year": "2000",
        "info": "Volume 9, 2000",
        "count": 20,
        "papers": [
            "Selected Papers from CODAS'99 - Guest Editors' Introduction.",
            "Active Information Gathering in InfosleuthTM.",
            "Evaluation of the Flexible Information Sharing Capabilities of View Media.",
            "InfoLOD and LandMark: Spatial Presentation of Attribute Information and Computing Representative Objects for Spatial Data.",
            "Spatial Query Processing Using Generalized Filter.",
            "Managing Change and Time in Dynamic Workflow Processes.",
            "Generating Versioning Facilities for a Design-Data Repository Supporting Cooperative Applications.",
            "Using Metadata to Query Passive Data Sources.",
            "Compositional Specification and Reuse of a Generic Cooperative Agent Model.",
            "Agents in Overalls: Experiences and Issues in the Development and Deployment of Industrial Agent-Based Systems.",
            "Heterogeneous Digital Library Query Platform Using a Truly Distributed Multi-Agent Search.",
            "Supporting Distributed Autonomous Information Services Using Coordination.",
            "Perspectives on an Integrated Construction Project Model.",
            "Classifying Local Queries for Global Query Optimization in Multidatabase Systems.",
            "Editorial - Special Issue on \"Intelligent Integration of Information\".",
            "Lessons Learned from Applying AI to the Web.",
            "The Use of CARIN Language and Algorithms for Information Integration: The PICSEL System.",
            "Imprecise Answers in Distributed Environments: Estimation of Information Loss for Multi-Ontology Based Query Processing.",
            "Combining Document Representations.",
            "Future Needs in Integration of Information."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1999",
        "info": "Volume 8, 1999",
        "count": 13,
        "papers": [
            "Efficiency, Incentives, and Computational Tractability in Mas-Coordination.",
            "The ADR Replication Manager.",
            "Architecture of a Universal Database: A Frame Model Approach.",
            "Guest Editors' Introduction.",
            "On Interactions Between Coexisting Traditional and Cooperative Transactions.",
            "Integrating Execution Dependencies into the Transaction Closure Framework.",
            "Least Privilege Security in CapBasED-AMS.",
            "Methodology and Case Tools for the Development of Federated Databases.",
            "Dynamic Agents.",
            "Information Services for the Web: Building and Maintaining Domain Models.",
            "A Formalism for Context Mediation Based on Feature Logic.",
            "Learning Other Agents' Preferences in Multi-Agent Negotiation Using the Bayesian Classifier.",
            "The Characterization of Continuous Queries."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1998",
        "info": "Volume 7, 1998",
        "count": 16,
        "papers": [
            "Cooperative Information Systems: Interoperability in Health Care Legacy Applications.",
            "Enforcement of Inter-Task Dependencies in Workflows, Characterization and Paradigm.",
            "Merging Databases Under Constraints.",
            "Loosely-Specified Query Processing in Large-Scale Information Systems.",
            "Finding Multiple Local Minima Using Chaotic Jump.",
            "Information Services: Coping with the Information Crisis - Guest Editors' Introduction.",
            "Distributed Query Scheduling Service: An Architecture and Its Implementation.",
            "A Spatial/Temporal Query Language for Multiple Data Sources in a Heterogeneous Information System Environment.",
            "WAG: Web-at-a-Glance.",
            "The Dimensional Fact Model: A Conceptual Model for Data Warehouses.",
            "Supporting Electronic Commerce Transactions with Contracting Services.",
            "Combining Structured Documents with High-Level Petri-Nets for Workflow Modeling in Internet-Based Commerce.",
            "Market-Based Workflow Management.",
            "An Electronic Broker for Business-To-Business Electronic Commerce on the Internet.",
            "A Safe and Scalable Payment Infrastructure for Trade of Electronic Content.",
            "Reliability Concepts for Mobile Agents."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1997",
        "info": "Volume 6, 1997",
        "count": 16,
        "papers": [
            "Formal Methods in CIS: Multiagent Systems - Guest Editors' Introduction.",
            "The Structure and Verification of Plan-Based Joint Intentions.",
            "An Efficient Technique to Ensure the Logical Consistency of Interacting Knowledge Bases.",
            "On the Formal Specification and Verification of Multi-Agent Systems.",
            "DESIRE: Modelling Multi-Agent Systems in a Compositional Formal Framework.",
            "Minimization in Cooperative Response to Failing Database Queries.",
            "Semantic Query Processing in the Venus Environment.",
            "Is It Possible and Useful to Support Commitment Reasoning?",
            "Selected Papers from COOPIS-97 - Guest Editors' Introduction.",
            "Modifying Queries on Complex Objects in Database Federations.",
            "Loosely-Specified Query Processing in Large-Scale Information Systems.",
            "Context-Based Naming in Information Bases.",
            "HADAS: A Network-Centric Framework for Interoperability Programming.",
            "Extending Database Support for Coordination Among Agents.",
            "Cooperative Data Management and Its Application to Mobile Computing.",
            "A Logical Framework for Security Enforcement in CAPBASED-AMS."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1996",
        "info": "Volume 5, 1996",
        "count": 18,
        "papers": [
            "Interaction Between Agents in Routine, Familiar and Unfamiliar Situation.",
            "Consensus and Compromise: Planning in Cooperating Agents.",
            "A Framework for Object Matching in Federated Databases and Its Implementation.",
            "Special Issue on Tackling Complex Applications Using Multi-Agent Systems.",
            "Agent-Based Business Process Management.",
            "An Experimental Multi-Agent Environment For Engineering Design.",
            "Multi-Agent Planning and Coordination for Distributed Concurrent Engineering.",
            "Coordination of Multiple Intelligent Software Agents.",
            "A Multi-Agent Approach to Environment Exploration.",
            "Issues and Extensions for Information Matchmaking Protocols.",
            "Capturing and Modeling Coordination Knowledge for Multi-Agent Systems.",
            "From Local Assessments to Global Rationality.",
            "Using Priorities to Combine Knowledge Bases.",
            "Formal Methods in CIS: Heterogeneous Databases - Guest Editors' Introduction.",
            "Conceptualizing Semantic Interoperability: A Perspective From the Knowledge Level.",
            "A Hyperrelational Approach to Integration and Manipulation of Data in Multidatabase Systems.",
            "A Methodology for Query Reformulation in CIS Using Semantic Knowledge.",
            "Language Features for Cooperation in an Object-Oriented Database Environment."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1995",
        "info": "Volume 4, 1995",
        "count": 19,
        "papers": [
            "Editorial.",
            "An Overview of Reflection and Its Use in Cooperation.",
            "Enterprise Modelling and the Teleological Approach to Requirements Engineering.",
            "Interoperable Query Processing from Object to Relational Schemas Based on a Parameterized Canonical Representation.",
            "Special Issue on Business Modelling and Re-Engineering.",
            "From E-R to \"A-R\" - Modelling Strategic Actor Relationships for Business Process Reengineering.",
            "Business Process Modeling and Workflow Management.",
            "Modeling Business Processes Over Object.",
            "Modelling in Coordination Systems.",
            "Reference Conceptual Architectures for Re-Engineering Information Systems.",
            "An Executable Meta Model for Re-Engineering of Database Schemas.",
            "Extracting an Entity Relationship Schema From a Relational Database Through Reverse Engineering.",
            "Relational Database Reverse Engineering: A Method Based on Query Analysis.",
            "Heterogeneous Cooperative Knowledge-Base Systems.",
            "Agent Organization and Communication with Multiple Ontologies.",
            "A Distributed and Anonymous Knowledge Sharing Approach to Software Interoperation.",
            "Heterogeneous Distributed Cooperative Problem Solving System Helios and Its Cooperation Mechanisms.",
            "COBRA: Integration of Heterogeneous Knowledge-Bases in Medical Domain.",
            "Strategies for Selecting Communication Structures in Cooperative Search."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1994",
        "info": "Volume 3, 1994",
        "count": 21,
        "papers": [
            "Preface.",
            "An Object-Oriented Programming Environment for Multimedia Cooperative Information Systems.",
            "An Architecture for Dynamically Interacting Agents.",
            "Specification and Verification of Communication Constraints for Interoperable Transactions.",
            "The Role of Commitment in Cooperative Negotiation.",
            "Cooperative Modeling in Applied Geographic Research.",
            "Computer Support for Collaborative Work: Guest Editors' Introduction.",
            "Model Based Information Access.",
            "SHARE: A Methodology and Environment for Collaborative Product Development.",
            "SHASTRA - An Architecture for Development of Collaborative Applications.",
            "SWIFT: System Workbench for Integrating and Facilitating Teams.",
            "Infrastructure Support for Multimedia Communication: A Survey.",
            "Extending Group Communication Facilities to Support Complex Distributed Office Procedures.",
            "A Framework for Enforceable Specification of Extended Transaction Models and Transaction Workflows.",
            "Decision Support through Facilitating the Exchange of Experiences in a Distributed Environment.",
            "Managing Read-Only Data on Arbitrary Networks with Fully Distributed Caching.",
            "Response-Requirements Specific Object Model for Workgroup Computing.",
            "Combining Default Logic Databases.",
            "Amalgamating Knowledge Bases, II: Distributed Mediators.",
            "Query Evaluation in Partitoned Disjunctive Deductive Databases.",
            "Building a Federated Relational Database System: An Approach Using a Knowledge-Based System."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1993",
        "info": "Volume 2, 1993",
        "count": 21,
        "papers": [
            "Remote System Interfaces: An Approach to Overcoming the Heterogeneity Barrier and Retaining Local Autonomy in the Integration of Heterogeneous Systems.",
            "On Automatic Reasoning for Schema Integration.",
            "An Approach to Resolving Semantic Heterogenity in a Federation of Autonomous, Heterogeneous Database Systems.",
            "Distributed Cooperation in Integrated Information Systems.",
            "Information and Knowledge Management: Guest Editors' Introduction.",
            "Design and Implementation of a Knowledge-Based Query Processor.",
            "Retrieving and Integrating Data from Multiple Information Sources.",
            "Integrated Support for Data Archeology.",
            "An Active Database Approach to Consistency Management in Data- and Knowledge-Based Systems.",
            "A Unified Model and Methodology for Temporal Object Databases.",
            "Performance Study on Supporting Objects in O-Raid Distributed Database Systems.",
            "Database Supported Cooperative Problem Solving.",
            "Specification and Implementation of a Belief Desire-Joint_intention Architecture for Cooperative Problem Solving.",
            "An Efficient Management of Read-Only Data in a Distributed Information System.",
            "Snitch: Augmenting Hypertext Documents with a Semantic Net.",
            "Preface.",
            "Three Aspects of Intelligent Cooperation in the Quality Cycle.",
            "Representing and Using Interschema Knowledge in Cooperative Information Systems.",
            "A Reflective Approach for Data-Driven Rules.",
            "Application Modelling in Heterogeneous Environments Using an Object Specification Language.",
            "Management of Shared Data in Federated Cooperative PEER Environment."
        ]
    },
    {
        "name": "IJCIS",
        "year": "1992",
        "info": "Volume 1, 1992",
        "count": 22,
        "papers": [
            "Preface.",
            "Distributed Object Management.",
            "Beyond Objects: Objects.",
            "Classes and Instances.",
            "From Type Systems to Knowledge Representation: Natural Semantics Specifications for Description Logics.",
            "A Framework for Supporting Triggers in Object-Oriented Database Systems.",
            "Sharing Processes: Team Coordination in Design Repositories.",
            "An Organizational Framework for Cooperating Intelligent Information Systems.",
            "Knowledge Communication in Intelligent Information Systems.",
            "Intelligent and Cooperative Problem Solving: Guest Editors' Introduction.",
            "Developing Intelligent Information Systems: A Workshop Summary.",
            "On Intelligent and Cooperative Information Systems: A Workshop Summary.",
            "A Generic Model for Intelligent Negotiating Agents.",
            "Generalizing the Partial Global Planning Algorithm.",
            "Intelligent and Cooperative Information Systems Meet Machine Learning.",
            "A Distributed Problem-Solving Infrastructure for Computer Network Management.",
            "Integrating Distributed Expertise.",
            "Planning and Reacting Across Supervenient Level of Representation.",
            "Conceptual Schemas: Multi-faceted Tools for Desktop Scientific Experiment Management.",
            "The Fourth Decade of Software Engineering: Some Issues in Knowledge Management.",
            "An Architectural Survey of Object Management Systems.",
            "Towards a Model for Multidatabase Transactions."
        ]
    }
]