[
    {
        "name": "IJGIS",
        "year": "2021",
        "info": "Volume 35, 2021",
        "count": 106,
        "papers": [
            "Geographical information science for the United Nations' 2030 agenda for sustainable development.",
            "Collaborative spatial multicriteria evaluation: a review and directions for future research.",
            "A multicriteria optimization framework for the definition of the spatial granularity of urban social media analytics.",
            "The spatial structure of socioeconomic disadvantage: a Bayesian multivariate spatial factor analysis.",
            "Sherloc: a knowledge-driven algorithm for geolocating microblog messages at sub-city level.",
            "A Bayesian spatio-temporal model to analyzing the stability of patterns of population distribution in an urban space using mobile phone data.",
            "Efficient regionalization for spatially explicit neighborhood delineation.",
            "Local fuzzy geographically weighted clustering: a new method for geodemographic segmentation.",
            "RegNet: a neural network model for predicting regional desirability with VGI data.",
            "The Traj2Vec model to quantify residents' spatial trajectories and estimate the proportions of urban land-use types.",
            "Common mistakes in ecological niche models.",
            "Emotional habitat: mapping the global geographic distribution of human emotion with physical environmental factors using a species distribution model.",
            "Extracting knowledge from legacy maps to delineate eco-geographical regions.",
            "An integrated method for DEM simplification with terrain structural features and smooth morphology preserved.",
            "Uncertainties and errors in algorithms for elevation gradients.",
            "A comparative study of heterogeneous ensemble-learning techniques for landslide susceptibility mapping.",
            "Land cover harmonization using Latent Dirichlet Allocation.",
            "Identifying urban growth patterns through land-use/land-cover spatio-temporal metrics: Simulation and analysis.",
            "A spatiotemporal structural graph for characterizing land cover changes.",
            "Reproducibility and replicability: opportunities and challenges for geospatial research.",
            "Compliance and containment in social distancing: mathematical modeling of COVID-19 across townships.",
            "Space-time disease mapping by combining Bayesian maximum entropy and Kalman filter: the BME-Kalman approach.",
            "Graph convolutional autoencoder model for the shape coding and cognition of buildings in maps.",
            "A generic encoding and operation scheme for mixed aperture three and four hexagonal discrete global grid systems.",
            "An adaptive detection of multilevel co-location patterns based on natural neighborhoods.",
            "Geographically and temporally neural network weighted regression for modeling spatiotemporal non-stationary relationships.",
            "Analysis of the performance and robustness of methods to detect base locations of individuals with geo-tagged social media data.",
            "From 2SFCA to i2SFCA: integration, derivation and validation.",
            "A BiLSTM-CNN model for predicting users' next locations based on geotagged social media.",
            "Adaptive simplification of GPS trajectories with geographic context - a quadtree-based approach.",
            "L-function of geographical flows.",
            "A trajectory restoration algorithm for low-sampling-rate floating car data and complex urban road networks.",
            "A method to identify defensive assignments in team-based invasion sports using spatiotemporal trajectories.",
            "Multiple-aspect analysis of semantic trajectories(MASTER).",
            "A distributed framework for extracting maritime traffic patterns.",
            "Stop-and-move sequence expressions over semantic trajectories.",
            "Online discovery of co-movement patterns in mobility data.",
            "Measuring the similarity between multipolygons using convex hulls and position graphs.",
            "Minimum-area ellipse bounding an isovist: towards a 2D GIS-based efficient implementation.",
            "RIM: a ray intersection model for the analysis of the between relationship of spatial objects in a 2D plane.",
            "Delineation of cities based on scaling properties of urban patterns: a comparison of three methods.",
            "Spatiotemporal coverage analysis of moving regions.",
            "Discovering regions of anomalous spatial co-locations.",
            "A Voronoi-based method for land-use optimization using semidefinite programming and gradient descent algorithm.",
            "Qualitative-geometric 'surrounds' relations between disjoint regions.",
            "Movement-aware map construction.",
            "A proactive route planning approach to navigation errors.",
            "An adaptive approach for modelling the movement uncertainty in trajectory data based on the concept of error ellipses.",
            "Walking through the forests of the future: using data-driven virtual reality to visualize forests under climate change.",
            "Dynamic optimization models for displaying outdoor advertisement at the right time and place.",
            "Indoor mapping and modeling by parsing floor plan images.",
            "Identifying what constitutes complexity perception of decision points during indoor route guidance.",
            "An accessibility spatial search algorithm to optimize defibrillator deployment in indoor space.",
            "Establishing the integrated science of movement: bringing together concepts and methods from animal and human movement analysis.",
            "A scalable method to construct compact road networks from GPS trajectories.",
            "Using information entropy and a multi-layer neural network with trajectory data to identify transportation modes.",
            "The Point-Descriptor-Precedence representation for point configurations and movements.",
            "An index for moving objects with constant-time access to their compressed trajectories.",
            "Identifying home locations in human mobility data: an open-source R package for comparison and reproducibility.",
            "Detecting spatiotemporal extents of traffic congestion: a density-based moving object clustering approach.",
            "A hybrid data model for dynamic GIS: application to marine geomorphological dynamics.",
            "A data relocation approach for terrain surface analysis on multi-GPU systems: a case study on the total viewshed problem.",
            "An augmented representation method of debris flow scenes to improve public perception.",
            "An experimental analysis of least-cost path models on ordinal-scaled raster surfaces.",
            "A method for finding least-cost corridors with reduced distortion in raster space.",
            "Measuring shallow-water bathymetric signal strength in lidar point attribute data using machine learning.",
            "Spatiotemporal effects of climate factors on childhood hand, foot, and mouth disease: a case study using mixed geographically and temporally weighted regression models.",
            "Pattern-based identification and mapping of landscape types using multi-thematic data.",
            "Development of a multiscale discretization method for the geographical detector model.",
            "An interactive detector for spatial associations.",
            "GIScience integrated with computer vision for the examination of old engravings and drawings.",
            "Deploying machine learning to assist digital humanitarians: making image annotation in OpenStreetMap more efficient.",
            "Benford's law and geographical information - the example of OpenStreetMap.",
            "Tagging the main entrances of public buildings based on OpenStreetMap and binary imbalanced learning.",
            "Synthesizing location semantics from street view images to improve urban land-use classification.",
            "A comprehensive quality assessment framework for linear features from Volunteered Geographic Information.",
            "A methodological framework for analysis of participatory mapping data in research, planning, and management.",
            "Vehicular crowd-sensing: a parametric routing algorithm to increase spatio-temporal road network coverage.",
            "Understanding the modifiable areal unit problem in dockless bike sharing usage and exploring the interactive effects of built environment factors.",
            "Delineating urban job-housing patterns at a parcel scale with street view imagery.",
            "Complexity-based matching between image resolution and map scale for multiscale image-map generation.",
            "Exact space-time prism of an activity program: bidirectional searches in multi-state supernetwork.",
            "A method to evaluate task-specific importance of spatio-temporal units based on explainable artificial intelligence.",
            "Quantifying historical landscape change with repeat photography: an accuracy assessment of geospatial data obtained through monoplotting.",
            "On the suitability of a unified GIS-BIM-HBIM framework for cataloguing and assessing vulnerability in Historic Urban Landscapes: a critical review.",
            "Aligning geographic entities from historical maps for building knowledge graphs.",
            "Loosening the grid: topology as the basis for a more inclusive GIS.",
            "Urban land-use analysis using proximate sensing imagery: a survey.",
            "A comparison of a gradient boosting decision tree, random forests, and artificial neural networks to model urban land use changes: the case of the Seoul metropolitan area.",
            "Understanding the multifaceted geospatial software ecosystem: a survey approach.",
            "Applying frequent-pattern mining and time geography to impute gaps in smartphone-based human-movement data.",
            "A topic model based framework for identifying the distribution of demand for relief supplies using social media data.",
            "An offline map matching algorithm based on shortest paths.",
            "Multiscale geographically and temporally weighted regression with a unilateral temporal weighting scheme and its application in the analysis of spatiotemporal characteristics of house prices in Beijing.",
            "A quantitative comparison of regionalization methods.",
            "A spatial model of cognitive distance in cities.",
            "A georeferenced graph model for geospatial data matching by optimising measures of similarity across multiple scales.",
            "Spatially-encouraged spectral clustering: a technique for blending map typologies and regionalization.",
            "Spatial social networks in geographic information science.",
            "Connecting family trees to construct a population-scale and longitudinal geo-social network for the U.S.",
            "Modeling transit-assisted hurricane evacuation through socio-spatial networks.",
            "Mapping research networks supported by the National Geographic Society through spatial social networks.",
            "To racketeer among neighbors: spatial features of criminal collaboration in the American Mafia.",
            "Prediction of human activity intensity using the interactions in physical and social spaces through graph convolutional networks.",
            "A topology-based graph data model for indoor spatial-social networking.",
            "Decentralized geoprivacy: leveraging social trust on the distributed web."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2020",
        "info": "Volume 34, 2020",
        "count": 110,
        "papers": [
            "Fourth paradigm GIScience? Prospects for automated discovery and explanation from data.",
            "Logsum-type space-time accessibility measures (STAMs) that can be calibrated under a definite time budget.",
            "A polyhedra-based model for moving regions in databases.",
            "A new cellular automata framework of urban growth modeling by incorporating statistical and heuristic methods.",
            "Road and travel time cross-validation for urban modelling.",
            "Road network generalization considering traffic flow patterns.",
            "Modelling perceived risks to personal privacy from location disclosure on online social networks.",
            "Generation of navigation networks for corridor spaces based on indoor visibility map.",
            "An introduction to R for spatial analysis and mapping (Second Edition).",
            "SOCO-Field: observation capability representation for GeoTask-oriented multi-sensor planning cognition.",
            "Comparative usability of an augmented reality sandtable and 3D GIS for education.",
            "3D BIM-enabled spatial query for retrieving property boundaries: a case study in Victoria, Australia.",
            "Accelerating the shortest-path calculation using cut nodes for problem reduction and division.",
            "The 'Incense Road' from Petra to Gaza: an analysis using GIS and Cost functions.",
            "Real-time GIS for smart cities.",
            "Estimating real-time high-street footfall from Wi-Fi probe requests.",
            "Real-time and archival data visualisation techniques in city dashboards.",
            "Assessing public transit performance using real-time data: spatiotemporal patterns of bus operation delays in Columbus, Ohio, USA.",
            "Real-time mapping of natural disasters using citizen update streams.",
            "Spatio-temporal modeling of PM2.5 concentrations with missing data problem: a case study in Beijing, China.",
            "A fast candidate viewpoints filtering algorithm for multiple viewshed site planning.",
            "Free and open source GIS in South America: political inroads and local advocacy.",
            "Integrated edge detection and terrain analysis for agricultural terrace delineation from remote sensing images.",
            "Migration pattern of Yellow-throated buntings revealed by isotope-based geographic assignment.",
            "CostMAP: an open-source software package for developing cost surfaces using a multi-scale search kernel.",
            "An evaluation of compression algorithms applied to moving object trajectories.",
            "A deep learning architecture for semantic address matching.",
            "Spatial interpolation of marine environment data using P-MSN.",
            "A comprehensive framework for studying diffusion patterns of imported dengue with individual-based movement data.",
            "GeoAI: spatially explicit artificial intelligence techniques for geographic knowledge discovery and beyond.",
            "Automated terrain feature identification from remote sensing imagery: a deep learning approach.",
            "Using multi-scale and hierarchical deep convolutional features for 3D semantic classification of TLS point clouds.",
            "Street-Frontage-Net: urban image classification using deep convolutional neural networks.",
            "Machine learning for cross-gazetteer matching of natural features.",
            "Spatial interpolation using conditional generative adversarial neural networks.",
            "A global analysis of cities' geosocial temporal signatures for points of interest hours of operation.",
            "A locally-constrained YOLO framework for detecting small and densely-distributed building footprints.",
            "A hybrid integrated deep learning model for the prediction of citywide spatio-temporal flow volumes.",
            "Automatic alignment of contemporary vector data and georeferenced historical maps using reinforcement learning.",
            "Spatio-temporal regression kriging for modelling urban NO2 concentrations.",
            "A review of assessment methods for cellular automata models of land-use change and urban growth.",
            "A land-use mix allocation model considering adjacency, intensity, and proximity.",
            "Using a maximum entropy model to optimize the stochastic component of urban cellular automata models.",
            "Automatic extraction of road intersection points from USGS historical map series using deep convolutional neural networks.",
            "A novel residual graph convolution deep learning model for short-term network-based traffic forecasting.",
            "Detecting regional dominant movement patterns in trajectory data with a convolutional neural network.",
            "Evaluating the impact of visualization of risk upon emergency route-planning.",
            "Pedestrian network generation based on crowdsourced tracking data.",
            "Big Spatiotemporal Data Analytics: a research and innovation frontier.",
            "An empirical study on the intra-urban goods movement patterns using logistics big data.",
            "Fine-grained landuse characterization using ground-based pictures: a deep learning solution based on globally available data.",
            "Identifying primary public transit corridors using multi-source big transit data.",
            "Mining spatiotemporal association patterns from complex geographic phenomena.",
            "SOVAS: a scalable online visual analytic system for big climate data analysis.",
            "Extracting activity patterns from taxi trajectory data: a two-layer framework using spatio-temporal clustering, Bayesian probability and Monte Carlo simulation.",
            "Data-driven approach to characterize urban vitality: how spatiotemporal context dynamically defines Seoul's nighttime.",
            "Emerging trends and research frontiers in spatial multicriteria analysis.",
            "Reestimating a minimum acceptable geocoding hit rate for conducting a spatial analysis.",
            "Minimum geocoding match rates: an international study of the impact of data and areal unit sizes.",
            "Interoperable information model for geovisualization and interaction in XR environments.",
            "Geographically neural network weighted regression for the accurate estimation of spatial non-stationarity.",
            "Computational improvements to multi-scale geographically weighted regression.",
            "Obfuscating spatial point tracks with simulated crowding.",
            "MARC: a robust method for multiple-aspect trajectory classification via space, time, and semantic embeddings.",
            "Predictive land value modelling in Guatemala City using a geostatistical approach and Space Syntax.",
            "Simulating urban land use change by integrating a convolutional neural network with vector-based cellular automata.",
            "GIS: an introduction to mapping technologies.",
            "Modeling movement, distributions, diversity, and disturbance: introduction to the fifth special issue on spatial ecology.",
            "A geostatistical model for estimating edge effects and cumulative human disturbance in wetlands and coastal waters.",
            "Individual Movement - Sequence Analysis Method (IM-SAM): characterizing spatio-temporal patterns of animal habitat use across landscapes.",
            "GIS Investigation of the relationship of sex and season on the population distribution of common bottlenose dolphins (Tursiops truncatus) in Charleston, South Carolina.",
            "How do species and data characteristics affect species distribution models and when to use environmental filtering?",
            "Aggregating the conceptualization of movement data better captures real world and simulated animal-environment relationships.",
            "Incorporating behavior into animal movement modeling: a constrained agent-based model for estimating visit probabilities in space-time prisms.",
            "Reintroduction of the European bison (Bison bonasus) in central-eastern Europe: a case study.",
            "The impact of spatial scale: exploring urban butterfly abundance and richness patterns using multi-criteria decision analysis and principal component analysis.",
            "Leveraging parallel spatio-temporal computing for crime analysis in large datasets: analyzing trends in near-repeat phenomenon of crime in cities.",
            "Spatial crime distribution and prediction for sporting events using social media.",
            "A spatio-temporal method for crime prediction using historical crime data and transitional zones identified from nightlight imagery.",
            "Volunteered geographic information research in the first decade: a narrative review of selected journal articles in GIScience.",
            "NEAT approach for testing and validation of geospatial network agent-based model processes: case study of influenza spread.",
            "An overview of clustering methods for geo-referenced time series: from one-way clustering to co- and tri-clustering.",
            "A lightweight ensemble spatiotemporal interpolation model for geospatial data.",
            "Prediction-based parking allocation framework in urban environments.",
            "Network-constrained bivariate clustering method for detecting urban black holes and volcanoes.",
            "Coupling fuzzy clustering and cellular automata based on local maxima of development potential to model urban emergence and expansion in economic development zones.",
            "Why did a vehicle stop? A methodology for detection and classification of stops in vehicle trajectories.",
            "Space-time prisms on a sphere with applications to long-distance movement.",
            "From small sets of GPS trajectories to detailed movement profiles: quantifying personalized trip-dependent movement diversity.",
            "Delivering time-evolving 3D city models for web visualization.",
            "Multi-criteria spatial screening and uncertainty analysis applied to direct-use geothermal projects.",
            "Incorporating spatial association into statistical classifiers: local pattern-based prior tuning.",
            "GeoVisuals: a visual analytics approach to leverage the potential of spatial videos and associated geonarratives.",
            "Urban expansion in Auckland, New Zealand: a GIS simulation via an intelligent self-adapting multiscale agent-based model.",
            "Australian 'gayborhoods' and 'lesborhoods': a new method for estimating the number and prevalence of adult gay men and lesbian women living in each Australian postcode.",
            "A comparison of neighbourhood relations based on ordinary Delaunay diagrams and area Delaunay diagrams: an application to define the neighbourhood relations of buildings.",
            "Mapping uncertain geographical attributes: incorporating robustness into choropleth classification design.",
            "Analysis of the spatiotemporal riding modes of dockless shared bicycles based on tensor decomposition.",
            "A machine learning approach for predicting computational intensity and domain decomposition in parallel geoprocessing.",
            "A multi-scale representation model of polyline based on head/tail breaks.",
            "Geospatial data conflation: a formal approach based on optimization and relational databases.",
            "Visions of time in geospatial ontologies from Indigenous peoples: a case study with the Eastern Cree in Northern Quebec.",
            "Semantic trajectory segmentation based on change-point detection and ontology.",
            "Progress in computational movement analysis - towards movement data science.",
            "Group diagrams for representing trajectories.",
            "Empirical assessment of road network resilience in natural hazards using crowdsourced traffic data.",
            "Understanding intra-urban human mobility through an exploratory spatiotemporal analysis of bike-sharing trajectories.",
            "Exploring the heterogeneity of human urban movements using geo-tagged tweets.",
            "Characterizing traveling fans: a workflow for event-oriented travel pattern analysis using Twitter data.",
            "The M³ massive movement model: a distributed incrementally updatable solution for big movement data exploration."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2019",
        "info": "Volume 33, 2019",
        "count": 118,
        "papers": [
            "A method for checking the quality of geographic metadata based on ISO 19157.",
            "Distinguishing extensive and intensive properties for meaningful geocomputation and mapping.",
            "Simulating urban growth boundaries using a patch-based cellular automaton with economic and ecological constraints.",
            "A proportional odds model of human mobility and migration patterns.",
            "Boolean matrix operators for computing binary topological relations between complex regions.",
            "Detecting arbitrarily shaped clusters in origin-destination flows using ant colony optimization.",
            "Fast Geographically Weighted Regression (FastGWR): a scalable algorithm to investigate spatial process heterogeneity in millions of observations.",
            "A spatiotemporal calculus for reasoning about land-use trajectories.",
            "Using multiple scale spatio-temporal patterns for validating spatially explicit agent-based models.",
            "Analysis of the appearance and disappearance of point objects over time.",
            "A spatial heterogeneity-based rough set extension for spatial data.",
            "Designing efficient and balanced police patrol districts on an urban street network.",
            "Automatic determination of stream networks from DEMs by using road network data to locate culverts.",
            "Hyperparameter optimization of neural network-driven spatial models accelerated using cyber-enabled high-performance computing.",
            "Reflections and speculations on the progress in Geographic Information Systems (GIS): a geographic perspective.",
            "A center-based modeling approach to solve the districting problem.",
            "An approach for understanding human activity patterns with the motivations behind.",
            "Computational reproducibility in geoscientific papers: Insights from a series of studies with geoscientists and a reproduction study.",
            "The desaturation method of DMSP/OLS nighttime light data based on vector data: taking the rapidly urbanized China as an example.",
            "The Equal Earth map projection.",
            "A density-based approach for detecting network-constrained clusters in spatial point events.",
            "Multiscale geographically and temporally weighted regression: exploring the spatiotemporal determinants of housing prices.",
            "Embedding road networks and travel time into distance metrics for urban modelling.",
            "Network-scape metric analysis: a new approach for the pattern analysis of urban road networks.",
            "A visualization approach for discovering colocation patterns.",
            "Supporting multi-resolution out-of-core rendering of massive LiDAR point clouds through non-redundant data structures.",
            "A simple and direct method to analyse the influences of sampling fractions on modelling intra-city human mobility.",
            "Usability evaluation for geographic information systems: a systematic literature review.",
            "A spatio-contextual probabilistic model for extracting linear features in hilly terrains from high-resolution DEM data.",
            "Integration of nighttime light remote sensing images and taxi GPS tracking data for population surface enhancement.",
            "Representation and analytical models for location-based big data.",
            "A natural language processing and geospatial clustering framework for harvesting local place names from geotagged housing advertisements.",
            "Inferring user tasks in pedestrian navigation from eye movement data in real-world environments.",
            "Geographic space as a living structure for predicting human activities using big data.",
            "A conceptual framework for studying collective reactions to events in location-based social media.",
            "Modeling and visualizing semantic and spatio-temporal evolution of topics in interpersonal communication on Twitter.",
            "A methodology with a distributed algorithm for large-scale trajectory distribution prediction.",
            "Erratum.",
            "Towards an integrated science of movement: converging research on animal movement ecology and human mobility science.",
            "Modeling urban growth in a metropolitan area based on bidirectional flows, an improved gravitational field model, and partitioned cellular automata.",
            "Space-time prism bounds of activity programs: a goal-directed search in multi-state supernetworks.",
            "A model for phased evacuations for disasters with spatio-temporal randomness.",
            "The scale effects of the spatial autocorrelation measurement: aggregation level and spatial resolution.",
            "A statistical method for detecting spatiotemporal co-occurrence patterns.",
            "A fuzzy formal concept analysis-based approach to uncovering spatial hierarchies among vague places extracted from user-generated data.",
            "Metrics for characterizing network structure and node importance in Spatial Social Networks.",
            "Examining the sensitivity of spatial scale in cellular automata Markov chain simulation of land use change.",
            "Measuring inter-city connectivity in an urban agglomeration based on multi-source data.",
            "Detecting clusters over intercity transportation networks using K-shortest paths and hierarchical clustering: a case study of mainland China.",
            "Commercial GIS location analytics: capabilities and performance.",
            "Uncertainty and context in GIScience and geography: challenges in the era of geospatial big data.",
            "Uncertainty in the effects of the modifiable areal unit problem under different levels of spatial autocorrelation: a simulation study.",
            "Spatial autocorrelation and data uncertainty in the American Community Survey: a critique.",
            "Uncertainties in the geographic context of health behaviors: a study of substance users' exposure to psychosocial stress using GPS data.",
            "Exploring the uncertainty of activity zone detection using digital footprints with multi-scaled DBSCAN.",
            "Same space - different perspectives: comparative analysis of geographic context through sketch maps and spatial video geonarratives.",
            "Travel impedance agreement among online road network data providers.",
            "A network approach to the production of geographic context using exponential random graph models.",
            "A comment on geographically weighted regression with parameter-specific distance metrics.",
            "A response to 'A comment on geographically weighted regression with parameter-specific distance metrics'.",
            "Modeling spatially non-stationary land use/cover change in the lower Connecticut River Basin by combining geographically weighted logistic regression and the CA-Markov model.",
            "Spatial land use regression of nitrogen dioxide over a 5-year interval in Calgary, Canada.",
            "Quantifying the spatial heterogeneity of points.",
            "A surface network based method for studying urban hierarchies by night time light remote sensing data.",
            "Assessing the performance of 38 machine learning models: the case of land consumption rates in Bavaria, Germany.",
            "Automatic analysis of positional plausibility for points of interest in OpenStreetMap using coexistence patterns.",
            "OutDet: an algorithm for extracting the outer surfaces of building information models for integration with geographic information systems.",
            "The effect of temporal sampling intervals on typical human mobility indicators obtained from mobile phone location data.",
            "A crowd sensing system identifying geotopics and community interests from user-generated content.",
            "Recommending attractive thematic regions by semantic community detection with multi-sourced VGI data.",
            "Simulating the spatial diffusion of memes on social media networks.",
            "Hierarchical community detection and functional area identification with OSM roads and complex graph theory.",
            "Crowdsourced geospatial data quality: challenges and future directions.",
            "Using provenance to disambiguate locational references in social network posts.",
            "The 'cottage effect' in citizen science? Spatial bias in aquatic monitoring programs.",
            "Placing Wikimapia: an exploratory analysis.",
            "Analysis of collaboration networks in OpenStreetMap through weighted social multigraph mining.",
            "VGTrust: measuring trust for volunteered geographic information.",
            "Implementing Moran eigenvector spatial filtering for massively large georeferenced datasets.",
            "Two-stage permutation tests for determining homogeneity within a spatial cluster.",
            "A comparative analysis of accessibility measures by the two-step floating catchment area (2SFCA) method.",
            "Getting Charlie off the MTA: a multiobjective optimization method to account for cost constraints in public transit accessibility metrics.",
            "Spatially-explicit sensitivity and uncertainty analysis in a MCDA-based flood vulnerability model.",
            "Analysis of positional uncertainty of road networks in volunteered geographic information with a statistically defined buffer-zone method.",
            "An approach for computing routes without complicated decision points in landmark-based pedestrian navigation.",
            "SMSM: a similarity measure for trajectory stops and moves.",
            "A representativeness-directed approach to mitigate spatial bias in VGI for the predictive mapping of geographic phenomena.",
            "Deep spatio-temporal residual neural networks for road-network-based data modeling.",
            "Correction.",
            "A space-time varying graph for modelling places and events in a network.",
            "Frequent subgraph mining in oceanographic multi-level directed graphs.",
            "Simulation of urban expansion via integrating artificial neural network with Markov chain - cellular automata.",
            "Parallelization of the flow-path network model using a particle-set strategy.",
            "Vehicle trajectory modelling with consideration of distant neighbouring dependencies for destination prediction.",
            "A building label placement method for 3D visualizations based on candidate label evaluation and selection.",
            "Flow Cross K-function: a bivariate flow analytical method.",
            "Automated placement of supplementary contour lines.",
            "The impact of interactive visualization on trade-off-based geospatial decision-making.",
            "Sensitivity of disease cluster detection to spatial scales: an analysis with the spatial scan statistic method.",
            "Fuzzy ontology-based foreshore identification from digital terrain models and very high-resolution airborne imagery through GEOBIA multi-scale analysis.",
            "Analysing the positional accuracy of GNSS multi-tracks obtained from VGI sources to generate improved 3D mean axes.",
            "Uncertain seas: probabilistic modeling of future coastal flood zones.",
            "Integration of air pollution data collected by mobile sensors and ground-based stations to derive a spatiotemporal air pollution profile of a city.",
            "Flood evacuation simulations using cellular automata and multiagent systems -a human-environment relationship perspective.",
            "Simulating urban dynamics by coupling top-down and bottom-up strategies.",
            "Turn calculations for the indoor application of the fewest turns path algorithm.",
            "Integrating general principles into mixed-integer programming to optimize schematic network maps.",
            "Location covering models: history, applications and advancements (Advances in Spatial Science).",
            "STLP-GSM: a method to predict future locations of individuals based on geotagged social media data.",
            "A human-machine adversarial scoring framework for urban perception assessment using street-view images.",
            "A regionalization method for clustering and partitioning based on trajectories from NLP perspective.",
            "Extracting urban landmarks from geographical datasets using a random forests classifier.",
            "The geospatial humanities: past, present and future.",
            "Hearing the silence: finding the middle ground in the spatial humanities? Extracting and comparing perceived silence and tranquillity in the English Lake District.",
            "A quad-tree-based fast and adaptive Kernel Density Estimation algorithm for heat-map generation.",
            "Mapping urban fingerprints of odonyms automatically extracted from French novels.",
            "Named entity recognition goes to old regime France: geographic text analysis for early modern French corpora.",
            "Infrastructural semantics: postal networks and statistical accounts in Scotland, 1790-1845."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2018",
        "info": "Volume 32, 2018",
        "count": 119,
        "papers": [
            "GeoCorpora: building a corpus to test and train microblog geoparsers.",
            "A hybrid method for Chinese address segmentation.",
            "Social media analytics for natural disaster management.",
            "Simulating urban dynamics in China using a gradient cellular automata model based on S-shaped curve evolution characteristics.",
            "Gradually morphing a thematic map series based on cellular automata.",
            "Size distribution of urban blocks in the Tokyo Metropolitan Region: estimation by urban block density and road width on the basis of normative plane tessellation.",
            "Unveiling movement uncertainty for robust trajectory similarity analysis.",
            "A Balanced Route Design for Min-Max Multiple-Depot Rural Postman Problem (MMMDRPP): a police patrolling case.",
            "Leveraging correlation across space and time to interpolate geophysical data via CoKriging.",
            "Spatial subdivision of complex indoor environments for 3D indoor navigation.",
            "A comparison of scenario-based hybrid bilevel and multi-objective location-allocation models for earthquake emergency shelters: a case study in the central area of Beijing, China.",
            "Exploring the relationship between density and completeness of urban building data in OpenStreetMap for quality estimation.",
            "A continuous deployment-based approach for the collaborative creation, maintenance, testing and deployment of CityGML models.",
            "A tile-based method for geodesic buffer generation in a virtual globe.",
            "Toponym matching through deep neural networks.",
            "A spatial fuzzy influence diagram for modelling spatial objects' dependencies: a case study on tree-related electric outages.",
            "Relocation optimization of electric cars in one-way car-sharing systems: modeling, exact solving and heuristics algorithms.",
            "A high-performance cellular automata model for urban simulation based on vectorization and parallel computing technology.",
            "Mapping spatiotemporal patterns of events using social media: a case study of influenza trends.",
            "An Extended Minimum Spanning Tree method for characterizing local urban patterns.",
            "An efficient method for rendering linear symbols on 3D terrain using a shader language.",
            "Generating vague neighbourhoods through data mining of passive web data.",
            "Integrating spatial and temporal contexts into a factorization model for POI recommendation.",
            "Fast map matching, an algorithm integrating hidden Markov model with precomputation.",
            "A statistical test on the local effects of spatially structured variance.",
            "Automatic change detection in lane-level road networks using GPS trajectories.",
            "Assessing trends and seasonal changes in elephant poaching risk at the small area level using spatio-temporal Bayesian modeling.",
            "A meta-modeling approach for spatio-temporal uncertainty and sensitivity analysis: an application for a cellular automata-based Urban growth and land-use change model.",
            "A new geodemographic classification of commuting flows for England and Wales.",
            "A spatial dynamic model of population changes in a vulnerable coastal environment.",
            "A discrete global grid system for earth system modeling.",
            "Characterizing mixed-use buildings based on multi-source big data.",
            "A comparative approach to modelling multiple urban land use changes using tree-based methods and cellular automata: the case of Greater Tokyo Area.",
            "Inferring spatial interaction patterns from sequential snapshots of spatial distributions.",
            "Combining land cover products using a minimum divergence and a Bayesian data fusion approach.",
            "Multi-objective spatially constrained clustering for regionalization with particle swarm optimization.",
            "Spatial health inequalities: adapting GIS tools and data analysis.",
            "GIScience for a driverless age.",
            "Are prominent mountains frequently mentioned in text? Exploring the spatial expressiveness of text frequency.",
            "Exploring maps by sounds: using parameter mapping sonification to make digital elevation models audible.",
            "Improving the performance of genetic algorithms for land-use allocation problems.",
            "Volunteered geographic information quality assessment using trust and reputation modelling in land administration systems in developing countries.",
            "Classifying airborne LiDAR point clouds via deep features learned by a multi-scale convolutional neural network.",
            "A spatial co-location mining algorithm that includes adaptive proximity improvements and distant instance references.",
            "Remotely sensed agricultural modification improves prediction of suitable habitat for a threatened lizard.",
            "Random encounters in probabilistic time geography.",
            "Attribute trajectory analysis: a framework to analyse attribute changes using trajectory analysis techniques.",
            "Comparison of methods for quantifying consumer spending on retail using publicly available data.",
            "Context-aware automated interpretation of elaborate natural language descriptions of location through learning from empirical data.",
            "Synchronising geometric representations for map mashups using relative positioning and Linked Data.",
            "Using a hydro-reference ontology to provide improved computer-interpretable semantics for the groundwater markup language (GWML2).",
            "Exploring the sensitivity of coastal inundation modelling to DEM vertical error.",
            "Gen*: a generic toolkit to generate spatially explicit synthetic populations.",
            "Toward space-time buffering for spatiotemporal proximity analysis of movement data.",
            "Mining significant crisp-fuzzy spatial association rules.",
            "Mapping and the citizen sensor.",
            "Yes, we can (do GIS): a review of new lines: critical GIS and the trouble of the map.",
            "Moving ahead with computational movement analysis.",
            "Analytics of movement through checkpoints.",
            "A multidimensional spatial scan statistics approach to movement pattern comparison.",
            "Detecting spatial community structure in movements.",
            "Interactional regions in cities: making sense of flows across networked systems.",
            "A context-based geoprocessing framework for optimizing meetup location of multiple moving objects along road networks.",
            "Segmenting human trajectory data by movement states while addressing signal loss and signal noise.",
            "Mining and visual exploration of closed contiguous sequential patterns in trajectories.",
            "Using interactions and dynamics for mining groups of moving objects from trajectory data.",
            "How do cyclists make their way? - A GPS-based revealed preference study in Copenhagen.",
            "How many days are enough?: capturing routine human mobility.",
            "Testing time-geographic density estimation for home range analysis using an agent-based model of animal movement.",
            "Spatiotemporal dynamics of cattle behavior and resource selection patterns on East African rangelands: evidence from GPS-tracking.",
            "Voronoi tessellation on the ellipsoidal earth for vector data.",
            "Geomorphometry on the surface of a triaxial ellipsoid: towards the solution of the problem.",
            "Describing and comparing landscapes using tags, texts, and free lists: an interdisciplinary approach.",
            "Mapping ecosystem services at the regional scale: the validity of an upscaling approach.",
            "The life cycle of contributors in collaborative online communities -the case of OpenStreetMap.",
            "RecNet: a deep neural network for personalized POI recommendation in location-based social networks.",
            "Quantifying multi-modal public transit accessibility for large metropolitan areas: a time-dependent reliability modeling approach.",
            "Optimize taxi driving strategies based on reinforcement learning.",
            "Using geodata and geolocation in the social sciences: mapping our changing world, by David Abernathy, Thousand Oaks, CA, Sage Publishing, 2017, 344 pp., $50.00, £27.99 (paperback), ISBN 9781473908185.",
            "Coupling maximum entropy modeling with geotagged social media data to determine the geographic distribution of tourists.",
            "A data model for moving regions of fixed shape in databases.",
            "Fine-grained prediction of urban population using mobile phone location data.",
            "An integrated web-based air pollution decision support system - a prototype.",
            "Improving the throughput of transportation networks with a time-optimization routing strategy.",
            "Uncertainty modeling and analysis of surface area calculation based on a regular grid digital elevation model (DEM).",
            "A two-stage estimation method with bootstrap inference for semi-parametric geographically weighted generalized linear models.",
            "Integrating multi-agent evacuation simulation and multi-criteria evaluation for spatial allocation of urban emergency shelters.",
            "Erratum.",
            "Opening GIScience: A process-based approach.",
            "A spatiotemporal regression-kriging model for space-time interpolation: a case study of chlorophyll-a prediction in the coastal areas of Zhejiang, China.",
            "Enhancing areal interpolation frameworks through dasymetric refinement to create consistent population estimates across censuses.",
            "Spatial mining of migration patterns from web demographics.",
            "A formal framework for the representation of stack-based terrains.",
            "A new approach to simplifying polygonal and linear features using superpixel segmentation.",
            "Spatial association detector (SPADE).",
            "Mining transition rules of cellular automata for simulating urban expansion by using the deep learning techniques.",
            "A critical evaluation of 3D spatial information models for managing legal arrangements of multi-owned developments in Victoria, Australia.",
            "Comparing historical and contemporary maps - a methodological framework for a cartographic map comparison applied to Swiss maps.",
            "A data model and algorithms for a spatial data marketplace.",
            "A spatial and statistical analysis of the impact of transformation of raster cost surfaces on the variation of least-cost paths.",
            "Multi-level temporal autoregressive modelling of daily activity satisfaction using GPS-integrated activity diary data.",
            "Toward a participatory VGI methodology: crowdsourcing information on regional food assets.",
            "A hybrid ensemble learning method for tourist route recommendations based on geo-tagged social networks.",
            "Fictive motion extraction and classification.",
            "Ecological metrics and methods for GPS movement data.",
            "Urban growth simulation by incorporating planning policies into a CA-based future land-use simulation model.",
            "A Time Monte Carlo method for addressing uncertainty in land-use change models.",
            "Urban Analytics.",
            "Generating urban road intersection models from low-frequency GPS trajectory data.",
            "An algorithm for on-the-fly K shortest paths finding in multi-storey buildings using a hierarchical topology model.",
            "Spatial association between regionalizations using the information-theoretical V-measure.",
            "A parallel method to accelerate spatial operations involving polygon intersections.",
            "Historic reconstruction of reservoir topography using contour line interpolation and structure from motion photogrammetry.",
            "Are all cities with similar urban form or not? Redefining cities with ubiquitous points of interest and evaluating them with indicators at city and block levels in China.",
            "Integrating algebraic multigrid method in spatial aggregation of massive trajectory data.",
            "Special section in honor of Andrew U. Frank.",
            "Andrew U. Frank's impact on research in land administration.",
            "Formal representation of qualitative direction.",
            "The world, the computer, and the mind: how Andrew Frank helped make human language and cognition cornerstones of geographic information science."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2017",
        "info": "Volume 31, 2017",
        "count": 118,
        "papers": [
            "Embedding user-generated content into oblique airborne photogrammetry-based 3D city model.",
            "A spatiotemporal indexing approach for efficient processing of big array-based climate data with MapReduce.",
            "Spatiotemporal correlation in WebGIS group-user intensive access patterns.",
            "Similarity matching for integrating spatial information extracted from place descriptions.",
            "A city hit by an earthquake: an HGIS approach to reconstructing the damage in Tiberias (Israel) in 1837.",
            "Measuring urban activities using Foursquare data and network analysis: a case study of Murcia (Spain).",
            "A modelling framework for the study of Spatial Data Infrastructures applied to coastal management and planning.",
            "A review of volunteered geographic information quality assessment methods.",
            "Predicting the visualization intensity for interactive spatio-temporal visual analytics: a data-driven view-dependent approach.",
            "Climatic niche breadth can explain variation in geographical range size of alpine and subalpine plants.",
            "The benefits of a high-resolution analysis of transit accessibility.",
            "For your eyes only? Evaluating a coordinated and multiple views tool with a map, a parallel coordinated plot and a table using an eye-tracking approach.",
            "Shape similarity measurement model for holed polygons based on position graphs and Fourier descriptors.",
            "Spatial co-location pattern mining of facility points-of-interest improved by network neighborhood and distance decay effects.",
            "Envelope generation and simplification of polylines using Delaunay triangulation.",
            "Visual analytics of delays and interaction in movement data.",
            "AFV refueling stations and the complexity of freeway intersections: the scale dependency of network representation.",
            "Unusual behavior detection and object ranking from movement trajectories in target regions.",
            "A peak-cluster assessment method for the identification of upland planation surfaces.",
            "Object-oriented tracking of the dynamic behavior of urban heat islands.",
            "30 years of IJGIS: the changing landscape of geographical information science and the road ahead.",
            "Multi-granularity periodic activity discovery for moving objects.",
            "A participatory framework for developing public participation GIS solutions to improve resource management systems.",
            "GIS-based dynamic modelling and analysis of flash floods considering land-use planning.",
            "Extending a BIM-based data model to support 3D digital management of complex ownership spaces.",
            "Mining online footprints to predict user's next location.",
            "Classifying natural-language spatial relation terms with random forest algorithm.",
            "An efficient incremental algorithm for generating the characteristic shape of a dynamic set of points in the plane.",
            "Personalized sightseeing tours: a model for visits in art museums.",
            "Configuring the neighbourhood effect in irregular cellular automata based models.",
            "Calculating on a round planet.",
            "Measurements of POI-based mixed use and their relationships with neighbourhood vibrancy.",
            "Testing spatial heterogeneity in geographically weighted principal components analysis.",
            "Towards a knowledge base to support geoprocessing workflow development.",
            "A hybrid genetic algorithm with local optimiser improves calibration of a vegetation change cellular automata model.",
            "Sensitivity of a stochastic land-cover change model to pixel versus polygonal land units.",
            "A spatial zoning approach to calibrate and validate urban growth models.",
            "Measuring place-based accessibility under travel time uncertainty.",
            "Improving the sampling strategy for point-to-point line-of-sight modelling in urban environments.",
            "Sensing spatial distribution of urban land use by integrating points-of-interest and Google Word2Vec model.",
            "A cartographic modeling approach to isopleth mapping.",
            "A context-sensitive correlated random walk: a new simulation model for movement.",
            "GIS diffusion in Uganda.",
            "A cyber-enabled spatial decision support system to inventory Mangroves in Mozambique: coupling scientific workflows and cloud computing.",
            "A 3D multi-threshold, region-growing algorithm for identifying dust storm features from model simulations.",
            "The Network-Max-P-Regions model.",
            "Geographically weighted regression with parameter-specific distance metrics.",
            "3D tree modeling from incomplete point clouds via optimization and L1-MST.",
            "An intelligent spatial land use planning support system using socially rational agents.",
            "A simplified linear feature matching method using decision tree analysis, weighted linear directional mean, and topological relationships.",
            "Parallel identification and filling of depressions in raster digital elevation models.",
            "The analysis and measurement of building patterns using texton co-occurrence matrices.",
            "A trajectory clustering approach based on decision graph and data field for detecting hotspots.",
            "A framework of spatio-temporal trajectory simplification methods.",
            "Exploring spatiotemporal clusters based on extended kernel estimation methods.",
            "Enabling smart data selection based on data completeness measures: a quality-aware approach.",
            "Modeling dynamic urban land-use change with geographical cellular automata and generalized pattern search-optimized rules.",
            "Mapping fine-scale population distributions at the building level by integrating multisource geospatial big data.",
            "A data-synthesis-driven method for detecting and extracting vague cognitive regions.",
            "The GRASS GIS temporal framework.",
            "Depicting urban boundaries from a mobility network of spatial interactions: a case study of Great Britain with geo-located Twitter data.",
            "Modeling urban expansion by using variable weights logistic cellular automata: a case study of Nanjing, China.",
            "Ripe for the picking? Dataset maturity assessment based on temporal dynamics of feature definitions.",
            "3D building roof reconstruction from airborne LiDAR point clouds: a framework based on a spatial database.",
            "Global multi-layer network of human mobility.",
            "A similarity-based automatic data recommendation approach for geographic models.",
            "Mapping changes of residence with passive mobile positioning data: the case of Estonia.",
            "Safe separation distance score: a new metric for evaluating wildland firefighter safety zones using lidar.",
            "Parallel constrained Delaunay triangulation on the GPU.",
            "Shape-adaptive geometric simplification of heterogeneous line datasets.",
            "Force-directed layout of origin-destination flow maps.",
            "A linear tessellation model to identify spatial pattern in urban street networks.",
            "PolarGlobe: A web-wide virtual globe system for visualizing multidimensional, time-varying, big climate data.",
            "Aggregation-based information retrieval system for geospatial data catalogs.",
            "Experiences and issues of using cellular automata for assisting urban and regional planning in China.",
            "Enhancing spatial accuracy of mobile phone data using multi-temporal dasymetric interpolation.",
            "Data-driven estimation of building interior plans.",
            "Classifying urban land use by integrating remote sensing and social media data.",
            "Ontologies and representation spaces for sketch map interpretation.",
            "The geometry of space-time prisms with uncertain anchors.",
            "A feature extraction and similarity metric-learning framework for urban model retrieval.",
            "Gaze-Informed location-based services.",
            "A CA-based land system change model: LANDSCAPE.",
            "MapMosaic: dynamic layer compositing for interactive geovisualization.",
            "Multi-level method for discovery of regional co-location patterns.",
            "Integrating multi-source big data to infer building functions.",
            "Optimization of simulation and visualization analysis of dam-failure flood disaster for diverse computing systems.",
            "Simultaneously simulate vertical and horizontal expansions of a future urban landscape: a case study in Wuhan, Central China.",
            "Quality assessment of building footprint data using a deep autoencoder network.",
            "Performance of shape indices and classification schemes for characterising perceptual shape complexity of building footprints in GIS.",
            "Evaluation of a spatially adaptive approach for land surface classification from digital elevation models.",
            "Estimating the prediction performance of spatial models via spatial k-fold cross validation.",
            "An artificial bee colony-based multi-objective route planning algorithm for use in pedestrian navigation at night.",
            "Template-based GIS computation: a geometric algebra approach.",
            "A GPU-accelerated adaptive kernel density estimation approach for efficient point pattern analysis on spatial big data.",
            "Critical GIS pedagogies beyond 'Week 10: Ethics'.",
            "Linked data: a geographic perspective.",
            "Spatiotemporal model for assessing the stability of urban human convergence and divergence patterns.",
            "A GIS-based fire spread simulator integrating a simplified physical wildland fire model and a wind field model.",
            "Kinetic prisms: incorporating acceleration limits into space-time prisms.",
            "Exploring the performance of spatio-temporal assimilation in an urban cellular automata model.",
            "Computing a hierarchy favored optimal route in a Voronoi-based road network with multiple levels of detail.",
            "A new algorithm to find raster-based least-cost paths using cut and fill operations.",
            "Knowledge-guided consistent correlation analysis of multimode landslide monitoring data.",
            "Reducing the grid orientation dependence of flow routing on square-grid digital elevation models.",
            "Color map design for visualization in flood risk assessment.",
            "A comprehensive methodology for discovering semantic relationships among geospatial vocabularies using oceanographic data discovery as an example.",
            "Introduction to GIS programming and fundamentals with python and ArcGIS.",
            "Coupling mobile phone and social media data: a new approach to understanding urban functions and diurnal patterns.",
            "A collective human mobility analysis method based on data usage detail records.",
            "Assessing the applicability of OpenStreetMap data to assist the validation of land use/land cover maps.",
            "Social Distance metric: from coordinates to neighborhoods.",
            "Extracting and analyzing semantic relatedness between cities using news articles.",
            "Simulating urban land-use changes at a large scale by integrating dynamic land parcel subdivision and vector-based cellular automata.",
            "Calibrating a Land Parcel Cellular Automaton (LP-CA) for urban growth simulation based on ensemble learning.",
            "Designing spatially cohesive nature reserves with backup coverage.",
            "Automation and evaluation of graduated dot maps.",
            "Editorial Board."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2016",
        "info": "Volume 30, 2016",
        "count": 128,
        "papers": [
            "Space, time, connectivity and conflict in biological landscapes: the fourth special issue on spatial ecology.",
            "Intraspecific variations in home range overlaps of a semi-free range herbivore are explained by remotely sensed productivity.",
            "Range-expanding wildlife: modelling the distribution of large mammals in Japan, with management implications.",
            "Visualising continuous intra-landscape isolation with uncertainty using least-cost modelling based catchment areas: common brushtail possums in the Auckland isthmus.",
            "Spatial analysis of heath toponymy in relation to present-day heathland distribution.",
            "Modelling forest canopy trends with on-demand spatial simulation.",
            "A wildlife movement approach to optimally locate wildlife crossing structures.",
            "Hyper-temporal SPOT-NDVI dataset parameterization captures species distributions.",
            "Towards a national bio-environmental data facility: experiences from the Atlas of Living Australia.",
            "Geospatial data of freshwater habitats for macroecological studies: an example with freshwater fishes.",
            "A function-based linear map symbol building and rendering method using shader language.",
            "Distinctions of geomorphological properties caused by different flow-direction predictions from digital elevation models.",
            "Network-constrained and category-based point pattern analysis for Suguo retail stores in Nanjing, China.",
            "Storage-efficient method for generating contours focusing on roundness.",
            "Assessing the effectiveness of different visualizations for judgments of positional uncertainty.",
            "Visualisation and evaluation of flood uncertainties based on ensemble modelling.",
            "Empirical determination of geometric parameters for selective omission in a road network.",
            "A multiscale masking method for point geographic data.",
            "Why GPS makes distances bigger than they are.",
            "Incorporating spatial interaction patterns in classifying and understanding urban land use.",
            "The Minkowski approach for choosing the distance metric in geographically weighted regression.",
            "Geo-temporal Twitter demographics.",
            "Spatially constrained clustering of ecological units to facilitate the design of integrated water monitoring networks in the St. Lawrence Basin.",
            "A metaheuristic approach for efficient and effective sketch-to-metric map alignment.",
            "Cyberinfrastructure, GIS, and spatial optimization: opportunities and challenges.",
            "A parallel algorithm for coverage optimization on multi-core architectures.",
            "Spatial optimization for regionalization problems with spatial interaction: a heuristic approach.",
            "Measuring segregation as a spatial optimisation problem, revisited: a case study of London, 1991-2011.",
            "A hybrid parallel cellular automata model for urban growth simulation over GPU/CPU heterogeneous architectures.",
            "A unified approach for location-allocation analysis: integrating GIS, distributed computing and spatial optimization.",
            "Estimating spatial efficiency using cyber search, GIS, and spatial optimization: a case study of fire service deployment in Los Angeles County.",
            "Optimal routing for waste collection: a case study in Singapore.",
            "A land use/land cover change geospatial cyberinfrastructure to integrate big data and temporal topology.",
            "Real-time genetic spatial optimization to improve forest fire spread forecasting in high-performance computing environments.",
            "Spatial data fusion in Spatial Data Infrastructures using Linked Data.",
            "A partitioned and asynchronous cellular automata model for urban growth simulation.",
            "Curvedness feature constrained map matching for low-frequency probe vehicle data.",
            "A WOE method for urban growth boundary delineation and its applications to land use planning.",
            "Possibilities of land use change analysis in a mountainous rural area: a methodological approach.",
            "An optimized spatial proximity model for fine particulate matter air pollution exposure assessment in areas of sparse monitoring.",
            "A polygon-based approach for matching OpenStreetMap road networks with regional transit authority data.",
            "Effects of demand estimates on the evaluation and optimality of service centre locations.",
            "Privacy and spatial pattern preservation in masked GPS trajectory data.",
            "Measuring visual pollution by outdoor advertisements in an urban street using intervisibilty analysis and public surveys.",
            "Geocomputation: a practical primer, by Chris Brunsdon and Alex Singleton, London, SAGE Publications, 2015, 392 pp., US$52.00, ISBN 9781446272930 (paperback), ISBN 9781446272923 (hardcover).",
            "An introduction to R for spatial analysis and mapping, by Chris Brunsdon and Lex Comber, London, Sage Publications Ltd., 2015, 360 pp., AU$92.00, NZ$94.78 (paperback), ISBN 9781446272954/AU$238.00, NZ$269.74 (hardback), ISBN 9781446272947.",
            "OpenStreetMap in GIScience: experiences, research and applications, edited by Jamal Jokar Arsanjani, Alexander Zipf, Peter Mooney and Marco Helbich, Cham, Springer, 2015, 324 pp., US$179.00 (hardcover), ISBN 978-3-319-14279-1.",
            "Analysis of movement data.",
            "Trajectory Box Plot: a new pattern to summarize movements.",
            "Kinematic interpolation of movement data.",
            "Movement analysis of free-grazing domestic ducks in Poyang Lake, China: a disease connection.",
            "Analysis of human mobility patterns from GPS trajectories and contextual information.",
            "Introducing 'presence' and 'stationarity index' to study partial migration patterns: an application of a spatio-temporal clustering technique.",
            "A new method for discovering behavior patterns among animal movements.",
            "Storm event representation and analysis based on a directed spatiotemporal graph model.",
            "A framework for models of movement in geographic space.",
            "Decentralized detection and monitoring of convoy patterns.",
            "Generative models for road network reconstruction.",
            "Spatiotemporal data model for network time geographic analysis in the era of big data.",
            "Indexing large geographic datasets with compact qualitative representation.",
            "Hybrid terrain rendering based on the external edge primitive.",
            "Ensemble adaptive tile prefetching using fuzzy logic.",
            "Reconstruction of itineraries from annotated text with an informed spanning tree algorithm.",
            "Representation and discovery of building patterns: a three-level relational approach.",
            "Spatial scale and small area population statistics for England and Wales.",
            "Optimizing precipitation station location: a case study of the Jinsha River Basin.",
            "Task-oriented information value measurement based on space-time prisms.",
            "Spatial statistics and geostatistics: theory and applications for geographic information science and technology, by Yongwan Chun and Daniel A. Griffith, Thousand Oaks, CA, SAGE Publications, 2013, 181 pp., $47.70/£24.29 (paperback), ISBN 978-1-446-20174-9.",
            "Computation and visualisation of the accuracy of old maps using differential distortion analysis.",
            "Estimating attendance from cellular network data.",
            "A scientometric analysis of selected GIScience journals.",
            "Uncertainty analysis of space-time prisms based on the moment-design method.",
            "Land-surface segmentation as a method to create strata for spatial sampling and its potential for digital soil mapping.",
            "Evaluating the impact of visualization of wildfire hazard upon decision-making under uncertainty.",
            "Enabling maps/location searches on mobile devices: constructing a POI database via focused crawling and information extraction.",
            "Prediction of categorical spatial data via Bayesian updating.",
            "Unsupervised regionalization of the United States into landscape pattern types.",
            "A method for finding a least-cost wide path in raster space.",
            "Interactive discovery of sequential patterns in time series of wind data.",
            "Establishing a framework for Open Geographic Information science.",
            "SPLITAREA: an algorithm for weighted splitting of faces in the context of a planar partition.",
            "Error propagation in a fuzzy logic multi-criteria evaluation for petroleum exploration.",
            "Space-time multiple regression model for grid-based population estimation in urban areas.",
            "Analyzing the distribution of human activity space from mobile phone usage: an individual and urban-oriented study.",
            "A bootstrap test for constant coefficients in geographically weighted regression models.",
            "Dealing with double vagueness in DEM morphometric analysis.",
            "Web-based geospatial multiple criteria decision analysis using open software and standards.",
            "Editorial: human dynamics in the mobile and big data era.",
            "Exploration of spatiotemporal and semantic clusters of Twitter data using unsupervised neural networks.",
            "A network Kernel Density Estimation for linear features in space-time analysis of big trace data.",
            "Understanding the bias of call detail records in human mobility research.",
            "Measures of transport mode segmentation of trajectories.",
            "A framework for identifying activity groups from individual space-time profiles.",
            "Finding spatial outliers in collective mobility patterns coupled with social ties.",
            "The impact of Hurricane Katrina on urban growth in Louisiana: an analysis using data mining and simulation approaches.",
            "Opportunistic natural experiments using digital telemetry: a transit disruption case study.",
            "Activity patterns, socioeconomic status and urban spatial structure: what can social media data tell us?",
            "Discovery of local topics by using latent spatio-temporal relationships in geo-social media.",
            "Illuminated and shadowed contour lines: improving algorithms and evaluating effectiveness.",
            "A novel methodology for identifying environmental exposures using GPS data.",
            "A bat-inspired approach to define transition rules for a cellular automaton model used to simulate urban expansion.",
            "Modeling spatiotemporal information generation.",
            "Integrating social network data into GISystems.",
            "Error assessment of grid-based diffuse solar radiation models.",
            "Incorporating movement in species distribution models: how do simulations of dispersal affect the accuracy and uncertainty of projections?",
            "Interaction between scale and scheduling choices in simulations of spatial agents.",
            "Integration of GIS and video surveillance.",
            "A new climatology of maximum and minimum temperature (1951-2010) in the Spanish mainland: a comparison between three different interpolation methods.",
            "Novel evaluation metrics for sparse spatio-temporal point process hotspot predictions - a crime case study.",
            "Bias estimation and correction for triangle-based surface area calculations.",
            "A new algorithm based on Region Partitioning for Filtering candidate viewpoints of a multiple viewshed.",
            "Driving forces and their interactions of built-up land expansion based on the geographical detector - a case study of Beijing, China.",
            "Rendering interior-filled polygonal vector data in a virtual globe.",
            "Enabling point pattern analysis on spatial big data using cloud computing: optimizing and accelerating Ripley's K function.",
            "Location-based anonymization: comparison and evaluation of the Voronoi-based aggregation system.",
            "Simulating urban growth under planning policies through parcel-based cellular automata (ParCA) model.",
            "Spatio-temporal analysis of crime by developing a method to detect critical distances for the Knox test.",
            "Exploring the usability of PPGIS among older adults: challenges and opportunities.",
            "Geostatistical space-time mapping of house prices using Bayesian maximum entropy.",
            "Parallel cartographic modeling: a methodology for parallelizing spatial data processing.",
            "ASSURE: a model for the simulation of urban expansion and intra-urban social segregation.",
            "A new assessment model for evacuation vulnerability in urban areas.",
            "Influence of urban expansion on the urban heat island effect in Shanghai.",
            "Novel shape indices for vector landscape pattern analysis.",
            "Optimal spatial allocation of irrigation water under uncertainty using the bilayer nested optimisation algorithm and geospatial technology.",
            "Analysis of behaviour of vehicles using VGI data.",
            "A universal spectral analytical method for digital terrain modeling.",
            "Valediction."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2015",
        "info": "Volume 29, 2015",
        "count": 118,
        "papers": [
            "A formal model to infer geographic events from sensor observations.",
            "Spatial chromatic model in high-dimensional spaces and the uniqueness of chromatic code: a new perspective of geographic entity-space relationship.",
            "GRASP-UTS: an algorithm for unsupervised trajectory segmentation.",
            "A novel approach for generating routable road maps from vehicle GPS traces.",
            "Sampling design optimization of a wireless sensor network for monitoring ecohydrological processes in the Babao River basin, China.",
            "Bayesian belief networks as a versatile method for assessing uncertainty in land-change modeling.",
            "Evaluation and comparison of landslide susceptibility mapping methods: a case study for the Ulus district, Bartın, northern Turkey.",
            "The fractal nature of maps and mapping.",
            "Density-based clustering for data containing two types of points.",
            "Cardinal directions: a comparison of direction relation matrix and objects interaction matrix.",
            "Locating a supermarket using a locally calibrated Huff model.",
            "Using geographically weighted regression kriging for crop yield mapping in West Africa.",
            "Geo-located community detection in Twitter with enhanced fast-greedy optimization of modularity: the case study of typhoon Haiyan.",
            "Rank-based strategies for cleaning inconsistent spatial databases.",
            "A GIS-oriented location model for supporting indoor evacuation.",
            "The decision task complexity and information acquisition strategies in GIS-MCDA.",
            "The new science of cities, by Michael Batty, Cambridge, MA, The MIT Press, 2013, 496 pp., $45.00/£31.95 (hard cover), ISBN 978-0-262-01952-1.",
            "How much past to see the future: a computational study in calibrating urban cellular automata.",
            "Forming a global monitoring mechanism and a spatiotemporal performance model for geospatial services.",
            "Modelling surface drainage patterns in altered landscapes using LiDAR.",
            "Massively parallel spatial point pattern analysis: Ripley's K function accelerated using graphics processing units.",
            "Split-Match-Aggregate (SMA) algorithm: integrating sidewalk data with transportation network data in GIS.",
            "Modelling outsourceable transactions on polygon-based cadastral parcels.",
            "Characterization of neighborhood sensitivity of an irregular cellular automata model of urban growth.",
            "Zipf's law for all the natural cities around the world.",
            "Real-time flood simulations using CA model driven by dynamic observation data.",
            "Parallelization of a regionalization heuristic in distributed computing platforms - a case study of parallel-p-compact-regions problem.",
            "Thematic signatures for cleansing and enriching place-related linked data.",
            "Graph-assisted landscape monitoring.",
            "Performance analysis of radial basis function networks and multi-layer perceptron networks in modeling urban change: a case study.",
            "Co-clustering geo-referenced time series: exploring spatio-temporal patterns in Dutch temperature data.",
            "An alternative approach to transverse and profile terrain curvature.",
            "A geographic approach for combining social media and authoritative data towards identifying useful information for disaster management.",
            "Statistical analysis of spatial and spatio-temporal point patterns, Third Edition, by Peter J. Diggle, Boca Raton, FL, CRC Press, 2013, 263 pp., $49.99, $79.95 EUR 62, 38 (hardback), ISBN 13: 978-1-4665-6023-9.",
            "Representing space in cognition: interrelations of behaviour, language, and formal models, edited by Thora Tenbrink, Jan Wiener, and Christophe Claramunt, Oxford, Oxford University Press, 2013, xv + 308 pp., $135.00/£70.00 (hard cover), ISBN 978-0-19-967991-1.",
            "Big data: techniques and technologies in geoinformatics, edited by Hassan A. Karimi, Boca Raton, FL, CRC Press, 2014, 312 pp., US$129.95 (hardcover), ISBN 13-978-1466586512.",
            "Space-time characteristics of micro-scale crime occurrences: an application of a network-based space-time search window technique for crime incidents in Chicago.",
            "Crowdsourcing urban form and function.",
            "Exploring space-time paths in physical and social closeness spaces: a space-time GIS approach.",
            "Integrating ensemble-urban cellular automata model with an uncertainty map to improve the performance of a single model.",
            "Pattern-mining approach for conflating crowdsourcing road networks with POIs.",
            "A new discovery of transition rules for cellular automata by using cuckoo search algorithm.",
            "An evaluation and classification of nD topological data structures for the representation of objects in a higher-dimensional GIS.",
            "Urbanization of the United States over two centuries: an approach based on a long-term database (1790-2010).",
            "A local scale-sensitive indicator of spatial autocorrelation for assessing high- and low-value clusters in multiscale datasets.",
            "Finding community structure in spatially constrained complex networks.",
            "From A to B, randomly: a point-to-point random trajectory generator for animal movement.",
            "A compromise aspect-adaptive cylindrical projection for world maps.",
            "Points of interest recommendation from GPS trajectories.",
            "Integrative representation and inference of qualitative locations about points, lines, and polygons.",
            "Barrier dynamics for GIS: a design pattern for geospatial barriers.",
            "Multi-label class assignment in land-use modelling.",
            "Mapping illegal domestic waste disposal potential to support waste management efforts in Queensland, Australia.",
            "A procedural modelling method for virtual high-speed railway scenes based on model combination and spatial semantic constraint.",
            "A service-oriented architecture to enable participatory planning: an e-planning platform.",
            "Landslide susceptibility evaluation based on BPNN and GIS: a case of Guojiaba in the Three Gorges Reservoir Area.",
            "A modification of the time-geographic framework to support temporal flexibility in 'fixed' activities.",
            "Improving the representation of major landforms in analytical relief shading.",
            "A dimension-independent extrusion algorithm using generalised maps.",
            "A multicriteria spatial decision support system for solving emergency service station location problems.",
            "Alternating scanning orders and combining algorithms to improve the efficiency of flow accumulation calculation.",
            "Application of inverse path distance weighting for high-density spatial mapping of coastal water quality patterns.",
            "An early warning system for detecting H1N1 disease outbreak - a spatio-temporal approach.",
            "Usability of VGI for validation of land cover maps.",
            "Spatial localization of closeness and betweenness measures: a self-contradictory but useful form of network analysis.",
            "A vector field model to handle the displacement of multiple conflicts in building generalization.",
            "A stratified optimization method for a multivariate marine environmental monitoring network in the Yangtze River estuary and its adjacent sea.",
            "Evaluating walkability: a capability-wise planning and design support system.",
            "Route planning and cost analysis for travelling through the Arctic Northeast Passage using public 3D GIS.",
            "Estimating the count of completeness errors in geographic data sets by means of a generalized Waring regression model.",
            "A spatially adaptive decomposition approach for parallel vector data visualization of polylines and polygons.",
            "Responsive geo-referenced content visualization based on a user interest model and level of detail.",
            "An improved artificial bee colony algorithm for optimal land-use allocation.",
            "Regional dynamics of terrestrial vegetation productivity and climate feedbacks for territory of Ukraine.",
            "Spatial simulation: exploring pattern and process.",
            "Hierarchical polygonization for generating and updating lane-based road network information for navigation from road markings.",
            "An improved ant colony optimization (I-ACO) method for the quasi travelling salesman problem (Quasi-TSP).",
            "An individual cognitive evacuation behaviour model for agent-based simulation: a case study of a large outdoor event.",
            "Predicting human mobility with activity changes.",
            "A method for discovery and analysis of temporal patterns in complex event data.",
            "Self-modifying CA model using dual ensemble Kalman filter for simulating urban land-use changes.",
            "Wholeness as a hierarchical graph to capture the nature of space.",
            "Strategies for improving land delivery for residential development: a case of the north-west metropolitan Melbourne.",
            "Estimation of precipitation fields from 1-minute rain gauge time series - comparison of spatial and spatio-temporal interpolation methods.",
            "Geomorphometric analysis of a rocky coastline: an example from Hornsund, Svalbard.",
            "Handbook of spatial point-pattern analysis in ecology.",
            "Simulating urban growth in a metropolitan area based on weighted urban flows by using web search engine.",
            "Generation of navigation graphs for indoor space.",
            "A travel time-based variable grid approach for an activity-based cellular automata model.",
            "Error assessment of grid-based direct solar radiation models.",
            "Modelling the spatial allocation of second-generation feedstock (lignocellulosic crops) in Europe.",
            "SELF: Semantically Enriched Line simpliFication.",
            "A concentration-based approach to data classification for choropleth mapping.",
            "A citizen data-based approach to predictive mapping of spatial variation of natural phenomena.",
            "The role of visualisation in the choice of stationary non-separable space-time covariance functions: an application to air pollution data.",
            "MODEL: a multicriteria ordinal evaluation tool for GIS.",
            "Exploring spatial scale in geography.",
            "Geographies of mobility: applications of location-based data.",
            "Trajectory reconstruction from mobile positioning data using cell-to-cell travel time information.",
            "Enhancing integrated indoor/outdoor mobility in a smart campus.",
            "A temporal-contextual analysis of urban dynamics using location-based data.",
            "Car navigation - computing routes that avoid complicated crossings.",
            "The space-time cube as part of a GeoVisual analytics environment to support the understanding of movement data.",
            "Everyday space-time geographies: using mobile phone-based sensor data to monitor urban activity in Harbin, Paris, and Tallinn.",
            "A localized contour tree method for deriving geometric and topological properties of complex surface depressions based on high-resolution topographical data.",
            "Spatial analysis of geometric design consistency and road sight distance.",
            "Anomalous behavior detection in single-trajectory data.",
            "Fusion of multi-scale DEMs using a regularized super-resolution method.",
            "The impact of planning on pedestrian movement: contrasting pedestrian movement models in pre-modern and modern neighborhoods in Israel.",
            "Approximation of Gaussian spatial autoregressive models for massive regular square tessellation data.",
            "Optimal spatial land-use allocation for limited development ecological zones based on the geographic information system and a genetic ant colony algorithm.",
            "Robust inferences of travel paths from GPS trajectories.",
            "A semi-automatic lightweight ontology bridging for the semantic integration of cross-domain geospatial information.",
            "Automatically enhancing CityGML LOD2 models with a corresponding indoor geometry.",
            "Propagation of positional error in 3D GIS: estimation of the solar irradiation of building roofs.",
            "Quasi indicatrix approach for distortion visualization and analysis for map projections.",
            "Conceptualising the geographic world: the dimensions of negotiation in crowdsourced cartography.",
            "Change detection for 3D vector data: a CGA-based Delaunay-TIN intersection approach."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2014",
        "info": "Volume 28, 2014",
        "count": 132,
        "papers": [
            "Decentralized and coordinate-free computation of critical points and surface networks in a discretized scalar field.",
            "Map-matching algorithm for large-scale low-frequency floating car data.",
            "Gravitational field routing strategy considering the distribution of traffic flow.",
            "An inconsistency measure of spatial data sets with respect to topological constraints.",
            "Enhanced multi-objective optimization algorithm for renewable energy sources: optimal spatial development of wind farms.",
            "Simulating visit probability distributions within planar space-time prisms.",
            "Geometric-based approach for integrating VGI POIs and road networks.",
            "Simulating urban growth by integrating landscape expansion index (LEI) and cellular automata.",
            "Identifying regions based on flexible user-defined constraints.",
            "Modeling and representation for earthquake emergency response knowledge: perspective for working with geo-ontology.",
            "The contested nature of historical GIS.",
            "Optimal spatial allocation of water resources based on Pareto ant colony algorithm.",
            "Modeling urban land-use dynamics in a fast developing city using the modified logistic cellular automaton with a patch-based simulation strategy.",
            "A GIS approach to modelling CO2 emissions associated with the pupil-school commute.",
            "Thematic land-cover map assimilation and synthesis: the case of locating potential bioenergy feedstock in eastern Ontario, Canada.",
            "Site-specific prediction of West Nile virus mosquito abundance in Greater Toronto Area using generalized linear mixed models.",
            "A path that buys time to decide where to go.",
            "Estimating gambling venue catchments for impact assessment using a calibrated gravity model.",
            "Computing least air pollution exposure routes.",
            "Mining candidate causal relationships in movement patterns.",
            "General sky models for illuminating terrains.",
            "Terrain data compression using wavelet-tiled pyramids for online 3D terrain visualization.",
            "A geo-information system approach for forest fire likelihood based on causative and anti-causative factors.",
            "Vario-scale data structures supporting smooth zoom and progressive transfer of 2D and 3D data.",
            "Analyzing the commercial activities of a street network by ranking their nodes: a case study in Murcia, Spain.",
            "Measuring similarity of mobile phone user trajectories- a Spatio-temporal Edit Distance method.",
            "Generation of schematic network maps with automated detection and enlargement of congested areas.",
            "Porting of a wildfire risk and fire spread application into a cloud computing environment.",
            "The use of GIS tools to support decision-making in the expansion of chain stores.",
            "The total operating characteristic to measure diagnostic ability for multiple thresholds.",
            "From land cover-graphs to urban structure types.",
            "An uncertainty and sensitivity analysis approach for GIS-based multicriteria landslide susceptibility mapping.",
            "Predicting the expansion of an urban boundary using spatial logistic regression and hybrid raster-vector routines with remote sensing and GIS.",
            "Geographically weighted regression with a non-Euclidean distance metric: a case study using hedonic house price data.",
            "Airborne near-real-time monitoring of assembly and parking areas in case of large-scale public events and natural disasters.",
            "Quality assessment for building footprints data on OpenStreetMap.",
            "A neighbor decay cellular automata approach for simulating urban expansion based on particle swarm intelligence.",
            "Are opinions expressed in land-use planning documents?",
            "Progressive vector compression for high-accuracy vector map data.",
            "A visualization-oriented 3D method for efficient computation of urban solar radiation based on 3D-2D surface mapping.",
            "A GRASS GIS parallel module for radio-propagation predictions.",
            "A linear road object matching method for conflation based on optimization and logistic regression.",
            "Crowdsourcing geographic knowledge: volunteered geographic information (VGI) in theory and practice.",
            "Space-time research in GIScience.",
            "Toward a kinetic-based probabilistic time geography.",
            "Voxel-based probabilistic space-time prisms for analysing animal movements and habitat use.",
            "Contour based visualization of vessel movement predictions.",
            "Space-time analyses for forecasting future incident occurrence: a case study from Yosemite National Park using the presence and background learning algorithm.",
            "Incorporating activity-travel time uncertainty and stochastic space-time prisms in multistate supernetworks for activity-travel scheduling.",
            "Detection of dynamic activity patterns at a collective level from large-volume trajectory data.",
            "High-resolution space-time processes for agents at the built-human interface of urban earthquakes.",
            "Web-based spatiotemporal simulation modeling and visualization of tsunami inundation and potential human response.",
            "A representation framework for studying spatiotemporal changes and interactions of dynamic geographic phenomena.",
            "Calibrating a cellular automata model for understanding rural-urban land conversion: a Pareto front-based multi-objective optimization approach.",
            "The continuous spatio-temporal model (CSTM) as an exhaustive framework for multi-scale spatio-temporal analysis.",
            "Local and global spatio-temporal entropy indices based on distance-ratios and co-occurrences distributions.",
            "An event abstraction layer for the integration of geosensor data.",
            "Visualizing the impact of space-time uncertainties on dengue fever patterns.",
            "Navigating spatio-temporal data with temporal zoom and pan in a multi-touch environment.",
            "Transcending the cube: translating GIScience time and space perspectives in a humanities GIS.",
            "Foundations of sustainability information representation theory: spatial-temporal dynamics of sustainable systems.",
            "A geographically and temporally weighted autoregressive model with application to housing prices.",
            "Editorial.",
            "Making a Mark: a computational and visual analysis of one researcher's intellectual domain.",
            "Mark on the globe: a quest for scientific bases of geographic information and its international influence.",
            "David Mark's contribution to ethnophysiography research.",
            "Place matters in sports: effects of the length of championship series on winning probabilities for the team with home field advantage.",
            "From text to landscape: locating, identifying and mapping the use of landscape features in a Swiss Alpine corpus.",
            "Comparing English, Mandarin, and Russian hydrographic and terrain categories.",
            "A systematic sensitivity analysis of constrained cellular automata model for urban growth simulation based on different transition rules.",
            "Predictive modelling of gold potential with the integration of multisource information based on random forest: a case study on the Rodalquilar area, Southern Spain.",
            "A bidirectional path-finding algorithm and data structure for maritime routing.",
            "Propagation of vertical and horizontal source data errors into a TIN with linear interpolation.",
            "Knowledge diffusion from GIScience to other fields: the example of the usage of weighted surface networks in nanotechnology.",
            "Exploring the relationship between street centrality and land use in Stockholm.",
            "Enriching user profiles using geo-social place semantics in geo-folksonomies.",
            "Optimizing an index with spatiotemporal patterns to support GEOSS Clearinghouse.",
            "A non-dominated sorting genetic algorithm for the location and districting planning of earthquake shelters.",
            "Total locational surplus for facility users distributed continuously along a network.",
            "GIS fundamentals, by Stephen Wise, Boca Raton.",
            "Teaching science and investigating environmental issues with geospatial technology: designing effective professional development for teachers, by J. MaKinster, N. Trautmann, and M. Barnet.",
            "Species distribution and diversity, habitat selection and connectivity: introduction to the Third Special Issue on Spatial Ecology.",
            "Scale dependence in habitat selection: the case of the endangered brown bear (Ursus arctos) in the Cantabrian Range (NW Spain).",
            "Delineating generalized species boundaries from species distribution data and a species distribution model.",
            "Effects of climate change and urban development on the distribution and conservation of vegetation in a Mediterranean type ecosystem.",
            "Benefits and drawbacks of two modelling approaches for a generalist carnivore: can models predict where Wile E. Coyote will turn up next?",
            "Free advanced modeling and remote-sensing techniques for wetland watershed delineation and monitoring.",
            "Go with the flow: geospatial analytics to quantify hydrologic landscape connectivity for passively dispersed microorganisms.",
            "Utilization of a multicriteria least cost path model in an aquatic environment.",
            "Using maps of continuous variation in species compositional turnover to supplement uniform polygon species range maps.",
            "Identifying minimal sets of survey techniques for multi-species monitoring across landscapes: an approach utilising species distribution models.",
            "Spatial structure analysis of a reptile community with airborne LiDAR data.",
            "How many predictors in species distribution models at the landscape scale? Land use versus LiDAR-derived canopy height.",
            "In memoriam: Prof Peter Fisher.",
            "Using a Bayesian estimator to combine information from a cluster analysis and remote sensing data to estimate high-resolution data for agricultural production in Germany.",
            "An algorithm for converting weather radar data into GIS polygons and its application in severe weather warning systems.",
            "An analysis on movement patterns between zones using smart card data in subway networks.",
            "Vague cognitive regions in geography and geographic information science.",
            "A hybrid representation for modeling, interactive editing, and real-time visualization of terrains with volumetric features.",
            "Improving the simulation of fine-resolution landscape changes by coupling top-down and bottom-up land use and cover changes rules.",
            "A parallel GPU-based approach for reporting flock patterns.",
            "Geostatistical mapping of real estate prices: an empirical comparison of kriging and cokriging.",
            "A fuzzy multiple-attribute decision-making modelling for vulnerability analysis on the basis of population information for disaster management.",
            "Fine-resolution population mapping using OpenStreetMap points-of-interest.",
            "Population of a spatio-temporal knowledge base for jurisdictional domains.",
            "A new insight into land use classification based on aggregated mobile phone data.",
            "GeoViz: interactive maps that help people think.",
            "Visual mining of moving flock patterns in large spatio-temporal data sets using a frequent pattern approach.",
            "Multi-perspective 3D panoramas.",
            "Interactive focus maps using least-squares optimization.",
            "Development of a prototype for uncertainty-aware geovisual analytics of land cover change.",
            "Designing an exploratory visual interface to the results of citizen surveys.",
            "A strategy for raster-based geocomputation under different parallel computing platforms.",
            "Plain move predicate and its consistency concerning the moving agents in a network.",
            "Detecting the dynamics of urban structure through spatial network analysis.",
            "Polygon-based approach for extracting multilane roads from OpenStreetMap urban road networks.",
            "Using one-class classifiers and multiple kernel learning for defining imprecise geographic regions.",
            "The simulation of surface flow dynamics using a flow-path network model.",
            "Metadata and provenance for spatial analysis: the case of spatial weights.",
            "An agent-integrated irregular automata model of urban land-use dynamics.",
            "An IO-efficient parallel implementation of an R2 viewshed algorithm for large terrain maps on a CUDA GPU.",
            "Object-based spatial cluster analysis of urban landscape pattern using nighttime light satellite images: a case study of China.",
            "Evaluating the fitness for use of spatial data sets to promote quality in ecological assessment and monitoring.",
            "A new pseudocylindrical equal-area projection for adaptive composite map projections.",
            "Solving land-use suitability analysis and planning problem by a hybrid meta-heuristic algorithm.",
            "Placing dots in dot maps.",
            "Multidimensional-unified topological relations computation: a hierarchical geometric algebra-based approach.",
            "AffectRoute - considering people's affective responses to environments for enhancing route-planning services.",
            "A georeferenced agent-based model to analyze the climate change impacts on ski tourism at a regional scale.",
            "Unique identification of vector geographic objects by location and geometry.",
            "Geospatial spreadsheets with microscale air quality visualization and synchronization for supporting multiple-scenario visual collaboration.",
            "Tagging-the-triangle algorithm for partitioning features with inconsistent boundaries."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2013",
        "info": "Volume 27, 2013",
        "count": 138,
        "papers": [
            "An integrative hierarchical stepwise sampling strategy for spatial sampling and its application in digital soil mapping.",
            "Rapid three-dimensional urban model production using bilayered displacement mapping.",
            "A comparison of multiple indicator kriging and area-to-point Poisson kriging for mapping patterns of herbivore species abundance in Kruger National Park, South Africa.",
            "Land-use configuration under traditional agriculture in the Kanto Plain, Japan: a historical GIS analysis.",
            "Establishing a national standard for 3D topographic data compliant to CityGML.",
            "Ad hoc matching of vectorial road networks.",
            "An orthogonal least-square-based method for DEM generalization.",
            "Toward an inclusive semantic interoperability: the case of Cree hydrographic features.",
            "Point- and curve-based geometric conflation.",
            "Computing with spatial trajectories, edited by Yu ZhengXiaofang Zhou, Berlin, Springer, 2011, 1st ed., £84.99 (hardcover), 308 pp. ISBN-10: 1461416280; ISBN-13: 978-1461416289.",
            "Revisiting the 'Is GIScience a science?' debate (or quite possibly scientific gerrymandering).",
            "Using kernel density estimation to assess the spatial pattern of road density and its impact on landscape fragmentation.",
            "A GML-based approach to automate spatial metadata updating.",
            "Contextual neural gas for spatial clustering and analysis.",
            "Qualitative GIS and the visualization of narrative activity space data.",
            "A review of quantitative methods for movement data.",
            "A probabilistic relaxation approach for matching road networks.",
            "Generic cumulative annular bucket histogram for spatial selectivity estimation of spatial database management system.",
            "A parallel computing approach to viewshed analysis of large terrain data using graphics processing units.",
            "Transportation mode-based segmentation and classification of movement trajectories.",
            "A framework for uncertainty assessment in simulation models.",
            "Some further clarification on Markov chain random fields and transiograms.",
            "Inferring properties and revealing geographical impacts of intercity mobile communication network of China using a subnet data set.",
            "A heuristic cellular automata approach for modelling urban land-use change based on simulated annealing.",
            "Association of elevation error with surface type, vegetation class and data origin in discrete-returns airborne LiDAR.",
            "Clustering of temporal event processes.",
            "The comap as a diagnostic tool for non-stationary kriging models.",
            "Allocation of urban land uses by Multi-Objective Particle Swarm Optimization algorithm.",
            "A fast, free-form rubber-sheet algorithm for contiguous area cartograms.",
            "Calibrating cellular automata based on landscape metrics by using genetic algorithms.",
            "An OLS regression model for context-aware tile prefetching in a web map cache.",
            "Using geovisual analytics to compare the performance of geographically weighted discriminant analysis versus its global counterpart, linear discriminant analysis.",
            "A context-aware personalized travel recommendation system based on geotagged social media data mining.",
            "Combining geographical information and traditional plots: the checkerplot.",
            "Forest fire risk maps: a GIS open source application - a case study in Norwest of Portugal.",
            "A spatial cognition-based urban building clustering approach and its applications.",
            "A Voronoi neighborhood-based search heuristic for distance/capacity constrained very large vehicle routing problems.",
            "Using adaptively coupled models and high-performance computing for enabling the computability of dust storm forecasting.",
            "Stochastic model-based methods for handling uncertainty in areal interpolation.",
            "Simultaneous computation of total viewshed on large high resolution grids.",
            "Efficiently implementable algebra for distributed in-network spatial analysis.",
            "Towards generating highly detailed 3D CityGML models from OpenStreetMap.",
            "Network-based space-time search-window technique for hotspot detection of street-level crime incidents.",
            "Continuous surface representation and approximation: spatial analytical implications.",
            "Efficient encoding and spatial operation scheme for aperture 4 hexagonal discrete global grid system.",
            "An improved artificial immune system for seeking the Pareto front of land-use allocation problem in large areas.",
            "Pedestrian network map generation approaches and recommendation.",
            "On the hyperfield or field-of-field concept.",
            "Fusing remote sensing with sparse demographic data for synthetic population generation: an algorithm and application to rural Afghanistan.",
            "Multimodal accessibility modeling from coarse transportation networks in Africa.",
            "Parallel optimal choropleth map classification in PySAL.",
            "GIS and public health, by E.K. Cromley and S.L. McLafferty, New York, Guilford Press, 2012, 2nd ed., ISBN-10 1609187504, ISBN-13 978-1609187507.",
            "Local models for spatial analysis, by Christopher D. LloydBoca Raton, FL, CRC Press, 2012, 336 pp. $94.55 (Hardback), IBSN 9781439829196/$89.95 (eBook), ISBN 9781439829233.",
            "Statistical geoinformatics for human environment interface, by Wayne L. Myers and Ganapati P. Patil, Boca Raton, FL, CRC Press, 2013, $79.95, 223 pp., ISBN 978-1-4200-8287-6.",
            "Spatial decision support systems. Principles and practices, by Ramathan Sugumaran and John DeGroote, CRC Press, 2012, 507 pp., $129.95, £80.99, €101.99 (hardcover), ISBN-10: 1420062093, ISBN-13: 978-1420062090.",
            "Agent-based models of geographical systems, edited by Alison J. Heppenstall, Andrew T. Crooks, Linda M. See and Michael Batty, Dordrecht/Heidelberg/London/New York, Springer, 2012, £179.99, 759 pp., (hardcover), ISBN 978-90-481-8926-7.",
            "Artificial surfaces simulating complex terrain types for evaluating grid-based flow direction algorithms.",
            "A genetic algorithm for multiobjective dangerous goods route planning.",
            "A formalization for semantic location granules.",
            "A performance, semantic and service quality-enhanced distributed search engine for improving geospatial resource discovery.",
            "A spatial data infrastructure model from the computational viewpoint.",
            "Parallel agent-based simulation of individual-level spatial interactions within a multicore computing environment.",
            "How much information is geospatially referenced? Networks and cognition.",
            "LOST-Tree: a spatio-temporal structure for efficient sensor data loading in a sensor web browser.",
            "Spatial inference with an interchangeable rule format.",
            "An efficient measure of compactness for two-dimensional shapes and its application in regionalization problems.",
            "Broad area mapping of monthly soil erosion risk using fuzzy decision tree approach: integration of multi-source data within GIS.",
            "The recent advancement in digital terrain analysis and modeling.",
            "Surface modeling of DEMs based on a sequential adjustment method.",
            "Quantifying local flow direction uncertainty.",
            "From Zipf's law to hypsometry: seeking the 'signature' of elevation distribution.",
            "A scale-adaptive DEM for multi-scale terrain analysis.",
            "A cellular automata model for simulating the evolution of positive-negative terrains in a small loess watershed.",
            "Uncertainty due to DEM error in landslide susceptibility mapping.",
            "Third-order geomorphometric variables (derivatives): definition, computation and utilization of changes of curvatures.",
            "Geological applications of digital terrain analysis.",
            "Characterization of active fault scarps from LiDAR data: a case study from Central Apennines (Italy).",
            "Terrain analysis for active tectonic zone characterization: a new application for MODIS night LST (MYD11C3) data set.",
            "GIS techniques for regional-scale landslide susceptibility assessment: the Sicily (Italy) case study.",
            "Measuring the significance of a divide to local drainage patterns.",
            "Terrain characterization and structural control of the Auca Mahuida volcanism (Neuquén Basin, Argentina).",
            "Visualizing and quantifying the movement of vegetative drought using remote-sensing data and GIS.",
            "A method to dynamically subdivide parcels in land use change models.",
            "A graph-based algorithm to define urban topology from unstructured geospatial data.",
            "Mining query-driven contexts for geographic and temporal search.",
            "Automated evaluation of building alignments in generalized maps.",
            "Seamless multivariate affine error-in-variables transformation and its application to map rectification.",
            "Calibration of an urban cellular automaton model by using statistical techniques and a genetic algorithm. Application to a small urban settlement of NW Spain.",
            "The temporal hierarchy of shelters: a hierarchical location model for earthquake-shelter planning.",
            "Discrete displacement analysis for geographic linear features and the application to glacier termini.",
            "The smoothness of HASM.",
            "Guidelines for trust interface design for public engagement Web GIS.",
            "Remote sensing and global environmental change, by Samuel Purkis and Victor KlemasChichester, Wiley-Blackwell, 2011, xii + 367 pp., €51.90 (hardback), ISBN 978-1-4443-3935-2.",
            "Surface modeling: high accuracy and high speed methods, by Tian-Xiang YueBoca Raton, CRC Press, 691 pp., £89.00, $139.95, €114.99, 2011, ISBN 978-1-4398-1758-2.",
            "Land change modelling: moving beyond projections.",
            "Measuring the temporal instability of land change using the Flow matrix.",
            "Map errors that could account for deviations from a uniform intensity of land change.",
            "A land-use-based modelling chain to assess the impacts of Natural Water Retention Measures on Europe's Green Infrastructure.",
            "Spatially-explicit sensitivity analysis of an agent-based model of land use change.",
            "Spatiotemporal scale dependency and other sensitivities in dynamic land-use change simulations.",
            "Evaluating drivers of land-use change and transition potential models in a complex landscape in Southern Mexico.",
            "Knowledge transfer and adaptation for land-use simulation with a logistic cellular automaton.",
            "An intelligent method to discover transition rules for cellular automata using bee colony optimisation.",
            "Improved visibility calculations with tree trunk obstruction modeling from aerial LiDAR.",
            "Spatial interpolation using MLP-RBFN hybrid networks.",
            "CD-graph: planar graph representation for spatial adjacency and neighbourhood relation with constraints.",
            "Determining the susceptibility of Eucalyptus nitens forests to Coryphodema tristis (cossid moth) occurrence in Mpumalanga, South Africa.",
            "A characteristic bitmap coding method for vector elements based on self-adaptive gridding.",
            "Comparative performance of logistic regression and survival analysis for detecting spatial predictors of land-use change.",
            "A Euler number-based topological computation model for land parcel database updating.",
            "A complete classification of spatial relations using the Voronoi-based nine-intersection model.",
            "Hierarchical self-organizing maps for clustering spatiotemporal data.",
            "Spatiotemporal simulation and risk analysis of dam-break flooding based on cellular automata.",
            "An efficient method for single-facility location and path-connecting problems in a cell map.",
            "A spatially explicit methodology for a priori estimation of field survey effort in environmental observation networks.",
            "Computing the semantic similarity of geographic terms using volunteered lexical definitions.",
            "CyberGIS: blueprint for integrated and scalable geospatial software ecosystems.",
            "CyberGIS software: a synthetic review and integration roadmap.",
            "CyberGIS design considerations for structured participation in collaborative problem solving.",
            "A communication-aware framework for parallel spatially explicit agent-based models.",
            "Parallel construction of large circular cartograms using graphics processing units.",
            "High-performance quadtree constructions on large-scale geospatial rasters using GPGPU parallel primitives.",
            "Re-engineering the GIS&T Body of Knowledge.",
            "A population density grid for Spain.",
            "Toward mapping land-use patterns from volunteered geographic information.",
            "An evaluation of ontology matching techniques on geospatial ontologies.",
            "Efficient measurement of continuous space shortest distance around barriers.",
            "Automatic drainage pattern recognition in river networks.",
            "Interest in intermediate soft-classified maps in land change model validation: suitability versus transition potential.",
            "Accuracy of contour lines using 3D bands.",
            "Semantically based reclassification of Danish land-use and land-cover information.",
            "A spatial genetic algorithm for automating land partitioning.",
            "Simulation of spatial population dynamics based on labor economics and multi-agent systems: a case study on a rapidly developing manufacturing metropolis.",
            "Soil depth estimation through soil-landscape modelling using regression kriging in a Himalayan terrain.",
            "Exploring multi-criteria decision strategies in GIS with linguistic quantifiers: an extension of the analytical network process using ordered weighted averaging operators.",
            "Geosocial gauge: a system prototype for knowledge discovery from social media.",
            "Locating place names from place descriptions.",
            "Mastering iron: the struggle to modernize an American industry, 1800-1868."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2012",
        "info": "Volume 26, 2012",
        "count": 119,
        "papers": [
            "Virtual city models for assessing environmental equity of access to sunlight: a case study of Kyoto, Japan.",
            "Modeling unobserved true position using multiple sources and information semantics.",
            "A GIS framework for the refinement of species geographic ranges.",
            "Analysing the spatial scale of population concentrations by religion in Northern Ireland using global and local variograms.",
            "A novel web-based system for tropical cyclone analysis and prediction.",
            "On-demand base maps on the web generalized according to user profiles.",
            "Malaria risk areas of Udalguri district of Assam, India: a GIS-based study.",
            "Revisiting John Snow's map: network-based spatial demarcation of cholera area.",
            "Modelling sustainable urban growth in a rapidly urbanising region using a fuzzy-constrained cellular automata approach.",
            "Large-scale land cover mapping with the integration of multi-source information based on the Dempster-Shafer theory.",
            "Measuring transit system accessibility using a modified two-step floating catchment technique.",
            "Scaling of geographic space from the perspective of city and field blocks and using volunteered geographic information.",
            "An evaluation of the use of points versus polygons in public participation geographic information systems using quasi-experimental design and Monte Carlo simulation.",
            "Comparative assessment of semantic-sensitive satellite image retrieval: simple and context-sensitive Bayesian networks.",
            "Characterizing and representing inference histories in geologic mapping.",
            "Predictive modelling of seabed sediment parameters using multibeam acoustic data: a case study on the Carnarvon Shelf, Western Australia.",
            "Identifying spatial concentrations of surnames.",
            "A multidisciplinary approach to reveal palaeo-hydrographic features: the case study of Luna archaeological site surroundings.",
            "What can I do there? Towards the automatic discovery of place-related services and activities.",
            "Reliable shortest path finding in stochastic networks with spatial correlated link travel times.",
            "Modelling spatial heterogeneity and anisotropy: child anaemia, sanitation and basic infrastructure in sub-Saharan Africa.",
            "Comparison of thematic maps using symbolic entropy.",
            "Exploratory analysis of the interrelations between co-located boolean spatial features using network graphs.",
            "Spatio-temporal location modeling in a 3D indoor environment: the case of AEDs as emergency medical devices.",
            "Evaluating representation and scale error in the maximal covering location problem using GIS and intelligent areal interpolation.",
            "Temporal change and suitability assessment of cropland in the Yellow River Basin during 1990-2005.",
            "Mapping organism spread potential by integrating dispersal and transportation processes using graph theory and catchment areas.",
            "Intentional actions, plans, and information systems.",
            "Foundations of location analysis. Series: International Series in Operations Research & Management Science, Vol 155, edited by Horst A. Eiselt and Vladimir MarianovNew York, Dordrecht, Heidelberg, London, Springer Science+Business Media, 2011, 509 pp., €181.85, $239.00, £153.00, ISBN 978-1-4419-7571-3 (hardprint), 978-1-4419-7572-0 (electronic).",
            "An ontology for the representation of spatiotemporal jurisdictional domains in information retrieval systems.",
            "Modeling experimental cross-transiograms of neighboring landscape categories with the gamma distribution.",
            "A framework of integrating GIS and parallel computing for spatial control problems - a case study of wildfire control.",
            "A GIS-supported impact assessment of the hierarchical flood-defense systems on the plain areas of the Taihu Basin, China.",
            "An improved distance metric for the interpolation of link-based traffic data using kriging: a case study of a large-scale urban road network.",
            "A comparative study of various strategies to concatenate road segments into strokes for map generalization.",
            "Evaluation of the variation in semantic contents of class sets on modelling dynamics of land-use changes.",
            "A landslide expert system: image classification through integration of data mining approaches for multi-category analysis.",
            "Extended hybrid meshing algorithm for multiresolution terrain models.",
            "Aggregation in continuous space coverage modeling.",
            "A GIS data model for landmark-based pedestrian navigation.",
            "Observations of dugongs at Aldabra Atoll, western Indian Ocean: lagoon habitat mapping and spatial analysis of sighting records.",
            "Integration of linear and areal hierarchies for continuous multi-scale representation of road networks.",
            "The inclusion of differentially assessed lands in urban growth model calibration: a comparison of two approaches using SLEUTH.",
            "Multicriteria generalization (MCG): a decision-making framework for formalizing multiscale environmental data reduction.",
            "Autocorrelation-Based Regioclassification - a self-calibrating classification approach for choropleth maps explicitly considering spatial autocorrelation.",
            "Choice set formation with multiple flexible activities under space-time constraints.",
            "Mining urban land-use patterns from volunteered geographic information by means of genetic algorithms and artificial neural networks.",
            "Tuning the second-generation SDI: theoretical aspects and real use cases.",
            "Detecting the order of spatial dependence via symbolic analysis.",
            "An effective heuristic for computing many shortest path alternatives in road networks.",
            "A node semantic similarity schema-matching method for multi-version Web Coverage Service retrieval.",
            "A three-step floating catchment area method for analyzing spatial access to health services.",
            "A three-step approach of simplifying 3D buildings modeled by CityGML.",
            "Measuring complexity in OGC web services XML schemas: pragmatic use and solutions.",
            "A GIS toolkit for measuring and mapping space-time accessibility from a place-based perspective.",
            "Defining agents' behaviour based on urban economic theory to simulate complex urban residential dynamics.",
            "Modeling of glacier bed topography from glacier outlines, central branch lines, and a DEM.",
            "Volunteered geographic information production as a spatial process.",
            "Application of Bayesian spatial smoothing models to assess agricultural self-sufficiency.",
            "An integrated approach for addressing geographic uncertainty in spatial optimization.",
            "Integrated modelling of population, employment and land-use change with a multiple activity-based variable grid cellular automaton.",
            "GIS-based modelling of topography-induced solar radiation variability in complex terrain for data sparse region.",
            "Improving map generalisation with new pruning heuristics.",
            "A multi-type ant colony optimization (MACO) method for optimal land use allocation in large areas.",
            "The viability of the genetic algorithm geodemographic modelling in the case of Korean DIF zoning.",
            "Statistics-based outlier detection for wireless sensor networks.",
            "Three-dimensional visualization of an emotional map with geographical information systems: a case study of historical and cultural heritage in the Yeongsan River Basin, Korea.",
            "Semantic similarity measurement based on knowledge mining: an artificial neural net approach.",
            "Assessing similarity matching for possible integration of feature classifications of geospatial data from official and informal sources.",
            "Detecting ethnic residential clusters using an optimisation clustering method.",
            "Reconsidering the definition of a spatial data infrastructure.",
            "Criteria of geographic relevance: an experimental study.",
            "Defining and generating axial lines from street center lines for better understanding of urban morphologies.",
            "The CartACom model: transforming cartographic features into communicating agents for cartographic generalisation.",
            "Movement similarity assessment using symbolic representation of trajectories.",
            "Estimating the spatial pattern of human-caused forest fires using a generalized linear mixed model with spatial autocorrelation in South Korea.",
            "Combining AHP with GIS in synthetic evaluation of environmental suitability for living in China's 35 major cities.",
            "Natural protected areas of San Luis Potosí, Mexico: ecological representativeness, risks, and conservation implications across scales.",
            "A modified particle swarm optimization algorithm for optimal allocation of earthquake emergency shelters.",
            "Assimilating process context information of cellular automata into change detection for monitoring land use changes.",
            "Paying as the urban areas grow - implementing and managing urban development charges using a GIS application.",
            "Developing a parallel computational implementation of AMOEBA.",
            "Comments on 'Combining spatial transition probabilities for stochastic simulation of categorical fields' with communications on some issues related to Markov chain geostatistics.",
            "Response to 'Comments on \"Combining spatial transition probabilities for stochastic simulation of categorical fields\" with communications on some issues related to Markov chain geostatistics'.",
            "Modeling of space-time infectious disease spread under conditions of uncertainty.",
            "Interpreting maps through the eyes of expert and novice users.",
            "An efficient outlying trajectories mining approach based on relative distance.",
            "Zone design of specific sizes using adaptive additively weighted Voronoi diagrams.",
            "A prefetching model based on access popularity for geospatial data in a cluster-based caching system.",
            "Incorporating spectral data into logistic regression model to classify land cover: a case study in Mt. Qomolangma (Everest) National Nature Preserve.",
            "GIS-based method of delimitating trade area for retail chains.",
            "Extending agent-based land-use/-cover change models to tropical deforestation: a focus on farm-based decision making in tropical subsistence farming.",
            "Multi-criteria modelling and clustering of spatial information.",
            "Accelerating agent-based computation of complex urban systems.",
            "Near real-time geoprocessing on the grid: A scalable approach to road traffic monitoring.",
            "Neighborhood size and spatial scale in raster-based slope calculations.",
            "Inferring network paths from point observations.",
            "Spatial data infrastructures in context: north and south, edited by Zorica Nedovic-Budic, Joep Crompvoets and Yola GeorgiadouLondon, New York: CRC Press, 2011, 288 pp., $99.95, €79.99, £63.99, ISBN 9781439828021.",
            "Code/space: software and everyday life, by Rob Kitchen and Martin DodgeMIT Press, Cambridge, MA, 2011, 320 pp., $35.00, £24.95, €28.99 (hardcover), ISBN 0-262-04248-7.",
            "Geospatial analysis of species, biodiversity and landscapes: introduction to the second special issue on spatial ecology.",
            "Which environmental variables should I use in my biodiversity model?",
            "Pseudo-absences, pseudo-models and pseudo-niches: pitfalls of model selection based on the area under the curve.",
            "Spatial non-stationarity and anisotropy of compositional turnover in eastern Australian Myrtaceae species.",
            "Influence of positional accuracy, sample size and scale on modelling species distributions: a review.",
            "The effect of species geographical distribution estimation methods on richness and phylogenetic diversity estimates.",
            "A comparison of two home range modeling methods using Ugandan mountain gorilla data.",
            "Spatial data for modelling and management of freshwater ecosystems.",
            "Developing physical surrogates for benthic biodiversity using co-located samples and regression tree models: a conceptual synthesis for a sandy temperate embayment.",
            "A comparison of spatially explicit and classic regression modelling of live coral cover using hyperspectral remote-sensing data in the Al Wajh lagoon, Red Sea.",
            "LaHMa: a landscape heterogeneity mapping method using hyper-temporal datasets.",
            "Reflections on Geographic Information Science: special issue in honor of Michael Goodchild.",
            "Theory and application in a post-GISystems world.",
            "Spatial econometrics in an age of CyberGIScience.",
            "Geodemographics and the practices of geographic information science.",
            "Space-adjusting technologies and the social ecologies of place: review and research agenda.",
            "Experiences with evacuation route planning algorithms.",
            "Core concepts of spatial information for transdisciplinary research.",
            "Spatial data quality and beyond.",
            "Climbing on a milestone for a better view: Goodchild's 'Geographical Information Science' paper as vantage point and ground for reflection."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2011",
        "info": "Volume 25, 2011",
        "count": 120,
        "papers": [
            "25 Volumes of the International Journal of Geographical Information Science.",
            "Interactive visualization of multi-resolution urban building models considering spatial cognition.",
            "Toward 3D spatial dynamic field simulation within GIS using kinetic Voronoi diagram and Delaunay tetrahedralization.",
            "Agent-based simulation of human movement shaped by the underlying street structure.",
            "Predictive ability of logistic regression, auto-logistic regression and neural network models in empirical land-use change modeling - a case study.",
            "A model for the automatic improvement of colour contrasts in maps: application to risk maps.",
            "Measuring congruence of spatial objects.",
            "Cellular automata-based spatial multi-criteria land suitability simulation for irrigated agriculture.",
            "Geo-referencing with semi-automatic gazetteer expansion using lexico-syntactical patterns and co-reference analysis.",
            "Regional carrying capacity evaluation and prediction based on GIS in the Yangtze River Delta, China.",
            "The geoviz toolkit: using component-oriented coordination methods for geographic visualization and analysis.",
            "Supporting synthesis in geovisualization.",
            "Developing a multi-network urbanization model: A case study of urban growth in Denver, Colorado.",
            "Weighted ego network for forming hierarchical structure of road networks.",
            "Deferred decentralized movement pattern mining for geosensor networks.",
            "An analytic solution to the alibi query in the space-time prisms model for moving object data.",
            "The natures of maps: cartographic constructions of the natural world.",
            "Planning support systems for cities and regions.",
            "Adjustment computations: spatial data analysis.",
            "Working across boundaries: people, nature, and regions.",
            "Interacting with geospatial technologies.",
            "Open source GIS: a GRASS GIS approach. The international series in engineering and computer science.",
            "Facility location: concepts, models, algorithms and case studies. Series: Contributions to Management Science.",
            "The Handbook of Spatial Statistics.",
            "Maps: finding our place in the world.",
            "Geospatial tools address emerging issues in spatial ecology: a review and commentary on the Special Issue.",
            "Modelling the effect of intersections in linear habitat on spatial distribution and local population density.",
            "Factors affecting space use overlap by white-tailed deer in an urban landscape.",
            "Incorporating a distance cost in systematic reserve design.",
            "Scale effects in uncertainty modeling of presettlement vegetation distribution.",
            "Spatial nonstationarity and the scale of species-environment relationships in the Mojave Desert, California, USA.",
            "Effects of geographical data sampling bias on habitat models of species distributions: a case study with steppe birds in southern Portugal.",
            "Multiscale analysis of the relationship between topography and aboveground biomass in the tropical rainforests of Sulawesi, Indonesia.",
            "Components of uncertainty in primary production model: the study of DEM, classification and location error.",
            "Sensitivity analysis of logistic regression parameterization for land use and land cover probability estimation.",
            "Scaling up: linking field data and remote sensing with a hierarchical model.",
            "How much impact does the choice of a random number generator really have?",
            "There is no good excuse for a bad random number generator: a reply to Barry.",
            "High-performance three-horizon composition algorithm for large-scale terrains.",
            "Topologically consistent 3D city models obtained by extrusion.",
            "Coupling urban cellular automata with ant colony optimization for zoning protected natural areas under a changing landscape.",
            "An optimized framework for seamlessly integrating OGC Web Services to support geospatial sciences.",
            "Embedding rivers in triangulated irregular networks with linear programming.",
            "Concepts, methodologies, and tools of an integrated geographical simulation and optimization system.",
            "Using moment invariants to analyze cluster shapes and hypothesize potential causes.",
            "Developing a dataset to assess ecosystem services in the Midwest United States.",
            "Spatial video and GIS.",
            "Modeling-in-the-middle: bridging the gap between agent-based modeling and multi-objective decision-making for land use change.",
            "A semantic-rich multi-scale information model for topography.",
            "Numerical experiments with cooperating multiple quadratic snakes for road extraction.",
            "A multiobjective model for generating optimal landmark sequences in pedestrian navigation applications.",
            "A modified grouping genetic algorithm to select ambulance site locations.",
            "Vagueness and the trade-off between the classification and delineation of geographic regions - an ontological analysis.",
            "Incorporating vegetation into visual exposure modelling in urban environments.",
            "Introduction to object-based landscape analysis.",
            "A multiscale geographic object-based image analysis to estimate lidar-measured forest canopy height using Quickbird imagery.",
            "Thematic accuracy assessment of geographic object-based image classification.",
            "Temporal dynamics of shrub proliferation: linking patches to landscapes.",
            "Identification of orchards and vineyards with different texture-based measurements by using an object-oriented classification approach.",
            "Improving the synoptic mapping of coral reef geomorphology using object-based image analysis.",
            "Synergy of very high resolution optical and radar data for object-based olive grove mapping.",
            "Land cover mapping within fixed segmented parcels and grown regions based on metadata attributes.",
            "Object-based classification of landforms based on their local geometry and geomorphometric context.",
            "Hybrid object-based approach for land use/land cover mapping using high spatial resolution imagery.",
            "Extended FRAG-BASE schema-matching method for multi-version open GIS Web services retrieval.",
            "Computing the fewest-turn map directions based on the connectivity of natural roads.",
            "Spatio-temporal analysis of tree height in a young cork oak plantation.",
            "A heuristic for the maximum value region problem in raster space.",
            "Building the distributed geographic SQL workflow in the Grid environment.",
            "Positional accuracy improvement: a comparative study in Shanghai, China.",
            "Solutions for 4D cadastre - with a case study on utility networks.",
            "The impact of DEM data source on prediction of flooding and erosion risk due to sea-level rise.",
            "Making GIScience research more open access.",
            "Calibration of a spatial simulation model with volunteered geographical information.",
            "A parallel computing approach to fast geostatistical areal interpolation.",
            "Zipf's law for all the natural cities in the United States: a geospatial perspective.",
            "Geopot: a Cloud-based geolocation data service for mobile applications.",
            "Using cloud computing to process intensive floating car data for urban traffic surveillance.",
            "Agent-based modeling within a cyberinfrastructure environment: a service-oriented computing approach.",
            "An event-based conceptual model for context-aware movement analysis.",
            "Agent-based simulation for a dual-diffusion process of influenza and human preventive behavior.",
            "Modelling potential movement in constrained travel environments using rough space-time prisms.",
            "Construction and computation of geometries on the ellipsoid.",
            "Digital map conflation: a review of the process and a proposal for classification.",
            "Local least absolute deviation estimation of spatially varying coefficient models: robust geographically weighted regression approaches.",
            "GIS-based stochastic modeling of physical accessibility using GPS-based floating car data and Monte Carlo simulation.",
            "REST-based semantic feature catalogue services.",
            "Scale variance analysis coupled with Moran's I scalogram to identify hierarchy and characteristic scale.",
            "Derivation of a resilient polygon centroid for natural resource management applications.",
            "An SVG-based method to support spatial analysis in XML/GML/SVG-based WebGIS.",
            "Detecting arbitrarily shaped clusters using ant colony optimization.",
            "Spatio-temporal analysis of territorial changes from a multi-scale perspective.",
            "Not developed yet? Alternative ways to include locations without changes in land use change models.",
            "GEONTO-MET: an approach to conceptualizing the geographic domain.",
            "Planar and non-planar topologically consistent vector map simplification.",
            "New method for positional quality control in cartography based on lines. A comparative study of methodologies.",
            "Predicting potential distributions of geographic events using one-class data: concepts and methods.",
            "Geographically weighted principal components analysis.",
            "The convergence of GIS and social media: challenges for GIScience.",
            "Beyond the epsilon band: polygonal modeling of gradation/uncertainty in area-class maps.",
            "Combining spatial transition probabilities for stochastic simulation of categorical fields.",
            "Registering randomly oriented scenes through moving object attributes.",
            "Evaluation of inductive logic programming for information extraction from natural language texts to support spatial data recommendation services.",
            "Zoning farmland protection under spatial constraints by integrating remote sensing, GIS and artificial immune systems.",
            "Finding moving flock patterns among pedestrians through collective coherence.",
            "Identifying strengths and limitations of pan-European forest cover maps through spatial comparison.",
            "Constructing personalized transportation networks in multi-state supernetworks: a heuristic approach.",
            "Building European spatial data infrastructures, by Ian MasserRedlands, CA, ESRI Press, 2010, 95 pp., US$34.95, £26.95, €28.99, ISBN-13: 978-1-58948-266-1.",
            "GIS in hospital and healthcare emergency management, edited by Ric SkinnerBoca Raton, FL, CRC Press, 2010, 279 pp. with many illustrations, all in black and white £63.99 (hardcover), ISBN-13: 978-1439821299.",
            "Spatial decision support systems: principles and practices, by R. Sugumaran and J. DeGrooteBoca Raton, FL, CRC Press - Taylor & Francis Group, 2010, 469 pp., $119.95, €97.99, £76.99, ISBN 978-1-4200-6209-0.",
            "Planning support systems: best practice and new methods, edited by Stan Geertman and John StillwellSpringer Science & Business Media, Berlin, 2009, £162.00, $249.00, €169.99, ISBN 978-4020-8951-0.",
            "Trust in Web GIS: the role of the trustee attributes in the design of trustworthy Web GIS applications.",
            "Map-based multicriteria analysis to support interactive land use allocation.",
            "Spatial multi-objective land use optimization: extensions to the non-dominated sorting genetic algorithm-II.",
            "Automatic revision of rules used to guide the generalisation process in systems based on a trial and error strategy.",
            "Investigating the system dynamics technique for the modeling and simulation of the development of spatial data infrastructures.",
            "Generating hierarchical strokes from urban street networks based on spatial pattern recognition.",
            "Disaggregating population density of the European Union with CORINE land cover.",
            "A multinomial logistic mixed model for the prediction of categorical spatial data.",
            "Advanced geoinformation science, edited by Chaowei Yang, David Wong, Qianjun Miao and Ruixin YangCRC Press, Boca Raton, FL, 2010, 525 pp., (hardcover), ISBN-10: 1439810605, ISBN-13: 978-1439810606."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2010",
        "info": "Volume 24, 2010",
        "count": 93,
        "papers": [
            "Relative positions in words: a system that builds descriptions around Allen relations.",
            "Theoretical analytics of stereographic projection on 3D objects' intersection predicate.",
            "Integration of GP and GA for mapping population distribution.",
            "Location-based algorithms for finding sets of corresponding objects over several geo-spatial data sets.",
            "Geographical Detectors-Based Health Risk Assessment and its Application in the Neural Tube Defects Study of the Heshun Region, China.",
            "The effect of offset correlation on positional accuracy estimation for linear features.",
            "Feature-based cartographic modelling.",
            "Semantics-based 3D dynamic hierarchical house property model.",
            "LISFLOOD: a GIS-based distributed model for river basin scale water balance and flood simulation.",
            "Maximal service area problem for optimal siting of emergency facilities.",
            "A semantic registry using a Feature Type Catalogue instead of ontologies to support spatial data infrastructures.",
            "Utilising urban context recognition and machine learning to improve the generalisation of buildings.",
            "Mapping transit-based access: integrating GIS, routes and schedules.",
            "Morphometric characterisation of landform from DEMs.",
            "Topographic mapping: covering the wider field of geospatial information science & technology (GIS&T).",
            "EDGIS: a dynamic GIS based on space time points.",
            "A new method for determining the population with walking access to transit.",
            "Optimization of mobile radioactivity monitoring networks.",
            "Geographically and temporally weighted regression for modeling spatio-temporal variation in house prices.",
            "A spatial approach to select pilot counties for programs to correct the biased sex ratio at birth in Shandong province, China.",
            "Detecting negative spatial autocorrelation in georeferenced random variables.",
            "Spatial data infrastructures as complex adaptive systems.",
            "A scale-explicit model for checking directional consistency in multi-resolution spatial data.",
            "Development of an interoperable tool to facilitate spatial data integration in the context of SDI.",
            "Investigation of aggregation effects in vegetation condition monitoring at a national scale.",
            "Sample surveying to estimate the mean of a heterogeneous surface: reducing the error variance through zoning.",
            "Automatic generation of the axial lines of urban environments to capture what we perceive.",
            "Using rough set theory to identify villages affected by birth defects: the example of Heshun, Shanxi, China.",
            "A cell-based algorithm for evaluating directional distances in GIS.",
            "The use of immersive real-time 3D computer graphics for visualisation of dilution of precision in virtual environments.",
            "A grid-based collaborative virtual geographic environment for the planning of silt dam systems.",
            "An enhanced supervised spatial decision support system of image classification: consideration on the ancillary information of paddy rice area.",
            "Selection of bandwidth type and adjustment side in kernel density estimation over inhomogeneous backgrounds.",
            "Constructing and implementing an agent-based model of residential segregation through vector GIS.",
            "Data model for system conceptualization in groundwater studies.",
            "A general-purpose parallel raster processing programming library test application using a geographic cellular automata model.",
            "Using landscape characteristics to define an adjusted distance metric for improving kriging interpolations.",
            "Personalizing map content to improve task completion efficiency.",
            "Community-based production of geographic information using open source software and Web 2.0.",
            "Simulating land-use dynamics under planning policies by integrating artificial immune systems with cellular automata.",
            "Parallel cellular automata for large-scale urban simulation using load-balancing techniques.",
            "Linear interpolation and joint model fitting of experimental transiograms for Markov chain simulation of categorical spatial variables.",
            "Identifying factors of influence in the spatial distribution of domestic fires.",
            "ESP: a tool to estimate scale parameter for multiresolution image segmentation of remotely sensed data.",
            "Forest Fire Alert System: a Geo Web GIS prioritization model considering land susceptibility and hotspots - a case study in the Carajás National Forest, Brazilian Amazon.",
            "Towards logic-based geospatial feature discovery and integration using web feature service and geospatial semantic web.",
            "Windowed nearest neighbour method for mining spatio-temporal clusters in the presence of noise.",
            "Adaptive multi-resolution labeling in virtual landscapes.",
            "Spatial variability of soil nutrients and GIS-based nutrient management in Yongji County, China.",
            "An extension of GIS-based least-cost path modelling to the location of wide paths.",
            "Analysis of the spatial relations among point distributions on a discrete space.",
            "An object-based conceptual framework and computational method for representing and analyzing coastal morphological changes.",
            "Propagating error in land-cover-change analyses: impact of temporal dependence under increased thematic complexity.",
            "An object-oriented shared data model for GIS and distributed hydrologic models.",
            "Comparative evaluation and analysis of online geocoding services.",
            "Constrained free space diagrams: a tool for trajectory analysis.",
            "An active crawler for discovering geospatial Web services and their distribution pattern - A case study of OGC Web Map Service.",
            "An agent-based micro-simulation framework for modelling of dynamic activity-travel rescheduling decisions.",
            "An application-driven approach to terrain model construction.",
            "Exploring population spatial concentrations in Northern Ireland by community background and other characteristics: an application of geographically weighted spatial statistics.",
            "Anchor uncertainty and space-time prisms on road networks.",
            "Affordance-based categorization of road network data using a grounded theory of channel networks.",
            "An agent-based model for optimal land allocation (AgentLA) with a contiguity constraint.",
            "Using geolifespans to model dynamic geographic domains.",
            "An ensemble approach to space-time interpolation.",
            "Characterizing errors in digital elevation models and estimating the financial costs of accuracy.",
            "Directed movements in probabilistic time geography.",
            "Local entropy map: a nonparametric approach to detecting spatially varying multivariate relationships.",
            "Propagating radial waves of travel cost in a grid.",
            "GIS-augmented video surveillance.",
            "Crossing natural and data set boundaries: coastal terrain modelling in the South-West Finnish Archipelago.",
            "GeoVA(t) - Geospatial Visual Analytics: Focus on Time.",
            "Assessing the quality of geoscientific simulation models with visual analytics methods - a design study.",
            "Using space-time visual analytic methods for exploring the dynamics of ethnic groups' residential patterns.",
            "Visualization of attributed hierarchical structures in a spatiotemporal context.",
            "Analysing spatio-temporal autocorrelation with LISTA-Viz.",
            "Space-time density of trajectories: exploring spatio-temporal patterns in movement data.",
            "An integrated approach for visual analysis of a multisource moving objects knowledge base.",
            "Exploring the efficiency of users' visual analytics strategies based on sequence analysis of eye movement recordings.",
            "Space, time and visual analytics.",
            "An ontology-based framework for geospatial clustering.",
            "A stroke-based method for automated generation of schematic network maps.",
            "Modeling the scale dependences of topological relations between lines and regions induced by reduction of attributes.",
            "Graphical design of world map projections.",
            "Equal arc ratio projection and a new spherical triangle quadtree model.",
            "Adjustment computation of HASM: a high-accuracy and high-speed method.",
            "Have a nice trip: an algorithm for identifying excess routes under satisfaction constraints.",
            "Using spatial analysis and Bayesian network to model the vulnerability and make insurance pricing of catastrophic risk.",
            "Ontologies of geographic information.",
            "Towards a unifying formalisation of geographic representation: the object-field model with uncertainty and semantics.",
            "Applying time-dependent variance-based global sensitivity analysis to represent the dynamics of an agent-based model of land use change.",
            "User-friendly web mapping: lessons from a citizen science website.",
            "Area aggregation in map generalisation by mixed-integer programming."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2009",
        "info": "Volume 23, 2009",
        "count": 76,
        "papers": [
            "Recent Trends in IJGISc.",
            "A kernel density estimation method for networks, its computational method and a GIS-based tool.",
            "Event-based topology for dynamic planar areal objects.",
            "An improved Fuzzy Kappa statistic that accounts for spatial autocorrelation.",
            "Detection of multi-scale clusters in network space.",
            "Extracting geographic features from the Internet to automatically build detailed regional gazetteers.",
            "Geostatistical modeling of sedimentological parameters using multi-scale terrain variables: application along the Belgian Part of the North Sea.",
            "Sensitivity analysis of spatial models.",
            "A theoretical approach to the use of cyberinfrastructure in geographical analysis.",
            "Developing geographic information infrastructures: the role of access policies.",
            "Computation of the third-order partial derivatives from a digital elevation model.",
            "A spatiotemporal data model for river basin-scale hydrologic systems.",
            "Cross-agency coordination in the shadow of hierarchy: 'joining up' government geospatial information systems.",
            "An architectural style for spatial data infrastructures.",
            "Representing geographical objects with scale-induced indeterminate boundaries: A neural network-based data model.",
            "Topological feature vectors for exploring topological relationships.",
            "Determining directional distances between points and shorelines using sweep line technique.",
            "Comment on 'Marine GIS: Identification of mesoscale oceanic thermal fronts'.",
            "Reply to Comment on 'Marine GIS: Identification of mesoscale oceanic thermal fronts'.",
            "Spatiotemporal analysis of rural-urban land conversion.",
            "Intelligent GIS for solving high-dimensional site selection problems using ant colony optimization techniques.",
            "Dynamic hybrid terrain representation based on convexity limits identification.",
            "Implementation of an adaptive salinity risk framework in the Condamine catchment, Queensland Murray-Darling Basin, Australia.",
            "Geographically intelligent disclosure control for flexible aggregation of census data.",
            "Carto-SOM: cartogram creation using self-organizing maps.",
            "Exploring spatially prioritized parameters of Feng-Shui from tomb footprint.",
            "Finding shortest paths on real road networks: the case for A.",
            "Peter Alan Burrough.",
            "Introduction to distributed geographic information processing research.",
            "Service chaining architectures for applications implementing distributed geographic information processing.",
            "Use of grid computing for modeling virtual geospatial products.",
            "Developing a grid-enabled spatial Web portal for Internet GIServices and geospatial cyberinfrastructure.",
            "TeraGrid GIScience Gateway: Bridging cyberinfrastructure and GIScience.",
            "Interoperability of functions in environmental models - a case study in hydrological modeling.",
            "The Handbook of Geographic Information Science, edited by J.P. Wilson and A.S. Fotheringham.",
            "Advances in Photogrammetry, Remote Sensing and Spatial Information Sciences: 2008 ISPRS Congress Book, edited by Z. Li, J. Chen, and E. Baltsavias.",
            "Framework for enterprise GIS for Saudi municipalities.",
            "A three-dimensional Douglas-Peucker algorithm and its application to automated generalization of DEMs.",
            "Assessment of sliver polygons in geographical vector data.",
            "Classification through consultation: public views of the geography of the e-Society.",
            "A spatio-temporal ontology for geographic information integration.",
            "On A* search with stopover areas.",
            "Geographic Visualization: Concepts, Tools & Applications, edited by Martin Dodge, Mary McDerby, and Martin Turner.",
            "Ranking spaces for predicting human movement in an urban environment.",
            "Ant intelligence for solving optimal path-covering problems with multi-objectives.",
            "Assessing housing growth when census boundaries change.",
            "Qualified topological relations between spatial objects with possible vague shape.",
            "A GeoAgent-based framework for knowledge-oriented representation: Embracing social rules in GIS.",
            "A data-mining approach for assessing consistency between multiple representations in spatial databases.",
            "Creating and delivering augmented scenes.",
            "Selective omission of road features based on mesh density for automatic map generalization.",
            "Street hierarchies: a minority of streets account for a majority of traffic flow.",
            "A comparative analysis of DEM-based models to estimate the solar radiation in mountainous terrain.",
            "A less-is-more approach to geovisualization - enhancing knowledge construction across multidisciplinary teams.",
            "Modeling uncertainty of moving objects on road networks via space-time prisms.",
            "Street-based topological representations and analyses for predicting traffic flow in GIS.",
            "Semantic Web Services-based process planning for earth science applications.",
            "A new methodology for measuring coastline recession using buffering and non-linear least squares estimation.",
            "Address databases for national SDI: Comparing the novel data grid approach to data harvesting and federated databases.",
            "Evaluating the effects of land-use development policies on ex-urban forest cover: An integrated agent-based GIS approach.",
            "GIS, multi-criteria and multi-factor spatial analysis for the probability assessment of the existence of illegal landfills.",
            "ST-DMQL: A Semantic Trajectory Data Mining Query Language.",
            "Effects of lidar post-spacing and DEM resolution to mean slope estimation.",
            "A discrete square global grid system based on the parallels plane projection.",
            "An Indoor Routing Algorithm for the Blind: Development and Comparison to a Routing Algorithm for the Sighted.",
            "An overview on current free and open source desktop GIS developments.",
            "Evaluating the Temporal and Spatial Urban Expansion Patterns of Guangzhou from 1979 to 2003 by Remote Sensing and GIS Methods.",
            "Multi-scale spatiotemporal analyses of moose-vehicle collisions: a case study in northern Vermont.",
            "Introducing scale parameters for adjusting area objects in GIS based on least squares and variance component estimation.",
            "Sensitivity analysis of a decision tree classification to input data errors using a general Monte Carlo error sensitivity model.",
            "A new algorithm for distance cartogram construction.",
            "Positioning localities based on spatial assertions.",
            "Quality assessment of linear data.",
            "Research on the Urban Influence Domains in China.",
            "Multi-criteria evaluation and least-cost path analysis for optimal haulage routing of dump trucks in large scale open-pit mines.",
            "An efficient domain decomposition framework for accurate representation of geodata in distributed hydrologic models."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2008",
        "info": "Volume 22, 2008",
        "count": 63,
        "papers": [
            "Just another node....",
            "Spatially enabling governments through SDI implementation.",
            "Embedding sustainable development strategies in agent-based models for use as a planning tool.",
            "WinBasin: Using improved algorithms and the GIS technique for automated watershed modelling analysis from digital elevation models.",
            "Grassroots groups as stakeholders in spatial data infrastructures: challenges and opportunities for local data development and sharing.",
            "Automated spot heights generalisation in trail maps.",
            "Automated catena-based discretization of landscapes for the derivation of hydrological modelling units.",
            "Web service approaches for providing enriched data structures to generalisation operators.",
            "Raster modelling of coastal flooding from sea-level rise.",
            "Identifying factors of geographic event conceptualisation.",
            "Multi-scale and multi-criteria mapping of mountain peaks as fuzzy entities.",
            "Geographical information retrieval.",
            "Geographic intention and modification in web search.",
            "An empirical study of the effects of NLP components on Geographic IR performance.",
            "Using co-occurrence models for placename disambiguation.",
            "On metonymy recognition for geographic information retrieval.",
            "A conceptual density-based approach for the disambiguation of toponyms.",
            "Location approximation for local search services using natural language hints.",
            "A comparison of geometric approaches to assessing spatial similarity for GIR.",
            "Reducing uninteresting spatial association rules in geographic databases using background knowledge: a summary of results.",
            "A new approach to quantifying spatial contiguity using graph theory and spatial interaction.",
            "Exploring potential human activities in physical and virtual spaces: a spatio-temporal GIS approach.",
            "Population-density estimation using regression and area-to-point residual kriging.",
            "Sweep-line algorithm for constrained Delaunay triangulation.",
            "The effect of instructions on distance and similarity judgements in information spatializations.",
            "Hierarchical lane-oriented 3D road-network model.",
            "Seeking the Pareto front for multiobjective spatial optimization problems.",
            "A spatiotemporal data model for dynamic transit networks.",
            "Modelling three-dimensional geoscientific fields with the Voronoi diagram and its dual.",
            "Sensitivity analysis of spatially aggregated responses: A gradient-based method.",
            "Spatial optimization as a generative technique for sustainable multiobjective land-use allocation.",
            "Towards a General Field model and its order in GIS.",
            "Least visible path analysis in raster terrain.",
            "Extensions of GAP-tree and its implementation based on a non-topological data model.",
            "An analysis of urban spatial structure using comprehensive prominence of irregular areas.",
            "Spatially modelling pathways of migratory birds for nature reserve site selection.",
            "Gauss Krüger projection for areas of wide longitudinal extent.",
            "Cartographic support for locational problem-solving by groups.",
            "A simplicial complex-based DBMS approach to 3D topographic data modelling.",
            "A flexible multi-source spatial-data fusion system for environmental status assessment at continental scale.",
            "Regionalization with dynamically constrained agglomerative clustering and partitioning (REDCAP).",
            "Framework for probabilistic geospatial ontologies.",
            "Cartographic generalisation of lines based on a B-spline snake model.",
            "Image-based quality assessment of road databases.",
            "SRTM resample with short distance-low nugget kriging.",
            "3D noise mapping in urban areas.",
            "Effects of DEM resolution and source on soil erosion modelling: a case study using the WEPP model.",
            "Using neural networks and cellular automata for modelling intra-urban land-use dynamics.",
            "Generalized network Voronoi diagrams: Concepts, computational methods, and applications.",
            "Earthquake-induced landslide hazard monitoring and assessment using SOM and PROMETHEE techniques: A case study at the Chiufenershan area in Central Taiwan.",
            "Exploring spatial data uncertainties in land-use change scenarios.",
            "Introduction to digital gazetteer research.",
            "Modelling vague places with knowledge from the Web.",
            "Georeferencing locality descriptions and computing associated uncertainty using a probabilistic approach.",
            "From named place to naming event: creating gazetteers for history.",
            "Automated conflation of digital gazetteer data.",
            "The role of ontology in improving gazetteer interaction.",
            "GIS-based multicriteria spatial modeling generic framework.",
            "Prediction and visualization of GPS multipath signals in urban areas using LiDAR Digital Surface Models and building footprints.",
            "Designing sound in cybercartography: from structured cinematic narratives to unpredictable sound/image interactions.",
            "A bottom-up approach to discover transition rules of cellular automata using ant intelligence.",
            "Fuzzy inference guided cellular automata urban-growth modelling using multi-temporal satellite images.",
            "An initial formal model for spatial data infrastructures."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2007",
        "info": "Volume 21, 2007",
        "count": 60,
        "papers": [
            "Modelling and prediction of GPS availability with digital photogrammetry and LiDAR.",
            "Metric details of topological line-line relations.",
            "Comparative tempo-spatial pattern analysis: CTSPA.",
            "Contour line thinning and multigrid generation of raster-based digital elevation models.",
            "Measuring rice paddy persistence spanning a century with Japan's oldest topographic maps: georeferencing the Rapid Survey Maps for GIS analysis.",
            "Modelling the risk of cyclone wave damage to coral reefs using GIS: a case study of the Great Barrier Reef, 1969-2003.",
            "Assessing the effect of attribute uncertainty on the robustness of choropleth map classification.",
            "Multi-scale correlations between topography and vegetation in a hillside catchment of Honduras.",
            "Exact cell decomposition on base map features for optimal path finding.",
            "DEM resolution dependencies of terrain attributes across a landscape.",
            "Efficient transmission of vector data over the Internet.",
            "Towards a general theory of geographic representation in GIS.",
            "Towards spatial data quality information analysis tools for experts assessing the fitness for use of spatial data.",
            "Mesh simplification for building typification.",
            "Global and local spatial indices of urban segregation.",
            "Evaluating the uncertainty caused by Post Office Box addresses in environmental health studies: A restricted Monte Carlo approach.",
            "Raster-network regionalization for watershed data processing.",
            "Local statistical spatial analysis: Inventory and prospect.",
            "Formalizing natural-language spatial relations between linear objects with topological and metric properties.",
            "A system of types and operators for handling vague spatial objects.",
            "NET-DBSCAN: clustering the nodes of a dynamic linear network.",
            "An adaptive approach to selecting a flow-partition exponent for a multiple-flow-direction algorithm.",
            "Extended Hausdorff distance for spatial objects in GIS.",
            "Advances in the spatio-temporal modelling of environment and landscapes (in honour of Professor Peter A. Burrough).",
            "Modelling landscape dynamics with Python.",
            "A probabilistic framework for representing and simulating uncertain environmental variables.",
            "Interactive visualization of uncertain spatial and spatio-temporal data under different scenarios: an air quality example.",
            "Estimating spatial patterns of rainfall interception from remotely sensed vegetation indices and spectral mixture analysis.",
            "Spatial-temporal specific neighbourhood rules for cellular automata land-use modelling.",
            "Patterns in soil quality: Natural geochemical variability versus anthropogenic impact in soils of Zeeland, The Netherlands.",
            "The use of GIS in reconstructing the Holocene palaeogeography of the Rhine-Meuse delta, The Netherlands.",
            "Integrating GIS and data warehousing in a Web environment: A case study of the US 1880 Census.",
            "A shortest path algorithm with novel heuristics for dynamic transportation networks.",
            "Testing the effects of positional uncertainty on spatial decision-making.",
            "Accuracy assessment of digital elevation models using a non-parametric approach.",
            "Analysis of the geographical accessibility of neurosurgical emergency hospitals in Sapporo city using GIS and AHP.",
            "Spatial-Data Sharing: Applying Social-Network Analysis to study individual and collective behaviour.",
            "The design and implementation of SPIRIT: a spatially aware search engine for information retrieval on the Internet.",
            "How complex can a land suitability map be?",
            "Coverage optimization in continuous space facility siting.",
            "Evolution of clusters in dynamic point patterns: with a case study of Ants' simulation.",
            "Modeling visibility through vegetation.",
            "Spatial aspects of MRSA epidemiology: a case study using stochastic simulation, kernel estimation and SaTScan.",
            "Geovisual analytics for spatial decision support: Setting the research agenda.",
            "Visual analytics of spatial interaction patterns for pandemic decision support.",
            "Highlighting space-time patterns: Effective visual encodings for interactive decision-making.",
            "Towards a framework for mining and analysing spatio-temporal datasets.",
            "A geographic visualization approach to multi-criteria evaluation of urban quality of life.",
            "Leveraging the potential of geospatial annotations for collaboration: a communication theory perspective.",
            "A spatio-temporal population model to support risk assessment and damage analysis for decision-making.",
            "A partition-based serial algorithm for generating viewshed on massive DEMs.",
            "Polygon-based texture mapping for cyber city 3D building models.",
            "An evaluation of void-filling interpolation methods for SRTM data.",
            "Identifying components for interoperable process models using concept lattice and semantic reference system.",
            "A rough set approach to the discovery of classification rules in spatial data.",
            "Space-time opportunities for multiple agents: a constraint-based approach.",
            "Temporal change in the landscape erosion pattern in the Yellow River Basin, China.",
            "Detection of spatial conflicts between rivers and contours in digital map updating.",
            "Multi-visibility maps of triangulated terrains.",
            "The potential for the use of Open Source Software and Open Specifications in creating Web-based cross-border health spatial information systems."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2006",
        "info": "Volume 20, 2006",
        "count": 58,
        "papers": [
            "A generalized cross-tabulation matrix to compare soft-classified maps at multiple resolutions.",
            "Fourier Series and the cartographic line.",
            "A hybrid interpolation method for the refinement of a regular grid digital elevation model.",
            "A discussion on the computational limitations of outranking methods for land-use suitability assessment.",
            "On the use of dimensioned measures of error to evaluate the performance of spatial interpolators.",
            "First evidence of West Nile virus amplification and relationship to human infections.",
            "Uncertainty analysis for soil-terrain models.",
            "Error-sensitive historical GIS: Identifying areal interpolation errors in time-series data.",
            "A new approach to the nearest-neighbour method to discover cluster features in overlaid spatial point processes.",
            "The accuracy of grid digital elevation models linearly constructed from scattered sample data.",
            "An efficient method for identifying and filling surface depressions in digital elevation models for hydrologic analysis and modelling.",
            "Application of GIS to investigate the use of space in coral reef fish: a comparison of territorial behaviour in two Red Sea butterflyfishes.",
            "Ontology-based retrieval of geographic information.",
            "3D simulation of soft geo-objects.",
            "Dynamic simplification and visualization of large maps.",
            "Indexing network-constrained trajectories for connectivity-based queries.",
            "Understanding SDI; complexity and institutionalization.",
            "Uncovering the statistical and spatial characteristics of fine toposcale DEM error.",
            "XML Web Service-based development model for Internet GIS applications.",
            "An evolutionary algorithm for multicriteria path optimization problems.",
            "Evaluating the usability of visualization methods in an exploratory geovisualization environment.",
            "GLOBAL sensitivity analysis, GIS and multi-criteria evaluation for a sustainable planning of a hazardous waste disposal site in Spain.",
            "Fourier Series and the cartographic line.",
            "Multidimensional visualisation of degrees of relevance of geographic data.",
            "On the integration of object-based models and field-based models in GIS.",
            "A multigranular object-oriented framework supporting spatio-temporal granularity conversions.",
            "Deriving ground surface digital elevation models from LiDAR data with geostatistics.",
            "GIS-based DSS for priority setting in humanitarian mine-action.",
            "A complete classification of topological relations using the 9-intersection method.",
            "Creating a hydrographic network from its cartographic representation: a case study using Ordnance Survey MasterMap data.",
            "Methods for detecting apparent differences between spatial tessellations at different time points.",
            "Population landscape: a geometric approach to studying spatial patterns of the US urban hierarchy.",
            "Sensitivity of channel mapping techniques to uncertainty in digital elevation data.",
            "Transiogram: A spatial relationship measure for categorical data.",
            "Book review.",
            "GIS-based multicriteria decision analysis: a survey of the literature.",
            "The role of sub-national government and the private sector in future spatial data infrastructures.",
            "Local-government data sharing: Evaluating the foundations of spatial data infrastructures.",
            "Function matching for Soviet-era table-based modified polyconic projections.",
            "Efficient regionalization techniques for socio-economic geographical units using minimum spanning trees.",
            "A first step towards a framework for presenting the location of confidential point data on maps - results of an empirical perceptual study.",
            "On the prediction error variance of three common spatial interpolation schemes.",
            "Computing the fuzzy topological relations of spatial objects based on induced fuzzy topology.",
            "OpenCIS - Open Source GIS-based web community information system.",
            "Ad hoc shared-ride trip planning by mobile geosensor networks.",
            "A spatial approach to forest-management optimization: linking GIS and multiple objective genetic algorithms.",
            "Relationship between herbicide concentration during the 1960s and 1970s and the contemporary MERIS Terrestrial Chlorophyll Index (MTCI) for southern Vietnam.",
            "Spatial agent-based modelling.",
            "Swarming methods for geospatial reasoning.",
            "A probe mechanism to couple spatially explicit agents and landscape models in an integrated modelling framework.",
            "Bounded rationality in agent-based models: experiments with evolutionary programs.",
            "Spatially explicit experiments for the exploration of land-use decision-making dynamics.",
            "Modelling adaptive, spatially aware, and mobile agents: Elk migration in Yellowstone.",
            "Agent-based modelling of shifting cultivation field patterns, Vietnam.",
            "Monitoring qualitative spatiotemporal change for geosensor networks.",
            "Terrain complexity and uncertainties in grid-based digital terrain analysis.",
            "Reactions to geovisualization: an experience from a European project.",
            "Accuracy of quantized Voronoi diagrams."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2005",
        "info": "Volume 19, 2005",
        "count": 55,
        "papers": [
            "Event-oriented approaches to geographic phenomena.",
            "Alternative representations of in-stream habitat: classification using remote sensing, hydraulic modeling, and fuzzy logic.",
            "A stochastic spatial decision support system based on PROMETHEE.",
            "Production of integrated digital terrain model from multiple datasets of different quality.",
            "Prediction of Anopheles minimus habitat in India - a tool for malaria management.",
            "Introduction to the Special Issue on Spatial modeling to explore land use dynamics.",
            "Exploring a spatio-dynamic neighbourhood-based model of residential behaviour in the Brussels periurban area.",
            "Analysis of land use drivers at the watershed and household level: Linking two paradigms at the Philippine forest fringe.",
            "Path dependence and the validation of agent-based spatial models of land use.",
            "Spatio-temporal dynamics in California's Central Valley: Empirical links to urban theory.",
            "Calibrating a neural network-based urban change model for two metropolitan areas of the Upper Midwest of the United States.",
            "Analysis of scale dependencies in an urban land-use-change model.",
            "Comparison of the structure and accuracy of two land change models.",
            "Sparse Grids: a new predictive modelling method for the analysis of geographic data.",
            "Enabling collaborative geoinformation access and decision-making through a natural, multimodal interface.",
            "Performance-improving techniques in web-based GIS.",
            "The application of GIS in the lands sector of a developing country: Challenges facing land administrators in Ghana.",
            "Typhoon insurance pricing with spatial decision support tools.",
            "Geographic Automata Systems.",
            "Colour-coded pixel-based highly interactive Web mapping for georeferenced data exploration.",
            "Embedding landscape processes into triangulated terrain models.",
            "A proposed framework for feature-level geospatial data sharing: a case study for transportation network data.",
            "An environmental decision-support system for the management of water pollution in a tidal river network.",
            "Ontological considerations in GIScience.",
            "An algebraic approach to automated geospatial information fusion.",
            "Dynamic environmental modelling in GIS: 1. Modelling in three spatial dimensions.",
            "Integration of genetic algorithms and GIS for optimal location search.",
            "Representing and reducing error in natural-resource classification using model combination.",
            "Dynamic environmental modelling in GIS: 2. Modelling error propagation.",
            "Discovering relative motion patterns in groups of moving point objects.",
            "Technological aspects of a full 3D cadastral registration.",
            "Possibilities and limits of prospective GIS land cover modelling - a compared case study: Garrotxes (France) and Alta Alpujarra Granadina (Spain).",
            "The technique of distance decayed visibility for forest landscape visualization.",
            "Comparison of the structure and accuracy of two land change models.",
            "Connecting historical and contemporary small-area geography in Britain: The creation of digital boundary data for 1971 and 1981 census units.",
            "Further developments of a fuzzy set map comparison approach.",
            "Comparison of land cover maps using fuzzy agreement.",
            "RUSLE applied in a GIS framework: Calculating the LS factor and deriving homogeneous patches for estimating soil loss.",
            "Using uncertain conceptual spaces to translate between land cover categories.",
            "Map generalization in the Web age.",
            "Optimization approaches for generalization and data abstraction.",
            "Amalgamation in cartographic generalization using Kohonen's feature nets.",
            "Building displacement over a ductile truss.",
            "Cartographic generalization of roads in a local and adaptive approach: A knowledge acquistion problem.",
            "Real-time generalization of XML-encoded spatial data for the Web and mobile devices.",
            "Scale-spaces for generalization of 3D buildings.",
            "A framework to enhance semantic flexibility for analysis of distributed phenomena.",
            "An integrated TIN and Grid method for constructing multi-resolution digital terrain models.",
            "A combinatorial data model for representing topological relations among 3D geographical features in micro-spatial environments.",
            "An application of problem and product ontologies for the revision of beach nourishments.",
            "Implementing a new data model for simulating processes.",
            "Query processing in spatial databases containing obstacles.",
            "Towards a potential research agenda to guide the implementation of Spatial Data Infrastructures - A case study from India.",
            "Marine GIS: Identification of mesoscale oceanic thermal fronts.",
            "GIS-based route planning in landslide-prone areas."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2004",
        "info": "Volume 18, 2004",
        "count": 53,
        "papers": [
            "Developing a conceptual framework for visually-enabled geocollaboration.",
            "Spatial simulation for translating from land use to land cover.",
            "Geocoding crime and a first estimate of a minimum acceptable hit rate.",
            "Integration of linear programming and a watershed-scale hydrologic model for proposing an optimized land-use plan and assessing its impact on soil conservation--A case study of the Nagwan watershed in the Hazaribagh district of Jharkhand, India.",
            "Modelling Scale in Geographical Information Science. Edited by Nicholas J. Tate and Peter M. Atkinson (Chichester: John Wiley and Sons, 2002). [Pp xv+277]. ISBN 0-471-98546-5. Hardback.",
            "Socio-Economic Applications of Geographic Information Science. Edited by David Kidner, Gary Higgs, and Sean White (London: Taylor & Francis, 2002) [Pp. xiii + 287]. ISBN 0-415-27910-0.",
            "Practical Geostatistics: Modelling and Spatial Analysis. By Simon W. Houlding. (Berlin: Springer Verlag, 2000). [Pp. xvi+159+CD-ROMJ]. ISBN: 3-540-66820-9. Hardback.",
            "Uncertainty in Remote Sensing and GIS. Edited by Giles M. Foody and Peter M. Atkinson (Chichester, UK: John Wiley, 2002). [Pp. xviii + 307 pages]. ISBN 0-470-84408-6. Hardback.",
            "Statistical Analysis of Spatial Point Patterns. Second Edition. By Peter J. Diggle (London: Edward Arnold). [Pp. viii+159]. ISBN 0-340-74070-1. Hardback.",
            "Map Calculus in GIS: a proposal and demonstration.",
            "Areas of fuzzy geographical entities.",
            "Using quadtree segmentation to support error modelling in categorical raster data.",
            "Intra-urban location and clustering of road accidents using GIS: a Belgian example.",
            "A double continuous approach to visualization and analysis of categorical maps.",
            "Advances in Spatial Data Handling. Edited by Dianne Richardson and Peter van Oosterom (Berlin: Springer Verlag, 2002). [Pp. xii+562+CD-ROM]. ISBN 3-540-43802-5.",
            "Planning Support Systems in Practice. Edited by Stan Geertman and John Stillwell (Berlin: Springer-Verlag, 2003). [Pp. xi+578]. ISBN 3-540-43719-3. Hardback.",
            "Geoinformation--Remote Sensing, Photogrammetry and Geographic Information Systems. By Gottfried Konecny. (London: Taylor and Francis, 2002). [Pp. xi+248]. ISBN: 0-415-23795-5. Paperback.",
            "Spatial Statistics Through Applications. Edited by J. Mateu and F. Montes (Southampton: WIT press, 2002). [Pp. xx+345]. ISBN 1-85312-649-7. Hardback.",
            "A global kinetic spatial data structure for a marine simulation.",
            "Comparing geospatial entity classes: an asymmetric and context-dependent similarity measure.",
            "The Scale Matcher: a procedure for assessing scale compatibility of spatial data and models.",
            "Visualization of the spatial patterns of inter-urban income disparities using coordinate transformations.",
            "Spatial Modelling in Forest Ecology and Management: A Case Study. Edited by M. Jansen, M. Judas and J. Saborowski (Berlin: Springer Verlag, 2002) ISBN 3-540-43357-0.",
            "Spatial Data Analysis: Theory and Practice. By Robert Haining (Cambridge: Cambridge University Press, 2003) ISBN 0-521-77437-3.",
            "GIS for Water Resources and Watershed Management. Edited by John G. Lyon (London: Taylor & Francis, 2002) ISBN 0-415-28607-7.",
            "Data fusion - from a logic perspective with a view to implementation.",
            "Geographical multi-representation: striving for the hyphenation.",
            "Modelling geographic data with multiple representations.",
            "Belief change and pre-orders: a brief overview.",
            "The beginnings of a logical semantics framework for the integration of thematic map data.",
            "Integrating knowledge representation and reasoning in Geographical Information Systems.",
            "Some thoughts on inference in the analysis of spatial data.",
            "A feature-based approach to conflation of geospatial sources.",
            "Interactive and visual fuzzy classification of remotely sensed imagery for exploration of uncertainty.",
            "Automated building generalization based on urban morphology and Gestalt theory.",
            "Book reviews.",
            "Geometric variability of raster cell class assignment.",
            "Accuracy of the coefficient expansion of the Transverse Mercator Projection.",
            "The choice of window size in approximating topographic surfaces from Digital Elevation Models.",
            "Effect of support size on the accuracy of a distributed rockfall model.",
            "Spatial variability in classification accuracy of agricultural crops in the Dutch national land-cover database.",
            "Book reviews.",
            "Multistate supernetwork approach to modelling multi-activity, multimodal trip chains.",
            "Examination of a constant-area quadrilateral grid in representation of global digital elevation models.",
            "Assessing the worldwide developments of national spatial data clearinghouses.",
            "Integrating land-cover data with different ontologies: identifying change from inconsistency.",
            "K-guarding of polyhedral terrain.",
            "Book reviews.",
            "Data mining of cellular automata's transition rules.",
            "The point-radius method for georeferencing locality descriptions and calculating associated uncertainty.",
            "GIS and genetic algorithms for HAZMAT route planning with security considerations.",
            "Landslide susceptibility mapping using GIS and the weight-of-evidence model.",
            "A method for examining the spatial dimension of multi-criteria weight sensitivity."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2003",
        "info": "Volume 17, 2003",
        "count": 41,
        "papers": [
            "Vectorial algebra algorithms for calculating terrain parameters from DEMs and solar radiation modelling in mountainous terrain.",
            "Extending GIS-based visual analysis: the concept of visualscapes.",
            "Kimberly van Niel, Shawn W. LaffanGambling with randomness: the use of pseudo-random number generators in GIS.",
            "Is inductive machine learning just another wild goose (or might it lay the golden egg)?",
            "Automating the administration boundary design process using hierarchical spatial reasoning theory and geographical information systems.",
            "An incremental construction algorithm for Delaunay triangulation using the nearest-point paradigm.",
            "Stability of the surface generated from distributed points of uncertain location.",
            "Agent-based modelling environment for spatial decision support.",
            "Extending the automated zoning procedure to reconcile incompatible zoning systems.",
            "A software framework to create vector-topology in parallel GIS operations.",
            "Rough and fuzzy geographical data integration.",
            "Fuzzy set approach to assessing similarity of categorical maps.",
            "Modelling error propagation in vector-based buffer analysis.",
            "Wavelet triangulated irregular networks.",
            "Research Article: Estimating local variations in land use statistics.",
            "Research Article: Dynamic run-time application development using CORBA objects and XML in the field of distributed GIS.",
            "Research Article: An object model with parametric polymorphism for dynamic segmentation.",
            "Research Article: Extensions to least-cost path algorithms for roadway planning.",
            "Research Article: A GIS-embedded system to support land consolidation plans in Galicia.",
            "Semantic reference systems.",
            "An object-oriented data model for complex objects in three-dimensional geographical information systems.",
            "Comparing two sets of polygons.",
            "A GIS-based Spatial Pattern Analysis Model for eco-region mapping and characterization.",
            "Modelling urban growth and landscape changes in the Atlanta metropolitan area.",
            "Infometric and statistical diagnostics to provide artificially-intelligent support for spatial analysis: the example of interpolation.",
            "Modelling the history of semi-structured geographical entities.",
            "Assessing vulnerability to earthquake hazards through spatial multicriteria analysis of urban areas.",
            "Usability evaluation and PPGIS: towards a user-centred design approach.",
            "Wavelets applied to simplification of digital terrain models.",
            "A comparison of two methods to create tracks of moving objects: linear weighted distance and constrained random walk.",
            "Increasing the spatial resolution of agricultural land cover maps using a Hopfield neural network.",
            "The discrete dynamics of small-scale spatial events: agent-based models of mobility in carnivals and street parades.",
            "Maximizing spatial congruence of observed and DEM-delineated overland flow networks.",
            "Formal information modelling for standardisation in the spatial domain.",
            "Automated map generalization with multiple operators: a simulated annealing approach.",
            "Knowledge discovery from soil maps using inductive learning.",
            "Comparison of polynomial models for land surface curvature calculation.",
            "Retail Geography and Intelligent Network Planning. By Mark Birkin, Graham Clarke and Martin Clarke. (Chichester: John Wiley and Sons, 2002). [Pp. ix+363]. ISBN: 0-471-49803-3. Paperback.",
            "Spatial Data Quality. Edited by Wenzhong Shi, Peter F. Fisher and Michael F. Goodchild (London: Taylor & Francis, 2002) [Pp. xx+313]. ISBN: 0-415-25835-9. Hardback.",
            "GPS for Land Surveyors, (2nd edition). By Jan van Sickle. (Chelsea, Michigan: Sleeping Bear Press 2001). [Pp xii+284]. ISBN 1-57504-075-1. Hardback.",
            "Concepts and Techniques of Geographic Information Systems. By C. P. Lo and Albert K. W. Yeung. (Upper Saddle River, New Jersey: Prentice Hall, 2002). [Pp. xii+492]. ISBN: 0-13-080427-4. Hardback."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2002",
        "info": "Volume 16, 2002",
        "count": 42,
        "papers": [
            "Data-gathering strategies for social-behavioural research about participatory geographical information system use.",
            "Analysing cadastral systems in uncertain situations: a conceptual framework based on soft systems theory.",
            "Integrating spatial data analysis and GIS: a new implementation using the Component Object Model (COM).",
            "Mapping Dilution of Precision (MDOP) and map-matched GPS.",
            "A working prototype of a dynamic geographical information system.",
            "Effects of spatial aggregation approaches on classified satellite imagery.",
            "Developments in statistical approaches to spatial uncertainty and its propagation.",
            "Uncertainty propagation in wildland fire behaviour modelling.",
            "Assessing effects of input uncertainty in structural landscape classification.",
            "Modelling a discrete spatial response using generalized linear mixed models: application to Lyme disease vectors.",
            "Geostatistical modelling of spatial uncertainty using p-field simulation with conditional probability fields.",
            "Efficient computation of spatial joins with intersection predicates.",
            "Ellipsoidal quadtrees for indexing of global geographical data.",
            "Geometric probability and GIS: some applications for the statistics of intersections.",
            "Using process models to improve spatial analysis.",
            "Representing multiple spatial statistics in generalized elevation uncertainty models: moving beyond the variogram.",
            "Accuracy of discontinuous binary surfaces: a case study using boreal forest fires.",
            "Developing a common spatial data infrastructure between State and Local Government--an Australian case study.",
            "Neural-network-based cellular automata for simulating multiple land use changes using GIS.",
            "An example of decision support for trypanosomiasis control using a geographical information system in eastern Zambia.",
            "An experiment on the elevation accuracy improvement of photogrammetrically derived DEM.",
            "Using GIS to analyse a severe forest blowdown in the Southern Rocky Mountains.",
            "Responding to the consequences of uncertainty in geographical data.",
            "Fractal dimension and fractal growth of urbanized areas.",
            "A method for the formalization and integration of geographical categorizations.",
            "Experimental evaluation of positional accuracy estimates from a linear network using point- and line-based testing methods.",
            "Errors of signal processing in digital terrain modelling.",
            "Extending geographical representation to include fields of spatial objects.",
            "Spatial data mining for enhanced soil map modelling.",
            "A data model for multi-dimensional transportation applications.",
            "Using simulated annealing for resource allocation.",
            "Watermarking of digital geospatial datasets: a review of technical, legal and copyright issues.",
            "Search algorithms for multiway spatial joins.",
            "Towards an evaluation of quality for names placement methods.",
            "Data quality and model complexity for regional scale soil erosion prediction.",
            "Using GIS in passive microwave soil moisture mapping and geostatistical analysis.",
            "Quantitative measures for spatial information of maps.",
            "Generic query tool for spatio-temporal data.",
            "Scale- and orientation-invariant scene similarity metrics for image queries.",
            "Characterisation and generalisation of cartographic lines using Delaunay triangulation.",
            "Calibration of stochastic cellular automata: the application to rural-urban land conversions.",
            "Error assessment of grid-based flow routing algorithms used in hydrological models."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2001",
        "info": "Volume 15, 2001",
        "count": 44,
        "papers": [
            "Citations to the International Journal of Geographical Information Systems and Science: the first 10 years.",
            "Utility map reconstruction.",
            "Formalizing fuzzy objects from uncertain classification results.",
            "A GIS-based environmental decision support system to assess the transfer of long-lived radiocaesium through food chains in areas contaminated by the Chernobyl accident.",
            "An exploratory method for qualitative trend curve analysis - a robust method against low quality data.",
            "Hierarchical fuzzy pattern matching for the regional comparison of land use maps.",
            "Map-centred exploratory approach to multiple criteria spatial decision making.",
            "GIS-based approach for participatory decision making and land suitability assessment.",
            "Using GIS and outranking multicriteria analysis for land-use suitability assessment.",
            "Fuzzy methods for categorical mapping with image-based land cover data.",
            "A Voronoi-based 9-intersection model for spatial relations.",
            "Visibility graphs and landscape visibility analysis.",
            "Providing spatial statistical data analysis functionality for the GIS user: the SAGE project.",
            "A TIN compression method using Delaunay triangulation.",
            "Triangulated irregular network optimization from contour data using bridge and tunnel edge removal.",
            "Voronoi-based region approximation for geographical information retrieval with gazetteers.",
            "Optimal spatial decision making using GIS: a prototype of a real estate geographical information system (REGIS).",
            "Artificial neural networks as a tool for spatial interpolation.",
            "Development of daily spatial heat unit mapping from monthly climatic surfaces for the Australian continent.",
            "A distributed spatial architecture for bush fire simulation.",
            "Easy triangle strips for TIN terrain models.",
            "GIS as media?",
            "Use of LDAP to partially implement the OGIS discovery service.",
            "Uncertainty and sensitivity analysis: tools for GIS-based model implementation.",
            "An integration of GIS, virtual reality and the Internet for visualization, analysis and exploration of spatial data.",
            "Assessing fitness for use: the expected value of spatial data sets.",
            "On the accuracy of TIGER-type geocoded address data in relation to cadastral and census areal units.",
            "Continuous indexing of hierarchical subdivisions of the globe.",
            "Analysis of surface changes using primitive events.",
            "A genetic algorithm for designing optimal patch configurations in GIS.",
            "A spatio-temporal data model for activity-based transport demand modelling.",
            "Ontology: buzzword or paradigm shift in GI science?",
            "Geographical categories: an ontological investigation.",
            "Ontologies in support of activities in geographical space.",
            "Nearness relations in environmental space.",
            "Ontology and epistemology for agent-based wayfinding simulation.",
            "Tiers of ontology and consistency constraints in geographical information systems.",
            "Fusion of top-level and geographical domain ontologies based on context formation and complementarity.",
            "Topology revisited: representing spatial relations.",
            "Robustness in GIS algorithm implementation with application to line simplification.",
            "Detecting outliers in irregularly distributed spatial data sets by locally adaptive and robust statistical analysis and GIS.",
            "Comparison of existing triangulation methods for regularly and irregularly spaced height fields.",
            "A cephalopod fishery GIS for the Northeast Atlantic: development and application.",
            "Integration of multi-source remote sensing data for land cover change detection."
        ]
    },
    {
        "name": "IJGIS",
        "year": "2000",
        "info": "Volume 14, 2000",
        "count": 46,
        "papers": [
            "Knowledge acquisition for the automatic interpretation of spatial data.",
            "Accuracy of count data transferred through the areal weighting interpolation method.",
            "A stochastic process-based model for the positional error of line segments in GIS.",
            "Assessment of error in digital vector data using fractal geometry.",
            "Using desktop GIS for the investigation of accessibility by public transport: an isochrone approach.",
            "Quantifying positional error induced by line simplification.",
            "Modelling sustainable urban development by the integration of constrained cellular automata and GIS.",
            "Fuzzy set theory and thematic maps: accuracy assessment and area estimation.",
            "Application of fuzzy measures in multi-criteria evaluation in GIS.",
            "Analysing forest fragmentation using spatial autocorrelation, graphs and GIS.",
            "Identity-based change: a foundation for spatio-temporal knowledge representation.",
            "A fuzzy set approach for modelling time in GIS.",
            "Regression analysis with spatially autocorrelated error: simulation studies and application to mapping of soil organic matter.",
            "A GIS based coastal management system for climate change associated flood risk assessment on the east coast of England.",
            "Long term management of a corporate GIS.",
            "GIS data modelling-lessons from the analysis of DTMs.",
            "Spatial analysis weighting algorithm using Voronoi diagrams.",
            "A general model of watershed extraction and representation using globally optimal flow paths and up-slope contributing areas.",
            "Querying probabilistic land cover data using fuzzy set theory.",
            "An organizational learning perspective on GIS.",
            "A direction dependent least-cost-path algorithm for roads and canals.",
            "Uncertain topological relations between imprecise regions.",
            "Using auxiliary information to adjust fuzzy membership functions for improved mapping of soil qualities.",
            "Development of Voronoi-based cellular automata -an integrated dynamic model for Geographical Information Systems.",
            "Rough classification and accuracy assessment.",
            "A conceptual framework for incorporating cognitive principles into geographical database representation.",
            "Using GIS and large-scale digital data to implement hedonic pricing studies.",
            "Integrating GIS components and spatial statistical analysis in DBMSs.",
            "Map analysis techniques for glaciological applications.",
            "Assessing farmland dynamics and land degradation on Sahelian landscapes using remotely sensed and socioeconomic data.",
            "Object-oriented representation for modelling mobile objects in an aquatic environment.",
            "Simulating artificial cities in a GIS environment: urban growth under alternative regulation regimes.",
            "Integrating attribute and space characteristics in choropleth display and spatial data mining.",
            "Aoristic analysis: the spatial interpretation of unspecific temporal events.",
            "Testing local spatial autocorrelation using k-order neighbours.",
            "Modelling snow accumulation with a geographic information system.",
            "Obituary: John Terrence Coppock.",
            "The social construction of geographical information systems.",
            "Actor-networks and implementation: examples from conservation GIS in Ecuador.",
            "Mapping biodiversity.",
            "Surfaces: tacit knowledge, formal language, and metaphor at the Harvard Lab for Computer Graphics and Spatial Analysis.",
            "Conforming (to) the opposition: the social construction of geographical information systems in social movements.",
            "Automatic extraction of building statistics from digital orthophotos.",
            "Determination of grid size for digital terrain modelling in landscape investigations - exemplified by soil moisture distribution at a micro-scale.",
            "Use of GIS for a spatial and temporal analysis of Kenyan wildlife with generalised linear modelling.",
            "Spatial analysis of rural energy system."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1999",
        "info": "Volume 13, 1999",
        "count": 46,
        "papers": [
            "Using digital spatial archives effectively.",
            "Applying case-based reasoning techniques in GIS.",
            "An accuracy assessment method for geographical line data sets based on buffering.",
            "Calibration and sensitivity analysis of a spatially-distributed solar radiation model.",
            "All shapes and sizes: the first generation of national spatial data infrastructures.",
            "Linear pycnophylactic reallocation comment on a paper by D. Martin.",
            "Processing fuzzy spatial queries: a configuration similarity approach.",
            "A personal construct-based knowledge acquisition process for natural resource mapping.",
            "The GARP modelling system: problems and solutions to automated spatial prediction.",
            "Exploring links between crime and disadvantage in north-west England: an analysis using geographical information systems.",
            "Modeling mobile individuals in dynamic landscapes.",
            "A raster-based method for computing Voronoi diagrams of spatial objects using dynamic distance transformation.",
            "Integrating geographical information systems into travel cost analysis and benefit transfer.",
            "System design for catchment-scale approaches to studying river channel adjustments using a GIS.",
            "The different identities of GIS and GIS diffusion.",
            "Reviewer acknowledgements.",
            "Visualization for exploration of spatial data.",
            "Four barriers to the development of effective exploratory visualisation tools for the geosciences.",
            "Constructing knowledge from multivariate spatiotemporal data: integrating geographical visualization with knowledge discovery in database methods.",
            "Extending the map metaphor using web delivered multimedia.",
            "Interactive maps for visual data exploration.",
            "Active legends for interactive cartographic animation.",
            "Interaction in virtual world views-linking 3D GIS with VR.",
            "Virtual environments for student fieldwork using networked components.",
            "Visualisation of 8000 years of geological history in Southern India.",
            "Interactive visualisation of geographical objects on the Internet.",
            "A commentary on GeoVRML: a tool for 3D representation of georeferenced data on the web.",
            "Matching spatial data sets: a statistical approach.",
            "A generic concept-based object-oriented geographical information system.",
            "Analysing space use patterns by Thiessen polygon and triangulated irregular network interpolation: a non-parametric method for processing telemetric animal fixes.",
            "Aggregation issues of spatial information in environmental research.",
            "Erratum.",
            "A framework for model integration in spatial decision support systems.",
            "Spatial representation of economic and financial measures used in agriculture via wavelet analysis.",
            "A strategy for controlling error of distributed environmental models by aggregation.",
            "Development of a technique to decompose heterogeneous mapping units in a categorical map of the biotic environment using correlated categorical data.",
            "A transformational approach to GIS operations.",
            "Benchmarking spatial joins a la carte.",
            "Incorporating fuzzy set methodologies in a DBMS repository for the application domain of GIS.",
            "Geostatistics for conflation and accuracy assessment of digital elevation models.",
            "Accuracy assessment of probabilistic visibilities.",
            "The use of fuzzy sets in the evaluation of the environment of coastal waters.",
            "Introduction to the Varenius project.",
            "Cognitive models of geographical space.",
            "Progress in computational methods for representing geographical concepts.",
            "Geographies of the information society."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1998",
        "info": "Volume 12, 1998",
        "count": 44,
        "papers": [
            "A New Ordering Strategy Applied to Spatial Data Processing.",
            "Application of a Bayesian Network in a GIS Based Decision Making System.",
            "Accuracy of Local Topographic Variables Derived from Digital Elevation Models.",
            "SimLand: A Prototype to Simulate Land Conversion Through the Integrated GIS and CA with AHP-Derived Transition Rules.",
            "Forming Spatially Coherent Regions by Classification of Multi-Variate Data: An Example from the Analysis of Maps of Crop Yield.",
            "Classification and Boundary Vagueness in Mapping Presettlement Forest Types.",
            "A Generic Statistical Approach for Modelling Error of Geometric Features in GIS.",
            "Error Propagation Modelling in Raster GIS: Overlay Operations.",
            "Sustainable Land Development Model for Rapid Growth Areas Using GIS.",
            "Liability Insurance and the Use of Geographical Information.",
            "Natural-Language Spatial Relations Between Linear and Areal Objects: The Topology and Metric of English-Language Terms.",
            "Data Mining and Soil Salinity Analysis.",
            "Mean-Variance Analysis of the Performance of Spatial Ordering Methods.",
            "Overcoming the Semantic and Other Barriers to GIS Interoperability.",
            "Abstraction and Decomposition in Interoperable GIS.",
            "On Spatial Database Integration.",
            "Towards integrated Geographical Information Processing.",
            "Spatial Multi-Database Topological Continuity and Indexing: A Step Towards Seamless GIS Data Interoperability.",
            "Issues and Prospects for the Next Generation of the Spatial Data Transfer Standard (SDTS).",
            "Cluster Discovery Techniques for Exploratory Spatial Data Analysis.",
            "Utility Network Derivation from Legacy Source Data for Feature-Based AM/FM Systems.",
            "Issues in GIS Development: Adapting to Research and Policy-Needs for Management of Wet Grasslands in an Environmentally Sensitive Area.",
            "A GIS Framework for Medelling Nitrogen Leaching from Agricultural Areas in the Middle Hills, Nepal.",
            "Continuing Education and Competency Programmes in GIS.",
            "A Hierarchical Approach to Distance Calculation Using the Spread Function.",
            "Spatial Indexing of Large Volume Swath Data Sets.",
            "Spatial Range Queries Using Traces.",
            "Can Census Offices Publish Statistics for More than One Small Area Geography? An Analysis of the differencing Problem in Statistical Disclosure.",
            "A Locational Error Model for Spatial Features.",
            "Information Strategies for Geographical Information Systems.",
            "GIS-Based Urban Modelling: Practices, Problem, and Prospects.",
            "Optimizing Census Geography: The Separation of Collection and Output Geographies.",
            "The Geography of Elderly Minority Populations in the United States.",
            "Loose-Coupling a Cellular Automaton Model and GIS: Long-Term Urban Growth Prediction for San Francisco and Washington/Baltimore.",
            "Internet-Based Investment Environment Information System: A Case Study on BKR of China.",
            "A Geographical Information System for a GPS Based Personal Guidance System.",
            "Aoristic Crime Analysis.",
            "Many Sorted Algebraic Data Models for GIS.",
            "A Method vor Building Displacement in Automated Map Generalisation.",
            "Comparing Area and Shape Distortion on Polyhedral-Based Recursive Partitions of the Sphere.",
            "Derivation of Topographic Variables from a Digital Elevation Model Given by a Spheriodal Trapezoidal Grid.",
            "Representation of 3-D Elevation in Terrain Databases Using Hierarchical Triangulated Irregular Networks. A Comparative Analysis.",
            "Impact of Sampling Intervals on the Reliability of Topographic Variables Mapped from Grid DEMs at a Micro-Scale.",
            "On Applying Viewshed Analysis for Determining Least-Cost Paths on Digital Elevation Models."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1997",
        "info": "Volume 11, 1997",
        "count": 43,
        "papers": [
            "Oversize Shelves: A Storage Management Technique for Large Spatial Data Objects.",
            "Assessing, Representing and Transmitting Positional Uncertainty in Maps.",
            "GIS Support for Distributed Group-Work in Regional Planning.",
            "Map Dynamics Integrating Cellular Automata and GIS Through Geo-Algebra.",
            "Variation in Count Data Transferred from a Set of Irregular Zones to a Set of Regular Zones Through the Point-in-Polygon Method.",
            "Spatial Relations, Minimum Bounding Rectangles, and Spatial Data Structures.",
            "Discrete Visibility Problems and Graph Algorithms.",
            "The SB+-Tree: An Efficient Index Structure for Joining Spatial Relations.",
            "Addressing Geographical Data Errors in a Classification Tree for Soil Unit Prediction.",
            "Resolution and Accuracy of Terrain Representation by Grid DEMs at a Micro-Scale.",
            "Formalization of Families of Categorical Coverages.",
            "Algebraic Models for the Aggregation of Area Features Based Upon Morphological Operators.",
            "Adaptive Recursive Tessellations (ART) for Geographical Information Systems.",
            "Adapting Regression Equations to Minimize the Mean Squared Error of Predictions Made Using Covariate Data from a GIS.",
            "An Integrated GIS and Knowledge-Based System as an Aid for the Geological Analysis of Sedimentary Basins.",
            "A Simple Positional Accuracy Measure for Linear Features.",
            "GIS-Application Development with GeoOOA.",
            "A Framework for the Integration of Geographical Information Systems and Modelbase Management.",
            "Simple Traversal of a Subdivision Without Extra Storage.",
            "A Parameterized Region-Growing Programme for Site Allocation on Raster Suitability Maps.",
            "Clarification on the Use of Linear Programming and GIS for Land-Use Modelling.",
            "Author's Reply to Arthur and Nalle.",
            "Modelling Uncertainty in Natural Resource Analysis Using Fuzzy Sets and Monte Carlo Simulation: Slope Stability Prediction.",
            "The Development of a GIS-Based Property Information System for Real Estate Valuation.",
            "Comparison of Techniques for Generating Digital Terrain Models from Contour Lines.",
            "Modelling Topographic Variation in Solar Radiation in a GIS Environment.",
            "Modelling River Channel Topography Using GIS.",
            "Data from the Deep: Implications for the GIS Community.",
            "Point Representation of Spatial Objects and Query Window Extension: A New Technique for Spatial Access Methods.",
            "A Region-Based, Graph-Theoretic Data Model for the Inference of Second-Order Thematic Information from Remotely-Sensed Images.",
            "Spatial Group Choice: A SDSS Tool for Collaborative Spatial Decision-Making.",
            "Comment on 'Modelling Topographic Potential for Erosion and Deposition Using GIS'.",
            "Reply to Comment by Desmet and Govers.",
            "Using Integrated Economic and Ecological Information to Improve Government Policy.",
            "Restoring Continuity: Exploration of Techniques for Reconstructing the Spatial Distribution Underlying Polygonized Data.",
            "An Extended Vector Product Format (EVPF) Suitable for the Representation of Three-Dimensional Elevation in Terrain Databases.",
            "Locating Some Types of Random Errors in Digital Terrain Models.",
            "Mapping Urban Air Pollution Using GIS: A Regression-Based Approach.",
            "Use of Knowledge Acquisition to Build Wildfire Representation in Geographical Information Systems.",
            "A Polygon Reduction Algorithm for Enhancing Graphics Performance with Application to Fast Rendering of Geophysical and Ionospheric Model Data.",
            "Modelling Community Evacuation Vulnerability Using GIS.",
            "A Prototype Graphic Landscape Analysis System: Part 1. Predicting Spatial Patterns of Grazing Pressure Using GIS.",
            "A Prototype Graphic Landscape Analysis System: Part 2. A Bioeconomic Analysis Model for Grazingland Development."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1996",
        "info": "Volume 10, 1996",
        "count": 52,
        "papers": [
            "The Rural Data Infrastructure.",
            "Environmental Information Systems Developments for Planning Sustainable Land Use.",
            "Discovering Environmental Data: Metadatabases, Network Information Resource Tools and the GENIE System.",
            "A Review of Current Issues in the Integration of GIS and Remote Sensing Data.",
            "The Application of GIS for Flood Defence in the Anglian Region: Developing for the Future.",
            "A GIS for Desert Locust Forecasting and Monitoring.",
            "Lattice Rings: Coordinates for Self-Similar Hierarchies and Their Relevance to Geographic Information Systems.",
            "Logical Data Modelling for Geographical Applications.",
            "A Constant Key Length Coding Scheme for Linear Quadtrees.",
            "Design of a View-Based DSS for Location Planning.",
            "Improving Locational Specificity of Map Data - A Multi-Resolution, Metadata-Driven Approach and Notation.",
            "Qualitative Spatial Reasoning: Cardinal Directions as an Example.",
            "Outside-in: An Alternative Approach to Forest Map Digitizing.",
            "Comparison of Routing Algorithms for Digital Elevation Models and Their Implications for Predicting Ephemeral Gullies.",
            "Mapping the Spatial Distribution of Forest Fire Danger Using GIS.",
            "The Role of Root-Mean-Square Error in the Geo-Transformation of Images in GIS.",
            "GIS Users Observed.",
            "Implementation of GIS in India: Organizational and Implications.",
            "A Comparison of Optimal Classification Strategies for Choroplethic Displays of Spatially Aggregated Data.",
            "A Computerised Decision Support System for Rural Policy Formulation.",
            "Classification of Kangaroo Habitat Distribution Using Three GIS Models.",
            "Quantifying Soil Variability in GIS Applications: II Spatial Distribution of Soil Properties.",
            "Toward Consensus on a European GIS Curriculum: The International Post-Graduate Course in GIS.",
            "The b-Function and Variable Stream Buffer Mapping: A Note on 'A GIS Methof for Riparian Water Quality Buffer Generation'.",
            "Modelling Uncertainty and Spatial Dependence: Stochastic Imaging.",
            "Efficient Methods for Isoline Extraction from a TIN.",
            "Representing the Visibility Structure of a Polyhedral Terrein Through a Horizon Map.",
            "Natural Trees - Neighbourhood-Location in a Nutshell.",
            "Fuzzy Representation of Geographical Boundaries in GIS.",
            "Use of the Weighted Kappa Coefficient in Classification Error Assessment of Thematic Maps.",
            "The Geography of Parameter Space: An Investigation of Spatial Non-Stationarity.",
            "Modelling Topographic Potential for Erosion and Deposition Using GIS.",
            "A Spatial Data Model Design for Feature-Based Geographical Information Systems.",
            "Spatial Strategies for Parallel Spatial Modelling.",
            "Developing Parallel Procedures for Line Simplification.",
            "Local Interpolation Using a Distributed Parallel Supercomputer.",
            "Parallel Polygon Line Shading: The Quest for More Computational Power from an Existing GIS Algorithm.",
            "Parallel Processing on Heterogeneous Networks for GIS Applications.",
            "Strategies for Real-Time Spatial Analysis Using Massively Parallel SIMD Cpmputers: An Application to Urban Traffic Flow Analysis.",
            "GIS and Geometric Representation in Facility Location Problems.",
            "Characteristic Mean and Dispersion in Surface Orientations for a Zone.",
            "Assessing Hazardous Waste Transport Risks Using a GIS.",
            "Sampling and Mapping of Heterogeneous Surfaces: Multi-Resolution Tiling Adjusted to Spatial Variability.",
            "GIS and Remote Sensing Integration for Environmental Applications.",
            "Landscape 'Contagion' in Raster and Vector Environments.",
            "Database Design for a Multi-Scale Spatial Information System.",
            "Identification of Field Attribute Error Under Different Models of Spatial Variation.",
            "A CORINE Map of Great Britain by Automated Means, Techniques for Automatic Generalization of the Land Cover Map of Great Britain.",
            "A. GIS-Based Approach to Multiple Criteria Group Decision-Making.",
            "An Assessment of Surface and Zonal Models of population.",
            "A Geographical Information System to Facilitate Military Housing Management.",
            "Weight Matrices and Spatial Autocorrelation Statistics Using a Topological Vector Data Model."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1995",
        "info": "Volume 9, 1995",
        "count": 36,
        "papers": [
            "An Event-Based Spatiotemporal Data Model (ESTDM) for Temporal Analysis of Geographical Data.",
            "An Iconic Query Language for Topological Relationships in GIS.",
            "Automatic Generation of Products from Terabyte-Size Geographical Information System Using Planning and Scheduling.",
            "GIS and Models of Accessibility Potential: An Application in Planning.",
            "Quantifying Soil Variability in GIS Applications I. Estimates of Position.",
            "The Resel-Based GIS.",
            "Concepts and Paradigms in Spatial Information: Are Current Geographical Information Systems Truly Generic?",
            "Templates for Spatial Reasoning in Responsive Geographical Information Systems.",
            "On the Equivalence of Topological Relations.",
            "Improving Simulation Accuracy of Spread Phenomena in a Raster-Based Geographic Information System.",
            "Massively Parallel Processing of Spatial Statistics.",
            "GIS and the Analysis of Spatially-Referenced Crime Data: Experiences in Merseyside. U. K.",
            "Fragmentation Index as a Region Based GIS Operator.",
            "Information-Associated Join Indices for Spatial Range Search.",
            "Integrating Geographical Information Systems and Multiple Criteria Decision-Making Methods.",
            "Constructing Interfaces Between (and within) Geographical Information Systems.",
            "Object-Oriented Knowledge-Based Symbol Selection for Visualizing Statistical Information.",
            "A GIS Evaluation of Land Use Dynamics and Forest Soil Fertility in a Watershed in Nepal.",
            "Rapid Generation of Digital Elevation Models from Topographic Maps.",
            "Development of a Geomorphological Spatial Model Using Object-Oriented Design.",
            "Interpolating Mean Rainfall Using Thin Plate Smoothing Splines.",
            "Topographic Solar Radiation Models for GIS.",
            "Soil-Landscape Modelling and Spatial Prediction of Soil Attributes.",
            "Modelling Spatially and Temporally Distributed Phenomena: New Methods and Tools for GRASS GIS.",
            "A Monte Carlo Simulation of Error Propagation in a GIS-Based Assessment of Seismic Risk.",
            "Quantifying Septic Nitrogen Loadings to Receiving Waters: Waquoit Bay, Massachusetts.",
            "Evaluating Field-Based GIS for Environmental Characterization, Modelling and Decision Support.",
            "The Development of an Interactive Multi-Scale GIS.",
            "Interactive GIS for Environmental Risk Assessment.",
            "Land Cover Classification by an Artificial Neural Network with Ancillary Information.",
            "Map-Image Registration Accuracy Using Least-Squares Polynomials.",
            "Modelling Conceptual Neighbourhoods of Toplogical Line-Region Relations.",
            "Modelling the Network Component of Geographical Information Systems.",
            "Developing and Testing of an Error Propagation Model for GIS Overlay Operations.",
            "Text Attributes and Processing Techniques in Geographical Information Systems.",
            "GIS - Cartography: Visual Decision Support for Spatio-Temporal Data Handling."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1994",
        "info": "Volume 8, 1994",
        "count": 31,
        "papers": [
            "The Systems Integration Problem.",
            "Visibility Algorithms on Triangulated Digital Terrain Models.",
            "Nearest Neighbourhood Operations with Generalized Voronoi Diagrams: A Review.",
            "Probabilistic Temporal GIS Modelling Involving More Than Two Map Classes.",
            "Bibliography on Spatiotemporal Databases.",
            "Parallel Terrain Triangulation.",
            "Topological Relations Between Regions with Holes.",
            "Towards a Natural Language User Interface: An Approach of Fuzzy Query.",
            "Relational Spatial Topologies for Historical Geographical Information.",
            "GIS Usability: Recommendations Based on the User's View.",
            "Handling Four-Dimensional Geo-Referenced Data in Environmental GIS.",
            "The Predictive Use of GIS to Model Property Valuations.",
            "A Query Oriented Implementation of a Topologic Data Structure for 3-Dimensional Vector Maps.",
            "Vector to Raster Conversion Error and Feature Complexity: an Empirical Study Using Simulated Data.",
            "Fuzzy Set Theoretic Approaches for Handling Imprecision in Spatial Analysis.",
            "Modelling Inside GIS: Part 1. Model Structures, Exploratory Spatial Data Analysis and Aggregation.",
            "How Effective are GIS in Practice? A Case Study of British Local Government.",
            "Line-of-Sight Communication on Terrain Models.",
            "Multistop-Based Measurements of Accessibility in a GIS Environment.",
            "Direct Induction of Compact Rule-Based Classifiers for Resource Mapping.",
            "A Land Evaluation Project in Greece Using GIS and Based on Boolean and Fuzzy Set Methodologies.",
            "Object-Oriented Approaches to Geo-Referenced Information.",
            "Simulating and Mapping Spatial Complexity Using Multi-Scale Techniques.",
            "Variable Resolution Block Kriging Using a Hierarchical Spatial Data Structure.",
            "Modelling Inside GIS: Part 2. Selecting and Calibrating Urban Models Using ARC-INFO.",
            "GIS in Bulgaria: Development and Perspectives.",
            "Areal Interpolation of Spatially Extensive Variables: A Comparison of Alternative Techniques.",
            "Storing and Retrieving Changes in a Sequence of Polygons.",
            "Parallelizing Visibility Computations on Triangulated Terrains.",
            "Analysing Telemetry Data with a GIS-Based Vector Structure.",
            "Justifying Investment in GIS: A Local Government Perspective."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1993",
        "info": "Volume 7, 1993",
        "count": 35,
        "papers": [
            "GIS and Spatial Analytical Problems.",
            "An Intuitive Approach to Analysing Small Point-Source Spatial Data Sets.",
            "Geographical Object-Oriented Databases - A Case Study.",
            "A GIS Method for Riparian Water Quality Buffer Generation.",
            "Integration of Linear Programming and GIS for Land-Use Modelling.",
            "Spatial Information Systems: Design, Modelling, and Use in Planning.",
            "Advanced Spatial Statistics for Analysing and Visualizing Geo-Referenced Data.",
            "Global Geographical Databases for Modelling Trace Gas Fluxes.",
            "TERRA-Vision - The Integration of Scientific Analysis Into the Decision-Making Process.",
            "Three-Dimensional Digital Imaging of Environmental Data: Selection of Gridding Parameters.",
            "Artificial Neural Networks for Land-Cover Classification and Mapping.",
            "An Intelligent Expert System Shell for Knowledge-Based Geographical Information Systems: 1. The Tools.",
            "An Intelligent Expert System Shell for Knowledge-Based Geographical Information Systems: 2. Some Applications.",
            "Modelling Spatial Relations and Operations with Partially Ordered Sets.",
            "Error Propagation in Cartographic Modelling Using Boolean Logic and Continuous Classification.",
            "An Experimental System for the Integration of GIS Data in Knowledge-Based Image Analysis for Remote Sensing of Agriculture.",
            "Feature-Based Derivation of Drainage Networks.",
            "Latest Developments in GIS/LIS.",
            "Issues of Implementing a Spatiotemporal System.",
            "Fuzziness in Geographical Information Systems: Contributions from the Analytic Hierarchy Process.",
            "Algorithm and Implementation Uncertainty in Viewshed Analysis.",
            "Use of the Average Mutual Information Index in Evaluating Classification Error and Consistency.",
            "Municipal GIS and the Enterprise Data Model.",
            "Spatial Decision Support Systems for Real Estate Investment Analysis.",
            "Finite-Element Mesh Generation from Mappable Features.",
            "A Multiple Criteria Decision-Making Approach to GIS-Based Land Suitability Evaluation.",
            "A Common Database for Digital Mapping and GIS.",
            "HyperArc: A Task-Oriented Hypertext GIS Interface.",
            "Guidelines for Demonstrating Geographical Information Systems Based on Participatory Development.",
            "The Research Agenda of the European Science Foundation's GISDATA Scientific Programme.",
            "Analysis of GIS Spatial Data Using Knowledge-Based Methods.",
            "Delaunay Triangulations in TIN Creation: An Overview and a Linear-Time Algorithm.",
            "A Conceptual Design of a Soil Database for a Geographical Information System.",
            "Spatial Analysis of Linguistic Data with GIS Functions.",
            "TIGER/Line Files in Teaching GIS."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1992",
        "info": "Volume 6, 1992",
        "count": 42,
        "papers": [
            "Development of intelligent geographical information systems.",
            "Data access, charging and copyright and their implications for geographical information systems.",
            "Geographical information science.",
            "Book reviews.",
            "Why not SQL!",
            "Development and test of an error model for categorical data.",
            "An inductive modelling procedure based on Bayes' theorem for analysis of pattern in spatial data.",
            "Management of wildfires with a geographical information system.",
            "Road network detection from SPOT imagery for updating geographical information systems in the rural-urban fringe.",
            "The vector to raster conversion: (mis)use in geographical information systems.",
            "Forthcoming events.",
            "Algebraic approach to spatial reasoning.",
            "Environmental decision support system project: an exploration of alternative architectures for geographical information systems.",
            "Structuring image data within a multi-media information system.",
            "Improvement of GIS graphics for analysis and decision-making.",
            "Assessing costs and benefits of geographical information systems: methodological and implementation issues.",
            "Book review.",
            "Forthcoming events.",
            "Geographical information systems and planning in the USA: selected municipal adoption trends and educational concerns.",
            "Teaching the principles of GIS: lessons from the GISTutor project.",
            "gistt: a geographic information systems teaching tool.",
            "MIT's Computer Resource Lab: A research and educational facility for GIS in urban planning.",
            "NCGIA education activities: the core curriculum and beyond.",
            "Teaching generic GIS using commercial software.",
            "GIS education in Europe.",
            "Curricula, Course Outlines and Laboratory Exercises.",
            "Book reviewsA Review of Five GIS Textbooks.",
            "A generic model for planar geographical objects.",
            "Algorithms for automated line generalization1 based on a natural principle of objective generalization.",
            "Modelling landslide distribution on loess soils in China: an investigation.",
            "Integrating GIS and spatial data analysis: problems and possibilities.",
            "The U.K. Regional Research Laboratory Initiative 1987-1991.",
            "Conference reportGIS in economic development.",
            "Book reviewsEconomic Activity and Land Use: the changing information base for local and regional studies. Edited by M. J. Healey (London: Longman Scientific and Technical, 1991.) [Pp 477.]Price £35.00.",
            "Forthcoming events.",
            "An algorithm for polygon overlay using cooperative parallel processing.",
            "Data integration through region-based nominal filtering.",
            "A Multiresolution topographic surface database.",
            "Generation of multi-resolution maps from run-length-encoded data.",
            "A system for identifying datasets for GIS users.",
            "GIS in local government: some findings from Great Britain.",
            "Book Review."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1991",
        "info": "Volume 5, 1991",
        "count": 41,
        "papers": [
            "Editorial.",
            "The development and applications of geographic information systems for urban and regional planning in the developing countries.",
            "GIS in Africa: problems, challenges and opportunities for co-operation.",
            "Is GIS appropriate technologyquest;.",
            "Spatial information for resource management in Asia: a review of institutional issues.",
            "The establishment and application of the geographic mapping database by city/county unit in China.",
            "An incremental approach for establishing a geographical information system in a developing country: Saudi Arabia.",
            "The feasibility of a land information system for Belize, Central America.",
            "Resource utilization and regional planning information systems (RURPIS) in Botswana.",
            "Monitoring grasshopper and locust habitats in Sahelian Africa using GIS and remote sensing technology.",
            "Development and application of global databases: considerable progress, but more collaboration needed.",
            "Conference Report International Conference on Geographic Information Systems Applications for Urban and Regional Planning.",
            "Editorial.",
            "Point Set Topological Relations.",
            "Utilizing discriminant function analysis with a geographical information system to model ecological succession spatially.",
            "Modelling soil map-unit inclusions by Monte Carlo simulation.",
            "Fuzzy reasoning in the development of geographical information systems FRSIS: a prototype soil information system with fuzzy retrieval capabilities.",
            "Remotely-sensed data as an information source for geographical information systems in natural resource management a review.",
            "The impact of geographical information systems on the role of spatial data libraries.",
            "A Review of: \"The Design and Analysis of Spatial Data Structures\". By H. SAMET. (Addison-Wesley Publishing Company, Inc., 1989.) [Pp. xvii+493; figures, tables, appendix, references, name and credit index, subject index.] Price US $46·50. ISBN 0201502550 (hardback).",
            "A Review of: \"Applications of Spatial Data Structures: Computer Graphics, Image Processing, and GIS\". By H. SAMET. (Addison-Wesley Publishing Company, Inc, 1989.) [Pp. xv + 507; figures, tables, appendix, references, name and credit index, subject index.] Price US $49.95. ISBN 020150300 X (hardback).",
            "A Review of: \"Remote Sensing Yearbook 1988/89\". Edited by ARTHUR P. CRACKNELL and LADSON HAYES. (London: Taylor & Francis, 1989.) [Pp 733.] Price £70-00.",
            "A Review of: \"Three Dimensional Applications in Geographical Information Systems\". Edited by J. RAPER. (London: Taylor & Francis, 1989.) [Pp 189.] Price £30·00. ISBN 0850667763.",
            "A Review of: \"Information Technology in Geography and Planning - Including Principles of GIS\". By Ian Bracken and Christopher Webster. (London, New York: Routledge, 1990.) Price £60·00. ISBN 041503 201 6.",
            "A Review of: \"Remote Sensing of Soils and Vegetation in the USSR\". By P. J. Curran, G. M. Foody, K. Ya. Kondratyev, V. V. Kozoderov and P. P. Fedchenko. (London: Taylor & Francis, 1990.) [Pp 200.] Price £30·00. ISBN 085066 4020.",
            "Editorial.",
            "Comparison of existing methods for building triangular irregular network, models of terrain from grid digital elevation models.",
            "Modelling accessibility using space-time prism concepts within geographical information systems.",
            "Organizational issues in the development of geographical information systems: a case study of UJS. Army topographic information automation.",
            "Integrating multi-criteria evaluation with geographical information systems.",
            "Taxonomy for surveying the use and value of geographical information!",
            "Tactile-map output from geographical information systems: the challenge and its importance.",
            "Determination of rasterizing error a case study with the soil map of The Netherlands.",
            "Editorial.",
            "Designing a personal guidance system to aid navigation without sight: progress on the GIS component.",
            "A new method for the characterization of topographic surfaces.",
            "Analyses of visibility sites on topographic surfaces.",
            "Use of an expert system to map forest soils from a geographical information system.",
            "Diffusion of geographic information innovations.",
            "Comparative evolution of statewide Geographic Information Systems in Ohio.",
            "A Review of: \"Accuracy of Spatial Databases\". Edited by M. Goodchild and S. Gopal. (London: Taylor & Francis, 1989.) [Pp 290.] Price £35.00."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1990",
        "info": "Volume 4, 1990",
        "count": 34,
        "papers": [
            "Editorial.",
            "Database organization strategies for spatial decision support systems.",
            "A Comparative Analysis of some 2-Dimensional Orderings.",
            "Terrain position as mapped from a gridded digital elevation model.",
            "Technical note A regression technique for estimating the time required to digitize maps manually.",
            "An information systems approach to the preservation of biological diversity.",
            "A geographical information system for some Mediterranean benthic communities.",
            "Video support in teaching about geographic information systems: a review of six videotapes.",
            "Editorial.",
            "QUILT: a geographic information system based on quadtrees.",
            "A modified binary space partitioning tree for geographic information systems.",
            "Construction of interfaces for the exchange of geographic data.",
            "Deficiencies of sheets and tiles: building sheetless databases.",
            "The development of a historical digital cadastral database.",
            "Environmental sensitivity index (ESI) mapping for oil spills using remote sensing and geographic information system technology.",
            "Concerning 'The economic evaluation of implementing a GIS'.",
            "Comment on 'Concerning \"The economic evaluation of implementing a GIS'\".",
            "Editorial.",
            "The WDGM model, a formal systems view on GIS.",
            "Rule-based spatial search.",
            "Fuzzy information representation and processing in conventional GIS software: database design and application.",
            "SPIDER - an interactive statistical tool for the analysis of spatially distributed data.",
            "Building a prototype Geographical Correlates Exploration Machine.",
            "Kriging: a method of interpolation for geographical information systems.",
            "An Australian geographical information and modelling system for natural area management.",
            "Editorial.",
            "Object-oriented data modelling for spatial databases.",
            "Positional accuracy and measurement error in digital databases of land use: an empirical study.",
            "Positional uncertainty in manually digitized map data.",
            "Attribute error and sensitivity analysis of map operations in geographical informations systems: suitability analysis.",
            "Integration of spatial data in vector and raster formats in a geographic information system environment.",
            "Using geographical information system and satellite imagery within a numerical simulation of regional urban growth.",
            "A syllabus for teaching geographical information systems.",
            "ESRC/NERC joint programme on geographical information handling A progress report."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1989",
        "info": "Volume 3, 1989",
        "count": 28,
        "papers": [
            "Editorial.",
            "A review of quadtree-based strategies for interfacing coverage data with digital elevation models in grid form.",
            "Data structures for three-dimensional spatial information systems in geology.",
            "Historical data as an explicit component of land information systems.",
            "QPF A versatile query language for a knowledge-based geographical information system.",
            "The Thailand Land Titling Project First steps in a parcel-based LIS.",
            "Vegetative succession and controlled fire in a glades ecosystem A geographical information system approach.",
            "A review of low-cost scanners.",
            "Forthcoming special issues.",
            "SIRO-DBMS SIRO-DBMS: a database tool-kit for geographical information systems.",
            "The research plan of the National Center for Geographic Information and Analysis.",
            "Towards a typology of geographical information systems.",
            "Schema integration analysis for the development of GIS databases.",
            "The development and state of the art of GIS in Romania.",
            "An efficient use of quadtrees in a geographical information system.",
            "A review of temporal database research and its use in GIS applications.",
            "Modelling the temporal element in land information systems.",
            "A graphic query language for cartographic and land information systems.",
            "The current state and the main trends in the development of geographical information systems in the U.S.S.R.",
            "A review of: \"Computer Processing of Remotely-Sensed Images.\" By P. A. MATHER. (Chichester: John Wiley & Sons, 1987.) [Pp. xiv + 352; figures, tables, appendix, subject index.] Price £37·50. ISBN 0471 90648 4.",
            "A review of: \"ILWIS - The Integrated Land and Watershed Management Information System, \" ITC Publication No. 7. Edited by A. M. J. MEIJERINK, C. R. VALENZUELA and A. STEWART. (Enschede: International Institute for Aerospace Survey and Earth Sciences (ITC), 1988.) [Pp. 115.] Price Dfl.20·00.",
            "Editorial.",
            "A model for data set management in large spatial information systems.",
            "Propagation of errors in spatial modelling with GIS.",
            "A comparison of techniques for calculating gradient and aspect from a gridded digital elevation model.",
            "On the spatial representation and accuracy of address-based data in the United Kingdom.",
            "The role for a geographical information system in a large environmental project.",
            "JAMGIS, the first Jamaican Government comprehensive multi-data geographical information system Achievements and problems."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1988",
        "info": "Volume 2, 1988",
        "count": 36,
        "papers": [
            "Editorial.",
            "Some reflections on the handling of geographical information.",
            "The Regional Research Laboratory initiative A progress report.",
            "A GIS research agenda.",
            "PAN graphs An aid to GIS analysis.",
            "Quadtree storage of vector data.",
            "The use of land and property information systems.",
            "Disaggregated GIS architecture Lessons from recent developments in multi-site database management systems.",
            "A review of: \"A National Standard for the Exchange of Digital Referenced Information.\" By D. G. Clarke, A. K. Cooper, E. C. Liebenberg and M. H. van Rooven: SWISK Special Report 45 (Pretoria, South Africa: CSIR, 1987.) [Pp. 201.] ISBN 0 7988 3073.",
            "A review of: \"Computers and the Representation of Geographical Data.\" By E. E. Shiryaev (translated from the Russian by V. M. Divid, N. N. Protsenko and Yu. U. Rajabov). (Chichester John Wiley & Sons, 1987.) [Pp. 263.] Price £36·00. ISBN 0 471 90915 7.",
            "Editorial.",
            "Aspects of the implementation of the GEOVIEW design.",
            "An intelligent, object-oriented geographical information system.",
            "Using Contents Addressable Filestore for rapid access to a large cartographic data set.",
            "Research related to geographical information systems at the Natural Environment Research Council's Unit for Thematic Information Systems.",
            "The potential of GIS modelling of gravity flows and slope instabilities.",
            "Early applications of geographical information systems at the Institute of Terrestrial Ecology.",
            "A 'demonstrator' for the National Geosciences Data Index.",
            "Design of a geographical information system for a heterogeneous scientific community.",
            "A review of: \"The British Government's Response to the Report of the Committee of Enquiry into the Handling of Geographic Information\", chaired by Lord Chorley. (London: HMSO, 1988.).",
            "Editorial.",
            "The use of digital map data in the segmentation and classification of remotely-sensed images.",
            "Conflation Automated map compilation.",
            "A review and conceptual framework of automated map generalization.",
            "Establishing a geographical information system in relation to its use A process of strategic choices.",
            "Evolution of a continental-scale geographical information system.",
            "Non-current data and geographical information systems A case for data retention.",
            "A review of: \"Planning Support Facilities in Geoinformatic Systems: An Environment for Handling, Visualizing and Communicating Geo-Information.\" By STIG C. HOLMBERG. (Stockholm: Department of Geodesy, The Royal Institute of Technology, 1988.) [Pp. 48.].",
            "A review of: \"Land Information Management. An Introduction with Special Reference to Cadastral Problems in Third World Countries.\" By P. F. DALE and J. D. MCLAUGHLIN. (Oxford: Clarendon Press (Oxford University Press), 1988.) [Pp. xii + 266; figures, tables, appendices, glossary and author and subject indices.] Price £30 hardback, £15 paperback. ISBN 0 19 858404 0 (hardback), 405 9 (paperback).",
            "A review of: \"National Transfer Format, Release 1.0, January, 1987.\" By The Working Party to Produce National Standards for the Transfer of National Digital Map Data. (Southampton: The NTF Secretariat, Ordnance Survey, 1987. [Pp. 191: appendices and looseleaf annex.].",
            "Editorial.",
            "Real-time data collection quality assurance models in three-dimensional spatial information systems.",
            "The economic evaluation of implementing a GIS.",
            "Resource use in manual digitization A case study of the Patuxent basin geographical information system database.",
            "SIMPLE An inductive modelling and mapping tool for spatially-oriented data.",
            "A GIS method to aid in non-point source critical area analysis."
        ]
    },
    {
        "name": "IJGIS",
        "year": "1987",
        "info": "Volume 1, 1987",
        "count": 32,
        "papers": [
            "Editorial.",
            "Editorial review.",
            "Requirements and principles for the implementation and construction of large-scale geographic information systems.",
            "Design of a spatial data structure using the relational normal forms.",
            "The evolution of a graduated symbol software package in a changing graphics environment.",
            "Performance evaluation and work-load estimation for geographic information systems.",
            "Computing aspects of a large geographic information system for the European Community.",
            "Editorial.",
            "The GEO VIEW design A relational data base approach to geographical data handling.",
            "Fundamental operations in computer-assisted map analysis.",
            "Spatially ordered networks and topographic reconstructions.",
            "KBGIS-II A knowledge-based geographical information system.",
            "Geographic information systems and the BBC's Domesday interactive videodisk.",
            "A proposed base for a geographical information system for India.",
            "Principles of Geographical Information Systems for Land Resources Assessment (Monograph on Soil and Resources Survey No. 12). By P. A. BURROUGH. (Oxford; Clarendon Press (Oxford University Press), 1986.) [Pp. xiv+193; figures, tables, plates, glossary, appendix and author and subject indices.] Price £40 hardback, £20 paperback. ISBN 019854 564 0 (hardback), 592 4 (paperback).",
            "A UKGeographic Information System for Environmental Monitoring, Resource Planning and Management Capable of Integrating and Using Satellite Remotely Sensed DataJ. A. T. Young. Remote Sensing Society Monograph. (Nottingham: Remote Sensing Society, 1986.) [.]£1200. ISBN 0946226083.",
            "Handling Geographic Information. Report of the Committee of Enquiry Chaired by Lord Chorley, Department of the Environment. (London: HMSO, 1987.) [Pp. 208. ] Price £l14-95. ISBN Oil 752015 2.",
            "Editorial.",
            "Current and potential uses of geographical information systems The North American experience.",
            "Geographical data handling and GIS in China.",
            "Recent developments in geographical information systems in the U.K.",
            "The development of geographical information systems in Japan.",
            "The Swedish Land Data Bank.",
            "Efficient digitizing through the combination of appropriate hardware and software for error detection and editing.",
            "Teach yourself geographical information systems The design, creation and use of demonstrators and tutors.",
            "Remote Sensing Yearbook 1987. Edited by A. Cracknell and L. Hayes. (London: Taylor & Francis, 1987.) [Pp. 690.] Price £70-00. ISBN 0 85066 378 4.",
            "Editorial.",
            "The National Science Foundation National Center for Geographic Information and Analysis.",
            "A spatial analytical perspective on geographical information systems.",
            "A Mark 1 Geographical Analysis Machine for the automated analysis of point data sets.",
            "Coordinating hazardous waste management activities using geographical information systems.",
            "Technical note It doesn't make me nearly as CROSS Some advantages of the point-vector representation of line segments in automated cartography."
        ]
    }
]