[
    {
        "name": "IJKM",
        "year": "2022",
        "info": "Volume 18: 2022",
        "count": 1,
        "papers": [
            "Influential Indicators and Measurements of Mediating and Moderating Roles on SME Performance."
        ]
    },
    {
        "name": "IJKM",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 18,
        "papers": [
            "Knowledge Management in Projects.",
            "Impact of Knowledge Capabilities on Organisational Performance in the Private Sector in Oman: An SEM Approach Using Path Analysis.",
            "The Importance of Knowledge-Based Risk Processes to Risk Analysis.",
            "How to Accumulate Empirical Engineering Knowledge in the Complex Problem-Solving Process for Novice Engineers.",
            "Avatars-Based Decision Support System Using Blockchain and Knowledge Sharing for Processes Simulation: A Natural Intelligence Implementation of the Multi-Chain Open Source Platform.",
            "The Role of Knowledge in Enhancing SME Innovation: The Case of Knowsley - Northwest Region of England.",
            "Knowledge-Based Assessment Applied to Lean Brazilian Toyota Plants: Employees' Perceptions.",
            "Motivators of Researchers' Knowledge Sharing and Community Promotion in Online Multi-Background Community.",
            "How Transformational Leadership Influences the Knowledge-Sharing Process: Mediating the Role of Trust.",
            "The Influence of Accounting Information Systems, Knowledge Management Capabilities, and Innovation on Organizational Performance in Iraqi SMEs.",
            "Deriving Intellectual Capital Bottom-Line in Professional Service Firms: A High Performance Work Practices Perspective.",
            "The Impact of Knowledge Sharing on the Relationship Between Market Orientation and Service Innovation.",
            "When Emotions Rule Knowledge: A Text-Mining Study of Emotions in Knowledge Management Research.",
            "Hunch Mining.",
            "Knowledge Sharing in Catholic Organizations: A Fuzzy-Set Qualitative Comparative Analysis.",
            "Self-Learning and Self-Satisfaction: Exploring the Relationship Through Knowledge-Sharing Behaviour.",
            "Why Would I Share?: The Intention to Use Blogs for Knowledge Sharing According to Gender, Experience, and Cultural Differences.",
            "Foundations for Knowledge and Belief Management."
        ]
    },
    {
        "name": "IJKM",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 24,
        "papers": [
            "The Effect of Conflict and Knowledge Sharing on the Information Technology Project Team Performance.",
            "The Antecedents of Search Performance: Information/ Knowledge Seeking for Task Completion.",
            "Knowledge Management & It's Origin, Success Factors, Planning, Tools, Applications, Barriers and Enablers: A Review.",
            "A Hybrid Approach to Retrieve Knowledge from a Document.",
            "Unlocking Social Media and User Generated Content as a Data Source for Knowledge Management.",
            "Examining the Relevance of Intellectual Capital in Improving the Entrepreneurial Propensity Among Indians.",
            "Expert Group Knowledge Triggers: When Knowledge Surfaces.",
            "Knowledge Hiding in a Buyer-Supplier Relationship: Present and Future Scope.",
            "Assessing the Citations of Articles on Intellectual Capital: What Are the \"Influencers\"?",
            "Organizational Culture, Social Capital, and Knowledge Management: An Integrated Model.",
            "Personal or Scenarios Factors?: Research on Knowledge Accumulation of Novice Engineers.",
            "Using Artificial Neural Networks (ANNs) to Improve Agricultural Knowledge Management System (KMS).",
            "Impact of Knowledge Adoption and Cognitive Learning in the Knowledge Transfer Process.",
            "Enriching SME Learning and Innovation Through Inter-Organizational Knowledge Transfer.",
            "Bibliometric Analysis of Social Media as a Platform for Knowledge Management.",
            "Managerial Ambidexterity and Firm Performance: The Mediating Role of Knowledge Brokerage.",
            "Discovering Knowledge by Comparing Silhouettes Using K-Means Clustering for Customer Segmentation.",
            "Employee Productivity and Service Quality Enhancement Using ERP With Knowledge Management: A Study in a Power Distribution Company in the Global Context.",
            "A Retrospective Analysis of the International Journal of Knowledge Management.",
            "An Evaluation of Employees' Competence Towards the Development of a Learning Organization.",
            "The Method of Evaluating Impacts of Knowledge Management on Job Satisfaction and Intellectual Level of Work.",
            "Customer Knowledge Acquisition in Omani Organizations.",
            "Guidelines for Selecting Appropriate Knowledge Management System Implementation Frameworks.",
            "Relating Knowledge Management Enablers, Knowledge Management Processes, and Organizational Effectiveness: The Case for the Maltese Pharmaceutical Sector."
        ]
    },
    {
        "name": "IJKM",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 23,
        "papers": [
            "Knowledge Portals: A Review.",
            "Internal and Consulting Information Flows in the Process of Knowledge Accumulation.",
            "Integrating Knowledge Management into Information Security: From Audit to Practice.",
            "Advancing Automated Content Analysis in Knowledge Management Research: The Use of Compound Concepts.",
            "Pursuing Innovation Through Knowledge Sharing: Brazil and Portugal.",
            "Mapping Methodological Issues in Knowledge Management Research, 2009-2014.",
            "Knowledge Management in the Dark: The Role of Shadow IT in Practices in Manufacturing.",
            "Knowledge Management, Sustainable Business Performance and Empowering Leadership: A Firm-Level Approach.",
            "Task-Individual-Social Software Fit in Knowledge Creation Performance.",
            "Toward a Theoretical Model of Learning Organization and Knowledge Management Processes.",
            "Intergroup Contact Theory: Examining Knowledge Sharing Among Individuals From Different Tribes.",
            "The Evolution of Data Science: A New Mode of Knowledge Production.",
            "The Link Between Knowledge Sharing and Organizational Performance: Empirical Evidence From the Czech Republic.",
            "Dilemma Between 'It's My or It's My Organization's Territory': Antecedent to Knowledge Hiding in Indian Knowledge Base Industry.",
            "A Methodology for Building Knowledge Memory Within the Handicraft Sector.",
            "Does the Location in a Science and Technology Park Influence University - Industry Relationships?: Evidence From a Peripheral Region.",
            "Empowering Organizations Through Customer Knowledge Acquisition: An Empirical Study in Mexico.",
            "Achieving Business Performance Via Implementation of Knowledge Management: A Comparative Study of MAKE and non-MAKE Companies.",
            "Knowledge Management Influence on Safety Management Practices: Evidence from Construction Industry.",
            "A University Knowledge Management Tool for the Evaluation of the Efficiency and Quality of Learning Resources in Distance e-Learning.",
            "How Knowledge Management Influences Performance?: Evidences from Indian Manufacturing and Services Firms.",
            "Analysis of Knowledge Sharing Barriers in Sri Lankan Software Companies.",
            "Do Leaders Really Matter in Knowledge Management Practices? Case of Serbian Companies."
        ]
    },
    {
        "name": "IJKM",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 24,
        "papers": [
            "Knowledge Discovery From Vernacular Expressions: An Application of Social Media and Sentiment Mining.",
            "Social-Media-Based Knowledge Sharing: A Qualitative Analysis of Multiple Cases.",
            "Our Knowledge Management Hubble May Need Glasses: Designing for Unknown Real-Time Big Data System Faults.",
            "Knowledge Sharing Barriers in Vietnamese Higher Education Institutions (HEIS).",
            "To Ask or Not to Ask: The Roles of Interpersonal Trust in Knowledge Seeking.",
            "Knowledge Acquisition, Knowledge Application, and Innovation Towards the Ability to Adapt to Change.",
            "Procedure Based on Semantic Similarity for Merging Ontologies by Non-Redundant Knowledge Enrichment.",
            "Influence of Behavioral Intentions, Affective Trust and Affective Commitment on Knowledge Sharing Behavior.",
            "Technology Transfer Projects in the UK: An Analysis of University - Industry Collaboration.",
            "Knowledge Transfer from International Consultants to Local Partners: An Empirical Study of Metro Construction Projects in Vietnam.",
            "Knowledge Sharing in a Critical Moment of Work: A Driver for Success?",
            "Why do People Share?: A Study of Intrinsic and Extrinsic Motivation to Share Knowledge in Organisations.",
            "Introducing a Model of Relationship Between Knowledge Sharing Behavior and Organizational Citizenship Behavior and Positively Orientated Organizational Behavior: A Two-Wave Study.",
            "Use of Organizational Memory Systems in a Police Organization.",
            "The Mediation Role of Knowledge Sharing Between Organizational Learning and Technological Innovation Practice.",
            "Designing a Knowledge Management System for Social Services Not-For-Profit Organisations.",
            "Leadership Styles, Absorptive Capacity and Firm's Innovation.",
            "A PKM-Based Decision-Making Training Program for Personal Healthcare: An Action Learning Approach.",
            "Antecedents of New Recruit's Adjustment: An Empirical Study on Indian IT Industry.",
            "Examining the Role of Technology Leadership on Knowledge Sharing Behaviour.",
            "The Mediation of Psychological Capital in the Relationship of Perceived Organizational Support, Engagement and Extra-Role Performance.",
            "A Best-Practice Model of University-Students Relationship Development: An Empirical Study.",
            "Empowering CRM Through Business Intelligence Applications: A Study in the Telecommunications Sector.",
            "The IoT- and Big Data-Driven Data Analysis Services: KM, Implications and Business Opportunities."
        ]
    },
    {
        "name": "IJKM",
        "year": "2017",
        "info": "Volume 13: 2017",
        "count": 17,
        "papers": [
            "The Past-Present-Future Conundrum: Extending Time-Bound Knowledge.",
            "Moderator Effects of Proactive Knowledge Transfer Among Knowledge Transfer Usefulness, Management, and Innovation: A Study of Knowledge Innovation Effective Model Construction.",
            "Knowledge Sharing between Enterprises of the Same Group.",
            "Understanding Knowledge Sharing in an Organization: A Perspective of Actor-Network Theory.",
            "Understanding Knowledge Networks Through Social Network Analysis.",
            "The Impact of Personal and Positional Powers on Knowledge Management Systems.",
            "Knowledge Management Proponents or Opponents: Empirical Test on Micro Finance in Emerging Market.",
            "Technology Transfer and Innovation Management: The Brazilian TTOs Challenges.",
            "Working Toward a System for Measuring Dynamic Knowledge.",
            "The Mediating Effect of Interpersonal Trust on Virtual Team's Collaboration.",
            "Exploring the Role of the Project Manager in Organizational Knowledge Creation.",
            "Knowledge Forms and Enterprise Innovation Performance: An Evidence from the Dimensions of Stock and Flow.",
            "Framework for Managing Shared Knowledge in an Information Systems Outsourcing Context.",
            "Knowledge Management and Quality Control in Software Outsourcing Projects.",
            "Distributed 'Knowing in Practice' Enabled by Knowledge Management Systems.",
            "Knowledge Management Process-Oriented Strategy for Healthcare Organizations.",
            "Innovation Through Boundary Spanning: The Role of IT in Enabling Knowledge Flows Across Technological and Geographical Boundaries."
        ]
    },
    {
        "name": "IJKM",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 16,
        "papers": [
            "Towards a Comprehensive Process Model for Transitioning MIS to KMS.",
            "Knowledge Management in 2016: A Newer Delphi with Applications.",
            "A Contingency Approach to Knowledge Management: Finding the Best Fit.",
            "Knowledge Retention in the Service Industry.",
            "Exploring Strategies for Capturing Customer's Tacit Knowledge in Customer Integration Methods.",
            "Knowledge Management Process in Multi-Site Provision of Service.",
            "Antecedents of Local Personnel Absorptive Capacity in Joint Project Engineering Teams in Nigeria.",
            "Knowledge Management and Systematic Innovation Capability.",
            "Knowledge Management and Entrepreneurship: A Contradictory Recipe.",
            "Tacit Knowledge Management Within Hospitality Establishments: Revealing the Body of the Iceberg.",
            "Spreading the Light of Knowledge: Nexus of Job Satisfaction, Psychological Safety and Trust.",
            "Tapping Diverse Experiences: Toward Articulating Knowledge Creation Theory.",
            "The Impact of National Cultural Values on Intrinsic Motivation to Transfer Tacit Knowledge.",
            "The Role of Motivation, Ability, and Opportunity in Achieving Effective Knowledge-Work: Knowledge Work and MAO.",
            "Participative Knowledge Management to Empower Manufacturing Workers.",
            "Eleven Years of the Knowledge Management Track at HICSS: An Overview."
        ]
    },
    {
        "name": "IJKM",
        "year": "2015",
        "info": "Volume 11: 2015",
        "count": 16,
        "papers": [
            "The Influence of Individual Characteristics on Knowledge Sharing Practices, Enablers, and Barriers in a Project Management Context.",
            "Rethinking Knowledge Sharing Barriers: A Content Analysis of 103 Studies.",
            "The Negative Performance Implications of Industry Dynamism on Organizational Knowledge.",
            "Measuring Knowledge Enablers and Project Success in IT Organizations.",
            "Reconceptualizing the Knowledge Hierarchy for Management Education.",
            "Leadership Social Power as a Component of KMS Success.",
            "The Knowledge-as-Object Metaphor: A Case of Semantic Pathology.",
            "Individual Level Knowledge Transfer in Virtual Settings: A Review and Synthesis.",
            "Knowledge Identification and Acquisition in SMEs: Strategically Emergent or Just Ad Hoc?",
            "Evaluating Critical Success Factors Model of Knowledge Management: An Analytic Hierarchy Process (AHP) Approach.",
            "Inter-Organizational Knowledge Sharing System in the Health Sector: Physicians' Perspective.",
            "Improving Value in Oil Business with Integrated Operations: A Practical Case of Knowledge Management.",
            "Towards a Business-Driven Process Model for Knowledge Security Risk Management: Making Sense of Knowledge Risks.",
            "Knowledge Risks of Social Media in the Financial Industry.",
            "Ownership of Collaborative Works in the Cloud.",
            "Knowledge Transfer in Information Security Capacity Building for Community-Based Organizations."
        ]
    },
    {
        "name": "IJKM",
        "year": "2014",
        "info": "Volume 10: 2014",
        "count": 19,
        "papers": [
            "A Comprehensive Relational Model of Factors Influencing Knowledge Sharing: An Empirical Study.",
            "Knowledge Management Practices and the Focus on the Individual.",
            "Modeling the Metrics of Individual, Organizational and Technological Knowledge Sharing Barriers: An Analytical Network Process Approach.",
            "Reassessing Software Quality Performance: The Role of Knowledge Management.",
            "Socio-Cultural Influences of Society on Knowledge Construction.",
            "Integrating IS Security with Knowledge Management: Are We Doing Enough?",
            "Genre-Based Approach to Assessing Information and Knowledge Security Risks.",
            "An Integrated Risk Management Framework: Measuring the Success of Organizational Knowledge Protection.",
            "Knowledge Management in Support of Enterprise Risk Management.",
            "Exploring the Effect of Knowledge Transfer Practices on User Compliance to IS Security Practices.",
            "A Formative Evaluation of Rendezvous: A Platform for Knowledge Sharing and Entertainment.",
            "Predicting Student Academic Performance: Role of Knowledge Sharing and Outcome Expectations.",
            "Multi-Group Moderation Analysis for Relationship between Knowledge Sharing Orientation and Business Performance.",
            "Knowledge Management Practice at a Bulgarian Bank: A Case Study.",
            "Examining the Transfer of Academic Knowledge to Business Practitioners: Doctoral Program Graduates as Intermediaries.",
            "Analysis of Reasons, Implications and Consequences of Demographic Change for IT Departments in Times of Scarcity of Talent: A Systematic Review.",
            "Knowledge Spirals in Higher Education Teaching Innovation.",
            "The Management and Construction of Knowledge as an Innovation Strategy for Collaborative Learning Through the Use and Creation of Learning Communities and Networks.",
            "Adaptation of Descriptive Metadata for Managing Educational Resources in the GREDOS Repository."
        ]
    },
    {
        "name": "IJKM",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 19,
        "papers": [
            "ICT and Building a Knowledge-Based Society in Egypt.",
            "Virtual Communities as Narrative Networks: Developing a Model of Knowledge Creation for Crowdsourced Environments.",
            "Search Efforts, Selective Appropriation, and the Usefulness of New Knowledge: Evidence from a Comparison Across U.S. and Non-U.S. Patent Applicants.",
            "Integrating Knowledge Sources: An Ontological Approach.",
            "A Generic Approach for the Semantic Annotation of Conceptual Models Using a Service-Oriented Architecture.",
            "The Role of Expected Reciprocity in Knowledge Sharing.",
            "Managing Knowledge: The Critical Role of Culture and Ownership as a Mediator of Systems.",
            "An Empirical Investigation into the Influence of Knowledge Sharing Barriers on Knowledge Sharing and Individual Innovation Behaviour.",
            "Improving Dynamic Knowledge Movements with a Knowledge-Based Framework during Conceptual Design of a Green Building Project.",
            "Capturing and Conveying Chamorro Cultural Knowledge Using Social Media.",
            "A Revised Knowledge Pyramid.",
            "Effective Implementation of Knowledge Management Strategies and the Key Roles of Knowledge Ambassadors in Strategy Integration: A Longitudinal Participative Case Study of Cross-Divisional Strategy Integration.",
            "Social Networks and Organizational Performance: Exploring the Quality of Domain Knowledge Sources.",
            "Environmental Assessment in Manuscripts Library and Storages of Semi-Active Record at Sultanate of Oman.",
            "Does Knowledge Management Systems Moderate Turnover Effects?: A Study on Software Development Teams.",
            "Formality and Informality: Learning in Relationships in an Organisation.",
            "Intention to Knowledge Sharing: From Planned Behavior and Psychological Needs Perspectives.",
            "Knowledge Management Implementation in Information Society: A Review of IIUM Library KM Strategy.",
            "Knowledge Representation Strategy Determination in Quantitative Terms."
        ]
    },
    {
        "name": "IJKM",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 17,
        "papers": [
            "Would You Share?: Examining Knowledge Type and Communication Channel for Knowledge Sharing Within and Across the Organizational Boundary.",
            "Knowledge Bases Over Algebraic Models: Some Notes About Informational Equivalence.",
            "Measuring the Influence of Expertise and Epistemic Engagement to the Practice of Knowledge Management.",
            "Theorizing on the Role of Individualism-Collectivism in Tacit Knowledge Transfer Between Agents in International Alliances.",
            "The Role of Knowledge Sharing in Raising the Task Innovativeness of Systems Analysts.",
            "An Investigation of the Impact of Intrinsic Motivation on Organizational Knowledge Sharing.",
            "Knowledge Sharing Barriers and Effectiveness at a Higher Education Institution.",
            "The Knowledge Spectrum.",
            "Building Socially-Aware E-Learning Systems Through Knowledge Management.",
            "Research Portals: Status Quo and Improvement Perspectives.",
            "An Empirical Study of Knowledge Sharing Intention within Virtual Teams.",
            "Incremental Experts: How Much Knowledge Does a Team Need?",
            "IT-Based Knowledge Capability and Commercialization of Innovations: Modeling the Impacts of Ambidexterity and Absorptive Capacity.",
            "Application of Multi-Dimensional Metric Model, Database, and WAM for KM System Evaluation.",
            "Designing, Setting Up, and Facilitating a Knowledge Sharing Virtual Community of Practice, between Social Work Lecturers in the UK and India.",
            "A Multidimensional Structure for Describing the Influence of Supply Chain Strategies, Business Strategies, and Knowledge Management Strategies on Knowledge Sharing in Supply Chain.",
            "Creating a Knowledge Supply Chain for e-Tourism Curriculum Design: Integrating Knowledge Management and Supply Chain Management."
        ]
    },
    {
        "name": "IJKM",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 21,
        "papers": [
            "Valuing Knowledge-Based Initiatives: What We Know and What We Don't Know.",
            "The Effects of a KM Strategy on KM Performance in Professional Services Firms.",
            "Knowledge Management: Realizing Value through Governance.",
            "A Knowledge Management Tool for the Interconnection of Communities of Practice.",
            "Knowledge Management Process and Organizational Performance in SMEs.",
            "Boundary Spanning Role of the IS Development Team in Consultant-Partnered Projects: Knowledge Management Perspective.",
            "The Practice of Jordanian Business to Attain Customer Knowledge Acquisition.",
            "Impact of Knowledge Management Dimensions on Learning Organization: Comparison Across Business Excellence Awarded and Non-Awarded Indian Organizations.",
            "A Dynamic Ability-Based View of the Organization.",
            "Assessing Knowledge Management Needs: A Strategic Approach to Developing Knowledge.",
            "Learning a Lightweight Ontology for Semantic Retrieval in Patient-Centered Information Systems.",
            "KM Approach for Improving the Labor Productivity of Vietnamese Enterprise.",
            "Using Grounded Theory to Acquire Knowledge About Critical Success Factors for Conducting Software Process Improvement Implementation Initiatives.",
            "Managing Professions for Knowledge Management.",
            "Merging Controlled Vocabularies for More Efficient Subject-Based IR Systems.",
            "Community-Based Development of Knowledge Products.",
            "Impact of Knowledge Management Practices on Task Knowledge: An Individual Level Study.",
            "Team Learning and Reflexivity in Technology-Mediated Collaboration.",
            "Measuring Knowledge Management/Knowledge Sharing (KM/KS) Efficiency and Effectiveness in Enterprise Networks.",
            "How Should Students Prepare for Exams: A Knowledge Management Approach.",
            "An Ontological Approach to Enterprise Knowledge Modeling in a Shipping Company."
        ]
    },
    {
        "name": "IJKM",
        "year": "2010",
        "info": "Volume 6: 2010",
        "count": 17,
        "papers": [
            "Factors Affecting KM Implementation in the Chinese Community.",
            "Supporting Knowledge Evaluation to Increase Quality in Electronic Knowledge Repositories.",
            "The Outcome of Knowledge Process for Customer of Jordanian Companies on the Achievement of Customer Knowledge Retention.",
            "Using Knowledge Management to Create Self-Reliant Communities in Thailand.",
            "A Project Staffing Model to Enhance the Effectiveness of Knowledge Transfer in the Requirements Planning Phase for Multi-Project Environments.",
            "Sustaining Organizational Innovativeness: Advancing Knowledge Sharing During the Scenario Process.",
            "A Viewpoint-Based Approach for Understanding the Morphogenesis of Patterns.",
            "Qualitative Analysis of Semantically Enabled Knowledge Management Systems in Agile Software Engineering.",
            "Critical Success Factors and Outcomes of Market Knowledge Management: A Conceptual Model and Empirical Evidence.",
            "Linking Business Strategy and Knowledge Management Capabilities for Organizational Effectiveness.",
            "The Impact of Supporting Organizational Knowledge Management through a Corporate Portal on Employees and Business Processes.",
            "Foot-Printing E-Learners' Activity: A First Step to Help their Appropriation of the Training System?",
            "A Knowledge Framework for Development: Empirical Investigation of 30 Societies.",
            "Exploring the Extent and Impediments of Knowledge Sharing in Chinese Business Enterprise.",
            "Situated Learning and Activity Theory-based Approach to Designing Integrated Knowledge and Learning Management Systems.",
            "Culture and Knowledge Transfer Capacity: A Cross-National Study.",
            "Taking Charities Seriously: A Call for Focused Knowledge Management Research."
        ]
    },
    {
        "name": "IJKM",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 21,
        "papers": [
            "A Model of Interrelationships Among Individual Level Knowledge Management Success Measures.",
            "Using Agent Based Simulation and Game Theory Analysis to Study Knowledge Flow in Organizations: The KMscape.",
            "Organizational Readiness Assessment for Knowledge Management.",
            "Knowledge Management Toolkit for SMEs.",
            "A Framework for Managing the Life Cycle of Knowledge in Organizations.",
            "Social Network Structures for Explicit, Tacit and Potential Knowledge.",
            "A Simulation System for Evaluating Knowledge Management System (KMS)Implementation Strategies in Small to Mid-Size Enterprises (SME).",
            "Perceptions and Knowledge Sharing Practices of Graduate Students in Singapore.",
            "Cocreating Corporate Knowledge with a Wiki.",
            "Reaching for the Moon: Expanding Transactive Memory's Reach with Wikis and Tagging.",
            "Improving Supply Chain Performance through the Implementation of Process Related Knowledge Transfer Mechanisms.",
            "Capturing Tacit Knowledge from Transient Workers: Improving the Organizational Competitiveness.",
            "Organization of Lessons Learned Knowledge: A Taxonomy and Implementation.",
            "Investigating the Impact of Knowledge Management Factors on New Product Development Performance.",
            "Knowledge Strategy and Its Role in the Organization: An Exploratory Study.",
            "Online Knowledge Sharing Among Chinese and American Employees: Explore the Influence of National Cultural Differences.",
            "Utilizing the Rasch Model to Develop and Evaluate Items for the Tacit Knowledge Inventory for Superintendents (TKIS).",
            "Exploring Qualitative Differences in Knowledge Sources: A Study of Hierarchical Effects of Judgmental Confidence and Accuracy Performance.",
            "Information Influence in Mediated Knowledge Transfer: An Experimental Test of Elaboration Likelihood.",
            "Using Corporate Universities to Failitate Knowledge Transfer and Achieve Competitive Advantage: An Exploratory Model Based on Media Richness and Type of Knowledge to be Transferred.",
            "Knowledge Management Awareness and Its Related Operations and Their Impact on Knowledge Management Utilization at Jordanian Universities."
        ]
    },
    {
        "name": "IJKM",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 25,
        "papers": [
            "Organizational Culture for Knowledge Management Systems: A Study of Corporate Users.",
            "Managing Knowledge in Organizational Memory Using Topics Maps1.",
            "Developing and Aligning a Knowledge Management Strategy: Towards a Taxonomy and a Framework.",
            "Challenges in Developing a Knowledge Management Strategy: A Case Study of the Air Force Materiel Command.",
            "Impacts from Using Knowledge: A Longitudinal Study from a Nuclear Power Plant.",
            "Mix, Match, Rediscover: A Mashup Experiment of Knowledge Organization in an Enterprise Environment.",
            "Work Unit's Knowledge Processing Style: An Empirical Examination of its Determinants.",
            "A Comparison and Scenario Analysis of Leading Data Mining Software.",
            "Semantic Search of Unstructured Knowledge using Qualitative Analysis.",
            "Virtual Communities Practice: A Mechanism for Efficient Knowledge Retrieval in MNC's.",
            "Knowledge Transfer: Revisiting Video.",
            "The Dimensions of Tacit & Explicit Knowledge: A Description and Measure.",
            "Common Knowledge Sharing Model of 24-Hour Knowledge Factory of Grid Computing Based on Case Based Reasoning.",
            "Risk Management: Strengthening Knowledge Management.",
            "Applying Sense-Making Methodology to Design Knowledge Management Practices.",
            "Toward a Knowledge Management Strategic Framework in the Arab Region.",
            "Introducing Elasticity for Spatial Knowledge Management.",
            "A Proposed Framework for Designing Sustainable Communities for Knowledge Management Systems.",
            "What is Knowledge Sharing from the Informer's Perspective?",
            "Do Organizational Memory and Information Technology Interact to Affect Organizational Information Needs and Provision?",
            "Validating Distinct Knowledge Assets: A Capability Perspective.",
            "The Role of Situated Embodied Interaction in the Banking Customer Knowledge Creation Process.",
            "Managing Knowledge with Technology: Current Trends in Local Government.",
            "Can Soft Systems Methodology Identify Socio-Technical Barriers to Knowledge Sharing and Management?: A Case Study from the UK National Health Service.",
            "Socio-Technical Knowledge Management: Studies and Initiatives."
        ]
    },
    {
        "name": "IJKM",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 24,
        "papers": [
            "The Ethics of Knowledge Management.",
            "Discontinuity in Organizations: Developing a Knowledge-Based Organizational Performance Model for Discontinuous Membership.",
            "Social Capital and Knowledge Sharing in Knowledge-Based Organizations: An Empirical Study.",
            "The Social Reality of Business Activity: A Contingent Methodology for Knowledge Elicitation and Mapping.",
            "An Empirical Assessment of the Performance Impacts of IS Support for Knowledge Transfer.",
            "Multi-Organizational Networks: Three Antecedents of Knowledge Transfer.",
            "Assessing Knowledge Management: Refining and Cross Validating the Knowledge Management Index Using Structural Equation Modeling Techniques.",
            "An Evaluation of Factors that Influence the Success of Knowledge Management Practices in U.S. Federal Agencies.",
            "Interdepartmental Knowledge Transfer Success During Information Technology Projects.",
            "Improving KMS Acceptance: The Role Of Organizational And Individuals Influence.",
            "Towards an Integrated Model of Knowledge Sharing in Software Development: Insights from a Case Study.",
            "Technology Trends in Knowledge Management tools.",
            "Mapping the Knowledge Management Domain of Ideas: Evidence from a Practice Group.",
            "The Key Requirements for Deploying Knowledge Management Services in a Semantic Grid Environment.",
            "Knowledge Chain Activity Classes: Impacts on Competitiveness and the Importance of Technology Support.",
            "Impact of Chinese Culture Calues on Knowledge Sharing Through Online Communities of Practice.",
            "Tacit Knowledge: Conceptualizations and Operationalizations.",
            "The Quality of Knowledge: Knowledge Patterns and Knowledge Refactorings.",
            "Knowledge Fusion: A Framework for extending the Rigor and Relevance of Knowledge Management.",
            "Information Technology in value shop Activities: An exploratory study of Knowledge Reuse in norwegian Police investigations.",
            "A structurational Analysis of users and Management in a Knowledge Management system Project implementation.",
            "Knowledge Management and organizational Performance in the Egyptian software Firms.",
            "Developing Knowledge Management systems from a Knowledge-Based and Multi-Agent Approach.",
            "Managing Knowledge capabilities for strategy implementation effectiveness."
        ]
    },
    {
        "name": "IJKM",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 20,
        "papers": [
            "Introduction to the Special Issue: An Australian Perspective on Organisational Issues in Knowledge Management.",
            "The Role of Informal Groups in Organisational Knowledge Work: Understanding an Emerging Community of Practice.",
            "Toward a Receiver-Based Theory of Knowledge Sharing.",
            "Integrating Knowledge Management with Programme Management.",
            "Developing and Analyzing Core Competencies for Alignment with Strategy.",
            "A Case-Classification-Conclusion 3Cs Approach to Knowledge Acquisition: Applying a Classification Logic Wiki to the Problem Solving Process.",
            "Comparing Cultural and Political Perspectives of Data, Information, and Knowledge Sharing in Organisations.",
            "Conceptualisation of Cultural Dimensions as a Major Influence on Knowledge Sharing.",
            "KAFRA: A Context-Aware Framework of Knowledge Management in Global Diversity.",
            "System Support for Knowledge Work: Bridging the Knowing-Doing Group.",
            "Center for Army Lessons Learned: Knowledge Application Process in the Military.",
            "Effects of Knowledge Management Implementation in Hospitals: An Exploratory Study in Taiwan.",
            "Think Social Capital Before You Think Knowledge Transfer.",
            "Knowledge Management Systems for Emergency Preparedness: The Claremont University Consortium Experience.",
            "A Model of Knowledge Management Success.",
            "Knowledge Sharing: Effects of Cooperative Type and Reciprocity Level.",
            "A Method for Knowledge Modeling: Application of Unified Modeling Language (UML) to Knowledge Modeling.",
            "Improvement of Software Engineering by Modeling Knowledge-Intensive Business Processes.",
            "Knowledge Management and Hurricane Katrina Response.",
            "Using Social Networking Analysis to Facilitate Knowledge Sharing in the British Council."
        ]
    },
    {
        "name": "IJKM",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 18,
        "papers": [
            "Assessing Knowledge Management System User Acceptance with the Technology Acceptance Model.",
            "Continuum of Context Explication: Knowledge Discovery Through Process-Oriented Portals.",
            "Learning about the Organization via Knowledge Management: The Case of JPL.",
            "The Role of Organizational Trust in Knowledge Management: Tool & Technology Use & Success.",
            "The Emerging Discipline of Knowledge Management.",
            "Knowledge Management at Americas Conference on Information Systems.",
            "Knowledge Management Metrics: A Review and Directions for Future Research.",
            "Assessing Knowledge Management Success.",
            "Outcomes of Knowledge Management Initiatives.",
            "Knowledge Management System Success: Empirical Assessment of a Theoretical Model.",
            "A Qualitative Study of the Characteristics of a Community of Practice for Knowledge Management and Its Success Factors.",
            "A Critical Decision Interview Approach to Capturing Tacit Knowledge: Principles and Application.",
            "Getting Knowledge Management Right: Lessons from Failure.",
            "Knowledge Management and the Leading Information Systems Journals: An Analysis of Trends and Gaps in Published Research.",
            "Performance Implications of the Knowledge Chain.",
            "Enhancing Performance Through Knowledge Management: A Holistic Framework.",
            "Knowledge Acquisitions and Transfer in Egyptian Software Firms.",
            "Fostering Innovation Through Knowledge-Centered Principles: A Case Analysis of Singapore Airlines."
        ]
    }
]