[
    {
        "name": "IJSWIS",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 22,
        "papers": [
            "CISMET: A Semantic Ontology Framework for Regulatory-Requirements-Compliant Information Systems Development and Its Application in the GDPR Case.",
            "Hybrid Query Execution on Linked Data With Complete Results.",
            "Interactive E-Textbook Platform Based on Block Editing Model in Crowdsourcing E-Learning Environments.",
            "Rethinking the Development of Technology-Enhanced Learning and the Role of Cognitive Computing.",
            "Learning Non-Taxonomic Relations of Ontologies: A Systematic Review.",
            "Coronavirus Pandemic (COVID-19): Emotional Toll Analysis on Twitter.",
            "Optimal User Association of LTE/Wi-Fi/Wi-Gig Bands in 5G Cellular Networks.",
            "Distributed Frequent Subgraph Mining Using Gaston and MapReduce.",
            "Classification of Code-Mixed Bilingual Phonetic Text Using Sentiment Analysis.",
            "An Ontology-Based Information Extraction System for Organic Farming.",
            "A Personalized Approach to Course Recommendation in Higher Education.",
            "Blog Backlinks Malicious Domain Name Detection via Supervised Learning.",
            "Prospecting the Effect of Topic Modeling in Information Retrieval.",
            "Government Services Bus (GSB): Opportunity to Improve the Quality of Data Entry.",
            "Certain and Uncertain Temporal Data Representation and Reasoning in OWL 2.",
            "A Semantic-Embedding Model-Driven Seq2Seq Method for Domain-Oriented Entity Linking on Resource-Restricted Devices.",
            "Building the Semantic Layer of the Józef Piłsudski Digital Archive With an Ontology-Based Approach.",
            "Discovering Curriculum Components for a New Product Development Course: A Latent Semantic Approach.",
            "Enhanced Learning Experiences Based on Regulatory Fit Theory Using Affective State Detection.",
            "Inconsistency Detection-Based LOD in Smart Homes.",
            "Provably Secure Data Sharing Approach for Personal Health Records in Cloud Storage Using Session Password, Data Access Key, and Circular Interpolation.",
            "Ranked Deep Web Page Detection Using Reinforcement Learning and Query Optimization."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 26,
        "papers": [
            "An Architecture for Restful Web Service Discovery Using Semantic Interfaces.",
            "A Status Property Classifier of Social Media User's Personality for Customer-Oriented Intelligent Marketing Systems: Intelligent-Based Marketing Activities.",
            "A Survey of Ontology Benchmarks for Semantic Web Ontology Tools.",
            "Internet Data Analysis Methodology for Cyberterrorism Vocabulary Detection, Combining Techniques of Big Data Analytics, NLP and Semantic Web.",
            "A Tool for Transforming Semantic Web Rule Language to SPARQL Infererecing Notation.",
            "Hybrid Approach for Sentiment Analysis of Twitter Posts Using a Dictionary-based Approach and Fuzzy Logic Methods: Study Case on Cloud Service Providers.",
            "Information Systems Workforce and Innovative Work Behavior: The Role of Participatory Management, Affective Trust and Guanxi.",
            "Distant Supervised Relation Extraction via DiSAN-2CNN on a Feature Level.",
            "Two Ways for the Automatic Generation of Application Ontologies by Using BalkaNet.",
            "Web Mining Customer Perceptions to Define Product Positions and Design Preferences.",
            "Combining Linked Open Data Similarity and Relatedness for Cross OSN Recommendation.",
            "Context-Aware Personalized Web Search Using Navigation History.",
            "Multi-Intentional Description of Learning Semantic Web Services.",
            "Efficient Weighted Semantic Score Based on the Huffman Coding Algorithm and Knowledge Bases for Word Sequences Embedding.",
            "LinkZoo: A Collaborative Resource Management Tool Based on Linked Data.",
            "Secure Timestamp-Based Mutual Authentication Protocol for IoT Devices Using RFID Tags.",
            "The Effect of Gender, Age, and Education on the Adoption of Mobile Government Services.",
            "Applications, Methodologies, and Technologies for Linked Open Data: A Systematic Literature Review.",
            "Advanced Learning Analytics in Academic Education: Academic Performance Forecasting Based on an Artificial Neural Network.",
            "Research Synthesis and Thematic Analysis of Twitter Through Bibliometric Analysis.",
            "CustNER: A Rule-Based Named-Entity Recognizer With Improved Recall.",
            "Integration of Semantics Into Sensor Data for the IoT: A Systematic Literature Review.",
            "An Intelligent Web Caching System for Improving the Performance of a Web-Based Information Retrieval System.",
            "Concept Map Information Content Enhancement Using Joint Word Embedding and Latent Document Structure.",
            "Intelligent Extraction of a Knowledge Ontology From Global Patents: The Case of Smart Retailing Technology Mining.",
            "Tag's Depth-Based Expert Profiling Using a Topic Modeling Technique."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 20,
        "papers": [
            "OnGIS: Geospatial Data Integration Using Semantic Technologies and Query Containment.",
            "Automatic Construction of OWL Ontologies From Petri Nets.",
            "Based on The Document-Link and Time-Clue Relationships Between Blog Posts to Improve the Performance of Google Blog Search.",
            "A Preventive Approach for Consistent OWL 2 DL Ontology Versions.",
            "Ontology-Based Modeling of Effect-Based Knowledge in Disaster Response.",
            "Bootstrapping of Semantic Relation Extraction for a Morphologically Rich Language: Semi-Supervised Learning of Semantic Relations.",
            "A Real-Time Twitter Trend Analysis and Visualization Framework.",
            "Language-Independent Type Inference of the Instances from Multilingual Wikipedia.",
            "An Integrated Recommender System Using Semantic Web With Social Tagging System.",
            "Deriving Competitive Foresight Using an Ontology-Based Patent Roadmap and Valuation Analysis.",
            "Exposing Social Data as Linked Data in Education.",
            "Contextual Determinants of E-Entrepreneurship: Opportunities and Challenges.",
            "Enhancing Consumers' Stickiness to Online Brand Communities as an Innovative Relationship Marketing Strategy.",
            "Social Presence and User-Generated Content of Social Media in China.",
            "Coupling Coordination of Internet Development, Technology Innovation and Star Hotel Efficiency.",
            "Fuzzy Probabilistic Ontology Approach: A Hybrid Model for Handling Uncertain Knowledge in Ontologies.",
            "Entrepreneurship in the Internet Age: Internet, Entrepreneurs, and Capital Resources.",
            "Geospatial Semantic Query Engine for Urban Spatial Data Infrastructure.",
            "Web Observatory Insights: Past, Current, and Future.",
            "A Parallel Neural Network Approach for Faster Rumor Identification in Online Social Networks."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 31,
        "papers": [
            "Predicting Reasoner Performance on ABox Intensive OWL 2 EL Ontologies.",
            "Property Clustering in Linked Data: An Empirical Study and Its Application to Entity Browsing.",
            "Multi-Target Search on Semantic Associations in Linked Data.",
            "On Evaluating Web-Scale Extracted Knowledge Bases in a Comparative Way.",
            "PROSE: A Plugin-Based Framework for Paraconsistent Reasoning on Semantic Web.",
            "RIKEN MetaDatabase: A Database Platform for Health Care and Life Sciences as a Microcosm of Linked Open Data Cloud.",
            "Rapid Relevance Feedback Strategy Based on Distributed CBIR System.",
            "Using the Linked Data Approach in European e-Government Systems: Example from Serbia.",
            "N-Dimensional Matrix-Based Ontology: A Novel Model to Represent Ontologies.",
            "On the Graph Structure of the Web of Data.",
            "Named Data Networking: A Promising Architecture for the Internet of Things (IoT).",
            "Time-Based Web Service Composition.",
            "Study on Ontology Ranking Models Based on the Ensemble Learning.",
            "Managing QoS Degradation of Component Web Services in a Dynamic Environment.",
            "Ontology Driven Cross-Linked Domain Data Integration and Spatial Semantic Multi Criteria Query System for Geospatial Public Health.",
            "Web-Based Collaborative Systems and Harvesting the Collective Intelligence in Business Organizations.",
            "Latent Dirichlet Allocation and POS Tags Based Method for External Plagiarism Detection: LDA and POS Tags Based Plagiarism Detection.",
            "Dynamic Search Engine Platform for Cloud Service Level Agreements Using Semantic Annotation.",
            "Semantic Search Exploiting Formal Concept Analysis, Rough Sets, and Wikipedia.",
            "Detecting Human Diseases Relatedness: A Spreading Activation Approach Over Ontologies.",
            "Genetic-Fuzzy Programming Based Linkage Rule Miner (GFPLR-Miner) for Entity Linking in Semantic Web.",
            "Marefa: Turning Publishers Catalogs' Data Into Linked Data.",
            "Venue-Influence Language Models for Expert Finding in Bibliometric Networks.",
            "A New LSA and Entropy-Based Approach for Automatic Text Document Summarization.",
            "Ontology With Hybrid Clustering Approach for Improving the Retrieval Relevancy in Social Event Detection.",
            "Semantic Web Services Discovery: A Survey and Research Challenges.",
            "A Multi-Feature Based Automatic Approach to Geospatial Record Linking.",
            "A Fuzzy Logic Based Synonym Resolution Approach for Automated Information Retrieval.",
            "On the Current State of Linked Open Data: Issues, Challenges, and Future Directions.",
            "A User-Aware and Semantic Approach for Enterprise Search.",
            "Using Semantic Web for Internet of Things Interoperability: A Systematic Review."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2017",
        "info": "Volume 13: 2017",
        "count": 31,
        "papers": [
            "Big Data and Data Analytics Research: From Metaphors to Value Space for Collective Wisdom in Human Decision Making and Smart Machines.",
            "Modelling Propagation of Public Opinions on Microblogging Big Data Using Sentiment Analysis and Compartmental Models.",
            "IoT-Based Big Data: From Smart City towards Next Generation Super City Planning.",
            "Finding Healthcare Issues with Search Engine Queries and Social Network Data.",
            "Harnessing Semantic Features for Large-Scale Content-Based Hashtag Recommendations on Microblogging Platforms.",
            "Automatic Schema-Independent Linked Data Instance Matching System.",
            "Multi-Version Ontology-Based Personalization of Clinical Guidelines for Patient-Centric Healthcare.",
            "SPedia: A Central Hub for the Linked Open Data of Scientific Publications.",
            "Enabling Interoperability in the Internet of Things: A OSGi Semantic Information Broker Implementation.",
            "Subjective Text Mining for Arabic Social Media.",
            "Reliable and Energy Efficient Routing Protocol for Under Water Sensor Networks.",
            "A Novel Query-Driven Clustering-Based Technique for Vertical Fragmentation and Allocation in Distributed Database Systems.",
            "BCWB: A P300 Brain-Controlled Web Browser.",
            "Transaction Dependency Based Approach for Database Damage Assessment Using a Matrix.",
            "CommuniMents: A Framework for Detecting Community Based Sentiments for Events.",
            "Matching and Ranking Trustworthy Context-Dependent Universities: A Case Study of the King Abdullah Scholarship Program.",
            "SEMDPA: A Semantic Web Crossroad Architecture for WSNs in the Internet of Things.",
            "An Efficient Intrusion Detection System for Selective Forwarding and Clone Attackers in IPv6-based Wireless Sensor Networks under Mobility.",
            "Context-Aware Broadcast in Duty-Cycled Wireless Sensor Networks.",
            "Low Cost Recursive Localization scheme for High Density Wireless Sensor Networks.",
            "An Adaptive and Hotspot Aware Taxi Zone Queuing System on Internet of Vehicles.",
            "Ontology Cohesion and Coupling Metrics.",
            "Extracting Top-k Company Acquisition Relations From the Web.",
            "MERA: A Musical Entities Reconciliation Architecture Based on Semantic Technologies.",
            "The Use of Software Tools in Linked Data Publication and Consumption: A Systematic Literature Review.",
            "Sarcastic Sentiment Detection Based on Types of Sarcasm Occurring in Twitter Data.",
            "Semantic Extension of Query for the Linked Data.",
            "Allied: A Framework for Executing Linked Data-Based Recommendation Algorithms.",
            "Social Semantic Search: A Case Study on Web 2.0 for Science.",
            "An Adapted Ant-Inspired Algorithm for Enhancing Web Service Composition.",
            "Efficient String Matching Algorithm for Searching Large DNA and Binary Texts."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 17,
        "papers": [
            "Semantic Web and Geospatial Unique Features Based Geospatial Data Integration.",
            "Discovery Mechanism for Learning Semantic Web Service.",
            "Geocoding Tweets Approach Based on Conceptual Representations in the Context of the Knowledge Society.",
            "Using a Dialogue Manager to Improve Semantic Web Search.",
            "SEMCON: A Semantic and Contextual Objective Metric for Enriching Domain Ontology Concepts.",
            "Bayes-ReCCE: A Bayesian Model for Detecting Restriction Class Correspondences in Linked Open Data Knowledge Bases.",
            "Satellite Parametric Description to Ontology Concepts and Semantic Classification of Satellite Data.",
            "Abstractive Summarization: A Hybrid Approach for the Compression of Semantic Graphs.",
            "Ontology-Driven Interactive Visualization of Film Production Complexity Using a Visual Language.",
            "Selectivity-Based Keyword Extraction Method.",
            "Quantifying the Connectivity of a Semantic Warehouse and Understanding its Evolution over Time.",
            "Hypermedia-Based Discovery for Source Selection Using Low-Cost Linked Data Interfaces.",
            "Towards An Objective Assessment Framework for Linked Data Quality: Enriching Dataset Profiles with Quality Indicators.",
            "SPORTAL: Profiling the Content of Public SPARQL Endpoints.",
            "Enabling RDF Stream Processing for Sensor Data Management in the Environmental Domain.",
            "Managing Large Amounts of Data Generated by a Smart City Internet of Things Deployment.",
            "QoS-Aware Stream Federation and Optimization Based on Service Composition."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2015",
        "info": "Volume 11: 2015",
        "count": 12,
        "papers": [
            "Template Based Semantic Integration: From Legacy Archaeological Datasets to Linked Data.",
            "PatchR: A Framework for Linked Data Change Requests.",
            "Complex Role Inclusions with Role Chains on the Right are Expressible in SROIQ.",
            "The KnowledgeStore: A Storage Framework for Interlinking Unstructured and Structured Knowledge.",
            "The Graph Signature: A Scalable Query Optimization Index for RDF Graph Databases Using Bisimulation and Trace Equivalence Summarization.",
            "Towards Linked Open Business Registers: The Application of the Registered Organization Vocabulary in Greece.",
            "A Hybrid Framework for Semantic Relation Extraction over Enterprise Data.",
            "A New Instance-Based Approach for Ontology Alignment.",
            "Incremental Ontology Population and Enrichment through Semantic-based Text Mining: An Application for IT Audit Domain.",
            "Property-based Semantic Similarity and Relatedness for Improving Recommendation Accuracy and Diversity.",
            "An Evaluation of Ontology Based Domain Analysis for Model Driven Development.",
            "Semantic Network Formalism for Knowledge Representation: Towards Consideration of Contextual Information."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2014",
        "info": "Volume 10: 2014",
        "count": 14,
        "papers": [
            "Nesting Strategies for Enabling Nimble MapReduce Dataflows for Large RDF Data.",
            "Pattern Based Feature Construction in Semantic Data Mining.",
            "Ubiquitous Semantic Applications: A Systematic Literature Review.",
            "Web Data Quality: Current State and New Challenges.",
            "OOPS! (OntOlogy Pitfall Scanner!): An On-line Tool for Ontology Evaluation.",
            "Improving Curated Web-Data Quality with Structured Harvesting and Assessment.",
            "Improving the Quality of Linked Data Using Statistical Distributions.",
            "Answering Continuous Description Logic Queries: Managing Static and Volatile Knowledge in Ontologies.",
            "Enhancing Visibility in EPCIS Governing Agri-Food Supply Chains via Linked Pedigrees.",
            "The Role of Ontology Engineering in Linked Data Publishing and Management: An Empirical Study.",
            "The Ubiquitous Semantic Web: Promises, Progress and Challenges.",
            "RSP-QL Semantics: A Unifying Query Model to Explain Heterogeneity of RDF Stream Processing Systems.",
            "Context-Aware Presentation of Linked Data on Mobile.",
            "A Mobile Matchmaker for the Ubiquitous Semantic Web."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 15,
        "papers": [
            "From Overview to Facets and Pivoting for Interactive Exploration of Semantic Web Data.",
            "Tools for the Automatic Generation of Ontology Documentation: A Task-Based Evaluation.",
            "PragmatiX: An Interactive Tool for Visualizing the Creation Process Behind Collaboratively Engineered Ontologies.",
            "Folksonomy-Based Tag Recommendation for Collaborative Tagging Systems.",
            "Dynamic Linking and Personalization on the Web using Linked Open Data.",
            "A Software Modeling Approach to Ontology Design via Extensions to ODM and OWL.",
            "Semantic Characterization of Tweets Using Topic Models: A Use Case in the Entertainment Domain.",
            "Crowdsourced Knowledge Acquisition: Towards Hybrid-Genre Workflows.",
            "\"Katie's Swiss Trip\": A Study of Personal Event Models for Photo Sharing.",
            "Opinion Bias Detection with Social Preference Learning in Social Data.",
            "Discovering and Characterizing Places of Interest Using Flickr and Twitter.",
            "Improving Wiki Article Quality Through Crowd Coordination: A Resource Allocation Approach.",
            "LinkedVis an Information Visualisation Toolkit for RDF Data.",
            "Visualizing Populated Ontologies with OntoTrix.",
            "Computing Semantic Relatedness from Human Navigational Paths: A Case Study on Wikipedia."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 16,
        "papers": [
            "Semantics for the Internet of Things: Early Progress and Back to the Future.",
            "A Core Ontological Model for Semantic Sensor Web Infrastructures.",
            "Enabling Query Technologies for the Semantic Sensor Web.",
            "An Architecture for Managing Knowledge and System Dynamism in the Worldwide Sensor Web.",
            "Towards Practical ABox Abduction in Large Description Logic Ontologies.",
            "A New Model to Compute the Information Content of Concepts from Taxonomic Knowledge.",
            "Adding Semantic Annotations into (Geospatial) RESTful Services.",
            "Towards Large-Scale Unsupervised Relation Extraction from the Web.",
            "Enabling Folksonomies for Knowledge Extraction: A Semantic Grounding Approach.",
            "Elementary: Large-Scale Knowledge-Base Construction via Machine Learning and Statistical Inference.",
            "Predicting Lexical Answer Types in Open Domain QA.",
            "Learning to Rank Complex Semantic Relationships.",
            "Modeling Indirect Influence on Twitter.",
            "Diversifying Search Results through Pattern-Based Subtopic Modeling.",
            "Expressive OWL Queries: Design, Evaluation, Visualization.",
            "Adimen-SUMO: Reengineering an Ontology for First-Order Reasoning."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 12,
        "papers": [
            "Numeric Query Answering on the Web.",
            "A Modal Defeasible Reasoner of Deontic Logic for the Semantic Web.",
            "An Enhanced Semantic Layer for Hybrid Recommender Systems: Application to News Recommendation.",
            "Semi-Automatic Ontology Construction by Exploiting Functional Dependencies and Association Rules.",
            "Concept Induction in Description Logics Using Information-Theoretic Heuristics.",
            "Using Similarity-Based Approaches for Continuous Ontology Development.",
            "AL-QuIn: An Onto-Relational Learning System for Semantic Web Mining.",
            "Semantics Discovery via Human Computation Games.",
            "Data Linking for the Semantic Web.",
            "ACRONYM: Context Metrics for Linking People to User-Generated Media Content.",
            "Online Semantic Knowledge Management for Product Design Based on Product Engineering Ontologies.",
            "A Theory of Social Agentivity and its Integration into the Descriptive Ontology for Linguistic and Cognitive Engineering."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2010",
        "info": "Volume 6: 2010",
        "count": 12,
        "papers": [
            "Integrating Interactive TV Services and the Web through Semantics.",
            "Enhancing Folksonomy-Based Content Retrieval with Semantic Web Technology.",
            "An Ontology-Based, Cross-Application Context Modeling and Management Service.",
            "Music Retrieval and Recommendation Scheme Based on Varying Mood Sequences.",
            "Semantic Search on Unstructured Data: Explicit Knowledge through Data Recycling.",
            "Ontology-Enhanced User Interfaces: A Survey.",
            "Files are Siles: Extending File Systems with Semantic Annotations.",
            "Building Chemical Ontology for Semantic Web Using Substructures Created by Chem-BLAST.",
            "A Tool Suite to Enable Web Designers, Web Application Developers and End-users to Handle Semantic Data1.",
            "Adaptive Hybrid Semantic Selection of SAWSDL Services with SAWSDL-MX2.",
            "A Pattern-Based Method for Re-Engineering Non-Ontological Resources into Ontologies.",
            "Towards Controlled Natural Language for Semantic Annotation."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 14,
        "papers": [
            "Solving Semantic Interoperability Conflicts in Cross-Border E-Government Services.",
            "A New Similarity Measure for Automatic Construction of the Unknown Word Lexical Dictionary.",
            "Extracting Concepts' Relations and Users' Preferences for Personalizing Query Disambiguation.",
            "The Berlin SPARQL Benchmark.",
            "Learning of OWL Class Descriptions on Very Large Knowledge Bases.",
            "Scalable Authoritative OWL Reasoning for the Web.",
            "Enabling Scalable Semantic Reasoning for Mobile Services.",
            "Linked Data - The Story So Far.",
            "Community-Driven Linked Data Authoring and Production of Consolidated Linked Data.",
            "Searching Linked Objects with Falcons: Approach, Implementation and Evaluation.",
            "A URI is Worth a Thousand Tags: From Tagging to Linked Data with MOAT.",
            "An Idea Ontology for Innovation Management.",
            "Inductive Classification of Semantically Annotated Resources through Reduced Coulomb Energy Networks.",
            "A Comparison of Corpus-Based and Structural Methods on Approximation of Semantic Relatedness in Ontologies."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 14,
        "papers": [
            "Semantic Web Services and Mobile Agents Integration for Efficient Mobile Services.",
            "Mobile Ontologies: Concept, Development, Usage, and Business Potential.",
            "Bringing Semantic Services to Real-World Objects.",
            "Semantic-Based Bluetooth-RFID Interaction for Advanced Resource Discovery in Pervasive Contexts.",
            "In Defense of Ambiguity.",
            "Ontological Indeterminacy and the Semantic Web.",
            "Identity of Resources and Entities on the Web.",
            "A Fuzzy Ontology Generation Framework from Fuzzy Relational Databases.",
            "Ontology Enhanced Concept Hierarchies for Text Identification.",
            "Evolutionary Conceptual Clustering Based on Induced Pseudo-Metrics.",
            "Tightly Coupled Fuzzy Description Logic Programs under the Answer Set Semantics for the Semantic Web.",
            "Efficient Processing of RDF Queries with Nested Optional Graph Patterns in an RDBMS.",
            "On the Evaluation of Semantic Web Service Frameworks.",
            "A Network Model Approach to Retrieval in the Semantic Web."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 15,
        "papers": [
            "Ontology of Folksonomy: A Mash-Up of Apples and Oranges.",
            "Exploring the Value of Folksonomies for Creating Semantic Metadata.",
            "Trust Metrics on Controversial Users: Balancing Between Tyranny of the Majority.",
            "GlobalMind: Automated Analysis of Cultural Contexts with Multicultural.",
            "Experience in Aligning Anatomical Ontologies.",
            "Association Rule Ontology Matching Approach.",
            "A Formal Foundation for Ontology-Alignment Interaction Models.",
            "An Ontology-Based Data Mediation Framework for Semantic Environments.",
            "Automatically Integrating Heterogeneous Ontologies from Structured Web Pages.",
            "Dynamic, Automatic, First-Order Ontology repair by Diagnosis of Failed Plan Execution.",
            "Semantic Labeling of Online Information Sources.",
            "An Incremental Method for the Lexical Annotation of Domain Ontologies.",
            "Ontology-Based Conceptual Design of ETL Processes for Both Structured and Semi-Structured Data.",
            "Ontologies with Semantic Web/Grid in Data Integration for OLAP.",
            "Using a Natural Language Understanding System to Generate Semantic Web Content."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 13,
        "papers": [
            "A Defeasible Logic Reasoner for the Semantic Web.",
            "Unraveling the Taste Fabric of Social Networks.",
            "Products and Services Ontologies: A Methodology for Deriving OWL Ontologies from Industrial Categorization Standards.",
            "Events in Multimedia Electronic Chronicles (E-Chronicles).",
            "R-DEVICE: An Object-Oriented Knowledge Base for RDF Metadata.",
            "Ontology-Based Automatic Annotation of Learning Content.",
            "OntoMedia Semantic Multimedia Metadata Integration and Organization.",
            "Knowledge-Assisted Image Analysis Based on Context and Spatial Optimization.",
            "S-IRAS: An Interactive Semantic Image Retrieval and Annotation System.",
            "Information Retrieval by Semantic Similarity.",
            "SemDiff: An Approach to Detecting Semantic Changes to Ontologies.",
            "Semantic Enrichment in Ontologies for Matching.",
            "Mediating RDF/S Queries to Relational and XML Sources."
        ]
    },
    {
        "name": "IJSWIS",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 10,
        "papers": [
            "Semantics for the Semantic Web: The Implicit, the Formal and the Powerful.",
            "Semantic eBusiness.",
            "A Tool for Working with Web Ontologies.",
            "An Ontology-Based Multimedia Annotator for the Semantic Web of Language Engineering.",
            "Querying the Web Reconsidered: Design Principles for Versatile Web Query Languages.",
            "A Layered Model for Building Ontology Translation Systems.",
            "A Survey on Ontology Creation Methodologies.",
            "The Human Semantic Web Shifting from Knowledge Push to Knowledge Pull.",
            "General Adaption Framework.",
            "A Context-Based Approach for Supporting Knowledge Work with Semantic Portals."
        ]
    }
]