[
    {
        "name": "IR",
        "year": "2022",
        "info": "Volume 25: 2022",
        "count": 3,
        "papers": [
            "Search results diversification for effective fair ranking in academic search.",
            "Efficient query processing techniques for next-page retrieval.",
            "Kernel density estimation based factored relevance model for multi-contextual point-of-interest recommendation."
        ]
    },
    {
        "name": "IR",
        "year": "2021",
        "info": "Volume 24: 2021",
        "count": 16,
        "papers": [
            "Guest editorial: special issue on ECIR 2020.",
            "A comparison of automatic Boolean query formulation for systematic reviews.",
            "Improving question answering for event-focused questions in temporal collections of news articles.",
            "Review helpfulness evaluation and recommendation based on an attention model of customer expectation.",
            "Evaluation metrics for measuring bias in search engine results.",
            "LSH kNN graph for diffusion on image retrieval.",
            "Structural textile pattern recognition and processing based on hypergraphs.",
            "Improved reviewer assignment based on both word and semantic features.",
            "Algorithmic copywriting: automated generation of health-related advertisements to improve their performance.",
            "Topic-independent modeling of user knowledge in informational search sessions.",
            "Pseudo relevance feedback optimization.",
            "Using word semantic concepts for plagiarism detection in text documents.",
            "Strong natural language query generation.",
            "Variational Bayesian representation learning for grocery recommendation.",
            "Combining semi-supervised and active learning to rank algorithms: application to Document Retrieval.",
            "Neural ranking models for document retrieval."
        ]
    },
    {
        "name": "IR",
        "year": "2020",
        "info": "Volume 23: 2020",
        "count": 23,
        "papers": [
            "Evaluating sentence-level relevance feedback for high-recall information retrieval.",
            "ReBoost: a retrieval-boosted sequence-to-sequence model for neural response generation.",
            "Fewer topics? A million topics? Both?! On topics subsets in test collections.",
            "Low-cost, bottom-up measures for evaluating search result diversification.",
            "Introduction to special issue on eCommerce search and recommendation.",
            "Informational, transactional, and navigational need of information: relevance of search intention in search engine advertising.",
            "Deep cross-platform product matching in e-commerce.",
            "A passage-based approach to learning to rank documents.",
            "Axiomatic thinking for information retrieval: introduction to special issue.",
            "An axiomatic approach to corpus-based cross-language information retrieval.",
            "On the foundations of similarity in information access.",
            "Evaluation measures for quantification: an axiomatic approach.",
            "How do interval scales help us with better understanding IR evaluation measures?",
            "On the nature of information access evaluation metrics: a unifying framework.",
            "Offline evaluation options for recommender systems.",
            "Assessing ranking metrics in top-N recommendation.",
            "Employing neighborhood reduction for alleviating sparsity and cold start problems in user-based collaborative filtering.",
            "Foreword to the special issue on mining actionable insights from online user generated content.",
            "Sharing emotions: determining films' evoked emotional experience from their online reviews.",
            "Robust keyword search in large attributed graphs.",
            "Special issue on learning from user interactions.",
            "Boosting learning to rank with user dynamics and continuation methods.",
            "Preference-based interactive multi-document summarisation."
        ]
    },
    {
        "name": "IR",
        "year": "2019",
        "info": "Volume 22: 2019",
        "count": 24,
        "papers": [
            "Guest editorial: social media for personalization and search.",
            "A topic recommender for journalists.",
            "Influence me! Predicting links to influential users.",
            "Predicting trading interactions in an online marketplace through location-based and online social networks.",
            "User interest prediction over future unobserved topics on social networks.",
            "Determining the interests of social media users: two approaches.",
            "Those were the days: learning to rank social media posts for reminiscence.",
            "Search bias quantification: investigating political bias in social media and web search.",
            "Special issue on knowledge graphs and semantics in text analysis and retrieval.",
            "Neural variational entity set expansion for automatically populated knowledge graphs.",
            "Automated assessment of knowledge hierarchy evolution: comparing directed acyclic graphs.",
            "Identifying and exploiting target entity type information for ad hoc entity retrieval.",
            "Neural architecture for question answering using a knowledge graph and web corpus.",
            "Payoffs and pitfalls in using knowledge-bases for consumer health search.",
            "Overcoming low-utility facets for complex answer retrieval.",
            "Special issue on de-personalisation, diversification, filter bubbles and search.",
            "The impact of result diversification on search behaviour and performance.",
            "Optimizing the recency-relevance-diversity trade-offs in non-personalized news recommendations.",
            "On the impact of group size on collaborative search effectiveness.",
            "Abstraction of query auto completion logs for anonymity-preserving analysis.",
            "Beyond word embeddings: learning entity and concept representations from large scale knowledge bases.",
            "A selective approach to index term weighting for robust information retrieval based on the frequency distributions of query terms.",
            "Demographic differences in search engine use with implications for cohort selection.",
            "A comparison of filtering evaluation metrics based on formal constraints."
        ]
    },
    {
        "name": "IR",
        "year": "2018",
        "info": "Volume 21: 2018",
        "count": 20,
        "papers": [
            "Retrieving and classifying instances of source code plagiarism.",
            "Machine learning techniques for XML (co-)clustering by structure-constrained phrases.",
            "Session search modeling by partially observable Markov decision process.",
            "A study of untrained models for multimodal information retrieval.",
            "Neural information retrieval: introduction to the special issue.",
            "Neural information retrieval: at the end of the early years.",
            "Using word embeddings in Twitter election classification.",
            "Picture it in your mind: generating high level visual representations from textual descriptions.",
            "Sequence-based context-aware music recommendation.",
            "Website replica detection with distant supervision.",
            "Clustering small-sized collections of short texts.",
            "EveTAR: building a large-scale multi-task test collection over Arabic tweets.",
            "Hybrid query expansion model for text and microblog information retrieval.",
            "A language model-based framework for multi-publisher content-based recommender systems.",
            "An artist ranking system based on social media mining.",
            "A non-parametric topical relevance model.",
            "Linear feature extraction for ranking.",
            "An analysis of evaluation campaigns in ad-hoc medical information retrieval: CLEF eHealth 2013 and 2014.",
            "(CF)2 architecture: contextual collaborative filtering.",
            "A systematic approach to normalization in probabilistic models."
        ]
    },
    {
        "name": "IR",
        "year": "2017",
        "info": "Volume 20: 2017",
        "count": 26,
        "papers": [
            "Constructing click models for search users.",
            "Modeling users' search sessions for high utility query recommendation.",
            "Decoding multi-click search behavior based on marginal utility.",
            "Enhancing click models with mouse movement information.",
            "Which used product is more sellable? A time-aware approach.",
            "Neural Semantic Personalized Ranking for item cold-start recommendation.",
            "Utilizing dependency relationships between math expressions in math IR.",
            "Efficiency in information retrieval: introduction to special issue.",
            "Performance improvements for search systems using an integrated cache of lists + intersections.",
            "The role of index compression in score-at-a-time query evaluation.",
            "Efficient distributed selective search.",
            "Document retrieval on repetitive string collections.",
            "Waves: a fast multi-tier top-k query processing algorithm.",
            "Collaborator recommendation in heterogeneous bibliographic networks using random walks.",
            "Validating simulated interaction for retrieval evaluation.",
            "Identifying top relevant dates for implicit time sensitive queries.",
            "Introduction to the special issue on search as learning.",
            "There's a creepy guy on the other end at Google!: engaging middle school students in a drawing activity to elicit their mental models of Google.",
            "Personalized Information Seeking Assistant (PiSA): from programming information seeking to learning.",
            "The role of domain knowledge in cognitive modeling of information search.",
            "The orchestration of a collaborative information seeking learning task.",
            "Optimizing search results for human learning goals.",
            "Online searching and learning: YUM and other search tools for children and teachers.",
            "A unified score propagation model for web spam demotion algorithm.",
            "Product review summarization through question retrieval and diversification.",
            "Statistical biases in Information Retrieval metrics for recommender systems."
        ]
    },
    {
        "name": "IR",
        "year": "2016",
        "info": "Volume 19: 2016",
        "count": 22,
        "papers": [
            "Medical information retrieval: introduction to the special issue.",
            "Information retrieval as semantic inference: a Graph Inference model applied to medical search.",
            "Retrieval, visualization, and mining of large radiation dosage data.",
            "Biomedical term extraction: overview and a new methodology.",
            "Evaluating multimodal relevance feedback techniques for medical image retrieval.",
            "State-of-the-art in biomedical literature retrieval for clinical cases: a survey of the TREC 2014 CDS track.",
            "Enhancing web search in the medical domain via query clarification.",
            "Methods for linking EHR notes to education materials.",
            "How users search and what they search for in the medical domain - Understanding laypeople and experts through query logs.",
            "Information retrieval evaluation using test collections.",
            "The strange case of reproducibility versus representativeness in contextual suggestion test collections.",
            "Topic set size design.",
            "Predicting relevance based on assessor disagreement: analysis and practical applications for search evaluation.",
            "Test collection reliability: a study of bias and robustness to statistical assumptions via stochastic simulation.",
            "Assessing efficiency-effectiveness tradeoffs in multi-stage retrieval systems without using relevance judgments.",
            "Mining unstructured content for recommender systems: an ensemble approach.",
            "The effect of pooling and evaluation depth on IR metrics.",
            "Beyond entities: promoting explorative search with bundles.",
            "Towards a probabilistic model for supporting collaborative information access.",
            "Evaluation and analysis of term scoring methods for term extraction.",
            "Detecting shilling attacks in private environments.",
            "Enhancing web search with queries of equivalent intents."
        ]
    },
    {
        "name": "IR",
        "year": "2015",
        "info": "Volume 18: 2015",
        "count": 21,
        "papers": [
            "Group topic model: organizing topics into groups.",
            "A new approach to query segmentation for relevance ranking in web search.",
            "MDPV: metric distance permutation vocabulary.",
            "A genetic programming framework to schedule webpage updates.",
            "Improving daily deals recommendation using explore-then-exploit strategies.",
            "Active learning for ranking with sample density.",
            "A term-based methodology for query reformulation understanding.",
            "An effective Web page recommender using binary data clustering.",
            "Which noise affects algorithm robustness for learning to rank.",
            "Multilingual information retrieval in the language modeling framework.",
            "Supervised topic models with word order structure for document classification and retrieval learning.",
            "Versatile Query Scrambling for Private Web Search.",
            "Negative query generation: bridging the gap between query likelihood retrieval models and relevance.",
            "Dynamic author name disambiguation for growing digital libraries.",
            "Mining document, concept, and term associations for effective biomedical retrieval: introducing MeSH-enhanced retrieval models.",
            "Pooling-based continuous evaluation of information retrieval systems.",
            "Latent entity space: a novel retrieval approach for entity-bearing queries.",
            "Mining and ranking users' intents behind queries.",
            "OpinoFetch: a practical and efficient approach to collecting opinions on arbitrary entities.",
            "Multilayer source selection as a tool for supporting patent search and classification.",
            "Opinions matter: a general approach to user profile modeling for contextual suggestion."
        ]
    },
    {
        "name": "IR",
        "year": "2014",
        "info": "Volume 17: 2014",
        "count": 23,
        "papers": [
            "Improving ranking performance with cost-sensitive ordinal classification via regression.",
            "Latent word context model for information retrieval.",
            "Leveraging integrated information to extract query subtopics for search result diversification.",
            "Using temporal bursts for query modeling.",
            "Learning music similarity from relative user ratings.",
            "Defending recommender systems by influence analysis.",
            "A nonparametric term weighting method for information retrieval based on measuring the divergence from independence.",
            "Probabilistic models in IR and their relationships.",
            "Discover hidden web properties by random walk on bipartite graph.",
            "Multimodal biomedical image indexing and retrieval using descriptive text and global feature mapping.",
            "Exploiting entity relationship for query expansion in enterprise search.",
            "A survey of approaches for ranking on the web of data.",
            "Identifying top news stories based on their popularity in the blogosphere.",
            "Evaluating hierarchical organisation structures for exploring digital libraries.",
            "Distance matters! Cumulative proximity expansions for ranking documents.",
            "Guest editorial: Special issue on information retrieval in the intellectual property domain.",
            "The effect of citation analysis on query expansion for patent retrieval.",
            "Wikipedia-based query phrase expansion in patent class search.",
            "Using query logs of USPTO patent examiners for automatic query expansion in patent searching.",
            "Using multiple query representations in patent prior-art search.",
            "Studying machine translation technologies for large-data CLIR tasks: a patent prior-art search case study.",
            "Dealing with temporal variation in patent categorization.",
            "Flowchart recognition for non-textual information retrieval in patent search."
        ]
    },
    {
        "name": "IR",
        "year": "2013",
        "info": "Volume 16: 2013",
        "count": 28,
        "papers": [
            "Leveraging comparable corpora for cross-lingual information retrieval in resource-lean language pairs.",
            "Modeling locations with social media.",
            "Balancing exploration and exploitation in listwise and pairwise online learning to rank for information retrieval.",
            "Crowdsourcing for information retrieval: introduction to the special issue.",
            "Implementing crowdsourcing-based relevance experimentation: an industrial perspective.",
            "Increasing cheat robustness of crowdsourcing tasks.",
            "An analysis of human factors and label accuracy in crowdsourcing relevance judgments.",
            "Identifying top news using crowdsourcing.",
            "Crowdsourcing and the crisis-affected community - Lessons learned and looking forward from Mission 4636.",
            "Crowdsourcing interactions: using crowdsourcing for evaluating interactive information retrieval systems.",
            "A learning approach to optimizing exploration-exploitation tradeoff in relevance feedback.",
            "Cross-language information retrieval models based on latent topic models trained with document-aligned comparable corpora.",
            "Forecasting user visits for online display advertising.",
            "A novel neighborhood based document smoothing model for information retrieval.",
            "Introduction to the special issue on search intents and diversification.",
            "Learning to rank query suggestions for adhoc and diversity search.",
            "Mining subtopics from different aspects for diversifying search results.",
            "Mining subtopics from text fragments for a web query.",
            "Diversified search evaluation: lessons from the NTCIR-9 INTENT task.",
            "Increasing evaluation sensitivity to diversity.",
            "The uncertain representation ranking framework for concept-based video retrieval.",
            "The whens and hows of learning to rank for web search.",
            "Cross-lingual training of summarization systems using annotated corpora in a foreign language.",
            "A query scrambler for search privacy on the internet.",
            "Using rating matrix compression techniques to speed up collaborative recommendations.",
            "Bridging memory-based collaborative filtering and text retrieval.",
            "When do people use query suggestion? A query suggestion log analysis.",
            "Document vector representations for feature extraction in multi-stage document ranking."
        ]
    },
    {
        "name": "IR",
        "year": "2012",
        "info": "Volume 15: 2012",
        "count": 24,
        "papers": [
            "Multimodal indexing based on semantic cohesion for image retrieval.",
            "Arabic texts analysis for topic modeling evaluation.",
            "Graph-based term weighting for information retrieval.",
            "The optimum clustering framework: implementing the cluster hypothesis.",
            "Opinion-based entity ranking.",
            "On complexity reduction of concept lattices: three counterexamples.",
            "Utilizing local evidence for blog feed search.",
            "Guest editorial: Special issue on information retrieval for social media.",
            "#nowplaying Madonna: a large-scale evaluation on estimating similarities between music artists and between movies from microblogs.",
            "Improving search via personalized query expansion using social media.",
            "Credibility-inspired ranking for blog post retrieval.",
            "Recommending Flickr groups with social topic model.",
            "A deniable and efficient question and answer service over ad hoc social networks.",
            "Finding similar questions in collaborative question answering archives: toward bootstrapping-based equivalent pattern learning.",
            "Conversation retrieval for microblogging sites.",
            "Sentiment detection with auxiliary data.",
            "Gateway finder in large graphs: problem definitions and fast solutions.",
            "Architecture and evaluation of BRUJA, a multilingual question answering system.",
            "Coverage-based search result diversification.",
            "Reranking web search results for diversity.",
            "On the role of novelty for search result diversification.",
            "Lumping algorithms for computing Google's PageRank and its derivative, with attention to unreferenced nodes.",
            "Implicit indexing of natural language text by reorganizing bytecodes.",
            "Extended structural relevance framework: a framework for evaluating structured document retrieval."
        ]
    },
    {
        "name": "IR",
        "year": "2011",
        "info": "Volume 14: 2011",
        "count": 31,
        "papers": [
            "Introduction to special issue on the second international conference on the theory of information retrieval.",
            "Retrieval constraints and word frequency distributions a log-logistic model for IR.",
            "Modeling score distributions in information retrieval.",
            "Variational bayes for modeling score distributions.",
            "Specificity aboutness in XML retrieval.",
            "An analysis of NP-completeness in novelty and diversity ranking.",
            "Learning to rank for why-question answering.",
            "Time-weighted web authoritative ranking.",
            "Discriminative probabilistic models for expert search in heterogeneous information sources.",
            "Investigating task performance of probabilistic topic models: an empirical study of PLSA and LDA.",
            "Diane Kelly: Methods for evaluating interactive information retrieval systems with users - Foundation and Trends in Information Retrieval, vol 3, nos 1-2, pp 1-224, 2009, ISBN: 978-1-60198-224-7.",
            "Michael W. Berry and Jacob Kogan (eds.): Text mining: applications and theory - John Wiley and Sons, Ltd, 2010, xiv + 207 pp, £55.00/€66.00, hardcover, ISBN: 978-0-470-74982-1.",
            "Special issue of The Journal of Information Retrieval on web mining for search.",
            "A unified representation of web logs for mining applications.",
            "A pattern mining approach for information filtering systems.",
            "Query reformulation mining: models, patterns, and applications.",
            "Incorporating web browsing activities into anchor texts for web search.",
            "The sum of its parts: reducing sparsity in click estimation with query segments.",
            "Sentiment classification: a lexical similarity based approach for extracting subjectivity in documents.",
            "Extending the language modeling framework for sentence retrieval to include local context.",
            "A multi-collection latent topic model for federated search.",
            "Re-ranking search results using an additional retrieved list.",
            "Ayşe Göker, John Davies (eds): Information retrieval: searching in the 21st century - John Wiley & Sons, 2009, 320 pp, Price £65.00/€74.80, ISBN: 978-0-470-02762-2.",
            "Efficient and effective spam filtering and re-ranking for large web datasets.",
            "Improving document clustering using Okapi BM25 feature weighting.",
            "Page importance computation based on Markov processes.",
            "Blog feed search with a post index.",
            "Online community search using conversational structures.",
            "Intent-based diversification of web search results: metrics and algorithms.",
            "A study of the integration of passage-, document-, and cluster-based information for re-ranking search results.",
            "Fusing different information retrieval systems according to query-topics: a study based on correlation in information retrieval systems and TREC topics."
        ]
    },
    {
        "name": "IR",
        "year": "2010",
        "info": "Volume 13: 2010",
        "count": 36,
        "papers": [
            "Filtering methods for content-based retrieval on indexed symbolic music databases.",
            "A framework to compute page importance based on user behaviors.",
            "Click-based evidence for decaying weight distributions in search effectiveness metrics.",
            "Estimating deep web data source size by capture-recapture method.",
            "William Hersh: Information retrieval: a health and biomedical perspective, 3rd ed - Health and Informatics Series, Springer, 2009, 504 pp, $79.95, ISBN: 978-0-387-78702-2).",
            "Document clustering of scientific texts using citation contexts.",
            "Sentence-level event classification in unstructured texts.",
            "Utilizing passage-based language models for ad hoc document retrieval.",
            "Bernard J. Jansen, Amanda Spink, Isak Taksa: Handbook of research on web log analysis - IGI Global, 2009, 628 pp, $265, ISBN: 978-1-59904-974-8.",
            "Christopher D. Manning, Prabhakar Raghavan, and Hinrich Schütze: Introduction to information retrieval - Cambridge University Press, Cambridge, England, 2008, 482 pp, ISBN: 978-0-521-86571-5.",
            "Introduction to special issue on learning to rank for information retrieval.",
            "Efficient algorithms for ranking with SVMs.",
            "Gradient descent optimization of smoothed information retrieval metrics.",
            "Knowledge transfer for cross domain learning to rank.",
            "Adapting boosting for information retrieval measures.",
            "On the choice of effectiveness measures for learning to rank.",
            "Learning to rank with (a lot of) word features.",
            "Classifying documents with link-based bibliometric measures.",
            "LETOR: A benchmark collection for research on learning to rank for information retrieval.",
            "A general approximation framework for direct optimization of information retrieval measures.",
            "David Gibbon, Zhu Liu: Introduction to video search engines - Springer, 2008, 276 pp, price: 64.95 euros, ISBN: 978-3-540-79336-6.",
            "John Davies, Marko Grobelnik and Dunja Mladenic: Semantic knowledge management - Springer, 2009, 252 pp., Price: $99 (ISBN: 978-3-540-88844-4).",
            "Current research in focused retrieval and result aggregation.",
            "Focused retrieval and result aggregation with political data.",
            "Focused and aggregated search: a perspective from natural language generation.",
            "Expected reading effort in focused retrieval evaluation.",
            "Statistical query expansion for sentence retrieval and its effects on weak and strong queries.",
            "FIDJI: using syntax for validating answers in multiple documents.",
            "Why finding entities in Wikipedia is difficult, sometimes.",
            "Entity ranking in Wikipedia: utilising categories, links and topic difficulty prediction.",
            "Finding related sentence pairs in MEDLINE.",
            "Discriminative graphical models for faculty homepage discovery.",
            "Structure vs. content in hierarchical corpora.",
            "Tendency correlation analysis for direct optimization of evaluation measures in information retrieval.",
            "A generative theory of relevance.",
            "Iris Xie: Interactive information retrieval in digital environments - IGI Publishing, Hershey, PA, 2008, 376 pp. US $99.95, ISBN 9781599042404."
        ]
    },
    {
        "name": "IR",
        "year": "2009",
        "info": "Volume 12: 2009",
        "count": 38,
        "papers": [
            "TREC genomics special issue overview.",
            "Exploring criteria for successful query expansion in the genomic domain.",
            "An empirical study of gene synonym query expansion in biomedical information retrieval.",
            "Evaluation of query expansion using MeSH in PubMed.",
            "Tasks, topics and relevance judging for the TREC Genomics Track: five years of experience evaluating biomedical text information retrieval systems.",
            "Introduction to the special issue on teaching and learning in information retrieval.",
            "The Bologna reform at the department of library and information science and book studies, university of Ljubljana.",
            "Blended learning and pure e-learning concepts for information retrieval: experiences and future directions.",
            "An inquiry-based learning approach to teaching information retrieval.",
            "Teaching mathematics for search using a tutorial style of delivery.",
            "A computer-supported learning system to help teachers to teach Fuzzy Information Retrieval Systems.",
            "Teaching and learning in information retrieval.",
            "Introduction to the special issue on non-english web retrieval.",
            "Current research issues and trends in non-English Web searching.",
            "Query structuring and expansion with two-stage term dependence for Japanese web retrieval.",
            "On knowledge-poor methods for person name matching and lemmatization for highly inflectional languages.",
            "Towards enhancing retrieval effectiveness of search engines for diacritisized Arabic documents.",
            "Mixed monolingual homepage finding in 34 languages: the role of language script and search domain.",
            "Non-english web search: an evaluation of indexing and searching the Greek web.",
            "A user-centric approach to identifying best deployment strategies for language tools: the impact of content and access language on Web user behaviour and attitudes.",
            "Using the Web as corpus for self-training text categorization.",
            "Classifying Amharic webnews.",
            "Re-ranking search results using language models of query-specific clusters.",
            "A comparison of extrinsic clustering evaluation metrics based on formal constraints.",
            "Modeling actions of PubMed users with n-gram language models.",
            "Pascal Poncelet, Florent Masseglia, Maguelonne Teisseire: Successes and New Directions in Data Mining.",
            "The ineffectiveness of within-document term frequency in text classification.",
            "A machine learning approach to sentiment analysis in multilingual Web texts.",
            "Preferential text classification: learning algorithms and evaluation measures.",
            "Server selection methods in personal metasearch: a comparative empirical study.",
            "D. Nahl, D. Bilal (eds.): Information and emotion: the emergent affective paradigm in information behaviour research and theory.",
            "Manning Christopher, Prabhakar Raghavan, Hinrich Schütze: Introduction to information retrieval.",
            "A comparison of extrinsic clustering evaluation metrics based on formal constraints.",
            "Overview of the Reliable Information Access Workshop.",
            "A guide to the RIA workshop data archive.",
            "Why current IR engines fail.",
            "On the number of terms used in automatic query expansion.",
            "Swapping documents and terms."
        ]
    },
    {
        "name": "IR",
        "year": "2008",
        "info": "Volume 11: 2008",
        "count": 27,
        "papers": [
            "An effective and efficient results merging strategy for multilingual information retrieval in federated search environments.",
            "Using only cross-document relationships for both generic and topic-focused multi-document summarizations.",
            "Nearest-biclusters collaborative filtering based on constant and coherent values.",
            "Features for image retrieval: an experimental comparison.",
            "An analysis on document length retrieval trends in language modeling smoothing.",
            "Smoothing document language models with probabilistic term count propagation.",
            "David Taniar: Research and Trends in Data Mining Technologies and Applications.",
            "Zdravko Markov and Daniel T. Larose, Data Mining the Web: Uncovering Patterns in Web Content, Structure, and Usage.",
            "Hybrid index maintenance for contiguous inverted lists.",
            "Evaluating the effectiveness of relevance feedback based on a user simulation model: effects of a user scenario on cumulated gain value.",
            "Document keyphrases as subject metadata: incorporating document key concepts in search results.",
            "A probability ranking principle for interactive information retrieval.",
            "Preface.",
            "Output-sensitive autocompletion search.",
            "Boosting multi-label hierarchical text categorization.",
            "An outranking approach for information retrieval.",
            "Efficient algorithms for pattern matching with general gaps, character classes, and transposition invariance.",
            "A compressed self-index using a Ziv-Lempel dictionary.",
            "Combining gene sequence similarity and textual information for gene function annotation in the literature.",
            "Effect of OCR error correction on Arabic retrieval.",
            "Focused web crawling in the acquisition of comparable corpora.",
            "On information retrieval metrics designed for evaluation with incomplete relevance assessments.",
            "Amy Langville and Carl Meyer, Google's Page Rank and Beyond: The Science of Search Engine Rankings.",
            "Ellen Voorhees and Donna Harman (eds): TREC Experiment and Evaluation in Information Retrieval.",
            "Probabilistic relevance ranking for collaborative filtering.",
            "Negation recognition in medical narrative reports.",
            "On event space and rank equivalence between probabilistic retrieval models."
        ]
    },
    {
        "name": "IR",
        "year": "2007",
        "info": "Volume 10: 2007",
        "count": 25,
        "papers": [
            "Lightweight natural language text compression.",
            "Extending WHIRL with background knowledge for improved text classification.",
            "Evolutionary learning of document categories.",
            "Ontological framework based on contextual mediation for collaborative information retrieval.",
            "Introduction to special issue on contextual information retrieval systems.",
            "An approach for the capture of context-dependent document relationships extracted from Bayesian analysis of users' interactions with information.",
            "Modeling context through domain ontologies.",
            "Knowledge-based query expansion to support scenario-specific retrieval of medical free text.",
            "Ontological framework based on contextual mediation for collaborative information retrieval.",
            "A pipelined architecture for distributed text query evaluation.",
            "Learning-based summarisation of XML documents.",
            "Linear feature-based models for information retrieval.",
            "Multilingual phrase-based concordance generation in real-time.",
            "Result merging methods in distributed information retrieval with overlapping databases.",
            "On rank-based effectiveness measures and optimization.",
            "An empirical study of tokenization strategies for biomedical information retrieval.",
            "An integrated system for building enterprise taxonomies.",
            "Syntactic sentence compression in the biomedical domain: facilitating access to related articles.",
            "Restricted inflectional form generation in management of morphological keyword variation.",
            "A review of text and image retrieval approaches for broadcast news video.",
            "Keith van Rijsbergen, The Geometry of Information Retrieval.",
            "Bias and the limits of pooling for large collections.",
            "Searching strategies for the Bulgarian language.",
            "Regularizing query-based retrieval scores.",
            "A new unsupervised method for document clustering by using WordNet lexical and conceptual relations."
        ]
    },
    {
        "name": "IR",
        "year": "2006",
        "info": "Volume 9: 2006",
        "count": 39,
        "papers": [
            "Two-stage statistical language models for text database selection.",
            "Hierarchical clustering of a Finnish newspaper article collection with graded relevance assessments.",
            "Retrieval quality vs. effectiveness of specificity-oriented search in XML collections.",
            "A merging strategy proposal: The 2-step retrieval status value method.",
            "Automatic search from streaming data.",
            "Information Representation and Retrieval in the Digital Age (ASIST Monograph Series) by Heting Chu, Medford, NJ: Information Today; 2003, 248 p, ISBN 1-57387-172-9.",
            "Introduction: A perspective on Web Information Retrieval.",
            "Efficient PageRank approximation via graph aggregation.",
            "A decision mechanism for the selective combination of evidence in topic distillation.",
            "Anonymous personalization in collaborative web search.",
            "Automatic question answering using the web: Beyond the Factoid.",
            "Quality and relevance of domain-specific search: A case study in mental health.",
            "Construction of query concepts based on feature clustering of documents.",
            "Word normalization and decompounding in mono- and bilingual IR.",
            "Extreme value theory applied to document retrieval from large collections.",
            "Multilingual modeling of cross-lingual spelling variants.",
            "Evolving local and global weighting schemes in information retrieval.",
            "A goodness of fit test approach in information retrieval.",
            "User modelling using evolutionary interactive reinforcement learning.",
            "A study of mixture models for collaborative filtering.",
            "New Directions in Question Answering.",
            "Review of Profiling Machines: Mapping the Personal Information Economy.",
            "Introduction to the special issue on the 27th European Conference on Information Retrieval Research.",
            "Noun phrases in interactive query expansion and document ranking.",
            "Experiments with dictionary-based CLIR using graded relevance assessments: Improving effectiveness by pseudo-relevance feedback.",
            "Can constrained relevance feedback and display strategies help users retrieve items on mobile devices?",
            "User evaluation of ontology as query construction tool.",
            "Full-text federated search of text-based digital libraries in peer-to-peer networks.",
            "TSP and cluster-based solutions to the reassignment of document identifiers.",
            "The nature of novelty detection.",
            "Spelling correction in the PubMed search engine.",
            "Methods for automatically evaluating answers to complex questions.",
            "Table extraction for answer retrieval.",
            "Collection-based compound noun segmentation for Korean information retrieval.",
            "Delta-distance: A family of dissimilarity metrics between images represented by multi-level feature vectors.",
            "A relatedness analysis of government regulations using domain knowledge and structural organization.",
            "Swedish full text retrieval: Effectiveness of different combinations of indexing strategies with query terms.",
            "Evaluating the effectiveness of content-oriented XML retrieval methods.",
            "Precision prediction based on ranked list coherence."
        ]
    },
    {
        "name": "IR",
        "year": "2005",
        "info": "Volume 8: 2005",
        "count": 30,
        "papers": [
            "Index-Based Persistent Document Identifiers.",
            "Automatic Alphabet Recognition.",
            "Information Retrieval with a Hybrid Automatic Query Expansion and Data Fusion Procedure.",
            "The Combination of Text Classifiers Using Reliability Indicators.",
            "System Performance and Natural Language Expression of Information Needs.",
            "Scale and Translation Invariant Collaborative Filtering Systems.",
            "Inverted Index Compression Using Word-Aligned Binary Codes.",
            "Guest Editorial: Spaces, Logic, and Link Analysis in IR: Recent Advances From A Mathematical and Logical Perspective.",
            "Test Data Likelihood for PLSA Models.",
            "Dempster-Shafer Theory for a Query-Biased Combination of Evidence on the Web.",
            "A Theoretical Study of a Generalized Version of Kleinberg's HITS Algorithm.",
            "Rank-Stability and Rank-Similarity of Link-Based Web Ranking Algorithms in Authority-Connected Graphs.",
            "Varying Retrieval Categoricity Using Hyperbolic Geometry.",
            "Complexity Reduction in Lattice-Based Information Retrieval.",
            "Personalised Indexing and Retrieval of Heterogeneous Structured Documents.",
            "On Event Spaces and Probabilistic Models in Information Retrieval.",
            "Data Driven Similarity Measures for k-Means Like Clustering Algorithms.",
            "Learning to Rank.",
            "Mobile Agents for Distributed and Heterogeneous Information Retrieval.",
            "A General Evaluation Framework for Topical Crawlers.",
            "Comparing Rank and Score Combination Methods for Data Fusion in Information Retrieval.",
            "Analysis of Statistical Question Classification for Fact-Based Questions.",
            "Mapping Scientific Frontiers: The Quest for Knowledge Visualization by Chaomei Chen. New York: Springer Verlag; 2003, 256 pps, (ISBN: 0-85233-494-0).",
            "Introduction to the Special Issue on INEX.",
            "Semantic Similarity Search on Semistructured Data with the XXL Search Engine.",
            "TIJAH: Embracing IR Methods in XML Databases.",
            "Hybrid XML Retrieval: Combining Information Retrieval and a Native XML Database.",
            "A Fusion Approach to XML Structured Document Retrieval.",
            "The Importance of Length Normalization for XML Retrieval.",
            "A Bayesian Framework for XML Information Retrieval: Searching and Learning with the INEX Collection."
        ]
    },
    {
        "name": "IR",
        "year": "2004",
        "info": "Volume 7: 2004",
        "count": 18,
        "papers": [
            "Editorial.",
            "Cross-Language Evaluation Forum: Objectives, Results, Achievements.",
            "Monolingual Document Retrieval for European Languages.",
            "Statistical Models for Monolingual and Bilingual Information Retrieval.",
            "Character N-Gram Tokenization for European Language Text Retrieval.",
            "Dictionary-Based Cross-Language Information Retrieval: Learning Experiences from CLEF 2000-2002.",
            "Combining Multiple Strategies for Effective Monolingual and Cross-Language Retrieval.",
            "Multilingual Information Retrieval Using Machine Translation, Relevance Feedback and Decompounding.",
            "Combination Approaches for Multilingual Text Retrieval.",
            "Interactive Cross-Language Document Selection.",
            "Introduction: Special Issue on the 25th European Conference on Information Retrieval Research.",
            "Replicating Web Structure in Small-Scale Test Collections.",
            "Within-Document Retrieval: A User-Centred Evaluation of Relevance Profiling.",
            "How Effective is Stemming and Decompounding for German Text Retrieval?",
            "Augmenting Naive Bayes Classifiers with Statistical Language Models.",
            "Simple Semantics in Topic Detection and Tracking.",
            "OSGS - A Personalized Online Store for E-Commerce Environments.",
            "Learning User Similarity and Rating Style for Collaborative Recommendation."
        ]
    },
    {
        "name": "IR",
        "year": "2003",
        "info": "Volume 6: 2003",
        "count": 16,
        "papers": [
            "Compressing Inverted Files.",
            "Dipe-D: A Tool for Knowledge-Based Query Formulation in Information Retrieval.",
            "A Memory-Based Approach to Anti-Spam Filtering for Mailing Lists.",
            "Using the Information Structure Model to Compare Profile-Based Information Filtering Systems.",
            "On Collection Size and Retrieval Effectiveness.",
            "Partial Collection Replication for Information Retrieval.",
            "Simulation Studies of Different Dimensions of Users' Interests and their Impact on User Modeling and Information Filtering.",
            "Knowledge-Enhanced Latent Semantic Indexing.",
            "Query Expansion with Long-Span Collocates.",
            "Principles of Data Mining.",
            "Spotting and Discovering Terms Through Natural Language Processing.",
            "Knowledge Management in the Socio Technical World? The Graffiti Continues.",
            "Looking for Information?A Survey of Research on Information Seeking, Needs, and Behavior.",
            "An Ontology-Based Binary-Categorization Approach for Recognizing Multiple-Record Web Documents Using a Probabilistic Retrieval Model.",
            "Applying Machine Learning to Text Segmentation for Information Retrieval.",
            "From Retrieval Status Values to Probabilities of Relevance for Advanced IR Applications."
        ]
    },
    {
        "name": "IR",
        "year": "2002",
        "info": "Volume 5: 2002",
        "count": 18,
        "papers": [
            "Asymmetric Missing-data Problems: Overcoming the Lack of Negative Data in Preference Ranking.",
            "Pooling for a Large-Scale Test Collection: An Analysis of the Search Results from the First NTCIR Workshop.",
            "Some Formal Analysis of Rocchio's Similarity-Based Relevance Feedback Algorithm.",
            "Hierarchical Text Categorization Using Neural Networks.",
            "Introduction to the Special Issue: Overview of the TREC Routing and Filtering Tasks.",
            "Detection As Multi-Topic Tracking.",
            "Information Filtering in TREC-9 and TDT-3: A Comparative Analysis.",
            "Related, but not Relevant: Content-Based Collaborative Filtering in TREC-8.",
            "Adaptive Filtering of Newswire Stories using Two-Level Clustering.",
            "Threshold Setting and Performance Optimization in Adaptive Filtering.",
            "Comparing the Performance of Adaptive Filtering and Ranked Output Systems.",
            "Finding Out About: A Cognitive Perspective on Search Engine Technology and the WWW.",
            "Information Retrieval: Algorithms and Heuristics.",
            "The Text in the Machine: Electronic Texts in the Humanities.",
            "An Empirical Analysis of Design Choices in Neighborhood-Based Collaborative Filtering Algorithms.",
            "Hierarchical Clustering Using Non-Greedy Principal Direction Divisive Partitioning.",
            "Exploiting Manual Indexing to Improve Collection Selection and Retrieval Effectiveness.",
            "Generalized Hamming Distance."
        ]
    },
    {
        "name": "IR",
        "year": "2001",
        "info": "Volume 4: 2001",
        "count": 17,
        "papers": [
            "Text Categorization Based on Regularized Linear Classification Methods.",
            "Measuring Search Engine Quality.",
            "The Characteristic Analysis of the DARE Visual Space.",
            "Managing Gigabytes - Compressing and Indexing Documents and Images (Second Edition).",
            "Foundations of Statistical Natural Language Processing.",
            "Advances in Automatic Text Summarization.",
            "Integrating External Knowledge to Supplement Training Data in Semi-Supervised Learning for Text Categorization.",
            "A Corpus-Based Learning Method of Compound Noun Indexing Rules for Korean.",
            "Eigentaste: A Constant Time Collaborative Filtering Algorithm.",
            "A Comparison of Text-Based Methods for Detecting Duplication in Scanned Document Databases.",
            "Information Retrieval Special Issue: Conceptual, Linguistic and Task-Based IR: Research at the University of Tampere.",
            "From Plain Character Strings to Meaningful Words: Producing Better Full Text Databases for Inflectional and Compounding Languages with Morphological Analysis Software.",
            "Dictionary-Based Cross-Language Information Retrieval: Problems, Methods, and Research Findings.",
            "ExpansionTool: Concept-Based Query Expansion and Construction.",
            "Extensions to the STAIRS Study-Empirical Evidence for the Hypothesised Ineffectiveness of Boolean Queries in Large Full-Text Databases.",
            "A Test Collection for the Evaluation of Content-Based Image Retrieval Algorithms-A User and Task-Based Approach.",
            "Changes in Search Tactics and Relevance Judgements when Preparing a Research Proposal A Summary of the Findings of a Longitudinal Study."
        ]
    },
    {
        "name": "IR",
        "year": "2000",
        "info": "Volume 3: 2000",
        "count": 19,
        "papers": [
            "Guest Introduction.",
            "Skeleton Trees for the Efficient Decoding of Huffman Encoded Texts.",
            "Binary Interpolative Coding for Effective Index Compression.",
            "Adding Compression to Block Addressing Inverted Indexes.",
            "Neural Network Agents for Learning Semantic Text Classification.",
            "A New Approach to Clustering Records in Information Retrieval Systems.",
            "Automating the Construction of Internet Portals with Machine Learning.",
            "Introduction.",
            "New Approaches to Spoken Document Retrieval.",
            "Information Retrieval can Cope with Many Errors.",
            "The Probability Ranking Principle Revisited.",
            "Content-Based Image Retrieval in Astronomy.",
            "Using the Co-occurrence of Words for Retrieval Weighting.",
            "Retrieving Information from a Distributed Heterogeneous Document Collection.",
            "Using Corpus-Based Approaches in a System for Multilingual Information Retrieval.",
            "DR-LINK in TIPSTER III.",
            "Improving English and Chinese Ad-Hoc Retrieval: A Tipster Text Phase 3 Project Report.",
            "Towards Universal Text Retrieval: Tipster Text Retrieval Research at New Mexico State University.",
            "A Hierarchical Document Retrieval Language."
        ]
    },
    {
        "name": "IR",
        "year": "2000",
        "info": "Volume 2: 2000",
        "count": 19,
        "papers": [
            "Improving Formal Models and Usability: Research in IR at Glasgow University - Introduction.",
            "Another Look at the Logical Uncertainty Principle.",
            "Exploiting the Similarity of Non-Matching Terms at Retrieval Time.",
            "Retrieving with Good Sense.",
            "Using Statistical Term Similarity for Sense Disambiguation in Cross-Language Information Retrieval.",
            "Incorporating Aspects of Information Use into Relevance Feedback.",
            "Interactive Evaluation of the Ostensive Model Using a New Test Collection of Images with Multiple Relevance Assessments.",
            "A Task-Oriented Non-Interactive Evaluation Methodology for Information Retrieval Systems.",
            "Introduction.",
            "Information Retrieval from Documents: A Survey.",
            "The TREC-5 Confusion Track: Comparing Retrieval Methods for Scanned Text.",
            "Locating and Recognizing Text in WWW Images.",
            "Word Spotting in Bitmapped Fax Documents.",
            "Comparison and Classification of Documents Based on Layout Similarity.",
            "Intelligent Indexing and Semantic Retrieval of Multimodal Documents.",
            "Improved Query Matching Using kd-Trees: A Latent Semantic Indexing Enhancement.",
            "Learning Algorithms for Keyphrase Extraction.",
            "Matching Index Expressions for Information Retrieval.",
            "Incremental Relevance Feedback in Japanese Text Retrieval."
        ]
    },
    {
        "name": "IR",
        "year": "1999",
        "info": "Volume 1: 1999",
        "count": 14,
        "papers": [
            "Editorial.",
            "Blind Men and Elephants: Six Approaches to TREC Data.",
            "Summarizing Similarities and Differences Among Related Documents.",
            "An Evaluation of Statistical Approaches to Text Categorization.",
            "An Evaluation of Automatically Constructed Hypertexts for Information Retrieval.",
            "Scaling Up the TREC Collection.",
            "Fusion Via a Linear Combination of Scores.",
            "Genetic Approach to Query Space Exploration.",
            "Exploiting Hierarchy in Text Categorization.",
            "The Effects of Conjunction, Facet Structure, and Dictionary Combinations in Concept-Based Cross-Language Retrieval.",
            "End-User Searching Challenges Indexing Practices in the Digital Newspaper Photo Archive.",
            "Browse and Search Patterns in a Digital Image Database.",
            "Simple Bayesian Model for Bitmap Compression.",
            "The Co-Effects of Query Structure and Expansion on Retrieval Performance in Probabilistic Text Retrieval."
        ]
    }
]