[
    {
        "name": "IS",
        "year": "2022",
        "info": "2022: Volumes\n103,\n104,\n105,\n106,",
        "count": 78,
        "papers": [
            "Aligning observed and modelled behaviour by maximizing synchronous moves and using milestones.",
            "CoPModL: Construction Process Modeling Language and Satisfiability Checking.",
            "BINet: Multi-perspective business process anomaly classification.",
            "Formalising and animating multiple instances in BPMN collaborations.",
            "Special issue: BPM 2018 selected papers in foundations and engineering.",
            "Detecting inorganic financial campaigns on Twitter.",
            "Bot2Vec: A general approach of intra-community oriented representation learning for bot detection in different types of social networks.",
            "Deep reinforcement learning based ensemble model for rumor tracking.",
            "Process model abstraction for rapid comprehension of complex business processes.",
            "Uniform probabilistic generation of relation instances satisfying a functional dependency.",
            "Blockchain and e-government innovation: Automation of public information processes.",
            "Detection of spam reviews through a hierarchical attention architecture with N-gram CNN and Bi-LSTM.",
            "Caught in a networked collusion? Homogeneity in conspiracy-related discussion networks on YouTube.",
            "Preface - Special Issue on Misinformation on the Web.",
            "Hierarchical clustering that takes advantage of both density-peak and density-connectivity.",
            "Unleashing the power of querying streaming data in a temporal database world: A relational algebra approach.",
            "Assessing and improving measurability of process performance indicators based on quality of logs.",
            "Modelling the quality of life goals of people living with dementia.",
            "Controlled flexibility in blockchain-based collaborative business processes.",
            "Sampling and approximation techniques for efficient process conformance checking.",
            "Requirements Engineering for Cyber Physical Production Systems: The e-CORE approach and its application.",
            "D2IA: User-defined interval analytics on distributed streams.",
            "Aligning social concerns with information system security: A fundamental ontology for social engineering.",
            "Computation of alignments of business processes through relaxation labeling and local optimal search.",
            "Editorial.",
            "Data variety, come as you are in multi-model data warehouses.",
            "Query-centric regression.",
            "COOL: A framework for conversational OLAP.",
            "Relational schema optimization for RDF-based knowledge graphs.",
            "A First-Order Logic verification framework for communication-parametric and time-aware BPMN collaborations.",
            "Graph integration of structured, semistructured and unstructured data for data journalism.",
            "Assured automatic dynamic reconfiguration of business processes.",
            "Electronic health records based reinforcement learning for treatment optimizing.",
            "A study into the contingencies of process improvement methods.",
            "Fast and accurate quantitative business process analysis using feature complete queueing models.",
            "Full-text search engine with suffix index for massive heterogeneous data.",
            "Keeping our rivers clean: Information-theoretic online anomaly detection for streaming business process events.",
            "Storing data once in M-trees and PM-trees: Revisiting the building principles of metric access methods.",
            "A unified metamodel for NoSQL and relational databases.",
            "Business process and rule integration approaches - An empirical analysis of model understanding.",
            "Selected Papers of BPM 2019 - Editorial to the Special Issue.",
            "Schema mapping generation in the wild.",
            "Cell separation algorithm with enhanced search behaviour in miRNA feature selection for cancer diagnosis.",
            "Pattern on demand in transactional distributed databases.",
            "Cracking in-memory database index: A case study for Adaptive Radix Tree index.",
            "Keyword aware influential community search in large attributed graphs.",
            "An efficient hybrid query recommendation using shingling and hashing techniques.",
            "Trends in Design, Optimization, Languages, and Analytical Processing of Big Data (DOLAP 2020).",
            "Data processing in modern distributed architectures.",
            "Vadalog: A modern architecture for automated reasoning with large knowledge graphs.",
            "Hate speech detection is not as easy as you may think: A closer look at model validation (extended version).",
            "Fragments of bag relational algebra: Expressiveness and certain answers.",
            "Querying APIs with SPARQL.",
            "AMW 2019 Special Issue.",
            "An efficient and scalable method for aggregate nearest neighbor queries on time-dependent road networks.",
            "Ripple: An approach to locate k nearest neighbours for location-based services.",
            "BPMN 2.0 OR-Join Semantics: Global and local characterisation.",
            "LILLIE: Information extraction and database integration using linguistics and learning-based algorithms.",
            "Exploring data structure alternatives in the RDB to NoSQL document store conversion process.",
            "Data quality challenges in large-scale cyber-physical systems: A systematic review.",
            "EQUALITY: Quality-aware intensive analytics on the edge.",
            "Establishing trajectories of moving objects without identities: The intricacies of cell tracking and a solution.",
            "Process discovery with context-aware process trees.",
            "Multi-label legal document classification: A deep learning-based approach with label-attention and domain-specific pre-training.",
            "Conformance checking of partially matching processes: An entropy-based approach.",
            "Exploiting co-occurrence networks for classification of implicit inter-relationships in legal texts.",
            "ECHR-OD: On building an integrated open repository of legal documents for machine learning applications.",
            "A knowledge-centered framework for exploration and retrieval of legal documents.",
            "Graph-based managing and mining of processes and data in the domain of intellectual property.",
            "The GDPR enforcement fines at glance.",
            "Special issue: Selected papers of ICPM 2019.",
            "Accurate privacy-preserving record linkage for databases with missing values.",
            "Towards defining data interpretability in open data portals: Challenges and research opportunities.",
            "Extracting value from Brazilian Court decisions.",
            "Lynx: A knowledge-based AI service platform for content processing, enrichment and analysis for the legal domain.",
            "Legal Information Retrieval systems: State-of-the-art and open issues.",
            "Adaptive personalized recommender system using learning automata and items clustering.",
            "\"Managing, Mining and Learning in the Legal Data Domain\"."
        ]
    },
    {
        "name": "IS",
        "year": "2021",
        "info": "2021: Volumes\n96,\n97,\n98,\n99,\n100,\n101,\n102",
        "count": 61,
        "papers": [
            "A large reproducible benchmark of ontology-based methods and word embeddings for word similarity.",
            "Feature-oriented engineering of declarative artifact-centric process models.",
            "Scalable and data-aware SQL query recommendations.",
            "A general framework for privacy-preserving of data publication based on randomized response techniques.",
            "Topical affinity in short text microblogs.",
            "ER-index: A referential index for encrypted genomic databases.",
            "Novel predictive model to improve the accuracy of collaborative filtering recommender systems.",
            "CryptDICE: Distributed data protection system for secure cloud data storage and computation.",
            "ProDB: A memory-secure database using hardware enclave and practical oblivious RAM.",
            "SJSON: A succinct representation for JSON documents.",
            "Efficient top-k recently-frequent term querying over spatio-temporal textual streams.",
            "On the composition of the long tail of business processes: Implications from a process mining study.",
            "Enterprise-grade protection against e-mail tracking.",
            "Efficient subspace search in data streams.",
            "Speed prediction in large and dynamic traffic sensor networks.",
            "Characterizing client usage patterns and service demand for car-sharing systems.",
            "How meaningful are similarities in deep trajectory representations?",
            "A DSL for WSN software components coordination.",
            "Anti-alignments - Measuring the precision of process models and event logs.",
            "Fast, scalable and geo-distributed PCA for big data analytics.",
            "The FORA Fog Computing Platform for Industrial IoT.",
            "Empowering conformance checking using Big Data through horizontal decomposition.",
            "GoFast: Graph-based optimization for efficient and scalable query evaluation.",
            "A real-time deep-learning approach for filtering Arabic low-quality content and accounts on Twitter.",
            "Rating prediction based on combination of review mining and user preference analysis.",
            "A Data Science approach analysing the Impact of Injuries on Basketball Player and Team Performance.",
            "Rank/select queries over mutable bitmaps.",
            "Comparison of machine learning classifiers: A case study of temperature alarms in a pharmaceutical supply chain.",
            "Automatic ensemble feature selection using fast non-dominated sorting.",
            "Beyond arrows in process models: A user study on activity dependences and their rationales.",
            "Scalable generalized median graph estimation and its manifold use in bioinformatics, clustering, classification, and indexing.",
            "Learned Metric Index - Proposition of learned indexing for unstructured data.",
            "Multi-label Arabic text classification in Online Social Networks.",
            "Reuse-centric k-means configuration.",
            "Formal foundations for responsible application integration.",
            "A deep view-point language and framework for projective modeling.",
            "Detecting trend deviations with generic stream processing patterns.",
            "Enabling runtime flexibility in data-centric and data-driven process execution engines.",
            "Service contract modeling in Enterprise Architecture: An ontology-based approach.",
            "Using agile methodologies for adopting COBIT.",
            "Points of Interest recommendations: Methods, evaluation, and future directions.",
            "Towards multi-purpose main-memory storage structures: Exploiting sub-space distance equalities in totally ordered data sets for exact knn queries.",
            "Query by documents on top of a search interface.",
            "Optimizing Semantic Deep Forest for tweet topic classification.",
            "Preface to the EDOC 2017/2018 Special Issue.",
            "Fast and eager k-medoids clustering: O(k) runtime improvement of the PAM, CLARA, and CLARANS algorithms.",
            "The role of local dimensionality measures in benchmarking nearest neighbor search.",
            "Query filtering using two-dimensional local embeddings.",
            "Prototyping a business process improvement plan. An evidence-based approach.",
            "Orientation and conformance: A HMM-based approach to online conformance checking.",
            "Model-based trace variant analysis of event logs.",
            "Conformance checking of mixed-paradigm process models.",
            "Stochastic process mining: Earth movers' stochastic conformance.",
            "Conformance checking over uncertain event data.",
            "Keyword search over schema-less RDF datasets by SPARQL query compilation.",
            "Practical and comprehensive formalisms for modelling contemporary graph query languages.",
            "Natural language-based detection of semantic execution anomalies in event logs.",
            "Blockchain-based Privacy-Preserving Record Linkage: enhancing data privacy in an untrusted environment.",
            "RCELF: A residual-based approach for Influence Maximization Problem.",
            "Reproducible experiments on Three-Dimensional Entity Resolution with JedAI.",
            "Conformance Checking in Process Mining."
        ]
    },
    {
        "name": "IS",
        "year": "2020",
        "info": "2020: Volumes\n87,\n88,\n89,\n90,\n91,\n92,\n93,\n94,\n95",
        "count": 96,
        "papers": [
            "An exploration of IoT platform development.",
            "Temporal data exchange.",
            "Understanding and improving ontology reasoning efficiency through learning and ranking.",
            "Quality-aware skill translation models for expert finding on StackOverflow.",
            "Customized query auto-completion and suggestion - A review.",
            "Pivot-based approximate k-NN similarity joins for big high-dimensional data.",
            "A top-k spatial join querying processing algorithm based on spark.",
            "A significance-based trust-aware recommendation approach.",
            "Dual-PISA: An index for aggregation operations on time series data.",
            "A survey of modeling language specification techniques.",
            "Introduction to Special Issue of the 10th International Conference on Similarity Search and Applications (SISAP 2017).",
            "ANN-Benchmarks: A benchmarking tool for approximate nearest neighbor algorithms.",
            "Self-indexed motion planning.",
            "Secure lightweight password authenticated key exchange for heterogeneous wireless sensor networks.",
            "The negative skycube.",
            "On optimal preference diffusion over social networks.",
            "Network-wide complex event processing over geographically distributed data sources.",
            "Bitmap filter: Speeding up exact set similarity joins with bitwise operations.",
            "Similarity query support in big data management systems.",
            "Efficient Path Routing Over Road Networks in the Presence of Ad-Hoc Obstacles.",
            "Retrieving the resource availability calendars of a process from an event log.",
            "Extending Big Data Management via Semantics: Recent Innovations.",
            "Metaquerying made practical for OWL 2 QL ontologies.",
            "From keywords to relational database content: A semantic mapping method.",
            "What does existing NeuroIS research focus on?",
            "Operator implementation of Result Set Dependent KWS scoring functions.",
            "To index or not to index: Time-space trade-offs for positional ranking functions in search engines.",
            "Comparing the expressiveness of downward fragments of the relation algebra with transitive closure on trees.",
            "Volunteering for Linked Data Wrapper maintenance: A platform perspective.",
            "JSON: Data model and query languages.",
            "Automated discovery of declarative process models with correlated data conditions.",
            "Discovering instance and process spanning constraints from process execution logs.",
            "An empirical evaluation of exact set similarity join techniques using GPUs.",
            "Information system ecology: An application of dataphoric ascendancy.",
            "Shared Ledger Accounting - Implementing the Economic Exchange pattern.",
            "Mining association rules for anomaly detection in dynamic process runtime behavior and explaining the root cause to users.",
            "Toward higher-level abstractions based on state machine for cloud resources elasticity.",
            "Detection and removal of infrequent behavior from event streams of business processes.",
            "Editorial.",
            "Design principles for the General Data Protection Regulation (GDPR): A formal concept analysis and its evaluation.",
            "Compatible byte-addressable direct I/O for peripheral memory devices in Linux.",
            "Clustering biomedical and gene expression datasets with kernel density and unique neighborhood set based vein detection.",
            "Understanding Service-Oriented Architecture (SOA): A systematic literature review and directions for further investigation.",
            "Improving malicious URLs detection via feature engineering: Linear and nonlinear space transformation methods.",
            "Discovering and merging related analytic datasets.",
            "A novel graph-based clustering method using noise cutting.",
            "On the declarative paradigm in hybrid business process representations: A conceptual framework and a systematic literature study.",
            "A-Cure: An accurate information reconstruction from inaccurate data sources.",
            "An efficient algorithm for approximated self-similarity joins in metric spaces.",
            "Detecting coherent explorations in SQL workloads.",
            "Feedback driven improvement of data preparation pipelines.",
            "Two-stage optimization for machine learning workflow.",
            "An Alternative View on Data Processing Pipelines from the DOLAP 2019 Perspective.",
            "A-BI+: A framework for Augmented Business Intelligence.",
            "Community-diversified influence maximization in social networks.",
            "Winter is here! A decade of cache-based side-channel attacks, detection & mitigation for RSA.",
            "A fully spatial personalized differentially private mechanism to provide non-uniform privacy guarantees for spatial databases.",
            "Efficient processing of reverse nearest neighborhood queries in spatial databases.",
            "Evaluation of factors contributing to the failure of information systems in public universities: The case of Iran.",
            "Automatic latent street type discovery from web open data.",
            "Recommender systems for smart cities.",
            "Explaining data with descriptions.",
            "Corrigendum to \"Discovering and learning sensational episodes of news events\" [Inf. Syst. 78 (2018) 68-80].",
            "SchemaDecrypt++: Parallel on-line Versioned Schema Inference for Large Semantic Web Data sources.",
            "Eras: Improving the quality control in the annotation process for Natural Language Processing tasks.",
            "DMAKit: A user-friendly web platform for bringing state-of-the-art data analysis techniques to non-specific users.",
            "Sports analytics - Evaluation of basketball players and team performance.",
            "Scenario-based process querying for compliance, reuse, and standardization.",
            "Three-dimensional Entity Resolution with JedAI.",
            "Comprehending 3D and 4D ontology-driven conceptual models: An empirical study.",
            "Continuous outlier mining of streaming data in flink.",
            "Scalable alignment of process models and event logs: An approach based on automata and S-components.",
            "A review of topic modeling methods.",
            "Providing accurate answers to OLAP queries based on standardized moments of data cubes.",
            "Decentralized data access control over consortium blockchains.",
            "Relevance- and interface-driven clustering for visual information retrieval.",
            "DimensionSlice: A main-memory data layout for fast scans of multidimensional data.",
            "Exploiting semantic relationships for unsupervised expansion of sentiment lexicons.",
            "Privacy-aware data cleaning-as-a-service.",
            "XChange: A semantic diff approach for XML documents.",
            "Knowledge-guided unsupervised rhetorical parsing for text summarization.",
            "A comprehensive analysis of delayed insertions in metric access methods.",
            "Bitpart: Exact metric search in high(er) dimensions.",
            "Re-ranking via local embeddings: A use case with permutation-based indexing and the nSimplex projection.",
            "A survey on graph-based methods for similarity searches in metric spaces.",
            "Introduction to Special Issue of the 11th International Conference on Similarity Search and Applications (SISAP 2018).",
            "Processing tweets for cybersecurity threat awareness.",
            "Every apprentice needs a master: Feedback-based effectiveness improvements for process model matching.",
            "In-situ visual exploration over big raw data.",
            "OILog: An online incremental log keyword extraction approach based on MDP-LSTM neural network.",
            "Collaborative filtering over evolution provenance data for interactive visual data exploration.",
            "Towards holistic Entity Linking: Survey and directions.",
            "Cause vs. effect in context-sensitive prediction of business process instances.",
            "A knowledge-intensive adaptive business process management framework.",
            "On the appropriateness of Platt scaling in classifier calibration.",
            "Detection of batch activities from event logs."
        ]
    },
    {
        "name": "IS",
        "year": "2019",
        "info": "2019: Volumes\n79,\n80,\n81,\n82,\n83,\n84,\n85,\n86",
        "count": 96,
        "papers": [
            "Special issue on DOLAP 2017: Design, Optimization, Languages and Analytical Processing of Big Data.",
            "An integration-oriented ontology to govern evolution in Big Data ecosystems.",
            "The percentage cube.",
            "Mapreduce performance model for Hadoop 2.x.",
            "EXODuS: Exploratory OLAP over Document Stores.",
            "The Pure Cold-Start Problem: A deep study about how to conquer first-time users in recommendations domains.",
            "Personal Data Management Systems: The security and functionality standpoint.",
            "Variability in business processes: Automatically obtaining a generic specification.",
            "End-to-end neural opinion extraction with a transition-based model.",
            "Knowledge triple mining via multi-task learning.",
            "Set operations over compressed binary relations.",
            "A novel edge-centric approach for graph edit similarity computation.",
            "Introduction to Special Issue of the 9th International Conference on Similarity Search and Applications (SISAP 2016).",
            "Supermetric search.",
            "Exploiting the structure of furthest neighbor search for fast approximate results.",
            "Computing inter-document similarity with Context Semantic Analysis.",
            "Searching for variable-speed motions in long sequences of motion capture data.",
            "Metadata management for scientific databases.",
            "Creative design of emergency management scenarios driven by semantics: An application to smart cities.",
            "Using entropy metrics for pruning very large graph cubes.",
            "Approaches and challenges of privacy preserving search over encrypted data.",
            "HiWalk: Learning node embeddings from heterogeneous networks.",
            "Comparing traditional conceptual modeling with ontology-driven conceptual modeling: An empirical study.",
            "Distance-based customer detection in fake follower markets.",
            "Scalable keyword search over relational data streams by aggressive candidate network consolidation.",
            "A practical data-flow verification scheme for business processes.",
            "Reasoning about UML/OCL class diagrams using constraint logic programming and formula.",
            "Corrigendum to \"Discovering and learning sensational episodes of news events\" [Information Systems 78 (2018) 68-80].",
            "Introduction to the Special Issue on Integrating Process-oriented and Event-based Systems.",
            "From event streams to process models and back: Challenges and opportunities.",
            "Assessing flexibility in event-driven process adaptation.",
            "Event-based failure prediction in distributed business processes.",
            "Predictive monitoring of temporally-aggregated performance indicators of business processes against low-level streaming events.",
            "MEdit4CEP-CPN: An approach for complex event processing modeling by prioritized colored petri nets.",
            "Wiser: A semantic approach for expert finding in academia based on entity linking.",
            "MIND: An approach to optimize communication time via middleware tuning.",
            "Predictive performance modeling for distributed batch processing using black box monitoring and machine learning.",
            "Privacy preserving serial publication of transactional data.",
            "The similarity-aware relational division database operator with case studies in agriculture and genetics.",
            "Advances in Databases and Information Systems (ADBIS) 2016 & 2017.",
            "Instant restore after a media failure (extended version).",
            "A generic and efficient framework for flash-aware spatial indexing.",
            "Interactive and space-efficient multi-dimensional time series subsequence matching.",
            "Sparse prefix sums: Constant-time range sum queries over sparse multidimensional data cubes.",
            "Automatic assessment of interactive OLAP explorations.",
            "Combining different metadata views for better recommendation accuracy.",
            "Boosting decision stumps for dynamic feature selection on data streams.",
            "Using Hidden Markov Models for the accurate linguistic analysis of process model activity labels.",
            "INDIANA: An interactive system for assisting database exploration.",
            "TAPON-MT: A versatile framework for semantic labelling.",
            "From BPMN process models to DMN decision models.",
            "Reverse engineering database queries from examples: State-of-the-art, challenges, and research opportunities.",
            "GreyCat: Efficient what-if analytics for data in motion at scale.",
            "Fairness in dataflow scheduling in the cloud.",
            "Moving kNN query processing in metric space based on influential sets.",
            "Scaling entity resolution: A loosely schema-aware approach.",
            "Handling probabilistic integrity constraints in pay-as-you-go reconciliation of data models.",
            "On the reproducibility of experiments of indexing repetitive document collections.",
            "KTMiner: Distributed k-truss detection in big graphs.",
            "Corrigendum to \"The percentage cube\" [Inf. Syst. 79 (2019) 20-31].",
            "Understanding and improvement of the selection of replica servers in key-value stores.",
            "Retraction notice to: \"An event detection method for social networks based on link prediction\" [Inf. Syst. 71 (2017) 16-26].",
            "A novel clustering algorithm based on the natural reverse nearest neighbor structure.",
            "Profiling of knowledge organisation systems for the annotation of Linked Data cultural resources.",
            "Metainformation scenarios in Digital Humanities: Characterization and conceptual modelling strategies.",
            "Reverse collective spatial keyword query processing on road networks with G-tree index structure.",
            "Semi-automatic inductive construction of reference process models that represent best practices in public administrations: A method.",
            "Relational database schema design for uncertain data.",
            "A modular approach to the specification and management of time duration constraints in BPMN.",
            "Efficient trip scheduling algorithms for groups.",
            "Concept and Computation of Ranking-based Dominance.",
            "Reviews with revenue in reputation: Credibility management method for consumer-opinion platforms.",
            "Efficiently using contextual influence to recommend new items to ephemeral groups.",
            "Stage-based discovery of business process models from event logs.",
            "Special issue: Selected papers of BPM 2017.",
            "Context-aware temporal network representation of event logs: Model and methods for process performance analysis.",
            "From knowledge-driven to data-driven inter-case feature encoding in predictive process monitoring.",
            "Looking into the TESSERACT: Time-drifts in event streams using series of evolving rolling averages of completion times.",
            "Business process improvement with the AB-BPM methodology.",
            "Object to NoSQL Database Mappers (ONDM): A systematic survey and comparison of frameworks.",
            "What knowledge management approach do entrepreneurial universities need?",
            "Skyblocking for entity resolution.",
            "DOLAP data warehouse research over two decades: Trends and challenges.",
            "Schema-independent querying for heterogeneous collections in NoSQL document stores.",
            "Beyond roll-up's and drill-down's: An intentional analytics model to reinvent OLAP.",
            "Binary classification in unstructured space with hypergraph case-based reasoning.",
            "Approximate OLAP of document-oriented databases: A variety-aware approach.",
            "Bridging the gap between linked open data-based recommender systems and distributed representations.",
            "Editorial.",
            "Querying on large and complex databases by content: Challenges on variety and veracity regarding real applications.",
            "Approximation algorithms for querying incomplete databases.",
            "On the Codd semantics of SQL nulls.",
            "Editorial.",
            "A design-time data-centric maturity model for assessing resilience in multi-party business processes.",
            "Interest-based recommendations for business intelligence users.",
            "Speech-acts based analysis for requirements discovery from online discussions."
        ]
    },
    {
        "name": "IS",
        "year": "2018",
        "info": "2018: Volumes\n73,\n74,\n75,\n76,\n77,\n78",
        "count": 55,
        "papers": [
            "Efficiently interpreting traces of low level events in business process logs.",
            "Rank and select: Another lesson learned.",
            "Modeling Music as Synchronized Time Series: Application to Music Score Collections.",
            "Survey and evaluation of web search engine hit counts as research tools in computational linguistics.",
            "Multi-party business process compliance monitoring through IoT-enabled artifacts.",
            "Preface CAISE'2016 special issue.",
            "Engineering transparency requirements: A modelling and analysis framework.",
            "Near real-time collaborative modeling for view-based Web information systems engineering.",
            "Discovering hidden dependencies in constraint-based declarative process models for improving understandability.",
            "Process variant comparison: Using event logs to detect differences in behavior and business rules.",
            "Genetic algorithms for hyperparameter optimization in predictive business process monitoring.",
            "Preface to the EDOC 2016 Special Issue.",
            "Characterization of trade-off preferences between non-functional properties.",
            "Root cause analysis in IT infrastructures using ontologies and abduction in Markov Logic Networks.",
            "Decentralized enforcement of document lifecycle constraints.",
            "Parallel algorithms for the automated discovery of declarative process models.",
            "Reasoning about attribute value equivalence in relational data.",
            "Schema profiling of document-oriented databases.",
            "VazaDengue: An information system for preventing and combating mosquito-borne diseases with social networks.",
            "Position prediction system based on spatio-temporal regularity of object mobility.",
            "Computational methods and optimizations for containment and complementarity in web data cubes.",
            "BLOSS: Effective meta-blocking with almost no effort.",
            "Guided Process Discovery - A pattern-based approach.",
            "Grammar-based graph compression.",
            "Performance prediction and adaptation for database management system workload using Case-Based Reasoning approach.",
            "Scalable approximate query tracking over highly distributed data streams with tunable accuracy guarantees.",
            "SQL schema design: foundations, normal forms, and normalization.",
            "Improving random forests by neighborhood projection for effective text classification.",
            "Mobile application user behavior in the developing countries: A survey in Iran.",
            "Scalable prediction-based online anomaly detection for smart meter data.",
            "Evaluating the quality of a set of modelling languages used in combination: A method and a tool.",
            "Querying spatial data by dominators in neighborhood.",
            "Interactive multidimensional modeling of linked data for exploratory OLAP.",
            "Interest-driven discovery of local process models.",
            "Trustor clustering with an improved recommender system based on social relationships.",
            "SharesSkew: An algorithm to handle skew for joins in MapReduce.",
            "A new technique of selecting an optimal blocking method for better record linkage.",
            "A case-based reasoning approach to reuse quality-driven designs in service-oriented architectures.",
            "A compact representation for trips over networks built on self-indexes.",
            "Multidimensional query reformulation with measure decomposition.",
            "An efficient similarity-based approach for comparing XML documents.",
            "Providing recommendations in social networks by integrating local and global reputation.",
            "Discovering and learning sensational episodes of news events.",
            "Editorial special issue: Selected papers of BPM 2016.",
            "Checking process compliance against natural language specifications using behavioral spaces.",
            "To aggregate or to eliminate? Optimal model simplification for improved process performance prediction.",
            "Semantics, Analysis and Simplification of DMN Decision Tables.",
            "Dynamic skipping and blocking, dead path elimination for cyclic workflows, and a local semantics for inclusive gateways.",
            "On the relevance of a business constraint to an event log.",
            "Foreword to the special issue on mining actionable insights from social networks.",
            "The effects of data quality on the analysis of corporate board interlock networks.",
            "Detecting prominent microblog users over crisis events phases.",
            "Investment recommendation by discovering high-quality opinions in investor based social networks.",
            "Mining authoritative and topical evidence from the blogosphere for improving opinion retrieval.",
            "Influence-based approach to market basket analysis."
        ]
    },
    {
        "name": "IS",
        "year": "2017",
        "info": "2017: Volumes\n63,\n64,\n65,\n66,\n67,\n68,\n69,\n70,\n71,\n72",
        "count": 116,
        "papers": [
            "Persisting big-data: The NoSQL landscape.",
            "Gravitating to rigidity: Patterns of schema evolution - and its absence - in the lives of tables.",
            "Cost-benefit analysis of data warehouse design methodologies.",
            "Big Data Management: New Frontiers, New Paradigms.",
            "Comparing columnar, row and array DBMSs to process recursive queries on graphs.",
            "Data generator for evaluating ETL process quality.",
            "A K-partitioning algorithm for clustering large-scale spatio-textual data.",
            "Information system for image classification based on frequency curve proximity.",
            "Partitioning road networks using density peak graphs: Efficiency vs. accuracy.",
            "Verifying goal-oriented specifications used in model-driven development processes.",
            "Skewed distributions in semi-stream joins: How much can caching help?",
            "Exploratory product search using top-k join queries.",
            "Result Merging for Structured Queries on the Deep Web with Active Relevance Weight Estimation.",
            "TopPI: An efficient algorithm for item-centric mining.",
            "Influence-based Twitter browsing with NavigTweet.",
            "Event log imperfection patterns for process mining: Towards a systematic approach to cleaning event logs.",
            "Preface.",
            "Approximate furthest neighbor with application to annulus query.",
            "Vector-based similarity measurements for historical figures.",
            "Improving matrix-based dynamic programming on massively parallel accelerators.",
            "A polygraph test for trustworthy structural similarity.",
            "An empirical evaluation of intrinsic dimension estimators.",
            "Mining Urban Data (Part C).",
            "Crowdsourcing turning-restrictions from map-matched trajectories.",
            "Never drive alone: Boosting carpooling with network analysis.",
            "Dynamic route planning with real-time traffic predictions.",
            "Traveling time prediction in scheduled transportation with journey segments.",
            "Forecasting smog-related health hazard based on social media and physical sensor.",
            "Crowdsourcing emergency data in non-operational cellular networks.",
            "An on-line algorithm for cluster detection of mobile nodes through complex event processing.",
            "Efficient techniques for time-constrained information dissemination using location-based social networks.",
            "MyWay: Location prediction via mobility profiling.",
            "Shaping City Neighborhoods Leveraging Crowd Sensors.",
            "Preface to BPM 2015.",
            "A framework for visually monitoring business process compliance.",
            "Controlled violation of temporal process constraints - Models, algorithms and results.",
            "Resolving inconsistencies and redundancies in declarative process models.",
            "Comparing textual descriptions to process models - The automatic detection of inconsistencies.",
            "Data mining approach to monitoring the requirements of the job market: A case study.",
            "Latent ranking analysis using pairwise comparisons in crowdsourcing platforms.",
            "An efficient approach to finding potential products continuously.",
            "A survey of official online sources of high-quality free-of-charge geospatial data for maritime geographic information systems applications.",
            "Modeling user interest in social media using news media and wikipedia.",
            "An evaluation of combinations of lossy compression and change-detection approaches for time-series data.",
            "Metagit: Decentralised metadata management with Git.",
            "Finding k most influential edges on flow graphs.",
            "Change visualisation: Analysing the resource and timing differences between two event logs.",
            "Multi-source uncertain entity resolution: Transforming holocaust victim reports into people.",
            "Parallel meta-blocking for scaling entity resolution over big heterogeneous data.",
            "The Performance Metric for Enterprise Service Bus (ESB) in SOA system: Theoretical underpinnings and empirical illustrations for information processing.",
            "Healthcare support for underserved communities using a mobile social media platform.",
            "Upscaledb: Efficient integer-key compression in a key-value store using SIMD instructions.",
            "Formal concept analysis for topic detection: A clustering quality experimental analysis.",
            "A systematic literature review on the architecture of business process management systems.",
            "Design and evaluation of virtual environments mechanisms to support remote collaboration on complex process diagrams.",
            "Handling multi-dimensional complex queries in key-value data stores.",
            "HESML: A scalable ontology-based semantic similarity measures library with a set of reproducible experiments and a replication dataset.",
            "An empirical study of transaction throughput thrashing across multiple relational DBMSes.",
            "A shape-based adaptive segmentation of time-series using particle swarm optimization.",
            "Answering top-K query combined keywords and structural queries on RDF graphs.",
            "Patterns for emerging application integration scenarios: A survey.",
            "Dynamic priority scheduling of periodic queries in on-demand data dissemination systems.",
            "Product functional information based automatic patent classification: Method and experimental studies.",
            "ReX: Representative extrapolating relational databases.",
            "Challenges in migrating legacy software systems to the cloud - an empirical study.",
            "Linguistic summarization of event logs - A practical approach.",
            "Special issue on DOLAP 2015: Evolving data warehousing and OLAP cubes to big data analytics.",
            "Category- and selection-enabled nearest neighbor joins.",
            "SETL: A programmable semantic extract-transform-load framework for semantic data warehouses.",
            "Eco-Physic: Eco-Physical design initiative for very large databases.",
            "Extending the framework for mobile health information systems Research: A content analysis.",
            "HarVis: An integrated social media content analysis framework for YouTube platform.",
            "A Two-Stage Machine learning approach for temporally-robust text classification.",
            "A decision support framework for identifying novel ideas in new product development from cross-domain analysis.",
            "Discovering public sentiment in social media for predicting stock movement of publicly listed companies.",
            "Uniform data access platform for SQL and NoSQL database systems.",
            "Compressed representation of dynamic binary relations with applications.",
            "Dispersed decision-making system with fusion methods from the rank level and the measurement level - A comparative study.",
            "MR-SimLab: Scalable subgraph selection with label similarity for big data.",
            "To use or not to use: Modelling end user grumbling as user resistance in pre-implementation stage of enterprise resource planning system.",
            "Shrink: Distance preserving graph compression.",
            "Editorial to a Special Section on Information Fusion in Internet of Things.",
            "Semantic interoperability with heterogeneous information systems on the internet through automatic tabular document exchange.",
            "Advances in Databases and Information Systems.",
            "A scalable dynamic programming scheme for the computation of optimal k-segments for ordered data.",
            "Efficient processing of shortest path queries in evolving graph sequences.",
            "Inference control of open relational queries under closed-world semantics based on theorem proving.",
            "Distributed snapshot maintenance in wide-column NoSQL databases using partitioned incremental ETL pipelines.",
            "A comparative study of existing quality measures for process discovery.",
            "Transforming unstructured natural language descriptions into measurable process performance indicators using Hidden Markov Models.",
            "A novel ensemble learning approach to unsupervised record linkage.",
            "ViewDF: Declarative incremental view maintenance for streaming data.",
            "The Social Relation Key: A new paradigm for security.",
            "Security towards the edge: Sticky policy enforcement for networked smart objects.",
            "DynamiCITY: Revealing city dynamics from citizens social media broadcasts.",
            "Deployment strategies for crowdsourcing text creation.",
            "Power to the patients: The HealthNetsocial network.",
            "Rule-based spreadsheet data transformation from arbitrary to relational tables.",
            "What surprises does your past have for you?",
            "Mobile recommendations based on interest prediction from consumer's installed apps-insights from a large-scale field study.",
            "Efficiently answer top-k queries on typed intervals.",
            "Energy-efficient air-indices for shortest path and distance queries on road networks.",
            "Privacy preserving record linkage in the presence of missing values.",
            "Merging event logs: Combining granularity levels for process flow analysis.",
            "An assessment of open relation extraction systems for the semantic web.",
            "Formulating and managing viable SLAs in cloud computing from a small to medium service provider's viewpoint: A state-of-the-art review.",
            "Supporting secure keyword search in the personal cloud.",
            "Context-aware recommender systems in mobile environment: On the road of future research.",
            "Benchmarking real-time vehicle data streaming models for a smart city.",
            "Designing business capability-aware configurable process models.",
            "A large-scale study of cultural differences using urban data about eating and drinking preferences.",
            "CLAP, ACIR and SCOOP: Novel techniques for improving the performance of dynamic Metric Access Methods.",
            "On the application of model-driven engineering in data reengineering.",
            "Distributed clustering of categorical data using the information bottleneck framework.",
            "Scalable and queryable compressed storage structure for raster data.",
            "Privacy preserving mechanisms for optimizing cross-organizational collaborative decisions based on the Karmarkar algorithm."
        ]
    },
    {
        "name": "IS",
        "year": "2016",
        "info": "2016: Volumes\n55,\n56,\n57,\n58,\n59,\n60,\n61,\n62",
        "count": 78,
        "papers": [
            "Combining user and database perspective for solving keyword queries over relational databases.",
            "A novel digital information service for federating distributed digital entities.",
            "Efficient and flexible algorithms for monitoring distance-based outliers over data streams.",
            "Efficient processing of enumerative set-based queries.",
            "Social networks and information retrieval, how are they converging? A survey, a taxonomy and an analysis of social information retrieval approaches and platforms.",
            "Formalism for a multiresolution time series database model.",
            "A tool for producing structured interoperable data from product features on the web.",
            "Modelling families of business process variants: A decomposition driven method.",
            "Practical compressed string dictionaries.",
            "Streamlining patient consultations for sleep disorders with a knowledge-based CDSS.",
            "Exploiting multimodal interactions in recommender systems with ensemble algorithms.",
            "Corrigendum to \"A commitment-based reference ontology for services\" [IS 54C (2015) 263-288].",
            "Preventing database schema extraction by error message handling.",
            "Tree edit distance: Robust and memory-efficient.",
            "Linked Open Models: Extending Linked Open Data with conceptual model information.",
            "S2CX: From relational data via SQL/XML to (Un-)Compressed XML.",
            "RkNN query integrity with influence zone.",
            "Preface to BPM 2014.",
            "A general process mining framework for correlating, predicting and clustering dynamic behavior based on event logs.",
            "Efficient discovery of Target-Branched Declare constraints.",
            "BPMN Miner: Automated discovery of BPMN process models with hierarchical structure.",
            "Diagnosing behavioral differences between business process models: An approach based on event structures.",
            "Property specification, process verification, and reporting - A case study with vehicle-commissioning processes.",
            "Analysis and improvement of business process models using spreadsheets.",
            "XBRL formula specification in the multidimensional data model.",
            "Process time patterns: A formal foundation.",
            "A simple deterministic algorithm for guaranteeing the forward progress of transactions.",
            "Mining Urban Data (Part B).",
            "Home is where your friends are: Utilizing the social graph to locate twitter users in a city.",
            "A rapid-prototyping framework for extracting small-scale incident-related information in microblogs: Application of multi-label classification on tweets.",
            "GeoSRS: A hybrid social recommender system for geolocated data.",
            "Situation monitoring of urban areas using social media data streams.",
            "Identifying K Primary Corridors from urban bicycle GPS trajectories on a road network.",
            "Urban navigation beyond shortest route: The case of safe paths.",
            "Leveraging spatial abstraction in traffic analysis and forecasting with visual analytics.",
            "Detection of radioactive sources in urban scenes using Bayesian Aggregation of data from mobile spectrometers.",
            "Labeling sensing data for mobility modeling.",
            "City data dating: Emerging affinities between diverse urban datasets.",
            "Containment for queries over trees with attribute value comparisons.",
            "Determining serialization order for serializable snapshot isolation.",
            "A fully persistent and consistent read/write cache using flash-based general SSDs for desktop workloads.",
            "A secure and quality-aware prototypical architecture for the Internet of Things.",
            "Network-based social coordination of business processes.",
            "IoT-enabled emergency information supply chain architecture for elderly people: The Australian context.",
            "Dealing with the new user cold-start problem in recommender systems: A comparative review.",
            "PaMeCo join: A parallel main memory compact hash join.",
            "Preface.",
            "Efficient similarity search within user-specified projective subspaces.",
            "Faster proximity searching with the distal SAT.",
            "New dynamic metric indices for secondary memory.",
            "The similarity-aware relational database set operators.",
            "A collaborative approach to computational reproducibility.",
            "Reproducible experiments on dynamic resource allocation in cloud data centers.",
            "Single-pass and linear-time k-means clustering based on MapReduce.",
            "Complex log file synthesis for rapid sandbox-benchmarking of security- and computer network analysis tools.",
            "Aggregated 2D range queries on clustered points.",
            "Singleton indexes for nearest neighbor search.",
            "FP-Hadoop: Efficient processing of skewed MapReduce jobs.",
            "Declarative semantics of transactions in ORM.",
            "A framework for social commerce design.",
            "Modeling dynamic relationship types for subsets of entity type instances and across entity types.",
            "Universal indexes for highly repetitive document collections.",
            "Group meetup in the presence of obstacles.",
            "Benchmarking regression algorithms for income prediction modeling.",
            "Process-aware approach for managing organisational knowledge.",
            "AUPS: An Open Source AUthenticated Publish/Subscribe system for the Internet of Things.",
            "Do activity lifecycles affect the validity of a business rule in a business process?",
            "SNCStream+: Extending a high quality true anytime data stream clustering algorithm.",
            "On learning web information extraction rules with TANGO.",
            "Combining unit and specification-based testing for meta-model validation and verification.",
            "Efficient multiple bichromatic mutual nearest neighbor query processing.",
            "SBH: Super byte-aligned hybrid bitmap compression.",
            "Preface to CAISE 2015.",
            "CyLog/Game aspect: An approach to separation of concerns in crowdsourced data management.",
            "Conformance checking and performance improvement in scheduled processes: A queueing-network perspective.",
            "An evaluation of the run-time and task-based performance of event detection techniques for Twitter.",
            "Detecting complex changes and refactorings during (Meta)model evolution.",
            "Augmenting process elicitation with visual priming: An empirical exploration of user behaviour and modelling outcomes."
        ]
    },
    {
        "name": "IS",
        "year": "2015",
        "info": "2015: Volumes\n47,\n48,\n49,\n50,\n51,\n52,\n53,\n54",
        "count": 126,
        "papers": [
            "Feasibility and effort estimation models for medium and small size information mining projects.",
            "The wavelet matrix: An efficient wavelet tree for large alphabets.",
            "Conceptual independence: A design principle for the construction of adaptive information systems.",
            "A view framework for modeling and change validation of artifact-centric inter-organizational business processes.",
            "A new verification technique for large processes based on identification of relevant tasks.",
            "The rise of \"big data\" on cloud computing: Review and open research issues.",
            "An effective candidate generation method for improving performance of edit similarity query processing.",
            "The generic model query language GMQL - Conceptual specification, implementation, and runtime evaluation.",
            "Top-k-size keyword search on tree structured data.",
            "Special issue: Selected papers of BPM 2012.",
            "The relationship between workflow graphs and free-choice workflow nets.",
            "Model repair - aligning process models to reality.",
            "Information leak detection in business process models: Theory, application, and tool support.",
            "An alignment-based framework to check the conformance of declarative process models and to preprocess event-log data.",
            "An impact-oriented maturity model for IT-based case management.",
            "EVA: An event algebra supporting complex event specification.",
            "Compliance validation and diagnosis of business data constraints in business processes at runtime.",
            "Profile Diversity for Query Processing using User Recommendations.",
            "On recommendation problems beyond points of interest.",
            "A fast MST-inspired kNN-based outlier detection method.",
            "On the undecidability of the equivalence of second-order tuple generating dependencies.",
            "Special section on collaborative big data.",
            "Collaborative and secure sharing of healthcare data in multi-clouds.",
            "An analytics appliance for identifying (near) optimal over-the-counter medicine products as health indicators for influenza surveillance.",
            "A novel policy-driven reversible anonymisation scheme for XML-based services.",
            "Special section on Cloud Intelligence: Editorial.",
            "SPARQL in the cloud using Rya.",
            "A secure data sharing and query processing framework via federation of cloud computing.",
            "Density-based data partitioning strategy to approximate large-scale subgraph mining.",
            "Special section on Papers from Advanced and Applied Convergence ISAAC 2013: Editorial.",
            "Performance analysis of DNS-assisted global mobility management scheme in cost-optimized proxy mobile IPv6 Networks.",
            "A study on the monitoring model development for quality measurement of internet traffic.",
            "Multiscale rank-based ordered dither algorithm for digital halftoning.",
            "Cost-effective approach inter-LMA domain management and distributed mobility control scheme in proxy mobile IPv6 networks.",
            "An effect of phase noise for an indoor wireless system.",
            "Transmitting scalable video coding using VLC with color and dimming control to assure QoS.",
            "The method to secure scalability and high density in cloud data-center.",
            "A variable-precision information-entropy rough set approach for job searching.",
            "Rough set approach for clustering categorical data using information-theoretic dependency measure.",
            "An interactive image clipping system using hand motion recognition.",
            "The emission characteristics and interference analysis of Power Line Telecommunication.",
            "Design of sub-threshold current memory circuit for low power ADC.",
            "Effective scalable video streaming transmission with TBS algorithm in an MC-CDMA system.",
            "Hybrid wireless sensor network for building energy management systems based on the 2.4 GHz and 400 MHz bands.",
            "Fuzzy-logic-based channel selection in IEEE 802.22 WRAN.",
            "Dealing with change in process choreographies: Design and implementation of propagation algorithms.",
            "Inverted index maintenance strategy for flashSSDs: Revitalization of in-place index update strategy.",
            "Predicting software future sustainability: A longitudinal perspective.",
            "Supporting set-valued joins in NoSQL using MapReduce.",
            "A principled approach to context schema evolution in a data management perspective.",
            "Detecting approximate clones in business process model repositories.",
            "Efficient formalization of railway interlocking data in RailML.",
            "On using broadcast index for efficient execution of shortest path continuous queries.",
            "The usage of best practices and procedures in the database community.",
            "Contextual preference mining for user profile construction.",
            "Social workflows - Vision and potential study.",
            "A geometric framework for data fusion in information retrieval.",
            "On the usefulness and ease of use of a model-driven Method Engineering approach.",
            "An ant colony optimisation approach for optimising SPARQL queries by reordering triple patterns.",
            "Implementation of integrated OBD-II connector with external network.",
            "A stochastic approach to group recommendations in social media systems.",
            "Data structures for temporal graphs based on compact sequence representations.",
            "A distance based time series classification framework.",
            "Near neighbor searching with K nearest references.",
            "Software defect prediction using a cost sensitive decision forest and voting, and a potential solution to the class imbalance problem.",
            "Exploiting velocity distribution skew to speed up moving object indexing.",
            "Incorporating ontology-based semantics into conceptual modelling.",
            "Cost-based holistic twig joins.",
            "CEP-traj: An event-based solution to process trajectory data.",
            "Specification and automated design-time analysis of the business process human resource perspective.",
            "More than bin packing: Dynamic resource allocation strategies in cloud data centers.",
            "SOFA: An extensible logical optimizer for UDF-heavy data flows.",
            "Corrigendum to \"Best position algorithms for efficient top-k query processing\" [Inf. Syst 36(6) (2011) 973-989].",
            "Preface.",
            "Similarity sets: A new concept of sets to seamlessly handle similarity in database management systems.",
            "Similarity Joins: Their implementation and interactions with other database operators.",
            "Quantized ranking for permutation-based indexing.",
            "A comparison of pivot selection techniques for permutation-based indexing.",
            "Quicker range- and k-NN joins in metric spaces.",
            "Technology adoption: A conjoint analysis of consumers' preference on future online banking services.",
            "Time-series clustering - A decade review.",
            "Advances in data warehousing and OLAP in the big Data Era.",
            "Clustering binary cube dimensions to compute relaxed GROUP BY aggregations.",
            "CineCubes: Aiding data workers gain insights from OLAP queries.",
            "Advanced topic modeling for social business intelligence.",
            "Handling measurement function changes with Slowly Changing Measures.",
            "INDREX: In-database relation extraction.",
            "Information integrity in smart grid systems.",
            "Integrated smart grid systems security threat model.",
            "Short term power load prediction with knowledge transfer.",
            "Allocative and strategic effects of privacy enhancement in smart grids.",
            "An effective countermeasure against traffic analysis attacks in wide area measurement systems.",
            "A hierarchical optimization model for energy data flow in smart grid power systems.",
            "Identification of vulnerable node clusters against false data injection attack in an AMI based Smart Grid.",
            "Scalable end-to-end security for advanced metering infrastructures.",
            "Wavelet based steganographic technique to protect household confidential information and seal the transmitted smart grid readings.",
            "Role-based access control for substation automation systems using XACML.",
            "Special issue on advanced information systems engineering.",
            "An ontological framework for situation-aware access control of software services.",
            "Queue mining for delay prediction in multi-class service processes.",
            "Automating data exchange in process choreographies.",
            "GoBIS: An integrated framework to analyse the goal and business process perspectives in information systems.",
            "Metrics for measuring complexity and completeness for social goal models.",
            "Growing up with stability: How open-source relational databases evolve.",
            "Prediction of business process durations using non-Markovian stochastic Petri nets.",
            "Challenges of Enterprise Resource Planning implementation in Iran large organizations.",
            "Parity Resynchronization using a Block-level Journaling for Software RAID.",
            "Impact analysis and change propagation in service-oriented enterprises: A systematic review.",
            "Individual privacy constraints on time-series data.",
            "Reverse nearest neighbor search with a non-spatial aspect.",
            "Mining urban data (part A).",
            "Dynamics of the urban lightscape.",
            "CrowdPulse: A framework for real-time semantic analysis of social streams.",
            "Mining citizen emotions to estimate the urgency of urban issues.",
            "Mining moving patterns for predicting next location.",
            "Real-time traffic incident detection using a probabilistic topic model.",
            "Guest editorial: Enterprise computing.",
            "Formalising natural language specifications using a cognitive linguistic/configuration based approach.",
            "Compliance monitoring in business processes: Functionalities, application, and tool-support.",
            "Modeling resources and capabilities in enterprise architecture: A well-founded ontology-based proposal for ArchiMate.",
            "A commitment-based reference ontology for services.",
            "A multi-level approach to modeling language extension in the Enterprise Systems Domain.",
            "Cloud Intelligence.",
            "Bloofi: Multidimensional Bloom filters.",
            "Efficient skyline query processing in SpatialHadoop.",
            "Tuning small analytics on Big Data: Data partitioning and secondary indexes in the Hadoop ecosystem."
        ]
    },
    {
        "name": "IS",
        "year": "2014",
        "info": "2014: Volumes\n39,\n40,\n41,\n42,\n43,\n44,\n45,\n46",
        "count": 76,
        "papers": [
            "Scalable skyline computation using a balanced pivot selection technique.",
            "An event-based notification approach for the delivery of patient medical information.",
            "Automated runtime repair of business processes.",
            "Integrating domain heterogeneous data sources using decomposition aggregation queries.",
            "Configuration vs. adaptation for business process variant maintenance: An empirical study.",
            "Simplifying process model abstraction: Techniques for generating model names.",
            "Compact representation of Web graphs with extended functionality.",
            "An event-based platform for collaborative threats detection and monitoring.",
            "Optimization issues of querying and evolving sensor and stream databases.",
            "Adaptive stratified reservoir sampling over heterogeneous data streams.",
            "Supporting historic queries in sensor networks with flash storage.",
            "Mining frequent itemsets in a stream.",
            "Top-k/w publish/subscribe: A publish/subscribe model for continuous top-k processing over data streams.",
            "Detecting and monitoring abrupt emergences and submergences of episodes over data streams.",
            "Approximation trade-offs in a Markovian stream warehouse: An empirical study.",
            "A new method for mining disjunctive emerging patterns in high-dimensional datasets using hypergraphs.",
            "Using a knowledge learning framework to predict errors in database design.",
            "On generating ⁎-sound nets with substitution.",
            "Efficient processing of label-constraint reachability queries in large graphs.",
            "MSSQ: Manhattan Spatial Skyline Queries.",
            "Performance of program modification techniques that ensure serializable executions with snapshot isolation DBMS.",
            "Process-oriented case-based reasoning.",
            "Facilitating representation and retrieval of structured cases: Principles and toolkit.",
            "Similarity assessment and efficient retrieval of semantic workflows.",
            "Retrieval and clustering for supporting business process adjustment and analysis.",
            "Case-based adaptation of workflows.",
            "Automatic case acquisition from texts for process-oriented case-based reasoning.",
            "Template-Based Design in COLIBRI Studio.",
            "An efficient algorithm for computing safe exit points of moving range queries in directed road networks.",
            "Generating the fewest redundancy-free scheme trees from acyclic conceptual-model hypergraphs in polynomial time.",
            "Hybrid query execution engine for large attributed graphs.",
            "Target-driven merging of taxonomies with Atom.",
            "DBCURE-MR: An efficient density-based clustering algorithm for large data using MapReduce.",
            "A framework for user driven data management.",
            "TWILITE: A recommendation system for Twitter using a probabilistic model based on latent Dirichlet allocation.",
            "The efficient management of Park resources: Natural and cultural data in the Alpi Marittime Park area.",
            "Scalable visibility color map construction in spatial databases.",
            "Assessing single-pair similarity over graphs by aggregating first-meeting probabilities.",
            "Top-n query processing in spatial databases considering bi-chromatic reverse k-nearest neighbors.",
            "CRISTAL: A practical study in designing systems to cope with change.",
            "On solving efficiently the view selection problem under bag and bag-set semantics.",
            "Searching continuous nearest neighbors in road networks on the air.",
            "How to guarantee compliance between workflows and product lifecycles?",
            "On indexing metric spaces using cut-regions.",
            "Two decades of Web application testing - A survey of recent advances.",
            "k-Nearest neighbor searching in hybrid spaces.",
            "Preface.",
            "On modeling context-aware social collaboration processes.",
            "Validation of user intentions in process orchestration and choreography.",
            "Agile requirements engineering via paraconsistent reasoning.",
            "Uniform access to NoSQL systems.",
            "Continuous visible k nearest neighbor query on moving objects.",
            "Outlier detection in audit logs for application systems.",
            "Managing heterogeneous datasets.",
            "Data preparation for KDD through automatic reasoning based on description logic.",
            "Direct neighbor search.",
            "Editorial.",
            "A requirement-driven approach to the design and evolution of data warehouses.",
            "Discovering OLAP dimensions in semi-structured data.",
            "Parallel online spatial and temporal aggregations on multi-core CPUs and many-core GPUs.",
            "On-demand re-optimization of integration flows.",
            "On the data complexity of relative information completeness.",
            "Editorial.",
            "Analyzing and dynamically indexing the query set.",
            "Static-to-dynamic transformation for metric indexing structures (extended version).",
            "Approximate nearest neighbor algorithm based on navigable small world graphs.",
            "Viral marketing for dedicated customers.",
            "A framework for data quality aware query systems.",
            "Identification of ontologies to support information systems development.",
            "What stakeholders will or will not say: A theoretical and empirical study of topic importance in Requirements Engineering elicitation interviews.",
            "Editorial.",
            "Controlled automated discovery of collections of business process models.",
            "Single-Entry Single-Exit decomposed conformance checking.",
            "Bridging abstraction layers in process mining.",
            "Modeling and execution of event stream processing in business processes.",
            "Splitting GSM schemas: A framework for outsourcing of declarative artifact systems."
        ]
    },
    {
        "name": "IS",
        "year": "2013",
        "info": "Volume 38, 2013",
        "count": 75,
        "papers": [
            "Improving the quality of predictions using textual information in online user reviews.",
            "Eco-informatics modelling via semantic inference.",
            "Algorithms for anomaly detection of traces in logs of process aware information systems.",
            "CARVE: Context-aware automatic view definition over relational databases.",
            "Efficient and scalable continuous skyline monitoring in two-tier streaming settings.",
            "Sequence optimization for media objects with due date constraints in multimedia presentations from digital libraries.",
            "Equally contributory privacy-preserving k-means clustering over vertically partitioned data.",
            "Practical perfect hashing in nearly optimal space.",
            "Probabilistic filters: A stream protocol for continuous probabilistic queries.",
            "A unified description language for human to automated services.",
            "Web-based closed-domain data extraction on online advertisements.",
            "Recommending multimedia web services in a multi-device environment.",
            "Histograms as statistical estimators for aggregate queries.",
            "Toward a user-oriented recommendation system for real estate websites.",
            "Consistent query answering under spatial semantic constraints.",
            "Efficient processing of probabilistic group subspace skyline queries in uncertain databases.",
            "The Farthest Spatial Skyline Queries.",
            "An evolutionary approach to complex schema matching.",
            "Enhancing density-based clustering: Parameter reduction and outlier detection.",
            "Mining neighbor-based patterns in data streams.",
            "Management and storage of in situ oceanographic data: An ECM-based approach.",
            "Efficient computation of combinatorial skyline queries.",
            "Temporal contexts: Effective text classification in evolving document collections.",
            "Efficient derivation of numerical dependencies.",
            "Countering overlapping rectangle privacy attack for moving kNN queries.",
            "Cost-aware query planning for similarity search.",
            "On the definition and design-time analysis of process performance indicators.",
            "On the privacy offered by (k, δ)-anonymity.",
            "Cost effectiveness of commercial computing clouds.",
            "On contextual ranking queries in databases.",
            "A data-mining approach to preference-based data ranking founded on contextual information.",
            "Editorial.",
            "Auction-based crowdsourcing supporting skill management.",
            "On the equivalence of incremental and fixpoint semantics for business artifacts with Guard-Stage-Milestone lifecycles.",
            "Simplifying discovered process models in a controlled manner.",
            "Compliance by design for artifact-centric business processes.",
            "Fast detection of exact clones in business process model repositories.",
            "Space-efficient representations of rectangle datasets supporting orthogonal range querying.",
            "Incrementally improving dataspaces based on user feedback.",
            "Forward to the special issue on vocabularies, ontologies and rules for the enterprise.",
            "An ontology-based analysis and semantics for organizational structure modeling in the ARIS method.",
            "Modeling and validation of business process families.",
            "An approach for sub-ontology evolution in a distributed health care enterprise.",
            "A semantic metrics suite for evaluating modular ontologies.",
            "Concept maps as the first step in an ontology construction method.",
            "An approach for grounding ontologies in raw data using foundational ontology.",
            "Learning to crawl deep web.",
            "Comparing top-k XML lists.",
            "FACETS: A cognitive business intelligence system.",
            "Optimizing XML queries: Bitmapped materialized views vs. indexes.",
            "Introduction to the special issue on data quality.",
            "Cross-lingual entity matching and infobox alignment in Wikipedia.",
            "MFIBlocks: An effective blocking algorithm for entity resolution.",
            "Scheduling strategies for efficient ETL execution.",
            "A taxonomy of privacy-preserving record linkage techniques.",
            "A maintenance centric approach to the view selection problem.",
            "Ptolemaic access methods: Challenging the reign of the metric space model.",
            "Probabilistic enhancement of approximate indexing in metric spaces.",
            "Succinct nearest neighbor search.",
            "How collaborative technology supports cognitive processes in collaborative process modeling: A capabilities-gains-outcome model.",
            "Version management for business process schema evolution.",
            "SVOIS: Support Vector Oriented Instance Selection for text classification.",
            "Efficient co-processor utilization in database query processing.",
            "A process-oriented methodology for evaluating the impact of IT: A proposal and an application in healthcare.",
            "Followee recommendation based on text analysis of micro-blogging activity.",
            "Reusable abstractions for modeling languages.",
            "XML tree structure compression using RePair.",
            "UpSizeR: Synthetically scaling an empirical relational database.",
            "Advances in Managing, Updating and Querying Uncertain and Imprecise Sensor and Stream Databases.",
            "Recognizing patterns in streams with imprecise timestamps.",
            "Probabilistic skyline operator over sliding windows.",
            "CIRCE: Correcting Imprecise Readings and Compressing Excrescent points for querying common patterns in uncertain sensor streams.",
            "An integrated framework for managing sensor data uncertainty using cloud computing.",
            "Efficient tracking of moving objects using a relational database.",
            "In-network approximate computation of outliers with quality guarantees."
        ]
    },
    {
        "name": "IS",
        "year": "2012",
        "info": "Volume 37, 2012",
        "count": 49,
        "papers": [
            "View determinacy for preserving selected information in data transformations.",
            "Vague continuous K-nearest neighbor queries over moving objects with uncertain velocity in road networks.",
            "A formal model of the Semantic Web Service Ontology (WSMO).",
            "Folksonomy-based personalized search and ranking in social media services.",
            "Management and engineering of process-aware information systems: Introduction to the special issue.",
            "Perceived consistency between process models.",
            "Business process analysis in healthcare environments: A methodology based on process mining.",
            "Process diagnostics using trace alignment: Opportunities, issues, and challenges.",
            "Discovery and analysis of e-mail-driven business processes.",
            "Browsing museum image collections on a multi-touch table.",
            "Risk assessment in ERP projects.",
            "Understanding user differences in open-source workflow management system usage intentions.",
            "\"Modeling with tools is easier, believe me\" - The effects of tool functionality on modeling grammar usage beliefs.",
            "Identification and classification of ERP critical failure factors in Iranian industries.",
            "A model of fuzzy spatio-temporal knowledge representation and reasoning based on high-level Petri nets.",
            "ArchiMeDeS: A model-driven framework for the specification of service-oriented architectures.",
            "A runtime approach to model-generic translation of schema and data.",
            "The Process Mining Manifesto - An interview with Wil van der Aalst.",
            "Introduction to the Special Issue on Semantic Web Data Management.",
            "An ontology-based retrieval system using semantic indexing.",
            "PoweRGen: A power-law based generator of RDFS schemas.",
            "Ontological query answering under expressive Entity-Relationship schemata.",
            "Quality-aware similarity assessment for entity matching in Web data.",
            "Structured data clouding across multiple webs.",
            "pest: Fast approximate keyword search in semantic data using eigenvector-based term propagation.",
            "Special Issue of DOLAP 2010 Information Systems.",
            "OLAP query reformulation in peer-to-peer data warehousing.",
            "Time-HOBI: Index for optimizing star queries.",
            "Incremental maintenance of materialized views with outerjoins.",
            "On the refactoring of activity labels in business process models.",
            "A unified framework for heterogeneous patterns.",
            "New perspectives in ontological analysis: Guidelines and rules for incorporating modelling languages into UEML.",
            "Cost-sensitive classification with inadequate labeled data.",
            "Business process management.",
            "Structuring acyclic process models.",
            "Distributed orchestration of user interfaces.",
            "How novices design business processes.",
            "Ensuring correctness during process configuration via partner synthesis.",
            "Coordination for fragmented loops and scopes in a distributed business process.",
            "Continuous distance-based skyline queries in road networks.",
            "PBFilter: A flash-based indexing scheme for embedded systems.",
            "A multi-dimensional quality assessment of state-of-the-art process discovery algorithms using real-life event logs.",
            "Core schema mappings: Scalable core computations in data exchange.",
            "Preface.",
            "An iterative approach to synthesize business process templates from compliance rules.",
            "Wiki Scaffolding: Aligning wikis with the corporate strategy.",
            "A trace metamodel proposal based on the model driven architecture framework for the traceability of user requirements in data warehouses.",
            "Behavioral adaptation of information systems through goal models.",
            "From fine-grained to abstract process models: A semantic approach."
        ]
    },
    {
        "name": "IS",
        "year": "2011",
        "info": "Volume 36, 2011",
        "count": 67,
        "papers": [
            "Introduction to the Special Issue on ADBIS 2009.",
            "Cost-based vectorization of instance-based integration processes.",
            "Temporal data classification using linear classifiers.",
            "Maintaining consistent results of continuous queries under diverse window specifications.",
            "Generalizing prefix filtering to improve set similarity joins.",
            "Slicing the metric space to provide quick indexing of complex data in the main memory.",
            "Tool support for the design and management of context models.",
            "Editorial.",
            "Using semantic techniques to access web data.",
            "Aggregated search of data and services.",
            "MashUp web data sources and services based on semantic queries.",
            "A unified multimedia and semantic perspective for data retrieval in the semantic web.",
            "Automatic generation of probabilistic relationships for improving schema matching.",
            "Improving the usability of standard schemas.",
            "Building a peer-to-peer content distribution network with high performance, scalability and robustness.",
            "An effective 3-in-1 keyword search method over heterogeneous data sources.",
            "Optimized query routing trees for wireless sensor networks.",
            "Interaction-centric modeling of process choreographies.",
            "Configurable multi-perspective business process models.",
            "theta-Constrained multi-dimensional aggregation.",
            "Finding the least influenced set in uncertain databases.",
            "Collection trees for event-monitoring queries.",
            "Knowledge-based sense disambiguation (almost) for all structures.",
            "A framework for corroborating answers from multiple web sources.",
            "Time prediction based on process mining.",
            "Metric and trigonometric pruning for clustering of uncertain data in 2D geometric space.",
            "Similarity of business process models: Metrics and evaluation.",
            "Product-based workflow support.",
            "Editorial.",
            "A model and architecture for open cross-media annotation and link services.",
            "Semantic based aspect-oriented programming for context-aware Web service composition.",
            "Demaq/Transscale: Automated distribution and scalability for declarative applications.",
            "A hybrid approach for estimating document frequencies in unstructured P2P networks.",
            "Checking determinism of XML Schema content models in optimal time.",
            "Reliable distributed data stream management in mobile environments.",
            "Suffix trees for inputs larger than main memory.",
            "Pyracanthus: A scalable solution for DHT-independent content-based publish/subscribe data networks.",
            "The dark side of the Internet: Attacks, costs and responses.",
            "Preface.",
            "Metric information filtering.",
            "Metric Index: An efficient and scalable solution for precise and approximate similarity search.",
            "Fully dynamic metric access methods based on hyperplane partitioning.",
            "A bounded distance metric for comparing tree structure.",
            "3XL: Supporting efficient operations on very large OWL Lite triple-stores.",
            "An efficient algorithm for the incremental construction of a piecewise linear classifier.",
            "Business policy compliance in service-oriented systems.",
            "Parallel skyline computation on multicore architectures.",
            "Polymorphic queries for P2P systems.",
            "Word co-occurrence features for text classification.",
            "ASAP: Eliminating algorithm-based disclosure in privacy-preserving data publishing.",
            "Human and automatic modularizations of process models to enhance their comprehension.",
            "Ranking uncertain sky: The probabilistic top-k skyline operator.",
            "Skyline and mapping aware join query evaluation.",
            "ARCHITECT: A layered framework for classifying technologies of event-based systems.",
            "Structure and attribute index for approximate graph matching in large graphs.",
            "Best position algorithms for efficient top-k query processing.",
            "Special issue on advanced information systems engineering.",
            "The brave new world of design requirements.",
            "Process compliance analysis based on behavioural profiles.",
            "Soundness verification for conceptual workflow nets with data: Early detection of errors with the most precision possible.",
            "Detecting proximity events in sensor networks.",
            "Towards open ontology learning and filtering.",
            "A quad-tree based multiresolution approach for two-dimensional summary data.",
            "CATCH: A detecting algorithm for coalition attacks of hit inflation in internet advertising.",
            "A personalized summarization of video life-logs from an indoor multi-camera system using a fuzzy rule-based system with domain knowledge.",
            "Corrective classification: Learning from data imperfections with aggressive and diverse classifier ensembling.",
            "Managing contextual preferences."
        ]
    },
    {
        "name": "IS",
        "year": "2010",
        "info": "Volume 35, 2010",
        "count": 53,
        "papers": [
            "Consistent query answers in the presence of universal constraints.",
            "Hypermedia presentation generation in Hera.",
            "Time series analysis with multiple resolutions.",
            "A link-based storage scheme for efficient aggregate query processing on clustered road networks.",
            "Query result caching for multiple event-driven continuous queries.",
            "VASA: An algebra for vague spatial data in databases.",
            "Foreword.",
            "An evidential approach to query interface matching on the deep Web.",
            "Computing certain answers in the presence of dependencies.",
            "A bi-labeling based XPath processing system.",
            "Finding and ranking compact connected trees for effective keyword proximity search in XML documents.",
            "A practical model on controlling the ERP implementation risks.",
            "On social Web sites.",
            "Arrangement of multi-dimensional scalable video data for heterogeneous clients.",
            "Interactive visualization for opportunistic exploration of large document collections.",
            "Competitive advantage of enterprise resource planning vendors in Iran.",
            "Tractable database design and datalog abduction through bounded treewidth.",
            "A reciprocal framework for spatial K-anonymity.",
            "Query rewritings using views for XPath queries, framework, and methodologies.",
            "Mining frequent closed patterns in pointset databases.",
            "Empirical evidence for the usefulness of Armstrong relations in the acquisition of meaningful functional dependencies.",
            "Vocabularies, ontologies, and rules for enterprise and business process modeling and management.",
            "Modeling languages for business processes and business rules: A representational analysis.",
            "Evaluating ontologies: Towards a cognitive measure of quality.",
            "An ontology modelling perspective on business reporting.",
            "From UML/OCL to SBVR specifications: A challenging transformation.",
            "A 'context-aware' and agent-centric perspective for the alignment between individuals and organizations.",
            "Activity labeling in process modeling: Empirical insights and recommendations.",
            "Content value chains modelling using a copyright ontology.",
            "Semantic reengineering of business processes.",
            "Modeling organizational performance indicators.",
            "Information Systems Special Issue on SBBD 2007.",
            "Modeling the web as a hypergraph to compute page reputation.",
            "PaMS: A component-based service for finding the missing full text of articles cataloged in a digital library.",
            "Efficient bulk-loading on dynamic metric access methods.",
            "Tree pattern mining with tree automata constraints.",
            "Modelling and querying geographical data warehouses.",
            "Automated analysis of feature models 20 years later: A literature review.",
            "A meta-index for querying distributed moving object database servers.",
            "Finding an application-appropriate model for XML data warehouses.",
            "Adaptive relaxation for querying heterogeneous XML data sources.",
            "VISTO: A new CBIR system for vector images.",
            "Modeling and mining of dynamic trust in complex service-oriented systems.",
            "A methodology for the semi-automatic creation of data-driven detailed business ontologies.",
            "SPGProfile: Speak Group Profile.",
            "A genetic based disk scheduling method to decrease makespan and missed tasks.",
            "Extracting a largest redundancy-free XML storage structure from an acyclic hypergraph in polynomial time.",
            "Indexing high-dimensional data for main-memory similarity search.",
            "Tuning the ensemble selection process of schema matchers.",
            "Continuous reverse k nearest neighbor monitoring on moving objects in road networks.",
            "Anonymization of moving objects databases by clustering and perturbation.",
            "Optimized algorithms for predictive range and KNN queries on moving objects.",
            "Approximate algorithms with generalizing attribute values for k-anonymity."
        ]
    },
    {
        "name": "IS",
        "year": "2009",
        "info": "Volume 34, 2009",
        "count": 44,
        "papers": [
            "A constraint-based querying system for exploratory pattern discovery.",
            "Theories of meaning in schema matching: An exploratory study.",
            "Personalized top-k skyline queries in high-dimensional space.",
            "GrouPeer: Dynamic clustering of P2P databases.",
            "Toward data mining engineering: A software engineering approach.",
            "Multimedia group and inter-stream synchronization techniques: A comparative study.",
            "KP-Miner: A keyphrase extraction system for English and Arabic documents.",
            "2LP: A double-lazy XML parser.",
            "On optimal scheduling for time-constrained services in multi-channel data dissemination systems.",
            "On the relationship between workflow models and document types.",
            "Multi-query optimization for sketch-based estimation.",
            "P2P OLAP: Data model, implementation and case study.",
            "A software engineering approach to ontology building.",
            "An evolutionary approach for combining different sources of evidence in search engines.",
            "PHIRST: A distributed architecture for P2P information retrieval.",
            "Discovering simulation models.",
            "Node and edge selectivity estimation for range queries in spatial networks.",
            "Query optimization using restructured views: Theory and experiments.",
            "Privacy-preserving naive Bayes classification on distributed data via semi-trusted mixers.",
            "Preface.",
            "Partition-based workload scheduling in living data warehouse environments.",
            "RLH: Bitmap compression technique based on run-length and Huffman encoding.",
            "Evaluating continuous K-nearest neighbor query on moving objects with uncertainty.",
            "Non-redundant sequential rules - Theory and algorithm.",
            "Data-driven memory management for stream join.",
            "Efficiently calculating inbreeding on large pedigrees databases.",
            "Using intrinsic data skew to improve hash join performance.",
            "Exploitation of semantic relationships and hierarchical data structures to support a user in his annotation and browsing activities in folksonomies.",
            "Emerging Cubes: Borders, size estimations and lossless reductions.",
            "Spatial aggregation: Data model and implementation.",
            "Information systems preface.",
            "On the consistent rewriting of conjunctive queries under primary key constraints.",
            "Efficient algorithms for descendant-only tree pattern queries.",
            "Analysis of imperative XML programs.",
            "Efficient inclusion for a class of XML types with interleaving and counting.",
            "A methodology for coupling fragments of XPath with structural indexes for XML documents.",
            "Information systems special issue on ACM CIKM 2007.",
            "A strategy for allowing meaningful and comparable scores in approximate matching.",
            "Correcting queries for XML.",
            "Implementing and evaluating phrasal query suggestions for proximity search.",
            "Using semantic components to search for domain-specific documents: An evaluation from the system perspective and the user perspective.",
            "Exploring models for semantic category verification.",
            "Requirements-oriented methodology for evaluating ontologies.",
            "Metric-based stochastic conceptual clustering for ontologies."
        ]
    },
    {
        "name": "IS",
        "year": "2008",
        "info": "Volume 33, 2008",
        "count": 36,
        "papers": [
            "Clustering spatial networks for aggregate query processing: A hypergraph approach.",
            "Effective protocols for kNN search on broadcast multi-dimensional index trees.",
            "Specification-based data reduction in dimensional data warehouses.",
            "Conformance checking of processes based on monitoring real behavior.",
            "Efficient mining of frequent episodes from complex sequences.",
            "A dimensionality reduction technique for efficient time series similarity analysis.",
            "A cost model to estimate the effort of data mining projects (DMCoMo).",
            "Foreword.",
            "An analysis of XQuery benchmarks.",
            "Toward microbenchmarking XQuery.",
            "An empirical evaluation of XQuery processors.",
            "The implication problem for measure-based constraints.",
            "Continuous subspace clustering in streaming time series.",
            "DFL: A dataflow language based on Petri nets and nested relational calculus.",
            "A framework for ICT standards creation: The case of ITU-T standard H.350.",
            "Mining relational data from text: From strictly supervised to weakly supervised learning.",
            "Zoned-partitioning of tree-like access methods.",
            "Information systems preface.",
            "Efficiently enumerating results of keyword search over data graphs.",
            "Inconsistency tolerance in P2P data integration: An epistemic logic approach.",
            "Dual syntax for XML languages.",
            "The complexity and approximation of fixing numerical attributes in databases under integrity constraints.",
            "On the expressibility of functions in XQuery fragments.",
            "Efficient memory representation of XML document trees.",
            "Querying business processes with BP-QL.",
            "Integrating and querying distributed XML data via XLink.",
            "From conceptual models to schemata: An object-process-based data warehouse construction method.",
            "Editorial.",
            "A research agenda for query processing in large-scale peer data management systems.",
            "A framework for semantic grouping in P2P databases.",
            "PORSCHE: Performance ORiented SCHEma mediation.",
            "Joining the results of heterogeneous search engines.",
            "Behavioral matchmaking for service retrieval: Application to conversation protocols.",
            "Integration of complex archeology digital libraries: An ETANA-DL experience.",
            "Aondê: An ontology Web service for interoperability across biodiversity applications.",
            "A knowledge-based approach to manage information systems interoperability."
        ]
    },
    {
        "name": "IS",
        "year": "2007",
        "info": "Volume 32, 2007",
        "count": 56,
        "papers": [
            "A configurable reference modelling language.",
            "Contextualization as an independent abstraction mechanism for conceptual modeling.",
            "A methodology for a Very Small Data Base design.",
            "Data space mapping for efficient I/O in large multi-dimensional databases.",
            "Evaluation of probabilistic queries over imprecise data in constantly-evolving environments.",
            "Efficient processing of XPath queries using indexes.",
            "Fast similarity join for multi-dimensional data.",
            "Noesis: Towards a situational method engineering technique.",
            "Formalizing the evolution of virtual communities.",
            "Partitioned optimization of complex queries.",
            "An efficient index structure for XML based on generalized suffix tree.",
            "CFP-tree: A compact disk-based structure for storing and querying frequent itemsets.",
            "The leganet system: Freshness-aware transaction routing in a database cluster.",
            "Schema-conscious XML indexing.",
            "DW-RBAC: A formal security model of delegation and revocation in workflow systems.",
            "Location query based on moving behaviors.",
            "Browsing large online data tables using generalized query previews.",
            "Branch-and-bound processing of ranked queries.",
            "Semantic sampling of existing databases through informative Armstrong databases.",
            "Efficient schema-based XML-to-Relational data mapping.",
            "A co-training framework for searching XML documents.",
            "Aldat: A retrospective on a work in progress.",
            "Techniques used and open challenges to the analysis, indexing and retrieval of digital video.",
            "Enabling soft queries for data retrieval.",
            "Exploring phrasal context and error correction heuristics in bootstrapping for geographic named entity annotation.",
            "An efficient location update mechanism for continuous queries over moving objects.",
            "Maintaining large update batches by restructuring and grouping.",
            "The role of information technology in achieving the organisation's strategic development goals: A case study.",
            "Mining association rules in very large clustered domains.",
            "Semantic optimization techniques for preference queries.",
            "Mining unconnected patterns in workflows.",
            "Business process mining: An industrial application.",
            "Efficient in-memory extensible inverted file.",
            "A lattice-based approach for updating access control policies in real-time.",
            "An automated entity-relationship clustering algorithm for conceptual database design.",
            "CILIOS: Connectionist inductive learning and inter-ontology similarities for recommending information agents.",
            "Developing secure data warehouses with a UML extension.",
            "Matching large schemas: Approaches and evaluation.",
            "Combining text and link analysis for focused crawling - An application for vertical search engines.",
            "Product lines for digital information products.",
            "Advances in intelligent information processing.",
            "Fuzzy prototype model and semantic distance.",
            "A new data clustering approach: Generalized cellular automata.",
            "A local-density based spatial clustering algorithm with noise.",
            "Particle model to optimize resource allocation and task assignment.",
            "Conceptual design of remote monitoring and fault diagnosis systems.",
            "A model for selecting an ERP system based on linguistic information processing.",
            "Holistic Join for Generalized Tree Patterns.",
            "Improving process models by discovering decision points.",
            "A new approach to mine frequent patterns using item-transformation methods.",
            "Fast computation of spatial selections and joins using graphics hardware.",
            "Discovering frequent geometric subgraphs.",
            "Interoperation among agent-based information systems through a communication acts ontology.",
            "Indexing schemes for similarity search in datasets of short protein fragments.",
            "Security Attack Testing (SAT) - testing the security of information systems at design time.",
            "Combining Description Logics with synopses for inferring complex knowledge patterns from XML sources."
        ]
    },
    {
        "name": "IS",
        "year": "2006",
        "info": "Volume 31, 2006",
        "count": 43,
        "papers": [
            "Enterprise modeling and Data Warehousing in Telecom Italia.",
            "Conversational querying.",
            "Answering similarity queries in peer-to-peer networks.",
            "The Michigan benchmark: towards XML query performance diagnostics.",
            "On augmenting database design-support environments to capture the geo-spatio-temporal data semantics.",
            "Granularity reduction in temporal document databases.",
            "Erratum to: \"An adaptive path index for XML data using the query workload\": [Information Systems 30(6) (2005) 467-487].",
            "Temporal pre-fetching of dynamic web pages.",
            "Adherence clustering: an efficient method for mining market-basket clusters.",
            "A methodology for clustering XML documents by structure.",
            "The Semantic Web and Web Services.",
            "Topic-specific crawling on the Web with the measurements of the relevancy context graph.",
            "Modeling user interests by conceptual clustering.",
            "Towards semantic-driven, flexible and scalable framework for peering and querying e-catalog communities.",
            "PeCAN: An architecture for users' privacy-aware electronic commerce contexts on the semantic web.",
            "Artemis: Deploying semantically enriched Web services in the healthcare domain.",
            "Composition of Semantic Web services using Linear Logic theorem proving.",
            "Ontology-based methodology for e-service discovery.",
            "A proof markup language for Semantic Web services.",
            "Integration of XML Schemas at various \"severity\" levels.",
            "Incremental maintenance of aggregate and outerjoin expressions.",
            "Integrating XML and CORBA to support collaborative writing using off-the-shelf editing software.",
            "A new range query algorithm for Universal B-trees.",
            "High dimensional nearest neighbor searching.",
            "YAM2: a multidimensional conceptual model extending UML.",
            "Advances in information retrieval: An introduction to the special issue.",
            "Efficient query expansion with auxiliary data structures.",
            "Query performance prediction.",
            "Accurate discovery of co-derivative documents via duplicate text detection.",
            "Negations and document length in logical retrieval.",
            "Answering content and structure-based queries on XML documents using relevance propagation.",
            "Introduction to the special issue on multimedia databases.",
            "A motion-based scene tree for browsing and retrieval of compressed videos.",
            "Complementary information retrieval for cross-media news content.",
            "The priority curve algorithm for video summarization.",
            "A composite approach to automating direct and indirect schema mappings.",
            "The MurMur project: Modeling and querying multi-representation spatio-temporal databases.",
            "Processing approximate aggregate queries in wireless sensor networks.",
            "Spatio-temporal join selectivity.",
            "Evaluating chi-squared automatic interaction detection.",
            "Adaptive cycle management in soft real-time disk retrieval.",
            "Finding recently frequent itemsets adaptively over online transactional data streams, .",
            "Broadcasting and querying multi-dimensional index trees in a multi-channel environment."
        ]
    },
    {
        "name": "IS",
        "year": "2005",
        "info": "Volume 30, 2005",
        "count": 31,
        "papers": [
            "Generating domain representations using a relationship model.",
            "Finding the most interesting correlations in a database: how hard can it be?.",
            "Iterative-improvement-based declustering heuristics for multi-disk databases.",
            "Database classification for multi-database mining.",
            "A comprehensive framework for modeling set-based business rules during conceptual database design.",
            "Entity identification for heterogeneous database integration--a multiple classifier system approach and empirical evaluation.",
            "Decision support queries on a tape-resident data warehouse.",
            "A formal approach to lock escalation.",
            "Algebraic equivalences of nested relational operators.",
            "Neighbor-finding based on space-filling curves.",
            "Sliding window filtering: an efficient method for incremental mining on a time-variant database.",
            "YAWL: yet another workflow language.",
            "Exploiting locality for scalable information retrieval in peer-to-peer networks.",
            "Generating page clippings from web search results using a dynamically terminated genetic algorithm.",
            "Towards practical meta-querying.",
            "DDR: an index method for large time-series datasets.",
            "Specification and validation of process constraints for flexible workflows.",
            "Using BWW model to evaluate building ontologies in CGs formalism.",
            "An architecture for workflow scheduling under resource allocation constraints.",
            "A methodology and tool support for managing business rules in organisations.",
            "Towards a theory of multimedia metacomputing.",
            "An adaptive path index for XML data using the query workload.",
            "Guest editors' introduction: Special issue on the CAiSE 2003 conference.",
            "A generic and customizable framework for the design of ETL scenarios.",
            "Information server for highly-connected cross-media publishing.",
            "On the query refinement in the ontology-based searching for information.",
            "Management applications of the Web Service Offerings Language (WSOL).",
            "Deliberation in a metadata-based modeling and simulation environment for inter-organizational networks.",
            "When security meets software engineering: a case of modelling secure information systems.",
            "Incremental mining of information interest for personalized web scanning.",
            "Modelling hypermedia and web applications: the Ariadne Development Method, ."
        ]
    },
    {
        "name": "IS",
        "year": "2004",
        "info": "Volume 29, 2004",
        "count": 40,
        "papers": [
            "Special issue on web data integration.",
            "Knowledge representation for information integration.",
            "A matching algorithm for measuring the structural similarity between an XML document and a DTD and its applications.",
            "Ontology-based distributed autonomous knowledge systems.",
            "A uniform framework for integration of information from the web.",
            "Erratum to \"Mooshka: a system for the management of multidimensional gene expression data in situ\": [Information Systems 28(4) (2003) 269-285].",
            "Introduction to special issue with best papers from CAiSE 2002.",
            "Service components for managing the life-cycle of service compositions.",
            "Serviceflow beyond workflow? IT support for managing inter-organizational service processes.",
            "Data integration under integrity constraints.",
            "Supporting dimension updates in an OLAP server.",
            "Designing information systems in social context: a goal and scenario modelling approach.",
            "Editorial.",
            "Concurrency control strategies for ordered data broadcast in mobile computing systems.",
            "A role model and its metaclass implementation.",
            "Introduction to special issue with best papers from KDD 2002.",
            "H-MDS: a new approach for interactive visualization with multidimensional scaling in the hyperbolic space.",
            "Selecting the right objective measure for association analysis.",
            "Hierarchical model-based clustering of large datasets through fractionation and refractionation.",
            "Exploiting response models--optimizing cross-sell and up-sell opportunities in banking.",
            "Privacy preserving mining of association rules.",
            "Memory-adaptive association rules mining.",
            "Incremental update on sequential patterns in large databases by implicit merging and efficient counting.",
            "Efficient processing of similarity search under time warping in sequence databases: an index-based approach.",
            "Extending object-oriented databases for fuzzy information modeling.",
            "Special issue on ADBIS 2002: advances in databases and information systems.",
            "Detection of complex temporal patterns over data streams.",
            "Representing and querying histories of semistructured databases using multidimensional OEM.",
            "On approximation measures for functional dependencies.",
            "Adaptive multiversion data broadcast organizations.",
            "Special issue on data quality in cooperative information systems.",
            "Methods for evaluating and creating data quality.",
            "The architecture: a platform for exchanging and improving data quality in cooperative information systems.",
            "Completeness of integrated information sources.",
            "Constraint-based wrapper specification and verification for cooperative information systems.",
            "Trie for similarity matching in large video databases.",
            "Modification semantics in now-relative databases.",
            "Mining interesting association rules from customer databases and transaction databases.",
            "Efficiency and effectiveness of query processing in cluster-based retrieval.",
            "Erratum to: \"Mining for interactive identification of users? information needs\": [Information Systems 28 (2003) 815-833]."
        ]
    },
    {
        "name": "IS",
        "year": "2003",
        "info": "Volume 28, 2003",
        "count": 45,
        "papers": [
            "Introduction to special issue with best papers from EDBT 2002.",
            "Algorithms and applications for universal quantification in relational databases.",
            "Using histograms to estimate answer sizes for XML queries.",
            "Temporal and spatio-temporal aggregations over data streams using multiple time granularities.",
            "Automatic tuning of data synopses.",
            "Efficient OLAP query processing in distributed data warehouses.",
            "Approximated trial and error analysis in scientific databases.",
            "One-pass evaluation of region algebra expressions.",
            "Extracting information from heterogeneous information sources using ontologically specified target views.",
            "Satisfiability of object-oriented database constraints with set and bag attributes.",
            "Why is the snowflake schema a good data warehouse design?",
            "Special issue on data management in bioinformatics.",
            "Cancer classification using gene expression data.",
            "Mooshka: a system for the management of multidimensional gene expression data in situ.",
            "Genomic data modeling.",
            "Design and implementation of a string database query language.",
            "Information technology challenges of biodiversity and ecosystems informatics.",
            "The building of BODHI, a bio-diversity database system.",
            "SAMOS in hindsight: experiences in building an active object-oriented DBMS.",
            "Interactive example-driven integration and reconciliation for accessing database federations.",
            "Multidimensional normal forms for data warehouse design.",
            "Refined rules termination analysis through transactions.",
            "Multi-query optimization for on-line analytical processing.",
            "The Agent-Object-Relationship metamodel: towards a unified view of state and behavior.",
            "Workflow modeling for virtual processes: an order-preserving process-view approach.",
            "Task-role-based access control model.",
            "Building a constraint-based spatial database system: model, languages, and implementation.",
            "Extracting the extended entity-relationship model from a legacy relational database.",
            "Improving the quality of data models: empirical validation of a quality management framework.",
            "Defining specialization for dataflow diagrams.",
            "ERP modeling: a comprehensive approach.",
            "Post-mining: maintenance of association rules by weighting.",
            "Specification of management views in information warehouse projects.",
            "Visualizing graphical and textual formalisms.",
            "Automatic construction of hypertexts for self-referencing: the Hyper-TextBook project.",
            "A filtering method for searching similar multidimensional sequences under the time-warping distance.",
            "Mining for interactive identification of users' information needs.",
            "Experiences using DIKE, a system for supporting cooperative information system and data warehouse design.",
            "Similarity search of time-warped subsequences via a suffix tree.",
            "T-ODMG: an ODMG compliant temporal object model supporting multiple granularity management.",
            "Efficient data mining for calling path patterns in GSM networks.",
            "DBC: a condensed representation of frequent patterns for efficient mining.",
            "Description logics with aggregates and concrete domains.",
            "Self-maintaining web pages.",
            "Reasoning about keys for XML."
        ]
    },
    {
        "name": "IS",
        "year": "2002",
        "info": "Volume 27, 2002",
        "count": 25,
        "papers": [
            "Discovering interesting inclusion dependencies: application to logical database tuning.",
            "A formal model for an expressive fragment of XSLT.",
            "A lattice-based approach for I/O efficient association rule mining.",
            "Developing a meta model for the Bunge-Wand-Weber ontological constructs.",
            "Signature-based structures for objects with set-valued attributes.",
            "Evaluation of concurrency control strategies for mixed soft real-time database systems.",
            "A theory of contexts in information bases.",
            "Integrating network devices in a meta-directory: the MetaComm experience.",
            "Integrating the maintenance and synchronization of data warehouses using a cooperative framework.",
            "MEERAn EER model enhanced with structure methods.",
            "MIRROR: a state-conscious concurrency control protocol for replicated real-time databases.",
            "A formal framework for business process modelling and design.",
            "Pushing extrema aggregates to optimize logic queries.",
            "Mining hybrid sequential patterns and sequential rules.",
            "Special issue on advanced information systems engineering.",
            "Towards requirements-driven information systems engineering: the Tropos project.",
            "Derived types and taxonomic constraints in conceptual modeling.",
            "Agility through coordination.",
            "Object-oriented modeling with A.",
            "Using UML Action Semantics for model execution and transformation.",
            "A visual language should be easy to use: a step forward for XML-GL.",
            "Formalizing visual interaction with historical databases.",
            "Using Hilbert curve in image storing and retrieving.",
            "Advanced feature extraction for keyblock-based image retrieval.",
            "On-line knowledge- and rule-based video classification system for video indexing and dissemination."
        ]
    },
    {
        "name": "IS",
        "year": "2001",
        "info": "Volume 26, 2001",
        "count": 32,
        "papers": [
            "Discovering Knowledge From Large Databases Using Prestored Information.",
            "Measuring Triggering-Interaction Complexity on Active Databases.",
            "Cure: An Efficient Clustering Algorithm for Large Databases.",
            "Guest Editorial: Special Issue on the 1st Web Information Systems Engineering Conference (WISE'00).",
            "Using Visual Spatial Search Interface for WWW Applications.",
            "Hybrid Transformation for Indexing and Searching Web Documents in the Cartographic Paradigm.",
            "Web Interface-Driven Cooperative Exception Handling in Adome Workflow Management System.",
            "Guest editorial: Special issue on advanced information systems engineering.",
            "Integrating geographically distributed development teams through increased product awareness.",
            "Dynamic and adaptive composition of e-services.",
            "Design principles for process modelling in enterprise application integration.",
            "The implementation of enterprise resource planning packages in different organisational and national cultures.",
            "Data warehouse process management.",
            "Method for the analysis and design of class characteristic migrations during object system evolution.",
            "Computer supported argumentation and collaborative decision making: the HERMES system.",
            "Efficient time-series subsequence matching using duality in constructing windows.",
            "A case study in systematic hypermedia design.",
            "Preface.",
            "Adapting materialized views after redefinitions: techniques and a performance study.",
            "Detecting redundant materialized views in data warehouse evolution.",
            "A foundation for capturing and querying complex multidimensional data.",
            "Mining optimized support rules for numeric attributes.",
            "Enriching the conceptual basis for query formulation through relationship semantics in databases.",
            "Functional and embedded dependency inference: a data mining point of view.",
            "The OO-method approach for information systems modeling: from object-oriented conceptual modeling to automated programming.",
            "Introduction to the special issue on data extraction, cleaning, and reconciliation.",
            "ARKTOS: towards the modeling, design, control and execution of ETL processes.",
            "An XML-enabled data extraction toolkit for web sources.",
            "A knowledge-based approach for duplicate elimination in data cleaning.",
            "Learning object identification rules for information integration.",
            "Discovering and reconciling value conflicts for numerical data integration.",
            "Adapting integrity enforcement techniques for data reconciliation."
        ]
    },
    {
        "name": "IS",
        "year": "2000",
        "info": "Volume 25, 2000",
        "count": 29,
        "papers": [
            "Spatial Query Optimization Utilizing Early Separated Filter and Refinement Strategy.",
            "A Semantic Object-Oriented Data Access System.",
            "Verification Of Workflow Task Structures: A Petri-net-baset Approach.",
            "Guest Editorial: Special Issue on Advanced Information Systems Engineering.",
            "Integrated Process Modeling: An Ontological Evaluation.",
            "Towards Quality-oriented Data Warehouse Usage and Evolution.",
            "Analyzing Process Models Using Graph Reduction Techniques.",
            "A Process-Oriented and Content-Based Perspective on Software Components.",
            "TOGA-A Customizable Service for Data-Centric Collaboration.",
            "What Happened When Database Researchers Met Usability.",
            "Requirements analysis for socio-technical system design.",
            "A Form Driven Object-Oriented Reverse Engineering Methodology.",
            "Concurrency control in mobile distributed real-time database systems.",
            "Joining nested relations and subrelations.",
            "Incorporating Load Factor into the scheduling of Soft real-time transactions for main memory databases.",
            "Quantifying the Utility of the Past in Mining Large Databases.",
            "ROCK: A Robust Clustering Algorithm for Categorical Attributes.",
            "Compostional Algebra for Interactive Data Access.",
            "Message from the Editors-in-Chief.",
            "On the relational representation of complex specialization structures.",
            "Accessing out-of-tuple data: a performance study.",
            "Scheduling transactions with stringent real-time constraints.",
            "A system for supporting organizations in knowledge-based document preparation.",
            "Guest Editorial: Special Issue On ADBIS 1999.",
            "Object Query Optimization through Detecting Independent Subqueries.",
            "Efficient Representation and Algebraic Manipulation of Infinite Relations in Paraconsistent Databases.",
            "Global Extensional Assertions and Local Integrity Constraints in Federated Schemata.",
            "A uniform methodology for extracting type conflicts and subscheme similarities from heterogeneous databases.",
            "An efficient spatial access method for spatial images containing multiple non-overlapping features."
        ]
    },
    {
        "name": "IS",
        "year": "1999",
        "info": "Volume 24, 1999",
        "count": 30,
        "papers": [
            "Grammars++ for Modelling Information in Text.",
            "Efficient Mining of Association Rules Using Closed Itemset Lattices.",
            "Deriving Orthogonality to Optimize the Search for Summary Data.",
            "Microsoft Repository Version 2 and the Open Information Model.",
            "DB-MAIN: A Next Generation Meta-CASE.",
            "Using metamodeling to integrate object-oriented analysis, design and programming concepts.",
            "Repository Support for Multi-Perspective Requirements Engineering.",
            "A Meta Modeling Approach to Workflow Management Systems Supporting Exception Handling.",
            "Goal-Driven Business Process Analysis Application in Electricity Deregulation.",
            "Meta-Modelling Based Assembly Techniques for Situational Method Engineering.",
            "Architecture and Quality in Data Warehouses: An Extended Repository Approach.",
            "An Environment for Designing Exceptions in Workflows.",
            "Mapping Among Knowledge Bases and Data Repositories: Precise Definition of Its Syntax and Semantics.",
            "Supporting Electronic Ink Databases.",
            "Active Rule Analysis and Optimisation in the Rock & Roll Deductive Object-Oriented Database.",
            "Schema Integration Methodology and Its Verification by Use of Information Capacity.",
            "A Belief-Consistent Multilevel Secure Relational Data Model.",
            "DLP: A Description Logic for Extracting and Managing Complex Terminological and Structural Properties from Database Schemes.",
            "Managing Process and Service Fusion in Virtual Enterprises.",
            "Application Framework Issues when Evolving Business Applications for Electronic Commerce.",
            "Developing Internet E-Commerce Benchmarks.",
            "GEM: A Global Electronic Market System.",
            "Mobile Agents Integrity for Electronic Commerce Applications.",
            "Ordered Functional Dependencies in Relational Databases.",
            "Domain Analysis for Business Software Systems.",
            "Typed Query Languages for Databases Containing Queries.",
            "Query Rewriting Using Views in the Presence of Functional and Inclusion Dependencies.",
            "On method statics and dynamics.",
            "Process-oriented architectures for electronic commerce and interorganizational workflow.",
            "Concurrency control for step-decomposed transactions."
        ]
    },
    {
        "name": "IS",
        "year": "1998",
        "info": "Volume 23, 1998",
        "count": 30,
        "papers": [
            "Specialization by Restriction and Schema Derivations.",
            "Concurrent Rule Execution in Active Databases.",
            "Definition and Analysis of Index Organizations for Object-Oriented Database Systems.",
            "A Real-Time Concurrency Control Protocol for Main-Memory Database Systems.",
            "Information Modeling in the Time of the Revolution.",
            "Special Issue on Advanced Information Systems Engineering.",
            "Integrating Semi-Formal and Formal Software Specification Techniques.",
            "Formalizing and Validating Behavioral Models Through the Event Calculus.",
            "Complex Entity Versioning at Two Granularity Levels.",
            "Specifying Global Behaviour in Database Federations.",
            "Defining the Semantics of Reactive Components in Event-Driven Workflow Execution with Event Histories.",
            "A Framework for Expressing Semantic Relationships Between Multiple Information Systems for Cooperation.",
            "Designing OQL: Allowing Objects to be Queried.",
            "A Formalisation of Semantic Schema Integration.",
            "Implementation of Transaction and Concurrency Control Support in a Temporal DBMS.",
            "Learning Translation Templates from Examples.",
            "Towards a Declarative Approach for Reusing Domain Ontologies.",
            "An Object Approach for Information System Cooperation.",
            "Storage and Retrieval of Database Constraints.",
            "Data Mining in Finance: Using Counterfactuals to Generate Knowledge from Organizational Information Systems.",
            "Accessing Extra-Database Information: Concurrency Control and Correctness.",
            "Reasoning about Qualitative Trends in Databases.",
            "Dynamic Allocation of Signature Files on Parallel Devices.",
            "Minimal Lossless Decompositions and Some Normal Forms Between 4NF and PJ/NF.",
            "Special Issue on Semistructured Data.",
            "Generating Finite-State Transducers for Semi-Structured Data Extraction from the Web.",
            "Grammars Have Exceptions.",
            "The Suffix-Signature Method for Searching for Phrases in Text.",
            "Managing Semistructured Data with FLORID: A Deductive Object-Oriented Perspective.",
            "Formal Models of Web Queries."
        ]
    },
    {
        "name": "IS",
        "year": "1997",
        "info": "Volume 22, 1997",
        "count": 23,
        "papers": [
            "Vertical Fragmentation and Allocation in Distributed Deductive Database Systems.",
            "Time and Space Efficient Secondary Memory Representation of Quadtrees.",
            "An Approach to Deadlock Detection in Multidatabases.",
            "Tool Agents in Coordinated Informations Systems.",
            "Information Systems Modelling with TROLL Formal Methods at Work.",
            "Reusability and Modularity in Transactional Workflows.",
            "DEGAS: A Database of Autonomous Objects.",
            "Dynamic Business Models as a Basis for Interoperable Transaction Design.",
            "The Relative Importance of Structural Constraints and Surface Semantics in Information Modeling.",
            "Providing Real-Time Response, State Recency and Temporal Consistency in Databases for Rapidly Changing Environments.",
            "A Uniform Indexing Scheme for Object-Oriented Databases.",
            "Decentralized Administration for a Temporal Access Control Model.",
            "Schema Versioning for Multitemporal Relational Databases.",
            "Facet Modelling: An Approach to Flexible and Integrated Conceptual Modelling.",
            "Estimating Block Accesses in a B+-Tree whose Leaf Records are of Arbitrary Size.",
            "A New and Versatile Method for Association Generation.",
            "Exploiting Fact Verbalisation in Conceptual Information Modelling.",
            "On Relaxing Serializability by Constraining Transaction Readsets.",
            "On the Feasibility of Situational Method Engineering.",
            "Integrity Constraint Integration in Heterogeneous Databases: An Enhanced Methodology for Schema Integration.",
            "Labyrinth, an Abstract Model for Hypermedia Applications. Description of its Static Components.",
            "MOF-Tree: A Spatial Access Method to Manipulate Multiple Overlapping Features.",
            "Uncertain Deductive Databases: A Hybrid Approach."
        ]
    },
    {
        "name": "IS",
        "year": "1996",
        "info": "Volume 21, 1996",
        "count": 32,
        "papers": [
            "Guest Editorial: Real-Time Database Systems.",
            "Integrating Standard Transactions in Firm Real-Time Database Systems.",
            "Multiclass Transaction Scheduling and Overload Management in Firm Real-Time Database Systems.",
            "Implementation of a Real-Time Database System.",
            "Value-cognizant Speculative Concurrency Control for Real-Time Databases.",
            "Effects of Deadline Propagation on Scheduling Nested Transactions in Distributed Real-Time Database Systems.",
            "Collaborative Version Control in an Agent-Based Hypertext Environment.",
            "Business Rules in Systems Analysis: a Meta-Model and Repository System.",
            "Validating Conceptual Specifications Through Model Execution.",
            "Standard Transformations for the Normalization of ER Schemata.",
            "Complexity Metrics for Systems Development Methods and Techniques.",
            "Requirements and Comparison of View Mechanisms for Object-Oriented Databases.",
            "A New Method for Estimating the Number of Objects Satisfying an Object-Oriented Query Involving Partial Participation of Classes.",
            "Selection Predicate Indexing for Active Databases Using Interval Skip Lists.",
            "Normalization Based on Fuzzy Functional Dependency in a Fuzzy Relational Data Model.",
            "Semantics of Time-Varying Information.",
            "Optimal Redesign Policies to Support Dynamic Processing of Applications on a Distributed Relational Database System.",
            "An Incremental Memory Allocation Method for Mixed Workloads.",
            "An Analysis of Schedules for Performing Multi-Page Requests.",
            "A More Realistic Locking Model and its Analysis.",
            "ROL: A Deductive Object Base Language.",
            "Adaptive Clustering of Hypermedia Documents.",
            "Partitioning Similarity Graphs: A Framework for Declustering Problems.",
            "Hierarchies of Indices for Text Searching.",
            "Defining Visions in Context: Models, Processes and Tools for Requirements Engineering.",
            "Corrigendum: Business Rules in Systems Analysis: a Meta-Model and Repository System.",
            "Analyzing Information Systems Development a Comparison and Analysis of Eight IS Development Approaches.",
            "Availability and Performance Limitations in Multidatabases.",
            "Feasibility of Aggregates in Time Constrained Queries.",
            "Queries = Examples + Counterexamples.",
            "Representation and Extraction of Information by Probabilistic Logic.",
            "Analysis of Tradeoff Between Data Accuracy and Performance of Databases."
        ]
    },
    {
        "name": "IS",
        "year": "1995",
        "info": "Volume 20, 1995",
        "count": 34,
        "papers": [
            "Analytical Profile Estimation in Database Systems.",
            "GRAS, a Graph-Oriented (Software) Engineering Database System.",
            "Formalization of an IS-A based Extended Nested Relation Data Model.",
            "KMeD: a Knowledge-based Multimedia Medical Distributed Database System.",
            "An active OODB system for genome physical map assembly.",
            "Computational modeling systems.",
            "Efficient organization and access of multi-dimensional datasets on tertiary storage systems.",
            "Design and implementation of ROCK & ROLL: a deductive object-oriented database system.",
            "A unifying object role modelling theory.",
            "The Snapshot Index: An I/O-optimal access method for timeslice queries.",
            "Allocating data and workload among multiple servers in a local area network.",
            "Guest Editorial: Special Issue on Advanced Information Systems Engineering.",
            "Developing Formal Object-Oriented Requirements Specifications: A Model, Tool and Technique.",
            "Representation and Communication - a Speech Act Based Approach to Information Systems Design.",
            "Guiding Schema Integration by Behavioural Information.",
            "Planning Support for Cooperating Transactions in EPOS.",
            "An Approach for Defining Ways-of-Working.",
            "Ordered Sharing a New Lock Primitive for Database Systems.",
            "An Overview of the Object-Protocol Model (OPM) and OPM Data Management Tools.",
            "Evaluation of Regular Nonlinear Recursions by Deductive Database Techniques.",
            "Guest Editorial Special Issue on Multimedia Information Systems.",
            "Schemes for Implementing Buffer Sharing in Continuous-Media Systems.",
            "A Disk-Based Storage Architecture for Movie on Demand Servers.",
            "Dynamic Inverted Quadtree: A Structure for Pictorial Databases.",
            "Nested Composite Nodes and Version Control in an Open Hypermedia System.",
            "The RT-LOTOS Formal Specification of the Conditional Delivery Mechanism.",
            "Database Security: Research and Practice.",
            "On Building a Hyperdistributed Database.",
            "Composite Regions in Topological Queries.",
            "Integration of the Decision Table Formalism with a Relational Environment.",
            "On Periodicity in Temporal Databases.",
            "Using Partial Information to Update Materialized Views.",
            "Supporting Inheriance Using Subclass Assertions.",
            "The Column Protocol: A High Availability and Low Message Cost Solution for Managing Replicated Data."
        ]
    },
    {
        "name": "IS",
        "year": "1994",
        "info": "Volume 19, 1994",
        "count": 41,
        "papers": [
            "Information Systems takes a new direction.",
            "Guest Editorial for the Special Issue on Extending Database Technology.",
            "Schema equivalence in heterogeneous systems: bridging theory and practice.",
            "Subsumption between queries to object-oriented databases.",
            "Type derivation using the projection operation.",
            "Composite-object views in relational DBMS: an implementation perspective.",
            "DBJ - a Dynamic Balancing Hash Join algorithm in multiprocessor database systems.",
            "Unifying concurrency control and recovery of transactions.",
            "The new Editorial Board of  Information Systems  .",
            "The DBPL Project: Advances in Modular Database Programming.",
            "Database models for infinite and indefinite temporal information.",
            "Transformation of database populations and operations from the conceptual to the internal level.",
            "A mixed transaction cost model for coarse grained multi-column partitioning in a shared-nothing database machine.",
            "A Software Environment for the Cooperative Design of Hypertext Documents.",
            "Introduction.",
            "Applying object-oriented analysis on a case study.",
            "Deteriming Object Interaction in Object-Oriented Deductive Conceptual Models.",
            "A Taxonomy for Real-World Modelling Concepts.",
            "The three dimensions of requirements engineering: a framework and its applications.",
            "Building reusable components through project evolution analysis.",
            "Schema standardization as an aid in view integration.",
            "Visualisation of conceptual specifications.",
            "Invited Project Review: Industrial-strength parallel query optimization: issues and lessons.",
            "An analysis of SQL integrity constraints from an entity-relationship model perspective.",
            "Safe referential integrity and null constraint structures in relational databases.",
            "The COMFORT Automatic Tuning Project, Invited Project Review.",
            "Performance of Linear Hashing Schemes for Primary Key Retrieval.",
            "On Indexing Spatial and Temporal Data, Invited Project Review.",
            "Deriving Incremental Production Rules for Deductive Data.",
            "Query Abbreviation in the Entity-Relationship Model.",
            "Unifying Temporal Data Models via a Conceptual Model.",
            "A Self-Adjusting Data Distribution Mechanism for Multidimensional Load Balancing in Multiprocessor-Based Database Systems.",
            "Analytical Comparison of Two Spatial Data Structures.",
            "Complete Decompositions of Join Dependencies.",
            "ARIS Toolset: A Software Product is Born.",
            "Guest Editorial.",
            "Data Sharing Economics and Requirements for Integration Tool Design.",
            "INCOME/STAR: Methodology and Tools for the Development of Distributed Information Systems.",
            "MAMBA: Automatic Customization of Computerized Business Processes.",
            "A Generic Approach for Computer-Assistance of Complex Decision Processes.",
            "Comparisons of Agent Approaches with Centralized Alternatives Based on Logistical Scenarios."
        ]
    },
    {
        "name": "IS",
        "year": "1993",
        "info": "Volume 18, 1993",
        "count": 40,
        "papers": [
            "The Behavior Network Model for conceptual information modeling.",
            "Counter reduction technique for combined processing of selection and join.",
            "Optimal MMI file systems for orthogonal range retrieval.",
            "Algebraic operations on encryped relational databases.",
            "Multi-Directory Hashing.",
            "Fundamental Graphical Primitives for Visual Query Languages.",
            "The effect of database filters on the performance of buffered relational database systems.",
            "An extended temporal system based on points and intervals.",
            "SQL*: a recursive SQL.",
            "Refinement of enquiries in retrieval systems based on the universal relation model.",
            "Corrigendum: Specification and execution of transactions for advanced database applications.",
            "Timestamp semantics and representation.",
            "Concurrency control for object bases.",
            "Parallel processing for the full reductioin of a chain query in distributed databases.",
            "Estimating the size of a relational join.",
            "Cache management for shared sequential data access.",
            "A graphical query interface based on aggregation/generalization hierarchies.",
            "Statistical databases: design of experiment structures.",
            "Introduction to GIUKU: Graphical Interactive Intelligent Utilities for Knowledgeable Users of data base systems.",
            "A generic retrieval system design supporting interoperability.",
            "Towards a complete conceptual model: Petri nets and entity-relationship diagrams.",
            "Dynamic hashing with distributed overflow space: a file organization with good insertion performance.",
            "An analytical comparison to two secondary index schemes: physical versus logical addresses.",
            "Data partitioning for multicomputer datbase systems: a cell-based approach.",
            "Designing computer networks to avoid partitioning.",
            "A metamodel approach for the management of multiple models and translation of schemes.",
            "Accommodating subjective vagueness through a fuzzy extension to the relational data model.",
            "A token-based synchronisation scheme for distributed real-time databases.",
            "Flexible consistency modes for active databases applications.",
            "A modularization for PROLOG knowledge bases.",
            "Query processing in distributed databases with non-disjoint data.",
            "Object store with navigation accelerator.",
            "Using SQL with object-oriented databases.",
            "Formal definition of a conceptual language for the description and manipulation of information models.",
            "Similar shape retrieval using a structural feature index.",
            "Transaction management in N-version programmed database systems.",
            "Real-time transaction scheduling in database systems.",
            "A Functional Approach to Database Updates.",
            "Adaptive hashing with signatures.",
            "Information systems: theoretical development and research approaches."
        ]
    },
    {
        "name": "IS",
        "year": "1992",
        "info": "Volume 17, 1992",
        "count": 31,
        "papers": [
            "A formal method for analyzing and integrating the rule-sets of multiple experts.",
            "Safe computation of the well-founded semantics of Datalog queries.",
            "An algebraic approach to databases with complex objects.",
            "Operation-oriented query language approach for recursive queries - Part 1. Functional definition.",
            "Operation-oriented query language approach for recursive queries - Part 2. Prototype implementation and its integration with relational databases.",
            "An environment for building graphical user interfaces for nested relational databases.",
            "Access Support Relations: An Indexing Method for Object Bases.",
            "Aspects of the automatic generation of SQL statements in the Natural Language Query Interface.",
            "Translation of SQL queries into a graph structure: query transformations and pre-optimization issues in a pipeline multiprocessor environment.",
            "Specification and execution of transactions for advanced database applications.",
            "A new polynomial time algorithm for BCNF relational database design.",
            "The DADES/GP approach to automatic generation of Information System prototypes from a deductive conceptual model.",
            "SQL/EER - syntax and semantics of an Entity-Relationship-based query language.",
            "Crypographic key assignment scheme for access control in a hierarchy.",
            "Temporal semantics in information systems - a survey.",
            "A methodology and tool for derivation of functional dependencies from business forms.",
            "An information measure of retrieval performance.",
            "Automatic generation of compiled forms for linear recursions.",
            "A conference key broadcasting system using sealed locks.",
            "A transaction-oriented approach to attribute partitioning.",
            "Note on the structure of joins.",
            "DBMS support for time and totally ordered compound data types.",
            "Linear-density hashing with dynamic overflow sharing.",
            "On GDM allocation for partial range queries.",
            "A logical framework for deductive objects.",
            "Performance evaluation of algorithms for transitive closure.",
            "Structural schema integration with full and partial correspondence using the Dual Model.",
            "Preprocessing predicates and queries.",
            "Using semantic knowledge of transactions to improve recovery and availability of replicated data.",
            "File organizations with shared overflow blocks for variable length objects.",
            "On the complexity of finding bounds for projection cardinalities in relational databases."
        ]
    },
    {
        "name": "IS",
        "year": "1991",
        "info": "Volume 16, 1991",
        "count": 40,
        "papers": [
            "Data caching strategies for distributed full text retrieval systems.",
            "Deadlock prediction for Escrow transactions.",
            "An extended universal instance data model.",
            "Adapting text to data in documents through a natural language processor.",
            "An integrated methodology for functional analysis.",
            "B+ Trees, Bounded Disorder and Adaptive Hashing.",
            "VLODS: a VLSI object oriented database system.",
            "Password authentication using Newton's interpolating polynomials.",
            "A performance optimization technique for an objectoriented functional data model.",
            "Performance evaluation of catalog management schemes in distributed database systems.",
            "Updating relational views using knowledge at view definition and view update time.",
            "Complexity of database languages.",
            "Optimizing joins between two fragmented relations on an broadcast local network.",
            "Select-partitioned join: an improved pratition-based join algorithm.",
            "Spatial indexing in binary decomposition and spatial bounding.",
            "Optimal B-tree packing.",
            "Formal techniques for systems specification and verification.",
            "The time dimension in conceptual modelling.",
            "A probabilistic inference model for information retrieval.",
            "Direct manipulation of a data dictionary with SQL.",
            "Question-and-answer passwords: an empirical evaluation.",
            "Analysis of a deferred and incremental update strategy for secondary indexes.",
            "Approximating block accesses in random files: the case of blocking factors lower than one.",
            "Optimization of join strategies in distributed databases.",
            "A file structure for semantic databases.",
            "Compression of correlated bit-vectors.",
            "A conceptual modelling formalism for temporal database applications.",
            "Understanding process structure diagrams.",
            "From information system requirements to designs: a mapping framework.",
            "Evaluation of functional linear recursions: a compilation approach.",
            "Semantics and verification of object-role models.",
            "Using multi-bucket data leaves with overflow chains-performance analysis.",
            "An authorization mechanism for UNIX-based cooperative environments.",
            "Modeling and evaluation of alternatives in information systems.",
            "Minimum boundary-length problem in B*-trees: a case study.",
            "Abstract data types for the logical modeling of complex data.",
            "View specification and manipulation for a semantic data model.",
            "On the design of multiple key hashing files for concurrent orthogonal range retrieval between two disks.",
            "Optimal parallel scheduling of M-way join queries.",
            "Describing morphological phenomena of Modern Greek using a unification grammar formalism."
        ]
    },
    {
        "name": "IS",
        "year": "1990",
        "info": "Volume 15, 1990",
        "count": 53,
        "papers": [
            "KBMS: aspects, theory and implementation.",
            "Practical, object-based knowledge representation for knowledge-based systems.",
            "Communication requirements for cooperative problem solving systems.",
            "Modular construction of logic knowledge bases: an algebraic approach.",
            "Partitioning and composing knowledge.",
            "Efficient compilation of large rule bases using logical access paths.",
            "A software process data model for knowledge engineering in information systems.",
            "SML: symbolic manipulation language. A graphic-orientid language for the description of a logic interpreter.",
            "TWAICE: a knowledge engineering tool.",
            "Expert database systems: knowledge/data management environments for intelligent information systems.",
            "Object-oriented database systems: the next miles of the marathon.",
            "Optimal view caching.",
            "Roles and their role in posing recursive queries.",
            "The CHRIS consultant-a tool for database design and rapid prototyping.",
            "Response time analysis of using a parallel join algorithm on a multiprocessor backend machine.",
            "Schema Evolution and the Relational Algebra.",
            "The use of simulated annealing for clustering data in databases.",
            "Implementation of a distributed data management system for technical applications-a feasibility study.",
            "Specification and verification of temporal relationships in transaction modelling.",
            "Redundant information in an authorization mechanism.",
            "Perfect hashing using sparse matrix packing.",
            "Effect of schema size on fragmentation design in multirelational databases.",
            "Storage management for persistent complex objects.",
            "Extension of relational views to derived relations with exceptions.",
            "General transitive closure of relations containing duplicates.",
            "Design and implementation of temporal query language with abstract time.",
            "Finding heuristics for processing selection queries in relational database systems.",
            "Physical database design aspects of relational DBMS implementations.",
            "A text compression algorithm.",
            "Information interchange between self-describing databases.",
            "Predictive performance analysis of a multi-computer database system.",
            "Simulative and analytical studies on performances in large multimedia databases.",
            "Join processing heuristics in relational database systems.",
            "Prefetching-a performance analysis.",
            "On the satisfiability of dependency constraints in entity-relationship schemata.",
            "An effective representation of complex clauses in a relational database.",
            "From transitive closure recursions to single-chain recursions.",
            "An approach to open intelligent information systems.",
            "Classification and syntax of constraints in binary semantical networks.",
            "A dynamic storage allocation algorithm suitable for file structures.",
            "A robust protocol for distributed query processing on an local area network.",
            "Some experiments in the use of clustering for data validation.",
            "An overview of PRIMO: a portable interface between PROLOG and relational databases.",
            "Parallel cycle detection in distributed databases.",
            "A recursive algebra for nested relations.",
            "A fuzzy database-query language.",
            "Estimating the size of relational SP-Theta-J operation results: an analytical approach.",
            "The ISAC-driven transition between requirements analysis and ER conceptual modelling.",
            "Distributed Database Design - Optimization vs. Feasibility.",
            "Recursive functions in a data base language for complex objects.",
            "An improvement on the automatic tool for relational database design.",
            "Building efficient and flexible feature-based indices.",
            "Coupling Prolog to a Database Management System."
        ]
    },
    {
        "name": "IS",
        "year": "1989",
        "info": "Volume 14, 1989",
        "count": 44,
        "papers": [
            "A study of the behavior of the read: write ratio under two-phase locking schemes.",
            "An assessment of the IDEF notations as descriptive tools.",
            "Pragmatics and semantics of NQL, a descriptive query language for network databases.",
            "Extended Boolean query processing in the generalized vector space model.",
            "Formal semantics for database schemas.",
            "Complex-Prolog: a logic database language for handling complex objects.",
            "Storage structure design of CODASYL DBMS using spreadsheet programs.",
            "A method for hierarchy processing in relational systems.",
            "An approach to efficient database design incorporating usage information.",
            "Hierarchical timestamping algorithm.",
            "Tri-cell-a data structure for spatial objects.",
            "Fitting reality into a database mold: rules for data collection.",
            "Analysis of Overflow Handling for Variable Length Records.",
            "How to recognize interesting topics to provide cooperative answering.",
            "Deadlock-freedom of large transactions in object management systems.",
            "Dynamic query interpretation in relational databases.",
            "Evaluating information systems projects: a perspective on cost-benefit analysis.",
            "Multi-way counting method.",
            "A graphical query language for the Binary Relationship Model.",
            "An automated tool for relational database design.",
            "Optimization problems and solution methods in the design of data distribution.",
            "Modeling of discrete dynamic systems-framework and examples.",
            "View updating through predefined procedures.",
            "NURQL: a nested universal relation query language.",
            "Modification of a multilevel indexed descriptor file.",
            "Modelling dynamic constraints using augmented place transition nets.",
            "Average cost of orthogonal range queries in multiattribute trees.",
            "Intelligent information systems: the concept of an intelligent document.",
            "An Analysis of B-trees and their Variants.",
            "Concurrent file conversion between B+-tree and linear hash files.",
            "Database access path selection: a two step approach.",
            "A network-wide information systems: multi-level context for the user at the workstation interface.",
            "Integration of heterogeneous database applications through an object-oriented interface.",
            "An algorithm for non-interfering checkpoints and its practicality in distributed database systems.",
            "An improved division operator for relational algebra.",
            "Independent revocation of access rights in database management systems.",
            "FQUERY III +:a \"human-consistent\" database querying system based on fuzzy logic with linguistic quantifiers.",
            "Importance in Knowledge systems.",
            "Some practical aspects of fuzzy database techniques: an example.",
            "FILIP: a fuzzy intelligent information system with learning capabilities.",
            "Extrapolation of fuzzy values from incomplete data bases.",
            "Indexing principles for a fuzzy data base.",
            "Fuzzy linguistic data bases: an application.",
            "Attribute grammars for the heuristic translation of query languages."
        ]
    },
    {
        "name": "IS",
        "year": "1988",
        "info": "Volume 13, 1988",
        "count": 31,
        "papers": [
            "The fact model: a semantic data model for complex databases.",
            "An integrated model of record segmentation and access path selection for databases.",
            "An approach and its specification to data reformatting in data conversion.",
            "A Petri-net model of access control mechanisms.",
            "Full text retrieval based on syntactic similarities.",
            "Optimizing the cost of relational queries using Partial-Relation schemes.",
            "GISD: a graphical interactive system for conceptual database design.",
            "Concurrency in Extendible Hashing.",
            "Adaptive hashing.",
            "Dynamic-history predictive compression.",
            "Handling hot spot in DB-sharing systems.",
            "Representation of vague information.",
            "Intelligent caching and indexing techniques for relational database systems.",
            "The Effect of Buffer Size on Pages Accessed in Random Files.",
            "ADISSA: architectural design of information systems based on structured analysis.",
            "Split sequence coalesced hashing.",
            "Relational database design using the NIAM conceptual schema.",
            "Confusional search on large files or databases.",
            "Relational data base design for the intensional aspects of a knowledge base.",
            "A rule-based approach for merging generalization hierarchies.",
            "Conceptual schemas applied to deductive databases.",
            "Extending relational algebra to manipulate temporal data.",
            "A methodology for conceptual documentation and maintenance.",
            "A measure of costs in balanced trees.",
            "Forming the optimal union of multiple databases.",
            "Design of engineering databases: a case for more varied semantic modelling concepts.",
            "SIAM: statistics information access method.",
            "Partitioned storage for temporal databases.",
            "Maintaining materialized views without accessing base data.",
            "Design of statistical databases: a methodology for the conceptual step.",
            "Parallel merging of lists in database management system."
        ]
    },
    {
        "name": "IS",
        "year": "1987",
        "info": "Volume 12, 1987",
        "count": 35,
        "papers": [
            "A formal approach to timing analysis and design of information systems.",
            "Approximating the number of unique values of an attribute without sorting.",
            "Functional dependencies and their connection with security of statistical databases.",
            "Temporal semantics and natural language processing in a decision support system.",
            "Non-first normal form universal relations: an application to information retrieval systems.",
            "Verification of resource controller processes.",
            "Denotational semantics of query languages.",
            "Evaluation of a multiple version cheme for concurrency control.",
            "SQL/NF: a query language for ¬1 NF relational databases.",
            "Achieving minimum height for block split tree structured files.",
            "Information requirements and alternatives in information system design.",
            "Concurrency Control for Design Objects with Versions in CAD Databases.",
            "Multi-relation dependencies.",
            "Text signatures by superimposed coding of letter triplets and quadruplets.",
            "CONST-A constructive approach to information modelling.",
            "On testing soundness of relational expressions.",
            "Voronoi trees and clustering problems.",
            "A general framework for computing block accesses.",
            "Synchronization of replicated data in distributed systems.",
            "The design of optimal access paths for relational databases.",
            "Fact structure and its application to updates in relational databases.",
            "On the irreducible non first normal form relations.",
            "Duplicate record identification in bibliographic databases.",
            "A hierarchical model of organizational control for the analysis of information systems requirements.",
            "Monitoring dynamic integrity constraints based on temporal logic.",
            "Linkage versus integration for binding database and interactive graphics systems.",
            "Defining views in the Binary Relationship Model.",
            "Cooperative behaviour in the FIDO system.",
            "PIQUE: a relational query language without relations.",
            "Tuple calculus: formal definiton and conversion from first-order calculus.",
            "An architecture for processing graph-grammar applications.",
            "Forward multidimensional search with application to information retrieval systems.",
            "A nearly optimal Huffman technique in the microcomputer environment.",
            "Optimal bucket size for multiattribute retrieval in partitioned files.",
            "Linked hashing: an improvement of open addressing techniques for large secondary storage files."
        ]
    },
    {
        "name": "IS",
        "year": "1986",
        "info": "Volume 11, 1986",
        "count": 26,
        "papers": [
            "The power of the private workspace model.",
            "A requirements modeling language and its logic.",
            "Taxonomy and formal properties of distributed joins.",
            "Losslessness and semantic correctness of database schema transformation: another look of schema equivalence.",
            "The INFOLOG linear tense propositional logic of events and transactions.",
            "Modeling the CODASYL DML context dependency for database program conversion.",
            "Classification and transformations of binary relationship relation schemata.",
            "Functional data model design.",
            "The relational model with relation-valued attributes.",
            "A semantic data model as the basis for an automated database design tool.",
            "Batch Insertion for Tree Structured File Organizations - Improving Differential Database Reprensentation.",
            "Double encoding - A technique for reducing storage requirement of text.",
            "Dimensions of information systems design: A framework for a long-range research program.",
            "Choice of the optimal number of blocks for data access by an index.",
            "Statistical treatment of the information content of a database.",
            "Redundancy in functional databases.",
            "Grid File Concurrency.",
            "A combined methodology for information systems analysis and design based on ISAC and NIAM.",
            "Schema translation: A three-level Semantic abstraction approach.",
            "Primary copy synchronization for DB-Sharing.",
            "Transaction management in distributed heterogeneous database management systems.",
            "Action based model of information system.",
            "Database concurrency control using read/write set information.",
            "A database language for sets, lists and tables.",
            "Choosing an optimal sequence of discriminators.",
            "Adding time dimension to relational model and extending relational algebra."
        ]
    },
    {
        "name": "IS",
        "year": "1985",
        "info": "Volume 10, 1985",
        "count": 34,
        "papers": [
            "A graph grammar approach to geographical databes.",
            "On the complexity of some multi-attribute file design problems.",
            "Design of a virtual database.",
            "On the automatic generation of optimal internal schemata.",
            "Data base design with the constrained multiple attribute tree.",
            "Property of separability in physical design of network model databases.",
            "Straightforward formalization of the relational model.",
            "A formal framework for describing and classifying semantic data models.",
            "A Framework for Application Systems Engineering.",
            "A query language allowing conditions of relational type queries.",
            "Choosing optimal branching factors for k-d-B trees.",
            "Nondeterministic dependencies in relations: An extention of the concept of functional dependency.",
            "Modeling and integrating procedures in office information systems design.",
            "GRDB: A general purpose relational database system.",
            "DATAID-1: A database design methodology.",
            "Temporal inferencing on administrative databases.",
            "Design criteria for functional data bases.",
            "Semantic and pragmatic processing in FIDO: A flexible interface for data-base operations.",
            "The answerability of database queries.",
            "Causal Dependencies in deadline requirements.",
            "Removing redundant join operations in queries involving views.",
            "Growing certainty with null values.",
            "A methodology to model the dynamic structure of an organization.",
            "Enabling local actions by global consensus.",
            "Decomposition of select expressions.",
            "Ontological aspects of logical databases.",
            "A case stuy of database design using the DATAID approach.",
            "Dynamic access control for relational views.",
            "Heuristic approach to network database external parameters design.",
            "A comparison of a network structure and a database system used for document retrieval.",
            "Performance of a multi-key access method based on descriptors and superimposed coding techniques.",
            "Information systems with attribute decomposition.",
            "Essential information structure diagrams and database schema design.",
            "Design of a distributed CODASYL database system."
        ]
    },
    {
        "name": "IS",
        "year": "1984",
        "info": "Volume 9, 1984",
        "count": 20,
        "papers": [
            "Validating database updates.",
            "Performance of VIDEBAS in an operational environment.",
            "Lipski's approach to incomplete information databases restated and generalized in the setting of Zadeh's possibility theory.",
            "Towards multi-level and modular conceptual schema specifications.",
            "A storage structure definiton language for Codasyl Data Bases.",
            "Estimating Block Selectivities.",
            "Observations on optimistic concurrency control schemes.",
            "Semantic integrity enforcement in centralized DBMS and distributed DBMS based on slow (geographically distributed) and fast (local area) networks.",
            "Constraint preserving and lossless database transformations.",
            "Information semantics and the conceptual schema.",
            "A pruned trie to index a sorted file and its evaluation.",
            "HOLMES: a deduction augmented database management system.",
            "Identifying subsystems in information systems analysis.",
            "An approach toward integrated algorithm information system.",
            "Dynamic non-dense indexes in relational databases.",
            "A comprehensive model for the storage structure design of codasyl databases.",
            "On the sizes of projections: a generating function approach.",
            "Attribute equivalence in global schema design for heterogeneous distributed databases.",
            "Nested set languages for functional databases.",
            "A methodology for conceptual design of office data bases."
        ]
    },
    {
        "name": "IS",
        "year": "1983",
        "info": "Volume 8, 1983",
        "count": 30,
        "papers": [
            "On recursive axioms in deductive databases.",
            "BASIS: A Behavioral Approach to the Specification of Information Systems.",
            "Testing a dependency-preserving decomposition for losslessness.",
            "Navigational facilities for relational data base.",
            "A methodology to solve distributed termination problem - A short note.",
            "Abstractions in temporal information.",
            "A practitioner's guide to data base compression - Tutorial.",
            "The automatic generation of test data for a relational database.",
            "On Correctness of Information Models.",
            "Privacy and security in information systems using programming language features.",
            "Estimating record selectivities.",
            "Semantic hierarchies and abstractions in conceptual schemata.",
            "Integrity checking in data base systems.",
            "Binary search with variable-length keys within an index page.",
            "A seven-tuple representation for hierarchical data structures.",
            "A dynamic model for the optimal selection of secondary indexes.",
            "Defining database views as data abstractions in EXT_Pascal.",
            "Inference control in statistical databases with incomplete information.",
            "Applications software and orgnizational change: Issues in the representation of knowledge.",
            "Complexity assessment: a design and management tool for information system development.",
            "Analysis of linear probing with buckets.",
            "Comparsing of database intervaces for application programming.",
            "Coding methods for text string search on compressed databases.",
            "Granting and revoking discretinary authority.",
            "Input output timing in information systems.",
            "A two level superimposed coding scheme for partial match retrieval.",
            "Theory of random observables in relational data bases.",
            "Formal aspects of optimistic concurrency control in a multiple version database system.",
            "Computation of statistical functions in distributed information systems.",
            "Correctness of a distributed transaction system."
        ]
    },
    {
        "name": "IS",
        "year": "1982",
        "info": "Volume 7, 1982",
        "count": 28,
        "papers": [
            "A new model for data base abstraction.",
            "Optimistic versus pessimistic concurrency control mechanisms in database management systems.",
            "On the updatability of network views-extending relational view theory to the network model.",
            "Dissimilarity and distance coefficients in automation-supported thesauri.",
            "Performance evaluation of four assiciative disk designs.",
            "A troughput model: sequential vs concurrent processing.",
            "Query optimisation using a data dictionary.",
            "Tree structures for high dimensionality nearest neighbor searching.",
            "Multidimensional B-trees for associative searching in database systems.",
            "An extended model for database implementation.",
            "Description models and the design of ADP systems: trends in West Germany.",
            "Man-machine communication in Portuguese: a friendly library service system.",
            "Axiomatic definitions for data modes semantics.",
            "An IS&R system based on Turkish language.",
            "Formal verification of information derivability in databases using precedence analyses.",
            "Data security management in distributed data bases.",
            "Process model and resource management in a distributed database.",
            "Semantics, dynamics tradeoff in relational database design.",
            "Incorporating English descriptions into a relational database.",
            "A prescriptive database interface methodology for end-users.",
            "A computer-aided methodology for conceptual data-base design.",
            "A consulting system for data base design.",
            "Reorganizing the files in data base management systems.",
            "A procedure to define the object type structure of a conceptual schema.",
            "Binary trees paging.",
            "Structural locking mechanisms and their effect on database management system performance.",
            "Achieving mutual exclusion in a distributed computing environment.",
            "A familial model of data for a multilevel schema framework."
        ]
    },
    {
        "name": "IS",
        "year": "1981",
        "info": "Volume 6, 1981",
        "count": 23,
        "papers": [
            "Database security-system architectures.",
            "On data dependency structures of relational databases.",
            "Structured methodology for designing static and dynamic aspects of data base applications.",
            "Complexity of a proposed database storage structure.",
            "Utilization of data access and manipulation in conceptual schema definitons.",
            "Dynamic modelling of a simple existence constraint.",
            "RDBM - A relational data base machine.",
            "Imprecision of specification of information systems parameters: A study of decision point probabilities.",
            "Computed chaining - A hybrid of direct chaining and open addressing.",
            "Four-schema approach: An extended model for database architecture.",
            "A Note on Human Factors Issues of Natural Language Interaction With Database Systems.",
            "A data base management system for document retrieval applications.",
            "Key compression using segment strings.",
            "Allocation of copies of s distinct files in an information network.",
            "Information systems theoretical foundations.",
            "An implementation of relational interface to an information retrieval system.",
            "A counter-example to a clustering heuristic.",
            "Management information systems structure, types and integration.",
            "The power of inequality semijoins.",
            "Data base design constrained by traffic load estimates.",
            "Applying simple theory of types to data bases.",
            "Compromisability of a statistical database.",
            "Data structuring with virtual sets."
        ]
    },
    {
        "name": "IS",
        "year": "1980",
        "info": "Volume 5, 1980",
        "count": 25,
        "papers": [
            "Reducing block accesses in inverted files by partial clustering.",
            "Space utilization and access path length in B-trees.",
            "Infological models and information user views.",
            "An access control facility for relational data base systems.",
            "Optimizing the evaluation of calculus expressions in a relational database system.",
            "Data base communication in a heterogeneous data base management system network.",
            "Proceduralism and parallelism in specification languages.",
            "Approximate pattern matching in a pattern database system.",
            "On limitations of artificial intelligence.",
            "A uniform formal description of data base management systems.",
            "An experiment in learning DBTG database administration.",
            "A note on optimal allocation of files in a symmetric and homogeneous network.",
            "Temporal aspects of logical procedure definiton.",
            "A model of cluster searching bases on classification.",
            "The file allocation problem under dynamic usage.",
            "Alternate implementations of the conceptual schema.",
            "Matrix for retrieval and sorting.",
            "Applications of Graph Grammar Theory to Consistency, Synchronization and Scheduling in Data Base Systems.",
            "A query-maintenance language for the Data Independent Acessing Model II.",
            "Integrated data analysis and management for the problem solving environment.",
            "The application of data types to database semantic integrity.",
            "Natural language access to information systems - An avaluation study of its acceptance by end users.",
            "Database maintenance efficiency using differential files.",
            "Algorithms for processing partial match queries using word fragments.",
            "Interacting in natural language with artificial systems: the DONAU project."
        ]
    },
    {
        "name": "IS",
        "year": "1979",
        "info": "Volume 4, 1979",
        "count": 26,
        "papers": [
            "Overflow handling in hashing tables: a hybrid approach.",
            "Manipulation of expression in a relational algebra.",
            "On models of information retrieval processes.",
            "On the selection of the access path in inverted database organization.",
            "Height-balanced multiway trees.",
            "Rational data base standards: an examination of the 1978 CODASYL DDLC Report.",
            "Information systems: on queries involving cardinalities.",
            "Comments on a paper by Erik K. Clemons - Rational data base standards: an examination of the 1978 CODASYL DDLC Report.",
            "A systematic approach to information systems development-II - Problem and data oriented methodology.",
            "Toward a unified view of data base management, programming languages, and operating systems-a tutorial.",
            "Comparing insertion schemes used to update 3-2 trees.",
            "Use of bipartite graphs as a notation for data bases.",
            "The integration of network data base management and problem resolution.",
            "Authorization in multilevel database models.",
            "A systematic approach to information systems development-I - Introduction.",
            "Structured logical design of information systems: a methodology, documentation and experience.",
            "Organization of quasi-consecutive retrieval files.",
            "On the equivalence of data base schemas - a semantic approach to data translation.",
            "File organizations and their reorganization.",
            "Further refinement of the linear quotient hashing method.",
            "Comments on Cherniavsky's paper \"On algorithmic natural language analysis and understanding\" - On Cherniavsky's man/machine distinction.",
            "Grammatical data base model.",
            "Permitting updates through views of data bases.",
            "Experiments with a very efficient heuristic for clustering problems.",
            "LEGOL 2.0: A relational specification language for complex rules.",
            "A heuristic approach for determining the optimal degree of file inversion."
        ]
    },
    {
        "name": "IS",
        "year": "1978",
        "info": "Volume 3, 1978",
        "count": 22,
        "papers": [
            "Are intelligent information systems ever achievable? Inviting a discussion.",
            "On algorithmic natural language analysis and understanding.",
            "Semantics of data bases: The semantics of data models.",
            "Comments on a paper by Biller and Neuhold: Semantics of data Bases: The semantics of data models.",
            "Remarks on the comments of B. Langefors on our paper - Semantics of data bases: The semantics of data models.",
            "Binary relations, matrices and inference developments.",
            "A class of hybrid list file organizations.",
            "Data Base Reorganization by Clustering Methods.",
            "Schema design using a data structure matrix.",
            "Efficient algorithms for answering queries with unsorted multilists.",
            "The WELL system: a multi-user database system based on binary relationships and graph-pattern-matching.",
            "Dynamic file movement in multilevel storage systems.",
            "Formulation of choice criterions for file organizations.",
            "Formal aspects of the relational model.",
            "Mapping external views to a common data model.",
            "The ANSI/X3/SPARC DBMS Framework Report of the Study Group on Dabatase Management Systems.",
            "Set-theoretic foundations of datastructure representation.",
            "Linguistic approach to database theory: DDL-s for hierarchical model.",
            "A cooperation system for heterogeneous data base management systems.",
            "On database systems viewed as programming languages.",
            "Comments on the paper of Cherniavsky: \"On artificial intelligence and attempts to disprove its existance\".",
            "CODASYL: Reports of the Data Description Language Committee."
        ]
    },
    {
        "name": "IS",
        "year": "1976",
        "info": "Volume 2, 1976/1977",
        "count": 15,
        "papers": [
            "Structured extension of COBOL for handling data bases.",
            "Random access in a list environment.",
            "Significations: The key to unify data base management.",
            "Security for the GPLAN system.",
            "TORUS: a step towards bridging the gap between data bases and the casual user.",
            "Optimal tree lists for information storage and retrieval.",
            "Extensions and corrections for the CODASYL approach to data base management.",
            "CODASYL: Stored-data description and data translation: a model and language.",
            "Recuced combined indexes for efficient multiple attribute retrieval.",
            "Avoiding redundant record accesses in unsorted multilist file organizations.",
            "Towards a more familiar relational retrieval language.",
            "A generalized mapping language for network data structures.",
            "Multi-dimensional clustering for data base organizations.",
            "A unimodality property of optimal exhaustive prefix codes and retrieval trees over alphabets of varying size.",
            "Information systems theory."
        ]
    },
    {
        "name": "IS",
        "year": "1975",
        "info": "Volume 1, 1975",
        "count": 14,
        "papers": [
            "Information Systems Records, Relations, Sets, Entities, and Things.",
            "Analysis of Collisions when Hashing by Division.",
            "Creation of a File Translation Language for Networks.",
            "Information and Information Processing Structure.",
            "A Parametric Model of Alternative File Structures.",
            "Modeling and analysis of data base organization. The doubly chained tree structure.",
            "Hierarchies of Data Base Languages: An Example.",
            "Relation Representation by Tables and by Functions.",
            "Access Synthronization and Deadlock-Analysis in Database Systems: An Implementation-oriented Approach.",
            "Remark on a Paper by Ghosh and Lum.",
            "Two major flaws in the CODASYL DDL 1973 and Proposed Corrections.",
            "Allocating Storage in Hierarchical Data Bases Using Traces.",
            "The Optimal Selection of Secondary Indices for Files.",
            "A General Model of Distribution of Objects in Information Retrieval Systems."
        ]
    }
]