[
    {
        "name": "JCIS",
        "year": "2021",
        "info": "Volume 61, 2021",
        "count": 53,
        "papers": [
            "ICTs, Empowerment, and Success: Women's Perceptions across Eight Countries.",
            "Restoring Trust after an Insider Breach: Both the Genders Matter - CEOs and Users.",
            "Effects of Privacy Notification Style and Frequency on Phone Usage.",
            "Institutional Logics and Their Influence on Enterprise Architecture Adoption.",
            "Addressing Crypto-Ransomware Attacks: Before You Decide whether To-Pay or Not-To.",
            "ERP Vendor Satisfaction: From Communication and IT Capability Perspectives.",
            "The Impact of Consumer Confusion on Mobile Self-Checkout Adoption.",
            "The Effect of Leadership and Teamwork on ISD Project Success.",
            "Reliability, Validity, and Strength of a Unified Model for Information Security Policy Compliance.",
            "Understanding Software Engineers' Skill Development in Software Development.",
            "Attitudinal and Behavioral Loyalty Toward Virtual Goods.",
            "A High-Reliability Approach to Risk Management in an IT Project.",
            "Employees' Mobile Cyberslacking and Their Commitment to the Organization.",
            "The Spectrum of Big Data Analytics.",
            "Social Networking Site Use, Positive Emotions, and Job Performance.",
            "Market Share Strategies for Cloud Computing Providers.",
            "Retraction: Gender Reputation Differences on Online Programming Q&A Communities.",
            "Cybersecurity Awareness and Skills of Senior Citizens: A Motivation Perspective.",
            "Formulating Knowledge-Based Cloud Identity Selection.",
            "Assessing IT Students' Intentions to Commit Unethical Actions.",
            "Affordances of Recommender Systems for Disorientation in Large Online Conversations.",
            "Trust in C2C Electronic Commerce: Ten Years Later.",
            "Computer Science in ASEAN: A Ten-Year Bibliometric Analysis (2009-2018).",
            "Project Control, Coordination, and Performance in Complex Information Systems Outsourcing.",
            "Investigating Factors of Twitter Use among Municipal Governments.",
            "Understanding Consumers' Post-Adoption Behavior in Sharing Economy Services.",
            "Factors Activating Big Data Adoption by Korean Firms.",
            "Literature Review about Intention Mining in Information Systems.",
            "Information Technology Work Value Differences.",
            "Can Online Rating Reflect Authentic Customer Purchase Feelings? Understanding How Customer Dissatisfaction Relates to Negative Reviews.",
            "Information Technology Operational Risk: A Teaching Case.",
            "Security Awareness: The First Step in Information Security Compliance Behavior.",
            "Virtual Brand Community Experience, Identification, and Electronic Word-of-mouth.",
            "Mobile Social Cyberbullying: Why are Keyboard Warriors Raging?",
            "The Role of Attitude toward Challenge in Serious Game Design.",
            "Antecedents of Technology Selection for Project Use.",
            "Big Data Analytics in Cyber Security: Network Traffic and Attacks.",
            "IT Ethics Perceptions and Behavior: An International Comparison.",
            "Towards a User Experience Framework for Business Intelligence.",
            "Perceptions of Cybersecurity Readiness among Workgroup IT Managers.",
            "A Pedagogy to Develop Effective Virtual Teams.",
            "Understanding the Use of Knowledge Sharing Tools.",
            "Team Performance and Triangle Approach: A Longitudinal Study.",
            "Do We Trust in AI? Role of Anthropomorphism and Intelligence.",
            "The Influence of Social Power on Knowledge Utilization.",
            "Understanding Social Media Monitoring and Online Rumors.",
            "Empirical Study on Initial Trust of Wearable Devices Based on Product Characteristics.",
            "Factors Affecting Coproduction Resentment within a Self-checkout Environment.",
            "Employees' Behavior in Phishing Attacks: What Individual, Organizational, and Technological Factors Matter?",
            "Media-Generating Activities and Follower Growth within Social Networks.",
            "A Risk Management Tool for Agile Software Development.",
            "Understanding Employee Information Security Policy Compliance from Role Theory Perspective.",
            "Utilizing a Simulation Approach for Data Analytics Pedagogy."
        ]
    },
    {
        "name": "JCIS",
        "year": "2020",
        "info": "Volume 60, 2020",
        "count": 56,
        "papers": [
            "Information Security Policy Compliance: Leadership, Trust, Role Values, and Awareness.",
            "Millennials Use of Social Media in Product Innovation Purchasing Processes.",
            "Media Impacts and Performance in Dispersed Teams.",
            "A Cross-Cultural Study of Interpersonal Trust in Social Commerce.",
            "Differential effects on assimilation stages for supply chain management information systems.",
            "Framework and Literature Analysis for Crowdsourcing's Answer Aggregation.",
            "Organizational Citizenship Behavior Regarding Security: Leadership Approach Perspective.",
            "Signalling Effects of Vlogger Popularity on Online Consumers.",
            "Understanding Predictors of Over-Optimism in IS Project Teams.",
            "Generalizing stopping rule research: Development of scales.",
            "Do technology and social media preferences differ with age? A study of the use of social technologies for business purposes in Spain.",
            "Self-Determination and Perceived Information Control in Cloud Storage Service.",
            "Organizational Identification and User Responses to Online Organization Criticism.",
            "Motivational Impacts on Intent to Use Health-Related Social Media.",
            "Privacy and security in the big data paradigm.",
            "Usability evaluation of menu interfaces for smartwatches.",
            "The impacts of cloud computing architecture on cloud service performance.",
            "An expert-based taxonomy of ERP implementation activities.",
            "Content-related factors influence perceived value of location-based mobile advertising.",
            "Investigation of virtual teams and serious games.",
            "Information security policies' compliance: a perspective for higher education institutions.",
            "Predicting user-level marketing performance of location-based social networking sites.",
            "Continuance of E-Textbook Use by Tertiary Students: A Qualitative Approach.",
            "I.S. educational game: Adoption in teaching search engine optimization (SEO).",
            "Women in IT Management: Significant Gains and Continuing Challenges.",
            "Students' acceptance of E-books: An application of UTAUT.",
            "The Information Systems name game revisited: Still muddled 20 years later.",
            "Assessing Students' Object-Oriented Programming Skills with Java: The \"Department-Employee\" Project.",
            "Important Skills for Data Scientists in China: Two Delphi Studies.",
            "Crypto Mining Attacks in Information Systems: An Emerging Threat to Cyber Security.",
            "Popularity of Branded Content in Social Media.",
            "A Service-Oriented Model for Personal Health Records.",
            "An Organic Approach to Customer Engagement and Loyalty.",
            "Mobile Services as a Means to Control: An Empirical Assessment.",
            "Leveraging Open E-Logistic Standards to Achieve Ambidexterity in Supply Chain.",
            "Free Wi-Fi: To Buy or Not to Buy.",
            "Interdisciplinarity in Data Science Pedagogy: A Foundational Design.",
            "Explaining Diversity and Conflicts in Privacy Behavior Models.",
            "Improving Organizational Performance Through the Use of Big Data.",
            "Understanding Adoption and Continuance of Online Direct Sales Channel.",
            "E-WOM's Impact on App Development.",
            "Architecting Microservices: Practical Opportunities and Challenges.",
            "I Want It Anyway: Consumer Perceptions of Smart Home Devices.",
            "How Social Impact Affects Smartphone Brand Loyalty.",
            "Examining Social Networking O2O Apps User Loyalty.",
            "Trade off Cybersecurity Concerns for Co-Created Value.",
            "A Cultural Comparative Study of Mobile Banking Adoption Factors.",
            "On the Security Risks of the Blockchain.",
            "Consumer Acceptance of Internet of Things (IoT): Smart Home Context.",
            "The Effect of Bring Your Own Device (BYOD) Adoption on Work Performance and Motivation.",
            "Role of Habit and Value Perceptions on m-Learning Outcomes.",
            "Information-Processing Support Index: A New Perspective on IT Usage.",
            "A High-Frequency Algorithmic Trading Strategy for Cryptocurrency.",
            "How Does Customer Service Offshoring Impact Customer Satisfaction?",
            "Screen Addiction and Media Multitasking among American and Taiwanese Users.",
            "Determinants of News Sharing Behavior on Social Media."
        ]
    },
    {
        "name": "JCIS",
        "year": "2019",
        "info": "Volume 59, 2019",
        "count": 36,
        "papers": [
            "Choosing Technology Majors: What You Don't Know Can Influence You.",
            "Search and Research on Economics of Pair Programming.",
            "Who to Trust? Applying Trust to Social Commerce.",
            "Examining Factors that Influence Intent to Adopt Data Science.",
            "A Factor Analysis of Consumer Expectations for Autonomous Cars.",
            "Adoption Intention of Cloud Computing at the Firm Level.",
            "Effects of Perceived Risk on Intention to Purchase: A Meta-Analysis.",
            "Does the Hand Anthropometric Dimension Influence Touch Interaction?",
            "The Moderating Effect of Industry Types on IT-Coordination Costs Relationship.",
            "The Impact of Cross-Addiction on Information Sharing Behaviors on Social Networking Sites.",
            "The Contribution of ICT Adoption to the Sustainable Information Society.",
            "How Does Sentiment Content of Product Reviews Make Diffusion Different?",
            "Adoption of e-Books: A Digital Textbook Perspective.",
            "Do Electronic Word-of-Mouth and Elaboration Likelihood Model Influence Hotel Booking?",
            "Mobile Proximity Usage Behaviors Based on User Characteristics.",
            "Gender in Shared Navigation: Men to Mars, Women to Venus?",
            "Leveraging Consumption Intention with Identity Information on Sharing Economy Platforms.",
            "Business Intelligence Effectiveness and Corporate Performance Management: An Empirical Analysis.",
            "Managers' and Employees' Differing Responses to Security Approaches.",
            "Information Security Policy Compliance: Leadership and Trust.",
            "The Moderating Effects of Product Involvement on Escalation Behavior.",
            "Ambidextrous Innovation and Game Market Fit Performance: Feedback from Game Testers.",
            "Influential Characteristics of Enterprise Information System User Interfaces.",
            "The Investigation of E-Learning System Design Quality on Usage Intention.",
            "Online Crowdsourcing Campaigns: Bottom-Up versus Top-Down Process Model.",
            "Toward an Understanding of Consumer Attitudes on Online Review Usage.",
            "Understanding the Complexities of Enterprise Architecture through Structuration Theory.",
            "A Hands-Free Music Score Turner Using Google Glass.",
            "Knowledge Sharing Analytics: The Case of IT Workers.",
            "Patient's Acceptance of IT-Assisted Self-Monitoring: A Multiple-Case Study.",
            "Exploring the Impact of Social Networking on Communication in Organizations.",
            "The Theory of Planned Behavior and Information Security Policy Compliance.",
            "Learning Laboratories as Services in Private Cloud Deployment.",
            "Factors Affecting Web Disclosure Adoption in the Nonprofit Sector.",
            "ERP Simulation Effects on Knowledge and Attitudes of Experienced Users.",
            "Systems Dynamics-Based Modeling of Data Warehouse Quality."
        ]
    },
    {
        "name": "JCIS",
        "year": "2018",
        "info": "Volume 58, 2018",
        "count": 39,
        "papers": [
            "Cloud Computing: An Examination of Factors Impacting Users' Adoption.",
            "Comparison of Mobile Web Browsers for Smartphones.",
            "An Identification of Factors Motivating Individuals' Use of Cloud-Based Services.",
            "Text Analysis of Green Supply Chain Practices in Healthcare.",
            "Using Serious Games in Data Communications and Networking Management Course.",
            "Exploring Factors Affecting the Adoption of Internet of Things Services.",
            "E-Supply Chain Integration Adoption: Examination of Buyer-Supplier Relationships.",
            "Changing Attitudes toward Location-Based Advertising in the USA and Finland.",
            "Taxonomy for Identification of Security Issues in Cloud Computing Environments.",
            "Knowledge Management Models within Information Technology Projects.",
            "A Creativity Support System Based on Causal Mapping.",
            "A Calculus of Virtual Community Knowledge Intentions: Anonymity and Perceived Network-Structure.",
            "Social Media Burnout: Definition, Measurement Instrument, and Why We Care.",
            "Mobile Work Continuance of Knowledge Workers: An Empirical Study.",
            "Synthesizing Agile and Knowledge Discovery: Case Study Results.",
            "Business Analytics and Organizational Value Chains: A Relational Mapping.",
            "Big Data Analytics Services for Enhancing Business Intelligence.",
            "Agile Methodologies: Organizational Adoption Motives, Tailoring, and Performance.",
            "How Client Capabilities, Vendor Configuration, and Location Impact BPO Outcomes.",
            "Understanding the Factors Affecting the Organizational Adoption of Big Data.",
            "Enhancing User Engagement through Gamification.",
            "Desired Skills for Entry Level IS Positions: Identification and Assessment.",
            "Examining the Impact of Training in the Unified Theory of Acceptance and Use of Technology.",
            "Control Mechanisms and Agile Methodology Use: Data from the Industry.",
            "The Impact of Online Training on Facebook Privacy.",
            "An Examination of Factors That Influence Students' IT Career Decisions.",
            "Toward an Integrated Decision-Making Model for Consumer Electronic.",
            "Competition and Information Deception in Online Social Networks.",
            "The Effects of Pranks in Social Media on Brands.",
            "Turnover Intention of Technology Professionals: A Social Exchange Theory Perspective.",
            "Performance Impacts of Web-Enabled Retail Services: An Empirical Study.",
            "Factors That Influence Employees' Security Policy Compliance: An Awareness-Motivation-Capability Perspective.",
            "The Effect of Innovation Characteristics on Cloud Computing Diffusion.",
            "Formation and Effect of Social Media Usage Habit.",
            "Perceived Usefulness Factors of Online Reviews: A Study of Amazon.com.",
            "An Empirical Study Evaluating Social Networking Continuance and Success.",
            "Guidelines for Business Rule Modeling Decisions.",
            "Skill Requirements in Big Data: A Content Analysis of Job Advertisements.",
            "One World, Two Realities: Perception Differences between Software Developers and Testers."
        ]
    },
    {
        "name": "JCIS",
        "year": "2017",
        "info": "Volume 57, 2017",
        "count": 40,
        "papers": [
            "How Important Are Enjoyment and Mobility for Mobile Applications?",
            "Novelties Within the Framework for Information System Due Diligence.",
            "Team Diversity, Learning, and Innovation: A Mediation Model.",
            "Analysis of Mobile Broadband Service Penetration in South Korea.",
            "Creativity and Problem-Solving: Closing The Skills Gap.",
            "How Trust and Need Satisfaction Motivate Producing User-Generated Content.",
            "Improving Decision Quality: The Role of Business Intelligence.",
            "Analyzing Relationships in Terrorism Big Data Using Hadoop and Statistics.",
            "Persuasive Electronic Word-of-Mouth Messages in Social Media.",
            "Initial Empirical Testing of Potential Factors Contributing to Patient Use of Secure Medical Teleconferencing.",
            "Longitudinal Analysis and Coping Model of User Adaptation.",
            "Opening the Knowledge Dam: Speech Recognition for Video Search.",
            "How Multinational Corporations Use Information Technology to Manage Global Operations.",
            "An Examination of Determinants of Software Testing and Project Management Effort.",
            "A Case Study on Implementing Modularity in Software Development.",
            "Impact of Information Seeking and Warning Frames on Online Deception: A Quasi-Experiment.",
            "Search Engine Optimization: Comparison of Link Building and Social Sharing.",
            "Online Social Networking Sites Continuance Intention: A Model Comparison Approach.",
            "Business Analytics-Based Enterprise Information Systems.",
            "\"When Is Short, Sweet?\" Selection Uncertainty and Online Review Presentations.",
            "Examining the Signaling Effect of E-tailers' Return Policies.",
            "A Multilevel Model of Information Technology Value.",
            "Assessing Self-Organization in Agile Software Development Teams.",
            "Change Management Support to Preserve Business-Information Technology Alignment.",
            "The Effect of Network Characteristics on Online Identity Management Practices.",
            "Examining the Impacts of Electronic Word-of-Mouth Message on Consumers' Attitude.",
            "It Pays to Be Agile.",
            "Identifying Traits and Values of Top-Performing Information Security Personnel.",
            "Impact of Radio Frequency Identification Technology on Environmental Sustainability.",
            "Social and Economic Development through Information and Communications Technologies: Italy.",
            "Understanding Continuance Intention of Mobile Payment Services: An Empirical Study.",
            "Examining Micro-Level (SQL) Curriculum-Oriented and Promotional IS Enrollment Strategies.",
            "Implications of Monitoring Mechanisms on Bring Your Own Device Adoption.",
            "Developing and Validating a Cultural User Satisfaction Instrument in Developing Countries.",
            "Distinguishing between Privacy and Security Concerns: An Empirical Examination and Scale Validation.",
            "The Influence of Online Search Behavior on Consumers' Decision-Making Heuristics.",
            "Analysis of Protective Behavior and Security Incidents for Home Computers.",
            "Analytics Capabilities and the Decision to Invest in Analytics.",
            "Online Consumers' Responses to Deal Popularity as an Extrinsic Cue.",
            "Leadership Effectiveness in IT-Centered Organizations: Gender and Levels of Management."
        ]
    },
    {
        "name": "JCIS",
        "year": "2016",
        "info": "Volume 56, 2016",
        "count": 40,
        "papers": [
            "It Consumerization: Byod-Program Acceptance and its Impact on Employer Attractiveness.",
            "Self-Service Business Intelligence Resulting in Disruptive Technology.",
            "Characteristics of Open Source Software Projects for the General Population: Reciprocity and Network Effects.",
            "Developing and Assessing Erp Competencies: Basic and Complex Knowledge.",
            "Are We There Yet? A Technique to Determine Theoretical Saturation.",
            "Users' Satisfaction with Social Network Sites: A Self-Determination Perspective.",
            "E-Learning Courseware Usability: Building a Theoretical Model.",
            "Developing a Financial Statement-Based Effectiveness Measure of Interorganizational Systems' Contribution.",
            "Investigating Users' Extrinsic Motivation for Green Personal Computing.",
            "An Empirical Study on Factors Influencing Consumers' Initial Trust in Wearable Commerce.",
            "Online Social Network Adoption: A Cross-Cultural Study.",
            "The Development of an Instrument to Measure Mobile Game Quality.",
            "Organizational Characteristics Influencing SME Information Security Maturity.",
            "Empirical Validation Of A Performance-Based Innovation Process Model: A Case Of ERP.",
            "Social Comparison, Goal Contagion, and Adoption of Innovative Information Technology.",
            "A Valuation Model For Information Technology Capability-Enabled Firm Value.",
            "Actionable Social Media Competitive Analytics For Understanding Customer Experiences.",
            "Factors Influencing The Success Of E-Government.",
            "Dimensions Of Institutionalized Organizational Trust And Firm's Innovativeness.",
            "Perceptions and Attitudes toward Online Mapping Services.",
            "Development of a Cloud Trust Label: A Delphi Approach.",
            "Relationship Conflict, Conflict Management, and Performance of Information Technology Teams.",
            "The Effects of Social Networking Sites on Consumer-Brand Relationships.",
            "Renewal of Classics: Database Technology for all Business Majors.",
            "Dimensionality of Social Capital and Organizational Citizenship Behavior in Information Systems Project Teams.",
            "Situational Privacy Concerns and Antecedent Factors.",
            "Active Learning for Knowledge Construction in E-Learning: A Replication Study.",
            "E-Progression of Nonprofit Organization Websites: U.S. Versus Thai Charities.",
            "Healthy Divide or Detrimental Division? Subgroups in Virtual Teams.",
            "The Roles of Awareness, Sanctions, and Ethics in Software Compliance.",
            "Using a Fit-Viability Approach to Explore the Determinants of E-Government Maturity.",
            "Tablet Adoption with Smart School Website Technology.",
            "Examining System Administrators' Verification Information to Enhance IT Training Design.",
            "A Dynamic k-Nearest Neighbor Method for WLAN-Based Positioning Systems.",
            "Supporting Business Intelligence Usage: An Integrated Framework with Automatic Weighting.",
            "Factors Influencing Students' Major and Career Selection in Systems Development: An Empirical Study.",
            "Computer and Smartphone Continuance Intention: A Motivational Model.",
            "When Deceitful Chats Look Truthful.",
            "The Effects of IT Management on Technology Process Integration.",
            "Predicting Drivers of Mobile Entertainment Adoption: A Two-Stage SEM-Artificial-Neural-Network Analysis."
        ]
    },
    {
        "name": "JCIS",
        "year": "2014",
        "info": "Volume 55, 2014-2015",
        "count": 40,
        "papers": [
            "Understanding it Entrepreneurial Intention: An Information Systems View.",
            "Trust-Discount Tradeoff in Three Contexts: Frugality Moderating Privacy and Security Concerns.",
            "Redesigning the Information Systems Analysis and Design Course: Curriculum Renewal.",
            "Comparing Perceptions of the Systems Analysis and Design Course.",
            "Mobile Device Adaptation Efforts: The Impact of Hedonic and Utilitarian Value.",
            "Information Technology and Human Factors Affecting Active Medication List Accuracy.",
            "Sustainability-Focused Knowledge Management in a Global Enterprise.",
            "Threat Protection and Convenience: Antecedents of Cloud-Based Data Backup.",
            "Using Social Technologies for Competitive Advantage: Impact on Organizations and Higher Education.",
            "Benefits and Barriers to Corporate Performance Management Systems.",
            "Understanding Continuance Use in Social Networking Services.",
            "Is this a Joke? The Impact of Message Manipulations on Risk Perceptions.",
            "Online Security Performances and Information Security Disclosures.",
            "Examining the Role of Organizational Readiness in Erp Project Delivery.",
            "Addressing the Major Information Technology Challenges of Electronic Textbooks.",
            "Investigating Customers' Satisfaction with Brand Pages in Social Networking Sites.",
            "Real-World Deception and the Impact of Severity.",
            "A Case Study of Strategic Group Map Application Used as a Tool for Knowledge Management.",
            "Understanding Consumers' Web-Mobile Shopping Extension Behavior: A Trust Transfer Perspective.",
            "Stages-of-Growth in Outsourcing, Offshoring and Backsourcing: Back to the Future?",
            "The Effect of Moral Intensity on it Employees' Bad News Reporting.",
            "Impacts of Comprehensive Information Security Programs on Information Security Culture.",
            "Terrorism Information Extraction from Online Reports.",
            "Education and Prevention Relationships on Security Incidents for Home Computers.",
            "Social Media: A Technology that needs no Support from It...Yet.",
            "Effect of Control on Information Systems Development Performance: A Meta-Analysis.",
            "The Effect of Status Quo Bias on Cloud System Adoption.",
            "Wireless Technologies in New Zealand Businesses: A Longitudinal Assessment.",
            "Conceptualization of the Business Intelligence Extended Use Model.",
            "An Empirical Examination of the \"Vicious Cycle\" of Facebook Addiction.",
            "Antecedents of Consumer Trust in Mobile Payment Adoption.",
            "Personality Traits and Information Privacy Concern on Social Media Platforms.",
            "A Conceptual Model for Communicating an Integrated Information Systems Curriculum.",
            "A Delphi Study of Factors Hindering Web Accessibility for Persons with Disabilities.",
            "Knowledge Management and the Creation of Business Value.",
            "Linear and Nonlinear Relationships on E-Repository Adoption.",
            "Public Sector Adoption of Social Media.",
            "Rethinking E-Commerce Service Quality: Does Website Quality Still Suffice?",
            "Analyzing Customer Service Technologies for Online Retailing: A Customer Service Life Cycle Approach.",
            "The Influence of Internet Advertising and Electronic Word of Mouth on Consumer Perceptions and Intention: Some Evidence from Online Group Buying."
        ]
    },
    {
        "name": "JCIS",
        "year": "2013",
        "info": "Volume 54, 2013-2014",
        "count": 41,
        "papers": [
            "The Dual Role of Trust in System Use.",
            "Does Sample Size Matter in Qualitative Research?: A Review of Qualitative Interviews in is Research.",
            "Mobile Business Intelligence: Key Considerations for Implementations Projects.",
            "Research in Information Systems Education: Scope and Productivity.",
            "Oss Adoption: Organizational Investment in Internal Human Capital.",
            "Enterprise Resource Planning Adoption: Structural Equation Modeling Analysis of Antecdants.",
            "Reducing User-Related Risks with User-Developer Partnering.",
            "Project Duration and Risk Factors on Virtual Projects.",
            "Trust and Distrust in Open Source Software Development.",
            "Understanding Professional Connections in Linkedin - A Question of Trust.",
            "The Holistic and Systems Approach to the Sustainable Information Society.",
            "Looking inside the \"it Black Box\": Technological Effects on it Usage.",
            "Perceived Risks and Ict Use.",
            "The Dependent Variable in Social Media Use.",
            "Absorptive Capacity as a Precondition for Business Process Improvement.",
            "A Method for Evaluating Performance of it-Centric Businesses Applied to the Domain of Electronic Marketplaces.",
            "Extracting News from Server Side Databases by Query Interfaces.",
            "Consumers' Intentions to Use E-Readers.",
            "Decoupling Software from Hardware in Technology Acceptance Research.",
            "Investigating Design Issues in Mobile Computer-Mediated Communication Technologies.",
            "Continued Use of Mobile Technology Mediated Services: A Value Perspective.",
            "Impacts of Customers' Perceptions on Internet Banking Use with a Smart Phone.",
            "Trust and it Innovation in Asymmetric Environments of the Supply Chain Management Process.",
            "Strategic Performance Management Systems: Impact on Business Results.",
            "Innovation Characteristics Influencing Veterans' Adoption of E-Government Services.",
            "Assessing Innovations in Cloud Security.",
            "Broadband Adoption in Regional and Urban Households.",
            "An Empirical Investigation of Emulators in Mobile Web Research.",
            "User's Adoption of Free Third-Party Security Apps.",
            "Consumer Acceptance and Continuance of Online Group Buying.",
            "Towards A Systemic Framework for Digital Forensic Readiness.",
            "Social Capital Characteristics of Open Source Software Opinion Leaders.",
            "Does Xbrl Benefit Financial Statement Auditing?",
            "Cloud Erp: A New Dilemma to Modern Organisations?",
            "A Study on Emotion and Memory in Technology Adoption.",
            "The Impact of Content Type and Availability on eBook Reader Adoption.",
            "Job Embeddedness of Information Technology Professionals: The Effects of Gender.",
            "A Business-Analytic Approach to Identify Critical Factors in Quantitative Disciplines.",
            "Factors Influencing Buyer's Trust in Consumer-to-Consumer E Commmerce.",
            "Daily Deals Websites: Mostly but not all about Location.",
            "Personality, Problematic Social Network Use and Academic Performance in China."
        ]
    },
    {
        "name": "JCIS",
        "year": "2012",
        "info": "Volume 53, 2012-2013",
        "count": 41,
        "papers": [
            "A Student ERP Simulation Game: A Longitudinal Study.",
            "Adoption of Mobile Commerce: A Confidence Model.",
            "Harmonizing Firms' Knowledge and Strategies with Organizational Capabilities.",
            "Extrinsic versus Intrinsic Motivation in Continued Twitter Usage.",
            "Cultural Effects on Perceptions of Unauthorized Software Copying.",
            "Ontology-Based Data Summarization Engine: A Design Methodology.",
            "Information Privacy Situation Awareness: Construct and Validation.",
            "It Impacts in Information and Physical Product Industries.",
            "Information Systems Job Market Late 1970'S-Early 2010'S.",
            "Trust, Avatars, and Electronic Communications: Implications for E-Learning.",
            "Shortening Requirements Engineering: Dual Imperative Action Research Study.",
            "Cross-Disciplinary Communities or Knowledge Islands: Examining Business Disciplines.",
            "Do Business Students Practice Smartphone Security?",
            "Agility of Project Manager in Global is Project.",
            "Examining Adoption Behavior of Mobile Government.",
            "The Impact of it Management Sophistication on Perceived it Importance in Strategic Alignment.",
            "Revisiting the Barriers Facing Women in Information Systems.",
            "The Moderating Factors in the Relationship between ERP Investments and Firm Performance.",
            "Scheduling Online Advertisements to Maximize Revenue under Non-Linear Pricing.",
            "Investigating the Antecedents of Users' Knowledge Sharing Intention.",
            "Application Strategies for Neuroscience in Information Systems Design Science Research.",
            "A New Data Stream Mining Algorithm for Interestingness-Rich Association Rules.",
            "Risk Dynamics Throughout the System Development Life Cycle.",
            "Service-Oriented Network Discovery and Selection in Virtualization-Based Mobile Internet.",
            "Knowledge Transfer Activation Analysis: Knowledge Trade Perspective.",
            "Content Acceptance Model and New Media Technologies.",
            "Understanding Technology Adoption Trade-Offs: A Conjoint Analysis Approach.",
            "Assessing Ethical Severity of e-Learning Systems Security Attacks.",
            "Bon Appétit for Apps: Young American Consumers' Acceptance of Mobile Applications.",
            "Requirements Uncertainty in Contract Software Development Projects.",
            "Knowledge Construction in e-Learning: An Empirical Validation of an Active Learning Model.",
            "Role of Leadership Competencies and Team Social Capital in it Services.",
            "Extensible Markup Language (XML) Schemas for Data Vault Models.",
            "Understanding Mobile Commerce Continuance Intentions: An Empirical Analysis of Chinese Consumers.",
            "Mobile Commerce and Consumer Privacy Concerns.",
            "Risks in Enterprise Cloud Computing: The Perspective of it Experts.",
            "Software Effort Estimation Using a Neural Network Ensemble.",
            "Impact of Information Quality on Supply Chain Decisions.",
            "Content Use from Websites: Effects of Governance Mechanisms.",
            "Improving Knowledge Management by Integrating Hei Process and Data Models.",
            "The Enterprise and its Architecture: Ontology & Challenges."
        ]
    },
    {
        "name": "JCIS",
        "year": "2011",
        "info": "Volume 52, 2011-2012",
        "count": 41,
        "papers": [
            "Enhancing Online Performance through Website Content and Personalization.",
            "An Integrated Model for Customer Online Repurchase Intention.",
            "Radio Frequency Identification Technology Utilization and Organizational Agility.",
            "Demographic Determinants of Adoption of Technological Innovation.",
            "A Computer Aided Content Analysis of Online Reviews.",
            "Viability of Fee-Based Email Service for Retail Customers.",
            "Challenging Front-end-of-Innovation in Information Systems.",
            "Learning to Thread the Needle: Information Technology Strategies.",
            "Elucidating the Ethical Sales Behavior in Electronic Commerce.",
            "Fuzzy-Semantic Information Management System for Dispersed Information.",
            "The Role of Citizenship Behaviors and Social Capital in Virtual Communities.",
            "Antecedents of Online Service Quality, Commitment and Loyalty.",
            "Managers' Perceptions of Information System Project Success.",
            "User Perceptions of Search Enhancements in Web Search.",
            "Mediating Role of Relationship Quality in Online Services.",
            "The Critical Success Factors for Public Sector CRM Implementation.",
            "Information Technology Investment and Manufacturing Worker Productivity.",
            "Defining Product Data Views for Different Stakeholders.",
            "Wiki-Based Knowledge Management Systems for More Democratic Organizations.",
            "Adopting Innovation Management Software in University Innovation Commercialization.",
            "E-Book Usage: Role of Environmental Consciousness, Personality and past Usage.",
            "User Adaptation and Infusion of Information Systems.",
            "Attitude Influencers in C2C E-Commerce: Buying and Selling.",
            "Explaining Purchasing Behavior within World of Warcraft.",
            "Daniel FirpoAssessing E-Excise Sucess with Delone and McLean's Model.",
            "Revisiting Customer Value by Forecasting E-Service Usage.",
            "The Decision Behavior of Facebook Users.",
            "A Mass Customization Information Systems Architecture Framework.",
            "Teaching Information Systems with Cases: An Exploratory Study.",
            "Determinants of Mobile Learning Adoption: An Empirical Analysis.",
            "Organizational Green Motivations for Information Technology: Empirical Study.",
            "The Role of Continuous Trust in Information Systems Continuance.",
            "A Rule-Based System to Extract Financial Information.",
            "Analyzing Home PC Security Adoption Behavior.",
            "User Satisfaction with Group Decision Making Process and Outcome.",
            "Who Needs Real-Life? Examining Needs in Virtual Worlds.",
            "Aligning Websites with Enterprise Success: An Evaluative Approach.",
            "Does Cognitive Overload Matter in Understanding Bpmn Models?",
            "Factors Influencing User Acceptance of Web-Based Decision Support Systems.",
            "Consequences of Psychological Contract Violations for is Personnel.",
            "Examining Commitment in Electronic Knowledge Repository Usage."
        ]
    },
    {
        "name": "JCIS",
        "year": "2010",
        "info": "Volume 51, 2010-2011",
        "count": 45,
        "papers": [
            "An Empirical Comparison of Four Text Mining Methods.",
            "Towards Innovative Design Research in Information Systems.",
            "Project Risk Differences between Virtual and Co-Located Teams.",
            "Determining Services for the Mobile Tourist.",
            "Impact of Negative Message Framing on Security Adoption.",
            "Internet Banking Adoption: Comparing Developed and Developing Countries.",
            "Understanding Situational Online Information Disclosure as a Privacy Calculus.",
            "Value Increasing Model in Commercial E-Banking.",
            "Enhancing Minority Student Leadership Skills Using Case Studies.",
            "Understanding and Prioritizing Technology Management Challenges.",
            "Buy-It Now: One Dollar Auction Attractive?",
            "Analysis of the Content and Characteristics of University Websites with Implications for Web Designers and Educators.",
            "The Organizational Contexts, Controls and Implementation of E-Business.",
            "Developing an Instrument for Measuring E-Commerce Dimensions.",
            "Service Engineering: An Interdisciplinary Framework.",
            "Social Influence and Instant Messaging Adoption.",
            "Social Network Analysis of a Criminal Hacker Community.",
            "The Deleterious Effects of Non-Response in Team-Level Research: What Every is Researcher Should Know to Avoid Bias.",
            "A Multidimensional Perspective on the Diffusion of Ontologies.",
            "The Post-Adoption Behavior of Online Knowledge Community: Decomposing Customer Value.",
            "Determinants of 3G Adoption in Malaysia: A Structural Analysis.",
            "Changes in Student Computer Technology Attitudes over 20 Years: 1988 to 2009.",
            "Information Technology-Enabled Innovativeness and Green Capabilities.",
            "Impact of Knowledge Acquisition on Technology Assimilation.",
            "Socialization and Software Piracy: A Study.",
            "Does Employee Alignment Affect Business-it Alignment? an Empirical Analysis.",
            "Modeling Business Goal for Business/it Alignment Using Requirements Engineering.",
            "A Framework for Situated Distributed Decision Support.",
            "Demographic Determinants of Adoption of Technological Innovation.",
            "Examining Technology Enactment in the Fixed Income Market.",
            "The Antecedents of Customer Relationship in E-Banking Industry.",
            "M-Banking in Metropolitan Bangkok and a Comparison with other Countries.",
            "How Spreadsheet Applications Affect Information Quality.",
            "Assessing it Critical Skills and Revising the Mis Curriculum.",
            "Modeling Use Continuance Behavior in Microblogging Services: The Case of Twitter.",
            "Knowledge Sharing in is Personnel: Organizational Behavior's Perspective.",
            "Seniors and Technology: Results from a Field Study.",
            "User's Willingness to Pay on Social Network Sites.",
            "Exploring E-Payment Adoption in Vietnam and Taiwan.",
            "Information Sharing between Local and State Governments.",
            "Multi-Objective Clustering with Data - and Human-Driven Metrics.",
            "Reviewing Criteria of Information Systems, Computer Science and Engineering Journals.",
            "The Data Quality Evaluation of Graph Information.",
            "Social Networking Service: Motivation, Pleasure, and Behavioral Intention to Use.",
            "An Agency Theory Explanation of Project Success."
        ]
    },
    {
        "name": "JCIS",
        "year": "2009",
        "info": "Volume 50, 2009-2010",
        "count": 60,
        "papers": [
            "Understanding and Classifying Information System Alignment Approaches.",
            "The Effect of Perceived Ethical Performance of Shopping Websites on Consumer Trust.",
            "Social Influence on Knowledge Worker's Adoption of Innovative Information Technology.",
            "Individual Adaptation of Information Technology.",
            "Resource or Capability? A Dissection of SMEs' it Infrastructure Flexibility and its Relationship with it Responsiveness.",
            "Online and Offline Social Ties of Social Network Website Users: An Exploratory Study in Eleven Societies.",
            "Do Knowledge Workers Use E-Mail Wisely?",
            "Modeling Complexity in Physically-Distributed Object-Oriented Systems.",
            "Knowledge of Software Piracy as an Antecedent to Reducing Pirating Behavior.",
            "Outline Reputation Scores: How Well are They Understood?",
            "Factors Impacting E-Government Development.",
            "Analyzing the Factors That Affect Information Systems Use: A Task-Technology Fit Meta-Analysis.",
            "Impact of the Internet on Manufacturing Trade.",
            "Impact of Motivating Language on Team Creative Performance.",
            "Measuring the Compatibility Factors in Mobile Entertainment Service Adoption.",
            "Implementing it Service Management: A Case Study Focussing on Critical Success Factors.",
            "Factors affecting the Adoption Level of C-Commerce: An Empirical Study.",
            "Technology Majors: Why are Women Absent?",
            "Information Technology Investments: Does Activity Based Costing Matter?",
            "Wealth Creation from Information Technology Investments Using the EVA®.",
            "Workplace Management and Employee Misuse: Does Punishment Matter?",
            "The Driving Forces for Design Project Effectiveness.",
            "It Certification Use by Hiring Personnel.",
            "Effects of HRM Practices on it Usage.",
            "The Factors Affecting Success of Knowledge-Based Systems at the Organizational Level.",
            "Toward a Theory of Iformation Technology Professional Competence.",
            "Mobile Data Service Demographics in Urban China.",
            "Utility Cost Perspectives in Data Quality Management.",
            "Intended Belief and Actual Behavior in Green Computing in Hong Kong.",
            "The Effects of Stereotype Threat on MIS Students: An Initial Investigation.",
            "Role of Trust in Adoption of Online Auto Insurance.",
            "Developing Metrics for Web Sites.",
            "An Ecological Model for Organizational Knowledge Management.",
            "Critical Success Factors for Business Intelligence Systems.",
            "Ready for Battle? A Phenomenological Study of Military Simulation Systems.",
            "Computer Information Systems in Financial Crime Investigations.",
            "Exploring the Impacts of Interdependent Relationships on IOS Use: The Roles of Governance Mechanisms.",
            "Critical Mass, Diffusion Channels, and Digital Divide.",
            "Subculture, Critical Mass, and Technology Use.",
            "Improving Open Source Software Maintenance.",
            "Will Negative Experiences Impact Future it Outsourcing?",
            "Technology-Enabled Retail Services and Online Sales Performance.",
            "Power of Branding on Internet Service Providers.",
            "Beautiful beyond Useful? The Role of Web Aesthetics.",
            "User Perception Differences in Enterprise Resource Planning Implementations.",
            "Factor Strategy Model: Proofs of Prototype Concept for Software Quality Evaluation.",
            "Why Employees Do Non-Work-Related Computing in the Workplace.",
            "The Impact of Flow on Online Consumer Behavior.",
            "Why Should i Share? Examining Consumers' Motives and Trust on Knowledge Sharing.",
            "Will They Adopt? Effects of Privacy and Accuracy.",
            "Examining Organic and Sponsored Search Results: A Vendor Reliability Perspective.",
            "The Influence of Causality on Negotiation Support Systems.",
            "Retailer Reputation and Online Pricing Strategy.",
            "A Rapid Mapping Conversion Methodology to a Commercial-off-the-Shelf System.",
            "Dynamics of the Importance of IS/IT Skills.",
            "An Empirical Investigation of Digital Content Characteristics, Value, and Flow.",
            "Business Method Patents and Sustained Competitive Advantage.",
            "Risk Indicators for Computer Systems Assisted Financial Examination.",
            "Examining Tactical Information Technology - Business Alignment.",
            "Combining Visualization and Interaction for Scalable Detection of Anomalies in Network Data."
        ]
    },
    {
        "name": "JCIS",
        "year": "2008",
        "info": "Volume 49, 2008-2009",
        "count": 45,
        "papers": [
            "Social Networking in Baltimore: Connection versus Collection.",
            "Status of Business Process Courses in AACSB-Accredited Undergraduate Programs of Business.",
            "Information Technology Continuance: A Theoretic Extension and Empirical Test.",
            "Innovate with Complex Information Technologies: A Theoretical Model and Empirical Examination.",
            "A Study of Intranet Usage and Resistance in Malaysia's Port Industry.",
            "A Structural Model of Data Warehousing Success.",
            "Collocation and Collation of Business Logic for Web Application Development.",
            "Measures of Uncertainty in Rule-Based Systems: One is Not Enough.",
            "Analyzing Factors of Defect Correction Effort in a Multi-Vendor Information System Development.",
            "The Role of Business Renovation and Information in E-Government.",
            "A Hybrid Decision Support Model for Selecting Highly Qualified Suppliers.",
            "The Open Source Movement: A Revolution in Software Development.",
            "Agile Project Management - Agilism versus Traditional Approaches.",
            "Virtual Transfer Price Negotiations: Unintended Interactions with Incentive Systems.",
            "Trends in Names of Undergraduate Computer-Related Majors in Aacsb-Accredited Schools of Business in the Usa.",
            "Managing Kowledge at Multiple Organizational Levels Using Faceted Ontologies.",
            "Web Site Quality in the UK Airline Industry: A Longitudinal Examination.",
            "On Embedding Test Patterns into Low-Power Bist Sequences.",
            "A Model for Document Validation Using Concurrent Authentication Processes.",
            "Undergraduate Special Topics Courses: What's on the Menu?",
            "Exploration of Information System Process Improvements and Firm Performance.",
            "Design and Evaluation of a Layered Thematic Knowledge Map System.",
            "IT-DDP: A Novel Methodology for Assuring Economic Value From Entrepreneurial Information Technology Projects.",
            "Customer-Focused E-Business Model for the Oil Industry.",
            "Evaluating Online Auction Strategy: A Theoretical Model and Empirical Exploration.",
            "Exhuming it Projects from Their Graves: An Analysis of Eight Failure Cases and Their Risk Factors.",
            "E-Learning and Study Effectiveness.",
            "Knowledge and Skill Requirements for it Graduates.",
            "Semantic Breakdown of Rfid Functionality to Support Application Development.",
            "An Empirical Study of User Acceptance of Fee-Based Online Content.",
            "Strategic, Tactical, & Operational Management Security Model.",
            "An Empirical Study of Cross-Listing in Online Auctions.",
            "Trust Violation in Electronic Commerce: Customer Concerns and Reactions.",
            "Web Trust - A Moderator of the Web's Perceived Individual Impact.",
            "The Examination of Two Web Site Usability Instruments for Use in B2C E-Commerce Organizations.",
            "The Role of Wiki Technology and Altruism in Collaborative Knowledge Creation.",
            "Examining the Success of Websites beyond E-Commerce: An Extension of the is Success Model.",
            "Concept-Guided Query Expansion for Knowledge Management with Semi-Automatic Knowledge Capturing.",
            "The Impact of Conflict and Conflict Management Style on Deadbeats and Deserters in Virtual Teams.",
            "Using Social Network Sites: The Effects of Playfulness, Critical Mass and Trust in a Hedonic Context.",
            "Factors Affecting the Intention to Download Music: Quality Perceptions and Downloading Intensity.",
            "The Negative Impact of Conflict on the Information System Development Process, Product, and Project.",
            "Student Intention to Use Expert Systems: An Exploratory Study.",
            "A Model for Environmentally Sustainable Information Systems Development.",
            "Performance Testing of Propositional Logic Inference Engines."
        ]
    },
    {
        "name": "JCIS",
        "year": "2007",
        "info": "Volume 48, 2007-2008",
        "count": 51,
        "papers": [
            "2007 Computer Educator of the Year.",
            "2007 Ben Bauman Award for Excellence.",
            "Developing A Continuous Auditing Assistance System Based on Information Process Models.",
            "User Assessment of Personal Digital Assistants Used in Pharmaceutical Detailing: System Features, Usefulness and Ease of Use.",
            "Aligning the Information Systems Curriculum with the Needs of Industry and Graduates.",
            "PKR: A Personalized Knowledge Recommendation System for Virtual Research Communities.",
            "A Novel Structural Similarity Measure on XML Data for Integrated Document Management.",
            "An Empirical Study on the Relationship between Customer Value and Repurchase Intention in Korean Internet Shopping Malls.",
            "How the Internal Environment Impacts Information Systems Project Success: An Investigation of Exploitative and Explorative Firms.",
            "Responses to Trust Violation: A Theoretical Framework.",
            "A Model of Customers' Trust in E-Businesses: Micro-Level Inter-Party Trust Formation.",
            "Behavior-Inductive Data Modeling for Enterprise Information Systems.",
            "A Usability Analysis of Company Websites.",
            "A Simulation Study of the Effects of VoIP Services on Selected Data Traffic under Wireline versus Wireless Expansion Scenarios.",
            "Assessing Organizational Innovation Capability and its Effect on E-Commerce Initiatives.",
            "Understanding Service Quality and Relationship Quality in is Outsourcing: Client Orientation & Promotion, Project Management Effectiveness, and the Task-Technology-Structure Fit.",
            "Determinants of Reach and Loyalty - A Study of Website Performance and Implications for Website Design.",
            "The Phases of ERP Software Implementation and Maintenance: A Model for Predicting Preferred ERP Use.",
            "Estimating the Determinants of CEO Compensation in the Information Technology Industry.",
            "The Impact of the Human Element in the Information Systems Quality for Decision Making and User Satisfaction.",
            "A Paradigm of Network Security Design: A Model for Teaching Network Security.",
            "An Empirical Study of Trust of Third Party Rating Services.",
            "Factors That Influence the Performance of Computer-Based Assessments: An Extension of the Technology Acceptance Model.",
            "The Km Chain - Empirical Study of the Vital Knowledge Sourcing Links.",
            "Organizational Culture and Knowledge Management in ERP Implementation: An Empirical Study.",
            "An Empirical Investigation of Knowledge Management Systems' Success.",
            "A Software Development Capstone Course and Project for CIS Majors.",
            "The Chief Information Security Officer: An Analysis of the Skills Required for Success.",
            "Gender Differences in Email and Instant Messaging: A Study of Undergraduate Business Information Systems Students.",
            "Exploring the Intention to Use Computers: An Empirical Investigation of the Role of Intrinsic Motivation, Extrinsic Motivation, and Perceived Ease of Use.",
            "The Role of Pluralistic Ignorance in Internet Abuse.",
            "A Sophisticated Approach to Semantic Web Services Discovery.",
            "Antecedents of Use-Continuance in Information Systems: Toward an Inegrative View.",
            "Information Extraction Agents for Service-Oriented Architecture Using Web Service Systems: A Framework.",
            "Combating the Decline in Information Systems Majors: The Role of Instrumental Assistance.",
            "Determinants of the Adoption of Enterprise Resource Planning within the Technology-Organization-Environment Framework: Taiwan's Communications Industry.",
            "Outsourcing Services in Partial Digital Environments: Assessing Management Preferences Where Paper is King.",
            "Drivers for Transactional B2C M-Commerce Adoption: Extended Theory of Planned Behavior.",
            "An Exploratory Study of Factors Influencing ASP (Application Service Provider) Success.",
            "A Comprehensive Two-Level Framework for Information Systems Curriculum Design, Assessment and Improvement.",
            "The Influence of Personality Traits and Information Privacy Concerns on Behavioral Intentions.",
            "ERP Alignment for Positive Business Performance: Evidence from Korea's ERP Market.",
            "An Interactive Web-Based Environment Using Pedagogical Agents.",
            "Use of Cognitive Mapping Techniques in Information Systems Development.",
            "The Impacts of Job Characteristics on is Employee Satisfaction: A Comparison between Permanent and Temporary Employees.",
            "Reconceptualizing Organizational Support and its Effect on Information Technology Usage: Evidence from the Health Care Sector.",
            "Current Information Technology Issues and Moral Intensity Influences.",
            "Groupware Uses and Influence on Performance in SMEs.",
            "User's Perspectives on Privacy in Web-Based Applications.",
            "A Comparison of Structural Equation Modeling Approaches: The Case of User Acceptance of Information Systems.",
            "An Exploratory Study into Determining the Relative Importance of Key Criteria in Web Usability: A Multi-Criteria Approach."
        ]
    },
    {
        "name": "JCIS",
        "year": "2006",
        "info": "Volume 47, 2006-2007",
        "count": 52,
        "papers": [
            "2006 Computer Educator of the Year.",
            "Ben Bauman Award for Excellence.",
            "An Extension of two Phase Locking to Support Parallel Updates of Data Warehouses.",
            "Is Service Quality and Culture: An Empirical Investigation.",
            "The Impact of Public Grid Computing Portfolio Composition on Adoption Intentions.",
            "IACIS: A Profile of Conferences (1990-2004).",
            "Wireless Applications in New Zealand Businesses: A Strategic Assessment.",
            "The Open Software Intensive System Strategy: An Integrative Approach for Building Software Intensive Systems.",
            "Development of a Web Site Usability Instrument Based on ISO 9241-11.",
            "Polarization and Dissatisfaction in Group Settings.",
            "Comparison of Trust Sources of an Online Market-Maker in the E-Marketplace: Buyer's and Seller's Perspectives.",
            "Spoofing - A Look at an Evolving Threat.",
            "Is Infrastructure: The Influence of Senior it Leadership and Strategic Information Systems Planning.",
            "Media Richness Theory and the Distance Education Environment.",
            "Enterprise Resource Planning (ERP) System Selection: A Data Envelopment Anaysis (DEA) Approach.",
            "Social and Legal Impacts on Information Ethics Decision Making.",
            "The Influence of Personalization in Affecting Consumer Attitudes toward Mobile Advertising in China.",
            "Evaluating Integration Approaches Adopted by Healthcare Organizations.",
            "Industry Perceptions of the Competencies Needed by Computer Programmers: Technical, Business, and Soft Skills.",
            "Demographic Differences in Attitudes toward Remote Electronic Voting Systems.",
            "The Study and Verification of Mathematical Modeling for Customer Purchasing Behavior.",
            "Networks and Telecommunications Course Content Lists: A Comparison between it Educators and Industry Personnel.",
            "An Empirical Model of Software Size and Work-Effort Estimation for Business Application Software.",
            "Measuring Information System Usage: Replication and Extensions.",
            "Modeling Web Service Profiles for the Semantic Web: A UML Based Approach.",
            "The Impact of Customer-Related it Investments on Customer Satisfaction and Shareholder Returns.",
            "Rigor in MIS Survey Research: In Search of Ideal Survey Methodological Attributes.",
            "A Review of the Impact of ACM Code of Conduct on Information Technology Moral Judgment and Intent.",
            "Partner Alignment and Governance in it Software Alliances.",
            "Information Systems Offshoring: Differing Perspectives of the Value Statement.",
            "A Study of Career Anchors and Job Characteristic Preferences of is Students.",
            "The Effectiveness of Strategic Information Systems Planning for Technical Resources, Personnel Resources, and Data Security in Environments of Heterogeneity and Hostility.",
            "Computer Information Systems as Determinants of Police Investigation Performance: An Empirical Study.",
            "Critical Success Factors in International ERP Implementations: A Case Research Approach.",
            "Refreshing Data Warehouses with near Real-Time Updates.",
            "An End-User Information Systems Curriculum for the 21St Century.",
            "Integrating Data Mining and Decision Support through Data Mining Based Decision Support System.",
            "Empiracal Study of Students' Computer Security Practices/Perceptions.",
            "The Organizational Transformation of Securities Brokerage Firms under Electronic Commerce Environment.",
            "Combinatorial Auction Based Collaborative Procurement.",
            "Information Technology and Six Sigma Implementation.",
            "A Comparative Examination of Individual Differences and Beliefs on Technology Usage: Gauging the Role of it.",
            "A Case-Based Approach to the Evaluation of New Audit Clients.",
            "Interactions between Organizational Size, Culture, and Structure and Some it Factors in the Context of ERP Success Assessment: An Exploratory Investigation.",
            "A Practical System to Manage and Control Digital Media.",
            "Is Project Management: Size, Practices and the Project Management Office.",
            "It Project Risk Factors: The Project Management Professionals Perspective.",
            "Information Technology Help Desk Survey: To Identify the Classification of Simple and Routine Enquiries.",
            "A Comparative Study of Virtual Communities in Bangladesh and the Usa.",
            "Assessing Organizational Innovation Capability and its Effect on E-Commerce Initiatives.",
            "Evaluating Effects of Data Popularity on Performance of Caching Strategy in Pull-Based Data Boradcast Systems.",
            "A Gdss for Ranking A Firm's Core Capability Strategies."
        ]
    },
    {
        "name": "JCIS",
        "year": "2005",
        "info": "Volume 46, 2005-2006",
        "count": 63,
        "papers": [
            "Infusion of Electronic Commerce into the Information Systems Curriculum.",
            "Emerging Issues in Researching Community-Based Wlans.",
            "Facilitating Conditions, Wireless Trust and Adoption Intention.",
            "Vector Error-Correction Models in a Consumer Packaged Goods Category Forecasting Decision Support System.",
            "An Enterprise Application Integration (EAI) Case-Study: Seamless Mortgage Processing at Harmond Bank.",
            "Quality Assesment of Cultural Web Sites with Fuzzy Operators.",
            "Transition of Knowledge/Skills Requirement for Entry-Level is Professionals: An Exploratory Study Based on Recruiters' Perception.",
            "An Improved Suite of Object Oriented Software Measures.",
            "The Effects of Buyer and Product Traits with Seller Reputation on Price Premiums in E-Auction.",
            "An Exploratory Study of Factors Influencing M-Learning Success.",
            "Effective Customer Relationship Management through Web Services.",
            "An Efficient Database Management Scheme for Portable Information Devices.",
            "2005 Computer Educator of the Year.",
            "2005 Ben Bauman Award for Excellence.",
            "Clustering of XML Schemas for Information Integration.",
            "Analysis of Critical Website Characteristics: A Cross-Category Study of Successful Websites.",
            "Factors Affecting Student Performance and Satisfaction: Online versus Traditional Course Delivery.",
            "A Decision Support System for Computer Literacy Training at Universities.",
            "Attitude towards Knowledge Sharing Behavior.",
            "How Individual Differences Influence Technology Usage Behavior? Toward an Integrated Framework.",
            "Frequency of Publication and Topical Emphasis of Knowledge Management Books versus Doctoral Dissertations: 1983-2005.",
            "Should Rule-Based Reasoning Be Enhanced by Case-Based Reasoning for Conceptual Database Design? A Theory and an Experiment.",
            "Evaluating the Teaching Effectiveness of Various Data Modeling Notations.",
            "Consumers' Initial Trust toward Second-Hand Products in the Electronic Market.",
            "An Empirical Investigation of the Task Specific Relative Strenghts of Selected Accounting and Information Systems Diagramming Techniques.",
            "Computer Forensics: The Modern Crime Fighting Tool.",
            "IACIS 2005 Conference in Review.",
            "A Role-Based Multilevel Security Access Control Model.",
            "The Role of Need for Cognition and Mood in Online Flow Experience.",
            "Factors in the Adoption of Third-Party B2B Portals in the Textile Industry.",
            "Dilemma between the Structured and Object-Oriented Approaches to Systems Analysis and Design.",
            "Work Commitments of Baby Boomers and Gen-Xers in the it Profession: Generational Differences or Myth?",
            "Information Systems Technologies: A Public-Private Sector Comparison.",
            "Performance Evaluation for Web Applications with Web Caching in a Distributed Wireless System Using Opnet™.",
            "Critical Infrastructure Network Evaluation.",
            "Determinants of Instructors' Intentions to Teach Online Courses: A Cross-Cultural Perspective.",
            "Where it Outsourcing is and Where it is Going: A Study across Functions and Department Sizes.",
            "Training Groups of End Users: Examining Group Interactions in a Computer-Based Learning Environment.",
            "Research Propositions for Knowledge Management Systems Supporting it Outsourcing Relationships.",
            "Papa Revisited: A Current Empirical Study of the Mason Framework.",
            "Improving Accessibility and Security for Mobile Phone Shopping.",
            "A Predictive Model for Web Prefetching.",
            "The Impact of Industrial Characteristics and Organizational Climate on KMS and Bip-Taiwan Bioscience Industry.",
            "Secure Information Sharing in Internet-Based Supply Chain Management Systems.",
            "Investigating Factors Influencing Adoption of Broadband in the Household.",
            "Use of a Groupware Product: A Test of Three Theoretical Perspectives.",
            "Understanding it Outsourcing and its Potential Effects on it Workers and Their Environment.",
            "Strategic Information Technology Prioritization.",
            "A Knowledge Component Analysis Model Based on Term Frequency and Correlation Analysis.",
            "Information Systems Ethics in the Triad.",
            "E-Learning and Individual Characteristics: The Role of Computer Anxiety and Communication Apprehension.",
            "Knowledge Management as a Foundation for Decision Support Systems.",
            "A Study of Trust in E-Shopping before and after First-Hand Experience is Gained.",
            "Process Coordination Requirements: Implications for the Design of Knowledge Management Systems.",
            "Ontological Modeling Rules for UML: An Empirical Assessment.",
            "Applying the UML and the Unified Process to the Design of Data Warehouses.",
            "Using Cognitive Mapping Techniques to Supplement UML and up in Information Requirements Determination.",
            "A Metamodeling Approach for Requirements Specification.",
            "Communication Challenges in Requirements Elicitation and the Use of the Repertory Grid Technique.",
            "Mapping Commonalities and Differences in Software Engineering and Graphic Design Approaches to Multimedia Systems Development.",
            "Critical Success Factors for Enterprise Resource Planning Implementation and Upgrade.",
            "Competing Mistresses? Academic Vs. Practitioner Perceptions of Systems Analysis.",
            "The Impact of Operational User Participation on Perceived System Implementation Success: An Empirical Investigation."
        ]
    },
    {
        "name": "JCIS",
        "year": "2004",
        "info": "Volume 45, 2004-2005",
        "count": 50,
        "papers": [
            "Computer Educator of the Year.",
            "Ben Bauman Award for Excellence.",
            "A First Attempt in Using Web-Based Support Tools to Create a Learning Community in the Introductory MIS Course.",
            "Information Seeking on University Web Sites: An Exploratory Study.",
            "An Empirical Investigation of the Effects of GSS and Group Process on Group Outcome in Small Group Decision-Makings.",
            "A Causal Model for Using Collaborative Technologies to Facilitate Student Team Projects.",
            "Evaluating Mid-Level ERP Software.",
            "The Impact of Cognitive and other Factors on the Perceived Usefulness of OLAP.",
            "The Effect of Age on Computer Programmer Wages.",
            "The Paradox of Soft Skills versus Technical Skills in is Hiring.",
            "Learning Style and Performance: A Field Study of is Students in an Analysis and Design Course.",
            "Systems Thinking for Identifying Unintended Consequences of it: Packaged Software Implementation in Small Businesses.",
            "The Role of Web Site Characteristics in Initial Trust Formation.",
            "Decision Support System for Tourism Development: System Dynamics Approach.",
            "Profiling the Learning Styles of Students in Cyber University.",
            "Alignment of Business Strategy and it Strategy: A Case Study of A Fortune 50 Financial Services Company.",
            "Information Technology Outsourcing and Virtual Team.",
            "User Information Satisfaction Scale Reduction: Application in an it Outsourcing Environment.",
            "Is Microsoft Excel 2003 Ready for the Statistics Classroom?",
            "Assessing & Quantifying the Loss of Network Intrusion.",
            "Core Web Technologies for New E-Commerce Employees.",
            "An Adaptable Customer Decision Support System for Custom Configurations.",
            "Visualizing Changing Requirements with Self-Organizing Maps.",
            "Understanding Information Quality in E-Business.",
            "Web Services Composition for Process Management in E-Business.",
            "Implementation of Knowledge Management Systems and Firm Performance: An Empirical Investigation.",
            "IACIS 2004 Conference in Review.",
            "Software Analysis by Code Clones in Open Source Software.",
            "Exploring the Systems Analyst Skill Set: Perceptions, Preferences, Age, and Gender.",
            "Integration of Project Management Components in Undergraduate Information Systems Curricula.",
            "The Importance of Information Technology: An Empirical and Longitudinal Study of the Annual Reports of the 50 Largest Companies in the United States.",
            "Measuring User Satisfaction and Perceived Usefulness in the ERP Context.",
            "Human-Computer Interaction: The Effect of Application Domain Knowledge on Icon Visualization.",
            "A Metamodel for Modeling Collaborative Systems.",
            "How are Public Sector Organizations Managing is Outsourcing Risks? An Analysis of Outsourcing Guidelines from Three Jurisdictions.",
            "Information Technology (IT) Appropriateness: The Contingency Theory of \"Fit\" and it Implementation in Small and Medium Enterprises.",
            "A Novel Approach to Joint Business and Information System Design.",
            "Dynamics of Information Technology (It) Successful Implementation in Development Countries: A Nigerian Case Study.",
            "An Empirical Application of the Delone and Mclean Model in the Kuwaiti Private Sector.",
            "Information Fusion via a Hierarchical Neural Network Model.",
            "The Role of Benchmarking in Best Practice Management and Knowledge Sharing.",
            "Creating Value through Managing Knowledge in an E-Government to Constituency (G2C) Environment.",
            "Assessment of a Web-Based Learning Game in an Information Systems Course.",
            "Portals in the Academic World: Are They Meeting Expectations?",
            "Incorporating Business Processes and Functions: Addressing the Missing Element in Information Systems Education.",
            "Exploring Knowledge Management Using Network Theories: Questions, Paradoxes and Prospects.",
            "The Acceptance of Women-Centric Websites.",
            "Analysis of Skill Requirements for Systems Analysts in Fortune 500 Organizations.",
            "The Demographics of Broadband Residential Consumers in a British Local Community: The London Borough of Hillingdon.",
            "Performance of Caching Strategies for Pull-Based Data Broadcast Systems in Mobile Computing Environments."
        ]
    },
    {
        "name": "JCIS",
        "year": "2003",
        "info": "Volume 44, 2003-2004",
        "count": 57,
        "papers": [
            "Computer Educator of the Year.",
            "Ben Bauman Award for Excellence.",
            "Enhancing the Quality-Of-Service for Application Service Providers.",
            "The it Alignment Planning Process.",
            "Assessment in On-Line CIS Courses.",
            "Sftis: A Decision Support System for Tourism Demand Analysis and Forecasting.",
            "Interorganizational Systems and Competitive Advantages - Lessons from History.",
            "Architecture for Web-Based Image Mining and Management Systems.",
            "Information Systems in Indian Rural Communities.",
            "A Deeper Look at the Attitude-Behavior Consistency Assumption in Information Systems Satisfaction Research.",
            "Exploring Internet Addiction: Demographic Characteristics and Stereotypes of Heavy Internet Users.",
            "Culture, Overload and Personal Innovativeness with Information Technology: Extending the Nomological Net.",
            "Integration and Composition of Web Service-Based Business Processes.",
            "The Impact of Power Distance on Email Acceptance: Evidence from the PRC.",
            "Wireless Systems Development Methodologies: An Analysis of Practice Using Actor Network Theory.",
            "An Empirical Evaluation of Knowledge Transfer Mechanisms for it Projects.",
            "Through the Looking Glass: Towards A Formalization of Aggregation Issues in Health Data Integration (HDI).",
            "A Knowledge Management Strategy for the Jason Organization: A Case Study.",
            "Member Trust in Teams: A Synthesized Analysis of Contract Negotiation in Outsourcing it Work.",
            "Evaluating the Usability of A Group Support System Using Co-Discovery.",
            "The Impact of Gender Differences on Job Satisfaction, Job Turnover, and Career Experiences of Information Systems Professionals.",
            "Evaluating is Curriculum Issues through an Ongoing Alumni Assessment Mechanism.",
            "Evaluating Electronic Commerce Acceptance with the Technology Acceptance Model.",
            "Collaboration and Visualization: Integrative Opportunities.",
            "An Exploratory Analysis of Relationships between Cellular Phone Uses' Shopping Motivators and Lifestyle Indicators.",
            "Improving Workers' Productivity and Reducing Internet Abuse.",
            "Measuring it Performance: \"Contingency\" Variables and Value Modes.",
            "A Multi-Agent DSS for Supporting E-Commerce Decisions.",
            "An Empirical Investigation into the Relationship between Computer Self-Efficacy, Anxiety, Experience, Support and Usage.",
            "Conflict Order-Based View Refreshment Scheme for Transaction Management in Data Warehouse Environment.",
            "IACIS 2003 Conference in Review.",
            "The Effect of Affiliation Motivation on the Intention to Use Groupware in an MBA Program.",
            "A Performance Evaluation Framework for a Public University Knowledge Management System.",
            "Evaluating Website Quality in the Airline Industry.",
            "Doing Survey Research on the Internet: Yes, Timing Does Matter.",
            "Virtual Mentor and the Lab System - Toward Building an Interactive, Personalized, and Intelligent E-Learning Environment.",
            "Theory-Based Instrumentation to Measure the Intention to Use Electronic Commerce in Small and Medium Sized Businesses.",
            "Cognitive Characteristics for Learning Visual Basic.",
            "Supply Chains Integration: Architecture and Enabling Technologies.",
            "The Influence of Creative Style and Climate on Software Development Team Creativity: An Exporatory Study.",
            "An Integrative Framework for the Assimilation of Enterprise Resource Planning Systems: Phases, Antecedents, and Outcomes.",
            "The Determinants of Total it Outsourcing: An Empirical Investigation of French and German Firms.",
            "An Empirical Study of End-User Computing Acceptance Factors in Small and Medium Enterprises in Taiwan: Analyzed by Structural Equation Modeling.",
            "Splitting the Sap Instance: Lessons on Scope and Business Processes.",
            "A Document and User Matching Model via Document Keyword Analysis.",
            "An Empirical Assessment of the Assimilation Patterns and the Benefits of Collaborative Information Technologies.",
            "An Empirical Examination of a Model of Computer Learning Performance.",
            "An Inhibiting Context Hampering Role of Information Technology as an Enabler in Organizational Learning.",
            "Effectiveness of E-Learning Course Materials for Learning Database Management Systems: An Experimental Investigation.",
            "Evaluating E-Learning: A Case Study.",
            "Discriminant Analysis of Technology Adoption Behavior: A Case of Internet Technologies in Small Businesses.",
            "Gaining Competitive Advantages through a Functionality Grid for Website Evaluation.",
            "The Role of Extranets in Delivering Customer Service.",
            "Protecting Personal Information Online: A Survey of User Privacy Concerns and Control Techniques.",
            "The Effects of Navigational Orientation and User Experience on User Task Efficiency and Frustration Levels.",
            "Transplanting the Best Practice for Implementation of an ERP System: A Structured Inductive Study of an International Company.",
            "Stages of Growth for Knowledge Management Technology in Law Firms."
        ]
    },
    {
        "name": "JCIS",
        "year": "2002",
        "info": "Volume 43, 2002-2003",
        "count": 62,
        "papers": [
            "Computer Educator of the Year.",
            "Ben Bauman Award for Excellence.",
            "Data Warehouse Development and Management: Practices of Some Large Companies.",
            "Connectionist Models for Learning, Discovering, and Forecasting Software Effort: An Empirical Study.",
            "An Empirical Investigation of the Adoption of Egovernment in Australian Citizens: Some Unexpected Research Findings.",
            "Numerical Queueing Analysis of Loss Priority for Large Buffer in Atm Networks.",
            "Designing a Knowledge-Based Interface for Intelligent Shopping Agents.",
            "Teaching Information Management to Graduate Non-It Majors.",
            "A Meta-Analysis of Emerging Infomediary Knowledge Management Systems: An Expert Systems Application in the E-Tailing Environment.",
            "The Visual Basic Course in Accredited Business Schools.",
            "Classroom Exercises for Improving Understanding of Analysis and Design of Decision Support Systems.",
            "An Exploratory Longitudinal Analysis of GSS Use in the Case Method Classroom.",
            "Case Tool Use and Job Design: A Restrictiveness/Flexibility Explanation.",
            "A Database-Centric and Web-Automatic Hypertext Application Design Method.",
            "A Target-Costing Based Strategic Decision Support System.",
            "Raising a Red Flag on Global WWW Privacy Policies.",
            "Web-Based Data Warehousing: Current Status and Perspective.",
            "Regulating the Information Society: Initial ISP Reactions to Australian Internet Content Legislation.",
            "Waiting for the other Shoe to Drop: Has Information Technology Integrated Marketing Operations with Marketing Strategy?",
            "A Synthesis of Research on the Properties of Effective Internet Commerce Web Sites.",
            "What is a Dot-Com Worth? an exploration of the Value Estimates of Information Technology-Based Firms.",
            "A Verification-Based Conflict Resolution Strategy for Knowledge Management Systems.",
            "Using Group Projects in MIS: Strategies for Instruction and Management.",
            "Investigating Computer Anxiety and Communication Apprehension as Performance Antecedents in a Computing-Intensive Learning Environment.",
            "An Empirical Investigation into the Relationship between Organizational Culture and Computer Efficacy as Moderated by Age and Gender.",
            "Design and Implementation of an ERP Oracle Financials Course.",
            "Organizational Size: A Significant Predictor of it Innovation Adoption.",
            "Not [Faculty] and [Internet].",
            "Systems Development Practices: Circa 2001.",
            "People and Information Matter: Task Support Satisfaction from the other Side.",
            "IACIS 2002 Conference in Review.",
            "Complexity and Control as Determinants of Performance with Information Technology Innovations.",
            "Providing Navigation Aids and Online Learning Helps to Support User Control: A Conceptual Model on Computer-Based Learning.",
            "Using Group Projects in Mis: Strategies for Instruction and Management.",
            "Changes in Student Computer Technology Attitudes over Time.",
            "The Three Ring Model and Development of an Instrument for Measuring Dimensions of E-Government Functions.",
            "Integrating Object Oriented Role-Based Access Control Model with Mandatory Access Control Principles.",
            "Web Personalization: The Impact of Perceived Innovation Characteristics on the Intention to Use Personalization.",
            "The Impact of Auction Item Image and Buyer/Seller Feedback Rating on Electronic Auctions.",
            "Student Attitudes toward Internet Courses: A Longitudinal Study.",
            "Investigating the Use of Role Play Training to Improve the Communication Skills of is Professionals: Some Empirical Evidence.",
            "Enterprise Software Certification Academy: A Longitudinal Study.",
            "A Structural Analysis of the Significance of A Set of the Original Tqm Measurement Items in Information Systems Function.",
            "The Perception of Professionals and Management Personnel on the Virtual Organization.",
            "Evaluating A Positive Attribute Clustering Model for Data Mining.",
            "What Can Ontologists Learn from Knowledge Management?",
            "CDC's New Epidemic: An Investigation into Awareness, Attitudes, Actions, and Knowledge of Computer Viruses among Students Utilizing Campus Computer Labs.",
            "Perceptions of Java - Experienced Programmers' Perspective.",
            "Predicting Database Designer Potential with the Berger Aptitude for Programming Test (B-Apt).",
            "A Knowledge Management Framework for Curriculum Assessment.",
            "Going with the Flow: Predicting Online Purchase Intentions.",
            "A Rubric for the Evaluation of Interactive Multimedia and the Impact of Instruction on Students' Evaluations.",
            "The Impact of Immediate Feedback on Group Decision Satisfaction.",
            "Is Trust Important in Technology Adoption? A Policy Capturing Approach.",
            "E-Catalog Evaluation Criteria and Their Relative Importance.",
            "Diversity and the Information Technology Workforce: Barriers and Opportunities.",
            "A Firm Level Study of Information Technology Productivity Using Financial and Market Based Measures.",
            "Critical Success Factors for is Outsourcing Implementation from an Interorganizational Relationship Perspective.",
            "An Investigation into the Feasibility of Using an Internet-Based Intelligent System to Facilitate Knowledge Transfer.",
            "Fortv: Decision Support System for Forecasting Television Viewership.",
            "Are Gender Perceptions of Computing Changing over Time?",
            "Student-Instructor Perception of Computer Technologies in Developing Countries: The Case of Jordan."
        ]
    },
    {
        "name": "JCIS",
        "year": "2001",
        "info": "Volume 42, 2001-2002",
        "count": 71,
        "papers": [
            "Working with Industry to Create a Successful Alliance.",
            "A Longitudinal Study of College Student Computer Knowledge.",
            "The Changing Profile of Information Systems Research: 1995-2000.",
            "Emerging Issues in it Certification.",
            "Lean Software Process.",
            "Re-Engineering Participation through On-Line Learning Environments: An Examination of Communication Apprehension, Choice, and Performance.",
            "Collaborative Team Learning in Information Systems: A Pedagogy for Developing Team Skills and High Performance.",
            "Adoption of Information Technology in Small Business: Testing Drivers of Adoption for Entrepreneurs.",
            "Graduate E-Business Program Design and Evaluation.",
            "Students' Views of the Importance of Techncal and Non-Technical Skills for Successful it Professionals.",
            "Key Dimensions of Web Design Quality as Related to Consumer Response.",
            "Students' Perceptions and Misconceptions of a Career in is.",
            "Do Broad Scope Managerial Accounting Systems Moderate the Effects of Budget Emphasis, Budget Participation and Perceived Environmental Uncertainty on the Propensity to Create Budgetary Slack?",
            "Capturing and Comparing Objectively and Subjectively Determined Decision Models in User Information Satisfaction Judgment Formation.",
            "Computer Educator of the Year.",
            "Ben Bauman Award for Excellence.",
            "A Study of Cultural Differences in Global Corporate Web Sites.",
            "Factors Affecting E-Commerce Web Site Effectiveness.",
            "Information Systems: The Quiet Revolution in Human Resource Management.",
            "The Effects of Race on Telecommuting Motivators: Implications for the Recruitment of Minorities into Open Information Technology Positions.",
            "Organizational Factors for Successful Management of Software Development.",
            "Distance Learning Technology Adoption: A Motivation Perspective.",
            "Decentralizing the is Function: Resources and Locus of Decisions.",
            "What Might Go Wrong with Lan Design and Implementation?",
            "Categorizing Corporate Web-Based, Supplier Diversity Initiatives.",
            "Improving Entity Relationship Modeling Accuracy with Novice Data Modelers.",
            "Entry-Level is Job Skills: A Survey of Employers.",
            "Structural Shifts in Career Anchors of Information Systems Personnel: A Preliminary Empirical Analysis.",
            "Small Company Cios.",
            "The Difficulties of Learning Object-Oriented Analysis and Design: An Exploratory Study.",
            "Assessing Belief Differences in Small Business Adopters and Non-Adopters of Web-Based E-Commerce.",
            "The Downturn in Programmer Demand: A Wavelet Analysis.",
            "Object-Oriented Analysis and Design - What Does the Research Say?",
            "Security in the Information Systems Curriculum: Identification & Status of Relevant Issues.",
            "An Internet Knowledge Sharing System.",
            "Computer End-User Skills Important for Business Professionals Now and toward 2005.",
            "Entry Level Value versus Career Value of Mis Courses: Faculty Expectations versus Alumni Perceptions.",
            "Hypertext Navigation - An Intrinsic Component of the Corporate Intranet.",
            "Cognitive Characteristics for Learning C++.",
            "A System Development Methodology for ERP Systems.",
            "Effects of Electronic Commerce Implementation in Taiwan.",
            "Internet Integrated Customer Relationship Management a Key Success Factor for Companies in the E-Commerce Arena.",
            "An Exploratory Examination of Factors Affecting Online Sales.",
            "Information Sourcing from the Internet and its Verification.",
            "An Empirical Study of Students' Computer Self-Efficacy: Differences among Four Academic Disciplines at a Large University.",
            "The Impact of Personality Diversity on Conflict in ISD Teams.",
            "Online Privacy Policies: An Assessment of the Fortune E-50.",
            "Enhancing Enterprise Decisions through Organizational Data Mining.",
            "The Master's Degrees in E-Commerce: A Survey Study.",
            "The Application Development Outsourcing Decision: An Application of the Technology Acceptance Model.",
            "The Management Information Systems (Mis) Job Market Late 1970S-Late 1990s.",
            "Designing a Web-Based Multi-Criteria Group Support System (MCGSS).",
            "Knowledge Mining from Trained Neural Networks.",
            "Organizational Factors Associated with Expert Systems Implementation.",
            "Policies Controlling Use of Computer-Based Resources in Small Businesses.",
            "Using Decision Support Systems to Enhance Learning in Higher Education.",
            "Simulation of the Harmful Consequences of Self-Similar Network Traffic.",
            "The Key Dimensions of Criteria for the Evaluation FNA Selection of ISPS: An Exploratory Study.",
            "Facilitating Innovation through Knowledge Sharing: A Look at the Us Naval Surface Warfare Center-Carderock Division.",
            "From Telemedicine to E-Health: Uncovering New Frontiers of Biomedical Research, Clinical Applications & Public Health Services Delivery.",
            "Knowledge Management as a Key for E-Business Competitiveness: From the Knowledge Chain to KM Audits.",
            "Knowledge Management: A Review of Industrial Cases.",
            "Knowledge Management Capabilities & Infrastructure for E-Commerce.",
            "Inter-Organizational Knowledge Management: A Comparison of Law Firms in Norway and Australia.",
            "An Agent-Based Knowledge Management Framework for the E-Commerce Environment.",
            "An Empirical Study of the Impact of Knowledge Management on Organizational Performance.",
            "A Knowledge Management Architecture in Collaborative Supply Chain.",
            "Building a Knowledge-Enabled Electronic Commerce Environment.",
            "Knowledge Management in E-Banking: A Competence-Based Perspective.",
            "A Web-Based Knowledge Management Environment for Consulting and Research Organizations.",
            "Knowledge Management Mechanisms in E-Commerce: A Study of Online Retailing and Auction Sites."
        ]
    },
    {
        "name": "JCIS",
        "year": "2000",
        "info": "Volume 41, 2000-2001",
        "count": 60,
        "papers": [
            "Computer Support of Shift Work: An Experiment in a GSS Environment.",
            "Error Identification in Presentation Slides.",
            "Developing Implementation Objectives for Educational Information Systems: A Theoretical Perspective.",
            "SAP R/3: A Reengineering Tool at Tenneco, Inc.",
            "Examining the Determinants of Productive Efficiency with it as a Production Factor.",
            "A Visual Approach to End User Form Management.",
            "Teaching Information Systems: A Resource for Department Heads and Course Coordinators.",
            "Electronic Resource Planning Solutions for Business Processes.",
            "Validation of the End-User Computing Satisfaction Instrument in Case Tool Environments.",
            "Influencing African Americans' Decisions to Select an Information Technology Major.",
            "Electronic Economies of Scope: Investigating Synergies from Procuring and Selling on the Web.",
            "Why Information Systems Projects are Abandoned: A Leadership and Communication Theory and Exploratory Study.",
            "Faculty Course Use of the Internet.",
            "The New Spectrum of the Cross-Enterprise Solution: The Integration of Supply Chain Management and Enterprise Resources Planning Systems.",
            "Confronting the OS Rivalry: Unix Vs. Nt.",
            "Computer Educator of the Year.",
            "Activating Consumer Response: A Model for Web Site Design Strategy.",
            "Is Audit Training Needs for the 21ST Century: A Selected Assessment.",
            "Status of Master's Programs in Information Systems.",
            "Understanding Online Retail: A Classification of Online Retailers.",
            "Developers' Perceptions of Information Systems Success Factors.",
            "A Study of Competitive Intelligence Practices in Organizations.",
            "Small Business Management: An It-Based Approach.",
            "Information Engineering Methodologies and Organizational Change: An Exploratory Study.",
            "Developing a Computer Security Policy for Organizational Use and Implementation.",
            "From Database to Web Browser: The Solutions to Data Access.",
            "It-Based Coordination and Organizational Performance: A Gestalt Approach.",
            "Educational Gaps as Perceived by is Educators: A Survey of Knowledge and Skill Requirements.",
            "Marketing Information Systems Usage in Taiwan's Top 1000 Companies.",
            "Motivational Factors, Characteristics, and Computer Skills of MBA Students in Web-Based Courses.",
            "Effectiveness of Asynchronous and Synchronous Modes for Learning Computer Software for End Users: An Experimental Investigation.",
            "A Study of User Attitudes toward Persistent Cookies.",
            "Consumer Perspectives on Service Quality of Electronic Commerce Web Sites.",
            "A Study of the Impact of Information Technology Investment on Firm Performance.",
            "Training End Users: Assessing the Effectiveness of Multimedia CBT.",
            "Utilizing the Internet as a Competitive Tool for Non-Profit Organizations.",
            "Marketing Information Systems Practices in Small Manufacturing Firms: Antecedents and Consequences.",
            "Neural Networks Refined: Using a Genetic Algorithm to Identify Predictors of is Student Success.",
            "Information Technology Deployment and its Impact on Operations in a Large Manufacturing Company.",
            "A Framework of Educational Technology Applications and Development Opportunities.",
            "Explaining Online Behavioral Differences: An Internet Dependency Perspective.",
            "An Empirical Study of the Measurement and Instrument Validation of Perceived Strategy Value of Information Systems.",
            "Understanding Small Business Electronic Commerce Adoption: An Empirical Analysis.",
            "Are Slovene Small Firms Using Information Technology Strategically?",
            "Customer Relationship Management: An Analysis Framework and Implementation Strategies.",
            "Explaining Software Development tool Use with the Technology Acceptance Model.",
            "User Perceptions of Data Quality: Internet and Traditional Text Sources.",
            "Developing a Data Communications Lab for Less Than $600: A Documented Experience.",
            "Evolution of is Professionals' Competency: An Exploratory Study.",
            "Factors Affecting the Adoption of Knowledge Management Technologies: A Discriminative Approach.",
            "Benchmarking the Required Information Systems Course in Aacsb Accredited MBA Programs: An Analysis of Course Content and Processes.",
            "Comparison of Database Management Systems.",
            "Shaping of Moral Intensity regarding Software Piracy in University Students: Immediate Community Effects.",
            "The Significance of Information and Analysis as a Component of a Leadership Model Based on Malcolm Baldrige National Quality Award Criteria.",
            "Age, Motivation, and Participation in Professional Development.",
            "A Longitudinal Study of Usage and Satisfaction Levels of Internet Shopping by College Students.",
            "Measuring Facts of Media Richness.",
            "Explaining is Student and is Industry Differences in Perceptions of Skill Importance.",
            "Development and Testing of an Instrument for Measuring the User Evaluations of Information Technology in Health Care.",
            "Getting More out of Organizational Memory: Comparative Comments and Output Medium."
        ]
    }
]