[
    {
        "name": "JDM",
        "year": "2021",
        "info": "Volume 32, 2021",
        "count": 20,
        "papers": [
            "On Elastic Incentives for Blockchain Oracles.",
            "Usurping Double-Ending Fraud in Real Estate Transactions via Blockchain Technology.",
            "Enhancing the Retailer Gift Card via Blockchain: Trusted Resale and More.",
            "Privacy Preserving Data Mining as Proof of Useful Work: Exploring an AI/Blockchain Design.",
            "An Infodemiological Analysis of Google Trends in COVID-19 Outbreak: Predict Case Numbers and Attitudes of Different Societies.",
            "Fear of Missing Out (FOMO) Toward ICT Use During Public Health Emergencies: An Investigation on Predictors and Outcomes.",
            "Profiling the Users of High Influence on Social Media in the Context of Public Events.",
            "Affording Twitter in Emergency Situations: The Occurrence of Rumor Sense-Making.",
            "Research Commentary on IS/IT Role in Emergency and Pandemic Management: Current and Future Research.",
            "Distinguishing Personality Recognition and Quantification of Emotional Features Based on Users' Information Behavior in Social Media.",
            "Missing Data in OLAP Cubes: Challenges and Strategies.",
            "The Paradoxical Effect of Social Media Usage on Developer Creativity and the Moderating Role of Openness to Experience.",
            "Learn From the Rumors: International Comparison of COVID-19 Online Rumors Between China and the United Kingdom.",
            "A Requirements Engineering Framework for Software Startup Companies.",
            "A Review on the Integration of Deep Learning and Service-Oriented Architecture.",
            "Text-Image Retrieval With Salient Features.",
            "Biomedical Ontology Matching Through Attention-Based Bidirectional Long Short-Term Memory Network.",
            "SinGAN-Based Asteroid Surface Image Generation.",
            "Low-Quality Error Detection for Noisy Knowledge Graphs.",
            "Convolutional Recurrent Neural Networks for Text Classification."
        ]
    },
    {
        "name": "JDM",
        "year": "2020",
        "info": "Volume 31, 2020",
        "count": 17,
        "papers": [
            "Detecting Expressional Anomie in Social Media via Fine-grained Content Mining.",
            "Optimizing Semi-Stream CACHEJOIN for Near-Real- Time Data Warehousing.",
            "Bug Bounty Marketplaces and Enabling Responsible Vulnerability Disclosure: An Empirical Analysis.",
            "A Service Architecture Using Machine Learning to Contextualize Anomaly Detection.",
            "Experience Matters: The Role of Vicarious Experience in Secure Actions.",
            "The Cultural Foundation of Information Security Behavior: Developing a Cultural Fit Framework for Information Security Behavior Control.",
            "Use of Qualitative Research to Generate a Function for Finding the Unit Cost of Software Test Cases.",
            "Research Challenges and Opportunities in Conducting Quantitative Studies on Large-Scale Agile Methodology.",
            "Artificial Intelligence (AI) Ethics: Ethics of AI and Ethical AI.",
            "Systems Analysis and Design Toolkit Based on Work System Theory and Its Extensions.",
            "A Framework for Building Mature Business Intelligence and Analytics in Organizations.",
            "Creativity of Participants in Crowdsourcing Communities: The Effects of Promotion Focus and Extrinsic Motivation.",
            "The Rise of NoSQL Systems: Research and Pedagogy.",
            "Investigating the Effects of Object-Relational Impedance Mismatch on the Efficiency of Object-Relational Mapping Frameworks.",
            "Expert Detection and Recommendation Model With User-Generated Tags in Collaborative Tagging Systems.",
            "A Meta-Analysis of Ontological Guidance and Users' Understanding of Conceptual Models.",
            "Revising the Socio-Technical Perspective for the 21st Century: New Mechanisms at Work."
        ]
    },
    {
        "name": "JDM",
        "year": "2019",
        "info": "Volume 30, 2019",
        "count": 15,
        "papers": [
            "Using Ontology and Rule-Based Reasoning for Conceptual Data Models Synonyms Detection: A Case Study.",
            "Map-Side Join Processing of SPARQL Queries Based on Abstract RDF Data Filtering.",
            "Designing Graph Databases With GRAPHED.",
            "Artificial Intelligence, Machine Learning, Automation, Robotics, Future of Work and Future of Humanity: A Review and Research Agenda.",
            "Multi-Objective Optimization-Based Networked Multi-Label Active Learning.",
            "Collaboration Matrix Factorization on Rate and Review for Recommendation.",
            "An Improved Approach to Audio Segmentation and Classification in Broadcasting Industries.",
            "Artificial Intelligence, Machine Learning, and Autonomous Technologies in Mining Industry.",
            "The Differential Effects of Interpersonal Justice and Injustice on Computer Abuse: A Regulatory Focus Theory Perspective.",
            "It's Not My Fault: The Transfer of Information Security Breach Information.",
            "Schema-Based JSON Data Stores in Relational Databases.",
            "AFARTICA: A Frequent Item-Set Mining Method Using Artificial Cell Division Algorithm.",
            "Factors Influencing Intention of Facebook Fans of Companies to Convert into Actual Buyers.",
            "Multi-Fuzzy-Objective Graph Pattern Matching with Big Graph Data.",
            "Social Capital and Knowledge Networks of Software Developers: A Case Study."
        ]
    },
    {
        "name": "JDM",
        "year": "2018",
        "info": "Volume 29, 2018",
        "count": 15,
        "papers": [
            "Beyond Micro-Tasks: Research Opportunities in Observational Crowdsourcing.",
            "An Ontological Analysis Framework for Domain-Specific Modeling Languages.",
            "QGLG Automatic Energy Gear-Shifting Mechanism with Flexible QoS Constraint in Cyber-Physical Systems: Designing, Analysis, and Evaluation.",
            "Implicit Semantics Based Metadata Extraction and Matching of Scholarly Documents.",
            "An Efficient Stochastic Update Propagation Method in Data Warehousing.",
            "To Evaluate or Not to Evaluate?: A Two-Process Model of Innovation Adoption Decision Making.",
            "A Novel Approach to Distributed Rule Matching and Multiple Firing Based on MapReduce.",
            "Research on Improved Method of Storage and Query of Large-Scale Remote Sensing Images.",
            "Towards Real-Time Multi-Sensor Golf Swing Classification Using Deep CNNs.",
            "Consumers' Stickiness to Mobile Payment Applications: An Empirical Study of WeChat Wallet.",
            "Research on Methodology of Correlation Analysis of Sci-Tech Literature Based on Deep Learning Technology in the Big Data.",
            "Detecting Users' Dietary Preferences and Their Evolutions via Chinese Social Media.",
            "RDF Keyword Search by Query Computation.",
            "Monitor and Detect Suspicious Transactions With Database Forensic Analysis.",
            "ICT R&D and Technology Knowledge Flows in Korea."
        ]
    },
    {
        "name": "JDM",
        "year": "2017",
        "info": "Volume 28, 2017",
        "count": 14,
        "papers": [
            "Thirty Years Later: Some Reflections on Ontological Analysis in Conceptual Modeling.",
            "Conceptual Modeling Meets Domain Ontology Development: A Reconciliation.",
            "A Framework for Managing Complexity in Information Systems.",
            "Improving the Domain Independence of Data Provenance Ontologies: A Demonstration Using Conceptual Graphs and the W7 Model.",
            "Evaluation of the Ontological Completeness and Clarity of Object-Oriented Conceptual Modelling Grammars.",
            "Effects of Domain Familiarity on Conceptual Modeling Performance.",
            "Combined Use of Conceptual Models in Practice: An Exploratory Study.",
            "The Effects of Construct Redundancy on Readers' Understanding of Conceptual Models.",
            "Reengineering Probabilistic Relational Databases with Fuzzy Probability Measures into XML Model.",
            "Mobile Collaboration Support for Virtual Teams: The Case of Virtual Information Systems Development Teams.",
            "Adapting Agile Practices for Data Warehousing, Business Intelligence, and Analytics.",
            "Incorporating Spatial Queries into Semantic Sensor Streams on the Internet of Things.",
            "Agility in Software Development and Project Value: An Empirical Investigation.",
            "Collaboration in Virtual Worlds: Impact of Task Complexity on Team Trust and Satisfaction."
        ]
    },
    {
        "name": "JDM",
        "year": "2016",
        "info": "Volume 27, 2016",
        "count": 12,
        "papers": [
            "Agility Facilitators for Contemporary Software Development.",
            "Dealing with Dangerous Data: Part-Whole Validation for Low Incident, High Risk Data.",
            "Cognitive Neuroscience in Information Systems Research.",
            "A Novel Approach to Managing the Dynamic Nature of Semantic Relatedness.",
            "Towards a Normal Form and a Query Language for Extended Relations Defined by Regular Expressions.",
            "Predicting Software Abnormal State by using Classification Algorithm.",
            "Path Expressions in SQL: A User Study on Query Formulation.",
            "Understanding Gender Differences in Media Perceptions of Hedonic Systems: A Comparison of 2D versus 3D Media.",
            "An Empirical Investigation of the Perceived Benefits of Agile Methodologies Using an Innovation-Theoretical model.",
            "Inherent Fusion: Towards Scalable Multi-Modal Similarity Search.",
            "Model Driven Engineering for Quality of Service Management: A Research Note on the Case of Real-Time Database Management Systems.",
            "Technology-Mediated Synchronous Virtual Education: An Empirical Study."
        ]
    },
    {
        "name": "JDM",
        "year": "2015",
        "info": "Volume 26, 2015",
        "count": 14,
        "papers": [
            "Benchmark for Approximate Query Answering Systems.",
            "Using Temporal Versioning and Integrity Constraints for Updating Geographic Databases and Maintaining Their Consistency.",
            "From Data Quality to Big Data Quality.",
            "Modeling and Implementing Scientific Hypothesis.",
            "A Novel Multidimensional Approach to Integrate Big Data in Business Intelligence.",
            "A Distributed System for The Management of Fine-grained Provenance.",
            "Discovering and Analysing Ontological Models From Big RDF Data.",
            "Parallel GPU-based Plane-Sweep Algorithm for Construction of iCPI-Trees.",
            "Considering User Intention in Differential Graph Queries.",
            "Temporal Data Management and Processing with Column Oriented NoSQL Databases.",
            "Scaling with Confidence: Entity Resolution under Weighted Constraints.",
            "Adoption and Use of Open Source Infrastructure Software by Large Corporations: The Case of MySQL.",
            "Parallel Skyline Computation Exploiting the Lattice Structure.",
            "An Emergent Model of End-users' Acceptance of Enterprise Resource Planning Systems: A Grounded Theory Approach."
        ]
    },
    {
        "name": "JDM",
        "year": "2014",
        "info": "Volume 25, 2014",
        "count": 12,
        "papers": [
            "Compression Schemes with Data Reordering for Ordered Data.",
            "Information Extraction from Microarray Data: A Survey of Data Mining Techniques.",
            "User Resistance to Software Migration: The Case on Linux.",
            "Enabling Resource Access Visibility for Automated Enterprise Services.",
            "Mindfully Experimenting with IT: Cases on Corporate Social Media Introduction.",
            "Evaluating Re-Identification Risks of Data Protected by Additive Data Perturbation.",
            "Novice Designer Performance Comparison Between the Entity Relationship Event Network and the Event-Based Logical Relational Design Techniques.",
            "Improving Business Intelligence Traceability and Accountability: An Integrated Framework of BI Product and Metacontent Map.",
            "Privacy-Preserving Outsourced Similarity Search.",
            "A Scalable Algorithm for One-to-One, Onto, and Partial Schema Matching with Uninterpreted Column Names and Column Values.",
            "Data Modeling: An Ontological Perspective of Pointers.",
            "SEDRIS Transmittal Storing and Retrieval System using Relational Databases."
        ]
    },
    {
        "name": "JDM",
        "year": "2012",
        "info": "Volume 23, 2012",
        "count": 15,
        "papers": [
            "Knowledge Representation: A Conceptual Modeling Approach.",
            "Situational Method Engineering to Support Process-Oriented Information Logistics: Identification of Development Situations.",
            "An Interpreter Approach for Exporting Relational Data into XML Documents with Structured Export Markup Language.",
            "A Unified Fuzzy Data Model: Representation and Processing.",
            "A Model of Error Propagation in Conjunctive Decisions and its Application to Database Quality Management.",
            "Managing Data Security in E-Markets through Relationship Driven Access Control.",
            "An Alternative Fit through Problem Representation in Cognitive Fit Theory.",
            "Compliance Assessments of Projects Adhering to Enterprise Architecture.",
            "Toward a Formal Semantics for Control-Flow Process Models.",
            "Analyzing the Cognitive Difficulties for Developing and Using UML Class Diagrams for Domain Understanding.",
            "Empirical Comparison of 3-D Virtual World and Face-to-Face Classroom for Higher Education.",
            "Research Note: Ontology-Based Structuring of Conceptual Data Modeling Patterns.",
            "A Conceptual Modeling Personalization Framework for OLAP.",
            "Effectively and Efficiently Designing and Querying Parallel Relational Data Warehouses on Heterogeneous Database Clusters: The F&A Approach.",
            "An Event-Oriented Data Modeling Technique Based on the Cognitive Semantics Theory."
        ]
    },
    {
        "name": "JDM",
        "year": "2011",
        "info": "Volume 22, 2011",
        "count": 16,
        "papers": [
            "A Link-Based Ranking Algorithm for Semantic Web Resources: A Class-Oriented Approach Independent of Link Direction.",
            "A Study of Open Source Software Development from Control Perspective.",
            "An MDA Approach and QVT Transformations for the Integrated Development of Goal-Oriented Data Warehouses and Data Marts.",
            "Understanding Business Domain Models: The Effect of Recognizing Resource-Event-Agent Conceptual Modeling Structures.",
            "A Survey of Approaches to Web Service Discovery in Service-Oriented Architectures.",
            "Multi-Level Modeling of Web Service Compositions with Transactional Properties.",
            "Service Composition and Interaction in a SOC Middleware Supporting Separation of Concerns with Flows and Views.",
            "Ensuring Customised Transactional Reliability of Composite Services.",
            "Leveraging Early Aspects in End-to-End Model Driven Development for Non-Functional Properties in Service Oriented Architecture.",
            "Complementing Business Process Verification by Validity Analysis: A Theoretical and Empirical Evaluation.",
            "Data Management and Data Administration: Assessing 25 Years of Practice.",
            "Research Review: A Systematic Literature Review on the Quality of UML Models.",
            "Semi-Automatic Composition of Situational Methods.",
            "DocBase: Design, Implementation and Evaluation of a Document Database for XML.",
            "A Meta-Analysis Comparing Relational and Semantic Models.",
            "Extending Agile Principles to Larger, Dynamic Software Projects: A Theoretical Assessment."
        ]
    },
    {
        "name": "JDM",
        "year": "2010",
        "info": "Volume 21, 2010",
        "count": 18,
        "papers": [
            "Using Ontology Languages for Conceptual Modeling.",
            "Modeling Design Patterns for Semi-Automatic Reuse in System Design.",
            "Energy and Latency Efficient Access of Wireless XML Stream.",
            "Toward a Unified Model of Information Systems Development Success.",
            "Representing Classes of Things and Properties in General in Conceptual Modelling: An Empirical Evaluation.",
            "Information Search Patterns in E-Commerce Product Comparison Services.",
            "Antecedents of the Closeness of Human-Avatar Relationships in a Virtual World.",
            "Antecedents of Online Game Dependency: The Implications of Multimedia Realism and Uses and Gratifications Theory.",
            "Assigning Ontological Meaning to Workflow Nets.",
            "Maintaining Mappings between Conceptual Models and Relational Schemas.",
            "Impact of Flow and Brand Equity in 3D Virtual Worlds.",
            "Cost and Service Capability Considerations on the Intention to Adopt Application Service Provision Services.",
            "Co-creation and Collaboration in a Virtual World: A 3D Visualization Design Project in Second Life.",
            "Transforming Activity-Centric Business Process Models into Information-Centric Models for SOA Solutions.",
            "An Integrated Query Relaxation Approach Adopting Data Abstraction and Fuzzy Relation.",
            "Accelerating Web Service Workflow Execution via Intelligent Allocation of Services to Servers.",
            "Matching Attributes across Overlapping Heterogeneous Data Sources Using Mutual Information.",
            "Disclosure Control of Confidential Data by Applying Pac Learning Theory."
        ]
    },
    {
        "name": "JDM",
        "year": "2009",
        "info": "Volume 20, 2009",
        "count": 14,
        "papers": [
            "Use Case Diagrams in Support of Use Case Modeling: Deriving Understanding from the Picture.",
            "Applying Learner-Centered Design Principles to UML Sequence Diagrams.",
            "Ontology Based Object-Oriented Domain Modeling: Representing Behavior.",
            "General Strategy for Querying Web Sources in a Data Federation Environment.",
            "The Quality of Online Privacy Policies: A Resource-Dependency Perspective.",
            "Reverse Engineering from an XML Document into an Extended DTD Graph.",
            "Efficient Filtering of Branch Queries for High-Performance XML Data Services.",
            "Towards Autonomic Workload Management in DBMSs.",
            "OOXKSearch: A Search Engine for Answering XML Keyword and Loosely Structured Queries Using OO Techniques.",
            "Towards Structured Flexibility in Information Systems Development: Devising a Method for Method Configuration.",
            "Cardinality-Aware Purely Relational XQuery Processor.",
            "A Cost-Based Range Estimation for Mapping Top-k Selection Queries over Relational Databases.",
            "Designing Document SQL (DSQL): An Accessible yet Comprehensive Ad-Hoc Querying Frontend for Query.",
            "A Dynamic Grid File for High-Dimensional Data Cube Storage and Range-Sum Querying."
        ]
    },
    {
        "name": "JDM",
        "year": "2008",
        "info": "Volume 19, 2008",
        "count": 19,
        "papers": [
            "Dimensions of UML Diagram Use: A Survey of Practitioners.",
            "Conflicts, Compromises and Political Decisions: Methodological Challenges of Enterprise-Wide E-Business Architecture.",
            "BROOD: Business Rules-driven Object Oriented Design.",
            "Enhancing UML Models: A Domain Analysis Approach.",
            "Bug Fixing Practices within Free/Libre Open Source Software Development Teams.",
            "Exploring the Effects of Process Characteristics on Products Quality in Open Source Software Development.",
            "The Impact of Ideology on the Organizational Adoption of Open Source Software.",
            "Adoption, Improvement, and Disruption: Predicting the Impact of Open Source Applications in Enterprise Software Markets.",
            "Delivering the 'Whole Product': Business Model Impacts and Agility Challenges in a Network of Open Source Firms.",
            "A Multiple-Bits Watermark for Relational Data.",
            "Using Iconic Graphics in Entity-Relationship Diagrams: The Impact on Understanding.",
            "Web Services, Service-Oriented Computing, and Service-Oriented Architecture: Separating Hype from Reality.",
            "Theories of Meaning in Schema Matching: A Review.",
            "An Open ECA Server for Active Applications.",
            "Evaluation of MDE Tools from a Metamodeling Perspective.",
            "Relaxing Queries with Hierarchical Quantified Data Abstraction.",
            "Reverse Engineering from an XML Document into an Extended DTD Graph.",
            "Ontology for Data Mining and its Application to Mining Incomplete Data.",
            "3-D Virtual Worlds in Education: Applications, Benefits, Issues, and Opportunities."
        ]
    },
    {
        "name": "JDM",
        "year": "2007",
        "info": "Volume 18, 2007",
        "count": 15,
        "papers": [
            "Semantics of the MibML Conceptual Modeling Grammar: An Ontological Analysis Using the Bunge-Wang-Weber Framework.",
            "A Measurement Ontology Generalizable for Emerging Domain Applications on the Semantic Web.",
            "Semantic Integration and Knowledge Discovery for Environmental Research.",
            "Optimization of Multidimensional Aggregates in Data Warehouses.",
            "Categorizing Post-Deployment IT Changes: An Empirical Investigation.",
            "Social Network Structures in Open Source Software Development Teams.",
            "A Knowledge Integration Approach for Organizational Decision Support.",
            "Temporal Aggregation Using a Multidimensional Index.",
            "View Materialization in a Data Cube: Optimization Models and Heuristics.",
            "A Space-Efficient Protocol for Consistency of External View Maintenance on Data Warehouse Systems: A Proxy Approach.",
            "Intelligent Search for Experts Using Fuzzy Abstraction Hierarchy in Knowledge Management Systems.",
            "Information Mediation Using Metamodels: An Approach Using XML and Common Warehouse Metamodel.",
            "Migrating Legacy Information Systems to Web Services Architecture.",
            "Empirical Assessment of Factors Influencing Success of Enterprise Resource Planning Implementations.",
            "Design of a Data Model for Social Network Applications."
        ]
    },
    {
        "name": "JDM",
        "year": "2006",
        "info": "Volume 17, 2006",
        "count": 20,
        "papers": [
            "The Critical Role of Information Processing in Creating an Effective Knowledge Organization.",
            "The Knowledge Transfer Process: From Field Studies to Technology Development.",
            "Knowledge Management Within Collaboration Processes: A Perspective Modeling and Analyzing Methodology.",
            "Semantic Enrichment in Knowledge Repositories: Anotating Semantic Relationships Between Discussion Documents.",
            "Ontology-Supported Web Service Composition: An Approach to Service-Oriented Knowledge Management in Corporate Services.",
            "Organizational Memory Management: Technological and Research Issues.",
            "Preparing Clinical Text for Use in Biomedical Research.",
            "Physical Modeling of Data Warehouses Using UML Component and Deployment Diagrams: Design and Implementation Issues.",
            "Node Partitioned Data Warehouses: Experimental Evidence and Improvements.",
            "Data Warehouse Design to Support Customer Relationship Management Analysis.",
            "Evaluating XML-Extened OLAP Queries Based on Physical Algebra.",
            "Designing Information Systems Capabilities to Create Business Value: A Theoretical Conceptualization of the Role of Flexibility and Integration.",
            "A Framework for Efficient Association Rule Mining in XML Data.",
            "Location-Aware Query Resolution for Location-Based Mobile Commerce: Performance Evaluation and Optimization.",
            "Enterprise Application System Reengineering: A Business Component Approach.",
            "Elitist and Ensemble Strategies for Cascade Generalization.",
            "Semantic Integrity Constraint Checking for Multiple XML Databases.",
            "A Scalable Middleware for Web Databases.",
            "Extending the OBJECTIVE Benchmark for Evaluation of Active Rules in a Distributed Component Integration Environment.",
            "UB2SQL: A Tool for Building Database Applications Using UML and B Formal Method."
        ]
    },
    {
        "name": "JDM",
        "year": "2005",
        "info": "Volume 16, 2005",
        "count": 21,
        "papers": [
            "On U.S. Homeland Security and Database Technology.",
            "Information Quality: Critical Ingredient for National Security.",
            "Semantic Association Identification and Knowledge Discovery for National Security Applications.",
            "Text Mining, Names and Security.",
            "A Database Interface for Link Analysis.",
            "Privacy-Preserving Data Mining: Development and Directions.",
            "Experimental Study of a Self-Tuning Algorithm for DBMS Buffer Pools.",
            "Evaluating the Dynamic Behavior of Database Applications.",
            "Intelligent Cache Management for Mobile Data Warehouse Systems.",
            "A Conceptual Design Methodology for Fuzzy Relational Databases.",
            "Conceptual Data Modeling Patterns: Representation and Validation.",
            "Enhancing Database Access Control by Facilitating Non-Key Related Cover Stories.",
            "Refinement Equivalence in Model-Based Reuse: Overcoming Differences in Abstraction Level.",
            "Theoretical vs. Practical Complexity: The Case of UML.",
            "An Investigation of the Impact of Organization Size on Data Quality Issues.",
            "BACIIS: Biological and Chemical Information Integration System.",
            "Creating a Dual-Agility Method: The Value of Method Engineering.",
            "On the Adaptation of an Agile Information Systems Development Method.",
            "Is Extreme Programming Just Old Wine in New Bottles: A Comparison of Two Cases.",
            "Assumptions Underlying Agile Software-Development Processes.",
            "Agile Modeling, Agile Software Development, and Extreme Programming: The State of Research."
        ]
    },
    {
        "name": "JDM",
        "year": "2004",
        "info": "Volume 15, 2004",
        "count": 24,
        "papers": [
            "Enterprise Resource Planning (ERP) Implementation Methodologies - Editorial Preface.",
            "A Systematic Approach to Flexible Specification, Composition, and Restructuring of Workflow Activities.",
            "Applying UML and XML for designing and interchanging information for data warehouses and OLAP applications.",
            "Informational and Computational Equivalence in Comparing Information Modeling Methods.",
            "Process-Embedded Data Integrity.",
            "Ontological Analysis, Evaluation and Engineering of Business Systems Analysis Methods - Editorial Preface.",
            "Reflection: Ontology in Information Systems - Foreword.",
            "ONTOMETRIC: A Method to Choose the Appropriate Ontology.",
            "An Ontology of Data Modeling Languages: A Study Using a Common-Sense Realistic Ontology.",
            "A Template for Defining Enterprise Modeling Constructs.",
            "An Evaluation of Inter-Organizational Workflow Modeling Formalisms.",
            "Applying Ontologies to Business and Systems Modeling Techniques and Perspectives: Lessons Learned.",
            "Relationship Construct in Modeling Information Systems: Identifying Relationship Based on Relation Element Theory - Editorial Preface.",
            "An Exploration of a Set of Entropy-Based Hybrid Splitting Methods for Decision Tree Induction.",
            "XTOPO: An XML-Based Topology for Information Highway on the Internet.",
            "Scalable QSF-Trees: Retrieving Regional Objects in High-Dimensional Spaces.",
            "An Efficient Concurrency Control Algorithm for High-Dimensional Index Structures.",
            "Data Warehouse Interoperability for the Extended Enterprise.",
            "Editorial Preface.",
            "Application of Mobile Agents in Mobile Data Access Systems: A Prototype.",
            "Mobile Agent Based Self-Adaptive Join for Wide-Area Distributed Query Processing.",
            "Ex Ante Evaluations of Alternate Data Structures for End User Queries: Theory and Experimental Test.",
            "Semantic Heterogeneity in Multidatabase Systems: A Review and a Proposed Meta-Data Structure.",
            "Clustering Schema Elements for Semantic Integration of Heterogeneous Data Sources."
        ]
    },
    {
        "name": "JDM",
        "year": "2003",
        "info": "Volume 14, 2003",
        "count": 16,
        "papers": [
            "Methodology Evaluation Framework for Component-Based System Development.",
            "Federated Process Framework in a Virtual Enterprise Using an Object-oriented Database and Extensible Markup Language.",
            "A New Approach To Secure Federated Information Bases Using Agent Technology.",
            "A Possibility Theory Framework for Security Evaluation in National Infrastructure Protection.",
            "Protecting Data through Perturbation Techniques: The Impact on Knowledge Discovery in Databases.",
            "Transaction-Relationship Oriented Log Division for Data Recovery from Information Attacks.",
            "Integrating Digital Signatures with Relational Databases: Issues and Organizational Implications.",
            "The Contribution of IT Governance Solutions to the Implementation of Data Warehouse Practice.",
            "Conceptual Modeling and Ontology: Possibilities and Pitfalls.",
            "Modeling Temporal Dynamics for Business Systems.",
            "Transformation Between UML Diagrams.",
            "RORIB: An Economic and Efficient Solution for Real-Time Online Remote Info Backup.",
            "Data Protection Using Watermarking in E-Business.",
            "Managing Data Quality in Dynamic Decision Environments: An Information Product Approach.",
            "XML Integration and Toolkit for B2B Applications.",
            "IAIS: A Methodology to Enable Inter-Agency Information Sharing In eGovernment."
        ]
    },
    {
        "name": "JDM",
        "year": "2002",
        "info": "Volume 13, 2002",
        "count": 16,
        "papers": [
            "Common Sense Reasoning in Automated Database Design: An Empirical Test.",
            "The Soprano Extensible Object Storage System.",
            "Benchmarking Data Mining Algorithms.",
            "Issues in Mobile Electronic Commerce.",
            "Human Factors Research on Data Modeling: A Review of Prior Research, An Extended Framework and Future Research Directions.",
            "Metaschemas for ER, ORM and UML Data Models: A Comparison.",
            "Regression Testing of Database Applications.",
            "The Use of Subtypes and Stereotypes in the UML Model.",
            "On Conceptual Micro-Object Modeling.",
            "Using Harel's Statecharts to Model Business Workflows.",
            "Normalization of Relations with Nulls in Candidate Keys.",
            "Representation and Storage of Motion Data.",
            "A Rigorous Approach for Mapping Workflows to Object-Oriented IS Models.",
            "Dynamic Semantics of UML State Machines: A Metamodeling Perspective.",
            "Online Analytical Mining of Path Traversal Patterns for Web Measurement.",
            "Database Technology for Global Support of a Medical Registry: An Implementation Case."
        ]
    },
    {
        "name": "JDM",
        "year": "2001",
        "info": "Volume 12, 2001",
        "count": 15,
        "papers": [
            "Object-Process Methodology Applied to Modeling Credit Card Transactions.",
            "FOOM: Functional and Object-Oriented Analysis and Design of Information Systems: An Integrated Methodology.",
            "Unified Modeling Language: A Complexity Analysis.",
            "Using Weakly Structured Documents to Fill in a Classical Database.",
            "Providing Approximate Answers Using a Knowledge Abstraction Database.",
            "Hypermedia Document Management: A Metadata and Meta-Information System.",
            "Mobile Computing at the Department of Defense.",
            "Mobile Commerce: Promises, Challenges and Research Agenda.",
            "A Prediction-Based Query Processing Strategy in Mobile Commerce Systems.",
            "Mobile Commerce Agents in WAP-Based Services.",
            "A Framework for Analyzing Mobile Transaction Models.",
            "An Adaptive Probe-Based Technique to Optimize Join Queries in Distributed Internet Databases.",
            "A Metadata Oriented Architecture for Building Datawarehouse.",
            "The Development of Ordered SQL Packages to Support Data Warehousing.",
            "Issues in Transaction-Time Temporal Object Database Systems."
        ]
    },
    {
        "name": "JDM",
        "year": "2000",
        "info": "Volume 11, 2000",
        "count": 12,
        "papers": [
            "Distributed Database Design for Mobile Geographical Applications.",
            "An Enterprise Model Repository: Architecture and System.",
            "Rich Base Schema: A Unified Framework for OODB Schema Version Management.",
            "Database Cooperation: Classification and Middleware Tools.",
            "Binary Equivalents of Ternary Relationships in Entity-Relationship Modeling: A Logical Decomposition Approach.",
            "Simplifying the Formulation of a Wide Range of Object-Oriented Complex Queries.",
            "Using Business Rules within a Design Process of Active Databases.",
            "Benchmarking OODBs with a Generic Tool.",
            "Performance Evaluation of Parallel S-Trees.",
            "Formal Approaches to Systems Analysis Using UML: An Overview.",
            "Extended Spatiotemporal UML: Motivations, Requirements and Constructs.",
            "Understanding the Role of Use Cases in UML: A Review and Research Agenda."
        ]
    },
    {
        "name": "JDM",
        "year": "1999",
        "info": "Volume 10, 1999",
        "count": 20,
        "papers": [
            "Methodology of Schema Integration for New Database Applications: A Practitioner's Approach.",
            "Processing III-Defined Spatial Operators in Geographic Databases: A Common Sense Approach.",
            "Solving the Partitioning Problem in Database Design.",
            "Data Mining: New Arsenal for Strategic Decision Making.",
            "Information Management and Lean Manufacturing.",
            "LEO: The Incredible Story of the World's First Business Computer.",
            "A View-Based Hypermedia Design Methodology.",
            "An Empirical Analysis of the Object-Oriented Database Concurrency Control Mechanism O2C2.",
            "Relational Data Modeling for Geographic Information Systems.",
            "Database Programming with DBC and JAVA.",
            "An Asynchronous Differential Join in Distributed Data Replications.",
            "Knowledge and Object-Oriented Approach for Interoperability of Heterogeneous Information Management Systems.",
            "Knowledge-Based Systems as Database Design Tools: A Comparative Study.",
            "Current Trends in Data Management Technology.",
            "Data Modeling in UML and ORM: A Comparison.",
            "Enhancing the ER Model with Integrity Methods Information Management Systems.",
            "A Case Study Evaluation of the Use of the Viable System Model in Information Systems Development.",
            "CMU-WEB: A Conceptual Model for Designing Usable Web Applications.",
            "Information Modeling and Method Engineering: A Psychological Perspective.",
            "The Unified Modeling Language User Guide."
        ]
    },
    {
        "name": "JDM",
        "year": "1998",
        "info": "Volume 9, 1998",
        "count": 25,
        "papers": [
            "View Maintenance for Materialized Transitive-Closure Relations.",
            "Temporal Interoperability in Multi+ Temporal Databases.",
            "A Graphical Interface to Genome Multidatabases.",
            "What's New? The Challenges of Ermerging Information Technologies.",
            "A Practical Perspective on Data Quality Issues.",
            "The American Society for Engineering Education's Use of Web-based Technology to Promote Excellence in Engineering Education.",
            "Database: Models, Languages, Design.",
            "Desirable Characteristics of Information Resource Dictionary Systems.",
            "Natural Language-Enabled Data Modeling: Improving Validation and Integration.",
            "A Comparative Study of Conceptual Data Modeling Techniques.",
            "Initiating Change in Documentation Practices.",
            "Is the Webmaster Position Becoming Obsolete?",
            "Guide to Client/Server and Intranet Development.",
            "Discovering Objects: Which Identification and Refinement Strategies Do Analysts Really Use?",
            "Fault-Tolerant Quorum Consensus Scheme for Replication Control in Mobile Distributed Database Systems.",
            "Database Interfaces: A Conceptual Framework and a Meta-Analysis on Natural Language Studies.",
            "The Dissemination of Good Practices in Database Development Work.",
            "Database and the Web.",
            "A Personal Perspective on the Use of Computing Technology.",
            "The Essence of Databases.",
            "A Methodology of Constructing Canonical Form Database Schemas in a Multiple Heterogeneous Database Environment.",
            "Integrated Functional and Executional Modeling of Software Using Web-Based Databases.",
            "Conditional Conflict Serializability: An Application Oriented Correctness Criterion.",
            "Electronic Commerce.",
            "Fuzzy Database Modeling."
        ]
    }
]