[
    {
        "name": "JIIS",
        "year": "2022",
        "info": "2022: Volumes\n58,",
        "count": 9,
        "papers": [
            "Exploiting stance hierarchies for cost-sensitive stance detection of Web documents.",
            "Coarse-grained decomposition and fine-grained interaction for multi-hop question answering.",
            "Knowledge graph summarization impacts on movie recommendations.",
            "User profiling and satisfaction inference in public information access services.",
            "An overview of machine learning techniques in constraint solving.",
            "Analysis of information cascading and propagation barriers across distinctive news events.",
            "Cross-lingual transfer of abstractive summarizer to less-resource language.",
            "IbLT: An effective granular computing framework for hierarchical community detection.",
            "Upper bounds for can-tree and FP-tree."
        ]
    },
    {
        "name": "JIIS",
        "year": "2021",
        "info": "2021: Volumes\n56,\n57",
        "count": 52,
        "papers": [
            "Sentiment word co-occurrence and knowledge pair feature extraction based LDA short text clustering algorithm.",
            "Multimodal depression detection on instagram considering time interval of posts.",
            "Distributed matrix factorization based on fast optimization for implicit feedback recommendation.",
            "Trajectory clustering method based on spatial-temporal properties for mobile social networks.",
            "On data lake architectures and metadata management.",
            "Efficient segmentation-based methods for anomaly detection in static and streaming time series under dynamic time warping.",
            "CGSPN : cascading gated self-attention and phrase-attention network for sentence modeling.",
            "TSCMF: Temporal and social collective matrix factorization model for recommender systems.",
            "Using reinforcement learning with external rewards for open-domain natural language generation.",
            "A framework for evaluating ontology meta-matching approaches.",
            "Case studies on using natural language processing techniques in customer relationship management software.",
            "A machine learning approach for performance-oriented decision support in service-oriented architectures.",
            "A novel scheme for employee churn problem using multi-attribute decision making approach and machine learning.",
            "Representing unstructured text semantics for reasoning purpose.",
            "Parsing argued opinion structure in Twitter content.",
            "Modeling information diffusion in online social networks using a modified forest-fire model.",
            "Empirical study of sentiment analysis tools and techniques on societal topics.",
            "On exploring feature representation learning of items to forecast their rise and fall in social media.",
            "Topic modeling for sequential documents based on hybrid inter-document topic dependency.",
            "SDDM: an interpretable statistical concept drift detection method for data streams.",
            "Genre based hybrid filtering for movie recommendation engine.",
            "Forecasting emergency department admissions.",
            "LDA-based term profiles for expert finding in a political setting.",
            "A model for automated technological surveillance of web portals and social networks.",
            "Using an auxiliary dataset to improve emotion estimation in users' opinions.",
            "Uncertain distance-based outlier detection with arbitrarily shaped data objects.",
            "A survey on data fusion: what for? in what form? what is next?",
            "Community detection in complex networks using network embedding and gravitational search algorithm.",
            "A survey of Big Data dimensions vs Social Networks analysis.",
            "An enhanced opinion retrieval approach via implicit feature identification.",
            "Financial markets sentiment analysis: developing a specialized Lexicon.",
            "CAESAR: context-aware explanation based on supervised attention for service recommendations.",
            "Recommender systems in the healthcare domain: state-of-the-art and research issues.",
            "Compact representations for efficient storage of semantic sensor data.",
            "Addressing the complexity of personalized, context-aware and health-aware food recommendations: an ensemble topic modelling based approach.",
            "Selecting the most helpful answers in online health question answering communities.",
            "A novel deep recommend model based on rating matrix and item attributes.",
            "Smart integration of sensors, computer vision and knowledge representation for intelligent monitoring and verbal human-computer interaction.",
            "UTLDR: an agent-based framework for modeling infectious diseases and public interventions.",
            "Mining emotion-aware sequential rules at user-level from micro-blogs.",
            "Depression detection from sMRI and rs-fMRI images using machine learning.",
            "SI: methodologies for intelligent systems.",
            "Leveraging colour-based pseudo-labels to supervise saliency detection in hyperspectral image datasets.",
            "Interpretable segmentation of medical free-text records based on word embeddings.",
            "Towards psychology-aware preference construction in recommender systems: Overview and research issues.",
            "Explanations for over-constrained problems using QuickXPlain with speculative executions.",
            "Issues in clustering algorithm consistency in fixed dimensional spaces. Some solutions for k-means.",
            "Music emotion recognition using recurrent neural networks and pretrained models.",
            "Performing arithmetic using a neural network trained on images of digit permutation pairs.",
            "Making design decisions under uncertainties: probabilistic reasoning and robust product design.",
            "How to raise artwork prices using action rules, personalization and artwork visual features.",
            "Leveraging contextual embeddings and self-attention neural networks with bi-attention for sentiment analysis."
        ]
    },
    {
        "name": "JIIS",
        "year": "2020",
        "info": "2020: Volumes\n54,\n55",
        "count": 54,
        "papers": [
            "Data-driven user behavioral modeling: from real-world behavior to knowledge, algorithms, and systems.",
            "Online social network analysis: detection of communities of interest.",
            "Data-driven decision making in critique-based recommenders: from a critique to social media data.",
            "Exploiting recommendation confidence in decision-aware recommender systems.",
            "Engagement in proactive recommendations.",
            "Predicting future personal life events on twitter via recurrent neural networks.",
            "Topic and sentiment aware microblog summarization for twitter.",
            "From mobility patterns to behavioural change: leveraging travel behaviour and personality profiles to nudge for sustainable transportation.",
            "A knowledge-based multi-criteria collaborative filtering approach for discovering services in mobile cloud computing platforms.",
            "Privacy-preserving shared collaborative web services QoS prediction.",
            "A deep architecture for depression detection using posting, behavior, and living environment data.",
            "Wikipedia enriched advertisement recommendation for microblogs by using sentiment enhanced user profiles.",
            "A survey on group recommender systems.",
            "Evaluating content novelty in recommender systems.",
            "Action extraction from social networks.",
            "Effective defense against fingerprinting attack based on autocorrelation property minimization approach.",
            "Next-generation heartbeat classification with a column-store DBMS and UDFs.",
            "Automatic keyphrase extraction: a survey and trends.",
            "Causal inference for social discrimination reasoning.",
            "Holistic primary key and foreign key detection.",
            "IncompFuse: a logical framework for historical information fusion with inaccurate data sources.",
            "Detection of road pavement quality using statistical clustering methods.",
            "A scaled-MST-based clustering algorithm and application on image segmentation.",
            "A novel multi-strategy DE algorithm for parameter optimization in support vector machine.",
            "Unsupervised tag recommendation for popular and cold products.",
            "Study of parallel processing area extraction and data transfer number reduction for automatic GPU offloading of IoT applications.",
            "WebKey: a graph-based method for event detection in web news.",
            "A utility based approach for data stream anonymization.",
            "Social recommender systems: techniques, domains, metrics, datasets and future scope.",
            "Clustering-Aided Multi-View Classification: A Case Study on Android Malware Detection.",
            "Topic-sentiment evolution over time: a manifold learning-based model for online news.",
            "Sentiment analysis using rule-based and case-based reasoning.",
            "Modeling cyber-physical systems - a GliderAgent 3.0 perspective.",
            "A multi-aspect approach to ontology matching based on Bayesian cluster ensembles.",
            "PARASOL: a hybrid approximation approach for scalable frequent itemset mining in streaming data.",
            "An updated dashboard of complete search FSM implementations in centralized graph transaction databases.",
            "Incorporating communities' structures in predictions of missing links.",
            "An implicit aspect modelling framework for diversity focused query expansion.",
            "A survey on question answering systems over linked data and documents.",
            "LTR-expand: query expansion model based on learning to rank association rules.",
            "Content-Based Document Image Retrieval Based on Document Modeling.",
            "Question retrieval using combined queries in community question answering.",
            "ETM: Enrichment by topic modeling for automated clinical sentence classification to detect patients' disease history.",
            "Healthcare predictive analytics for disease progression: a longitudinal data fusion approach.",
            "Finding discriminatory features from electronic health records for depression prediction.",
            "The contribution of linked open data to augment a traditional data warehouse.",
            "A survey on intention analysis: successful approaches and open challenges.",
            "Improve the translational distance models for knowledge graph embedding.",
            "Machine learning for music genre: multifaceted review and experimentation with audioset.",
            "Automated conversion from natural language query to SPARQL query.",
            "System for monitoring road slippery based on CCTV cameras and convolutional neural networks.",
            "Analysis of street crime predictors in web open data.",
            "Compacting frequent star patterns in RDF graphs.",
            "A minimum spanning tree based partitioning and merging technique for clustering heterogeneous data sets."
        ]
    },
    {
        "name": "JIIS",
        "year": "2019",
        "info": "2019: Volumes\n52,\n53",
        "count": 50,
        "papers": [
            "Validating data acquired with experimental multimodal biometric system installed in bank branches.",
            "An enhancement on Clinical Data Analytics Language (CliniDAL) by integration of free text concept search.",
            "Word sense disambiguation application in sentiment analysis of news headlines: an applied approach to FOREX market prediction.",
            "Granular methods in automatic music genre classification: a case study.",
            "Discovering more precise process models from event logs by filtering out chaotic activities.",
            "Improving large-scale hierarchical classification by rewiring: a data-driven filter based approach.",
            "Lightweight domain modeling for adaptive web-based educational system.",
            "Deep recurrent convolutional networks for inferring user interests from social media.",
            "Cooperative treatment of failing queries over uncertain databases: a matrix-computation-based approach.",
            "ISoTrustSeq: a social recommender system based on implicit interest, trust and sequential behaviors of users using matrix factorization.",
            "Design of a clinician dashboard to facilitate co-decision making in the management of non-specific low back pain.",
            "An overview of recommender systems in the internet of things.",
            "SemiLD: mediator-based framework for keyword search over semi-structured and linked data.",
            "Reliable TF-based recommender system for capturing complex correlations among contexts.",
            "Experimental validation for N-ary error correcting output codes for ensemble learning of deep neural networks.",
            "Inferring preferences in ontology-based recommender systems using WOWA.",
            "Trust inference using implicit influence and projected user network for item recommendation.",
            "Incremental entity resolution process over query results for data integration systems.",
            "Computational modelling and data-driven techniques for systems analysis.",
            "Improving process algebra model structure and parameters in infectious disease epidemiology through data mining.",
            "Model mining - Integrating data analytics, modelling and verification.",
            "Objective/MC: A high-level model checking language - Formalization of the imperative core and translation into PRISM.",
            "Measuring network reliability and repairability against cascading failures.",
            "Design of a software architecture supporting business-to-government information sharing to improve public safety and security - Combining business rules, Events and blockchain technology.",
            "One-pass MapReduce-based clustering method for mixed large scale data.",
            "Persistent entropy for separating topological features from noise in vietoris-rips complexes.",
            "Real-time recommendation with locality sensitive hashing.",
            "Efficient question classification and retrieval using category information and word embedding on cQA services.",
            "Context-aware user preferences prediction on location-based social networks.",
            "Clustering of semantically enriched short texts.",
            "Activity prediction in process mining using the WoMan framework.",
            "Collaborative filtering recommendation based on trust and emotion.",
            "EVE: explainable vector based embedding technique using Wikipedia.",
            "AWML: adaptive weighted margin learning for knowledge graph embedding.",
            "Ensembles of density estimators for positive-unlabeled learning.",
            "Density-based unsupervised ensemble learning methods for time series forecasting of aggregated or clustered electricity consumption.",
            "Effect of speech segment samples selection in stutter block detection and remediation.",
            "CBSSD: community-based semantic subgroup discovery.",
            "Rank correlated subgroup discovery.",
            "StreamPref: a query language for temporal conditional preferences on data streams.",
            "Semantic similarity aggregators for very short textual expressions: a case study on landmarks and points of interest.",
            "Database of speech and facial expressions recorded with optimized face motion capture settings.",
            "JIIS special issue preface.",
            "A grammar inference approach for language self-adaptation and evolution in digital ecosystems.",
            "A framework for aspect based sentiment analysis on turkish informal texts.",
            "Crowd Sourced Semantic Enrichment (CroSSE) for knowledge driven querying of digital resources.",
            "Hollow-tree: a metric access method for data with missing values.",
            "Skyline-based dissimilarity of images.",
            "Safe disassociation of set-valued datasets.",
            "Business information architecture for successful project implementation based on sentiment analysis in the tourist sector."
        ]
    },
    {
        "name": "JIIS",
        "year": "2018",
        "info": "2018: Volumes\n50,\n51",
        "count": 51,
        "papers": [
            "A multi-strategy approach to structural analogy making.",
            "HINMINE: heterogeneous information network mining with information retrieval heuristics.",
            "Redescription mining augmented with random forest of multi-target predictive clustering trees.",
            "Multi-class and feature selection extensions of Roughly Balanced Bagging for imbalanced data.",
            "Discrete representation strategies for foreign exchange prediction.",
            "Towards mining the organizational structure of a dynamic event scenario.",
            "Online and offline classification of traces of event logs on the basis of security risks.",
            "State-of-art approaches for review spammer detection: a survey.",
            "Spectral features for audio based vehicle and engine classification.",
            "Dynamic adaptation of online ensembles for drifting data streams.",
            "Tree-based methods for online multi-target regression.",
            "Case-based decision model matches ideal point model: - Application to marketing decision support system.",
            "Automatic music genre classification based on musical instrument track separation.",
            "A new approximate query engine based on intelligent capture and fast transformations of granulated data summaries.",
            "On the design of hardware-software architectures for frequent itemsets mining on data streams.",
            "A Lesson learned from PMF based approach for Semantic Recommender System.",
            "Query expansion using pseudo relevance feedback on wikipedia.",
            "Tag recommendation method in folksonomy based on user tagging status.",
            "An overview of recommender systems in the healthy food domain.",
            "A new slope one based recommendation algorithm using virtual predictive items.",
            "An automatic classification of text documents based on correlative association of words.",
            "A proposal of a temporal semantics aware linked data information retrieval framework.",
            "Profile based recommendation of code reviewers.",
            "Evaluation of local community metrics: from an experimental perspective.",
            "A hybrid approach for measuring semantic similarity based on IC-weighted path distance in WordNet.",
            "Toward analyzing impact of disjoint axioms for merging heterogeneous ontologies.",
            "Segregation discovery in a social network of companies.",
            "Predicting the popularity of topics based on user sentiment in microblogging websites.",
            "Topic detection and tracking on heterogeneous information.",
            "A survey of book recommender systems.",
            "Anytime diagnosis for reconfiguration.",
            "Recommendation using a clustering algorithm based on a hybrid features selection method.",
            "Robust learning in expert networks: a comparative analysis.",
            "Accurate and efficient detection of critical links in network to minimize information loss.",
            "Discovering anomalous frequent patterns from partially ordered event logs.",
            "Analysis of medications change in Parkinson's disease progression data.",
            "Correction to: Analysis of medications change in Parkinson's disease progression data.",
            "Network representation with clustering tree features.",
            "REMI: A framework of reusable elements for mining heterogeneous data with missing information - A Tale of Congestion in Two Smart Cities.",
            "Unified domain-specific language for collecting and processing data of social media.",
            "Musical performance analysis in terms of emotions it evokes.",
            "Weighted fast sequential DTW for multilingual audio Query-by-Example retrieval.",
            "Environmental sound recognition using short-time feature aggregation.",
            "WoLMIS: a labor market intelligence system for classifying web job vacancies.",
            "Discovering spammer communities in twitter.",
            "HIFUN - a high level functional query language for big data analytics.",
            "A tourism destination recommender system using users' sentiment and temporal dynamics.",
            "Multimodal mood classification of Hindi and Western songs.",
            "Predicting IR personalization performance using pre-retrieval query predictors.",
            "Recognition of web users with the aid of biometric user model.",
            "Extending expressivity and flexibility of abductive logic programming."
        ]
    },
    {
        "name": "JIIS",
        "year": "2017",
        "info": "2017: Volumes\n48,\n49",
        "count": 48,
        "papers": [
            "Classifying and querying very large taxonomies with bit-vector encoding.",
            "A data-driven passing interaction model for embodied basketball agents.",
            "Two-tier network anomaly detection model: a machine learning approach.",
            "Skeleton clustering by multi-robot monitoring for fall risk discovery.",
            "A just-in-time keyword extraction from meeting transcripts using temporal and participant information.",
            "Intelligent information processing for building university knowledge base.",
            "TasteMiner: Mining partial tastes for neighbor-based collaborative filtering.",
            "MTara A. Smyser ultilingual news extraction via stopword language model scoring.",
            "Efficient pruning for top-K ranking queries on attribute-wise uncertain datasets.",
            "Cost effective storage space for data cubes.",
            "An approximate representation of hypercliques.",
            "Identifying urban crowds using geo-located Social media data: a Twitter experiment in New York City.",
            "Path-based methods on categorical structures for conceptual representation of wikipedia articles.",
            "Faceted exploration of RDF/S datasets: a survey.",
            "Identifying representative users in matrix factorization-based recommender systems: application to solving the content-less new item cold-start problem.",
            "Processing skyline queries in incomplete distributed databases.",
            "Active rule base development for dynamic vertical partitioning of multimedia databases.",
            "Product ranking using hierarchical aspect structures.",
            "Erratum to: The use of data-derived label hierarchies in multi-label classification.",
            "A statistical approach for modeling inter-document semantic relationships in digital libraries.",
            "Detecting abnormal profiles in collaborative filtering recommender systems.",
            "ScLink: supervised instance matching system for heterogeneous repositories.",
            "Scalable validation of industrial equipment using a functional DSMS.",
            "Genre classification of symbolic pieces of music.",
            "Diversity of editors and teams versus quality of cooperative work: experiments on wikipedia.",
            "Labeling data and developing supervised framework for hindi music mood analysis.",
            "An efficient and large-scale reasoning method for the semantic Web.",
            "Sentence similarity based on semantic kernels for intelligent text retrieval.",
            "An introduction to personalization and mass customization.",
            "Supporting the social dimension of shopping for personalized products through online sales configurators.",
            "Human computation for constraint-based recommenders.",
            "Managing variants of a personalized product - Practical compression and fast evaluation of variant tables.",
            "Constraint-based and SAT-based diagnosis of automotive configuration problems.",
            "Building renovation adopts mass customization - Configuring insulating envelopes.",
            "Temporal Query Processing in Social Network.",
            "An audio-visual corpus for multimodal automatic speech recognition.",
            "A video summarization approach based on the emulation of bottom-up mechanisms of visual attention.",
            "Distrust seed set propagation algorithm to detect web spam.",
            "Location detection and disambiguation from twitter messages.",
            "A survey on expert finding techniques.",
            "Towards portable natural language interfaces based on case-based reasoning.",
            "DomESA: a novel approach for extending domain-oriented lexical relatedness calculations with domain-specific semantics.",
            "QBEES: query-by-example entity search in semantic knowledge graphs based on maximal aspects, diversity-awareness and relaxation.",
            "VR-Tree: A novel tree-based approach for modeling Web Query Interfaces.",
            "Design and implementation of a web-based medical drawing management system.",
            "Materialized view selection using evolutionary algorithm for speeding up big data query processing.",
            "An expressive event-based language for representing user behavior patterns.",
            "Semi-supervised classification trees."
        ]
    },
    {
        "name": "JIIS",
        "year": "2016",
        "info": "2016: Volumes\n46, 47",
        "count": 52,
        "papers": [
            "A sentence structure-based approach to unsupervised author identification.",
            "An approach to structure determination and estimation of hierarchical Archimedean Copulas and its application to Bayesian classification.",
            "A framework for enriching Data Warehouse analysis with Question Answering systems.",
            "Labelset topic model for multi-label document classification.",
            "Policy-based memoization for ILP-based concept discovery systems.",
            "A multimodal approach for extracting content descriptive metadata from lecture videos.",
            "Proximity-based federation of smart objects - Its graph-rewriting framework and correctness.",
            "A grid density based framework for classifying streaming data in the presence of concept drift.",
            "An efficient and flexible scanning of databases of protein secondary structures - with the segment index and multithreaded alignment.",
            "Guest editors' introduction: special issue on case-based reasoning.",
            "Enhancing case-based regression with automatically-generated ensembles of adaptations.",
            "Case-base maintenance with multi-objective evolutionary algorithms.",
            "Combining similarity and sentiment in opinion mining for product recommendation.",
            "A hierarchical multi-criteria sorting approach for recommender systems.",
            "Erratum to: A hierarchical multi-criteria sorting approach for recommender systems.",
            "Robust recommendation method based on suspicious users measurement and multidimensional trust.",
            "SAUText - a system for analysis of unstructured textual data.",
            "Machine learning for intrusion detection in MANET: a state-of-the-art survey.",
            "A systematic approach to reliability assessment in integrated databases.",
            "Automatic musical instrument classification using fractional fourier transform based- MFCC features and counter propagation neural network.",
            "Collective regression for handling autocorrelation of network data in a transductive setting.",
            "Fast and scalable vector similarity joins with MapReduce.",
            "Towards context-aware media recommendation based on social tagging.",
            "Local optimal scale in a hierarchical segmentation method for satellite images - An OBIA approach for the agricultural landscape.",
            "Click efficiency: a unified optimal ranking for online Ads and documents.",
            "Types of minority class examples and their influence on learning classifiers from imbalanced data.",
            "Hybrid sentiment analysis framework for a morphologically rich language.",
            "Recent advances in mining patterns from complex data.",
            "Behavioral process mining for unstructured processes.",
            "Predicate invention-based specialization in Inductive Logic Programming.",
            "The use of data-derived label hierarchies in multi-label classification.",
            "Efficient energy-based embedding models for link prediction in knowledge graphs.",
            "A semantic approach to remove incoherent items from a user profile and improve the accuracy of a recommender system.",
            "Evidential data mining: precise support and confidence.",
            "Improving the prediction of page access by using semantically enhanced clustering.",
            "Guest editor's introduction: special issue on analyzing and mining social networks for decision support and recommender systems.",
            "Impersonate human decision making process: an interactive context-aware recommender system.",
            "Social group recommendation in the tourism domain.",
            "Recommendation using DMF-based fine tuning method.",
            "RedTweet: recommendation engine for reddit.",
            "Artificial immune network with feature selection for bank term deposit recommendation.",
            "Creating corroborated crisis reports from social media data through formal concept analysis.",
            "Inferring social network user profiles using a partial social graph.",
            "A 1NF temporal relational model and algebra coping with valid-time temporal indeterminacy.",
            "Characterization and search of web services through intensional knowledge.",
            "A formalized framework for incorporating expert labels in crowdsourcing environment.",
            "Permutation anonymization.",
            "Measuring similarity of individuals in description logics over the refinement space of conjunctive queries.",
            "Modelling expertise at different levels of granularity using semantic similarity measures in the context of collaborative knowledge-curation platforms.",
            "A novel method for dictionary translation.",
            "A comparison of two MLEM2 rule induction algorithms extended to probabilistic approximations.",
            "Multimedia polysensory integration training system dedicated to children with educational difficulties."
        ]
    },
    {
        "name": "JIIS",
        "year": "2015",
        "info": "2015: Volumes\n44, 45",
        "count": 38,
        "papers": [
            "Algorithms and criteria for diversification of news article comments.",
            "Classifying actions based on histogram of oriented velocity vectors.",
            "Answering keyword queries through cached subqueries in best match retrieval models.",
            "A distributed decision support algorithm that preserves personal privacy.",
            "An efficient content based video copy detection using the sample based hierarchical adaptive k-means clustering.",
            "An insight into the experimental design for credit risk and corporate bankruptcy prediction systems.",
            "Guest editor's introduction: special issue on discovery science 2012.",
            "Soft constraints for pattern mining.",
            "Fast progressive training of mixture models for model selection.",
            "Change point detection for burst analysis from an observed information diffusion sequence of tweets.",
            "Efficient redundancy reduced subgroup discovery via quadratic programming.",
            "A scalable approach to spectral clustering with SDD solvers.",
            "Effectively and efficiently supporting roll-up and drill-down OLAP operations over continuous dimensions via hierarchical clustering.",
            "A hybrid approach of topic model and matrix factorization based on two-step recommendation framework.",
            "Advanced management of data integrity: property-based testing for business rules.",
            "Interactive search over Web scale RDF data using predicates as constraints.",
            "A novel hybrid approach improving effectiveness of recommender systems.",
            "Semantic grounding of social annotations for enhancing resource classification in folksonomies.",
            "Design, implementation and validation of AI-inspired information systems.",
            "Consistent structuring of inconsistent knowledge.",
            "Design of distributed database systems: an iterative genetic algorithm.",
            "Query-driven approach of contextual ontology module learning using web snippets.",
            "KIPTC: a kernel information propagation tag clustering algorithm.",
            "Semi-supervised hybrid clustering by integrating Gaussian mixture model and distance metric learning.",
            "An end to end framework for building data cubes over trajectory data streams.",
            "Processing continuous K-nearest skyline query with uncertainty in spatio-temporal databases.",
            "Classification and clustering with continuous time Bayesian network models.",
            "The rating prediction task in a group recommender system that automatically detects groups: architectures, algorithms, and performance evaluation.",
            "The importance of the label hierarchy in hierarchical multi-label classification.",
            "Hybrid data labeling algorithm for clustering large mixed type data.",
            "Guest editor's introduction: special issue on quality issues, measures of interestingness and evaluation of data mining models.",
            "Objectively evaluating condensed representations and interestingness measures for frequent itemset mining.",
            "Subspace clustering of data streams: new algorithms and effective evaluation measures.",
            "Cost-based quality measures in subgroup discovery.",
            "Efficient discovery of correlated patterns using multiple minimum all-confidence thresholds.",
            "Optimizing text classification through efficient feature selection based on quality metric.",
            "Evaluation of an associative classifier based on position-constrained frequent/closed subtree mining.",
            "Mining coverage patterns from transactional databases."
        ]
    },
    {
        "name": "JIIS",
        "year": "2014",
        "info": "2014: Volumes\n42, 43",
        "count": 52,
        "papers": [
            "Clustering-based diversity improvement in top-N recommendation.",
            "Cost-sensitive three-way email spam filtering.",
            "Bayesian analysis of GUHA hypotheses.",
            "Hierarchical directory mapping for category-constrained meta-search.",
            "Content based image retrieval via a transductive model.",
            "Mining top-k frequent patterns over data streams sliding window.",
            "Human perspective to anomaly detection for cybersecurity.",
            "Dealing with trajectory streams by clustering and mathematical transforms.",
            "Mining complex patterns.",
            "Link classification with probabilistic graphs.",
            "Hierarchical object-driven action rules.",
            "Semantic subgroup explanations.",
            "A method for reduction of examples in relational learning.",
            "A contribution to the discovery of multidimensional patterns in healthcare trajectories.",
            "Finding the most descriptive substructures in graphs with discrete and numeric labels.",
            "Singer identification based on computational auditory scene analysis and missing feature methods.",
            "D-HOCS: an algorithm for discovering the hierarchical overlapping community structure of a social network.",
            "Exploiting the wisdom of social connections to make personalized recommendations on scholarly articles.",
            "Dream sentiment analysis using second order soft co-occurrences (SOSCO) and time course representations.",
            "SMOL: a systemic methodology for ontology learning from heterogeneous sources.",
            "Producing efficient retrievability ranks of documents using normalized retrievability scoring function.",
            "Mining regional co-location patterns with kNNG.",
            "A new particle swarm feature selection method for classification.",
            "TS-stream: clustering time series on data streams.",
            "Token list based information search in a multi-dimensional massive database.",
            "Bayesian networks for supporting query processing over incomplete autonomous databases.",
            "Detecting intrusion transactions in database systems: a novel approach.",
            "In-memory, distributed content-based recommender system.",
            "A naive Bayes probability estimation model based on self-adaptive differential evolution.",
            "Integration operators for generating RDF/OWL-based user defined mediator views in a grid environment.",
            "OBCAS: an agent-based system and ontology for mobile context aware interactions.",
            "Extensions and relationships of some existing lower-bound functions for dynamic time warping.",
            "Multi-view document clustering via ensemble method.",
            "Discriminative and deterministic approaches towards entity resolution.",
            "Link-based web spam detection using weight properties.",
            "Algorithms for spatial collocation pattern mining in a limited memory environment: a summary of results.",
            "Toward seed-insensitive solutions to local community detection.",
            "A rule-based expert system for earthquake prediction.",
            "Learning from syntax generalizations for automatic semantic annotation.",
            "Automatic content based image retrieval using semantic analysis.",
            "Image understanding and the web: a state-of-the-art review.",
            "Consistent feature selection and its application to face recognition.",
            "Time-slide window join over data streams.",
            "DART+: Direction-aware bichromatic reverse k nearest neighbor query processing in spatial databases.",
            "Improving process models by mining mappings of low-level events to high-level activities.",
            "Special issue on future directions for intelligent information systems.",
            "The human is the loop: new directions for visual analytics.",
            "Data-centric intelligent information integration - from concepts to automation.",
            "Intelligent digital libraries and tailored services.",
            "A roadmap for privacy-enhanced secure data provenance.",
            "Mining the home environment.",
            "Employing flowgraphs for forward route reconstruction in video surveillance system."
        ]
    },
    {
        "name": "JIIS",
        "year": "2013",
        "info": "2013: Volumes\n40, 41",
        "count": 48,
        "papers": [
            "NODAR: mining globally distributed substructures from a single labeled graph.",
            "Fiducial feature reduction analysis for electrocardiogram (ECG) based biometric recognition.",
            "Content-based and collaborative techniques for tag recommendation: an empirical evaluation.",
            "A sound and complete chase procedure for constrained tuple-generating dependencies.",
            "Automatic discovery of Web Query Interfaces using machine learning techniques.",
            "Clustering interval data through kernel-induced feature space.",
            "Instrument identification and pitch estimation in multi-timbre polyphonic musical signals based on probabilistic mixture model decomposition.",
            "E-FFC: an enhanced form-focused crawler for domain-specific deep web databases.",
            "Special issue on SIASP at ICDM 2010.",
            "Toward finding hidden communities based on user profile.",
            "Meme ranking to maximize posts virality in microblogging platforms.",
            "Catching a viral video.",
            "Tag recommendation by machine learning with textual and social features.",
            "Iterative classification for multiple target attributes.",
            "Folksonomy link prediction based on a tripartite graph for tag recommendation.",
            "UniDis: a universal discretization technique.",
            "Reducing the size of databases for multirelational classification: a subgraph-based approach.",
            "An argumentation framework for description logic ontology reasoning and management.",
            "Learning from data streams with only positive and unlabeled data.",
            "BruteSuppression: a size reduction method for Apriori rule sets.",
            "Coupling semantic and statistical techniques for dynamically enriching web ontologies.",
            "Provisional reporting for rank joins.",
            "Unsupervised feature construction for improving data representation and semantics.",
            "Clustering based on a near neighbor graph and a grid cell graph.",
            "QUBiC: An adaptive approach to query-based recommendation.",
            "Special issue on challenges in knowledge discovery and data mining.",
            "Learning to predict opinion share and detect anti-majority opinionists in social networks.",
            "Transfer learning by centroid pivoted mapping in noisy environment.",
            "Clustering of non-metric proximity data based on bi-links with ϵ-indiscernibility.",
            "Improving customer acquisition models by incorporating spatial autocorrelation at different levels of granularity.",
            "A framework for analysis of the effect of time on shopping behavior.",
            "The notion of diversity in graphical entity summarisation on semantic knowledge graphs.",
            "An intensional approach for periodic data in relational databases.",
            "Granular computing for relational data classification.",
            "Formal concept analysis approach for data extraction from a limited deep web database.",
            "A novel feature selection method and its application.",
            "Clinical reasoning gains in medical PBL: an UMLS based tutoring system.",
            "Querying now-relative data.",
            "A spectral approach to detecting subtle anomalies in graphs.",
            "MIRrors: Music Information Research reflects on its future - Special issue foreword.",
            "Evaluation in Music Information Retrieval.",
            "Classification accuracy is not enough - On the evaluation of music genre recognition systems.",
            "Automatic music transcription: challenges and future directions.",
            "Capturing the workflows of music information retrieval for repeatability and reuse.",
            "Feature learning and deep architectures: new directions for music informatics.",
            "Seven problems that keep MIR from attracting the interest of cognition and neuroscience.",
            "Toward an understanding of the history and impact of user studies in music information retrieval.",
            "The neglected user in music information retrieval research."
        ]
    },
    {
        "name": "JIIS",
        "year": "2012",
        "info": "2012: Volumes\n38, 39",
        "count": 60,
        "papers": [
            "Probabilistic skylines on uncertain data: model and bounding-pruning-refining methods.",
            "The ramification problem in temporal databases: an approach with conflicting constraints.",
            "Knowledge-driven delivery of home care services.",
            "A relational database integrity framework for access control policies.",
            "\"Andromaly\": a behavioral malware detection framework for android devices.",
            "Learning non-taxonomical semantic relations from domain texts.",
            "On context-aware co-clustering with metadata support.",
            "Wavelet ridges for musical instrument classification.",
            "Learning Instance Weighted Naive Bayes from labeled and unlabeled data.",
            "A density-based spatial clustering for physical constraints.",
            "Message classification as a basis for studying command and control communications - an evaluation of machine learning approaches.",
            "Data clustering using bacterial foraging optimization.",
            "Visually exploring movement data via similarity-based analysis.",
            "A multi-agent recommender system for supporting device adaptivity in e-Commerce.",
            "A transduction-based approach to fuzzy clustering, relevance ranking and cluster label generation on web search results.",
            "Contextual correlation based thread detection in short text message streams.",
            "Extracting multiple news attributes based on visual features.",
            "A new generative opinion retrieval model integrating multiple ranking factors.",
            "Mining Bayesian networks out of ontologies.",
            "Tableaux-based optimization of schema mappings for data integration.",
            "Intelligent video and audio applications for learning enhancement.",
            "SMARTINT: using mined attribute dependencies to integrate fragmented web databases.",
            "Modeling temporal dimensions of semistructured data.",
            "The Semantic Service Search Engine (S3E).",
            "A new unsupervised feature selection method for text clustering based on genetic algorithms.",
            "In & out zooming on time-aware user/tag clusters.",
            "Natural language technology and query expansion: issues, state-of-the-art and perspectives.",
            "Aircraft interior failure pattern recognition utilizing text mining and neural networks.",
            "WSM: a novel algorithm for subgraph matching in large weighted graphs.",
            "Temporal aggregation on user-defined granularities.",
            "cTraj: efficient indexing and searching of sequences containing multiple moving objects.",
            "Semantic distances for technology landscape visualization.",
            "Community-based anomaly detection in evolutionary networks.",
            "Tagging image by merging multiple features in a integrated manner.",
            "Interpretability-based validity methods for clustering results evaluation.",
            "Reasoning with unknown, not-applicable and irrelevant meta-values in concept learning and pattern discovery.",
            "Geometrical codification for clustering mixed categorical and numerical databases.",
            "Key factors in web latency savings in an experimental prefetching system.",
            "Towards an effective automatic query expansion process using an association rule mining approach.",
            "A distributed architecture for efficient parallelization and computation of knowledge-based temporal abstractions.",
            "Rotation-invariant similarity in time series using bag-of-patterns representation.",
            "Adaptive two-level optimization for selection predicates of multiple continuous queries.",
            "BRACID: a comprehensive approach to learning rules from imbalanced data.",
            "Challenges and solutions in the opinion summarization of user-generated content.",
            "Tractable reasoning with vague knowledge using fuzzy EL++.",
            "An adaptive learning automata-based ranking function discovery algorithm.",
            "Linear semi-supervised projection clustering by transferred centroid regularization.",
            "A new method of mining data streams using harmony search.",
            "Using maximal spanning trees and word similarity to generate hierarchical clusters of non-redundant RSS news articles.",
            "Detection and resolution of semantic inconsistency and redundancy in an automatic ontology merging system.",
            "Improving database performance with a mixed fragmentation design.",
            "DoSO: a document self-organizer.",
            "Multi-level delegations with trust management in access control systems.",
            "What influences the accuracy of decision tree ensembles?",
            "Image auto-annotation with automatic selection of the annotation length.",
            "Efficient processing of top-k queries: selective NRA algorithms.",
            "Towards a unified framework for opinion retrieval, mining and summarization.",
            "Extracting semantic relations to enrich domain ontologies.",
            "Exploiting semantic resources for large scale text categorization.",
            "A computational model for the identification and assessment of structural similarities in argumentative discourses."
        ]
    },
    {
        "name": "JIIS",
        "year": "2011",
        "info": "2011: Volumes\n36, 37",
        "count": 37,
        "papers": [
            "Collaborative RFID intrusion detection with an artificial immune system.",
            "Flexible rule-based inference exploiting taxonomies.",
            "ST-Audit: guideline-based automatic auditing of electronic patient records.",
            "A review and comparison of strategies for handling missing values in separate-and-conquer rule learning.",
            "Mining transposed motifs in music.",
            "Using web sources for improving video categorization.",
            "Integrating web service and semantic dialogue model for user models interoperability on the web.",
            "The ESTEEM platform: enabling P2P semantic collaboration through emerging collective knowledge.",
            "Deep Web adaptive crawling based on minimum executable pattern.",
            "Outlier detection by example.",
            "Special issue on data mining for decision making and risk management.",
            "A new co-training-style random forest for computer aided diagnosis.",
            "Modeling complex longitudinal consumer behavior with Dynamic Bayesian networks: an Acquisition Pattern Analysis application.",
            "Hybrid data mining approaches for prevention of drug dispensing errors.",
            "Risk-neutral evaluation of information security investment on data centers.",
            "Combined rough sets with flow graph and formal concept analysis for business aviation decision-making.",
            "Data augmentation by predicting spending pleasure using commercially available external data.",
            "String analysis technique for shopping path in a supermarket.",
            "Detection of risk factors using trajectory mining.",
            "Consumer decision making in knowledge-based recommendation.",
            "Active adaptation in human-agent collaborative interaction.",
            "A model and environment for improving multimedia scholarly reading practices.",
            "Research interests: their dynamics, structures and applications in unifying search and reasoning.",
            "A dynamic trust network for autonomy-oriented partner finding.",
            "Optimizing queries to remote resources.",
            "A vector-space dynamic feature for phrase-based statistical machine translation.",
            "Operators for transforming kernels into quasi-local kernels that improve SVM accuracy.",
            "A graph model for mutual information based clustering.",
            "Using ontology databases for scalable query answering, inconsistency detection, and data integration.",
            "Load shedding for multi-way stream joins based on arrival order patterns.",
            "Effective monitoring by efficient fingerprint matching using a forest of NAQ-trees.",
            "Special issue on data analysis methodologies for intelligent systems: guest editor's introduction.",
            "Application of analysis of variance and post hoc comparisons to studying the discriminative power of sound parameters in distinguishing between musical instruments.",
            "On three classes of division queries involving ordinal preferences.",
            "Extracting and summarizing the frequent emerging graph patterns from a dataset of graphs.",
            "Visualization of trends using RadViz.",
            "SEWEBAR-CMS: semantic analytical report authoring for data mining results."
        ]
    },
    {
        "name": "JIIS",
        "year": "2010",
        "info": "2010: Volumes\n34, 35",
        "count": 32,
        "papers": [
            "A new classification of datasets for frequent itemsets.",
            "Processing top-N relational queries by learning.",
            "Using temporal constraints for temporal abstraction.",
            "Neighborhood graphs for indexing and retrieving multi-dimensional data.",
            "Answering questions with an n-gram based passage retrieval engine.",
            "CLOVIS: towards precision-oriented text-based video retrieval through the unification of automatically-extracted concepts and relations of the visual and audio/speech contents.",
            "Generating a meta-DL by federating search on OAI and non-OAI servers.",
            "Architecture and algorithms of the SOPHIE choreography framework.",
            "Introduction to the special issue on advanced information retrieval and databases.",
            "Evaluating information retrieval system performance based on user preference.",
            "Passage extraction and result combination for genomics information retrieval.",
            "Identification of a dominating instrument in polytimbral same-pitch mixes using SVM classifiers with non-linear kernel.",
            "A top-down approach for compressing data cubes under the simultaneous evaluation of multiple hierarchical range queries.",
            "Queries with CASE expressions.",
            "Hierarchical associative classifier (HAC) for malware detection from the large and imbalanced gray list.",
            "VIREX and VRXQuery: interactive approach for visual querying of relational databases to produce XML.",
            "Comparison of knowledge during the assembly process of learning objects.",
            "Intelligent answering location questions from the web using molecular alignment.",
            "A conceptual model for user-centered quality information retrieval on the World Wide Web.",
            "Design of a multi_agent system for worm spreading_reduction.",
            "Synthesizing advanced transaction models using the situation calculus.",
            "Derived types in semantic association discovery.",
            "Describing and deriving certain answers over partial databases.",
            "Intelligent selection and retrieval of multiple time-oriented records.",
            "Noise reduction for instance-based learning with a local maximal margin approach.",
            "Support vector classifier based on fuzzy c-means and Mahalanobis distance.",
            "Modeling interactive storytelling genres as application domains.",
            "Ontology-driven web-based semantic similarity.",
            "Semantic-distance based evaluation of ranking queries over relational databases.",
            "Speed up gradual rule mining from stream data! A B-Tree and OWA-based approach.",
            "A performance evaluation framework for association mining in spatial data.",
            "Subspace tree: high dimensional multimedia indexing with logarithmic temporal complexity."
        ]
    },
    {
        "name": "JIIS",
        "year": "2009",
        "info": "2009: Volumes\n32, 33",
        "count": 26,
        "papers": [
            "An enhanced Web page change detection approach based on limiting similarity computations to elements of same type.",
            "Effective database transformation and efficient support computation for mining sequential patterns.",
            "Unary and n-ary inclusion dependency discovery in relational databases.",
            "An interoperable context sensitive model of trust.",
            "Specifying active databases as non-Markovian theories of actions.",
            "A coherent query language for XML.",
            "A novel approach for process mining based on event types.",
            "An adaptive personalized news dissemination system.",
            "Extending the rand, adjusted rand and jaccard indices to fuzzy partitions.",
            "A dual-layered model for web services representation and composition.",
            "Gaining insight through case-based explanation.",
            "The POINT approach to represent now in bitemporal databases.",
            "Introduction.",
            "A new approach to discover interlacing data structures in high-dimensional space.",
            "A local semi-supervised Sammon algorithm for textual data visualization.",
            "FARICS: a method of mining spatial association rules and collocations using clustering and Delaunay diagrams.",
            "Data mining-based materialized view and index selection in data warehouses.",
            "Enabling OLAP in mobile environments via intelligent data cube compression techniques.",
            "A join tree probability propagation architecture for semantic modeling.",
            "The Multi-Tree Cubing algorithm for computing iceberg cubes.",
            "(alpha, k)-anonymous data publishing.",
            "Guest editors' introduction to the special issue on flexible queries in information systems.",
            "Relaxing RDF queries based on user and domain preferences.",
            "Incremental controlled relaxation of failing flexible queries.",
            "A fuzzy extension of the XPath query language.",
            "Issues in the practical use of the OWA operators in fuzzy querying."
        ]
    },
    {
        "name": "JIIS",
        "year": "2008",
        "info": "2008: Volumes\n30, 31",
        "count": 25,
        "papers": [
            "Answering form-based web queries using the data-mining approach.",
            "VirtuE: a formal model of virtual enterprises for information markets.",
            "Measuring the structural similarity among XML documents and DTDs.",
            "Null values in fuzzy databases.",
            "Bag-based data models for incomplete information and their closure properties.",
            "Transaction Management for Flash Media Databases in Portable Computing Environments.",
            "Mining categories for emails via clustering and pattern discovery.",
            "Using synchronic and diachronic relations for summarizing multiple documents describing evolving events.",
            "Agent based intelligent search framework for product information using ontology mapping.",
            "Is it DSS or OLTP: automatically identifying DBMS workloads.",
            "Consistency measures for feature selection.",
            "Incremental application of knowledge to continuously arriving time-oriented data.",
            "Using B+-trees for processing of line segments in large spatial databases.",
            "Context-sensitive queries for image retrieval in digital libraries.",
            "Content-based image retrieval by hierarchical linear subspace method.",
            "Guest editors' introduction: special issue for ISIP 2005.",
            "A framework for checking proofs naturally.",
            "Approximate schemas, source-consistency and query answering.",
            "Building and using temporal knowledge in archaeological documentation.",
            "A glimpse of symbolic-statistical modeling by PRISM.",
            "A note on phase transitions and computational pitfalls of learning from sequences.",
            "Maintaining frequent closed itemsets over a sliding window.",
            "An adaptive partitioning approach for mining discriminant regions in 3D image data.",
            "Multi-objective genetic algorithms based automated clustering for fuzzy association rules mining.",
            "A novel retrieval approach reflecting variability of syntactic phrase representation."
        ]
    },
    {
        "name": "JIIS",
        "year": "2007",
        "info": "2007: Volumes\n28, 29",
        "count": 26,
        "papers": [
            "Knowledge discovery from spatial transactions.",
            "Towards a new approach for mining frequent itemsets on data stream.",
            "Classifying web documents in a hierarchy of categories: a comprehensive study.",
            "A process of knowledge discovery from web log data: Systematization and critical review.",
            "Dynamic management of UDDI registries in a wireless environment of web services: Concepts, architecture, operation, and deployment.",
            "Constraint-based sequential pattern mining: the pattern-growth methods.",
            "Approximate range-sum query answering on data cubes with probabilistic guarantees.",
            "An active database architecture for knowledge-based incremental abstraction of complex concepts from continuously arriving time-oriented raw data.",
            "Ontology-supported FAQ processing and ranking techniques.",
            "Recommenders in a personalized, collaborative digital library environment.",
            "Biodiversity and ecosystem informatics.",
            "Component-based end-user database design for ecologists.",
            "Database-backed decision trees with application to biological informatics.",
            "A scalable algorithm for dispersing population.",
            "Neural network-based light attenuation model for monitoring seagrass population in the Indian river lagoon.",
            "A semantic framework and software design to enable the transparent integration, reorganization and discovery of natural systems knowledge.",
            "An architecture for electronic field guides.",
            "A knowledge environment for the biodiversity and ecological sciences.",
            "Information ecology: open system environment for data, memories, and knowing.",
            "SPHINX: Schema integration by example.",
            "About quotient and division of crisp and fuzzy relations.",
            "Hierarchical document classification using automatically generated hierarchy.",
            "Bayesian networks for imputation in classification problems.",
            "Preserving privacy in association rule mining with bloom filters.",
            "The MIEL system: Uniform interrogation of structured and weakly-structured imprecise data.",
            "Context recognition using internet as a knowledge base."
        ]
    },
    {
        "name": "JIIS",
        "year": "2006",
        "info": "2006: Volumes\n26, 27",
        "count": 30,
        "papers": [
            "Introduction.",
            "Building and querying e-catalog networks using P2P and data summarisation techniques.",
            "Fuzzy semantic tagging and flexible querying of XML documents extracted from the Web.",
            "Consequence finding and computing answers with defaults.",
            "Querying a summary of database.",
            "A unified interaction scheme for information sources.",
            "Answering constraint-based mining queries on itemsets using previous materialized results.",
            "A preference processing model for cooperative agents.",
            "Deriving similarity for Semantic Web using similarity graph.",
            "Genetic algorithms based approach to database vertical partition.",
            "MPM: a hierarchical clustering algorithm using matrix partitioning method for non-numeric data.",
            "Incorporating large unlabeled data to enhance EM classification.",
            "A plausible inference prototype for the Semantic Web.",
            "Holes in joins.",
            "Latent linkage semantic kernels for collective classification of link data.",
            "MPM: a hierarchical clustering algorithm using matrix partitioning method for non-numeric data.",
            "Modeling a web-based remote monitoring and fault diagnosis system with UML and component technology.",
            "Merging deductive and inductive reasoning for processing textual descriptions of inter-human conflicts.",
            "Bootstrapping rule induction to achieve rule stability and reduction.",
            "A new approach for combining content-based and collaborative filters.",
            "Fuzzy methods for case-based recommendation and decision support.",
            "Using KCCA for Japanese-English cross-language information retrieval and document classification.",
            "An efficient approach to mining indirect associations.",
            "Measuring inconsistency in knowledgebases.",
            "Mining spatio-temporal data.",
            "Spatial associative classification: propositional vs structural approach.",
            "Mining changing regions from access-constrained snapshots: a cluster-embedded decision tree approach.",
            "Spatial ordering and encoding for geographic data mining and visualization.",
            "Time-focused clustering of trajectories of moving objects.",
            "Mining sequential patterns from data streams: a centroid approach."
        ]
    },
    {
        "name": "JIIS",
        "year": "2005",
        "info": "2005: Volumes\n24, 25",
        "count": 23,
        "papers": [
            "Clustering in Dynamic Spatial Databases.",
            "Generating a Condensed Representation for Association Rules.",
            "A New Term Significance Weighting Approach.",
            "Scanning the Issue.",
            "Nearest-Neighbor Automatic Sound Annotation with a WordNet Taxonomy.",
            "A Music Recommendation System Based on Music and User Grouping.",
            "Estimation of Musical Sound Separation Algorithm Effectiveness Employing Neural Networks.",
            "Drum Loops Retrieval from Spoken Queries.",
            "Voice-Based Gender Identification in Multimedia Applications.",
            "Automatic Recognition of Isolated Monophonic Musical Instrument Sounds using kNNC.",
            "Pitch Detection Enhancement Employing Music Prediction.",
            "An Engineering Approach to Cooperating Agents for Distributed Information Systems.",
            "Automatic Category Theme Identification and Hierarchy Generation for Chinese Text Categorization.",
            "Post-Supervised Template Induction for Information Extraction from Lists and Tables in Dynamic Web Sources.",
            "Fuzzy Cognitive Maps Learning Using Particle Swarm Optimization.",
            "PSE: An Object-Oriented Representation for Modeling and Managing Part-of Relationships.",
            "Intelligent Services for the Elderly Over the TV.",
            "A Framework for Effective Annotation of Information from Closed Captions Using Ontologies.",
            "The Neem Platform: An Evolvable Framework for Perceptual Collaborative Applications.",
            "An Interface Agent Approach to Personalize Users' Interaction with Databases.",
            "A Fixed-Distribution PAC Learning Theory for Neural FIR Models.",
            "A Framework for Management of Semistructured Probabilistic Data.",
            "Maximal Association Rules: A Tool for Mining Associations in Text."
        ]
    },
    {
        "name": "JIIS",
        "year": "2004",
        "info": "2004: Volumes\n22, 23",
        "count": 25,
        "papers": [
            "Guest Editor's Introduction: Special Issue on Data Mining.",
            "Sequential Association Rule Mining with Time Lags.",
            "Filtering Multi-Instance Problems to Reduce Dimensionality in Relational Learning.",
            "Dataless Transitions Between Concise Representations of Frequent Patterns.",
            "Meta-Learner for Unknown Attribute Values Processing: Dealing with Inconsistency of Meta-Databases.",
            "Identifying and Handling Mislabelled Instances.",
            "Optimizing Recursive Information Gathering Plans in EMERAC.",
            "Mining Informative Rule Set for Prediction.",
            "Answering Queries Addressed to Several Databases According to a Majority Merging Approach.",
            "Guest Editor's Introduction: Special Issue on Web Content Mining.",
            "An Analytical Approach to Concept Extraction in HTML Environments.",
            "Learning Rules for Conceptual Structure on the Web.",
            "Optimizing the Execution Time for Checking the Consistency of XML Documents.",
            "Interval Set Clustering of Web Users with Rough K-Means.",
            "Optimization in Data Cube System Design.",
            "An Evaluation of Passage-Based Text Categorization.",
            "Dynamic Composition of Information Retrieval Techniques.",
            "Recommender Systems Research: A Connection-Centric Survey.",
            "Use and Maintenance of Histograms for Large Scientific Database Access Planning: A Case Study of a Pharmaceutical Data Repository.",
            "A Dynamic Programming Algorithm for Linear Text Segmentation.",
            "Editorial.",
            "Ontology Guided XML Security Engine.",
            "Transaction Fusion: A Model for Data Recovery from Information Attacks.",
            "The Design and Implementation of a Self-Healing Database System.",
            "On Logical Foundations of Multilevel Secure Databases."
        ]
    },
    {
        "name": "JIIS",
        "year": "2003",
        "info": "2003: Volumes\n20, 21",
        "count": 27,
        "papers": [
            "The Wisdom Web: New Challenges for Web Intelligence (WI).",
            "A Data Cube Model for Prediction-Based Web Prefetching.",
            "Self-Organized Load Balancing in Proxy Servers: Algorithms and Performance.",
            "Average-Clicks: A New Measure of Distance on the World Wide Web.",
            "A Data Model for XML Databases.",
            "View Inference for Heterogeneous XML Information Integration.",
            "Extending Datalog with Declarative Updates.",
            "Studying Recommendation Algorithms by Graph Analysis.",
            "Vocal Access to a Newspaper Archive: Assessing the Limitations of Current Voice Information Access Technology.",
            "Ordering and Path Constraints over Semistructured Data.",
            "A Deductive Database Approach to A.I. Planning.",
            "A Statistical Theory for Quantitative Association Rules.",
            "Analysis of Feature Dependencies in Sound Description.",
            "Editorial: Music Information Retrieval.",
            "Automatic Thematic Extractor.",
            "Analysis of Vowels in Sung Queries for a Music Information Retrieval System.",
            "Robust Polyphonic Music Retrieval with N-grams.",
            "Application of Temporal Descriptors to Musical Instrument Sound Recognition.",
            "Introduction: Intelligent Information Systems to Aid the Handicapped.",
            "Communication Interface with Eye-Gaze and Head Gesture Using Successive DP Matching and Fuzzy Inference.",
            "EMG-Based Motion Discrimination Using a Novel Recurrent Neural Network.",
            "The Development of a Virtual Myoelectric Prosthesis Controlled by an EMG Pattern Recognition System Based on Neural Networks.",
            "Intelligent Processing of Stuttered Speech.",
            "Functional Behavioral Assessment Using the LERS Data Mining System - Strategies for Understanding Complex Physiological and Behavioral Patterns.",
            "Semantic E-Workflow Composition.",
            "A Comparison of Word- and Sense-Based Text Categorization Using Several Classification Algorithms.",
            "Personalized and Adaptive Services on Board a Car: An Application for Tourist Information."
        ]
    },
    {
        "name": "JIIS",
        "year": "2002",
        "info": "2002: Volumes\n18, 19",
        "count": 30,
        "papers": [
            "Editorial - A Survey of Research Questions for Intelligent Information Systems in Education.",
            "Latent Semantic Analysis for User Modeling.",
            "Empirical Study of a 3D Visualization for Information Retrieval Tasks.",
            "Linear-Time Preprocessing in Optimal Numerical Range Partitioning.",
            "Authorization and Access Control of Application Data in Workflow Systems.",
            "Guest Editors' Introduction to the Special Issue on Automated Text Categorization.",
            "A Dynamic Probabilistic Model to Visualise Topic Evolution in Text Streams.",
            "Latent Semantic Kernels.",
            "A Probabilistic Framework for the Hierarchic Organisation and Classification of Document Collections.",
            "PVA: A Self-Adaptive Personal View Agent.",
            "Hidden Markov Models for Text Categorization in Multi-Page Documents.",
            "A Study of Approaches to Hypertext Categorization.",
            "Guest Editor's Introduction - Special Issue on Multimedia Data Mining.",
            "Image Mining: Trends and Developments.",
            "Spatio-Temporal Data Mining for Typhoon Image Collection.",
            "Mining Multimedia Subjective Feedback.",
            "A Multimedia Data Mining Framework: Mining Information from Traffic Video Sequences.",
            "Mining of Moving Objects from Time-Series Images and its Application to Satellite Weather Imagery.",
            "Learning Prosodic Patterns for Mandarin Speech Synthesis.",
            "Efficient Management of Persistent Knowledge.",
            "Introduction to Special Issue on Data Warehousing and Knowledge Discovery.",
            "Approximate Query Answering Using Data Warehouse Striping.",
            "Capturing Delays and Valid Times in Data Warehouses - Towards Timely Consistent Analyses.",
            "Bottom-Up Association Rule Mining in Relational Databases.",
            "Combining Approximation Techniques and Vector Quantization for Adaptable Similarity Search.",
            "Hypothetical Temporal Reasoning in Databases.",
            "Using Dempster-Shafer's Theory of Evidence to Combine Aspects of Information Use.",
            "A Strategy of Dynamic Reasoning in Knowledge-Based System with Fuzzy Production Rules.",
            "A Knowledge-Based Approach to Visual Information.",
            "Aggregate Queries Over Conditional Tables."
        ]
    },
    {
        "name": "JIIS",
        "year": "2001",
        "info": "2001: Volumes\n16, 17",
        "count": 26,
        "papers": [
            "Text Database Discovery on the Web: Neural Net Based Approach.",
            "Partial Evaluation of Views.",
            "Temporal Granularity: Completing the Puzzle.",
            "A Default Logic Based Framework for Context-Dependent Reasoning with Lexical Knowledge.",
            "Feature Weight Maintenance in Case Bases Using Introspective Learning.",
            "The Relational Structure of Belief Networks.",
            "Compiling Source Descriptions for Efficient and Flexible Information Integration.",
            "Using Rough Sets with Heuristics for Feature Selection.",
            "Unsupervised Rough Set Classification Using GAs.",
            "An Extension to GCWA and Query Evaluation for Disjunctive Deductive Databases.",
            "Loglinear-Based Quasi Cubes.",
            "Parametric Algorithms for Mining Share Frequent Itemsets.",
            "A Framework for Method-Specific Knowledge Compilation from Databases.",
            "Towards Intelligent Semantic Caching for Web Sources.",
            "Logical Approach to Capability-Based Rewriting in a Mediator for WebSources.",
            "The Branching-Time Transformation Technique for Chain Datalog Programs.",
            "Guest Editor Introduction: Scientific and Statistical Database Management.",
            "On Clustering Validation Techniques.",
            "Clustering High Dimensional Massive Scientific Datasets.",
            "A Statistical Metadata Model for Simultaneous Manipulation of both Data and Metadata.",
            "Tracing Lineage of Array Data.",
            "SP-GiST: An Extensible Database Index for Supporting Space Partitioning Trees.",
            "BitCube: A Three-Dimensional Bitmap Indexing for XML Documents.",
            "Specifying OLAP Cubes on XML Data.",
            "Improving Federated Database Queries Using Declarative Rewrite Rules for Quantified Subqueries.",
            "Mediator-Based Evolutionary Design and Development of Image Meta-Analysis Environments."
        ]
    },
    {
        "name": "JIIS",
        "year": "2000",
        "info": "2000: Volumes\n14, 15",
        "count": 26,
        "papers": [
            "A Value-Driven System for Autonomous Information Gathering.",
            "Decision-Centric Information Monitoring.",
            "Producing Interoperable Queries for Relational and Object-Oriented Databases.",
            "Introduction.",
            "Information Systems that Really Support Decision-Making.",
            "IMPACT: A System for Building Agent Applications.",
            "Mining for Attribute Definitions in a Distributed Two-Layered DB System.",
            "Representing and Reasoning on Conceptual Queries Over Image Databases.",
            "Enhancing Concept-Based Retrieval Based on Minimal Term Sets.",
            "Machine Learning for Intelligent Processing of Printed Documents.",
            "An Adjustable Description Quality Measure for Pattern Discovery Using the AQ Methodology.",
            "Levelwise Search and Pruning Strategies for First-Order Hypothesis Spaces.",
            "Token-Templates and Logic Programs for Intelligent Web Search.",
            "Data Warehousing and Knowledge Discovery.",
            "Incremental Design of a Data Warehouse.",
            "Temporal Coupling Verification in Time Series Databases.",
            "Multidimensional Index Structures in Relational Databases.",
            "Knowledge Discovery from Series of Interval Events.",
            "Textual Data Mining to Support Science and Technology Management.",
            "Design and Implementation of the ROL Deductive Object-Oriented Database System.",
            "Using Constraint Satisfaction for View Update.",
            "Efficient Rule-Based Attribute-Oriented Induction for Data Mining.",
            "Consistency and Completeness in Rough Sets.",
            "Migrating Autonomous Objects in a WAN Environment.",
            "View Management Support in Advanced Knowledge Base Servers.",
            "Querying Documents using Content, Structure and Properties."
        ]
    },
    {
        "name": "JIIS",
        "year": "1999",
        "info": "1999: Volumes\n12, 13",
        "count": 22,
        "papers": [
            "Ranking Strategies for Navigation Based Query Formulation.",
            "Active Rule Termination Analysis: An Implementation and Evaluation of the Refined Triggering Graph Method.",
            "Borders: An Efficient Algorithm for Association Generation in Dynamic Databases.",
            "Cooperative Query Answering with Generalized Quantifiers.",
            "Guest Editor Introduction: Functional Approach to Intelligent Information Systems.",
            "The Evolving Role of Constraints in the Functional Data Model.",
            "The Functional Data Model as the Basis for an Enriched Database Query Language.",
            "Functional Query Optimization over Object-Oriented Views for Data Integration.",
            "How to Comprehend Queries Functionally.",
            "Optimizing Queries with Object Updates.",
            "Abstract Interpretation for Termination Analysis in Functional Active Databases.",
            "Editors' Foreword: Intelligent Temporal Information Systems in Medicine.",
            "Fuzzy Temporal/Categorical Information in Diagnosis.",
            "Temporal Pattern Matching Using Fuzzy Templates.",
            "Deriving Trends in Historical and Real-Time Continuously Sampled Medical Data.",
            "A Multidimensional and Multigranular Model of Time for Medical Knowledge-Based Systems.",
            "Integration of Temporal Reasoning and Temporal-Data Maintenance into a Reusable Database Mediator to Answer Abstract, Time-Oriented Queries: The Tzolkin System.",
            "A Collaborative Environment for Authoring Large Knowledge Bases.",
            "Data Mining in Large Databases Using Domain Generalization Graphs.",
            "Software Agent-Oriented Frameworks for Global Query Processing.",
            "KWM: Knowledge-based Workflow Model for Agile Organization.",
            "Type Safety in the Context of Method Updates."
        ]
    },
    {
        "name": "JIIS",
        "year": "1998",
        "info": "1998: Volumes\n10, 11",
        "count": 21,
        "papers": [
            "An Overview of the Rule-Based Object Language.",
            "New Techniques for Data Reduction in a Database System for Knowledge Discovery Applications.",
            "Reasoning About Data Provided by Federated Deductive Databases.",
            "ADEPTflex-Supporting Dynamic Changes of Workflows Without Losing Control.",
            "Modeling and Analysis of Workflows Using Petri Nets.",
            "From Centralized Workflow Specification to Distributed Workflow Execution.",
            "WebWork: METEOR2's Web-Based Workflow Management System.",
            "AL-log: Integrating Datalog and Description Logics.",
            "SCDBR: An Automated Reasoner for Specifications of Database Updates.",
            "Mining Text Using Keyword Distributions.",
            "A Formal Definition of the Chimera Object-Oriented Data Model.",
            "Abductive Knowledge Base Updates for Contextual Reasoning.",
            "A Model for Query Decomposition and Answer Construction in Heterogeneous Distributed Database Systems.",
            "Prioritizing Information for the Discovery of Phenomena.",
            "Minimum Cross-Entropy Approximation for Modeling of Highly Intertwining Data Sets at Subclass Levels.",
            "Five Steps to Construct a Model of Data Allocation for Distributed Database Systems.",
            "Selected Research Issues in Decision Support Databases.",
            "Guest Editors' Introduction: Information Visualization. The Next Frontier.",
            "Automated Visual Presentation: From Heterogeneous Information to Coherent Visual Discourse.",
            "Information Visualization Within a Digital Video Library.",
            "Knowledge Mining With VxInsight: Discovery Through Interaction."
        ]
    },
    {
        "name": "JIIS",
        "year": "1997",
        "info": "1997: Volumes\n8, 9",
        "count": 25,
        "papers": [
            "On the Accuracy of Meta-Learning for Scalable Data Mining.",
            "A Model for Adaptive Information Retrieval.",
            "Generation and Evaluation of Indexes for Chemistry Articles.",
            "The ARCHIMEDES Network System; A System for Searching and Accessing Information in Multiple Multimedia Sources.",
            "The TSIMMIS Approach to Mediation: Data Models and Languages.",
            "Learning to Understand Information on the Internet: An Example-Based Approach.",
            "Information Filtering: A New Two-Phase Model Using Stereotypic User Profiling.",
            "On Migrating Threads.",
            "A Mediator for Approximate Consistency: Supporting \"Good Enough\" Materialized Views.",
            "Fuzzy Database Model Based on Quasi-Order Relations.",
            "Multi-Path Reasoning in a Database.",
            "Automated Query Formulation Using an Entity-Relationship Conceptual Schema.",
            "Designing Templates for Mining Association Rules.",
            "Discovering Patterns from Large and Dynamic Sequential Data.",
            "Feature Subset Selection within a Simulated Annealing Data Mining Algorithm.",
            "Exploiting Background Information in Knowledge Discovery from Text.",
            "P2: A Lightweight DBMS Generator.",
            "An Optimal Cache for a Federated Database System.",
            "Modified Component Valuations in Valuation Based Systems as a Way to Optimize Query Processing.",
            "An Extended Relational Data Model for Probabilistic Reasoning.",
            "Adaptive Intelligent Agents.",
            "Transportable Information Agents.",
            "Intelligent Adaptive Information Agents.",
            "Knowledge-Directed Adaptation in Multi-Level Agents.",
            "Knowledge Management in Societies of Intelligent Adaptive Agents."
        ]
    },
    {
        "name": "JIIS",
        "year": "1996",
        "info": "1996: Volumes\n6, 7",
        "count": 25,
        "papers": [
            "Nonstandard Set Theories and Information Management.",
            "Query Processing in Annotated Logic Programming: Theory and Implementation.",
            "Bottom-Up Computation of the Fitting Model for General Deductive Databases.",
            "Intelligent Integration of Information - Foreword.",
            "Query Reformulation for Dynamic Information Integration.",
            "Information Mediation in Cyberspace: Scalable Methods for Declarative Information Networks.",
            "An Approach to Information Mediation in the Industrial Domain.",
            "NCL: A Common Language for Achieving Rule-Based Interoperability Among Heterogeneous Systems.",
            "Generating Data Integration Mediators that Use Materialization.",
            "CoBase: A Scalable and Extensible Cooperative Information System.",
            "Integrating Information via Matchmaking.",
            "Glossary: Intelligent Integration of Information.",
            "A Parallel Algorithm for Real-Time Decision Making: A Rough Set Approach.",
            "A Data Model for Processes Based on Relative Time.",
            "Panorama: A Database System that Annotates Its Answers to Queries with Their Properties.",
            "Computing Access Relevance for Path-Method Generation in OODBs and IM-OODB.",
            "Foreword: Special Issue on Active Database Systems.",
            "PEARD: A Prototype Environment for Active Rule Debugging.",
            "Support Environment for Active Rule Design.",
            "A Formal Semantics for an Active Functional DBPL.",
            "Rule Activation Techniques in Active Database Systems.",
            "Intensional Query Answering by Partial Evaluation.",
            "The Analysis of Relationships in Databases for Rule Derivation.",
            "Integrating Medical Expert Systems, Patient Data-Bases and User Interfaces.",
            "Precision and Recall of Ranking Information-Filtering Systems."
        ]
    },
    {
        "name": "JIIS",
        "year": "1995",
        "info": "1995: Volumes\n4, 5",
        "count": 26,
        "papers": [
            "Guest Editor's Introduction: Knowledge Discovery in Databases-from Research to Applications.",
            "Automated Analysis and Exploration of Image Databases: Results, Progress, and Challenges.",
            "Opportunity Explorer: Navigating Large Databases Using Knowledge Discovery Templates.",
            "Selecting Among Rules Induced from a Hurricane Database.",
            "Efficient Discovery of Interesting Statements in Databases.",
            "A Bayesian Method for Learning Belief Networks that Contain Hidden Variables.",
            "Discovering Dynamics: From Inductive Logic Programming to Machine Discovery.",
            "Forword: Deductive Object-Oriented Databases.",
            "Fixpoint Iteration with Subsumption in Deductive Databases.",
            "A deductive and Object-Oriented Approach to a Complex Scheduling Problem.",
            "ConceptBase - A Deductive Object Base for Meta Data Management.",
            "On the Declarative and Procedural Semantics of Deductive Object-Oriented Systems.",
            "Combining Databases with Prioritized Information.",
            "The Role of Abduction in Database View Updating.",
            "Intelligent Reasoning Using General Knowledge to Update Specific Information: Database Approach.",
            "A Knowledge-based System for Generating Informative Responsens to Indirect Database Queries.",
            "KOSI - An Integrated System for Discovering Functional Relations from Databases.",
            "The Strong Semantics for Logic Programs.",
            "RAMA: An Architecture for Internet Information Filtering.",
            "Implicit Commitments: Heterogeneous Agent Coordination for Retrieval and Assembly of Distributed Image Data.",
            "Data Model and Query Evaluation in Global Information Systems.",
            "Resource Location in Large Scale Heterogeneous and Autonomous Databases.",
            "Conceptual Query Formulation and Retrieval.",
            "Induction of Ripple-Down Rules Applied to Modeling Large Databases.",
            "Knowledge Discovery from Structural Data.",
            "Improved Retrieval in a Fuzzy Database from Adjusted User Input."
        ]
    },
    {
        "name": "JIIS",
        "year": "1994",
        "info": "1994: Volume 3",
        "count": 13,
        "papers": [
            "Fuzzy Relational Algebra for Possibility-Distribution-Fuzzy-Relational Model of Fuzzy Data.",
            "Fuzzy Information Retrieval.",
            "Query Answering via Cooperative Data Inference.",
            "An Autonomous Multistrategy Theorem Proving System Using Knowledge-Based Techniques.",
            "Autonomous Objects: A Natural Model for Complex Applications.",
            "Coordinating Context Building in Heterogeneous Information Systems.",
            "Representation of Highly-Complex Knowledge in a Database.",
            "An Architecture of an Intelligent System for Routing User Requests in a Network of Heterogeneous Databases.",
            "Efficient and Effective Querying by Image Content.",
            "Foundations of Visual Metaphors for Schema Display.",
            "Query Representation and Management in a Multiparadigmatic Visual Query Environment.",
            "Duet - A Database User Interface Design Environment.",
            "Multimedia Object Modeling and Storage Allocation Strategies."
        ]
    },
    {
        "name": "JIIS",
        "year": "1993",
        "info": "1993: Volume 2",
        "count": 16,
        "papers": [
            "Database Management and Analysis Tools of Machine Induction.",
            "Database Exploration in Search of Regularities.",
            "A General Framework for Coherence in a CKBS.",
            "ERL: Logic for Entity-Relationship Databases.",
            "Mechanical Proof Systems for Logic II, Consensus Programs and Their Processing.",
            "A Case-Based Approach to Software Reuse.",
            "Knowledge Management by Example.",
            "Processing Negation and Disjunction in Logic Programs Through Integrity Constraints.",
            "On the Learning of Rule Uncertainties and their Integration into Probabilistic Knowledge Bases.",
            "On the Complexity of the Instance Checking Problem in Concept Languages with Existential Quantification.",
            "Learning Decision Trees from Decision Rules: A Method and Initial Results from a Comparative Study.",
            "Introduction: The Roles of Fuzzy Logic and Management of Uncertainty in Building Intelligent Information Systems.",
            "Qualitative Reasoning with Imprecise Probabilities.",
            "From Fuzzy Databases to Intelligent Manual Using Fril.",
            "A High-Performance, Ad-Hoc, Fuzzy Query Processing System.",
            "Retrieving Information by Fuzzification of Queries."
        ]
    },
    {
        "name": "JIIS",
        "year": "1992",
        "info": "1992: Volume 1",
        "count": 13,
        "papers": [
            "Integrated Knowledge Acquisition Architectures.",
            "The Roles of Artificial Intelligence in Information Systems.",
            "The Epistemology of Conceptual Clustering: KBG, an Implementation.",
            "Mining for Knowledge in Databases: The INLEN Architecture, Initial Implementation and First Results.",
            "An Overview of Cooperative Answering.",
            "Learning Mutually Dependent Relations.",
            "Incremental Database Rule Processing In PARADISER.",
            "Intelligent Support for Systems Development: The Notion and the Issues.",
            "Supporting Inconsistent Rules in Database Systems.",
            "Intelligent Databases: Old Challenges and New Opportunities.",
            "Relaxation as a Platform for Cooperative Answering.",
            "Some Approaches for Relational Databases Flexible Querying.",
            "Neighborhood and Associative Query Answering."
        ]
    }
]