[
    {
        "name": "JSIS",
        "year": "2022",
        "info": "Volume 31: 2022",
        "count": 5,
        "papers": [
            "When and why technology leadership enters the C-suite: An antecedents perspective on CIO presence.",
            "Disciplined autonomy: How business analytics complements customer involvement for digital innovation.",
            "Strategic roles of IT modernization and cloud migration in reducing cybersecurity risks of organizations: The case of U.S. federal government.",
            "Digital at the edge - antecedents and performance effects of boundary resource deployment.",
            "Welcome to this 1st issue of volume 31 of The Journal of Strategic Information Systems."
        ]
    },
    {
        "name": "JSIS",
        "year": "2021",
        "info": "Volume 30: 2021",
        "count": 23,
        "papers": [
            "The contingent role of interproject connectedness in cultivating open source software projects.",
            "The nature of IT use in temporary organizations.",
            "Strategic innovation in IT outsourcing: Exploring the differential and interaction effects of contractual and relational governance mechanisms.",
            "Examining interdependence between product users and employees in online user communities: The role of employee-generated content.",
            "Welcome to this 1st issue of Volume 30 of The Journal of Strategic Information Systems.",
            "Relating agility and electronic integration: The role of knowledge and process coordination mechanisms.",
            "SISP as practice: De-isolating SISP activity across multiple levels.",
            "The impact of structure and flux of corporate boards on organizational performance: A perspective from the information technology industry.",
            "Realizing value from shadow analytics: A case study.",
            "Welcome to this 2nd issue of Volume 30 of The Journal of Strategic Information Systems.",
            "Understanding and measuring formal communication quality for technology implementation: A test during the anticipation stage.",
            "Digital opportunities for incumbents - A resource-centric perspective.",
            "Sustaining collaborative software development through strategic consortium.",
            "We're engaged! Following the path to a successful information management capability.",
            "Digital strategy aligning in SMEs: A dynamic capabilities perspective.",
            "The lifecycle of algorithmic decision-making systems: Organizational choices and ethical challenges.",
            "Welcome to this 3RD issue of Volume 30 of The Journal of Strategic Information Systems.",
            "Opening organizational learning in crisis management: On the affordances of social media.",
            "Information systems security research agenda: Exploring the gap between research and practice.",
            "Exploring the boundaries and processes of digital platforms for knowledge work: A review of information systems research.",
            "Digital innovation: Review and novel perspective.",
            "The role of IT in organizational innovation - A systematic literature review.",
            "Welcome to this 4th issue of Volume 30 of The Journal of Strategic Information Systems."
        ]
    },
    {
        "name": "JSIS",
        "year": "2020",
        "info": "Volume 29: 2020",
        "count": 24,
        "papers": [
            "IOS drivers of manufacturer-supplier flexibility and manufacturer agility.",
            "Worker stress in the age of mobile technology: The combined effects of perceived interruption overload and worker control.",
            "Information Technology and organizational innovation: Harmonious information technology affordance and courage-based actualization.",
            "Organizational buyers' assimilation of B2B platforms: Effects of IT-enabled service functionality.",
            "IT outsourcing success: A dynamic capability-based model.",
            "Welcome to this 1st issue of volume 29 of The Journal of Strategic Information Systems.",
            "The digital work of strategists: Using open strategy for organizational transformation.",
            "Augmenting the algorithm: Emerging human-in-the-loop work configurations.",
            "Platform drifting: When work digitalization hijacks its spirit.",
            "Balancing fluid and cemented routines in a digital workplace.",
            "Digital work and organisational transformation: Emergent Digital/Human work configurations in modern organisations.",
            "Introduction.",
            "Viewpoint: Information systems research strategy.",
            "The past and future of The Journal of Strategic Information Systems: A conversation with Bob Galliers.",
            "Effectual tactics in digital intrapreneurship: A process model.",
            "Accomplishing the layered modular architecture in digital innovation: The case of the car's driver information module.",
            "Examining relational digital transformation through the unfolding of local practices of the Finnish taxi industry.",
            "Aligning the IT portfolio with business strategy: Evidence for complementarity of corporate and business unit alignment.",
            "The contribution of IT-leveraging capability for collaborative product development with suppliers.",
            "Crowdsourcing as a strategic IS sourcing phenomenon: Critical review and insights for future research.",
            "The strategic impacts of Intelligent Automation for knowledge and service work: An interdisciplinary review.",
            "Welcome to this 4th issue of Volume 29 of The Journal of Strategic Information Systems.",
            "Human resource management and its impact on strategic business-IT alignment: A literature review and avenues for future research.",
            "Literature review: Understanding information systems strategy in the digital age."
        ]
    },
    {
        "name": "JSIS",
        "year": "2019",
        "info": "Volume 28: 2019",
        "count": 25,
        "papers": [
            "What we talk about when we talk about (big) data.",
            "Digital transformation strategy making in pre-digital organizations: The case of a financial services provider.",
            "Dealing with digital traces: Understanding protective behaviors on mobile devices.",
            "Affordances, experimentation and actualization of FinTech: A blockchain implementation study.",
            "Decision-making and biases in cybersecurity capability development: Evidence from a simulation game experiment.",
            "The CIO stereotype: Content, bias, and impact.",
            "Design of review systems - A strategic instrument to shape online reviewing behavior and economic outcomes.",
            "Understanding digital transformation: A review and a research agenda.",
            "A review of the ICT-enabled development literature: Towards a power parity theory of ICT4D.",
            "Crowdwork platform governance toward organizational value creation.",
            "A review of the practical relevance of IS strategy scholarly research.",
            "Information technology and the search for organizational agility: A systematic review with future research possibilities.",
            "A comprehensive framework to research digital innovation: The joint use of the systems of innovation and critical realism.",
            "Enterprise reputation threats on social media: A case of data breach framing.",
            "Using a business process management system to model dynamic teaching methods.",
            "How employees gain meta-knowledge using enterprise social networks: A validation and extension of communication visibility theory.",
            "Reappraising maturity models in e-Government research: The trajectory-turning point theory.",
            "Exploring complexity and contradiction in information technology outsourcing: A set-theoretical approach.",
            "Welcome to this 4th issue of volume 28 of The Journal of Strategic Information Systems.",
            "Invited Viewpoint: How well does the Information Systems discipline fare in the Financial Times' top 50 Journal list?",
            "The roots of misalignment: Insights on strategy implementation from a system dynamics perspective.",
            "Congruent patterns of outsourcing capabilities: A bilateral perspective.",
            "Business intelligence and analytics use, innovation ambidexterity, and firm performance: A dynamic capabilities perspective.",
            "Dynamic information technology capability: Concept definition and framework development.",
            "Strategic signaling through cloud service certifications: Comparing the relative importance of certifications' assurances to companies and consumers."
        ]
    },
    {
        "name": "JSIS",
        "year": "2018",
        "info": "Volume 27: 2018",
        "count": 25,
        "papers": [
            "Welcome to the first issue of Volume 27 of The Journal of Strategic Information Systems.",
            "The role of IT application orchestration capability in improving agility and performance.",
            "Exploring the relationships between IT competence, innovation capacity and organizational agility.",
            "Aligning with new digital strategy: A dynamic capabilities approach.",
            "The influence of entrepreneurial action on strategic alignment in new ventures: Searching for the genesis of alignment.",
            "Sourcing in or out: Implications for social capital and knowledge sharing.",
            "Data analytics competency for improving firm decision making performance.",
            "Editorial.",
            "An affordance perspective of enterprise social media and organizational socialization.",
            "Achieving benefits with enterprise architecture.",
            "Sustaining and advancing IT careers: Women's experiences in a UK-based IT company.",
            "How and why trust matters in post-adoptive usage: The mediating roles of internal and external self-efficacy.",
            "Effects of consumer visit to online community and product channel on local sales of large consumer goods: Evidence from real estate industry.",
            "Welcome to the third issue of Volume 27 of The Journal of Strategic Information Systems.",
            "Who delivers the bigger bang for the buck: CMO or CIO?",
            "When decision support systems fail: Insights for strategic information systems from Formula 1.",
            "Sourcing knowledge in open source software projects: The impacts of internal and external social capital on project success.",
            "The doctrine of the mean: Reference groups and public information systems development.",
            "Editorial on Generating Business and Social Value from Digital Entrepreneurship and Innovation.",
            "Not all digital venture ideas are created equal: Implications for venture creation processes.",
            "Developing and maintaining clients' trust through institutional mechanisms in online service markets for digital entrepreneurs: A process model.",
            "When guanxi meets structural holes: Exploring the guanxi networks of Chinese entrepreneurs on digital platforms.",
            "Assessing value creation in digital innovation ecosystems: A Social Media Analytics approach.",
            "Money is not everything: A typology of crowdfunding project creators.",
            "Generating innovation potential: How digital entrepreneurs conceal, sequence, anchor, and propagate new technology."
        ]
    },
    {
        "name": "JSIS",
        "year": "2017",
        "info": "Volume 26: 2017",
        "count": 22,
        "papers": [
            "Editorial.",
            "Strategy, Resource Orchestration and E-commerce Enabled Social Innovation in Rural China.",
            "Performance implications of information-value offering in e-service systems: Examining the resource-based perspective and innovation strategy.",
            "Towards analysing the rationale of information security non-compliance: Devising a Value-Based Compliance analysis method.",
            "The paradoxical effects of legal intervention over unethical information technology use: A rational choice theory perspective.",
            "Editorial.",
            "Conflict resolution in business services outsourcing relationships.",
            "Solvers' participation in crowdsourcing platforms: Examining the impacts of trust, and benefit and cost factors.",
            "Distinguishing the effects of B2B information quality, system quality, and service outcome quality on trust and distrust.",
            "Closing the loop: Empirical evidence for a positive feedback model of IT business value creation.",
            "Editorial.",
            "Open strategy: Literature review, re-analysis of cases and conceptualisation as a practice.",
            "Datification and its human, organizational and societal effects: The strategic opportunities and challenges of algorithmic decision-making.",
            "Debating big data: A literature review on realizing value from big data.",
            "Exploring the tension between transparency and datification effects of open government IS through the lens of Complex Adaptive Systems.",
            "Datification, Organizational Strategy, and IS Research: What's the Score?",
            "Editorial.",
            "Not just an ego-trip: Exploring backers' motivation for funding in incentive-based crowdfunding.",
            "Why men and women continue to use social networking sites: The role of gender differences.",
            "Firestorms: Modeling conflict diffusion and management strategies in online communities.",
            "What makes a good contributor? Understanding contributor behavior within large Free/Open Source Software projects - A socialization perspective.",
            "Strategic signalling and awards: Investigation into the first decade of AIS best publications awards."
        ]
    },
    {
        "name": "JSIS",
        "year": "2016",
        "info": "Volume 25: 2016",
        "count": 23,
        "papers": [
            "Editorial.",
            "Managing inter-organizational knowledge sharing.",
            "Do different kinds of trust matter? An examination of the three trusting beliefs on satisfaction and purchase behavior in the buyer-seller context.",
            "The role of Transaction Cost Economics in Information Technology Outsourcing research: A meta-analysis of the choice of contract type.",
            "Transaction Cost Economics on trial again: A commentary on \"The Role of Transaction Cost Economics in Information Technology Outsourcing Research: A Meta-Analysis of the Choice of Contract Type\".",
            "A response to \"Transaction Cost Economics on Trial Again\".",
            "A Commentary on: \"The role of transaction cost economics in information technology outsourcing research: A meta-analysis of the choice of contract type\".",
            "A Commentary: Theory appropriation and the growth of knowledge.",
            "Editorial.",
            "Is SAM still alive? A bibliometric and interpretive mapping of the strategic alignment research field.",
            "Does mutuality matter? Examining the bilateral nature and effects of CEO-CIO mutual understanding.",
            "Social media management strategies for organizational impression management and their effect on public perception.",
            "Social media network behavior: A study of user passion and affect.",
            "Open source project success: Resource access, flow, and integration.",
            "Expectable use: An important facet of IT usage.",
            "Creating agile organizations through IT: The influence of internal IT service perceptions on IT service quality and IT agility.",
            "A commentary on: \"Creating agile organizations through IT: The influence of IT service climate on IT service quality and IT agility\".",
            "\"Cargo Cult\" science in traditional organization and information systems survey research: A case for using nontraditional methods of data collection, including Mechanical Turk and online panels.",
            "Editorial.",
            "The effects of collecting and connecting activities on knowledge creation in organizations.",
            "Do shareholders favor business analytics announcements?",
            "A communicative-tension model of change-induced collective voluntary turnover in IT.",
            "Governing innovation in U.S. state government: An ecosystem perspective."
        ]
    },
    {
        "name": "JSIS",
        "year": "2015",
        "info": "Volume 24: 2015",
        "count": 22,
        "papers": [
            "Editorial.",
            "Strategic opportunities (and challenges) of algorithmic decision-making: A call for action on the long-term societal effects of 'datification'.",
            "Strategies and symbolism in the adoption of organizational social networking systems.",
            "Handle with care: How online social network providers' privacy policies impact users' information sharing behavior.",
            "Editorial.",
            "Communicational ambidexterity as a new capability to manage social media communication within organizations.",
            "Linking dimensions of social media use to job performance: The role of social capital.",
            "What's in IT for employees? Understanding the relationship between use and performance in enterprise social software.",
            "Business value of social media technologies: Evidence from online user innovation communities.",
            "Design for social media engagement: Insights from elderly care assistance.",
            "Editorial.",
            "Reflections on societal and business model transformation arising from digitization and big data analytics: A research agenda.",
            "Academic agility in digital innovation research: The case of mobile ICT publications within information systems 2000-2014.",
            "The interplay between evidence and judgment in the IT project prioritization process.",
            "The tension between business process modelling and flexibility: Revealing multiple dimensions with a sociomaterial approach.",
            "Strategic innovation through outsourcing: The role of relational and contractual governance.",
            "Editorial.",
            "Resistance to crowdfunding among entrepreneurs: An impression management perspective.",
            "Managing potentially disruptive innovations in software companies: Transforming from On-premises to the On-demand.",
            "Editorial: Understanding strategic innovation in IT and business process outsourcing.",
            "Exploring and managing the \"innovation through outsourcing\" paradox.",
            "Social innovations in outsourcing: An empirical investigation of impact sourcing companies in India."
        ]
    },
    {
        "name": "JSIS",
        "year": "2014",
        "info": "Volume 23: 2014",
        "count": 22,
        "papers": [
            "Information systems strategy as practice: Micro strategy and strategizing for IS.",
            "Information systems strategizing, organizational sub-communities, and the emergence of a sustainability strategy.",
            "Site-shifting as the source of ambidexterity: Empirical insights from the field of ticketing.",
            "Information systems use as strategy practice: A multi-dimensional view of strategic information system implementation and use.",
            "A strategic activity model of Enterprise System implementation and use: Scaffolding fluidity.",
            "Information Systems Strategy and Strategy-as-Practice: A joint agenda.",
            "Editorial.",
            "A dynamic capabilities perspective of IS project portfolio management.",
            "Integrating the IS functions after mergers and acquisitions: Analyzing business-IT alignment.",
            "Incorporating trust-in-technology into Expectation Disconfirmation Theory.",
            "A strategic path to study IT use through users' IT culture and IT needs: A mixed-method grounded theory.",
            "Case studies and generalization in information systems research: A critical realist perspective.",
            "Editorial.",
            "Organizational responsiveness to anti-offshoring institutional pressures.",
            "Forced coopetition in IT multi-sourcing.",
            "Beyond free software: An exploration of the business value of strategic open source.",
            "Retaining and attracting users in social networking services: An empirical investigation of cyber migration.",
            "Editorial.",
            "Implications for strategic IS research of the resource-based theory of the firm: A reflection.",
            "How information-sharing values influence the use of information systems: An investigation in the business intelligence systems context.",
            "Modern information technology in an old workforce: Toward a strategic research agenda.",
            "How anchoring and adjusting influence citizens' acceptance of video-mediated crime reporting: A narrative approach."
        ]
    },
    {
        "name": "JSIS",
        "year": "2013",
        "info": "Volume 22: 2013",
        "count": 24,
        "papers": [
            "Editorial.",
            "Moving closer to the fabric of organizing visions: The case of a trade show.",
            "The attraction of contributors in free and open source software projects.",
            "Service Management and Engineering in Information Systems Research.",
            "IT service climate, antecedents and IT service quality outcomes: Some initial evidence.",
            "Using enterprise architecture analysis and interview data to estimate service response time.",
            "The influence of SOA governance mechanisms on IT flexibility and service reuse.",
            "Action-embedded transformational leadership in self-managing global information systems development teams.",
            "From boundary spanning to creolization: A study of Chinese software and services outsourcing vendors.",
            "Explaining the adoption of grid computing: An integrated institutional theory and organizational capability approach.",
            "The influence of user affect in online information disclosure.",
            "The economic impact of cyber terrorism.",
            "Realizing the strategic potential of e-HRM.",
            "Analyzing the impact of HRIS implementations on HR personnel's job satisfaction and turnover intention.",
            "Identity ambiguity and the promises and practices of hybrid e-HRM project teams.",
            "Lost in translation? An actor-network approach to HRIS implementation.",
            "An institutional theory perspective on e-HRM's strategic potential in MNC subsidiaries.",
            "Envisioning E-HRM and strategic HR: Taking seriously identity, innovative practice, and service.",
            "Towards an information systems perspective and research agenda on crowdsourcing for innovation.",
            "Network ties and the success of open source software development.",
            "Mobility at work: A typology of mobile communities of practice and contextual ambidexterity.",
            "Achieving offshore software development success: An empirical analysis of risk mitigation through relational norms.",
            "Knowledge based transactions and decision framing in Information Technology Outsourcing.",
            "Corrigendum to \"Joint collaborative planning as a governance mechanism to strengthen the chain of IT value co-creation\" [J. Strategic Inf. Syst. 21(3) (2012) 182-200]."
        ]
    },
    {
        "name": "JSIS",
        "year": "2012",
        "info": "Volume 21: 2012",
        "count": 21,
        "papers": [
            "Knowledge risks in organizational networks: An exploratory framework.",
            "Knowledge risks in organizational networks: The practice perspective.",
            "Factors of stickiness in transfers of know-how between MNC units.",
            "Informing strategic IS change: Towards a 'meta-learning' framework.",
            "Client strategies in vendor transition: A threat balancing perspective.",
            "Strategic information systems: Reflections and prospectives.",
            "Ubiquitous IT: The case of the Boeing 787 and implications for strategic IT research.",
            "Strategizing information systems-enabled organizational transformation: A transdisciplinary review and new directions.",
            "Information systems strategy: Past, present, future?",
            "How does social software change knowledge management? Toward a strategic research agenda.",
            "Information systems strategy: Quo vadis?",
            "Where's the competitive advantage in strategic information systems research? Making the case for boundary-spanning research based on the German business and information systems engineering tradition.",
            "Joint collaborative planning as a governance mechanism to strengthen the chain of IT value co-creation.",
            "Firm orientation, community of practice, and Internet-enabled interfirm communication: Evidence from Chinese firms.",
            "'Orchestrating' sustainable crowdsourcing: A characterisation of solver brokerages.",
            "A multi-level investigation of information technology outsourcing.",
            "The coevolution of IT innovation and copyright institutions: The development of the mobile music business in Japan and Korea.",
            "Adoption of open source software in organizations: A socio-cognitive perspective.",
            "Strategies for software-based hybrid business models.",
            "Government policy, public value and IT outsourcing: The strategic case of ASPIRE.",
            "Information technology investment announcements and market value in transition economies: Evidence from Warsaw Stock Exchange."
        ]
    },
    {
        "name": "JSIS",
        "year": "2011",
        "info": "Volume 20: 2011",
        "count": 34,
        "papers": [
            "A warm welcome to Volume 20 of the Journal of Strategic Information Systems!",
            "The Greening of IT: Paradox or promise?",
            "Compliance with institutional imperatives on environmental sustainability: Building theory on the role of Green IS.",
            "Integrating the smartphone into a sound environmental information systems strategy: Principles, practices and a research agenda.",
            "Integrative framework for assessing firms' potential to undertake Green IT initiatives via virtualization - A theoretical perspective.",
            "Green projects: An information drives analysis of four cases.",
            "From green to sustainability: Information Technology and an integrated sustainability framework.",
            "Designing IT systems according to environmental settings: A strategic analysis framework.",
            "Information technology as a change actant in sustainability innovation: Insights from Uppsala.",
            "The PC (polluting computer): Forever a tragedy of the commons?",
            "A new departure.",
            "An assessment of the use of Transaction Cost Theory in information technology outsourcing.",
            "Beyond Transaction Cost Economics: Towards an endogenous theory of Information Technology Outsourcing.",
            "Special section on healthcare information systems.",
            "Building nation-wide information infrastructures in healthcare through modular implementation strategies.",
            "From cacophony to harmony: A case study about the IS implementation process as an opportunity for organizational transformation at Sentara Healthcare.",
            "Strategic alternatives in telecare design: Developing a value-configuration-based alignment framework.",
            "Strategic enterprise information systems for global supply chain competitiveness.",
            "Disintermediation of traditional chemical intermediary roles in the Electronic Business-to-Business (e-B2B) exchange world.",
            "Information technology, operational, and management competencies for supply chain agility: Findings from case studies.",
            "B2B integration in global supply chains: An identification of technical integration scenarios.",
            "Modeling the information completeness of object tracking systems.",
            "Knowledge management in supply chain: An empirical study from France.",
            "Improving inventory effectiveness in RFID-enabled global supply chain with Grey forecasting model.",
            "Alignment within the software development unit: Assessing structural and relational dimensions between developers and testers.",
            "Barriers to knowledge sharing and stakeholder alignment in solar energy clusters: Learning from other sectors and regions.",
            "Inscription of behaviour and flexible interpretation in Information Infrastructures: The case of European e-Customs.",
            "Value conflicts for information security management.",
            "Drivers, barriers and critical success factors for ERPII implementation in supply chains: A critical analysis.",
            "Firm-level benefits of IT-enabled resources: A conceptual extension and an empirical assessment.",
            "An empirical investigation of the relationship of IS strategy with firm performance.",
            "Intentionality and power interplay in IS implementation: The case of an asset management firm.",
            "Computer skills, non-routine tasks, and wage premium: A longitudinal study.",
            "Maximizing the positive influence of IT for improving organizational performance."
        ]
    },
    {
        "name": "JSIS",
        "year": "2010",
        "info": "Volume 19: 2010",
        "count": 24,
        "papers": [
            "JSIS Editorial March 2010.",
            "Strategic information systems research: An archival analysis.",
            "Consultancies and capabilities in innovating with IT.",
            "Developing dynamic capabilities in electronic marketplaces: A cross-case study.",
            "Rethinking IS project boundaries in practice: A multiple-projects perspective.",
            "Information systems in the public sector: The e-Government enactment framework.",
            "Editorial.",
            "Globalization, culture, and information: Towards global knowledge transparency.",
            "Impacts of internal and interorganizational information systems on the outsourcing of manufacturing.",
            "The strategic value of IT insourcing: An IT-enabled business process perspective.",
            "Does IT outsourcing deliver economic value to firms?",
            "Information technology outsourcing through a configurational lens.",
            "Editorial.",
            "Of managers, ideas and jesters, and the role of information technology.",
            "An examination of the antecedents and consequences of organizational IT innovation in hospitals.",
            "Paradoxical effects of institutionalisation on the strategic awareness of technology in organisations.",
            "An empirical investigation of employee portal success.",
            "Organizational impact of system quality, information quality, and service quality.",
            "Opening up design science: The challenge of designing for reuse and joint development.",
            "Strategy, networks and systems in the global translation services market.",
            "Managing culture creep: Toward a strategic model of user IT culture.",
            "Metrics for characterizing the form of security policies.",
            "Knowledge Management Competence for Enterprise System Success.",
            "Facts, myths and thought-styles... and a rallying cry for civic engagement."
        ]
    },
    {
        "name": "JSIS",
        "year": "2009",
        "info": "Volume 18: 2009",
        "count": 16,
        "papers": [
            "JSIS Editorial March 2009.",
            "The defensive use of IT in a newly vulnerable market: The New York Stock Exchange, 1980-2007.",
            "The moderating effect of the business strategic orientation on eCommerce adoption: Evidence from UK family run SMEs.",
            "Competitive advantage from mandatory investments: An empirical study of Australian firms.",
            "Disruptive technology: How Kodak missed the digital photography revolution.",
            "Click trading: A case study of Moneynet.",
            "Effects of information technology failures on the market value of firms.",
            "The role of IT in crisis response: Lessons from the SARS and Asian Tsunami disasters.",
            "The role of IS capabilities in delivering sustainable improvements to competitive positioning.",
            "Individualist and collectivist perspectives on knowledge in organizations: Implications for information systems research.",
            "A review of the IT outsourcing literature: Insights for practice.",
            "Use of collaborative technologies and knowledge sharing in co-located and distributed teams: Towards the 24-h knowledge factory.",
            "JSIS editorial December 2009.",
            "Alleviating piracy through open source strategy: An exploratory study of business software firms in China.",
            "Managing sustainability with the support of business intelligence: Integrating socio-environmental indicators and organisational context.",
            "Applying Stabell and Fjeldstad's value configurations to E-commerce: A cross-case analysis of UK comparison websites."
        ]
    },
    {
        "name": "JSIS",
        "year": "2008",
        "info": "Volume 17: 2008",
        "count": 19,
        "papers": [
            "Editorial.",
            "The quality of group tacit knowledge.",
            "Architectural knowledge in inter-organizational IT innovation.",
            "Why do we trust new technology? A study of initial trust formation with organizational information systems.",
            "eGovernment Strategies: ICT innovation in international public sector contexts.",
            "Making e-Government systems workable: Exploring the evolution of frames.",
            "Investigating organizational learning in eGovernment projects: A multi-theoretic approach.",
            "User engagement in e-government systems implementation: A comparative case study of two Singaporean e-government initiatives.",
            "Adoption of ICT in a government organization in a developing country: An empirical study.",
            "Learning lessons from evaluating eGovernment: Reflective case experiences that support transformational government.",
            "Trust and risk in e-government adoption.",
            "JSIS editorial Fall 2008 issue.",
            "Capital One Financial and a decade of experience with newly vulnerable markets: Some propositions concerning the competitive advantage of new entrants.",
            "Managing stakeholders around inter-organizational systems: A diagnostic approach.",
            "Experience-based learning of Japanese IT professionals: A qualitative research.",
            "Internet privacy concerns and beliefs about government surveillance - An empirical investigation.",
            "Snow, buses, and mobile data services in the information age.",
            "Designing a core IT artefact for Knowledge Management Systems using participatory action research in a government and a non-government organisation.",
            "Control, trust, power, and the dynamics of information system outsourcing relationships: A process study of contractual software development."
        ]
    },
    {
        "name": "JSIS",
        "year": "2007",
        "info": "Volume 16: 2007",
        "count": 22,
        "papers": [
            "Editorial.",
            "An examination of the trade-off between internal and external IT capabilities.",
            "Global software development: Exploring socialization and face-to-face meetings in distributed strategic projects.",
            "ERP systems as an enabler of sustained business process innovation: A knowledge-based view.",
            "The adoption of consortium B2B e-marketplaces: An exploratory study.",
            "Strategic information systems planning: A case study from the financial services industry.",
            "Editorial: JSIS Security and Privacy Special Issue.",
            "Danger is in the eye of the beholders: Social representations of Information Systems security in healthcare.",
            "The role of external and internal influences on information systems security - a neo-institutional perspective.",
            "Preventing application software piracy: An empirical investigation of technical copy protections.",
            "Conflicts between privacy and property: The discourse in personal and organizational knowledge.",
            "RFID, privacy and the perception of risk: A strategic framework.",
            "Editorial.",
            "The open source software phenomenon: Characteristics that promote research.",
            "Mobilizing software expertise in personal knowledge exchanges.",
            "Does IT pay to focus? An analysis of IT business value under single and multi-focused business strategies.",
            "Why build a customer relationship management capability?",
            "JSIS editorial December 2007 issue.",
            "A study of subsidiaries' views of information systems strategic planning in multinational organisations.",
            "Understanding the influence of information systems competencies on process innovation: A resource-based view.",
            "Understanding user behavior with new mobile applications.",
            "Exploring consumer adoption of mobile payments - A qualitative study."
        ]
    },
    {
        "name": "JSIS",
        "year": "2006",
        "info": "Volume 15: 2006",
        "count": 18,
        "papers": [
            "Editorial.",
            "Post-merger IT integration strategies: An IT alignment perspective.",
            "Resource-based view and competitive strategy: An integrated model of the contribution of information technology to firm performance.",
            "Automotive e-hubs: Exploring motivations and barriers to collaboration and interaction.",
            "Editorial.",
            "Requirements determination for common systems: turning a global vision into a local reality.",
            "Technology-push and communication-pull forces driving message-based coordination performance.",
            "Innovative IT climates: CIO perspectives.",
            "Value creation in web services: An integrative model.",
            "Editorial.",
            "A standards war waged by a developing country: Understanding international standard setting from the actor-network perspective.",
            "Information systems and evidence-based policy in multi-agency networks: The micro-politics of situated innovation.",
            "Measuring switching costs in IT outsourcing services.",
            "The transformational dimension in the realization of business value from information technology.",
            "Editorial.",
            "Strategic benefits to SMEs from third party web services: An action research analysis.",
            "Information systems assimilation in Indian organizations: An examination of strategic and organizational imperatives.",
            "IT valuation in turbulent times."
        ]
    },
    {
        "name": "JSIS",
        "year": "2005",
        "info": "Volume 14: 2005",
        "count": 22,
        "papers": [
            "Editorial.",
            "Development, global futures and IS research: a polemic.",
            "Power, politics and persuasion in IS evaluation: a focus on 'relevant social groups'.",
            "Strategic risk positioning as sensemaking in crisis: the adoption of electronic trading at the London international financial futures and options exchange.",
            "A resource-based view of competitive advantage at the Port of Singapore.",
            "R. Magalhaes, , Organizational Knowledge Systems: An Action-oriented Perspective on Organization and Information Systems (2004) Edward Elgar Publishing, Cheltenham, UK 272 pages, ISBN 1-84376-282-X (£65.00).",
            "Special Issue Part II: understanding the contextual influences on enterprise system design, implementation, use and evaluation.",
            "A framework for addressing the organisational issues of enterprise systems implementation.",
            "Global-local negotiations for implementing configurable packages: The power of initial organizational decisions.",
            "Mandates and technology acceptance: A tale of two enterprise technologies.",
            "On the interpretative flexibility of hosted ERP systems.",
            "From means to ends: The transformation of ERP in a manufacturing company.",
            "The dynamics of contextual forces of ERP implementation.",
            "Personal innovativeness, social influences and adoption of wireless Internet services via mobile technology.",
            "Strategic implications of mobile technology: A case study using Value-Focused Thinking.",
            "Mobile music business in Japan and Korea: Copyright management institutions as a reverse salient.",
            "Modelling corporate wireless security and privacy.",
            "The role of standards in innovation and diffusion of broadband mobile services: The case of South Korea.",
            "Editorial.",
            "IT outsourcing configuration: Research into defining and designing outsourcing arrangements.",
            "Determinants of IS sourcing decisions: A comparative study of transaction cost theory versus the resource-based view.",
            "Adoption of electronic government services among business organizations in Singapore."
        ]
    },
    {
        "name": "JSIS",
        "year": "2004",
        "info": "Volume 13: 2004",
        "count": 22,
        "papers": [
            "Editorial.",
            "Information technology and the transformation of industries: three research perspectives.",
            "IS-enabled sustainable competitive advantage in financial services, retailing and manufacturing.",
            "The relationships among management accounting information, organizational learning and production performance.",
            "Strategic Information Systems in the Post-Net Era.",
            "Strategies for value creation in electronic markets: towards a framework for managing evolutionary change.",
            "Enterprise strategy management systems: current and next generation.",
            "Seeking strategic advantage in the post-net era: viewing ERP systems from the resource-based perspective.",
            "Proprietary versus internet technologies and the adoption and impact of electronic marketplaces.",
            "Beyond strategic information systems: towards an IS capability.",
            "Erratum to \"Leveraging IT resources and capabilities at the housing and development board\" [J. Strategic Inf. Syst. 12(2003) 229-249].",
            "Editorial.",
            "Knowledge strategy in organizations: refining the model of Hansen, Nohria and Tierney.",
            "Using and validating the strategic alignment model.",
            "De-escalation of commitment to information systems projects: a process perspective.",
            "Understanding the contextual influences on enterprise system design, implementation, use and evaluation.",
            "Enterprise systems, knowledge transfer and power users.",
            "'Best' for whom?: the tension between 'best practice' ERP packages and diverse epistemic cultures in a university context.",
            "An exploration of enterprise technology selection and evaluation.",
            "Dominant actors, political agendas, and strategic shifts over time: a critical ethnography of an enterprise systems implementation.",
            "An institutional perspective on sources of ERP package-organisation misalignments.",
            "Coping with ERP-related contextual issues in SMEs: a vendor's perspective."
        ]
    },
    {
        "name": "JSIS",
        "year": "2003",
        "info": "Volume 12: 2003",
        "count": 27,
        "papers": [
            "Editorial.",
            "Determinants of a sustainable competitive advantage due to an IT-enabled strategy.",
            "The diffusion of information systems development methods.",
            "A conceptual model of an interorganizational intelligent meeting-scheduler (IIMS).",
            "Bridging communities of practice with information technology in pursuit of global knowledge sharing.",
            "Editorial.",
            "Creating social and intellectual capital through IT career transitions.",
            "The IT contribution in developing a transnational capability at Electrolux.",
            "An extended platform logic perspective of IT governance: managing perceptions and activities of IT.",
            "A computer called LEO: Georgina Ferry; 4th Estate, London, 2003, 221 pages, hardback, ISBN 1-84115-185 (£15.99).",
            "Technology fears: distrust and cultural persistence in electronic marketplace adoption.",
            "Strategic information systems planning: too little or too much?",
            "Leveraging IT resources and capabilities at the housing and development board.",
            "Redesigning Human Systems: Enid Mumford; Information Science Publishing, Hershey, PA, 2003, 303 pages, ISBN 1-59140-118-6 (US$79.95).",
            "Preface.",
            "The LEO principle: perspectives on 50 years of business computing.",
            "LEO and the computer revolution.",
            "Business computing 2001 - the state of the art.",
            "50 Years of business computing: LEO to Linux.",
            "Conference sponsors' panel: what have we learnt in 50 years?",
            "Panel: social and economic consequences of business computing and public policy.",
            "Knowledge and digital information.",
            "Panel: crystal ball, 2001-2051.",
            "Looking forward fifty years - the NCC prize papers.",
            "The world and business computing in 2051: from LEO to RUR?",
            "The world and business computing in 2051.",
            "The world and business computing at mid-century."
        ]
    },
    {
        "name": "JSIS",
        "year": "2002",
        "info": "Volume 11: 2002",
        "count": 17,
        "papers": [
            "Editorial.",
            "Strategic use of the Internet and e-commerce: Cisco Systems.",
            "The regulation of electronic commerce: learning from the UK's RIP act.",
            "The role of software patents in sustaining IT-enabled competitive advantage: a call for research.",
            "Editorial.",
            "The communal resource and information systems.",
            "IT alignment and firm performance in small manufacturing firms.",
            "PUZZLE: a concept and prototype for linking business intelligence to business strategy.",
            "Exploring ASP as sourcing strategy: theoretical perspectives, propositions for practice.",
            "M. Khosrowpour, Success and Pitfalls of Information Technology Management, Idea Group Publishing, Hershey, PA, 1999, ISBN 1-878289-56-X, US$ 165 (Book 1); M. Khosrowpour, Organizational Achievement and Failure in Information Technology Management, Idea Group Publishing, Hershey, PA, 2000, ISBN 1-878289-83-7, US$ 165 (Book 2); M. Khosrowpour, Pitfalls and Triumphs of Information Technology Management, Idea Group Publishing, Hershey, PA, 2001, ISBN 1-878289-61-6, US$ 165 (Book 3).",
            "JSIS Editorial - Special Issue on \"Trust in the Digital Economy\".",
            "Dynamic nature of trust in virtual teams.",
            "Institution-based trust in interorganizational exchange relationships: the role of online B2B marketplaces on trust formation.",
            "Trustworthiness in electronic commerce: the role of privacy, security, and site attributes.",
            "Some antecedents and effects of trust in virtual communities.",
            "The impact of initial consumer trust on intentions to transact with a web site: a trust building model.",
            "Online trust: a stakeholder perspective, concepts, implications, and future directions."
        ]
    },
    {
        "name": "JSIS",
        "year": "2001",
        "info": "Volume 10: 2001",
        "count": 19,
        "papers": [
            "JSIS Editorial Vol 10 No 1.",
            "How CIOs obtain peer commitment to strategic IS proposals: barriers and facilitators.",
            "An empirical study of misalignment between Australian CEOs and IT managers.",
            "Relating IT strategy and organizational culture: an empirical study of public sector units in India.",
            "Competing with CRS-generated information in the airline industry.",
            "Editorial.",
            "An information technology trilogy: business strategy, technological deployment and organizational performance.",
            "Information technology, strategic decision making approaches and organizational performance in different industrial settings.",
            "The development and exercise of power by leaders of support units in implementing information technology-based services.",
            "An empirical model of IT usage in the Malaysian public sector.",
            "Editorial.",
            "Leveraging geographic and information technology scope for superior performance: an exploratory study in international banking.",
            "Sustaining strategic IT advantage in the information age: how strategy paradigms differ by speed.",
            "Receptivity of Singapore's SMEs to electronic commerce adoption.",
            "Analysts and clients in organisational contexts: a conversational perspective.",
            "Information management (IM) strategy: the construct and its measurement.",
            "Managerial information system success factors within the cultural context of North America and a former Soviet Republic.",
            "Building outsourcing relationships across the global community: the UPS-Motorola experience.",
            "B2B e-Commerce in emerging economies: i-metal.com's non-ferrous metals exchange in China."
        ]
    },
    {
        "name": "JSIS",
        "year": "2000",
        "info": "Volume 9: 2000",
        "count": 18,
        "papers": [
            "Editorial.",
            "Viewpoint: The Risk of Information Compromise and Approaches to Prevention.",
            "A methodology of constructing a decision path for IT investment.",
            "Managing information technology investments using a real-options approach.",
            "Information systems strategy for small and medium sized enterprises: an organisational perspective.",
            "Information technology management: the case of the Port of Singapore Authority.",
            "Editorial.",
            "The role of AI-based technology in support of the knowledge management value activity cycle.",
            "The use of collaborative electronic media for information sharing: an exploratory study of determinants.",
            "\"It is what one does\": why people participate and help others in electronic communities of practice.",
            "The effects of knowledge management systems on emergent teams: towards a research model.",
            "Knowledge management technology and the reproduction of knowledge work practices.",
            "Individual and collective congruence in the knowledge management process.",
            "An investigation of factors that influence the management of knowledge in organizations.",
            "Editorial.",
            "The effect of strategic alignment on the use of IS-based resources for competitive advantage.",
            "The need for a processual view of inter-organizational systems adoption.",
            "Exploring information technology outsourcing relationships: theory and practice."
        ]
    },
    {
        "name": "JSIS",
        "year": "1999",
        "info": "Volume 8: 1999",
        "count": 33,
        "papers": [
            "Editorial.",
            "Learning from singularities: the example of the Asian Financial Crisis: Information technology in the Asia-Pacific: implications of the financial crisis.",
            "Development of IT in Japan amid financial difficulties.",
            "IT spending in the midst of the Asian economic downturn: a Singapore perspective.",
            "Can Australia capitalise on the post-crisis opportunity?",
            "'Mind the Gap': diagnosing the relationship between the IT organisation and the rest of the business.",
            "From reengineering to electronic commerce: old questions, new challenges.",
            "Process integration through information technology at the Générale de Banque of Belgium.",
            "IT-enabled organizational transformation: a case study of BPR failure at TELECO.",
            "Virtual partnerships in support of electronic commerce: the case of TCIS.",
            "JSIS 8(2).",
            "Drivers and tracers of business process changes.",
            "Making sense of telebanking information systems: the role of organizational back ups.",
            "Strategic context and patterns of IT infrastructure capability.",
            "Moving IS evaluation forward: learning themes and research issues.",
            "Developing managerial skills in IT organizations - a case study based on action learning.",
            "Towards the integration of e-business, knowledge management and policy considerations within an information systems strategy framework.",
            "Integrating market, technology, and policy opportunities in e-business strategy.",
            "International NGOs: networking, information flows and learning.",
            "The relative success of alternative approaches to strategic information systems planning: an empirical analysis.",
            "Risk mitigation in IT outsourcing strategy revisited: longitudinal case research at LISA.",
            "Achieving the Promise of Information Technology: Introducing the Transformational Project Paradigm R. Sackman (Ed.); PMI Publishing, 1998, 194 pages, ISBN 1-880410-03-6, US$ 39.95.",
            "Strategic Management and Information Systems, 2nd ed. W. Robson (Ed.); Pitman Publishing, 1997, 575 pages, ISBN 0273-61591-2, £23.99.",
            "Strategic Information Management: Challenges and Strategies in Managing Information Systems, 2nd ed. R. Galliers, D. Leidner, B. Baker (Eds.); Butterworth-Heinemann, 1999, 590 pages, ISBN 0-7506-3975 X, £22.50.",
            "The 6th European Conference on IT Evaluation: Brunel University, 4-5 November 1999.",
            "Editorial.",
            "Between transient constructs and persistent structures: designing systems in action.",
            "Unpacking the systems development process: an empirical application of the CSF concept in a research context.",
            "An integrated approach toward strategic information systems planning.",
            "When success turns into failure: a package-driven business process re-engineering project in the financial services industry.",
            "The paradox of information systems: strategic value and low status.",
            "The Creative Age, Demos: K. Seltzer, T. Bentley; 1999, 91 pages, ISBN 1-898-30970-1.",
            "The New Barbarian Manifesto: Ian Angell, Kogan Page, 2000, ISBN 0-7494-3151-2."
        ]
    },
    {
        "name": "JSIS",
        "year": "1998",
        "info": "Volume 7: 1998",
        "count": 19,
        "papers": [
            "Editorial.",
            "Crisis and foundations: an inquiry into the nature and limits of models and methods in the information systems discipline.",
            "An exploratory study in investigating transnational information systems.",
            "Strategic use of EDI in the public sector: the HMSO case study.",
            "A classification of success factors for decision support systems.",
            "Women computer professionals: Progress and resistance: Rosemary Wright, The Edwin Mellen Press, Lewiston, NY, July 1997, 250 pp., £49.95. ISBN 0-7734-2244-7 (hardback).",
            "Management, information and power: A narrative of the involved manager: Lucas Introna, Macmillan, London, 1997, ISBN 0333698703.",
            "An examination of the role of the information systems centre.",
            "An information systems view of Chinese state enterprises.",
            "The role of appropriability in sustaining competitive advantage - an electronic auction system case study.",
            "Virtual organizing as a strategy for the \"Big Six\" to stay competitive in a global market.",
            "The strategic impact of IT on the retail financial services industry.",
            "Financial securities transactions: a study of logistic process performance improvements.",
            "Global strategies to overcome the spiral of decline in universal bank markets.",
            "Information gathering problems in multinational banking.",
            "Problems, knowledge, solutions: solving complex problems.",
            "Problems, knowledge, solutions: solving complex problems - a response to Enid Mumford's paper ICIS 1998, Helsinki, Finland.",
            "Contours of diffusion of electronic data interchange in Finland: Overcoming technological barriers and collaborating to make it happen.",
            "A cross-national comparison of the adoption of business process reengineering: fashion-setting networks?"
        ]
    },
    {
        "name": "JSIS",
        "year": "1997",
        "info": "Volume 6: 1997",
        "count": 19,
        "papers": [
            "Exploring the use of electronic messaging infrastructure: the case of a telecommunications firm.",
            "Understanding user perceptions of information systems success.",
            "The challenges of strategic data planning in practice: an interpretive case study.",
            "Editorial.",
            "A strategic client/server implementation: new technology, lessons from history.",
            "Assessment of information strategies in insurance companies in the Netherlands.",
            "Tel Aviv City hall - The computerization revolution.",
            "Editorial.",
            "Information systems management issues in Central America: a multinational and comparative study.",
            "Information systems outsourcing strategies for affiliated firms of the Korean conglomerate groups.",
            "Interorganisational information systems: issues affecting interorganisational cooperation.",
            "EDI in the Scottish Health Service: inter-organisational systems and inter-organisational change.",
            "Information management: the organizational dimension: Michael J Earl (Ed.) Oxford University Press, 1996 ISBN 0-19-825760-0.",
            "Editorial.",
            "Assessing realized information systems strategy.",
            "Embryonic approach to the development of information systems.",
            "Differences in national information infrastructures: the reflection of national cultures.",
            "Business process redesign at CompuNet - standardizing top-quality service through IT.",
            "Information systems: An emerging discipline?: John Mingers and Frank Stowell (Eds.). McGraw-Hill, Maidenhead, 387 pages, ISBN 0077092953."
        ]
    },
    {
        "name": "JSIS",
        "year": "1996",
        "info": "Volume 5: 1996",
        "count": 26,
        "papers": [
            "Editorial.",
            "The new alchemist: or how to transmute base organizations into corporations of gleaming gold.",
            "Role of national culture in the transfer of information technology.",
            "Reconciling the IT/business relationship: a troubled marriage in need of guidance.",
            "The role of information technology in retailing: the case of supporting fashion purchasing at a European department store chain.",
            "Self-producing systems: implications and applications of autopoiesis: Plenum Press, New York, 1995, 246, pages $59.60. ISBN 0 306 44797 5.",
            "Information Management: The Evaluation of Information Systems Investments: Chapman and Hall, London, 1994, 272 pages. ISBN 0 412 41540 2.",
            "Editorial.",
            "The practice of information strategy in six information intensive organizations in The Netherlands.",
            "Organisational learning and core capabilities development: the role of IT.",
            "Multinational corporations - the emerging research agenda.",
            "Government regulation through voluntary cooperation: a follow-up study of the strategic impact of information technology.",
            "Competing through information technology: Strategy and implementation: Prentice Hall, 1995, 298 pages. ISBN 0-13-295304-8.",
            "User driven innovation - the world's first business computer: McGraw-Hill, 1996, 416 pages, £35. ISBN 0-07-709236-8.",
            "Editorial.",
            "From efficiency to flexibility: the strategic use of information in the airline industry.",
            "Integrating information technology divisions in a bank merger Fit, compatibility and models of change.",
            "The New Branch Columbus project at Royal Bank of Scotland: the implementation of large-scale business process re-engineering.",
            "Toward a theory of strategic information systems planning.",
            "Editorial.",
            "Toward more effective management of information technology benefits.",
            "Modeling the relative importance of ethical behavior criteria: a simulation of information systems professionals' ethical decisions.",
            "Banking 2000? Reengineering at the First National Bank of Southern Africa to create a branch of the future.",
            "The impact of electronic markets: the case of the Dutch Flower Auctions.",
            "Competitive advantage through information technology: McGraw-Hill International Editions, 1996, 372 pp, NZ$80.95. ISBN 0 07 114106 5.",
            "Effective project management: Wiley, 1995, 333 pp. ISBN 0-471-11521-5."
        ]
    },
    {
        "name": "JSIS",
        "year": "1995",
        "info": "Volume 4: 1995",
        "count": 30,
        "papers": [
            "Editorial.",
            "Reconsidering reengineering: Keynote Talk at the IFIP TC-8 Joint Meeting, Bond University, Gold Coast, Australia, May 1994.",
            "Factors contributing to the success of customer oriented interorganizational systems.",
            "Networks of collaboration or conflict? Electronic data interchange and power in the supply chain.",
            "Organizational innovativeness, competitive strategy and investment success.",
            "The role of feedback in assessing information systems planning effectiveness.",
            "Information technology enables business process reengineering at YCH DistriPark (Singapore).",
            "Linking information technology to business strategy at Banco Comercial Português.",
            "Editorial.",
            "Cooperative supply chain management: the impact of interorganizational information systems.",
            "The importance of relationship management in establishing successful interorganizational systems.",
            "Transforming the organization: the contribution of the information systems function.",
            "Benchmarking as a strategy for managing conflicting stakeholder perceptions of information systems.",
            "Restructuring the Information Systems Department at M-Net and Multichoice: A major restructure of an IS department.",
            "LEO: The First Business Computer: Hasler Publishing, Wokingham (1994) 272 pp ISBN 0 9521651 0 4.",
            "The Japanese advantage? competitive IT strategies past, present and future: Butterworth-Heinemann Oxford (1985) 246 pp £25.00.",
            "Editorial.",
            "Executive access to information systems in Australian public organizations.",
            "ITEM: a strategic approach to information systems in voluntary organizations.",
            "Implementation strategies for office systems.",
            "An evaluation of an innovative information technology - the case of Carrier EXPERT.",
            "IT-enabled business process reengineering: organizational and human resource dimensions.",
            "How to assess your IT investment: A study of methods and practice: B Farbey, F Land and D Targett Butterworth-Heinemann (1993) 158 pp £19.99 ISBN 0 7506 0654 1.",
            "Measuring the value of information technology: J Hares and D Royle Wiley Chichester (1994) 268 pp £24.95 ISBN 0 4719 4307 X.",
            "Expertise and innovation: Information technology strategies in the financial services sector: R Fincham, J Fleck, R Proctor, H Scarbrough, M Tierney and R Williams Oxford University Press (1994) 334 pp £35.00 ISBN 0 19 828904 9.",
            "Editorial.",
            "Career orientations of information systems employees in South Africa.",
            "Information flows amongst executives: their implications for systems development.",
            "Information strategy: alignment with organization structure.",
            "Why Information Systems Fail: A Case Study Approach: McGraw-Hill London (1993) 369 pp ISBN 1 872474 08 X."
        ]
    },
    {
        "name": "JSIS",
        "year": "1994",
        "info": "Volume 3: 1994",
        "count": 36,
        "papers": [
            "Editorial.",
            "The new and the old of business process redesign.",
            "A methodology for business process redesign: experiences and issues.",
            "A model of EDI integration and strategic business reengineering.",
            "An exploratory econometric analysis of shared electronic banking network adoption.",
            "Fuzzy logic: Daniel McNeill and Paul Freiberg Simon and Schuster, New York (1993) 319 pp $22.00 ISBN 0 671 73843 7.",
            "Editorial.",
            "Organizational practice, information resource deployment and systems success: a cross-cultural survey.",
            "Government regulation through voluntary cooperation: the strategic impact of information technology.",
            "Information technology and information systems perspectives on business strategies.",
            "DHL goes 'open'.",
            "Hard drive: Bill Gates and the making of the Microsoft empire: James Wallace and Jim Erickson John Wiley, New York (1992) 432 pp £16.95 ISBN 0 471 56886 4.",
            "Paradigm shirt: the new promise of information technology: Dan Tapscott and Art Caston McGraw-Hill New York (1993) 337 pp $24.95 ISBN 0 07 062857 2.",
            "Quality software management, volume 2: First-order measurement: Gerald M Weinberg Dorset House Publishing New York (1993) 346 pp $32.50 ISBN 0 932633 22 6.",
            "Strategic information technology management: Perspectives on organizational growth and competitive advantage: Rajiv D Banker, Robert J Kauffman and Mo Adam Mahmood (eds) Idea Group Publishing Harrisburg PA (1993) 704 pp $84.95 (+ $12 shipping to UK) ISBN 1 878289 16 0.",
            "Information in the enterprise: It's more than technology: G Darnton and S Giacoletto Digital Press/Prentice-Hall Hemel Hempstead (1992) 318 pp £27.50 ISBN 0 13 1761763 0.",
            "Decision support and executive information systems: Paul Gray (ed) Prentice-Hall International Englewood Cliffs NJ (1994) 469 pp $22.95 ISBN 0 13 291253 8.",
            "Expert systems in business and finance: Paul R Watkins and Lance B Eliot (eds) Wiley New York (1993) 367 pp $24.95 ISBN 0 471 91967 5.",
            "Managing expert systems: Ephraim Turban and Jay Liebowitz Idea Group Publishing Harrisburg PA (1992) 484 pp, $53.50 ISBN 1 878289 11 X.",
            "Editorial.",
            "An organizational learning perspective on information systems planning.",
            "Measuring the strategic dimensions of the quality of information.",
            "To join or not to join: a framework for evaluating electronic data interchange systems.",
            "Electronic data interchange in international trade: frameworks for the strategic analysis of ocean port communities.",
            "Case study editorial.",
            "RyderFIRST: facilitating a turnaround in ryder system's consumer truck rental division.",
            "Complete systems analysis: The workbook, the textbook, the answers: James and Susan Robertson Dorset House New York (1994) 2 Vols 592 pp $74.75 ISBN 0 932633 25 0.",
            "Strategic information systems: Seev Neumann Macmillan College Publishing New York (1994) 258 pp ISBN 0 02 386690 X.",
            "Editorial.",
            "Strategic users of information technology: a longitudinal analysis of organizational strategy and performance.",
            "Computer support for strategic organizational decision-making.",
            "A window on information systems technology in China.",
            "New treatments or old remedies: is business process reengineering really socio-technical design?",
            "IT supports business strategy growth at the development bank of Singapore.",
            "Reengineering the corporation: A manifesto for business revolution: Michael Hammer and James Champy HarperCollins Publishers USA published in UK by Nicholas Brealey Publishing London (1993) 216 pp.",
            "Strategic information systems: A European perspective: Claudio Ciborra and Tawfik Jelassi (Eds) John Wiley New York (1994) 242pp ISBN 0 471 94107 7."
        ]
    },
    {
        "name": "JSIS",
        "year": "1993",
        "info": "Volume 2: 1993",
        "count": 27,
        "papers": [
            "Editorial.",
            "'Though this be madness, yet there is method in't'.",
            "A strategy for identifying 'excellent' systems analysts.",
            "Does the reporting level of the information systems executive make a difference?",
            "High tech or high touch? Efficient channel strategies for delivering financial services.",
            "Case study editorial.",
            "The strategic intent of on-line trading systems: a case study in national livestock marketing.",
            "Case study: Integrating global commercial operations with information technology at BP Chemicals.",
            "Editorial.",
            "Strategic information systems - a conceptual analysis.",
            "The strategic positioning of information systems in post-acquisition management.",
            "Strategic information systems research: a review and research framework.",
            "Key information technology issues in Estonia.",
            "Information systems personnel as expatriates: a review of the literature and identification of issues.",
            "Editorial.",
            "Information technology and new organizational forms: destination but no road map?",
            "Telecommuting as a workplace alternative: an identification of significant factors in American firms' determination of work-at-home policies.",
            "Market as opportunity? Case studies in outsourcing information technology and services.",
            "The impact of EDI on the components sector of the Australian automotive industry.",
            "Successful use of information technology in a small tourism enterprise: the case of Country Holidays.",
            "IT strategies: beyond competitive advantage.",
            "A survey of the use of strategic information systems planning approaches in UK organizations.",
            "Causality in the alignment of information technology and business strategy.",
            "Success measures for information systems strategic planning.",
            "IT2000: A critical appraisal of Singapore's state-wide strategic planning process for information technology.",
            "The virtual corporation: William H. Davidow and Michael S. Malone Harper Collins, New York, 1993 294 pp, $23.00 ISBN 0-88730-593-8.",
            "Artificial life: The quest for a new creation: Steven Levy Pantheon Books, New York, 1992 394 pp. £16.99 ISBN 0-224-035-991."
        ]
    },
    {
        "name": "JSIS",
        "year": "1991",
        "info": "Volume 1: 1991/1992",
        "count": 45,
        "papers": [
            "Introducing the journal of strategic information systems - the new approach to information systems management.",
            "The CIM-IS partnership: integration for competitive advantage.",
            "Stakeholders of strategic information systems planning: theoretical concepts and empirical examples.",
            "Customer-oriented strategic systems.",
            "Modelling corporate information needs: fresh approaches to the information architecture.",
            "The ITBE 2000 initiative: are business schools meeting the challenge of management and IT in the 21st century?",
            "The Arthur D Little forecast on information and productivity: Making the Integrated Enterprise Work by Norman Weizer, George O. Gardner III, Stuart Lipoff, Martyn F, Roetter and Frederick G. Withington John Wiley & Sons Inc., New York, 1991, 272 pp. £24.95 ISBN 0-471-52511-1.",
            "Forecasting and management of technology: by Alan L. Porter, A. Thomas Roper, Thomas W. Mason, Frederick A. Rossini and Jerry Banks John Wilev & Sons Inc., New York, 1991, 448 pp. £51.30 ISBN 0-471-51223-0.",
            "Information systems issues facing senior executives: the culture gap.",
            "Information systems management in Greece: issues and perceptions.",
            "The process of strategic information planning.",
            "Economic aspects of requirements analysis.",
            "On the concept of inter-organizational information systems.",
            "Case study editorial.",
            "Re-engineering becomes the CEO's policy at mutual benefit life.",
            "Taking technology opportunities to the business.",
            "The corporation of the 1990s: Information technology and organizational tranformation: Edited by Michael S. Scott Morton Oxford University Press, New York, 1991, 331 pp. US $24.94, £19.95.",
            "Critical issues in information systems research: Edited by R.J. Boland and R.A. Hirschheim John Wiley & Sons, Chichester, UK. 1987. 394 pp, £49.50.",
            "Editorial.",
            "A framework for recognizing patterns when reshaping business processes.",
            "IT for competitive advantage: the place of expert systems.",
            "IT strategy in retailing: organizational change and future direction.",
            "A contingency model of EDI's impact on industry sectors.",
            "Supporting strategic information needs: an empirical assessment of some organizational factors.",
            "Case study editorial.",
            "The ASB Bank: an IT case study in sustained competitive advantage.",
            "Re-structuring implications for utilities subsidiaries in the post-privatization era.",
            "Outsourcing and the trailing edge of technology.",
            "Strategic IT issues: the views of some major IT investors.",
            "Strategy: an information systems research perspective.",
            "Aligning information systems with business strategy.",
            "The key role of applications software make-or-buy decisions.",
            "Case study editorial.",
            "Business strategy workshop - a framework for planning.",
            "Creating a business-based it strategy: Unicorn Applied Information Technology 14 A. Brown (Editor) Chapman & Hall, London, 1992, 305 pp, £65.00 ISBN 0-412-45910-8.",
            "Emerging information technologies for competitive advantage and economic development: Proceedings of 1992 Information Resources Management Association International Conference, 24-27 May 1992, Charleston, South Carolina Idea Group Publishing, Harrisburg, USA, 1992, 414 pp, US $43.95 ISBN 1-878289-17-9.",
            "Editorial.",
            "Enterprise engineering: building 21st century organizations.",
            "Computer-based information systems for development planning: the significance of cultural factors.",
            "An empirical investigation of information technology structure, control and corporate governance.",
            "Process and product success in information systems development.",
            "The implementation of an electronic market for pig trading in Singapore.",
            "Case study editorial.",
            "Global success with electronic banking: the Hongkong Bank and HEXAGON.",
            "Paradigm shift: The new promise of information technology: Don Tapscott and Art Caston McGraw-Hill Inc., New York, 1993, 337 pp. £21.95 ISBN 0-07-062857-2."
        ]
    }
]