[
    {
        "name": "JWS",
        "year": "2022",
        "info": "2022: Volumes\n72,",
        "count": 9,
        "papers": [
            "A study of the quality of Wikidata.",
            "An empirical study of representing adjectives over knowledge bases: Approach, lexicon and application.",
            "A reference architecture for social robots.",
            "NLIRE: A Natural Language Inference method for Relation Extraction.",
            "The Smart Musical Instruments Ontology.",
            "A multiplatform energy-aware OWL reasoner benchmarking framework.",
            "A framework for differentially-private knowledge graph embeddings.",
            "Skeleton parsing for complex question answering over knowledge bases.",
            "A hybrid E-learning recommendation integrating adaptive profiling and sentiment analysis."
        ]
    },
    {
        "name": "JWS",
        "year": "2021",
        "info": "2021: Volumes\n66,\n67,\n68,\n69,\n70,\n71",
        "count": 18,
        "papers": [
            "On revealing shared conceptualization among open datasets.",
            "Knowledge graph embeddings for dealing with concept drift in machine learning.",
            "FarsBase-KBP: A knowledge base population system for the Persian Knowledge Graph.",
            "Handling redundant processing in OBDA query execution over relational sources.",
            "Entity summarization: State of the art and future challenges.",
            "DTN: Deep triple network for topic specific fake news detection.",
            "Crossing the chasm between ontology engineering and application development: A survey.",
            "Improved distant supervision relation extraction based on edge-reasoning hybrid graph model.",
            "Supporting contextualized learning with linked open data.",
            "Beware of the hierarchy - An analysis of ontology evolution and the materialisation impact for biomedical ontologies.",
            "Intelligent software web agents: A gap analysis.",
            "HeadlineStanceChecker: Exploiting summarization to detect headline disinformation.",
            "Negative statements considered useful.",
            "Towards the next generation of the LinkedGeoData project using virtual knowledge graphs.",
            "Time-aware evidence ranking for fact-checking.",
            "SemML: Facilitating development of ML models for condition monitoring with semantics.",
            "Design, Application and Evaluation of PROV-SwProcess: A PROV extension Data Model for Software Development Processes.",
            "Optimizing a tableau reasoner and its implementation in Prolog."
        ]
    },
    {
        "name": "JWS",
        "year": "2020",
        "info": "2020: Volumes\n60,\n61-62,\n63,\n64,\n65",
        "count": 26,
        "papers": [
            "SOBA: Semi-automated Ontology Builder for Aspect-based sentiment analysis.",
            "Large-scale relation extraction from web documents and knowledge graphs with human-in-the-loop.",
            "The Internet of Musical Things Ontology.",
            "DABGEO: A reusable and usable global energy ontology for the energy domain.",
            "Relaxing relationship queries on graph data.",
            "Curriculum learning for distant supervision relation extraction.",
            "FEEL: Framework for the integration of Entity Extraction and Linking systems.",
            "The role of knowledge in determining identity of long-tail entities.",
            "Web Semantics for Digital Humanities.",
            "Representation Learning for the Semantic Web.",
            "GBKOM: A generic framework for BK-based ontology matching.",
            "The enslaved ontology: Peoples of the historic slave trade.",
            "Chinese semantic document classification based on strategies of semantic similarity computation and correlation analysis.",
            "IQA: Interactive query construction in semantic question answering systems.",
            "Uncovering hidden semantics of set information in knowledge bases.",
            "Benchmarking neural embeddings for link prediction in knowledge graphs under semantic and structural changes.",
            "Evaluating and comparing ontology alignment systems: An MCDM approach.",
            "No one is perfect: Analysing the performance of question answering components over the DBpedia knowledge graph.",
            "GTFS-Madrid-Bench: A benchmark for virtual knowledge graph access in the transport domain.",
            "FAT-RE: A faster dependency-free model for relation extraction.",
            "Fine-Grained Entity Linking.",
            "A benchmark for end-user structured data exploration and search user interfaces.",
            "Less is more: Data-efficient complex question answering over knowledge bases.",
            "Schema-agnostic SPARQL-driven faceted search benchmark generation.",
            "Schema aware iterative Knowledge Graph completion.",
            "Knowledge-driven joint posterior revision of named entity classification and linking."
        ]
    },
    {
        "name": "JWS",
        "year": "2019",
        "info": "2019: Volumes\n54,\n55,\n56,\n57,\n58,\n59",
        "count": 40,
        "papers": [
            "Managing the evolution and preservation of the data web.",
            "Triple storage for random-access versioned querying of RDF archives.",
            "Decentralized Collaborative Knowledge Management Using Git.",
            "Completeness and consistency analysis for evolving knowledge bases.",
            "TISCO: Temporal scoping of facts.",
            "SemaDrift: A hybrid method and visual tools to measure semantic drift in ontologies.",
            "Improving discoverability of open government data with rich metadata descriptions using semantic government vocabulary.",
            "Enabling Spatio-Temporal Search in Open Data.",
            "Characterising dataset search - An analysis of search logs and data requests.",
            "On modeling linked open statistical data.",
            "DCAT-AP representation of Czech National Open Data Catalog and its impact.",
            "Raising interoperability among base registries: The evolution of the Linked Base Registry for addresses in Flanders.",
            "Leopard - A baseline approach to attribute prediction and validation for knowledge graph population.",
            "Linking and disambiguating entities across heterogeneous RDF graphs.",
            "Reasoning and querying web-scale open data based on DL-LiteA in a divide-and-conquer way.",
            "Visualization and interaction for ontologies and linked data - Editorial.",
            "SOSA: A lightweight ontology for sensors, observations, samples, and actuators.",
            "Semantically-enhanced rule-based diagnostics for industrial Internet of Things: The SDRL language and case study for Siemens trains and turbines.",
            "An ontology-mediated analytics-aware approach to support monitoring and diagnostics of static and streaming data.",
            "Measuring expert performance at manually classifying domain entities under upper ontology classes.",
            "Automating ontology engineering support activities with OnToology.",
            "Comparing ontology authoring workflows with Protégé: In the laboratory, in the tutorial and in the 'wild'.",
            "On expansion and contraction of DL-Lite knowledge bases.",
            "Grounding knowledge acquisition with ontology explanation: A case study.",
            "Why are ontologies not reused across the same domain?",
            "BNO - An ontology for understanding the transittability of complex biomolecular networks.",
            "Extending WordNet with UFO foundational ontology.",
            "Publisher's Note.",
            "Implicit quantification made explicit: How to interpret blank nodes and universal variables in Notation3 Logic.",
            "Ontop-spatial: Ontop of geospatial databases.",
            "Manual semantic annotations: User evaluation of interface and interaction designs.",
            "Analysis of Ontology Competency Questions and their formalizations in SPARQL-OWL.",
            "Automated Class Correction and Enrichment in the Semantic Web.",
            "Tolstoy semanticized: Constructing a digital edition for knowledge discovery.",
            "Semantic annotation of natural history collections.",
            "User-centric pattern mining on knowledge graphs: An archaeological case study.",
            "Evaluating the impact of semantic technologies on bibliographic systems: A user-centred and comparative approach.",
            "Embedding models for episodic knowledge graphs.",
            "Knowledge graph fact prediction via knowledge-enriched tensor factorization.",
            "Representing anything from scholar papers."
        ]
    },
    {
        "name": "JWS",
        "year": "2018",
        "info": "2018: Volumes\n48,\n49,\n50,\n51,\n52-53",
        "count": 21,
        "papers": [
            "Publication and usage of official Czech pension statistics Linked Open Data.",
            "Enriching integrated statistical open city data by combining equational knowledge and missing value imputation.",
            "The semantics of populations: A city indicator perspective.",
            "Effective searching of RDF knowledge graphs.",
            "LargeRDFBench: A billion triples benchmark for SPARQL endpoint federation.",
            "Inference Inspector: Improving the verification of ontology authoring actions.",
            "Analyzing user interactions with biomedical ontologies: A visual perspective.",
            "Specification and implementation of mapping rule visualization and editing: MapVOWL and the RMLEditor.",
            "Structuring visual exploratory analysis of skill demand.",
            "Publishing privacy logs to facilitate transparency and accountability.",
            "Impact analysis of data placement strategies on query efforts in distributed RDF stores.",
            "The dataLegend ecosystem for historical statistics.",
            "Machine Translation using Semantic Web Technologies: A Survey.",
            "On the size of intermediate results in the federated processing of SPARQL BGPs.",
            "On building and publishing Linked Open Schema from social Web sites.",
            "Building an effective and efficient background knowledge resource to enhance ontology matching.",
            "Neural Wikipedian: Generating Textual Summaries from Knowledge Base Triples.",
            "GeoTriples: Transforming geospatial data into RDF graphs using R2RML and RML mappings.",
            "Entity set expansion with semantic features of knowledge graphs.",
            "Parallel tractability of ontology materialization: Technique and practice.",
            "Expressive ontology learning as neural machine translation."
        ]
    },
    {
        "name": "JWS",
        "year": "2017",
        "info": "2017: Volumes\n42,\n43,\n44,\n45,\n46-47",
        "count": 22,
        "papers": [
            "Decomposing federated queries in presence of replicated fragments.",
            "Real-time data analytics and event detection for IoT-enabled communication systems.",
            "Operator-aware approach for boosting performance in RDF stream processing.",
            "Language and domain aware lightweight ontology matching.",
            "Linking open data and the crowd for real-time passenger information.",
            "Using ontologies for verification and validation of workflow-based experiments.",
            "The Ten-Year OntoFarm and its Fertilization within the Onto-Sphere.",
            "Ontology Based Data Access in Statoil.",
            "Interfacing fast-fashion design industries with Semantic Web technologies: The case of Imperial Fashion.",
            "Semantic access to streaming and static data at Siemens.",
            "A framework for real-time semantic social media analysis.",
            "Explaining and predicting abnormal expenses at large scale using knowledge graph based reasoning.",
            "Large-scale structural and textual similarity-based mining of knowledge graph to predict drug-drug interactions.",
            "Tree-based models for inductive classification on the Web Of Data.",
            "Automatic acquisition of a taxonomy of microblogs users' interests.",
            "Enhancing answer completeness of SPARQL queries via crowdsourcing.",
            "Tableau-based revision for expressive description logics with individuals.",
            "The Semantic Web Challenge 2015.",
            "3cixty: Building comprehensive knowledge bases for city exploration.",
            "Towards a sales assistant using a product knowledge graph.",
            "The xLiMe system: Cross-lingual and cross-modal semantic annotation, search and recommendation over live-TV, news and social media streams.",
            "Swift Linked Data Miner: Mining OWL 2 EL class expressions directly from online RDF datasets."
        ]
    },
    {
        "name": "JWS",
        "year": "2016",
        "info": "2016: Volumes\n36,\n37-38,\n39,\n40,\n41",
        "count": 29,
        "papers": [
            "Semantic Web in data mining and knowledge discovery: A comprehensive survey.",
            "Domain adaptation for ontology localization.",
            "Personalized concept-based search on the Linked Open Data.",
            "A mobile query service for integrated access to large numbers of online semantic web data sources.",
            "Building semantic trees from XML documents.",
            "The Graph of Things: A step towards the Live Knowledge Graph of connected things.",
            "A rule-based agent-oriented approach for supporting weakly-structured scientific workflows.",
            "Editorial.",
            "Faceted search over RDF-based knowledge graphs.",
            "CohEEL: Coherent and efficient named entity linking through random walks.",
            "RIQ: Fast processing of SPARQL queries on RDF quadruples.",
            "Sar-graphs: A language resource connecting linguistic knowledge with semantic relations from knowledge graphs.",
            "Building event-centric knowledge graphs from news.",
            "Learning the semantics of structured data sources.",
            "Contextualized ranking of entity types based on knowledge graphs.",
            "Triple Pattern Fragments: A low-cost knowledge graph interface for the Web.",
            "Instance matching benchmarks in the era of Linked Data.",
            "DL-Learner - A framework for inductive learning on the Semantic Web.",
            "A multigranularity locking model for RDF.",
            "LHD 2.0: A text mining approach to typing entities in knowledge graphs.",
            "Defining and computing Least Common Subsumers in RDF.",
            "Visual query interfaces for semantic datasets: An evaluation study.",
            "Approximation and relaxation of semantic web path queries.",
            "Dimensional enrichment of statistical linked open data.",
            "Adapting ontologies to best-practice artifacts using transformation patterns: Method, implementation and use cases.",
            "Exploratory spatio-temporal analysis of linked statistical data.",
            "LDQL: A query language for the Web of Linked Data.",
            "Overview of YAM++ - (not) Yet Another Matcher for ontology alignment task.",
            "CroMatcher: An ontology matching system based on automated weighted aggregation and iterative final alignment."
        ]
    },
    {
        "name": "JWS",
        "year": "2015",
        "info": "2015: Volumes\n30,\n31,\n32,\n33,\n34,\n35",
        "count": 46,
        "papers": [
            "Editorial.",
            "Global machine learning for spatial ontology population.",
            "Discovering and understanding word level user intent in Web search queries.",
            "SINA: Semantic interpretation of user queries for question answering on interlinked data.",
            "Mímir: An open-source semantic search framework for interactive information seeking and discovery.",
            "Tailored semantic annotation for semantic search.",
            "An overview of semantic search evaluation initiatives.",
            "On the formulation of performant SPARQL queries.",
            "Mining various semantic relationships from unstructured user-generated web data.",
            "WSMO-Lite and hRESTS: Lightweight semantic annotations for Web services and RESTful APIs.",
            "Linked hypernyms: Enriching DBpedia with Targeted Hypernym Discovery.",
            "Methodology for geospatial data source discovery in ontology-driven geo-information integration architectures.",
            "Using a suite of ontologies for preserving workflow-centric research objects.",
            "The Data Mining OPtimization Ontology.",
            "Special issue of the Journal of Web Semantics on ontology-based data access.",
            "Inconsistency-tolerant query answering in ontology-based data access.",
            "Optimising resolution-based rewriting algorithms for OWL ontologies.",
            "Temporalizing rewritable query languages over knowledge bases.",
            "Temporal query entailment in the Description Logic SHQ.",
            "Complexity of answering counting aggregate queries over DL-Lite.",
            "Engineering ontology-based access to real-world data sources.",
            "Efficient SPARQL-to-SQL with R2RML mappings.",
            "A bootstrapping approach to entity linkage on the Semantic Web.",
            "Neighborhood-user profiling based on perception relationship in the micro-blog scenario.",
            "SACI: Sentiment analysis by collective inspection on social media content.",
            "A novel approach to generate MCQs from domain ontology: Considering DL semantics and open-world assumption.",
            "Special Issue of the Journal of Web Semantics on Geospatial Semantics.",
            "LC3: A spatio-temporal and semantic model for knowledge discovery from geospatial datasets.",
            "Querying and integrating spatial-temporal information on the Web of Data via time geography.",
            "Sextant: Visualizing time-evolving linked geospatial data.",
            "Exposing INSPIRE on the Semantic Web.",
            "Editorial.",
            "Using semantic data to improve cross-lingual linking of article clusters.",
            "Substructure counting graph kernels for machine learning from RDF data.",
            "DeFacto - Temporal and multilingual Deep Fact Validation.",
            "An unsupervised instance matcher for schema-free RDF data.",
            "Automatic acquisition of class disjointness.",
            "The Semantic Web Challenge 2014.",
            "Mining the Web of Linked Data with RapidMiner.",
            "DIVE into the event-based browsing of linked historical media.",
            "The Mannheim Search Join Engine.",
            "Semantic reasoning on mobile devices: Do Androids dream of efficient reasoners?",
            "Queries with negation and inequalities over lightweight ontologies.",
            "C3D+P: A summarization method for interactive entity resolution.",
            "The description logic SHIQ with a flexible meta-modelling hierarchy.",
            "The rationale of PROV."
        ]
    },
    {
        "name": "JWS",
        "year": "2014",
        "info": "2014: Volumes\n24,\n25,\n26,\n27-28,\n29",
        "count": 29,
        "papers": [
            "The Semantic Web Challenge 2012.",
            "Mining events connections on the social web: Real-time instance matching and data analysis in EventMedia.",
            "SPUD - Semantic Processing of Urban Data.",
            "Wildfire monitoring using satellite images, ontologies and linked geospatial data.",
            "On the design of a self-medication web application built on linked open data.",
            "Exploring Linked Data with contextual tag clouds.",
            "Clustering rule bases using ontology-based similarity measures.",
            "ArguBlogging: An application for the Argument Web.",
            "Ztreamy: A middleware for publishing semantic streams on the Web.",
            "Streaming the Web: Reasoning over dynamic data.",
            "Querying a messy web of data with Avalanche.",
            "The swget portal: Navigating and acting on the web of linked data.",
            "Linked knowledge sources for topic classification of microposts: A semantic graph-based approach.",
            "The Semantic Web Challenge 2013.",
            "The BBC World Service Archive prototype.",
            "Constitute: The world's constitutions to read, search, and compare.",
            "B-hist: Entity-centric search over personal web browsing history.",
            "Smart traffic analytics in the semantic web with STAR-CITY: Scenarios, system and lessons learned in Dublin City.",
            "Big linked cancer data: Integrating linked TCGA and PubMed.",
            "Everything you always wanted to know about blank nodes.",
            "Lessons learnt from the deployment of a semantic virtual research environment.",
            "Konclude: System description.",
            "Recent applications of web semantics in eLifeScience.",
            "Querying neXtProt nanopublications and their value for insights on sequence variants and tissue expression.",
            "API-centric Linked Data integration: The Open PHACTS Discovery Platform case study.",
            "Domain-specific summarization of Life-Science e-experiments from provenance traces.",
            "Theophrastus: On demand and real-time automatic annotation and exploration of (web) documents using open linked data.",
            "A hybrid approach to finding relevant social media content for complex domain specific information needs.",
            "Identifying relevant concept attributes to support mapping maintenance under ontology evolution."
        ]
    },
    {
        "name": "JWS",
        "year": "2013",
        "info": "2013: Volumes\n18,\n19,\n20,\n21,\n22,\n23,",
        "count": 24,
        "papers": [
            "Federating queries in SPARQL 1.1: Syntax, semantics and evaluation.",
            "Editorial: Special Issue on the Semantic and Social Web.",
            "Folksonomized ontology and the 3E steps technique to support ontology evolvement.",
            "Community analysis through semantic rules and role composition derivation.",
            "Improving habitability of natural language interfaces for querying ontologies with feedback and clarification dialogues.",
            "Binary RDF representation for publication and exchange (HDT).",
            "Ontology evolution without tears.",
            "The quality of the XML Web.",
            "Relatedness between vocabularies on the Web of data: A taxonomy and an empirical study.",
            "How ontologies are made: Studying the hidden social dynamics behind collaborative ontology engineering projects.",
            "Key choices in the design of Simple Knowledge Organization System (SKOS).",
            "SMARTMUSEUM: A mobile recommender system for the Web of Data.",
            "On a steady path to semantic technology evaluation.",
            "Evaluating question answering over linked data.",
            "Repeatable and reliable semantic search evaluation.",
            "Ontology matching benchmarks: Generation, stability, and discriminability.",
            "Evaluation of instance matching tools: The experience of OAEI.",
            "Towards savvy adoption of semantic technology: From published use cases to category-specific adopter readiness models.",
            "User interfaces for semantic authoring of textual content: A systematic literature review.",
            "Ultrawrap: SPARQL execution on relational data.",
            "k-nearest keyword search in RDF graphs.",
            "Data Linking.",
            "Active learning of expressive linkage rules using genetic programming.",
            "An automatic key discovery approach for data linking."
        ]
    },
    {
        "name": "JWS",
        "year": "2012",
        "info": "2012: Volumes\n10,\n11,\n12-13,\n14,\n15,\n16,\n17",
        "count": 46,
        "papers": [
            "Web-scale semantic information processing.",
            "Scalable distributed indexing and query processing over Linked Data.",
            "Searching web data: An entity retrieval and high-performance indexing model.",
            "WebPIE: A Web-scale Parallel Inference Engine using MapReduce.",
            "Scalable and distributed methods for entity matching, consolidation and disambiguation over linked data corpora.",
            "Induction of robust classifiers for web ontologies through kernel machines.",
            "A novel XML document structure comparison framework based-on sub-tree commonalities and label semantics.",
            "Automatic metadata mining from multilingual enterprise content.",
            "Challenges for the multilingual Web of Data.",
            "A general framework for representing, reasoning and querying with annotated Semantic Web data.",
            "Where to publish and find ontologies? A survey of ontology libraries.",
            "Reasoning with Context in the Semantic Web.",
            "Representing and querying validity time in RDF and OWL: A logic-based approach.",
            "Context-dependent views to axioms and consequences of Semantic Web ontologies.",
            "Towards a context sensitive approach to searching information based on domain specific knowledge sources.",
            "Domains and context: First steps towards managing diversity in knowledge.",
            "Contextualized knowledge repositories for the Semantic Web.",
            "Interactive ontology debugging: Two query strategies for efficient fault localization.",
            "Higher-order aspects and context in SUMO.",
            "Interactive ontology revision.",
            "An interaction-based approach to semantic alignment.",
            "OWL-POLAR: A framework for semantic policy representation and reasoning.",
            "Dealing with the Messiness of the Web of Data.",
            "Emerging practices for mapping and linking life sciences data using RDF - A case series.",
            "An empirical survey of Linked Data conformance.",
            "Integrating open government data with stratosphere for more transparency.",
            "A general Datalog-based framework for tractable query answering over ontologies.",
            "A novel approach to ontology classification.",
            "The iSeM matchmaker: A flexible approach for adaptive hybrid semantic service selection.",
            "A configurable translation-based cross-lingual ontology mapping system to adjust mapping outcomes.",
            "A lexico-semantic pattern language for learning ontology instances from text.",
            "Internationalization of Linked Data: The case of the Greek DBpedia edition.",
            "MultiFarm: A benchmark for multilingual ontology matching.",
            "Comments on \"WebPIE: A Web-scale parallel inference engine using MapReduce\".",
            "Reply to comment on \"WebPIE: A Web-scale parallel inference engine using MapReduce\".",
            "ONTOCOM: A reliable cost estimation method for ontology development projects.",
            "Georeferencing Flickr photos using language models at different levels of granularity: An evidence based approach.",
            "The Semantic Web Challenge, 2011.",
            "BOTTARI: An augmented reality mobile application to deliver personalized and location-based recommendations by continuous analysis of social media streams.",
            "A middleware framework for scalable management of linked streams.",
            "SchemEX - Efficient construction of a data catalogue by stream-based indexing of linked data.",
            "Understanding why users tag: A survey of tagging motivation literature and results from an empirical study.",
            "Improving semantic web services discovery using SPARQL-based repository filtering.",
            "The SSN ontology of the W3C semantic sensor network incubator group.",
            "FaBiO and CiTO: Ontologies for describing bibliographic resources and citations.",
            "Corrigendum to \"WebPIE: A Web-scale Parallel Inference Engine using MapReduce\" [Web Semant. Sci. Serv. Agents World Wide Web 10 (2012) 59-75]."
        ]
    },
    {
        "name": "JWS",
        "year": "2011",
        "info": "Volume 9: 2011",
        "count": 33,
        "papers": [
            "Categorising social tags to improve folksonomy-based recommendations.",
            "Humans, semantic services and similarity: A user study of semantic Web services matching and composition.",
            "LexInfo: A declarative model for the lexicon-ontology interface.",
            "Enhanced geographically typed semantic schema matching.",
            "Class expression learning for ontology engineering.",
            "Guiding the representation of n-ary relations in ontologies through aggregation, generalisation and participation.",
            "BNOSA: A Bayesian network and ontology based semantic annotation framework.",
            "Supporting domain experts to construct conceptual ontologies: A holistic approach.",
            "Design and use of the Simple Event Model (SEM).",
            "The QALL-ME Framework: A specifiable-domain multilingual Question Answering architecture.",
            "Using provenance in the Semantic Web.",
            "Modelling provenance of DBpedia resources using Wikipedia contributions.",
            "Robust and scalable Linked Data reasoning incorporating provenance and trust annotations.",
            "Provenance-based reproducibility in the Semantic Web.",
            "Enhancing workflow with a semantic description of scientific intent.",
            "Semantic Web dynamics.",
            "Concept drift and how to identify it.",
            "DSNotify - A solution for event detection and link maintenance in dynamic datasets.",
            "Using provenance to debug changing ontologies.",
            "A holistic approach to collaborative ontology development based on change management.",
            "The Semantic Web Challenge, 2010.",
            "NCBO Resource Index: Ontology-based search and mining of biomedical resources.",
            "TWC LOGD: A portal for linked open government data ecosystems.",
            "Shortipedia aggregating and curating Semantic Web data.",
            "Creating voiD descriptions for Web-scale data.",
            "SemSearchPro - Using semantics throughout the search process.",
            "Searching and browsing Linked Data with SWSE: The Semantic Web Search Engine.",
            "SAWSDL-iMatcher: A customizable and effective Semantic Web Service matchmaker.",
            "Mapping queries to the Linking Open Data cloud: A case study using DBpedia.",
            "Semantically enhanced Information Retrieval: An ontology-based approach.",
            "Semantic Web search based on ontological conjunctive queries.",
            "Relevance feedback between hypertext and Semantic Web search: Frameworks and evaluation.",
            "Lightweight integration of IR and DB for scalable hybrid search with integrated ranking support."
        ]
    },
    {
        "name": "JWS",
        "year": "2010",
        "info": "Volume 8: 2010",
        "count": 39,
        "papers": [
            "Constructing composite web services from natural language requests.",
            "An adaptive ontology mapping approach with neural network based constraint satisfaction.",
            "Modeling and evaluation of trust with an extension in semantic web.",
            "Leveraging personal metadata for Desktop search: The Beagle++ system.",
            "Anomalies in ontologies with rules.",
            "On the discovery of subsumption relations for the alignment of ontologies.",
            "DLEJena: A practical forward-chaining OWL 2 RL reasoner combining Jena and Pellet.",
            "Bridging the Gap - Data Mining and Social Network Analysis for Integrating Semantic Web and Web 2.0.",
            "Bridging the gap between tagging and querying vocabularies: Analyses and applications for enhancing multimedia IR.",
            "Automatic construction of a large-scale situation ontology by mining how-to instructions from the web.",
            "Disambiguating identity web references using Web 2.0 data and semantics.",
            "Introduction to the Special Issue.",
            "Interactive publication: The document as a research tool.",
            "Structured literature image finder: Parsing text and figures in biomedical literature.",
            "Semantic Web and Social Web heading towards Living Documents in the Life Sciences.",
            "Dynamic visualization of statistical learning in the context of high-dimensional textual data.",
            "Visualizing search results and document collections using topic maps.",
            "CORAAL - Dive into publications, bathe in the knowledge.",
            "Reflect: A practical approach to web semantics.",
            "Enhanced display of scientific articles using extended metadata.",
            "Supporting browsing-specific information needs: Introducing the Citation-Sensitive In-Browser Summariser.",
            "An ontology for representing financial headline news.",
            "ARAXA: Storing and managing Active XML documents.",
            "Semantic web enabled software analysis.",
            "Modeling and querying graphical representations of statistical data.",
            "nSPARQL: A navigational language for RDF.",
            "Atlas: Storing, updating and querying RDF(S) data on top of DHTs.",
            "Interoperability results for Semantic Web technologies using OWL as the interchange language.",
            "Service matchmaking revisited: An approach based on model checking.",
            "Discovering Semantic Web services using SPARQL and intelligent agents.",
            "Learning the emergent knowledge from annotated blog postings.",
            "The Semantic Web Challenge, 2009.",
            "TrialX: Using semantic technologies to match patients to relevant clinical trials based on their Personal Health Records.",
            "VisiNav: A system for visual search and navigation on web data.",
            "Sig.ma: Live views on the Web of Data.",
            "Scalable reduction of large datasets to interesting subsets.",
            "User interaction in semantic web research.",
            "Evaluating the usability of natural language query languages and interfaces to Semantic Web knowledge bases.",
            "From the web of data to a world of action."
        ]
    },
    {
        "name": "JWS",
        "year": "2009",
        "info": "Volume 7: 2009",
        "count": 30,
        "papers": [
            "Quality-driven information filtering using the WIQA policy framework.",
            "Making Web services tradable: A policy-based approach for specifying preferences on Web service properties.",
            "Policy-based spectrum access control for dynamic spectrum access network radios.",
            "Specifying and enforcing high-level semantic obligation policies.",
            "A meta-control architecture for orchestrating policy enforcement across heterogeneous information sources.",
            "Extending SPARQL with regular expression patterns (for querying RDF).",
            "Bridging the gap between OWL and relational databases.",
            "Inexact matching of ontology graphs using expectation-maximization.",
            "Detecting innovative topics based on user-interest ontology.",
            "OWLS-MX: A hybrid Semantic Web service matchmaker for OWL-S services.",
            "Special issue: The Web of Data.",
            "Automated ontology instantiation from tabular web sources - The AllRight system.",
            "DBpedia - A crystallization point for the Web of Data.",
            "From keywords to semantic queries - Incremental query construction on the semantic web.",
            "Semplore: A scalable IR approach to search the Web of Data.",
            "Hermes: Data Web search on a pay-as-you-go integration infrastructure.",
            "Querying for provenance, trust, uncertainty and other meta knowledge in RDF.",
            "Simple and Efficient Minimal RDFS.",
            "Ontology matching with semantic verification.",
            "Distributed reasoning with ontologies and rules in order-sorted logic programming.",
            "The Semantic Web challenge, 2008.",
            "Paggr: Linked Data widgets and dashboards.",
            "Exploring the Geospatial Semantic Web with DBpedia Mobile.",
            "HealthFinland - A national semantic publishing network and portal for health information.",
            "SemaPlorer - Interactive semantic exploration of data and media based on a federated cloud infrastructure.",
            "Marvin: Distributed reasoning over large-scale Semantic Web data.",
            "Ontology driven semantic profiling and retrieval in medical information systems.",
            "Automated generation of composite web services based on functional semantics.",
            "An efficient and scalable algorithm for segmented alignment of ontologies of arbitrary size.",
            "Scalable highly expressive reasoner (SHER)."
        ]
    },
    {
        "name": "JWS",
        "year": "2008",
        "info": "Volume 6: 2008",
        "count": 32,
        "papers": [
            "Semantic Web and Web 2.0.",
            "Collective knowledge systems: Where the Social Web meets the Semantic Web.",
            "Metcalfe's law, Web 2.0, and the Semantic Web.",
            "Using the Semantic Web for linking and reusing data across Web 2.0 communities.",
            "Mass argumentation and the semantic web.",
            "Discovering shared conceptualizations in folksonomies.",
            "hGRDDL: Bridging microformats and RDFa.",
            "Bridging the semantic Web and Web 2.0 with Representational State Transfer (REST).",
            "The two cultures: Mashing up Web 2.0 and the Semantic Web.",
            "Ease of interaction plus ease of integration: Combining Web2.0 and the Semantic Web in a reviewing site.",
            "SweetWiki: A semantic wiki.",
            "A method for computing lexical semantic distance using linear functionals.",
            "IRS-III: A broker-based approach to semantic Web services.",
            "Translating the Foundational Model of Anatomy into OWL.",
            "Introduction to the special issue on \"Semantic Multimedia\".",
            "Automatic generation of matter-of-opinion video documentaries.",
            "The semantic web as a newspaper media convergence facilitator.",
            "ZemPod: A semantic web approach to podcasting.",
            "Syndication on the Web using a description logic approach.",
            "ActiveRDF: Embedding Semantic Web data into object-oriented languages.",
            "YAGO: A Large Ontology from Wikipedia and WordNet.",
            "Ontology-driven, unsupervised instance population.",
            "Falcon-AO: A practical ontology matching system.",
            "Introduction to the special issue on the Semantic Web Challenge 2006 and 2007.",
            "Semantic annotation and search of cultural-heritage collections: The MultimediaN E-Culture demonstrator.",
            "FOAFing the music: Bridging the semantic gap in music recommendation.",
            "The DBin platform: A complete environment for Semantic Web Communities.",
            "Revyu: Linking reviews and ratings into the Web of Data.",
            "Potluck: Data mash-up tool for casual users.",
            "Recommendations based on semantically enriched museum collections.",
            "Managing uncertainty and vagueness in description logics for the Semantic Web.",
            "OWL 2: The next step for OWL."
        ]
    },
    {
        "name": "JWS",
        "year": "2007",
        "info": "Volume 5: 2007",
        "count": 25,
        "papers": [
            "Introduction to the special issue of JWS with selected papers from ISWC 2005.",
            "Ontologies are us: A unified model of social networks and semantics.",
            "Piggy Bank: Experience the Semantic Web inside your web browser.",
            "Provenance-based validation of e-science experiments.",
            "Understanding ontology evolution: A change detection approach.",
            "Pellet: A practical OWL-DL reasoner.",
            "GrOWL: A tool for visualization and editing of OWL ontologies.",
            "A survey of trust in computer science and the Semantic Web.",
            "AquaLog: An ontology-driven question answering system for organizational semantic intranets.",
            "Editorial.",
            "Towards a web of patterns.",
            "Verifying feature models using OWL.",
            "Leveraging Semantic Web technologies for business component specification.",
            "Towards semantically enhanced Web service repositories.",
            "SwetoDblp ontology of Computer Science publications.",
            "DOLCE ergo SUMO: On foundational and domain models in the SmartWeb Integrated Ontology (SWIntO).",
            "Web Authoring for Accessibility (WAfA).",
            "Variable-strength conditional preferences for ranking objects in ontologies.",
            "Patterns of semantic relations to improve image content search.",
            "Magpie: Experiences in supporting Semantic Web browsing.",
            "Where is the Web in the Semantic Web?",
            "Towards content trust of web resources.",
            "A comparison of two modelling paradigms in the Semantic Web.",
            "Semantic Wikipedia.",
            "POLYPHONET: An advanced social network extraction system from the Web."
        ]
    },
    {
        "name": "JWS",
        "year": "2006",
        "info": "Volume 4: 2006",
        "count": 24,
        "papers": [
            "Semantic approach to service discovery in a Grid environment.",
            "Semantic annotation for knowledge management: Requirements and a survey of the state of the art.",
            "OWL-Eu: Adding customised datatypes into OWL.",
            "Combining OWL ontologies using epsilon-Connections.",
            "Towards automatic merging of domain ontologies: The HCONE-merge approach.",
            "Semantic Grid - The convergence of technologies.",
            "The Semantic Grid and chemistry: Experiences with CombeChem.",
            "An overview of S-OGSA: A Reference Semantic Grid Architecture.",
            "On agents and grids: Creating the fabric for a new generation of distributed intelligent systems.",
            "Semantic Web Mining: State of the art and future directions.",
            "Swoop: A Web Ontology Editing Browser.",
            "GOHSE: Ontology driven linking of biology resources.",
            "Editorial - Semantic Web for Life Sciences.",
            "Semantic web infrastructure for fungal enzyme biotechnologists.",
            "The foundational model of anatomy in OWL: Experience and perspectives.",
            "SAMBO - A system for aligning and merging biomedical ontologies.",
            "A semantic web approach to biological pathway data reasoning and integration.",
            "Aggregation of bioinformatics data using Semantic Web technology.",
            "SWAN: A distributed knowledge infrastructure for Alzheimer disease research.",
            "Referent tracking for treatment optimisation in schizophrenic patients: A case study in applying philosophical ontology to diagnostic algorithms.",
            "Ontologies for ecoinformatics.",
            "Using Bayesian decision for ontology mapping.",
            "CONFOTO: Browsing and annotating conference photos on the Semantic web.",
            "MusiDB: A personalized search engine for music."
        ]
    },
    {
        "name": "JWS",
        "year": "2005",
        "info": "Volume 3: 2005",
        "count": 21,
        "papers": [
            "Preface.",
            "Rules and ontologies in support of real-time ubiquitous application.",
            "OWL rules: A proposal and prototype implementation.",
            "Query Answering for OWL-DL with rules.",
            "On the decidability and complexity of integrating ontologies and rules.",
            "Preface.",
            "Completeness, decidability and complexity of entailment for RDF Schema and a semantic extension involving the OWL vocabulary.",
            "OntoTrack: A semantic approach for ontology authoring.",
            "From tables to frames.",
            "What would it mean to blog on the semantic web?",
            "LUBM: A benchmark for OWL knowledge base systems.",
            "Information gathering during planning for Web Service composition.",
            "Semantic Web Challenge 2004.",
            "Flink: Semantic Web technology for the extraction and analysis of social networks.",
            "MuseumFinland - Finnish museums on the semantic web.",
            "World Wide Web Conference 2005 - Semantic Web track.",
            "Named graphs.",
            "Debugging unsatisfiable classes in OWL ontologies.",
            "Efficient and scalable filtering of graph-based metadata.",
            "Synthy: A system for end to end composition of web services.",
            "Learning domain ontologies for semantic Web service descriptions."
        ]
    },
    {
        "name": "JWS",
        "year": "2004",
        "info": "Volume 2: 2004/2005",
        "count": 10,
        "papers": [
            "Generating transformational annotation for web document adaptation: tool support and empirical evaluation.",
            "OWL-QL - a language for deductive query answering on the Semantic Web.",
            "Annotation, composition and invocation of semantic web services.",
            "Semantic annotation, indexing, and retrieval.",
            "Peer-to-peer semantic coordination.",
            "Bibster - a semantics-based bibliographic Peer-to-Peer system.",
            "World Wide Web Conference 2004 - Semantic Web Track.",
            "A subscribable peer-to-peer RDF repository for distributed metadata management.",
            "Learning to integrate web taxonomies.",
            "Semantic email: theory and applications."
        ]
    },
    {
        "name": "JWS",
        "year": "2003",
        "info": "Volume 1: 2003/2004",
        "count": 27,
        "papers": [
            "A new journal for a new era of the World Wide Web.",
            "From SHIQ and RDF to OWL: the making of a Web Ontology Language.",
            "Automated discovery, interaction and composition of Semantic Web services.",
            "Developing metadata-intensive applications with Rondo.",
            "The National Cancer Institute's Thésaurus and Ontology.",
            "TAP: A Semantic Web Test-bed.",
            "Start making sense: The Chatty Web approach for global semantic agreements.",
            "A case for automated large-scale semantic annotation.",
            "WWW conference special issue.",
            "Agent-based Semantic Web Services.",
            "Piazza: mediation and integration infrastructure for Semantic Web data.",
            "Super-peer-based routing strategies for RDF-based peer-to-peer networks.",
            "Unveiling the hidden bride: deep annotation for mapping and migrating legacy data to the Semantic Web.",
            "Optimizing taxonomic semantic web queries using labeling schemes.",
            "An integration site for Semantic Web metadata.",
            "A short study on the success of the Gene Ontology.",
            "Semantic web technologies to reconcile privacy and context awareness.",
            "Agent-based service selection.",
            "Quality of service for workflows and web service processes.",
            "Web services: problems and future directions.",
            "Editorial - International Semantic Web Conference 2003.",
            "Contextualizing ontologies.",
            "Reducing OWL entailment to description logic satisfiability.",
            "Viewing the semantic web through RVL lenses.",
            "HTN planning for Web Service composition using SHOP2.",
            "Explaining answers from the Semantic Web: the Inference Web approach.",
            "Walking through CS AKTive Space: a demonstration of an integrated Semantic Web application."
        ]
    }
]