[
    {
        "year": "2021",
        "name": "22nd MDM 2021",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2021",
                "sub_name": "22nd IEEE International Conference on Mobile Data Management, MDM 2021, Toronto, ON, Canada, June 15-18, 2021.",
                "count": 46,
                "papers": [
                    "Fairness-aware Methods in Rankings and Recommenders.",
                    "Machine Learning Meets Big Spatial Data (Revised).",
                    "A Differentially Private Task Planning Framework for Spatial Crowdsourcing.",
                    "Engaging Drivers in Ride Hailing via Competition: A Case Study with Arena.",
                    "IFP-ADAC: A Two-stage Interpretable Fault Prediction Model for Multivariate Time Series.",
                    "Urban Crowd Density Prediction Based on Multi-relational Graph.",
                    "HQ-Filter: Hierarchy-Aware Filter For Empty-Resulting Queries in Interactive Exploration.",
                    "Visit Places on Your Way: A Skyline Approach in Time-Dependent Networks.",
                    "BLAME: A Blockchain-assisted Misbehavior Detection and Event Validation in VANETs.",
                    "Efficient Spatio-Textual Similarity Join Processing on NUMA Systems.",
                    "Meta-Learning Enhanced Neural ODE for Citywide Next POI Recommendation.",
                    "IDEAL: a Vector-Raster Hybrid Model for Efficient Spatial Queries over Complex Polygons.",
                    "Towards Predicting Vehicular Data Consumption.",
                    "Efficient Parking Search using Shared Fleet Data.",
                    "Online Staypoint Detection in High-Frequency Location Update Streams.",
                    "2SRS: A Two-Sided Recommender System to Connect Local Businesses to Bus Passengers.",
                    "A Distributed Location Trusted Service Achieving k-Anonymity against the Global Adversary.",
                    "Dual Sequence Transformer for Query-based Interactive Recommendation.",
                    "Spatial K-Core Identification in Large Spatial Data.",
                    "BaCIM: Balanced Competitive Influence Maximization based on Blocked Reverse Influence Sampling.",
                    "Improving persistence based trajectory simplification.",
                    "A computer vision approach for trajectory classification.",
                    "Trajectory Similarity using Compression.",
                    "Reachability Queries with Transfer Decay.",
                    "Feature Selection in Mobile Activity Recognition: A Comparative Study.",
                    "Triastore: A Web 3.0 Blockchain Datastore for Massive IoT Workloads.",
                    "OSMRunner : A System for Exploring and Fixing OSM Connectivity.",
                    "Learning Shortest Paths on Large Dynamic Graphs.",
                    "Hidden Markov Model to Predict Tourists Visited Places.",
                    "A Context, Location and Preference-Aware System for Safe Pedestrian Mobility.",
                    "Crime Monitor: Monitoring Criminals from Trajectory Data.",
                    "GPSClean: An Embedded Tool for Cleaning GPS Data.",
                    "Transitive Halifax: An Activity-Based Search Engine for Bus Routes.",
                    "A Large-scale Disease Outbreak Analytics System based on Wi-Fi Session Logs.",
                    "A Navigation System for Safe Routing.",
                    "ST_VISIONS: A Python Library for Interactive Visualization of Spatio-temporal Data.",
                    "Measuring Heart Rate and Heart Rate Variability with Smartphone Camera.",
                    "HealthDist: A Context, Location and Preference-Aware System for Safe Navigation.",
                    "UGASP: User and Group Aware Shopping Planner.",
                    "Ship path planning based on Deep Reinforcement Learning and weather forecast.",
                    "A Context-aware Framework for ML Models on Spatio-temporal Data Streams.",
                    "Multi-inhabitant and explainable Activity Recognition in Smart Homes.",
                    "Green Planning of IoT Smart Environments.",
                    "Semi-supervised methodologies to tackle the annotated data scarcity problem in the field of HAR.",
                    "Dynamic Rate Control for Topic-based Pub/Sub Systems.",
                    "Racoon: Rapid Contact Tracing of Moving Objects Using Smart Indexes."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st MDM 2020",
        "info": "Versailles, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2020",
                "sub_name": "21st IEEE International Conference on Mobile Data Management, MDM 2020, Versailles, France, June 30 - July 3, 2020.",
                "count": 61,
                "papers": [
                    "COVID-19 Mobile Contact Tracing Apps (MCTA): A Digital Vaccine or a Privacy Demolition?",
                    "Managing Uncertainty in Evolving Geo-Spatial Data.",
                    "A new similarity measure for low-sampling cellular fingerprint trajectories.",
                    "IFLoc: Indoor Height Estimation by Telco Data.",
                    "Money Cannot Buy Everything: Trading Mobile Data with Controllable Privacy Loss.",
                    "VPN+ Towards Detection and Remediation of Information Leakage on Smartphones.",
                    "Distributed Incentive-Based Secured Traffic Monitoring in VANETs.",
                    "Trade-off Aware Sequenced Routing Queries (or OSR Queries when POIs are not Free).",
                    "Semantically Diverse Path Search.",
                    "STAD: Spatio-Temporal Adjustment of Traffic-Oblivious Travel-Time Estimation.",
                    "Crash Prediction and Risk Assessment with Individual Mobility Networks.",
                    "Online Clustering of Trajectories in Road Networks.",
                    "Learning Semantic Relationships of Geographical Areas based on Trajectories.",
                    "GradeSense: Gradation Aware Storage for Robust Activity Recognition in a Multimodal Smarthome.",
                    "Context-Aware Data Association for Multi-Inhabitant Sensor-Based Activity Recognition.",
                    "Semantic Trajectory Modelling in Indoor and Outdoor Spaces.",
                    "Notable Site Recognition using Deep Learning on Mobile and Crowd-sourced Imagery.",
                    "Probabilistic Value Selection for Space Efficient Model.",
                    "Location-Based Social Network Data Generation Based on Patterns of Life.",
                    "Dynamic macro scale traffic flow optimisation using crowd-sourced urban movement data.",
                    "Noise Patterns in GPS Trajectories.",
                    "STIMULATE: A System for Real-time Information Acquisition and Learning for Disaster Management.",
                    "A solution for annotating sensor data streams - An industrial use case in building management system.",
                    "AutoConjunction: Adaptive Model-based Feature Conjunction for CTR Prediction.",
                    "RESGCN: RESidual Graph Convolutional Network based Free Dock Prediction in Bike Sharing System.",
                    "The Anyplace 4.0 IoT Localization Architecture.",
                    "A Demonstration of Summit: a Scalable Data Management Framework for Massive Trajectory.",
                    "NLMO: Towards a Natural Language Tool for Querying Moving Objects.",
                    "CAPRIOv2.0: A Context-Aware Unified Indoor-Outdoor Path Recommendation System.",
                    "Tools for processing digital trajectories of tourists.",
                    "SMART-Env.",
                    "A Road Segment Attribute Completion System.",
                    "Distributed Mobility Data Management in MobilityDB.",
                    "Managing Moving Objects With Imprecise Location.",
                    "A Correlated Time Series Forecast System.",
                    "Big Mobility Data Analytics: Algorithms and Techniques for Efficient Trajectory Clustering.",
                    "Big Data Series Analytics in the Context of Environmental Crowd Sensing.",
                    "A Big Data Platform For Spatio-Temporal Social Event Discovery.",
                    "Modelling, Managing and Processing of Mobility Data in Urban Environment.",
                    "Exploratory Trajectory Analysis for Massive Historical AIS Datasets.",
                    "Machine Learning based System for Vessel Turnaround Time Prediction.",
                    "Detection of Abnormal Vessel Behaviours from AIS data using GeoTrackNet: from the Laboratory to the Ocean.",
                    "Discrete Kalman Filter and Linear Regression Comparison for Vessel Coordinate Prediction.",
                    "Sea Area Monitoring and Analysis of Fishing Vessels Activity: The i4sea Big Data Platform.",
                    "Optimizing Vessel Trajectory Compression.",
                    "EU-MRV: an analysis of 2018's Ro-Pax CO2 data.",
                    "Experimental Comparison of Complex Event Processing Systems in the Maritime Domain.",
                    "Artificial intelligence technologies for Maritime Surveillance applications.",
                    "Are Satellite Images Effective for Estimating Land Prices on Deep Neural Network Models?",
                    "An Efficient Method for Recommending Branch Locations to Reduce the Transportation Distance between Stations and Urban Events.",
                    "DACNN: Dynamic Weighted Attention with Multi-channel Convolutional Neural Network for Emotion Recognition.",
                    "Live Stream Highlight Detection Using Chat Messages.",
                    "Detecting Social Anxiety with Online Social Network Data.",
                    "Ontology-based Dynamic Semantic Annotation for Social Image Retrieval.",
                    "Counting People by Using Convolutional Neural Network and A PIR Array.",
                    "A Cost Model for Data Discovery in Large-Scale IoT Networks of Smart Cities.",
                    "Towards a Simulation Framework for Edge-to-Cloud Orchestration in C-ITS.",
                    "A smart fog-to-cloud system in airport: challenges and lessons learnt.",
                    "A Novel Edge-to-Cloud-as-a-Service (E2CaaS) Model for Building Software Services in Smart Cities.",
                    "Bridging MQTT and Kafka to support C-ITS: a feasibility study.",
                    "Personalized tourism route recommendation based on user's active interests*."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th MDM 2019",
        "info": "Hong Kong, SAR, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2019",
                "sub_name": "20th IEEE International Conference on Mobile Data Management, MDM 2019, Hong Kong, SAR, China, June 10-13, 2019.",
                "count": 104,
                "papers": [
                    "Geometric Top-k Processing: Updates Since MDM'16 [Advanced Seminar].",
                    "Mobile Data Collection and Analysis with Local Differential Privacy.",
                    "Lighthouse: Enabling Landmark-Based Accurate and Robust Next Generation Indoor LBSs on a Worldwide Scale.",
                    "Automated Product Localization Through Mobile Data Analysis.",
                    "MR-Cubes: On-the-Fly Computation of Location Popularity from Check-in Data Streams.",
                    "Scalable and Accurate Estimation of Room-Level People Counts from Multi-Modal Fusion of Perimeter Sensors and WiFi Trajectories.",
                    "A Martingale-Based Approach for Flight Behavior Anomaly Detection.",
                    "An Effective Approach on Mining Co-Location Patterns from Spatial Databases with Rare Features.",
                    "Clustering Noisy Trajectories via Robust Deep Attention Auto-Encoders.",
                    "MISCELA: Discovering Correlated Attribute Patterns in Time Series Sensor Data.",
                    "KOLQ in a Road Network.",
                    "Toward System-Optimal Route Guidance.",
                    "Efficient Batch Processing of Shortest Path Queries in Road Networks.",
                    "Group Nearest Compact POI Set Queries in Road Networks.",
                    "Safe Driving at Traffic Lights: An Image Recognition Based Approach.",
                    "Toward Efficient Processing of Spatio-Temporal Workloads in a Distributed In-Memory System.",
                    "A Semantic Sequential Correlation Based LSTM Model for Next POI Recommendation.",
                    "Time-Dependent Reachability Analysis: A Data-Driven Approach.",
                    "Passenger Searching from Taxi Traces Using HITS-Based Inference Model.",
                    "Efficient Photo Crowdsourcing in Delay-Tolerant Networks with Evolving POIs.",
                    "Publishing Sensitive Trajectory Data Under Enhanced l-Diversity Model.",
                    "Detecting Mobile Crowdsensing Context in the Wild.",
                    "Optimizing Rebalance Scheme for Dock-Less Bike Sharing Systems with Adaptive User Incentive.",
                    "Utility-Time Social Event Planning on EBSN.",
                    "k-Collective Influential Facility Placement Over Moving Object.",
                    "A VLOS Compliance Solution to Ground/Aerial Parcel Delivery Problem.",
                    "Mining Prevalent Co-Location Patterns Based on Global Topological Relations.",
                    "TTDM: A Travel Time Difference Model for Next Location Prediction.",
                    "STCNN: A Spatio-Temporal Convolutional Neural Network for Long-Term Traffic Prediction.",
                    "Temporal Graph Convolutional Networks for Traffic Speed Prediction Considering External Factors.",
                    "Sextant: Grab's Scalable In-Memory Spatial Data Store for Real-Time K-Nearest Neighbour Search.",
                    "DriveLaB: An Experimental Platform for Telematics.",
                    "Synchronization-Free GPS Spoofing Detection with Crowdsourced Air Traffic Control Data.",
                    "An Automated Framework for Explaining Facts Extracted From Mobility Datasets.",
                    "MapReuse: Recycling Routing API Queries.",
                    "Road Intersection Detection Based on Direction Ratio Statistics Analysis.",
                    "Traffic Congestion Prediction by Spatiotemporal Propagation Patterns.",
                    "STAR: A Concise Deep Learning Framework for Citywide Human Mobility Prediction.",
                    "Trajectory Prediction from a Mass of Sparse and Missing External Sensor Data.",
                    "Building a Large-Scale Microscopic Road Network Traffic Simulator in Apache Spark.",
                    "A Personal Location Prediction Method to Solve the Problem of Sparse Trajectory Data.",
                    "Deep Learning-Based Spatial Analytics for Disaster-Related Tweets: An Experimental Study.",
                    "SCQ: Stage-Based, Context-Aware, QoE-Driven Power Optimization for Interactive Applications on Mobile Devices.",
                    "Central Station Based Demand Prediction in a Bike Sharing System.",
                    "A Practical Delivery Route Planning System.",
                    "A Charging Scheduling System for Electric Vehicles using Vehicle-to-Grid.",
                    "Computing and Visualizing the Shortest Path between Moving Objects on Road Networks.",
                    "GDMS: A Geospatial Data Mining System for Abnormal Event Detection and Visualization.",
                    "ORSUP: Optimal Route Search with Users' Preferences.",
                    "LaCAVR: Load and Constraints Aware Vehicle Rerouting.",
                    "POLAr: Geographic Placement Optimization for Latency Sensitive Applications.",
                    "SSVisual: Intelligent Start-Stop System.",
                    "TrajSense: Trajectory Prediction from Sparse and Missing External Sensor Data.",
                    "Social-Aware Ridesharing.",
                    "Attention Based Stack ResNet for Citywide Traffic Accident Prediction.",
                    "A Spatial Insight for UGC Apps: Fast Similarity Search on Keyword-Induced Point Groups.",
                    "Deep Learning Method for Citywide Crowd Flows Prediction.",
                    "TCSC: A New Type Of Spatial Crowdsourcing.",
                    "DURS: A Distributed Method for k-Nearest Neighbor Search on Uncertain Graphs.",
                    "Traffic Incident Detection: A Deep Learning Framework.",
                    "A Framework for Constrained Graph Partitioning.",
                    "Mining Human Mobility Data and Social Media for Smart Ride Sharing.",
                    "The Use of Citizen Science in the Characterization of the Lyon's Urban Heat and Cool Islands.",
                    "Understanding Human Behavior through Sensory Data and Location Based Services.",
                    "Towards Usability on Reverse Top-k Geo-Social Keyword Query Results.",
                    "A LSTM and Graph CNN Combined Network for Community House Price Forecasting.",
                    "Outdoor Localization Framework with Telco Data.",
                    "Bluetooth Mesh Networks for Indoor Localization.",
                    "Towards Robust Methods for Indoor Localization using Interval Data.",
                    "Action Recognition from Low-Resolution Infrared Sensor for Indoor use: A Comparative Study between Deep Learning and Classical Approaches.",
                    "Automatic Radio Map Construction Exploiting Mobile Payments.",
                    "Neural Network for Predicting Error of AP Location Estimation Method Using Crowdsourced Wi-Fi Fingerprints.",
                    "A Safe, Efficient and Integrated Indoor Robotic Fleet for Logistic Applications in Healthcare and Commercial Spaces: The ENDORSE Concept.",
                    "CAPRIO: Context-Aware Path Recommendation Exploiting Indoor and Outdoor Information.",
                    "Sequence-Aware Recommendation with Long-Term and Short-Term Attention Memory Networks.",
                    "MODELHealth: An Innovative Software Platform for Machine Learning in Healthcare Leveraging Indoor Localization Services.",
                    "Textile and Apparel Supply Chain with Distributed Ledger Technology (DLT).",
                    "Next Generation Blockchain Network (NGBN).",
                    "Privacy-Protected Blockchain System.",
                    "Construction of Elderly Mutual Aid Time Bank Based on Blockchain.",
                    "Mining Spatial Co-Location Patterns Based on Overlap Maximal Clique Partitioning.",
                    "Fine-Grained Dynamic Population Mapping Method Based on Large-Scale Sparse Mobile Phone Data.",
                    "Mining Significant Co-Location Patterns From Spatial Regional Objects.",
                    "POI Representation Learning by a Hybrid Model.",
                    "Integrated Multiple DEA Specifications and Visualization Technique for Advanced Management Analysis and Decision.",
                    "A Structure-Behavior Coalescence Design Method for Mobile Social Network Systems.",
                    "IDR: Positive Influence Maximization and Negative Influence Minimization Under Competitive Linear Threshold Model.",
                    "A Collusion Avoidance Node Selection Scheme for Social Network-Based Distributed Data Storage.",
                    "Application of Weighted Alternating Least Squares on Constructing the Disease Networks in the Heterogeneous Process of Aging.",
                    "Fine Grained Group Gesture Detection Using Smartwatches.",
                    "Golang-Based POI Discovery and Recommendation in Real Time.",
                    "Popularity Prediction Caching Using Hidden Markov Model for Vehicular Content Centric Networks.",
                    "Mobile Video Multipath Concurrent Transmission Over Heterogeneous Wireless Networks Based on ACO.",
                    "Offline Worker Selection for Real-Time Spatial Crowdsourcing Multi-Worker Tasks.",
                    "Android App Update Timing: A Measurement Study.",
                    "Meta Path-Based Information Entropy for Modeling Social Influence in Heterogeneous Information Networks.",
                    "PTGF: Public Transport General Framework for Identifying Transport Modes Based on Cellular Data.",
                    "Learned Index for Spatial Queries.",
                    "Optimal Delivery Routing in Road Network With Occupancy Detection.",
                    "Prevalent Co-Visiting Patterns Mining from Location-Based Social Networks.",
                    "A Keyword-Aware Optimal Route Query Algorithm on Large-Scale Road Networks.",
                    "Mitigating Congestion Using Environment Protective Dynamic Traffic Orchestration.",
                    "Activity-Based Shared Mobility Model for Smart Transportation.",
                    "CLEAN: Frequent Pattern-Based Trajectory Spatial-Temporal Compression on Road Networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "19th MDM 2018",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2018",
                "sub_name": "19th IEEE International Conference on Mobile Data Management, MDM 2018, Aalborg, Denmark, June 25-28, 2018.",
                "count": 45,
                "papers": [
                    "Future Directions for Indoor Information Systems: A Panel Discussion.",
                    "Sensor Cloud: Sensing-as-a-Service Paradigm.",
                    "Targets and Shapes Tracking (Advanced Seminar).",
                    "Telco Big Data: Current State & Future Directions.",
                    "Optimal Meeting Points for Public Transit Users.",
                    "Crowd-Based Ecofriendly Trip Planning.",
                    "Ridesharing-Inspired Trip Recommendations.",
                    "Stochastic Shortest Path Finding in Path-Centric Uncertain Road Networks.",
                    "DCount - A Probabilistic Algorithm for Accurately Disaggregating Building Occupant Counts into Room Counts.",
                    "Improved Localisation Using Spatio-Temporal Data from Cellular Network.",
                    "Mining Subgraphs from Propagation Networks through Temporal Dynamic Analysis.",
                    "Tensor Methods for Group Pattern Discovery of Pedestrian Trajectories.",
                    "Hierarchical Regions of Interest.",
                    "Adaptive Travel-Time Estimation: A Case for Custom Predicate Selection.",
                    "Decaying Telco Big Data with Data Postdiction.",
                    "POI Recommendation of Location-Based Social Networks Using Tensor Factorization.",
                    "Outlier Detection for Multidimensional Time Series Using Deep Neural Networks.",
                    "Origin-Destination Trajectory Diversity Analysis: Efficient Top-k Diversified Search.",
                    "A Semi-Supervised Approach for the Semantic Segmentation of Trajectories.",
                    "Corridor Learning Using Individual Trajectories.",
                    "Identifying Movements in Noisy Crowd Analytics Data.",
                    "Distributed kNN Query Authentication.",
                    "Privacy Preserving Reverse k-Nearest Neighbor Queries.",
                    "Privacy-Preserving Spatial Crowdsourcing Based on Anonymous Credentials.",
                    "Efficient Matching of Offers and Requests in Social-Aware Ridesharing.",
                    "Reputation and Credit Based Incentive Mechanism for Data-Centric Message Delivery in DTNs.",
                    "Top-k Query Processing with Replication Strategy in Mobile Ad Hoc Networks.",
                    "Load-Balanced Task Allocation for Improved System Lifetime in Mobile Crowdsensing.",
                    "ROGER: An On-Line Flight Efficiency Monitoring System Using ADS-B Data.",
                    "A Cost-Aware Incentive Mechanism in Mobile Crowdsourcing Systems.",
                    "Predicting Visitors Using Location-Based Social Networks.",
                    "Next Check-in Location Prediction via Footprints and Friendship on Location-Based Social Networks.",
                    "Accurate Fuel Estimates Using CAN Bus Data and 3D Maps.",
                    "Frequent Pattern-Based Map-Matching on Low Sampling Rate Trajectories.",
                    "DriveLaB: A Platform for Reducing Speeding.",
                    "Concept for Evaluation of Techniques for Trajectory Distance Measures.",
                    "aSTEP: Aau's Spatio-TEmporal Data Analytics Platform.",
                    "TBD-DP: Telco Big Data Visual Analytics with Data Postdiction.",
                    "Resource-Efficient Transmission of Vehicular Sensor Data Using Context-Aware Communication.",
                    "The AutoMat CVIM - A Scalable Data Model for Automotive Big Data Marketplaces.",
                    "Trajectolizer: Interactive Analysis and Exploration of Trajectory Group Dynamics.",
                    "FMS: Managing Crowdsourced Indoor Signals with the Fingerprint Management Studio.",
                    "VIPTRA: Visualization and Interactive Processing on Big Trajectory Data.",
                    "ChainMOB: Mobility Analytics on Blockchain.",
                    "Data Analytics for Snow Plow Trucks Fleet."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "18th MDM 2017",
        "info": "Daejeon, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2017",
                "sub_name": "18th IEEE International Conference on Mobile Data Management, MDM 2017, Daejeon, South Korea, May 29 - June 1, 2017.",
                "count": 60,
                "papers": [
                    "Geofence Index: A Performance Estimator for the Reliability of Proactive Location-Based Services.",
                    "Effect of Information Propagation on Business Popularity: A Case Study on Yelp.",
                    "Effectiveness of Mobile Notification Delivery.",
                    "TrustCEP: Adopting a Trust-Based Approach for Distributed Complex Event Processing.",
                    "HCoM: Item-Based Similarity Model for Heterogeneous Implicit Feedback.",
                    "An Efficient Online Approach for Direction-Preserving Trajectory Simplification with Interval Bounds.",
                    "Approximately Filtering Redundant Data for Uncertain RFID Data Streams.",
                    "Crowdsourcing Based Evaluation of Ranking Approaches for Spatial Keyword Querying.",
                    "On Evaluating Social Proximity-Aware Spatial Range Queries.",
                    "Finding Influential Local Users with Similar Interest from Geo-Tagged Social Media Data.",
                    "Towards Optimal Free-of-Charge Trip Planning in Bike-Sharing Systems.",
                    "A Balanced Assignment Mechanism for Online Taxi Recommendation.",
                    "Hybrid Bicycle Allocation for Usage Load Balancing and Lifetime Optimization in Bike-Sharing Systems.",
                    "Fairness versus Optimality in Ridesharing.",
                    "Understanding and Predicting Trends in Urban Freight Transport.",
                    "Online Traffic Flow Prediction Using Convolved Bilinear Poisson Regression.",
                    "ARM-K: A Methodology for Mining Associations of Traffic Congested Links.",
                    "Towards Vehicle Emission Estimation from Smartphone Sensors.",
                    "Probabilistic Speed Profiling for Multi-Lane Road Networks.",
                    "Using Mobile Signaling Data to Classify Vehicles on Highways in Real Time.",
                    "Efficient OD Trip Matrix Prediction Based on Tensor Decomposition.",
                    "Confidence Model-Based Data Repair for Telco Localization.",
                    "Indoor Localization Accuracy Estimation from Fingerprint Data.",
                    "A Traffic Analysis Perspective on Communication in the Brain.",
                    "IBS: An Efficient Stateful Algorithm for Optimal Sequenced Group Trip Planning Queries.",
                    "Weighted Optimal Sequenced Group Trip Planning Queries.",
                    "Efficient Multi-Destinations Route Planning with Deadlines and Cost Constraints.",
                    "The Hitchhiker's Guide to the Optimal Route Planning.",
                    "Assessing the Accuracy Benefits of On-the-Fly Trajectory Selection in Fine-Grained Travel-Time Estimation.",
                    "Topic Model-Based Road Network Inference from Massive Trajectories.",
                    "Discovering Evolving Moving Object Groups from Massive-Scale Trajectory Streams.",
                    "Exploiting Trip Patterns in Passenger Trajectory Streams for Bus Scheduling Optimization in Real Time.",
                    "Partitioning Road Network Streams Based on Runtime Correlation Discovery.",
                    "SCI-FII: Speculative Conversational Interface Framework for Incremental Inference on Modularized Services.",
                    "Kaleido: Implementing a Novel Data System for Multi-Device Synchronization.",
                    "ASN.1 Specification for ETSI Certificates and Encoding Performance Study.",
                    "Experimental Study of Telco Localization Methods.",
                    "Footfall Count Estimation Techniques Using Mobile Data.",
                    "NOVEL: NO-VowEL Technique to Search Fuzzy Keyword.",
                    "Top-k Sequenced Route Queries.",
                    "Step Detection Algorithm for Accurate Distance Estimation Using Dynamic Step Length.",
                    "Taxonomy-Induced Matrix Factorization for Inferring Preference of Mobile Telecom Users.",
                    "Secure SMS Transmission Based on Verifiable Hash Convergent Group Signcryption.",
                    "A Mobile Application for Fine Dust Monitoring System.",
                    "Sensitive Data Leakage Detection in Pre-Installed Applications of Custom Android Firmware.",
                    "Point-of-Interest Recommendation for Location Promotion in Location-Based Social Networks.",
                    "Short-Term User Activity Prediction with Massive Mobile Broadband Data.",
                    "UDAT: User Discrimination Using Activity-Time Information.",
                    "ConflictFinder: Mining Maritime Traffic Conflict from Massive Ship Trajectories.",
                    "ACCES: Offline Accuracy Estimation for Fingerprint-Based Localization.",
                    "A Temporal Community Contexts Based Funny Joke Generation.",
                    "Efficient Temporal Information Extraction from Korean Documents.",
                    "A Chatbot for Psychiatric Counseling in Mental Healthcare Service Based on Emotional Dialogue Analysis and Sentence Generation.",
                    "A Novel Concept of the Rehabilitation Training Coach Robot for Patients with Disability.",
                    "Automating Papanicolaou Test Using Deep Convolutional Activation Feature.",
                    "Model Regularization of Deep Neural Networks for Robust Clinical Opinions Generation from General Blood Test Results.",
                    "A Look at Wearable Abandonment.",
                    "An Automatic Mobile App Testing Method with User Event Scenario.",
                    "Movement Classification based on Acceleration Spectrogram with Dynamic Time Warping Method.",
                    "Reducing Energy Consumption of a Modem via Selective Packet Transmission Delaying."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th MDM 2016",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2016",
                "sub_name": "IEEE 17th International Conference on Mobile Data Management, MDM 2016, Porto, Portugal, June 13-16, 2016.",
                "count": 55,
                "papers": [
                    "Developing and Deploying Mobile Sensing Applications in the Wild.",
                    "How to Turn Data into a Smart Colution: Smart Cities Use Case.",
                    "LiveLabs: Building Real-World Testbeds for Mobile Sensing, Analytics, and Intervention Experiments.",
                    "Advanced Query Answering Techniques over Big Mobile Data.",
                    "Group Finder: An Item-Driven Group Formation Framework.",
                    "A Framework to Model Human Behavior at Large Scale during Natural Disasters.",
                    "MobiHerd: Towards Enabling Cost-Effective and Scalable Mobile Group Buying.",
                    "Characterizing User Mobility from the View of 4G Cellular Network.",
                    "Building the Case for Dynamic Location Query Processing.",
                    "Web Access Patterns Enhancing Data Access Performance of Cooperative Caching in IMANETs.",
                    "Top-K with Diversity-M Data Retrieval in WSNs.",
                    "Finding Geospatial Resources Using Uncertain Data.",
                    "MPG: Not So Random Exploration of a City.",
                    "Estimating Urban Traffic Congestions with Multi-sourced Data.",
                    "ParkGauge: Gauging the Occupancy of Parking Garages with Crowdsensed Parking Characteristics.",
                    "Online Risk Prediction for Indoor Moving Objects.",
                    "Online Clustering of Trajectory Data Stream.",
                    "Distributed Convoy Pattern Mining.",
                    "Scalable Processing of Location-Based Social Networking Queries.",
                    "Collaborative Co-clustering across Multiple Social Media.",
                    "A Bayesian-Based Approach for Activity and Mobility Inference in Location-Based Social Networks.",
                    "Real-Time and Cost-Effective Limitation of Misinformation Propagation.",
                    "A Model of Multimodal Ridesharing and Its Analysis.",
                    "Bicycle-Sharing System Analysis and Trip Prediction.",
                    "Taxi, Please! A Nearest Neighbor Query in Time-Dependent Road Networks.",
                    "A Flexible Real-Time Ridesharing System Considering Current Road Conditions.",
                    "PRI-Navigator: An Efficient Approach for Logistic Route Planning with Pick-up and Delivery.",
                    "From Human Mobility to Data Mobility: Leveraging Spatiotemporal History in Device-to-Device Information Diffusion.",
                    "Opportunistic Computation Offloading in Mobile Edge Cloud Computing Environments.",
                    "Experiences with Sensor-Based Research for Critical, Socio-technical Systems.",
                    "Presumably Simple: Monitoring Crowds Using WiFi.",
                    "A Mobile Chinese Character Image Recognition Platform.",
                    "K-Closest Pairs Queries in Road Networks.",
                    "ParDiSP: A Partition-Based Framework for Distance and Shortest Path Queries on Road Networks.",
                    "D-Grid: An In-Memory Dual Space Grid Index for Moving Object Databases.",
                    "Efficient Access to Temporally Overlaying Spatial and Textual Trajectories.",
                    "Differentially-Private Mining of Representative Travel Patterns.",
                    "On the Privacy of Frequently Visited User Locations.",
                    "The Secure Data Container: An Approach to Harmonize Data Sharing with Information Security.",
                    "A Case Study of Mobile User Behaviors Using Spatio-temporal Data.",
                    "Modeling and Analyzing Electric Vehicle Charging.",
                    "An Unsupervised Collaborative Approach to Identifying Home and Work Locations.",
                    "Understanding Urban Mobility via Taxi Trip Clustering.",
                    "FoGBAT: Combining Bluetooth and GPS Data for Better Traffic Analytics.",
                    "Tethys: Sensor-Based Aquatic Quality Monitoring in Waterways.",
                    "Incorporating Weather Updates for Public Transportation Users of Recommendation Systems.",
                    "Efficient Trajectory Analysis for Several Time-Dependent Attributes: A Case Study for Roe Deer.",
                    "Visualize People's Mobility - Both individually and Collectively - Using Mobile Phone Cellular Data.",
                    "Enhancing Virtual Reality Systems with Smart Wearable Devices.",
                    "UTE: A Ubiquitous Data Exploration Platform for Mobile Sensing Experiments.",
                    "CrowdRankEval: A Ranking Function Evaluation Framework for Spatial Keyword Queries.",
                    "Dynamic and Personalized Routing in PreGo.",
                    "Secure Candy Castle - A Prototype for Privacy-Aware mHealth Apps.",
                    "A Framework for Online Mobility Pattern Discovery from Trajectory Data Streams.",
                    "BusesinRio: Buses as Mobile Traffic Sensors: Managing the Bus GPS Data in the City of Rio de Janeiro."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2016w",
                "sub_name": "IEEE 17th International Conference on Mobile Data Management, MDM 2016, Porto, Portugal, June 13-16, 2016 - Workshops.",
                "count": 20,
                "papers": [
                    "Geometric Aspects and Auxiliary Features to Top-k Processing.",
                    "Compression of Spatio-temporal Data.",
                    "Mobile Computing, Internet of Things, and Big Data for Urban Informatics.",
                    "Social Influence Analysis Using Mobile Phone Dataset.",
                    "Event Detection: Monitoring and Tracking the Dynamics of Social Networks Communities.",
                    "Social Network Analysis of Mobile Streaming Networks.",
                    "Optimal Task Assignment in Sensor Networks.",
                    "The Use of Autonomous UAVs to Improve Pesticide Application in Crop Fields.",
                    "A Framework for Chainsaw Detection Using One-Class Kernel and Wireless Acoustic Sensor Networks into the Amazon Rainforest.",
                    "Active Learning for On-Line Partial Discharge Monitoring in Noisy Environments.",
                    "Evolving Centralities in Temporal Graphs: A Twitter Network Analysis.",
                    "Mining the Twitter Stream: Unravel Events, Interactions, and Communities in Real-Time.",
                    "Sampling Evolving Ego-Networks with forgetting Factor.",
                    "New Challenges and Research Trend in Activity Recognition.",
                    "APISENSE (http: //apisense.io).",
                    "Scaling a Real-Time Driving Behaviour Analysis System.",
                    "Emerging Applications of Context-Aware Systems in Healthcare.",
                    "SmartVent: A Context Aware IoT System to Measure Indoor Air Quality and Ventilation Rate.",
                    "Context-Aware Mobile Recommender System Based on Activity Patterns.",
                    "Human Activity Recognition by Means of Online Semi-supervised Learning."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16th MDM 2015",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2015-1",
                "sub_name": "16th IEEE International Conference on Mobile Data Management, MDM 2015, Pittsburgh, PA, USA, June 15-18, 2015 - Volume 1.",
                "count": 49,
                "papers": [
                    "Converting Mobile Sensing in Data and Data into Action.",
                    "Always Fleeting: Indexing Moving Objects.",
                    "Living on the Edge with Only Clouds to Fall Back on.",
                    "SHAREK: A Scalable Dynamic Ride Sharing System.",
                    "Vehicle Routing with User-Generated Trajectory Data.",
                    "A Mixed Breadth-Depth First Search Strategy for Sequenced Group Trip Planning Queries.",
                    "Radio Map Prefetching for Indoor Navigation in Intermittently Connected Wi-Fi Networks.",
                    "Sleep Well: A Sound Sleep Monitoring Framework for Community Scaling.",
                    "RECATHON: A Middleware for Context-Aware Recommendation in Database Systems.",
                    "Processing Convex Hull Queries in MANETs.",
                    "Who Will Attend? - Predicting Event Attendance in Event-Based Social Network.",
                    "Personalized Event Recommendations Using Social Networks.",
                    "Socialite: A Flexible Framework for Social Internet of Things.",
                    "COMA: Road Network Compression for Map-Matching.",
                    "Finding Important Locations: A Feature-Based Approach.",
                    "Making Sense of Trajectory Data in Indoor Spaces.",
                    "Efficient Computation of Group Optimal Sequenced Routes in Road Networks.",
                    "Group Processing of Simultaneous Shortest Path Queries in Road Networks.",
                    "Scalable Spatial Crowdsourcing: A Study of Distributed Algorithms.",
                    "SmartSource: A Mobile Q&A Middleware Powered by Crowdsourcing.",
                    "Efficient and Scalable Spatial Retrieval of Resident Involvement Information in City Events.",
                    "How to Deal with Third Party Apps in a Privacy System - The PMP Gatekeeper -.",
                    "Resource Allocation for Heterogeneous Traffic in LTE Virtual Networks.",
                    "Predictive Caching Framework for Mobile Wireless Networks.",
                    "Battery-Efficient Transportation Mode Detection on Mobile Devices.",
                    "On the Feasibility of Leveraging Smartphone Accelerometers to Detect Explosion Events.",
                    "Leveraging Smartphone Advances for Continuous Location Privacy.",
                    "Continuous Median Queries in Wireless Sensor Networks.",
                    "AARPA: Combining Mobile and Power-Line Sensing for Fine-Grained Appliance Usage and Energy Monitoring.",
                    "Comparing Urban Sensing Applications Using Event and Network-Driven Mobile Phone Location Data.",
                    "CommSense: Identify Social Relationship with Phone Contacts via Mining Communications.",
                    "Mining Risk Factors in RFID Baggage Tracking Data.",
                    "From Mobile Phone Data to Transport Network - Gaining Insight about Human Mobility.",
                    "Efficient Cloud-Based Real-Time Geo-Information Delivery for Mobile Users.",
                    "USapiens: A System for Urban Trajectory Data Analytics.",
                    "Interactive and Scalable Exploration of Big Spatial Data - A Data Management Perspective.",
                    "Towards a Microblogs Data Management System.",
                    "Labyrinth: Visually Configurable Data-Leakage Detection in Mobile Applications.",
                    "Scalable Mockup Experiments on Smartphones Using Smart Lab.",
                    "Anyplace: A Crowdsourced Indoor Information Service.",
                    "PPTM: Privacy-Aware Participatory Traffic Monitoring Using Mobile Secure Probes.",
                    "iCOMOT - A Toolset for Managing IoT Cloud Systems.",
                    "The PersonaCheck System for Personalizing M-Commerce Checkout Processes.",
                    "A Map-Matching Aware Framework for Road Network Compression.",
                    "A Prototype of an Augmented Reality Browser for Natural Environment Studies.",
                    "Location and Time Optimizations for Traveling Clients.",
                    "Aerial Vehicle Trajectory Design for Task Aggregation.",
                    "Decentralized Collaborative Editing Platform.",
                    "A Framework for Spatial Predictive Query Processing and Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2015-2",
                "sub_name": "16th IEEE International Conference on Mobile Data Management, MDM 2015, Pittsburgh, PA, USA, June 15-18, 2015 - Volume 2.",
                "count": 27,
                "papers": [
                    "Querying of Geo-Textual Web Content: Concepts and Techniques.",
                    "Internet of Things: Challenges and State-of-the-Art Solutions in Internet-Scale Sensor Information Management and Mobile Analytics.",
                    "The Era of Big Spatial Data: Challenges and Opportunities.",
                    "Mobile Data Management in Indoor Spaces.",
                    "Spatial Predictive Queries.",
                    "Managing Infrastructure-Based Vehicular Networks.",
                    "An Interactive Freight-Pooling Service for Efficient Last-Mile Delivery.",
                    "Content Replication in Mobile Vehicular Ad-Hoc Networks.",
                    "A Logic-Based Security Framework for Mobile Perimeter.",
                    "IGOD - Identifying Geolocation of Cloud Datacenter Hosting Mobile User's Data.",
                    "A Risk Assessment Framework for Wireless Sensor Networks in a Sensor Cloud.",
                    "Human Mobility Computing and Privacy: Fad or Reality?",
                    "An Analysis of the Walking Environmental Factors Affecting the Stress of Pedestrians for Route Recommendation.",
                    "Top - k Query Based Dynamic Scheduling for IoT-enabled Smart City Waste Collection.",
                    "SensePresence: Infrastructure-Less Occupancy Detection for Opportunistic Sensing Applications.",
                    "Exploring Institution-Based Mobility: Which Universities Attract Athletes from Distant and Diverse Locales?",
                    "Differentially Private Real-Time Data Release over Infinite Trajectory Streams.",
                    "BusMate: Understanding Mobility Behavior for Trajectory-Based Advertising.",
                    "SST: Privacy Preserving for Semantic Trajectories.",
                    "Large-Scale Human Mobility Analysis Based on Mobile Phone and Social Media Communication: A Case-Study in Africa.",
                    "Measuring the External Influence in Information Diffusion.",
                    "Rayzit: An Anonymous and Dynamic Crowd Messaging Architecture.",
                    "A Weighted Distance Similarity Model to Improve the Accuracy of Collaborative Recommender System.",
                    "Usage of Annotation Tags in the Problem of Mining Similar Users.",
                    "A Model of Relevant Common Author and Citation Authority Propagation for Citation Recommendation.",
                    "A Platform for Travel Planning by Using Google Maps.",
                    "A Framework for Healthcare Everywhere: BMI Prediction Using Kinect and Data Mining Techniques on Mobiles."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15th MDM 2014",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2014-1",
                "sub_name": "IEEE 15th International Conference on Mobile Data Management, MDM 2014, Brisbane, Australia, July 14-18, 2014 - Volume 1.",
                "count": 52,
                "papers": [
                    "Mobile Big Data Analytics: Research, Practice, and Opportunities.",
                    "Supporting Location-Based Services in a Main-Memory Database.",
                    "Cost-Efficient Spatial Network Partitioning for Distance-Based Query Processing.",
                    "A*-based Solutions for KNN Queries with Operating Time Constraints in Time-Dependent Road Networks.",
                    "Trip Recommendation with Multiple User Constraints by Integrating Point-of-Interests and Travel Packages.",
                    "Estimating Common Pedestrian Routes through Indoor Path Networks Using Position Traces.",
                    "WhereToGo: Personalized Travel Recommendation for Individuals and Groups.",
                    "Differentially Private Location Recommendations in Geosocial Networks.",
                    "Design and Implementation of the Privacy Management Platform.",
                    "Spatial Task Assignment for Crowd Sensing with Cloaked Locations.",
                    "A Location-Based Authentication System Leveraging Smartphones.",
                    "NITOS BikesNet: Enabling Mobile Sensing Experiments through the OMF Framework in a City-Wide Environment.",
                    "E-VeT: Economic Reward/Penalty-Based System for Vehicular Traffic Management.",
                    "Efficient and Secure Code Dissemination in Sensor Clouds.",
                    "9 Million Bicycles? Extending Induction Loops with Bluetooth Sensing.",
                    "Handling False Negatives in Indoor RFID Data.",
                    "Pattern-Wise Trust Assessment of Sensor Data.",
                    "Trajectory Event Cleaning for Mobile RFID Objects.",
                    "Effective Mobile Context Pattern Discovery via Adapted Hierarchical Dirichlet Processes.",
                    "ConCon: Context-Aware Middleware for Content Sharing in Dynamic Participating Environments.",
                    "Using Location-Based Social Networks for Time-Constrained Information Dissemination.",
                    "MadApp: A Middleware for Opportunistic Data in Mobile Web Applications.",
                    "A Clustering Approach to the Discovery of Points of Interest from Geo-Tagged Microblog Posts.",
                    "Finding Dense Locations in Indoor Tracking Data.",
                    "Mining Mobility Evolution from Check-In Datasets.",
                    "A Smartphone User Activity Prediction Framework Utilizing Partial Repetitive and Landmark Behaviors.",
                    "Distinguishing Electric Vehicles from Fossil-Fueled Vehicles with Mobile Sensing.",
                    "Cloud-Based Query Evaluation for Energy-Efficient Mobile Sensing.",
                    "Overhearing-Based Efficient Boundary Detection in Dense Mobile Wireless Sensor Networks.",
                    "Social-Aware Top-k Spatial Keyword Search.",
                    "Keyword Based Semantic Search for Mobile Data.",
                    "ToSS-it: A Cloud-Based Throwaway Spatial Index Structure for Dynamic Location Data.",
                    "Efficient Retrieval of Top-K Most Similar Users from Travel Smart Card Data.",
                    "Efficient Top-k Spatial Locality Search for Co-located Spatial Web Objects.",
                    "Top-k Query Processing and Malicious Node Identification against Data Replacement Attack in MANETs.",
                    "CityZen: A Cost-Effective City Management System with Incentive-Driven Resident Engagement.",
                    "RoadEye: A System for Personalized Retrieval of Dynamic Road Conditions.",
                    "ScoDA: Cooperative Content Adaptation Framework for Mobile Browsing.",
                    "eHealth TABLET: A Developing Country Perspective in Managing the Development and Deployment of a Mobile - Cloud Electronic Medical Record for Local Government Units.",
                    "Enabling Location-Based Services 2.0: Challenges and Opportunities.",
                    "Oscillation Resolution for Mobile Phone Cellular Tower Data to Enable Mobility Modelling.",
                    "EnviS Tag, Scan, View: A Location-Based App for Visualizing Spatio-temporal Data from Sensor Cloud.",
                    "ORange: Objective-Aware Range Query Refinement.",
                    "Real-Time QoS Monitoring for Cloud-Based Big Data Analytics Applications in Mobile Environments.",
                    "Hybrid Queries over Symbolic and Spatial Trajectories: A Usage Scenario.",
                    "An Interactive Analytics Tool for Understanding Location Semantics and Mobility of Users Using Mobile Network Data.",
                    "A Cross-Media Music Retrieval System by Converting Color Changes into Tonal Changes.",
                    "RouteMiner: Mining Ship Routes from a Massive Maritime Trajectories.",
                    "SimMiner: A Tool for Discovering User Similarity by Mining Geospatial Trajectories.",
                    "HipStream: A Privacy-Preserving System for Managing Mobility Data Streams.",
                    "A Demonstration of the NITOS BikesNet Framework.",
                    "PopTour: Discovering Journey Group T-Patterns from Instagram Trajectories to Recommend Hot Travel Routes."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2014-2",
                "sub_name": "IEEE 15th International Conference on Mobile Data Management, MDM 2014, Brisbane, Australia, July 14-18, 2014 - Volume 2.",
                "count": 17,
                "papers": [
                    "Semantic Trajectories and Beyond.",
                    "Fusing Information, Crowdsourcing and Mobility.",
                    "Dynamic Content and Route Management in Wireless Networks.",
                    "Information Enrichment for Tourist Spot Recommender System Using Location Aware Crowdsourcing.",
                    "K Anonymity Based on Fuzzy Spatio-temporal Context.",
                    "Towards High Performance Spatio-temporal Data Management Systems.",
                    "A Framework for Continuous Group Activity Recognition Using Mobile Devices: Concept and Experimentation.",
                    "Understanding Sustainable Mobility: The Potential of Electric Vehicles.",
                    "Skyline Travel Routes: Exploring Skyline for Trip Planning.",
                    "Home and Work Place Prediction for Urban Planning Using Mobile Network Data.",
                    "Human Mobility Prediction and Unobstructed Route Planning in Public Transport Networks.",
                    "Energy Efficient Resource Distribution for Mobile Wireless Sensor Networks.",
                    "A Negative Location-Based Information Dissemination Method in Mobile Ad Hoc Networks.",
                    "Towards Declarative Programming for Mobile Crowdsourcing: P2P Aspects.",
                    "Challenges in Crowdsourcing Real-Time Information for Public Transportation.",
                    "Exploring Location-Related Data on Smart Phones for Activity Inference.",
                    "edPAS: Event-Based Dynamic Parking Allocation System in Vehicular Networks."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th MDM 2013",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2013-1",
                "sub_name": "2013 IEEE 14th International Conference on Mobile Data Management, Milan, Italy, June 3-6, 2013 - Volume 1.",
                "count": 50,
                "papers": [
                    "Querying the Web with Local Intent.",
                    "Automated Vehicles: Autonomous or Connected?",
                    "Smart System Design: Industrial Challenges and Perspectives.",
                    "Large-Scale Participatory Urban Sensing: A Fad or Reality?",
                    "Efficient Location Based Services for Groups of Mobile Users.",
                    "Real-Time Street Parking Availability Estimation.",
                    "PLUTUS: Leveraging Location-Based Social Networks to Recommend Potential Customers to Venues.",
                    "Efficient Approaches for Multi-requests Route Planning in Urban Areas.",
                    "COMPASS - Optimized Routing for Efficient Data Access in Mobile Chord-Based P2P Systems.",
                    "USense - A Smartphone Middleware for Community Sensing.",
                    "On Alleviating Beacon Overhead in Routing Protocols for Urban VANETs.",
                    "A Probabilistic Encryption Based MIN/MAX Computation in Wireless Sensor Networks.",
                    "A Practical Location Privacy Attack in Proximity Services.",
                    "Routing Service Quality - Local Driver Behavior Versus Routing Services.",
                    "HUNTS: A Trajectory Recommendation System for Effective and Efficient Hunting of Taxi Passengers.",
                    "Distant-Time Location Prediction in Low-Sampling-Rate Trajectories.",
                    "T-Watcher: A New Visual Analytic System for Effective Traffic Surveillance.",
                    "Building Accurate 3D Spatial Networks to Enable Next Generation Intelligent Transportation Systems.",
                    "Energy-Efficient Collaborative Query Processing Framework for Mobile Sensing Services.",
                    "Efficient Spatio-temporal Information Fusion in Sensor Networks.",
                    "Exploiting Foursquare and Cellular Data to Infer User Activity in Urban Environments.",
                    "Understanding Sequential Decisions via Inverse Reinforcement Learning.",
                    "Spatiotemporal Data Cleansing for Indoor RFID Tracking Data.",
                    "Identifying Typical Movements among Indoor Objects - Concepts and Empirical Study.",
                    "Hybrid Indoor Positioning with Wi-Fi and Bluetooth: Architecture and Performance.",
                    "Continuous Query Processing for Actual and Predicted Object Flow in Symbolic Space.",
                    "Mobile Stream Sampling under Time Constraints.",
                    "Cost-Based Quantile Query Processing in Wireless Sensor Networks.",
                    "Modeling of Traffic-Aware Travel Time in Spatial Networks.",
                    "A Robust Routing Method for Top-k Queries in Mobile Ad Hoc Networks.",
                    "Uncovering Temporal and Spatial Localities in Individuals' Mobility.",
                    "SaLsA Streams: Dynamic Context Models for Autonomous Transport Vehicles Based on Multi-sensor Fusion.",
                    "Holistic Load-Balancing in a Distributed Spatial Cache.",
                    "Selective Offload and Proactive Caching of Mobile Data in LTE-Based Urban Networks.",
                    "Information Fusion Based on Collective Intelligence for Multi-robot Search and Rescue Missions.",
                    "Evaluation of Spatial Keyword Queries with Partial Result Support on Spatial Networks.",
                    "A Data Warehouse Solution for Analyzing RFID-Based Baggage Tracking Data.",
                    "Building a Delay-Tolerant Cloud for Mobile Data.",
                    "A Proactive Application to Monitor Truck Fleets.",
                    "Privacy Management for Mobile Platforms - A Review of Concepts and Approaches.",
                    "Context-Aware Sensor Search, Selection and Ranking Model for Internet of Things Middleware.",
                    "EXSED: An Intelligent Tool for Exploration of Social Events Dynamics from Augmented Trajectories.",
                    "On the Privacy of Real-World Friend-Finder Services.",
                    "MOIR/UOTS: Trip Recommendation with User Oriented Trajectory Search.",
                    "EcoTour: Reducing the Environmental Footprint of Vehicles Using Eco-routes.",
                    "IndoorSTG: A Flexible Tool to Generate Trajectory Data for Indoor Moving Objects.",
                    "FlowPredictor: Continuous Queries on Actual and Predicted Object Flow in Symbolic Space.",
                    "A Platform for Privacy-Preserving Geo-social Recommendation of Points of Interest.",
                    "How to Assure Privacy on Android Phones and Devices?",
                    "A Novel Mobile Framework for Anonymity Techniques and Services Research."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2013-2",
                "sub_name": "2013 IEEE 14th International Conference on Mobile Data Management, Milan, Italy, June 3-6, 2013 - Volume 2.",
                "count": 47,
                "papers": [
                    "Personal Data Management with Secure Hardware: How to Keep Your Data at Hand.",
                    "Crowdsourcing for Mobile Data Management.",
                    "Social Networking and Mobility: A Data Management Perspective.",
                    "Visual Analysis of Mobility Data.",
                    "Using Mobile Agents in Vehicular Networks for Data Processing.",
                    "Smartphone-Assisted Mobility in Urban Environments for Visually Impaired Users through Computer Vision and Sensor Fusion.",
                    "Location Privacy Management and Protection in Geo-social Networks.",
                    "Distributed Complex Event Processing in Sensor Networks.",
                    "An Open-Source Based ITS Platform.",
                    "SmartCampusAAU - An Open Platform Enabling Indoor Positioning and Navigation.",
                    "Collaborative Mobile Application and Advanced Services for Smart Parking.",
                    "Hiding Sensitive Patterns from Sequence Databases: Research Challenges and Solutions.",
                    "Device Names in the Wild: Investigating Privacy Risks of Zero Configuration Networking.",
                    "Distance-Based k^m-Anonymization of Trajectory Data.",
                    "Privacy Challenges in Third-Party Location Services.",
                    "Privacy through Uncertainty in Location-Based Services.",
                    "Location Sharing with Trusted Peers - Measuring Sensitivity of Location Observations.",
                    "Gonio, Aequus and Incognitus: Three Spatial Granularities for Privacy-Aware Systems.",
                    "Query by Impression: A Novel Place Query System with Adjacency Constraints.",
                    "Opinion Mining on Social Media Data.",
                    "KAMP: Preserving k-Anonymity for Combinations of Patterns.",
                    "A Temporal Probabilistic Model for Dynamic Circle Recommendation in Mobile Applications.",
                    "CLODA: A Crowdsourced Linked Open Data Architecture.",
                    "Bluetooth-Based Mobile P2P Framework for Preference-Aware Data Dissemination on Social Networks.",
                    "A Chinese Restaurant Recommendation System Based on Mobile Context-Aware Services.",
                    "Maintain User Locations on Google Cloud Considering Users Privacy and Energy Saving for Mobile Social Networking Applications.",
                    "SentiMeter-Br: A Social Web Analysis Tool to Discover Consumers' Sentiment.",
                    "Modeling High Predictability and Scaling Laws of Human Mobility.",
                    "An Efficient Pre-computation Technique for Approximation Distance Query in Road Networks.",
                    "A Gravity Model for Speed Estimation over Road Network.",
                    "Recognizing High-Level Contexts from Smartphone Built-In Sensors for Mobile Media Content Recommendation.",
                    "Estimating Real Human Trajectories through Mobile Phone Data.",
                    "GPS Sensing Systems and Fuzzy Rules to Improve Urban Navigation Assistance and Planning.",
                    "Open Architecture for Mobile Data Collection Using Cloud Computing.",
                    "Analysis of End-to-End SOA Security Protocols with Mobile Devices.",
                    "Design and Implementation of VOD (Video on Demand) SaaS Framework for Android Platform on Cloud Environment.",
                    "Behavioral Modeling for Suspicious Process Detection in Cloud Computing Environments.",
                    "A Roadmap on Improved Performance-centric Cloud Storage Estimation Approach for Database System Deployment in Cloud Environment.",
                    "Mobile Healthcare Systems with Multi-cloud Offloading.",
                    "Code Migration in Mobile Clouds with the NAM4J Middleware.",
                    "Multi-user Attribute Based Searchable Encryption.",
                    "eCloudIDS Tier-1 iCloudIDM Layer-I (iCloudIDM-LI) Subsystem Design and Implementation through User-centric Identity Management Approach for Secure Cloud Computing Environment.",
                    "Utterance Classification Using Linguistic and Non-linguistic Information for Network-Based Speech-to-Speech Translation Systems.",
                    "WFST-Based Spoken Dialogue System on Smartphones - Its Development and Implementation for Field Use.",
                    "Speech Recognition and Spoken Language Understanding for Mobile Personal Assistants: A Case Study of \"Shabette Concier\".",
                    "Multilingual Speech-to-Speech Translation System: VoiceTra.",
                    "Complementary Integration of Heterogeneous Crowd-Sourced Datasets for Enhanced Social Analytics."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th MDM 2012",
        "info": "Bengaluru, India",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2012",
                "sub_name": "13th IEEE International Conference on Mobile Data Management, MDM 2012, Bengaluru, India, July 23-26, 2012.",
                "count": 58,
                "papers": [
                    "Efficient Similarity Joins on Massive High-Dimensional Datasets Using MapReduce.",
                    "Elastic Load-Balancing in a Distributed Spatial Cache Overlay.",
                    "Key Formulation Schemes for Spatial Index in Cloud Data Managements.",
                    "Parking in Competitive Settings: A Gravitational Approach.",
                    "MELOC: Memory and Location Optimized Caching Model for Small Mobile Ad Hoc Networks.",
                    "DATEM: Towards QoS Aware Event Notification Framework for Delay Tolerant Networks.",
                    "Implementing and Optimizing an Encryption Filesystem on Android.",
                    "Exploiting Rich Telecom Data for Increased Monetization of Telecom Application Stores.",
                    "Cooperative Scalable Moving Continuous Query Processing.",
                    "Continuous All k-Nearest-Neighbor Querying in Smartphone Networks.",
                    "A Spatial Caching Framework for Map Operations in Geographical Information Systems.",
                    "On Packing Very Large R-trees.",
                    "OptiMoS: Optimal Sensing for Mobile Sensors.",
                    "Using On-the-Move Mining for Mobile Crowdsensing.",
                    "A Predictive Protocol for Mobile Context Updates with Hard Energy Constraints.",
                    "Comet: Decentralized Complex Event Detection in Mobile Delay Tolerant Networks.",
                    "Optimizing Multiple Data Acquisition Queries in Sparse Mobile Sensor Networks.",
                    "An Efficient, Robust, and Scalable Trust Management Scheme for Unattended Wireless Sensor Networks.",
                    "Trust Management of Encrypted Data Aggregation in a Sensor Network Environment.",
                    "Privacy-Preserving Data Management in Mobile Environments: A Partial Encryption Approach.",
                    "Encrypted Searchable Storage of RFID Tracking Data.",
                    "Privacy-Preserving Sharing of Sensitive Semantic Locations under Road-Network Constraints.",
                    "Secure Hierarchical Data Aggregation in Wireless Sensor Networks: Performance Evaluation and Analysis.",
                    "Tracking the Dynamic Distribution of People in Indoor Space with Noisy Partitioning Sensors.",
                    "Low Energy and Sufficiently Accurate Localization for Non-smartphones.",
                    "Calibrating Large Scale Vehicle Trajectory Data.",
                    "Motion Trends Detection in Wireless Sensor Networks.",
                    "BP-growth: Searching Strategies for Efficient Behavior Pattern Mining.",
                    "Online Identification of Dwell Regions for Moving Objects.",
                    "MWGen: A Mini World Generator.",
                    "ComeTogether: Discovering Communities of Places in Mobility Data.",
                    "Maximizing Vehicular Network Connectivity through an Effective Placement of Road Side Units Using Voronoi Diagrams.",
                    "Social and Sensor Data Fusion in the Cloud.",
                    "PhonePark: Street Parking Using Mobile Phones.",
                    "Detecting Hazardous Vehicles and Disseminating Their Behavior in Urban Areas.",
                    "Place Learning via Direct WiFi Fingerprint Clustering.",
                    "Mining Significant Places from Cell ID Trajectories: A Geo-grid Based Approach.",
                    "System Management with IBM Mobile Systems Remote: A Question of Power and Scale.",
                    "Securing Enterprise Data on Smartphones Using Run Time Information Flow Control.",
                    "Cityride: A Predictive Bike Sharing Journey Advisor.",
                    "The Airplace Indoor Positioning Platform for Android Smartphones.",
                    "MARS: A Personalised Mobile Activity Recognition System.",
                    "To Taxi or Not to Taxi? - Enabling Personalised and Real-Time Transportation Decisions for Mobile Users.",
                    "SmartP2P: A Multi-objective Framework for Finding Social Content in P2P Smartphone Networks.",
                    "A Demonstration of Mining Significant Places from Cell ID Trajectories through a Geo-grid Based Approach.",
                    "A Smart Mobile Application for Identifying Storage Location of Small Industrial Assets.",
                    "SAWLnet: Sensitivity Aware Location Cloaking on Road-NETworks.",
                    "SimPl: A Simulation Platform for Elastic Load-Balancing in a Distributed Spatial Cache Overlay.",
                    "Building Activity Definitions to Recognize Complex Activities Using an Online Activity Toolkit.",
                    "Delivering Mobile eGovernance on Low-End-Phones.",
                    "Take Control of Your SMSes: Designing an Usable Spam SMS Filtering System.",
                    "Misco: A System for Data Analysis Applications on Networks of Smartphones Using MapReduce.",
                    "Mobile Data Stream Mining: From Algorithms to Applications.",
                    "Crowdsourcing: Dynamic Data Management in Mobile P2P Networks.",
                    "Defending Location Privacy Using Zero Knowledge Proof Concept in Location Based Services.",
                    "Framework for Collaborative Download in Wireless Mobile Environment.",
                    "Extracting Region of Interest (ROI) Details Using LBS Infrastructure and Web-Databases.",
                    "Secured Data Management Paradigm for Mobile Grid Environment Using Surrogate Objects."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th MDM 2011",
        "info": "Luleå, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2011-1",
                "sub_name": "12th IEEE International Conference on Mobile Data Management, MDM 2011, Luleå, Sweden, June 6-9, 2011, Volume 1.",
                "count": 52,
                "papers": [
                    "Mobile Data - Essential Part of a Smarter Planet.",
                    "Mobile Data Management - A Dozen Years Later.",
                    "Mobility, Data Mining and Privacy Understanding Human Movement Patterns from Trajectory Data.",
                    "Challenges for Mobile Data Management in the Era of Cloud and Social Computing.",
                    "MD-HBase: A Scalable Multi-dimensional Data Infrastructure for Location Aware Services.",
                    "DiSCO: A Distributed Semantic Cache Overlay for Location-Based Services.",
                    "Multi-objective Query Optimization in Smartphone Social Networks.",
                    "Towards Online Multi-model Approximation of Time Series.",
                    "Finding Regions of Interest from Trajectory Data.",
                    "Efficient Online Algorithms for the Polygonal Approximation of Trajectory Data.",
                    "Exploring Spatial-Temporal Trajectory Model for Location Prediction.",
                    "DIME: Disposable Index for Moving Objects.",
                    "Disclosure-Free GPS Trace Search in Smartphone Networks.",
                    "Optimizing Sensor Data Acquisition for Energy-Efficient Smartphone-Based Continuous Event Processing.",
                    "Optimizing the Energy Consumption of Continuous Query Processing with Mobile Clients.",
                    "A Multi-tiered Architecture for Content Retrieval in Mobile Peer-to-Peer Networks.",
                    "Personalizing Mobile Web Search for Location Sensitive Queries.",
                    "Effective Privacy-Preserving Online Route Planning.",
                    "Context-Aware User's Interests for Personalizing Mobile Search.",
                    "Integrating Identity, Location, and Absence Privacy in Context-Aware Retrieval of Points of Interest.",
                    "Reaching Available Public Parking Spaces in Urban Environments Using Ad Hoc Networking.",
                    "Trip-Mine: An Efficient Trip Planning Approach with Travel Time Constraints.",
                    "Message-Based Patient Guidance in Day-Hospital.",
                    "A Mobile Data Management Architecture for Interoperability of Resource and Context Data.",
                    "Decentralized Pull-Based Information Gathering in Vehicular Networks Using GeoVanet.",
                    "A Time/Space Efficient XML Filtering System for Mobile Environment.",
                    "Towards Collaborative Editing of Structured Data on Mobile Devices.",
                    "Selecting Relevant Sensor Providers for Meeting \"Your\" Quality Information Needs.",
                    "Context Compression: Using Principal Component Analysis for Efficient Wireless Communications.",
                    "Online Clustering of Distributed Streaming Data Using Belief Propagation Techniques.",
                    "Decentralized Change Detection in Wireless Sensor Network Using DFT-based Synopsis.",
                    "Energy-Efficient Real-Time Data Compression in Wireless Sensor Networks.",
                    "Improving Wi-Fi Based Indoor Positioning Using Bluetooth Add-Ons.",
                    "Contextual Grouping: Discovering Real-Life Interaction Types from Longitudinal Bluetooth Data.",
                    "A Flexible Context Aware Reasoning Approach for IoT Applications.",
                    "Acquisition and Presentation of Diverse Spatial Context Data for Blind Navigation.",
                    "Efficient Algorithms for Top-k Keyword Queries on Spatial Databases.",
                    "A kNN Query Processing Method in Mobile Ad Hoc Networks.",
                    "RA-SAX: Resource-Aware Symbolic Aggregate Approximation for Mobile ECG Analysis.",
                    "ATM: Automated Trust Management for Mobile Ad Hoc Networks Using Support Vector Machine.",
                    "Towards Multicore Processing of Spatio-temporal Range Queries.",
                    "Adaptive Information Delivery in Data-Intensive Sensor Networks.",
                    "Towards a Robust Concurrent and Interleaved Activity Recognition of Mobile Users.",
                    "On the Fly Proxy Generation for Home Devices Interoperability.",
                    "COSMOS: A Platform for Seamless Mobile Services in the Cloud.",
                    "Data Stream Processing on Real-Time Mobile Advertisement: Ericsson Research Approach.",
                    "A Method for Providing Content and Service Recommendations Using Social Information from Telecommunications Networks.",
                    "Infrastructures for Research on Multimodal Moving Objects.",
                    "vHike - A Dynamic Ride-Sharing Service for Smartphones.",
                    "Visualization of Energy Consumption of Continuous Query Processing with Mobile Clients.",
                    "Deploying In-Network Data Analysis Techniques in Sensor Networks.",
                    "Hand-OLAP: Semantics-Aware Compression of Data Cubes for Effective and Efficient OLAP in Mobile Enviroments."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2011-2",
                "sub_name": "12th IEEE International Conference on Mobile Data Management, MDM 2011, Luleå, Sweden, June 6-9, 2011, Volume 2.",
                "count": 23,
                "papers": [
                    "Mobile Sensor Databases.",
                    "Participatory Sensing: Crowdsourcing Data from Mobile Smartphones in Urban Spaces.",
                    "Advanced Car Navigation - Future Vehicle Instrumentation for Situation-Aware Services.",
                    "Data Types and Operations for Spatio-temporal Data Streams.",
                    "Managing Moving Objects in Spatio-temporal Data Streams.",
                    "Enhancement of Semantic Business Processes with Information Profiles: Application of Mobile Context Information.",
                    "Inferring Multiple Activities of Mobile Users with Activity Algebra.",
                    "Mobility Prediction Based on Machine Learning.",
                    "Towards a Safe Realization of Privacy-Preserving Data Publishing Mechanisms.",
                    "Dynamic Indexing System for Spatio-temporal Queries in Wireless Sensor Networks.",
                    "Energy Efficient, Adaptive and Collaborative Data Sampling in Wireless Sensor Networks.",
                    "Using Continua Health Alliance Standards - Implementation and Experiences of IEEE 11073.",
                    "Architectural Choices for mHealth Services in Finland and Cameroon.",
                    "Managing Health Information Flows with a Reconfigurable Component-Based Middleware.",
                    "Towards a Mobile Health Context Prediction: Sequential Pattern Mining in Multiple Streams.",
                    "A Universal Tool for Mobile Long-Time Recording, Monitoring and Analysis of Bio-Signals.",
                    "Your Floor Knows Where You Are: Sensing and Acquisition of Movement Data.",
                    "Mobile Emergency System and Integration.",
                    "APHR: Annotated Personal Health Record for Enabling Pervasive Healthcare.",
                    "Enabling Structured Queries over Unstructured Documents.",
                    "A Framework for Query Processing over Compressed Knowledge Bases.",
                    "Framework and Implementation of a Knowledge Management System for Aerospace Collaborative Working Environments.",
                    "Learning and Sharing Technology in Informal Contexts: A Multiagent-Based Supporting Approach."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th MDM 2010",
        "info": "Kanas City, Missouri, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2010",
                "sub_name": "Eleventh International Conference on Mobile Data Management, MDM 2010, Kanas City, Missouri, USA, 23-26 May 2010.",
                "count": 74,
                "papers": [
                    "A Generic Platform for Efficient Processing of Spatial Monitoring Queries in Mobile Peer-to-Peer Networks.",
                    "Low Cost Region Detection from Distributed Sensor Observations.",
                    "diffeRS: A Mobile Recommender Service.",
                    "Learning Location Correlation from GPS Trajectories.",
                    "ACR: An Adaptive Cost-Aware Buffer Replacement Algorithm for Flash Storage Devices.",
                    "An Interactive-Voting Based Map Matching Algorithm.",
                    "Mobile Metadata for Web-Based Image Query Services.",
                    "Mobile Multimedia Management for Community-Aware Storytelling.",
                    "Privacy-Aware Location-Aided Routing in Mobile Ad Hoc Networks.",
                    "Private and Flexible Proximity Detection in Mobile Social Networks.",
                    "Coping with Node Misbehaviors in Ad Hoc Networks: A Multi-dimensional Trust Management Approach.",
                    "Query m-Invariance: Preventing Query Disclosures in Continuous Location-Based Services.",
                    "Processing Approximate Rank Queries in a Wireless Mobile Sensor Environment.",
                    "Efficient Evaluation of k-Range Nearest Neighbor Queries in Road Networks.",
                    "ParTAC: A Partition-Tolerant Atomic Commit Protocol for MANETs.",
                    "Resource Discovery Protocols for Bluetooth-Based Ad-hoc Smart Spaces: Architectural Considerations and Protocol Evaluation.",
                    "Towards Adaptive Sensor Data Management for Distributed Fire Evacuation Infrastructure.",
                    "A Cross Pruning Framework for Top-k Data Collection in Wireless Sensor Networks.",
                    "A Distributed Technique for Dynamic Operator Placement in Wireless Sensor Networks.",
                    "Online Time Interval Top-k Queries in Wireless Sensor Networks.",
                    "Cost-Efficient Data Collection Approach Using K-Nearest Neighbors in a 3D Sensor Network.",
                    "Ad-hoc OLAP on Trajectory Data.",
                    "Uncertain Range Queries for Necklaces.",
                    "Supporting Continuous Range Queries in Indoor Space.",
                    "Dessy: Search and Synchronization on the Move.",
                    "On the Evaluation of Caching in Vehicular Information Systems.",
                    "Mobility-Awareness for Information Sharing in MANETs.",
                    "Ensuring Privacy and Security for LBS through Trajectory Partitioning.",
                    "Adapting Batch Learning Algorithms Execution in Ubiquitous Devices.",
                    "TANGO: A Flexible Mobility-Enabled Architecture for Online and Offline Mobile Enterprise Applications.",
                    "Querying Spatio-temporal Patterns in Mobile Phone-Call Databases.",
                    "Scalable, Real-Time Map-Matching Using IBM's System S.",
                    "The Boomerang Protocol: Tieing Data to Geographic Locations in Mobile Disconnected Networks.",
                    "An Ontology-Based Framework for Designing a Sensor Quality of Information Software Library.",
                    "A New Approach for Spatiotemporal Pattern Queries in Trajectory Databases.",
                    "Pcube: A System to Evaluate and Test Privacy-Preserving Proximity Services.",
                    "A Flash-Aware Random Write Optimized Database.",
                    "Data-Based Agreement for Inter-vehicle Coordination.",
                    "Efficient Simulation Architecture for Routing and Replication in Mobile Peer to Peer Network of UAVs.",
                    "Dessy: Demonstrating Mobile Search and Synchronization.",
                    "Context Elements for Transportation Services.",
                    "Malware Detection on Mobile Devices.",
                    "Dynamic Approximative Data Caching in Wireless Sensor Networks.",
                    "Gossip-Based Data Fusion Framework for Radio Resource Map.",
                    "Dynamic Social Grouping Based Routing in a Mobile Ad-hoc Network.",
                    "MobileSOA Framework for Context-Aware Mobile Applications.",
                    "Performance Analysis of Secure Hierarchical Data Aggregation in Wireless Sensor Networks.",
                    "A Communication Efficient Framework for Finding Outliers in Wireless Sensor Networks.",
                    "Self Synchronization of Mobile Objects.",
                    "Security in Pervasive Health Care Networks: Current R&D and Future Challenges.",
                    "Real-Time Data Compression in Wireless Sensor Networks.",
                    "A Peer to Peer Based Information Sharing Scheme in Vehicular Ad Hoc Networks.",
                    "SMBots - An Architecture to Manage Dynamic Services Based on SMS.",
                    "Mobile Communities in Developing Countries.",
                    "Supporting Location-Based Services through Composable Stream-Processing Flows.",
                    "Energy Efficient Data Access in Mobile Ad Hoc Networks.",
                    "Sensing, Triggers and Mobile (Meta)Data.",
                    "Defending Wireless Sensor Networks against Adversarial Localization.",
                    "Interest-Awareness for Information Sharing in MANETs.",
                    "CReaM: User-Centric Replication Model for Mobile Environments.",
                    "Finding One-Of Probably Nearest Neighbors with Minimum Location Updates.",
                    "Situation-Aware Data Stream Mining Service for Ubiquitous Applications.",
                    "Protecting Privacy in Location-Based Services Using K-Anonymity without Cloaked Region.",
                    "PATS: A Framework of Pattern-Aware Trajectory Search.",
                    "Mobility Can Help: Protect User Identity with Dynamic Credential.",
                    "In-Device Spatial Cloaking for Mobile User Privacy Assisted by the Cloud.",
                    "Access Schemes for Mobile Cloud Computing.",
                    "Mobile Community Cloud Computing: Emerges and Evolves.",
                    "A Mobile-Cloud Collaborative Traffic Lights Detector for Blind Navigation.",
                    "Use of Data Warehouse to Manage Data from Wireless Sensors Networks That Monitor Pollinators.",
                    "An Examination of Sensor Data Collection Method for Spatial Interpolation on Hierarchical Delaunay Overlay Network.",
                    "A-SAS: An Adaptive High-Availability Scheme for Distributed Stream Processing Systems.",
                    "Timing and Radius Considerations for Maintaining Connectivity QoS.",
                    "Measurement-Based Admission Control in Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10th MDM 2009",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2009",
                "sub_name": "MDM 2009, Tenth International Conference on Mobile Data Management, Taipei, Taiwan, 18-20 May 2009.",
                "count": 117,
                "papers": [
                    "Mining Individual Life Pattern Based on Location History.",
                    "A Message Processing Method for Top-k Query for Traffic Reduction in Ad Hoc Networks.",
                    "Operator Placement for Snapshot Multi-predicate Queries in Wireless Sensor Networks.",
                    "Privacy-Aware Proximity Based Services.",
                    "Efficient Capturing of Environmental Data with Mobile RFID Readers.",
                    "Finding Probabilistic Nearest Neighbors for Query Objects with Imprecise Locations.",
                    "PLOT: Privacy in Location Based Services: An Open-Ended Toolbox.",
                    "Information-Gradient Based Decentralized Data Management over RFID Tag Clouds.",
                    "Aggregate Location Monitoring for Wireless Sensor Networks: A Histogram-Based Approach.",
                    "On the Energy Efficiency for Heterogeneous Data Broadcasting.",
                    "Mobile Access to MPEG-7 Based Multimedia Services.",
                    "Outlier Detection in Ad Hoc Networks Using Dempster-Shafer Theory.",
                    "Graph Model Based Indoor Tracking.",
                    "A Concurrency Control Protocol for Continuously Monitoring Moving Objects.",
                    "SLA-Aware Adaptive On-demand Data Broadcasting in Wireless Environments.",
                    "DigestJoin: Exploiting Fast Random Reads for Flash-Based Joins.",
                    "Thresholded Range Aggregation in Sensor Networks.",
                    "ProvidentHider: An Algorithm to Preserve Historical k-Anonymity in LBS.",
                    "Fair Delay Tolerant Mobile Data Ferrying.",
                    "TwinRoute: Energy-Efficient Data Collection in Fixed Sensor Networks with Mobile Sinks.",
                    "Knowing When to Slide - Efficient Scheduling for Sliding Window Processing.",
                    "Interval-Based Nearest Neighbor Queries over Sliding Windows from Trajectory Data.",
                    "R-U-In? - Exploiting Rich Presence and Converged Communications for Next-Generation Activity-Oriented Social Networking.",
                    "A Data Transmission Method Using Multicast in Mobile Ad Hoc Networks.",
                    "Caching as Privacy Enhancing Mechanism in Location-Based Services.",
                    "Perimeter-Based Data Replication in Mobile Sensor Networks.",
                    "Information Sharing in Mobile Ad-Hoc Networks: Metadata Management in the MIDAS Dataspace.",
                    "A Design and Development Methodology for Mobile RFID Applications Based on the ID-Services Middleware Architecture.",
                    "Seamless Indoor/Outdoor Positioning Handover for Location-Based Services in Streamspin.",
                    "Mining Cluster-Based Mobile Sequential Patterns in Location-Based Service Environments.",
                    "Generalized Spatial Queries in the Wireless Data Broadcasting System.",
                    "Incentive Based Routing Protocol for Mobile Peer to Peer Networks.",
                    "Data Gathering by Mobile Mules in a Spatially Separated Wireless Sensor Network.",
                    "A Context Middleware Framework for Managing Context in Mobile Ad Hoc Network Environment.",
                    "Multidimensional Similarity In-network Query for Large-Scale Sensor Networks.",
                    "Active Location Reporting for Emergency Call in UMTS IP Multimedia Subsystem.",
                    "ExtRange: Continuous Moving Range Queries in Mobile Peer-to-Peer Networks.",
                    "Lazy-Update B+-Tree for Flash Devices.",
                    "Evaluation of Trajectory Clustering Based on Information Criteria for Human Activity Analysis.",
                    "CAESAR: A Context-Aware, Social Recommender System for Low-End Mobile Devices.",
                    "Gohcci: Protecting Sensitive Data on Stolen or Misplaced Mobile Devices.",
                    "Interactive Location Cloaking with the PROBE Obfuscator.",
                    "GeoLife2.0: A Location-Based Social Networking Service.",
                    "A Wireless Human Motion Capturing System for Home Rehabilitation.",
                    "A Sensor Network Testbed Integrating Multiple Networks.",
                    "Virtual Campfire - Cross-Platform Services for Mobile Social Software.",
                    "Sticker: Searching and Aggregating User-Generated Contents along with Trajectories of Moving Phenomena.",
                    "VeryIDX - A Privacy Preserving Digital Identity Management System for Mobile Devices.",
                    "Exploring GPS Data for Traffic Status Estimation.",
                    "Underground Positioning: Subway Information System Using WiFi Location Technology.",
                    "MotoBrowser: Enjoyable Browsing Using Cellular Phones by \"Motoring\" Web Pages.",
                    "NCTUns 5.0 Network Simulator for Advanced Wireless Vehicular Network Researches.",
                    "True Event Decision by Cooperative Sensor Network.",
                    "YushanNet: A Delay-Tolerant Wireless Sensor Network for Hiker Tracking in Yushan National Park.",
                    "A Context Aware Interactive Robot for Broadband Wireless Learning.",
                    "Zeus - The Service Intergration Platform for Appliance Control of the Intelligent Digital Life.",
                    "An Instant Messaging with Google Talk Handheld Devices Based on WEB2.0 for Tourist Call for Assistance.",
                    "Privacy-Preserving Techniques for Proximity Based LBS.",
                    "Impact of Beacon Packet Losses to RSSI-Signature-Based Indoor Localization Sensor Networks.",
                    "PipeProbe: Mapping Spatial Layout of Indoor Water Pipelines.",
                    "Network Coding Based Data Distribution in WiMAX.",
                    "A Practical Experience with RFID Security.",
                    "A Feasibility Study on Vehicle-to-Infrastructure Communication: WiFi vs. WiMAX.",
                    "XD: A Cross-Layer Designed Data Collection Mechanism for Mission-Critical WSNs in Urban Buildings.",
                    "Context Aware Traffic Congestion Estimation to Compensate Intermittently Available Mobile Sensors.",
                    "Two Ranked Aware Phase Surveillance in Wireless Sensor Networks.",
                    "Adaptive Location Update Mechanism for Network-Constrained Moving Objects in Changeful Traffic Conditions.",
                    "An Implementation of Auditory Context Recognition for Mobile Devices.",
                    "Design and Implementation of Mobile Personal Emotion Monitoring System.",
                    "Query l-diversity in Location-Based Services.",
                    "AnonTwist: Nearest Neighbor Querying with Both Location Privacy and K-anonymity for Mobile Users.",
                    "Node Level Security Management and Authentication in Mobile Ad Hoc Networks.",
                    "A Downlink Delay-Minimized Scheduling Scheme for OFDMA WiMAX Systems.",
                    "A Hybrid Location Identification Method in Wireless Ad Hoc/Sensor Networks.",
                    "Triangular Energy Saving Route Protocol by Energy Sieving in Wireless Ad Hoc Networks.",
                    "Spiral Movement Deployment Mechanism for Obstacle-Resistance in Wireless Sensor Networks.",
                    "Novel Pervasive Computing Services Experienced through Personal Smart Spaces.",
                    "Power Saving Class Management for Energy Saving in IEEE 802.16e Wireless Networks.",
                    "Using Nearest Neighbor Method and Subtractive Clustering-Based Method on Antenna-Array Selection Used in Virtual MIMO in Wireless Sensor Network.",
                    "Management of Networked Sensing Devices.",
                    "WINFO+: Identification of Environment Condition Using Walking Signals.",
                    "ETC: Energy-Driven Tree Construction in Wireless Sensor Networks.",
                    "An Evaluation of Overhearing-Based Data Transmission Reduction in Wireless Sensor Networks.",
                    "Integration of Heterogeneous Sensor Nodes by Data Stream Management.",
                    "Optimal Path Planning for Fault-Tolerant and Energy-Efficient Target Surveillance in Wireless Sensor and Actor Networks.",
                    "A Broadcast-Based Data Gathering Method Considering Energy Consumption for Sensor Networks.",
                    "HGAF-h: A Hierarchical Honeycomb Cooperative Power Saving Architecture for Sensor Networks.",
                    "Pattern-Based Window: A Novel Window Operator to Support Event Detection over Data Stream.",
                    "Utilizing Existing Semantic Knowledge Bases for Creating Annotations on Mobile Devices.",
                    "Effects of Different Hibernation Behaviors on the Service Distribution Protocol for Mobile Networks and Its Replica Placement Process.",
                    "Context-Aware, Policy-Based Seamless Mobility Using the FOCALE Autonomic Architecture.",
                    "Towards an XML-Based Query and Contextual Information Model in Context-Aware Mobile Information Systems.",
                    "Security Ontology Proposal for Mobile Applications.",
                    "Adaptive Query Routing on Distributed Context - The COSINE Framework.",
                    "Mobile Data Protection Using Handheld Usage Context Matching.",
                    "Exploring the Energy Consumption of Data Sorting Algorithms in Embedded and Mobile Environments.",
                    "Decentral Item-Based Collaborative Filtering for Recommending Images on Mobile Devices.",
                    "Improving Adaptive Streaming Service across Wired/Wireless Networks.",
                    "Bearer Reservation with Preemption for Voice Call Continuity.",
                    "A Survey on Mobile Landmark Recognition for Information Retrieval.",
                    "OntoMobiLe: A Generic Ontology-Centric Service-Oriented Architecture for Mobile Learning.",
                    "Sharing Hierarchical Mobile Multimedia Content Using the MobiTOP System.",
                    "Improving Mobile Peer-to-Peer Streaming Service with BitTorrent-Like Redundant Tracker.",
                    "Design of P2Pnet: An Autonomous P2P Ad-Hoc Group Communication System.",
                    "Advanced Dynamic Bandwidth Allocation and Scheduling Scheme for the Integrated Architecture of EPON and WiMAX.",
                    "Network-Aware P2P Content Sharing over MANET.",
                    "Design and Implementation the Incremental Clustering Algorithm for Geotagged Photos on a Map-Enabled Photo Web Service.",
                    "Halo: A Hierarchical Identity-Based Public Key Infrastructure for Peer-to-Peer Opportunistic Collaboration.",
                    "Supporting Contexts for Indoor Navigation Using a Multilayered Space Model.",
                    "Constructing Hierarchical Representations of Indoor Spaces.",
                    "Towards an Indoor Level-of-Detail Model for Route Visualization.",
                    "Topology of the Prism Model for 3D Indoor Spatial Objects.",
                    "Spatially Augmented Audio Delivery: Applications of Spatial Sound Awareness in Sensor-Equipped Indoor Environments.",
                    "Cell Planning for Indoor Object Tracking Based on RFID.",
                    "Time-Dependent Optimal Routing in Micro-scale Emergency Situation.",
                    "ONALIN: Ontology and Algorithm for Indoor Routing.",
                    "A SDBMS-Based 2D-3D Hybrid Model for Indoor Routing."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9th MDM 2008",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2008",
                "sub_name": "9th International Conference on Mobile Data Management (MDM 2008), Beijing, China, April 27-30, 2008.",
                "count": 38,
                "papers": [
                    "Keynote 1 - Strong Programming Model for Strong Weak Mobility: The ProActive Parallel Suite.",
                    "Keynote 2 - Unleashing Shared-Experience Communications in a Mobile World.",
                    "A Flexible Spatio-Temporal Indexing Scheme for Large-Scale GPS Track Retrieval.",
                    "Efficient Cost-Based Tracking of Scheduled Vehicle Journeys.",
                    "A Lattice-Based Semantic Location Model for Indoor Navigation.",
                    "Monitoring Moving Objects Using Low Frequency Snapshots in Sensor Networks.",
                    "UTR-Tree: An Index Structure for the Full Uncertain Trajectories of Network-Constrained Moving Objects.",
                    "Preprocessing Position Data of Mobile Objects.",
                    "Road Network Based Adaptive Query Evaluation in VANET.",
                    "Secure Data Sharing in Mobile Environments.",
                    "Privacy Preservation in the Publication of Trajectories.",
                    "A Profile Anonymization Model for Privacy in a Personalized Location Based Service Environment.",
                    "Modeling and Managing Mobile Commerce Spaces Using RESTful Data Services.",
                    "A Next Generation Operator Environment to Turn Context-Aware Services into a Commercial Reality.",
                    "Mobile User Profile Acquisition through Network Observables and Explicit User Queries.",
                    "Follow Me, Follow You - Spatiotemporal Community Context Modeling and Adaptation for Mobile Information Systems.",
                    "Processing Mutual Nearest Neighbor Queries for Moving Object Trajectories.",
                    "Safe-Time: Distributed Real-Time Monitoring of cKNN in Mobile Peer-to-Peer Networks.",
                    "Continuous Reverse k-Nearest-Neighbor Monitoring.",
                    "LAOF: A New Framework to Efficiently Process Business Objects on Resource Constrained Mobile Phones.",
                    "Location-Dependent Skyline Query.",
                    "On Reducing Communication Cost for Distributed Moving Query Monitoring Systems.",
                    "Cyclic Data Synchronization through Reusing SyncML.",
                    "Mobile Data Overlay (MDO): A Data Placement Paradigm for Mobile Applications.",
                    "Multi-data Delivery Based on Network Coding in On-demand Broadcast.",
                    "Workload-Aware Query Routing Trees in Wireless Sensor Networks.",
                    "Grid-Based Access Scheduling for Mobile Data Intensive Sensor Networks.",
                    "Querying Imprecise Data in Sensor Databases.",
                    "GeoLife: Managing and Understanding Your Past Life over Maps.",
                    "NexusEditor: A Schema-Aware Graphical User Interface for Managing Spatial Context Models.",
                    "Mobile Mining and Information Management in HealthNet Scenarios.",
                    "Conceptual Modeling for Moving Objects Database Applications.",
                    "MOIR: A Prototype for Managing Moving Objects in Road Networks.",
                    "CarWeb: A Traffic Data Collection Platform.",
                    "A Simulator for a Mobile Peer-to-Peer Database Environment.",
                    "Spoken Dialog System for Next Generation Knowledge Access.",
                    "Distributed Top-K Query Processing in Wireless Sensor Networks.",
                    "Economic-based Incentive Schemes for Dynamic Data Management in Mobile P2P Computing."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th MDM 2007",
        "info": "Mannheim, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2007",
                "sub_name": "8th International Conference on Mobile Data Management (MDM 2007), Mannheim, Germany, May 7-11, 2007.",
                "count": 80,
                "papers": [
                    "How to Build Your Own Moving Objects Database System.",
                    "Smart Earth: From Pervasive Observation to Trusted Information.",
                    "Phenomenon-Aware Stream Query Processing.",
                    "Mobile Peer-to-Peer Data Dissemination with Resource Constraints.",
                    "Optimizing Energy-Efficient Query Processing in Wireless Sensor Networks.",
                    "Collaboratively Querying Sensor Networks through Handheld Devices.",
                    "BORA: Routing and Aggregation for Distributed Processing of Spatio-Temporal Range Queries.",
                    "Place: A Distributed Spatio-Temporal Data Stream Management System for Moving Objects.",
                    "Semantics of Spatially-Aware Windows Over Streaming Moving Objects.",
                    "Privacy-Preserving Data Mining on Moving Object Trajectories.",
                    "Anonymity in Location-Based Services: Towards a General Framework.",
                    "Enforcing Data Integrity in Very Large Ad Hoc Networks.",
                    "An Adaptive Control Method in the Hybrid Wireless Broadcast Environment.",
                    "Variant Bandwidth Channel Allocation in the Data Broadcasting Environment.",
                    "Multi-Resolution Data Management for Opportunistic Networking.",
                    "Exploiting Our Computational Surroundings for Better Mobile Collaboration.",
                    "Data Replication Considering Power Consumption in Ad Hoc Networks.",
                    "Group Anti-Entropy - Achieving Eventual Consistency in Mobile Service Environments.",
                    "ConQuer: A Peer Group-Based Incentive Model for Constraint Querying in Mobile-P2P Networks.",
                    "Integrated Data Modeling for Querying Physical Objects in RFID-Enabled Pervasive Computing.",
                    "Advanced Evasive Data Storage in Sensor Networks.",
                    "Distributed Histograms for Processing Aggregate Data from Moving Objects.",
                    "A Failure Tolerating Atomic Commit Protocol for Mobile Environments.",
                    "Q-NiGHT: Adding QoS to Data Centric Storage in Non-Uniform Sensor Networks.",
                    "Quantifying Network Partitioning in Mobile Ad Hoc Networks.",
                    "MINT Views: Materialized In-Network Top-k Views in Sensor Networks.",
                    "On Join Location in Sensor Networks.",
                    "Infrastructure for Data Processing in Large-Scale Interconnected Sensor Networks.",
                    "Audio and Image Browser for Mobile Devices.",
                    "A Sensed-Point-Oriented Geographic Routing for Camera Networks.",
                    "iPDA: Supporting Privacy-Preserving Location-Based Mobile Services.",
                    "Moppy-Mobile Object Position Prediction Application.",
                    "A Testbed for the Exploration of Novel Concepts in Mobile Service Delivery.",
                    "CADD: A Tool for Context Modeling and Data Tailoring.",
                    "Distribution of Fingerprints for 802.11-Based Positioning Systems.",
                    "Location-Aware Wireless Sensor Networks.",
                    "Privacy in Location-Based Services: State-of-the-Art and Research Directions.",
                    "Location-Aware Query Processing and Optimization.",
                    "Organizing and Program Committees of the MDM 07 Workshops.",
                    "The International Workshop on Privacy-Aware Location-Based Mobile Services (PALMS 2007).",
                    "FragDB - Secure Localized Storage Based on Super-Distributed RFID-Tag Infrastructures.",
                    "Privacy (Regimes) Do Not Threaten Location Technology Development.",
                    "Extending P3P/Appel for Friend Finder.",
                    "Privacy Preserving Computation of Shortest Path in Presence of a Single Convex Polygonal Obstacle.",
                    "Privacy-Aware RNN Query Processing on Location-Based Services.",
                    "A Comparison of Spatial Generalization Algorithms for LBS Privacy Preservation.",
                    "Location Privacy Pricing and Motivation.",
                    "Hiding Location Information from Location-Based Services.",
                    "Analysis of Security and Privacy Issues in RFID-Based Reference Point Systems.",
                    "Protecting Moving Trajectories with Dummies.",
                    "Privacy-Aware Knowledge Discovery from Location Data.",
                    "Second International Workshop on Managing Context Information and Semantics in Mobile Environments (MCISME).",
                    "On Relaxing Contextual Preference Queries.",
                    "An RFID-Based Platform Supporting Context-Aware Computing in Complex Spaces.",
                    "Situation Inference for Mobile Users: A Rule Based Approach.",
                    "Using a Folksonomy Approach for Location Tagging in Community Based Presence Systems.",
                    "Metropolitan Active Space: Introducing Context-Aware Services in GSM Networks.",
                    "Context Life Cycle Management Scheme in Ubiquitous Computing Environments.",
                    "International Workshop on Data Intensive Sensor Networks (DISN).",
                    "Scheduling Transmission of Bulk Data in Sensor Networks Using a Dynamic TDMA Protocol.",
                    "Distributive Energy Efficient Adaptive Clustering Protocol for Wireless Sensor Networks.",
                    "On the Integration of Data Stream Clustering into a Query Processor for Wireless Sensor Networks.",
                    "Optimal Locations for Join Processing in Sensor Networks.",
                    "Parallelized Simulated Annealing for Model Updating in Ad-Hoc Wireless Sensing Networks.",
                    "State-Filters for Enhanced Filtering in Sensor-Based Publish/Subscribe Systems.",
                    "The MicroPulse Framework for Adaptive Waking Windows in Sensor Networks.",
                    "Near Optimal Update-Broadcast of Data Sets.",
                    "Energy-Efficient Medium Access for Data Intensive Wireless Sensor Networks.",
                    "Scalable Hybrid Routing in Very Large Sensor Networks.",
                    "2nd Workshop on Tools and Applications for Mobile Contents (TAMC).",
                    "Image-Identification Methods for Camera-Equipped Mobile Phones.",
                    "Isolating Transactions on Replicated Content Going Mobile.",
                    "A Wireless Sensor Network for Distribution Bus Protection.",
                    "International Workshop on Mobile Service-Oriented Architectures and Ontologies (MOSO).",
                    "Towards Entity-Centric Wide-Area Context Discovery.",
                    "Implementing OMA DRM Using Web Services: An Approach to Integrate OMA DRM and Web Services on Mobile Units.",
                    "Developing Mobile Ontologies; Who, Why, Where, and How?",
                    "A Framework and Tool for Personalisation of Mobile Services Using Semantic Web.",
                    "An Ontology Based Approach to Interaction Ambient Design.",
                    "Mobile Service Development and Deployment with Remotely Launched Service-Oriented Mobile Agents."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th MDM 2006",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2006",
                "sub_name": "7th International Conference on Mobile Data Management (MDM 2006), Nara, Japan, May 9-13, 2006.",
                "count": 162,
                "papers": [
                    "Welcome from the General Chairs.",
                    "Welcome From The Program Chairs.",
                    "Conference Officers.",
                    "Program Committee.",
                    "External Reviewers.",
                    "Sponsors.",
                    "\"ExScal: A Perspective on Large Scale Wireless Sensor Networks\".",
                    "The Changing Face of Web Search.",
                    "Efficient Context-aware Service Discovery in Multi-Protocol Pervasive Environments.",
                    "Discovering Causal Dependencies in Mobile Context-Aware Recommenders.",
                    "Context Integration for Mobile Data Tailoring.",
                    "Time Geography for Ad-Hoc Shared-Ride Trip Planning.",
                    "An Efficient Resilience Mechanism for Data Centric Storage in Mobile Ad Hoc Networks.",
                    "On the Content Predictability of Cooperative Image Caching in Ad Hoc Networks.",
                    "Cooperative Device Browsing through Portable Private Area Network.",
                    "Ad-Hoc Collaboration Between Messengers: Operations and Incentives.",
                    "Access Control and Privacy in Location-Aware Services forMobile Organizations.",
                    "Robust B+-Tree-Based Indexing of Moving Objects.",
                    "LUGrid: Update-tolerant Grid-based Indexing for Moving Objects.",
                    "k-Closest Pair Query Monitoring Over Moving Objects.",
                    "Global Cache Management in Nonuniform Mobile Broadcast.",
                    "Efficient Object Retrieval from Parallel Air Channels in the Presence of Replicated Objects.",
                    "Evaluation of Dual-Structure Key-management Scheme Suitable for Mobile Services.",
                    "Update-Aware Scheduling Algorithms for Hierarchical Data Dissemination Systems.",
                    "u-Cam: A User-Driven Control Mechanism for Ubiquitous Cameras and Its Content Management.",
                    "A Mobile Information Service Adapted to Vague and Situational Requirements of Individual.",
                    "A Rule-based Approach to Content Delivery Adaptation in Web Information Systems.",
                    "Detecting The Sufficient Display Resolution For Image Browsing.",
                    "CAR: Controlled Adjustment of Routes and Sensor Networks Lifetime.",
                    "Efficient Online State Tracking Using Sensor Networks.",
                    "Data Stream Query Optimization Across System Boundaries of Server and Sensor Network.",
                    "In-Network Data Processing forWireless Sensor Networks.",
                    "Service Maps for Heterogeneous Network Environments.",
                    "Efficient Querying and Resource Management Using Distributed Presence Information in Converged Networks.",
                    "Distributed Leader Election in P2P Systems for Dynamic Sets.",
                    "Efficient Access to Wireless Web Services.",
                    "Processing Precision-Constrained Approximate Queries in Wireless Sensor Networks.",
                    "On In-network Synopsis Join Processing for Sensor Networks.",
                    "A Coverage-Based Maximum Lifetime Data Gathering Algorithm in Sensor Networks.",
                    "User Pattern Analysis in Cellular Systems.",
                    "Data Delivery System with Convergence of Terrestrial Digital Broadcasting and Communication for Cellular Phone.",
                    "Nearly Lossless Audio Watermark Embedding Techniques to be Extracted Contactlessly by Cell Phone.",
                    "Data Dissemination to a Large Mobile Network: Simulation of Broadcast Clouds.",
                    "BMQ-Index: Shared and Incremental Processing of Border Monitoring Queries over Data Streams.",
                    "Window Query Processing with Proxy Cache.",
                    "To Broadcast Push or Not and What?.",
                    "On Mining Moving Patterns for Object Tracking Sensor Networks.",
                    "Macroscopic Structural Summarization of Road Networks for Mobile Traffic Information Services.",
                    "Context-Aware Information Provision to the Mobile Phone Standby Screen.",
                    "Developing a Web Crawler for Massive Mobile Search Services.",
                    "u-Cam: Ubiquitous Camera in Real World with User-Driven Control.",
                    "Photo-to-Search: Using Camera Phones to Inquire of the Surrounding World.",
                    "Querying Moving Objects in SECONDO.",
                    "P2P-Based Semantic Service Management in Mobile Ad-hoc Networks.",
                    "Security Management for Mobile Devices by Face Recognition.",
                    "ANNATTO: Adaptive Nearest Neighbor Queries in Travel Time Networks.",
                    "Cell-Phone Based User Activity Recognition, Management and Utilization.",
                    "Two Approaches to Browse LargeWeb Pages Using Mobile Devices.",
                    "Self-Organizing Location Estimation Method using Ad-hoc Networks.",
                    "Wireless Information Sharing in Ubiquitous Environments.",
                    "MobiREAL : Scenario Generation and Toolset for MANET Simulation with Realistic Node Mobility.",
                    "A User-Driven Device Handover System in PAN Environments.",
                    "Location-Based Information Delivery Using Stream Processing Engine.",
                    "An Energy-Aware Video Streaming System for Portable Computing Devices.",
                    "Demonstration of a Cellular Phone Application Based on Context-Aware Group Formation.",
                    "A System for Analyzing Life Rhythm Using Wireless Sensors on Mules.",
                    "u-PaV: Automatic Transformation of Web Content into TV-like Video Content for Ubiquitous Environment.",
                    "A Real-World Event Search System in Sensor Network Environments.",
                    "TinyOS: An Open Operating System for Wireless Sensor Networks (Invited Seminar).",
                    "Data Access Techniques for Location-Based Services.",
                    "Network-Aware Wireless Sensor Data Management.",
                    "Data Intensive Mobile Sensornets: Killer Applications and Grand Deterrents.",
                    "A New Ph.D. Program in Computational Transportation Science.",
                    "Sharing Location Dependent Experiences in MANET.",
                    "Ontology Based Dynamic Updates in Sparse Mobile Ad-hoc Networks for Rescue Scenarios.",
                    "Update Log Dissemination in Mobile Ad Hoc Networks.",
                    "On a Cooperation of Broadcast Scheduling and Base Station Caching in the Hybrid Wireless Broadcast Environment.",
                    "Extracting Semantic Location from Outdoor Positioning Systems.",
                    "An Anonymous Context Aware Access Control Architecture For Ubiquitous Services.",
                    "Using Moving Object Databases to Provide Context Information in Mobile Ad-hoc Networks.",
                    "Putting Context in Context: The Role and Design of Context Management in a Mobility and Adaptation Enabling Middleware.",
                    "Query Modification Based on Real-World Contexts for Mobile and Ubiquitous Computing Environments.",
                    "SemanticWeb Content Adaptation and Services Delivery on Morfeo's Semantic Mobility Channel.",
                    "Automating Photo Annotation using Services and Ontologies.",
                    "The Role of Ontologies in Context-Aware Recommender Systems.",
                    "Using FIPA Agents with Service-Oriented Peer-to-Peer Middleware.",
                    "SOGOS - A Distributed Meta Level Architecture for the Self-Organizing Grid of Services.",
                    "Ontology-based Semantic Web Service platform in Mobile Environments.",
                    "DigiMe - Ubiquitous Search and Browsing for Digital Libraries.",
                    "Fox Service: An Implementation Case of Ontology-based Search Agent in Mobile Environments.",
                    "Context-Aware Processing of Ontologies in Mobile Environments.",
                    "Context Sensitive Mobile Access to Grid Environments and VO Workspaces.",
                    "Breakthroughs in Large-Scale Ad Hoc Wireless Networking and Application for Vehicle Safety.",
                    "A SW Framework for Retrieving and Organizing Real-time Mobile Data.",
                    "A Real-time Mobile System for Fetal Heart Rate Monitoring and Fetal Distress Detection.",
                    "Mobile Advertisement System Utilizing User's Contextual Information.",
                    "Generating Useful Photo Context Metadata for the Semantic Web.",
                    "Call Intent based \"Enhanced Caller ID\".",
                    "A New User Authentication Protocol for Mobile Terminals in Wireless Network.",
                    "Evaluation of the Impact of Selfish Nodes in Ad Hoc Networks and Detection and Countermeasure Methods.",
                    "Secure Access Control Schemes for RFID Systems with Anonymity.",
                    "On the Security of Two Group Key Agreement Protocols for Mobile Devices.",
                    "Content-Based Entry Control for Secure Spaces.",
                    "Server Side C-DASH: Ubiquitous Hardware/Software Codesign Environment.",
                    "Ubiquitous Gadgets for Constructing Flexible Ubiquitous Services.",
                    "Flexible Network System for Wearable Computing Using Conductive Fabric.",
                    "NB-FACE: No-Beacon FACE Ad-hoc Routing Protocol for Reduction of Location Acquisition Overhead.",
                    "Pointing and Retrieving: A Data Translation Model for Real World Computing.",
                    "Demand-Oriented Information Retrieval Method on MANET.",
                    "Profile-based Query Routing in a Mobile Social Network.",
                    "AWeb Search Method using User Operation on Digital Maps.",
                    "A Query Processing Method Considering Query Frequency for Broadcast Database Systems.",
                    "Topic Detection from Blog Documents Using Users' Interests.",
                    "Context-Aware SVM for Context-Dependent Information Recommendation.",
                    "Extended Correspondent Registration Scheme for Reducing Handover Delay in Mobile IPv6.",
                    "Intra-Class Utility-Fair Bandwidth Adaptation for Multi-Class Traffic in Wireless Networks.",
                    "An Internet Gateway Access-Point Selection Problem forWireless Infrastructure Mesh Networks.",
                    "Dynamic Address Configuration Supporting One Hop Communication of Mobile Personal Area Network.",
                    "Discovery and Delay Analysis of Bluetooth Devices.",
                    "Enhancing Network Performance with Adaptive Admission Control.",
                    "An Adaptive Scheme for Consistency among Players in Networked Racing Games.",
                    "Maximizing User Gain in Multi-flow Multicast Streaming on Overlay Networks.",
                    "QoS Control for Continuous Media over Heterogeneous Environment by Wired and Wireless Network.",
                    "Power Controlled Routing inWireless Multihop Communication for Higher End-to-End Bandwidth.",
                    "Influences of Network Latency of Voice and Haptic Media on Efficiency of Collaborative Work.",
                    "Collaborative Virtual Environment Considering Scalability and Usability.",
                    "A Security Model for OLSR MANET Protocol.",
                    "Light Client Management Protocol for Wireless Mesh Networks.",
                    "Conformance and Interoperability Testing of an Ad Hoc Routing Protocol.",
                    "On TDMA Slot Assignment Protocol Considering the Existence of Unidirectional Wireless Links in Ad Hoc Sensor Networks.",
                    "A Study on Performance Evaluation of Real-time Data Transmission on Vehicular Ad Hoc Networks.",
                    "Accelerating Remote Logging by Two Level Asynchronous Checkpointing.",
                    "Consistency Management among Replicas Using a Quorum System in Ad Hoc Networks.",
                    "FlexSched: A Parameterized Data Schedule Generator for Multi-Channel Broadcast Systems.",
                    "A Technique for Information Sharing using Inter-Vehicle Communication with Message Ferrying.",
                    "An Embedded Intelligence Model: Issues in the Real-World Empowered Organizational Computing.",
                    "Effect of Retransmissions in Mobile Agent Communications under Unstable Network Conditions.",
                    "Trapco: Website Design by Transforming Paper-based Prototypes to Computer-based Prototypes.",
                    "A New Secure Mobile Community System.",
                    "Activity Scheduling inWeb-Service Based Workflow Management for Balancing Load and Handling Failures.",
                    "Collecting Adaptive Data for Isolated Wireless Sensors with Patrol Nodes in Live E!.",
                    "An Antecedence Graph Approach for Fault Tolerance in a Multi-Agent.",
                    "Service-Orientation in Mobile Computing - An Overview.",
                    "Delivering Mobile Enterprise Services on Morfeo's MC Open Source Platform.",
                    "Design and Implementation of WAP Certificate Converter Toolkit.",
                    "Developing Client-Server Speech Translation Platform.",
                    "Quality Improvement of MP3 Encoded Audio Reproduction using Fluency Locally Supported Sampling Function for Use in Cell Phones.",
                    "A Proposal of Test Bed for \"Intelligent\" Multimedia Communication System Using MPEG-4.",
                    "GeoNote.net: A Social Network System for Geographic Information.",
                    "Design of a Car Navigation System that Predicts User Destination.",
                    "Active Folders: A Metaphor for Developing and Interacting with Context-Aware Applications.",
                    "A Simple Broadcasting Method for Computation Time Reduction on Grid Computing Environment.",
                    "A Study on Formulation of the Ubiquitous Cloud Model.",
                    "RectNet - A Distributed Geometrical Data Structure.",
                    "Processed Data Collection using Opportunistic Routing in Location Aware Wireless Sensor Networks.",
                    "Scalable Self-Configuring Integration of Localization and Indexing in Wireless Ad-Hoc Sensor Networks.",
                    "Selective Iterative Multilateration for Hop Count-Based Localization in Wireless Sensor Networks.",
                    "NED: An Efficient Noise-Tolerant Event and Event Boundary Detection Algorithm in Wireless Sensor Networks.",
                    "A Meta-Data-Based Data Aggregation Scheme in Clustering Wireless Sensor Networks.",
                    "Operator Allocation in Borealis with Integrated Sensor Network Query Processors.",
                    "Modeling and Predicting Future Trajectories of Moving Objects in a Constrained Network.",
                    "Formalizing Mobility in Dynamic Location-Aware Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6th MDM 2005",
        "info": "Ayia Napa, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2005",
                "sub_name": "6th International Conference on Mobile Data Management (MDM 2005), Ayia Napa, Cyprus, May 9-13, 2005.",
                "count": 48,
                "papers": [
                    "Efficient constraint processing for location-aware computing.",
                    "An implementation method of a location-based active map transformation system.",
                    "A secure P2P architecture for location management.",
                    "TOSA: a near-optimal scheduling algorithm for multi-channel data broadcast.",
                    "Using a hybrid method for accessing broadcast data.",
                    "Data scheduling for multi-item and transactional requests in on-demand broadcast.",
                    "Efficient indexing of the historical, present, and future positions of moving objects.",
                    "Preserving mobile customer privacy: an access control system for moving objects and customer profiles.",
                    "Dynamic topological predicates and notifications in moving objects databases.",
                    "Efficient trajectory joins using symbolic representations.",
                    "Distributed group-based cooperative caching in a mobile broadcast environment.",
                    "Comparison of replication strategies for content availability in C2P2 networks.",
                    "An approach of composing near optimal invalidation reports.",
                    "STEP: Self-Tuning Energy-safe Predictors.",
                    "Prediction intelligence in context-aware applications.",
                    "The role of caching and context-awareness in P2P service discovery.",
                    "A context-aware group management middleware to support resource sharing in MANET environments.",
                    "GPAC: generic and progressive processing of mobile queries over mobile data.",
                    "Using ECA rules to implement mobile query agents for fast-evolving pure P2P database systems.",
                    "kNR-tree: a novel R-tree-based index for facilitating spatial window queries on any k relations among N spatial relations in mobile environments.",
                    "An efficient algorithm for predictive continuous nearest neighbor query processing and result maintenance.",
                    "A remote personal device management framework based on SyncML DM specifications.",
                    "Group management for mobile Ad Hoc networks: design, implementation and experiment.",
                    "Distributed data-centric application development using multiple mobile devices.",
                    "Data dissemination in mobile peer-to-peer networks.",
                    "A general model of hybrid data dissemination.",
                    "Distributed caching of multi-dimensional data in mobile environments.",
                    "An energy-conserved on-demand data broadcasting system.",
                    "On-line balanced k-channel data allocation with hybrid schedule per channel.",
                    "Tuning query performance in mobile sensor databases.",
                    "Programming sensor networks with mobile agents.",
                    "Concept-based discovery of mobile services.",
                    "Dynamically-optimized context in recommender systems.",
                    "Geo-word centric association rule mining.",
                    "Efficient dynamic resource specifications.",
                    "Delivering mobile enterprise applications on iMMS framework.",
                    "Live data views: programming pervasive applications that use \"timely\" and \"dynamic\" data.",
                    "Scalable synchronization of intermittently connected database clients.",
                    "Context management for end user development of context-aware applications.",
                    "Demo: eureauweb™: an information system for users of European inland waterways.",
                    "Demo: PoLoS: integrated platform for location based services.",
                    "Demo: mobile database administrator-MDBA.",
                    "Demo: a framework for location information processing.",
                    "Demo: ontology-based context-aware delivery of extended points of interest.",
                    "Challenges and opportunities in ICT: a European perspective.",
                    "Invariant aspects in M-commerce environments.",
                    "Mobile peer-to-peer computing: challenges, metrics and applications.",
                    "Panel on mobility in sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mdm/2005mcmp",
                "sub_name": "Proceedings of the First International Workshop on Managing Context Information in Mobile and Pervasive Environments May 9, 2005, Ayia Napa, Cyprus.",
                "count": 16,
                "papers": [
                    "Semantic Discovery for Context-Aware Service Provisioning in Mobile Environments.",
                    "Service-Oriented Context-Aware Application Design.",
                    "Semantic and Syntactic modeling of component-based services for context-aware pervasive systems using OWL-S.",
                    "InfoStar: An Adaptive Visual Analytic Platform for Mobile Devices.",
                    "On Supporting Context-Aware Preferences in Relational Database Systems.",
                    "Integrated Context Management for Multi-domain Pervasive Environments.",
                    "Direct Interruptability Prediction and Scenario-based Evaluation of Wearable Devices: Towards Reliable Interruptability Predictions.",
                    "Interruptability Prediction Using Motion Detection.",
                    "A Context-Based Architecture for Learning How to Make Contextualized Decisions.",
                    "Augmentation of Content with Context Meta-data: The Mobile Collector.",
                    "Distributed Context Data Management.",
                    "Distributed algorithms for Constructing and Maintaining a Spanning Tree in a Mobile Ad hoc Network.",
                    "Context driven, adaptive tour computation and information presentation.",
                    "OntoNav: A Semantic Indoor Navigation System.",
                    "Model Checking for Sentient Computing: An Axiomatic Approach.",
                    "Matching User's Semantics with Data Semantics in Location-Based Services."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "5th MDM 2004",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2004",
                "sub_name": "5th IEEE International Conference on Mobile Data Management (MDM 2004), 19-22 January 2004, Berkeley, CA, USA.",
                "count": 48,
                "papers": [
                    "Opportunistic Resource Exchange in Inter-Vehicle Ad-Hoc Networks.",
                    "TrafficView: A Scalable Traffic Monitoring System.",
                    "Processing Range-Monitoring Queries on Heterogeneous Mobile Objects.",
                    "Disconnected Operation in Publish/Subscribe Middleware.",
                    "Semantic Location Modeling for Location Navigation in Mobile Environment.",
                    "Hanging Services: An Investigation of Context-Sensitivity and Mobile Code for Localised Services.",
                    "Efficient Content Location in Wireless Ad Hoc Networks.",
                    "A Rule Engine for Location Based Content Syndication.",
                    "Next Generation Airline Information: Using Consumer Devices to Keep Passengers Informed and as an Additional Channel to Market.",
                    "Multi-Protocol Profiles to Support User Mobility Across Network Technologies.",
                    "Context-Aware Adaptation for Mobile Devices.",
                    "On Bulk Loading TPR-Tree.",
                    "A Multi-Layer Location Management Scheme that Bridges the Best Static Scheme and the Best Dynamic Scheme.",
                    "Universal Trajectory Queries for Moving Object Databases.",
                    "Rufis: Mobile Data Sharing Using a Generic Constraint-Oriented Reconciler.",
                    "Proposal of Paper-Based Cross-Media Cooperation System.",
                    "Managed Portal Appliance: An Experiment in Extending the Reach of Web Applications.",
                    "Data Broadcasting with Data Item Locality and Client Mobility.",
                    "Context Aware Mobile Transactions.",
                    "Energy Efficient Access in Multiversion Broadcast Environment.",
                    "Broadcasting Consistent Data in Mobile Environments.",
                    "Middleware Providing Dynamic Group Communication Facility for Cellular Phone Applications.",
                    "Supporting Mobile Context-Aware Applications on a Global Scale.",
                    "Replication of Data Associated with Locations in Ad Hoc Networks.",
                    "Dynamic Active Networks Services.",
                    "Context-Aware Unified Communication.",
                    "Enabling Context-Aware and Privacy-Conscious User Data Sharing.",
                    "Meta Data to Support Context Aware Mobile Applications.",
                    "MobiVoD: A Video-on-Demand System Design for Mobile Ad Hoc Networks.",
                    "QoS-Aware Service Location in Mobile Ad-Hoc Networks.",
                    "Soft Handover in Terrestrial Broadcast Networks.",
                    "Selective Establishment of Pseudo Reservations for QoS Guarantees in Mobile Internet.",
                    "Optimizing Data Placement over Wireless Broadcast Channel for Multi-Dimensional Range Query Processing.",
                    "Performance Evaluation of a Predeclaration-Based Transaction Processing in a Hybrid Data Delivery.",
                    "Data Indexing for Heterogeneous Multiple Broadcast Channel.",
                    "Maintaining Temporal Consistency in Broadcast Environments.",
                    "Mobile Agents: What about Them? Did They Deliver what They Promised? Are They Here to Stay?",
                    "Obstacles to the Adoption of Mobile Agents.",
                    "Mobile Agents: Ten Reasons For Failure.",
                    "Mobile Agents: Right Concept, Wrong Approach.",
                    "Mobile Agents: Overcoming Early Hype and a Bad Name.",
                    "Mobile Agents: Can They Assist with Context Awareness?",
                    "Towards Pluggable Discovery Frameworks for Mobile and Pervasive Applications.",
                    "Universal Manager: Seamless Management of Enterprise Mobile and Non-Mobile Devices.",
                    "Linking Physical Worlds to Logical Worlds with Mobile Agents.",
                    "Prediction-Based Strategies for Energy Saving in Object Tracking Sensor Networks.",
                    "An Enhanced Hoarding Approach Based on Graph Analysis.",
                    "Cache-Miss-Initiated Prefetch in Mobile Environments."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th MDM 2003",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2003",
                "sub_name": "Mobile Data Management, 4th International Conference, MDM 2003, Melbourne, Australia, January 21-24, 2003, Proceedings.",
                "count": 37,
                "papers": [
                    "Storing and Accessing User Context.",
                    "Cooperative Caching in Ad Hoc Networks.",
                    "Investigation of Cache Maintenance Strategies for Multi-cell Environments.",
                    "Resilient Data-Centric Storage in Wireless Ad-Hoc Sensor Networks.",
                    "Shape-Based Similarity Query for Trajectory of Mobile Objects.",
                    "An Efficient Spatiotemporal Indexing Method for Moving Objects in Mobile Communication Environments.",
                    "DynaMark: A Benchmark for Dynamic Spatial Indexing.",
                    "Using Separate Processing for Read-Only Transactions in Mobile Environment.",
                    "Publish/Subscribe Tree Construction in Wireless Ad-Hoc Networks.",
                    "Personal Workflows: Modeling and Management.",
                    "Architectural Support for Global Smart Spaces.",
                    "FATES: Finding A Time dEpendent Shortest path.",
                    "Search K Nearest Neighbors on Air.",
                    "Adaptive Location Management in Mobile Environments.",
                    "Policy-Driven Binding to Information Resources in Mobility-Enabled Scenarios.",
                    "Constructing Environment-Aware Mobile Applications Adaptive to Small, Networked Appliances in Ubiquitous Computing Environment.",
                    "Experiences in Using CC/PP in Context-Aware Systems.",
                    "Document Visualization on Small Displays.",
                    "Towards Autonomous Services for Smart Mobile Devices.",
                    "Nomad: Application Participation in a Global Location Service.",
                    "Mobiscope: A Scalable Spatial Discovery Service for Mobile Network Resources.",
                    "Presence, Location, and Instant Messaging in a Context-Aware Application Framework.",
                    "CAMEL: A Moving Object Database Approach for Intelligent Location Aware Services.",
                    "Using Hashing and Caching for Location Management in Wireless Mobile Systems.",
                    "SEB-tree: An Approach to Index Continuously Moving Objects.",
                    "Best Movement of Mobile Agent in Mobile Computing Systems.",
                    "Clique: A Transparent, Peer-to-Peer Replicated File System.",
                    "Transactional Peer-to-Peer Information Processing: The AMOR Approach.",
                    "Performance Evaluation of Transcoding-Enabled Streaming Media Caching System.",
                    "Adaptive File Cache Management for Mobile Computing.",
                    "Adaptive Power-Aware Prefetching Schemes for Mobile Broadcast Environments.",
                    "A Multi-layered Database Model for Mobile Environment.",
                    "A Task Oriented Approach to Delivery in Mobile Environments.",
                    "Picturing the Future Personal Navigation Products and Services by Means of Scenarios.",
                    "Personal Digest System for Professional Baseball Programs in Mobile Environment.",
                    "Handling Client Mobility and Intermittent Connectivity in Mobile Web Accesses.",
                    "Enabling Web-Based Location-Dependent Information Services in Mobile Environments."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "3rd MDM 2002",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2002",
                "sub_name": "Proceedings of the Third International Conference on Mobile Data Management (MDM 2002), Singapore, January 8-11, 2002.",
                "count": 26,
                "papers": [
                    "Research Challenges in Location-Enabled M-Services.",
                    "UCS-Router: A Policy Engine for Enforcing Message Routing Rules in a Universal Communication System.",
                    "An Approach to Disconnected Operation in an Object-Oriented Database.",
                    "Adaptable Consistency Control Mechanism for a Mobility Enabled File System.",
                    "A Reconfigurable Stream Orchestration Framework for Mobile Users.",
                    "MobileIQ: A Framework for Mobile Information Access.",
                    "Building Internet Marketplaces on the Basis of Mobile Agents for Parallel Processing.",
                    "Dispatching Multiple Mobile Agents in Parallel for Visiting E-Shops.",
                    "A Strategy for Efficient Access of Multiple Data Items in Mobile Environments.",
                    "Replica Allocation in Ad Hoc Networks with Periodic Data Update.",
                    "Index and Data Allocation on Multiple Broadcast Channels Considering Data Access Frequencies.",
                    "Semantic Data Access in an Asymmetric Mobile Environment.",
                    "Allocation of Shared Data Based on Mobile User Movement.",
                    "Indexing the Current Positions of Moving Objects Using the Lazy Update R-tree.",
                    "Query Processing for Moving Objects with Space-Time Grid Storage Model.",
                    "Location Aggregation from Multiple Sources.",
                    "User Behavior Analysis of Location Aware Search Engine.",
                    "iQueue: A Pervasive Data Composition Framework.",
                    "Disseminating Data in Unreliable Wireless Environment.",
                    "Design of Compiler for Mobile Environment and Its Formalization Using Evolving Algebra.",
                    "Broadcast Transaction Scheduling in Mobile Computing Environments.",
                    "Dynamic Mobile IP and Nice-TCP for Improving TCP/IP Performance.",
                    "BlueLocator: Enabling Enterprise Location-Based Services.",
                    "Toward Improving the Mobile Experience with Proxy Transcoding and Virtual Composite Devices for a Scalable Bluetooth LAN Access Solution.",
                    "Mobile Middleware for Voice/Data-Integrated Internet Communication.",
                    "Location Caching in the Mobile Middleware Platform."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "2nd MDM 2001",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mdm/2001",
                "sub_name": "Mobile Data Management, Second International Conference, MDM 2001, Hong Kong, China, January 8-10, 2001, Proceedings.",
                "count": 31,
                "papers": [
                    "Towards Sensor Database Systems.",
                    "An Architecture for the Effective Support of Adaptive Context-Aware Applications.",
                    "Event Engine for Adaptive Mobile Computing.",
                    "Adaptive Delivery of Multimedia Data in Heterogeneous and Mobile Environments.",
                    "Effects and Performance of Content Negotiation Based on CC/PP.",
                    "Design and Implementation of an Information Announcement Toolkit for Mobile Computers.",
                    "High Performance Data Broadcasting: A Comprehensive Systems' Perspective.",
                    "Optimized Scheduling on Broadcast Disks.",
                    "Optimistic Scheduling Algorithm for Mobile Transactions Based on Reordering.",
                    "Bandwidth-Conserving Cache Validation Schemes in a Moblie Database System.",
                    "Quasi-consistency and Caching with Broadcast Disks.",
                    "A Map-Based Hoarding Mechanism for Location-Dependent Information.",
                    "Hashing Moving Objects.",
                    "Storage and Retrieval of Moving Objects.",
                    "A Mobility Framework for Ad Hoc Wireless Networks.",
                    "Operating System and Algorithmic Techniques for Energy Scalable Wireless Sensor Networks.",
                    "Towards a Programmable Mobile IP.",
                    "Adaptive Call Admission Control for Wireless Multimedia Network.",
                    "Soft Mobile Ad-Hoc Networking.",
                    "CC/PP for Content Negotiation and Contextualization.",
                    "Serving Spatial Location Information over the Internet.",
                    "On-Line Service Adaptation for Mobile and Fixed Terminal Devices.",
                    "Multicast Micro-mobility Management.",
                    "Personal Workflow Management in Support of Pervasive Computing.",
                    "An Agent-Based Architecture Using XML for Mobile Federated Database Systems.",
                    "Designing Electronic Forms in Web Applications: Integration of Form Components.",
                    "Increasing Concurrency of Transactions Using Delayed Certification in Mobile DBMs.",
                    "Multi-resolution Web Document Browsing in a Distributed Agent Environment.",
                    "Dynamic Remote Update Adapting Wireless Network Connection States.",
                    "Performance Modeling of Layered-Data Delivery for Mobile Users through Broadcast/On-Demand Hybrid Communication.",
                    "Energy-Efficient Transaction Management for Real-Time Mobile Databases in Ad-Hoc Network Environments."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "1st MDA 1999",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/mda/1999",
                "sub_name": "Mobile Data Access, First International Conference, MDA'99, Hong Kong, China, December 16-17, 1999, Proceedings.",
                "count": 22,
                "papers": [
                    "Wireless VoIP: Opportunities and Challenges.",
                    "GSM Mobile Phone Based Communication of Multimedia Information: A Case Study.",
                    "A Witness-Aided Routing Protocol for Mobile Ad-Hoc Networks with Unidirectional Links.",
                    "Assessing Opportunities for Broadband Optical Wireless Local Loops in an Unbundled Access Network.",
                    "On Simulation Modeling of Information Dissemination Systems in Mobile Environments.",
                    "On the Performance of Transaction Processing in Broadcast Environments.",
                    "Transaction Processing in an Asymmetric Mobile Environment.",
                    "Speculative Lock Management to Increase Concurrency in Mobile Environments.",
                    "Optimistic Concurrency Control in Broadcast Environments: Looking Forward at the Server and Backward at the Clients.",
                    "Modelling the WAP Transaction Service using Coloured Petri Nets.",
                    "Enabling Ubiquitous Database Access with XML.",
                    "Design and Evaluation of an Information Announcement Mechanism for Mobile Computers.",
                    "Active Rule System for Adaptive Mobile Data Access.",
                    "Preserving Smooth Traffic and High Presentation QoS for VBR-Encoded Video.",
                    "Peer Replication with Selective Control.",
                    "Cache Coherency in Location-Dependent Information Services for Mobile Environment.",
                    "An Autonomous Data Coherency Protocol for Mobile Devices.",
                    "Location Management Strategies for Reducing Both Movement Cost and Locating Cost Simultaneously.",
                    "Internet Mobility Support Optimized for Client Access and its Scalable Authentication Framework.",
                    "Proxy Agent Consistency Service Based on CORBA.",
                    "Integrating Mobile Objects into the Wirelessly Wired World: The Need for Energy Efficient Algorithms (Abstract).",
                    "Databases Unplugged: Challenges in Ubiquitous Data Management (Abstract)."
                ]
            }
        ]
    }
]