[
    {
        "year": "2021",
        "name": "40th PODS 2021",
        "info": "Virtual Event, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2021",
                "sub_name": "PODS'21: Proceedings of the 40th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, Virtual Event, China, June 20-25, 2021.",
                "count": 32,
                "papers": [
                    "Synchronization Schemas.",
                    "Modern Lower Bound Techniques in Database Theory and Constraint Satisfaction.",
                    "Approximation Algorithms for Large Scale Data Analysis.",
                    "Privacy: From Database Reconstruction to Legal Theorems.",
                    "Improved Differentially Private Euclidean Distance Approximation.",
                    "Datalog Unchained.",
                    "Expressiveness within Sequence Datalog.",
                    "2021 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "Frequent Elements with Witnesses in Data Streams.",
                    "Relative Error Streaming Quantiles.",
                    "Stackless Processing of Streamed Trees.",
                    "Estimating the Size of Union of Sets in Streaming Models.",
                    "Minimum Coresets for Maxima Representation of Multidimensional Data.",
                    "Spanner Evaluation over SLP-Compressed Documents.",
                    "Two-Attribute Skew Free, Isolated CP Theorem, and Massively Parallel Joins.",
                    "Cover or Pack: New Upper and Lower Bounds for Massively Parallel Joins.",
                    "Algorithms for a Topology-aware Massively Parallel Computation Model.",
                    "Consistent Query Answering for Primary Keys on Path Queries.",
                    "Benchmarking Approximate Consistent Query Answering.",
                    "Structure and Complexity of Bag Consistency.",
                    "New Algorithms for Monotone Classification.",
                    "Subspace Exploration: Bounds on Projected Frequency Estimation.",
                    "Data-Independent Space Partitionings for Summaries.",
                    "Model Counting meets F0 Estimation.",
                    "A Dichotomy for the Generalized Model Counting Problem for Unions of Conjunctive Queries.",
                    "Tractable Orders for Direct Access to Ranked Answers of Conjunctive Queries.",
                    "Expressive Power of Linear Algebra Query Languages.",
                    "Tractability Beyond ß-Acyclicity for Conjunctive Queries with Negation.",
                    "Deciding Boundedness of Monadic Sirups.",
                    "Tuple-Independent Representations of Infinite Probabilistic Databases.",
                    "Probabilistic Databases under Updates: Boolean Query Evaluation and Ranked Enumeration.",
                    "Model-theoretic Characterizations of Rule-based Ontologies."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "39th PODS 2020",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2020",
                "sub_name": "Proceedings of the 39th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2020, Portland, OR, USA, June 14-19, 2020.",
                "count": 32,
                "papers": [
                    "word2vec, node2vec, graph2vec, X2vec: Towards a Theory of Vector Embeddings of Structured Data.",
                    "2020 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "Probabilistic Databases for All.",
                    "Coping with Incomplete Data: Recent Advances.",
                    "The Adversarial Robustness of Sampling.",
                    "A Framework for Adversarially Robust Streaming Algorithms.",
                    "A Tight Lower Bound for Comparison-Based Quantile Summaries.",
                    "Bag Query Containment and Information Theory.",
                    "First-Order Rewritability in Consistent Query Answering with Respect to Multiple Keys.",
                    "On Monotonic Determinacy and Rewritability for Recursive Queries and Views.",
                    "Solving a Special Case of the Intensional vs Extensional Conjecture in Probabilistic Databases.",
                    "Counting Problems over Incomplete Databases.",
                    "Queries with Arithmetic on Incomplete Databases.",
                    "Fair Near Neighbor Search: Independent Range Sampling in High Dimensions.",
                    "On the I/O Complexity of the k-Nearest Neighbors Problem.",
                    "Efficient Indexes for Diverse Top-k Range Queries.",
                    "Three Modern Roles for Logic in AI.",
                    "All-Instances Restricted Chase Termination.",
                    "The Limits of Efficiency for Open- and Closed-World Query Evaluation Under Guarded TGDs.",
                    "New Results for the Complexity of Resilience for Binary Conjunctive Queries with Self-Joins.",
                    "The Impact of Negation on the Complexity of the Shapley Value in Conjunctive Queries.",
                    "Projection Views of Register Automata.",
                    "Deciding Robustness for Lower SQL Isolation Levels.",
                    "Fine-Grained Complexity Analysis of Queries: From Decision to Counting and Enumeration.",
                    "Generative Datalog with Continuous Distributions.",
                    "Conjunctive Regular Path Queries with String Variables.",
                    "Trade-offs in Static and Dynamic Evaluation of Hierarchical Queries.",
                    "Answering (Unions of) Conjunctive Queries using Random Access and Random-Order Enumeration.",
                    "Parallel Algorithms for Sparse Matrix Multiplication and Join-Aggregate Queries.",
                    "Aggregate Queries on Sparse Databases.",
                    "Triangle and Four Cycle Counting in the Data Stream Model.",
                    "How the Degeneracy Helps for Triangle Counting in Graph Streams."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "38th PODS 2019",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2019",
                "sub_name": "Proceedings of the 38th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2019, Amsterdam, The Netherlands, June 30 - July 5, 2019.",
                "count": 34,
                "papers": [
                    "Differential Privacy and the US Census.",
                    "Regularizing Conjunctive Features for Classification.",
                    "Probabilistic Databases with an Infinite Open-World Assumption.",
                    "Query Evaluation in Election Databases.",
                    "2019 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "Database Repairs and Consistent Query Answering: Origins and Further Developments.",
                    "Efficient Logspace Classes for Enumeration, Counting, and Uniform Generation.",
                    "Ranked Enumeration of Minimal Triangulations.",
                    "Enumeration on Trees with Tractable Combined Complexity and Efficient Updates.",
                    "Counting Database Repairs under Primary Keys Revisited.",
                    "The Complexity of Counting Cycles in the Adjacency List Streaming Model.",
                    "On the Enumeration Complexity of Unions of Conjunctive Queries.",
                    "Split-Correctness in Information Extraction.",
                    "Robust Set Reconciliation via Locality Sensitive Hashing.",
                    "What Storage Access Privacy is Achievable with Small Overhead?",
                    "Tight Trade-offs for the Maximum k-Coverage Problem in the General Streaming Model.",
                    "Weighted Reservoir Sampling from Distributed Streams.",
                    "Distributed and Streaming Linear Programming in Low Dimensions.",
                    "Better Sliding Window Algorithms to Maximize Subadditive and Diversity Objectives.",
                    "Making Consistency Protocols Serializable.",
                    "The Space-Efficient Core of Vadalog.",
                    "Decidable XPath Fragments in the Real World.",
                    "Containment of Shape Expression Schemas for RDF.",
                    "Complexity Bounds for Relational Algebra over Document Spanners.",
                    "Reachability in Database-driven Systems with Numerical Attributes under Recency Bounding.",
                    "Compiling Existential Positive Queries to Bounded-Variable Fragments.",
                    "Testability of Homomorphism Inadmissibility: Property Testing Meets Database Theory.",
                    "The Selfish Models Property: Bounding the Complexity of Query Containment and Entailment Problems.",
                    "Attacking Diophantus: Solving a Special Case of Bag Containment.",
                    "On Functional Aggregate Queries with Additive Inequalities.",
                    "Topology Dependent Bounds For FAQs.",
                    "Instance and Output Optimal Parallel Algorithms for Acyclic Joins.",
                    "HyperBench: A Benchmark and Tool for Hypergraphs and Empirical Findings.",
                    "Algorithmic Fairness: Measures, Methods and Representations."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "37th PODS 2018",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2018",
                "sub_name": "Proceedings of the 37th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, Houston, TX, USA, June 10-15, 2018.",
                "count": 35,
                "papers": [
                    "How Can Reasoners Simplify Database Querying (And Why Haven't They Done It Yet)?",
                    "General and Fractional Hypertree Decompositions: Hard and Easy Cases.",
                    "Reconciling Graphs and Sets of Sets.",
                    "Entity Matching with Active Monotone Classification.",
                    "Set Similarity Search for Skewed Data.",
                    "Subtrajectory Clustering: Models and Algorithms.",
                    "Distance-Sensitive Hashing.",
                    "2018 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "Reflections on Schema Mappings, Data Exchange, and Metadata Management.",
                    "Worst-Case Optimal Join Algorithms: Techniques, Results, and Open Problems.",
                    "Document Spanners for Extracting Incomplete Information: Expressiveness and Complexity.",
                    "Joining Extractions of Regular Expressions.",
                    "Enumeration for FO Queries over Nowhere Dense Graphs.",
                    "Constant Delay Algorithms for Regular Document Spanners.",
                    "Enumeration of MSO Queries on Strings with Constant Delay and Logarithmic Updates.",
                    "Blockchains: Past, Present, and Future.",
                    "Certain Answers Meet Zero-One Laws.",
                    "Consistent Query Answering for Primary Keys and Conjunctive Queries with Negated Atoms.",
                    "Computing Optimal Repairs for Functional Dependencies.",
                    "An Operational Approach to Consistent Query Answering.",
                    "First-Order Query Evaluation with Cardinality Conditions.",
                    "Containment for Rule-Based Ontology-Mediated Queries.",
                    "When Can We Answer Queries Using Result-Bounded Data Interfaces?",
                    "The Tractability Frontier of Well-designed SPARQL Queries.",
                    "Compressed Representations of Conjunctive Query Results.",
                    "In-memory Representations of Databases via Succinct Data Structures: Tutorial Abstract.",
                    "In-Database Learning with Sparse Tensors.",
                    "Data Streams with Bounded Deletions.",
                    "Active Learning of GAV Schema Mappings.",
                    "Distinct Sampling on Streaming Data with Near-Duplicates.",
                    "Distributed Statistical Estimation of Matrix Products with Applications.",
                    "Optimal Differentially Private Algorithms for k-Means Clustering.",
                    "Explanations and Transparency in Collaborative Workflows.",
                    "Improvements on the k-center Problem for Uncertain Data.",
                    "Heavy Hitters and the Structure of Local Privacy."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "36th PODS 2017",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2017",
                "sub_name": "Proceedings of the 36th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2017, Chicago, IL, USA, May 14-19, 2017.",
                "count": 35,
                "papers": [
                    "Data Citation: A Computational Challenge.",
                    "A Relational Framework for Classifier Engineering.",
                    "Querying Probabilistic Preferences in Databases.",
                    "Benchmarking the Chase.",
                    "Efficient and Provable Multi-Query Optimization.",
                    "Write-Optimized Skip Lists.",
                    "Output-optimal Parallel Algorithms for Similarity Joins.",
                    "2017 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "The Semiring Framework for Database Provenance.",
                    "Data Integration: After the Teenage Years.",
                    "How Fast can a Distributed Transaction Commit?",
                    "JSON: Data model, Query languages and Schema specification.",
                    "J-Logic: Logical Foundations for JSON Querying.",
                    "Reverse Engineering SPJ-Queries from Examples.",
                    "Private Incremental Regression.",
                    "Statistical Relational Learning: Unifying AI & DB Perspectives on Structured Probabilistic Models.",
                    "Dichotomies in Ontology-Mediated Querying with the Guarded Fragment.",
                    "The Complexity of Ontology-Based Data Access with OWL 2 QL and Bounded Treewidth Queries.",
                    "Conjunctive Queries on Probabilistic Graphs: Combined Complexity.",
                    "Circuit Treewidth, Sentential Decision, and Query Compilation.",
                    "2-3 Cuckoo Filters for Faster Triangle Listing and Set Intersection.",
                    "On Asymptotic Cost of Triangle Listing in Random Graphs.",
                    "Efficiently Enumerating Minimal Triangulations.",
                    "Counting and Enumerating (Preferred) Database Repairs.",
                    "Answering Conjunctive Queries under Updates.",
                    "Communication Cost in Parallel Query Evaluation: A Tutorial.",
                    "Tight Space-Approximation Tradeoff for the Multi-Pass Streaming Set Cover Problem.",
                    "Streaming Algorithms for Measuring H-Impact.",
                    "Efficient Matrix Sketching over Distributed Data.",
                    "BPTree: An ℓ2 Heavy Hitters Algorithm Using Constant Memory.",
                    "Stable Model Semantics for Tuple-Generating Dependencies Revisited.",
                    "Schema Mappings for Data Graphs.",
                    "Dependencies for Graphs.",
                    "A Worst-Case Optimal Multi-Round Algorithm for Parallel Computation of Conjunctive Queries.",
                    "What Do Shannon-type Inequalities, Submodular Width, and Disjunctive Datalog Have to Do with One Another?"
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "35th PODS 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2016",
                "sub_name": "Proceedings of the 35th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2016, San Francisco, CA, USA, June 26 - July 01, 2016.",
                "count": 37,
                "papers": [
                    "A Theory of Regular Queries.",
                    "2016 ACM PODS Alberto O. Mendelzon Test-of-Time Award.",
                    "FAQ: Questions Asked Frequently.",
                    "Shortest Paths and Distances with Differential Privacy.",
                    "Minimization of Tree Pattern Queries.",
                    "Optimal Score Aggregation Algorithms.",
                    "Hypertree Decompositions: Questions and Answers.",
                    "Incremental View Maintenance For Collection Programming.",
                    "AJAR: Aggregations and Joins over Annotated Relations.",
                    "Bounded Query Rewriting Using Views.",
                    "Red Spider Meets a Rainworm: Conjunctive Query Finite Determinacy Is Undecidable.",
                    "Towards a Worst-Case I/O-Optimal Algorithm for Acyclic Joins.",
                    "On the Complexity of Inner Product Similarity Join.",
                    "Data Management for Social Networking.",
                    "Verification of Hierarchical Artifact Systems.",
                    "Recency-Bounded Verification of Dynamic Database-Driven Systems.",
                    "Making SQL Queries Correct on Incomplete Databases: A Feasibility Study.",
                    "Designing a Query Language for RDF: Marrying Open and Closed Worlds.",
                    "Schema Validation via Streaming Circuits.",
                    "Variability in Data Streams.",
                    "Streaming Space Complexity of Nearly All Functions of One Variable on Frequency Vectors.",
                    "Efficient Top-k Indexing via General Reductions.",
                    "Anti-Persistence on Persistent Storage: History-Independent Sparse Tables and Dictionaries.",
                    "Logical Aspects of Massively Parallel and Distributed Systems.",
                    "Counting Answers to Existential Positive Queries: A Complexity Classification.",
                    "Computing Join Queries with Functional Dependencies.",
                    "Semantic Acyclicity Under Constraints.",
                    "Tractable Lineages on Treelike Instances: Limits and Extensions.",
                    "Towards Tight Bounds for the Streaming Set Cover Problem.",
                    "An Optimal Algorithm for l1-Heavy Hitters in Insertion Streams and Related Problems.",
                    "Better Algorithms for Counting Triangles in Data Streams.",
                    "Locating a Small Cluster Privately.",
                    "Parallel Algorithms for Constructing Range and Nearest-Neighbor Searching Data Structures.",
                    "Space Lower Bounds for Itemset Frequency Sketches.",
                    "Are Few Bins Enough: Testing Histogram Distributions.",
                    "Range-Max Queries on Uncertain Data.",
                    "Fast Algorithms for Parsing Sequences of Parentheses with Few Errors."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "34th PODS 2015",
        "info": "Melbourne, Victoria, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2015",
                "sub_name": "Proceedings of the 34th ACM Symposium on Principles of Database Systems, PODS 2015, Melbourne, Victoria, Australia, May 31 - June 4, 2015.",
                "count": 30,
                "papers": [
                    "Computational Thinking, Inferential Thinking and \"Big Data\".",
                    "Dichotomies in the Complexity of Preferred Repairs.",
                    "The Data Complexity of Consistent Query Answering for Self-Join-Free Conjunctive Queries Under Primary Key Constraints.",
                    "High-Level Why-Not Explanations using Ontologies.",
                    "The ACM PODS Alberto O. Mendelzon Test-of-Time Award 2015.",
                    "Parallel-Correctness and Transferability for Conjunctive Queries.",
                    "LogiQL: A Declarative Language for Enterprise Applications.",
                    "Function Symbols in Tuple-Generating Dependencies: Expressive Power and Computability.",
                    "Default Negation for Non-Guarded Existential Rules.",
                    "Chase Termination for Guarded Existential Rules.",
                    "Recovering Exchanged Data.",
                    "The (Almost) Complete Guide to Tree Pattern Containment.",
                    "Efficient Evaluation and Approximation of Well-designed Pattern Trees.",
                    "BonXai: Combining the simplicity of DTD with the expressiveness of XML Schema.",
                    "Compact Summaries over Large Datasets.",
                    "Defining Relations on Graphs: How Hard is it in the Presence of Node Partitions?",
                    "Querying Big Data by Accessing Small Data.",
                    "Skyline Queries with Noisy Comparisons.",
                    "The Communication Complexity of Distributed Set-Joins with Applications to Matrix Multiplication.",
                    "Joins via Geometric Resolutions: Worst-case and Beyond.",
                    "External Memory Stream Sampling.",
                    "Vertex and Hyperedge Connectivity in Dynamic Graph Streams.",
                    "Fast and Near-Optimal Algorithms for Approximating Distributions by Histograms.",
                    "On Top-k Range Reporting in 2D Space.",
                    "Dynamic Data Structures for Document Collections and Graphs.",
                    "Join Dependency Testing, Loomis-Whitney Join, and Triangle Enumeration.",
                    "Private Multiplicative Weights Beyond Linear Queries.",
                    "Symmetric Weighted First-Order Model Counting.",
                    "Smooth Tradeoffs between Insert and Query Complexity in Nearest Neighbor Search.",
                    "Erratum for: Approximating and Testing k-Histogram Distributions in Sub-linear Time."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "33rd PODS 2014",
        "info": "Snowbird, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2014",
                "sub_name": "Proceedings of the 33rd ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS'14, Snowbird, UT, USA, June 22-27, 2014.",
                "count": 25,
                "papers": [
                    "Incomplete data: what went wrong, and how to fix it.",
                    "Expressive languages for querying the semantic web.",
                    "Expressiveness of guarded existential rule languages.",
                    "Containment and equivalence of well-designed SPARQL.",
                    "On scale independence for querying big data.",
                    "Weaker forms of monotonicity for declarative networking: a more fine-grained answer to the calm-conjecture.",
                    "Model-data Ecosystems: challenges, tools, and trends.",
                    "All-distances sketches, revisited: HIP estimators for massive graphs analysis.",
                    "Composable core-sets for diversity and coverage maximization.",
                    "Is min-wise hashing optimal for summarizing set intersection?",
                    "Enumerating answers to first-order queries over databases of low degree.",
                    "Counting solutions to conjunctive queries: structural and hybrid tractability.",
                    "A dichotomy for non-repeating queries with negation in probabilistic databases.",
                    "Database principles in information extraction.",
                    "Cleaning inconsistencies in information extraction via prioritized repairs.",
                    "Nested dependencies: structure and reasoning.",
                    "Does query evaluation tractability help query containment?",
                    "Generating low-cost plans from proofs.",
                    "Skew in parallel query processing.",
                    "The input/output complexity of triangle enumeration.",
                    "Beyond worst-case analysis for joins with minesweeper.",
                    "Independent range sampling.",
                    "A dynamic I/O-efficient structure for one-dimensional top-k range reporting.",
                    "Categorical range maxima queries.",
                    "Cost-oblivious storage reallocation."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "32nd PODS 2013",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2013",
                "sub_name": "Proceedings of the 32nd ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2013, New York, NY, USA - June 22 - 27, 2013.",
                "count": 28,
                "papers": [
                    "Foundations of data-aware process analysis: a database theory perspective.",
                    "The complexity of mining maximal frequent subgraphs.",
                    "Deciding monotone duality and identifying frequent itemsets in quadratic logspace.",
                    "Spanners: a formal framework for information extraction.",
                    "Learning and verifying quantified boolean queries by example.",
                    "The ACM PODS Alberto O. Mendelzon test-of-time award 2013.",
                    "Verification of database-driven systems via amalgamation.",
                    "When is naive evaluation possible?",
                    "Sketching via hashing: from heavy hitters to compressed sensing to sparse fourier transform.",
                    "Collaborative data-driven workflows: think global, act local.",
                    "I/O-efficient planar range skyline and attrition priority queues.",
                    "Nearest neighbor searching under uncertainty II.",
                    "On the BDD/FC conjecture.",
                    "On the expressive power of update primitives.",
                    "Flag & check: data access with monadically defined queries.",
                    "Verification of relational data-centric dynamic systems with external services.",
                    "Querying graph databases.",
                    "Charting the tractability frontier of certain conjunctive query answering.",
                    "Trial for RDF: adapting graph query languages for RDF data.",
                    "Ontology-based data access: a study through disjunctive datalog, CSP, and MMSNP.",
                    "Well-founded semantics for extended datalog and ontological reasoning.",
                    "Semantic acyclicity on graph databases.",
                    "On XPath with transitive axes and data tests.",
                    "A trichotomy for regular simple path queries on graphs.",
                    "Communication steps for parallel query processing.",
                    "A dichotomy in the intensional expressive power of nested relational calculi augmented with aggregate functions and a powerset operator.",
                    "Enumeration of first-order queries on classes of structures with bounded expansion.",
                    "The fine classification of conjunctive queries and parameterized logarithmic space complexity."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "31st PODS 2012",
        "info": "Scottsdale, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2012",
                "sub_name": "Proceedings of the 31st ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2012, Scottsdale, AZ, USA, May 20-24, 2012.",
                "count": 30,
                "papers": [
                    "What next?: a half-dozen data management research goals for big data and the cloud.",
                    "Graph sketches: sparsification, spanners, and subgraphs.",
                    "Approximating and testing k-histogram distributions in sub-linear time.",
                    "Mergeable summaries.",
                    "The ACM PODS Alberto O. Mendelzon test-of-time award 2012.",
                    "Worst-case optimal join algorithms: [extended abstract].",
                    "Deterministic regular expressions in linear time.",
                    "Linguistic foundations for bidirectional transformations: invited tutorial.",
                    "The power of the dinur-nissim algorithm: breaking privacy of statistical and graph databases.",
                    "A rigorous and customizable framework for privacy.",
                    "Static analysis and optimization of semantic web queries.",
                    "The complexity of evaluating path expressions in SPARQL.",
                    "Space-efficient range reporting for categorical data.",
                    "Dynamic top-k range reporting in external memory.",
                    "Indexability of 2D range search revisited: constant redundancy and weak indivisibility.",
                    "Approximate computation and implicit regularization for very large-scale data analysis.",
                    "Max-Sum diversification, monotone submodular functions and dynamic updates.",
                    "Query-based data pricing.",
                    "Local transformations and conjunctive-query equivalence.",
                    "A dichotomy in the complexity of deletion propagation with functional dependencies.",
                    "The wavelet trie: maintaining an indexed sequence of strings in compressed space.",
                    "On the optimality of clustering properties of space filling curves.",
                    "Nearest-neighbor searching under uncertainty.",
                    "Classification of annotation semirings over query containment.",
                    "Efficient approximations of conjunctive queries.",
                    "On the complexity of package recommendation problems.",
                    "Space-efficient estimation of statistics over sub-sampled streams.",
                    "Rectangle-efficient aggregation in spatial data streams.",
                    "Randomized algorithms for tracking distributed count, frequencies, and ranks.",
                    "Continuous distributed counting for non-monotonic streams."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "30th PODS 2011",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2011",
                "sub_name": "Proceedings of the 30th ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2011, June 12-16, 2011, Athens, Greece.",
                "count": 28,
                "papers": [
                    "A quest for beauty and wealth (or, business processes for database researchers).",
                    "Get the most out of your sample: optimal unbiased estimators using partial information.",
                    "FIFO indexes for decomposable problems.",
                    "Pan-private algorithms via statistics on sketches.",
                    "Tight bounds for Lp samplers, finding duplicates in streams, and related problems.",
                    "Incomplete information and certain answers in general data models.",
                    "Determining the currency of data.",
                    "Data exchange beyond complete data.",
                    "Space-efficient substring occurrence estimation.",
                    "On finding skylines in external memory.",
                    "Beyond simple aggregates: indexing for summary queries.",
                    "New results on two-dimensional orthogonal range aggregation in external memory.",
                    "On provenance minimization.",
                    "Provenance for aggregate queries.",
                    "On the complexity of privacy-preserving complex event processing.",
                    "Provenance views for module privacy.",
                    "Maximizing conjunctive views in deletion propagation.",
                    "Querying graph patterns.",
                    "Determining relevance of accesses at runtime.",
                    "Parallel evaluation of conjunctive queries.",
                    "Finding a minimal tree pattern under neighborhood constraints.",
                    "The complexity of text-preserving XML transformations.",
                    "Efficient evaluation for a temporal logic on changing XML documents.",
                    "Rewrite rules for search database systems.",
                    "Relational transducers for declarative networking.",
                    "A rule-based language for web data management.",
                    "Querying semantic web data with SPARQL.",
                    "Theory of data stream computing: where to go."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "29th PODS 2010",
        "info": "Indianapolis, Indiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2010",
                "sub_name": "Proceedings of the Twenty-Ninth ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2010, June 6-11, 2010, Indianapolis, Indiana, USA.",
                "count": 31,
                "papers": [
                    "Datalog redux: experience and conjecture.",
                    "Expressive languages for path queries over graph-structured data.",
                    "Transducing Markov sequences.",
                    "Positive higher-order queries.",
                    "The ACM PODS Alberto O. Mendelzon test-of-time-award 2010.",
                    "An optimal algorithm for the distinct elements problem.",
                    "Understanding cardinality estimation using entropy maximization.",
                    "From information to knowledge: harvesting entities and relationships from web sources.",
                    "Optimal sampling from distributed streams.",
                    "Incremental query evaluation in a ring of databases.",
                    "Fast Manhattan sketches in data streams.",
                    "Semantic query optimization in the presence of types.",
                    "Optimizing linear counting queries under differential privacy.",
                    "Universally optimal privacy mechanisms for minimax agents.",
                    "Towards an axiomatization of statistical privacy and utility.",
                    "Information complexity: a tutorial.",
                    "Capturing missing tuples and missing values.",
                    "On the first-order expressibility of computing certain answers to conjunctive queries over uncertain databases.",
                    "Certain answers for XML queries.",
                    "Computing query probability with incidence algebras.",
                    "On probabilistic fixpoint and Markov chain query languages.",
                    "Foundations of schema mapping management.",
                    "Schema design for XML repositories: complexity and tractability.",
                    "Simplifying XML schema: single-type approximations of regular tree languages.",
                    "Characterizing schema mappings via data examples.",
                    "Understanding queries in a search database system.",
                    "A learning algorithm for top-down XML transformations.",
                    "Cache-oblivious hashing.",
                    "Performance guarantees for B-trees with different-sized atomic keys.",
                    "When data dependencies over SQL tables meet the logics of paradox and S-3.",
                    "The power of tree projections: local consistency, greedy algorithms, and larger islands of tractability."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "28th PODS 2009",
        "info": "Providence, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2009",
                "sub_name": "Proceedings of the Twenty-Eigth ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2009, June 19 - July 1, 2009, Providence, Rhode Island, USA.",
                "count": 30,
                "papers": [
                    "A web of concepts.",
                    "Generalized schema-mappings: from termination to tractability.",
                    "Reverse data exchange: coping with nulls.",
                    "XML schema mappings.",
                    "The ACM PODS Alberto O. Mendelzon test-of-time-award 2009.",
                    "Size and treewidth bounds for conjunctive queries.",
                    "XPath evaluation in linear time with polynomial combined complexity.",
                    "The finite model theory toolbox of a database theoretician.",
                    "A general datalog-based framework for tractable query answering over ontologies.",
                    "Satisfiability and relevance for queries over active documents.",
                    "Relative information completeness.",
                    "Relationship privacy: output perturbation for queries with joins.",
                    "An efficient rigorous approach for identifying statistically significant frequent itemsets.",
                    "Similarity caching.",
                    "Indexing uncertain data.",
                    "Optimal sampling from sliding windows.",
                    "Space-optimal heavy hitters with strong error bounds.",
                    "Optimal tracking of distributed heavy hitters and quantiles.",
                    "Worst-case efficient range search indexing: invited tutorial.",
                    "Secondary indexing in one dimension: beyond b-trees and bitmap indexes.",
                    "Dynamic indexability and lower bounds for dynamic one-dimensional range query indexes.",
                    "Satisfiability of downward XPath with data equality tests.",
                    "Equivalence of nested queries with mixed semantics.",
                    "Equivalence of SQL queries in presence of embedded dependencies.",
                    "Running tree automata on probabilistic XML.",
                    "XML with incomplete information: models, properties, and query answering.",
                    "Distributed XML design.",
                    "Consensus answers for queries over probabilistic databases.",
                    "Exceeding expectations and clustering uncertain data.",
                    "Computing all skyline probabilities for uncertain data."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "27th PODS 2008",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2008",
                "sub_name": "Proceedings of the Twenty-Seventh ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS 2008, June 9-11, 2008, Vancouver, BC, Canada.",
                "count": 31,
                "papers": [
                    "Curated databases.",
                    "The recovery of a schema mapping: bringing exchanged data back.",
                    "On the complexity of deriving schema mappings from database instances.",
                    "Towards a theory of schema-mapping optimization.",
                    "Evaluating rank joins with optimal cost.",
                    "Effective characterizations of tree logics.",
                    "Estimating PageRank on graph streams.",
                    "A generic flow algorithm for shared filter ordering problems.",
                    "Time-decaying aggregates in out-of-order streams.",
                    "Approximating predicates and expressive queries on probabilistic databases.",
                    "Incorporating constraints in probabilistic XML.",
                    "Query evaluation with soft-key constraints.",
                    "Answering aggregate queries in data exchange.",
                    "Data exchange and schema mappings in open and closed worlds.",
                    "The chase revisited.",
                    "Dependencies revisited for improving data quality.",
                    "Epistemic privacy.",
                    "On searching compressed string collections cache-obliviously.",
                    "Approximation algorithms for clustering uncertain data.",
                    "Approximation algorithms for co-clustering.",
                    "The power of two min-hashes for similarity search among hierarchical data objects.",
                    "Static analysis of active XML systems.",
                    "Complexity and composition of synthesized web services.",
                    "XPath evaluation in linear time.",
                    "XPath, transitive closure logic, and nested tree walking automata.",
                    "Local Hoare reasoning about DOM.",
                    "Annotated XML: queries and provenance.",
                    "Near-optimal dynamic replication in unstructured peer-to-peer networks.",
                    "Type inference for datalog and its application to query optimisation.",
                    "Shape sensitive geometric monitoring.",
                    "Tree-width and functional dependencies in databases."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "26th PODS 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2007",
                "sub_name": "Proceedings of the Twenty-Sixth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 11-13, 2007, Beijing, China.",
                "count": 31,
                "papers": [
                    "Management of probabilistic data: foundations and challenges.",
                    "Generalized hypertree decompositions: np-hardness and tractable variants.",
                    "Queries determined by views: pack your views.",
                    "Provenance semirings.",
                    "Machine models and lower bounds for query processing.",
                    "Decision trees for entity identification: approximation algorithms and hardness results.",
                    "XML transformation by tree-walking transducers with invisible pebbles.",
                    "The complexity of query containment in expressive fragments of XPath 2.0.",
                    "Expressiveness and complexity of xml publishing transducers.",
                    "Maintaining bernoulli samples over evolving multisets.",
                    "Finding near neighbors through cluster pruning.",
                    "CWA-solutions for data exchange settings with target dependencies.",
                    "Quasi-inverses of schema mappings.",
                    "On reconciling data exchange, data integration, and peer data management.",
                    "A crash course on database queries.",
                    "The complexity of reasoning about pattern-based XML schemas.",
                    "Monadic datalog over finite structures with bounded treewidth.",
                    "Index-based multidimensional array queries: safety and equivalence.",
                    "Non-linear prefixes in query languages.",
                    "Reasoning about XML update constraints.",
                    "Polynomial time fragments of XPath with variables.",
                    "Optimization of continuous queries with shared expensive filters.",
                    "Variance estimation over sliding windows.",
                    "Marrying words and trees.",
                    "Estimating statistical aggregates on probabilistic data streams.",
                    "Sketching unaggregated data streams for subpopulation-size queries.",
                    "What is \"next\" in event processing?",
                    "Privacy, accuracy, and consistency too: a holistic solution to contingency table release.",
                    "On the complexity of managing probabilistic XML data.",
                    "The dichotomy of conjunctive queries on probabilistic structures.",
                    "Maximally joining probabilistic data."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "25th PODS 2006",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2006",
                "sub_name": "Proceedings of the Twenty-Fifth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 26-28, 2006, Chicago, Illinois, USA.",
                "count": 39,
                "papers": [
                    "Principles of dataspace systems.",
                    "Two-variable logic on data trees and XML reasoning.",
                    "An adaptive packed-memory array.",
                    "The complexity of data exchange.",
                    "Data exchange: computing cores in polynomial time.",
                    "Inverting schema mappings.",
                    "Data exchange and incomplete information.",
                    "Equivalence of queries combining set and bag-set semantics.",
                    "The containment problem for REAL conjunctive queries with inequalities.",
                    "Verification of communicating data-driven web services.",
                    "Analyzing workflows implied by instance-dependent access rules.",
                    "From statistical knowledge bases to degrees of belief: an overview.",
                    "On redundancy vs dependency preservation in normalization: an information-theoretic study of 3NF.",
                    "Tractable database design through bounded treewidth.",
                    "Evolution of page popularity under random web graph models.",
                    "Privacy via pseudorandom sketches.",
                    "Achieving anonymity via clustering.",
                    "On the efficiency of checking perfect privacy.",
                    "Finding and approximating top-k answers in keyword proximity search.",
                    "Efficiently ordering subgoals with access constraints.",
                    "Flow algorithms for two pipelined filter ordering problems.",
                    "Asking the right questions: model-driven optimization using probes.",
                    "Processing queries on tree-structured data efficiently.",
                    "Scalable computation of acyclic joins.",
                    "Cache-oblivious string B-trees.",
                    "Randomized computations on large data sets: tight lower bounds.",
                    "Counting triangles in data streams.",
                    "Space- and time-efficient deterministic algorithms for biased quantiles over data streams.",
                    "Approximate quantiles and the order of the stream.",
                    "Deterministic k-set structure.",
                    "A simpler and more efficient deterministic scheme for finding frequent items over sliding windows.",
                    "Finding global icebergs over distributed data sets.",
                    "Efficient gossip-based aggregate computation.",
                    "Structural characterizations of the semantics of XPath as navigation tool on a document.",
                    "The expressivity of XPath with transitive closure.",
                    "Relational lenses: a language for updatable views.",
                    "Programmable clustering.",
                    "The logic of RDF and SPARQL: a tutorial.",
                    "On the decidability and finite controllability of query processing in databases with incomplete information."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "24th PODS 2005",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2005",
                "sub_name": "Proceedings of the Twenty-fourth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 13-15, 2005, Baltimore, Maryland, USA.",
                "count": 35,
                "papers": [
                    "Context-sensitive program analysis as database queries.",
                    "XML data exchange: consistency and query answering.",
                    "XPath satisfiability in the presence of DTDs.",
                    "Deciding well-definedness of XQuery fragments.",
                    "Views and queries: determinacy and rewriting.",
                    "Schema mappings, data exchange, and metadata management.",
                    "On the complexity of division and set joins in the relational algebra.",
                    "On the complexity of nonrecursive XQuery and functional query languages on complex values.",
                    "An incremental algorithm for computing ranked full disjunctions.",
                    "Security analysis of cryptographically controlled access to XML documents.",
                    "Simulatable auditing.",
                    "Practical privacy: the SuLQ framework.",
                    "Privacy-enhancing k-anonymization of customer data.",
                    "Computing cores for data exchange: new algorithms and practical solutions.",
                    "Peer data exchange.",
                    "Composition of mappings given by embedded dependencies.",
                    "Multi-structural databases.",
                    "A divide-and-merge methodology for clustering.",
                    "Allocating isolation levels to transactions.",
                    "Buffering in query evaluation over XML streams.",
                    "Histograms revisited: when are histograms the best approximation method for aggregates over joins?",
                    "Lower bounds for sorting with few random accesses to external memory.",
                    "Operator placement for in-network stream query processing.",
                    "Join-distinct aggregate estimation over update streams.",
                    "Space efficient mining of multigraph streams.",
                    "XML type checking with macro tree transducers.",
                    "Regular rewriting of active XML and unambiguity.",
                    "Determining source contribution in integration systems.",
                    "Models and methods for privacy-preserving data publishing and analysis: invited tutorial.",
                    "Estimating arbitrary subset sums with few probes.",
                    "FTW: fast similarity search under the time warping distance.",
                    "Space complexity of hierarchical heavy hitters in multi-dimensional data streams.",
                    "Differential constraints.",
                    "Diagnosis of asynchronous discrete event systems: datalog to the rescue!",
                    "Relative risk and odds ratio: a data mining perspective."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "23rd PODS 2004",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2004",
                "sub_name": "Proceedings of the Twenty-third ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 14-16, 2004, Paris, France.",
                "count": 34,
                "papers": [
                    "Forword.",
                    "The Lixto Data Extraction Project - Back and Forth between Theory and Practice.",
                    "Conditional XPath, the First Order Complete XPath Dialect.",
                    "Frontiers of Tractability for Typechecking Simple XML Transformations.",
                    "Positive Active XML.",
                    "The Past, Present and Future of Web Information Retrieval.",
                    "Comparing and Aggregating Rankings with Ties.",
                    "Using Non-Linear Dynamical Systems for Web Searching and Ranking.",
                    "Specification and Verification of Data-driven Web Services.",
                    "Composing Schema Mappings: Second-Order Dependencies to the Rescue.",
                    "Foundations of Semantic Web Databases.",
                    "A Characterization of First-Order Topological Properties of Planar Spatial Data.",
                    "Roads, Codes and Spatiotemporal Queries.",
                    "Replicated Declustering of Spatial Data.",
                    "Clustering via Matrix Powering.",
                    "Computational Complexity of Itemset Frequency Satisfiability.",
                    "k-Means Projective Clustering.",
                    "Deterministic Wavelet Thresholding for Maximum-Error Metrics.",
                    "On the Memory Requirements of XPath Evaluation over XML Streams.",
                    "Conjunctive Queries over Trees.",
                    "Synopses for Query Optimization: A Space-Complexity Perspective.",
                    "Weighted Hypertree Decompositions and Optimal Query Plans.",
                    "Trees, Automata and XML.",
                    "On the Complexity of Optimal K-Anonymity.",
                    "Locally Consistent Transformations and Query Answering in Data Exchange.",
                    "Logical Foundations of Peer-To-Peer Data Integration.",
                    "Adaptive Sampling for Geometric Problems over Data Streams.",
                    "Flexible Time Management in Data Stream Systems.",
                    "Power-Conserving Computation of Order-Statistics over Sensor Networks.",
                    "Approximate Counts and Quantiles over Sliding Windows.",
                    "On the Decidability of Containment of Recursive Datalog Queries - Preliminary report.",
                    "Processing First-Order Queries under Limited Access Patterns.",
                    "On Preservation under Homomorphisms and Unions of Conjunctive Queries.",
                    "Multi-valued Dependencies in the Presence of Lists."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "22nd PODS 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2003",
                "sub_name": "Proceedings of the Twenty-Second ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 9-12, 2003, San Diego, CA, USA.",
                "count": 29,
                "papers": [
                    "E-services: a look behind the curtain.",
                    "An information-theoretic approach to normal forms for relational and XML data.",
                    "Algorithms for data migration with cloning.",
                    "Privacy in data systems.",
                    "Materializing views with minimal size to answer queries.",
                    "The impact of the constant complement approach towards view updating.",
                    "View-based query containment.",
                    "The view selection problem for XML content based routing.",
                    "Computing full disjunctions.",
                    "Data exchange: getting to the core.",
                    "Soft stratification for magic set based query evaluation in deductive databases.",
                    "Query containment and rewriting using views for regular path queries under constraints.",
                    "Concise descriptions of subsets of structured sets.",
                    "On producing join results early.",
                    "Correlating XML data streams using tree-edit distance embeddings.",
                    "Numerical document queries.",
                    "Typing and querying XML documents: some complexity bounds.",
                    "The complexity of XPath query evaluation.",
                    "Query-preserving watermarking of relational databases and XML documents.",
                    "Revealing information while preserving privacy.",
                    "Limiting privacy breaches in privacy preserving data mining.",
                    "Maintaining time-decaying stream aggregates.",
                    "Maintaining variance and k-medians over data stream windows.",
                    "Optimal indexing using near-minimal space.",
                    "On nearest neighbor indexing of nonlinear trajectories.",
                    "On the decidability and complexity of query answering over inconsistent and incomplete databases.",
                    "How to quickly find a witness.",
                    "Feasible itemset distributions in data mining: theory and application.",
                    "What's hot and what's not: tracking most frequent items dynamically."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "21st PODS 2002",
        "info": "Madison, Wisconsin, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2002",
                "sub_name": "Proceedings of the Twenty-first ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 3-5, Madison, Wisconsin, USA.",
                "count": 27,
                "papers": [
                    "Models and Issues in Data Stream Systems.",
                    "Monadic Datalog and the Expressive Power of Languages for Web Information Extraction.",
                    "From Discrepancy to Declustering: Near optimal multidimensional declustering strategies for range queries.",
                    "Algorithmics and Applications of Tree and Graph Searching.",
                    "Validating Streaming XML Documents.",
                    "Containment and Equivalence for an XPath Fragment.",
                    "On the Power of Walking for Querying Tree-Structured Data.",
                    "A Normal Form for XML Documents.",
                    "Distributed Computation of Web Queries Using Automata.",
                    "Conjunctive Selection Conditions in Main Memory.",
                    "Efficient Aggregation over Objects with Extent.",
                    "How to Evaluate Multiple Range-Sum Queries Progressively.",
                    "On the Computation of Relational View Complements.",
                    "On Propagation of Deletions and Annotations Through Views.",
                    "The View-Selection Problem Has an Exponential-Time Lower Bound for Conjunctive Queries and Views.",
                    "OLAP Dimension Constraints.",
                    "Fast Algorithms For Hierarchical Range Histogram Construction.",
                    "On Moving Object Queries.",
                    "Knowledge Compilation = Query Rewriting + View Synthesis.",
                    "Answering Queries Using Views with Arithmetic Comparisons.",
                    "Characterizing Memory Requirements for Queries over Continuous Data Streams.",
                    "Data Integration: A Theoretical Perspective.",
                    "Lossless Regular Views.",
                    "On Verifying Consistency of XML Specifications.",
                    "Labeling Dynamic XML Trees.",
                    "On the Complexity of Approximate Query Optimization.",
                    "Least Expected Cost Query Optimization: What Can We Expect?"
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "20th PODS 2001",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/2001",
                "sub_name": "Proceedings of the Twentieth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 21-23, 2001, Santa Barbara, California, USA.",
                "count": 29,
                "papers": [
                    "A Web Odyssey: From Codd to XML.",
                    "Querying Websites Using Compact Skeletons.",
                    "Dynamically Distributed Query Evaluation.",
                    "Flexible Queries Over Semistructured Data.",
                    "Multiobjective Query Optimization.",
                    "Pipelining in Multi-Query Optimization.",
                    "Optimization of Sequence Queries in Database Systems.",
                    "The Parameterized Complexity of Database Queries.",
                    "Relaxed Multi-Way Trees with Group Updates.",
                    "Optimal Aggregation Algorithms for Middleware.",
                    "On XML Integrity Constraints in the Presence of DTDs.",
                    "Extended Path Expressions for XML.",
                    "XML with Data Values: Typechecking Revisited.",
                    "Representing and Querying XML with Incomplete Information.",
                    "Querying Partially Sound and Complete Data Sources.",
                    "On Computing Functions with Uncertainty.",
                    "String Operations in Query Languages.",
                    "Robbers, Marshals, and Guards: Game Theoretic and Logical Characterizations of Hypertree Width.",
                    "On the Complexity of Join Predicates.",
                    "Equivalences among Aggregate Queries with Negation.",
                    "Optimal and Approximate Computation of Summary Statistics for Range Aggregates.",
                    "Efficient Computation of Temporal Aggregates with Range Predicates.",
                    "The Challenges of Delivering Content on the Internet.",
                    "On the Design and Quantification of Privacy Preserving Data Mining Algorithms.",
                    "On the Effects of Dimensionality Reduction on High Dimensional Similarity Search.",
                    "A condensed representation to find frequent patterns.",
                    "Database-friendly random projections.",
                    "Two-dimensional Substring Indexing.",
                    "Process Locking: A Protocol based on Ordered Shared Locks for the Execution of Transactional Processes."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "19th PODS 2000",
        "info": "Dallas, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/00",
                "sub_name": "Proceedings of the Nineteenth ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, May 15-17, 2000, Dallas, Texas, USA.",
                "count": 29,
                "papers": [
                    "The Web as a Graph.",
                    "Typechecking for XML Transformers.",
                    "Integrity Constraints for XML.",
                    "DTD Inference for Views of XML Data.",
                    "On the Content of Materialized Aggregate Views.",
                    "View-Based Query Processing for Regular Path Queries with Inverse.",
                    "Query Containment for Data Integration Systems.",
                    "Constraint Satisfaction and Database Theory: a Tutorial.",
                    "Auditing Boolean Attributes.",
                    "Verification of Relational Transducers for Electronic Commerce.",
                    "Reachability and Connectivity Queries in Constraint Databases.",
                    "Fixed-Point Query Languages for Linear Constraint Databases.",
                    "Linear Approximation of Planar Spatial Databases Using Transitive-Closure Logic.",
                    "Computational Aspects of Resilient Data Extraction from Semistructured Sources.",
                    "Expressive and Efficient Pattern Languages for Tree-Structured Data.",
                    "Expressive Power and Data Complexity of Query Languages for Trees and Lists.",
                    "Indexing the Edges - A Simple and Yet Efficient Approach to High-Dimensional Indexing.",
                    "Indexing Moving Points.",
                    "On Herbrand Semantics and Conflict Serializability of Read-Write Transactions.",
                    "Entrepreneurship for Information Systems Researchers (Abstract of Invited Tutorial).",
                    "Optimal Histograms for Hierarchical Range Queries.",
                    "(Almost) Optimal Parallel Block Access for Range Queries.",
                    "Selectivity Estimation for Boolean Queries.",
                    "Traversing Itemset Lattice with Statistical Metric Pruning.",
                    "Computational Properties of Metaquerying Problems.",
                    "Information Dependencies.",
                    "Uniform Generation in Spatial Constraint Databases and Applications.",
                    "Analysis and Application of Adaptive Sampling.",
                    "Towards Estimation Error Guarantees for Distinct Values."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "18th PODS 1999",
        "info": "Philadephia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/99",
                "sub_name": "Proceedings of the Eighteenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 31 - June 2, 1999, Philadelphia, Pennsylvania, USA.",
                "count": 35,
                "papers": [
                    "On Views and XML.",
                    "Tracking Join and Self-Join Sizes in Limited Storage.",
                    "Hypertree Decompositions and Tractable Queries.",
                    "Efficient Sequencing Tape-Resident Jobs.",
                    "Processing and Optimization of Multiway Spatial Joins Using R-Trees.",
                    "Interaction between Path and Type Constraints.",
                    "Consistent Query Answers in Inconsistent Databases.",
                    "Type Inference in the Polymorphic Relational Algebra.",
                    "Reasoning about Nested Functional Dependencies.",
                    "Open Problems in Electronic Commerce.",
                    "Exact and Approximate Aggregation in Constraint Query.",
                    "Minimal Data Upgrading to Prevent Inference and Association.",
                    "A Framework for Measuring Changes in Data Characteristics.",
                    "Least Expected Cost Query Optimization: An Exercise in Utility.",
                    "Inherent Complexity of Recursive Queries (Extended Abstract).",
                    "Rewriting Aggregate Queries Using Views.",
                    "On the Complexity of the View-Selection Problem.",
                    "Querying Aggregate Data.",
                    "Applications of Linear Algebra in Information Retrieval and Hypertext Analysis.",
                    "Rewriting of Regular Expressions and Regular Path Queries.",
                    "Query Automata.",
                    "Type Inference for Queries on Semistructured Data.",
                    "Queries with Incomplete Answers over Semistructured Data.",
                    "Fast Time-Series Searching with Scaling and Shifting.",
                    "Substring Selectivity Estimation.",
                    "On Indexing Mobile Objects.",
                    "Using LDAP Directory Caches.",
                    "Correctness in General Configurations of Transactional Components.",
                    "Workflow, Transactions, and Datalog.",
                    "Atomicity with Incompatible Presumptions.",
                    "Concurrency Control and Recovery in Transactional Process Management.",
                    "Window-Accumulated Subsequence Matching Problem is Linear.",
                    "Locality Preserving Dictionaries: Theory and Application to Clustering in Databases.",
                    "On Two-Dimensional Indexability and Optimal Range Search Indexing.",
                    "Group Updates for Relaxed Height-Balanced Trees."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "17th PODS 1998",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/98",
                "sub_name": "Proceedings of the Seventeenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 1-3, 1998, Seattle, Washington, USA.",
                "count": 32,
                "papers": [
                    "Fuzzy Queries in Multimedia Database Systems.",
                    "Expressiveness of Structured Document Query Languages Based on Attribute Grammars.",
                    "A New Framework For Itemset Generation.",
                    "Logic Based Modeling and Analysis of Workflows.",
                    "An Overview of Query Optimization in Relational Systems.",
                    "A Lower Bound Theorem for Indexing Schemes and Its Application to Multidimensional Range Queries.",
                    "Tight Bounds for 2-Dimensional Indexing Schemes.",
                    "A Cost Model for Similarity Queries in Metric Spaces.",
                    "Data Base Design Principles for Striping and Placement of Delay-Sensitive Data on Disks.",
                    "Throughput-Competitive Admission Control for Continuous Media Databases.",
                    "Querying Spatial Databases via Topological Invariants.",
                    "Safe Constraint Queries.",
                    "An Expressive Language for Linear Spatial Database Queries.",
                    "External Memory Algorithms.",
                    "Path Constraints in Semistructured and Structured Databases.",
                    "Query Containment for Conjunctive Queries with Regular Expressions.",
                    "On the Decidability of Query Containment under Constraints.",
                    "Latent Semantic Indexing: A Probabilistic Analysis.",
                    "Efficient Searching with Linear Constraints.",
                    "Relational Transducers for Electronic Commerce.",
                    "Generalizing Data to Provide Anonymity when Disclosing Information (Abstract).",
                    "Typed Query Languages for Databases Containing Queries.",
                    "On the Complexity of the Containment Problem for Conjunctive Queries with Built-in Predicates.",
                    "Conjunctive-Query Containment and Constraint Satisfaction.",
                    "Deciding Equivalences Among Aggregate Queries.",
                    "Data Bases in Digital Libraries: Where Computer Science and Information Management Meet.",
                    "The Complexity of Query Reliability.",
                    "Dynamic Tree Isomorphism via First-Order Updates.",
                    "Complexity of Nonrecursive Logic Programs with Complex Values.",
                    "Complexity of Answering Queries Using Materialized Views.",
                    "Decidability and Undecidability Results for the Termination Problem of Active Database Rules.",
                    "Dynamic Assembly of Views in Data Cubes."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "16th PODS 1997",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/97",
                "sub_name": "Proceedings of the Sixteenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 12-14, 1997, Tucson, Arizona, USA.",
                "count": 27,
                "papers": [
                    "Multimedia Support for Databases.",
                    "On the Complexity of Database Queries.",
                    "Deciding Containment for Queries with Complex Objects.",
                    "On the Containment and Equivalence of Database Queries with Linear Constraints.",
                    "Conjunctive Query Equivalence of Keyed Relational Schemas.",
                    "Managing Semantic Heterogeneity in Databases: A Theoretical Perspective.",
                    "Complete Geometrical Query Languages.",
                    "On the Decidability of Semi-Linearity of Semi-Algebraic Sets and Its Implications for Spatial Databases.",
                    "A Cost Model For Nearest Neighbor Search in High-Dimensional Data Space.",
                    "Languages for Relational Databases over Interpreted Structures.",
                    "Rewriting Queries Using Views in Description Logics.",
                    "Answering Recursive Queries Using Views.",
                    "Semistructured Data.",
                    "Regular Path Queries with Constraints.",
                    "Formal Models of Web Queries.",
                    "Cut & Paste.",
                    "Stochastic Service Guarantees for Continuous Data on Multi-Zone Disks.",
                    "Epidemic Algorithms in Replicated Databases (Extended Abstract).",
                    "Replication and Consistency: Being Lazy Helps Sometimes.",
                    "OLAP and Statistical Databases: Similarities and Differences.",
                    "Correctness and Parallelism of Composite Systems.",
                    "Data mining, Hypergraph Transversals, and Machine Learning.",
                    "Referential Actions as Logic Rules.",
                    "Partial-Sum Queries in Data Cubes Using Covering Codes.",
                    "On the Complexity of Generating Optimal Plans with Cross Products.",
                    "On the Analysis of Indexing Schemes.",
                    "Processing Queries By Linear Constraints."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "15th PODS 1996",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/96",
                "sub_name": "Proceedings of the Fifteenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 3-5, 1996, Montreal, Canada.",
                "count": 26,
                "papers": [
                    "Accessing Information from Globally Distributed Knowledge Repositories.",
                    "Relational Expressive Power of Constraint Query Languages.",
                    "Linear vs. Order Contstrained Queries Over Rational Databases.",
                    "Towards Practical Constraint Databases.",
                    "Variable Independence and Aggregation Closure.",
                    "Temporal Versus First-Order Logic to Query Temporal Databases.",
                    "Point vs. Interval-based Query Languages for Temporal Databases.",
                    "Testing Complex Temporal Relationships Involving Multiple Granularities and Its Application to Data Mining.",
                    "In Memoriam: Paris C. Kanellakis.",
                    "Geographic Database Systems: Issues and Research Needs (Abstract).",
                    "Topological Queries in Spatial Databases.",
                    "Tables as a Paradigm for Querying and Restructuring.",
                    "On Genericity and Parametricity.",
                    "Verifiable Properties of Database Transactions.",
                    "Chasing Constrained Tuple-Generating Dependencies.",
                    "Recovery for Transaction Failures in Object-Based Databases.",
                    "Are Window Queries Representative for Arbitrary Range Queries?",
                    "A Model for the Prediction of R-tree Performance.",
                    "Efficient and Acurate Cost Models for Parallel Query Optimization.",
                    "Mining Optimized Association Rules for Numeric Attributes.",
                    "Managing Rule Conflicts in an Active Database.",
                    "Static Analysis of Intensional Databases in U-Datalog.",
                    "Future Directions and Research Problems in the World Wide Web (Abstract).",
                    "Combining Fuzzy Information from Multiple Systems.",
                    "Answering Queries Using Limited External Processors.",
                    "Integrating Information by Outerjoins and Full Disjunctions."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "14th PODS 1995",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/95",
                "sub_name": "Proceedings of the Fourteenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 22-25, 1995, San Jose, California, USA.",
                "count": 29,
                "papers": [
                    "Database Metatheory: Asking the Big Queries.",
                    "Algebras for Querying Text Regions.",
                    "Sequences, Datalog and Transducers.",
                    "Similarity-Based Queries.",
                    "Constraint Programming and Database Languages: A Tutorial.",
                    "Separability of Polyhedra for Optimal Filtering of Spatial and Constraint Data.",
                    "Dense-Order Constraint Databases.",
                    "Measuring Infinite Relations.",
                    "Window Query-Optimal Clustering of Spatial Objects.",
                    "Answering Queries Using Views.",
                    "Answering Queries Using Templates with Binding Patterns.",
                    "View Maintenance Issues for the Chronicle Data Model.",
                    "Research Problems in Genome Databases.",
                    "Semantics and Expressiveness Issues in Active Databases.",
                    "Space-Bounded FOIES.",
                    "The Size of a Revised Knowledge Base.",
                    "Semantic Query Optimization in Datalog Programs.",
                    "Magic Factoring of Closure Programs.",
                    "Structural Totality and Constraint Stratification.",
                    "Using Witness Generators to Support Bi-directional Update Between Object-Based Databases.",
                    "Applying an Update Method to a Set of Receivers.",
                    "Normalizing Incomplete Databases.",
                    "Combinatorial Games In Database Theory.",
                    "Safe Locking Policies for Dynamic Databases.",
                    "Increasing the Resilience of Atomic Commit at No Additional Cost.",
                    "Scheduling Problems in Parallel Query Optimization.",
                    "On the Complexity of Bounded-Variable Queries.",
                    "Finite Queries do not Have Effective Syntax.",
                    "The Reliability of Queries."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "13th PODS 1994",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/94",
                "sub_name": "Proceedings of the Thirteenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 24-26, 1994, Minneapolis, Minnesota, USA.",
                "count": 32,
                "papers": [
                    "Will I be Pretty, Will I be Rich? Some Thoughts on Theory vs. Practice in Systems Engineering (Summary).",
                    "Beyond Uniformity and Independence: Analysis of R-trees Using the Concept of Fractal Dimension.",
                    "On the Relative Cost of Sampling for Join Selectivity Estimation.",
                    "Path Caching: A Technique for Optimal External Searching.",
                    "Optimal Response Time Retrieval of Replicated Data.",
                    "Constraint Checking with Partial Information.",
                    "Compiling Query Constraints.",
                    "Constraints among Argument Sizes in Logic Programs.",
                    "Tutorial Database Mining.",
                    "The Power of Sampling in Knowledge Discovery.",
                    "Can Datalog be Approximated?",
                    "Bounded Arity Datalog (!=) Queries on Graphs.",
                    "On the Complexity of Equivalence between Recursive and Nonrecursive Datalog Programs.",
                    "A Decomposition-Based Simulated Annealing Technique for Data Clustering.",
                    "Reducing Recovery Constraints on Locking based Protocols.",
                    "Relative Serializbility: An Approach for Relaxing the Atomicity of Transactions.",
                    "Tutorial: Languages for Collection Types.",
                    "New Techniques for Studying Set Languages, Bag Languages and Aggregate Functions.",
                    "A Query Language for NC.",
                    "A Query Language for List-Based Complex Objects.",
                    "Universal Finiteness and Satisfiability.",
                    "Any Algorithm in the Complex Object Algebra with Powerset Needs Exponential Space to Compute Transitive Closure.",
                    "Dyn-FO: A Parallel, Dynamic Complexity Class.",
                    "Functional Database Query Languages as Typed Lambda Calculi of Fixed Order.",
                    "Object Migration.",
                    "Making Object-Oriented Schemas More Expressive.",
                    "A Polymorphic Calculus for Views and Object Sharing.",
                    "Adding Disjunction to Datalog.",
                    "Towards a Theory of Spatial Database Queries.",
                    "Finitely Representable Databases.",
                    "Tutorial: Text Dominated Databases, Theory Practice and Experience.",
                    "Reasoning about Strings in Databases."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "12th PODS 1993",
        "info": "Washington, D.C., USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/93",
                "sub_name": "Proceedings of the Twelfth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 25-28, 1993, Washington, DC, USA.",
                "count": 27,
                "papers": [
                    "A Call to Order.",
                    "Reflective Programming in the Relational Algebra.",
                    "Normal Forms and Conservative Properties for Query Languages over Collection Types.",
                    "Semantic Representations and Query Languages for Or-sets.",
                    "Towards Tractable Algebras for Bags.",
                    "Optimization of Real Conjunctive Queries.",
                    "On the Semantics of Theory Change: Arbitration between Old and New Information.",
                    "Extended Commitment Ordering or Guaranteeing Global Serializability by Applying Commitment Order Selectivity to Global Transactions.",
                    "On Correctness of Non-serializable Executions.",
                    "Equivalence, Query-Reachability, and Satisfiability in Datalog Extensions.",
                    "An Alternating Fixpoint Tailored to Magic Programs.",
                    "Finding Nonrecursive Envelopes for Datalog Predicates.",
                    "Negation and Minimality in Non-Horn Databases.",
                    "Complexity Aspects of Various Semantics for Disjunctive Databases.",
                    "Query Evaluation under the Well Founded Semantics.",
                    "Multiple Join Size Estimation by Virtual Domains.",
                    "Fixed-Precision Estimation of Join Selectivity.",
                    "On the Feasibility of Checking Temporal Integrity Constraints.",
                    "Towards an Analysis of Range Query Performance in Spatial Data Structures.",
                    "Blocking for External Graph Searching.",
                    "Indexing for Data Models with Constraints and Classes.",
                    "Completeness Results for Recursive Data Bases.",
                    "Safety and Translation of Calculus Queries with Scalar Functions.",
                    "Database Method Schemas and Object Creation.",
                    "Context-Based Synchronisation: An Approach beyond Semantics for Concurrency Control.",
                    "Strict Histories in Object-Based Database Systems.",
                    "Towards a Unified Theory of Concurrency Control and Recovery."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "11th PODS 1992",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/92",
                "sub_name": "Proceedings of the Eleventh ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, June 2-4, 1992, San Diego, California, USA.",
                "count": 33,
                "papers": [
                    "New Data Models and Languages - the Challenge.",
                    "Tie-Breaking Semantics and Structural Totality.",
                    "Queries Are Easier Than You Thought (Probably).",
                    "Learning Efficient Query Processing Strategies.",
                    "Analysis of Disk Arm Movement for Large Sequential Reads.",
                    "On the Equivalence of Recursive and Nonrecursive Datalog Programs.",
                    "Constraints and Redundancy in Datalog.",
                    "Datalog Expressiveness of Chain Queries: Grammar Tools and Characterizations.",
                    "The Valid Model Semantics for Logic Programs.",
                    "Greedy by Choice.",
                    "Monotonic Aggregation in Deductive Databases.",
                    "The Well-Founded Semantics of Aggregation.",
                    "A Fault-Tolerant Commit Protocol for Replicated Databases.",
                    "Distributed Algorithms for Dynamic Replication of Data.",
                    "Ensuring Transaction Atomicity in Multidatabase Systems.",
                    "Functional and Predicative Programming in OODB's.",
                    "Semi-determinism.",
                    "Containment and Minimization of Positive Conjunctive Queries in OODB's.",
                    "Locking without Blocking: Making Lock Based Concurrent Data Structure Algorithms Nonblocking.",
                    "An Approach to Eliminate Transaction Blocking in Locking Protocols.",
                    "Tolerating Bounded Inconsistency for Increasing Concurrency in Database Systems.",
                    "Knowledgebase Transformations.",
                    "On the Complexity of Propositional Knowledge Base Revision, Updates, and Counterfactuals.",
                    "Real-Time Integrity Constraints.",
                    "Implementing Deductive Databases by Linear Programming.",
                    "Pattern Matching by Rs-Operations: Toward a Unified Approach to Querying Sequenced Data.",
                    "Pushing Constraint Selections.",
                    "The Complexity of Reusing and Modifying Rulebases.",
                    "The Complexity of Querying Indefinite Data about Linearly Ordered Domains.",
                    "Relations with Relation Names as Arguments: Algebra and Calculus.",
                    "Magic-sets Transformation in Nonrecursive Systems.",
                    "Avoiding Cartesian Products in Programs for Multiple Joins.",
                    "On Tree-Based Techniques for Query Evaluation."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "10th PODS 1991",
        "info": "Denver, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/91",
                "sub_name": "Proceedings of the Tenth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 29-31, 1991, Denver, Colorado, USA.",
                "count": 30,
                "papers": [
                    "Tools for Datalog Boundedness.",
                    "On Datalog vs. Polynomial Time.",
                    "On the Power of Rule-Based Languages with Sets.",
                    "The Expressiveness of a Family of Finite Set Languages.",
                    "Non-Deterministic Queue Operations.",
                    "Bounded Ignorance in Replicated Systems.",
                    "A Tight Upper Bound on the Benefits of Replication and Consistency Control Protocols.",
                    "Modeling Hot Spots In Database Systems.",
                    "Modular Acyclicity and Tail Recursion in Logic Programs.",
                    "Structural Query Optimization - A uniform Framework for Semantic Query Optimization in Deductive Databases.",
                    "Detecting Redundant Tuples During Query Evaluation.",
                    "Overbound and Right-Linear Queries.",
                    "Deductive Databases in Action.",
                    "Minimum and Maximum Predicates in Logic Programming.",
                    "Performance Analysis of File Organizations that Use Multi-Bucket Data Leaves with Partial Expansions.",
                    "Constraint-Based Query Optimization for Spatial Databases.",
                    "Uncoupling Updating and Rebalancing in Chromatic Binary Search Trees.",
                    "Mixed-Approach Algorithms for Transitive Closure.",
                    "On Negation in HiLog.",
                    "Termination Detection in Logic Programs using Argument Sizes.",
                    "Inference of Inequality Constraints in Logic Programs.",
                    "Parallelizing Datalog Programs by Generalized Pivoting.",
                    "Suppressing Marginal Cells to Protect Sensitive Information in a Two-Dimensional Statistical Table.",
                    "Semantic Complexity of Classes of Relational Queries and Query Independent Data Partitioning.",
                    "On the Expected Size of Recursive Datalog Queries.",
                    "On the Representation of Infinite Temporal Data and Queries.",
                    "The Expressive Power of Structured Values in Pure OODB's.",
                    "Subtyping in OODB's.",
                    "Tractable Query Languages for Complex Object Databases.",
                    "On the Equivalence of Database Restructurings Involving Object Identifiers."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "9th PODS 1990",
        "info": "Nashville, Tennessee, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/90",
                "sub_name": "Proceedings of the Ninth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, April 2-4, 1990, Nashville, Tennessee, USA.",
                "count": 36,
                "papers": [
                    "Research Directions in Object-Oriented Database Systems.",
                    "Method Schemas.",
                    "Representability of Design Objects by Ancestor-Controlled Hierarchical Specifications.",
                    "Query Size Estimation by Adaptive Sampling.",
                    "Deriving Constraints Among Argument Sizes in Logic Programs.",
                    "On the Expressive Power of Datalog: Tools and a Case Study.",
                    "Load Control for Locking: The 'Half-and-Half' Approach.",
                    "Locks with Constrained Sharing.",
                    "A Serialization Graph Construction for Nested Transactions.",
                    "Multi-Level Recovery.",
                    "On the Optimality of Strategies for Multiple Joins.",
                    "Polynomial-Time Program Transformations in Deductive Databases.",
                    "Semigroup Techniques in Recursive Query Optimization.",
                    "Independence of Logic Database Queries and Updates.",
                    "Modular Stratification and Magic Sets for DATALOG Programs with Negation.",
                    "Three-Valued Formalization of Logic Programming: Is It Needed?",
                    "Backward Chaining Evaluation in Stratified Disjunctive Theories.",
                    "The Expressive Powers of the Logic Programming Semantics.",
                    "Stable Models and Non-Determinism in Logic Programs with Negation.",
                    "Non-Deterministic Languages to Express Deterministic Transformations.",
                    "Graph-Theoretic Methods in Database Theory.",
                    "Quasilinear Algorithms for Processing Relational Calculus Expressions.",
                    "On the Optimality of Disk Allocation for Cartesian Product Files.",
                    "Efficient Processing of Window Queries in The Pyramid Data Structure.",
                    "A Framework for the Performance Analysis of Concurrent B-tree Algorithms.",
                    "Querying Constraints.",
                    "Constraint Query Languages.",
                    "Magic Conditions.",
                    "On Being Optimistic about Real-Time Constraints.",
                    "Token Transactions: Managing Fine-Grained Migration of Data.",
                    "Data-value Partitioning and Virtual Messages.",
                    "A Novel Checkpointing Scheme for Distributed Database Systems.",
                    "Polynomial Time Query Processing in Temporal Deductive Databases.",
                    "Handling Infinite Temporal Data.",
                    "GraphLog: a Visual Formalism for Real Life Recursion.",
                    "A Graph-Oriented Object Database Model."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "8th PODS 1989",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/89",
                "sub_name": "Proceedings of the Eighth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, March 29-31, 1989, Philadelphia, Pennsylvania, USA.",
                "count": 38,
                "papers": [
                    "The Alternating Fixpoint of Logic Programs with Negation.",
                    "Every Logic Program Has a Natural Stratification And an Iterated Least Fixed Point Model.",
                    "A Procedural Semantics for Well Founded Negation in Logic Programs.",
                    "Logic Programming as Constructivism: A Formalization and its Application to Databases.",
                    "Complexity of Query Processing in Databases with OR-Objects.",
                    "A Sound and Complete Query Evaluation Algorithm for Relational Databases with Disjunctive Information.",
                    "Horn Tables - An Efficient Tool for Handling Incomplete Information in Databases.",
                    "Automata Theory for Database Theoreticans.",
                    "Declarative Expression of Deductive Database Updates.",
                    "Updating Databases in the Weak Instance Model.",
                    "Attribute Agreement.",
                    "Can Constant-time Maintainability Be More Practical?",
                    "Practical Algorithms for Finding Prime Attributes and Testing Normal Forms.",
                    "A Decision Procedure for Conjunctive Query Disjointness.",
                    "Bottom-Up Beats Top-Down for Datalog.",
                    "On the Power of Alexander Templates.",
                    "Safety of Datalog Queries over Infinite Databases.",
                    "Proof-Tree Transformation Theorems and Their Applications.",
                    "Linearizing Nonlinear Recursions in Polynomial Time.",
                    "Inference of Monotonicity Constraints in Datalog Programs.",
                    "Why a Single Parallelization Strategy in not Enough in Knowledge Bases.",
                    "Modular Architectures for Distributed and Database Systems.",
                    "Clustered Multiattribute Hash Files.",
                    "Utilization of B-trees with Inserts, Deletes and Modifies.",
                    "Fractals for Secondary Key Retrieval.",
                    "Declustering Using Error Correcting Codes.",
                    "The Impact of Recovery on Concurrency Control.",
                    "Concurrency Control of Nested Transactions Accessing B-Trees.",
                    "Hypothetical Datalog: Negation and Linear Recursion.",
                    "Inductive Pebble Games and the Expressive Power of Datalog.",
                    "On the First-Order Expressibility of Recursive Queries.",
                    "Expressibility of Bounded-Arity Fixed-Point Query Hierarchies.",
                    "Relational Database Behavior: Utilizing Relational Discrete Event Systems and Models.",
                    "Untyped Sets, Invention, and Computable Queries.",
                    "Modeling Complex Structures in Object-Oriented Databases.",
                    "C-Logic of Complex Objects.",
                    "A Logic for Object-Oriented Logic Programming (Maier's O-Logic Revisited).",
                    "Type Systems for Querying Class Hierarchies with Non-strict Inheritance."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "7th PODS 1988",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/88",
                "sub_name": "Proceedings of the Seventh ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, March 21-23, 1988, Austin, Texas, USA.",
                "count": 36,
                "papers": [
                    "Theory of Database Queries.",
                    "On the Expressive Power of Logic Programming Languages with Sets.",
                    "Rewriting of Rules Containing Set Terms in a Logic Data Model (LDL).",
                    "Possibilities and Limitations of Using Flat Operators in Nested Algebra Expressions.",
                    "On the Expressive Power of Database Queries with Intermediate Types.",
                    "An Axiomatic Approach to Deciding Query Safety in Deductive Databases.",
                    "Temporal Deductive Databases and Infinite Objects.",
                    "The Complexity of Ordering Subgoals.",
                    "An Algorithm for Ordering Subgoals in NAIL!",
                    "Optimizing Existential Datalog Queries.",
                    "Explicit Control of Logic Programs Through Rule Algebra.",
                    "Analysis of Bounded Disorder File Organization.",
                    "Analytical Modeling of Materialized View Maintenance.",
                    "Serialization Graph Algorithms for Multiversion Concurrency Control.",
                    "The Queue Protocol: A Deadlock-free Homogeneous Non-Two-Phase Locking Protocol.",
                    "Object-Oriented Database Systems.",
                    "Independence-reducible Database Schemes.",
                    "Decomposition of Relational Schemata into Components Defined by Both Projection and Restriction.",
                    "Concepts for a Database System Compiler.",
                    "Transaction Synchronisation in Object Bases.",
                    "Hybrid Concurrency Control for Abstract Data Types.",
                    "Concurrent Set Manipulation without Locking.",
                    "Unfounded Sets and Well-Founded Semantics for General Logic Programs.",
                    "Why Not Negation by Fixpoint?",
                    "Procedural and Declarative Database Update Languages.",
                    "Database Updates in Logic Programming.",
                    "Optimization of Multiple-Relation Multiple-Disjunct Queries.",
                    "Statistical Estimators for Relational Algebra Expressions.",
                    "Stable Set and Multiset Operations in Optimal Time and Space.",
                    "Minimizing Time-Space Cost For Database Version Control.",
                    "What Should A Database Know?",
                    "A Semantics for Complex Objects and Approximate Queries.",
                    "A Framework for Comparison of Update Semantics.",
                    "A Generalized Transitive Closure for Relational Queries.",
                    "Counting Methods for Cyclic Relations.",
                    "Decidability and Undecidability Results for Boundedness of Linear Recursive Queries."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "6th PODS 1987",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/87",
                "sub_name": "Proceedings of the Sixth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, March 23-25, 1987, San Diego, California, USA.",
                "count": 37,
                "papers": [
                    "Database Theory: Past and Future.",
                    "Logic Programming With Sets.",
                    "Sets and Negation in a Logic Database Language (LDL1).",
                    "Logical Design of Relational Database Systems.",
                    "On Designing Database Schemes Bounded or Constant-time-maintainable with respect to Functional Dependencies.",
                    "Computing Covers for Embedded Functional Dependencies.",
                    "Dynamic Query Interpretation in Relational Databases.",
                    "A New Basis for the Weak Instance Model.",
                    "Answering Queries in Categorial Data Bases.",
                    "Nested Transactions and Read/Write Locking.",
                    "Transaction Commitment at Minimal Communication Cost.",
                    "The Precedence-Assignment Model for Distributed Database Concurrency Control Algorithms.",
                    "A Knowledge Theoretic Analysis of Atomic Commitment Protocols.",
                    "Perspectives in Deductive Databases (Abstract).",
                    "Maintenance of Stratified Databases Viewed as a Belief Revision System.",
                    "Specification and Implementation of Programs for Updating Incomplete Information Databases.",
                    "Operation Specific Locking in B-Trees.",
                    "Concurrency Control in Database Structures with Relaxed Balance.",
                    "Performance Results in Multiversion Timestamp Concurrency Control with Predeclared Writesets.",
                    "Decomposing an N-ary Relation into a Tree of Binary Relations.",
                    "Formal Limits on the Automatic Generation and Maintenance of Integrity Constraints.",
                    "Relative Knowledge in a Distributed Database.",
                    "The Parallel Complexity of Simple Chain Queries.",
                    "Bounds on the Propagation of Selection into Logic Programs.",
                    "A Decidable Class of Bounded Recursions.",
                    "Decidability and Expressiveness of Logic Queries.",
                    "Chickens and Eggs: The Interrelationship of Systems and Theory.",
                    "Axiomatization and Simplification Rules for Relational Transactions.",
                    "A Transcation Language Complete for Database Update and Specification.",
                    "On the Power of Magic.",
                    "Efficient Evaluation for a Subset of Recursive Queries.",
                    "Worst-case Complexity Analysis of Methods for Logic Query Implementation.",
                    "On the Expressive Power of the Extended Relational Algebra for the Unnormalized Relational Model.",
                    "Safety and Correct Translation of Relational Calculus Formulas.",
                    "Safety of Recursive Horn Clauses With Infinite Relations.",
                    "One-Sided Recursions.",
                    "Optimizing Datalog Programs."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "5th PODS 1986",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/86",
                "sub_name": "Proceedings of the Fifth ACM SIGACT-SIGMOD Symposium on Principles of Database Systems, March 24-26, 1986, Cambridge, Massachusetts, USA.",
                "count": 29,
                "papers": [
                    "Magic Sets and Other Strange Ways to Implement Logic Programs.",
                    "On the Implementation of a Simple Class of Logic Queries for Databases.",
                    "Convergence of Sideways Query Evaluation.",
                    "A Theoretical Foundation of Multi-Level Concurrency Control.",
                    "Deleting Completed Transactions.",
                    "Safety of Non-Well-Locked Trasnaction Systems.",
                    "A Calculus for Complex Objects.",
                    "Some Classes of Multilevel Relational Structures.",
                    "Weak Temporal Relations.",
                    "Rearranging Data to Maximize the Efficiency of Compression.",
                    "Order Preserving Linear Hashing Using Dynamic Key Statistics.",
                    "Balanced Multidimensional Extendible Hash Tree.",
                    "Negation as Failure for First-Order Queries.",
                    "Positivism vs. Minimalism in Deductive Databases.",
                    "The Extended Closed World Assumpution and its Relationship to Parallel Circumscription.",
                    "On the Properties and Characterization of Connection-tap-free Schemes.",
                    "One Flavor Assumption and Gamma-Acyclicity for Universal Relation Views.",
                    "The Equivalence of Solving Queries and Production Tree Projections.",
                    "On Finite FD-Acyclicity.",
                    "Unifying Functional and Multivalued Dependencies for Relational Database Design.",
                    "Alpha-Acyclic Decompositions of Relational Database Schemes.",
                    "Constant Time Maintenance or The Triumph of the fd.",
                    "Test Data for Relational Queries.",
                    "A Model-Theoretic Approach to Updating Logical Databases.",
                    "Deciding Properties of Transactional Schemas.",
                    "Availability in Partitioned Replicated Databases.",
                    "On the Integrity of Databases with Incomplete Information.",
                    "Data Independent Recursion in Deductive Databases.",
                    "Parallel Evaluation of Recursive Rule Queries."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "4th PODS 1985",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/85",
                "sub_name": "Proceedings of the Fourth ACM SIGACT-SIGMOD Symposium on Principles of Database Systems, March 25-27, 1985, Portland, Oregon, USA.",
                "count": 30,
                "papers": [
                    "Concurrency and Linear Hashing.",
                    "Semantically-based Concurrency Control for Search Structures.",
                    "The Interpolation-Based Grid File.",
                    "Concurrent Operations on B-Trees with Overtaking.",
                    "On Optimizing Summary-Table-by-Example Queries.",
                    "A Query Language for a Homogeneous Temporal Database.",
                    "Querying Logical Databases.",
                    "Updating a Relational Database through a Universal Schema Interface.",
                    "Relaxing the Universal Relation Scheme Assumption.",
                    "A Semantic Approach to Correctness of Concurrent Transaction Executions.",
                    "Algorithmic Aspects of Multiversion Concurrency Control.",
                    "Deadlock-Freedom (and Safety) of Transactions in a Distributed Database.",
                    "An Experimental Evaluation of Crash Recovery Mechanisms.",
                    "On the Correctness of a Local Storage Subsystem.",
                    "Distributed Management in Local Area Networks.",
                    "Equivalence of Views by Query Capacity.",
                    "Algebraic Versus Probabilistic Independence in Data Bases.",
                    "Algorithms for Translating View Updates to Database Updates for Views Involving Selections, Projections, and Joins.",
                    "Chordality Properties on Graphs and Minimal Conceptual Connections in Semantic Data Models.",
                    "On Computing Restricted Projections of Representative Instances.",
                    "Efficient Query Answering in the Representative Instance Approach.",
                    "An Improved Algorithm for Finding a Key of a Relation.",
                    "Transactions and Integrity Constraints.",
                    "Embedded Join Dependencies as a Tool for Decomposing Full Join Dependencies.",
                    "An Efficient, Fault-Tolerant Protocol for Replicated Data Management.",
                    "The Complexity of Reliable Concurrency Control.",
                    "On the Complexity of Commit Protocols.",
                    "Small Armstrong Relations for Database Design.",
                    "A Normal Form for Nested Relations.",
                    "Partition Semantics for Relations."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "3rd PODS 1984",
        "info": "Waterloo, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/84",
                "sub_name": "Proceedings of the Third ACM SIGACT-SIGMOD Symposium on Principles of Database Systems, April 2-4, 1984, Waterloo, Ontario, Canada.",
                "count": 36,
                "papers": [
                    "On the Recognition and Design of Acyclic Databases.",
                    "Dependency Characterizations for Acyclic Database Schemes.",
                    "Properties of Database Schemata with Functional Dependencies.",
                    "Functional and Inclusion Dependencies: A Graph Theoretic Approach.",
                    "Maximal Concurrency by Locking.",
                    "Concurrency Control in Graph Protocols by Using Edge Locks.",
                    "Concurrency Control Mechanisms and the Serializability of Concurrent Tree Algorithms.",
                    "Is Byzantine Agreement Useful in a Distributed Database?",
                    "Conceptual-To-Internal Mappings in Commercial Database Systems.",
                    "Synapse Approach to Database Recovery.",
                    "A New Approach to Database Logic.",
                    "Relative Information Capacity of Simple Relational Database Schemata.",
                    "Formal Data Base Specification - An Eclectic Perspective.",
                    "IFO: A Formal Semantic Database Model.",
                    "On the Cyclic to Acyclic Scheme Transformation and Solving Cyclic Queries.",
                    "On the Decomposition of Join Dependencies.",
                    "Using Semiouterjoins to Process Queries in Multidatabase Systems.",
                    "Canonical View Update Support through Boolean Algebras of Components.",
                    "Index Maintenance for Non-Uniform Record Distributions.",
                    "A Class of Data Structures for Associative Searching.",
                    "Non First Normal Form Relations to Represent Hierarchical Organized Data.",
                    "On Relational Algebra with Marked Nulls.",
                    "The Temporal Query Language TQuel.",
                    "Object Projection Views in the Dynamic Relational Model.",
                    "On the Equivalence of Logical Databases.",
                    "An Enhanced Inference Mechanism for Generating Relational Algebra Queries.",
                    "A Transportable Natural Language Database Update System.",
                    "Specification and Verification of Abstract Database Types.",
                    "On Lossless Transformation of Database Schemes not Necessarily Satisfying Universal Instance Assumption.",
                    "Weak Multivalued Dependencies.",
                    "Querying Weak Instances.",
                    "On the Complexity and Axiomatizability of Consistent Database States.",
                    "Increasing Availability in Partitioned Database Systems.",
                    "Reliable Scheduling of Database Transactions for Unreliable Systems.",
                    "A Mean Value Performance Model for Locking in Databases: The Waiting Case.",
                    "Towards a Theory of Online Schedulers."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "2nd PODS 1983",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/83",
                "sub_name": "Proceedings of the Second ACM SIGACT-SIGMOD Symposium on Principles of Database Systems, March 21-23, 1983, Colony Square Hotel, Atlanta, Georgia, USA.",
                "count": 38,
                "papers": [
                    "Impossibility of Distributed Consensus with One Faulty Process.",
                    "A Recovery Algorithm for a Distributed Database System.",
                    "Determining the Last Process to Fail.",
                    "Optimal Termination Prococols for Network Partitioning.",
                    "Towards a Sound View Integration Methodology.",
                    "Inclusion Dependencies and the Universal Instance.",
                    "Inference Rules for Functional and Inclusion Dependencies.",
                    "A Discipline for Robustness or Storage Reduction in Binary Search Trees.",
                    "Interpolation-Based Index Maintenance.",
                    "Storage Mappings for Multidimensional Linear Dynamic Hashing.",
                    "Extendible Hashing for Concurrent Operations and Distributed Data.",
                    "Unstructured Data Bases or Very Efficient Text Searching.",
                    "Processing Queries with Quantifiers: A Horticultural Approach.",
                    "Attributed Grammars for Query Language Translations.",
                    "The Complexity of Evaluating Relational Queries.",
                    "Granularity Hierarchies in Concurrency Control.",
                    "Concurrency Control for Resilient Nested Transactions.",
                    "Hierarchical Database Decomposition - A Technique for Database Concurrency Control.",
                    "A Framework for Understanding Distributed (Deadlock Detection) Algorithms.",
                    "A Simple Analytic Model for Performance of Exclusive Locking in Database Systems.",
                    "LOG Write-Ahead Protocols and IMS/VS Logging.",
                    "An Operational Model for Database System Reliability.",
                    "An Approximation Algorithm to the File Allocation Problem in Computer Networks.",
                    "GYO Reductions, Canonical Connections, Tree and Cyclic Schemas and Tree Projections.",
                    "The Revenge of the JD.",
                    "Independent and Separable Database Schemes.",
                    "On the Recognition of Coverings of Acyclic Database Hypergraphs.",
                    "Inverting Relational Expressions - A Uniform and Natural Technique for Various Database Problems.",
                    "Information Theoretic Aspects of Data Bases.",
                    "Updates of Relational Views.",
                    "Sort Sets in the Relational Model.",
                    "Elimination of Intersection Anomalies from Database Schemes.",
                    "On the Semantics of Updates in Databases.",
                    "Path Expressions in Databases.",
                    "Improving Database Schemes by Adding Attributes.",
                    "Disaggregations in Databases.",
                    "Dynamic Constraints and Database Evolution.",
                    "Algebraic Aspects of Relational Database Decomposition."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "1st PODS 1982",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pods/82",
                "sub_name": "Proceedings of the ACM Symposium on Principles of Database Systems, March 29-31, 1982, Los Angeles, California, USA.",
                "count": 37,
                "papers": [
                    "Assumptions in Relational Database Theory.",
                    "The U. R. Strikes Back.",
                    "On Equivalences of Database Schemes.",
                    "Database Relations with Null Values.",
                    "Connections in Acyclic Hypergraphs.",
                    "The Tree Property is Fundamental for Query Processing.",
                    "Transforming Cyclic Schemas into Trees.",
                    "Compatible Attributes in a Universal Relation.",
                    "Multilevel Atomicity.",
                    "Sacrificing Serializability to Attain High Availability of Data.",
                    "On Concurrency Control by Multiple Versions.",
                    "Concurrency on High-trafic Data Elements.",
                    "An Algorithm for Minimizing Roll Back Cost.",
                    "Is Distributed Locking Harder?",
                    "An Optimal Algorithm for Testing for Safety and Detecting Deadlocks in Locked Transaction Systems.",
                    "An Extended Relational Algebra with Control over Duplicate Elimination.",
                    "Remarks on the Algebra of Non First Normal Form Relations.",
                    "Non-reversible Privacy Transformations.",
                    "A Universal Relation Database System Implemented via the Network Model.",
                    "Horn Clauses and the Fixpoint Query Hierarchy.",
                    "Testing Containment of Conjunctive Queries Under Functional and Inclusion Dependencies.",
                    "The Relational Model of Data and Cylindrial Algebras.",
                    "Inclusion Dependencies and Their Interaction with Functional Dependencies.",
                    "Notions of Dependency Satisfaction.",
                    "A Theory of Data Dependencies over Relational Expressions.",
                    "Independent Database Schemas.",
                    "The Format Model: A Theory of Database Organization.",
                    "An Operational Approach to Data Bases.",
                    "The Inference Problem for Template Dependencies.",
                    "The Implication and Finite Implication Problems for Typed Template Dependencies.",
                    "Using Write-once Memory for Database Storage.",
                    "Performance Evaluation of a Two-Phase Commit Based Protocol for DDBS.",
                    "External Hashing with Limited Internal Storage.",
                    "Foundations for Multifile Design by Application Partitioning.",
                    "Concurrency Control in a Dynamic Search Structure.",
                    "Compatibility and Commutativity in Non-two-phase Locking Protocols.",
                    "Theory of Serializability for a Parallel Model of Transactions."
                ]
            }
        ]
    }
]