[
    {
        "year": "2021",
        "name": "21st SDM 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2021",
                "sub_name": "Proceedings of the 2021 SIAM International Conference on Data Mining, SDM 2021, Virtual Event, April 29 - May 1, 2021.",
                "count": 85,
                "papers": [
                    "Discovering Reliable Causal Rules.",
                    "Stochastic Time Series Representation for Interval Pattern Mining via Gaussian Processes.",
                    "Efficient Permutation Testing for Significant Sequential Patterns.",
                    "Learning Reliable Rules under Class Imbalance.",
                    "GPU-Accelerated Constraint-Based Causal Structure Learning for Discrete Data.",
                    "Discrete Listwise Collaborative Filtering for Fast Recommendation.",
                    "GraphShop: Graph-based Approach for Shop-type Recommendation.",
                    "Sequence-aware Heterogeneous Graph Neural Collaborative Filtering.",
                    "LDFeRR: A Fuel-efficient Route Recommendation Approach for Long-distance Driving Based on Historical Trajectories.",
                    "Session-based Recommendation with Hypergraph Attention Networks.",
                    "Deep Multi-Instance Contrastive Learning with Dual Attention for Anomaly Precursor Detection.",
                    "Noise-Response Analysis of Deep Neural Networks Quantifies Robustness and Fingerprints Structural Malware.",
                    "Signature-Based Anomaly Detection in Networks.",
                    "A Dimensionality-Driven Approach for Unsupervised Out-of-distribution Detection.",
                    "Reconstruction-based Anomaly Detection with Completely Random Forest.",
                    "New Approximation Algorithms for Forest Closeness Centrality - for Individual Vertices and Vertex Groups.",
                    "PRESTO: Simple and Scalable Sampling Techniques for the Rigorous Approximation of Temporal Motif Counts.",
                    "POTION : Optimizing Graph Structure for Targeted Diffusion.",
                    "Node Proximity Is All You Need: Unified Structural and Positional Node and Graph Embedding.",
                    "Refining Network Alignment to Improve Matched Neighborhood Consistency.",
                    "Fairness-aware Agnostic Federated Learning.",
                    "Equitable Allocation of Healthcare Resources with Fair Survival Models.",
                    "Fair Classification Under Strict Unawareness.",
                    "Turning Attacks into Protection: Social Media Privacy Protection Using Adversarial Attacks.",
                    "Influencers and the Giant Component: The Fundamental Hardness in Privacy Protection for Socially Contagious Attributes.",
                    "A Practical Online Framework for Extracting Running Video Summaries under a Fixed Memory Budget.",
                    "Adaptive Holding for Online Bottleneck Matching with Delays.",
                    "Mining Easily Understandable Models from Complex Event Logs.",
                    "Deep Neural Network for 3D Surface Segmentation based on Contour Tree Hierarchy.",
                    "Learning Time-series Shapelets via Supervised Feature Selection.",
                    "Maximizing Cohesion and Separation in Graph Representation Learning: A Distance-aware Negative Sampling Approach.",
                    "DPGS: Degree-Preserving Graph Summarization.",
                    "Density of States Graph Kernels.",
                    "SUSAN: The Structural Similarity Random Walk Kernel.",
                    "Scalable Graph Synthesis with Adj and 1 - Adj.",
                    "Multi-Armed Bandit Based Feature Selection.",
                    "UNIANO: robust and efficient anomaly consensus in time series sensitive to cross-correlated anomaly profiles.",
                    "Random Features Strengthen Graph Neural Networks.",
                    "AutoGFS: Automated Group-based Feature Selection via Interactive Reinforcement Learning.",
                    "Better Short than Greedy: Interpretable Models through Optimal Rule Boosting.",
                    "Complexity-Adaptive Gaussian Process Model Inference for Large-Scale Data.",
                    "Predictive Optimization with Zero-Shot Domain Adaptation.",
                    "Exceptional Model Mining meets Multi-objective Optimization.",
                    "Estimating Conditional Mutual Information for Discrete-Continuous Mixtures using Multi-Dimensional Adaptive Histograms.",
                    "Sign-aware Perturbations Regression.",
                    "Faster Stochastic Second Order Method for Large-Scale Machine Learning Models.",
                    "Maximizing Approximately k-Submodular Functions.",
                    "Submodular Maximization via Taylor Series Approximation.",
                    "Frank-Wolfe algorithm for learning SVM-type multi-category classifiers.",
                    "Provable Distributed Stochastic Gradient Descent with Delayed Updates.",
                    "Verifying Tree Ensembles by Reasoning about Potential Instances.",
                    "CiNet: Redesigning Deep Neural Networks for Efficient Mobile-Cloud Collaborative Inference.",
                    "\"Misc\"-Aware Weakly Supervised Aspect Classification.",
                    "SUMDocS: Surrounding-aware Unsupervised Multi-Document Summarization.",
                    "Deep Multi-type Objects Muli-view Multi-instance Multi-label Learning.",
                    "Inter-Series Attention Model for COVID-19 Forecasting.",
                    "MT-STNets: Multi-Task Spatial-Temporal Networks for Multi-Scale Traffic Prediction.",
                    "A Fine-grained Graph-based Spatiotemporal Network for Bike Flow Prediction in Bike-sharing Systems.",
                    "A Deep Adversarial Model for Suffix and Remaining Time Prediction of Event Sequences.",
                    "Attention-Based Autoregression for Accurate and Efficient Multivariate Time Series Forecasting.",
                    "Yet Meta Learning Can Adapt Fast, it Can Also Break Easily.",
                    "Do winning tickets exist before DNN training?",
                    "HALO: Learning to Prune Neural Networks with Shrinkage.",
                    "EduHawkes: A Neural Hawkes Process Approach for Online Study Behavior Modeling.",
                    "Contradictory Structure Learning for Semi-supervised Domain Adaptation.",
                    "Learning Robust Patient Representations from Multi-modal Electronic Health Records: A Supervised Deep Learning Approach.",
                    "TedPar: Temporally Dependent PARAFAC2 Factorization for Phenotype-based Disease Progression Modeling.",
                    "TeX-Graph: Coupled tensor-matrix knowledge-graph embedding for COVID-19 drug repurposing.",
                    "Physics-Guided Recurrent Graph Model for Predicting Flow and Temperature in River Networks.",
                    "Graph-based Reinforcement Learning for Active Learning in Real Time: An Application in Modeling River Networks.",
                    "A Data-Dependent Algorithm for Querying Earth Mover's Distance with Low Doubling Dimensions.",
                    "PhraseScope: An Effective and Unsupervised Framework for Mining High Quality Phrases.",
                    "Scalable Distributed Approximation of Internal Measures for Clustering Evaluation.",
                    "Unsupervised Selective Manifold Regularized Matrix Factorization.",
                    "Functional Autoencoders for Functional Data Representation Learning.",
                    "Quadratic Residual Networks: A New Class of Neural Networks for Solving Forward and Inverse Problems in Physics Involving PDEs.",
                    "Synthesizing Skeletal Motion and Physiological Signals as a Function of a Virtual Human's Actions and Emotions.",
                    "Towards Learning Outcome Prediction via Modeling Question Explanations and Student Responses.",
                    "Temporal-Aware Graph Neural Network for Credit Risk Prediction.",
                    "Large-Scale Flight Frequency Optimization with Global Convergence in the US Domestic Air Passenger Markets.",
                    "Heterogeneous Graph Neural Networks for Query-focused Summarization.",
                    "Dynamic Graph Convolutional Networks Using the Tensor M-Product.",
                    "Disentangled Dynamic Graph Deep Generation.",
                    "Robust Dual Recurrent Neural Networks for Financial Time Series Prediction.",
                    "Learning over Families of Sets - Hypergraph Representation Learning for Higher Order Tasks."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "20th SDM 2020",
        "info": "Cincinnati, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2020",
                "sub_name": "Proceedings of the 2020 SIAM International Conference on Data Mining, SDM 2020, Cincinnati, Ohio, USA, May 7-9, 2020.",
                "count": 75,
                "papers": [
                    "LTSpAUC: Learning Time-series Shapelets for Optimizing Partial AUC.",
                    "Two-Sample Testing for Event Impacts in Time Series.",
                    "Knowledge guided diagnosis prediction via graph spatial-temporal network.",
                    "Convolutional Methods for Predictive Modeling of Geospatial Data.",
                    "Pattern detection in large temporal graphs using algebraic fingerprints.",
                    "Filling Missing Values on Wearable-Sensory Time Series Data.",
                    "Meta-Learning for Size and Fit Recommendation in Fashion.",
                    "BasConv: Aggregating Heterogeneous Interactions for Basket Recommendation with Graph Convolutional Neural Network.",
                    "Stacked Mixed-Order Graph Convolutional Networks for Collaborative Filtering.",
                    "BiGAN: Collaborative Filtering with Bidirectional Generative Adversarial Networks.",
                    "Multiplex Memory Network for Collaborative Filtering.",
                    "Content-Aware Successive Point-of-Interest Recommendation.",
                    "Deep Multi-sphere Support Vector Data Description.",
                    "Finding the Sweet Spot: Batch Selection for One-Class Active Learning.",
                    "\"Now you see it, now you don't!\" Detecting Suspicious Pattern Absences in Continuous Time Series.",
                    "Semantic Discord: Finding Unusual Local Patterns for Time Series.",
                    "Exploring the Unknown - Query Synthesis in One-Class Active Learning.",
                    "Learning a Neural-network-based Representation for Open Set Recognition.",
                    "Two-variable Dual Coordinate Descent Methods for Linear SVM with/without the Bias Term.",
                    "A Predictive Optimization Framework for Hierarchical Demand Matching.",
                    "Dual Coordinate-Descent Methods for Linear One-Class SVM and SVDD.",
                    "Hessian based analysis of SGD for Deep Nets: Dynamics and Generalization.",
                    "Second-order Optimization for Non-convex Machine Learning: an Empirical Study.",
                    "DANR: Discrepancy-aware Network Regularization.",
                    "An Advantage Actor-Critic Algorithm with Confidence Exploration for Open Information Extraction.",
                    "What Do Questions Exactly Ask? MFAE: Duplicate Question Identification with Multi-Fusion Asking Emphasis.",
                    "Identifying Potential Investors with Data Driven Approaches.",
                    "Document Clustering Meets Topic Modeling with Word Embeddings.",
                    "Semi-supervised Classification using Attention-based Regularization on Coarse-resolution Data.",
                    "SSNN: Sentiment Shift Neural Network.",
                    "Counterfactual Evaluation of Treatment Assignment Functions with Networked Observational Data.",
                    "A Graph-Based Approach for Active Learning in Regression.",
                    "On Supervised Change Detection in Graph Streams.",
                    "Optimal Bidding Strategy without Exploration in Real-time Bidding.",
                    "Global-and-Local Aware Data Generation for the Class Imbalance Problem.",
                    "Harmonic Alignment.",
                    "Residual Core Maximization: An Efficient Algorithm for Maximizing the Size of the k-Core.",
                    "Deep Matrix Tri-Factorization: Mining Vertex-wise Interactions in Multi-Space Attributed Graphs.",
                    "Adiabatic Quantum Computing for Max-Sum Diversification.",
                    "Deep Adversarial Canonical Correlation Analysis.",
                    "Deep Self-representative Concept Factorization Network for Representation Learning.",
                    "Deep Neural Networks with Knowledge Instillation.",
                    "Dual-Attention Recurrent Networks for Affine Registration of Neuroimaging Data.",
                    "Efficient and Effective Graph Convolution Networks.",
                    "HIDRA: Head Initialization across Dynamic targets for Robust Architectures.",
                    "Cost-Effective and Stable Policy Optimization Algorithm for Uplift Modeling with Multiple Treatments.",
                    "Well-calibrated and specialized probability estimation trees.",
                    "Bayesian Modeling of Intersectional Fairness: The Variance of Bias.",
                    "An Instance-Specific Algorithm for Learning the Structure of Causal Bayesian Networks Containing Latent Variables.",
                    "Features or Shape? Tackling the False Dichotomy of Time Series Classification.",
                    "Attention-Aware Answers of the Crowd.",
                    "HYPA: Efficient Detection of Path Anomalies in Time Series Data on Networks.",
                    "Fisher Deep Domain Adaptation.",
                    "Representation Learning for Imbalanced Cross-Domain Classification.",
                    "A Unified Non-Negative Matrix Factorization Framework for Semi Supervised Learning on Graphs.",
                    "Temporal Graph Kernels for Classifying Dissemination Processes.",
                    "Heavy-Tailed Universality Predicts Trends in Test Accuracies for Very Large Pre-Trained Deep Neural Networks.",
                    "Rare Disease Prediction by Generating Quality-Assured Electronic Health Records.",
                    "Dissecting Ethereum Blockchain Analytics: What We Learn from Topology and Geometry of the Ethereum Graph?",
                    "Physics-Guided Architecture (PGA) of Neural Networks for Quantifying Uncertainty in Lake Temperature Modeling.",
                    "D2M: Dynamic Defense and Modeling of Adversarial Movement in Networks.",
                    "Detecting Media Self-Censorship without Explicit Training Data.",
                    "PhyNet: Physics Guided Neural Networks for Particle Drag Force Prediction in Assembly.",
                    "Improved mixing time for k-subgraph sampling.",
                    "SPADE: Streaming PARAFAC2 DEcomposition for Large Datasets.",
                    "Explainable Subgraphs with Surprising Densities: A Subgroup Discovery Approach.",
                    "Vertex-reinforced Random Walk for Network Embedding.",
                    "GRIA: Graphical Regularization for Integrative Analysis.",
                    "On the Information Unfairness of Social Networks.",
                    "Lag-Aware Multivariate Time-Series Segmentation.",
                    "Deep Parametric Model for Discovering Group-cohesive Functional Brain Regions.",
                    "Deep Kernel Learning for Clustering.",
                    "Maximizing diversity over clustered data.",
                    "Heterogeneous Dual-Task Clustering with Visual-Textual Information.",
                    "NSVD: Normalized Singular Value Deviation Reveals Number of Latent Factors in Tensor Decomposition."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "19th SDM 2019",
        "info": "Calgary, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2019",
                "sub_name": "Proceedings of the 2019 SIAM International Conference on Data Mining, SDM 2019, Calgary, Alberta, Canada, May 2-4, 2019.",
                "count": 90,
                "papers": [
                    "Incremental Multi-view Support Vector Machine.",
                    "Deep Multimodality Model for Multi-task Multi-view Learning.",
                    "Augmented Multi-Task Learning by Optimal Transport.",
                    "Calibrating Probability Estimation Trees using Venn-Abers Predictors.",
                    "Deep Multi-view Information Bottleneck.",
                    "Forest Packing: Fast Parallel, Decision Forests.",
                    "Fast Unsupervised Location Category Inference from Highly Inaccurate Mobility Data.",
                    "GeoAttn: Localization of Social Media Messages via Attentional Memory Network.",
                    "Bus Travel Speed Prediction using Attention Network of Heterogeneous Correlation Features.",
                    "A Nondeterministic Normalization based Scan Statistic (NN-scan) towards Robust Hotspot Detection: A Summary of Results.",
                    "A Fast Algorithm for Combinatorial Hotspot Mining Based on Spatial Scan Statistic.",
                    "A Deep Spatio-Temporal Fuzzy Neural Network for Passenger Demand Prediction.",
                    "AMAS: Attention Model for Attributed Sequence Classification.",
                    "MM-Pred: A Deep Predictive Model for Multi-attribute Event Sequence.",
                    "Constraint Programming for Association Rules.",
                    "Linear Time Motif Discovery in Time Series.",
                    "Deep Skip-Gram Networks for Text Classification.",
                    "Mining Rules Incrementally over Large Knowledge Bases.",
                    "Optimally rotated coordinate systems for adaptive least-squares regression on sparse grids.",
                    "ℓ0-Regularized Sparsity for Probabilistic Mixture Models.",
                    "Intrinsic Dimensionality Estimation within Tight Localities.",
                    "Identifying When Effect Restoration Will Improve Estimates of Causal Effect.",
                    "We Are Not Your Real Parents: Telling Causal from Confounded using MDL.",
                    "Query-Aware Bayesian Committee Machine for Scalable Gaussian Process Regression.",
                    "A Novel Regularizer for Temporally Stable Learning with an Application to Twitter Topic Classification.",
                    "Efficient Summarizing of Evolving Events from Twitter Streams.",
                    "Hierarchical Attention Networks for Cyberbullying Detection on the Instagram Social Network.",
                    "SPMM: A Soft Piecewise Mapping Model for Bilingual Lexicon Induction.",
                    "Aspect-Based Sentiment Analysis with Minimal Guidance.",
                    "Joint Post and Link-level Influence Modeling on Social Media.",
                    "Positive-Unlabeled Classification under Class Prior Shift and Asymmetric Error.",
                    "Fast Training for Large-Scale One-versus-All Linear Classifiers using Tree-Structured Initialization.",
                    "Towards Identifying Causal Relation Between Instances and Labels.",
                    "Discovering and Controlling for Latent Confounds in Text Classification Using Adversarial Domain Adaptation.",
                    "A Bayesian Approach for Accurate Classification-Based Aggregates.",
                    "Decision List Optimization based on Continuous Relaxation.",
                    "Mining Maximal Induced Bicliques using Odd Cycle Transversals.",
                    "DSL: Discriminative Subgraph Learning via Sparse Self-Representation.",
                    "Relationship Profiling over Social Networks: Reverse Smoothness from Similarity to Closeness.",
                    "Edge Replacement Grammars : A Formal Language Approach for Generating Graphs.",
                    "Temporal Graph Regression via Structure-Aware Intrinsic Representation Learning.",
                    "Multi-Dimensional, Multilayer, Nonlinear and Dynamic HITS.",
                    "Flow-Based Local Graph Clustering with Better Seed Set Inclusion.",
                    "Spherical Principal Component Analysis.",
                    "Auto-Summarization: A Step Towards Unsupervised Learning of a Submodular Mixture.",
                    "Learning Diverse Gaussian Graphical Models and Interpreting Edges.",
                    "Deep Co-Clustering.",
                    "Discovering Multiple Co-Clusterings in Subspaces.",
                    "Accelerated Experimental Design for Pairwise Comparisons.",
                    "Region-Based Active Learning with Hierarchical and Adaptive Region Construction.",
                    "Feature selection as Monte-Carlo Search in Growing Single Rooted Directed Acyclic Graph by Best Leaf Identification.",
                    "Relative distance comparisons with confidence judgements.",
                    "Doubly Robust Prediction and Evaluation Methods Improve Uplift Modeling for Observational Data.",
                    "EstImAgg: A Learning Framework for Groupwise Aggregated Data.",
                    "DTEC: Distance Transformation Based Early Time Series Classification.",
                    "Leveraging Subsequence-orders for Univariate and Multivariate Time-series Classification.",
                    "Branch and Border: Partition-Based Change Detection in Multivariate Time Series.",
                    "Spatial Context-Aware Networks for Mining Temporal Discriminative Period in Land Cover Detection.",
                    "Elastic bands across the path: A new framework and method to lower bound DTW.",
                    "Coupled Clustering of Time-Series and Networks.",
                    "Classifying Heterogeneous Sequential Data by Cyclic Domain Adaptation: An Application in Land Cover Detection.",
                    "Incomplete Conditional Density Estimation for Fast Materials Discovery.",
                    "Physics Guided RNNs for Modeling Dynamical Systems: A Case Study in Simulating Lake Temperature Profiles.",
                    "Reading Customer Reviews to Answer Product-related Questions.",
                    "An Interpretable Fast Model for Predicting The Risk of Heart Failure.",
                    "LSCP: Locally Selective Combination in Parallel Outlier Ensembles.",
                    "Deep Anomaly Detection on Attributed Networks.",
                    "ABACUS: Unsupervised Multivariate Change Detection via Bayesian Source Separation.",
                    "Learning On-the-Job to Re-rank Anomalies from Top-1 Feedback.",
                    "SMF: Drift-Aware Matrix Factorization with Seasonal Patterns.",
                    "Multi-Stage Variational Auto-Encoders for Coarse-to-Fine Image Generation.",
                    "Path-based Attribute-aware Representation Learning for Relation Prediction.",
                    "Spatial Variational Auto-Encoding via Matrix-Variate Normal Distributions.",
                    "Multi-dimensional Graph Convolutional Networks.",
                    "Autonomous Deep Learning: Continual Learning Approach for Dynamic Environments.",
                    "Deep Transfer Reinforcement Learning for Text Summarization.",
                    "TMSA: A Mutual Learning Model for Topic Discovery and Word Embedding.",
                    "Attentional Heterogeneous Graph Neural Network: Application to Program Reidentification.",
                    "GPU Accelerated Sub-Sampled Newton's Method for Convex Classification Problems.",
                    "CP Tensor Decomposition with Cannot-Link Intermode Constraints.",
                    "Find the dimension that counts: Fast dimension estimation and Krylov PCA.",
                    "Boolean matrix factorization meets consecutive ones property.",
                    "Robust Factorization Machine: A Doubly Capped Norms Minimization.",
                    "Collaborative Filtering with Noisy Ratings.",
                    "A Full Probabilistic Model for Yes/No Type Crowdsourcing in Multi-Class Classification.",
                    "Predicting Multiple Demographic Attributes with Task Specific Embedding Transformation and Attention Network.",
                    "Semantics-Aware Hidden Markov Model for Human Mobility.",
                    "Dissecting the Learning Curve of Taxi Drivers: A Data-Driven Approach.",
                    "Recommendations for optimizing the collective user experience.",
                    "Fairness in representation: quantifying stereotyping as a representational harm."
                ]
            },
            {
                "sub_name_abbr": "conf/sdm/2019edml",
                "sub_name": "Proceedings of the 1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning co-located with SIAM International Conference on Data Mining (SDM 2019), Calgary, Alberta, Canada, May 4th, 2019.",
                "count": 10,
                "papers": [
                    "1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning (EDML 2019).",
                    "Evaluation of Unsupervised Learning Results: Making the Seemingly Impossible Possible.",
                    "EvalNE: A Framework for Evaluating Network Embeddings on Link Prediction.",
                    "Benchmarking Nearest Neighbor Search: Influence of Local Intrinsic Dimensionality and Result Diversity in Real-World Datasets.",
                    "Context-Driven Data Mining Through Bias Removal and Incompleteness Mitigation.",
                    "Instance Spaces for Objective Assessment of Algorithms and Benchmark Test Suites.",
                    "Instance Space Analysis for Unsupervised Outlier Detection.",
                    "Lessons Learned from the FIMI Workshops.",
                    "Clustering Evaluation in High-Dimensional Data.",
                    "Characterizing Transactional Databases for Frequent Itemset Mining."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "18th SDM 2018",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2018",
                "sub_name": "Proceedings of the 2018 SIAM International Conference on Data Mining, SDM 2018, May 3-5, 2018, San Diego Marriott Mission Valley, San Diego, CA, USA.",
                "count": 86,
                "papers": [
                    "Front Matter.",
                    "Many-to-many Correspondences between Partitions: Introducing a Cut-based Approach.",
                    "Graph sketching-based Space-efficient Data Clustering.",
                    "Image Constrained Blockmodelling: A Constraint Programming Approach.",
                    "NLRR++: Scalable Subspace Clustering via Non-Convex Block Coordinate Descent.",
                    "Unsupervised Neural Categorization for Scientific Publications.",
                    "Mixtures of Block Models for Brain Networks.",
                    "Causal Inference on Event Sequences.",
                    "Outlier Detection over Distributed Trajectory Streams.",
                    "JUMP: A Fast Deterministic Algorithm to Find the Closest Pair of Subsequences.",
                    "Streaming Tensor Factorization for Infinite Data Sources.",
                    "Mining Top-k Quantile-based Cohesive Sequential Patterns.",
                    "STAPLE: Spatio-Temporal Precursor Learning for Event Forecasting.",
                    "Near-Optimal Mapping of Network States using Probes.",
                    "Network Inference from Contrastive Groups Using Discriminative Structural Regularization.",
                    "Group Centrality Maximization via Network Design.",
                    "Robust Road Map Inference through Network Alignment of Trajectories.",
                    "AspEm: Embedding Learning by Aspects in Heterogeneous Information Networks.",
                    "Semi-supervised Embedding in Attributed Networks with Outliers.",
                    "Online Truth Discovery on Time Series Data.",
                    "Modeling the Interaction Coupling of Multi-View Spatiotemporal Contexts for Destination Prediction.",
                    "Who will Attend This Event Together? Event Attendance Prediction via Deep LSTM Networks.",
                    "You Are How You Move: Linking Multiple User Identities From Massive Mobility Traces.",
                    "Click versus Share: A Feature-driven Study of Micro-Video Popularity and Virality in Social Media.",
                    "A Probabilistic Hough Transform for Opportunistic Crowd-sensing of Moving Traffic Obstacles.",
                    "Interpretable Categorization of Heterogeneous Time Series Data.",
                    "Efficient search of the best warping window for Dynamic Time Warping.",
                    "Accelerating Time Series Searching with Large Uniform Scaling.",
                    "Evolving Separating References for Time Series Classification.",
                    "Classifying Multivariate Time Series by Learning Sequence-level Discriminative Patterns.",
                    "Health-ATM: A Deep Architecture for Multifaceted Patient Health Record Representation and Risk Prediction.",
                    "Uncorrelated Patient Similarity Learning.",
                    "EEG-based Motion Intention Recognition via Multi-task RNNs.",
                    "Multi-Task Learning based Survival Analysis for Predicting Alzheimer's Disease Progression with Multi-Source Block-wise Missing Data.",
                    "Deep Attention Model for Triage of Emergency Department Patients.",
                    "Learning Graph Representation via Frequent Subgraphs.",
                    "On2Vec: Embedding-based Relation Prediction for Ontology Population.",
                    "On Spectral Graph Embedding: A Non-Backtracking Perspective and Graph Approximation.",
                    "A Family of Tractable Graph Distances.",
                    "Fast Flow-based Random Walk with Restart in a Multi-query Setting.",
                    "Ensemble-Spotting: Ranking Urban Vibrancy via POI Embedding with Multi-view Spatial Graphs.",
                    "Latitude: A Model for Mixed Linear-Tropical Matrix Factorization.",
                    "Topic Modeling based on Keywords and Context.",
                    "Discovering Hidden Topical Hubs and Authorities in Online Social Networks.",
                    "SamBaTen: Sampling-based Batch Incremental Tensor Decomposition.",
                    "ParaSketch: Parallel Tensor Factorization via Sketching.",
                    "The Trustworthy Pal: Controlling the False Discovery Rate in Boolean Matrix Factorization.",
                    "Exploiting Structure for Fast Kernel Learning.",
                    "Global Nonlinear Metric Learning by Gluing Local Linear Metrics.",
                    "Co-regularized Monotone Retargeting for Semi-supervised LeTOR.",
                    "Markov Chain Monitoring.",
                    "Multi-view Weak-label Learning based on Matrix Completion.",
                    "Efficient and Effective Accelerated Hierarchical Higher-Order Logistic Regression for Large Data Quantities.",
                    "Discriminative Prototype Set Learning for Nearest Neighbor Classification.",
                    "ALE: Additive Latent Effect Models for Grade Prediction.",
                    "A Salient Ensemble of Trees using Cascaded Linear Classifiers with Feature-Cost Constraints.",
                    "An LSTM Approach to Patent Classification based on Fixed Hierarchy Vectors.",
                    "Limited-memory Common-directions Method for Distributed Ll-regularized Linear Classification.",
                    "A Practitioners' Guide to Transfer Learning for Text Classification using Convolutional Neural Networks.",
                    "Sparse Decomposition for Time Series Forecasting and Anomaly Detection.",
                    "StreamCast: Fast and Online Mining of Power Grid Time Sequences.",
                    "Exact Mean Computation in Dynamic Time Warping Spaces.",
                    "Framework for Inferring Leadership Dynamics of Complex Movement from Time Series.",
                    "Brain EEG Time Series Selection: A Novel Graph-Based Approach for Classification.",
                    "A Rare and Critical Condition Search Technique and its Application to Telescope Stray Light Analysis.",
                    "Revenue Maximization on the Multi-grade Product.",
                    "Avoidance Region Discovery: A Summary of Results.",
                    "Learning Convolutional Text Representations for Visual Question Answering.",
                    "Black-box Expectation Propagation for Bayesian Models.",
                    "Learning to Interact with Users: A Collaborative-Bandit Approach.",
                    "Robust Cost-Sensitive Learning for Recommendation with Implicit Feedback.",
                    "Investigating Deep Reinforcement Learning Techniques in Personalized Dialogue Generation.",
                    "Modeling Item-specific Effects for Video Click.",
                    "One-Class Recommendation with Asymmetric Textual Feedback.",
                    "Online IT Ticket Automation Recommendation Using Hierarchical Multi-armed Bandit Algorithms.",
                    "Reconstructing a cascade from temporal observations.",
                    "Modeling Co-Evolution Across Multiple Networks.",
                    "Multi-Layered Network Embedding.",
                    "Maximizing the Effect of Information Adoption: A General Framework.",
                    "SMACD: Semi-supervised Multi-Aspect Community Detection.",
                    "Toward Relational Learning with Misinformation.",
                    "Personalized Ranking on Poisson Factorization.",
                    "Strongly Hierarchical Factorization Machines and ANOVA Kernel Regression.",
                    "A Novel Genetic Algorithm for Feature Selection in Hierarchical Feature Spaces.",
                    "Making Kernel Density Estimation Robust towards Missing Values in Highly Incomplete Multivariate Data without Imputation.",
                    "Dense Neighborhood Pattern Sampling in Numerical Data."
                ]
            },
            {
                "sub_name_abbr": "conf/sdm/2018cost",
                "sub_name": "International Workshop on Cost-Sensitive Learning, COST@SDM 2018, San Diego, California, USA, May 5, 2018.",
                "count": 4,
                "papers": [
                    "Cost-Sensitive Learning: Preface.",
                    "Classifier Performance Estimation with Unbalanced, Partially Labeled Data.",
                    "Cost-sensitive Classifier Selection when there is Additional Cost Information.",
                    "Recognizing Cuneiform Signs Using Graph Based Methods."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "17th SDM 2017",
        "info": "Houston, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2017",
                "sub_name": "Proceedings of the 2017 SIAM International Conference on Data Mining, Houston, Texas, USA, April 27-29, 2017.",
                "count": 95,
                "papers": [
                    "Front Matter.",
                    "Using a Random Forest to Inspire a Neural Network and Improving on It.",
                    "Pruning Decision Trees via Max-Heap Projection.",
                    "Margin Distribution Logistic Machine.",
                    "Active Learning of Classification Models with Likert-Scale Feedback.",
                    "Risk Clearance with Guaranteed Precision.",
                    "Computational Drug Discovery with Dyadic Positive-Unlabeled Learning.",
                    "Multi-Region Neural Representation: A novel model for decoding visual stimuli in human brains.",
                    "ALPINE: Progressive Itemset Mining with Definite Guarantees.",
                    "Polyadic Regression and its Application to Chemogenomics.",
                    "Active Learning of Functional Networks from Spike Trains.",
                    "Outlier Detection with Autoencoder Ensembles.",
                    "Gleaning Wisdom from the Past: Early Detection of Emerging Rumors in Social Media.",
                    "VolTime: Unsupervised Anomaly Detection on Users' Online Activity Volume.",
                    "Detecting Malicious Behavior in Computer Networks via Cost-Sensitive and Connectivity Constrained Classification.",
                    "Efficiently Discovering Unexpected Pattern-Co-Occurrences.",
                    "Time-Aware Subscription Prediction Model for User Acquisition in Digital News Media.",
                    "The Power of Certainty: A Dirichlet-Multinomial Model for Belief Propagation.",
                    "From Theory to Practice: Efficient Active Cost-sensitive Classification with Expected Error Reduction.",
                    "Generalized Inverse Classification.",
                    "Predict Land Covers with Transition Modeling and Incremental Learning.",
                    "Unified and Contrasting Graphical Lasso for Brain Network Discovery.",
                    "t-BNE: Tensor-based Brain Network Embedding.",
                    "An RNN Architecture with Dynamic Temporal Matching for Personalized Predictions of Parkinson's Disease.",
                    "Clustering with Domain-Specific Usefulness Scores.",
                    "BrainZoom: High Resolution Reconstruction from Multi-modal Brain Signals.",
                    "Uncovering Group Level Insights with Accordant Clustering.",
                    "A Method to Accelerate Human in the Loop Clustering.",
                    "Model-based von Mises-Fisher Co-clustering with a Conscience.",
                    "Targeted matrix completion.",
                    "Active Positive-Definite Matrix Completion.",
                    "Multi-core K-means.",
                    "Indexing and classifying gigabytes of time series under time warping.",
                    "A Sparse Nonlinear Classifier Design Using AUC Optimization.",
                    "A Dual-Tree Algorithm for Fast k-means Clustering With Large k.",
                    "Specious rules: an efficient and effective unifying method for removing misleading and uninformative patterns in association rule mining.",
                    "MeiKe: Influence-based Communities in Networks.",
                    "Signed Network Embedding in Social Media.",
                    "Finding low-tension communities.",
                    "Sensitivity of Community Structure to Network Uncertainty.",
                    "Subnetwork Mining with Spatial and Temporal Smoothness.",
                    "Selection of Negative Samples for One-class Matrix Factorization.",
                    "HBGG: a Hierarchical Bayesian Geographical Model for Group Recommendation.",
                    "Collaborative User Network Embedding for Social Recommender Systems.",
                    "Redundancies in Data and their Effect on the Evaluation of Recommendation Systems: A Case Study on the Amazon Reviews Datasets.",
                    "Price Recommendation on Vacation Rental Websites.",
                    "Ranking in Heterogeneous Networks with Geo-Location Information.",
                    "Condensing Temporal Networks using Propagation.",
                    "Community-aware network sparsification.",
                    "Graph-based semi-supervised learning for relational networks.",
                    "Toward Personalized Relational Learning.",
                    "Biclustering: An application of Dual Topic Models.",
                    "A Graduated Non-Convexity Relaxation for Large Scale Seriation.",
                    "User-guided Cross-domain Sentiment Classification.",
                    "Exploring Latent Semantic Factors to Find Useful Product Reviews.",
                    "Outlier Detection for Text Data.",
                    "ROFLMAO: Robust Oblique Forests with Linear MAtrix Operations.",
                    "Exploiting Hierarchical Structures for Unsupervised Feature Selection.",
                    "Embedded Supervised Feature Selection for Multi-class Data.",
                    "Correlation by Compression.",
                    "A Deflation Method for Structured Probabilistic PCA.",
                    "Identifying Deep Contrasting Networks from Time Series Data: Application to Brain Network Analysis.",
                    "Cumulative Knowledge-based Regression Models for Next-term Grade Prediction.",
                    "BreachRadar: Automatic Detection of Points-of-Compromise.",
                    "HiDDen: Hierarchical Dense Subgraph Detection with Application to Financial Fraud Detection.",
                    "MultiC2: an Optimization Framework for Learning from Task and Worker Dual Heterogeneity.",
                    "Uplift Modeling with Multiple Treatments and General Response Types.",
                    "FACETS: Adaptive Local Exploration of Large Graphs.",
                    "Absenteeism Detection in Social Media.",
                    "Multimodal Network Alignment.",
                    "Near-Optimal and Practical Algorithms for Graph Scan Statistics.",
                    "Accelerated Attributed Network Embedding.",
                    "Meta-Path Graphical Lasso for Learning Heterogeneous Connectivities.",
                    "Statistical Learning Theory Approach for Data Classification with ℓ-diversity.",
                    "Private and Right-Protected Big Data Publication: An Analysis.",
                    "Differentially Private Rank Aggregation.",
                    "Hash-Based Feature Learning for Incomplete Continuous-Valued Data.",
                    "Multi-Task Multiple Kernel Relationship Learning.",
                    "Multivariate Confidence Intervals.",
                    "A Fast Trust-Region Newton Method for Softmax Logistic Regression.",
                    "Learning from Multi-Modality Multi-Resolution Data: an Optimization Approach.",
                    "Sparse Graphical Modeling via Stochastic Complexity.",
                    "Limited-memory Common-directions Method for Distributed Optimization and its Application on Empirical Risk Minimization.",
                    "Automatic Frankensteining: Creating Complex Ensembles Autonomously.",
                    "Error Metrics for Learning Reliable Manifolds from Streaming Data.",
                    "CSTG: An Effective Framework for Cost-sensitive Sparse Online Learning.",
                    "Concept Drift Detection with Hierarchical Hypothesis Testing.",
                    "Deep Learning: A Generic Approach for Extreme Condition Traffic Forecasting.",
                    "H-Fuse: Efficient Fusion of Aggregated Historical Data.",
                    "Efficiently Summarising Event Sequences with Rich Interleaving Patterns.",
                    "Discovery of Causal Time Intervals.",
                    "Robust Map Matching for Heterogeneous Data via Dominance Decompositions.",
                    "Uncovering the Spatiotemporal Patterns of Collective Social Activity.",
                    "Discovering bursts revisited: guaranteed optimization of the model parameters.",
                    "Back Matter."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "16th SDM 2016",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2016",
                "sub_name": "Proceedings of the 2016 SIAM International Conference on Data Mining, Miami, Florida, USA, May 5-7, 2016.",
                "count": 98,
                "papers": [
                    "Front Matter.",
                    "Clustering in the Face of Fast Changing Streams.",
                    "Kernelized Sparse Self-Representation for Clustering and Recommendation.",
                    "Multi-Domain Manifold Learning for Drug-Target Interaction Prediction.",
                    "Finding Surprisingly Frequent Patterns of Variable Lengths in Sequence Data.",
                    "Identifying Connectivity Patterns for Brain Diseases via Multi-side-view Guided Deep Architectures.",
                    "Regularized Weighted Linear Regression for High-dimensional Censored Data.",
                    "Node Classification in Signed Social Networks.",
                    "Uncovering Multiple Diffusion Networks Using the First-Hand Sharing Pattern.",
                    "Integrating Community and Role Detection in Information Networks.",
                    "Exploiting Emotional Information for Trust/Distrust Prediction.",
                    "Online Prediction of User Actions through an Ensemble Vote from Vector Representation and Frequency Analysis Models.",
                    "FairPlay: Fraud and Malware Detection in Google Play.",
                    "Synergies that Matter: Efficient Interaction Selection via Sparse Factorization Machine.",
                    "A Spatial-Temporal Probabilistic Matrix Factorization Model for Point-of-Interest Recommendation.",
                    "Top-N Recommendation with Novel Rank Approximation.",
                    "Vocal Competence Based Karaoke Recommendation: A Maximum-Margin Joint Model.",
                    "A Confidence-Based Approach for Balancing Fairness and Accuracy.",
                    "Differentially Private Significance Testing on Paired-Sample Data.",
                    "A general framework to increase the robustness of model-based change point detection algorithms to outliers and noise.",
                    "LODES: Local Density Meets Spectral Outlier Detection.",
                    "Routine Mining Based Anomaly Detection in Mobile Phone Data.",
                    "A Scalable Approach for Outlier Detection in Edge Streams Using Sketch-based Approximations.",
                    "R1STM: One-class Support Tensor Machine with Randomised Kernel.",
                    "Scalable Anomaly Ranking of Attributed Neighborhoods.",
                    "Linear and Kernel Classification: When to Use Which?",
                    "Pattern Aided Classification.",
                    "TerseSVM : A Scalable Approach for Learning Compact Models in Large-scale Classification.",
                    "Discriminative Training of Structured Dictionaries via Block Orthogonal Matching Pursuit.",
                    "A Unified View of Localized Kernel Learning.",
                    "Binary Classifier Calibration Using an Ensemble of Linear Trend Estimation.",
                    "Power Simultaneous Spectral Data Embedding and Clustering.",
                    "Process Trace Clustering: A Heterogeneous Information Network Approach.",
                    "Lagrangian Constrained Clustering.",
                    "Fast Multiplier Methods to Optimize Non-exhaustive, Overlapping Clustering.",
                    "Stochastic Co-clustering for Document-Term Data.",
                    "On finding the maximum edge biclique in a bipartite graph: a subspace clustering approach.",
                    "Geometric methods to accelerate k-means algorithms.",
                    "Pivot-based k-means Algorithm for Numerous-class Data Sets.",
                    "k-Means for Streaming and Distributed Big Sparse Data.",
                    "Haliteds: Fast and Scalable Subspace Clustering for Multidimensional Data Streams.",
                    "Online Clustering of Multivariate Time-series.",
                    "Learning A Task-Specific Deep Architecture For Clustering.",
                    "Kernelized Matrix Factorization for Collaborative Filtering.",
                    "Robust Unsupervised Feature Selection on Networked Data.",
                    "Euclidean Co-Embedding of Ordinal Data for Multi-Type Visualization.",
                    "K-Nearest Neighbor Search and Outlier Detection via Minimax Distances.",
                    "Nonlinear Joint Unsupervised Feature Selection.",
                    "A Framework to Adjust Dependency Measure Estimates for Chance.",
                    "Risk Prediction with Electronic Health Records: A Deep Learning Approach.",
                    "Predicting the Popularity of News Articles.",
                    "Uncovering Latent Behaviors in Ant Colonies.",
                    "The Impact of Community Safety on House Ranking.",
                    "iPath:  Forecasting the Pathway to Impact.",
                    "Cost-Sensitive Batch Mode Active Learning: Designing Astronomical Observation by Optimizing Telescope Time and Telescope Choice.",
                    "A Fast Kernel for Attributed Graphs.",
                    "BIRDNEST: Bayesian Inference for Ratings-Fraud Detection.",
                    "Unstable Communities in Network Ensembles.",
                    "CAMLP: Confidence-Aware Modulated Label Propagation.",
                    "Query-Driven Maximum Quasi-Clique Search.",
                    "Distributed Representations of Expertise.",
                    "Temporal Kernel Descriptors for Learning with Time-sensitive Patterns.",
                    "Modelling Recurrent Events for Improving Online Change Detection.",
                    "MACFP: Maximal Approximate Consecutive Frequent Pattern Mining under Edit Distance.",
                    "DPClass: An Effective but Concise Discriminative Patterns-Based Classification Framework.",
                    "Fast Lossless Frequent Itemset Mining in Data Streams using Crucial Patterns.",
                    "Flexibly Mining Better Subgroups.",
                    "Deterministic Column Sampling for Low-Rank Matrix Approximation: Nyström vs. Incomplete Cholesky Decomposition.",
                    "A polynomial expansion line search for large-scale unconstrained minimization of smooth L2-regularized loss functions, with implementation in Apache Spark.",
                    "Structured Regression on Multilayer Networks.",
                    "RelSim: Relation Similarity Search in Schema-Rich Heterogeneous Information Networks.",
                    "Collective Opinion Spam Detection using Active Inference.",
                    "Discovery of Precursors to Adverse Events using Time Series Data.",
                    "Effective Crowd Expertise Modeling via Cross Domain Sparsity and Uncertainty Reduction.",
                    "GSpartan: a Geospatio-Temporal Multi-task Learning Framework for Multi-location Prediction.",
                    "Learning Correlative and Personalized Structure for Online Multi-Task Classification.",
                    "Online Sparse Passive Aggressive Learning with Kernels.",
                    "ADMM for Training Sparse Structural SVMs with Augmented ℓ1 Regularizers.",
                    "Structural Orthogonal Procrustes Regression for Face Recognition with Pose Variations and Misalignment.",
                    "Capricorn: An Algorithm for Subtropical Matrix Factorization.",
                    "Automatic Unsupervised Tensor Mining with Quality Assessment.",
                    "Rank Selection for Non-negative Matrix Factorization with Normalized Maximum Likelihood Coding.",
                    "Sparse Hybrid Variational-Gibbs Algorithm for Latent Dirichlet Allocation.",
                    "Scaling Lifted Probabilistic Inference and Learning Via Graph Databases.",
                    "Estimating Posterior Ratio for Classification: Transfer Learning from Probabilistic Perspective.",
                    "Constrained Group Testing to Predict Binding Response of Candidate Compounds.",
                    "Regularized Parametric Regression for High-dimensional Survival Analysis.",
                    "Copula-HDP-HMM: Non-parametric Modeling of Temporal Multivariate Data for I/O Efficient Bulk Cache Preloading.",
                    "On Skewed Multi-dimensional Distributions: the FusionRP Model, Algorithms, and Discoveries.",
                    "Universal Dependency Analysis.",
                    "High Dimensional Structured Estimation with Noisy Designs.",
                    "Learning Linear Dynamical Systems from Multivariate Time Series: A Matrix Factorization Based Framework.",
                    "Spatio-Temporal Tensor Analysis for Whole-Brain fMRI Classification.",
                    "Linear-time Detection of Non-linear Changes in Massively High Dimensional Time Series.",
                    "Speeding Up All-Pairwise Dynamic Time Warping Matrix Calculation.",
                    "Joint Learning of Representation and Structure for Sparse Regression on Graphs.",
                    "Infusing Geo-Recency Mixture Models for Effective Location Prediction in LBSN.",
                    "Back Matter."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15th SDM 2015",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2015",
                "sub_name": "Proceedings of the 2015 SIAM International Conference on Data Mining, Vancouver, BC, Canada, April 30 - May 2, 2015.",
                "count": 110,
                "papers": [
                    "Front Matter.",
                    "Functional Node Detection on Linked Data.",
                    "Where Graph Topology Matters: The Robust Subgraph Problem.",
                    "Same bang, fewer bucks: efficient discovery of the cost-influence skyline.",
                    "Selecting Shortcuts for a Smaller World.",
                    "Significant Subgraph Mining with Multiple Testing Correction.",
                    "From Categorical to Numerical: Multiple Transitive Distance Learning and Embedding.",
                    "Spectral Embedding of Signed Networks.",
                    "An LLE based Heterogeneous Metric Learning for Cross-media Retrieval.",
                    "Feature Selection for Nonlinear Regression and its Application to Cancer Research.",
                    "Efficient Partial Order Preserving Unsupervised Feature Selection on Networks.",
                    "NetCodec: Community Detection from Individual Activities.",
                    "Efficient Algorithms for a Robust Modularity-Driven Clustering of Attributed Graphs.",
                    "Vertex Clustering of Augmented Graph Streams.",
                    "Tensor Spectral Clustering for Partitioning Higher-order Network Structures.",
                    "Community Detection for Emerging Networks.",
                    "Labeling Educational Content with Academic Learning Standards.",
                    "Data mining for real mining: A robust algorithm for prospectivity mapping with uncertainties.",
                    "Product Adoption Rate Prediction: A Multi-factor View.",
                    "PatentCom: A Comparative View of Patent Document Retrieval.",
                    "Combating Product Review Spam Campaigns via Multiple Heterogeneous Pairwise Features.",
                    "A Bayesian Framework for Modeling Human Evaluations.",
                    "Feature-based factorized Bilinear Similarity Model for Cold-Start Top-n Item Recommendation.",
                    "Cross-Modal Retrieval: A Pairwise Classification Approach.",
                    "Binary Classifier Calibration Using a Bayesian Non-Parametric Approach.",
                    "Semi-supervised learning for structured regression on partially observed attributed graphs.",
                    "Health Insurance Market Risk Assessment: Covariate Shift and k-Anonymity.",
                    "Attacking DBSCAN for Fun and Profit.",
                    "Result Integrity Verification of Outsourced Privacy-preserving Frequent Itemset Mining.",
                    "Modeling Users' Adoption Behaviors with Social Selection and Influence.",
                    "Exploring the Impact of Dynamic Mutual Influence on Social Event Participation.",
                    "Efficient Online Relative Comparison Kernel Learning.",
                    "Cheetah: Fast Graph Kernel Tracking on Dynamic Graphs.",
                    "On the Non-Trivial Generalization of Dynamic Time Warping to the Multi-Dimensional Case.",
                    "Fast Mining of a Network of Coevolving Time Series.",
                    "Shapelet Ensemble for Multi-dimensional Time Series.",
                    "Low Rank Representation on Riemannian Manifold of Symmetric Positive Definite Matrices.",
                    "Getting to Know the Unknown Unknowns: Destructive-Noise Resistant Boolean Matrix Factorization.",
                    "Convex Matrix Completion: A Trace-Ball Optimization Perspective.",
                    "Near-separable Non-negative Matrix Factorization with ℓ1 and Bregman Loss Functions.",
                    "Personalized TV Recommendation with Mixture Probabilistic Matrix Factorization.",
                    "Legislative Prediction with Dual Uncertainty Minimization from Heterogeneous Information.",
                    "PLUMS: Predicting Links Using Multiple Sources.",
                    "SourceSeer: Forecasting Rare Disease Outbreaks Using Multiple Data Sources.",
                    "GIN: A Clustering Model for Capturing Dual Heterogeneity in Networked Data.",
                    "Believe It Today or Tomorrow? Detecting Untrustworthy Information from Dynamic Multi-Source Data.",
                    "Rare Class Detection in Networks.",
                    "Hidden Hazards: Finding Missing Nodes in Large Graph Epidemics.",
                    "Clustering and Ranking in Heterogeneous Information Networks via Gamma-Poisson Model.",
                    "A Divide-and-Conquer Algorithm for Betweenness Centrality.",
                    "Frameworks to Encode User Preferences for Inferring Topic-sensitive Information Networks.",
                    "Dropout Training of Matrix Factorization and Autoencoder for Link Prediction in Sparse Graphs.",
                    "An ADMM Algorithm for Clustering Partially Observed Networks.",
                    "Scaling log-linear analysis to datasets with thousands of variables.",
                    "A Distributed Frank-Wolfe Algorithm for Communication-Efficient Sparse Learning.",
                    "Exceptional Model Mining with Tree-Constrained Gradient Ascent.",
                    "FORMULA: FactORized MUlti-task LeArning for task discovery in personalized medical models.",
                    "Active Multi-task Learning via Bandits.",
                    "Hierarchical Active Transfer Learning.",
                    "Learning Complex Rare Categories with Dual Heterogeneity.",
                    "Faster Jobs in Distributed Data Processing using Multi-Task Learning.",
                    "Selecting Social Media Responses to News: A Convex Framework Based On Data Reconstruction.",
                    "Tracking Events Using Time-dependent Hierarchical Dirichlet Tree Model.",
                    "Fast Eigen-Functions Tracking on Dynamic Graphs.",
                    "Approximation Algorithms for Reducing the Spectral Radius to Control Epidemic Spread.",
                    "Propagation-based Sentiment Analysis for Microblogging Data.",
                    "POLYGLOT-NER: Massive Multilingual Named Entity Recognition.",
                    "Online Resource Allocation with Structured Diversification.",
                    "Towards Permission Request Prediction on Mobile Apps via Structure Feature Learning.",
                    "On Influential Nodes Tracking in Dynamic Social Networks.",
                    "Less is More: Building Selective Anomaly Ensembles with Application to Event Detection in Temporal Graphs.",
                    "Principled Neuro-Functional Connectivity Discovery.",
                    "Estimating Ad Impact on Clicker Conversions for Causal Attribution: A Potential Outcomes Approach.",
                    "Towards Classification of Social Streams.",
                    "Mobile App Security Risk Assessment: A Crowdsourcing Ranking Approach from User Comments.",
                    "Learning Compressive Sensing Models for Big Spatio-Temporal Data.",
                    "Learning Stroke Treatment Progression Models for an MDP Clinical Decision Support System.",
                    "OnlineCM: Real-time Consensus Classification with Missing Values.",
                    "MET: A Fast Algorithm for Minimizing Propagation in Large Graphs with Small Eigen-Gaps.",
                    "What shall I share and with Whom? - A Multi-Task Learning Formulation using Multi-Faceted Task Relationships.",
                    "A Generalized Mixture Framework for Multi-label Classification.",
                    "Domain-Knowledge Driven Cognitive Degradation Modeling for Alzheimer's Disease.",
                    "Ensemble Learning Methods for Binary Classification with Multi-modality within the Classes.",
                    "A Framework for Simplifying Trip Data into Networks via Coupled Matrix Factorization.",
                    "Multi-View Low-Rank Analysis for Outlier Detection.",
                    "REAFUM: Representative Approximate Frequent Subgraph Mining.",
                    "DIAS: A Disassemble-Assemble Framework for Highly Sparse Text Clustering.",
                    "Optimal event sequence sanitization.",
                    "Predicting Neighbor Distribution in Heterogeneous Information Networks.",
                    "SimplePPT: A Simple Principal Tree Algorithm.",
                    "Temporally Coherent CRP: A Bayesian Non-Parametric Approach for Clustering Tracklets with applications to Person Discovery in Videos.",
                    "Correlating Surgical Vital Sign Quality with 30-Day Outcomes using Regression on Time Series Segment Features.",
                    "Multi-Layered Framework for Modeling Relationships between Biased Objects.",
                    "Optimizing Hashing Functions for Similarity Indexing in Arbitrary Metric and Nonmetric Spaces.",
                    "SpecLDA: Modeling Product Reviews and Specifications to Generate Augmented Specifications.",
                    "Mining Multi-Relational Gradual Patterns.",
                    "Modeling User Arguments, Interactions, and Attributes for Stance Prediction in Online Debate Forums.",
                    "Predicting Preference Tags to Improve Item Recommendation.",
                    "Data Stream Classification Guided by Clustering on Nonstationary Environments and Extreme Verification Latency.",
                    "Mining Block I/O Traces for Cache Preloading with Sparse Temporal Non-parametric Mixture of Multivariate Poisson.",
                    "Taming the Empirical Hubness Risk in Many Dimensions.",
                    "Scalable Clustering of Time Series with U-Shapelets.",
                    "Causal Inference by Direction of Information.",
                    "Graph Regularized Meta-path Based Transductive Regression in Heterogeneous Information Network.",
                    "Localizing Temporal Anomalies in Large Evolving Graphs.",
                    "Non-exhaustive, Overlapping k-means.",
                    "Festival, Date and Limit Line: Predicting Vehicle Accident Rate in Beijing.",
                    "A Multi-label Least-Squares Hashing For Scalable Image Search.",
                    "Spatiotemporal Event Forecasting in Social Media.",
                    "Back Matter."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14th SDM 2014",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2014",
                "sub_name": "Proceedings of the 2014 SIAM International Conference on Data Mining, Philadelphia, Pennsylvania, USA, April 24-26, 2014.",
                "count": 120,
                "papers": [
                    "Class Augmented Active Learning.",
                    "Batch Mode Active Learning with Hierarchical-Structured Embedded Variance.",
                    "Learning from Multi-User Multi-Attribute Annotations.",
                    "Selective Sampling on Probabilistic Data.",
                    "Disambiguation-Free Partial Label Learning.",
                    "DAVA: Distributing Vaccines over Networks under Prior Information.",
                    "Influence Maximization with Viral Product Design.",
                    "A Generative Model with Network Regularization for Semi-Supervised Collective Classification.",
                    "Local Learning for Mining Outlier Subgraphs from Network Datasets.",
                    "A Probabilistic Approach to Uncovering Attributed Graph Anomalies.",
                    "VOG: Summarizing and Understanding Large Graphs.",
                    "Context-Preserving Hashing for Fast Text Classification.",
                    "FlexiFaCT: Scalable Flexible Factorization of Coupled Tensors on Hadoop.",
                    "Turbo-SMT: Accelerating Coupled Sparse Matrix-Tensor Factorizations by 200x.",
                    "DuSK: A Dual Structure-preserving Kernel for Supervised Tensor Learning with Applications to Neuroimages.",
                    "How Can I Index My Thousands of Photos Effectively and Automatically? An Unsupervised Feature Selection Approach.",
                    "Unveiling Variables in Systems of Linear Equations.",
                    "Transductive HSIC Lasso.",
                    "Robust Subspace Discovery through Supervised Low-Rank Constraints.",
                    "Adaptive Quantization for Hashing: An Information-Based Approach to Learning Binary Codes.",
                    "Linking Heterogeneous Input Spaces with Pivots for Multi-Task Learning.",
                    "Active Multitask Learning Using Both Latent and Supervised Shared Topics.",
                    "Multi-Task Feature Selection on Multiple Networks via Maximum Flows.",
                    "Mixed-Transfer: Transfer Learning over Mixed Graphs.",
                    "Multi-Graph Learning with Positive and Unlabeled Bags.",
                    "Consumer Segmentation and Knowledge Extraction from Smart Meter and Survey Data.",
                    "Keeping up with Innovation: A Predictive Framework for Modeling Healthcare Data with Evolving Clinical Interventions.",
                    "Turning the Tide: Curbing Deceptive Yelp Behaviors.",
                    "Predictive Learning in the Presence of Heterogeneity and Limited Training Data.",
                    "Forecasting a Moving Target: Ensemble Models for ILI Case Count Predictions.",
                    "AUC dominant unsupervised ensemble of binary classifiers.",
                    "Convex Optimization for Binary Classifier Aggregation in Multiclass Problems.",
                    "A Deep Learning Approach to Link Prediction in Dynamic Networks.",
                    "A Marginalized Denoising Method for Link Prediction in Relational Data.",
                    "Learning on Probabilistic Labels.",
                    "Adaptive User Distance Modeling in Social Media.",
                    "Make It or Break It: Manipulating Robustness in Large Networks.",
                    "It Takes Two to Tango: Exploring Social Tie Development with Both Online and Offline Interactions.",
                    "Laplacian Spectral Properties of Graphs from Random Local Samples.",
                    "Triangle counting in streamed graphs via small vertex covers.",
                    "A Constrained Hidden Markov Model Approach for Non-Explicit Citation Context Extraction.",
                    "Joint Author Sentiment Topic Model.",
                    "A Dynamic Nonparametric Model for Characterizing the Topical Communities in Social Streams.",
                    "Recurrent Chinese Restaurant Process with a Duration-based Discount for Event Identification from Twitter.",
                    "Automatic Construction and Ranking of Topical Keyphrases on Collections of Short Documents.",
                    "On Randomly Projected Hierarchical Clustering with Guarantees.",
                    "Self-Taught Spectral Clustering via Constraint Augmentation.",
                    "Embed and Conquer: Scalable Embeddings for Kernel k-Means on MapReduce.",
                    "A Constructive Setting for the Problem of Density Ratio Estimation.",
                    "Density Estimation with Adaptive Sparse Grids for Large Data Sets.",
                    "Latent Factor Transition for Dynamic Collaborative Filtering.",
                    "Contextual Combinatorial Bandit and its Application on Diversified Online Recommendation.",
                    "User Preference Learning with Multiple Information Fusion for Restaurant Recommendation.",
                    "On Modeling Community Behaviors and Sentiments in Microblogging.",
                    "Selecting a Representative Set of Diverse Quality Reviews Automatically.",
                    "Finding the True Frequent Itemsets.",
                    "A Statistical Learning Theory Framework for Supervised Pattern Discovery.",
                    "When and Where: Predicting Human Movements Based on Social Spatial-Temporal Events.",
                    "Ensembles of Elastic Distance Measures for Time Series Classification.",
                    "Discovery of Rare Sequential Topic Patterns in Document Stream.",
                    "Generalized Outlier Detection with Flexible Kernel Density Estimates.",
                    "Building associations between markers of environmental stressors and adverse human health impacts using frequent itemset mining.",
                    "Less is More: Similarity of Time Series under Linear Transformations.",
                    "Graphical Models for Identifying Fraud and Waste in Healthcare Claims.",
                    "Classifier-Adjusted Density Estimation for Anomaly Detection and One-Class Classification.",
                    "Towards Accurate Histogram Publication under Differential Privacy.",
                    "WCAMiner: A Novel Knowledge Discovery System for Mining Concept Associations using Wikipedia.",
                    "META: Multi-resolution Framework for Event Summarization.",
                    "The Benefits of Personalized Smartphone-Based Activity Recognition Models.",
                    "Online Matrix Completion Through Nuclear Norm Regularisation.",
                    "Online Discovery of Group Level Events in Time Series.",
                    "Beating Human Analysts in Nowcasting Corporate Earnings by using Publicly Available Stock Price and Correlation Features.",
                    "Relational Regularization and Feature Ranking.",
                    "Exploiting Monotonicity Constraints in Active Learning for Ordinal Classification.",
                    "Quantifying trust dynamics in signed graphs, the S-Cores approach.",
                    "Improving Credit Card Fraud Detection with Calibrated Probabilities.",
                    "Unsupervised Selection of Robust Audio Feature Subsets.",
                    "Kaleido: Network Traffic Attribution using Multifaceted Footprinting.",
                    "ROCsearch - An ROC-guided Search Strategy for Subgroup Discovery.",
                    "Result Integrity Verification of Outsourced Bayesian Network Structure Learning.",
                    "Classifying Imbalanced Data Streams via Dynamic Feature Group Weighting with Importance Sampling.",
                    "Towards Breaking the Curse of Dimensionality for High-Dimensional Privacy.",
                    "Extracting Researcher Metadata with Labeled Features.",
                    "Future Influence Ranking of Scientific Literature.",
                    "Membership Detection Using Cooperative Data Mining Algorithms.",
                    "Efficient Matching of Substrings in Uncertain Sequences.",
                    "Modeling Asymmetry and Tail Dependence among Multiple Variables by Using Partial Regular Vine.",
                    "Multi-Task Clustering using Constrained Symmetric Non-Negative Matrix Factorization.",
                    "A Weighted Adaptive Mean Shift Clustering Algorithm.",
                    "Community Discovery in Social Networks via Heterogeneous Link Association and Fusion.",
                    "Large-scale Kernel RankSVM.",
                    "Detecting Influence Relationships from Graphs.",
                    "Discriminative Density-ratio Estimation.",
                    "Density-Based Clustering Validation.",
                    "Directed Interpretable Discovery in Tensors with Sparse Projection.",
                    "Recovering Missing Labels of Crowdsourcing Workers.",
                    "Factor Matrix Trace Norm Minimization for Low-Rank Tensor Completion.",
                    "A New Framework for Traffic Anomaly Detection.",
                    "Characterising Seismic Data.",
                    "Submodularity in Team Formation Problem.",
                    "Unsupervised Feature Learning by Deep Sparse Coding.",
                    "Online Anomaly Detection by Improved Grammar Compression of Log Sequences.",
                    "Large-Scale Multi-Label Learning with Incomplete Label Assignments.",
                    "Adversarial Learning with Bayesian Hierarchical Mixtures of Experts.",
                    "Discriminant Analysis for Unsupervised Feature Selection.",
                    "Finding Friends on a New Site Using Minimum Information.",
                    "On Finding the Point Where There Is No Return: Turning Point Mining on Game Data.",
                    "Addressing Human Subjectivity via Transfer Learning: An Application to Predicting Disease Outcome in Multiple Sclerosis Patients.",
                    "A graphical model approach to ATLAS-free mining of MRI images.",
                    "To Sample or To Smash? Estimating reachability in large time-varying graphs.",
                    "An Optimization-based Framework to Learn Conditional Random Fields for Multi-label Classification.",
                    "Discovering Groups of Time Series with Similar Behavior in Multiple Small Intervals of Time.",
                    "Memory-efficient Query-driven Community Detection with Application to Complex Disease Associations.",
                    "Frugal Traffic Monitoring with Autonomous Participatory Sensing.",
                    "Iterative Framework Radiation Hybrid Mapping.",
                    "A Guide to Selecting a Network Similarity Method.",
                    "Subgraph Search in Large Graphs with Result Diversification.",
                    "Mining Interpretable and Predictive Diagnosis Codes from Multi-source Electronic Health Records.",
                    "Auto-play: A Data Mining Approach to ODI Cricket Simulation and Prediction.",
                    "Accelerating Graph Adjacency Matrix Multiplications with Adjacency Forest."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th SDM 2013",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2013",
                "sub_name": "Proceedings of the 13th SIAM International Conference on Data Mining, May 2-4, 2013. Austin, Texas, USA.",
                "count": 89,
                "papers": [
                    "Fast Exact Max-Kernel Search.",
                    "Triadic Measures on Graphs: The Power of Wedge Sampling.",
                    "Maximal Deviations of Incomplete U-statistics with Applications to Empirical Risk Sampling.",
                    "NetSpot: Spotting Significant Anomalous Regions on Dynamic Networks.",
                    "Mining Connection Pathways for Marked Nodes in Large Graphs.",
                    "Missing or Inapplicable: Treatment of Incomplete Continuous-valued Features in Supervised Learning.",
                    "Patient Risk Prediction Model via Top-k Stability Selection.",
                    "Collective Kernel Construction in Noisy Environment.",
                    "Mining Probabilistic Representative Frequent Patterns From Uncertain Data.",
                    "Discriminative Feature Selection for Uncertain Graph Classification.",
                    "Determining the Number of Clusters via Iterative Consensus Clustering.",
                    "Constrained Spectral Clustering using L1 Regularization.",
                    "Efficient Anytime Density-based Clustering.",
                    "Evolutionary Soft Co-Clustering.",
                    "Sparse Subspace Clustering via Group Sparse Coding.",
                    "On Graph Stream Clustering with Side Information.",
                    "Dynamic Community Detection in Weighted Graph Streams.",
                    "DELTACON: A Principled Massive-Graph Similarity Function.",
                    "What's Your Next Move: User Activity Prediction in Location-based Social Networks.",
                    "CoFiSet: Collaborative Filtering via Learning Pairwise Preferences over Item-sets.",
                    "k-means-: A Unified Approach to Clustering and Outlier Detection.",
                    "CMI: An Information-Theoretic Contrast Measure for Enhancing Subspace Cluster and Outlier Detection.",
                    "Cost-Sensitive Double Updating Online Learning and Its Application to Online Anomaly Detection.",
                    "Efficient Selection of Globally Optimal Rules on Large Imbalanced Data Based on Rule Coverage Relationship Analysis.",
                    "Outlier Detection with Space Transformation and Spectral Analysis.",
                    "Multi-objective Multi-view Spectral Clustering via Pareto Optimization.",
                    "Multi-Transfer: Transfer Learning with Multiple Views and Multiple Sources.",
                    "Multi-View Clustering via Joint Nonnegative Matrix Factorization.",
                    "On Handling Negative Transfer and Imbalanced Distributions in Multiple Source Transfer Learning.",
                    "Unsupervised Feature Selection for Multi-View Data in Social Media.",
                    "SMART: Semi-Supervised Music Emotion Recognition with Social Tagging.",
                    "Probabilistic Combination of Classifier and Cluster Ensembles for Non-transductive Learning.",
                    "Active Learning to Rank using Pairwise Supervision.",
                    "ActNeT: Active Learning for Networked Texts in Microblogging.",
                    "Active Class Discovery and Learning for Networked Data.",
                    "Climate Multi-model Regression Using Spatial Smoothing.",
                    "Distribution Regularized Regression Framework for Climate Modeling.",
                    "Sparse Representation for HIV-1 Protease Drug Resistance Prediction.",
                    "Dynamic Shaker Detection from Evolving Entities.",
                    "Monitoring and mining GPS traces in transit space.",
                    "Exploiting Synchronicity Networks for Finding Valuables in Heterogeneous Networks.",
                    "Exploring and Inferring User-User Pseudo-Friendship for Sentiment Analysis with Heterogeneous Networks.",
                    "Opinion Maximization in Social Networks.",
                    "Point-of-Interest Recommendation in Location Based Social Networks with Topic and Location Awareness.",
                    "Community Detection with Prior Knowledge.",
                    "Regularization of Latent Variable Models to Obtain Sparsity.",
                    "Sparse Max-Margin Multiclass and Multi-label Classifier Design for Fast Inference.",
                    "An Empirical Study of the Suitability of Class Decomposition for Linear Models: When Does It Work Well?",
                    "Reduced Set KPCA for Improving the Training and Execution Speed of Kernel Machines.",
                    "A New Perspective on Convex Relaxations of Sparse SVM.",
                    "Time-sensitive Classification of Behavioral Data.",
                    "An Examination of Practical Granger Causality Inference.",
                    "Bregman Divergences and Triangle Inequality.",
                    "Joint Segmentation and Clustering in Text Corpuses.",
                    "Automatic Detection and Correction of Multi-class Classification Errors Using System Whole-part Relationships.",
                    "Contextual Time Series Change Detection.",
                    "Very Fast Similarity Queries on Semi-Structured Data from the Web.",
                    "Topic Models For Feature Selection in Document Clustering.",
                    "A Nonparametric Mixture Model for Topic Modeling over Time.",
                    "Discriminative Transfer Learning on Manifold.",
                    "SemInf: A Burst-based Semantic Influence Model for Biomedical Topic Influence.",
                    "Pinch Ratio Clustering from a Topologically Intrinsic Lexicographic Ordering.",
                    "Retweeting: An Act of Viral Users, Susceptible Users, or Viral Topics?",
                    "Time Series Classification under More Realistic Assumptions.",
                    "Finding Affordable and Collaborative Teams from a Network of Experts.",
                    "IBSM: Interval-Based Sequence Matching.",
                    "Modeling the Diffusion of Preferences on Social Networks.",
                    "Mining Labelled Tensors by Discovering both their Common and Discriminative Subspaces.",
                    "Modeling Clinical Time Series Using Gaussian Process Sequences.",
                    "Integrity Verification of K-means Clustering Outsourced to Infrastructure as a Service (IaaS) Providers.",
                    "Selective Transfer Learning for Cross Domain Recommendation.",
                    "Change Detection from Temporal Sequences of Class Labels: Application to Land Cover Change Mapping.",
                    "Fractional Immunization in Networks.",
                    "Fast Shapelets: A Scalable Algorithm for Discovering Time Series Shapelets.",
                    "MC-MinH: Metagenome Clustering using Minwise based Hashing.",
                    "Shattering and Compressing Networks for Betweenness Centrality.",
                    "CoSelect: Feature Selection with Instance Selection for Social Media Data.",
                    "A Hierarchical Probabilistic Model for Low Sample Rate Home-Use Energy Disaggregation.",
                    "On the Detectability of Node Grouping in Networks.",
                    "MODS: Multiple One-class Data Streams Learning from Homogeneous Data.",
                    "Robust Textual Data Streams Mining Based on Continuous Transfer Learning.",
                    "Graphical Modeling of Macro Behavioral Targeting in Social Networks.",
                    "Learning Topics in Short Texts by Non-negative Matrix Factorization on Term Correlation Matrix.",
                    "Set Coverage Problems in a One-Pass Data Stream.",
                    "Sentiment Topic Model with Decomposed Prior.",
                    "Topic-Level Expert Modeling in Community Question Answering.",
                    "Butterfly Mixing: Accelerating Incremental-Update Algorithms on Clusters.",
                    "It Is Not Just What We Say, But How We Say Them: LDA-based Behavior-Topic Model.",
                    "Feature Selection by Joint Graph Sparse Coding."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th SDM 2012",
        "info": "Anaheim, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2012",
                "sub_name": "Proceedings of the Twelfth SIAM International Conference on Data Mining, Anaheim, California, USA, April 26-28, 2012.",
                "count": 98,
                "papers": [
                    "Detecting and Tracking Coordinated Groups in Dense, Systematically Moving, Crowds.",
                    "Large-Scale Nonparametric Estimation of Vehicle Travel Time Distributions.",
                    "Drought Detection of the Last Century: An MRF-based Approach.",
                    "Toward Data-driven, Semi-automatic Inference of Phenomenological Physical Models: Application to Eastern Sahel Rainfall.",
                    "Sparse Group Lasso: Consistency and Climate Applications.",
                    "The Multi-Set Stream Clustering Problem.",
                    "Stratification Based Hierarchical Clustering Over a Deep Web Data Source.",
                    "Cluster-Aware Compression with Provable K-means Preservation.",
                    "Supervised Clustering of Label Ranking Data.",
                    "Symmetric Nonnegative Matrix Factorization for Graph Clustering.",
                    "Feature Selection with Linked Data in Social Media.",
                    "Microscopic Social Influence.",
                    "HAR: Hub, Authority and Relevance Scores in Multi-Relational Data for Query Search.",
                    "Evaluating Event Credibility on Twitter.",
                    "Multi-skill Collaborative Teams based on Densest Subgraphs.",
                    "Heterogeneous Data Fusion via Space Alignment Using Nonmetric Multidimensional Scaling.",
                    "Heterogeneous Datasets Representation and Learning using Diffusion Maps and Laplacian Pyramids.",
                    "A Bayesian Nonparametric Joint Factor Model for Learning Shared and Individual Subspaces from Multiple Data Sources.",
                    "Adaptive Multi-task Sparse Learning with an Application to fMRI Study.",
                    "Learning from Heterogeneous Sources via Gradient Boosting Consensus.",
                    "Slim: Directly Mining Descriptive Patterns.",
                    "MARBLES: Mining Association Rules Buried in Long Event Sequences.",
                    "Mining Patterns in Networks using Homomorphism.",
                    "Scalable Induction of Probabilistic Real-Time Automata Using Maximum Frequent Pattern Based Clustering.",
                    "Class Relevant Pattern Mining in Output-Polynomial Time.",
                    "Simplex Distributions for Embedding Data Matrices over Time.",
                    "Transformation Based Ensembles for Time Series Classification.",
                    "Mining Compressing Sequential Patterns.",
                    "Beam Methods for the Profile Hidden Markov Model.",
                    "Optimal Distance Estimation Between Compressed Data Series.",
                    "Multi-Objective Multi-Label Classification.",
                    "Bayesian Supervised Multilabel Learning with Coupled Embedding and Classification.",
                    "Subtree Replacement in Decision Tree Simplification.",
                    "A Distributed Kernel Summation Framework for General-Dimension Machine Learning.",
                    "Kernelized Probabilistic Matrix Factorization: Exploiting Graphs and Side Information.",
                    "On Dynamic Link Inference in Heterogeneous Networks.",
                    "A Framework for the Evaluation and Management of Network Centrality.",
                    "PICS: Parameter-free Identification of Cohesive Subgroups in Large Attributed Graphs.",
                    "Structural Analysis in Multi-Relational Social Networks.",
                    "Influence Blocking Maximization in Social Networks under the Competitive Linear Threshold Model.",
                    "Feature Selection over Distributed Data Streams through Convex Optimization.",
                    "Feature Selection \"Tomography\" - Illustrating that Optimal Feature Filtering is Hopelessly Ungeneralizable.",
                    "Sampling Strategies to Evaluate the Performance of Unknown Predictors.",
                    "A Bayesian Markov-switching Model for Sparse Dynamic Network Estimation.",
                    "Learning Hierarchical Relationships among Partially Ordered Objects with Heterogeneous Attributes and Links.",
                    "Transfer Learning of Distance Metrics by Cross-Domain Metric Sampling across Heterogeneous Spaces.",
                    "Dual Transfer Learning.",
                    "Transfer Significant Subgraphs across Graph Databases.",
                    "Transfer Topic Modeling with Ease and Scalability.",
                    "SOR: Scalable Orthogonal Regression for Low-Redundancy Feature Selection and its Healthcare Applications.",
                    "Mining Massive Archives of Mice Sounds with Symbolized Representations.",
                    "IntruMine: Mining Intruders in Untrustworthy Data of Cyber-physical Systems.",
                    "Robust Reputation-Based Ranking on Bipartite Rating Networks.",
                    "Event Detection in Social Streams.",
                    "On Influential Node Discovery in Dynamic Social Networks.",
                    "Query-based Biclustering using Formal Concept Analysis.",
                    "Granger Causality Analysis in Irregular Time Series.",
                    "Clustering Based on Yukawa Potential.",
                    "Deterministic CUR for Improved Large-Scale Data Analysis: An Empirical Study.",
                    "Combining Active Learning and Dynamic Dimensionality Reduction.",
                    "Context-aware Search for Personal Information Management Systems.",
                    "Mining Social Dependencies in Dynamic Interaction Networks.",
                    "Detecting Irregularly Shaped Significant Spatial and Spatio-Temporal Clusters.",
                    "Contextual Collaborative Filtering via Hierarchical Matrix Factorization.",
                    "Active Learning with Monotonicity Constraints.",
                    "Pseudo Cold Start Link Prediction with Multiple Sources in Social Networks.",
                    "Discovering Context-aware Influential Objects.",
                    "Monitoring and Mining Insect Sounds in Visual Space.",
                    "Image Mining of Historical Manuscripts to Establish Provenance.",
                    "RP-growth: Top-k Mining of Relevant Patterns with Minimum Support Raising.",
                    "Fast Random Walk Graph Kernel.",
                    "Tracking Spatio-Temporal Diffusion in Climate Data.",
                    "Group Sparsity in Nonnegative Matrix Factorization.",
                    "Global Linear Neighborhoods for Efficient Label Propagation.",
                    "Generalized Similarity Kernels for Efficient Sequence Classification.",
                    "Detecting Extreme Rank Anomalous Collections.",
                    "Visualizing Variable-Length Time Series Motifs.",
                    "Which Distance Metric is Right: An Evolutionary K-Means View.",
                    "Constructing Training Sets for Outlier Detection.",
                    "A Flexible Open-Source Toolbox for Scalable Complex Graph Analysis.",
                    "Fast Robustness Estimation in Large Social Graphs: Communities and Anomaly Detection.",
                    "On Finding Joint Subspace Boolean Matrix Factorizations.",
                    "Generalized Optimization Framework for Graph-based Semi-supervised Learning.",
                    "A Tree-Based Kernel for Graphs.",
                    "Density-based Projected Clustering over High Dimensional Data Streams.",
                    "A Novel Approximation to Dynamic Time Warping allows Anytime Clustering of Massive Time Series Datasets.",
                    "Nearest-Neighbor Search on a Time Budget via Max-Margin Trees.",
                    "Efficient Clustering of Metagenomic Sequences using Locality Sensitive Hashing.",
                    "Balancing Prediction and Recommendation Accuracy: Hierarchical Latent Factors for Preference Data.",
                    "On Evaluation of Outlier Rankings and Outlier Scores.",
                    "Regularized Structured Output Learning with Partial Labels.",
                    "The Similarity Between Stochastic Kronecker and Chung-Lu Graph Models.",
                    "WIGM: Discovery of Subgraph Patterns in a Large Weighted Graph.",
                    "Legislative Prediction via Random Walks over a Heterogeneous Graph.",
                    "An Iterative and Re-weighting Framework for Rejection and Uncertainty Resolution in Crowdsourcing.",
                    "Citation Prediction in Heterogeneous Bibliographic Networks.",
                    "Mining Multi-Label Data Streams Using Ensemble-Based Active Learning.",
                    "Feature Selection for High-dimensional Integrated Data."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11th SDM 2011",
        "info": "Mesa, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2011",
                "sub_name": "Proceedings of the Eleventh SIAM International Conference on Data Mining, SDM 2011, April 28-30, 2011, Mesa, Arizona, USA.",
                "count": 86,
                "papers": [
                    "ACE: Anomaly Clustering Ensemble for Multi-perspective Anomaly Detection in Robot Behaviors.",
                    "Interpreting and Unifying Outlier Scores.",
                    "Fast Algorithms for Finding Extremal Sets.",
                    "Structural Diversity for Privacy in Publishing Social Networks.",
                    "The Network Completion Problem: Inferring Missing Nodes and Edges in Networks.",
                    "Integrating Distance Metrics Learned from Multiple Experts and its Application in Inter-Patient Similarity Assessment.",
                    "Learning Feature Dependencies for Noise Correction in Biomedical Prediction.",
                    "Data Integration via Constrained Clustering: An Application to Enzyme Clustering.",
                    "A Gaussian Process Based Online Change Detection Algorithm for Monitoring Periodic Time Series.",
                    "Discovering Dynamic Dipoles in Climate Data.",
                    "Centralities in Large Networks: Algorithms and Observations.",
                    "Large Scale Graph Mining and Inference for Malware Detection.",
                    "Non-Negative Residual Matrix Factorization with Application to Graph Anomaly Detection.",
                    "Kernel-based Similarity Search in Massive Graph Databases with Wavelet Trees.",
                    "Clustered low rank approximation of graphs in information science applications.",
                    "Who Should Label What? Instance Allocation in Multiple Expert Active Learning.",
                    "A Quadratic Mean based Supervised Learning Model for Managing Data Skewness.",
                    "MKBoost: A Framework of Multiple Kernel Boosting.",
                    "Efficient Kernel Approximation for Large-Scale Support Vector Machine Classification.",
                    "A Sequential Dual Method for Structural SVMs.",
                    "Segmented nestedness in binary data.",
                    "Extracting Interpretable Features for Early Classification on Time Series.",
                    "Feature-based Inductive Transfer Learning through Minimum Encoding.",
                    "Chernoff Dimensionality Reduction-Where Fisher Meets FKT.",
                    "Weighted Rank-One Binary Matrix Factorization.",
                    "ABACUS: Mining Arbitrary Shaped Clusters from Large Datasets based on Backbone Identification.",
                    "Spatially-Aware Comparison and Consensus for Clusterings.",
                    "SONAR: Signal De-mixing for Robust Correlation Clustering.",
                    "Nonparametric Bayesian Co-clustering Ensembles.",
                    "A Generalized Framework for Mining Arbitrarily Positioned Overlapping Co-clusters.",
                    "On Node Classification in Dynamic Content-based Networks.",
                    "Predicting Item Adoption Using Social Correlation.",
                    "Influence Maximization in Social Networks When Negative Opinions May Emerge and Propagate.",
                    "Towards Community Detection in Locally Heterogeneous Networks.",
                    "Cost of Collaboration vs Individual Effort in Social Networks.",
                    "Are your Items in Order.",
                    "Probabilistic Models over Ordered Partitions with Applications in Document Ranking and Collaborative Filtering.",
                    "Distributed Monitoring of the R2 Statistic for Linear Regression.",
                    "Block-LDA: Jointly modeling entity-annotated text and entity-entity links.",
                    "A Tractable Pseudo-Likelihood Function for Bayes Nets Applied to Relational Data.",
                    "Sparse Latent Semantic Analysis.",
                    "Graph-Based Marginal Ranking for Update Summarization.",
                    "Exploiting Coherence for the Simultaneous Discovery of Latent Facets and associated Sentiments.",
                    "Semi-Supervised Convolution Graph Kernels for Relation Extraction.",
                    "On Flow Authority Discovery in Social Networks.",
                    "Characterizing Uncertain Data using Compression.",
                    "From Black and White to Full Colour: Extending Redescription Mining Outside the Boolean World.",
                    "A Structure Function for Transaction Data.",
                    "Multidimensional Association Rules in Boolean Tensors.",
                    "Fast Rule Mining Over Multi-Dimensional Windows.",
                    "FAMER: Making Multi-Instance Learning Better and Faster.",
                    "Multi-Instance Mixture Models.",
                    "Multi-Label Collective Classification.",
                    "A Probabilistic Hierarchical Approach for Pattern Discovery in Collaborative Filtering Data.",
                    "Online Max-Margin Weight Learning for Markov Logic Networks.",
                    "On Classification of Graph Streams.",
                    "Temporal Structure Learning for Clustering Massive Data Streams in Real-Time.",
                    "Significance of Patterns in Time Series Collections.",
                    "Time Series Motifs Statistical Significance.",
                    "A Complexity-Invariant Distance Measure for Time Series.",
                    "On Anonymization of Multi-graphs.",
                    "Scalable Software-Defect Localisation by Hierarchical Mining of Dynamic Call Graphs.",
                    "Computationally Generated Cardiac Biomarkers: Heart Rate Patterns to Predict Death Following Coronary Attacks.",
                    "Unsupervised Disaggregation of Low Frequency Power Measurements.",
                    "WindMine: Fast and Effective Mining of Web-click Sequences.",
                    "A Fast Algorithm for Sparse PCA and a New Sparsity Control Criteria.",
                    "Gaussian Process for Dimensionality Reduction in Transfer Learning.",
                    "Semantic Graph Kernels for Automated Reasoning.",
                    "The Odd One Out: Identifying and Characterising Anomalies.",
                    "Sparse Solutions for Single Class SVMs: A Bi-Criterion Approach.",
                    "Multi-task Multiple Kernel Learning.",
                    "The Infinite Push: A New Support Vector Ranking Algorithm that Directly Optimizes Accuracy at the Absolute Top of the List.",
                    "Active Teaching for Inductive Learners.",
                    "Semi-supervised Variable Weighting for Clustering.",
                    "Discovering Bucket Orders from Data.",
                    "Exemplar-based Robust Coherent Biclustering.",
                    "Sequential Minimal Optimization in Adaptive-Bandwidth Convex Clustering.",
                    "Efficient Document Clustering via Online Nonnegative Matrix Factorizations.",
                    "Extending Consensus Clustering to Explore Multiple Clustering Views.",
                    "Weighted Graph Compression for Parameter-free Clustering With PaCCo.",
                    "iMet: Interactive Metric Learning in Healthcare Applications.",
                    "Maximising the Quality of Influence.",
                    "Human Dynamics in Large Communication Networks.",
                    "Diversified Trajectory Pattern Ranking in Geo-tagged Social Media.",
                    "One-Class-Based Uncertain Data Stream Learning.",
                    "Online Discovery of Top-k Similar Motifs in Time Series Data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10th SDM 2010",
        "info": "Columbus, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2010",
                "sub_name": "Proceedings of the SIAM International Conference on Data Mining, SDM 2010, April 29 - May 1, 2010, Columbus, Ohio, USA.",
                "count": 82,
                "papers": [
                    "Text Categorization Using Word Similarities Based on Higher Order Co-occurrences.",
                    "Exploiting Associations between Word Clusters and Document Classes for Cross-Domain Text Categorization.",
                    "Semi-supervised Bio-named Entity Recognition with Word-Codebook Learning.",
                    "Improving Accessibility of Transaction-centric Web Objects.",
                    "Reconstructing Randomized Social Networks.",
                    "Reconstruction from Randomized Graph via Low Rank Approximation.",
                    "Do You Trust to Get Trust? A Study of Trust Reciprocity Behaviors and Reciprocal Trust Prediction.",
                    "Publishing Skewed Sensitive Microdata.",
                    "A SAT-based Framework for Efficient Constrained Clustering.",
                    "Spectral and Semidefinite Relaxation of the CLUHSIC Algorithm.",
                    "Generation of Alternative Clusterings Using the CAMI Approach.",
                    "Making k-means Even Faster.",
                    "On Mining Statistically Significant Attribute Association Information.",
                    "An Information-Theoretic Approach to Finding Informative Noisy Tiles in Binary Databases.",
                    "Mining Top-K Patterns from Binary Datasets in Presence of Noise.",
                    "Formal Concept Sampling for Counting and Threshold-Free Local Pattern Mining.",
                    "Alleviating the Sparsity Problem in Collaborative Filtering by Using an Adapted Distance and a Graph-Based Method.",
                    "Collaborative Filtering: Weighted Nonnegative Matrix Factorization Incorporating User and Item Graphs.",
                    "Temporal Collaborative Filtering with Bayesian Probabilistic Tensor Factorization.",
                    "Residual Bayesian Co-clustering for Matrix Approximation.",
                    "Two-View Transductive Support Vector Machines.",
                    "Fast Stochastic Frank-Wolfe Algorithms for Nonlinear SVMs.",
                    "Single-Pass Distributed Learning of Multi-class SVMs Using Core-Sets.",
                    "Nonnegative Principal Component Analysis for Proteomic Tumor Profiles.",
                    "Efficient Nonnegative Matrix Factorization with Random Projections.",
                    "Bridging Domains with Words: Opinion Analysis with Matrix Tri-factorizations.",
                    "Exact Passive-Aggressive Algorithm for Multiclass Classification Using Support Class.",
                    "Robust Mining of Time Intervals with Semi-interval Partial Order Patterns.",
                    "Cascading Spatio-temporal Pattern Discovery: A Summary of Results.",
                    "Frequentness-Transition Queries for Distinctive Pattern Mining from Time-Segmented Databases.",
                    "Consecutive Ones Property and Spectral Ordering.",
                    "Naive Bayes Classifier for Positive Unlabeled Learning with Uncertainty.",
                    "On Multidimensional Sharpening of Uncertain Data.",
                    "Subspace Clustering for Uncertain Data.",
                    "On the Use of Combining Rules in Relational Probability Trees.",
                    "The Application of Statistical Relational Learning to a Database of Criminal and Terrorist Activity.",
                    "ContexTour: Contextual Contour Analysis on Dynamic Multi-relational Clustering.",
                    "Identifying Multi-instance Outliers.",
                    "Mining Actionable Subspace Clusters in Sequential Data.",
                    "GraSS: Graph Structure Summarization.",
                    "Mining Frequent Graph Sequence Patterns Induced by Vertices.",
                    "On Clustering Graph Streams.",
                    "Inferring Probability Distributions of Graph Size and Node Degree from Stochastic Graph Grammars.",
                    "p-ISOMAP: An Efficient Parametric Update for ISOMAP for Visual Analytics.",
                    "Confidence-Based Feature Acquisition to Minimize Training and Test Costs.",
                    "Co-selection of Features and Instances for Unsupervised Rare Category Analysis.",
                    "Active Ordering of Interactive Prediction Tasks.",
                    "Radius Plots for Mining Tera-byte Scale Graphs: Algorithms, Patterns, and Observations.",
                    "Spectral Analysis of Signed Graphs for Clustering, Prediction and Visualization.",
                    "Fast Single-Pair SimRank Computation.",
                    "A Heterogeneous Label Propagation Algorithm for Disease Gene Discovery.",
                    "Direct Density Ratio Estimation with Dimensionality Reduction.",
                    "The Generalized Dimensionality Reduction Problem.",
                    "Convex Principal Feature Selection.",
                    "Generalized and Heuristic-Free Feature Construction for Improved Accuracy.",
                    "Unsupervised Discovery of Abnormal Activity Occurrences in Multi-dimensional Time Series, with Applications in Wearable Systems.",
                    "An Integrated Framework for Simultaneous Classification and Regression of Time-Series Data.",
                    "Multiresolution Motif Discovery in Time Series.",
                    "Time-Series Classification in Many Intrinsic Dimensions.",
                    "MACH: Fast Randomized Tensor Decompositions.",
                    "Scalable Tensor Factorizations with Missing Data.",
                    "On Low-Rank Updates to the Singular Value and Tucker Decompositions.",
                    "Towards Finding Valuable Topics.",
                    "Predicting Customer Churn in Mobile Networks through Analysis of Social Groups.",
                    "Directed Network Community Detection: A Popularity and Productivity Link Model.",
                    "HCDF: A Hybrid Community Discovery Framework.",
                    "A Robust Decision Tree Algorithm for Imbalanced Data Sets.",
                    "Multi-label Classification without the Multi-label Cost.",
                    "Fast and Accurate Gene Prediction by Decision Tree Classification.",
                    "On Classification of High-Cardinality Data Streams.",
                    "Predictive Modeling with Heterogeneous Sources.",
                    "A Probabilistic Framework to Learn from Multiple Annotators with Time-Varying Accuracy.",
                    "An Integrative Approach to Indentifying Biologically Relevant Genes.",
                    "A Compression Based Distance Measure for Texture.",
                    "Fast Implementation of ℓ1Regularized Learning Algorithms Using Gradient Descent Methods.",
                    "Learning Compressible Models.",
                    "A Permutation Approach to Validation.",
                    "Adaptive Informative Sampling for Active Learning.",
                    "Evaluating Query Result Significance in Databases via Randomizations.",
                    "Cross-Selling Optimization for Customized Promotion.",
                    "A Generalized Tree Matching Algorithm Considering Nested Lists for Web Data Extraction.",
                    "Mining Maximally Banded Matrices in Binary Data."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th SDM 2009",
        "info": "Sparks, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2009",
                "sub_name": "Proceedings of the SIAM International Conference on Data Mining, SDM 2009, April 30 - May 2, 2009, Sparks, Nevada, USA.",
                "count": 105,
                "papers": [
                    "GAD: General Activity Detection for Fast Clustering on Large Data.",
                    "CORE: Nonparametric Clustering of Large Numeric Databases.",
                    "Constraint-Based Subspace Clustering.",
                    "Integrated KL (K-means - Laplacian) Clustering: A New Clustering Approach by Combining Attribute Data and Pairwise Relations.",
                    "Hybrid Clustering of Text Mining and Bibliometrics Applied to Journal Sets.",
                    "Event Discovery in Time Series.",
                    "FuncICA for Time Series Pattern Discovery.",
                    "Autocannibalistic and Anyspace Indexing Algorithms with Application to Sensor Data Mining.",
                    "Proximity-Based Anomaly Detection Using Sparse Structure Learning.",
                    "Optimal Distance Bounds on Time-Series Data.",
                    "Application of Bayesian Partition Models in Warranty Data Analysis.",
                    "Learning Random-Walk Kernels for Protein Remote Homology Identification and Motif Discovery.",
                    "Outlier Detection with Globally Optimal Exemplar-Based GMM.",
                    "Prior-Free Rare Category Detection.",
                    "A Family of Large Margin Linear Classifiers and Its Application in Dynamic Environments.",
                    "DensEst: Density Estimation for Data Mining in High Dimensional Spaces.",
                    "A Framework for Exploring Categorical Data.",
                    "Discovering Substantial Distinctions among Incremental Bi-Clusters.",
                    "Bayesian Cluster Ensembles.",
                    "Agglomerative Mean-Shift Clustering via Query Set Compression.",
                    "Adaptive Concept Drift Detection.",
                    "Scalable Distributed Change Detection from Astronomy Data Streams Using Local, Asynchronous Eigen Monitoring Algorithms.",
                    "Positive Unlabeled Learning for Data Stream Classification.",
                    "Time-Decayed Correlated Aggregates over Data Streams.",
                    "Multi-Modal Hierarchical Dirichlet Process Model for Predicting Image Annotation and Image-Object Label Correspondence.",
                    "A Bayesian Approach to Graphy Regression with Relevant Subgraph Selection.",
                    "A Hybrid Data Mining Metaheuristic for the p-Median Problem.",
                    "A New Constraint for Mining Sets in Sequences.",
                    "A Re-evaluation of the Over-Searching Phenomenon in Inductive Rule Learning.",
                    "A Semi-Supervised Framework for Feature Mapping and Multiclass Classification.",
                    "Aligned Graph Classification with Regularized Logistic Regression.",
                    "An Entity Based Model for Coreference Resolution.",
                    "Analyses for Service Interaction Networks with Applications to Service Delivery.",
                    "Change-Point Detection in Time-Series Data by Direct Density-Ratio Estimation.",
                    "Context Aware Trace Clustering: Towards Improving Process Mining Results.",
                    "Detection and Characterization of Anomalies in Multivariate Time Series.",
                    "Discovery of Geospatial Discriminating Patterns from Remote Sensing Datasets.",
                    "Diversity-Based Weighting Schemes for Clustering Ensembles.",
                    "Divide and Conquer Strategies for Effective Information Retrieval.",
                    "Speeding Up Secure Computations via Embedded Caching.",
                    "Exact Discovery of Time Series Motifs.",
                    "Exploiting Semantic Constraints for Estimating Supersenses with CRFs.",
                    "Feature Weighted SVMs Using Receiver Operating Characteristics.",
                    "FEDRA: A Fast and Efficient Dimensionality Reduction Algorithm.",
                    "Finding Representative Association Rules from Large Rule Collections.",
                    "FutureRank: Ranking Scientific Articles by Predicting their Future PageRank.",
                    "Highlighting Diverse Concepts in Documents.",
                    "Identifying Information-Rich Subspace Trends in High-Dimensional Data.",
                    "Low-Entropy Set Selection.",
                    "Measuring Discrimination in Socially-Sensitive Decision Records.",
                    "Mining Cohesive Patterns from Graphs with Feature Vectors.",
                    "Mining Complex Spatio-Temporal Sequence Patterns.",
                    "Mining for Surprise Events Within Text Streams.",
                    "Multi-field Correlated Topic Modeling.",
                    "Multiple Kernel Clustering.",
                    "MUSK: Uniform Sampling of k Maximal Patterns.",
                    "Noise Robust Classification Based on Spread Spectrum.",
                    "Non-negative Matrix Factorization, Convexity and Isometry.",
                    "Non-parametric Information-Theoretic Measures of One-Dimensional Distribution Functions from Continuous Time Series.",
                    "On Maximum Coverage in the Streaming Model & Application to Multi-topic Blog-Watch.",
                    "On Randomness Measures for Social Networks.",
                    "On Segment-Based Stream Modeling and Its Applications.",
                    "On the Comparison of Relative Clustering Validity Criteria.",
                    "Parallel Pairwise Clustering.",
                    "PICC Counting: Who Needs Joins When You Can Propagate Efficiently?.",
                    "Providing Privacy through Plausibly Deniable Search.",
                    "Randomization Techniques for Graphs.",
                    "Semi-supervised Learning by Sparse Representation.",
                    "ShatterPlots: Fast Tools for Mining Large Graphs.",
                    "Spatially Cost-Sensitive Active Learning.",
                    "Structure and Dynamics of Research Collaboration in Computer Science.",
                    "Text Categorization with All Substring Features.",
                    "The Set Classification Problem and Solution Methods.",
                    "Topic Evolution in a Stream of Documents.",
                    "Tracking User Mobility to Detect Suspicious Behavior.",
                    "Toward Optimal Ordering of Prediction Tasks.",
                    "Hierarchical Linear Discriminant Analysis for Beamforming.",
                    "Twin Vector Machines for Online Learning on a Budget.",
                    "The Metric Dilemma: Competence-Conscious Associative Classification.",
                    "AMORI: A Metric-Based One Rule Inducer.",
                    "Identifying Unsafe Routes for Network-Based Trajectory Privacy.",
                    "Privacy Preservation in Social Networks with Sensitive Edge Weights.",
                    "Graph Generation with Prescribed Feature Constraints.",
                    "Detecting Communities in Social Networks Using Max-Min Modularity.",
                    "A Bayesian Approach Toward Finding Communities and Their Evolutions in Dynamic Social Networks.",
                    "Efficient Discovery of Interesting Patterns Based on Strong Closedness.",
                    "Efficient Computation of Partial-Support for Mining Interesting Itemsets.",
                    "Grammar Mining.",
                    "Top-k Correlative Graph Mining.",
                    "High Performance Parallel/Distributed Biclustering Using Barycenter Heuristic.",
                    "MultiVis: Content-Based Social Network Exploration through Multi-way Visual Analysis.",
                    "Near-optimal Supervised Feature Selection among Frequent Subgraphs.",
                    "Polynomial-Delay and Polynomial-Space Algorithms for Mining Closed Sequences, Graphs, and Pictures in Accessible Set Systems.",
                    "Link Propagation: A Fast Semi-supervised Learning Algorithm for Link Prediction.",
                    "Understanding Importance of Collaborations in Co-authorship Networks: A Supportiveness Analysis Approach.",
                    "Topic Cube: Topic Modeling for OLAP on Multidimensional Text Databases.",
                    "Local Relevance Weighted Maximum Margin Criterion for Text Classification.",
                    "Multi-topic Based Query-Oriented Summarization.",
                    "Straightforward Feature Selection for Scalable Latent Semantic Indexing.",
                    "Parallel Large Scale Feature Selection for Logistic Regression.",
                    "Travel-Time Prediction Using Gaussian Process Regression: A Trajectory-Based Approach.",
                    "Discretized Spatio-Temporal Scan Window.",
                    "Finding Links and Initiators: A Graph-Reconstruction Problem.",
                    "Efficient Multiplicative Updates for Support Vector Machines.",
                    "Efficient Active Learning with Boosting."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th SDM 2008",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2008",
                "sub_name": "Proceedings of the SIAM International Conference on Data Mining, SDM 2008, April 24-26, 2008, Atlanta, Georgia, USA.",
                "count": 77,
                "papers": [
                    "Semi-Supervised Clustering via Matrix Factorization.",
                    "Creating a Cluster Hierarchy under Constraints of a Partially Known Hierarchy.",
                    "Constrained Co-clustering of Gene Expression Data.",
                    "Data Peeler: Contraint-Based Closed Pattern Mining in n-ary Relations.",
                    "SpaRClus: Spatial Relationship Pattern-Based Hierarchial Clustering.",
                    "Mining Tree Patterns with Almost Smallest Supertrees.",
                    "Maximal Quasi-Bicliques with Balanced Noise Tolerance: Concepts and Co-clustering Applications.",
                    "CISpan: Comprehensive Incremental Mining Algorithms of Closed Sequential Patterns for Multi-Versional Software Mining.",
                    "Mining Association Rules of Simple Conjunctive Queries.",
                    "Discovering Relational Items Sets Efficiently.",
                    "A Stagewise Least Square Loss Function for Classification.",
                    "Semi-Supervised Learning Based on Semiparametric Regularization.",
                    "Roughly Balanced Bagging for Imbalanced Data.",
                    "An Efficient Local Algorithm for Distributed Multivariate Regression in Peer-to-Peer Networks.",
                    "Aerosol Optical Depth Prediction from Satellite Obsercations by Multiple Instance Regression.",
                    "Feature Selection with the logRatio Kernel.",
                    "A RELIEF Based Feature Extraction Algorithm.",
                    "Deterministic Latent Variable Models and Their Pitfalls.",
                    "Massive-Scale Kernel Discriminant Analysis: Mining for Quasars.",
                    "Dynamic Non-Parametric Mixture Models and the Recurrent Chinese Restaurant Process: with Applications to Evolutionary Clustering.",
                    "Latent Variable Mining with Its Applications to Anomalous Behavior Detection.",
                    "Similarity Measures for Categorical Data: A Comparative Evaluation.",
                    "Gaussian Process Learning for Cyber-Attack Early Warning.",
                    "Practical Private Computation and Zero-Knowledge Tools for Privacy-Preserving Distributed Data Mining.",
                    "A Spamicity Approach to Web Spam Detection.",
                    "Semantic Smoothing for Bayesian Text Classification with Small Training Data.",
                    "Clustering from Constraint Graphs.",
                    "Efficiently Mining Closed Subsequences with Gap Constraints.",
                    "Semi-Supervised Classification with Universum.",
                    "Finding Subgroups having Several Descriptions: Algorithms for Redescription Mining.",
                    "The PageTrust Algorithm: How to rank web pages when negative links are allowed?",
                    "A pattern mining approach toward discovering generalized sequence signatures.",
                    "The Asymmetric Approximate Anytime Join: A New Primitive with Applications to Data Mining.",
                    "Preemptive Measures against Malicious Party in Privacy-Preserving Data Mining.",
                    "A Range Query Approach for High Dimensional Euclidean Space Based on EDM Estimation.",
                    "A Bayesian Technique for Estimating the Credibility of question Answerers.",
                    "Semi-supervised Multi-label Learning by Solving a Sylvester Equation.",
                    "Exploiting Structured Reference Data for Unsupervised Text Segmentation with Conditional Random Fields.",
                    "Graph Mining with Variational Dirichlet Process Mixture Models.",
                    "Direct Density Ratio Estimation for Large-scale Covariate Shift Adaptation.",
                    "ROC-tree: A Novel Decision Tree Induction Algorithm Based on Receiver Operating Characteristics to Classify Gene Expression Data.",
                    "Semi-supervised Learning of a Markovian Metric.",
                    "Mining Abnormal Patterns from Heterogeneous Time-Series with Irrelevant Features for Fault Event Detection.",
                    "Outlier Detection with Uncertain Data.",
                    "Randomization of real-valued matrices for assessing the significance of data mining results.",
                    "Theorectical Analysis of Subsequence Time-Series Clustering from a Frequency-Analysis Viewpoint.",
                    "Active Learning with Model Selection in Linear Regression.",
                    "A Feature Selection Algorithm Capable of Handling Extremely Large Data Dimensionality.",
                    "Generic Methods for Multi-criteria Evaluation.",
                    "A New Method for Rule Finding Via Bootstrapped Confidence Intervals.",
                    "Mining and Ranking Generators of Sequential Patterns.",
                    "Type-Independent Correction of Sample Selection Bias via Structural Discovery and Re-balancing.",
                    "Exploration and Reduction of the Feature Space by Hierarchical Clustering.",
                    "On the Dangers of Cross-Validation. An Experimental Evaluation.",
                    "Mining Complex, Maximal and Complete Sub-graph and Sets of Correlated Variables with Applications to Feature Subset Selection.",
                    "Spatio-Temporal Partitioning for Improving Aerosol Prediction Accuracy.",
                    "On Indexing High Demensional Data with Uncertainty.",
                    "Efficient Distribution Mining and Classification.",
                    "Mining Sequence Classifiers for Early Prediction.",
                    "Exact and Approximate Reverse Nearest Neighbor Search for Multimedia Data.",
                    "Finding a Haystack in Haystacks - Simultaneous Identification of Concepts in Large Bio-Medical Corpora.",
                    "Learning Markov Network Structure using Few Independence Tests.",
                    "Statistical Density Prediction in Traffic Networks.",
                    "Proximity Tracking on Time-Evolving Bipartite Graphs.",
                    "Integration of Multiple Networks for Robust Label Propagation.",
                    "Spatial Scan Statistics for Graph Clustering.",
                    "Randomizing Social Networks: a Spectrum Preserving Approach.",
                    "Efficient Maximum Margin Clustering via Cutting Plane Algorithm.",
                    "Robust Clustering in Arbitrarily Oriented Subspaces.",
                    "The Relevant-set Correlation Model for Data Clustering.",
                    "Cluster Ensemble Selection.",
                    "Weighted Consensus Clustering.",
                    "A general framework for estimating similarity of datasets and decision trees: exploring semantic similarity of decision trees.",
                    "A General Model for Multiple View Unsupervised Learning.",
                    "Unsupervised Segmentation of Conversational Transcripts.",
                    "Large-Scale Many-Class Learning.",
                    "Simultaneous Unsupervised Learning of Disparate Clusterings."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7th SDM 2007",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2007",
                "sub_name": "Proceedings of the Seventh SIAM International Conference on Data Mining, April 26-28, 2007, Minneapolis, Minnesota, USA.",
                "count": 75,
                "papers": [
                    "A General Framework for Mining Concept-Drifting Data Streams with Skewed Distributions.",
                    "Fast Counting with AV-Space for Efficient Rule Induction.",
                    "Maximizing the Area under the ROC Curve with Decision Lists and Rule Sets.",
                    "Maximum Margin Classifiers with Specified False Positive and False Negative Error Rates.",
                    "AC-Framework for Privacy-Preserving Collaboration.",
                    "On Privacy-Preservation of Text and Sparse Binary Data with Sketches.",
                    "Preventing Information Leaks in Email.",
                    "Towards Attack-Resilient Geometric Data Perturbation.",
                    "Adaptive Concept Learning through Clustering and Aggregation of Relational Data.",
                    "RCMap: Efficiently Creating High-Quality Euclidean Embeddings.",
                    "Active Learning of Constraints for Semi-supervised Text Clustering.",
                    "Mining Naturally Smooth Evolution of Clusters from Dynamic Data.",
                    "Clustering by weighted cuts in directed graphs.",
                    "Multi-way Clustering on Relation Graphs.",
                    "Fast Multilevel Transduction on Graphs.",
                    "Conical Dimension as an Intrinsic Dimension Estimator and its Applications.",
                    "Nonlinear Dimensionality Reduction using Approximate Nearest Neighbors.",
                    "On Point Sampling Versus Space Sampling for Dimensionality Reduction.",
                    "An Analysis of Logistic Models: Exponential Family Connections and Online Performance.",
                    "Bandits for Taxonomies: A Model-based Approach.",
                    "Boosting Optimal Logical Patterns Using Noisy Data.",
                    "Constraint-Based Pattern Set Mining.",
                    "Finding Motifs in a Database of Shapes.",
                    "Incremental Spectral Clustering With Application to Monitoring of Evolving Blog Communities.",
                    "ROAM: Rule- and Motif-Based Anomaly Detection in Massive Moving Object Data Sets.",
                    "Segmentations with Rearrangements.",
                    "Efficient Multiclass Boosting Classification with Active Learning.",
                    "Kernel Based Detection of Mislabeled Training Examples.",
                    "On Sample Selection Bias and Its Efficient Correction via Model Averaging and Unlabeled Examples.",
                    "Probabilistic Joint Feature Selection for Multi-task Learning.",
                    "Fast Newton-type Methods for the Least Squares Nonnegative Matrix Approximation Problem.",
                    "Higher Order Orthogonal Iteration of Tensors (HOOI) and its Relation to PCA and GLRAM.",
                    "Less is More: Compact Matrix Decomposition for Large Sparse Graphs.",
                    "Harmonium Models for Semantic Video Representation and Classification.",
                    "Identifying Bundles of Product Options using Mutual Information Clustering.",
                    "Lattice based Clustering of Temporal Gene-Expression Matrices.",
                    "Robust, Complete, and Efficient Correlation Clustering.",
                    "On Anonymization of String Data.",
                    "Load Shedding in Classifying Multi-Source Streaming Data: A Bayes Risk Approach.",
                    "Topic Models over Text Streams: A Study of Batch and Online Unsupervised Learning.",
                    "Are approximation algorithms for consensus clustering worthwhile?.",
                    "Learning from Time-Changing Data with Adaptive Windowing.",
                    "WAT: Finding Top-K Discords in Time Series Database.",
                    "A PAC Bound for Approximate Support Vector Machines.",
                    "Localized Support Vector Machine and Its Efficient Algorithm.",
                    "Understanding and Utilizing the Hierarchy of Abnormal BGP Events.",
                    "Distributed Top-K Outlier Detection from Astronomy Catalogs using the DEMAC System.",
                    "Mining Visual and Textual Data for Constructing a Multi-Modal Thesaurus.",
                    "HP2PC: Scalable Hierarchically-Distributed Peer-to-Peer Clustering.",
                    "Bursty Feature Representation for Clustering Text Streams.",
                    "Flexible Anonymization For Privacy Preserving Data Publishing: A Systematic Search Based Approach.",
                    "A System for Keyword Search on Textual Streams.",
                    "Co-Preserving Patterns in Bipartite Partitioning for Topic Identification.",
                    "Change-Point Detection using Krylov Subspace Learning.",
                    "Approximating Representations for Large Numerical Databases.",
                    "Distance Preserving Dimension Reduction for Manifold Learning.",
                    "Stacked Graphical Models for Efficient Inference in Markov Random Fields.",
                    "Summarizing Review Scores of \"Unequal\" Reviewers.",
                    "A Better Alternative to Piecewise Linear Time Series Segmentation.",
                    "Patterns of Cascading Behavior in Large Blog Graphs.",
                    "PoClustering: Lossless Clustering of Dissimilarity Data.",
                    "An incremental data-stream sketch using sparse random projections.",
                    "Performance of Recommendation Systems in Dynamic Streaming Environments.",
                    "Scalable Name Disambiguation using Multi-level Graph Partition.",
                    "Dynamic Algorithm for Graph Clustering Using Minimum Cut Tree.",
                    "Rank Aggregation for Similar Items.",
                    "Sketching Landscapes of Page Farms.",
                    "Estimating False Negatives for Classification Problems with Cluster Structure.",
                    "Discriminating Subsequence Discovery for Sequence Clustering.",
                    "Fast Best-Match Shape Searching in Rotation Invariant Metric Spaces.",
                    "HACS: Heuristic Algorithm for Clustering Subsets.",
                    "On Demand Phenotype Ranking through Subspace Clustering.",
                    "Semi-Supervised Dimensionality Reduction.",
                    "Computing Statistical Profiles of Active Sites in Proteins.",
                    "Semi-supervised Feature Selection via Spectral Analysis."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6th SDM 2006",
        "info": "Bethesda, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2006",
                "sub_name": "Proceedings of the Sixth SIAM International Conference on Data Mining, April 20-22, 2006, Bethesda, MD, USA.",
                "count": 76,
                "papers": [
                    "Area Under ROC Optimisation using a Ramp Approximation.",
                    "On the Necessary and Sufficient Conditions of a Meaningful Distance Function for High Dimensional Data Space.",
                    "CPM: A Covariance-preserving Projection Method.",
                    "Transform Regression and the Kolmogorov Superposition Theorem.",
                    "A Latent Dirichlet Model for Unsupervised Entity Resolution.",
                    "Deriving Private Information from Randomly Perturbed Ratings.",
                    "Name Reference Resolution in Organizational Email Archives.",
                    "Automated Knowledge Discovery from Simulators.",
                    "Mining for Outliers in Sequential Databases.",
                    "Mining Control Flow Abnormality for Logic Error Isolation.",
                    "Scan Detection: A Data Mining Approach.",
                    "Learning Bayesian Networks from Incomplete Data: An Efficient Method for Generating Approximate Predictive Distributions.",
                    "Efficient Markov Network Structure Discovery using Independence Tests.",
                    "K-Means Clustering Over a Large, Dynamic Network.",
                    "Adapting K-Medians to Generate Normalized Cluster Centers.",
                    "Advanced Prototype Machines: Exploring Prototypes for Classification.",
                    "Toward Semantic XML Clustering.",
                    "A Semantic Approach for Mining Hidden Links from Complementary and Non-interactive Biomedical Literature.",
                    "Representation is Everything: Towards Efficient and Adaptable Similarity Measures for Biological Data.",
                    "Mining Frequent Agreement Subtrees in Phylogenetic Databases.",
                    "Trend Relational Analysis and Grey-Fuzzy Clustering Method.",
                    "Joint Cluster Analysis of Attribute Data and Relationship Data: the Connected k-Center Problem.",
                    "Weighted Clustering Ensembles.",
                    "Clustering in the Presence of Bridge-Nodes.",
                    "Mining Interesting Patterns from Very High Dimensional Data: A Top-Down Row Enumeration Approach.",
                    "Mining Frequent Patterns by Differential Refinement of Clustered Bitmaps.",
                    "Discovery of Co-evoluting Spatial Co-located Event Sets.",
                    "Efficient Algorithms for Sequence Segmentation.",
                    "Density-Based Clustering over an Evolving Data Stream with Noise.",
                    "A Random Walks Method for Text Classification.",
                    "Efficient Mining of Temporally Annotated Sequences.",
                    "A Framework for Local Supervised Dimensionality Reduction of High Dimensional Data.",
                    "Segmentation and dimensionality reduction.",
                    "Probabilistic Multi-State Split-Merge Algorithm for Coupling Parameter Estimates.",
                    "Item Sets that Compress.",
                    "Mining Approximate Frequent Itemsets In the Presence of Noise: Algorithm and Analysis.",
                    "Mining frequent closed itemsets out-of-core.",
                    "Local L2-Thresholding Based Data Mining in Peer-to-Peer Systems.",
                    "Collaborative Information Extraction and Mining from Multiple Web Documents.",
                    "Collaborative Document Clustering.",
                    "Cluster Description Formats, Problems and Algorithms.",
                    "Positive Borders or Negative Borders: How to Make Lossless Generator Based Representations Concise.",
                    "Bayesian K-Means as a \"Maximization-Expectation\" Algorithm.",
                    "A Framework for Clustering Massive Text and Categorical Data Streams.",
                    "Cone Cluster Labeling for Support Vector Clustering.",
                    "Semi-Supervised Clustering with Partial Background Information.",
                    "A New Privacy-Preserving Distributed k-Clustering Algorithm.",
                    "ODAC: Hierarchical Clustering of Time Series Data Streams.",
                    "Detecting the Change of Clustering Structure in Categorical Data Streams.",
                    "Dissimilarity Measures for Detecting Hepatotoxicity in Clinical Trial Data.",
                    "Transductive De-Noising and Dimensionality Reduction using Total Bregman Regression.",
                    "Robust Estimation for Mixture of Probability Tables based on beta-likelihood.",
                    "Fast optimal bandwidth selection for kernel density estimation.",
                    "Risk-Sensitive Learning via Expected Shortfall Minimization.",
                    "On Approximate Solutions to Support Vector Machines.",
                    "Confidence Estimation Methods for Partially Supervised Information Extraction.",
                    "Inference of Node Replacement Recursive Graph Grammars.",
                    "Learning from Incomplete Ratings Using Non-negative Matrix Factorization.",
                    "Health monitoring of a shaft transmission system via hybrid models of PCR and PLS.",
                    "Modeling Evolutionary Behaviors for Community-based Dynamic Recommendation.",
                    "A Systematic Cross-Comparison of Sequence Classifiers.",
                    "Data-Enhanced Predictive Modeling for Sales Targeting.",
                    "Graph-based Methods for Orbit Classification.",
                    "Mining and Validating Localized Frequent Itemsets with Dynamic Tolerance.",
                    "Profiling Protein Families from Partially Aligned Sequences.",
                    "Personalized Knowledge Discovery: Mining Novel Association Rules from Text.",
                    "A Novel Framework for Incorporating Labeled Examples into Anomaly Detection.",
                    "Towards the Prediction of Protein Abundance from Tandem Mass Spectrometry Data.",
                    "Using Compression to Identify Classes of Inauthentic Texts.",
                    "Fast Mining of Distance-Based Outliers in High Dimensional Datasets.",
                    "Spatial Weighted Outlier Detection.",
                    "Robust Clustering for Tracking Noisy Evolving Data Streams.",
                    "WIP: mining Weighted Interesting Patterns with a strong weight and/or support affinity.",
                    "Discovering Frequent Tree Patterns over Data Streams.",
                    "Finding Sequential Patterns from a Massive Number of Spatio-Temporal Events.",
                    "Mining Minimal Contrast Subgraph Patterns."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5th SDM 2005",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2005",
                "sub_name": "Proceedings of the 2005 SIAM International Conference on Data Mining, SDM 2005, Newport Beach, CA, USA, April 21-23, 2005.",
                "count": 77,
                "papers": [
                    "Computational Developments of ψ-learning.",
                    "A Random Walks Perspective on Maximizing Satisfaction and Profit.",
                    "Surveying Data for Patchy Structure.",
                    "2-Dimensional Singular Value Decomposition for 2D Maps and Images.",
                    "Summarizing and Mining Skewed Data Streams.",
                    "Online Analysis of Community Evolution in Data Streams.",
                    "Mining Frequent Itemsets from Data Streams with a Time-Sensitive Sliding Window.",
                    "On Abnormality Detection in Spuriously Populated Data Streams.",
                    "Privacy-Preserving Classification of Customer Data without Loss of Accuracy.",
                    "Privacy Aware Market Basket Data Set Generation: A Feasible Approach for Inverse Frequent Set Mining.",
                    "On Variable Constraints in Privacy Preserving Data Mining.",
                    "Clustering with Model-level Constraints.",
                    "Clustering with Constraints: Feasibility Issues and the k-Means Algorithm.",
                    "A Cutting Algorithm for the Minimum Sum-of-Squared Error Clustering.",
                    "Dynamic Classification of Defect Structures in Molecular Dynamics Simulation Data.",
                    "Striking Two Birds With One Stone: Simultaneous Mining of Positive and Negative Spatial Patterns.",
                    "Finding Young Stellar Populations in Elliptical Galaxies from Independent Components of Optical Spectra.",
                    "Hybrid Attribute Reduction for Classification Based on A Fuzzy Rough Set Technique.",
                    "HARMONY: Efficiently Mining the Best Rules for Classification.",
                    "On Error Correlation and Accuracy of Nearest Neighbor Ensemble Classifiers.",
                    "Lazy Learning for Classification Based on Query Projections.",
                    "Mining Non-Derivable Association Rules.",
                    "Depth-First Non-Derivable Itemset Mining.",
                    "Exploiting Relationships for Domain-Independent Data Cleaning.",
                    "A Spectral Clustering Approach To Finding Communities in Graph.",
                    "Mining Behavior Graphs for \"Backtrace\" of Noncrashing Bugs.",
                    "Learning to Refine Ontology for a New Web Site Using a Bayesian Approach.",
                    "Exploiting Parameter Related Domain Knowledge for Learning in Graphical Models.",
                    "Exploiting Geometry for Support Vector Machine Indexing.",
                    "Parallel Computation of RBF Kernels for Support Vector Classifiers.",
                    "Loadstar: A Load Shedding Scheme for Classifying Data Streams.",
                    "Topic-driven Clustering for Document Datasets.",
                    "Variational Learning for Noisy-OR Component Analysis.",
                    "Summarizing Sequential Data with Closed Partial Orders.",
                    "SUMSRM: A New Statistic for the Structural Break Detection in Time Series.",
                    "Markov Models for Identification of Significant Episodes.",
                    "Efficient Mining of Maximal Sequential Patterns Using Multiple Samples.",
                    "Gaussian Processes for Active Data Mining of Spatial Aggregates.",
                    "Correlation Clustering for Learning Mixtures of Canonical Correlation Models.",
                    "On Periodicity Detection and Structural Periodic Similarity.",
                    "Cross Table Cubing: Mining Iceberg Cubes from Data Warehouses.",
                    "Decision Tree Induction in High Dimensional, Hierarchically Distributed Databases.",
                    "Slope One Predictors for Online Rating-Based Collaborative Filtering.",
                    "Sparse Fisher Discriminant Analysis for Computer Aided Detection.",
                    "Expanding the Training Data Space Using Emerging Patterns and Genetic Methods.",
                    "Making Data Mining Models Useful to Model Non-paying Customers of Exchange Carriers.",
                    "Matrix Condition Number Prediction with SVM Regression and Feature Selection.",
                    "Cluster Validity Analysis of Alternative Results from Multi-Objective Optimization.",
                    "ClosedPROWL: Efficient Mining of Closed Frequent Continuities by Projected Window List Technology.",
                    "Three Myths about Dynamic Time Warping Data Mining.",
                    "PCA without eigenvalue calculations: a case study on face recognition.",
                    "Mining Top-K Itemsets over a Sliding Window Based on Zipfian Distribution.",
                    "Hierarchical Document Classification Using Automatically Generated Hierarchy.",
                    "On Clustering Binary Data.",
                    "Time-series Bitmaps: a Practical Visualization Tool for Working with Large Time Series Databases.",
                    "Pushing Feature Selection Ahead Of Join.",
                    "Discarding Insignificant Rules during Impact Rule Discovery in Large, Dense Databases.",
                    "SPID4.7: Discretization Using Successive Pseudo Deletion at Maximum Information Gain Boundary Points.",
                    "Iterative Mining for Rules with Constrained Antecedents.",
                    "Influence in Ratings-Based Recommender Systems: An Algorithm-Independent Approach.",
                    "Mining Unconnected Patterns in Workflows.",
                    "The Best Nurturers in Computer Science Research.",
                    "Knowledge Discovery from Heterogeneous Dynamic Systems using Change-Point Correlations.",
                    "Building Decision Trees on Records Linked through Key References.",
                    "Efficient Allocation of Marketing Resources using Dynamic Programming.",
                    "Near-Neighbor Search in Pattern Distance Spaces.",
                    "An Algorithm for Well Structured Subspace Clusters.",
                    "CBS: A New Classification Method by Using Sequential Patterns.",
                    "SeqIndex: Indexing Sequences by Sequential Pattern Analysis.",
                    "On the Equivalence of Nonnegative Matrix Factorization and Spectral Clustering.",
                    "Kronecker Factorization for Speeding up Kernel Machines.",
                    "Symmetric Statistical Translation Models for Automatic Image Annotation.",
                    "Correcting Sampling Bias in Structural Genomics through Iterative Selection of Underrepresented Targets.",
                    "Statictical Models for Unequally Spaced Time Series.",
                    "CLSI: A Flexible Approximation Scheme from Clustered Term-Document Matrices.",
                    "WFIM: Weighted Frequent Itemset Mining with a weight range and a minimum weight.",
                    "Model-based Clustering With Probabilistic Constraints."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "4th SDM 2004",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2004",
                "sub_name": "Proceedings of the Fourth SIAM International Conference on Data Mining, Lake Buena Vista, Florida, USA, April 22-24, 2004.",
                "count": 61,
                "papers": [
                    "Mining Relationships Between Interacting Episodes.",
                    "Making Time-Series Classification More Accurate Using Learned Constraints.",
                    "GRM: A New Model for Clustering Linear Sequences.",
                    "Nonlinear Manifold Learning for Data Stream.",
                    "Text Mining from Site Invariant and Dependent Features for Information Extraction Knowledge Adaptation.",
                    "Constructing Time Decompositions for Analyzing Time-Stamped Documents.",
                    "Equivalence of Several Two-Stage Methods for Linear Discriminant Analysis.",
                    "A Framework for Discovering Co-Location Patterns in Data Sets with Extended Spatial Objects.",
                    "A Top-Down Method for Mining Most-Specific Frequent Patterns in Biological Sequences.",
                    "Using Support Vector Machines for Classifying Large Sets of Multi-Represented Objects.",
                    "Minimum Sum-Squared Residue Co-Clustering of Gene Expression Data.",
                    "Training Support Vector Machines Using Adaptive Clustering.",
                    "IREP++, A Faster Rule Learning Algorithm.",
                    "GenIc: A Single-Pass Generalized Incremental Algorithm for Clustering.",
                    "Conquest: A Distributed Tool for Constructing Summaries of High-Dimensional Discrete Attribute Data Sets.",
                    "Basic Association Rules.",
                    "Hierarchical Clustering for Thematic Browsing and Summarization of Large Sets of Association Rules.",
                    "Analytical Evaluation of Clustering Results Using Computational Negative Controls.",
                    "An Abstract Weighting Framework for Clustering Algorithms.",
                    "RBA: An Integrated Framework for Regression based on Association Rules.",
                    "Privacy-Preserving Multivariate Statistical Analysis: Linear Regression and Classification.",
                    "Clustering with Bregman Divergences.",
                    "Density-Connected Subspace Clustering for High-Dimensional Data.",
                    "Tesselation and Clustering by Mixture Models and Their Parallel Implementations.",
                    "Clustering Categorical Data Using the Correlated-Force Ensemble.",
                    "HICAP: Hierarchical Clustering with Pattern Preservation.",
                    "Enhancing Communities of Interest Using Bayesian Stochastic Blockmodels.",
                    "VEDAS: A Mobile and Distributed Data Stream Mining System for Real-Time Vehicle Monitoring.",
                    "DOMISA: DOM-Based Information Space Adsorption of Web Information Hierarchy Mining.",
                    "CREDOS: Classification Using Ripple Down Structure (A Case for Rare Classes).",
                    "Active Semi-Supervision for Pairwise Constrained Clustering.",
                    "Finding Frequent Patterns in a Large Sparse Graph.",
                    "A General Probabilistic Framework for Mining Labeled Ordered Trees.",
                    "Mixture Density Mercer Kernels: A Method to Learn Kernels Directly from Data.",
                    "A Mixture Model for Clustering Ensembles.",
                    "Visualizing RFM Segmentation.",
                    "Visually Mining through Cluster Hierarchies.",
                    "Class-Specific Ensembles for Active Learning.",
                    "Mining Text for Word Senses Using Independent Component Analysis.",
                    "A Kernel-Based Semi-Naïve Bayesian Classifier Using P-Trees.",
                    "BAMBOO: Accelerating Closed Itemset Mining by Deeply Pushing the Length-Decreasing Support Constraint.",
                    "A General Framework for Adaptive Anomaly Detection with Evolving Connectionist Systems.",
                    "R-MAT: A Recursive Model for Graph Mining.",
                    "Lazy Learning by Scanning Memory Image Lattice.",
                    "Text Mining Using Non-Negative Matrix Factorizations.",
                    "Active Mining of Data Streams.",
                    "Learning to Read Between the Lines: The Aspect Bernoulli Model.",
                    "Exploiting Hierarchical Domain Values in Classification Learning.",
                    "IFD: Iterative Feature and Data Clustering.",
                    "Adaptive Filtering for Efficient Record Linkage.",
                    "A Foundational Approach to Mining Itemset Utilities from Databases.",
                    "The Discovery of Generalized Causal Models with Mixed Variables Using MML Criterion.",
                    "Reservoir-Based Random Sampling with Replacement from Data Stream.",
                    "Principal Component Analysis and Effective K-Means Clustering.",
                    "Classifying Documents Without Labels.",
                    "Data Reduction in Support Vector Machines by a Kernelized Ionic Interaction Model.",
                    "Continuous-Time Bayesian Modeling of Clinical Data.",
                    "Subspace Clustering of High Dimensional Data.",
                    "Privacy Preserving Naïve Bayes Classifier for Vertically Partitioned Data.",
                    "Resource-Aware Mining with Variable Granularities in Data Streams.",
                    "Mining Patters of Activity from Video Data."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "3rd SDM 2003",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2003",
                "sub_name": "Proceedings of the Third SIAM International Conference on Data Mining, San Francisco, CA, USA, May 1-3, 2003.",
                "count": 42,
                "papers": [
                    "Decision Tree Classification of Spatial Data Patterns from Videokeratography using Zernicke Polynomials.",
                    "Feature Mining Paradigms for Scientific Data.",
                    "A Comparative Study of Anomaly Detection Schemes in Network Intrusion Detection.",
                    "Fast Online SVD Revisions for Lightweight Recommender Systems.",
                    "Finding Clusters of Different Sizes, Shapes, and Densities in Noisy, High Dimensional Data.",
                    "Hierarchical Document Clustering using Frequent Itemsets.",
                    "Scalable, Balanced Model-based Clustering.",
                    "A New Gravitational Clustering Algorithm.",
                    "Mining Changes of Classification by Correspondence Tracing.",
                    "Dynamic Classification of Online Customers.",
                    "Communication and Memory Efficient Parallel Decision Tree Construction.",
                    "ATLaS: A Native Extension of SQL for Data Mining.",
                    "Approximate Query Answering by Model Averaging.",
                    "On using Page Cooccurrences for Computing Clickstream Similarity.",
                    "CloSpan: Mining Closed Sequential Patterns in Large Datasets.",
                    "StarClass: Interactive Visual Classification using Star Coordinates.",
                    "Anytime Query-Tuned Kernel Machines via Cholesky Factorization.",
                    "Estimation of Topological Dimension.",
                    "Nonparametric Density Estimation: Toward Computational Tractability.",
                    "Generalized Sensitivity Analysis: A Framework for Evaluating Data Analysis Results.",
                    "STAMP: On Discovery of Statistically Important Pattern Repeats in Long Sequential Data.",
                    "Efficient Unsupervised Mining from Noisy Data Sets: Application to Clustering Co-occurrence Data.",
                    "Active Sampling: An Effective Approach to Feature Selection.",
                    "PageRank: HITS and a Unified Framework for Link Analysis.",
                    "The Application of Text Mining Software to Examine Coded Information.",
                    "Extracting Cyber Communities through Patterns.",
                    "On the Techniques for Data Clustering with Numerical Constraints.",
                    "The Analysis of Asthma and Exposure Data using Geographic Information Systems and Data Mining Information.",
                    "Detecting Periodicity in Nonideal Datasets.",
                    "Detection of Underrepresented Biological Sequences using Class-Conditional Distribution Models.",
                    "Learning Bayesian Network Structure from Distributed Data.",
                    "Mixture Models and Frequent Sets: Combining Global and Local Methods for 0-1 Data.",
                    "Field-Theoretic Methods for Intractable Probabilistic Models.",
                    "Data-Mining of a Large Virtual Community: Relationship between Users DB and the Web-Log File.",
                    "Cube Lattices: A Framework for Multidimensional Data Mining.",
                    "ApproxMAP: Approximate Mining of Consensus Sequential Patterns.",
                    "Mining Frequent Sequential Patterns under Regular Expressions: A Highly Adaptive Strategy for Pushing Contraints.",
                    "Sort-Merge Feature Selection for Video Data.",
                    "An Outlier-based Data Association Method for Linking Criminal Incidents.",
                    "CPAR: Classification based on Predictive Association Rules.",
                    "Mining Temporal Databases for Subsequence Patterns.",
                    "Using Low-Memory Representations to Cluster Very Large Data Sets."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "2nd SDM 2002",
        "info": "Arlington, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2002",
                "sub_name": "Proceedings of the Second SIAM International Conference on Data Mining, Arlington, VA, USA, April 11-13, 2002.",
                "count": 34,
                "papers": [
                    "Visualizing Clustering Results.",
                    "VizCluster: An Interactive Visualization Approach to Cluster Analysis and Its Application on Microarray Data.",
                    "Ensemble-based Adaptive Intrusion Detection.",
                    "Instance Selection Techniques for Memory-based Collaborative Filtering.",
                    "Shared Memory Paraellization of Data Mining Algorithms: Techniques, Programming Interface, and Performance.",
                    "A Data Parallel Approach for Large-Scale Gaussian Process Modeling.",
                    "Efficient Filtering of Large DatasetA User-Centric Paradigm.",
                    "Why the Information Explosion Can Be Bad for Data Mining, and How Data Fusion Provides a Way Out.",
                    "On the Optimal Clustering of Sequential Data.",
                    "Efficient Substructure Discovery from Large Semi-structured Data.",
                    "Discovering Frequent Substructures from Hierarchical Semi-structured Data.",
                    "Iterative Deepening Dynamic Time Warping for Time Series.",
                    "Extracting Precursor Rules from Time SeriesA Classical Statistical Viewpoint.",
                    "Autoregressive Tree Models for Time-Series Analysis.",
                    "Incremental Support Vector Machine Classification.",
                    "A Pattern Search Method for Model Selection of Support Vector Regression.",
                    "Explicit Thermodynamic Properties using Radial Basis Functions Neural Networks.",
                    "Cluster Selection in Divisive Clustering Algorithms.",
                    "A Clustering Technique for Mining Data from Text Tables.",
                    "On Scaling Up Balanced Clustering Algorithms.",
                    "Efficient Local Flexible Nearest Neighbor Classification.",
                    "Approximate Splitting for Ensembles of Trees using Histograms.",
                    "The Power of Second-Order Decision Tables.",
                    "Mining Relationship between Triggering and Consequential Events in a Short Transaction Database.",
                    "Learning Simple Relations: Theory and Applications.",
                    "A Framework for Scalable Cost-sensitive Learning Based on Combing Probabilities and Benefits.",
                    "CHARM: An Efficient Algorithm for Closed Itemset Mining.",
                    "Evaluating the Performance of Association Mining Methods in 3-D Medical Image Databases.",
                    "Mining Frequent Itemsets in Evolving Databases.",
                    "Discovering Fully Dependent Patterns.",
                    "One Step Evolutionary Mining of Context Sensitive Associations and Web Navigation Patterns.",
                    "MedMeSH Summarizer: Text Mining for Gene Clusters.",
                    "Segmented Regression Estimators for Massive Data Sets.",
                    "Collusion in the U. S. Crop Insurance Program: Applied Data Mining."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "1st SDM 2001",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sdm/2001",
                "sub_name": "Proceedings of the First SIAM International Conference on Data Mining, SDM 2001, Chicago, IL, USA, April 5-7, 2001.",
                "count": 29,
                "papers": [
                    "Derivative Dynamic Time Warping.",
                    "Decomposition of Event Sequences into Independent Components.",
                    "Finding similar situations in sequences of events via random projections.",
                    "Selective Markov Models for Predicting Web-Page Accesses.",
                    "On the performance of bisecting K-means and PDDP.",
                    "Generalized K-Harmonic Means - Dynamic Weighting of Data in Unsupervised Learning.",
                    "Adaptive Grids for Clustering Massive Data Sets.",
                    "Detecting Seasonal Trends and Cluster Motion Visualization for Very High Dimensional Transactional Data.",
                    "Improved Spatial-Temporal Forecasting through Modelling of Spatial Residuals in Recent History.",
                    "Methods for Large-Scale Mining of Networks of Human Genes.",
                    "Mining the Detector Responses of a Conducting Polymer Composite-Based Electronic Nose.",
                    "Looking for Nonlinearities in the Large Scale Dynamics of the Atmosphere.",
                    "RSVM: Reduced Support Vector Machines.",
                    "Boosting Localized Classifiers in Heterogeneous Databases.",
                    "Generating Classification Rules According to User's Existing Knowledge.",
                    "Information Theoretic Feature Crediting in Multiclass Support Vector Machines.",
                    "A Middleware for Developing Parallel Data Mining Applications.",
                    "Shared State for Client-Server Mining.",
                    "A Fourier Analysis Based Approach to Learning Decision Trees in a Distributed Environment.",
                    "Automatic Textual Document Categorization Using Multiple Similarity-Based Models.",
                    "Dimension reduction based on centroids and least squares for efficient processing of text data.",
                    "Hierarchical Classification of Real Life Documents.",
                    "Cheaper by the Dozen: Batched Algorithms.",
                    "Incremental Mining of Constrained Association Rules.",
                    "Using Simulated Pseudo Data To Speed Up Statistical Predictive Modeling From Massive Data Sets.",
                    "Mining Preferences from Spatial-Temporal Data.",
                    "Modeling Spatial Dependencies for Mining Geospatial Data.",
                    "Detecting Novel Network Intrusions Using Bayes Estimators.",
                    "PNrule: A New Framework for Learning Classifier Models in Data Mining (A Case-Study in Network Intrusion Detection)."
                ]
            }
        ]
    }
]