[
    {
        "year": "2021",
        "name": "33rd SSDBM 2021",
        "info": "Tampa, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2021",
                "sub_name": "SSDBM 2021: 33rd International Conference on Scientific and Statistical Database Management, Tampa, FL, USA, July 6-7, 2021.",
                "count": 33,
                "papers": [
                    "Unsupervised Anomaly Detection for Time Series with Outlier Exposure.",
                    "Accelerating Depth-First Traversal by Graph Ordering.",
                    "In-Database Machine Learning with SQL on GPUs.",
                    "Subarray Skyline Query Processing in Array Databases.",
                    "Caching Support for Range Query Processing on Bitmap Indices.",
                    "Bio-SODA: Enabling Natural Language Question Answering over Knowledge Graphs without Training Data.",
                    "MAMBO - Indexing Dead Space to Accelerate Spatial Queries✱.",
                    "Distributed Enumeration of Four Node Graphlets at Quadrillion-Scale.",
                    "HInT: Hybrid and Incremental Type Discovery for Large RDF Data Sources.",
                    "SDTA: An Algebra for Statistical Data Transformation.",
                    "NF-GNN: Network Flow Graph Neural Networks for Malware Detection and Classification.",
                    "Online Landmark-Based Batch Processing of Shortest Path Queries.",
                    "Truss Decomposition on Large Probabilistic Networks using H-Index.",
                    "NIR-Tree: A Non-Intersecting R-Tree.",
                    "Graph-based Strategy for Establishing Morphology Similarity.",
                    "Sub-trajectory Similarity Join with Obfuscation.",
                    "ArrayQL for Linear Algebra within Umbra.",
                    "Automatic View Selection in Graph Databases.",
                    "MASCARA-FPGA cooperation model: Query Trimming through accelerators.",
                    "Local Gaussian Process Model Inference Classification for Time Series Data.",
                    "Missing Data Patterns: From Theory to an Application in the Steel Industry.",
                    "Automatic Selection of Analytic Platforms with ASAP-DM.",
                    "DJEnsemble: a Cost-Based Selection and Allocation of a Disjoint Ensemble of Spatio-temporal Models.",
                    "Frequent Itemsets Mining with a Guaranteed Local Differential Privacy in Small Datasets.",
                    "MoParkeR : Multi-objective Parking Recommendation.",
                    "SCHeMa: Scheduling Scientific Containers on a Cluster of Heterogeneous Machines.",
                    "WBSum: Workload-based Summaries for RDF/S KBs.",
                    "On Lowering Merge Costs of an LSM Tree.",
                    "Practical Fully-Decentralized Secure Aggregation for Personal Data Management Systems.",
                    "MISE: An Array-Based Integrated System for Atmospheric Scanning LiDAR.",
                    "The Tensor-Relational Algebra, and Other Ideas in Machine Learning System Design.",
                    "What is special about spatial data science and Geo-AI?",
                    "Scalable Query Processing and Query Engines over Cloud Databases: Models, Paradigms, Techniques, Future Challenges."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "32nd SSDBM 2020",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2020",
                "sub_name": "SSDBM 2020: 32nd International Conference on Scientific and Statistical Database Management, Vienna, Austria, July 7-9, 2020.",
                "count": 32,
                "papers": [
                    "LRZ Convolution: An Algorithm for Automatic Anomaly Detection in Time-series Data.",
                    "Accessible Streaming Algorithms for the Chi-Square Test.",
                    "Efficient Search over Genomic Short Read Data.",
                    "Towards Co-Evolution of Data-Centric Ecosystems.",
                    "GeoPrune: Efficiently Matching Trips in Ride-sharing Through Geometric Properties.",
                    "Freedom for the SQL-Lambda: Just-in-Time-Compiling User-Injected Functions in PostgreSQL.",
                    "A Versatile Hypergraph Model for Document Collections.",
                    "Selectivity Estimation for Relation-Tree Joins.",
                    "Top-k String Similarity Joins.",
                    "Efficient Calculation of Empirical P-values for Association Testing of Binary Classifications.",
                    "STILT: Unifying Spatial, Temporal and Textual Search using a Generalized Multi-dimensional Index.",
                    "Node Classification and Link Prediction in Social Graphs using RLVECN.",
                    "Transit-based Task Assignment in Spatial Crowdsourcing.",
                    "Deluceva: Delta-Based Neural Network Inference for Fast Video Analytics.",
                    "Figure Captioning in Scholarly Literatures to Augment Search Results.",
                    "A Decomposition Approach for Risk-Averse Index Selection.",
                    "Orderings of Data - More Than a Tripping Hazard: Visionary.",
                    "Hurricane in Bipartite Graphs: The Lethal Nodes of Butterflies.",
                    "Unsupervised non-parametric change point detection in electrocardiography.",
                    "Improving geocoding quality via learning to integrate multiple geocoders.",
                    "Determining the provenance of land parcel polygons via machine learning.",
                    "Cohesive Subgraph Detection in Large Bipartite Networks.",
                    "An Algebraic Approach for High-level Text Analytics.",
                    "Vectorising k-Core Decomposition for GPU Acceleration.",
                    "Shared Execution Techniques for Business Data Analytics over Big Data Streams.",
                    "The Vantage Index: Executing Distance Queries at Scale.",
                    "DocDesign: Cost-Based Database Design for Document Stores.",
                    "WALLeSMART: Cloud Platform for Smart Farming.",
                    "Combining Two Worlds: MonetDB with Multi-Dimensional Index Structure Support to Efficiently Query Scientific Data.",
                    "We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomist.",
                    "Arrays in Databases: from Underdog to First-Class Citizen.",
                    "Multidimensional Clustering over Big Data: Models, Issues, Analysis, Emerging Trends."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "31st SSDBM 2019",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2019",
                "sub_name": "Proceedings of the 31st International Conference on Scientific and Statistical Database Management, SSDBM 2019, Santa Cruz, CA, USA, July 23-25, 2019.",
                "count": 27,
                "papers": [
                    "Minimizing Bias in Estimation of Mutual Information from Data Streams.",
                    "Monte Carlo Dependency Estimation.",
                    "Outlier Detection in Non-stationary Data Streams.",
                    "Dynamap: Schema Mapping Generation in the Wild.",
                    "Discovering Spatial High Utility Itemsets in Spatiotemporal Databases.",
                    "Efficient Incremental Cooccurrence Analysis for Item-Based Collaborative Filtering.",
                    "Maintaining Wavelet Synopses for Sliding-Window Aggregates.",
                    "An Efficient Graph Compressor Based on Adaptive Prefix Encoding.",
                    "Informative Summarization of Numeric Data.",
                    "Less Data Delivers Higher Search Effectiveness for Keyword Queries.",
                    "An Experimental Study of Context-Free Path Query Evaluation Methods.",
                    "Keep Your Host Language Object and Also Query it: A Case for SQL Query Support in RDBMS for Host Language Objects.",
                    "Accelerating array joining with integrated value-index.",
                    "A High-level User-oriented Framework for Database Evolution.",
                    "Versioning in Main-Memory Database Systems: From MusaeusDB to TardisDB.",
                    "LUCK- Linear Correlation Clustering Using Cluster Algorithms and a kNN based Distance Function.",
                    "Graph Ordering and Clustering: A Circular Approach.",
                    "Towards Generalizing Stochastic Spatiotemporal Graphs for Analyzing Least-Cost Path Stability.",
                    "REDS: Estimating the Performance of Error Detection Strategies Based on Dirtiness Profiles.",
                    "Deep Stacked Ensemble Recommender.",
                    "Terabyte-scale Particle Data Analysis: An ArrayUDF Case Study.",
                    "Improvement of SQL Recommendation on Scientific Database.",
                    "An Experimental Survey of Evaluation Strategies for Constellation Queries.",
                    "A New Polynomial-time Support Measure for Counting Frequent Patterns in Graphs.",
                    "SQUID: A Scalable System for Querying, Updating and Indexing Dynamic Graph Databases.",
                    "Detecting Global Periodic Correlated Clusters in Event Series based on Parameter Space Transform.",
                    "On systematic hyperparameter analysis through the example of subspace clustering."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "30th SSDBM 2018",
        "info": "Bozen-Bolzano, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2018",
                "sub_name": "Proceedings of the 30th International Conference on Scientific and Statistical Database Management, SSDBM 2018, Bozen-Bolzano, Italy, July 09-11, 2018.",
                "count": 33,
                "papers": [
                    "Metadata-driven error detection.",
                    "Towards meaningful distance-preserving encryption.",
                    "SBG-sketch: a self-balanced sketch for labeled-graph stream summarization.",
                    "Multidimensional range queries on modern hardware.",
                    "Massively-parallel break detection for satellite data.",
                    "Declarative cartography under fine-grained access control.",
                    "COMPASS: compact array storage with value index.",
                    "TIPP: parallel Delaunay triangulation for large-scale datasets.",
                    "Learning interesting attributes for automated data categorization.",
                    "Numerically stable parallel computation of (co-)variance.",
                    "A unified framework of density-based clustering for semi-supervised classification.",
                    "Finding shortest keyword covering routes in road networks.",
                    "ERMrest: a web service for collaborative data management.",
                    "Publishing spatial histograms under differential privacy.",
                    "GeoSparkViz: a scalable geospatial data visualization framework in the apache spark ecosystem.",
                    "Efficient anti-community detection in complex networks.",
                    "Selecting representative and diverse spatio-textual posts over sliding windows.",
                    "NoSingles: a space-efficient algorithm for influence maximization.",
                    "Order-independent constraint-based causal structure learning for gaussian distribution models using GPUs.",
                    "Feature-based comparison and generation of time series.",
                    "Point pattern search in big data.",
                    "Distributed caching for processing raw arrays.",
                    "GPU-based parallel indexing for concurrent spatial query processing.",
                    "Optimizer time estimation for SQL queries.",
                    "Scheduling data-intensive scientific workflows with reduced communication.",
                    "PARADISO: an interactive approach of parameter selection for the mean shift algorithm.",
                    "Towards an efficient and effective framework for the evolution of scientific databases.",
                    "Maximizing area-range sum for spatial shapes (MAxRS3).",
                    "PathGraph: querying and exploring big data graphs.",
                    "Crossing an OCEAN of queries: analyzing SQL query logs with OCEANLog.",
                    "In-database analytics with ibmdbpy.",
                    "Visual querying of large multilayer graphs.",
                    "Federated database system for scientific data."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "29th SSDBM 2017",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2017",
                "sub_name": "Proceedings of the 29th International Conference on Scientific and Statistical Database Management, Chicago, IL, USA, June 27-29, 2017.",
                "count": 42,
                "papers": [
                    "Managing Sensor Data Streams: Lessons Learned from the WeBike Project.",
                    "Incremental Discovery of Inclusion Dependencies.",
                    "Generating What-If Scenarios for Time Series Data.",
                    "Computing Influence of a Product through Uncertain Reverse Skyline.",
                    "FlatFIT: Accelerated Incremental Sliding-Window Aggregation For Real-Time Analytics.",
                    "A Benchmark for Betweenness Centrality Approximation Algorithms on Large Graphs.",
                    "Incremental Temporal Pattern Mining Using Efficient Batch-Free Stream Clustering.",
                    "Dot-Product Join: Scalable In-Database Linear Algebra for Big Model Analytics.",
                    "On-line Versioned Schema Inference for Large Semantic Web Data Sources.",
                    "Bi-Level Online Aggregation on Raw Data.",
                    "Data Series Similarity Using Correlation-Aware Measures.",
                    "Edge Labeling Schemes for Graph Data.",
                    "Class-based Conditional MaxRS Query in Spatial Data Streams.",
                    "Active Learning with Density-Initialized Decision Tree for Record Matching.",
                    "BLOCK: Efficient Execution of Spatial Range Queries in Main-Memory.",
                    "Multi-Hypothesis CSV Parsing.",
                    "Fast Equi-Join Algorithms on GPUs: Design and Implementation.",
                    "Query Suggestion to allow Intuitive Interactive Search in Multidimensional Time Series.",
                    "SHRec: Scalable Holistic Recommendation.",
                    "A Unified Correlation-based Approach to Sampling Over Joins.",
                    "Probabilistic k-Nearest Neighbor Monitoring of Moving Gaussians.",
                    "Measuring Fairness in Ranked Outputs.",
                    "How the Passengers Flow in Complex Metro Networks?",
                    "DualDB: An Efficient LSM-based Publish/Subscribe Storage System.",
                    "DistriPlan: An Optimized Join Execution Framework for Geo-Distributed Scientific Data.",
                    "Fides: Towards a Platform for Responsible Data Science.",
                    "Challenges of Differentially Private Release of Data Under an Open-world Assumption.",
                    "Mining Persistent and Discriminative Communities in Graph Ensembles.",
                    "High-Definition Digital Elevation Model System Vision Paper.",
                    "Discovering Partial Periodic Itemsets in Temporal Databases.",
                    "Detecting Global Hyperparaboloid Correlated Clusters Based on Hough Transform.",
                    "Tiling Strategies for Distributed Point Cloud Databases.",
                    "Computing Isochrones in Multimodal Spatial Networks using Tile Regions.",
                    "Location and Processing Aware Datacube Caching.",
                    "MELT: Mapreduce-based Efficient Large-scale Trajectory Anonymization.",
                    "PLI: Augmenting Live Databases with Custom Clustered Indexes.",
                    "Improving Statistical Similarity Based Data Reduction for Non-Stationary Data.",
                    "Dynamic Group Trip Planning Queries in Spatial Databases.",
                    "SGVCut: A Vertex-Cut Partitioning Tool for Random Walks-based Computations over Social Network graphs.",
                    "VISOR: Visualizing Summaries of Ordered Data.",
                    "Skluma: A Statistical Learning Pipeline for Taming Unkempt Data Repositories.",
                    "DataSynthesizer: Privacy-Preserving Synthetic Datasets."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "28th SSDBM 2016",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2016",
                "sub_name": "Proceedings of the 28th International Conference on Scientific and Statistical Database Management, SSDBM 2016, Budapest, Hungary, July 18-20, 2016.",
                "count": 28,
                "papers": [
                    "Efficient Feedback Collection for Pay-as-you-go Source Selection.",
                    "Functional Dependencies Unleashed for Scalable Data Exchange.",
                    "Graph-based modelling of query sets for differential privacy.",
                    "PAMPAS: Privacy-Aware Mobile Participatory Sensing Using Secure Probes.",
                    "Geometric Graph Indexing for Similarity Search in Scientific Databases.",
                    "Efficient Similarity Search across Top-k Lists under the Kendall's Tau Distance.",
                    "Monitoring Spatial Coverage of Trending Topics in Twitter.",
                    "SPOTHOT: Scalable Detection of Geo-spatial Events in Large Textual Streams.",
                    "Efficient Maintenance of All-Pairs Shortest Distances.",
                    "Bermuda: An Efficient MapReduce Triangle Listing Algorithm for Web-Scale Graphs.",
                    "PIEJoin: Towards Parallel Set Containment Joins.",
                    "Multi-Assignment Single Joins for Parallel Cross-Match of Astronomic Catalogs on Heterogeneous Clusters.",
                    "Regular Path Queries on Massive Graphs.",
                    "SolveDB: Integrating Optimization Problem Solvers Into SQL Databases.",
                    "Compact and queryable representation of raster datasets.",
                    "Vectorized UDFs in Column-Stores.",
                    "SPECTRA: Continuous Query Processing for RDF Graph Streams Over Sliding Windows.",
                    "Pruning Forests to Find the Trees.",
                    "Framework for real-time clustering over sliding windows.",
                    "Fast, Explainable View Detection to Characterize Exploration Queries.",
                    "Novel Data Reduction Based on Statistical Similarity.",
                    "Data Exchange with MapReduce: A First Cut.",
                    "Privacy or Security?: Take A Look And Then Decide.",
                    "SMS: Stable Matching Algorithm using Skylines.",
                    "Array Database Scalability: Intercontinental Queries on Petabyte Datasets.",
                    "Demonstrating KDBMS: A Knowledge-based Database Management System.",
                    "SciServer Compute: Bringing Analysis Close to the Data.",
                    "Selective Scan for Filter Operator of SciDB."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "27th SSDBM 2015",
        "info": "La Jolla, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2015",
                "sub_name": "Proceedings of the 27th International Conference on Scientific and Statistical Database Management, SSDBM '15, La Jolla, CA, USA, June 29 - July 1, 2015.",
                "count": 39,
                "papers": [
                    "Estimating mutual information on data streams.",
                    "A novel approach for approximate aggregations over arrays.",
                    "Probabilistic aggregate skyline join queries: skylines with aggregate operations over existentially uncertain relations.",
                    "A compression-based framework for the efficient analysis of business process logs.",
                    "On the internal evaluation of unsupervised outlier detection.",
                    "Top-k entity augmentation using consistent set covering.",
                    "Online template matching over a stream of digitized documents.",
                    "Distributed top-k query processing on multi-dimensional data with keywords.",
                    "OpenAlea: scientific workflows combining data analysis and simulation.",
                    "TarMiner: automatic extraction of miRNA targets from literature.",
                    "Top-k representative queries with binary constraints.",
                    "Optimizing continuous queries using update propagation with varying granularities.",
                    "Vertical partitioning for query processing over raw data.",
                    "DrillBeyond: processing multi-result open world SQL queries.",
                    "How to quantify the impact of lossy transformations on change detection.",
                    "RUBIK: efficient threshold queries on massive time series.",
                    "Indexing bi-temporal windows.",
                    "The hyperdyadic index and generalized indexing and query with PIQUE.",
                    "Transparent inclusion, utilization, and validation of main memory domain indexes.",
                    "RITA: an index-tuning advisor for replicated databases.",
                    "Aggregation and multidimensional analysis of big data for large-scale scientific applications: models, issues, analytics, and beyond.",
                    "Orthogonal mechanism for answering batch queries with differential privacy.",
                    "Extending database task schedulers for multi-threaded application code.",
                    "Privacy-preserving big data publishing.",
                    "Querying RDF data with text annotated graphs.",
                    "Relaxation of subgraph queries delivering empty results.",
                    "GRAPHITE: an extensible graph traversal framework for relational database management systems.",
                    "Efficient similarity search in scientific databases with feature signatures.",
                    "Improving performance of similarity measures for uncertain time series using preprocessing techniques.",
                    "Similarity search in fuzzy object databases.",
                    "FiND: a real-time filtering by novelty and diversity for publish/subscribe systems.",
                    "Data mining for isotopic mapping of bioarchaeological finds in a central european alpine passage.",
                    "Towards automated prediction of relationships among scientific datasets.",
                    "Compact distance histogram: a novel structure to boost k-nearest neighbor queries.",
                    "Ontology-assisted keyword search for NeuroML models.",
                    "SciCSM: novel contrast set mining over scientific datasets using bitmap indices.",
                    "Efficient iterative processing in the SciDB parallel array engine.",
                    "GEN: a database interface generator for HPC programs.",
                    "Batch matching of conjunctive triple patterns over linked data streams in the internet of things."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "26th SSDBM 2014",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2014",
                "sub_name": "Conference on Scientific and Statistical Database Management, SSDBM '14, Aalborg, Denmark, June 30 - July 02, 2014.",
                "count": 48,
                "papers": [
                    "Maintaining a microbial genome & metagenome data analysis system in an academic setting.",
                    "Efficient classification of billions of points into complex geographic regions using hierarchical triangular mesh.",
                    "Offline cleaning of RFID trajectory data.",
                    "Skew-resistant parallel in-memory spatial join.",
                    "Mining statistically sound co-location patterns at multiple distances.",
                    "Integrating non-spatial preferences into spatial location queries.",
                    "SAGA: array storage as a DB with support for structural aggregations.",
                    "Extending the SQL array concept to support scientific analytics.",
                    "SLACID - sparse linear algebra in a column-oriented in-memory database system.",
                    "Efficient data management and statistics with zero-copy integration.",
                    "Data perturbation for outlier detection ensembles.",
                    "A subspace filter supporting the discovery of small clusters in very noisy datasets.",
                    "DivIDE: efficient diversification for interactive data exploration.",
                    "Local context selection for outlier ranking in graphs with multiple numeric node attributes.",
                    "(k, d)-core anonymity: structural anonymization of massive networks.",
                    "Matching dominance: capture the semantics of dominance for multi-dimensional uncertain objects.",
                    "A provable algorithmic approach to product selection problems for market entry and sustainability.",
                    "Distributed data placement to minimize communication costs via graph partitioning.",
                    "SensorBench: benchmarking approaches to processing wireless sensor network data.",
                    "Managing evolving shapes in sensor networks.",
                    "Proactive adaptations in sensor network query processing.",
                    "Boosting the basic counting on distributed streams.",
                    "PStore: an efficient storage framework for managing scientific data.",
                    "Inverse predictions on continuous models in scientific databases.",
                    "Geometric graph matching and similarity: a probabilistic approach.",
                    "Schema matching over relations, attributes, and data values.",
                    "Helping scientists reconnect their datasets.",
                    "Detecting correlated columns in relational databases with mixed data types.",
                    "A case study in optimizing continuous queries using the magic update technique.",
                    "Node classification in uncertain graphs.",
                    "Point cloud databases.",
                    "Toward efficient and reliable genome analysis using main-memory database systems.",
                    "Efficient processing of exploratory top-k joins.",
                    "A study of partitioning and parallel UDF execution with the SAP HANA database.",
                    "Subspace anytime stream clustering.",
                    "Efficient temporal shortest path queries on evolving social graphs.",
                    "Data movement in hybrid analytic systems: a case for automation.",
                    "Protection of sensitive trajectory datasets through spatial and temporal exchange.",
                    "New approaches to storing and manipulating multi-dimensional sparse arrays.",
                    "Exploring subspace clustering for recommendations.",
                    "Data patterns to alleviate the design of scientific workflows exemplified by a bone simulation.",
                    "Communication-efficient preference top-k monitoring queries via subscriptions.",
                    "On efficiently generating realistic social media timeline structures.",
                    "DistillFlow: removing redundancy in scientific workflows.",
                    "MR-microT: a MapReduce-based MicroRNA target prediction method.",
                    "Integrating fault-tolerance and elasticity in a distributed data stream processing system.",
                    "Simulation workflow design tailor-made for scientists.",
                    "A system for efficient and simultaneous processing of moving K nearest neighbor and spatial keyword queries."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "25th SSDBM 2013",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2013",
                "sub_name": "Conference on Scientific and Statistical Database Management, SSDBM '13, Baltimore, MD, USA, July 29 - 31, 2013.",
                "count": 48,
                "papers": [
                    "Making sense of big data with the Berkeley data analytics stack.",
                    "Computational challenges in next-generation genomics.",
                    "Education and career paths for data scientists.",
                    "On the combination of relative clustering validity criteria.",
                    "Parameter-free and domain-independent similarity search with diversity.",
                    "A multidimensional data model with subcategories for flexibly capturing summarizability.",
                    "Nearest group queries.",
                    "Providing multi-scale consistency for multi-scale geospatial data.",
                    "Reasoning about RFID-tracked moving objects in symbolic indoor spaces.",
                    "Towards a universal tracking database.",
                    "GIPSY: joining spatial datasets with contrasting density.",
                    "Publishing trajectories with differential privacy guarantees.",
                    "Fast computation of approximate biased histograms on sliding windows over data streams.",
                    "Multi-scale dissemination of time series data.",
                    "Multi-query scheduling for time-critical data stream applications.",
                    "Learning uncertainty models from weather forecast performance databases using quantile regression.",
                    "Search and result presentation in scientific workflow repositories.",
                    "Tuning large scale deduplication with reduced effort.",
                    "HmSearch: an efficient hamming distance query processing algorithm.",
                    "pcApriori: scalable apriori for multiprocessor systems.",
                    "Shortlisting top-K assignments.",
                    "GPS: a graph processing system.",
                    "RMiCS: a robust approach for mining coherent subgraphs in edge-labeled multi-layer graphs.",
                    "SMIX: self-managing indexes for dynamic workloads.",
                    "Inverted indices for particle tracking in petascale cosmological simulations.",
                    "Accelerating gene context analysis using bitmaps.",
                    "The open connectome project data cluster: scalable analysis and vision for high-throughput neuroscience.",
                    "Real-time collaborative analysis with (almost) pure SQL: a case study in biogeochemical oceanography.",
                    "Optimizing fastquery performance on lustre file system.",
                    "Graywulf: a platform for federated scientific databases and services.",
                    "Learning to explore scientific workflow repositories.",
                    "Best of both worlds: relational databases and statistics.",
                    "Data management systems on GPUs: promises and challenges.",
                    "Nesting the earth mover's distance for effective cluster tracing.",
                    "Semantic query reformulation: the NIF experience.",
                    "Autonomous clustering for wireless sensor networks.",
                    "Forecasting in hierarchical environments.",
                    "Towards efficient discovery of coverage patterns in transactional databases.",
                    "Bulk sorted access for efficient top-k retrieval.",
                    "DoS: an efficient scheme for the diversification of multiple search results.",
                    "Research lattices: towards a scientific hypothesis data model.",
                    "Sharing confidential data for algorithm development by multiple imputation.",
                    "Mining multidimensional contextual outliers from categorical relational data.",
                    "A fast handshake join implementation on FPGA with adaptive merging network.",
                    "Adaptive exploration for large-scale protein analysis in the molecular dynamics database.",
                    "Parallel online aggregation in action.",
                    "Astronomical data processing in EXTASCID.",
                    "Data vaults: a database welcome to scientific file repositories."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "24th SSDBM 2012",
        "info": "Chania, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2012",
                "sub_name": "Scientific and Statistical Database Management - 24th International Conference, SSDBM 2012, Chania, Crete, Greece, June 25-27, 2012. Proceedings.",
                "count": 51,
                "papers": [
                    "Navigating Oceans of Data.",
                    "Probabilistic Range Monitoring of Streaming Uncertain Positions in GeoSocial Networks.",
                    "Probabilistic Frequent Pattern Growth for Itemset Mining in Uncertain Databases.",
                    "Evaluating Trajectory Queries over Imprecise Location Data.",
                    "Efficient Range Queries over Uncertain Strings.",
                    "Continuous Probabilistic Sum Queries in Wireless Sensor Networks with Ranges.",
                    "Partitioning and Multi-core Parallelization of Multi-equation Forecast Models.",
                    "Integrating GPU-Accelerated Sequence Alignment and SNP Detection for Genome Resequencing Analysis.",
                    "Discovering Representative Skyline Points over Distributed Data.",
                    "SkyQuery: An Implementation of a Parallel Probabilistic Join Engine for Cross-Identification of Multiple Astronomical Databases.",
                    "Efficient Filtering in Micro-blogging Systems: We Won't Get Flooded Again.",
                    "Regular Path Queries on Large Graphs.",
                    "Sampling Connected Induced Subgraphs Uniformly at Random.",
                    "Discovery of Top-k Dense Subgraphs in Dynamic Graph Collections.",
                    "On the Efficiency of Estimating Penetrating Rank on Large Graphs.",
                    "Towards Efficient Join Processing over Large RDF Graph Using MapReduce.",
                    "Panel on \"Data Infrastructures and Data Management Research: Close Relatives or Total Strangers?\".",
                    "Efficient Similarity Search in Very Large String Sets.",
                    "Substructure Clustering: A Novel Mining Paradigm for Arbitrary Data Types.",
                    "BT* - An Advanced Algorithm for Anytime Classification.",
                    "Finding the Largest Empty Rectangle Containing Only a Query Point in Large Multidimensional Databases.",
                    "Sensitivity of Self-tuning Histograms: Query Order Affecting Accuracy and Robustness.",
                    "Database Support for Exploring Scientific Workflow Provenance Graphs.",
                    "(Re)Use in Public Scientific Workflow Repositories.",
                    "Aggregating and Disaggregating Flexibility Objects.",
                    "Fine-Grained Provenance Inference for a Large Processing Chain with Non-materialized Intermediate Views.",
                    "Automatic Conflict Resolution in a CDSS.",
                    "Tracking Distributed Aggregates over Time-Based Sliding Windows.",
                    "Hinging Hyperplane Models for Multiple Predicted Variables.",
                    "Optimizing Notifications of Subscription-Based Forecast Queries.",
                    "Minimizing Index Size by Reordering Rows and Columns.",
                    "Data Vaults: A Symbiosis between Database Technology and Scientific File Repositories.",
                    "Usage Data in Web Search: Benefits and Limitations.",
                    "Functional Feature Extraction and Chemical Retrieval.",
                    "Scalable Computation of Isochrones with Network Expiration.",
                    "A Dataflow Graph Transformation Language and Query Rewriting System for RDF Ontologies.",
                    "Sensitive Label Privacy Protection on Social Network Data.",
                    "Trading Privacy for Information Loss in the Blink of an Eye.",
                    "Extracting Hot Spots from Satellite Data.",
                    "A Framework for Enabling Query Rewrites when Analyzing Workflow Records.",
                    "Towards Enabling Outlier Detection in Large, High Dimensional Data Warehouses.",
                    "Multiplexing Trajectories of Moving Objects.",
                    "On Optimizing Workflows Using Query Processing Techniques.",
                    "Optimizing Flows for Real Time Operations Management.",
                    "(In?)Extricable Links between Data and Visualization: Preliminary Results from the VISTAS Project.",
                    "FireWatch: G.I.S.-Assisted Wireless Sensor Networks for Forest Fires.",
                    "AIMS: A Tool for the View-Based Analysis of Streams of Flight Data.",
                    "TARCLOUD: A Cloud-Based Platform to Support miRNA Target Prediction.",
                    "SALSA: A Software System for Data Management and Analytics in Field Spectrometry.",
                    "Incremental DNA Sequence Analysis in the Cloud.",
                    "AITION: A Scalable Platform for Interactive Data Mining."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "23rd SSDBM 2011",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2011",
                "sub_name": "Scientific and Statistical Database Management - 23rd International Conference, SSDBM 2011, Portland, OR, USA, July 20-22, 2011. Proceedings.",
                "count": 53,
                "papers": [
                    "The Architecture of SciDB.",
                    "Location-Based Instant Search.",
                    "Continuous Inverse Ranking Queries in Uncertain Streams.",
                    "Finding Haystacks with Needles: Ranked Search for Data Using Geospatial and Temporal Characteristics.",
                    "Using Medians to Generate Consensus Rankings for Biological Data.",
                    "A Truly Dynamic Data Structure for Top-k Queries on Uncertain Data.",
                    "Efficient Storage and Temporal Query Evaluation in Hierarchical Data Archiving Systems.",
                    "Update Propagation in a Streaming Warehouse.",
                    "Efficient Processing of Multiple DTW Queries in Time Series Databases.",
                    "Probabilistic Time Consistent Queries over Moving Objects.",
                    "Knowledge Annotations in Scientific Workflows: An Implementation in Kepler.",
                    "Improving Workflow Fault Tolerance through Provenance-Based Recovery.",
                    "ProPub: Towards a Declarative Approach for Publishing Customized, Policy-Aware Provenance.",
                    "Provenance-Enabled Automatic Data Publishing.",
                    "A Panel Discussion on Data Intensive Science: Moving towards Solutions.",
                    "Querying Shortest Path Distance with Bounded Errors in Large Graphs.",
                    "PG-Join: Proximity Graph Based String Similarity Joins.",
                    "A Flexible Graph Pattern Matching Framework via Indexing.",
                    "Subgraph Search over Massive Disk Resident Graphs.",
                    "BR-Index: An Indexing Structure for Subgraph Matching in Very Large Dynamic Graphs.",
                    "CloudVista: Visual Cluster Exploration for Extreme Scale Data in the Cloud.",
                    "Efficient Selectivity Estimation by Histogram Construction Based on Subspace Clustering.",
                    "Finding Closed MEMOs.",
                    "Density Based Subspace Clustering over Dynamic Data.",
                    "Hierarchical Clustering for Real-Time Stream Data with Noise.",
                    "Energy Proportionality and Performance in Data Parallel Computing Clusters.",
                    "Privacy Preserving Group Linkage.",
                    "Dynamic Anonymization for Marginal Publication.",
                    "Pantheon: Exascale File System Search for Scientific Computing.",
                    "Massive-Scale RDF Processing Using Compressed Bitmap Indexes.",
                    "Database-as-a-Service for Long-Tail Science.",
                    "Data Scientists, Data Management and Data Policy.",
                    "Context-Aware Parameter Estimation for Forecast Models in the Energy Domain.",
                    "Implementing a General Spatial Indexing Library for Relational Databases of Large Numerical Simulations.",
                    "Histogram and Other Aggregate Queries in Wireless Sensor Networks.",
                    "Efficient In-Database Maintenance of ARIMA Models.",
                    "Recipes for Baking Black Forest Databases - Building and Querying Black Hole Merger Trees from Cosmological Simulations.",
                    "CrowdLabs: Social Analysis and Visualization for the Sciences.",
                    "Heidi Visualization of R-tree Structures over High Dimensional Data.",
                    "Towards Efficient and Precise Queries over Ten Million Asteroid Trajectory Models.",
                    "Keyword Search Support for Automating Scientific Workflow Composition.",
                    "FastQuery: A General Indexing and Querying System for Scientific Data.",
                    "Retrieving Accurate Estimates to OLAP Queries over Uncertain and Imprecise Multidimensional Data Streams.",
                    "Hybrid Data-Flow Graphs for Procedural Domain-Specific Query Languages.",
                    "Scalable and Automated Workflow in Mining Large-Scale Severe-Storm Simulations.",
                    "Accurate Cost Estimation Using Distribution-Based Cardinality Estimates for Multi-dimensional Queries.",
                    "Session-Based Browsing for More Effective Query Reuse.",
                    "The ETLMR MapReduce-Based ETL Framework.",
                    "Top-k Similarity Search on Uncertain Trajectories.",
                    "Fast and Accurate Trajectory Streams Clustering.",
                    "Data-Driven Multidimensional Design for OLAP.",
                    "An Adaptive Outlier Detection Technique for Data Streams.",
                    "Power-Aware DBMS: Potential and Challenges."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "22nd SSDBM 2010",
        "info": "Heidelberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2010",
                "sub_name": "Scientific and Statistical Database Management, 22nd International Conference, SSDBM 2010, Heidelberg, Germany, June 30 - July 2, 2010. Proceedings.",
                "count": 43,
                "papers": [
                    "Tradeoffs between Parallel Database Systems, Hadoop, and HadoopDB as Platforms for Petabyte-Scale Analysis.",
                    "Emerging Trends and Converging Technologies in Data Intensive Scalable Computing.",
                    "Deriving Spatio-temporal Query Results in Sensor Networks.",
                    "Efficient and Adaptive Distributed Skyline Computation.",
                    "On the Efficient Construction of Multislices from Recurrences.",
                    "Optimizing Query Processing in Cache-Aware Wireless Sensor Networks.",
                    "Approximate Query Answering and Result Refinement on XML Data.",
                    "Efficient and Scalable Method for Processing Top-k Spatial Boolean Queries.",
                    "A Framework for Moving Sensor Data Query and Retrieval of Dynamic Atmospheric Events.",
                    "Client + Cloud: Evaluating Seamless Architectures for Visual Data Analytics in the Ocean Sciences.",
                    "Scalable Clustering Algorithm for N-Body Simulations in a Shared-Nothing Cluster.",
                    "Database Design for High-Resolution LIDAR Topography Data.",
                    "PetaScope: An Open-Source Implementation of the OGC WCS Geo Service Standards Suite.",
                    "Towards Archaeo-informatics: Scientific Data Management for Archaeobiology.",
                    "DESSIN: Mining Dense Subgraph Patterns in a Single Graph.",
                    "Discovery of Evolving Convoys.",
                    "Finding Top-k Similar Pairs of Objects Annotated with Terms from an Ontology.",
                    "Identifying the Most Influential User Preference from an Assorted Collection.",
                    "MC-Tree: Improving Bayesian Anytime Classification.",
                    "Non-intrusive Quality Analysis of Monitoring Data.",
                    "Visual Decision Support for Ensemble Clustering.",
                    "An Indexing Scheme for Fast and Accurate Chemical Fingerprint Database Searching.",
                    "BEMC: A Searchable, Compressed Representation for Large Seismic Wavefields.",
                    "Dynamic Data Reorganization for Energy Savings in Disk Storage Systems.",
                    "Organization of Data in Non-convex Spatial Domains.",
                    "PrefIndex: An Efficient Supergraph Containment Search Technique.",
                    "Supporting Web-Based Visual Exploration of Large-Scale Raster Geospatial Data Using Binned Min-Max Quadtree.",
                    "Bridging Workflow and Data Provenance Using Strong Links.",
                    "LIVE: A Lineage-Supported Versioned DBMS.",
                    "Optimizing Resource Allocation for Scientific Workflows Using Advance Reservations.",
                    "A Fault-Tolerance Architecture for Kepler-Based Distributed Scientific Workflows.",
                    "Provenance Context Entity (PaCE): Scalable Provenance Tracking for Scientific RDF Data.",
                    "Taverna, Reloaded.",
                    "Can Shared-Neighbor Distances Defeat the Curse of Dimensionality?",
                    "Optimizing All-Nearest-Neighbor Queries with Trigonometric Pruning.",
                    "Prefix Tree Indexing for Similarity Search and Similarity Joins on Genomic Data.",
                    "Similarity Estimation Using Bayes Ensembles.",
                    "Subspace Similarity Search: Efficient k-NN Queries in Arbitrary Subspaces.",
                    "Continuous Skyline Monitoring over Distributed Data Streams.",
                    "Propagation of Densities of Streaming Data within Query Graphs.",
                    "Spatio-temporal Event Stream Processing in Multimedia Communication Systems.",
                    "Stratified Reservoir Sampling over Heterogeneous Data Streams.",
                    "Tree Induction over Perennial Objects."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "21st SSDBM 2009",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2009",
                "sub_name": "Scientific and Statistical Database Management, 21st International Conference, SSDBM 2009, New Orleans, LA, USA, June 2-4, 2009, Proceedings.",
                "count": 44,
                "papers": [
                    "The Scientific Data Management Center: Providing Technologies for Large Scale Scientific Exploration.",
                    "Query Recommendations for Interactive Database Exploration.",
                    "Scientific Mashups: Runtime-Configurable Data Product Ensembles.",
                    "View Discovery in OLAP Databases through Statistical Combinatorial Optimization.",
                    "Designing a Geo-scientific Request Language - A Database Approach.",
                    "SEEDEEP: A System for Exploring and Querying Scientific Deep Web Data Sources.",
                    "Expressing OLAP Preferences.",
                    "Energy Smart Management of Scientific Data.",
                    "Data Parallel Bin-Based Indexing for Answering Queries on Multi-core Architectures.",
                    "Finding Regions of Interest in Large Scientific Datasets.",
                    "Adaptive Physical Design for Curated Archives.",
                    "MLR-Index: An Index Structure for Fast and Scalable Similarity Search in High Dimensions.",
                    "B-Fabric: An Open Source Life Sciences Data Management System.",
                    "Design and Implementation of Metadata System in PetaShare.",
                    "Covariant Evolutionary Event Analysis for Base Interaction Prediction Using a Relational Database Management System for RNA.",
                    "What Makes Scientific Workflows Scientific?.",
                    "Enabling Ad Hoc Queries over Low-Level Scientific Data Sets.",
                    "Exploring Scientific Workflow Provenance Using Hybrid Queries over Nested Data and Lineage Graphs.",
                    "Data Integration with the DaltOn Framework - A Case Study.",
                    "Experiment Line: Software Reuse in Scientific Workflows.",
                    "Tracking Files in the Kepler Provenance Framework.",
                    "BioBrowsing: Making the Most of the Data Available in Entrez.",
                    "Using Workflow Medleys to Streamline Exploratory Tasks.",
                    "Experiences on Processing Spatial Data with MapReduce.",
                    "Optimization and Execution of Complex Scientific Queries over Uncorrelated Experimental Data.",
                    "Comprehensive Optimization of Declarative Sensor Network Queries.",
                    "Efficient Evaluation of Generalized Tree-Pattern Queries with Same-Path Constraints.",
                    "Mode Aware Stream Query Processing.",
                    "Evaluating Reachability Queries over Path Collections.",
                    "Easing the Dimensionality Curse by Stretching Metric Spaces.",
                    "Probabilistic Similarity Search for Uncertain Time Series.",
                    "Reverse k-Nearest Neighbor Search Based on Aggregate Point Access Methods.",
                    "Finding Structural Similarity in Time Series Data Using Bag-of-Patterns Representation.",
                    "Cloud Computing for Science.",
                    "Classification with Unknown Classes.",
                    "HSM: Heterogeneous Subspace Mining in High Dimensional Data.",
                    "Split-Order Distance for Clustering and Classification Hierarchies.",
                    "Combining Multiple Interrelated Streams for Incremental Clustering.",
                    "Improving Relation Extraction by Exploiting Properties of the Target Relation.",
                    "Cor-Split: Defending Privacy in Data Re-publication from Historical Correlations and Compromised Tuples.",
                    "A Bipartite Graph Framework for Summarizing High-Dimensional Binary, Categorical and Numeric Data.",
                    "Region Extraction and Verification for Spatial and Spatio-temporal Databases.",
                    "Identifying the Most Endangered Objects from Spatial Datasets.",
                    "Constraint-Based Learning of Distance Functions for Object Trajectories."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "20th SSDBM 2008",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2008",
                "sub_name": "Scientific and Statistical Database Management, 20th International Conference, SSDBM 2008, Hong Kong, China, July 9-11, 2008, Proceedings.",
                "count": 46,
                "papers": [
                    "New Challenges in Petascale Scientific Databases.",
                    "Adventures in the Blogosphere.",
                    "The Evolution of Vertical Database Architectures - A Historical Review (Keynote Talk).",
                    "Linked Bernoulli Synopses: Sampling along Foreign Keys.",
                    "Query Planning for Searching Inter-dependent Deep-Web Databases.",
                    "Summarizing Two-Dimensional Data with Skyline-Based Statistical Descriptors.",
                    "Query Selectivity Estimation for Uncertain Data.",
                    "Disclosure Risks of Distance Preserving Data Transformations.",
                    "Privacy-Preserving Publication of User Locations in the Proximity of Sensitive Sites.",
                    "A Probabilistic Framework for Building Privacy-Preserving Synopses of Multi-dimensional Data.",
                    "Efficient Similarity Search for Tree-Structured Data.",
                    "Hierarchical Graph Embedding for Efficient Query Processing in Very Large Traffic Networks.",
                    "Monitoring Aggregate k-NN Objects in Road Networks.",
                    "RAM: Randomized Approximate Graph Mining.",
                    "Finding Frequent Items over General Update Streams.",
                    "Efficiently Discovering Recent Frequent Items in Data Streams.",
                    "Prioritized Evaluation of Continuous Moving Queries over Streaming Locations.",
                    "A Comparative Evaluation of XML Difference Algorithms with Genomic Data.",
                    "Adaptive Request Scheduling for Parallel Scientific Web Services.",
                    "ViP: A User-Centric View-Based Annotation Framework for Scientific Data.",
                    "Ontology Database: A New Method for Semantic Modeling and an Application to Brainwave Data.",
                    "The hB-pi* Tree: An Optimized Comprehensive Access Method for Frequent-Update Multi-dimensional Point Data.",
                    "Breaking the Curse of Cardinality on Bitmap Indexes.",
                    "A New Approach for Optimization of Dynamic Metric Access Methods Using an Algorithm of Effective Deletion.",
                    "An Ontology-Based Index to Retrieve Documents with Geographic Information.",
                    "Mining Temporal Association Patterns under a Similarity Constraint.",
                    "A General Framework for Increasing the Robustness of PCA-Based Correlation Clustering Algorithms.",
                    "Searching Correlated Objects in a Long Sequence.",
                    "Caching Dynamic Skyline Queries.",
                    "Plot Query Processing with Wavelets.",
                    "Quality-Aware Probing of Uncertain Data with Resource Constraints.",
                    "Efficient Computation of Statistical Significance of Query Results in Databases.",
                    "Analysis of Basic Data Reordering Techniques.",
                    "Kriging for Localized Spatial Interpolation in Sensor Networks.",
                    "Scalable Ubiquitous Data Access in Clustered Sensor Networks.",
                    "iJoin: Importance-Aware Join Approximation over Data Streams.",
                    "Efficient Continuous K-Nearest Neighbor Query Processing over Moving Objects with Uncertain Speed and Direction.",
                    "ProUD: Probabilistic Ranking in Uncertain Databases.",
                    "Flexible Scientific Workflow Modeling Using Frames, Templates, and Dynamic Embedding.",
                    "Examining Statistics of Workflow Evolution Provenance: A First Study.",
                    "ELKI: A Software System for Evaluation of Subspace Clustering Algorithms.",
                    "IVIP - A Scientific Workflow System to Support Experts in Spatial Planning of Crop Production.",
                    "A FUSE-Based Tool for Accessing Meteorological Data in Remote Servers.",
                    "IndeGSRI: Efficient View-Dependent Ranking in CFD Post- processing Queries with RDBMS.",
                    "Real-Time Integration of Geospatial Raster and Point Data Streams.",
                    "IRMA: An Image Registration Meta-algorithm."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "19th SSDBM 2007",
        "info": "Banff, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2007",
                "sub_name": "19th International Conference on Scientific and Statistical Database Management, SSDBM 2007, 9-11 July 2007, Banff, Canada, Proceedings.",
                "count": 36,
                "papers": [
                    "Cost-based Optimization of Complex Scientific Queries.",
                    "What Constitutes a Scientific Database?",
                    "Efficient Evaluation of Inbreeding Queries on Pedigree Data.",
                    "Managing Scientific Data: New Challenges for Database Research.",
                    "Maintaining K-Anonymity against Incremental Updates.",
                    "MAMCost: Global and Local Estimates leading to Robust Cost Estimation of Similarity Queries.",
                    "On Exploring Complex Relationships of Correlation Clusters.",
                    "Component-based Data Layout for Efficient Slicing of Very Large Multidimensional Volumetric Data.",
                    "Information-Aware 2n-Tree for Efficient Out-of-Core Indexing of Very Large Multidimensional Volumetric Data.",
                    "Boosting k-Nearest Neighbor Queries Estimating Suitable Query Radii.",
                    "Efficient Approximation of Spatial Network Queries using the M-Tree with Road Network Embedding.",
                    "On Efficient Processing of Subspace Skyline Queries on High Dimensional Data.",
                    "MonetDB/SQL Meets SkyServer: the Challenges of a Scientific Database.",
                    "CSR+-tree: Cache-conscious Indexing for High-dimensional Similarity Search.",
                    "Update Conscious Bitmap Indices.",
                    "Processing Spatial-Keyword (SK) Queries in Geographic Information Retrieval (GIR) Systems.",
                    "Some Challenges in Integrating Information on Protein Interactions and a Partial Solution.",
                    "Duplicate Elimination in Space-partitioning Tree Indexes.",
                    "Incorporating Uncertainty Metrics into a General-Purpose Data Integration System.",
                    "Database Support for Weighted Match Joins.",
                    "Window-Oblivious Join: A Data-Driven Memory Management Scheme for Stream Join.",
                    "Adaptive-Size Reservoir Sampling over Data Streams.",
                    "Reservoir Sampling over Memory-Limited Stream Joins.",
                    "Sensor Scheduling for Aggregate Monitoring inWireless Sensor Networks.",
                    "Retrieval of Spatial Join Pattern Instances from Sensor Networks.",
                    "Reliable Hierarchical Data Storage in Sensor Networks.",
                    "A Distributed Algorithm for Joins in Sensor Networks.",
                    "Enabling Real-Time Querying of Live and Historical Stream Data.",
                    "A Fast Algorithm for Approximate Quantiles in High Speed Data Streams.",
                    "Effective Summarization of Multi-Dimensional Data Streams for Historical Stream Mining.",
                    "Mining RNA Tertiary Motifs with Structure Graphs.",
                    "An Efficient Algorithm for Mining Coherent Patterns from Heterogeneous Microarrays.",
                    "Gene Ontology-Based Annotation Analysis and Categorization of Metabolic Pathways.",
                    "Efficient Indexing of Heterogeneous Data Streams with Automatic Performance Configurations.",
                    "Adaptive Wavelet Density Estimators over Data Streams.",
                    "iSEE: Efficient Continuous K-Nearest-Neighbor Monitoring over Moving Objects."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "18th SSDBM 2006",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2006",
                "sub_name": "18th International Conference on Scientific and Statistical Database Management, SSDBM 2006, 3-5 July 2006, Vienna, Austria, Proceedings.",
                "count": 45,
                "papers": [
                    "Containment of Partially Specified Tree-Pattern Queries.",
                    "InterJoin: Exploiting Indexes and Materialized Views in XPath Evaluation.",
                    "The Holodex: Integrating Summarization with the Index.",
                    "Minimizing I/O Costs of Multi-Dimensional Queries with Bitmap Indices.",
                    "Data Management in Production Grids - Challenges and Techniques.",
                    "Data-Preservation in Scientific Workflow Middleware.",
                    "Efficient Data Harvesting for Tracing Phenomena in Sensor Networks.",
                    "A Framework for Querying Pedigree Data.",
                    "Task-Oriented Integrated Use of Biological Web Data Sources.",
                    "Scalability Management in Sensor-Network PhenomenaBases.",
                    "The GOBASE: an information management system for Gene Ontology.",
                    "A Demonstration of the SciFlo Grid Workflow Engine.",
                    "Mining Frequent 3D Sequential Patterns.",
                    "Mining Hierarchies of Correlation Clusters.",
                    "PhyloMiner: A Tool for Evolutionary Data Analysis.",
                    "On Data and Visualization Models for Signaling Pathways.",
                    "SQL.CT: Providing Data Management for Visual Exploration of CT Datasets.",
                    "HDF5-FastQuery: Accelerating Complex Queries on HDF Datasets using Fast Bitmap Indices.",
                    "Materialized Views in the Presence of Reporting Functions.",
                    "Probabilistic Ranking Queries on Gaussians.",
                    "Efficient Storage Allocation of Large-Scale Extendible Multi-dimensional Scientific Datasets.",
                    "Efficient Query Processing in Arbitrary Subspaces Using Vector Approximations.",
                    "Reusable Tools for Metadata Management - Pie in the Sky?",
                    "How to cite curated databases and how to make them citable.",
                    "Provenance and Reliability: Managing Metadata for Statistical Models.",
                    "Semantic Map of Services for Structural Bioinformatics.",
                    "BioFacets: Faceted Classification for Biological Information.",
                    "Edits - Data Cleansing at the Data Entry to assert semantic Consistency of metric Data.",
                    "Efficient Methods on Predictions for Similarity Search over Stream Time Series.",
                    "Time Series Analysis Using the Concept of Adaptable Threshold Similarity.",
                    "Exploring Data Streams with Nonparametric Estimators.",
                    "Indexing Time-Evolving Data With Variable Lifetimes.",
                    "Sampling Trajectory Streams with Spatiotemporal Criteria.",
                    "An Extensible Infrastructure for Processing Distributed Geospatial Data Streams.",
                    "The Composite OLAP-Object Data Model: Removing an Unnecessary Barrier.",
                    "Accuracy Control in Compressed Multidimensional Data Cubes for Quality of Answer-based OLAP Tools.",
                    "Optimistic Coarse-Grained Cache Semantics for Data Marts.",
                    "A Disc-based Approach to Data Summarization and Privacy Preservation.",
                    "On-line Aggregation and Filtering of Pattern-based Queries.",
                    "ACache: Using Caching to Improve the Performance of Multiple Sequence Alignments.",
                    "Progressive Spatial Join.",
                    "A Dynamic Mobility Histogram Construction Method Based on Markov Chains.",
                    "Dynamic Travel Time Maps - Enabling Efficient Navigation.",
                    "Addressing the Need for Map-Matching Speed: Localizing Globalb Curve-Matching Algorithms.",
                    "Inferences on Kernel Density Estimates by Solving Nonlinear Systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "17th SSDBM 2005",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2005",
                "sub_name": "17th International Conference on Scientific and Statistical Database Management, SSDBM 2005, 27-29 June 2005, University of California, Santa Barbara, CA, USA, Proceedings.",
                "count": 38,
                "papers": [
                    "Retrofitting a Data Model to Existing Environmental Data.",
                    "An Information Theoretic Model for Database Alignment.",
                    "U.S. Air Force Weather Database and XML Web Services Implementation.",
                    "Creating and Providing Data Management Services for the Biological and Ecological Sciences: Science Environment for Ecological Knowledge.",
                    "DEX: Increasing the Capability of Scientific Data Analysis Pipelines by Using Efficient Bitmap Indices to Accelerate Scientific Visualization.",
                    "Iteration Aware Prefetching for Large Multidimensional Datasets.",
                    "WebGD Framework and WebGD-GEN Application Generator.",
                    "A Robust, Low-Cost Virtual Archive for Science Data.",
                    "Efficient Scheduling and Execution of Scientific Workflow Tasks.",
                    "Incorporating Semantics in Scientific Workflow Authoring.",
                    "Loose Coupling of Distributed Data and Models through Web Services.",
                    "GENESIS SciFlo: Scientific Knowledge Creation on the Grid using a Semantically-Enabled Dataflow Execution Environment.",
                    "A Scientific Workflow Approach to Distributed Geospatial Data Processing using Web Services.",
                    "Efficiently Supporting Structure Queries on Phylogenetic Trees.",
                    "Co-Scheduling of Computation and Data on Computer Clusters.",
                    "Scientific Models Management in Computational Grids.",
                    "Lineage Path Integration for Phylogenetic Resources.",
                    "Source-aware Join Strategies of Sensor Data Streams.",
                    "Using Linear Models to Monitor the Physical World with Sensors.",
                    "Optimizing In-Order Execution of Continuous Queries over Streamed Sensor Data.",
                    "Querying Streaming Geospatial Image Data: The GeoStreams Project.",
                    "Clustering Moving Objects via Medoid Clusterings.",
                    "Detection and Tracking of Discrete Phenomena in Sensor-Network Databases.",
                    "A Query Language for Moving Object Trajectories.",
                    "Mining Most General Multidimensional Summarization of Probably Groups in Data Warehouses.",
                    "Optimizing Multiple Top-K Queries over Joins.",
                    "Integrating Heterogeneous Multidimensional Databases.",
                    "Using Multi-Scale Histograms to Answer Pattern Existence and Shape Match Queries.",
                    "Searching for Related Objects in Relational Databases.",
                    "Assumption-Free Anomaly Detection in Time Series.",
                    "A Fast Approximation Scheme for Probabilistic Wavelet Synopses.",
                    "The \"Best K\" for Entropy-based Categorical Data Clustering.",
                    "Local Computation of Answers to Table Queries on Summary Databases.",
                    "Probabilistic Data Modeling and Querying for Location-Based Data Warehouses.",
                    "Material Science Image Content Querying: A SQL Integrated Map Algebra Approach.",
                    "Fuzzy Decomposition of Spatially Extended Objects.",
                    "Spatial Search of Orbital Swath Data.",
                    "NSF Long Term Ecological Research Sites - Praxis et Theoria."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "16th SSDBM 2004",
        "info": "Santorini Island, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2004",
                "sub_name": "Proceedings of the 16th International Conference on Scientific and Statistical Database Management (SSDBM 2004), 21-23 June 2004, Santorini Island, Greece.",
                "count": 66,
                "papers": [
                    "Where the Rubber Meets the Sky: The Semantic Gap between Data Producers and Data Consumers.",
                    "The Two Cultures of Digital Curation.",
                    "HybridTreeMiner: An Efficient Algorithm for Mining Frequent Rooted Trees and Free Trees Using Canonical Form.",
                    "COBBLER: Combining Column and Row Enumeration for Closed Pattern Discovery.",
                    "Upper Bound on the Length of Generalized Disjunction-Free Patterns.",
                    "Mining Deviants in Time Series Data Streams.",
                    "A Fast Algorithm for Subspace Clustering by Pattern Similarity.",
                    "Efficient Similarity Search in Streaming Time Sequences.",
                    "Parallelizing Clustering of Geoscientific Data Sets using Data Streams.",
                    "A Scalable Approach to Approximating Aggregate Queries over Intermittent Streams.",
                    "Temporal Range Exploration of Large Scale Multidimensional Time Series Data.",
                    "Accessing and Visualizing Scientific Spatiotemporal Data.",
                    "Selected Spatio-Temporal Data Types and Operations for a 3D/4D Geological Information System.",
                    "Indexing the Trajectories of Moving Objects in Networks (Extended Abstract).",
                    "Efficient Query Processing on Relational Data-Partitioning Index Structures.",
                    "Continuous K-Nearest Neighbor Search for Moving Objects.",
                    "A Tree-Structured Query Interface for Querying Semi-Structured Data.",
                    "Spatio-Temporal Data Services in a Shared-Nothing Environment.",
                    "SaIL: A Library for Efficient Application Integration of Spatial Indices.",
                    "Merging R-trees.",
                    "Spatial Join for High-Resolution Objects.",
                    "Improvements in Distance-Based Indexing.",
                    "A Comparative Study of Spatial Indexing Techniques for Multidimensional Scientific Datasets.",
                    "BASS: Approximate Search on Large String Databases.",
                    "Customized Answers to Summary Queries via Aggregate Views.",
                    "Fast Computation of Iceberg Dwarf.",
                    "MM-Cubing: Computing Iceberg Cubes by Factorizing the Lattice Space.",
                    "On the Integration of Autonomous Data Marts.",
                    "An Economic Model for Resource Exchange in Mobile Peer to Peer Networks.",
                    "A Generic Algorithmic Framework for Aggregation of Spatio-Temporal Data.",
                    "Retrieval of Isomorphic Substructures in Crystallographic Databases.",
                    "Modeling and Language Support for the Management of Pattern-Bases.",
                    "Composing Lineage Metadata with XML for Custom Satellite-Derived Data Products.",
                    "Managing Moving Objects on Dynamic Transportation Networks.",
                    "All-Nearest-Neighbors Queries in Spatial Databases.",
                    "Multi-scale Classification of Moving Objects Trajectories.",
                    "Scalable Spatio-temporal Continuous Query Processing for Location-aware Services.",
                    "An Information System for Material Microstructures.",
                    "Knowledge Discovery from Databases on the Semantic Web.",
                    "MISSION: An Agent-Based System for Semantic Integration of Heterogeneous Distributed Statistical Information Sources.",
                    "The Schema Evolution and Data Migration Framework of the Environmental Mass Database IMIS.",
                    "String Join Using Precedence Count Matrix.",
                    "On Integrating Scientific Resources through Semantic Registration.",
                    "MDDQL-Stat: Data Querying and Analysis through Integration of Intentional and Extensional Semantics.",
                    "Exploiting Multiple Paths to Express Scientific Queries.",
                    "An Integrated Metadata Model for Statistical Data Collection and Processing.",
                    "East of Neuchâtel: A Universal Model for the Representation of Statistical Taxonomy Systems.",
                    "AutoPart: Automating Schema Design for Large Scientific Databases Using Data Partitioning.",
                    "Grid-Based Metadata Services.",
                    "DataMover: Robust Terabyte-Scale Multi-file Replication over Wide-Area Networks.",
                    "Data Management over the GRID: Heaven or Hell?.",
                    "A Monte Carlo Sampling Method for Drawing Representative Samples from Large Databases.",
                    "LCGMiner: Levelwise Closed Graph Pattern Mining from Large Databases.",
                    "Kepler: An Extensible System for Design and Execution of Scientific Workflows.",
                    "Finding Frequent Items in Sliding Windows with Multinomially-Distributed Item Frequencies.",
                    "A Shrinking-Based Dimension Reduction Approach for Multi-Dimensional Data Analysis.",
                    "Detection and Limitation of Interval Inference in Statistical Databases.",
                    "Knowledge Sifter: Ontology-Driven Search over Heterogeneous Databases.",
                    "An Efficient Method to Find Area Clusters with Constraints Using Grid Index Structure.",
                    "A Data Warehouse Conceptual Data Model.",
                    "A Weight-based Map Matching Method in Moving Objects Databases.",
                    "Hierarchical Stream Aggregates: Querying Nested Stream Sessions.",
                    "Ants caught in the Semantic Web: A study in the application of description logic to animal systematics.",
                    "A Service Oriented Architecture for a Health Research Data Network.",
                    "Self-Deadlocks in Disparate Scientific Data Management Systems.",
                    "Discovery of Serial Episodes from Streams of Events."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "15th SSDBM 2003",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2003",
                "sub_name": "Proceedings of the 15th International Conference on Scientific and Statistical Database Management (SSDBM 2003), 9-11 July 2003, Cambridge, MA, USA.",
                "count": 34,
                "papers": [
                    "Entity Level Data Integration by Statistical Methods.",
                    "Approximate String Joins.",
                    "The Virtual Data Grid: A New Model and Architecture for Data-Intensive Collaboration.",
                    "Disclosure Risk Measures for Microdata.",
                    "Indexing and Incremental Updating Condensed Data Cube.",
                    "Computing Cube View Dependences in OLAP Datacubes.",
                    "On Solving the View Selection Problem in Distributed Data Warehouse Architectures.",
                    "Space Constrained Selection Problems for Data Warehouses and Pervasive Computing.",
                    "Using Bitmap Index for Interactive Exploration of Large Datasets.",
                    "Stream Window Join: Tracking Moving Objects in Sensor-Network Databases.",
                    "Supporting Sliding Window Queries for Continuous Data Streams.",
                    "A Visual Framework Invites Human into the Clustering Process.",
                    "A Strategy Selection Framework for Adaptive Prefetching in Data Visualization.",
                    "The CenSSIS Image Database.",
                    "A Quad-Tree Based Multiresolution Approach for Two-dimensional Summary Data.",
                    "PiQA: An Algebra for Querying Protein Data Sets.",
                    "The ed-tree: An Index for Large DNA Sequence Databases.",
                    "Database Support for 3D-Protein Data Set Analysis.",
                    "TreeRank: A Similarity Measure for Nearest Neighbor Searching in Phylogenetic Databases.",
                    "Object-Relational Management of Multiply Represented Geographic Entities.",
                    "Efficient Update and Retrieval of Objects in a Multiresolution Geospatial Database.",
                    "Performance Evaluation of Spatio-temporal Selectivity Estimation Techniques.",
                    "Declustering Large Multidimensional Data Sets for Range Queries over Heterogeneous Disks.",
                    "The Evolution of a Hierarchical Partitioning Algorithm for Large-Scale Scientific Data: Three Steps of Increasing Complexity.",
                    "Prototype of a Value-Range Query Technique on Earth Sciences Data.",
                    "Using Triangle Inequality to Efficiently Process Continuous Queries on High-Dimensional Streaming Time Series.",
                    "A Practical Approach for Microscopy Imaging Data Management (MIDM) in Neuroscience.",
                    "MoBIoS: A Metric-Space DBMS to Support Biological Discovery.",
                    "A Spatio-temporal Multi-modal Data Management and Analysis Environment for Tracking MS Lesions.",
                    "A Modeling and Execution Environment for Distributed Scientific Workflows.",
                    "Compiling Abstract Scientific Workflows into Web Service Workflows.",
                    "Development of an Informatics Tool for Crystallography Laboratory Administrators.",
                    "Acceleration of Relational Index Structures Based on Statistics.",
                    "A Web Query System for Heterogeneous Geospatial Data."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "14th SSDBM 2002",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2002",
                "sub_name": "Proceedings of the 14th International Conference on Scientific and Statistical Database Management, July 24-26, 2002, Edinburgh, Scotland, UK.",
                "count": 30,
                "papers": [
                    "Tale of Two Cultures: Are There Database Research Issues in Bioinformatics?",
                    "A Structure-Based Search Engine for Phylogenetic Databases.",
                    "Using the GRID for Biodiversity Research: The GRAB Demonstrator.",
                    "A Conceptual Framework for Composing and Managing Scientific Data Lineage.",
                    "The Design and Implementation of a Meaning Driven Data Query Language.",
                    "Query Processing with Description Logic Ontologies Over Object-Wrapped Databases.",
                    "Chimera: AVirtual Data System for Representing, Querying, and Automating Data Derivation.",
                    "An Architecture for Managing Distributed Scientific Resources.",
                    "Annotating Scientific Images: A Concept-Based Approach.",
                    "Managing Heterogeneous Ecological Data Using Morpho.",
                    "Multiple Overlapping Classifications: Issues and Solutions.",
                    "ATreeGrep: Approximate Searching in Unordered Trees.",
                    "Compressing Bitmap Indexes for Faster Search Operations.",
                    "Accelerating High-Dimensional Nearest Neighbor Queries.",
                    "Efficient k Nearest Neighbor Queries on Remote Spatial Databases Using Range Estimation.",
                    "A Cost Model for Interval Intersection Queries on RI-Trees.",
                    "Efficient Techniques for Range Search Queries on Earth Science Data.",
                    "Access Support Tree & TextArray: A Data Structure for XML Document Storage & Retrieval.",
                    "Image Data Model for an Efficient Multi-Criteria Query: A Case in Medical Databases.",
                    "Similarity Searching for Multi-Attribute Sequences.",
                    "Developing Scientific Database Applications in a Grid Environment.",
                    "Metadata for Traveling Statistics - The World of Statistics Meets the Semantic Web.",
                    "XML-Extended OLAP Querying.",
                    "A Negotiation Agent for Distributed Heterogeneous Statistical Databases.",
                    "Statistical Composites: A Transformation-Bound Representation of Statistical Datasets.",
                    "Information-Theoretic Disclosure Risk Measures in Statistical Disclosure Control of Tabular Data.",
                    "Use of Metadata Registries for Searching for Statistical Data.",
                    "The Edinburgh Mouse Atlas and Gene-Expression Database: A Spatio-Temporal Database for Biological Research.",
                    "Abstract and Discrete Models for Uncertain Spatiotemporal Data.",
                    "Joint Queries Estimation from Multiple OLAP Databases."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "13th SSDBM 2001",
        "info": "Fairfax, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2001",
                "sub_name": "Proceedings of the 13th International Conference on Scientific and Statistical Database Management, July 18-20, 2001, George Mason University, Fairfax, Virginia, USA.",
                "count": 29,
                "papers": [
                    "Clustering Algorithms and Validity Measures.",
                    "Modeling Statistical Metadata.",
                    "Semistructured Probalistic Databases.",
                    "An Extensible Index for Spatial Databases.",
                    "2D TSA-tree: A Wavelet-Based Approach to Improve the Efficiency of Multi-Level Spatial Data Mining.",
                    "Tracing Lineage of Array Data.",
                    "Entropy Based Approximate Querying and Exploration of Datacubes.",
                    "OLAP Databases and Aggregation Functions.",
                    "Specifying OLAP Cubes On XML Data.",
                    "An efficient query strategy for integrated Remote Sensing and inventory (Spatial) Databases.",
                    "Using Association Rules to Add or Eliminate Query Constraints Automatically.",
                    "Rewrite Rules for Quantified Subqueries in a Federated Database.",
                    "Clustering High dimensional Massive Scientific Dataset.",
                    "BitCube: A Three-Dimensional Bitmap Indexing for XML Documents.",
                    "a Schema-Independent XML Database System.",
                    "Earth System Science Workbench: A Data Management Infrastructure for Earth Science Products.",
                    "Evolutionary Design and Development of Image Meta-Analysis Environments Based on Object-Relational Database Mediator Technology.",
                    "Cost-based Unbalanced R-Trees.",
                    "Efficient Disk Allocation Schemes for Parallel Retrieval of Multidimensional Grid Data.",
                    "Efficient Historical R-trees.",
                    "The Science Data Highway - where are we today?",
                    "Two Approaches to Representing Multiple Overlapping Classifications: a Comparison.",
                    "Ontology Negotiation between Scientific Archives.",
                    "An XML-Based Distributed Metadata Server (DIMES) Supporting Earth Science Metadata.",
                    "A Feasible Method to Find Areas with Constraints Using Hierarchical Depth-First Clustering.",
                    "Integrating distributed Scientific Data Sources with MOCHA and XRoaster.",
                    "Exploring the Behavior of the Spring Ecosystem Model Using An Object-Oriented Database System.",
                    "Content-Based Browsing of Data from the Tropical Rainfall Measuring Mission (TRMM).",
                    "An Information System for Distillation Data Farming."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "12th SSDBM 2000",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/2000",
                "sub_name": "Proceedings of the 12th International Conference on Scientific and Statistical Database Management, Berlin, Germany, July 26-28, 2000.",
                "count": 23,
                "papers": [
                    "Techniques for Effective Integration, Maintenance and Evolution of Species Databases.",
                    "Three Improvements to the BLASTP Search of Genome Databases.",
                    "Efficient Web Access to Distributed Biological Collections Using a Taxonomy Browser.",
                    "Knowledge-Based Integration of Neuroscience Data Sources.",
                    "TSA-Tree: A Wavelet-Based Approach to Improve the Efficiency of Multi-Level Surprise and Trend Queries on Time-Series Data.",
                    "Supporting Content-Based Searches on Time Series via Approximation.",
                    "Automatic Aggregation Using Explicit Metadata.",
                    "pCube: Update-Efficient Online Aggregation with Progressive Feedback and Error Bounds.",
                    "Answering Multidimensional Queries on Cubes Using Other Cubes.",
                    "Light-Weight Indexing of General Bitemporal Data.",
                    "Optimizing Selections over Datacubes.",
                    "The Sort/Sweep Algorithm: A New Method for R-Tree Based Spatial Joins.",
                    "A Tool for Nesting and Clustering Large Objects.",
                    "Serving Datacube Tuples from Main Memory.",
                    "Coordinating Simultaneous Caching of File Bundles from Tertiary Storage.",
                    "Implementing Geospatial Operations in an Object-Relational Database System.",
                    "Extending Geographic Databases for a Query Language to Support Queries Involving Statistical Data.",
                    "Toward Spatial Joins for Polygons.",
                    "An Integrated Database System at the National Level for Water Resource Engineers and Planners of Bangladesh.",
                    "The Prometheus Database for Taxonomy.",
                    "Generating Network-Based Moving Objects.",
                    "A Performance Evaluation of Log-Only Temporal Object Database Systems.",
                    "Extending GeoToolKit to Access Distributed Spatial Data and Operations."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "11th SSDBM 1999",
        "info": "Cleveland, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/99",
                "sub_name": "11th International Conference on Scientific and Statistical Database Management, Proceedings, Cleveland, Ohio, USA, 28-30 July, 1999.",
                "count": 37,
                "papers": [
                    "Techniques for Online Exploration of Large Object-Relational Datasets.",
                    "A Framework for Statistical Data Mining with Summary Tables.",
                    "Fast Approximate Answers to Aggregate Queries on a Data Cube.",
                    "Evaluation of Ad Hoc OLAP: In-Place Computation.",
                    "Specifying Updates in Biomedical Databases.",
                    "An Indexing Scheme for Fast Similarity Search in Large Time Series Databases.",
                    "Master-Client R-Trees: A New Parallel R-Tree Architecture.",
                    "PISA: Performance Models for Index Structures with and without Aggregated Data.",
                    "Supporting Imprecision in Multidimensional Databases Using Granularities.",
                    "An Infrastructure for Scalable Parallel Multidimensional Analysis.",
                    "2D+ String: A Spatial Metadata to Reason Topological and Directional Relationships.",
                    "How to Avoid Building DataBlades That Know the Value of Everything and the Cost of Nothing.",
                    "Data, Information, Knowledge: How Do We Attempt to Traverse across These Domains? (Abstract).",
                    "Query Processing in the TAMBIS Bioinformatics Source Integration System.",
                    "Rationale and Design of the European Computerized Human Brain Database System.",
                    "A Query System in a Biological Database.",
                    "Sharing Experiences from Scientific Experiments.",
                    "Challenges and Opportunities in Scientific and Statistical Databases (Panel).",
                    "Graphical Interaction with Historical Databases.",
                    "Reclustering of High Energy Physics Data.",
                    "Conflict Detection for Integration of Taxonomic Data Sources.",
                    "Multidimensional Indexing and Query Coordination for Tertiary Storage Management.",
                    "Panel: Data Exchanges and Interoperability in Distributed Earth Science Information Systems.",
                    "Incremental Join of Time-Oriented Data.",
                    "Range Selectivity Estimation for Continuous Attributes.",
                    "Dynamic Caching of Query Results for Decision Support Systems.",
                    "Dynamic Query Re-Optimization.",
                    "NetMedia: Giving Control to Distributed Multimedia Presentation Systems.",
                    "GiView: A Multi-Resolution Geographical Data Retrieval System.",
                    "LITCHI: Knowledge Integrity Testing for Taxonomic Databases.",
                    "ASSISS: An Active Semi-Structured Scientific Information Sharing System.",
                    "TAMBIS Online: A Bioinformatics Source Integration Tool.",
                    "The Advanced Web Query System of GPCRDB.",
                    "Building a Star Join Schema Using SQL Server.",
                    "The Diamond Eye Image Mining System.",
                    "Remote Data Access via the SIESIP Distributed Information System.",
                    "DML: A Bridge between Database Systems and L-Systems for Biological Research."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "10th SSDBM 1998",
        "info": "Capri, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/98",
                "sub_name": "10th International Conference on Scientific and Statistical Database Management, Proceedings, Capri, Italy, July 1-3, 1998.",
                "count": 32,
                "papers": [
                    "Current Scientific Data Management Problems (Abstract).",
                    "Scalable, Parallel, Scientific Databases.",
                    "Efficient I/O of Grid Hierarchies for AMR Computations on Parallel Disks.",
                    "Determining the Optimal File Size on Tertiary Storage Systems Based on the Distribution of Query Sizes.",
                    "Benchmarking Spatial Joins À La Carte.",
                    "Research Issues in Clinical Data Warehousing.",
                    "Modeling Multidimensional Databases, Cubes and Cube Operations.",
                    "Normal Forms for Multidimensional Databases.",
                    "From a Procedural to a Visual Query Language for OLAP.",
                    "SRQL: Sorted Relational Query Language.",
                    "Discrete Object Detection and Motion Registration Based on a Data Management Approach.",
                    "Moving Objects Databases: Issues and Solutions.",
                    "Specifications for Efficient Indexing in Spatiotemporal Databases.",
                    "Computational Issues Connected with the Protection of Sensitive Statistics by Auditing Sum Queries.",
                    "Efficient Proximity Search in Multivariate Data.",
                    "Efficient Execution of Operations in a DBMS for Multidimensional Arrays.",
                    "OLAP and Data Warehousing in Statistical Databases (Panel).",
                    "A Pyramid Data Model for Supporting Content-Based Browsing and Knowledge Discovery.",
                    "FED - A Framework for Iterative Data Selection in Exploratory Visualization.",
                    "Scientific Workflow Management by Database Management.",
                    "An Extensible Framework for Spatio-Temporal Database Applications.",
                    "A Scalable Bottum-Up Data Mining Algorithm for Relational Databases.",
                    "Information Technology Implementation for a Distributed Data System Serving Earth Scientists: Seasonal to Interannual ESIP.",
                    "Integrated Metadata-Systems within Statistical Offices.",
                    "Remote Access to Earth Science Data by Content, Space, and Time.",
                    "ConIstat: a System to Manage, Record and Present Cyclical Data.",
                    "Tools for Data Warehouse Quality.",
                    "A Web-Based Database for Conducting Outcomes Research via the Internet: the National Comprehensive Cancer Network System.",
                    "Metabolic Pathway Interface to Molecular Biology Databases.",
                    "Providing Information on Environmental Change: Data Management Strategies and Internet Access Approaches within the UK Environmental Change Network.",
                    "Attribute Uncertainty Propagation in Vector Geographic Information Systems: Sensitivity Analysis.",
                    "Building Geo-Scientifc Applications on Top of GeoToolKit: a Case Study of Data Integration."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "9th SSDBM 1997",
        "info": "Olympia, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/97",
                "sub_name": "Ninth International Conference on Scientific and Statistical Database Management, Proceedings, August 11-13, 1997, Olympia, Washington, USA.",
                "count": 31,
                "papers": [
                    "Data Mining and Knowledge Discovery in Databases: Implications for Scientific Databases.",
                    "Knowledge Discovery in an Earthquake Text Database: Correlation between Significant Earthquakes and the Time of Day.",
                    "Data Mining and Modeling in Scientific Databases.",
                    "A Cost Model for Estimating the Performance of Spatial Joins Using R-trees.",
                    "Data Abstraction through Density Estimation by Storage Management.",
                    "Large-Sample and Deterministic Confidence Intervals for Online Aggregation.",
                    "Query Pre-Execution and Batching in Paradise: A Two-Pronged Approach to the Efficient Processing of Queries on Tape-Resident Raster Images.",
                    "Parallel Input/Output with Heterogeneous Disks.",
                    "A Prototype Metadata Database for Online Analytical Processing of Environmental Data.",
                    "For Scientific Data Discovery: Why Can't the Archive be More Like the Web?",
                    "A Spatial Data Cube Concept for Supporting Data Analysis in Environmental Epidemiology.",
                    "VANILLA: A Dynamic Data Model for a Generic Scientific Database.",
                    "A Forest Canopy Research Database and Analysis System.",
                    "Developing and Accessing Scientific Databases with the Object-Protocol (OPM) Data Management Tools.",
                    "ESMDIS: Earth System Model Data Information System.",
                    "Remote Access Tool for Earth Science Data.",
                    "Managing Soil Science Experiments Using ZOO.",
                    "The S-PLUS DataBlade for INFORMIX-Universal Server: The Natural Wedding of an Object Relational Database with an Object-Oriented Data Analysis Engine.",
                    "Summarizability in OLAP and Statistical Data Bases.",
                    "Usability of Compromise-Free Statistical Databases.",
                    "Security Problems for Statistical Databases with General Cell Suppressions.",
                    "Metadata: A Case Study from the Environmental Sciences.",
                    "Some Thoughts About a Metadata Management System.",
                    "A Simple Structure for Statistical Meta-Data.",
                    "Using the STEP Standard and Databases in Science.",
                    "LOGOS: A Computational Framework for Neuroinformatics Research.",
                    "Beyond Interoperability - Tracking and Managing the Results of Computational Applications.",
                    "Constructing and Maintaining Scientific Database Views in the Framework of the Object-Protocol Model.",
                    "Scientific Databases: A Challenge in Interdisciplinary Eduction (Panel).",
                    "geoPOM: A Heterogeneous Geoscientific Persistent Object System.",
                    "The Virtual Domain Application Data Center: Serving Interdisciplinary Earth Scientists."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "8th SSDBM 1996",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/96",
                "sub_name": "Proceedings of the Eighth International Conference on Scientific and Statistical Database Management, Stockholm, Sweden, June 18-20, 1996.",
                "count": 26,
                "papers": [
                    "Data Mining: Machine Learning, Statistics, and Databases.",
                    "Censoring Statistical Tables to Protect Sensitive Information: Easy and Hard Problems.",
                    "A Data Structure for Representing Aggregate Data.",
                    "Statistical Dependencies.",
                    "Astronomical Tables, 2-D Indexing, and Fuzzy-joins.",
                    "Sequence Matching of Images.",
                    "Approximate Query Answering In Numerical Databases.",
                    "Frog and Turtle: Visual Bridges Between Files and Object-Oriented Data.",
                    "A Scientific Multimedia Database System for Polymer Science Experiments.",
                    "Persistent Array Access Using Server-Directed I/O.",
                    "Extendible Arrays for Statistical Databases and OLAP Applications.",
                    "Optimizing Statistical Queries by Exploiting Orthogonality and Interval Properties of Grouping Relations.",
                    "Practical Problems of Implementing Metadata Standards in Official Statistics.",
                    "Design Principles for a Unified Statistical Data/Metadata System (Position Paper).",
                    "Quality Aspects of a Modern Database Service (Position Paper).",
                    "What Clinical Database Management System does the NHS need? (Position Paper).",
                    "Conceptual Data Model with Structured Objects for Statistical Database.",
                    "Using the Functional Data Model to Integrate Distributed Biological Data Sources.",
                    "Reuse of High-Level Information Requests: Leveraging the Investment.",
                    "Extracting and Providing Knowledge within an Object-Centered Scientific Information System for Atmospheric Research.",
                    "Requirements and Design for Replication Services for a Time Series Management System.",
                    "The Design and Implementation of a Database For Human Genome Research (Position Paper).",
                    "Data and Information Architectures for Large-Scale Distributed Data Intensive Information Systems (Position Paper).",
                    "Characterization of Temporal Sequences in Geophysical Databases (Position Paper).",
                    "Computational Indexes for Time Series.",
                    "Efficient Temporal Join Processing Using Time Index."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "7th SSDBM 1994",
        "info": "Charlottesville, Virginia",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/94",
                "sub_name": "Seventh International Working Conference on Scientific and Statistical Database Management, September 28-30, 1994, Charlottesville, Virginia, USA, Proceedings.",
                "count": 33,
                "papers": [
                    "Information Visualization: Data Infrastructure Architectures.",
                    "The SANDBOX: A Virtual Reality Interface to Scientific Databases.",
                    "GTL - A Graphical Language for Temporal Data.",
                    "A Design Methodology for Databases with Uncertain Data.",
                    "Comparative Multivariate Visualization Across Conceptually Different Graphic Displays.",
                    "Supporting Statistical Operations in Extensible Databases: A Case Study.",
                    "Statistical versus Relational Join Dependencies.",
                    "Routine Multiple Imputation in Statistical Databases.",
                    "Integration of Statistical Information Systems - Theory and Practice.",
                    "A General Model for the Answer-Perturbation Techniques.",
                    "A Physical Storage for Efficient Statistical Query Processing.",
                    "SEQUOIA 2000: A Reflection of the First Three Years.",
                    "A Federated DBMS-Based Integrated Environment for Molecular Biology.",
                    "Physical Map Assembler: An Active Object-Oriented Database for Human Genome Applications.",
                    "A Scientific Database System for Polymers and Materials Engineering Needs.",
                    "Modeling Complex Astrophysics Data.",
                    "The Conceptual Schema and External Schemata of Metadatabases.",
                    "Metadata: A User's View.",
                    "Bambi Meets Godzilla: Object Databases for Scientific Computing.",
                    "An Object-Oriented Data Model for a Time Series Management System.",
                    "Computational Proxies: Modeling Scientific Applications in Object Databases.",
                    "Long-Term Database Support for EXPRESS Data.",
                    "Physical Schemas for Large Multidimensional Arrays in Scientific Computing Applications.",
                    "Spatial Data Reallocation Based on Multidimensional Range Queries - A Contribution to Data Management for the Earth Sciences.",
                    "High Performance Access to Radio Astronomy Data: A Case Study.",
                    "CANDID: Comparison Algorithm for Navigating Digital Image Databases.",
                    "A Framework for Feature-Based Indexing for Spatial Databases.",
                    "Research Data Management in Ecology: A Practical Approach for Long-term Projects.",
                    "A User-Friendly Interface for Mainframe.",
                    "Beta Testing of EOSDIS Version 0 Using Query Scenarios from Interdisciplinary Scientists.",
                    "Analyzing High Energy Physics Data Using Databases: A Case Study.",
                    "The Design, Development and Operation of a Distributed Data Inventory System.",
                    "Development of Database Management for the Analysis of Large Scale Radioecological Accidents."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "6th SSDBM 1992",
        "info": "Monte Verita, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/92",
                "sub_name": "Proceedings of the 6th Int. Working Conf. on Scientific and Statistical Database Management, Monte Verita, Switzerland, 1992.",
                "count": 23,
                "papers": [
                    "Solving Spatial Analysis Problems with GeoSAL, A Spatial Query Language.",
                    "VIDDEL: an object-oriented VIsual Data DEfinition Language for statistical data.",
                    "The Data Analysis System for the COMPTEL Gamma-Ray Telescope aboard the NASA Compton Gamma-Ray Observatory - Experiences from one year Mission Data Analysis (invited contribution).",
                    "Data Management for Genomic Mapping Applications: A Case Study.",
                    "Object-oriented Database Support for Computational Chemistry.",
                    "Modelling Ecological Data.",
                    "Thoughts on Real Data and Statistics (invited contribution).",
                    "Representing Non-Inheritance Relationships in an Object-Oriented, Scientific Database.",
                    "Integration of Scientific Data and Formulae in an Object-Oriented System.",
                    "Approximate Joins in Scientific Databases in Practice.",
                    "A Functional Approach to Scientific Database Implementation.",
                    "Assessing \"Global Climatic Change\" (keynote address).",
                    "Resolving Data Heterogeneity in Scientific and Statistical Databases.",
                    "Statistical Protection for Statistical Databases.",
                    "An Object-Oriented Statistical Database: A Proposal for the National Statistical Office.",
                    "Data Management in S (invited contribution).",
                    "Analysis of Tradeoff between Data Accuracy and Performance of Databases.",
                    "On the Semantic Completeness of Macro-Data Operators for Statistical Aggregation.",
                    "Matrix-based Interchange of Aggregated Statistical Data.",
                    "Providing Temporal Support in Data Base Management Systems for Global Change Research.",
                    "Definition and Use of Meta-Data in Statistical Data Processing.",
                    "The BSRN Database.",
                    "Concurrent Operations in Balanced and Nested Grid Files."
                ]
            },
            {
                "sub_name_abbr": "conf/ssdbm/90",
                "sub_name": "Statistical and Scientific Database Management, 5th International Conference SSDBM, Charlotte, NC, USA, April 3-5, 1990, Proccedings.",
                "count": 16,
                "papers": [
                    "Object-Oriented Approach to Managing Statistical and Scientific Databases.",
                    "STORM: A Statistical Object Representation Model.",
                    "Semantic Modeling of Bivariate Statistical Tests.",
                    "Deductive Mathematical Databases - A Case Study.",
                    "Optimal Distribution of Restricted Ranges in Secure Statistical Database.",
                    "Implementing Subscripted Identifiers in Scientific Databases.",
                    "Random Sampling from Database Files: A Survey.",
                    "Temporal Summary Table Management and Graphic Interface.",
                    "A Framework for Query Optimization in Temporal Databases.",
                    "GRASP: A Graphical System for Statistical Databases.",
                    "A Visual Interface for Browsing and Manipulating Statistical Entities.",
                    "Database Systems for Programmable Logic Controllers.",
                    "The Implementation of Area and Membership Retrievals in Point Geography using SQL.",
                    "Preliminary Data in Economic Databases.",
                    "PLATYPUS: Inheritance and Scientific Discovery.",
                    "Using a Blackboard Architecture in a Distributed DBMS Environment: An Expert System Application."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "4th SSDBM 1988",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/88",
                "sub_name": "Statistical and Scientific Database Management, 4th International Working Conference SSDBM, Rome, Italy, June 21-23, 1988, Proccedings.",
                "count": 27,
                "papers": [
                    "Research Topics in Statistical and Scientific Database Management: the IV SSDBM.",
                    "Statistical Data Management Requirements and the SQL Standards - An Evolving Comparison.",
                    "The Representation of a Temporal Data Model in the Relational Environment.",
                    "Knowledge Based Support for the Management of Statistical Databases.",
                    "A Study of Modified Interpolation Search in Compressed, Fully Transposed, Ordered Files.",
                    "Design of Statistical Information Media: Time Performance and Storage Constraints.",
                    "Handling Time in Query Languages.",
                    "Software and Hardware Enhancement of Arithmetic Coding.",
                    "Orthogonal Range Retrieval Using Bucket Address Hashing.",
                    "Automatic Drawing of Statistical Diagrams.",
                    "The Classification Problem with Semantically Heterogeneous Data.",
                    "Database Issues for a Veterinary Medical Expert System.",
                    "Ranges and Trackers in Statistical Databases.",
                    "A Data Model, Knowledge Base, and Natural Language Processing for Sharing a Large Statistical Database.",
                    "Precision-Time Tradeoffs: A Paradigm for Processing Statistical Queries on Databases.",
                    "Interpretation of Statistical Queries to Relational Databases.",
                    "GQL, A Graphical Query Language for Semantic Databases.",
                    "A Conceptual Model for the Representation of Statistical Data in Geographical Information Systems.",
                    "Spatial Data Base Queries: Relational Algebra versus Computational Geometry.",
                    "Design of the User-Interface for an Object-Oriented Statistical Data-Base.",
                    "Knowledge Browsing - Front Ends to Statistical Databases.",
                    "Statistical Relational Model.",
                    "A Model of Summary Data and its Applications in Statistical Databases.",
                    "Panel Discussion - Statistical Relational Model.",
                    "Database Management Systems for Statistical and Scientific Applications: Are Commercially Available DBMS Good Enough? Panel.",
                    "Geographical Database Systems and Statistical Information -Panel.",
                    "The Analysis of Geographical Data: Data Rich, Technology Adequate, Theory Poor."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "3rd SSDBM 1986",
        "info": "Luxembourg, Luxembourg",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/86",
                "sub_name": "Proceedings of the Third International Workshop on Statistical and Scientific Database Management, July 22-24, 1986, Grand Duchy of Luxembourg, Luxembourg.",
                "count": 43,
                "papers": [
                    "Scientific and Statistical Data Management Research at LBL.",
                    "DBMS and COMPASS: The COMPTEL Processing and Analysis Software System.",
                    "Use of a Commercial DBMS in a Scientific Environment.",
                    "Scientific Data Manipulation in a Relational Database System.",
                    "Performance Analysis of Storage Schemes for Large Numerical Databases.",
                    "Physical Database Support for Scientific and Statistical Database Management.",
                    "Efficient Transmission and Storage of Alphanumeric Data and Metadata.",
                    "Decomposing Complex Contingency Tables to Reduce Storage Requirements.",
                    "Managing the Data Analysis Process.",
                    "Auditing of Data Analyses.",
                    "LABSTAT BROWSE: A Search Facility Built for an Existing Database.",
                    "Multidimensional Data Visualization Design Tradeoffs: Speed vs. Detail.",
                    "A Database Interface to an Integrated Data Analysis and Plotting Tool.",
                    "A Query Language Capable of Handling Incomplete Information and Statistics.",
                    "Aggregation Operations in Historical Relational Databases (extended abstract).",
                    "An Algebra for Statistical Data.",
                    "HQUEL, a Query Language for Historical Relational Databases.",
                    "A Model of Summaries for Very Large Databases.",
                    "On the Semantics of Aggregated Data.",
                    "Using Logic to Organize Statistical Databases.",
                    "Conceptual Schema for a Wide-Scope Statistical Database and its Applications.",
                    "On the Form of an Intelligent Front End to a Statistical Data-Base.",
                    "A Comparison of Old and New Technologies for Translating Between Relational Query Languages.",
                    "A Strategy for Coupling Logic Programming and Database Technology.",
                    "Esprit Project 311: Advanced Data and Knowledge Management System.",
                    "The Design of a Data Base Management System for Economic Time Series Data.",
                    "Compilation of Data for Statistical Analysis: Theory and Application of Record Linking.",
                    "Cluster Analysis - A Series of Database Views?",
                    "Data Analysis for Relational Data Bases: The PEPIN-SICLA System.",
                    "Data Base Management and Statistical Information.",
                    "The Design of Cantor - A New System for Data Analysis.",
                    "The Design and Implementation of the SSDB.",
                    "Implementing a Computer Efficient Database Management System: A Progress Report.",
                    "The Small Area Data Program: An Essential Information Resource.",
                    "Textbase Management Systems: Tools for the Archiving and Analysis of Textual Data.",
                    "ARCHEDDA - A Prototype for a Heterogeneous Distributed Database System.",
                    "SIAM: Statistics Information Access Method.",
                    "An Evaluation of Two New Inference Control Methods.",
                    "Prior Knowledge and the Security of a Dynamic Statistical Database.",
                    "Design of a Fuel Statistics Database Using Focus.",
                    "Database Management Problems with a Cancer Register.",
                    "Database Management in Multicenter Prospective Tumor Studies.",
                    "An Examination of How a Classification System Can Be Used to Automate POSCH Metadata."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "2nd SSDBM 1983",
        "info": "Los Altos, California",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/83",
                "sub_name": "Proceedings of the Second International Workshop on Statistical Database Management, Los Altos, California, USA, September 27-29, 1983.",
                "count": 56,
                "papers": [
                    "Data-Bases for Clinical Histories.",
                    "Features of a System for Statistical Databases.",
                    "Issues Related to Medical Statistical Databases.",
                    "Management and Display of Data Analysis Environments for Large Data Sets.",
                    "Model for a Clinical Research Database.",
                    "Research Needs and Database Development: Push and Pull.",
                    "Research Topics in Statistical Database Management.",
                    "A Multi-Tree Automation for Efficient Data Transmission.",
                    "A Relational Database Machine for Efficient Processing of Statistical Queries.",
                    "SIBYL: An Economist's Workbench.",
                    "ALDS Project: Motivation, Statistical Database Management Issues, Perspectives, and Directions.",
                    "Data Management Without a Database Manager.",
                    "Development Implications of an Interactive, Portable, User-Friendly, Statistical Database Management System or the Separation of Church and State.",
                    "Distributed Data Management in a Minicomputer Network: The SEEDIS Experience.",
                    "An Integrated Research Support System for Inter-Package Communication and Handling Large Volume Output From Statistical Database Analysis Operations.",
                    "Integrating Data and Documentation in a Multi-National Research Project: The IEA Second International Mathematics Study.",
                    "Paste - A Tool to Put Application Systems Together Easily.",
                    "PIGAS - An Interactive Statistical Database Management System.",
                    "Simulators, Statistical Analysis, and Databases.",
                    "CANSIM, the Canadian Socio-Economic Management Information System.",
                    "Diversification in Statistical Data Bases and Its Consequences.",
                    "Econometric Time Series on DIALOG.",
                    "Evolution in Storage and Retrieval: The LABSTAT Data Base and Software System.",
                    "Interactive Information Management with EPS.",
                    "Meta Data: An Experience of Its Uses and Management.",
                    "Problems, Plans and Activities Concerning the Economic Databases at Statistics Sweden.",
                    "Proposal for Workshop on Large Economic Data Bases.",
                    "SAS Applied to Statistical Databanks Via a Command Language.",
                    "A Statistical Data Manipulation Language.",
                    "Complex Data Types and a Data Manipulation Language for Scientific and Statistical Databases.",
                    "Data Structures for Scientific Simulation Programs.",
                    "An Extension of Relational Algebra for Summary Tables.",
                    "How Baroque Should a Statistical Database Management System Be?",
                    "How Far Should a Database System Go? (to Support a Statistical One).",
                    "An Integrated Macro-Economic Data Management System Based on Multi-Dimensional Arrays.",
                    "Classification of Metadata.",
                    "Some Experiments in Evaluation of an Expert System for Statistical Estimation on Databases.",
                    "The GENISYS Data Definition Facilities.",
                    "Logical and Physical Modeling of Statistical Scientific Databases.",
                    "Proposal of a Logical Model for Statistical Data Base.",
                    "Statistical Data Management Research at Lawrence Berkeley Laboratory.",
                    "A Statistical Database Component of a Data Analysis and Modelling System: Lessons From Eight Years of User Experience.",
                    "System/K: A Knowledge Base Management System.",
                    "Computer-Independent Data Compression for Large Statistical Databases.",
                    "Index Coding: A Compression Technique for Large Statistical Databases.",
                    "An Overview of Cantor - A New System for Data Analysis.",
                    "Statistical Database Research Project in Japan and the CAS SDB Project.",
                    "A Strategy for Implementing a Computer Efficient Database Management System - Preliminary Research Report.",
                    "Utilization of Character Reference Locality for Efficient Storage of Data Base.",
                    "Automated Cell Suppression to Preserve Confidentiality of Business Statistics.",
                    "An Information Theoretic Approach to Statistical Databases and Their Security: A Preliminary Report.",
                    "An Introduction to Sampling to Estimate Database Integrity.",
                    "A Security Model for the Statistical Database Problem.",
                    "Statistical Databases: Their Model, Query Language and Security.",
                    "Performance Prediction Methods for Evaluating PDE Algorithms on MIMD Machines.",
                    "Using Statistical Software with a Database Management Data Theory."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "1st SSDBM 1981",
        "info": "Menlo Park, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ssdbm/81",
                "sub_name": "Proceedings of the First LBL Workshop on Statistical Database Management, Melno Park, California, USA, December 2-4, 1981.",
                "count": 49,
                "papers": [
                    "Data Definition for Statistical Summary Data or Appearances Can Be Deceiving.",
                    "A Statistician's View of the Requirements of a Database to Support a Central Query Language.",
                    "Additional Facilities of a Concentional DBMS to Support Interactive Statistical Analysis.",
                    "Toward the Development of an Integrated Economic Data Base at the World Bank.",
                    "Design of the Genealogical Information System.",
                    "Units and Accuracy in Statistical Databases.",
                    "SUBJECT: A Directory Driven System for Large Statistical Databases.",
                    "Statistical Analyses using FWS/MANAGE Database Management System.",
                    "GPI: A Statistical Package/Data Base Interface.",
                    "Data Management Support for Statistical Data Editing and Subset Selection.",
                    "Data Definition and Data Manipulation Panel Discussion Questions.",
                    "Characteristics and Evolution of the OSIRIS Data Definition Languages.",
                    "Must We Navigate Through Databases?",
                    "Metadata in the RAPID DBMS.",
                    "Why are Commercial Database Management Systems Rarely Used for Research Data?",
                    "Data Definition in SIR/DBMS as Applied to the 1980 U.S. Census.",
                    "Data Manipulation in Minitab.",
                    "Data Manipulation Languages for Statistical Databases - the Statistical Analysis System (SAS).",
                    "Data Manipulation in SPSS and SPSS-X.",
                    "Data Manipulation in P-STAT.",
                    "Data Manipulation in the S System for Interactive Data Analysis.",
                    "The Impact of Large Data Sets on Interaction Style for Data Manipulation Languages.",
                    "Rule/based Statistical Calculations on a \"Database Abstract\".",
                    "A Data Model for Integrating Statistical Interpretations.",
                    "Abe: A Query Language for Constructing Aggregates-by-Example.",
                    "For Large Meta Information of National Integrated Statistics.",
                    "Automatic Aggregation and Disaggregation of Data (Abstract).",
                    "MICRONET's Architectural Support for Statistical Aggregations.",
                    "A Methodology for the Determination of Statistical Database Machine Performance Requirements.",
                    "Database Machine Support for Efficient Access to Large Statistical Databases.",
                    "Efficient Inference Control for Range SUM Queries on Statistical Data Bases.",
                    "Update Handling Techniques in Statistical Databases.",
                    "Query Directed Partitioning Scheme for Securing Statistical Databases.",
                    "An Efficient Multi-Group Scheme for Data Compression (Extended Abstract).",
                    "The Access Method Used in a Scientific Data Management System.",
                    "Flexible Techniques for Storage and Analysis of Large Continuing Surveys.",
                    "The Relational Model Applied to the Automation of the Canadian Consumer Price index.",
                    "A Reservoir Water Quality Database Management Ssystem.",
                    "A Simple Sequential Data Base for SAS.",
                    "Modernization of a Preexisting Clinical Trials System: The SWOG Database Experience.",
                    "Effects of Database Management on the Organization and Administration of Clinical Trials.",
                    "Developing Data Bank Systems in Applied Research Organizations: An Overview and a Case Study.",
                    "Statistical Database Management for Ecosystem Effects Analysis.",
                    "Volume Testing of Statistical/Database Software.",
                    "Using the INGRES Relational Database System in Statistical Applications.",
                    "Volume Testing of DBMS Software: The ORACLE Relational DBMS.",
                    "Volume Testing of Statistical Database Using Model 204 DBMS.",
                    "Solving Complex Data Retrieval Problems with TPL.",
                    "The PHANTOM Approach to the Benchmark Problem Set."
                ]
            }
        ]
    }
]