[
    {
        "year": "2021",
        "name": "47th VLDB 2021",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/adms/2021",
                "sub_name": "International Workshop on Accelerating Analytics and Data Management Systems Using Modern Processor and Storage Architectures, ADMS@VLDB 2021, Copenhagen, Denmark, August 16, 2021.",
                "count": 7,
                "papers": [
                    "Delayed Parity Update for Bridging the Gap between Replication and Erasure Coding in Server-based Storage.",
                    "Extending In-Memory OLTP with Persistent Memory.",
                    "One Buffer Manager to Rule Them All: Using Distributed Memory with Cache Coherence over RDMA.",
                    "Evaluating Lightweight Integer Compression Algorithms in Column-Oriented In-Memory DBMS.",
                    "OneJoin: Cross-Architecture, Scalable Edit SimilarityJoin for DNA Data Storage Using oneAPI.",
                    "Highlighting the Performance Diversity of Analytical Queries using VOILA.",
                    "Scaling Joins to a Thousand GPUs."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2021seadata",
                "sub_name": "Proceedings of the 2nd Workshop on Search, Exploration, and Analysis in Heterogeneous Datastores (SEA-Data 2021) co-located with 47th International Conference on Very Large Data Bases (VLDB 2021), Copenhagen, Denmark, August 20, 2021.",
                "count": 12,
                "papers": [
                    "Finding NeMo: Fishing in Banking Networks Using Network Motifs.",
                    "Extreme-Scale Interactive Cross-Platform Streaming Analytics - The INFORE Approach.",
                    "Let the Database Talk Back: Natural Language Explanations for SQL.",
                    "The Secret Life of Wikipedia Tables.",
                    "Know Your Experiments: Interpreting Categories of Experimental Data and Their Coverage.",
                    "COVIDGraph: Connecting Biomedical COVID-19 Resources and Computational Biology Models.",
                    "New Workflows in NoSQL Schema Management.",
                    "Towards a Unified Knowledge Graph Data Management System.",
                    "Declarative Querying of Heterogeneous NoSQL Stores.",
                    "Auctus: A Search Engine for Data Discovery and Augmentation.",
                    "A Data Discovery Platform Empowered by Knowledge GraphTechnologies: Challenges and Opportunities.",
                    "Multi-model Query Processing Meets Category Theory and Functional Programming."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2021phd",
                "sub_name": "Proceedings of the VLDB 2021 PhD Workshop co-located with the 47th International Conference on Very Large Databases (VLDB 2021), Copenhagen, Denmark, August 16, 2021.",
                "count": 13,
                "papers": [
                    "Stream Mining of Complex Event Tensor.",
                    "Exploiting Data Distribution in Distributed Learning of Deep Classification Models under the Parameter Server Architecture.",
                    "Integrating Massive Data Streams.",
                    "Context-Free Path Querying In Terms of Linear Algebra.",
                    "SHACL Constraint Validation during SPARQL Query Processing.",
                    "Interactive Data Discovery in Data Lakes.",
                    "Living in a Candy Store - from being a PhD Student to Working as a Faculty Member on ML for Systems.",
                    "Differentiating Relational Queries.",
                    "Checking Plausibility in Exploratory Data Analysis.",
                    "Cooperative Techniques for Dealing with Unsatisfactory Answers in RDF Knowledge Bases.",
                    "Main Memory Databases Instant Recovery.",
                    "Enhancing JSON Schema Discovery by Uncovering Hidden Data.",
                    "Towards an Integrated Solution for IoT Data Management."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "46th VLDB 2020",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2020phd",
                "sub_name": "Proceedings of the VLDB 2020 PhD Workshop co-located with the 46th International Conference on Very Large Databases (VLDB 2020), ONLINE, August 31 - September 4, 2020.",
                "count": 15,
                "papers": [
                    "Democratizing Data Science and Lessons Learned Along the Way.",
                    "Complex Event Processing for the Internet of Things.",
                    "Unsupervised Subsequence Anomaly Detection in Large Sequences.",
                    "Complex Event Processing on Real-time Video Streams.",
                    "Extended Provenance Management for Data Science Applications.",
                    "AlphaJoin: Join Order Selection à la AlphaGo.",
                    "(Artificial) Mind over Matter: Humans In and Humans Out in Matching.",
                    "Secure Data Processing at Scale.",
                    "Schema Evolution in Hybrid Databases Systems.",
                    "Redesigning Query Engines for White-box Compression.",
                    "Tunable Streaming Graph Embeddings at Scale.",
                    "Efficient and Scalable Aggregate Computation on Temporal Graphs.",
                    "Elastic Query Processing on Function as a Service Platforms.",
                    "Resilient and Scalable Architecture for Permissioned Blockchain Fabrics.",
                    "Reliable Clustering with Applications to Data Integration."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2020di2kg",
                "sub_name": "Proceedings of the 2nd International Workshop on Challenges and Experiences from Data Integration to Knowledge Graphs co-located with 46th International Conference on Very Large Data Bases, DI2KG@VLDB 2020, Tokyo, Japan, August 31, 2020.",
                "count": 6,
                "papers": [
                    "Intermediate Training of BERT for Product Matching.",
                    "Fast Entity Resolution With Mock Labels and Sorted Integer Sets.",
                    "Entity Resolution on Camera Records Without Machine Learning.",
                    "CheetahER: A Fast Entity Resolution System for Heterogeneous Camera Data.",
                    "An Extensible Block Scheme-Based Method for Entity Matching.",
                    "Spread the Good Around! Information Propagation in Schema Matching and Entity Resolution for Heterogeneous Data."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2020sfdi-lsgda",
                "sub_name": "Software Foundations for Data Interoperability and Large Scale Graph Data Analytics - 4th International Workshop, SFDI 2020, and 2nd International Workshop, LSGDA 2020, held in Conjunction with VLDB 2020, Tokyo, Japan, September 4, 2020, Proceedings.",
                "count": 15,
                "papers": [
                    "Attribute Diversified Community Search.",
                    "Parallel Mining of Frequent Subtree Patterns.",
                    "An Axiomatic Role Similarity Measure Based on Graph Topology.",
                    "Scalable In-Memory Graph Pattern Matching on Symmetric Multiprocessor Systems.",
                    "A Graph-Based Approach Towards Risk Alerting for COVID-19 Spread.",
                    "Distributed Graph Analytics with Datalog Queries in Flink.",
                    "Explaining Results of Path Queries on Graphs - Single-Path Results for Context-Free Path Queries.",
                    "NGNC: A Flexible and Efficient Framework for Error-Tolerant Query Autocompletion.",
                    "A Cheap Implementation of Resugaring in BIRDS Based on Bidirectional Transformation.",
                    "Toward Appropriate Data Publishing in Relational Data Exchange Framework.",
                    "Toward Programmable Strategy for Co-existence of Relational Schemes.",
                    "Data Integration Models and Architectures for Service Alliances.",
                    "Towards Smart Data Sharing by Updatable Views.",
                    "Integration of Fast-Evolving Data Sources Using a Deep Learning Approach.",
                    "Towards Guaranteeing Global Consistency for Peer-Based Data Integration Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2020aidb",
                "sub_name": "AIDB@VLDB 2020, 2nd International Workshop on Applied AI for Database Systems and Applications, Held with VLDB 2020, Monday, August 31, 2020, Online Event / Tokyo, Japan.",
                "count": 7,
                "papers": [
                    "The Case for Learned Spatial Indexes.",
                    "It's AI Match: A Two-Step Approach for Schema Matching Using Embeddings.",
                    "Buffer Pool Aware Query Scheduling via Deep Reinforcement Learning.",
                    "ML Based Provenance in Databases.",
                    "A Simple and Effective Predictive Resource Scaling Heuristic for Large-scale Cloud Applications.",
                    "Hands-off Model Integration in Spatial Index Structures.",
                    "MADEX: Learning-augmented Algorithmic Index Structures."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "45th VLDB 2019",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2019phd",
                "sub_name": "Proceedings of the VLDB 2019 PhD Workshop, co-located with the 45th International Conference on Very Large Databases (VLDB 2019), Los Angeles, California, USA, August 26-30, 2019.",
                "count": 17,
                "papers": [
                    "Database Systems 2.0.",
                    "Structured Data Meets News.",
                    "Efficient Scale-Out Using Query-Driven Workload Distribution and Fragment Allocation.",
                    "Adopting Markov Logic Networks for Big Spatial Data and Applications.",
                    "Developing Big Data Analytics Architecture for Spatial Data.",
                    "Effective and Efficient Variable-Length Data Series Analytics.",
                    "From Distributed Sources to Distributed Sinks: Towards Truly Decentralized Event Stream Processing.",
                    "Pre-Estimation of Electric Vehicle Energy Consumption on Unfamiliar Roads and Actual Driving Experiments.",
                    "Biomedical Data Categorization and Integration using Human-in-the-loop Approach.",
                    "Provenance-Based Routing in Probabilistic Graph Databases.",
                    "Make Informed Decisions: Understanding Query Results from Incomplete Databases.",
                    "Optimized Spatio-Temporal Data Structures for Hybrid Transactional and Analytical Workloads on Columnar In-Memory Databases.",
                    "Truly Scalable Data Series Similarity Search.",
                    "Data as a Language: A Novel Approach to Data Integration.",
                    "Comprehensive Framework for Sorting Benchmarks.",
                    "A Cross-domain Natural Language Interface to Databases using Adversarial Text Method.",
                    "Computational Aspects Around Preference Queries."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "44th VLDB 2018",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2018ladas",
                "sub_name": "Proceedings of the Latin America Data Science Workshop co-located with 44th International Conference on Very Large Data Bases (VLDB 2018), Rio de Janeiro, Brazil, Aug 27, 2018.",
                "count": 13,
                "papers": [
                    "Scientific Data Analysis Using Data-Intensive Scalable Computing: The SciDISC Project.",
                    "An I/O Performance Evaluation Tool for Distributed Data-Intensive Scientific Applications.",
                    "A Comparative Study on Streaming Frameworks for Big Data.",
                    "Big Data Analytics Technologies and Platforms: A Brief Review.",
                    "Urban Data Consistency in RDF: A Case Study of Curitiba Transportation System.",
                    "Business Activity Clustering: A Use Case in Curitiba.",
                    "Influence of Virtual Road Traffic Sensors of Oporto for Origin-Destination Matrix Estimation.",
                    "A Multilayer and Time-Varying Structural Analysis of the Brazilian Air Transportation Network.",
                    "Applying Term Frequency-Based Indexing to Improve Scalability and Accuracy of Probabilistic Data Linkage.",
                    "ATAnalysis - Toward a Psycholinguistic Method to Analyze Video Textual Information.",
                    "Computation of PDFs on Big Spatial Data: Problem & Architecture.",
                    "Towards a Human-in-the-Loop Library for Tracking Hyperparameter Tuning in Deep Learning Development.",
                    "A Method to Build a Geolocalized Food Price Time Series Knowledge Base Analyzable by Everyone."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2018phd",
                "sub_name": "Proceedings of the VLDB 2018 PhD Workshop co-located with the 44th International Conference on Very Large Databases (VLDB 2018), Rio de Janeiro, Brasil, Aug 27-31, 2018.",
                "count": 15,
                "papers": [
                    "Integrating Analytics with Relational Databases.",
                    "Capitalizing on Hierarchical Graph Decomposition for Scalable Network Analysis.",
                    "Detecting Spatial Clusters of Infection Risk with Geo-Located Social Media Data.",
                    "Workload-Aware Discovery of Integrity Constraints for Data Cleaning.",
                    "Unsupervised Ensembles for Outlier Detection.",
                    "Vecstra: An Efficient and Scalable Geospatial In-Memory Cache.",
                    "Dynamic Database Operator Scheduling for Processing-in-Memory.",
                    "Multi-Core Allocation Model for Database Systems.",
                    "Spatial Indexing on Flash-Based Solid State Drives.",
                    "Reducing the Footprint of Main Memory HTAP Systems: Removing, Compressing, Tiering, and Ignoring Data.",
                    "Progressive Indices: Indexing Without Prejudice.",
                    "Auditing DBMSes through Forensic Analysis.",
                    "Relating Educational Materials via Extraction of their Topics.",
                    "Parameter Curation and Data Generation for Benchmarking Multi-model Queries.",
                    "Self-Driving: From General Purpose to Specialized DBMSs."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2018bidu",
                "sub_name": "Big Social Data and Urban Computing - First Workshop, BiDU@VLDB 2018, Rio de Janeiro, Brazil, August 31, 2018, Revised Selected Papers.",
                "count": 11,
                "papers": [
                    "Characterizing Usage Patterns and Service Demand of a Two-Way Car-Sharing System.",
                    "MobilityMirror: Bias-Adjusted Transportation Datasets.",
                    "MODAL - A Platform for Mobility Analyses Using Open Datasets.",
                    "Mensageria: A Smart City Framework for Real-Time Analysis of Traffic Data Streams.",
                    "SLEDS: A DSL for Data-Centric Storage on Wireless Sensor Networks.",
                    "Extraction and Exploration of Business Categories Signatures.",
                    "Comparing Emotional Reactions to Terrorism Events on Twitter.",
                    "Using Government Data to Uncover Political Power and Influence of Contemporary Slavery Agents in Brazil.",
                    "CidadeSocial: An Application Software for Opportunistic and Collaborative Engagement of Urban Populations.",
                    "Structures of Interactions and Data in Urban Networks: The Case of PortoAlegre.cc.",
                    "DMEK: Improving Profile Matching in Opportunistic Collaborations."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2018bidup",
                "sub_name": "Proceedings of the Poster Track of the Workshop on Big Social Data and Urban Computing co-located with BiDU 2018 at VLDB 2018, Rio de Janeiro, Brazil, August 31, 2018.",
                "count": 16,
                "papers": [
                    "Using Multilayer Social Networks in an Analysis of Higher Education for Professional Demand.",
                    "Optimization of Urban Semaphore Times Turning into JSSP.",
                    "Strategy for Generation of Knowledge through Automatic Correlation of Dimensional Data in Star Schema: Application in the Context of Leishmaniasis.",
                    "Computer-assisted City Touring for Explorers.",
                    "An Analysis of the Network of Rural Producers in the State of Rio de Janeiro.",
                    "Multi-criteria Analysis Applied to the Inspection of Aedes Aegypti Mosquito Breeding Places.",
                    "Data Quality Assessment and Enhancement on Social and Sensor Data.",
                    "Identifing Social and Technical Aspects in the Startup Ecosystem in Rio de Janeiro State.",
                    "Is the Location of Public Health Units in Curitiba Meeting the Citizen's Needs?",
                    "Checking Fake News on Web Browsers: An Approach Using Collaborative Datasets.",
                    "The Role of Social Capital in Information Diffusion over Twitter: A Study Case over Brazilian Posts.",
                    "Heimdall - Internet of Things (IoT) Platform for Data Retrieval.",
                    "Analyzing Polarization in Twitter: The Murder of Brazilian Councilwoman and Activist Marielle Franco.",
                    "Publish or Post: Identification of Influences between Science and Society through Intelligent Systems.",
                    "Zooming in on NYC Taxi Data with Portal.",
                    "Vision Paper: Challenges and Opportunities of Social Computing in Urban Agriculture in Global North and South Countries."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "43rd VLDB 2017",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2017phd",
                "sub_name": "Proceedings of the VLDB 2017 PhD Workshop co-located with the 43rd International Conference on Very Large Databases (VLDB 2017), Munich, Germany, August 28, 2017.",
                "count": 14,
                "papers": [
                    "Efficient Migration of Very Large Distributed State for Scalable Stream Processing.",
                    "Spatio-Temporal Locality in Hash Tables.",
                    "Graph Pattern Mining for Business Decision Support.",
                    "Efficient Clustering for Large-Scale, Sparse, Discrete Data with Low Fundamental Resolution.",
                    "Query Processing Based on Compressed Intermediates.",
                    "A Hardware-Oblivious Optimizer for Data Stream Processing.",
                    "Generalizing Matching Knowledge using Active Learning.",
                    "Comparing Entities in RDF Graphs.",
                    "Scalable Linkage across Location Enhanced Services.",
                    "Distributed Similarity Joins on Big Textual Data: Toward a Robust Cost-Based Framework.",
                    "Facilitating User Interaction With Data.",
                    "Processing Moving Object Data Streams with Data Stream Management Systems.",
                    "Symmetric and Asymmetric Aggregate Function in Massively Parallel Computing.",
                    "Practical Verification of Hierarchical Artifact Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2017mates",
                "sub_name": "Mobility Analytics for Spatio-Temporal and Social Data - First International Workshop, MATES 2017, Munich, Germany, September 1, 2017, Revised Selected Papers.",
                "count": 10,
                "papers": [
                    "On Attributed Community Search.",
                    "Data Analytics Enables Advanced AIS Applications.",
                    "What do Geotagged Tweets Reveal About Mobility Behavior?",
                    "Edge Representation Learning for Community Detection in Large Scale Information Networks.",
                    "Introducing ADegree: Anonymisation of Social Networks Through Constraint Programming.",
                    "JEREMIE: Joint Semantic Feature Learning via Multi-relational Matrix Completion.",
                    "A Big Data Driven Approach to Extracting Global Trade Patterns.",
                    "Efficient Processing of Spatiotemporal Pattern Queries on Historical Frequent Co-Movement Pattern Datasets.",
                    "Exploratory Spatio-Temporal Queries in Evolving Information.",
                    "Efficient Cross-Modal Retrieval Using Social Tag Information Towards Mobile Applications."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "42nd VLDB 2016",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2016phd",
                "sub_name": "Proceedings of the VLDB 2016 PhD Workshop co-located with the 42nd International Conference on Very Large Databases (VLDB 2016), New Delhi, India, September 9, 2016.",
                "count": 8,
                "papers": [
                    "Efficient Fault Tolerance for Massively Parallel Dataflow Systems.",
                    "Building a Scalable Distributed Online Media Processing Environment.",
                    "Heterogeneity-Aware Query Optimization.",
                    "Distributed Moving Objects Database Based on Key-Value Stores.",
                    "Identifying Top-K Optimal Locations for Placement of Large-Scale Trajectory-Aware Services.",
                    "Rigorous and Flexible Privacy Models for Utilizing Personal Spatiotemporal Data.",
                    "Have Your Cake and Eat it, Too: Data Provenance for Turing-Complete SQL Queries.",
                    "Commonsense for Making Sense of Data."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "41st VLDB 2015",
        "info": "Kohala Coast, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2015bigoq",
                "sub_name": "Biomedical Data Management and Graph Online Querying - VLDB 2015 Workshops, Big-O(Q) and DMAH, Waikoloa, HI, USA, August 31 - September 4, 2015, Revised Selected Papers.",
                "count": 14,
                "papers": [
                    "Vector Space Models for Encoding and Retrieving Longitudinal Medical Record Data.",
                    "The Study of the Compatibility Rules of Traditional Chinese Medicine Based on Apriori and HMETIS Hypergraph Partitioning Algorithm.",
                    "Comparing Small Graph Retrieval Performance for Ontology Concepts in Medical Texts.",
                    "Maps of Human Disease: A Web-Based Framework for the Visualization of Human Disease Comorbidity and Clinical Profile Overlay.",
                    "Secure Similarity Queries: Enabling Precision Medicine with Privacy.",
                    "Time-, Energy-, and Monetary Cost-Aware Cache Design for a Mobile-Cloud Database System.",
                    "BiobankCloud: A Platform for the Secure Storage, Sharing, and Processing of Large Biomedical Data Sets.",
                    "Three-Dimensional Data Analytics for Pathology Imaging.",
                    "Automated Analysis of Muscle X-ray Diffraction Imaging with MCMC.",
                    "SparkGIS: Efficient Comparison and Evaluation of Algorithm Results in Tissue Image Analysis Studies.",
                    "Social Network Analytics: Beyond the Obvious.",
                    "S2X: Graph-Parallel Querying of RDF with GraphX.",
                    "The Time Has Come: Traversal and Reachability in Time-Varying Graphs.",
                    "Robust Cardinality Estimation for Subgraph Isomorphism Queries on Property Graphs."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "40th VLDB 2014",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2014bpoe",
                "sub_name": "Big Data Benchmarks, Performance Optimization, and Emerging Hardware - 4th and 5th Workshops, BPOE 2014, Salt Lake City, USA, March 1, 2014 and Hangzhou, China, September 5, 2014, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "On Big Data Benchmarking.",
                    "A Micro-benchmark Suite for Evaluating Hadoop MapReduce on High-Performance Networks.",
                    "MemTest: A Novel Benchmark for In-memory Database.",
                    "DSIMBench: A Benchmark for Microarray Data Using R.",
                    "A Benchmark to Evaluate Mobile Video Upload to Cloud Infrastructures.",
                    "Benchmarking Replication and Consistency Strategies in Cloud Serving Databases: HBase and Cassandra.",
                    "I/O Characterization of Big Data Workloads in Data Centers.",
                    "Characterizing Workload of Web Applications on Virtualized Servers.",
                    "Performance Benefits of DataMPI: A Case Study with BigDataBench.",
                    "InvarNet-X: A Comprehensive Invariant Based Approach for Performance Diagnosis in Big Data Platform.",
                    "Tuning Hadoop Map Slot Value Using CPU Metric.",
                    "A Study of SQL-on-Hadoop Systems.",
                    "Predoop: Preempting Reduce Task for Job Execution Accelerations.",
                    "Record Placement Based on Data Skew Using Solid State Drives.",
                    "Efficient HTTP Based I/O on Very Large Datasets for High Performance Computing with the Libdavix Library.",
                    "Exploring Opportunities for Non-volatile Memories in Big Data Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2014data4u",
                "sub_name": "Proceedings of the First International Workshop on Bringing the Value of \"Big Data\" to Users, Data4U@VLDB 2014, Hangzhou, China, September 1, 2014.",
                "count": 6,
                "papers": [
                    "DiNoDB: Efficient Large-Scale Raw Data Analytics.",
                    "A Paradigm for Learning Queries on Big Data.",
                    "Improving package recommendations through query relaxation.",
                    "Affordable Analytics on Expensive Data.",
                    "Taming Big Data: Integrating diverse public data sources for economic competitiveness analytics.",
                    "An Efficient Processing of k-Dominant Skyline Query in MapReduce."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "39th VLDB 2013",
        "info": "Riva del Garda, Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2013bd3",
                "sub_name": "Proceedings of the First International Workshop on Big Dynamic Distributed Data, Riva del Garda, Italy, August 30, 2013.",
                "count": 11,
                "papers": [
                    "Safe-Zones for Monitoring Distributed Streams.",
                    "Communication-Efficient Distributed Online Prediction using Dynamic Model Synchronizations.",
                    "Communication-efficient Outlier Detection for Scale-out Systems.",
                    "Elastic Complex Event Processing under Varying Query Load.",
                    "Adaptive Selective Replication for Complex Event Processing Systems.",
                    "Dynamic Partitioning of Big Hierarchical Graphs.",
                    "Scalable and Robust Management of Dynamic Graph Data.",
                    "Towards Elastic Stream Processing: Patterns and Infrastructure.",
                    "Task Graphs of Stream Mining Algorithms.",
                    "Large-scale Online Mobility Monitoring with Exponential Histograms.",
                    "Multi-Stage Malicious Click Detection on Large Scale Web Advertising Data."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2013ssw",
                "sub_name": "3RD International Workshop on Semantic Search over the Web, SSW '13, Riva del Garda, Italy, August 30, 2013.",
                "count": 7,
                "papers": [
                    "Automatic web spreadsheet data extraction.",
                    "Discovering attribute and entity synonyms for knowledge integration and semantic web search.",
                    "A framework for guided search of mashup components.",
                    "Recommendation of text tags using linked data.",
                    "Supporting semantic web search and structured queries on mobile devices.",
                    "Towards a folksonomy of web APIs.",
                    "Effectively and efficiently supporting crowd-enabled databases via NoSQL paradigms."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2013dbrank",
                "sub_name": "7th International Workshop on Ranking in Databases (co-located with VLDB 2013), DBRank 2013, Riva del Garda, Italy - August 30 - 30, 2013.",
                "count": 8,
                "papers": [
                    "Spatial keyword querying of geo-tagged web content.",
                    "Entwining structure into web search.",
                    "A thin monitoring layer for top-k aggregation queries over a database.",
                    "On the modelling of ranking algorithms in probabilistic datalog.",
                    "Ranking and new database architectures.",
                    "Progressive ranking based on a dominance list.",
                    "Wearable queries: adapting common retrieval needs to data and users.",
                    "Keyword search and evaluation over relational databases: an outlook to the future."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "38th VLDB 2012",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2012ssw",
                "sub_name": "Proceedings of the 2nd International Workshop on Semantic Search over the Web, Istanbul, Turkey, August 27, 2012.",
                "count": 6,
                "papers": [
                    "Colledge: a vision of collaborative knowledge networks.",
                    "Towards a similarity-based web service discovery through soft constraint satisfaction problems.",
                    "Exploratory search upon semantically described web data sources.",
                    "A classification of web API selection solutions over the linked web.",
                    "Enhancing the famous people ontology by mining a social network.",
                    "Searching semantic data warehouses: models, issues, architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/immoa/2012",
                "sub_name": "Proceedings of the 2nd International Workshop on Information Management for Mobile Applications, Istanbul, Turkey, August 31, 2012.",
                "count": 7,
                "papers": [
                    "Dynamic Context Management for Mobile Applications.",
                    "A Hierarchical Approach to Resource Awareness in DHTs for Mobile Data Management.",
                    "Towards an Ambient Data Mediation System.",
                    "Context-Aware Routing Method for P2P File Sharing Systems over MANET.",
                    "Considering the High Level Critical Situations in Context-Aware Recommender Systems.",
                    "Privacy Preservation for Location-Based Services Based on Attribute Visibility.",
                    "Applying Pervasive and Flexible Access Control to Distributed Multimedia Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "37th VLDB 2011",
        "info": "Seattle, Washington, USA",
        "venues": []
    },
    {
        "year": "2010",
        "name": "36th VLDB 2010",
        "info": "Singapore",
        "venues": []
    },
    {
        "year": "2009",
        "name": "35th VLDB 2009",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/red/2009",
                "sub_name": "Resource Discovery, Second International Workshop, RED 2009, Lyon, France, August 28, 2009. Revised Papers.",
                "count": 9,
                "papers": [
                    "Immune-Inspired Method for Selecting the Optimal Solution in Web Service Composition.",
                    "Web Database Schema Identification through Simple Query Interface.",
                    "Semantic Interoperability and Dynamic Resource Discovery in P2P Systems.",
                    "Data Source Management and Selection for Dynamic Data Integration.",
                    "A Provenance-Based Approach to Resource Discovery in Distributed Molecular Dynamics Workflows.",
                    "On Building a Search Interface Discovery System.",
                    "Building Specialized Multilingual Lexical Graphs Using Community Resources.",
                    "An Efficient Semantic Web Services Matching Mechanism.",
                    "Efficiently Selecting the Best Web Services."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2009phd",
                "sub_name": "Proceedings of the VLDB 2009 PhD Workshop. Co-located with the 35th International Conference on Very Large Data Bases (VLDB 2009). Lyon, France, August 24, 2009.",
                "count": 13,
                "papers": [
                    "Towards Semantic Trajectory Data Analysis: A Conceptual and Computational Approach.",
                    "Using Index Structures for Anytime Stream Mining.",
                    "Mobility Data Warehousing and Mining.",
                    "METL: Managing and Integrating ETL Processes.",
                    "Usability and Expressiveness in Database Keyword Search: Bridging the Gap.",
                    "DataCell: Building a Data Stream Engine on top of a Relational Database Kernel.",
                    "Composing Data-Providing Web Services.",
                    "Leveraging P2P overlays for Large-scale and Highly Robust Content Distribution and Search.",
                    "Efficient Management of Multidimensional Data in Structured Peer-to-peer Overlays.",
                    "Synergy-based Workload Management.",
                    "Towards Low Carbon Similarity Search with Compressed Sketches.",
                    "Framework-Based Development and Evaluation of Cost-Based Native XML Query Optimization Techniques.",
                    "Similarity-aware Query Processing and Optimization."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "34th VLDB 2008",
        "info": "Auckland, New Zealand",
        "venues": []
    },
    {
        "year": "2007",
        "name": "33rd VLDB 2007",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2007",
                "sub_name": "Proceedings of the 33rd International Conference on Very Large Data Bases, University of Vienna, Austria, September 23-27, 2007.",
                "count": 161,
                "papers": [
                    "Cover Page.",
                    "Sponsors.",
                    "Copyright Notice.",
                    "Welcome Message from the General Chairs.",
                    "Foreword from the PC Chairs.",
                    "Conference Officers.",
                    "Program Committees and External Reviewers.",
                    "VLDB Endowment Board of Trustees.",
                    "Table of Contents (pdf).",
                    "Data Access Patterns in The Amazon.com Technology Platform.",
                    "Technology for Developing Regions.",
                    "Self-Tuning Database Systems: A Decade of Progress.",
                    "Probabilistic Skylines on Uncertain Data.",
                    "Matching Twigs in Probabilistic XML.",
                    "OLAP over Imprecise Data with Domain Constraints.",
                    "Materialized Views in Probabilistic Databases for Information Exchange and Query Optimization.",
                    "LCS-TRIM: Dynamic Programming Meets XML Indexing and Querying.",
                    "Extending XQuery with Window Functions.",
                    "Structured Materialized Views for XML Queries.",
                    "XRPC: Interoperable and Efficient Distributed XQuery.",
                    "Security in Outsourcing of Association Rule Mining.",
                    "Over-encryption: Management of Access Control Evolution on Outsourced Data.",
                    "CADS: Continuous Authentication on Data Streams.",
                    "Proof-Infused Streams: Enabling Authentication of Sliding Window Queries On Streams.",
                    "Staying FIT: Efficient Load Shedding Techniques for Distributed Stream Processing.",
                    "A Simple and Efficient Estimation Method for Stream Expression Cardinalities.",
                    "Ad-hoc Top-k Query Answering for Data Streams.",
                    "Extending Q-Grams to Estimate Selectivity of String Matching with Low Edit Distance.",
                    "Fast nGram-Based String Search Over Data Encoded Using Algebraic Signatures.",
                    "Effective Phrase Prediction.",
                    "Lazy Maintenance of Materialized Views.",
                    "Extending Dependencies with Conditions.",
                    "Unifying Data and Domain Knowledge Using Virtual Views.",
                    "Efficient Skyline Computation over Low-Cardinality Domains.",
                    "Approaching the Skyline in Z Order.",
                    "Efficient Computation of Reverse Skyline Queries.",
                    "VGRAM: Improving Performance of Approximate Queries on String Collections Using Variable-Length Grams.",
                    "Improving Data Quality: Consistency and Accuracy.",
                    "Example-driven design of efficient record matching queries.",
                    "Adaptive Aggregation on Chip Multiprocessors.",
                    "To Share or Not To Share?",
                    "Executing Stream Joins on the Cell Processor.",
                    "RankMass Crawler: A Crawler with High PageRank Coverage Guarantee.",
                    "EntityRank: Searching Entities Directly and Holistically.",
                    "Building Structured Web Community Portals: A Top-Down, Compositional, and Incremental Approach.",
                    "Scalable Semantic Web Data Management Using Vertical Partitioning.",
                    "Ranked Subsequence Matching in Time-Series Databases.",
                    "Indexable PLA for Efficient Similarity Search.",
                    "Mining Approximate Top-K Subspace Anomalies in Multi-Dimensional Time-Series Data.",
                    "Time Series Compressibility and Privacy.",
                    "A Bayesian Method for Guessing the Extreme Values in a Data Set.",
                    "Efficient Processing of Top-k Dominating Queries on Multi-Dimensional Data.",
                    "Best Position Algorithms for Top-k Queries.",
                    "Sum-Max Monotonic Ranked Joins for Evaluating Top-K Twig Queries on Weighted Data Graphs.",
                    "Answering Aggregation Queries in a Secure System Model.",
                    "The Boundary Between Privacy and Utility in Data Publishing.",
                    "Minimality Attack in Privacy Preserving Data Publishing.",
                    "On the Correctness Criteria of Fine-Grained Access Control in Relational Databases.",
                    "Modeling and Querying Vague Spatial Objects Using Shapelets.",
                    "On Efficient Spatial Matching.",
                    "Main-Memory Operation Buffering for Efficient R-Tree Update.",
                    "Monitoring Business Processes with Queries.",
                    "An Approach to Optimize Data Processing in Business Processes.",
                    "Reasoning about the Behavior of Semantic Web Services with Concurrent Transaction Logic.",
                    "Randomized Algorithms for Data Reconciliation in Wide Area Aggregate Query Processing.",
                    "Query Processing over Incomplete Autonomous Databases.",
                    "iTrails: Pay-as-you-go Information Integration in Dataspaces.",
                    "Update Exchange with Mappings and Provenance.",
                    "Data Integration with Uncertainty.",
                    "Context-Aware Wrapping: Synchronized Data Extraction.",
                    "Processing Forecasting Queries.",
                    "Cooperative Scans: Dynamic Bandwidth Sharing in a DBMS.",
                    "Stop-and-Restart Style Execution for Long Running Decision Support Queries.",
                    "K-Anonymization as Spatial Indexing: Toward Scalable and Incremental Anonymization.",
                    "Fast Data Anonymization with Low Information Loss.",
                    "Privacy Skyline: Privacy with Multidimensional Adversarial Knowledge.",
                    "Integrity Auditing of Outsourced Data.",
                    "Adaptive Fastest Path Computation on a Road Network: A Traffic Mining Approach.",
                    "Seeking Stable Clusters in the Blogosphere.",
                    "On Dominating Your Neighborhood Profitably.",
                    "Detecting Attribute Dependencies from Query Feedback.",
                    "Making Sense of Suppressions and Failures in Sensor Data: A Bayesian Approach.",
                    "MIST: Distributed Indexing and Querying in Sensor Networks using Statistical Models.",
                    "Early Profile Pruning on XML-aware Publish/Subscribe Systems.",
                    "Value-Based Notification Conditions in Large-Scale Publish/Subscribe Systems.",
                    "Efficiently Answering Top-k Typicality Queries on Large Databases.",
                    "Depth Estimation for Ranking Query Optimization.",
                    "Anytime Measures for Top-k Algorithms.",
                    "Towards Graph Containment Search and Indexing.",
                    "Graph Indexing: Tree + Delta >= Graph.",
                    "Multi-Probe LSH: Efficient Indexing for High-Dimensional Similarity Search .",
                    "STAR: Self-Tuning Aggregation for Scalable Monitoring.",
                    "SQLB: A Query Allocation Framework for Autonomous Consumers and Providers.",
                    "Peer-to-Peer Similarity Search in Metric Spaces.",
                    "Inferring XML Schema Definitions from XML Data.",
                    "Querying Complex Structured Databases.",
                    "Measuring the Structural Similarity of Semistructured Documents Using Entropy.",
                    "Declarative Information Extraction Using Datalog with Embedded Extraction Predicates.",
                    "A Relational Approach to Incrementally Extracting and Querying Structure in Unstructured Data.",
                    "Efficient Keyword Search over Virtual XML Views.",
                    "A General Framework for Modeling and Processing Optimization Queries.",
                    "On the Production of Anorexic Plan Diagrams.",
                    "Efficient Use of the Query Optimizer for Automated Database Design.",
                    "Dynamic Workload Management for Very Large Data Warehouses: Juggling Feathers and Bowling Balls.",
                    "Tracing Lineage Beyond Relational Operators.",
                    "A Generic solution for Warehousing Business Process Data.",
                    "Why You Should Run TPC-DS: A Workload Analysis.",
                    "The End of an Architectural Era (It's Time for a Complete Rewrite).",
                    "Computer Science 2.0: A New World of Data Management.",
                    "RadixZip: Linear-Time Compression of Token Streams.",
                    "Continuous Queries in Oracle.",
                    "Challenges and Experience in Prototyping a Multi-Modal Stream Analytic and Monitoring Application on System S.",
                    "Efficient Bulk Deletes for Multi Dimensionally Clustered Tables in DB2.",
                    "Supporting Time-Constrained SQL Queries in Oracle.",
                    "Request Window: an Approach to Improve Throughput of RDBMS-based Data Integration System by Utilizing Data Sharing Across Concurrent Distributed Queries.",
                    "Inverse Functions in the AquaLogic Data Services Platform.",
                    "A genetic approach for random testing of database systems.",
                    "Bridging the Application and DBMS Profiling Divide for Database Application Developers.",
                    "Automating the Detection of Snapshot Isolation Anomalies.",
                    "Optimization of Frequent Itemset Mining on Multiple-Core Processor.",
                    "CellSort: High Performance Sorting on the Cell Processor.",
                    "Increasing Buffer-Locality for Multiple Index Based Scans through Intelligent Placement and Index Scan Speed Control.",
                    "SciPort: An Adaptable Scientific Data Integration Platform for Collaborative Scientific Research.",
                    "DataScope: Viewing Database Contents in Google Maps' Way.",
                    "XBenchMatch: a Benchmark for XML Schema Matching Tools.",
                    "GeRoMeSuite: A System for Holistic Generic Model Management.",
                    "Semi-Automatic Schema Integration in Clio.",
                    "XSeek: A Semantic XML Search Engine Using Keywords.",
                    "Self-Organizing Schema Mappings in the GridVine Peer Data Management System.",
                    "CallAssist: Helping Call Center Agents in Preference Elicitation.",
                    "NS2: Networked Searchable Store with Correctness.",
                    "GhostDB: Hiding Data from Prying Eyes.",
                    "FuSem - Exploring Different Semantics of Data Fusion.",
                    "IndeGS: Index Supported Graphics Data Server for CFD Data Postprocessing.",
                    "A STEP Towards Realizing Codd's Vision of Rendezvous with the Casual User.",
                    "TRAX - Real-World Tracking of Moving Objects.",
                    "Zoom*UserViews: Querying Relevant Provenance in Workflow Systems.",
                    "DAMIA - A Data Mashup Fabric for Intranet Applications.",
                    "UQLIPS: A Real-time Near-duplicate Video Clip Detection System.",
                    "The GCX System: Dynamic Buffer Minimization in Streaming XQuery Evaluation.",
                    "A Cost-Estimation Component for Statement Sequences.",
                    "Eliminating Impedance Mismatch in C++.",
                    "Large Scale P2P Distribution of Open-Source Software.",
                    "HiSbase: Histogram-based P2P Main Memory Data Management.",
                    "P2P Authority Analysis for Social Communities.",
                    "SOR: A Practical System for Ontology Storage, Reasoning and Search.",
                    "Periscope/SQ: Interactive Exploration of Biological Sequence Databases.",
                    "BlogScope: A System for Online Analysis of High Volume Text Streams.",
                    "FluxCapacitor: Efficient Time-Travel Text Search.",
                    "Deadline and QoS Aware Data Warehouse.",
                    "Query language support for incomplete information in the MayBMS system.",
                    "Adaptive query processing: Why, How, When, and What Next?",
                    "Raster databases.",
                    "From Data Privacy to Location Privacy: Models and Algorithms.",
                    "Secure Data Outsourcing.",
                    "Regulatory-Compliant Data Management.",
                    "Probabilistic Graphical Models and their Role in Databases.",
                    "XML retrieval: db/ir in theory, web in practice.",
                    "Model Management and Schema Mappings: Theory and Practice.",
                    "Performance Evaluation and Experimental Assessment - Conscience or Curse of Database Research?",
                    "What does Web 2.0 have to do with databases?"
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "32nd VLDB 2006",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2006",
                "sub_name": "Proceedings of the 32nd International Conference on Very Large Data Bases, Seoul, Korea, September 12-15, 2006.",
                "count": 136,
                "papers": [
                    "Enterprise Information Mashups: Integrating Information, Simply.",
                    "Next Generation Data Management in Enterprise Application Platforms.",
                    "Data Integration: The Teenage Years.",
                    "Safety Guarantee of Continuous Join Queries over Punctuated Data Streams.",
                    "Scalable Continuous Query Processing by Tracking Hotspots.",
                    "Continuous Nearest Neighbor Monitoring in Road Networks.",
                    "Implementing Mapping Composition.",
                    "Nested Mappings: Schema Mapping Reloaded.",
                    "Debugging Schema Mappings with Routes.",
                    "A Linear Time Algorithm for Optimal Tree Sibling Partitioning and Approximation Algorithms in Natix.",
                    "Efficient Discovery of XML Data Redundancies.",
                    "Inference of Concise DTDs from XML Data.",
                    "Efficient Secure Query Evaluation over Encrypted XML Databases.",
                    "Anatomy: Simple and Effective Privacy Preservation.",
                    "Towards Robustness in Query Auditing.",
                    "Adaptive Cleaning for RFID Data Streams.",
                    "A Deferred Cleansing Method for RFID Data Analytics.",
                    "Online Outlier Detection in Sensor Data Using Non-Parametric Models.",
                    "Relaxing Join and Selection Queries.",
                    "Using Partial Evaluation in Distributed Query Evaluation.",
                    "TRAC: Toward Recency and Consistency Reporting in a Database with Distributed Data Sources.",
                    "Towards Robust Indexing for Ranked Queries.",
                    "An Incrementally Maintainable Index for Approximate Lookups in Hierarchical Data.",
                    "FIX: Feature-based Indexing Technique for XML Documents.",
                    "Type-Based XML Projection.",
                    "Twig2Stack: Bottom-up Processing of Generalized-Tree-Pattern Queries over XML Documents.",
                    "An Algebraic Query Model for Effective and Efficient Retrieval of XML Fragments.",
                    "Putting Context into Schema Matching.",
                    "Schema Summarization.",
                    "Multi-column Substring Matching for Database Schema Translation.",
                    "Querying Business Processes.",
                    "Query Optimization over Web Services.",
                    "iDM: A Unified and Versatile Data Model for Personal Dataspace Management.",
                    "CURE for Cubes: Cubing Using a ROLAP Engine.",
                    "Efficient Allocation Algorithms for OLAP Over Imprecise Data.",
                    "Composite Subset Measures.",
                    "Efficient and Decentralized PageRank Approximation in a Peer-to-Peer Web Search Network.",
                    "LinkClus: Efficient Clustering via Heterogeneous Semantic Links.",
                    "Link Spam Detection Based on Mass Estimation.",
                    "Answering Top-k Queries Using Views.",
                    "Answering Top-k Queries with Multi-Dimensional Selections: The Ranking Cube Approach.",
                    "IO-Top-k: Index-access Optimized Top-k Query Processing.",
                    "Performance Tradeoffs in Read-Optimized Databases.",
                    "To Tune or not to Tune? A Lightweight Physical Design Alerter.",
                    "Efficient Scheduling of Heterogeneous Continuous Queries.",
                    "Indexing for Function Approximation.",
                    "Active and Accelerated Learning of Cost Models for Optimizing Scientific Applications.",
                    "Adaptive Execution of Variable-Accuracy Functions.",
                    "AFilter: Adaptable XML Filtering with Prefix-Caching and Suffix-Clustering.",
                    "Answering Tree Pattern Queries Using Views.",
                    "Maintaining XPath Views In Loosely Coupled Systems.",
                    "A Dip in the Reservoir: Maintaining Sample Synopses of Evolving Datasets.",
                    "On Biased Reservoir Sampling in the Presence of Stream Evolution.",
                    "State-Slice: New Paradigm of Multi-query Optimization of Window-based Stream Queries.",
                    "Similarity Search: A Matching Based Approach.",
                    "Progressive Computation of the Min-Dist Optimal-Location Query.",
                    "Bellwether Analysis: Predicting Global Aggregates from Local Regions.",
                    "Efficiently Linking Text Documents with Relevant Structured Information.",
                    "Meaningful Labeling of Integrated Query Interfaces.",
                    "GORDIAN: Efficient and Scalable Discovery of Composite Keys.",
                    "An Integrated Approach to Recovery and High Availability in an Updatable, Distributed Data Warehouse.",
                    "Lazy Database Replication with Snapshot Isolation.",
                    "Delay Aware Querying with Seaweed.",
                    "Full Disjunctions: Polynomial-Delay Iterators in Action.",
                    "The Spatial Skyline Queries.",
                    "The New Casper: Query Processing for Location Services without Compromising Privacy.",
                    "Providing Resiliency to Load Variations in Distributed Stream Processing.",
                    "Load Shedding in Stream Databases: A Control-Based Approach.",
                    "Window-Aware Load Shedding for Aggregation Queries over Data Streams.",
                    "Mining Frequent Closed Cubes in 3D Datasets.",
                    "Efficient Incremental Maintenance of Data Cubes.",
                    "FlowCube: Constructuing RFID FlowCubes for Multi-Dimensional Analysis of Commodity Flows.",
                    "Approximate Encoding for Direct Access and Query Processing over Compressed Bitmaps.",
                    "How to Wring a Table Dry: Entropy Compression of Relations and Querying of Compressed Relations.",
                    "Compact Histograms for Hierarchical Identifiers.",
                    "LB_Keogh Supports Exact Indexing of Shapes under Rotation Invariance with Arbitrary Representations and Distance Measures.",
                    "Distance Indexing on Road Networks.",
                    "Reference-based Indexing of Sequence Databases.",
                    "Efficient Exact Set-Similarity Joins.",
                    "Analysis of Two Existing and One New Dynamic Programming Algorithm for the Generation of Optimal Bushy Join Trees without Cross Products.",
                    "Containment of Conjunctive Object Meta-Queries.",
                    "ULDBs: Databases with Uncertainty and Lineage.",
                    "Creating Probabilistic Databases from Information Extraction Models.",
                    "Quality Views: Capturing and Exploiting the User Perspective on Data Quality.",
                    "Automatic Extraction of Dynamic Record Sections From Search Engine Result Pages.",
                    "Trustworthy Keyword Search for Regulatory-Compliant Record Retention.",
                    "Efficient Detection of Empty-Result Queries.",
                    "Cost-Based Query Transformation in Oracle.",
                    "Query Processing in the AquaLogic Data Services Platform.",
                    "The Making of TPC-DS.",
                    "Data Mining with the SAP Netweaver BI Accelerator.",
                    "Contest of XML Lock Protocols.",
                    "Adaptive Self-tuning Memory in DB2.",
                    "Mapping Moving Landscapes by Mining Mountains of Logs: Novel Techniques for Dependency Model Generation.",
                    "IT839 Policy Leading to u-Korea.",
                    "Home Network: Road to Ubiquitous World.",
                    "Advances in Memory Technology.",
                    "Efficient XSLT Processing in Relational Database System.",
                    "On the Path to Efficient XML Queries.",
                    "Building Conference Proceedings Requires Adaptable Workflow and Content Management.",
                    "Globalization: Challenges to Database Community.",
                    "NUITS: A Novel User Interface for Efficient Keyword Search over Databases.",
                    "IPAC - An Interactive Approach to Access Control for Semi-structured Data.",
                    "Trio: A System for Data, Uncertainty, and Lineage.",
                    "SIREN: A Similarity Retrieval Engine for Complex Data.",
                    "AQAX: A System for Approximate XML Query Answers.",
                    "PARAgrab: A Comprehensive Architecture for Web Image Management and Multimodal Querying.",
                    "Incremental Schema Matching.",
                    "A Semantic Information Integration Tool Suite.",
                    "POP/FED: Progressive Query Optimization for Federated Queries in DB2.",
                    "SPIDER: a Schema mapPIng DEbuggeR.",
                    "OntoQuest: Exploring Ontological Data Made Easy.",
                    "HISA: A Query System Bridging The Semantic Gap For Large Image Databases.",
                    "Adaptive Density Estimation.",
                    "GMine: A System for Scalable, Interactive Graph Visualization and Mining.",
                    "A Middleware for Fast and Flexible Sensor Network Deployment.",
                    "Entirely Declarative Sensor Network Systems.",
                    "R-SOX: Runtime Semantic Query Optimization over XML Streams.",
                    "Using High Dimensional Indexes to Support Relevance Feedback Based Interactive Images Retrival.",
                    "XML Evolution: A Two-phase XML Processing Model Using XML Prefiltering Techniques.",
                    "myPortal: Robust Extraction and Aggregation of Web Content.",
                    "EOS2: Unstoppable Stateful PHP.",
                    "SMOQE: A System for Providing Secure Access to XML.",
                    "Crimson: A Data Management System to Support Evaluating Phylogenetic Tree Reconstruction Algorithms.",
                    "HUX: Handling Updates in XML.",
                    "InteMon: Intelligent System Monitoring on Large Clusters.",
                    "Simple and Realistic Data Generation.",
                    "XCheck: A Platform for Benchmarking XQuery Engines.",
                    "GignoMDA - Exploiting Cross-Layer Optimization for Complex Database Applications.",
                    "LGeDBMS: A Small DBMS for Embedded System with Flash Memory.",
                    "Panel: One Platform for Mining Structured & Unstructured Data: Dream or Reality?",
                    "Foundations of Automated Database Tuning.",
                    "Streaming in a Connected World.",
                    "Query Co-Processing on Commodity Processors.",
                    "A Decade of Progress in Indexing and Mining Large Time Series Databases.",
                    "Randomized Algorithms for Matrices and Massive Data Sets."
                ]
            },
            {
                "sub_name_abbr": "conf/cleandb/2006",
                "sub_name": "Proceedings of the First Int'l VLDB Workshop on Clean Databases, CleanDB 2006, September 11, 2006, Seoul, Korea (Co-located with VLDB 2006).",
                "count": 10,
                "papers": [
                    "Structure Aware XML Object Identification.",
                    "QUEST: QUery-driven Exploration of Semistructured Data with ConflicTs and Partial Knowledge.",
                    "Column Heterogeneity as a Measure of Data Quality.",
                    "Generic Entity Resolution with Data Confidences.",
                    "Circumventing Data Quality Problems Using Multiple Join Paths.",
                    "In-network Outlier Cleaning for Data Collection in Sensor Networks.",
                    "The Bellman Data Quality Browser.",
                    "Data Cleaning for Decision Support.",
                    "Efficiently Filtering RFID Data Streams.",
                    "Cleansing Databases of Misspelled Proper Nouns."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "31st VLDB 2005",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2005",
                "sub_name": "Proceedings of the 31st International Conference on Very Large Data Bases, Trondheim, Norway, August 30 - September 2, 2005.",
                "count": 142,
                "papers": [
                    "Why Search Engines are Used Increasingly to Offload Queries from Databases.",
                    "Database-Inspired Search.",
                    "Sketching Streams Through the Net: Distributed Approximate Query Tracking.",
                    "Summarizing and Mining Inverse Distributions on Data Streams via Dynamic Inverse Sampling.",
                    "Adaptive Stream Filters for Entity-based Queries with Non-Value Tolerance.",
                    "Improving Database Performance on Simultaneous Multithreading Processors.",
                    "Parallel Querying with Non-Dedicated Computers.",
                    "Optimistic Intra-Transaction Parallelism on Chip Multiprocessors.",
                    "Information Preserving XML Schema Embedding.",
                    "Light-weight Domain-based Form Assistant: Querying Web Databases On the Fly.",
                    "Designing Information-Preserving Mapping Schemes for XML.",
                    "Rewriting XPath Queries Using Materialized Views.",
                    "Benefits of Path Summaries in an XML Query Optimizer Supporting Multiple Access Methods.",
                    "Efficient Processing of XML Path Queries Using the Disk-based F&B Index.",
                    "Customizable Parallel Execution of Scientific Stream Queries.",
                    "Using Association Rules for Fraud Detection in Web Advertising Networks.",
                    "Parameter Free Bursty Events Detection in Text Streams.",
                    "From Region Encoding To Extended Dewey: On Efficient Processing of XML Twig Pattern Matching.",
                    "Tree-Pattern Queries on a Lightweight XML Processor.",
                    "FiST: Scalable XML Document Filtering by Sequencing Twig Patterns.",
                    "Maximal Vector Computation in Large Data Sets.",
                    "Efficient Computation of the Skyline Cube.",
                    "Catching the Best Views of Skyline: A Semantic Approach Based on Decisive Subspaces.",
                    "Efficient Evaluation of XQuery over Streaming Data.",
                    "Semantic Query Optimization for XQuery over XML Streams.",
                    "Statistical Learning Techniques for Costing XML Queries.",
                    "Approximate Matching of Hierarchical Data Using pq-Grams.",
                    "The TEXTURE Benchmark: Measuring Performance of Text Queries on a Relational DBMS.",
                    "n-Gram/2L: A Space and Time Efficient Two-Level n-Gram Inverted Index Structure.",
                    "Query Translation from XPath to SQL in the Presence of Recursive DTDs.",
                    "Pattern Tree Algebras: Sets or Sequences?",
                    "Structure and Content Scoring for XML.",
                    "Consistently Estimating the Selectivity of Conjuncts of Predicates.",
                    "Efficiently Processing Queries on Interval-and-Value Tuples in Relational Databases.",
                    "Selectivity Estimation for Fuzzy String Predicates in Large Data Sets.",
                    "Space Efficiency in Synopsis Construction Algorithms.",
                    "One-Pass Wavelet Synopses for Maximum-Error Metrics.",
                    "MDL Summarization with Holes.",
                    "View Matching for Outer-Join Views.",
                    "Caching with 'Good Enough' Currency, Consistency, and Completeness.",
                    "Query Caching and View Selection for XML Databases.",
                    "Optimizing Nested Queries with Parameter Sort Orders.",
                    "Stack-based Algorithms for Pattern Matching on DAGs.",
                    "Bidirectional Expansion For Keyword Search on Graph Databases.",
                    "Link Spam Alliances.",
                    "The SphereSearch Engine for Unified Ranked Retrieval of Heterogeneous XML and Web Documents.",
                    "Hubble: An Advanced Dynamic Folder Technology for XML.",
                    "C-Store: A Column-oriented DBMS.",
                    "Fine-Grained Replication and Scheduling with Freshness and Correctness Guarantees.",
                    "Cache-conscious Frequent Pattern Mining on a Modern Processor.",
                    "Parallel Execution of Test Runs for Database Application Systems.",
                    "Query Execution Assurance for Outsourced Databases.",
                    "Automatic Composition of Transition-based Semantic Web Services with Messaging.",
                    "An Efficient and Versatile Query Engine for TopX Search.",
                    "KLEE: A Framework for Distributed Top-k Query Algorithms.",
                    "Scaling and Time Warping in Time Series Querying.",
                    "BATON: A Balanced Tree Structure for Peer-to-Peer Networks.",
                    "Client Assignment in Content Dissemination Networks for Dynamic Data.",
                    "Indexing Data-oriented Overlay Networks.",
                    "Streaming Pattern Discovery in Multiple Time-Series.",
                    "Mining Compressed Frequent-Pattern Sets.",
                    "Discovering Large Dense Subgraphs in Massive Graphs.",
                    "General Purpose Database Summarization.",
                    "Online Estimation For Subset-Based SQL Queries.",
                    "Content-Based Routing: Different Plans for Different Data.",
                    "REED: Robust, Efficient Filtering and Event Detection in Sensor Networks.",
                    "Shuffling a Stacked Deck: The Case for Partially Randomized Ranking of Search Engine Results.",
                    "Indexing Mixed Types for Approximate Retrieval.",
                    "Answering Queries from Statistics and Probabilistic Views.",
                    "Inspector Joins.",
                    "Revisiting Pipelined Parallelism in Multi-Join Query Processing.",
                    "Early Hash Join: A Configurable Algorithm for the Efficient and Early Production of Join Results.",
                    "On Map-Matching Vehicle Tracking Data.",
                    "An Efficient and Scalable Approach to CNN Queries in a Road Network.",
                    "Complex Spatio-Temporal Pattern Queries.",
                    "Distributed Privacy Preserving Information Sharing.",
                    "On k-Anonymity and the Curse of Dimensionality.",
                    "Checking for k-Anonymity Violation by Views.",
                    "Indexing Multi-Dimensional Uncertain Data with Arbitrary Probability Density Functions.",
                    "A Trajectory Splitting Model for Efficient Spatio-Temporal Indexing.",
                    "On Computing Top-t Most Influential Spatial Sites.",
                    "Efficient Implementation of Large-Scale Multi-Structural Databases.",
                    "OLAP Over Uncertain and Imprecise Data.",
                    "Prediction Cubes.",
                    "Tuning Schema Matching Software using Synthetic Scenarios.",
                    "Semantic Adaptation of Schema Mappings when Schemas Evolve.",
                    "Mapping Maintenance for Data Integration Systems.",
                    "Bridging the Gap between OLAP and SQL.",
                    "Optimizing Refresh of a Set of Materialized Views.",
                    "Large Scale Data Warehouses on Grid: Oracle Database 10g and HP ProLiant Systems.",
                    "The Integrated Microbial Genomes (IMG) System: A Case Study in Biological Data Management.",
                    "A Heartbeat Mechanism and Its Application in Gigascope.",
                    "Using a Fuzzy Classification Query Language for Customer Relationship Management.",
                    "Flexible Database Generators.",
                    "Recovery Principles in MySQL Cluster 5.1.",
                    "Getting Priorities Straight: Improving Linux Support for Database I/O.",
                    "Temporal Management of RFID Data.",
                    "Supporting RFID-based Item Tracking Applications in Oracle DBMS Using a Bitmap Datatype.",
                    "SVM in Oracle Database 10g: Removing the Barriers to Widespread Adoption of Support Vector Machines.",
                    "Native XML Support in DB2 Universal Database.",
                    "XQuery Implementation in a Relational Database System.",
                    "CXHist : An On-line Classification-Based Histogram for XML String Selectivity Estimation.",
                    "Consistency for Web Services Applications.",
                    "Query By Excel.",
                    "An Efficient SQL-based RDF Querying Scheme.",
                    "Analyzing Plan Diagrams of Database Query Optimizers.",
                    "Database Publication Practices.",
                    "PrediCalc: A Logical Spreadsheet Management System.",
                    "Automatic Data Fusion with HumMer.",
                    "Querying Business Processes with BP-QL.",
                    "StreamGlobe: Processing and Sharing Data Streams in Grid-Based P2P Infrastructures.",
                    "MINERVA: Collaborative P2P Search.",
                    "HePToX: Marrying XML and Heterogeneity in Your P2P Databases.",
                    "U-DBMS: A Database System for Managing Constantly-Evolving Data.",
                    "Database Change Notifications: Primitives for Efficient Database Query Result Caching.",
                    "CMS-ToPSS: Efficient Dissemination of RSS Documents.",
                    "Interactive Schema Translation with Instance-Level Mappings.",
                    "AReNA: Adaptive Distributed Catalog Infrastructure Based On Relevance Networks.",
                    "Data Sharing in the Hyperion Peer Database System.",
                    "NILE-PDT: A Phenomenon Detection and Tracking Framework for Data Stream Management Systems.",
                    "Robust Real-time Query Processing with QStream.",
                    "Loadstar: Load Shedding in Data Stream Mining.",
                    "iMeMex: Escapes from the Personal Information Jungle.",
                    "Personalizing XML Text Search in PimenT.",
                    "WISE-Integrator: A System for Extracting and Integrating Complex Web Search Interfaces of the Deep Web.",
                    "WmXML: A System for Watermarking XML Data.",
                    "Pathfinder: XQuery - The Relational Way.",
                    "MIX: A Meta-data Indexing System for XML.",
                    "ULoad: Choosing the Right Storage for Your XML Application.",
                    "A Faceted Query Engine Applied to Archaeology.",
                    "A Dynamically Adaptive Distributed System for Processing Complex Continuous Queries.",
                    "RankSQL: Supporting Ranking Queries in Relational Database Management Systems.",
                    "PSYCHO: A Prototype System for Pattern Management.",
                    "Answering Imprecise Queries over Web Databases.",
                    "ConQuer: A System for Efficient Querying Over Inconsistent Databases.",
                    "QoS-based Data Access and Placement for Federated Information Systems.",
                    "Approximate Joins: Concepts and Techniques.",
                    "Offline and Data Stream Algorithms for Efficient Computation of Synopsis Structures.",
                    "Personalized Systems: Models and Methods from an IR and DB Perspective.",
                    "Contextual Insight in Search: Enabling Technologies and Applications.",
                    "Semantic Overlay Networks.",
                    "XML Full-Text Search: Challenges and Opportunities."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "30th VLDB 2004",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2004",
                "sub_name": "(e)Proceedings of the Thirtieth International Conference on Very Large Data Bases, VLDB 2004, Toronto, Canada, August 31 - September 3 2004.",
                "count": 150,
                "papers": [
                    "Databases in a Wireless World.",
                    "Structures, Semantics and Statistics.",
                    "Whither Data Mining?",
                    "Compressing Large Boolean Matrices using Reordering Techniques.",
                    "On the performance of bitmap indices for high cardinality attributes.",
                    "Practical Suffix Tree Construction.",
                    "Answering XPath Queries over Networks by Sending Minimal Views.",
                    "A Framework for Using Materialized XPath Views in XML Query Processing.",
                    "Schema-Free XQuery.",
                    "Client-Based Access Control Management for XML documents.",
                    "Secure XML Publishing without Information Leakage in the Presence of Data Inference.",
                    "Limiting Disclosure in Hippocratic Databases.",
                    "On Testing Satisfiability of Tree Pattern Queries.",
                    "Containment of Nested XML Queries.",
                    "Efficient XML-to-SQL Query Translation: Where to Add the Intelligence?",
                    "Taming XPath Queries by Minimizing Wildcard Steps.",
                    "The NEXT Logical Framework for XQuery.",
                    "Detecting Change in Data Streams.",
                    "Stochastic Consistency, and Scalable Pull-Based Caching for Erratic Data Sources.",
                    "False Positive or False Negative: Mining Frequent Itemsets from High Speed Transactional Data Streams.",
                    "Indexing Temporal XML Documents.",
                    "Schema-based Scheduling of Event Processors and Buffer Minimization for Queries on Structured Data Streams.",
                    "Bloom Histogram: Path Selectivity Estimation for XML Data with Updates.",
                    "XQuery on SQL Hosts.",
                    "ROX: Relational Over XML.",
                    "From XML View Updates to Relational View Updates: old solutions to a new problem.",
                    "XWAVE: Approximate Extended Wavelets for Streaming Data.",
                    "REHIST: Relative Error Histogram Construction Algorithms.",
                    "Distributed Set Expression Cardinality Estimation.",
                    "Memory-Limited Execution of Windowed Stream Joins.",
                    "Resource Sharing in Continuous Sliding-Window Aggregates.",
                    "Remembrance of Streams Past: Overload-Sensitive Management of Archived Streams.",
                    "WIC: A General-Purpose Algorithm for Monitoring Web Information Sources.",
                    "Simlarity Search for Web Services.",
                    "AWESOME - A Data Warehouse-based System for Adaptive Website Recommendations.",
                    "Accurate and Efficient Crawling for Relevant Websites.",
                    "Instance-based Schema Matching for Web Databases by Domain-specific Query Probing.",
                    "Computing PageRank in a Distributed Internet Search Engine System.",
                    "Enhancing P2P File-Sharing with an Internet-Scale Query Processor.",
                    "Online Balancing of Range-Partitioned Data with Applications to Peer-to-Peer Systems.",
                    "Networked Query Processing for Distributed Stream-Based Applications.",
                    "Data Sharing Through Query Translation in Autonomous Sources.",
                    "Linear Road: A Stream Data Management Benchmark.",
                    "Query Languages and Data Models for Database Sequences and Data Streams.",
                    "Tamper Detection in Audit Logs.",
                    "Auditing Compliance with a Hippocratic Database.",
                    "High-Dimensional OLAP: A Minimal Cubing Approach.",
                    "The Complexity of Fully Materialized Coalesced Cubes.",
                    "Relational link-based ranking.",
                    "ObjectRank: Authority-Based Keyword Search in Databases.",
                    "Combating Web Spam with TrustRank.",
                    "Model-Driven Data Acquisition in Sensor Networks.",
                    "The Design of GridDB: A Data-Centric Overlay for the Scientific Grid.",
                    "Towards an Internet-Scale XML Dissemination Service.",
                    "Efficiency-Quality Tradeoffs for Vector Score Aggregation.",
                    "Merging the Results of Approximate Match Operations.",
                    "Top-k Query Evaluation with Probabilistic Guarantees.",
                    "STEPS towards Cache-resident Transaction Processing.",
                    "Write-Optimized B-Trees.",
                    "Cache-Conscious Radix-Decluster Projections.",
                    "Clotho: Decoupling memory page layout from storage organization.",
                    "Vision Paper: Enabling Privacy for the Paranoids.",
                    "A Privacy-Preserving Index for Range Queries.",
                    "Resilient Rights Protection for Sensor Streams.",
                    "Reverse kNN Search in Arbitrary Dimensionality.",
                    "Gorder: An Efficient Method for KNN Join Processing.",
                    "Query and Update Efficient B+-Tree Based Indexing of Moving Objects.",
                    "Indexing Large Human-Motion Databases.",
                    "On The Marriage of Lp-norms and Edit Distance.",
                    "Approximate NN queries on Streams with Guaranteed Error/performance Bounds.",
                    "Object Fusion in Geographic Information Systems.",
                    "Maintenance of Spatial Semijoin Queries on Moving Points.",
                    "Voronoi-Based K Nearest Neighbor Search for Spatial Network Databases.",
                    "A Framework for Projected Clustering of High Dimensional Data Streams.",
                    "Efficient Query Evaluation on Probabilistic Databases.",
                    "Efficient Indexing Methods for Probabilistic Threshold Queries over Uncertain Data.",
                    "Probabilistic Ranking of Database Query Results.",
                    "An Annotation Management System for Relational Databases.",
                    "Symmetric Relations and Cardinality-Bounded Multisets in Database Systems.",
                    "Algebraic Manipulation of Scientific Datasets.",
                    "Multi-objective Query Processing for Database Systems.",
                    "Lifting the Burden of History from Adaptive Query Processing.",
                    "A Combined Framework for Grouping and Order Optimization.",
                    "The Case for Precision Sharing.",
                    "Returning Modified Rows - SELECT Statements with Side Effects.",
                    "PIVOT and UNPIVOT: Optimization and Execution Strategies in an RDBMS.",
                    "A Multi-Purpose Implementation of Mandatory Access Control in Relational Database Management Systems.",
                    "Hardware Acceleration in Commercial Databases: A Case Study of Spatial Operations.",
                    "P*TIME: Highly Scalable OLTP DBMS for Managing Update-Intensive Stream Workload.",
                    "Generating Thousand Benchmark Queries in Seconds.",
                    "Supporting Ontology-Based Semantic matching in RDBMS.",
                    "BioPatentMiner: An Information Retrieval System for BioMedical Patents.",
                    "Flexible String Matching Against Large Databases in Practice.",
                    "DB2 Design Advisor: Integrated Automatic Physical Database Design.",
                    "Automatic SQL Tuning in Oracle 10g.",
                    "Database Tuning Advisor for Microsoft SQL Server 2005.",
                    "Query Rewrite for XML in Oracle XML DB.",
                    "Indexing XML Data Stored in a Relational Database.",
                    "Automated Statistics Collection in DB2 UDB.",
                    "High Performance Index Build Algorithms for Intranet Search Engines.",
                    "Automated design of multidimensional clustering tables for relational databases.",
                    "Integrating Automatic Data Acquisition with Business Processes - Experiences with SAP's Auto-ID Infrastructure.",
                    "Managing RFID Data.",
                    "Production Database Systems: Making Them Easy is Hard Work.",
                    "Managing Data from High-Throughput Genomic Processing: A Case Study.",
                    "Database Challenges in the Integration of Biomedical Data Sets.",
                    "The Bloomba Personal Content Database.",
                    "Trends in Data Warehousing: A Practitioner's View.",
                    "Technology Challenges in a Data Warehouse.",
                    "Sybase IQ Multiplex - Designed For Analytics.",
                    "Biological Data Management: Research, Practice and Opportunities.",
                    "Where is Business Intelligence taking today's Database Systems?",
                    "Database Architecture for New Hardware.",
                    "Security of Shared Data in Large Systems: State of the Art and Research Directions.",
                    "Self-Managing Technology in Database Management Systems.",
                    "Architectures and Algorithms for Internet-Scale (P2P) Data Management.",
                    "The Continued Saga of DB-IR Integration.",
                    "GPX: Interactive Mining of Gene Expression Data.",
                    "Computing Frequent Itemsets Inside Oracle 10G.",
                    "StreamMiner: A Classifier Ensemble-based Engine to Mine Concept-drifting Data Streams.",
                    "Semantic Mining and Analysis of Gene Expression Data.",
                    "HOS-Miner: A System for Detecting Outlying Subspaces of High-dimensional Data.",
                    "VizTree: a Tool for Visually Mining and Monitoring Massive Time Series Databases.",
                    "An Electronic Patient Record \"on Steroids\": Distributed, Peer-to-Peer, Secure and Privacy-conscious.",
                    "Queries and Updates in the coDB Peer to Peer Database System.",
                    "A-ToPSS: A Publish/Subscribe System Supporting Imperfect Information Processing.",
                    "Efficient Constraint Processing for Highly Personalized Location Based Services.",
                    "LH*RS: A Highly Available Distributed Data Storage.",
                    "Semantic Query Optimization in an Automata-Algebra Combined XQuery Engine over XML Streams.",
                    "ShreX: Managing XML Documents in Relational Databases.",
                    "A Uniform System for Publishing and Maintaining XML Data.",
                    "An Injection of Tree Awareness: Adding Staircase Join to PostgreSQL.",
                    "FluXQuery: An Optimizing XQuery Processor for Streaming XML Data.",
                    "COMPASS: A Concept-based Web Search Engine for HTML, XML, and Deep Web Data.",
                    "Discovering and Ranking Semantic Associations over a Large RDF Metabase.",
                    "An Automatic Data Grabber for Large Web Sites.",
                    "WS-CatalogNet: An Infrastructure for Creating, Peering, and Querying e-Catalog Communities.",
                    "Trust-Serv: A Lightweight Trust Negotiation Service.",
                    "Green Query Optimization: Taming Query Optimization Overheads through Plan Recycling.",
                    "Progressive Optimization in Action.",
                    "CORDS: Automatic Generation of Correlation Statistics in DB2.",
                    "CHICAGO: A Test and Evaluation Environment for Coarse-Grained Optimization.",
                    "SVT: Schema Validation Tool for Microsoft SQL-Server.",
                    "CAPE: Continuous Query Engine with Heterogeneous-Grained Adaptivity.",
                    "HiFi: A Unified Architecture for High Fan-in Systems.",
                    "An Integration Framework for Sensor Networks and Data Stream Management Systems.",
                    "QStream: Deterministic Querying of Data Streams.",
                    "AIDA: an Adaptive Immersive Data Analyzer.",
                    "BilVideo Video Database Management System.",
                    "PLACE: A Query Processor for Handling Real-time Spatio-temporal Data Streams."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "29th VLDB 2003",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2003",
                "sub_name": "Proceedings of 29th International Conference on Very Large Data Bases, VLDB 2003, Berlin, Germany, September 9-12, 2003.",
                "count": 123,
                "papers": [
                    "A Nanotechnology-based Approach to Data Storage.",
                    "Integrating Information for On Demand Computing.",
                    "The Data-Centric Revolution in Networking.",
                    "The History of Histograms (abridged).",
                    "Complex Queries over Web Repositories.",
                    "XSEarch: A Semantic Search Engine for XML.",
                    "An Efficient and Resilient Approach to Filtering and Disseminating Streaming Data.",
                    "Efficient Mining of XML Query Patterns for Caching.",
                    "A Framework for Clustering Evolving Data Streams.",
                    "A Regression-Based Temporal Pattern Mining Scheme for Data Streams.",
                    "On the Costs of Multilingualism in Database Systems.",
                    "Distributed Top-N Query Processing with Possibly Uncooperative Local Systems.",
                    "Optimized Query Execution in Large Search Engines with Global Page Ordering.",
                    "Path Queries on Compressed XML.",
                    "On the minimization of Xpath queries.",
                    "Covering Indexes for XML Queries: Bisimulation - Simulation = Negation.",
                    "Phrase Matching in XML.",
                    "RRXF: Redundancy reducing XML storage in relations.",
                    "MARS: A System for Publishing XML from Mixed and Redundant Storage.",
                    "Projecting XML Documents.",
                    "Mixed Mode XML Query Processing.",
                    "From Tree Patterns to Generalized Tree Patterns: On Efficient Evaluation of XQuery.",
                    "Efficient Processing of Expressive Node-Selecting Queries on XML Data in Secondary Storage: A Tree Automata-based Approach.",
                    "Query Processing for High-Volume XML Message Brokering.",
                    "Holistic Twig Joins on Indexed XML Documents.",
                    "Maximizing the Output Rate of Multi-Way Join Queries over Streaming Information Sources.",
                    "Scheduling for shared window joins over data streams.",
                    "Load Shedding in a Data Stream Manager.",
                    "Querying the Internet with PIER.",
                    "Tuple Routing Strategies for Distributed Eddies.",
                    "AQuery: Query Language for Ordered Data, Optimization Techniques, and Experiments.",
                    "WISE-Integrator: An Automatic Integrator of Web Search Interfaces for E-Commerce.",
                    "SASH: A Self-Adaptive Histogram Set for Dynamically Changing Workloads.",
                    "VIPAS: Virtual Link Powered Authority Search in the Web.",
                    "Balancing Performance and Data Freshness in Web Database Servers.",
                    "Buffering Accesses to Memory-Resident Index Structures.",
                    "Data Morphing: An Adaptive, Cache-Conscious Storage Technique.",
                    "COMBI-Operator: Database Support for Data Mining Applications.",
                    "A Shrinking-Based Approach for Multi-Dimensional Data Analysis.",
                    "Data Bubbles for Non-Vector Data: Speeding-up Hierarchical Clustering in Arbitrary Metric Spaces.",
                    "Finding Hierarchical Heavy Hitters in Data Streams.",
                    "Star-Cubing: Computing Iceberg Cubes by Top-Down and Bottom-Up Integration.",
                    "Coarse-Grained Optimization: Techniques for Rewriting SQL Statement Sequences.",
                    "Processing Sliding Window Multi-Joins in Continuous Queries over Data Streams.",
                    "Continuous K-Nearest Neighbor Queries for Continuously Moving Points with Updates.",
                    "Staircase Join: Teach a Relational DBMS to Watch its (Axis) Steps.",
                    "Checks and Balances: Monitoring Data Quality Problems in Network Traffic Databases.",
                    "Systematic Development of Data Mining-Based Data Quality Tools.",
                    "Adaptive, Hands-Off Stream Mining.",
                    "Composing Mappings Among Data Sources.",
                    "Mapping Adaptation under Evolving Schemas.",
                    "Locking Protocols for Materialized Aggregate Join Views.",
                    "Supporting Frequent Updates in R-Trees: A Bottom-Up Approach.",
                    "The ND-Tree: A Dynamic Indexing Technique for Multidimensional Non-ordered Discrete Data Spaces.",
                    "Temporal Slicing in the Evaluation of XML Queries.",
                    "The Generalized Pre-Grouping Transformation: Aggregate-Query Optimization in the Presence of Dependencies.",
                    "Estimating the Output Cardinality of Partial Preaggregation with a Measure of Clusteredness.",
                    "BHUNT: Automatic Discovery of Fuzzy Algebraic Constraints in Relational Data.",
                    "Tabular Placement of Relational Data on MEMS-based Storage Devices.",
                    "Memory Requirements for Query Execution in Highly Constrained Devices.",
                    "Lachesis: Robust Database Storage Management Based on Device-specific Performance Characteristics.",
                    "Cache Tables: Paving the Way for an Adaptive Database Cache.",
                    "Primitives for Workload Summarization and Implications for SQL.",
                    "A Dependability Benchmark for OLTP Application Environments.",
                    "Supporting Top-k Join Queries in Relational Databases.",
                    "AniPQO: Almost Non-intrusive Parametric Query Optimization for Nonlinear Cost Functions.",
                    "Efficient Approximation Of Optimization Queries Under Parametric Aggregation Constraints.",
                    "The TPR*-Tree: An Optimized Spatio-Temporal Access Method for Predictive Queries.",
                    "Query Processing in Spatial Network Databases.",
                    "Multiscale Histograms: Summarizing Topological Relations in Large Spatial Datasets.",
                    "Avoiding Ordering and Grouping In Query Processing.",
                    "Operator Scheduling in a Data Stream Manager.",
                    "Efficient IR-Style Keyword Search over Relational Databases.",
                    "Merging Models Based on Given Correspondences.",
                    "Locating Data Sources in Large Distributed Systems.",
                    "Robust Estimation With Sampling and Approximate Pre-Aggregation.",
                    "Controlling Access to Published Data Using Cryptography.",
                    "OASIS: An Online and Accurate Technique for Local-alignment Searches on Biological Sequences.",
                    "Privacy-Preserving Indexing of Documents on the Network.",
                    "Data Compression in Oracle.",
                    "Improving Performance with Bulk-Inserts in Oracle R-Trees.",
                    "Statistics on Views.",
                    "Efficient Query Processing for Multi-Dimensionally Clustered Tables in DB2.",
                    "A Platform Based on the Multi-dimensional Data Model for Analysis of Bio-Molecular Structures.",
                    "Capturing Global Transactions from Multiple Recovery Log Files in a Partitioned Database System.",
                    "The BEA/XQRL Streaming XQuery Processor.",
                    "XML Schemas in Oracle XML DB.",
                    "Integrated Data Management for Mobile Services in the Real World.",
                    "Web Services (Industrial Session).",
                    "Grid and Applications (Industrial Session).",
                    "Commercial Use of Database Technology.",
                    "The Zero-Delay Data Warehouse: Mobilizing Heterogeneous Databases.",
                    "A Database Striptease or How to Manage Your Personal Databases.",
                    "Who needs XML Databases?",
                    "Illuminating the Dark Side of Web Services.",
                    "Xcerpt and visXcerpt: From Pattern-Based to Visual Querying of XML and Semistructured Data.",
                    "OrientStore: A Schema Based Native XML Storage System.",
                    "Managing Distributed Workspaces with Active XML.",
                    "Xquec: Pushing Queries to Compressed XML Data.",
                    "A System for Keyword Proximity Search on XML Databases.",
                    "XISS/R: XML Indexing and Storage System using RDBMS.",
                    "Implementing Xquery 1.0: The Galax Experience.",
                    "WebService Composition with O'GRAPE and OSIRIS.",
                    "Chameleon: an Extensible and Customizable Tool for Web Data Translation.",
                    "NexusScout: An Advanced Location-Based Application on a Distributed, Open Mediation Platform.",
                    "Schema-driven Customization of Web Services.",
                    "BibFinder/StatMiner: Effectively Mining and Using Coverage and Overlap Statistics in Data Integration.",
                    "S-ToPSS: Semantic Toronto Publish/Subscribe System.",
                    "From Focused Crawling to Expert Information: an Application Framework for Web Exploration and Portal Generation.",
                    "CachePortal II: Acceleration of Very Large Scale Data Center-Hosted Database-driven Web Applications.",
                    "ATLAS: A Small but Complete SQL Extension for Data Mining and Data Streams.",
                    "Business Modelling Using SQL Spreadsheets.",
                    "An Interpolated Volume Data Model.",
                    "Efficacious Data Cube Exploration by Semantic Summarization and Compression.",
                    "QUIET: Continuous Query-driven Index Tuning.",
                    "Chip-Secured Data Access: Reconciling Access Rights with Data Encryption.",
                    "IrisNet: An Architecture for Internet-scale Sensing Services.",
                    "Large-Scale, Standards-Based Earth Observation Imagery and Web Mapping Services.",
                    "Privacy-Enhanced Data Management for Next-Generation e-Commerce.",
                    "The Semantic Web: Semantics for Data on the Web.",
                    "Data Stream Query Processing: A Tutorial.",
                    "Grid Data Management Systems & Services.",
                    "Constructing and integrating data-centric Web Applications: Methods, Tools, and Techniques."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/2003phd",
                "sub_name": "Proceedings of the VLDB 2003 PhD Workshop. Co-located with the 29th International Conference on Very Large Data Bases (VLDB 2003). Berlin, September 12-13, 2003.",
                "count": 17,
                "papers": [
                    "Analysis and design of approximate queries over XML documents using statistical techniques.",
                    "XQuery Optimization.",
                    "CIRQuL - Complex Information Retrieval Query Language.",
                    "Semantic Data Cleansing in Genome Databases.",
                    "Extending relational database functionality with data inconsistency resolution support.",
                    "Integrating and Updating Domain Knowledge with Data Mining.",
                    "Matching Database Access Patterns to Storage Characteristics.",
                    "Consistency Based Snapshot Management in Data Grids.",
                    "Modeling and managing ETL processes.",
                    "Pathfinder: Compiling XQuery for Execution on the Monet Database Engine.",
                    "AmbientDB: Complex Query Processing for P2P Networks.",
                    "On a Hierarchical Indexing Fuzzy Content-Based Image Retrieval Approach.",
                    "Information Discovery, Extraction and Integration for the Hidden Web.",
                    "Combined Locking Approach for Scheduling Hard Real-Time Transactions in Real-Time Databases.",
                    "Inference and Prediction of Uncertain Events in Active Systems: A Language and Execution Model.",
                    "A Space Efficient Persistent Implementation of an Index for DNA Sequences.",
                    "Adaptive Distributed Query Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/dbisp2p/2003",
                "sub_name": "Databases, Information Systems, and Peer-to-Peer Computing, First International Workshop, DBISP2P, Berlin Germany, September 7-8, 2003, Revised Papers.",
                "count": 17,
                "papers": [
                    "Design Issues and Challenges for RDF- and Schema-Based Peer-to-Peer Systems.",
                    "SIL: Modeling and Measuring Scalable Peer-to-Peer Search Networks.",
                    "Searchable Querical Data Networks.",
                    "Semantic Overlay Clusters within Super-Peer Networks.",
                    "Structuring Peer-to-Peer Networks Using Interest-Based Communities.",
                    "A Robust Logical and Computational Characterisation of Peer-to-Peer Database Systems.",
                    "Semantic Data Integration in P2P Systems.",
                    "Defining Peer-to-Peer Data Integration Using Both as View Rules.",
                    "Coordinating Peer Databases Using ECA Rules.",
                    "An Adaptive and Scalable Middleware for Distributed Indexing of Data Streams.",
                    "Building Content-Based Publish/Subscribe Systems with Distributed Hash Tables.",
                    "AmbientDB: Relational Query Processing in a P2P Network.",
                    "Towards a Unifying Framework for Complex Query Processing over Structured Peer-to-Peer Data Networks.",
                    "Distributed Queries and Query Optimization in Schema-Based P2P-Systems.",
                    "PePeR: A Distributed Range Addressing Space for Peer-to-Peer Systems.",
                    "Trust-Aware Delivery of Composite Goods.",
                    "Content-Based Overlay Networks for XML Peers Based on Multi-level Bloom Filters."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "28th VLDB 2002",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2002",
                "sub_name": "Proceedings of 28th International Conference on Very Large Data Bases, VLDB 2002, Hong Kong, August 20-23, 2002.",
                "count": 117,
                "papers": [
                    "Data Routing Rather than Databases: The Meaning of the Next Wave of the Web Revolution to Data Management.",
                    "Foundation Matters.",
                    "Wireless Graffiti - Data, Data Everywhere Matters.",
                    "Self-tuning Database Technology and Information Services: from Wishful Thinking to Viable Engineering.",
                    "REFEREE: An Open Framework for Practical Testing of Recommender Systems using ResearchIndex.",
                    "Adaptable Similarity Search using Non-Relevant Information.",
                    "Sideway Value Algebra for Object-Relational Databases.",
                    "Database Selection Using Actual Physical and Acquired Logical Collection Resources in a Massive Domain-specific Operational Environment.",
                    "Structural Function Inlining Technique for Structurally Recursive XML Queries.",
                    "Efficient Algorithms for Processing XPath Queries.",
                    "Incorporating XSL Processing into Database Engines.",
                    "Optimizing View Queries in ROLEX to Support Navigable Result Trees.",
                    "Chip-Secured Data Access: Confidential Data on Untrusted Servers.",
                    "Hippocratic Databases.",
                    "Watermarking Relational Databases.",
                    "Parametric Query Optimization for Linear and Piecewise Linear Cost Functions.",
                    "Plan Selection Based on Query Clustering.",
                    "Generic Database Cost Models for Hierarchical Memory Systems.",
                    "Streaming Queries over Streaming Data.",
                    "Monitoring Streams - A New Class of Data Management Applications.",
                    "A Transducer-Based XML Query Processor.",
                    "Updates for Structure Indexes.",
                    "RE-Tree: An Efficient Index Structure for Regular Expressions.",
                    "Efficient Structural Joins on Indexed XML Documents.",
                    "Shooting Stars in the Sky: An Online Algorithm for Skyline Queries.",
                    "Continuous Nearest Neighbor Search.",
                    "Progressive Merge Join: A Generic and Non-blocking Sort-based Join Algorithm.",
                    "Foundations of Preferences in Database Systems.",
                    "Multi-Dimensional Regression Analysis of Time-Series Data Streams.",
                    "Comparing Data Streams Using Hamming Norms (How to Zero In).",
                    "Approximate Frequency Counts over Data Streams.",
                    "StatStream: Statistical Monitoring of Thousands of Data Streams in Real Time.",
                    "Optimizing Result Prefetching in Web Search Engines with Segmented Indices.",
                    "I/O-Conscious Data Preparation for Large-Scale Web Search Engines.",
                    "Distributed Search over the Hidden Web: Hierarchical Database Sampling and Selection.",
                    "Exact Indexing of Dynamic Time Warping.",
                    "Adaptive Index Structures.",
                    "A Case for Fractured Mirrors.",
                    "XPathLearner: An On-line Self-Tuning Markov Histogram for XML Path Selectivity Estimation.",
                    "How to Summarize the Universe: Dynamic Maintenance of Quantiles.",
                    "Structure and Value Synopses for XML Data Graphs.",
                    "Compressed Accessibility Map: Efficient Access Control for XML.",
                    "Optimizing the Secure Evaluation of Twig Queries.",
                    "Provisions and Obligations in Policy Management and Security Applications.",
                    "Effective Change Detection Using Sampling.",
                    "Maintaining Coherency of Dynamic Data in Cooperating Repositories.",
                    "A Bandwidth Model for Internet Search.",
                    "Using Latency-Recency Profiles for Data Delivery on the Web.",
                    "View Invalidation for Dynamic Content Caching in Multitiered Architectures.",
                    "Improving Data Access of J2EE Applications by Exploiting Asynchronous Messaging and Caching Services.",
                    "Eliminating Fuzzy Duplicates in Data Warehouses.",
                    "Translating Web Data.",
                    "COMA - A System for Flexible Combination of Schema Matching Approaches.",
                    "Efficient Exploration of Large Scientific Databases.",
                    "Searching on the Secondary Structure of Protein Sequences.",
                    "ProTDB: Probabilistic Data in XML.",
                    "Fast and Accurate Text Classification via Multiple Linear Discriminant Projections.",
                    "DISCOVER: Keyword Search in Relational Databases.",
                    "Maintaining Data Privacy in Association Rule Mining.",
                    "A Logical Framework for Scheduling Workflows under Resource Allocation Constraints.",
                    "An Almost-Serial Protocol for Transaction Execution in Main-Memory Database Systems.",
                    "Lightweight Flexible Isolation for Language-based Extensible Systems.",
                    "Processing Star Queries on Hierarchically-Clustered Fact Tables.",
                    "Exploiting Versions for On-line Data Warehouse Maintenance in MOLAP Servers.",
                    "FAS - A Freshness-Sensitive Coordination Middleware for a Cluster of OLAP Components.",
                    "The Generalized MDL Approach for Summarization.",
                    "Quotient Cube: How to Summarize the Semantics of a Data Cube.",
                    "A One-Pass Aggregation Algorithm with the Optimal Buffer Size in Multidimensional OLAP.",
                    "Incremental Maintenance for Non-Distributive Aggregate Functions.",
                    "Reverse Nearest Neighbor Aggregates Over Data Streams.",
                    "Tree Pattern Aggregation for Scalable XML Data Dissemination.",
                    "DTD-Directed Publishing with Attribute Translation Grammars.",
                    "A Multi-version Cache Replacement and Prefetching Policy for Hybrid Data Delivery Environments.",
                    "Toward Recovery-Oriented Computing.",
                    "SMART: Making DB2 (More) Autonomic.",
                    "Business Process Cockpit.",
                    "GnatDb: A Small-Footprint, Secure Database System.",
                    "Experience Report: Exploiting Advanced Database Optimization Features for Large-Scale SAP R/3 Installations.",
                    "Information Integration and XML in IBM's DB2.",
                    "A New Passenger Support System for Public Transport using Mobile Database Access.",
                    "OBK - An Online High Energy Physics' Meta-Data Repository.",
                    "The gRNA: A Highly Programmable Infrastructure for Prototyping, Developing and Deploying Genomics-Centric Applications.",
                    "An Efficient Method for Performing Record Deletions and Updates Using Index Scans.",
                    "Joining Ranked Inputs in Practice.",
                    "SQL Memory Management in Oracle9i.",
                    "XMark: A Benchmark for XML Data Management.",
                    "The Denodo Data Integration Platform.",
                    "Preference SQL - Design, Implementation, Experiences.",
                    "The Rubicon of Smart Data.",
                    "Information Management Challenges from the Aerospace Industry.",
                    "Experiments on Query Expansion for Internet Yellow Page Services Using Web Log Mining.",
                    "Issues and Evaluations of Caching Solutions for Web Application Acceleration.",
                    "An Automated System for Web Portal Personalization.",
                    "EOS: Exactly-Once E-Service Middleware.",
                    "ServiceGlobe: Distributing E-Services Across the Internet.",
                    "SELF-SERV: A Platform for Rapid Composition of Web Services in a Peer-to-Peer Environment.",
                    "Database Technologies for Electronic Commerce.",
                    "Advanced Database Technologies in a Diabetic Healthcare System.",
                    "RTMonitor: Real-Time Data Monitoring Using Mobile Agent Technologies.",
                    "Viator - A Tool Family for Graphical Networking and Data View Creation.",
                    "Profiling and Internet Connectivity in Automotive Environments.",
                    "GeMBASE: A Geometric Mediator for Brain Analysis with Surface Ensembles.",
                    "Extending an ORDBMS: The StateMachine Module.",
                    "BANKS: Browsing and Keyword Searching in Relational Databases.",
                    "Active XML: Peer-to-Peer Data and Web Services Integration.",
                    "LegoDB: Customizing Relational Storage for XML Documents.",
                    "enTrans: A System for Flexible Consistency Maintenance in Directory Applications.",
                    "Champagne: Data Change Propagation for Heterogeneous Information Systems.",
                    "ALIAS: An Active Learning led Interactive Deduplication System.",
                    "A-TOPSS - A Publish/Subscribe System Supporting Approximate Matching.",
                    "Automation in Information Extraction and Data Integration.",
                    "Database Tuning: Principles, Experiments, and Troubleshooting Techniques.",
                    "Searching and Mining Fine-Grained Semi-Structured Data.",
                    "Application Servers and Associated Technologies.",
                    "Querying and Mining Data Streams: You Only Get One Look.",
                    "eBusiness Standards and Architectures.",
                    "Sensor Data Mining: Similarity Search and Pattern Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/eextt/2002",
                "sub_name": "Efficiency and Effectiveness of XML Tools and Techniques and Data Integration over the Web, VLDB 2002 Workshop EEXTT and CAiSE 2002 Workshop DTWeb. Revised Papers.",
                "count": 19,
                "papers": [
                    "A Proposal for an XML Data Definition and Manipulation Language.",
                    "Relevance Ranking Tuning for Similarity Queries on XML Data.",
                    "A New Path Expression Computing Approach for XML Data.",
                    "Integrated XML Document Management.",
                    "Integration of XML Data.",
                    "XML to Relational Conversion Using Theory of Regular Tree Grammars.",
                    "Adaptive XML Shredding: Architecture, Implementation, and Challenges.",
                    "An Adaptable and Adjustable Mapping from XML Data to Tables in RDB.",
                    "Efficient Structure Oriented Storage of XML Documents Using ORDBMS.",
                    "Assessing XML Data Management with XMark.",
                    "The XOO7 Benchmark.",
                    "Multi-user Evaluation of XML Data Management Systems with XMach-1.",
                    "The Michigan Benchmark: A Microbenchmark for XML Query Processing Systems.",
                    "XBench - A Family of Benchmarks for XML DBMSs.",
                    "Data Integration Using Web Services.",
                    "Efficient Cache Answerability for XPath Queries.",
                    "Web-Based Integration of Printed and Digital Information.",
                    "Integrating Scientific Data through External, Concept-Based Annotations.",
                    "Exploiting and Completing Web Data Sources Capabilities."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "27th VLDB 2001",
        "info": "Roma, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2001",
                "sub_name": "VLDB 2001, Proceedings of 27th International Conference on Very Large Data Bases, September 11-14, 2001, Roma, Italy.",
                "count": 105,
                "papers": [
                    "Business Process Coordination: State of the Art, Trends, and Open Issues.",
                    "Ambient Intelligence with the Ubiquitous Network, the Embedded Computer Devices and the Hidden Databases (abstract).",
                    "Et tu, XML? The downfall of the relational empire (abstract).",
                    "The Semantic Web Paving the Way to the Knowledge Society.",
                    "LEO - DB2's LEarning Optimizer.",
                    "User-Optimizer Communication using Abstract Plans in Sybase ASE.",
                    "XXL - A Library Approach to Supporting Efficient Implementations of Advanced Database Queries.",
                    "Generic Schema Matching with Cupid.",
                    "A Formal Perspective on the View Selection Problem.",
                    "Self-similarity in the Web.",
                    "Surfing Wavelets on Streams: One-Pass Summaries for Approximate Aggregate Queries.",
                    "Analyzing Quantitative Databases: Image is Everything.",
                    "Discovery of Influence Sets in Frequently Updated Databases.",
                    "RoadRunner: Towards Automatic Data Extraction from Large Web Sites.",
                    "Visual Web Information Extraction with Lixto.",
                    "Crawling the Hidden Web.",
                    "A Database Index to Large Biological Sequences.",
                    "Storage and Querying of E-Commerce Data.",
                    "Improving Business Process Quality through Exception Understanding, Prediction, and Prevention.",
                    "Weaving Relations for Cache Performance.",
                    "Cache-Conscious Concurrency Control of Main-Memory Indexes on Shared-Memory Multiprocessor Systems.",
                    "Form-Based Proxy Caching for Database-Backed Web Sites.",
                    "FeedbackBypass: A New Approach to Interactive Similarity Query Processing.",
                    "Fast Evaluation Techniques for Complex Similarity Queries.",
                    "An Extendible Hash for Multi-Precision Similarity Querying of Image Databases.",
                    "Similarity Search for Adaptive Ellipsoid Queries Using Spatial Transformation.",
                    "Answering XML Queries on Heterogeneous Data Sources.",
                    "Query Engines for Web-Accessible XML Data.",
                    "Querying XML Views of Relational Data.",
                    "Views in a Large Scale XML Repository.",
                    "Supporting Incremental Join Queries on Ranked Inputs.",
                    "Efficient Management of Multiversion Documents by Object Referencing.",
                    "Efficient Progressive Skyline Computation.",
                    "NetCube: A Scalable Tool for Fast Data Mining and Compression.",
                    "Mining Multi-Dimensional Constrained Gradients in Data Cubes.",
                    "C2P: Clustering based on Closest Pairs.",
                    "A Fast Index for Semistructured Data.",
                    "Efficient Index Structures for String Databases.",
                    "Indexing and Querying XML Data for Regular Path Expressions.",
                    "Declarative Data Cleaning: Language, Model, and Algorithms.",
                    "Potter's Wheel: An Interactive Data Cleaning System.",
                    "Update Propagation Strategies for Improving the Quality of Data on the Web.",
                    "Walking Through a Very Large Virtual Environment in Real-time.",
                    "Analyzing energy behavior of spatial access methods for memory-resident data.",
                    "Indexing the Distance: An Efficient Method to KNN Processing.",
                    "MV3R-Tree: A Spatio-Temporal Access Method for Timestamp and Interval Queries.",
                    "Transaction Timestamping in (Temporal) Databases.",
                    "Online Scaling in a Highly Available Database.",
                    "An Evaluation of Generic Bulk Loading Techniques.",
                    "Lineage Tracing for General Data Warehouse Transformations.",
                    "A Data Warehousing Architecture for Enabling Service Provisioning Process.",
                    "Approximate String Joins in a Database (Almost) for Free.",
                    "Dynamic Pipeline Scheduling for Improving Interactive Query Performance.",
                    "Functional Properties of Information Filtering.",
                    "Dynamic Update Cube for Range-sum Queries.",
                    "Intelligent Rollups in Multidimensional OLAP Data.",
                    "Distinct Sampling for Highly-Accurate Answers to Distinct Values Queries and Event Reports.",
                    "Hyperqueries: Dynamic Distributed Query Processing on the Internet.",
                    "Comparing Hybrid Peer-to-Peer Systems.",
                    "Data Staging for On-Demand Broadcast.",
                    "Change-Centric Management of Versions in an XML Warehouse.",
                    "Estimating the Selectivity of XML Path Expressions for Internet Scale Applications.",
                    "On Processing XML in LDAP.",
                    "Collaborative Analytical Processing - Dream or Reality? (Panel abstract).",
                    "Are Web Services the Next Revolution in e-Commerce? (Panel).",
                    "Storage Service Providers: a Solution for Storage Management? (Panel).",
                    "French government activity in the conservation of data and electronic documents.",
                    "The Long-Term Preservation of Authentic Electronic Records.",
                    "Italian Electronic Identity Card - principle and architecture.",
                    "Ontology-based Support for Digital Government.",
                    "Discovering Web Services: An Overview.",
                    "Architectures for Internal Web Services Deployment.",
                    "Scientific OLAP for the Biotech Domain.",
                    "Warehousing Workflow Data: Challenges and Opportunities.",
                    "A Sequential Pattern Query Language for Supporting Instant Data Mining for e-Services.",
                    "Aggregate Maintenance for Data Warehousing in Informix Red Brick Vista.",
                    "Navigating large-scale semi-structured data in business portals.",
                    "A Comparative Study of Alternative Middle Tier Caching Solutions to Support Dynamic Web Content Acceleration.",
                    "The Propel Distributed Services Platform.",
                    "Tavant System Architecture for Sell-side Channel Management.",
                    "Operating System Extensions for the Teradata Parallel VLDB.",
                    "Cache Fusion: Extending Shared-Disk Clusters with Shared Caches.",
                    "DB2 Spatial Extender - Spatial data within the RDBMS.",
                    "A Prototype Content-Based Retrieval System that Uses Virtual Images to Save Space.",
                    "ACTIVIEW: Adaptive data presentation using SuperSQL.",
                    "AgFlow: Agent-based Cross-Enterprise Workflow Management System.",
                    "Cache Portal: Technology for Accelerating Database-driven e-commerce Web Sites.",
                    "Developing an Indexing Scheme for XML Document Collection using the Oracle8i Extensibility Framework.",
                    "Enabling End-users to Construct Data-intensive Web-sites from XML Repositories: An Example-based Approach.",
                    "Flexible and scalable digital library search.",
                    "LoPiX: A System for XML Data Integration and Manipulation.",
                    "PicoDBMS: Validation and Experience.",
                    "SIT-IN: a Real-Life Spatio-Temporal Information System.",
                    "SMOOTH - A Distributed Multimedia Database System.",
                    "Supervised Wrapper Generation with Lixto.",
                    "The WorlInfo Assistant: Spatio-Temporal Information Integration on the Web.",
                    "VXMLR: A Visual XML-Relational Database System.",
                    "WARLOCK: A Data Allocation Tool for Parallel Warehouses.",
                    "WebFilter: A High-throughput XML-based Publish and Subscribe System.",
                    "Storage and Retrieval of XML Data Using Relational Databases.",
                    "Data Management for Pervasive Computing.",
                    "Caching Technologies for Web Applications.",
                    "Approximate Query Processing: Taming the TeraBytes.",
                    "Information Management for Genome Level Bioinformatics.",
                    "Managing Business Processes via Workflow Technology."
                ]
            },
            {
                "sub_name_abbr": "conf/tes/2001",
                "sub_name": "Technologies for E-Services, Second International Workshop, TES 2001, Rome, Italy, September 14-15, 2001, Proceedings.",
                "count": 15,
                "papers": [
                    "E-Services: Current Technology and Open Issues.",
                    "The Role of B2B Protocols in Inter-Enterprise Process Execution.",
                    "Conversations + Interfaces = Business Logic.",
                    "Compatibility of e -Services in a Cooperative Multi-platform Environment.",
                    "Beyond Discrete E-Services: Composing Session-Oriented Services in Telecommunications.",
                    "View-Based Contracts in an E-Service Cross-Organizational Workflow Environment.",
                    "BizBuilder - An E-Services Framework Targeted for Internet Workflow.",
                    "Peer-to-Peer Traced Execution of Composite Services.",
                    "Supporting Reliable Transactional Business Processes by Publish/Subscribe Techniques.",
                    "User Action Recovery in Internet SAGAs (iSAGAs).",
                    "Security for Distributed E-Service Composition.",
                    "ESTIA-Efficient Electronic Services for Tourists in Action.",
                    "InfoPipes: A Flexible Framework for M-Commerce Applications.",
                    "Psi-Pervasive Services Infrastructure.",
                    "Adaptive Migration Strategy for Mobile Agents on Internet."
                ]
            },
            {
                "sub_name_abbr": "conf/dbtel/2001",
                "sub_name": "Databases in Telecommunications II, VLDB 2001 International Workshop, DBTel 2001 Rome, Italy, September 10, 2001, Proceedings.",
                "count": 13,
                "papers": [
                    "Telecommunications, Databases, and Evolution.",
                    "Data Warehouse Population Platform.",
                    "Experimenting NT Cluster Technology for Massive CDR Processing.",
                    "Mining Sequential Alarm Patterns in a Telecommunication Database.",
                    "Generalized MD-Joins: Evaluation and Reduction to SQL.",
                    "Query Processing in Embedded Control Programs.",
                    "Benchmark for Real-Time Database Systems for Telecommunications.",
                    "Replication between Geographically Separated Clusters - An Asynchronous Scalable Replication Mechanism for Very High Availability.",
                    "Yima: Design and Evaluation of a Streaming Media System for Residential Broadband Services.",
                    "QuDAS: A QoS-Based Brokering Architecture for Data Services.",
                    "LDAP, Databases and Distributed Objects: Towards a Better Integration.",
                    "Network Convergence Using Universal Numbers: The UPT Project.",
                    "Toward Universal Information Models in Enterprise Management."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "26th VLDB 2000",
        "info": "Cairo, Egypt",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/2000",
                "sub_name": "VLDB 2000, Proceedings of 26th International Conference on Very Large Data Bases, September 10-14, 2000, Cairo, Egypt.",
                "count": 96,
                "papers": [
                    "Ordering Information, Conference Organizers, Program Committees, Additional Reviewers, Additional Demonstrations Reviewers, Sponsors, VLDB Endowment, Preface, Foreword.",
                    "Practical Applications of Triggers and Constraints: Success and Lingering Issues (10-Year Award).",
                    "Biodiversity Informatics: The Challenge of Rapid Development, Large Databases, and Complex Data (Keynote).",
                    "Toto, We're Not in Kansas Anymore: On Transitioning from Research to the Real (Invited Industrial Talk).",
                    "Rethinking Database System Architecture: Towards a Self-Tuning RISC-Style Database System.",
                    "PicoDMBS: Scaling Down Database Techniques for the Smartcard.",
                    "The 3W Model and Algebra for Unified Data Mining.",
                    "Design and Implementation of a Genetic-Based Algorithm for Data Mining.",
                    "Mining Frequent Itemsets Using Support Constraints.",
                    "Efficient Filtering of XML Documents for Selective Dissemination of Information.",
                    "Efficiently Publishing Relational Data as XML Documents.",
                    "Schema Mapping as Query Discovery.",
                    "Local Dimensionality Reduction: A New Approach to Indexing High Dimensional Spaces.",
                    "Dynamic Maintenance of Wavelet-Based Histograms.",
                    "Approximate Query Processing Using Wavelets.",
                    "Efficient Numerical Error Bounding for Replicated Network Services.",
                    "Don't Be Lazy, Be Consistent: Postgres-R, A New Way to Implement Database Replication.",
                    "Offering a Precision-Performance Tradeoff for Aggregation Queries over Replicated Data.",
                    "Manipulating Interpolated Data is Easier than You Thought.",
                    "Using SQL to Build New Aggregates and Extenders for Object- Relational Systems.",
                    "ICICLES: Self-Tuning Samples for Approximate Query Answering.",
                    "Caching Strategies for Data-Intensive Web Sites.",
                    "The Evolution of the Web and Implications for an Incremental Crawler.",
                    "CheeTah: a Lightweight Transaction Server for Plug-and-Play Internet Data Management.",
                    "Hypothetical Queries in an OLAP Environment.",
                    "Hierarchical Compact Cube for Range-Max Queries.",
                    "Temporal Queries in OLAP.",
                    "Integrating the UB-Tree into a Database System Kernel.",
                    "Multi-Dimensional Database Allocation for Parallel Data Warehouses.",
                    "Oracle8i Index-Organized Table and Its Application to New Domains.",
                    "FALCON: Feedback Adaptive Loop for Content-Based Retrieval.",
                    "User-Adaptive Exploration of Multidimensional Data.",
                    "Toward Learning Based Web Query Processing.",
                    "Optimizing Queries on Compressed Bitmaps.",
                    "What Happens During a Join? Dissecting CPU and Memory Optimization Effects.",
                    "Set Containment Joins: The Good, The Bad and The Ugly.",
                    "Identifying Representative Trends in Massive Time Series Data Sets Using Sketches.",
                    "Decision Tables: Scalable Classification Exploring RDBMS Capabilities.",
                    "Fast Time Sequence Indexing for Arbitrary Lp Norms.",
                    "Novel Approaches to the Indexing of Moving Object Trajectories.",
                    "Managing Intervals Efficiently in Object-Relational Databases.",
                    "Optimizing Multi-Feature Queries for Image Databases.",
                    "Contrast Plots and P-Sphere Trees: Space vs. Time in Nearest Neighbour Searches.",
                    "Temporal Integrity Constraints with Indeterminacy.",
                    "The BT-tree: A Branched and Temporal Access Method.",
                    "Performance Issues in Incremental Warehouse Maintenance.",
                    "The Challenge of Process Data Warehousing.",
                    "A Scalable Algorithm for Answering Queries Using Views.",
                    "Automated Selection of Materialized Views and Indexes in SQL Databases.",
                    "What Is the Nearest Neighbor in High Dimensional Spaces?",
                    "The A-tree: An Index Structure for High-Dimensional Spaces Using Relative Approximation.",
                    "Focused Crawling Using Context Graphs.",
                    "Approximating Aggregate Queries about Web Pages via Random Walks.",
                    "Computing Geographical Scopes of Web Resources.",
                    "A Case-Based Approach to Information Integration.",
                    "Approximate Query Translation Across Heterogeneous Information Sources.",
                    "Design and Development of a Stream Service in a Heterogenous Client Environment.",
                    "Semantic Access: Semantic Interface for Querying Databases.",
                    "The TreeScape System: Reuse of Pre-Computed Aggregates over Irregular OLAP Hierarchies.",
                    "OLAP++: Powerful and Easy-to-Use Federations of OLAP and Object Databases.",
                    "Memex: A Browsing Assistant for Collaborative Archiving and Mining of Surf Trails.",
                    "Building and Customizing Data-Intensive Web Sites Using Weave.",
                    "Information Integration: The MOMIS Project Demonstration.",
                    "Telcordia's Database Reconciliation and Data Quality Analysis Tool.",
                    "Rainbow: Distributed Database System for Classroom Education and Experimental Research.",
                    "Agora: Living with XML and Relational.",
                    "Publish/Subscribe on the Web at Extreme Speed.",
                    "Demonstration: Enabling Scalable Online Personalization on the Web.",
                    "INSITE: A Tool for Interpreting Users? Interaction with a Web Space.",
                    "Model-Based Information Integration in a Neuroscience Mediator System.",
                    "Push Technology Personalization through Event Correlation.",
                    "XPERANTO: Middleware for Publishing Object-Relational Data as XML Documents.",
                    "Building Scalable Internet Applications with Oracle8i Server.",
                    "Social, Educational, and Governmental Change Enabled through Information Technology.",
                    "A 20/20 Vision of the VLDB-2020?",
                    "Panel: Is Generic Metadata Management Feasible?",
                    "Panel: Future Directions of Database Research - The VLDB Broadening Strategy, Part 1.",
                    "Panel: Future Directions of Database Research - The VLDB Broadening Strategy, Part 2.",
                    "An Ultra Highly Available DBMS.",
                    "The Zero Latency Enterprise.",
                    "High-Performance and Scalability through Application Tier,In-Memory Data Management.",
                    "Asera: Extranet Architecture for B2B Solutions.",
                    "Linking Business to Deliver Value: A Data Management Challenge.",
                    "Evolution of Groupware for Business Applications: A Database Perspective on Lotus Domino/Notes.",
                    "Process Automation as the Foundation for E-Business.",
                    "Media360 Workflow-Implementing a Workflow Engine Inside a Database.",
                    "Work and Information Practices in the Sciences of Biodiversity.",
                    "Research Directions in Biodiversity Informatics.",
                    "Biodiversity Informatics Infrastructure: An Information Commons for the Biodiversity Community.",
                    "A Database Platform for Bioinformatics.",
                    "Data Mining in the Bioinformatics Domain.",
                    "Controlling Data Warehouses with Knowledge Networks.",
                    "Integration of Data Mining with Database Technology.",
                    "E.piphany Epicenter Technology Overview.",
                    "Concurrency in the Data Warehouse.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "25th VLDB 1999",
        "info": "Edinburgh, Scotland",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/99",
                "sub_name": "VLDB'99, Proceedings of 25th International Conference on Very Large Data Bases, September 7-10, 1999, Edinburgh, Scotland, UK.",
                "count": 77,
                "papers": [
                    "Repeating History Beyond ARIES.",
                    "Online Feedback for Nested Aggregate Queries with Multi-Threading.",
                    "Generalised Hash Teams for Join and Group-by.",
                    "Explaining Differences in Multidimensional Aggregates.",
                    "Database Architecture Optimized for the New Bottleneck: Memory Access.",
                    "The Persistent Cache: Improving OID Indexing in Temporal Object-Oriented Database Systems.",
                    "Cache Conscious Indexing for Decision-Support in Main Memory.",
                    "Comparing Hierarchical Data in External Memory.",
                    "Mining Deviants in a Time Series Database.",
                    "Exploiting Versions for Handling Updates in Broadcast Disks.",
                    "Fast Algorithms for Maintaining Replica Consistency in Lazy Master Replicated Databases.",
                    "Active Views for Electronic Commerce.",
                    "An Adaptive Hybrid Server Architecture for Client Caching ODBMSs.",
                    "Dynamic Load Balancing for Parallel Association Rule Mining on Heterogenous PC Cluster Systems.",
                    "Histogram-Based Approximation of Set-Valued Query-Answers.",
                    "Semantic Compression and Pattern Extraction with Fascicles.",
                    "Issues in Network Management in the Next Millennium.",
                    "A Scalable and Highly Available Networked Database Architecture.",
                    "Networked Data Management Design Points.",
                    "In Cyber Space No One can Hear You Scream.",
                    "Finding Intensional Knowledge of Distance-Based Outliers.",
                    "SPIRIT: Sequential Pattern Mining with Regular Expression Constraints.",
                    "A Novel Index Supporting High Volume Data Warehouse Insertion.",
                    "Microsoft English Query 7.5: Automatic Extraction of Semantics from Relational Databases and OLAP Cubes.",
                    "The New Locking, Logging, and Recovery Architecture of Microsoft SQL Server 7.0.",
                    "The Value of Merge-Join and Hash-Join in SQL Server.",
                    "VOODB: A Generic Discrete-Event Random Simulation Model To Evaluate the Performances of OODBs.",
                    "DBMSs on a Modern Processor: Where Does Time Go?",
                    "Performance Measurements of Compressed Bitmap Indices.",
                    "Capturing and Querying Multiple Aspects of Semistructured Data.",
                    "Relational Databases for Querying XML Documents: Limitations and Opportunities.",
                    "Query Optimization for XML.",
                    "Context-Based Prefetch for Implementing Objects on Relations.",
                    "GHOST: Fine Granularity Buffering of Indexes.",
                    "Loading a Cache with Query Results.",
                    "Building Hierarchical Classifiers Using Class Proximity.",
                    "Distributed Hypertext Resource Discovery Through Examples.",
                    "Multi-Dimensional Substring Selectivity Estimation.",
                    "Evaluating Top-k Selection Queries.",
                    "Probabilistic Optimization of Top N Queries.",
                    "Combining Histograms and Parametric Curve Fitting for Feedback-Driven Query Result-size Estimation.",
                    "Integrating Heterogenous Overlapping Databases through Object-Oriented Transformations.",
                    "Quality-driven Integration of Heterogenous Information Systems.",
                    "Physical Data Independence, Constraints, and Optimization with Universal Plans.",
                    "On Efficiently Implementing SchemaSQL on an SQL Database System.",
                    "Unrolling Cycles to Decide Trigger Termination.",
                    "User-Defined Table Operators: Enhancing Extensibility for ORDBMS.",
                    "Optimal Grid-Clustering: Towards Breaking the Curse of Dimensionality in High-Dimensional Clustering.",
                    "Similarity Search in High Dimensions via Hashing.",
                    "What can Hierarchies do for Data Warehouses?",
                    "O-O, What Have They Done to DB2?",
                    "High Level Indexing of User-Defined Types.",
                    "Implementation of SQL3 Structured Types with Inheritance and Value Substitutability.",
                    "Generating Call-Level Interfaces for Advanced Database Application Programming.",
                    "PM3: An Orthogonal Persistent Systems Programming Language - Design, Implementation, Performance.",
                    "Cost Models DO Matter: Providing Cost Information for Diverse Data Sources in a Federated System.",
                    "Active Storage Hierarchy, Database Systems and Applications - Socratic Exegesis.",
                    "Data-Driven, One-To-One Web Site Generation for Data-Intensive Applications.",
                    "Optimization of Run-time Management of Data Intensive Web-sites.",
                    "Extracting Large-Scale Knowledge Bases from the Web.",
                    "Aggregation Algorithms for Very Large Compressed Data Warehouses.",
                    "Extending Practical Pre-Aggregation in On-Line Analytical Processing.",
                    "Hierarchical Prefix Cubes for Range-Sum Queries.",
                    "Implementation of Two Semantic Query Optimization Techniques in DB2 Universal Database.",
                    "High-Performance Extensible Indexing.",
                    "Online Dynamic Reordering for Interactive Data Processing.",
                    "What Do Those Weird XML Types Want, Anyway?",
                    "Industrial Panel on Data Warehousing Technologies: Experiences, Challenges, and Directions.",
                    "Datawarehousing Has More Colours Than Just Black & White.",
                    "Curio: A Novel Solution for Efficient Storage and Indexing in Data Warehouses.",
                    "Hyper-Programming in Java.",
                    "Building Light-Weight Wrappers for Legacy Web Data-Sources Using W4F.",
                    "XML Repository and Active Views Demonstration.",
                    "Spatio-Temporal Retrieval with RasDaMan.",
                    "Miro Web: Integrating Multiple Data Sources through Semistructured Data Types.",
                    "Aqua: A Fast Decision Support Systems Using Approximate Query Answers.",
                    "The Mirror MMDBMS Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/dbtel/1999",
                "sub_name": "Databases in Telecommunications, International Workshop Co-located with VLDB-99, Edinburgh, Scotland, UK, September 6, 1999, Proceedings.",
                "count": 14,
                "papers": [
                    "Telecommunications Databases - Applications and Performance Analysis.",
                    "Overview of Data Management Issues and Experiments in TINA Networks.",
                    "PANACE: A System That Uses Database Technology to Manage Networks.",
                    "A Transactional Approach to Configuring Telecommunications Services.",
                    "Making LDAP Active with the LTAP Gateway; Case Study in Providing Telecom Integration and Enchanced Services.",
                    "Requirements Analysis of Distribution in Databases for Telecommunications.",
                    "Database Requirement Analysis for a Third Generation Mobile Telecom System.",
                    "Virtual Data Warehousing, Data Publishing, and Call Detail.",
                    "Joining Very Large Data Sets.",
                    "Assesment of Scaleable Database Architectures for CDR Analysis - An Experimental Approach.",
                    "How to Analyze 1 Billion CDRs per Sec on $200K Hardware.",
                    "A Distributed Real-Time Main-Memory Database for Telecommunication.",
                    "Database Architecture for Location and Trajectory Management in Telecommunications.",
                    "Panel Session: Do the DBMS SW Vendors Offer the Products Required by the Industrial User in the Communication Industry?"
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "24th VLDB 1998",
        "info": "New York City, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/98",
                "sub_name": "VLDB'98, Proceedings of 24rd International Conference on Very Large Data Bases, August 24-27, 1998, New York City, New York, USA.",
                "count": 82,
                "papers": [
                    "Atomicity versus Anonymity: Distributed Transactions for Electronic Commerce.",
                    "Technology and the Future of Commerce and Finance (Abstract).",
                    "Determining Text Databases to Search in the Internet.",
                    "Proximity Search in Databases.",
                    "Incremental Maintenance for Materialized Views over Semistructured Data.",
                    "Performance Measurements of Tertiary Storage Devices.",
                    "Active Storage for Large-Scale Data Mining and Multimedia.",
                    "Resource Scheduling for Composite Multimedia Objects.",
                    "Hash Joins and Hash Teams in Microsoft SQL Server.",
                    "Diag-Join: An Opportunistic Join Algorithm for 1:N Relationships.",
                    "Evaluating Functional Joins Along Nested Reference Sets in Object-Relational and Object-Oriented Databases.",
                    "Using Schema Matching to Simplify Heterogeneous Data Translation.",
                    "nD-SQL: A Multi-Dimensional Language for Interoperability and OLAP.",
                    "The Heterogeneity Problem and Middleware Technology: Experiences with and Performance of Database Gateways.",
                    "Reducing the Braking Distance of an SQL Query Engine.",
                    "Querying Continuous Time Sequences.",
                    "Low-Cost Compensation-Based Query Processing.",
                    "A Quantitative Analysis and Performance Study for Similarity-Search Methods in High-Dimensional Spaces.",
                    "Improving Adaptable Similarity Query Processing by Using Approximations.",
                    "MindReader: Querying Databases Through Multiple Examples.",
                    "Design and Analysis of Parametric Query Optimization Algorithms.",
                    "Inferring Function Semantics to Optimize Queries.",
                    "TOPAZ: a Cost-Based, Rule-Driven, Multi-Phase Parallelizer.",
                    "Filtering with Approximate Predicates.",
                    "Optimal Histograms with Quality Guarantees.",
                    "Binding Propagation in Disjunctive Databases.",
                    "Computing Iceberg Queries Efficiently.",
                    "Clustering Categorical Data: An Approach Based on Dynamical Systems.",
                    "Incremental Clustering for Mining in a Data Warehousing Environment.",
                    "On Optimal Node Splitting for R-trees.",
                    "R-Tree Based Indexing of Now-Relative Bitemporal Data.",
                    "Fast High-Dimensional Data Search in Incomplete Databases.",
                    "On the Discovery of Interesting Patterns in Association Rules.",
                    "Algorithms for Mining Association Rules for Binary Segmentations of Huge Categorical Databases.",
                    "Algorithms for Mining Distance-Based Outliers in Large Datasets.",
                    "PUBLIC: A Decision Tree Classifier that Integrates Building and Pruning.",
                    "RainForest - A Framework for Fast Decision Tree Construction of Large Datasets.",
                    "WaveCluster: A Multi-Resolution Clustering Approach for Very Large Spatial Databases.",
                    "An Asynchronous Avoidance-Based Cache Consistency Algorithm for Client Caching DBMSs.",
                    "Design, Implementation, and Performance of the LHAM Log-Structured History Data Access Method.",
                    "Secure Buffering in Firm Real-Time Database Systems.",
                    "Small Materialized Aggregates: A Light Weight Index Structure for Data Warehousing.",
                    "Materialized View Selection for Multidimensional Datasets.",
                    "Expiring Data in a Warehouse.",
                    "Safely and Efficiently Updating References During On-line Reorganization.",
                    "Buffering and Read-Ahead Strategies for External Mergesort.",
                    "Bulk-Loading Techniques for Object Databases and an Application to Relational Data.",
                    "Algorithms for Querying by Spatial Structure.",
                    "A Raster Approximation For Processing of Spatial Joins.",
                    "Scalable Sweeping-Based Spatial Join.",
                    "Ratio Rules: A New Paradigm for Fast, Quantifiable Data Mining.",
                    "Scalable Techniques for Mining Causal Structures.",
                    "Mining Surprising Patterns Using Temporal Description Length.",
                    "Massive Stochastic Testing of SQL.",
                    "Selectivity Estimation in Extensible Databases - A Neural Network Approach.",
                    "The Drill Down Benchmark.",
                    "Issues in Developing Very Large Data Warehouses.",
                    "The National Medical Knowledge Bank.",
                    "Bank of America Case Study: The Information Currency Advantage.",
                    "DTL's DataSpot: Database Exploration Using Plain Language.",
                    "From Data Independence to Knowledge Independence: An on-going Story.",
                    "Experiences in Federated Databases: From IRO-DB to MIRO-Web.",
                    "Materialized Views in Oracle.",
                    "Checkpointing in Oracle.",
                    "Architecture of Oracle Parallel Server.",
                    "KODA - The Architecture And Interface of a Data Model Independent Kernel.",
                    "The ADABAS Buffer Pool Manager.",
                    "A Database System for Real-Time Event Aggregation in Telecommunication.",
                    "Heterogeneous Database Query Optimization in DB2 Universal DataJoiner.",
                    "Plan-Per-Tuple Optimization Solution - Parallel Execution of Expensive User-Defined Functions.",
                    "Is Web-site Management a Database Problem?",
                    "Information, Communication, and Money: For What Can We Charge and How Can We Meter It?",
                    "Starting (and Sometimes Ending) a Database Company.",
                    "Bridging Heterogeneity: Research and Practice of Database Middleware Technology.",
                    "The Cubetree Storage Organization.",
                    "DataBlitz: A High Performance Main-Memory Storage Manager.",
                    "DMS: A Parallel Data Mining Server.",
                    "IBM's DB2 Universal Database demonstrations at VLDB'98.",
                    "MapInfo SpatialWare: A Spatial Information Server for RDBMS.",
                    "Objectivity Industrial Exhibit.",
                    "Oracle Industrial Exhibit.",
                    "A Single Pass Computing Engine for Interactive Analysis of VLDBs."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "23rd VLDB 1997",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/97",
                "sub_name": "VLDB'97, Proceedings of 23rd International Conference on Very Large Data Bases, August 25-29, 1997, Athens, Greece.",
                "count": 66,
                "papers": [
                    "Innovation in Database Management: Computer Science vs. Engineering.",
                    "The Microsoft Repository.",
                    "Multidimensional Access Methods: Trees Have Grown Everywhere.",
                    "Incremental Organization for Data Recording and Warehousing.",
                    "Multiple-View Self-Maintenance in Data Warehousing Environments.",
                    "Recovering Information from Summary Data.",
                    "A Language for Manipulating Arrays.",
                    "Implementing Abstract Objects with Inheritance in Datalogneg.",
                    "The Case for Enhanced Abstract Data Types.",
                    "Integrating Reliable Memory in Databases.",
                    "Logical and Physical Versioning in Main Memory Databases.",
                    "Using Versions in Update Transactions: Application to Integrity Checking.",
                    "A Foundation for Multi-dimensional Databases.",
                    "Fast Computation of Sparse Datacubes.",
                    "Data Warehouse Configuration.",
                    "Algorithms for Materialized View Design in Data Warehousing Environment.",
                    "An Efficient Cost-Driven Index Selection Tool for Microsoft SQL Server.",
                    "Materialized Views Selection in a Multidimensional Database.",
                    "Efficient Construction of Regression Trees with Range and Region Splitting.",
                    "Parallel Algorithms for High-dimensional Similarity Joins for Data Mining Applications.",
                    "STING: A Statistical Information Grid Approach to Spatial Data Mining.",
                    "Merging Ranks from Heterogeneous Internet Sources.",
                    "To Weave the Web.",
                    "Using Probabilistic Information in Data Integration.",
                    "On-Demand Data Elevation in Hierarchical Multimedia Storage Servers.",
                    "Principles of Optimally Placing Data in Tertiary Storage Libraries.",
                    "Vertical Data Migration in Large Near-Line Document Archives Based on Markov-Chain Predictions.",
                    "Describing and Using Query Capabilities of Heterogeneous Sources.",
                    "Don't Scrap It, Wrap It! A Wrapper Architecture for Legacy Data Sources.",
                    "Optimizing Queries Across Diverse Data Sources.",
                    "Optimizing Queries with Universal Quantification in Object-Oriented and Object-Relational Databases.",
                    "Parallel Query Scheduling and Optimization with Time- and Space-Shared Resources.",
                    "The Complexity of Transformation-Based Join Enumeration.",
                    "1-Safe Algorithms for Symmetric Site Configurations.",
                    "Adaptive Data Broadcast in Hybrid Networks.",
                    "Finding Data in the Neighborhood.",
                    "A One-Pass Algorithm for Accurately Estimating Quantiles for Disk-Resident Data.",
                    "Concurrent Garbage Collection in O2.",
                    "Garbage Collection in Object Oriented Databases Using Transactional Cyclic Reference Counting.",
                    "Dynamic Memory Adjustment for External Mergesort.",
                    "Evaluation of Main Memory Join Algorithms for Joins with Set Comparison Join Predicates.",
                    "Spatial Joins Using R-trees: Breadth-First Traversal with Global Optimizations.",
                    "A Generic Approach to Bulk Loading Multidimensional Index Structures.",
                    "A Region Splitting Strategy for Physical Database Design of Multidimensional File Organizations.",
                    "M-tree: An Efficient Access Method for Similarity Search in Metric Spaces.",
                    "DataGuides: Enabling Query Formulation and Optimization in Semistructured Databases.",
                    "Using Taxonomy, Discriminants, and Signatures for Navigating in Text Databases.",
                    "Towards an ODMG-Compliant Visual Object Query Language.",
                    "Fast Incremental Maintenance of Approximate Histograms.",
                    "Groupwise Processing of Relational Queries.",
                    "Selectivity Estimation Without the Attribute Value Independence Assumption.",
                    "Effective Memory Use in a Media Server.",
                    "Efficient User-Adaptable Similarity Search in Large Multimedia Databases.",
                    "Resource Scheduling in Enhanced Pay-Per-View Continuous Media Databases.",
                    "Integrating SQL Databases with Content-Specific Search Engines.",
                    "Facilitating Multimedia Database Exploration through Visual Interfaces and Perpetual Query Reformulations.",
                    "Geo/Environmental and Medical Data Management in the RasDaMan System.",
                    "GTE SuperPages: Using IR Techniques for Searching Complex Objects.",
                    "Data Manager for Evolvable Real-time Command and Control Systems.",
                    "Mining Insurance Data at Swiss Life.",
                    "The Network as a Global Database: Challenges of Interoperability, Proactivity, Interactiveness, Legacy.",
                    "Distributed Processing over Stand-alone Systems and Applications.",
                    "Critical Database Technologies for High Energy Physics.",
                    "Caprera: An Activity Framework for Transaction Processing on Wide-Area Networks.",
                    "The Oracle Universal Server Buffer.",
                    "Efficient Testing of High Performance Transaction Processing Systems."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "22nd VLDB 1996",
        "info": "Bombay, India",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/96",
                "sub_name": "VLDB'96, Proceedings of 22th International Conference on Very Large Data Bases, September 3-6, 1996, Mumbai (Bombay), India.",
                "count": 72,
                "papers": [
                    "The Changing Landscape of the Software Industry and its Implications for India.",
                    "Very Large Databases in a Commercial Application Environment.",
                    "Of Objects and Databases: A Decade of Turmoil.",
                    "Filter Trees for Managing Spatial Data over a Range of Size Granularities.",
                    "The X-tree : An Index Structure for High-Dimensional Data.",
                    "Analysis of n-Dimensional Quadtrees using the Hausdorff Fractal Dimension.",
                    "WATCHMAN : A Data Warehouse Intelligent Cache Manager.",
                    "Efficient Snapshot Differential Algorithms for Data Warehousing.",
                    "Incremental Maintenance of Externally Materialized Views.",
                    "Optimization of Queries with User-defined Predicates.",
                    "The Design and Implementation of a Sequence Database System.",
                    "EROC: A Toolkit for Building NEATO Query Optimizers.",
                    "A New SQL-like Operator for Mining Association Rules.",
                    "Sampling Large Databases for Association Rules.",
                    "Constructing Efficient Decision Trees by Using Optimized Numeric Association Rules.",
                    "Reordering Query Execution in Tertiary Memory Databases.",
                    "Query Processing Techniques for Multiversion Access Methods.",
                    "Coalescing in Temporal Databases.",
                    "Effective & Efficient Document Ranking without using a Large Lexicon.",
                    "PESTO : An Integrated Query/Browser for Object Databases.",
                    "Fast Nearest Neighbor Search in Medical Image Databases.",
                    "Query Decomposition and View Maintenance for Query Languages for Unstructured Data.",
                    "SchemaSQL - A Language for Interoperability in Relational Multi-Database Systems.",
                    "Querying Heterogeneous Information Sources Using Source Descriptions.",
                    "Supporting State-Wide Immunisation Tracking Using Multi-Paradigm Workflow Technology.",
                    "ZOO : A Desktop Experiment Management Environment.",
                    "Applying Data Mining Techniques to a Health Insurance Information System.",
                    "Querying Multiple Features of Groups in Relational Databases.",
                    "Modeling Skewed Distribution Using Multifractals and the '80-20' Law.",
                    "Answering Queries with Aggregation Using Views.",
                    "Semantic Data Caching and Replacement.",
                    "Clustering Techniques for Minimizing External Path Length.",
                    "Disseminating Updates on Broadcast Disks.",
                    "Implementation and Analysis of a Parallel Collection Query Language.",
                    "Calibrating the Query Optimizer Cost Model of IRO-DB, an Object-Oriented Federated Database System.",
                    "Cost-based Selection of Path Expression Processing Algorithms in Object-Oriented Databases.",
                    "Obtaining Complete Answers from Incomplete Databases.",
                    "Object Fusion in Mediator Systems.",
                    "The Role of Integrity Constraints in Database Interoperation.",
                    "Dynamic Load Balancing in Hierarchical Parallel Database Systems.",
                    "Estimation of Query-Result Distribution and its Application in Parallel-Join Load Balancing.",
                    "Intra-Transaction Parallelism in the Mapping of an Object Model to a Relational Multi-Processor System.",
                    "Supporting Periodic Authorizations and Temporal Reasoning in Database Access Control.",
                    "Querying a Multilevel Database: A Logical Analysis.",
                    "Further Improvements on Integrity Constraint Checking for Stratifiable Deductive Databases.",
                    "On the Computation of Multidimensional Aggregates.",
                    "Storage Estimation for Multidimensional Aggregates in the Presence of Hierarchies.",
                    "Information Retrieval from an Incomplete Data Cube.",
                    "SPRINT: A Scalable Parallel Classifier for Data Mining.",
                    "Modeling Design Versions.",
                    "Integrating Triggers and Declarative Constraints in SQL Database Systems.",
                    "Practical Issues with Commercial Use of Federated Databases.",
                    "Supporting Procedural Constructs in SQL Compilers.",
                    "Extracting Large Data Sets using DB2 Parallel Edition.",
                    "Cache Coherency in Oracle Parallel Server.",
                    "Scalablity and Availability in Oracle7 7.3.",
                    "Bellcore's ADAPT/X Harness System for Managing Information on Internet and Intranets.",
                    "DISNIC-PLAN: A NICNET Based Distributed Database for Micro-level Planning in India.",
                    "Large Databases for Remote Sensing and GIS.",
                    "DWMS: Data Warehouse Management System.",
                    "The XPS Approach to Loading and Unloading Terabyte Databases.",
                    "How System 11 SQL Server Became Fast.",
                    "Using Referential Integrity To Easily Define Consistent Subset Replicas.",
                    "The Query Optimizer in Tandem's new ServerWare SQL Product.",
                    "TPC-D: The Challenges, Issues and Results.",
                    "Tribeca: A Stream Database Manager for Network Traffic Analysis.",
                    "MineSet(tm): A System for High-End Data Mining and Visualization.",
                    "The Structured Information Manager: A Database System for SGML Documents.",
                    "Loading the Data Warehouse Across Various Parallel Architectures.",
                    "Performance of Future Database Systems: Bottlenecks and Bonananzas.",
                    "Database Management Systems and the Internet.",
                    "What is the Data Warehousing Problem? (Are Materialized Views the Answer?)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "21st VLDB 1995",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/95",
                "sub_name": "VLDB'95, Proceedings of 21th International Conference on Very Large Data Bases, September 11-15, 1995, Zurich, Switzerland.",
                "count": 72,
                "papers": [
                    "The Double Life of the Transaction Abstraction: Fundamental Principle and Evolving System Concept.",
                    "Document Management as a Database Problem.",
                    "From VLDB to VMLDB (Very MANY Large Data Bases): Dealing with Large-Scale Semantic Heterogenity.",
                    "A Performance Evaluation of OID Mapping Techniques.",
                    "OODB Bulk Loading Revisited: The Partitioned-List Approach.",
                    "Efficient Incremental Garbage Collection for Client-Server Object Database Systems.",
                    "W3QS: A Query System for the World-Wide Web.",
                    "Duplicate Removal in Information System Dissemination.",
                    "Generalizing GlOSS to Vector-Space Databases and Broker Hierarchies.",
                    "Hot Block Clustering for Disk Arrays with Dynamic Striping.",
                    "A Performance Study of Workfile Disk Management for Concurrent Mergesorts in a Multiprocessor Database System.",
                    "Declustering Databases on Heterogeneous Disk Systems.",
                    "Value-cognizant Speculative Concurrency Control.",
                    "High-Concurrency Locking in R-Trees.",
                    "Index Concurrency Control in Firm Real-Time Database Systems.",
                    "A Data Transformation System for Biological Data Sources.",
                    "Schema and Database Evolution in the O2 Object Database System.",
                    "Procedures in Object-Oriented Query Languages.",
                    "Towards a Cooperative Transaction Model - The Cooperative Activity Model.",
                    "A Practical and Modular Implementation of Extended Transaction Models.",
                    "Using Formal Methods to Reason about Semantics-Based Decompositions of Transactions.",
                    "Bypassing Joins in Disjunctive Queries.",
                    "Coloring Away Communication in Parallel Query Optimization.",
                    "The Fittest Survives: An Adaptive Approach to Query Optimization.",
                    "Type Classification of Semi-Structured Documents.",
                    "L/MRP: A Buffer Management Strategy for Interactive Continuous Data Flows in a Multimedia DBMS.",
                    "Retrieval of Composite Multimedia Objects.",
                    "Estimating the Selectivity of Spatial Queries Using the 'Correlation' Fractal Dimension.",
                    "Sampling-Based Estimation of the Number of Distinct Values of an Attribute.",
                    "A Cost Model for Clustered Object-Oriented Databases.",
                    "Processing Object-Oriented Queries with Invertible Late Bound Functions.",
                    "Eager Aggregation and Lazy Aggregation.",
                    "Aggregate-Query Processing in Data Warehousing Environments.",
                    "A Non-Uniform Data Fragmentation Strategy for Parallel Main-Menory Database Systems.",
                    "Managing Intra-operator Parallelism in Parallel Database Systems.",
                    "Dynamic Multi-Resource Load Balancing in Parallel Database Systems.",
                    "Mining Generalized Association Rules.",
                    "Discovery of Multiple-Level Association Rules from Large Databases.",
                    "An Efficient Algorithm for Mining Association Rules in Large Databases.",
                    "Improving Performance in Replicated Databases through Relaxed Coherency.",
                    "Redo Recovery after System Crashes.",
                    "The ClustRa Telecom Database: High Availability, High Throughput, and Real-Time Response.",
                    "NeuroRule: A Connectionist Approach to Data Mining.",
                    "Fast Similarity Search in the Presence of Noise, Scaling, and Translation in Time-Series Databases.",
                    "Querying Shapes of Histories.",
                    "A Scalable Architecture for Autonomous Heterogeneous Database Interactions.",
                    "OPOSSUM: Desk-Top Schema Management through Customizable Visualization.",
                    "Flexible Relations - Operational Support of Variant Relational Structures.",
                    "The hBP-tree: A Modified hB-tree Supporting Concurrency, Recovery and Node Consolidation.",
                    "Generalized Search Trees for Database Systems.",
                    "Near Neighbor Search in Large Metric Spaces.",
                    "Query Processing in Tertiary Memory Databases.",
                    "Applying Database Technology in the ADSM Mass Storage System.",
                    "Benchmarking Spatial Join Operations with Spatial Output.",
                    "Similarity based Retrieval of Pictures Using Indices on Spatial Relationships.",
                    "Scientific Journals: Extinction or Explosion? (Panel).",
                    "Databases and Workflow Management: What is it All About? (Panel).",
                    "Metrics for Accessing Heterogeneous Data: Is There Any Hope? (Panel).",
                    "Providing Database Migration Tools - A Practicioner's Approach.",
                    "Promises and Realities of Active Database Systems.",
                    "Database De-Centralization - A Practical Approach.",
                    "A Product Specification Database for Visual Prototyping.",
                    "Very Large Databases: How Large, How Different?",
                    "DB2 Query Parallelism: Staging and Implementation.",
                    "Managing a DB2 Parallel Edition Database.",
                    "DB2 Common Server: Technology, Progress, & Directions.",
                    "OS Support for VLDBs: Unix Enhancements for the Teradata Data Base.",
                    "Accessing a Relational Database through an Object-Oriented Database Interface.",
                    "Informix-Online XPS: A Dynamically Scalable RDBMS for Open Parallel Platforms.",
                    "The Oracle Warehouse.",
                    "Efficient Search of Multi-Dimensional B-Trees.",
                    "BigSur: A System For the Management of Earth Science Data."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "20th VLDB 1994",
        "info": "Santiago de Chile, Chile",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/94",
                "sub_name": "VLDB'94, Proceedings of 20th International Conference on Very Large Data Bases, September 12-15, 1994, Santiago de Chile, Chile.",
                "count": 69,
                "papers": [
                    "Semantic Integration in Heterogeneous Databases Using Neural Networks.",
                    "Providing Dynamic Security Control in a Federated Database.",
                    "An Approach for Building Secure Database Federations.",
                    "Optimization Algorithms for Exploiting the Parallelism-Communication Tradeoff in Pipelined Parallelism.",
                    "Dalí: A High Performance Main Memory Storage Manager.",
                    "Some Issues in Design of Distributed Deductive Databases.",
                    "Towards Automated Performance Tuning for Complex Workloads.",
                    "Fast, Randomized Join-Order Selection - Why Use Transformations?",
                    "Query Optimization by Predicate Move-Around.",
                    "Supporting Exceptions to Schema Consistency to Ease Schema Evolution in OODBMS.",
                    "Bulk Loading into an OODB: A Performance Study.",
                    "NAOS - Efficient and Modular Reactive Capabilities in an Object-Oriented Database System.",
                    "Efficient and Effective Clustering Methods for Spatial Data Mining.",
                    "Performance of Data-Parallel Spatial Operations.",
                    "The Impact of Global Clustering on Spatial Database Systems.",
                    "Indexing Multiple Sets.",
                    "Fast Incremental Indexing for Full-Text Information Retrieval.",
                    "The hcC-tree: An Efficient Index Structure for Object Oriented Databases.",
                    "A Transaction Replication Scheme for a Replicated Database with Node Autonomy.",
                    "A Top-Down Approach for Two Level Serializability.",
                    "New Concurrency Control Algorithms for Accessing and Compacting B-Trees.",
                    "OdeFS: A File System Interface to an Object-Oriented Database.",
                    "Implementing Lazy Database Updates for an Object Database System.",
                    "Access to Objects by Path Expressions and Rules.",
                    "Towards Event-Driven Modelling for Database Design.",
                    "GraphDB: Modeling and Querying Graphs in Databases.",
                    "Qualified Answers That Reflect User Needs and Preferences.",
                    "V-Trees - A Storage Method for Long Vector Data.",
                    "On Index Selection Schemes for Nested Object Hierarchies.",
                    "RP*: A Family of Order Preserving Scalable Distributed Data Structures.",
                    "Including Group-By in Query Optimization.",
                    "The GMAP: A Versatile Tool for Physical Data Independence.",
                    "Memory-Contention Responsive Hash Joins.",
                    "Database Graph Views: A Practical Model to Manage Persistent Graphs.",
                    "Persistent Threads.",
                    "Investigation of Algebraic Query Optimisation Techniques for Database Programming Languages.",
                    "Dual-Buffering Strategies in Object Bases.",
                    "2Q: A Low Overhead High Performance Buffer Management Replacement Algorithm.",
                    "Maximizing Buffer and Disk Utilizations for News On-Demand.",
                    "An Effective Deductive Object-Oriented Database Through Language Integration.",
                    "An Algebraic Approach to Rule Analysis in Expert Database Systems.",
                    "Fast Algorithms for Mining Association Rules in Large Databases.",
                    "Hilbert R-tree: An Improved R-tree using Fractals.",
                    "Cache Conscious Algorithms for Relational Query Processing.",
                    "Join Index Hierarchies for Supporting Efficient Navigations in Object-Oriented Databases.",
                    "Cumulative Updates.",
                    "On Spatially Partitioned Temporal Join.",
                    "Client-Server Paradise.",
                    "Reasoning About Spatial Relationships in Picture Retrieval Systems.",
                    "Content-Based Image Indexing.",
                    "A Low-Cost Storage Server for Movie on Demand Databases.",
                    "Composite Events for Active Databases: Semantics, Contexts and Detection.",
                    "From Nested-Loop to Join Queries in OODB.",
                    "Materialization: A Powerful and Ubiquitous Abstraction Pattern.",
                    "A Requirement-Based Approach to Data Modeling and Re-Engineering.",
                    "Experiments on Access to Digital Libraries: How can Images and Text be Used Together.",
                    "Data Integration in the Large: The Challenge of Reuse.",
                    "An Empirical Performance Study of the Ingres Search Accelerator for a Large Property Management Database System.",
                    "Modelling and Querying Video Data.",
                    "Data Compression Support in Databases.",
                    "An Overview of Repository Technology.",
                    "A Multidatabase System for Tracking and Retrieval of Financial Data.",
                    "Building a Laboratory Information System Around a C++-Based Object-Oriented DBMS.",
                    "Relating Distributed Objects.",
                    "Integrating a Structured-Text Retrieval System with an Object-Oriented Database System.",
                    "User Interfaces; Who Cares?",
                    "Scientific Databases - State of the Art and Future Directions.",
                    "PC Database Systems - Present and Future.",
                    "Challenges for Global Information Systems."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "19th VLDB 1993",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/93",
                "sub_name": "19th International Conference on Very Large Data Bases, August 24-27, 1993, Dublin, Ireland, Proceedings.",
                "count": 65,
                "papers": [
                    "Managing Derived Data in the Gaea Scientific DBMS.",
                    "Algebraic Optimization of Computations over Scientific Databases.",
                    "Tioga: Providing Data Management Support for Scientific Visualization Applications.",
                    "An Object Data Model with Roles.",
                    "A Model of Methods Access Authorization in Object-oriented Databases.",
                    "Versions of Simple and Composite Objects.",
                    "Querying and Updating the File.",
                    "Declustering Objects for Visualization.",
                    "The Rufus System: Information Organization for Semi-Structured Data.",
                    "Managing Semantic Heterogeneity with Production Rules and Persistent Queues.",
                    "The Use of Information Capacity in Schema Integration and Translation.",
                    "Specifying and Enforcing Intertask Dependencies.",
                    "Integrity Constraint and Rule Maintenance in Temporal Deductive Knowledge Bases.",
                    "Coral++: Adding Object-Orientation to a Logic Database Language.",
                    "Queries Independent of Updates.",
                    "Analysis of Dynamic Load Balancing Strategies for Parallel Shared Nothing Database Systems.",
                    "Performance of Catalog Management Schemes for Running Access Modules in a Locally Distributed Database System.",
                    "Implementation and Performance Evaluation of a Parallel Transitive Closure Algorithm on PRISMA/DB.",
                    "STDL - A Portable Language for Transaction Processing.",
                    "NCR 3700 - The Next-Generation Industrial Database Computer.",
                    "Collections of Objects in SQL3.",
                    "Universality of Serial Histograms.",
                    "Viewers: A Data-World Analogue of Procedure Calls.",
                    "Towards a Formal Approach for Object Database Design.",
                    "Searching Large Lexicons for Partially Specified Terms using Compressed Inverted Files.",
                    "Managing Temporal Financial Data in an Extensible Database.",
                    "Hamming Filters: A Dynamic Signature File Organization for Parallel Stores.",
                    "Managing Memory to Meet Multiclass Workload Response Time Goals.",
                    "Adaptive Database Buffer Allocation Using Query Feedback.",
                    "Dynamic Memory Allocation for Multiple-Query Workloads.",
                    "A Cost-Effective Method for Providing Improved Data Availability During DBMS Restart Recovery After a Failure.",
                    "Exploiting A History Database for Backup.",
                    "Recovering from Main-Memory Lapses.",
                    "Data Sharing Analysis for a Database Programming Lanaguage via Abstract Interpretation.",
                    "A Domain-theoretic Approach to Integrating Functional and Logic Database Languages.",
                    "Update Logging for Persistent Programming Languages: A Comparative Performance Evaluation.",
                    "On Implementing a Language for Specifying Active Database Execution Models.",
                    "An Adaptive Algorithm for Incremental Evaluation of Production Rules in Databases.",
                    "An Active Object-Oriented Database: A Multi-Paradigm Approach to Constraint Management.",
                    "Multi-Join Optimization for Symmetric Multiprocessors.",
                    "On the Effectiveness of Optimization Search Strategies for Parallel Execution Spaces.",
                    "Applying Hash Filters to Improving the Execution of Bushy Trees.",
                    "Control of an Extensible Query Optimizer: A Planning-Based Approach.",
                    "Query Optimization in the Presence of Foreign Functions.",
                    "A Blackboard Architecture for Query Optimization in Object Bases.",
                    "A Plan-Operator Concept for Client-Based Knowledge Progressing.",
                    "Toward Practical Constraint Databases.",
                    "Combining Theory and Practice in Integrity Control: A Declarative Approach to the Specification of a Transaction Modification Subsystem.",
                    "Reading a Set of Disk Pages.",
                    "Disk Mirroring with Alternating Deferred Updates.",
                    "Memory-Adaptive External Sorting.",
                    "A New Presumed Commit Optimization for Two Phase Commit.",
                    "Local Disk Caching for Client-Server Database Systems.",
                    "Key Range Locking Strategies for Improved Concurrency.",
                    "Predictions and Challenges for Database Systems in the Year 2000.",
                    "Object-Oriented Database Systems: Promises, Reality, and Future.",
                    "DBMS Research at a Crossroads: The Vienna Update.",
                    "Object Database Morphology.",
                    "Database Research Strategies of Funding Agencies (Panel).",
                    "Mobile Computing: Fertile Research Area or Black Hole? (Panel).",
                    "The Voice of the Customer: Innovative and Useful Research Directions (Panel).",
                    "A Practical Issue Concerning Very Large Data Bases: The Need for Query Governors.",
                    "Problems/Challenges facing Industry Data Base Users.",
                    "The Need for Data Quality.",
                    "Database Requirements of Knowledge-based Production Scheduling and Control: A CIM Perspective."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "18th VLDB 1992",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/92",
                "sub_name": "18th International Conference on Very Large Data Bases, August 23-27, 1992, Vancouver, Canada, Proceedings.",
                "count": 58,
                "papers": [
                    "CMD: A Multidimensional Declustering Method for Parallel Data Systems.",
                    "Using Segmented Right-Deep Trees for the Execution of Pipelined Hash Joins.",
                    "Practical Skew Handling in Parallel Joins.",
                    "Querying in Highly Mobile Distributed Environments.",
                    "A Temporal Evolutionary Object-Oriented Data Model and Its Query Language for Medical Image Management.",
                    "Using Flexible Transactions to Support Multi-System Telecommunication Applications.",
                    "Object-Oriented Database Systems.",
                    "Optimizing Boolean Expressions in Object-Bases.",
                    "Improved Unnesting Algorithms for Join Aggregate SQL Queries.",
                    "Parametric Query Optimization.",
                    "SVP: A Model Capturing Sets, Lists, Streams, and Parallelism.",
                    "Supporting Lists in a Data Model (A Timely Approach).",
                    "A Multi-Resolution Relational Data Model.",
                    "Resilient Logical Structures for Efficient Management of Replicated Data.",
                    "Dynamic Data Distribution (D3) in a Shared-Nothing Multiprocessor Data Store.",
                    "High Throughput Escrow Algorithms for Replicated Databases.",
                    "Multiview: A Methodology for Supporting Multiple Views in Object-Oriented Databases.",
                    "Entity Modeling in the MLS Relational Model.",
                    "An Extended Relational Database Model for Uncertain and Imprecise Information.",
                    "Spatial Databases.",
                    "Database Management in the Year 2000: Projections and Star Gazing (Panel).",
                    "A Method for Change Computation in Deductive Databases.",
                    "CORAL - Control, Relations and Logic.",
                    "Updates in a Rule-Based Language for Objects.",
                    "Georgraphic Information Systems, A Challenge for the 90's (Panel).",
                    "Proclamation-Based Model for Cooperating Transactions.",
                    "Query Optimization in a Heterogeneous DBMS.",
                    "The Principle of Commitment Ordering, or Guaranteeing Serializability in a Heterogeneous Environment of Multiple Autonomous Resource Mangers Using Atomic Commitment.",
                    "Database Tuning.",
                    "Implementing High Level Active Rules on Top of a Relational DBMS.",
                    "Composite Event Specification in Active Databases: Model & Implementation.",
                    "Production Rules in Parallel and Distributed Database Environments.",
                    "An Efficient Indexing Technique for Full Text Databases.",
                    "On B-Tree Indices for Skewed Distributions.",
                    "Random Sampling from Pseudo-Ranked B+ Trees.",
                    "Temporal Query Processing and Optimization in Multiprocessor Database Machines.",
                    "Incomplete Information in Relational Temporal Databases.",
                    "A Uniform Approach to Processing Temporal Queries.",
                    "A Performance Study of Alternative Object Faulting and Pointer Swizzling Strategies.",
                    "Performance Evaluation of an Adaptive and Robust Load Control Method for the Avoidance of Data-Contention Thrashing.",
                    "Extensible Buffer Management of Indexes.",
                    "Software Repositories.",
                    "A Conceptual Model for Dynamic Clustering in Object Databases.",
                    "Integrity Maintenance in Object-Oriented Databases.",
                    "Activity Model: A Declarative Approach for Capturing Communication Behavior in Object-Oriented Databases.",
                    "Database Technology for Reliable Systems: Issues, Impact, and Approaches (Panel).",
                    "Multiversion Query Locking.",
                    "Principles of Transaction-Based On-Line Reorganization.",
                    "Parallelism in a Main-Memory DBMS: The Performance of PRISMA/DB.",
                    "Locking and Latching in a Memory-Resident Database System.",
                    "Multidatabase Applications: Semantic and System Issues.",
                    "Knowledge Discovery in Databases: An Attribute-Oriented Approach.",
                    "An Interval Classifier for Database Mining Applications.",
                    "An Information-Retrieval Approach for Image Databases.",
                    "Experiences With an Object Manager for a Process-Centered Environment.",
                    "Global Memory Management in Client-Server Database Architectures.",
                    "Performance and Scalability of Client-Server Database Architectures.",
                    "Data Management for Real-Time Systems."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "17th VLDB 1991",
        "info": "Barcelona, Catalonia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/91",
                "sub_name": "17th International Conference on Very Large Data Bases, September 3-6, 1991, Barcelona, Catalonia, Spain, Proceedings.",
                "count": 61,
                "papers": [
                    "Semantic Modeling of Object Oriented Databases.",
                    "Integrating Implicit Answers with Object-Oriented Queries.",
                    "A Methodology for the Design and Transformation of Conceptual Schemas.",
                    "Experimental Evaluation of Real-Time Optimistic Concurrency Control Schemes.",
                    "Adaptive Load Control in Transaction Processing Systems.",
                    "A Performance Evaluation of Multi-Level Transaction Management.",
                    "Conceptual Modeling Using and Extended E-R Model (Abstract).",
                    "Semantic Queries with Pictures: The VIMSYS Model.",
                    "Optimization for Spatial Query Processing.",
                    "Efficiency of Nested Relational Document Database Systems.",
                    "A Formalism for Extended Transaction Model.",
                    "A Transactional Model for Long-Running Activities.",
                    "Safe Referential Integrity Structures in Relational Databases.",
                    "A Metadata Approach to Resolving Semantic Conflicts.",
                    "Solving Domain Mismatch and Schema Mismatch Problems with an Object-Oriented Database Programming Language.",
                    "Management Of Schema Evolution In Databases.",
                    "Using Write Protected Data Structures To Improve Software Fault Tolerance in Highly Available Database Management Systems.",
                    "Adaptive Locking Strategies in a Multi-node Data Sharing Environment.",
                    "Recovery and Coherency-Control Protocols for Fast Intersystem Page Transfer and Fine-Granularity Locking in a Shared Disks Transaction Environment.",
                    "Active Database Systems (Abstract).",
                    "Algebraic Properties of Bag Data Types.",
                    "The Power of Methods With Parallel Semantics.",
                    "Dynamic Constraints and Object Migration.",
                    "Object Placement in Parallel Hypermedia Systems.",
                    "Fido: A Cache That Learns to Fetch.",
                    "Predictive Load Control for Flexible Buffer Allocation.",
                    "Implementing Set-Oriented Production Rules as an Extension to Starburst.",
                    "Effects of Database Size on Rule System Performance: Five Case Studies.",
                    "Data Management for Large Rule Systems.",
                    "Data and Knowledge Bases for Genome Mapping: What Lies Ahead? (Panel).",
                    "Distributed Database Management: Current State-of-the-Art, Unsolved Problems, New Issues (Abstract).",
                    "Real-Time Databases (Panel).",
                    "Cooperative Database Design (Panel).",
                    "Rule Management in Object Oriented Databases: A Uniform Approach.",
                    "Ode as an Active Database: Constraints and Triggers.",
                    "A Model for Active Object Oriented Databases.",
                    "Kaleidoscope Data Model for An English-like Query Language.",
                    "Extending the Search Strategy in a Query Optimizer.",
                    "Performance Analysis of a Load Balancing Hash-Join Algorithm for a Shared Memory Multiprocessor.",
                    "Cooperative Access to Data and Knowledge Baes (Abstract).",
                    "An Iterative Method for Distributed Database Design.",
                    "A Framework for Automating Physical Database Design.",
                    "Optimizing Random Retrievals from CLV format Optical Disks.",
                    "Temporal Logic & Historical Databases.",
                    "A Temporal Knowledge Representation Model OSAM*/T and Its Query Language OQL/T.",
                    "An Evaluation of Non-Equijoin Algorithms.",
                    "Database Technologies for the 90's and Beyond (Panel).",
                    "Language Constructs for Programming Active Databases.",
                    "Alert: An Architecture for Transforming a Passive DBMS into an Active DBMS.",
                    "On Maintaining Priorities in a Production Rule System.",
                    "Federated Database Systems for Managing Distributed, Heterogeneous, and Autonomous Databases.",
                    "A Functional Programming Approach to Deductive Databases.",
                    "Aggregation and Relevance in Deductive Databases.",
                    "Integrity Constraints Checking In Deductive Databases.",
                    "Handling Data Skew in Multiprocessor Database Computers Using Partition Tuning.",
                    "A Taxonomy and Performance Model of Data Skew Effects in Parallel Joins.",
                    "Optimization of Multi-Way Join Queries for Parallel Execution.",
                    "Interoperability In Multidatabases: Semantic and System Issues (Panel).",
                    "Logic Programming Environments for Large Knowledge Bases: A Practical Perspective (Abstract).",
                    "A Relationship Mechanism for a Strongly Typed Object-Oriented Database Programming Language.",
                    "Deriving Production Rules for Incremental View Maintenance."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "16th VLDB 1990",
        "info": "Brisbane, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/90",
                "sub_name": "16th International Conference on Very Large Data Bases, August 13-16, 1990, Brisbane, Queensland, Australia, Proceedings.",
                "count": 60,
                "papers": [
                    "The Time Index: An Access Structure for Temporal Data.",
                    "A Temporal Relational Algebra as Basis for Temporal Relational Completeness.",
                    "Support for Temporal Data by Complex Objects.",
                    "Indexing in a Hypertext Database.",
                    "Search Key Substitution in the Encipherment of B-Trees.",
                    "Query Processing for Multi-Attribute Clustered Records.",
                    "Triggered Real-Time Databases with Consistency Constraints.",
                    "Cooperative Transaction Hierarchies: A Transaction Model to Support Design Applications.",
                    "A Formal Approach to Recovery by Compensating Transactions.",
                    "A Study of Three Alternative Workstation-Server Architectures for Object Oriented Database Systems.",
                    "Maintaining Consistency of Client-Cached Data.",
                    "The Performance and Utility of the Cactis Implementation Algorithms.",
                    "Parity Striping of Disk Arrays: Low-Cost Reliable Storage with Acceptable Throughput.",
                    "Performance Analysis of Disk Arrays under Failure.",
                    "Transaction Support in Read Optimizied and Write Optimized File Systems.",
                    "An Adaptive Hash Join Algorithm for Multiuser Environments.",
                    "Hash-Based Join Algorithms for Multiprocessor Computers.",
                    "Bucket Spreading Parallel Hash: A New, Robust, Parallel Hash Join Method for Data Skew in the Super Database Computer (SDC).",
                    "Two Epoch Algorithms for Disaster Recovery.",
                    "Adaptable Recovery Using Dynamic Quorum Assignments.",
                    "The Tree Quorum Protocol: An Efficient Approach for Managing Replicated Data.",
                    "Factoring Augmented Regular Chain Programs.",
                    "The Magic of Duplicates and Aggregates.",
                    "How to Forget the Past Without Repeating It.",
                    "Advanced Query Processing in Object Bases Using Access Support Relations.",
                    "Elimination of View and Redundant Variables in a SQL-like Database Language for Extended NF2 Structures.",
                    "Measuring the Complexity of Join Enumeration in Query Optimization.",
                    "Hybrid Transitive Closure Algorithms.",
                    "Distributed Transitive Closure Computations: The Disconnection Set Approach.",
                    "A Parallel Strategy for Transitive Closure usind Double Hash-Based Clustering.",
                    "Rule Ordering in Bottom-Up Fixpoint Evaluation of Logic Programs.",
                    "Efficient Implementation of Loops in Bottom-Up Evaluation of Logic Queries.",
                    "Right-, left- and multi-linear rule transformations that maintain context information.",
                    "ARIES/KVL: A Key-Value Locking Method for Concurrency Control of Multiaction Transactions Operating on B-Tree Indexes.",
                    "Commit_LSN: A Novel and Simple Method for Reducing Locking and Latching in Transaction Processing Systems.",
                    "The Effect of Skewed Data Access on Buffer Hits and Data Contention an a Data Sharing Environment.",
                    "Consistency of Versions in Object-Oriented Databases.",
                    "Database Application Development as an Object Modeling Activity.",
                    "ILOG: Declarative Creation and Manipulation of Object Identifiers.",
                    "Tradeoffs in Processing Complex Join Queries via Hashing in Multiprocessor Database Machines.",
                    "Hybrid-Range Partitioning Strategy: A New Declustering Strategy for Multiprocessor Database Machines.",
                    "An Adaptive Data Placement Scheme for Parallel Database Computer Systems.",
                    "A Multidatabase Transaction Model for InterBase.",
                    "A Polygen Model for Heterogeneous Database Systems: The Source Tagging Perspective.",
                    "The C-based Database Programming Language Jasmine/C.",
                    "Synthesizing Database Transactions.",
                    "Deriving Production Rules for Constraint Maintainance.",
                    "Referential Integrity Revisited: An Object-Oriented Perspective.",
                    "The Buddy-Tree: An Efficient and Robust Access Method for Spatial Data Base Systems.",
                    "Query Processing for Distance Metrics.",
                    "On Indexing Line Segments.",
                    "On Restructuring Nested Relations in Partitioned Normal Form.",
                    "Non-Monotonic Knowledge Evolution in VLKDBs.",
                    "Database Updates through Abduction.",
                    "An Incremental Join Attachment for Starburst.",
                    "Distributed Linear Hashing and Parallel Projection in Main Memory Databases.",
                    "Efficient Main Memory Data Management Using the DBGraph Storage Model.",
                    "A Probabilistic Framework for Vague Queries and Imprecise Information in Databases.",
                    "Priority-Hints: An Algorithm for Priority-Based Buffer Management.",
                    "Concept Description Language for Statistical Data Modeling."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "15th VLDB 1989",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/89",
                "sub_name": "Proceedings of the Fifteenth International Conference on Very Large Data Bases, August 22-25, 1989, Amsterdam, The Netherlands.",
                "count": 51,
                "papers": [
                    "From a laguna to open waters: Another view on the next generations of databases.",
                    "Knowledge to Mediate from User's Workstations to Databases.",
                    "On the design and implementation of information systems from deductive conceptual models.",
                    "A Deductive Method for Entity-Relationship Modeling.",
                    "A Family of Incomplete Relational Database Models.",
                    "Gral: An Extensible Relational Database System for Geometric Applications.",
                    "The LSD tree: Spatial Access to Multidimensional Point and Nonpoint Objects.",
                    "Managing Complex Objects in an Extensible Relational DBMS.",
                    "Effective Resource Utilization for Multiprocessor Join Execution.",
                    "Optimization and Dataflow Algorithms for Nested Tree Queries.",
                    "Parallel Processing of Recursive Queries in Distributed Architectures.",
                    "Pasta-3's Graphical Query Language: Direct Manipulation, Cooperative Queries, Full Expressive Power.",
                    "ENIAM: A More Complete Conceptual Schema Language.",
                    "FaceKit: A Database Interface Design Toolkit.",
                    "A Low Communication Sort Algorithm for a Parallel Database Machine.",
                    "Percentile Finding Algorithm for Multiple Sorted Runs.",
                    "A Signature Access Method for the Starburst Database System.",
                    "Commutativity and its Role in the Processing of Linear Recursion.",
                    "Estimating the Size of Generalized Transitive Closures.",
                    "Argument Reduction by Factoring.",
                    "Database Support for Hypertext.",
                    "Finding Regular Simple Paths in Graph Databases.",
                    "Towards on Open Architecture for LDL.",
                    "Event-Join Optimization in Temporal Relational Databases.",
                    "Achieving Zero Information-Loss in a Classical Database Environment.",
                    "Derived Data Update in Semantic Databases.",
                    "Using Integrity Constraints to Provide Intensional Answers to Relational Queries.",
                    "Integration of Buffer Management and Query Optimization in Relational Database Environment.",
                    "The Effect of Bucket Size Tuning in the Dynamic Hybrid GRACE Hash Join Method.",
                    "Building knowledge-based applications with cooperating databases.",
                    "Random Sampling from B+ Trees.",
                    "Aggregate Evaluability in Statistical Databases.",
                    "Aggregates in Possibilistic Databases.",
                    "Extending the Relational Algebra to Capture Complex Objects.",
                    "Sorting, Grouping and Duplicate Elimination in the Advanced Information Management Prototype.",
                    "Optimization of Relational Schemas Containing Inclusion Dependencies.",
                    "The Case For Safe RAM.",
                    "ARIES/NT: A Recovery Method Based on Write-Ahead Logging for Nested Transactions.",
                    "Quasi Serializability: a Correctness Criterion for Global Concurrency Control in InterBase.",
                    "The O2 Object Manager: an Overview.",
                    "On Correctly Configuring Versioned Objects.",
                    "The Starburst Long Field Manager.",
                    "Scheduling Real-Time Transactions with Disk Resident Data.",
                    "Priority in DBMS Resource Scheduling.",
                    "The O2 Database Programming Language.",
                    "A Model of Queries for Object-Oriented Databases.",
                    "OQL: A Query Language for Manipulating Object-oriented Databases.",
                    "Database Tools and Interfaces.",
                    "Monitoring Database Objects.",
                    "Situation Monitoring for Active Databases.",
                    "Future research directions: Evidence from this conference."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "14th VLDB 1988",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/88",
                "sub_name": "Fourteenth International Conference on Very Large Data Bases, August 29 - September 1, 1988, Los Angeles, California, USA, Proceedings.",
                "count": 42,
                "papers": [
                    "Scheduling Real-time Transactions: a Performance Evaluation.",
                    "Distributed Concurrency Control Performance: A Study of Algorithms, Distribution, and Replication.",
                    "Split-Transactions for Open-Ended Activities.",
                    "Enforcing Inclusion Dependencies and Referencial Integrity.",
                    "Closed World Databases Opened Through Null Values.",
                    "Implementing Queries and Updates on Universal Scheme Interfaces.",
                    "An Implementation for Nested Relational Databases.",
                    "A Performance Study of Query Optimization Algorithms on a Database System Supporting Procedures.",
                    "The Partial Normalized Storage Model of Nested Relations.",
                    "Browsing Electronic Mail: Experiences Interfacing a Mail System to a DBMS.",
                    "Towards a Spatial Query Language: User Interface Considerations.",
                    "Management of Complex Objects as Dynamic Forms.",
                    "Versions of Schema for Object-Oriented Databases.",
                    "Temporal Relationships in Databases.",
                    "A logical framework for temporal deductive databases.",
                    "Dynamic Derivation of Personalized Views.",
                    "Administration and Autonomy in a Replication-Transparent Distributed DBMS.",
                    "Rapid Application Prototyping the PROQUEL Language.",
                    "Implementing an Interpreter for Functional Rules in a Query Optimizer.",
                    "Anatomy of a Mudular Multiple Query Optimizer.",
                    "Selectivity Estimation and Query Optimization in Large Databases with Highly Skewed Distribution of Column Values.",
                    "Towards a Real Horn Clause Language.",
                    "Fixed-point semantics and the representation of algorithms on large data.",
                    "Computing Facts in Non-Horn Deductive Systems.",
                    "Fast Text Access Methods for Optical and Large Magnetic Disks: Designs and Performance Comparison.",
                    "Design and Implementation of an Extensible Database Management System Supporting User Defined Data Types and Functions.",
                    "Extended User-Defined Indexing with Application to Textual Databases.",
                    "The Design of XPRS.",
                    "Disk Shadowing.",
                    "An Analysis of Three Transaction Processing Architectures.",
                    "A Superimposed Coding Scheme Based on Multiple Block Descriptor Files for Indexing Very Large Data Bases.",
                    "Techniques for Design and Implementation of Efficient Spatial Access Methods.",
                    "Compact 0-Complete Trees.",
                    "Efficient Transitive Closure Algorithms.",
                    "Modelling Non Deterministic Queries and Updates in Deductive Databases.",
                    "Efficient Search in Very Large Databases.",
                    "Reducing Storage for Quorum Consensus Algorithms.",
                    "A Theory of Timestamp-Based Concurrency Control for Nested Transactions.",
                    "Mixed concurrency control: Dealing with heterogeneity in distributed database systems.",
                    "A Formal Model of Trade-off between Optimization and Execution Costs in Semantic Query Optimization.",
                    "Hash-Partitioned Join Method Using Dynamic Destaging Strategy.",
                    "An Information-Theoretic Study on Aggregate Responses."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "13th VLDB 1987",
        "info": "Brighton, England",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/87",
                "sub_name": "VLDB'87, Proceedings of 13th International Conference on Very Large Data Bases, September 1-4, 1987, Brighton, England.",
                "count": 53,
                "papers": [
                    "Database Support for Knowledge-Based Image Evaluation.",
                    "MOBY: An Architecture for Distributed Expert Database Systems.",
                    "Magic Functions: A Technique to Optimize Extended Datalog Recursive Programs.",
                    "Optimization of Systems of Algebraic Equations for Evaluating Datalog Queries.",
                    "Recursive Strategies for Answering Recursive Queries - The RQA/FQI Strategy.",
                    "Using Design Axioms and Topology to Model Database Semantics.",
                    "Integrity Checking in Deductive Databases.",
                    "The Theory of Probabilistic Databases.",
                    "The POSTGRES Data Model.",
                    "FAD, a Powerful and Simple Database Language.",
                    "Object-Oriented Specification of Databases: An Algebraic Approach.",
                    "Constructing Database Systems in a Persistent Environment.",
                    "Incremental Reorganization of Relational Databases.",
                    "Supporting Flat Relations by a Nested Relational Kernel.",
                    "On The Satisfiability of Dependency Constraints in Entity-Relationship Schemata.",
                    "Dependency Inference.",
                    "Independent Database Schemes under Functional and Inclusion Dependencies.",
                    "Providing Time-Related Constraints for Conventional Database Systems.",
                    "Dealing with Temporal Schema Anomalies in History Databases.",
                    "Behaviour Management in Database Applications.",
                    "Of Nests and Trees: A Unified Approach to Processing Queries That Contain Nested Subqueries, Aggregates, and Quantifiers.",
                    "A Comparison of Self-Contained and Embedded Database Languages.",
                    "Preferences; Putting More Knowledge into Queries.",
                    "A Source-to-Source Meta-Translation System for Relational Query Languages.",
                    "Translating and Optimizing SQL Queries Having Aggregates.",
                    "Query Transformation for PSJ-Queries.",
                    "Direct Algorithms for Computing the Transitive Closure of Database Relations.",
                    "New Strategies for Computing the Transitive Closure of a Database Relation.",
                    "An Extended Disjunctive Normal Form Approach for Optimizing Recursive Logic Queries in Loosely Coupled Environments.",
                    "The Design of the POSTGRES Storage System.",
                    "Index Access with a Finite Buffer.",
                    "A New Compression Method with Fast Searching on Large Databases.",
                    "Multimedia Information Management in an Object-Oriented Database System.",
                    "Freeform: A User-Adaptable Form Management System.",
                    "Mind Your Grammar: a New Approach to Modelling Text.",
                    "An Analytical Method for Estimating and Interpreting Query Time.",
                    "Measured Performance of Time Interval Concurrency Control Techniques.",
                    "Query Optimization by Stored Queries.",
                    "Basis of a Partially Informed Distributed Database.",
                    "Extending Logging for Database Snapshot Refresh.",
                    "Enhancements to the Voting Algorithm.",
                    "Masking System Crashes in Database Application Programs.",
                    "Integrity Constraint Reformulation for Efficient Validation.",
                    "Log-Based Recovery for Nested Transactions.",
                    "PRIMA - a DBMS Prototype Supporting Engineering Applications.",
                    "DVSS: A Distributed Version Storage Server for CAD Applications.",
                    "Managing Change in a Computer-Aided Design Database.",
                    "Design and Analysis of Integrated Concurrency-Coherence Controls.",
                    "Performance Evaluation of an Operating System Transaction Manager.",
                    "Cooperative Object Buffer Management in the Advanced Information Management Prototype.",
                    "Expert Database Support for Consistent Dynamic Objects.",
                    "A Dual Space Representation for Geometric Data.",
                    "The R+-Tree: A Dynamic Index for Multi-Dimensional Objects."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "12th VLDB 1986",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/86",
                "sub_name": "VLDB'86 Twelfth International Conference on Very Large Data Bases, August 25-28, 1986, Kyoto, Japan, Proceedings.",
                "count": 56,
                "papers": [
                    "Knowledge-based Integrity Constraint Validation.",
                    "Checking Consistency of Database Constraints: a Logical Basis.",
                    "Adaptive Predicate Managers in Database Systems.",
                    "LDL: A Logic-Based Data Language.",
                    "Optimizing the Rule-Data Interface in a KMS.",
                    "Retrieval-By-Unification Operation on a Relational Knowledge Base.",
                    "Historical Multi-Media Databases.",
                    "Using History Information to Process Delayed Database Updates.",
                    "Temporal Data Management.",
                    "Object and File Management in the EXODUS Extensible Database System.",
                    "Implementation Techniques of Complex Objects.",
                    "Managing Text as Data.",
                    "Estimating Block Accessses when Attributes are Correlated.",
                    "Optimization of Nonrecursive Queries.",
                    "Translating Aggregate Queries into Iterative Programs.",
                    "R* Optimizer Validation and Performance Evaluation for Distributed Queries.",
                    "Simple Random Sampling from Relational Databases.",
                    "Completeness Information and Its Application to Query Processing.",
                    "The Idea of De-Clustering and its Applications.",
                    "A Superjoin Algorithm for Deductive Databases.",
                    "A Study of Sort Algorithms for Multiprocessor Database Machines.",
                    "An Overview of The System Software of A Parallel Relational Database Machine GRACE.",
                    "A Reliable Backend Using Multiattribute Clustering and Select-Join Operator.",
                    "GAMMA - A High Performance Dataflow Database Machine.",
                    "Concurrent Operations in Extendible Hashing.",
                    "The Management of Dynamically Distributed Database Windows (Extended Abstract).",
                    "On Affinity Based Routing in Multi-System Data Sharing.",
                    "ECRINS/86: An Extended Entity-Relationship Data Base Management System and its Semantic Query Language.",
                    "An Extended Relational Database System and It's Application to Management of Logic Diagrama.",
                    "Designing A Generalized NF2 Model with an SQL-Type Language Interface.",
                    "An Observation on Database Buffering Performance Metrics.",
                    "A Study of Index Structures for Main Memory Database Management Systems.",
                    "Transposition Algorithms on Very Large Compressed Databases.",
                    "Knowledge-Bases and Database Engineering.",
                    "A General Model for Version Management in Databases.",
                    "Toward a General Spatial Data Model for an Object-Oriented DBMS.",
                    "A Unifying Framework for Version Control in a CAD Environment.",
                    "Framework for the Security Component of an Ada DBMS.",
                    "Preliminary Design of ADMS±: A Workstation-Mainframe Integrated Architecture for Database Management Systems.",
                    "The REMIT System for Paraphrasing Relational Query Expressions into Natural Language.",
                    "Relational Data Model with Cause-Effect Association (Abstract).",
                    "On Analogical Query Processing in Logic Database.",
                    "Multiple Query Processing in Deductive Databases using Query Graphs.",
                    "Translation and Optimization of Logic Queries: The Algebraic Approach.",
                    "On the Computation of the Transitive Closure of Relational Operators.",
                    "A Parallel Processing Strategy for Evaluating Recursive Queries.",
                    "Towards DBMSs for Supporting New Applications.",
                    "Database Research at MCC (Abstract).",
                    "Research and Development on Knowledge Bases Systems at ICOT.",
                    "On the Properties of Extended Inclusion Dependencies.",
                    "Updating Derived Relations: Detecting Irrelevant and Autonomously Computable Updates.",
                    "Choosing a View Update Translator by Dialog at View Definition Time.",
                    "Anyone for a VLDB in The Year 2000?",
                    "Computer and Communication System Development among Financial Institutions in Japan.",
                    "A Very Large Database System to Serve National Welfare.",
                    "New Seat Reservation System for Japanese National Railways - Distributed Processing Network and High Efficiency Databases."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "11th VLDB 1985",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/85",
                "sub_name": "VLDB'85, Proceedings of 11th International Conference on Very Large Data Bases, August 21-23, 1985, Stockholm, Sweden.",
                "count": 44,
                "papers": [
                    "Multiprocessor Hash-Based Join Algorithms.",
                    "Some Experimental Results on Distributed Join Algorithms in a Local Network.",
                    "The Private Workspace Model Feasibility and Applications to 2PL Performance Improvements.",
                    "G-WHIZ, a Visual Interface for the Functional Model with Recursion.",
                    "Multirelations - Semantice and Languages.",
                    "ARIEL - A Semantic Front-End to Relational DBMSs.",
                    "File Processing Efficiency on the Content Addressable File Store.",
                    "Dynamic and Order Preserving Data Partitioning for Database Machines.",
                    "Design of a Signature File Method that Accounts for Non-Uniform Occurrence and Query Frequencies.",
                    "Updating Replicated Data During Communications Failures.",
                    "On-the-Fly, Incremental, Consistent Reading of Entire Databases.",
                    "Understanding the Implications of View Update Policies.",
                    "Concurrency Control in B+-Trees Databases Using Preparatory Operations.",
                    "Pre-Analysis Locking: A Safe and Deadlock Free Locking Policy.",
                    "Locking with Prevention of Cyclic and Infinite Restarting in Distributed Database Systems.",
                    "An Object-Oriented Environment for OIS Applications.",
                    "The Type Concept in Office Document Retrieval.",
                    "\"Fill-in-the-Form\" Programming.",
                    "Local and Global Query Optimization Mechanisms for Relational Databases.",
                    "A Time Bound on the Materialization of some Recursively Defined Views.",
                    "A Tool for Modular Database Design.",
                    "Database Design Tools: An Expert System Approach.",
                    "The MR Diagram - A Model for Conceptual Database Design.",
                    "Incremental File Reorganization Schemes.",
                    "Selective Deferred Index Maintenance & Concurrency Control in Integrated Information Systems.",
                    "Bit Transposed Files.",
                    "NetBook - a Data Model to Support Knowledge Exploration.",
                    "Accommodating Exceptions in Databases, and Refining the Schema by Learning from them.",
                    "Coping with Complexity in Automated Reasoning about Database Systems.",
                    "A Model of CAD Transactions.",
                    "An Architecture and Data Model for CAD Databases.",
                    "An Extensible Object-Oriented Approach to Databases for VLSI/CAD.",
                    "Update Semantics for Incomplete Databases.",
                    "Hit Data Model Data Bases from the Functional Point of View.",
                    "Determining when a Structure is a Nested Relation.",
                    "A Knowledge-Based Approach to Data Management for Intelligent User Interfaces.",
                    "The Representation and Deductive Retrieval of Complex Objects.",
                    "Functional Dependencies in Logic Programs.",
                    "An Evaluation of Buffer Management Strategies for Relational Database Systems.",
                    "An Efficient Implementation of a Relational Data Base.",
                    "Database Machine Morphology.",
                    "On Semantic Reefs and Efficient Processing of Correlation Queries with Aggregates.",
                    "Data Constructors: On the Integration of Rules and Relations.",
                    "Computing Queries from Derived Relations."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "10th VLDB 1984",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/84",
                "sub_name": "Tenth International Conference on Very Large Data Bases, August 27-31, 1984, Singapore, Proceedings.",
                "count": 55,
                "papers": [
                    "Database Portals: A New Application Program Interface.",
                    "A Personal Data Manager.",
                    "Query Processing on Personal Computers: A Pragmatic Approach (Extended Abstract).",
                    "Ski: A Semantics-Knowledgeable Interface.",
                    "Dependency Satisfaction in Databases with Incomplete Information.",
                    "Transactions in Relational Databases (Preliminary Report).",
                    "A Data Manipulation Model: An Extension of the Alpha Expression.",
                    "A Less Costly Constraints Checking for Join Dependency.",
                    "Datadict - A Data Analysis and Logical Database Design Tool.",
                    "Relationship Merging in Schema Integration.",
                    "A Temporal Framework for Database Specification and Verification.",
                    "Statistical Databases.",
                    "The Performance of Concurrency Control Algorithms for Database Management Systems.",
                    "Choice and Performance in Locking for Databases.",
                    "Evaluating Multiple Server DBMS in General Purpors Operating System Environments.",
                    "Characteristics of Scientific Databases.",
                    "Nested Transactions with Multiple Commit Points: An Approach to the Structuring of Advanced Database Applications.",
                    "Molecular Objects, Abstract Data Types, and Data Models: A Framework.",
                    "Equivalence and Mapping of Database Schemes.",
                    "Comprehensive Approach to the Design of Relational Database Schemes.",
                    "Interval Queries on Object Histories: Extended Abstract.",
                    "Line Graph of Gamma-Acyclic Database Schems and its Recognition Algorithm.",
                    "Bit-Sliced VLSI Algorithm for Search and Sort.",
                    "Towards an Optimal Data-Structure: CB-trees.",
                    "A Dynamic Perfect Hash Function Defined by an Extended Hash Indicator Table.",
                    "Databases for Expert Systems.",
                    "Development of a Multimedia Information System for an Office Environment.",
                    "End User Access to Very Large Databases in an Automated Office/Workstation Environment.",
                    "Language Support for Office Modelling.",
                    "Constraint Equations: Declarative Expression of Constraints With Automatic Enforcement.",
                    "Specification, Semantics, and Enforcement of Dynamic Database Constraints.",
                    "A Relational Database View Update Translation Mechanism.",
                    "Hashing Methods and Relational Algebra Operations.",
                    "Extending the Algebraic Framework of Query Processing to Handle Outerjoins.",
                    "Processing Read-Only Queries Over Views With Generalization.",
                    "A Transaction Mechanism for Engineering Design Databases.",
                    "An Example of Knowledge-Based Query Processing in a CAD/CAM DBMS.",
                    "Information Processing for CAD/VLSI on a Generalized Data Management System.",
                    "Certification by Intervals of Timestamps in Distributed Database Systems.",
                    "UNIBASE - An Integrated Access to Databases.",
                    "A Strategy for Decomposing Complex Queries in a Heterogeneous DDB.",
                    "Optimization of Nested Queries in a Distributed Relational Database.",
                    "Processing Inequality Queries Based on Generalized Semi-Joins.",
                    "Optimizing Star Queries in a Distributed Database System.",
                    "Inexpensive Large Capacity Storage will Revolutionize the Design of Database Management Systems.",
                    "Robustness to Crash in a Distributed Database: A Non Shared-memory Multi-Processor Approach.",
                    "Architectural Issues of Transaction Management in Multi-Layered Systems.",
                    "Distributed Transaction Management in Jasmin.",
                    "Unified Dynamic Hashing.",
                    "Cascade Hashing.",
                    "A Mapping Function for the Directory of a Multidimensional Extendible Hashing.",
                    "Integration of Time Versions into a Relational Database System.",
                    "Name-Tracing Using the ICL Content Addressable Filestore.",
                    "Automatic Classification of Office Documents by Coupling Relational Data Bases and PROLOG Expert Systems.",
                    "Retrieval of Relational Structures for Image Sequence Analysis."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "9th VLDB 1983",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/83",
                "sub_name": "9th International Conference on Very Large Data Bases, October 31 - November 2, 1983, Florence, Italy, Proceedings.",
                "count": 44,
                "papers": [
                    "A Multimedia Office Filing System.",
                    "Benchmarking Database Systems A Systematic Approach.",
                    "Application of Novel Technologies to the Management of a Very Large Date Base.",
                    "A Surrogate Concept for Engineering Databases.",
                    "Active Databases as a Paradigm for Enhanced Computing Environments.",
                    "Building Usable Menu-Based Natural Language Interfaces To Databases.",
                    "The Multipurpose Presentation System.",
                    "How Does an Expert System Get its Data? (Extended Abstract).",
                    "Obtaining Progressive Protocols for a Simple Multiversion Database Model.",
                    "Solving the Phantom Problem by Predicative Optimistic Concurrency Control.",
                    "Disjoint-Interval Topological Sort: A Useful Concept in Serializability Theory (Extended Abstract).",
                    "A Non-Two-Phase Locking Protocol for Concurrency Control in General Databases.",
                    "Empirical Comparison of Database Concurrency Schemes.",
                    "Basic Timestamp, Multiple Version Timestamp, and Two-Phase Locking.",
                    "A Quantitative Comparison of Lockprotocols for Centralized Databases.",
                    "A Dynamic Hash File for Random and Sequential Accessing.",
                    "The Reconstruction and Optimization of Trie Hashing Functions.",
                    "An Implementation of Hypothetical Relations.",
                    "AIM - An Integrity Monitor for the Database System INGRES.",
                    "Universal Relation Views: A Pragmatic Approach.",
                    "Database Decomposition into Fourth Normal Form.",
                    "Operations and the Properties on Non-First-Normal-Form Relational Databases.",
                    "LAURA: A Formal Data Model and her Logical Design Methodology.",
                    "A Pragmatic Approach to Structured Database Design.",
                    "A Modularization Mechanism for Conceptual Modeling.",
                    "Database Partitioning in a Cluster of Processors.",
                    "File Allocation in Distributed Databases with Interaction between Files.",
                    "An Analytic Approach to Statistical Databases.",
                    "File Redundancy Issues in Distributed Database Systems.",
                    "A Model for Integrated Information Systems.",
                    "A Data Modeling Approach to Simplify the Design of User Interfaces.",
                    "The Integrated Data Model: A Database Perspective.",
                    "Query-By-Example: Operations on Piecewise Continuous Data (Extended Abstract).",
                    "A Target Logical Schema: The ACS.",
                    "Characterization of Well-Behaved Database Schemata and Their Update Semantics.",
                    "An Abstract Introduction to the Temporal-Hierarchic Data Model (THM).",
                    "A Modal System of Algebras for Database Specification and Query/Update Language Support.",
                    "Processing Queries Over Generalization Hierarchies in a Multidatabase System.",
                    "Supporting a Semantic Data Model in a Distributed Database System.",
                    "An Approach to Object Sharing in Distributed Datbase Systems.",
                    "View Management in Distributed Data Base Systems.",
                    "High-Level Navigational Facilities for Network and Relational Databases.",
                    "Program Analysis for Conversion from a Navigation to a Specification Database Interface.",
                    "Modelling Information Preserving Databases: Consequences of the Concept of Time."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "8th VLDB 1982",
        "info": "Mexico City, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/82",
                "sub_name": "Eigth International Conference on Very Large Data Bases, September 8-10, 1982, Mexico City, Mexico, Proceedings.",
                "count": 37,
                "papers": [
                    "TIMBER: A Sophisticated Relation Browser (Invited Paper).",
                    "An Interactive Query Language for External Data Bases.",
                    "GUIDE: Graphical User Interface for Database Exploration.",
                    "System D: A Distributed System for Availability.",
                    "Heterogeneity in the Distributed Database Management System SIRIUS-DELTA.",
                    "A Heuristic Approach to Distributed Query Processing.",
                    "A Sophisticate's Introduction to Distributed Concurrency Control (Invited Paper).",
                    "A Formal Model for Maximum Concurrency in Transaction Systems with Predeclared Writesets.",
                    "An Efficient Deadlock Removal Scheme for Non-Two-Phase Locking Protocols.",
                    "Physical Design of Network Model Databases Using the Property of Separability.",
                    "IDBD - An Interactive Design Tool for CODASYL-DBTG-Type Data bases.",
                    "Storage and Access Structures to Support a Semantic Data Model.",
                    "Reflections on Boyce-Codd Normal Form.",
                    "A Methodology for View Inegration in Logical Database Design.",
                    "Choices in Practical Data Design.",
                    "Consistency and Transactions in CAD Database.",
                    "Randomizing, A Practical Method for Protecting Statistical Databases Against Compromise.",
                    "Data Structures for an Integrated Data Base Management and Information Retrieval System.",
                    "Statistical Databases: Characteristics, Problems, and some Solutions.",
                    "Microprocessor Assisted Tuple Access, Decompression and Assembly for Statistical Database Systems.",
                    "Metadata Management for Large Statistical Databases.",
                    "Databases for Computer Aided Design and Manufacturing.",
                    "An Implementation of Impure Surrogates.",
                    "A Mechanism for Managing the Buffer Pool in a Relational Database System Using the Hot Set Model.",
                    "On Line Processing of Compacted Relations.",
                    "Database Applications in Developing Countries.",
                    "Specification-Based Computing Environments.",
                    "A Temporal Framework for Database Specifications.",
                    "Semantic Integrity Dependencies and Delayed Integrity Checking.",
                    "A Single-File Version of Linear Hashing with Partial Expansions.",
                    "Parallel Algorithms and Their Implementation in MICRONET.",
                    "The Size of Projections of Relations Satisfying a Functional Dependency.",
                    "Formalization of Database Systems - and a Formal Definition of IMS (Invited Paper).",
                    "A Denotational Definition of the Semantics of DRC, A Domain Relational Calculus.",
                    "Semantics of Network Data Manipulation Languages: An Object-Oriented Approach.",
                    "On the Algebraic Specification of Databases.",
                    "The Database/Data Dictionary Interface."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "7th VLDB 1981",
        "info": "Cannes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/81",
                "sub_name": "Very Large Data Bases, 7th International Conference, September 9-11, 1981, Cannes, France, Proceedings.",
                "count": 55,
                "papers": [
                    "Referential Integrity.",
                    "Data Model Theory Meets a Practical Application.",
                    "Modelling Events a Data Base Application Design.",
                    "On Modelling Behavioural Semantics of Databases.",
                    "Design and Analysis of a Relational Join Operation for VLSI.",
                    "A Commercial Back-End Data Base System.",
                    "Hardware Organization for Nonnumeric Processing.",
                    "Concepts of Sorting and Projection in a Cellular Array.",
                    "Algorithms for Acyclic Database Schemes.",
                    "Join Graphs and Acyclic Database Schemes.",
                    "Constraints on Null Values in Relational Databases.",
                    "A Theory of Correct Locking Protocols for Database Systems.",
                    "Optimistic Methods for Concurrency Control in Distributed Database Systems.",
                    "Logical Integration of Locally Independent Relational Databases into a Distributed Database.",
                    "The Transaction Concept: Virtues and Limitations (Invited Paper).",
                    "Transaction Monitoring in ENCOMPASS: Reliable Distributed Transaction Processing.",
                    "A Resource Class Independent Deadlock Detection Algorithm.",
                    "User Interfaces for Pictorial Data Bases.",
                    "Data Base System Performance Prediction Using an Analytical Model (Invited Paper).",
                    "A Performance Evaluation of Data Base Machine Architectures (Invited Paper).",
                    "Theoretical and Practical Tools for Data Base Design.",
                    "A Method for Defining Information Structures and Transactions in Conceptual Schema Design.",
                    "Information Systems Design Approach Integrating Data and Transactions.",
                    "Impacts of Logic and Databases (Invited Paper).",
                    "Data Models and Data Manipulation Languages: Complementary Semantics and Proof Theory.",
                    "Efficient Processing of Interactive Relational Data Base Queries expressed in Logic.",
                    "Data Base Machines: System Evaluation and Conversion Issues.",
                    "Deferring Updates in a Relational Data Base System.",
                    "Derived Relations: A Unified Mechanism for Views, Snapshots, and Distributed Data.",
                    "A Transformational Framework for the Automatic Control of Derived Data.",
                    "Separability - An Approach to Physical Data Base Design.",
                    "Digital B-Trees.",
                    "Reduced Cover-Trees and their Application in the Sabre Access Path Model.",
                    "Integrating Data Base and Message Systems (Invited Paper).",
                    "IML-Inscribed Nets for Modeling Text Processing and Data (Base) Management Systems.",
                    "The Active Information System: A Data-Driven System for the Analysis of Imprecise Data.",
                    "Distributed Data Processing Versus Distributed Data Base Processing.",
                    "On Representing Incomplete Information in a Relational Data Base.",
                    "Independent Components of Databases.",
                    "Systematic Derivation of Complementary Specifications.",
                    "A Compression Technique for Large Statistical Data-Bases.",
                    "Application of Data Compression to a Large Bibliographic Data Base.",
                    "Application of DBMS to Land Information Systems.",
                    "A History of System R and SQL/Data System (Invited Paper).",
                    "DSIS - A Database System with Interrelational Semantics.",
                    "The Implementation of GERM, An Entity-Relationship Data Base Management System.",
                    "Data Bases for Software Development.",
                    "Scheduling of Page-Fetches in Join Operations.",
                    "Concurrent Data Base Reorganization - Assessment of a Powerful Technique through Modeling.",
                    "QUIST: A System for Semantic Query Optimization in Relational Databases.",
                    "The Optimization Strategy for Query Evaluation in RDB/V1.",
                    "A Database Approach to Modelling and Managing Security Information.",
                    "Synergistic Authorization in Database Systems.",
                    "SUBJECT: A Directory Driven System for Organizing and Accessing Large Statistical Databases.",
                    "Data Dictionaries: An Assessment of Current Practice and Problems."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "6th VLDB 1980",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/80",
                "sub_name": "Sixth International Conference on Very Large Data Bases, October 1-3, 1980, Montreal, Quebec, Canada, Proceedings.",
                "count": 49,
                "papers": [
                    "Some Large Questions about Very Large Data Bases.",
                    "Splitting the Conceptual Schema.",
                    "An Introduction to the Unified Database Language (UDL).",
                    "Path Expressions for Complex Queries and Automatic Database Program Conversion.",
                    "On Retrieval from a Small Version of a Large Data Base.",
                    "Estimation of the Number of Tuples Satisfying a Query Expressed in Predicate Calculus Language.",
                    "Processing Conjunctive Predicates and Queries.",
                    "SIRIUS: A French Nationwide Project on Distributed Data Bases.",
                    "Database Snapshots.",
                    "Analysis of Distributed Data Base Processing Strategies.",
                    "Data Abstraction, Databases and Conceptual Modelling.",
                    "A Conceptual Model for Semantic Integrity Checking.",
                    "Fast Maintenance of Semantic Integrity Assertions Using Redundant Aggregate Data.",
                    "Knowledge-Based Query Processing.",
                    "A Pragmatic Approach to Database Design.",
                    "The Development and Application of Data Base Design Tools and Methodology.",
                    "Managing Systems That Manage Data.",
                    "Quintillabit: Parameters of a Hyperlarge Database.",
                    "OFS: An Integrated Form Management System.",
                    "A Dialogue Interface for Data Base Applications.",
                    "Semantics vs. Graphics - To Show or not to Show.",
                    "Distributed Database Systems.",
                    "Efficient Access of Compressed Data.",
                    "Linear Hashing: A New Tool for File and Table Addressing.",
                    "Linear Hashing with Partial Expansions.",
                    "Data Planning.",
                    "Extension Joins.",
                    "What does Boyce-Codd Normal Form Do?",
                    "Functional Dependencies and Incomplete Information.",
                    "Distributed Concurrency Control in Database Systems.",
                    "Timestamp-Based Algorithms for Concurrency Control in Distributed Database Systems.",
                    "Update Synchronization in Distributed Databases.",
                    "Non-Two-Phase Locking Protocols with Shared and Exclusive Locks.",
                    "Status Report on ISO/TC97/SC5/WG3 - Data Base Management Systems.",
                    "Standardization and the Relational Approach to Databases: An ANSI Task Group Status Report.",
                    "EEV Evaluation and Implementation of Database Systems.",
                    "Telidon and the Human Factors of Videotex Data Bases.",
                    "DB1 - A DBMS-Based Application Generator.",
                    "Production Program Generation in a Flexible Data Dictionary System.",
                    "An Intuitive Approach to Normalize Network Structured Data.",
                    "Database Theory and its Relationship to Practice.",
                    "On the Design of a Reliable Storage Component for Distributed Database Management Systems.",
                    "The Analysis of the Effects of Concurrency Control on Distributed Database System Performance.",
                    "Strategies for Handling Transactions in Distributed Data Base Systems During Recovery.",
                    "Database Machines.",
                    "Some Features of the TAXIS Data Model.",
                    "Translation Structures of Relational Views.",
                    "Some Analytic Tools for the Design of Relational Database Systems.",
                    "DBMS Standards: Current Status and Future Directions."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "5th VLDB 1979",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/79",
                "sub_name": "Fifth International Conference on Very Large Data Bases, October 3-5, 1979, Rio de Janeiro, Brazil, Proceedings.",
                "count": 48,
                "papers": [
                    "Locking and Recovery in a Shared Database System: An Application Programming Tutorial.",
                    "Spatial Management of Data (Abstract).",
                    "Towards more Informative User Interfaces.",
                    "Logical Design of Deductive Natural Language Consultable Data Bases.",
                    "A System for Interactive Error Detection.",
                    "Towards a Universal Relation Interface.",
                    "Multivalued Dependencies with Null Values in Relational Data Bases.",
                    "Algorithmic Applications for a new Result on Multivalued Dependencies.",
                    "Generalized Mutual Dependencies and the Decomposition of Database Relations.",
                    "The Quest for Comprehensive Semantic Formalisms.",
                    "Functional Specification of a Decision Support System.",
                    "Implementation of the IRRD Data Base in Portugal.",
                    "A Description Language and Pilot-System Executive for Information-Transport Systems.",
                    "Software Requirement Definition and Data Models.",
                    "An External Schema Facility for CODASYL 1978.",
                    "On the Role of 'Understanding Models' in Conceptual Schema Design.",
                    "Statistice for the Usage of a Conceptual Data Model as a Basis for Logical Data Base Design.",
                    "An Optimized Backout Mechanism for Sequential Updates.",
                    "On Search Performance for Conjunctive Queries in Compressed, Fully Transposed Ordered Files.",
                    "Minimizing the I/O-Operations for Undo-Logging in Database Systems.",
                    "Some Very Large Data Bases in Developing Countries.",
                    "The ADAPT System: A Generalized Approach Towards Data Conversion.",
                    "The Functional Dependency Model for Logical Database Design.",
                    "Monitoring Integrity Constraints in a CODASYL-Like DBMS.",
                    "A Designer for DBMS-Processable Logical Database Structures.",
                    "The Entity Join.",
                    "Fundamental and Secondary Issues in the Design of Non-Procedural Relational Languages.",
                    "Tools for Information System Dynamics Management.",
                    "Interactive Specification and Formal Verification of User's Views in Data Bases Design.",
                    "Database Concurrent Processor.",
                    "Data Base Management Systems Security and INGRES.",
                    "Proving Consistency of Database Transactions.",
                    "Database Program Conversion: A Framework for Research.",
                    "A Methodologic Guide-Line for the Instalation of Data Base Development Tools and Data Administration Tools: Two Case Studies from Brazil.",
                    "A DBMS for Large Statistical Databases.",
                    "1978 New Orleans Data Base Design Workshop Report.",
                    "Transaction and Catalog Management of the Distributed File Management System DISCO.",
                    "On Optimistic Methods for Concurrency Control.",
                    "Decentralized Authorization in a Database System.",
                    "Two-Phase Deadlock Detection Algorithm in Distributed Databases.",
                    "The Problem of Multiple Paths in a Database Schema.",
                    "Ambiguity in Processing Boolean Queries on TDMS Tree Structures: A Study of Four Different Philosophies.",
                    "Parallel Processing of Relations: A Single-Assignment Approach.",
                    "Query Processing in a Relational Database Management System.",
                    "Distribution Models of Relations.",
                    "Application of Sub-Predicate Tests in Database Systems.",
                    "Program Development by Transformations Applied to Relational Database Queries.",
                    "Semantic Checking of Questions Expressed in Predicate Calculus Language."
                ]
            }
        ]
    },
    {
        "year": "1978",
        "name": "4th VLDB 1978",
        "info": "West Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/78",
                "sub_name": "Fourth International Conference on Very Large Data Bases, September 13-15, 1978, West Berlin, Germany.",
                "count": 67,
                "papers": [
                    "Data Base Design Tools.",
                    "Data Base Design in Theory and Practice.",
                    "Comments on the paper \"Data Base Design in Theory and Practice\" by Bo Sundgren.",
                    "Comments on the Paper \"Data Base Design in Theory and Practice\".",
                    "Data Base and Software Engineering - A Design Viewpoint.",
                    "A Software Engineering View of Data Base Management.",
                    "A Software Engineering View of Data Base Systems.",
                    "Security and Privacy.",
                    "Privacy and Security of Data Communications and Data Bases.",
                    "An Opening Statement for the Session in Impact of New Technologies.",
                    "Impact of New Technologies.",
                    "Computer Technology and the Database User.",
                    "Distributed Database Management.",
                    "Issues in Distributed Data Base Management Systems: A Technical Overview.",
                    "Data Base Theory and Modeling - Theoretical and Practical Aspects.",
                    "A Sophisticate's Introduction to Database Normalization Theory.",
                    "What End-User Facilities do we Need?",
                    "Implementing a Three Schema DBMS Framework.",
                    "The External Schema and CODASYL.",
                    "Conceptual and Internal Schemas in CODASYL.",
                    "On Relating the CODASYL Database Languages and the ANSI/SPARC Framework.",
                    "Conversion and the CODASYL Framework.",
                    "Efficient Organization of Internal DBMS Structure.",
                    "What is a \"Good\" Semantic or Meta Model?",
                    "What is the Use of Abstract Data Types?",
                    "Natural Language Data Bases.",
                    "Data Base Research Projects and Funding.",
                    "Record Subtype Facilities in Database Systems.",
                    "A Normal Form for Abstract Syntax.",
                    "Operations Data Bases.",
                    "Data Base Description with a Single Name Category Data Model.",
                    "The Data Dictionary Facilities of NDB.",
                    "A Micro-DBMS for a Distributed Data Base.",
                    "On Bubble Memories and Relational Data Base.",
                    "A Review of the 1978 CODASYL Database Specifications.",
                    "An Alternative Structure for Data Base Management Systems.",
                    "FORAL LP: Design and Implementation.",
                    "Current Research Into Specialized Processors For Text Information Retrieval.",
                    "A Search Processor for Data Base Management Systems.",
                    "MICRONET: A Microcomputer Network System for Managing Distributed Relational Databases.",
                    "Microprocessor Based Modular Database Processors.",
                    "The Rebound Sorter: An Efficient Sort Engine for Large Files.",
                    "Performance Study of a Database Machine in Supporting Relational Databases.",
                    "A DBMS Architecture to Support Information Analysis (Abstract).",
                    "A Model and a Method for Logical Data Base Design.",
                    "Concepts for Design of an Information System Conceptual Schema and its Utilization in the REMORA Project.",
                    "The Information Preserving Properties of Relational Database Transformations.",
                    "Mutual Dependencies and Some Results on Undecomposable Relations.",
                    "On the Updatability of Relational Views.",
                    "EUFID: The End User Friendly Interface to Data Management Systems.",
                    "Conversational Aspects of Database Interactions.",
                    "The Simplification of Retrieval Requests Generated by Question-Answering Systems.",
                    "Programming Languages and Databases.",
                    "Information Protection by Method Base Systems.",
                    "Algebraic Specification Schemes for Data Base Systems.",
                    "Application Specification for Distributed Data Base Systems.",
                    "A Distributed Data Base System Using Logical Relational Machines.",
                    "The ADD System: An Architecture for Distributed Databases.",
                    "A Survey of Physical Database Design Methodology and Techniques.",
                    "On Searching Transposed Files (Abstract).",
                    "An Analysis of Storage Utilization Factor in Block Split Data Structuring Scheme.",
                    "A Concurrent Database Manipulation Problem: Binary Search Trees (Abstract).",
                    "Application of Sparse Matrix Techniques to Search, Retrieval, Classification and Relationship Analysis in Large Data Base Systems - SPARCOM.",
                    "Virtual Hashing: A Dynamically Changing Hashing.",
                    "Data Model Equivalence.",
                    "Equivalence among Relational Expressions with the Union and Difference Operation.",
                    "Data Models Transformation Method Based on Axiomatic Data Model Extension."
                ]
            },
            {
                "sub_name_abbr": "conf/vldb/78s",
                "sub_name": "Issues in Data Base Management, Proceedings of the 4th VLDB (Material from the Survey Sessions), September 13-15, 1978, West Berlin, Germany.",
                "count": 32,
                "papers": [
                    "Data Base Design in Theory and Practice - Towards an Integrated Methodology.",
                    "Data Base Design Tools.",
                    "Comments on the paper \"Data Base Design in Theory and Practice\" by \"Bo Sundgren\".",
                    "Comments on Dr. Sundgren's paper \"Data Base Design in Theory and Practice - Towards an Integrated Methodology\".",
                    "Comments on the paper \"Data Base Design in Theory and Practice\" by Bo Sundgren.",
                    "Comments on the Paper \"Data Base Design in Theory and Practice\".",
                    "A Software Engineering View of Data Base Management.",
                    "Modularity in Data Base System Design: A Software Engineering View of Data Base Systems.",
                    "Database Modularity.",
                    "Comments on the Papers \"A Software Engineering View of Data Base Management\" by I. A. Wasserman and \"A Software Engineering View of Data Base Systems\" by H. Weber.",
                    "Data Base Design in Software Systems for Process Monitoring and Control.",
                    "Software and Data Base Engineering - Towards a Common Design Methodology.",
                    "Issues in Distributed Data Base Management Systems: A Technical Overview.",
                    "A Note on Theoretical Problems in Distributed Database Management.",
                    "Issues in Distributed Database Systems.",
                    "Important Issues in Distributed Data Base Management Systems.",
                    "Issues in Distributed Database Management Systems: A Technical Overview.",
                    "Some Remarks on a Paper of Adiba, M. et al. on \"Issues in Distributed Data Base Management Systems: A Technical Overview\".",
                    "Computer Technology and the Database User.",
                    "Statement for the Session on Impact of New Technologies.",
                    "Statement for the Session on Impact of New Technologies.",
                    "Statement for the Session on Impact of New Technologies.",
                    "Statement for the Session on Impact of New Technologies.",
                    "Some Less Enthusiastic Remarks on the Impact of New Technologies.",
                    "Impact of New Technologies.",
                    "The Impact of New Technologies on the Architecture of Secondary Storage and Large Data Bases.",
                    "Statement for the Session on Impact of New Technologies.",
                    "Privacy and Security of Data Communications and Data Bases.",
                    "Privacy, Security and Databases: Any Solutions?",
                    "Database Security.",
                    "Authorization and Database Security.",
                    "Six Principles for Improving Security in the Use of Medical Data Bases."
                ]
            }
        ]
    },
    {
        "year": "1977",
        "name": "3rd VLDB 1977",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/77",
                "sub_name": "Proceedings of the Third International Conference on Very Large Data Bases, October 6-8, 1977, Tokyo, Japan.",
                "count": 62,
                "papers": [
                    "Information Processing Systems in a Database Environment.",
                    "Design and Performance Tools for Data Base Systems.",
                    "Toward a Design Methodology for DBMS: A Software Engineering Approach.",
                    "Extended Set Theory.",
                    "A Survey of Research and Development in Distributed Database Management.",
                    "Database Machine Architecture in the Context of Information Technology Evolution.",
                    "A Survey: The Application of Data Base Management Computers in Distributed Systems.",
                    "Design Criteria for Distributed Database Systems.",
                    "Models of Distributed Systems.",
                    "Architectural Issues in Distributed Data Base Systems.",
                    "Observations on Data Manipulation Languages and Their Embedding in General Purpose Programming Languages.",
                    "Standardization and Database Systems.",
                    "Using New Clues to Find Data.",
                    "Some Comments on Human Archival Memory as a Very Large Data Base.",
                    "Psychological Issues in Data Base Management.",
                    "Panel: User's View of Very Large Database Applications.",
                    "Panel: Directions in Database Research.",
                    "An Architectural Extension for a Large Database System Incorporating a Processor for Disk Search.",
                    "Data File Management in Shift Register Memories.",
                    "Associative Programming in CASSM and its Applications.",
                    "Design of a Balanced Multiple Valued File Organization Schema with the Least Redundancy.",
                    "Evaluation of Combinatorial File Orgenization Schemes.",
                    "A Scan-Driven Sort Facility for a Relational Database System.",
                    "A Conceptual Design of a Generalized Database Subsystem.",
                    "A Direct Access Terabit Archival Memory.",
                    "Tertiary Memory Access and Performance in the Datacomputer.",
                    "Total Hospital Information System of Komagome Metropolitan Hospital.",
                    "Encoding, Decoding and Storing Melodies for a Data Base of Renaissance Polyphony: A Progress Report.",
                    "Architecture of the SOFIS Data Base Management System.",
                    "Developing a Natural Language Interface to Complex Data.",
                    "IDA: An Intelligent Data Access Program.",
                    "User-Oriented Data Base Query with the ROBOT Natural Language Query System.",
                    "Coexistence and Transformation of Data.",
                    "A Processing Interface for Multiple External Schema Access to a Data Base Management System.",
                    "Schema Analysis for Database Restructuring.",
                    "A Unified Approach to Program and Data Conversion.",
                    "A Relational Data Language with Simplified Binary Relation Handling Capability.",
                    "Structure and Implementation of a Relational Query Language for the Problem Solver.",
                    "A Generalized End-User Facility Architecture for Relational Database Systems.",
                    "Domain-Oriented Relational Languages.",
                    "POREL: A Distributed Data Base on an Inhomogeneous Computer Network.",
                    "Data Base Support and Interactive Graphics.",
                    "Multi-Level Structures of the DBTG Data Model for an Achievement of Physical Data Independence.",
                    "Self-Descriptive Relational Data Base.",
                    "Data Base Design by Applied Data Synthesis.",
                    "The Decomposition Versus Synthetic Approach to Relational Database Design.",
                    "A Consideration on Normal Form of Not-Necessarily-Normalized Relation in the Relational Data Model.",
                    "Decomposition and Composition of a Relational Database.",
                    "The Role Concept in Data Models.",
                    "Multiple View Support within the ANSI/SPARC Framework.",
                    "Implementation of a Fuzzy-Set Theoretic Data Structure System (Abstract).",
                    "On Semantic Issues Connected with Incomplete Information Data Bases (Abstract).",
                    "Protection of Information in Relational Data Bases.",
                    "Scheduling Algorithms for Avoiding Inconsistency in Large Databases.",
                    "A Kernel Design for a Secure Data Base Management System.",
                    "Auditing Large Scale Data Bases.",
                    "A Simulation Model for Performance Analysis of Large Shared Data Bases.",
                    "CS4: A Tool for Database Design by Infological Simulation (Abstract).",
                    "A Data Base Design Decision Support System.",
                    "Evaluation and Optimization.",
                    "Validation and Verification Aspects of Information Modeling.",
                    "A Note on the Survey: \"Future of Database Technology\"."
                ]
            }
        ]
    },
    {
        "year": "1976",
        "name": "2nd VLDB 1976",
        "info": "Brussels, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/76",
                "sub_name": "Systems for Large Data Bases, September 8-10, 1976, Brussels, Belgium.",
                "count": 15,
                "papers": [
                    "New Criteria for the Conceptual Model.",
                    "Structure and Redundancy in the Conceptual Schema in the Administration of Very Large Data Bases.",
                    "A Semantic Model for Data Base Protection Languages.",
                    "A Taxonomy of Data Models.",
                    "Choosing an Efficient Internal Schema.",
                    "DIAM II and Levels of Abstraction - The Physical Device Level: A General Model for Access Methods.",
                    "Relational Transformation and a Redundancy in Relational Data Base.",
                    "High Performance Hardware for Database Systems.",
                    "An Approach to Data Communication between Different Generalized Data Base Management Systems.",
                    "Application Program Conversion due to Data Base Changes.",
                    "A Data Manipulation Language for Relational Data Structures.",
                    "User Extensions to the Peterlee Relational Test Vehicle.",
                    "A Deductive Capability for Data Management.",
                    "An Enduser Guidance Component for an Intelligent Data Base System.",
                    "MERLIN - Design of a National Bibliographic Database."
                ]
            }
        ]
    },
    {
        "year": "1975",
        "name": "1st VLDB 1975",
        "info": "Framingham, Massachusetts",
        "venues": [
            {
                "sub_name_abbr": "conf/vldb/75",
                "sub_name": "Proceedings of the International Conference on Very Large Data Bases, September 22-24, 1975, Framingham, Massachusetts, USA.",
                "count": 52,
                "papers": [
                    "Query-by-Example: the Invocation and Definition of Tables and Forms.",
                    "Semantic Integrity in a Relational Data Base System.",
                    "Functional Specifications of Subsystem for Database Integrity.",
                    "The Use of Cluster Analysis in Physical Data Base Design.",
                    "Data Models for Secondary Storage Representations.",
                    "Stanford's Generalized Database System.",
                    "Using Semantic Networks for Database Management.",
                    "Specification of Stored Data Structures and Desired Output Results in DIAM II with FORAL.",
                    "The Entity-Relationship Model: Toward a Unified View of Data.",
                    "Restructuring for Large Data Bases: Three Levels of Abstraction.",
                    "On the Feasibility of Implementing a Large Relational Data Base with Optimal Performance on a Mini-Computer.",
                    "A Multi-Level Architecture for Relational Data Base Systems.",
                    "Automating Logical File Design.",
                    "A Data Base Management Facility for Automatic Generation of Data Base Managers.",
                    "Selection of File Organization Using an Analytic Model.",
                    "Definition and Evaluation of Access Rules in Data Management Systems.",
                    "Automatic Data Base Schema Design and Optimization.",
                    "Hierarchical Performance Analysis Models for Data Base Systems.",
                    "Optimal Choice of Data Restructuring Points.",
                    "Needed: Distributed Control.",
                    "Database Experience in the Netherlands PTT (ITCIS).",
                    "A Computer Architecture for Large (Distributed) Data Bases.",
                    "Optimal Allocation of Resources in Distributed Information Networks.",
                    "Granularity of Locks in a Large Shared Data Base.",
                    "On the Encipherment of Search Trees and Random Access Files.",
                    "The Design of a Rotating Associative Array Memory for a Relational Database Management Application.",
                    "Keyword Access to a Mass Storage Device at the Record Level.",
                    "CASSM: A Cellular System for Very Large Data Bases.",
                    "Estimating Response Time for Auxiliary Memory Configuartions with Multiple Movable-Head Disk Modules.",
                    "A DBMS for the U.S. Bureo of the Census.",
                    "Implementation Strategies for the Census Data Base.",
                    "Using Large Data Bases for Interactive Problem Solving.",
                    "Analyzing Transaction Activity to a Large Data Base: An Empirical Study.",
                    "Multiple Concurrent Updates.",
                    "An Optimizable Model for Application of Rollback/Restart/Recovery Procedures for Large Data Bases.",
                    "An Experiment in Dedicated Data Management.",
                    "Analysis of VSAM's Free-Space Behavior.",
                    "Reorganization Points for File Designs with Nonlinear Processing Costs.",
                    "Query Execution and Index Selection for Relational Data Bases.",
                    "Hardware and System Architecture for a Very Large Database.",
                    "Partial-Match Queries and File Designs.",
                    "Recent Results on the Attribute Based Data Model - A Tutorial.",
                    "Datalanguage: The Access Language on the Datacomputer.",
                    "On the Implementation of a Logical Data Base Converter.",
                    "Features of a Conceptual Schema.",
                    "Different Views of a Data Base: Coexistence between Network Model and Relational Model.",
                    "Multi-Level Data Model in DPLS - Database, Dynamic Program Control & Open-Ended Pol Support.",
                    "Binary Search Tree Complex - Towards the Implementation of Relations.",
                    "File Directory Design Considerations for Distributed Data Bases.",
                    "Design Principles of a Data Base System for Unlimited Quantities of Data with Highly Complex Structures.",
                    "An Experimental VM/370 Based Information System.",
                    "PRTV: An Efficient Implementation for Large Relational Data Bases."
                ]
            }
        ]
    }
]