[
    {
        "year": "2021",
        "name": "5th WAIM/APWeb 2021",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2021-1",
                "sub_name": "Web and Big Data - 5th International Joint Conference, APWeb-WAIM 2021, Guangzhou, China, August 23-25, 2021, Proceedings, Part I.",
                "count": 38,
                "papers": [
                    "Co-authorship Prediction Based on Temporal Graph Attention.",
                    "Degree-Specific Topology Learning for Graph Convolutional Network.",
                    "Simplifying Graph Convolutional Networks as Matrix Factorization.",
                    "GRASP: Graph Alignment Through Spectral Signatures.",
                    "FANE: A Fusion-Based Attributed Network Embedding Framework.",
                    "What Have We Learned from OpenReview?",
                    "Unsafe Driving Behavior Prediction for Electric Vehicles.",
                    "Resource Trading with Hierarchical Game for Computing-Power Network Market.",
                    "Analyze and Evaluate Database-Backed Web Applications with WTool.",
                    "Semi-supervised Variational Multi-view Anomaly Detection.",
                    "A Graph Attention Network Model for GMV Forecast on Online Shopping Festival.",
                    "Suicide Ideation Detection on Social Media During COVID-19 via Adversarial and Multi-task Learning.",
                    "An Efficient Bucket Logging for Persistent Memory.",
                    "Data Poisoning Attacks on Crowdsourcing Learning.",
                    "Dynamic Environment Simulation for Database Performance Evaluation.",
                    "LinKV: An RDMA-Enabled KVS for High Performance and Strict Consistency Under Skew.",
                    "Cheetah: An Adaptive User-Space Cache for Non-volatile Main Memory File Systems.",
                    "Chinese Word Embedding Learning with Limited Data.",
                    "Sparse Biterm Topic Model for Short Texts.",
                    "EMBERT: A Pre-trained Language Model for Chinese Medical Text Mining.",
                    "Self-supervised Learning for Semantic Sentence Matching with Dense Transformer Inference Network.",
                    "An Explainable Evaluation of Unsupervised Transfer Learning for Parallel Sentences Mining.",
                    "Leveraging Syntactic Dependency and Lexical Similarity for Neural Relation Extraction.",
                    "A Novel Capsule Aggregation Framework for Natural Language Inference.",
                    "Learning Modality-Invariant Features by Cross-Modality Adversarial Network for Visual Question Answering.",
                    "Difficulty-Controllable Visual Question Generation.",
                    "Incorporating Typological Features into Language Selection for Multilingual Neural Machine Translation.",
                    "Removing Input Confounder for Translation Quality Estimation via a Causal Motivated Method.",
                    "Learning Refined Features for Open-World Text Classification.",
                    "Emotion Classification of Text Based on BERT and Broad Learning System.",
                    "Improving Document-Level Sentiment Classification with User-Product Gated Network.",
                    "Integrating RoBERTa Fine-Tuning and User Writing Styles for Authorship Attribution of Short Texts.",
                    "Dependency Graph Convolution and POS Tagging Transferring for Aspect-Based Sentiment Classification.",
                    "DTWSSE: Data Augmentation with a Siamese Encoder for Time Series.",
                    "PT-LSTM: Extending LSTM for Efficient Processing Time Attributes in Time Series Prediction.",
                    "Loss Attenuation for Time Series Prediction Respecting Categories of Values.",
                    "PFL-MoE: Personalized Federated Learning Based on Mixture of Experts.",
                    "A New Density Clustering Method Using Mutual Nearest Neighbor."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2021-2",
                "sub_name": "Web and Big Data - 5th International Joint Conference, APWeb-WAIM 2021, Guangzhou, China, August 23-25, 2021, Proceedings, Part II.",
                "count": 36,
                "papers": [
                    "Unsupervised Deep Hashing via Adaptive Clustering.",
                    "FedMDR: Federated Model Distillation with Robust Aggregation.",
                    "Data Augmentation for Graph Convolutional Network on Semi-supervised Classification.",
                    "Generating Long and Coherent Text with Multi-Level Generative Adversarial Networks.",
                    "A Reasonable Data Pricing Mechanism for Personal Data Transactions with Privacy Concern.",
                    "A Probabilistic Inference Based Approach for Querying Associative Entities in Knowledge Graph.",
                    "BOUNCE: An Efficient Selective Enumeration Approach for Nested Named Entity Recognition.",
                    "PAIRPQ: An Efficient Path Index for Regular Path Queries on Knowledge Graphs.",
                    "A Hybrid Semantic Matching Model for Neural Collective Entity Linking.",
                    "Multi-space Knowledge Enhanced Question Answering over Knowledge Graph.",
                    "A Distribution-Aware Training Scheme for Learned Indexes.",
                    "AIR Cache: A Variable-Size Block Cache Based on Fine-Grained Management Method.",
                    "Learning an Index Advisor with Deep Reinforcement Learning.",
                    "SardineDB: A Distributed Database on the Edge of the Network.",
                    "DLSM: Distance Label Based Subgraph Matching on GPU.",
                    "Distributed Top-k Pattern Mining.",
                    "SQKT: A Student Attention-Based and Question-Aware Model for Knowledge Tracing.",
                    "Comparison Question Generation Based on Potential Compared Attributes Extraction.",
                    "Multimodal Encoders for Food-Oriented Cross-Modal Retrieval.",
                    "Data Cleaning for Indoor Crowdsourced RSSI Sequences.",
                    "A Behavior-Aware Graph Convolution Network Model for Video Recommendation.",
                    "GRHAM: Towards Group Recommendation Using Hierarchical Attention Mechanism.",
                    "Multi-interest Network Based on Double Attention for Click-Through Rate Prediction.",
                    "Self-residual Embedding for Click-Through Rate Prediction.",
                    "GCNNIRec: Graph Convolutional Networks with Neighbor Complex Interactions for Recommendation.",
                    "Velocity-Dependent Nearest Neighbor Query.",
                    "Finding Geo-Social Cohorts in Location-Based Social Networks.",
                    "Modeling Dynamic Spatial Influence for Air Quality Prediction with Atmospheric Prior.",
                    "Learning Cooperative Max-Pressure Control by Leveraging Downstream Intersections Information for Traffic Signal Control.",
                    "Privacy-Preserving Healthcare Analytics of Trajectory Data.",
                    "PARROT: An Adaptive Online Shopping Guidance System.",
                    "gStore-C: A Transactional RDF Store with Light-Weight Optimistic Lock.",
                    "Deep-gAnswer: A Knowledge Based Question Answering System.",
                    "ALMSS: Automatic Learned Index Model Selection System.",
                    "GPKRS: A GPU-Enhanced Product Knowledge Retrieval System.",
                    "Standard-Oriented Standard Knowledge Graph Construction and Applications System."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "4th WAIM/APWeb 2020",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2020-1",
                "sub_name": "Web and Big Data - 4th International Joint Conference, APWeb-WAIM 2020, Tianjin, China, September 18-20, 2020, Proceedings, Part I.",
                "count": 59,
                "papers": [
                    "Active Classification of Cold-Start Users in Large Sparse Datasets.",
                    "Instance-Aware Evaluation of Sensitive Columns in Tabular Dataset.",
                    "EPUR: An Efficient Parallel Update System over Large-Scale RDF Data.",
                    "Multiple Local Community Detection via High-Quality Seed Identification.",
                    "Partition-Oriented Subgraph Matching on GPU.",
                    "An Index Method for the Shortest Path Query on Vertex Subset for the Large Graphs.",
                    "Efficient Personalized Influential Community Search in Large Networks.",
                    "Leveraging Explicit Unsupervised Information for Robust Graph Convolutional Neural Network Learning.",
                    "Content Sharing Prediction for Device-to-Device (D2D)-based Offline Mobile Social Networks by Network Representation Learning.",
                    "LSimRank: Node Similarity in a Labeled Graph.",
                    "Fruited-Forest: A Reachability Querying Method Based on Spanning Tree Modelling of Reduced DAG.",
                    "Frequent Semantic Trajectory Sequence Pattern Mining in Location-Based Social Networks.",
                    "Aligning Users Across Social Networks via Intra and Inter Attentions.",
                    "NSTI-IC: An Independent Cascade Model Based on Neighbor Structures and Topic-Aware Interest.",
                    "Knowledge Graph Attention Network Enhanced Sequential Recommendation.",
                    "TKGFrame: A Two-Phase Framework for Temporal-Aware Knowledge Graph Completion.",
                    "An Ontology-Aware Unified Storage Scheme for Knowledge Graphs.",
                    "IterG: An Iteratively Learning Graph Convolutional Network with Ontology Semantics.",
                    "Fine-Grained Evaluation of Knowledge Graph Embedding Models in Downstream Tasks.",
                    "Learning to Answer Complex Questions with Evidence Graph.",
                    "Characterizing Robotic and Organic Query in SPARQL Search Sessions.",
                    "Tail Entity Recognition and Linking for Knowledge Graphs.",
                    "Natural Answer Generation via Graph Transformer.",
                    "Diversified Top-k Querying in Knowledge Graphs.",
                    "High Order Semantic Relations-Based Temporal Recommendation Model by Collaborative Knowledge Graph Learning.",
                    "Temporal Knowledge Graph Incremental Construction Model for Recommendation.",
                    "Few-Shot Representation Learning for Cold-Start Users and Items.",
                    "Long Short-Term Memory with Sequence Completion for Cross-Domain Sequential Recommendation.",
                    "IASR: An Item-Level Attentive Social Recommendation Model for Personalized Ranking.",
                    "Spatio-Temporal Self-Attention Network for Next POI Recommendation.",
                    "Joint Cooperative Content Caching and Recommendation in Mobile Edge-Cloud Networks.",
                    "Dual Role Neural Graph Auto-encoder for CQA Recommendation.",
                    "KGWD: Knowledge Graph Based Wide & Deep Framework for Recommendation.",
                    "Seamless Incorporation of Appointment-Based Requests on Taxi-Rider Match Scheduling.",
                    "FHAN: Feature-Level Hierarchical Attention Network for Group Event Recommendation.",
                    "KASR: Knowledge-Aware Sequential Recommendation.",
                    "Graph Attentive Network for Region Recommendation with POI- and ROI-Level Attention.",
                    "Generalized Collaborative Personalized Ranking for Recommendation.",
                    "Dynamic Multi-hop Reasoning.",
                    "Multi-hop Reading Comprehension Incorporating Sentence-Based Reasoning.",
                    "Author Contributed Representation for Scholarly Network.",
                    "Unsupervised Cross-Modal Retrieval by Coupled Dual Generative Adversarial Networks.",
                    "GSimRank: A General Similarity Measure on Heterogeneous Information Network.",
                    "Multi-task Learning for Low-Resource Second Language Acquisition Modeling.",
                    "Multi-view Clustering via Multiple Auto-Encoder.",
                    "A Method for Place Name Recognition in Tang Poetry Based on Feature Templates and Conditional Random Field.",
                    "MLND: A Weight-Adapting Method for Multi-label Classification Based on Neighbor Label Distribution.",
                    "meanNet: A Multi-layer Label Mean Based Semi-supervised Neural Network Approach for Credit Prediction.",
                    "Multi-task Attributed Graphical Lasso.",
                    "Hylo: Hybrid Layer-Based Optimization to Reduce Communication in Distributed Deep Learning.",
                    "Joint Reasoning of Events, Participants and Locations for Plot Relation Recognition.",
                    "FedSmart: An Auto Updating Federated Learning Optimization Mechanism.",
                    "Discriminative Multi-label Model Reuse for Multi-label Learning.",
                    "Global and Local Attention Embedding Network for Few-Shot Fine-Grained Image Classification.",
                    "Bayes Classifier Chain Based on SVM for Traditional Chinese Medical Prescription Generation.",
                    "A Spatial and Sequential Combined Method for Web Service Classification.",
                    "A Pruned DOM-Based Iterative Strategy for Approximate Global Optimization in Crowdsourcing Microtasks.",
                    "D-GHNAS for Joint Intent Classification and Slot Filling.",
                    "Index-Based Scheduling for Parallel State Machine Replication."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2020-2",
                "sub_name": "Web and Big Data - 4th International Joint Conference, APWeb-WAIM 2020, Tianjin, China, September 18-20, 2020, Proceedings, Part II.",
                "count": 46,
                "papers": [
                    "DHBFT: Dynamic Hierarchical Byzantine Fault-Tolerant Consensus Mechanism Based on Credit.",
                    "MaSRChain: A Trusted Manuscript Submission and Review System Based on Blockchain.",
                    "Enabling Efficient Multi-keyword Search Over Fine-Grained Authorized Healthcare Blockchain System.",
                    "Debiasing Learning to Rank Models with Generative Adversarial Networks.",
                    "An Effective Constraint-Based Anomaly Detection Approach on Multivariate Time Series.",
                    "A Method for Decompensation Prediction in Emergency and Harsh Situations.",
                    "Improved Brain Segmentation Using Pixel Separation and Additional Segmentation Features.",
                    "Evaluating Fault Tolerance of Distributed Stream Processing Systems.",
                    "Predicting Human Mobility with Self-attention and Feature Interaction.",
                    "Predicting Adverse Drug-Drug Interactions via Semi-supervised Variational Autoencoders.",
                    "Smarter Smart Contracts: Efficient Consent Management in Health Data Sharing.",
                    "Joint Learning-Based Anomaly Detection on KPI Data.",
                    "Parallel Variable-Length Motif Discovery in Time Series Using Subsequences Correlation.",
                    "Learning Ability Community for Personalized Knowledge Tracing.",
                    "LOCATE: Locally Anomalous Behavior Change Detection in Behavior Information Sequence.",
                    "Hyperthyroidism Progress Prediction with Enhanced LSTM.",
                    "DeepStyle: User Style Embedding for Authorship Attribution of Short Texts.",
                    "Densely-Connected Transformer with Co-attentive Information for Matching Text Sequences.",
                    "WEKE: Learning Word Embeddings for Keyphrase Extraction.",
                    "Contribution of Improved Character Embedding and Latent Posting Styles to Authorship Attribution of Short Texts.",
                    "Utilizing BERT Pretrained Models with Various Fine-Tune Methods for Subjectivity Detection.",
                    "A Framework for Learning Cross-Lingual Word Embedding with Topics.",
                    "Paperant: Key Elements Generation with New Ideas.",
                    "Turn-Level Recurrence Self-attention for Joint Dialogue Action Prediction and Response Generation.",
                    "Mining Affective Needs from Online Opinions for Design Innovation.",
                    "Multi-grained Cross-modal Similarity Query with Interpretability.",
                    "Efficient Semantic Enrichment Process for Spatiotemporal Trajectories in Geospatial Environment.",
                    "On the Vulnerability and Generality of K-Anonymity Location Privacy Under Continuous LBS Requests.",
                    "Fine-Grained Urban Flow Prediction via a Spatio-Temporal Super-Resolution Scheme.",
                    "Detecting Abnormal Congregation Through the Analysis of Massive Spatio-Temporal Data.",
                    "SSMDL: Semi-supervised Multi-task Deep Learning for Transportation Mode Classification and Path Prediction with GPS Trajectories.",
                    "GHSH: Dynamic Hyperspace Hashing on GPU.",
                    "A Unified Framework for Processing Exact and Approximate Top-k Set Similarity Join.",
                    "Quantitative Contention Generation for Performance Evaluation on OLTP Databases.",
                    "Pipelined Query Processing Using Non-volatile Memory SSDs.",
                    "Sorting-Based Interactive Regret Minimization.",
                    "Tool Data Modeling Method Based on an Object Deputy Model.",
                    "Unsupervised Deep Hashing with Structured Similarity Learning.",
                    "A New CPU-FPGA Heterogeneous gStore System.",
                    "Euge: Effective Utilization of GPU Resources for Serving DNN-Based Video Analysis.",
                    "Blockchain PG: Enabling Authenticated Query and Trace Query in Database.",
                    "PHR: A Personalized Hidden Route Recommendation System Based on Hidden Markov Model.",
                    "JoyDigit NexIoT: An Open IoT Data Platform for Senior Living.",
                    "Epidemic Guard: A COVID-19 Detection System for Elderly People.",
                    "Automatic Document Data Storage System Based on Machine Learning.",
                    "A Meta-Search Engine Ranking Based on Webpage Information Quality Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2020w",
                "sub_name": "Web and Big Data. APWeb-WAIM 2020 International Workshops - KGMA 2020, SemiBDMA 2020, DeepLUDA 2020, Tianjin, China, September 18-20, 2020, Revised Selected Papers.",
                "count": 13,
                "papers": [
                    "Neighborhood Query Processing and Surrounding Objects Retrieval in Spatial Databases: Applications and Algorithms.",
                    "Distributed Graph Processing: Techniques and Systems.",
                    "Method for Re-finding Mobile Phone Documents Based on Feature Knowledge Graph.",
                    "Knowledge Graph Embedding with Relation Constraint.",
                    "Knowledge-Driven Multi-dimensional Dialogue Rewriting Model.",
                    "Towards Knowledge Graphs Federations: Issues and Technologies.",
                    "A Learning Interests Oriented Model for Cold Start Recommendation.",
                    "A Composite Chain Structure Blockchain Storage Method Based on Blockchain Technology.",
                    "Curriculum-Oriented Multi-goal Agent for Adaptive Learning.",
                    "Distributed Storage and Query for Domain Knowledge Graphs.",
                    "Label Propagation Algorithm Based on Topological Potential.",
                    "LBNet: A Model for Judicial Reading Comprehension.",
                    "Deep Semantic Hashing for Large-Scale Image Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "3rd WAIM/APWeb 2019",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2019-1",
                "sub_name": "Web and Big Data - Third International Joint Conference, APWeb-WAIM 2019, Chengdu, China, August 1-3, 2019, Proceedings, Part I.",
                "count": 30,
                "papers": [
                    "A Framework for Image Dark Data Assessment.",
                    "Medical Treatment Migration Prediction in Healthcare via Attention-Based Bidirectional GRU.",
                    "WRL: A Combined Model for Short-Term Load Forecasting.",
                    "DeepAM: Deep Semantic Address Representation for Address Matching.",
                    "Drawing CoCo Core-Sets from Incomplete Relational Data.",
                    "Reducing Wrong Labels for Distant Supervision Relation Extraction with Selective Capsule Network.",
                    "Coupled Semi-supervised Clustering: Exploring Attribute Correlations in Heterogeneous Information Networks.",
                    "PrivBUD-Wise: Differentially Private Frequent Itemsets Mining in High-Dimensional Databases.",
                    "A Learning Approach for Topic-Aware Influence Maximization.",
                    "DeepDial: Passage Completion on Dialogs.",
                    "A Survival Certification Model Based on Active Learning over Medical Insurance Data.",
                    "A Novel Approach for Air Quality Inference and Prediction Based on DBU-LSTM.",
                    "Predictive Role Discovery of Research Teams Using Ordinal Factorization Machines.",
                    "Deep Learning for Online Display Advertising User Clicks and Interests Prediction.",
                    "In Pursuit of Social Capital: Upgrading Social Circle Through Edge Rewiring.",
                    "Distributed Landmark Selection for Lower Bound Estimation of Distances in Large Graphs.",
                    "AERIAL: An Efficient Randomized Incentive-Based Influence Maximization Algorithm.",
                    "Cider: Highly Efficient Processing of Densely Overlapped Communities in Big Graphs.",
                    "Time Optimal Profit Maximization in a Social Network.",
                    "Iterative Hypergraph Computation Based on Hyperedge-Connected Graphs.",
                    "How to Reach: Discovering Multi-resolution Paths on Large Scale Networks.",
                    "Analysis and Management to Hash-Based Graph and Rank.",
                    "Two-Encoder Pointer-Generator Network for Summarizing Segments of Long Articles.",
                    "Enhancing Joint Entity and Relation Extraction with Language Modeling and Hierarchical Attention.",
                    "An Unsupervised Learning Approach for NER Based on Online Encyclopedia.",
                    "Pseudo Topic Analysis for Boosting Pseudo Relevance Feedback.",
                    "Leveraging Domain Context for Question Answering over Knowledge Graph.",
                    "Leveraging Lexical Semantic Information for Learning Concept-Based Multiple Embedding Representations for Knowledge Graph Completion.",
                    "Efficient Distributed Knowledge Representation Learning for Large Knowledge Graphs.",
                    "Coherence and Salience-Based Multi-Document Relationship Mining."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2019-2",
                "sub_name": "Web and Big Data - Third International Joint Conference, APWeb-WAIM 2019, Chengdu, China, August 1-3, 2019, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Using Sentiment Representation Learning to Enhance Gender Classification for User Profiling.",
                    "Exploring Nonnegative and Low-Rank Correlation for Noise-Resistant Spectral Clustering.",
                    "FeatureBand: A Feature Selection Method by Combining Early Stopping and Genetic Local Search.",
                    "Supervised Hashing with Recurrent Scaling.",
                    "TRPN: Matrix Factorization Meets Recurrent Neural Network for Temporal Rating Prediction.",
                    "Improved Review Sentiment Analysis with a Syntax-Aware Encoder.",
                    "Who Is the Abnormal User: Anomaly Detection Framework based on the Graph Convolutional Networks.",
                    "I-mRMR: Incremental Max-Relevance, and Min-Redundancy Feature Selection.",
                    "ST-DCN: A Spatial-Temporal Densely Connected Networks for Crowd Flow Prediction.",
                    "Streaming Recommendation Algorithm with User Interest Drift Analysis.",
                    "Unified Group Recommendation Towards Multiple Criteria.",
                    "A Novel Ensemble Approach for Click-Through Rate Prediction Based on Factorization Machines and Gradient Boosting Decision Trees.",
                    "Latent Path Connected Space Model for Recommendation.",
                    "FreshJoin: An Efficient and Adaptive Algorithm for Set Containment Join.",
                    "Apara: Workload-Aware Data Partition and Replication for Parallel Databases.",
                    "Which Category Is Better: Benchmarking the RDBMSs and GDBMSs.",
                    "A Meta-Path-Based Recurrent Model for Next POI Prediction with Spatial and Temporal Contexts.",
                    "Discovering Attractive Segments in the User Generated Video Streams.",
                    "Spatial Temporal Trajectory Similarity Join.",
                    "Data Driven Charging Station Placement.",
                    "An Efficient Top-k Spatial Join Query Processing Algorithm on Big Spatial Data.",
                    "Multi-view Based Spatial-Keyword Query Processing for Real Estate.",
                    "PowerMonitor: Aspect Mining and Sentiment Analysis on Online Reviews.",
                    "Transformer and Multi-scale Convolution for Target-Oriented Sentiment Analysis.",
                    "A New Feature Selection Algorithm Based on Category Difference for Text Categorization.",
                    "Opinion-Aware Knowledge Embedding for Stance Detection.",
                    "History-Driven Entity Categorization.",
                    "MBMN: Multivariate Bernoulli Mixture Network for News Emotion Analysis.",
                    "FMQO: A Federated RDF System Supporting Multi-query Optimization.",
                    "DataServiceHatch: Generating and Composing Continuous Data Services.",
                    "A Mobile Phone Data Visualization Tool for People Flow Analysis.",
                    "NativeHelper: A Bilingual Sentence Search and Recommendation Engine for Academic Writing.",
                    "PKRS: A Product Knowledge Retrieve System.",
                    "DataSESec: Security Monitoring for Data Share and Exchange Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2019w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2019 International Workshops, KGMA and DSEA, Chengdu, China, August 1-3, 2019, Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "Distributed Query Evaluation over Large RDF Graphs.",
                    "Classification-Based Emoji Recommendation for User Social Networks.",
                    "Leveraging Context Information for Joint Entity and Relation Linking.",
                    "Community Detection in Knowledge Graph Network with Matrix Factorization Learning.",
                    "A Survey of Relation Extraction of Knowledge Graphs.",
                    "PEVR: Pose Estimation for Vehicle Re-Identification.",
                    "The Research of Chinese Ethnical Face Recognition Based on Deep Learning.",
                    "Model of Charging Stations Construction and Electric Vehicles Development Prediction.",
                    "Boundary Detector Encoder and Decoder with Soft Attention for Video Captioning."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "2nd WAIM/APWeb 2018",
        "info": "Macau, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2018-1",
                "sub_name": "Web and Big Data - Second International Joint Conference, APWeb-WAIM 2018, Macau, China, July 23-25, 2018, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "Abstractive Summarization with the Aid of Extractive Summarization.",
                    "Rank-Integrated Topic Modeling: A General Framework.",
                    "Multi-label Classification via Label-Topic Pairs.",
                    "Similarity Calculations of Academic Articles Using Topic Events and Domain Knowledge.",
                    "Sentiment Classification via Supplementary Information Modeling.",
                    "Training Set Similarity Based Parameter Selection for Statistical Machine Translation.",
                    "Identifying Scholarly Communities from Unstructured Texts.",
                    "A Hybrid Spectral Method for Network Community Detection.",
                    "Personalized Top-n Influential Community Search over Large Social Networks.",
                    "Matrix Factorization Meets Social Network Embedding for Rating Prediction.",
                    "An Estimation Framework of Node Contribution Based on Diffusion Information.",
                    "Multivariate Time Series Clustering via Multi-relational Community Detection in Networks.",
                    "NSPD: An N-stage Purchase Decision Model for E-commerce Recommendation.",
                    "Social Image Recommendation Based on Path Relevance.",
                    "Representation Learning with Depth and Breadth for Recommendation Using Multi-view Data.",
                    "Attentive and Collaborative Deep Learning for Recommendation.",
                    "Collaborative Probability Metric Learning.",
                    "UIContextListRank: A Listwise Recommendation Model with Social Contextual Information.",
                    "Diversified Keyword Expansion on Multi-labeled Graphs.",
                    "Distributed k-Nearest Neighbor Queries in Metric Spaces.",
                    "Efficient Grammar Generation for Inverted Indexes.",
                    "LIDH: An Efficient Filtering Method for Approximate k Nearest Neighbor Queries Based on Local Intrinsic Dimension.",
                    "Query Performance Prediction and Classification for Information Search Systems.",
                    "Aggregate Query Processing on Incomplete Data.",
                    "Travel Time Forecasting with Combination of Spatial-Temporal and Time Shifting Correlation in CNN-LSTM Neural Network.",
                    "DMDP^2 D M D P 2 : A Dynamic Multi-source Based Default Probability Prediction Framework.",
                    "Brain Disease Diagnosis Using Deep Learning Features from Longitudinal MR Images.",
                    "Attention-Based Recurrent Neural Network for Sequence Labeling.",
                    "Haze Forecasting via Deep LSTM.",
                    "Importance-Weighted Distance Aware Stocks Trend Prediction.",
                    "Jointly Modeling Structural and Textual Representation for Knowledge Graph Completion in Zero-Shot Scenario.",
                    "Neural Typing Entities in Chinese-Pedia.",
                    "Knowledge Graph Embedding by Learning to Connect Entity with Relation.",
                    "StarMR: An Efficient Star-Decomposition Based Query Processor for SPARQL Basic Graph Patterns Using MapReduce.",
                    "DAVE: Extracting Domain Attributes and Values from Text Corpus.",
                    "PRSPR: An Adaptive Framework for Massive RDF Stream Reasoning.",
                    "TSRS: Trip Service Recommended System Based on Summarized Co-location Patterns.",
                    "DFCPM: A Dominant Feature Co-location Pattern Miner.",
                    "CUTE: Querying Knowledge Graphs by Tabular Examples.",
                    "ALTAS: An Intelligent Text Analysis System Based on Knowledge Graphs.",
                    "SPARQLVis: An Interactive Visualization Tool for Knowledge Graphs.",
                    "PBR: A Personalized Book Resource Recommendation System."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2018-2",
                "sub_name": "Web and Big Data - Second International Joint Conference, APWeb-WAIM 2018, Macau, China, July 23-25, 2018, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Fuzzy Searching Encryption with Complex Wild-Cards Queries on Encrypted Database.",
                    "Towards Privacy-Preserving Travel-Time-First Task Assignment in Spatial Crowdsourcing.",
                    "Plover: Parallel In-Memory Database Logging on Scalable Storage Devices.",
                    "Inferring Regular Expressions with Interleaving from XML Data.",
                    "Efficient Query Reverse Engineering for Joins and OLAP-Style Aggregations.",
                    "DCA: The Advanced Privacy-Enhancing Schemes for Location-Based Services.",
                    "Discussion on Fast and Accurate Sketches for Skewed Data Streams: A Case Study.",
                    "Matching Consecutive Subpatterns over Streaming Time Series.",
                    "A Data Services Composition Approach for Continuous Query on Data Streams.",
                    "Discovering Multiple Time Lags of Temporal Dependencies from Fluctuating Events.",
                    "A Combined Model for Time Series Prediction in Financial Markets.",
                    "Location Prediction in Social Networks.",
                    "Efficient Longest Streak Discovery in Multidimensional Sequence Data.",
                    "Map Matching Algorithms: An Experimental Evaluation.",
                    "Predicting Passenger's Public Transportation Travel Route Using Smart Card Data.",
                    "Detecting Taxi Speeding from Sparse and Low-Sampled Trajectory Data.",
                    "Cloned Vehicle Behavior Analysis Framework.",
                    "An Event Correlation Based Approach to Predictive Maintenance.",
                    "Using Crowdsourcing for Fine-Grained Entity Type Completion in Knowledge Bases.",
                    "Improving Clinical Named Entity Recognition with Global Neural Attention.",
                    "Exploiting Implicit Social Relationship for Point-of-Interest Recommendation.",
                    "Spatial Co-location Pattern Mining Based on Density Peaks Clustering and Fuzzy Theory.",
                    "A Tensor-Based Method for Geosensor Data Forecasting.",
                    "Aggregate k Nearest Neighbor Queries in Metric Spaces.",
                    "Finding the K Nearest Objects over Time Dependent Road Networks.",
                    "Reverse Top-k Query on Uncertain Preference.",
                    "Keyphrase Extraction Based on Optimized Random Walks on Multiple Word Relations.",
                    "Answering Range-Based Reverse kNN Queries.",
                    "EarnCache: Self-adaptive Incremental Caching for Big Data Applications.",
                    "Storage and Recreation Trade-Off for Multi-version Data Management.",
                    "Decentralized Data Integrity Verification Model in Untrusted Environment.",
                    "Enabling Concurrency on Smart Contracts Using Multiversion Ordering.",
                    "ElasticChain: Support Very Large Blockchain by Reducing Data Redundancy.",
                    "A MapReduce-Based Approach for Mining Embedded Patterns from Large Tree Data."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2018w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2018 International Workshops: MWDA, BAH, KGMA, DMMOOC, DS, Macau, China, July 23-25, 2018, Revised Selected Papers.",
                "count": 31,
                "papers": [
                    "Hybrid Decision Based Chinese News Headline Classification.",
                    "A Self-representation Model for Robust Clustering of Categorical Sequences.",
                    "Diversified Spatial Keyword Query on Topic Coverage.",
                    "Sequence-As-Feature Representation for Subspace Classification of Multivariate Time Series.",
                    "Discovering Congestion Propagation Patterns by Co-location Pattern Mining.",
                    "Spectroscopy-Based Food Internal Quality Evaluation with XGBoost Algorithm.",
                    "Large Scale UAVs Collaborative Formation Simulation Based on Starlings' Flight Mechanism.",
                    "Measuring the Spatio-Temporal Similarity Between Users.",
                    "Gesture Recognition Based on Accelerometer and Gyroscope and Its Application in Medical and Smart Homes.",
                    "Smartphone-Based Human Activity Recognition Using CNN in Frequency Domain.",
                    "Text Classification Methods Based on SVD and FCM.",
                    "An Image Processing Method via OpenCL for Identification of Pulmonary Nodules.",
                    "Pulmonary Nodule Segmentation Method of CT Images Based on 3D-FCN.",
                    "Research on Video Recommendation Algorithm Based on Knowledge Reasoning of Knowledge Graph.",
                    "A Hybrid Framework for Query Processing and Data Analytics on Spark.",
                    "Improving Network-Based Top-N Recommendation with Background Knowledge from Linked Open Data.",
                    "A Web-Based Theme-Related Word Set Construction Algorithm.",
                    "Classifying Personal Photo Collections: An Event-Based Approach.",
                    "A Learning Analytic Model for Smart Classroom.",
                    "Understanding User Interests Acquisition in Personalized Online Course Recommendation.",
                    "A Learning Analytics System for Cognition Analysis in Online Learning Community.",
                    "A Semantic Role Mining and Learning Performance Prediction Method in MOOCs.",
                    "MOOC Guider: An End-to-End Dialogue System for MOOC Users.",
                    "AUnet: An Unsupervised Method for Answer Reliability Evaluation in Community QA Systems.",
                    "Model and Practice of Crowd-Based Education.",
                    "Exploring Business Models and Dynamic Pricing Frameworks for SPOC Services.",
                    "Speed-Up Algorithms for Happiness-Maximizing Representative Databases.",
                    "Multi-location Influence Maximization in Location-Based Social Networks.",
                    "Emotion Analysis for the Upcoming Response in Open-Domain Human-Computer Conversation.",
                    "A Recurrent Neural Network Language Model Based on Word Embedding.",
                    "Inferring Social Ties from Multi-view Spatiotemporal Co-occurrence."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "1st WAIM/APWeb 2017",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apweb/2017-1",
                "sub_name": "Web and Big Data - First International Joint Conference, APWeb-WAIM 2017, Beijing, China, July 7-9, 2017, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "Meta Paths and Meta Structures: Analysing Large Heterogeneous Information Networks.",
                    "TrajSpark: A Scalable and Efficient In-Memory Management System for Big Trajectory Data.",
                    "A Local-Global LDA Model for Discovering Geographical Topics from Social Media.",
                    "Team-Oriented Task Planning in Spatial Crowdsourcing.",
                    "Negative Survey with Manual Selection: A Case Study in Chinese Universities.",
                    "Element-Oriented Method of Assessing Landscape of Sightseeing Spots by Using Social Images.",
                    "Sifting Truths from Multiple Low-Quality Data Sources.",
                    "A Community-Aware Approach to Minimizing Dissemination in Graphs.",
                    "Time-Constrained Graph Pattern Matching in a Large Temporal Graph.",
                    "Efficient Compression on Real World Directed Graphs.",
                    "Keyphrase Extraction Using Knowledge Graphs.",
                    "Semantic-Aware Partitioning on RDF Graphs.",
                    "An Incremental Algorithm for Estimating Average Clustering Coefficient Based on Random Walk.",
                    "Deep Multi-label Hashing for Large-Scale Visual Search Based on Semantic Graph.",
                    "An Ontology-Based Latent Semantic Indexing Approach Using Long Short-Term Memory Networks.",
                    "Privacy-Preserving Collaborative Web Services QoS Prediction via Differential Privacy.",
                    "High-Utility Sequential Pattern Mining with Multiple Minimum Utility Thresholds.",
                    "Extracting Various Types of Informative Web Content via Fuzzy Sequential Pattern Mining.",
                    "Exploiting High Utility Occupancy Patterns.",
                    "Translation Language Model Enhancement for Community Question Retrieval Using User Adoption Answer.",
                    "Holographic Lexical Chain and Its Application in Chinese Text Summarization.",
                    "Authorship Identification of Source Codes.",
                    "DFDS: A Domain-Independent Framework for Document-Level Sentiment Analysis Based on RST.",
                    "Fast Follower Recovery for State Machine Replication.",
                    "Laser: Load-Adaptive Group Commit in Lock-Free Transaction Logging.",
                    "Detecting User Occupations on Microblogging Platforms: An Experimental Study.",
                    "Counting Edges and Triangles in Online Social Networks via Random Walk.",
                    "Fair Reviewer Assignment Considering Academic Social Network.",
                    "Viral Marketing for Digital Goods in Social Networks.",
                    "Change Detection from Media Sharing Community.",
                    "Measuring the Similarity of Nodes in Signed Social Networks with Positive and Negative Links.",
                    "Elastic Resource Provisioning for Batched Stream Processing System in Container Cloud.",
                    "An Adaptive Framework for RDF Stream Processing.",
                    "Investigating Microstructure Patterns of Enterprise Network in Perspective of Ego Network.",
                    "Neural Architecture for Negative Opinion Expressions Extraction.",
                    "Identifying the Academic Rising Stars via Pairwise Citation Increment Ranking.",
                    "Fuzzy Rough Incremental Attribute Reduction Applying Dependency Measures.",
                    "SET: Secure and Efficient Top-k Query in Two-Tiered Wireless Sensor Networks.",
                    "Top-k Pattern Matching Using an Information-Theoretic Criterion over Probabilistic Data Streams.",
                    "Sliding Window Top-K Monitoring over Distributed Data Streams.",
                    "Diversified Top-k Keyword Query Interpretation on Knowledge Graphs.",
                    "Group Preference Queries for Location-Based Social Networks.",
                    "A Formal Product Search Model with Ensembled Proximity.",
                    "Incorporating User Preferences Across Multiple Topics into Collaborative Filtering for Personalized Merchant Recommendation.",
                    "Joint Factorizational Topic Models for Cross-City Recommendation.",
                    "Aligning Gaussian-Topic with Embedding Network for Summarization Ranking.",
                    "Improving Document Clustering for Short Texts by Long Documents via a Dirichlet Multinomial Allocation Model.",
                    "Intensity of Relationship Between Words: Using Word Triangles in Topic Discovery for Short Texts.",
                    "Context-Aware Topic Modeling for Content Tracking in Social Media."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2017-2",
                "sub_name": "Web and Big Data - First International Joint Conference, APWeb-WAIM 2017, Beijing, China, July 7-9, 2017, Proceedings, Part II.",
                "count": 35,
                "papers": [
                    "Combining Node Identifier Features and Community Priors for Within-Network Classification.",
                    "An Active Learning Approach to Recognizing Domain-Specific Queries From Query Log.",
                    "Event2vec: Learning Representations of Events on Temporal Sequences.",
                    "Joint Emoji Classification and Embedding Learning.",
                    "Target-Specific Convolutional Bi-directional LSTM Neural Network for Political Ideology Analysis.",
                    "Boost Clickbait Detection Based on User Behavior Analysis.",
                    "A Novel Hybrid Friends Recommendation Framework for Twitter.",
                    "A Time and Sentiment Unification Model for Personalized Recommendation.",
                    "Personalized POI Groups Recommendation in Location-Based Social Networks.",
                    "Learning Intermediary Category Labels for Personal Recommendation.",
                    "Skyline-Based Recommendation Considering User Preferences.",
                    "Improving Topic Diversity in Recommendation Lists: Marginally or Proportionally?",
                    "Integrating Feedback-Based Semantic Evidence to Enhance Retrieval Effectiveness for Clinical Decision Support.",
                    "Reordering Transaction Execution to Boost High Frequency Trading Applications.",
                    "Bus-OLAP: A Bus Journey Data Management Model for Non-on-time Events Query.",
                    "Distributed Data Mining for Root Causes of KPI Faults in Wireless Networks.",
                    "Precise Data Access on Distributed Log-Structured Merge-Tree.",
                    "Cuttle: Enabling Cross-Column Compression in Distributed Column Stores.",
                    "Optimizing Window Aggregate Functions via Random Sampling.",
                    "Fast Log Replication in Highly Available Data Store.",
                    "New Word Detection in Ancient Chinese Literature.",
                    "Identifying Evolutionary Topic Temporal Patterns Based on Bursty Phrase Clustering.",
                    "Personalized Citation Recommendation via Convolutional Neural Networks.",
                    "A Streaming Data Prediction Method Based on Evolving Bayesian Network.",
                    "A Learning Approach to Hierarchical Search Result Diversification.",
                    "TeslaML: Steering Machine Learning Automatically in Tencent.",
                    "DPHSim: A Flexible Simulator for DRAM/PCM-Based Hybrid Memory.",
                    "CrowdIQ: A Declarative Crowdsourcing Platform for Improving the Quality of Web Tables.",
                    "OICPM: An Interactive System to Find Interesting Co-location Patterns Using Ontologies.",
                    "BioPW: An Interactive Tool for Biological Pathway Visualization on Linked Data.",
                    "ChargeMap: An Electric Vehicle Charging Station Planning System.",
                    "Topic Browsing System for Research Papers Based on Hierarchical Latent Tree Analysis.",
                    "A Tool of Benchmarking Realtime Analysis for Massive Behavior Data.",
                    "Interactive Entity Centric Analysis of Log Data.",
                    "A Tool for 3D Visualizing Moving Objects."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2017w",
                "sub_name": "Web and Big Data - APWeb-WAIM 2017 International Workshops: MWDA, HotSpatial, GDMA, DDC, SDMA, MASS, Beijing, China, July 7-9, 2017, Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "Smooth Representation Clustering Based on Kernelized Random Walks.",
                    "A Joint Model for Water Scarcity Evaluation.",
                    "Efficient Stance Detection with Latent Feature.",
                    "Deep Analysis and Utilization of Malware's Social Relation Network for Its Detection.",
                    "An Adversarial Machine Learning Model Against Android Malware Evasion Attacks.",
                    "Word Similarity Computation with Extreme-Similar Method.",
                    "Measuring the Wellness Indices of the Elderly Using RFID Sensors Data in a Smart Nursing Home.",
                    "Using Jaccard Distance Measure for Unsupervised Activity Recognition with Smartphone Accelerometers.",
                    "Speech Emotion Recognition Using Multiple Classifiers.",
                    "Intelligent Taxi Dispatching Based on Improved Artificial Fish Swarm Algorithm.",
                    "Correction of Telecom Localization Errors by Context Knowledge.",
                    "Inferring Unmet Human Mobility Demand with Multi-source Urban Data.",
                    "A Hybrid Approach of HTTP Anomaly Detection.",
                    "TaxiCluster: A Visualization Platform on Clustering Algorithms for Taxi Trajectories.",
                    "Transformation of XML Data Sources for Sequential Path Mining.",
                    "Graph Summarization Based on Attribute-Connected Network.",
                    "Timely Detection of Temporal Relations in RDF Stream Processing Scenario.",
                    "Finding Optimal Team for Multi-skill Task in Spatial Crowdsourcing.",
                    "CI-Bot: A Hybrid Chatbot Enhanced by Crowdsourcing.",
                    "Group Formation Based on Crowdsourced Top-k Recommendation.",
                    "Taxi Call Prediction for Online Taxicab Platforms.",
                    "Data Gathering Framework Based on Fog Computing Paradigm in VANETs.",
                    "Automatic Text Generation via Text Extraction Based on Submodular.",
                    "Collaborative Heterogeneous Information Embedding for Recommender Systems.",
                    "Comparative Research for Social Recommendations on VK."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th WAIM 2016",
        "info": "Nanchang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2016-1",
                "sub_name": "Web-Age Information Management - 17th International Conference, WAIM 2016, Nanchang, China, June 3-5, 2016, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "More Efficient Algorithm for Mining Frequent Patterns with Multiple Minimum Supports.",
                    "Efficient Mining of Uncertain Data for High-Utility Itemsets.",
                    "An Improved HMM Model for Sensing Data Predicting in WSN.",
                    "eXtreme Gradient Boosting for Identifying Individual Users Across Different Digital Devices.",
                    "Two-Phase Mining for Frequent Closed Episodes.",
                    "Effectively Updating High Utility Co-location Patterns in Evolving Spatial Databases.",
                    "Mining Top-k Distinguishing Sequential Patterns with Flexible Gap Constraints.",
                    "A Novel Chinese Text Mining Method for E-Commerce Review Spam Detection.",
                    "Retrieving Routes of Interest Over Road Networks.",
                    "Semantic-Aware Trajectory Compression with Urban Road Network.",
                    "Discovering Underground Roads from Trajectories Without Road Network.",
                    "Ridesharing Recommendation: Whether and Where Should I Wait?",
                    "Keyword-aware Optimal Location Query in Road Network.",
                    "Point-of-Interest Recommendations by Unifying Multiple Correlations.",
                    "Top-k Team Recommendation in Spatial Crowdsourcing.",
                    "Explicable Location Prediction Based on Preference Tensor Model.",
                    "Random Partition Factorization Machines for Context-Aware Recommendations.",
                    "A Novel Framework to Process the Quantity and Quality of User Behavior Data in Recommender Systems.",
                    "RankMBPR: Rank-Aware Mutual Bayesian Personalized Ranking for Item Recommendation.",
                    "Unsupervised Expert Finding in Social Network for Personalized Recommendation.",
                    "An Approach for Clothing Recommendation Based on Multiple Image Attributes.",
                    "SocialFM: A Social Recommender System with Factorization Machines.",
                    "Identifying Linked Data Datasets for sameAs Interlinking Using Recommendation Techniques.",
                    "Query-Biased Multi-document Abstractive Summarization via Submodular Maximization Using Event Guidance.",
                    "Inferring Diffusion Network on Incomplete Cascade Data.",
                    "Anchor Link Prediction Using Topological Information in Social Networks.",
                    "Collaborative Partitioning for Multiple Social Networks with Anchor Nodes.",
                    "A General Framework for Graph Matching and Its Application in Ontology Matching.",
                    "Internet Traffic Analysis in a Large University Town: A Graphical and Clustering Approach.",
                    "Conceptual Sentence Embeddings.",
                    "Inferring Social Roles of Mobile Users Based on Communication Behaviors.",
                    "Sparse Topical Coding with Sparse Groups.",
                    "Differential Evolution-Based Fusion for Results Diversification of Web Search.",
                    "BMF: An Indexing Structure to Support Multi-element Check.",
                    "Efficient Unique Column Combinations Discovery Based on Data Distribution.",
                    "Event Related Document Retrieval Based on Bipartite Graph.",
                    "SPedia: A Semantics Based Repository of Scientific Publications Data.",
                    "A Set-Based Training Query Classification Approach for Twitter Search.",
                    "NBLucene: Flexible and Efficient Open Source Search Engine.",
                    "Context-Aware Entity Summarization."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2016-2",
                "sub_name": "Web-Age Information Management - 17th International Conference, WAIM 2016, Nanchang, China, June 3-5, 2016, Proceedings, Part II.",
                "count": 40,
                "papers": [
                    "Detecting Anomalous Ratings Using Matrix Factorization for Recommender Systems.",
                    "A Novel Spatial Cloaking Scheme Using Hierarchical Hilbert Curve for Location-Based Services.",
                    "Efficient Privacy-Preserving Content-Based Image Retrieval in the Cloud.",
                    "Preserving the d-Reachability When Anonymizing Social Networks.",
                    "Personalized Location Anonymity - A Kernel Density Estimation Approach.",
                    "Detecting Data-model-oriented Anomalies in Parallel Business Process.",
                    "Learning User Credibility on Aspects from Review Texts.",
                    "Detecting Anomaly in Traffic Flow from Road Similarity Analysis.",
                    "PACOKS: Progressive Ant-Colony-Optimization-Based Keyword Search over Relational Databases.",
                    "Enhanced Query Classification with Millions of Fine-Grained Topics.",
                    "A Hybrid Machine-Crowdsourcing Approach for Web Table Matching and Cleaning.",
                    "An Update Method for Shortest Path Caching with Burst Paths Based on Sliding Windows.",
                    "Low Overhead Log Replication for Main Memory Database System.",
                    "Diversification of Keyword Query Result Patterns.",
                    "Efficient Approximate Substring Matching in Compressed String.",
                    "Top-K Similarity Search for Query-By-Humming.",
                    "Restricted Boltzmann Machines for Retweeting Behaviours Prediction.",
                    "Cross-Collection Emotion Tagging for Online News.",
                    "Online News Emotion Prediction with Bidirectional LSTM.",
                    "Learning for Search Results Diversification in Twitter.",
                    "Adjustable Time-Window-Based Event Detection on Twitter.",
                    "User-IBTM: An Online Framework for Hashtag Suggestion in Twitter.",
                    "Unifying User and Message Clustering Information for Retweeting Behavior Prediction.",
                    "KPCA-WT: An Efficient Framework for High Quality Microblog Extraction in Time-Frequency Domain.",
                    "Active Learning Method for Constraint-Based Clustering Algorithms.",
                    "An Effective Cluster Assignment Strategy for Large Time Series Data.",
                    "AdaWIRL: A Novel Bayesian Ranking Approach for Personal Big-Hit Paper Prediction.",
                    "Detecting Live Events by Mining Textual and Spatial-Temporal Features from Microblogs.",
                    "A Label Correlation Based Weighting Feature Selection Approach for Multi-label Data.",
                    "Valuable Group Trajectory Pattern Mining Directed by Adaptable Value Measuring Model.",
                    "DualPOS: A Semi-supervised Attribute Selection Approach for Symbolic Data Based on Rough Set Theory.",
                    "Semi-supervised Clustering Based on Artificial Bee Colony Algorithm with Kernel Strategy.",
                    "HMNRS: A Hierarchical Multi-source Name Resolution Service for the Industrial Internet.",
                    "Optimizing Replica Exchange Strategy for Load Balancing in Multienant Databases.",
                    "ERPC: An Edge-Resources Based Framework to Reduce Bandwidth Cost in the Personal Cloud.",
                    "Multidimensional Similarity Join Using MapReduce.",
                    "Real-Time Logo Recognition from Live Video Streams Using an Elastic Cloud Platform.",
                    "Profit Based Two-Step Job Scheduling in Clouds.",
                    "A Join Optimization Method for CPU/MIC Heterogeneous Systems.",
                    "GFSF: A Novel Similarity Join Method Based on Frequency Vector."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2016w",
                "sub_name": "Web-Age Information Management - WAIM 2016 International Workshops, MWDA, SDMMW, and SemiBDMA, Nanchang, China, June 3-5, 2016, Revised Selected Papers.",
                "count": 27,
                "papers": [
                    "Modeling User Preference from Rating Data Based on the Bayesian Network with a Latent Variable.",
                    "A Hybrid Approach for Sparse Data Classification Based on Topic Model.",
                    "Human Activity Recognition in a Smart Home Environment with Stacked Denoising Autoencoders.",
                    "Ranking Online Services by Aggregating Ordinal Preferences.",
                    "DroidDelver: An Android Malware Detection System Using Deep Belief Network Based on API Call Blocks.",
                    "A Novel Feature Extraction Method on Activity Recognition Using Smartphone.",
                    "Fault-Tolerant Adaptive Routing in n-D Mesh.",
                    "An Improved Slope One Algorithm Combining KNN Method Weighted by User Similarity.",
                    "Urban Anomalous Events Analysis Based on Bayes Probabilistic Model from Mobile Phone Records.",
                    "A Combined Model Based on Neural Networks, LSSVM and Weight Coefficients Optimization for Short-Term Electric Load Forecasting.",
                    "Efficient Context-Aware Nested Complex Event Processing over RFID Streams.",
                    "Using Convex Combination Kernel Function to Extract Entity Relation in Specific Field.",
                    "A Novel Method of Influence Ranking via Node Degree and H-index for Community Detection.",
                    "Efficient and Load Balancing Strategy for Task Scheduling in Spatial Crowdsourcing.",
                    "How Surfing Habits Affect Academic Performance: An Experimental Study.",
                    "Preference-Aware Top-k Spatio-Textual Queries.",
                    "Result Diversification in Event-Based Social Networks.",
                    "Complicated-Skills-Based Task Assignment in Spatial Crowdsourcing.",
                    "Market-Driven Optimal Task Assignment in Spatial Crowdsouring.",
                    "A Shortest Path Query Method Based on Tree Decomposition and Label Coverage.",
                    "An Efficient Two-Table Join Query Processing Based on Extended Bloom Filter in MapReduce.",
                    "An Improved Community Detection Method in Bipartite Networks.",
                    "Community Detection Algorithm of the Large-Scale Complex Networks Based on Random Walk.",
                    "Efficient Interval Indexing and Searching on Cloud.",
                    "Filtering Uncertain XML Documents by Threshold XPEs.",
                    "Storing and Querying Semi-structured Spatio-Temporal Data in HBase.",
                    "Efficient Approximation of Well-Designed SPARQL Queries."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16th WAIM 2015",
        "info": "Qingdao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2015",
                "sub_name": "Web-Age Information Management - 16th International Conference, WAIM 2015, Qingdao, China, June 8-10, 2015. Proceedings.",
                "count": 70,
                "papers": [
                    "An Influence Field Perspective on Predicting User's Retweeting Behavior.",
                    "Realizing Impact Sourcing by Adaptive Gold Questions: A Socially Responsible Measure for Workers' Trustworthiness.",
                    "A Coalition Formation Game Theory-Based Approach for Detecting Communities in Multi-relational Networks.",
                    "Individual Influence Maximization via Link Recommendation.",
                    "Community Detection Based on Minimum-Cut Graph Partitioning.",
                    "Coherent Topic Hierarchy: A Strategy for Topic Evolutionary Analysis on Microblog Feeds.",
                    "Age Detection for Chinese Users in Weibo.",
                    "Batch Mode Active Learning for Networked Data with Optimal Subset Selection.",
                    "A Question Answering System Built on Domain Knowledge Base.",
                    "Fast and Accurate Computation of Role Similarity via Vertex Centrality.",
                    "Multimodal-Based Supervised Learning for Image Search Reranking.",
                    "Novel Word Features for Keyword Extraction.",
                    "A Multi-round Global Performance Evaluation Method for Interactive Image Retrieval.",
                    "Resorting Relevance Evidences to Cumulative Citation Recommendation for Knowledge Base Acceleration.",
                    "Relevance Search on Signed Heterogeneous Information Network Based on Meta-path Factorization.",
                    "Improving the Effectiveness of Keyword Search in Databases Using Query Logs.",
                    "cluTM: Content and Link Integrated Topic Model on Heterogeneous Information Networks.",
                    "Learning to Recommend with User Generated Content.",
                    "Combining Positive and Negative Feedbacks with Factored Similarity Matrix for Recommender Systems.",
                    "Review Comment Analysis for Predicting Ratings.",
                    "Adaptive Temporal Model for IPTV Recommendation.",
                    "RPCV: Recommend Potential Customers to Vendors in Location-Based Social Network.",
                    "Mining Dependencies Considering Time Lag in Spatio-Temporal Traffic Data.",
                    "Location Semantics Protection Based on Bayesian Inference.",
                    "SALA: A Skew-Avoiding and Locality-Aware Algorithm for MapReduce-Based Join.",
                    "Energy-Proportional Query Processing on Database Clusters.",
                    "SparkRDF: In-Memory Distributed RDF Management Framework for Large-Scale Social Data.",
                    "Distributed Grid-Based K Nearest Neighbour Query Processing Over Moving Objects.",
                    "An Efficient Block Sampling Strategy for Online Aggregation in the Cloud.",
                    "Computing Probability Threshold Set Similarity on Probabilistic Sets.",
                    "Region-aware Top-k Similarity Search.",
                    "A Partition-Based Bi-directional Filtering Method for String Similarity JOINs.",
                    "Fast Multiway Maximum Margin Clustering Based on Genetic Algorithm via the NystrÖm Method.",
                    "DTMF: A User Adaptive Model for Hybrid Recommendation.",
                    "An Adaptive Skew Handling Join Algorithm for Large-scale Data Analysis.",
                    "NokeaRM: Employing Non-key Attributes in Record Matching.",
                    "Efficient Foreign Key Discovery Based on Nearest Neighbor Search.",
                    "OntoEvent: An Ontology-Based Event Description Language for Semantic Complex Event Processing.",
                    "Differential Trust Propagation with Community Discovery for Link-Based Web Spam Demotion.",
                    "Inferring User Preference in Good Abandonment from Eye Movements.",
                    "Private Range Queries on Outsourced Databases.",
                    "Efficient Influence Maximization Based on Three Degrees of Influence Theory.",
                    "Bichromatic Reverse kNN Query Algorithm on Road Network Distance.",
                    "IIRS: A Novel Framework of Identifying Commodity Entities on E-commerce Big Data.",
                    "Extracting Appraisal Expressions from Short Texts.",
                    "Friendship Link Recommendation Based on Content Structure Information.",
                    "Overlapping Community Detection in Directed Heterogeneous Social Network.",
                    "Efficient MapReduce-Based Method for Massive Entity Matching.",
                    "The Role of Physical Location in Our Online Social Networks.",
                    "Hierarchical Community Evolution Mining from Dynamic Networks.",
                    "Exploiting Conceptual Relations of Sentences for Multi-document Summarization.",
                    "Towards Narrative Information Systems.",
                    "Maximizing the Spread of Competitive Influence in a Social Network Oriented to Viral Marketing.",
                    "SEMR: Secure and Efficient Multi-dimensional Range Query Processing in Two-tiered Wireless Sensor Networks.",
                    "A Sampling-Based Framework for Crowdsourced Select Query with Multiple Predicates.",
                    "A Customized Schema Design Framework for Multi-tenant Database.",
                    "A Multi-attribute Probabilistic Matrix Factorization Model for Personalized Recommendation.",
                    "A Novel Knowledge Extraction Framework for Resumes Based on Text Classifier.",
                    "SimRank Based Top-k Query Aggregation for Multi-Relational Networks.",
                    "On Dynamic Top-k Influence Maximization.",
                    "Community Based Spammer Detection in Social Networks.",
                    "LDM: A DTD Schema Mapping Language Based on Logic Patterns.",
                    "Effective Sampling of Points of Interests on Maps Based on Road Networks.",
                    "Associated Index for Big Structured and Unstructured Data.",
                    "Web Knowledge Base Improved OCR Correction for Chinese Business Cards.",
                    "Shortest Path and Word Vector Based Relation Representation and Clustering.",
                    "CrowdSR: A Crowd Enabled System for Semantic Recovering of Web Tables.",
                    "A Personalized News Recommendation System Based on Tag Dependency Graph.",
                    "SmartInt: A Demonstration System for the Interaction Between Schema Mapping and Record Matching.",
                    "CDSG: A Community Detection System Based on the Game Theory."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2015w",
                "sub_name": "Web-Age Information Management - WAIM 2015 International Workshops: HENA, HRSUNE, Qingdao, China, June 8-10, 2015, Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "A Distributed RDF Storage and Query Model Based on HBase.",
                    "A New Link Prediction Algorithm Based on Local Links.",
                    "Spammer Detection on Online Social Networks Based on Logistic Regression.",
                    "Personalized Mention Probabilistic Ranking - Recommendation on Mention Behavior of Heterogeneous Social Network.",
                    "A Novel Recommendation Algorithm Based on Heterogeneous Information Network Similarity and Preference Diffusion.",
                    "Information Diffusion in Online Social Networks: Models, Methods and Applications.",
                    "Mining Personal Interests of Microbloggers Based on Free Tags in SINA Weibo.",
                    "Social Media Usage as a Service: A Service-Dominant Logic Perspective.",
                    "Information Revelation for Better or Worse Recommendation: Understanding Chinese Users' Privacy Attitudes and Practices."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15th WAIM 2014",
        "info": "Macau, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2014",
                "sub_name": "Web-Age Information Management - 15th International Conference, WAIM 2014, Macau, China, June 16-18, 2014. Proceedings.",
                "count": 87,
                "papers": [
                    "Faster MaxScore Document Retrieval with Aggressive Processing.",
                    "Finding Novel Patents Based on Patent Association.",
                    "Optimizing Top-k Retrieval: Submodularity Analysis and Search Strategies.",
                    "Improving Recommendations with Collaborative Factors.",
                    "Evolutionary Personalized Hashtag Recommendation.",
                    "PathSimExt: Revisiting PathSim in Heterogeneous Information Networks.",
                    "AdaMF: Adaptive Boosting Matrix Factorization for Recommender System.",
                    "A Generic Approach for Bulk Loading Trie-Based Index Structures on External Storage.",
                    "Density-Based Local Outlier Detection on Uncertain Data.",
                    "Indexing Uncertain Data for Supporting Range Queries.",
                    "A Distributed Quorum System for Ensuring Bounded Staleness of Key-Value Stores.",
                    "Multimodal Data Fusion in Text-Image Heterogeneous Graph for Social Media Recommendation.",
                    "Accuracy Estimation of Link-Based Similarity Measures and Its Application.",
                    "An Efficient Influence Maximization Algorithm to Discover Influential Users in Micro-blog.",
                    "Detecting Errors in Numeric Attributes.",
                    "Distributed Entity Resolution Based on Similarity Join for Large-Scale Data Clustering.",
                    "Exploring the Intervention Problem with the Networked Poisson Process in a Real Heterogeneous Social Network.",
                    "An Infinite Latent Generalized Linear Model.",
                    "ITCI: An Information Theory Based Classification Algorithm for Incomplete Data.",
                    "Discovering Informative Contents of Web Pages.",
                    "Chinese Evaluation Phrase Extraction Based on Cascaded Model.",
                    "Tracking Topics on Revision Graphs of Wikipedia Edit History.",
                    "Holistic Subgraph Search over Large Graphs.",
                    "Clustering Query Results to Support Keyword Search on Tree Data.",
                    "An Efficient Conditioning Method for Probabilistic Relational Databases.",
                    "A Proactive Complex Event Processing Method Based on Parallel Markov Decision Processes.",
                    "Social-Aware KNN Search in Location-Based Social Networks.",
                    "A Spatial-temporal Topic Segmentation Model for Human Mobile Behavior.",
                    "Real-Time Predicting Bursting Hashtags on Twitter.",
                    "Fast Approximation of Shortest Path on Dynamic Information Networks.",
                    "Detecting of PIU Behaviors Based on Discovered Generators and Emerging Patterns from Computer-Mediated Interaction Events.",
                    "Characterizing Tweeting Behaviors of Sina Weibo Users via Public Data Streaming.",
                    "Time Series Classification Using Multi-Channels Deep Convolutional Neural Networks.",
                    "A Query Approach of Supporting Variable Physical Window in Large-Scale Smart Grid.",
                    "P3RN: Personalized Privacy Protection Using Query Semantics over Road Networks.",
                    "A Novel Privacy-Preserving Group Matching Scheme in Social Networks.",
                    "Highly Efficient Indexing for Privacy-Preserving Multi-keyword Query over Encrypted Cloud Data.",
                    "Parallel Mining of OWL 2 EL Ontology from Linked Data.",
                    "TraPath: Fast Regular Path Query Evaluation on Large-Scale RDF Graphs.",
                    "BF-Matrix: A Secondary Index for the Cloud Storage.",
                    "A Cluster Based Schema Design for Multi-tenant Database.",
                    "Tenant-Oriented Composite Authentication Tree for Data Integrity Protection in SaaS.",
                    "Efficient Graph Similarity Join with Scalable Prefix-Filtering Using MapReduce.",
                    "SSD-Aware Temporary Data Management Policy for Improving Query Performance.",
                    "A Novel Index Structure for Multi-key Search.",
                    "Load-Balanced Breadth-First Search on GPUs.",
                    "Leveraging Attributes and Crowdsourcing for Join.",
                    "Truth Discovery Based on Crowdsourcing.",
                    "Sarcasm Detection in Social Media Based on Imbalanced Classification.",
                    "Centroid-Based Classification of Categorical Data.",
                    "ChronoSAGE: Diversifying Topic Modeling Chronologically.",
                    "Comments-Oriented Summarization in Blogsphere Using a Two-Stage Sentence Similarity Measure.",
                    "Popularity Prediction of Burst Event in Microblogging.",
                    "Identifying Gender of Microblog Users Based on Message Mining.",
                    "Continuous Temporal Top-k Query over Versioned Documents.",
                    "Theme-Aware Social Strength Inference from Spatiotemporal Data.",
                    "Organizing Sightseeing Tweets Based on Content Relatedness and Sharability.",
                    "Efficient Diverse Rank of Hot-Topics-Discussion on Social Network.",
                    "Encoding Document Semantic into Binary Codes Space.",
                    "LSG: A Unified Multi-dimensional Latent Semantic Graph for Personal Information Retrieval.",
                    "HRank: A Path Based Ranking Method in Heterogeneous Information Network.",
                    "Action-Scene Model for Recognizing Human Actions from Background in Realistic Videos.",
                    "Automatically Learning and Specifying Association Relations between Words.",
                    "A Chinese Question Answering System for Specific Domain.",
                    "Top-k Spatio-textual Similarity Search.",
                    "A Query Suggestion Interface with Features of Queries and Search Results.",
                    "Finding Photo Sets of Events by Minimizing Misrecognition from Neighbor Events.",
                    "Online Community Transition Detection.",
                    "PPML: Penalized Partial Least Squares Discriminant Analysis for Multi-Label Learning.",
                    "Authorship Attribution with Very Few Labeled Data: A Co-training Approach.",
                    "Edges Protection in Multiple Releases of Social Network Data.",
                    "Trust Prediction with Temporal Dynamics.",
                    "Trust Inference Path Search Combining Community Detection and Ant Colony Optimization.",
                    "ExNa: An Efficient Search Pattern for Search Engines.",
                    "A Correlation-Based Semantic Model for Text Search.",
                    "Finding Relatedness between Research Papers Using Similarity and Dissimilarity Scores.",
                    "Context-Dependent Sentiment Classification Using Antonym Pairs and Double Expansion.",
                    "A Novel Knowledge Network Framework for Financial News Navigation.",
                    "How Do People Communicate through Different Social Connections?",
                    "From Trajectories to Path Network: An Endpoints-Based GPS Trajectory Partition and Clustering Framework.",
                    "An Intelligent Search Platform for Business News.",
                    "Structured Sparse Linear Model for Social Trust Prediction.",
                    "Finding Time-Dependent Hot Path from GPS Trajectories.",
                    "A Two-Phase Model for Retweet Number Prediction.",
                    "Finding Vacant Taxis Using Large Scale GPS Traces.",
                    "Logo Detection and Recognition Based on Classification.",
                    "Business Intelligence by Connecting Real-Time Indoor Location to Sales Records."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2014w",
                "sub_name": "Web-Age Information Management - WAIM 2014 International Workshops: BigEM, HardBD, DaNoS, HRSUNE, BIDASYS, Macau, China, June 16-18, 2014 Revised Selected Papers.",
                "count": 38,
                "papers": [
                    "Predicting Popularity of Microblogs in Emerging Disease Event.",
                    "A Cross-Simulation Method for Large-Scale Traffic Evacuation with Big Data.",
                    "Detecting Fake Reviews of Hype About Restaurants by Sentiment Analysis.",
                    "Where to Find Help When You Are in an Emergency? - HelpMe: A Guidance System for Self-rescue.",
                    "Keyword-Based Semantic Analysis of Microblog for Public Opinion Study in Online Collective Behaviors.",
                    "Research on Reasoning Model of Firefighting and Rescue Cases.",
                    "Empirical Study of Online Public Opinion Index Prediction on Real Accidents Data.",
                    "Public Opinion Analysis and Crisis Response in Mass Incidents: A Case Study of a Flight Delay Event in China.",
                    "An Effective Method to Detect People in Danger.",
                    "Structured and Quantitative Research on Scenario of Firefighting and Rescue Cases.",
                    "A Cross-Reasoning Method for Scenario Awareness and Decision-Making Support in Earthquake Emergency Response.",
                    "PM2.5 Air Quality Index Prediction Using an Ensemble Learning Model.",
                    "Cloud Service-Oriented Modeling and Simulation of Regional Crowd Evacuation in Emergency.",
                    "Strategy Study on Mass Evacuation with LBS Information.",
                    "Online Social Network as a Powerful Tool to Identify Experts for Emergency Management.",
                    "Wear-Aware Algorithms for PCM-Based Database Buffer Pools.",
                    "Accelerate K-means Algorithm by Using GPU in the Hadoop Framework.",
                    "An Efficient Hybrid Index Structure for Temporal Marine Data.",
                    "On Massive Spatial Data Retrieval Based on Spark.",
                    "HDStore: An SSD/HDD Hybrid Distributed Storage Scheme for Large-Scale Data.",
                    "Rating Aware Route Planning in Road Networks.",
                    "Optimal RSUs Deployment in Vehicular Networks.",
                    "Cache-Aware Query Processing with User Privacy Protection in Location-Based Services.",
                    "A Review of Factors Affecting Recommender Decisions in Social Networks for Educational Purposes.",
                    "Exploring Arduino for Building Educational Context-Aware Recommender Systems that Deliver Affective Recommendations in Social Ubiquitous Networking Environments.",
                    "The Ethics of a Recommendation System.",
                    "The Negative Effects of 'Too Accurate' Recommendation Results: A Pilot Study of the Effects of Search Engine Overuse on Chinese Students.",
                    "Supporting Growers with Recommendations in RedVides: Some Human Aspects Involved.",
                    "Geographical Information in a Multi-domain Recommender System.",
                    "Hashtag Recommendation Based on User Tweet and Hashtag Classification on Twitter.",
                    "Business Ecosystem and Ecosystem of Big Data.",
                    "Using Big Data Strategy for the Development of the Communication Industry.",
                    "A Data Model for Object-Based Seamless Digital Map Using Digital Map 2.0.",
                    "Parallel Gene Clustering Using MapReduce.",
                    "An Efficient Patent Storing Mechanism Based on SQLite on Hadoop Platform.",
                    "Considering Rating as Probability Distribution of Attitude in Recommender System.",
                    "On Computing Similarity in Academic Literature Data: Methods and Evaluation.",
                    "Ranking People by Integrating Professional Capability, Sociability and Time Decaying Effect."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th WAIM 2013",
        "info": "Beidaihe, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2013",
                "sub_name": "Web-Age Information Management - 14th International Conference, WAIM 2013, Beidaihe, China, June 14-16, 2013. Proceedings.",
                "count": 85,
                "papers": [
                    "Frequent Subgraph Summarization with Error Control.",
                    "LSA-PTM: A Propagation-Based Topic Model Using Latent Semantic Analysis on Heterogeneous Information Networks.",
                    "Improving Semi-supervised Text Classification by Using Wikipedia Knowledge.",
                    "Time Series Representation: A Random Shifting Perspective.",
                    "Mining Frequent Itemsets from Sparse Data Streams in Limited Memory Environments.",
                    "Human Dynamics Revealed through Log Analytics in a Cloud Computing Environment.",
                    "Data Fusion: Resolving Conflicts from Multiple Sources.",
                    "Entity Resolution on Uncertain Relations.",
                    "Imputation for Categorical Attributes with Probabilistic Reasoning.",
                    "A New Approach to Identify Influential Spreaders in Complex Networks.",
                    "Presenting XML Schema Mapping with Conjunctive-Disjunctive Views.",
                    "An ETL Framework for Online Analytical Processing of Linked Open Data.",
                    "A Framework for Analyzing Monetary Cost of Database Systems in the Cloud.",
                    "Efficient Distributed Multi-dimensional Index for Big Data Management.",
                    "Fast Multi-fields Query Processing in Bigtable Based Cloud Systems.",
                    "ST-HBase: A Scalable Data Management System for Massive Geo-tagged Objects.",
                    "EasyControl: Improve Database Throughput under Overloading.",
                    "Combination of In-Memory Graph Computation with MapReduce: A Subgraph-Centric Method of PageRank.",
                    "A Human-Machine Method for Web Table Understanding.",
                    "Probabilistic k-Skyband Operator over Sliding Windows.",
                    "Saturn: A Fast Keyword kNN Search System in Road Networks.",
                    "Top-K Aggregate Queries on Continuous Probabilistic Datasets.",
                    "Shortest Path Finder with Light Materialized Path View for Location Based Services.",
                    "RUM+-tree: A New Multidimensional Index Supporting Frequent Updates.",
                    "Joint Clustering and Feature Selection.",
                    "A Self-Supervised Framework for Clustering Ensemble.",
                    "GCBN: A Hybrid Spatio-temporal Causal Model for Traffic Analysis and Prediction.",
                    "An Overlapped Community Partition Algorithm Based on Line Graph.",
                    "Distance-Based Feature Selection from Probabilistic Data.",
                    "Aspect-Specific Polarity-Aware Summarization of Online Reviews.",
                    "Fast Top-k Distance-Based Outlier Detection on Uncertain Data.",
                    "A Metric Learning Based Approach to Evaluate Task-Specific Time Series Similarity.",
                    "Using Coalitional Games to Detect Communities in Social Networks.",
                    "A Comparison Study of Clustering Models for Online Review Sentiment Analysis.",
                    "TopicDSDR: Combining Topic Decomposition and Data Reconstruction for Summarization.",
                    "CUVIM: Extracting Fresh Information from Social Network.",
                    "Comments-Oriented Document Summarization Based on Multi-aspect Co-feedback Ranking.",
                    "Image Annotation with Weak Labels.",
                    "Scan and Join Optimization by Exploiting Internal Parallelism of Flash-Based Solid State Drives.",
                    "MixSL: An Efficient Transaction Recovery Model in Flash-Based DBMS.",
                    "Keyword Oriented Bitmap Join Index for In-Memory Analytical Processing.",
                    "Can SSDs Help Reduce Random I/Os in Hash Joins?",
                    "An Index Model for Multitenant Data Storage in SaaS.",
                    "Reverse Top-k Group Nearest Neighbor Search.",
                    "Efficient Subsequence Search in Databases.",
                    "A Novel Data Broadcast Strategy for Traffic Information Query in the VANETs.",
                    "A Spatial Proximity Based Compression Method for GML Documents.",
                    "Efficient MSubtree Results Computation for XML Keyword Queries.",
                    "Measuring and Visualizing Interest Similarity between Microblog Users.",
                    "Correlation Range Query.",
                    "Real Time Event Detection in Twitter.",
                    "A Data Cleaning Framework Based on User Feedback.",
                    "Finding Critical Blocks of Information Diffusion in Social Networks.",
                    "Guide Query in Social Networks.",
                    "Probabilistic Graph Summarization.",
                    "Blind Chance: On Potential Trust Friends Query in Mobile Social Networks.",
                    "Sensitive Edges Protection in Social Networks.",
                    "Ontology-Based Semantic Search for Large-Scale RDF Data.",
                    "A Unified Generative Model for Characterizing Microblogs' Topics.",
                    "A Novel Model for Medical Image Similarity Retrieval.",
                    "Finding Similar Questions with Categorization Information and Dependency Syntactic Tree.",
                    "Ranking Web Pages by Associating Keywords with Locations.",
                    "Behavioral Consistency Measurement and Analysis of WS-BPEL Processes.",
                    "Efficient Complex Event Processing under Boolean Model.",
                    "Bounding Trust under Uncertain Topology Information in Reputation-Based Trust Systems.",
                    "A Novel Service Selection Based on Resource-Directive Decomposition.",
                    "Collaborative Filtering Based on Rating Psychology.",
                    "Modeling Semantic and Behavioral Relations for Query Suggestion.",
                    "Mining User Interest and Its Evolution for Recommendation on the Micro-blogging System.",
                    "Collaborative Filtering Using Multidimensional Psychometrics Model.",
                    "Incorporating Social Actions into Recommender Systems.",
                    "DiffR-Tree: A Differentially Private Spatial Index for OLAP Query.",
                    "K-core-preferred Attack to the Internet: Is It More Malicious Than Degree Attack?",
                    "Fuzzy Keyword Search over Encrypted Data in the Public Key Setting.",
                    "The Hardness of (ε, m)-anonymity.",
                    "Annotating Web Images by Combining Label Set Relevance with Correlation.",
                    "Clustering Analysis and Semantics Annotation of 3D Models Based on Users' Implicit Feedbacks.",
                    "bCATE: A Balanced Contention-Aware Transaction Execution Model for Highly Concurrent OLTP Systems.",
                    "Personalized News Recommendation Using Ontologies Harvested from the Web.",
                    "TinyQP: A Query Processing System in Wireless Sensor Networks.",
                    "CWePS: Chinese Web People Search.",
                    "CONCERT: A Concept-Centric Web News Recommendation System.",
                    "DOI Proxy Framework for Automated Entering and Validation of Scientific Papers.",
                    "Effectively Return Query Results for Keyword Search on XML Data.",
                    "BrackitMR: Flexible XQuery Processing in MapReduce."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2013w",
                "sub_name": "Web-Age Information Management - WAIM 2013 International Workshops: HardBD, MDSP, BigEM, TMSN, LQPM, BDMS, Beidaihe, China, June 14-16, 2013. Proceedings.",
                "count": 37,
                "papers": [
                    "Power Conservation in Large-Scale Storage Systems.",
                    "A Scalable, Continuously Available Database System Based on Commodity Hardware.",
                    "DL-Dedupe: Dual-Level Deduplication Scheme for Flash-Based SSDs.",
                    "SFCM: A SSD-Friendly Cache Management Policy for Hybrid Storage Systems.",
                    "HB-Storage: Optimizing SSDs with a HDD Write Buffer.",
                    "An Efficient Strategy of Building Distributed Index Based on Lucene.",
                    "Adaptive Sequential Prefetching for Multiple Streams.",
                    "Incremental Truth Discovery for Information from Multiple Data Sources.",
                    "Continuous, Online Anomaly Region Detection and Tracking in Networks.",
                    "Simdedup: A New Deduplication Scheme Based on Simhash.",
                    "InfoMall: A Large-Scale Storage System for Web Archiving.",
                    "Sequential Record Based Compression for Massive Image Storage in Database.",
                    "Research of Network Coding Data Collection Mechanism Based on the Rough Routing in Wireless Multi-hop Network.",
                    "Event Matching Algorithm to Collaborate Sensor Network and the Cloud through a Middleware Service.",
                    "An Efficient Map-Matching Mechanism for Emergency Scheduling and Commanding.",
                    "An Empirical Study of Information Diffusion in Micro-blogging Systems during Emergency Events.",
                    "Cluster-By: An Efficient Clustering Operator in Emergency Management Database Systems.",
                    "Multi-node Scheduling Algorithm Based on Clustering Analysis and Data Partitioning in Emergency Management Cloud.",
                    "Minimum-Delay POIs Coverage under Obstacle-Constraint in Emergency Management.",
                    "A cloud Computation Architecture for Unconventional Emergency Management.",
                    "Exploiting Content-Based Pub/Sub Systems for Event Detection in Emergency Management.",
                    "Webpage Mining for Inflation Emergency Early Warning.",
                    "Efficient Indexing of the Past, Present and Future Positions of Moving Objects on Road Network.",
                    "Skyline Query for Location-Based Recommendation in Mobile Application.",
                    "A Hierarchical 3D Spatial Model Based on User-Defined Data Types.",
                    "Data Interpolating over RFID Data Streams for Missed Readings.",
                    "A New Indexing Technique for Supporting By-attribute Membership Query of Multidimensional Data.",
                    "CorePeer: A P2P Mechanism for Hybrid CDN-P2P Architecture.",
                    "Extracting Prevalent Co-location Patterns from Historic Spatial Data.",
                    "Mining Co-locations from Spatially Uncertain Data with Probability Intervals.",
                    "A Hybrid Approach for Privacy Preservation in Location Based Queries.",
                    "Dynamic Table: A Scalable Storage Structure in the Cloud.",
                    "Reflection on the Popularity of MapReduce and Observation of Its Position in a Unified Big Data Platform.",
                    "Cleaning Missing Data Based on the Bayesian Network.",
                    "Stock Cloud Computing Platform: Architecture and Prototype Systems.",
                    "A Novel Method for Identifying Optimal Number of Clusters with Marginal Differential Entropy.",
                    "Threshold Selection for Classification with Skewed Class Distribution."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th WAIM 2012",
        "info": "Harbin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2012",
                "sub_name": "Web-Age Information Management - 13th International Conference, WAIM 2012, Harbin, China, August 18-20, 2012. Proceedings.",
                "count": 45,
                "papers": [
                    "Data Quality: Theory and Practice.",
                    "Construction of Web-Based, Service-Oriented Information Networks: A Data Mining Perspective - (Abstract).",
                    "Electronic Textbooks and Data Mining.",
                    "Topology-Based Data Compression in Wireless Sensor Networks.",
                    "A Residual Energy-Based Fairness Scheduling MAC Protocol for Wireless Sensor Networks.",
                    "Topology-Aided Geographic Routing Protocol for Wireless Sensor Networks.",
                    "Polaris: A Fingerprint-Based Localization System over Wireless Networks.",
                    "A High-Performance Algorithm for Frequent Itemset Mining.",
                    "Mining Link Patterns in Linked Data.",
                    "Detecting Positive Opinion Leader Group from Forum.",
                    "D'MART: A Tool for Building and Populating Data Warehouse Model from Existing Reports and Tables.",
                    "Continuous Skyline Queries with Integrity Assurance in Outsourced Spatial Databases.",
                    "Assessing Quality Values of Wikipedia Articles Using Implicit Positive and Negative Ratings.",
                    "Form-Based Instant Search and Query Autocompletion on Relational Data.",
                    "Range Query Estimation for Dirty Data Management System.",
                    "Top-k Most Incremental Location Selection with Capacity Constraint.",
                    "An Approach of Text-Based and Image-Based Multi-modal Search for Online Shopping.",
                    "Categorizing Search Results Using WordNet and Wikipedia.",
                    "Optimal Sequenced Route Query Algorithm Using Visited POI Graph.",
                    "A Packaging Approach for Massive Amounts of Small Geospatial Files with HDFS.",
                    "Adaptive Update Workload Reduction for Moving Objects in Road Networks.",
                    "An Adaptive Distributed Index for Similarity Queries in Metric Spaces.",
                    "Finding Relevant Tweets.",
                    "Fgram-Tree: An Index Structure Based on Feature Grams for String Approximate Search.",
                    "Efficient Processing of Updates in Dynamic Graph-Structured XML Data.",
                    "Extracting Focused Time for Web Pages.",
                    "Top-Down SLCA Computation Based on Hash Search.",
                    "Top-K Graph Pattern Matching: A Twig Query Approach.",
                    "Dynamic Graph Shortest Path Algorithm.",
                    "A Framework for High-Quality Clustering Uncertain Data Stream over Sliding Windows.",
                    "Bayesian Network Structure Learning from Attribute Uncertain Data.",
                    "Bandwidth-Aware Medical Image Retrieval in Mobile Cloud Computing Network.",
                    "Efficient Algorithms for Constrained Subspace Skyline Query in Structured Peer-to-Peer Systems.",
                    "Processing All k-Nearest Neighbor Queries in Hadoop.",
                    "RGH: An Efficient RSU-Aided Group-Based Hierarchical Privacy Enhancement Protocol for VANETs.",
                    "Locating Encrypted Data Precisely without Leaking Their Distribution.",
                    "LB-Logging: A Highly Efficient Recovery Technique for Flash-Based Database.",
                    "An Under-Sampling Approach to Imbalanced Automatic Keyphrase Extraction.",
                    "A Tourist Itinerary Planning Approach Based on Ant Colony Algorithm.",
                    "A Transparent Approach for Database Schema Evolution Using View Mechanism.",
                    "WYSIWYE: An Algebra for Expressing Spatial and Textual Rules for Information Extraction.",
                    "A Scalable Algorithm for Detecting Community Outliers in Social Networks.",
                    "An Efficient Index for Top-k Keyword Search on Social Networks.",
                    "Engineering Pathway for User Personal Knowledge Recommendation.",
                    "Pick-Up Tree Based Route Recommendation from Taxi Trajectories."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th WAIM 2011",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2011",
                "sub_name": "Web-Age Information Management - 12th International Conference, WAIM 2011, Wuhan, China, September 14-16, 2011. Proceedings.",
                "count": 55,
                "papers": [
                    "Analytics for Info-plosion Including Information Diffusion Studies for the 3.11 Disaster.",
                    "Using the Web for Collaborative Language Learning and Teaching.",
                    "Data-Driven Modeling and Analysis of Online Social Networks.",
                    "Efficient Filter Algorithms for Reverse k-Nearest Neighbor Query.",
                    "Keyword Query Cleaning with Query Logs.",
                    "A Self-adaptive Cross-Domain Query Approach on the Deep Web.",
                    "SPARQL Query Answering with RDFS Reasoning on Correlated Probabilistic Data.",
                    "Probabilistic Threshold Join over Distributed Uncertain Data.",
                    "Bayesian Classifiers for Positive Unlabeled Learning.",
                    "Measuring Social Tag Confidence: Is It a Good or Bad Tag?",
                    "A New Vector Space Model Exploiting Semantic Correlations of Social Annotations for Web Page Clustering.",
                    "A Generalization Based Approach for Anonymizing Weighted Social Network Graphs.",
                    "Incremental Reasoning over Multiple Ontologies.",
                    "General-Purpose Ontology Enrichment from the WWW.",
                    "QuerySem: Deriving Query Semantics Based on Multiple Ontologies.",
                    "Getting Critical Categories of a Data Set.",
                    "MFCluster: Mining Maximal Fault-Tolerant Constant Row Biclusters in Microarray Dataset.",
                    "Expansion Finding for Given Acronyms Using Conditional Random Fields.",
                    "Leveraging Communication Information among Readers for RFID Data Cleaning.",
                    "Web Article Quality Assessment in Multi-dimensional Space.",
                    "DRScribe: An Improved Topic-Based Publish-Subscribe System with Dynamic Routing.",
                    "An Efficient Quad-Tree Based Index Structure for Cloud Data Management.",
                    "Efficient Duplicate Detection on Cloud Using a New Signature Scheme.",
                    "A Secure and Efficient Role-Based Access Policy towards Cryptographic Cloud Storage.",
                    "Tagging Image by Exploring Weighted Correlation between Visual Features and Tags.",
                    "Credibility-Oriented Ranking of Multimedia News Based on a Material-Opinion Model.",
                    "Actions in Still Web Images: Visualization, Detection and Retrieval.",
                    "Social Analytics for Personalization in Work Environments.",
                    "Finding Appropriate Experts for Collaboration.",
                    "Location Privacy Protection in the Presence of Users' Preferences.",
                    "Layered Graph Data Model for Data Management of DataSpace Support Platform.",
                    "A Study of RDB-Based RDF Data Management Techniques.",
                    "Requirement-Based Query and Update Scheduling in Real-Time Data Warehouses.",
                    "Answering Subgraph Queries over Large Graphs.",
                    "Finding Relevant Papers Based on Citation Relations.",
                    "ASAP : Towards Accurate, Stable and Accelerative Penetrating-Rank Estimation on Large Graphs.",
                    "Efficient Name Disambiguation in Digital Libraries.",
                    "A Classification Framework for Disambiguating Web People Search Result Using Feedback.",
                    "Incorporating User Feedback into Name Disambiguation of Scientific Cooperation Network.",
                    "Multi-core vs. I/O Wall: The Approaches to Conquer and Cooperate.",
                    "W-Order Scan: Minimizing Cache Pollution by Application Software Level Cache Management for MMDB.",
                    "Index Structure for Cross-Class Query in Object Deputy Database.",
                    "Ensemble Pruning via Base-Classifier Replacement.",
                    "Efficient Approximate Similarity Search Using Random Projection Learning.",
                    "Informed Prediction with Incremental Core-Based Friend Cycle Discovering.",
                    "Early Prediction of Temporal Sequences Based on Information Transfer.",
                    "Mining Event Temporal Boundaries from News Corpora through Evolution Phase Discovery.",
                    "Event Detection over Live and Archived Streams.",
                    "Renda-RX: A Benchmark for Evaluating XML-Relational Database System.",
                    "Energy-Conserving Fragment Methods for Skewed XML Data Access in Push-Based Broadcast.",
                    "Evaluating Probabilistic Spatial-Range Closest Pairs Queries over Uncertain Objects.",
                    "Synthesizing Routes for Low Sampling Trajectories with Absorbing Markov Chains.",
                    "Approximate Continuous K-Nearest Neighbor Queries for Uncertain Objects in Road Networks.",
                    "Parallel Detection of Temporal Events from Streaming Data.",
                    "Towards Effective Event Detection, Tracking and Summarization on Microblog Data."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2011w",
                "sub_name": "Web-Age Information Management - WAIM 2011 International Workshops: WGIM 2011, XMLDM 2011, SNA 2011, Wuhan, China, September 14-16, 2011, Revised Selected Papers.",
                "count": 20,
                "papers": [
                    "Enhancing the Quality of Place Resources in Geo-folksonomies.",
                    "Generating Semantic-Based Trajectories for Indoor Moving Objects.",
                    "HTPR*-Tree: An Efficient Index for Moving Objects to Support Predictive Query and Partial History Query.",
                    "Developing Rich Web GIS Applications for Visual Analytics.",
                    "Single-Source Multi-Target A* Algorithm for POI Queries on Road Network.",
                    "Combining Top-k Query in Road Networks.",
                    "Extracting Focused Locations for Web Pages.",
                    "Searching Similar Trajectories in Real Time: An Effectiveness and Efficiency Study.",
                    "Multidimensional Implementation of Stream ADT.",
                    "Measuring XML Structured-ness with Entropy.",
                    "Similarity Join on XML Based on k-Generation Set Distance.",
                    "XML Query Processing Using Views.",
                    "XIO-SLCA: Optimize SLCA for Effective Keyword Search in XML Documents.",
                    "The Development of XML Stored Procedures in XML Enabled Databases.",
                    "A Slope One Collaborative Filtering Recommendation Algorithm Using Uncertain Neighbors Optimizing.",
                    "A Social Reputation Management for Web Communities.",
                    "A Collaborative Filtering Recommendation System by Unifying User Similarity and Item Similarity.",
                    "Supporting Query over Dynamic Combination of Data Sources for Social Media.",
                    "Detecting Opinion Leader Dynamically in Chinese News Comments.",
                    "An Approach of Semi-automatic Public Sentiment Analysis for Opinion and District."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th WAIM 2010",
        "info": "Jiuzhaigou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2010",
                "sub_name": "Web-Age Information Management, 11th International Conference, WAIM 2010, Jiuzhaigou, China, July 15-17, 2010. Proceedings.",
                "count": 73,
                "papers": [
                    "Analyzing Data Quality Using Data Auditor.",
                    "Rebuilding the World from Views.",
                    "Approximate Query Processing in Sensor Networks.",
                    "Duplicate Identification in Deep Web Data Integration.",
                    "Learning to Detect Web Spam by Genetic Programming.",
                    "Semantic Annotation of Web Objects Using Constrained Conditional Random Fields.",
                    "Time Graph Pattern Mining for Web Analysis and Information Retrieval.",
                    "FISH: A Novel Peer-to-Peer Overlay Network Based on Hyper-deBruijn.",
                    "Continuous Summarization of Co-evolving Data in Large Water Distribution Network.",
                    "Proactive Replication and Search for Rare Objects in Unstructured Peer-to-Peer Networks.",
                    "SWORDS: Improving Sensor Networks Immunity under Worm Attacks.",
                    "Efficient Multiple Objects-Oriented Event Detection Over RFID Data Streams.",
                    "CW2I: Community Data Indexing for Complex Query Processing.",
                    "Clustering Coefficient Queries on Massive Dynamic Social Networks.",
                    "Predicting Best Answerers for New Questions in Community Question Answering.",
                    "Semantic Grounding of Hybridization for Tag Recommendation.",
                    "Rich Ontology Extraction and Wikipedia Expansion Using Language Resources.",
                    "Fine-Grained Cloud DB Damage Examination Based on Bloom Filters.",
                    "XML Structural Similarity Search Using MapReduce.",
                    "Comparing Hadoop and Fat-Btree Based Access Method for Small File I/O Applications.",
                    "Mining Contrast Inequalities in Numeric Dataset.",
                    "Users' Book-Loan Behaviors Analysis and Knowledge Dependency Mining.",
                    "An Extended Predictive Model Markup Language for Data Mining.",
                    "A Cross-Media Method of Stakeholder Extraction for News Contents Analysis.",
                    "An Efficient Approach for Mining Segment-Wise Intervention Rules in Time-Series Streams.",
                    "Automated Recognition of Sequential Patterns in Captured Motion Streams.",
                    "Online Pattern Aggregation over RFID Data Streams.",
                    "Cleaning Uncertain Streams by Parallelized Probabilistic Graphical Models.",
                    "Taming Computational Complexity: Efficient and Parallel SimRank Optimizations on Undirected Graphs.",
                    "DSI: A Method for Indexing Large Graphs Using Distance Set.",
                    "K-Radius Subgraph Comparison for RDF Data Cleansing.",
                    "A Novel Framework for Processing Continuous Queries on Moving Objects.",
                    "Group Visible Nearest Neighbor Queries in Spatial Databases.",
                    "iPoc: A Polar Coordinate Based Indexing Method for Nearest Neighbor Search in High Dimensional Space.",
                    "Join Directly on Heavy-Weight Compressed Data in Column-Oriented Database.",
                    "Exploiting Service Context for Web Service Search Engine.",
                    "Building Business Intelligence Applications Having Prescriptive and Predictive Capabilities.",
                    "FileSearchCube: A File Grouping Tool Combining Multiple Types of Interfile-Relationships.",
                    "Trustworthy Information: Concepts and Mechanisms.",
                    "How to Design Kansei Retrieval Systems?",
                    "Detecting Hot Events from Web Search Logs.",
                    "Evaluating Truthfulness of Modifiers Attached to Web Entity Names.",
                    "Searching the Web for Alternative Answers to Questions on WebQA Sites.",
                    "Domain-Independent Classification for Deep Web Interfaces.",
                    "Data Selection for Exact Value Acquisition to Improve Uncertain Clustering.",
                    "Exploring the Sentiment Strength of User Reviews.",
                    "Semantic Entity Detection by Integrating CRF and SVM.",
                    "An Incremental Method for Causal Network Construction.",
                    "DCUBE: CUBE on Dirty Databases.",
                    "An Algorithm for Incremental Maintenance of Materialized XPath View.",
                    "Query Processing in INM Database System.",
                    "Fragile Watermarking for Color Image Recovery Based on Color Filter Array Interpolation.",
                    "A Hybrid-Feature-Based Efficient Retrieval over Chinese Calligraphic Manuscript Image Repository.",
                    "Efficient Filtering of XML Documents with XPath Expressions Containing Ancestor Axis.",
                    "ACAR: An Adaptive Cost Aware Cache Replacement Approach for Flash Memory.",
                    "GPU-Accelerated Predicate Evaluation on Column Store.",
                    "MOSS-DB: A Hardware-Aware OLAP Database.",
                    "Efficient Duplicate Record Detection Based on Similarity Estimation.",
                    "A Novel Composite Kernel for Finding Similar Questions in CQA Services.",
                    "Efficient Similarity Query in RFID Trajectory Databases.",
                    "Context-Aware Basic Level Concepts Detection in Folksonomies.",
                    "Extracting 5W1H Event Semantic Elements from Chinese Online News.",
                    "Automatic Domain Terminology Extraction Using Graph Mutual Reinforcement.",
                    "Semi-supervised Learning from Only Positive and Unlabeled Data Using Entropy.",
                    "Margin Based Sample Weighting for Stable Feature Selection.",
                    "Associative Classifier for Uncertain Data.",
                    "Automatic Multi-schema Integration Based on User Preference.",
                    "EIF: A Framework of Effective Entity Identification.",
                    "A Multilevel and Domain-Independent Duplicate Detection Model for Scientific Database.",
                    "Generalized UDF for Analytics Inside Database Engine.",
                    "Efficient Continuous Top-k Keyword Search in Relational Databases.",
                    "V Locking Protocol for Materialized Aggregate Join Views on B-Tree Indices.",
                    "Web Information Credibility."
                ]
            },
            {
                "sub_name_abbr": "conf/waim/2010w",
                "sub_name": "Web-Age Information Management - WAIM 2010 International Workshops: IWGD 2010, XMLDM 2010, WCMT 2010, Jiuzhaigou Valley, China, July 15-17, 2010, Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "Mining Graphs with Constraints on Symmetry and Diameter.",
                    "Graph Partitioning Strategies for Efficient BFS in Shared-Nothing Parallel Systems.",
                    "HyperGraphDB: A Generalized Graph Database.",
                    "Survey of Graph Database Performance on the HPC Scalable Graph Analysis Benchmark.",
                    "A Model for Automatic Generation of Multi-partite Graphs from Arbitrary Data.",
                    "A Fast Two-Stage Algorithm for Computing SimRank and Its Extensions.",
                    "Hotspot District Trajectory Prediction.",
                    "Effective XML Keyword Search through Valid Lowest Information Unit.",
                    "Reducing Redundancy of XPath Query over Networks by Transmitting XML Views.",
                    "Building Web Application with XQuery.",
                    "Functional Dependencies for XML.",
                    "Structure and Content Similarity for Clustering XML Documents.",
                    "pq-Hash: An Efficient Method for Approximate XML Joins.",
                    "TwigLinkedList: Improvement of TwigList.",
                    "Compression Algorithms for Structural Query Results on XML Data.",
                    "SeCCX: Semantics-Based Fine Granular Concurrency Control for XML Data.",
                    "XRCJ: Supporting Keyword Search in XML and Relation Co-occurrence.",
                    "Formal Verification of Stochastic Timing Behavior in Web-Based Business Process Collaboration.",
                    "An Efficient Blind Ring Signature Scheme without Pairings.",
                    "Improving the Throughput of Wireless Mesh Networks for Web Services.",
                    "Author Name Disambiguation for Citations on the Deep Web.",
                    "Approximate Content Summary for Database Selection in Deep Web Data Integration.",
                    "Detecting Comment Spam through Content Analysis.",
                    "Enriching the Contents of Enterprises' Wiki Systems with Web Information.",
                    "Query Processing with Materialized Views in a Traceable P2P Record Exchange Framework."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10th WAIM/APWeb 2009",
        "info": "Suzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2009",
                "sub_name": "Advances in Data and Web Management, Joint International Conferences, APWeb/WAIM 2009, Suzhou, China, April 2-4, 2009, Proceedings.",
                "count": 70,
                "papers": [
                    "Distributed XML Processing.",
                    "Towards Multi-modal Extraction and Summarization of Conversations.",
                    "Simple but Effective Porn Query Recognition by k-NN with Semantic Similarity Measure.",
                    "Selective-NRA Algorithms for Top-k Queries.",
                    "Continuous K-Nearest Neighbor Query over Moving Objects in Road Networks.",
                    "Data Quality Aware Queries in Collaborative Information Systems.",
                    "Probabilistic Threshold Range Aggregate Query Processing over Uncertain Data.",
                    "Dynamic Data Migration Policies for Query-Intensive Distributed Data Environments.",
                    "C-Tree Indexing for Holistic Twig Joins.",
                    "Processing XML Keyword Search by Constructing Effective Structured Queries.",
                    "Representing Multiple Mappings between XML and Relational Schemas for Bi-directional Query Translation.",
                    "Finding Irredundant Contained Rewritings of Tree Pattern Queries Using Views.",
                    "IRank: A Term-Based Innovation Ranking System for Conferences and Scholars.",
                    "A Generalized Topic Modeling Approach for Maven Search.",
                    "Topic and Viewpoint Extraction for Diversity and Bias Analysis of News Contents.",
                    "Topic-Level Random Walk through Probabilistic Model.",
                    "Query-Focused Summarization by Combining Topic Model and Affinity Propagation.",
                    "Rank Aggregation to Combine QoS in Web Search.",
                    "Personalized Delivery of On-Line Search Advertisement Based on User Interests.",
                    "Automatic Web Image Annotation via Web-Scale Image Semantic Space Learning.",
                    "Representing and Inferring Causalities among Classes of Multidimensional Data.",
                    "Efficient Incremental Computation of CUBE in Multiple Versions What-If Analysis.",
                    "Incremental Computation for MEDIAN Cubes in What-If Analysis.",
                    "The Tradeoff of Delta Table Merging and Re-writing Algorithms in What-If Analysis Application.",
                    "Efficiently Clustering Probabilistic Data Streams.",
                    "Detecting Abnormal Trend Evolution over Multiple Data Streams.",
                    "Mining Interventions from Parallel Event Sequences.",
                    "Effective Similarity Analysis over Event Streams Based on Sharing Extent.",
                    "A Term-Based Driven Clustering Approach for Name Disambiguation.",
                    "Sentiment Clustering: A Novel Method to Explore in the Blogosphere.",
                    "Kernel-Based Transductive Learning with Nearest Neighbors.",
                    "An Improved Algorithm for Mining Non-Redundant Interacting Feature Subsets.",
                    "AutoPCS: A Phrase-Based Text Categorization System for Similar Texts.",
                    "A Probabilistic Approach for Mining Drifting User Interest.",
                    "Temporal Company Relation Mining from the Web.",
                    "StreetTiVo: Using a P2P XML Database System to Manage Multimedia Data in Your Living Room.",
                    "Qualitative Spatial Representation and Reasoning for Data Integration of Ocean Observational Systems.",
                    "Managing Hierarchical Information on Small Screens.",
                    "An Approach to Detect Collaborative Conflicts for Ontology Development.",
                    "Using Link-Based Content Analysis to Measure Document Similarity Effectively.",
                    "Parallel Load Balancing Strategies for Tree-Structured Peer-to-Peer Networks.",
                    "A Verification Mechanism for Secured Message Processing in Business Collaboration.",
                    "Semantic Service Discovery by Consistency-Based Matchmaking.",
                    "A Fast Heuristic Algorithm for the Composite Web Service Selection.",
                    "Intervention Events Detection and Prediction in Data Streams.",
                    "New Balanced Data Allocating and Online Migrating Algorithms in Database Cluster.",
                    "An Evaluation of Real-Time Transaction Services in Web Services E-Business Systems.",
                    "Formal Definition and Detection Algorithm for Passive Event in RFID Middleware.",
                    "Distributed Benchmarking of Relational Database Systems.",
                    "Optimizing Many-to-Many Data Aggregation in Wireless Sensor Networks.",
                    "Bag of Timestamps: A Simple and Efficient Bayesian Chronological Mining.",
                    "Efficient Hybrid Password-Based Authenticated Group Key Exchange.",
                    "Optimal K-Nearest-Neighbor Query in Data Grid.",
                    "A Routing Scheme with Localized Movement in Event-Driven Wireless Sensor Networks.",
                    "Short Text Clustering for Search Results.",
                    "Load Shedding for Shared Window Join over Real-Time Data Streams.",
                    "A Sliding-Window Approach for Finding Top-k Frequent Itemsets from Uncertain Streams.",
                    "A Novel ID-Based Anonymous Signcryption Scheme.",
                    "Pseudo Period Detection on Time Series Stream with Scale Smoothing.",
                    "An Affinity Path Based Wireless Broadcast Scheduling Approach for Multi-item Queries.",
                    "Lightweight Data Mining Based Database System Self-optimization: A Case Study.",
                    "Efficient Detection of Discords for Time Series Stream.",
                    "SLICE: A Novel Method to Find Local Linear Correlations by Constructing Hyperplanes.",
                    "Complete and Equivalent Query Rewriting Using Views.",
                    "Grubber: Allowing End-Users to Develop XML-Based Wrappers for Web Data Sources.",
                    "Performance Analysis of Group Handover Scheme for IEEE 802.16j-Enabled Vehicular Networks.",
                    "Directly Identify Unexpected Instances in the Test Set by Entropy Maximization.",
                    "Decentralized Orchestration of BPEL Processes with Execution Consistency.",
                    "Let Wiki Be More Powerful and Suitable for Enterprises with External Program.",
                    "DepRank: A Probabilistic Measure of Dependence via Heterogeneous Links."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2009w",
                "sub_name": "Advances in Web and Network Technologies, and Information Management, APWeb/WAIM 2009 International Workshops: WCMT 2009, RTBI 2009, DBIR-ENQOIR 2009, PAIS 2009, Suzhou, China, April 2-4, 2009, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "ScaMMDB: Facing Challenge of Mass Data Processing with MMDB.",
                    "A Data Distribution Strategy for Scalable Main-Memory Database.",
                    "Temporal Restriction Query Optimization for Event Stream Processing.",
                    "Video Object Segmentation Based on Disparity.",
                    "A Database Approach for Accelerate Video Data Access.",
                    "Medical Image Retrieval in Private Network Based on Dynamic Fuzzy Data Model and Wavelet Entropy.",
                    "Extension of OWL with Dynamic Fuzzy Logic.",
                    "ADEB: A Dynamic Alert Degree Evaluation Model for Blogosphere.",
                    "Data Warehouse Based Approach to the Integration of Semi-structured Data.",
                    "Towards Faceted Search for Named Entity Queries.",
                    "A Petri-Net-Based Approach to QoS Estimation of Web Service Choreographies.",
                    "Personalization Service Research of the E-Learning System Based on Clustering Coefficient Partition Algorithm.",
                    "Automatic Generation of Processes Based on Processes Semantic for Smartflow Pattern.",
                    "Easy Flow: New Generation Business Process Model.",
                    "User Feedback for Improving Question Categorization in Web-Based Question Answering Systems.",
                    "XTree: A New XML Keyword Retrieval Model.",
                    "Effective Top-k Keyword Search in Relational Databases Considering Query Semantics.",
                    "A Grid Index Based Method for Continuous Constrained Skyline Query over Data Stream.",
                    "Ontology Personalization: An Approach Based on Conceptual Prototypicality.",
                    "Ontology Evaluation through Text Classification.",
                    "Core-Tag Clustering for Web 2.0 Based on Multi-similarity Measurements.",
                    "Meta Galaxy: A Flexible and Efficient Cube Model for Data Retrieval in OLAP."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9th WAIM 2008",
        "info": "Zhangjiajie, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2008",
                "sub_name": "The Ninth International Conference on Web-Age Information Management, WAIM 2008, July 20-22, 2008, Zhangjiajie, China.",
                "count": 96,
                "papers": [
                    "LG-ERM: An Entity-Level Ranking Mechanism for Deep Web Query.",
                    "Weighting Links Using Lexical and Positional Analysis in Web Ranking.",
                    "Approximate Boolean + Ranking Query Answering Using Wavelets.",
                    "S-BITS : Social-Bookmarking Induced Topic Search.",
                    "LCA-Based Keyword Search for Effectively Retrieving \"Information Unit\" from Web Pages.",
                    "Path Similarity Based Directory Ontology Matching.",
                    "Using Ontology to Enhance Collaborative Recommendation Based on Community.",
                    "Analyzing Distribution and Evolution of Research Interests by Term Extraction and Ontology Learning.",
                    "Approach to the Formal Representation of OWL-S Ontology Maintenance Requirements.",
                    "System II: A Native RDF Repository Based on the Hypergraph Representation for RDF Data Model.",
                    "Parallel Structural Join Algorithm on Shared-Memory Multi-Core Systems.",
                    "In-Network Execution of External Join for Sensor Networks.",
                    "LOB: Bucket Based Index for Range Queries.",
                    "A New Dynamic Hash Index for Flash-Based Storage.",
                    "Efficient k-Closest-Pair Range-Queries in Spatial Databases.",
                    "Exploiting Path Information for Syntax-Based XML Subtree Matching in RDBs.",
                    "SIMP: Efficient XML Structural Index for Multiple Query Processing.",
                    "An Efficient Structural Index for Branching Path Queries.",
                    "Effective Indices for Efficient Approximate String Search and Similarity Join.",
                    "Efficient Processing of Complex Twig Pattern Matching.",
                    "Exploiting Application Semantics in Monitoring Real-Time Data Streams.",
                    "Approximate Validity of XML Streaming Data.",
                    "Cost-Efficient Processing of Continuous Extreme Queries over Distributed Data Streams.",
                    "Advanced Star Coordinates.",
                    "QoS-Aware Scheduling of Web Services.",
                    "Modeling and Reasoning about Semantic Web Services Contract Using Description Logic.",
                    "Modeling and Service Capability Evaluation for RFID Complex Event Processing.",
                    "Research on Web-Based Multi-Agent System for Aeroengine Fault Diagnosis.",
                    "An Algorithm for Classifying Articles and Patent Documents Using Link Structure.",
                    "Automatic Web Query Classification Using Large Unlabeled Web Pages.",
                    "Self-Switching Classification Framework for Titled Documents.",
                    "Subject-Oriented Classification Based on Scale Probing in the Deep Web.",
                    "Towards Efficient and Flexible KNN Query Processing in Real-Life Road Networks.",
                    "Continuous Reverse Nearest Neighbor Queries on Moving Objects in Road Networks.",
                    "Evaluation of a Stream of Top-N Selection Queries in Relational Databases.",
                    "A Cost-Efficient Method for Continuous Top-k Processing over Data Stream.",
                    "A Query Dependent Approach to Learning to Rank for Information Retrieval.",
                    "PerRank: Personalized Rank Retrieval with Categorical and Numerical Attributes.",
                    "Categorizing Queries by Topic Directory.",
                    "A New Performance Benchmark for Content-Based 3D Model Retrieval.",
                    "Expertise Search in a Time-Varying Social Network.",
                    "REC: A Novel Model to Rank Experts in Communities.",
                    "Recommendation over a Heterogeneous Social Network.",
                    "Co-Clustering Tags and Social Data Sources.",
                    "Set-Expression Based Method for Effective Privacy Preservation.",
                    "A New Approach for Detecting Anonymity of Patterns.",
                    "A Personalized (a, k)-Anonymity Model.",
                    "Scientific Workflow Provenance Querying with Security Views.",
                    "Name Disambiguation Using Atomic Clusters.",
                    "Fuzzy K-Means with Variable Weighting in High Dimensional Data Analysis.",
                    "Outlier Detection for Transaction Databases Using Association Rules.",
                    "Scalable Community Discovery of Large Networks.",
                    "PLEDS: A Personalized Entity Detection System Based on Web Log Mining Techniques.",
                    "Temperature-Aware Scheduling: When is System-Throttling Good Enough?",
                    "Managing Uncertain Data: Probabilistic Approaches.",
                    "Finding Correlated Item Pairs through Efficient Pruning with a Given Threshold.",
                    "Co-Occurring Patterns of Amino Acid Physicochemical Properties in Proteins.",
                    "COCA: More Accurate Multidimensional Histograms out of More Accurate Correlations Detection.",
                    "Research on Malicious Transaction Processing Method of Database System.",
                    "Research on Communication-Efficient Method for Distributed Threshold Monitoring.",
                    "Reducing Data Decryption Cost by Broadcast Encryption and Account Assignment for Web Applications.",
                    "Churn Impact on Replicated Data Duration in Structured P2P Networks.",
                    "An Adaptive User Profile Based on Memory Model.",
                    "PEDS-VM: A Variation Management Prototype for Pattern Evolving Data Streams.",
                    "A Publicly Verifiable Dynamic Sharing Protocol for Data Secure Storage.",
                    "PASE: A Prototype for Ad-hoc Process-Aware Information System Declaratively Constructing Environment.",
                    "A Survey of Alert Fusion Techniques for Security Incident.",
                    "A Survey of Secure Routing in Ad Hoc Networks.",
                    "An Admission Control Policy Based on Social Networks for P2P Systems.",
                    "Protecting Mobile Codes Using the Decentralized Label Model.",
                    "AMCAS: An Automatic Malicious Code Analysis System.",
                    "A Scalable Framework of Network Traffic Identification.",
                    "Counting Data Stream Based on Improved Counting Bloom Filter.",
                    "Optimizing Traffic Classification Using Hybrid Feature Selection.",
                    "Design and Implementation of Multi-Version Disk Backup Data Merging Algorithm.",
                    "Network Dynamic Risk Assessment Based on the Threat Stream Analysis.",
                    "Accelerating Multiple String Matching by Using Cache-Efficient Strategy.",
                    "Methodology of Network Intrusion Detection System Penetration Testing.",
                    "Network Security Analysis Based on Security Status Space.",
                    "A Quasi Word-Based Compression Method of English Text Using Byte-Oriented Coding Scheme.",
                    "Research on Web QoS Control Strategy Based on User Behaviour.",
                    "Component Based Context Model.",
                    "A New Database Adaptive Buffer Replacement Algorithm Based on Call Graph Optimization.",
                    "Controlling Information Leakage of Fine-Grained Access Model in DBMSs.",
                    "DTAD: A Dynamic Taint Analysis Detector for Information Security.",
                    "A Kind of Formal Modelling for Network Security Situational Awareness Based on HMM.",
                    "An Efficient Algorithm of Role Mapping across Security Domains in Data-Sharing Environments.",
                    "An Improved Method of Hybrid Worm Simulation.",
                    "A New-Style Domain Integrating Management of Windows and UNIX.",
                    "A Prediction Model of DoS Attack's Distribution Discrete Probability.",
                    "SOA-Based Service Recovery Framework.",
                    "A Strategy Selection Model for Network Survivability Based on Fuzzy Matrix Game.",
                    "Measuring Network Vulnerability Based on Pathology.",
                    "Data-Flow Based Analysis of Java Bytecode Vulnerability.",
                    "ASG Automated Signature Generation for Worm-Like P2P Traffic Patterns.",
                    "Research of a Secure File System for Protection of Intellectual Property Right."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th WAIM/APWeb 2007",
        "info": "Huang Shan (Yellow Mountain), China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2007",
                "sub_name": "Advances in Data and Web Management, Joint 9th Asia-Pacific Web Conference, APWeb 2007, and 8th International Conference, on Web-Age Information Management, WAIM 2007, Huang Shan, China, June 16-18, 2007, Proceedings.",
                "count": 91,
                "papers": [
                    "Data Mining Using Fractals and Power Laws.",
                    "Exploring the Power of Links in Data Mining.",
                    "Community Systems: The World Online.",
                    "A New DBMS Architecture for DB-IR Integration.",
                    "Study on Efficiency and Effectiveness of KSORD.",
                    "Discovering Web Services Based on Probabilistic Latent Factor Model.",
                    "SCORE: Symbiotic Context Oriented Information Retrieval.",
                    "Process Aware Information Systems: A Human Centered Perspective.",
                    "IMCS: Incremental Mining of Closed Sequential Patterns.",
                    "Mining Time-Shifting Co-regulation Patterns from Gene Expression Data.",
                    "Tight Correlated Item Sets and Their Efficient Discovery.",
                    "Improved Prediction of Protein Secondary Structures Using Adaptively Weighted Profiles.",
                    "Framework for Building a High-Quality Web Page Collection Considering Page Group Structure.",
                    "Multi-document Summarization Using Weighted Similarity Between Topic and Clustering-Based Non-negative Semantic Feature.",
                    "A Fair Load Balancing Algorithm for Hypercube-Based DHT Networks.",
                    "LINP: Supporting Similarity Search in Unstructured Peer-to-Peer Networks.",
                    "Generation and Matching of Ontology Data for the Semantic Web in a Peer-to-Peer Framework.",
                    "Energy-Efficient Skyline Queries over Sensor Network Using Mapped Skyline Filters.",
                    "An Adaptive Dynamic Cluster-Based Protocol for Target Tracking in Wireless Sensor Networks.",
                    "Distributed, Hierarchical Clustering and Summarization in Sensor Networks.",
                    "A New Similarity Measure for Near Duplicate Video Clip Detection.",
                    "Efficient Algorithms for Historical Continuous k NN Query Processing over Moving Object Trajectories.",
                    "Effective Density Queries for Moving Objects in Road Networks.",
                    "An Efficient Spatial Search Method Based on SG-Tree.",
                    "Getting Qualified Answers for Aggregate Queries in Spatio-temporal Databases.",
                    "Dynamic Adaptation Strategies for Long-Term and Short-Term User Profile to Personalize Search.",
                    "Using Structured Tokens to Identify Webpages for Data Extraction.",
                    "Honto? Search: Estimating Trustworthiness of Web Information by Search Results Aggregation and Temporal Analysis.",
                    "A Probabilistic Reasoning Approach for Discovering Web Crawler Sessions.",
                    "An Exhaustive and Edge-Removal Algorithm to Find Cores in Implicit Communities.",
                    "Active Rules Termination Analysis Through Conditional Formula Containing Updatable Variable.",
                    "Computing Repairs for Inconsistent XML Document Using Chase.",
                    "An XML Publish/Subscribe Algorithm Implemented by Relational Operators.",
                    "Retrieving Arbitrary XML Fragments from Structured Peer-to-Peer Networks.",
                    "Combining Smooth Graphs with Semi-supervised Learning.",
                    "Extracting Trend of Time Series Based on Improved Empirical Mode Decomposition Method.",
                    "Spectral Edit Distance Method for Image Clustering.",
                    "Mining Invisible Tasks from Event Logs.",
                    "The Selection of Tunable DBMS Resources Using the Incremental/Decremental Relationship.",
                    "Hyperclique Pattern Based Off-Topic Detection.",
                    "An Energy Efficient Connected Coverage Protocol in Wireless Sensor Networks.",
                    "A Clustered Routing Protocol with Distributed Intrusion Detection for Wireless Sensor Networks.",
                    "Continuous Approximate Window Queries in Wireless Sensor Networks.",
                    "A Survey of Job Scheduling in Grids.",
                    "Relational Nested Optional Join for Efficient Semantic Web Query Processing.",
                    "Efficient Processing of Relational Queries with Sum Constraints.",
                    "A Theoretical Framework of Natural Computing - M Good Lattice Points (GLP) Method.",
                    "Building Data Synopses Within a Known Maximum Error Bound.",
                    "Exploiting the Structure of Update Fragments for Efficient XML Index Maintenance.",
                    "Improvements of HITS Algorithms for Spam Links.",
                    "Efficient Keyword Search over Data-Centric XML Documents.",
                    "Promotional Ranking of Search Engine Results: Giving New Web Pages a Chance to Prove Their Values.",
                    "Adaptive Scheduling Strategy for Data Stream Management System.",
                    "A QoS-Guaranteeing Scheduling Algorithm for Continuous Queries over Streams.",
                    "A Simple But Effective Event-Driven Model for Data Stream Queries.",
                    "Efficient Difference NN Queries for Moving Objects.",
                    "APCAS: An Approximate Approach to Adaptively Segment Time Series Stream.",
                    "Continuous k-Nearest Neighbor Search Under Mobile Environment.",
                    "Record Extraction Based on User Feedback and Document Selection.",
                    "Density Analysis of Winnowing on Non-uniform Distributions.",
                    "Error-Based Collaborative Filtering Algorithm for Top-N Recommendation.",
                    "A PLSA-Based Approach for Building User Profile and Implementing Personalized Recommendation.",
                    "CoXML: A Cooperative XML Query Answering System.",
                    "Concept-Based Query Transformation Based on Semantic Centrality in Semantic Peer-to-Peer Environment.",
                    "Mining Infrequently-Accessed File Correlations in Distributed File System.",
                    "Learning-Based Trust Model for Optimization of Selecting Web Services.",
                    "SeCED-FS: A New Approach for the Classification and Discovery of Significant Regions in Medical Images.",
                    "Context-Aware Search Inside e-Learning Materials Using Textbook Ontologies.",
                    "Activate Interaction Relationships Between Students Acceptance Behavior and E-Learning.",
                    "Semantic-Based Grouping of Search Engine Results Using WordNet.",
                    "Static Verification of Access Control Model for AXML Documents.",
                    "SAM: An Efficient Algorithm for F&B-Index Construction.",
                    "BUXMiner: An Efficient Bottom-Up Approach to Mining XML Query Patterns.",
                    "A Web Service Architecture for Bidirectional XML Updating.",
                    "(alpha, k)-anonymity Based Privacy Preservation by Lossy Join.",
                    "Achieving k -Anonymity Via a Density-Based Clustering Method.",
                    "k -Anonymization Without Q-S Associations.",
                    "Protecting and Recovering Database Systems Continuously.",
                    "Towards Web Services Composition Based on the Mining and Reasoning of Their Causal Relationships.",
                    "A Dynamically Adjustable Rule Engine for Agile Business Computing Environments.",
                    "A Formal Design of Web Community Interactivity.",
                    "Towards a Type-2 Fuzzy Description Logic for Semantic Search Engine.",
                    "A Type-Based Analysis for Verifying Web Application.",
                    "Homomorphism Resolving of XPath Trees Based on Automata.",
                    "An Efficient Overlay Multicast Routing Algorithm for Real-Time Multimedia Applications.",
                    "Novel NonGaussianity Measure Based BSS Algorithm for Dependent Signals.",
                    "HiBO: Mining Web's Favorites.",
                    "Frequent Variable Sets Based Clustering for Artificial Neural Networks Particle Classification.",
                    "Attributes Reduction Based on GA-CFS Method.",
                    "Towards High Performance and High Availability Clusters of Archived Stream.",
                    "Continuously Matching Episode Rules for Predicting Future Events over Event Streams."
                ]
            },
            {
                "sub_name_abbr": "conf/apweb/2007w",
                "sub_name": "Advances in Web and Network Technologies, and Information Management, APWeb/WAIM 2007 International Workshops: DBMAN 2007, WebETrends 2007, PAIS 2007 and ASWAN 2007, Huang Shan, China, June 16-18, 2007, Proceedings.",
                "count": 76,
                "papers": [
                    "Cost Framework for a Heterogeneous Distributed Semi-structured Environment.",
                    "Cost-Based Vertical Fragmentation for XML.",
                    "Efficiently Crawling Strategy for Focused Searching Engine.",
                    "QoS-Guaranteed Ring Replication Management with Strong Consistency.",
                    "A Mobile Database Sharing Protocol to Increase Data Availability in Mobile Environments.",
                    "Mining Recent Frequent Itemsets over Data Streams with a Time-Sensitive Sliding Window.",
                    "Mining Web Transaction Patterns in an Electronic Commerce Environment.",
                    "Mining Purpose-Based Authorization Strategies in Database System.",
                    "RSP-DS: Real Time Sequential Pattern Analysis over Data Streams.",
                    "Investigative Queries in Sensor Networks.",
                    "A Taxonomy-Based Approach for Constructing Semantics-Based Super-Peer Networks.",
                    "A Comparative Study of Replica Placement Strategies in Data Grids.",
                    "A Workload Balancing Based Approach to Discourage Free Riding in Peer-to-Peer Network.",
                    "QoS-Based Services Selecting and Optimizing Algorithms on Grid.",
                    "Bayesian Method Based Trusted Overlay for Information Retrieval over Networks.",
                    "Managing a Geographic Database from Mobile Devices Through OGC Web Services.",
                    "Real-Time Creation Method of Personalized Mobile Web Contents for Ubiquitous Contents Access.",
                    "The Golden Mean Operator Scheduling Strategy in Data Stream Systems.",
                    "Continuous Skyline Tracking on Update Data Streams.",
                    "A Hybrid Algorithm for Web Document Clustering Based on Frequent Term Sets and k-Means.",
                    "OMSI-Tree: Power-Awareness Query Processing over Sensor Networks by Removing Overlapping Regions.",
                    "On Studying Front-Peer Attack-Resistant Trust and Reputation Mechanisms Based on Enhanced Spreading Activation Model in P2P Environments.",
                    "A Load Balancing Method Using Ring Network in the Grid Database.",
                    "Design and Implementation of a System for Environmental Monitoring Sensor Network.",
                    "Policy Based Scheduling for Resource Allocation on Grid.",
                    "Characterizing DSS Workloads from the Processor Perspective.",
                    "Exploiting Connection Relation to Compress Data Graph.",
                    "Indexing the Current Positions of Moving Objects on Road Networks.",
                    "DBMSs with Native XML Support: Towards Faster, Richer, and Smarter Data Management.",
                    "A Personalized Re-ranking Algorithm Based on Relevance Feedback.",
                    "An Investigation and Conceptual Models of Podcast Marketing.",
                    "A User Study on the Adoption of Location Based Services.",
                    "Email Community Detection Using Artificial Ant Colony Clustering.",
                    "EviRank: An Evidence Based Content Trust Model for Web Spam Detection.",
                    "A Novel Factoid Ranking Model for Information Retrieval.",
                    "Dynamic Composition of Web Service Based on Coordination Model.",
                    "An Information Retrieval Method Based on Knowledge Reasoning.",
                    "Research on Personalized Recommendation Algorithm in E-Supermarket System.",
                    "XML Normal Forms Based on Constraint-Tree-Based Functional Dependencies.",
                    "Untyped XQuery Canonization.",
                    "Web Search Tailored Ontology Evaluation Framework.",
                    "An Overview of the Business Process Maturity Model (BPMM).",
                    "Process Mining: Extending alpha -Algorithm to Mine Duplicate Tasks in Process Logs.",
                    "A Distributed Genetic Algorithm for Optimizing the Quality of Grid Workflow.",
                    "Safety Analysis and Performance Evaluation of Time WF-nets.",
                    "Dual Workflow Nets: Mixed Control/Data-Flow Representation for Workflow Modeling and Verification.",
                    "Bridging Organizational Structure and Information System Architecture Through Process.",
                    "Relation-Driven Business Process-Oriented Service Discovery.",
                    "Workflow Message Queue's Performance Effect Measurements on an EJB-Based Workflow Management System.",
                    "RFID Application Model and Performance for Postal Logistics.",
                    "An Organization and Task Based Access Control Model for Workflow System.",
                    "A Method of Web Services Composition Based on Service Alliance.",
                    "Toward a Lightweight Process-Aware Middleware.",
                    "Automatic Generation of Web Service Workflow Using a Probability Based Process-Semantic Repository.",
                    "A Three-Dimensional Customer Classification Model Based on Knowledge Discovery and Empirical Study.",
                    "QoS-Driven Global Optimization of Services Selection Supporting Services Flow Re-planning.",
                    "SOA-Based Collaborative Modeling Method for Cross-Organizational Business Process Integration.",
                    "Model Checking for BPEL4WS with Time.",
                    "A Version Management of Business Process Models in BPMS.",
                    "Research on Architecture and Key Technology for Service-Oriented Workflow Performance Analysis.",
                    "The Study on Internet-Based Face Recognition System Using Principal Component Analysis.",
                    "Semantic Representation of RTBAC: Relationship-Based Access Control Model.",
                    "A Code-Based Multi-match Packet Classification with TCAM.",
                    "Home Network Device Authentication: Device Authentication Framework and Device Certificate Profile.",
                    "P-IDC: Information Security and Consideration in Building Internet Data Centers for Pervasive Environment.",
                    "Improvement of an Authenticated Key Agreement Protocol.",
                    "A Mechanism for Securing Digital Evidences in Pervasive Environments.",
                    "A Secure Chaotic Hash-Based Biometric Remote User Authentication Scheme Using Mobile Devices.",
                    "Adapting Web Services Security Standards for Mobile and Wireless Environments.",
                    "Coexistence Proof Using Chain of Timestamps for Multiple RFID Tags.",
                    "A Design of Authentication Protocol for Multi-key RFID Tag.",
                    "An Efficient Fragile Watermarking for Web Pages Tamper-Proof.",
                    "Classification of Key Management Schemes for Wireless Sensor Networks.",
                    "An Efficient Algorithm for Proportionally Fault-Tolerant Data Mining.",
                    "SOGA: Fine-Grained Authorization for Self-Organizing Grid.",
                    "Permission-Centric Hybrid Access Control."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th WAIM 2006",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2006",
                "sub_name": "Advances in Web-Age Information Management, 7th International Conference,WAIM 2006, Hong Kong, China, June 17-19, 2006, Proceedings.",
                "count": 50,
                "papers": [
                    "On-Demand Index for Efficient Structural Joins.",
                    "An Efficient Indexing Scheme for Moving Objects' Trajectories on Road Networks.",
                    "Spatial Index Compression for Location-Based Services Based on a MBR Semi-approximation Scheme.",
                    "KCAM: Concentrating on Structural Similarity for XML Fragments.",
                    "A New Structure for Accelerating XPath Location Steps.",
                    "Efficient Evaluation of Multiple Queries on Streamed XML Fragments.",
                    "Automated Extraction of Hit Numbers from Search Result Pages.",
                    "Keyword Extraction Using Support Vector Machine.",
                    "LSM: Language Sense Model for Information Retrieval.",
                    "Succinct and Informative Cluster Descriptions for Document Repositories.",
                    "LRD: Latent Relation Discovery for Vector Space Expansion and Information Retrieval.",
                    "Web Image Retrieval Refinement by Visual Contents.",
                    "An Effective Approach for Hiding Sensitive Knowledge in Data Publishing.",
                    "Tracking Network-Constrained Moving Objects with Group Updates.",
                    "Dynamic Configuring Service on Semantic Grid.",
                    "Object Placement and Caching Strategies on AN.P2P.",
                    "Role-Based Peer-to-Peer Model: Capture Global Pseudonymity for Privacy Protection.",
                    "A Reputation Management Scheme Based on Global Trust Model for Peer-to-Peer Virtual Communities.",
                    "QoS-Aware Web Services Composition Using Transactional Composition Operator.",
                    "Optimizing the Profit of On-Demand Multimedia Service Via a Server-Dependent Queuing System.",
                    "Service Matchmaking Based on Semantics and Interface Dependencies.",
                    "Crawling Web Pages with Support for Client-Side Dynamism.",
                    "RecipeCrawler:  Collecting Recipe Data from WWW Incrementally.",
                    "CCWrapper: Adaptive Predefined Schema Guided Web Extraction.",
                    "MiniTasking: Improving Cache Performance for Multiple Query Workloads.",
                    "Cache Consistency in Mobile XML Databases.",
                    "Bulkloading Updates for Moving Objects.",
                    "Finding the Plateau in an Aggregated Time Series.",
                    "Compressing Spatial and Temporal Correlated Data in Wireless Sensor Networks Based on Ring Topology.",
                    "Discovery of Temporal Frequent Patterns Using TFP-Tree.",
                    "DGCL: An Efficient Density and Grid Based Clustering Algorithm for Large Spatial Database.",
                    "Scalable Clustering Using Graphics Processors.",
                    "TreeCluster: Clustering Results of Keyword Search over Databases.",
                    "A New Method for Finding Approximate Repetitions in DNA Sequences.",
                    "Dynamic Incremental Data Summarization for Hierarchical Clustering.",
                    "Classifying E-Mails Via Support Vector Machine.",
                    "A Novel Web Page Categorization Algorithm Based on Block Propagation Using Query-Log Information.",
                    "Counting Graph Matches with Adaptive Statistics Collection.",
                    "Tight Bounds on the Estimation Distance Using Wavelet.",
                    "Load Shedding for Window Joins over Streams.",
                    "Error-Adaptive and Time-Aware Maintenance of Frequency Counts over Data Streams.",
                    "Supporting Efficient Distributed Top-k Monitoring.",
                    "Designing Quality XML Schemas from E-R Diagrams.",
                    "Validating Semistructured Data Using OWL.",
                    "Dynamic Data Distribution of High Level Architecture Based on Publication and Subscription Tree.",
                    "A Framework for Query Reformulation Between Knowledge Base Peers.",
                    "An Efficient Indexing Technique for Computing High Dimensional Data Cubes.",
                    "A Scientific Workflow Framework Integrated with Object Deputy Model for Data Provenance.",
                    "On the Development of a Multiple-Compensation Mechanism for Business Transactions.",
                    "OS-DRAM: A Delegation Administration Model in a Decentralized Enterprise Environment."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6th WAIM 2005",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2005",
                "sub_name": "Advances in Web-Age Information Management, 6th International Conference, WAIM 2005, Hangzhou, China, October 11-13, 2005, Proceedings.",
                "count": 104,
                "papers": [
                    "What the Web Has Done for Scientific Data - and What It Hasn't.",
                    "Integrity Theory for Resource Space Model and Its Application.",
                    "Challenges of Grid Computing.",
                    "BBTC: A New Update-Supporting Coding Scheme for XML Documents.",
                    "Using XML Structure to Reduce Candidate Nodes Participated in Query Processing.",
                    "An Effective and Efficient Approach for Keyword-Based XML Retrieval.",
                    "Subgraph Join: Efficient Processing Subgraph Queries on Graph-Structured XML Document.",
                    "A Soft Real-Time Web News Classification System with Double Control Loops.",
                    "Searching the World Wide Web for Local Services and Facilities: A Review on the Patterns of Location-Based Queries.",
                    "Self-adaptive Statistics Management for Efficient Query Processing.",
                    "Design and Implementation of the Modified R-Tree Structure with Non-blocking Querying.",
                    "Importance-Based Web Page Classification Using Cost-Sensitive SVM.",
                    "An Efficient Approach for Interactive Mining of Frequent Itemsets.",
                    "Similarity Search with Implicit Object Features.",
                    "An Improved FloatBoost Algorithm for Naïve Bayes Text Classification.",
                    "An Approach to RDF(S) Query, Manipulation and Inference on Databases.",
                    "Clustering OWL Documents Based on Semantic Analysis.",
                    "An Ontology Based Approach to Construct Behaviors in Web Information Systems.",
                    "A Semi-automatic Ontology Acquisition Method for the Semantic Web.",
                    "Watermarking Abstract Tree-Structured Data.",
                    "Location-Based Caching Scheme for Mobile Clients.",
                    "Extended Derivation Cube Based View Materialization Selection in Distributed Data Warehouse.",
                    "A Framework of HTML Content Selection and Adaptive Delivery.",
                    "An Improved Multi-stage (t, n)-Threshold Secret Sharing Scheme.",
                    "Information Management in E-Learning System.",
                    "A Stratification-Based Approach to Accurate and Fast Image Annotation.",
                    "Web Services Composition Based on Ontology and Workflow.",
                    "Web Service Composition Using Markov Decision Processes.",
                    "FECT: A Modelling Framework for Automatically Composing Web Services.",
                    "Intrusion Detection of DoS/DDoS and Probing Attacks for Web Services.",
                    "cGridex: Efficient Processing of Continuous Range Queries over Moving Objects.",
                    "An Efficient Context Modeling and Reasoning System in Pervasive Environment: Using Absolute and Relative Context Filtering Technology.",
                    "Influences of Functional Dependencies on Bucket-Based Rewriting Algorithms.",
                    "GARWM: Towards a Generalized and Adaptive Watermark Scheme for Relational Data.",
                    "Refined Rules Termination Analysis Through Activation Path.",
                    "Stream Operators for Querying Data Streams.",
                    "Join Algorithm Using Multiple Replicas in Data Grid.",
                    "A Heuristic and Distributed QoS Route Discovery Method for Mobile Ad Hoc Networks.",
                    "Planning Enhanced Grid Workflow Management System Based on Agent.",
                    "Reasoning Based on the Distributed beta-PSML.",
                    "An Auto-stopped Hierarchical Clustering Algorithm Integrating Outlier Detection Algorithm.",
                    "Research Paper Recommender Systems: A Subspace Clustering Approach.",
                    "Concept Updating with Support Vector Machines.",
                    "On the Performance of Feature Weighting K-Means for Text Subspace Clustering.",
                    "State Transfer Graph: An Efficient Tool for Webview Maintenance.",
                    "An EJB-Based Very Large Scale Workflow System and Its Performance Measurement.",
                    "Deploying pi-Calculus Technology in Inter-organizational Process.",
                    "Modulation for Scalable Multimedia Content Delivery.",
                    "A Deadline-Sensitive Approach for Real-Time Processing of Sliding Windows.",
                    "MPX: A Multiversion Concurrency Control Protocol for XML Documents.",
                    "An Index Structure for Parallel Processing of Multidimensional Data.",
                    "Construction of Security Architecture of Web Services Based EAI.",
                    "Using Web Services and Scientific Workflow for Species Distribution Prediction Modeling.",
                    "Integrative Security Management for Web-Based Enterprise Applications.",
                    "An Ontology-Based Semantic Integration for Digital Museums.",
                    "A Unified Subspace Outlier Ensemble Framework for Outlier Detection.",
                    "A Convertible Limited Verifier Signature Scheme.",
                    "Short Signature Scheme Based on Discrete Logarithms.",
                    "Simulating a Finite State Mobile Agent System.",
                    "Algorithm for Analyzing N-Dimensional Hilbert Curve.",
                    "DMT: A Flexible and Versatile Selectivity Estimation Approach for Graph Query.",
                    "A New Public Key Certificate Revocation Scheme Based on One-Way Hash Chain.",
                    "Interactive Chinese Search Results Clustering for Personalization.",
                    "Efficient Delay Aware Peer-to-Peer Overlay Network.",
                    "PIES: A Web Information Extraction System Using Ontology and Tag Patterns.",
                    "An Algebraic Framework for Schema Matching.",
                    "A Clustering Algorithm Based Absorbing Nearest Neighbors.",
                    "Parallel Mining of Top-K Frequent Itemsets in Very Large Text Database.",
                    "Removing Smoothing from Naive Bayes Text Classifier.",
                    "Medical Image Clustering with Domain Knowledge Constraint.",
                    "Tick Scheduling: A Deadline Based Optimal Task Scheduling Approach for Real-Time Data Stream Systems.",
                    "A Novel Ranking Strategy in Hybrid Peer-to-Peer Networks.",
                    "An Algorithmic Approach to High-Level Personalisation of Web Information Systems.",
                    "(Web Services Performance Analysis Center): A Performance-Aware Web Service Composition Tool.",
                    "Design and Implementation of a Service Bundle Manager for Home Network Middleware.",
                    "A State-Transfer-Based Dynamic Policy Approach for Constraints in RBAC.",
                    "A New Cache Model and Replacement Algorithm for Network Attached Optical Jukebox.",
                    "Multiple Watermarking Using Hadamard Transform.",
                    "An Immunity-Based Intrusion Detection Solution for Database Systems.",
                    "Filtering Duplicate Items over Distributed Data Streams.",
                    "An Optimized K-Means Algorithm of Reducing Cluster Intra-dissimilarity for Document Clustering.",
                    "Hierarchical Metadata Driven View Selection for Spatial Query Evaluations.",
                    "Priority Processing in the Web Service-Workflow Architecture.",
                    "Policy-Based Workflow Management System.",
                    "A Mobile-Aware System for Website Personalization.",
                    "An Algorithm for Best Selection in Semantic Composition of Web Service.",
                    "Using Quantitative Association Rules in Collaborative Filtering.",
                    "Extracting, Presenting and Browsing of Web Social Information.",
                    "An Ontology-Based Host Resources Monitoring Approach in Grid Environment.",
                    "Domain-Specific Website Recognition Using Hybrid Vector Space Model.",
                    "Understanding User Operations on Web Page in WISE.",
                    "Two-Phase Exclusion Based Broadcast Adaptation in Wireless Networks.",
                    "Web Service Collaboration Analysis via Automata.",
                    "A Novel Resource Description Based Approach for Clustering Peers.",
                    "The Segmentation of News Video into Story Units.",
                    "Process Controlling and Monitoring Scheme for Distributed Systems with Fault-Tolerance by Using Web Services.",
                    "CoopStreaming: A Novel Peer-to-Peer System for Fast Live Media Streaming.",
                    "Ontology-Based HTML to XML Conversion.",
                    "Image Matrix Fisher Discriminant Analysis (IMFDA)- 2D Matrix Based Face Image Retrieval Algorithm.",
                    "Approximate Common Structures in XML Schema Matching.",
                    "Bi-directional Ontology Versioning BOV.",
                    "Quantitative Modeling for Web Objects' Cacheability.",
                    "An Efficient Scheme of Merging Multiple Public Key Infrastructures in ERP.",
                    "Forms-XML: Generating Form-Based User Interfaces for XML Vocabularies."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "5th WAIM 2004",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2004",
                "sub_name": "Advances in Web-Age Information Management: 5th International Conference, WAIM 2004, Dalian, China, July 15-17, 2004.",
                "count": 83,
                "papers": [
                    "A Framework for a Trusted Environment for Virtual Collaboration.",
                    "Future Interconnection Environment - Dream, Principle, Challenge and Practice.",
                    "Recent Advances in Histogram Construction Algorithms.",
                    "Dynamic Adjustment of Sliding Windows over Data Streams.",
                    "Space Efficient Quantile Summary for Constrained Sliding Windows on a Data Stream.",
                    "The Dimension-Reduced Multi-scale Histogram: A New Method for Fast and Efficient Retrieval of Similar Time Sequences and Subsequence.",
                    "Time Series Prediction Based on Gene Expression Programming.",
                    "A Grid-Based Index Method for Time Warping Distance.",
                    "Fail-Stop Authentication Protocol for Digital Rights Management in Adaptive Information Retrieval System.",
                    "Effective Web-Related Resource Security Using Distributed Role Hierarchy.",
                    "A Low-Cost Checkpointing Scheme for Mobile Computing Systems.",
                    "Semantic and Adaptive Middleware for Data Management in Smart Vehicle Space.",
                    "Dynamic Resource Reservation Using the Differentiated Handoff Estimation Model for Mobile Networks.",
                    "Adaptive Generic Communications for Integrated Mobile and Internet Web-Services.",
                    "Spatio-temporal Database with Multi-granularities.",
                    "A Simple but Effective Dynamic Materialized View Caching.",
                    "A Cache Replacement Algorithm in Hierarchical Storage of Continuous Media Object.",
                    "CCAN: Cache-Based CAN Using the Small World Model.",
                    "Performance Evaluations of Replacement Algorithms in Hierarchical Web Caching.",
                    "Component-Based WebGIS and Its Spatial Cache Framework.",
                    "Learning-Based Top-N Selection Query Evaluation over Relational Databases.",
                    "DHT Based Searching Improved by Sliding Window.",
                    "A Scalable and I/O Optimal Skyline Processing Algorithm.",
                    "Linearization Approach for Efficient KNN Search of High-Dimensional Data.",
                    "SQL/MDR: Query Language for Consistent Access of Metadata Registries Based on SQL3.",
                    "Solving Queries over Semantically Integrated Biological Data Sources.",
                    "Fast Approximate Search in Text Databases.",
                    "Apply Feedback Control Theory to Design Soft Real-Time Search Engine System.",
                    "User Interest Detection on Web Pages for Building Personalized Information Agent.",
                    "Improved Link-Based Algorithms for Ranking Web Pages.",
                    "Effectiveness Evaluation and Comparison of Web Search Engines and Meta-search Engines.",
                    "Semantic Search in the WWW Supported by a Cognitive Model.",
                    "Semantic Board: A Bulletin Board System Supporting Dynamic Semantic Information.",
                    "Efficient Evaluation of Sparse Data Cubes.",
                    "Redundancy Free Mappings from Relations to XML.",
                    "Tree Multivalued Dependencies for XML Datasets.",
                    "TROS: A Novel Model and Its Implementation for XML Data Management.",
                    "Optimized Query Translation Strategy for XML Stored in Relational Database.",
                    "QReduction: Synopsizing XPath Query Set Efficiently under Resource Constraint.",
                    "Extracting Key Value and Checking Structural Constraints for Validating XML Key Constraints.",
                    "Estimating the Selectivity of XML Path Expression with Predicates by Histograms.",
                    "Wrapping Web Pages into XML Documents.",
                    "Rapid Prototyping for Web Applications.",
                    "Capacity Planning for Composite Web Services Using Queueing Network-Based Models.",
                    "A Web-Based Coordination Infrastructure for Grid Collective Services.",
                    "Symbolic Agent Negotiation for Semantic Web Service Exploitation.",
                    "Object-Oriented Realization of Workflow Views for Web Services - An Object Deputy Model Based Approach.",
                    "Modeling QoS for Semantic Equivalent Web Services.",
                    "Improved Email Classification through Enriched Feature Space.",
                    "PLD: A Distillation Algorithm for Misclassified Documents.",
                    "Sequential Classifiers Combination for Text Categorization: An Experimental Study.",
                    "Combining Active Learning and Boosting for Naïve Bayes Text Classifiers.",
                    "Using Interval Association Rules to Identify Dubious Data Values.",
                    "Mining Web Sequential Patterns Incrementally with Revised PLWAP Tree.",
                    "Mining Frequent Items in Spatio-temporal Databases.",
                    "Discovery of Frequent XML Query Patterns with DTD Cardinality Constraints.",
                    "Mining Inheritance Rules from Genealogical Data.",
                    "Mining DAG Patterns from DAG Databases.",
                    "Mining Class Outliers: Concepts, Algorithms and Applications.",
                    "CD-Trees: An Efficient Index Structure for Outlier Detection.",
                    "Mobile Data Management with Sound.",
                    "A Mixture Model of Classical Fuzzy Classifiers.",
                    "An Empirical Study of Building Compact Ensembles.",
                    "Merging Individually Learned Optimal Results to Accelerate Coordination.",
                    "The Compression of Massive Offline Relations.",
                    "Finding Plagiarism Based on Common Semantic Sequence Model.",
                    "Web Information Extraction Based on Similar Patterns.",
                    "TS-Cache: A Novel Caching Strategy to Manage Data in MANET Database.",
                    "Extended Chain-Conflicting Serializability for the Correct Schedule of Transactions in Hierarchical Multidatabase.",
                    "An Efficient Hierarchical Failure Recovery Algorithm Ensuring Semantic Atomicity for Workflow Applications.",
                    "A Macrocommittees Method of Combining Multistrategy Classifiers for Heterogeneous Ontology Matching.",
                    "Hypertext Classification Algorithm Based on Co-weighting Multi-information.",
                    "Verifying a MAC-Based Service Bundle Authentication Mechanism for the OSGi Service Platform.",
                    "Optimal Data Dispatching Methods in Near-Line Tertiary Storage System.",
                    "A Real-Time Information Gathering Agent Based on Ontology.",
                    "Dynamical Schedule Algorithms Based on Markov Model in Tertiary Storage.",
                    "Image Retrieval Using Structured Logical Shape Feature.",
                    "Automatic HTML to XML Conversion.",
                    "Quality Improvement Modeling and Practice in Baosteel Based on KIV-KOV Analysis.",
                    "A Frequent Pattern Discovery Method for Outlier Detection.",
                    "Adaptive Load Balancing and Fault Tolerance in Push-Based Information Delivery Middleware Service.",
                    "Performance Optimization of Fractal Dimension Based Feature Selection Algorithm.",
                    "Graph-Based Cyclic Multi-join Query Optimization Algorithm."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th WAIM 2003",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2003",
                "sub_name": "Advances in Web-Age Information Management, 4th International Conference, WAIM 2003, Chengdu, China, August 17-19, 2003, Proceedings.",
                "count": 51,
                "papers": [
                    "Recent Advances in Access Control Models.",
                    "Managing Trust in Peer-to-Peer Systems Using Reputation-Based Techniques.",
                    "Advertising and Matching Agent Services on the World Wide Web.",
                    "Efficient Reduction of Web Latency through Predictive Prefetching on a WAN.",
                    "Compact Encoding of the Web Graph Exploiting Various Power Laws: Statistical Reason Behind Link Database.",
                    "Improving the Web Site's Effectiveness by Considering Each Page's Temporal Information.",
                    "Redundancy Free Mappings from Relations to XML.",
                    "UD(k, l)-Index: An Efficient Approximate Index for XML Data.",
                    "Logical Foundation for Updating XML.",
                    "XML Database Schema Integration Using XDD.",
                    "Xaggregation: Flexible Aggregation of XML Data.",
                    "Efficient Evaluation of XML Path Queries with Automata.",
                    "Managing XML by the Nested Relational Sequence Database System.",
                    "Normalizing XML Element Trees as Well-Designed Document Structures for Data Integration.",
                    "Classifying High-Speed Text Streams.",
                    "Partition Based Hierarchical Index for Text Retrieval.",
                    "A Genetic Semi-supervised Fuzzy Clustering Approach to Text Classification.",
                    "Partition for the Rough Set-Based Text Classification.",
                    "Efficiently Mining Interesting Emerging Patterns.",
                    "DENCLUE-M: Boosting DENCLUE Algorithm by Mean Approximation on Grids.",
                    "A New Fast Clustering Algorithm Based on Reference and Density.",
                    "Classification Using Constrained Emerging Patterns.",
                    "A New Multivariate Decision Tree Construction Algorithm Based on Variable Precision Rough Set.",
                    "A New Heuristic Reduct Algorithm Base on Rough Sets Theory.",
                    "Using Rules to Analyse Bio-medical Data: A Comparison between C4.5 and PCL.",
                    "A Protein Secondary Structure Prediction Framework Based on the Support Vector Machine.",
                    "Efficient Semantic Search in Peer-to-Peer Systems.",
                    "Enacting Business Processes in a Decentralised Environment with p2p-Based Workflow Support.",
                    "Peer-Serv: A Framework of Web Services in Peer-to-Peer Environment.",
                    "Dynamic Clustering-Based Query Answering in Peer-to-Peer Systems.",
                    "The RBAC Based Privilege Management for Authorization of Wireless Networks.",
                    "Data Securing through Rule-Driven Mobile Agents and IPsec.",
                    "Site-Role Based GreedyDual-Size Replacement Algorithm.",
                    "A Study on the Two Window-Based Marking Algorithm in Differentiated Services Network.",
                    "A Mobility-Aware Location Update Protocol to Track Mobile Users in Location-Based Services.",
                    "An Optimized Topology Control Algorithm for Mobile Ad Hoc Networks.",
                    "Efficient Evaluation of Composite Correlations for Streaming Time Series.",
                    "An Efficient Computational Method for Measuring Similarity between Two Conceptual Entities.",
                    "Ontology-Based Access to Distributed Statistical Databases.",
                    "A Filter Index for Complex Queries on Semi-structured Data.",
                    "An Improved Framework for Online Adaptive Information Filtering.",
                    "An Image Retrieval Method Based on Information Filtering of User Relevance Feedback Records.",
                    "A New Similar Trajectory Retrieval Scheme Using k-Warping Distance Algorithm for Moving Objects.",
                    "TupleRank and Implicit Relationship Discovery in Relational Databases.",
                    "Top-N Query: Query Language, Distance Function, and Processing Strategies.",
                    "Scalable Query Reformulation Using Views in the Presence of Functional Dependencies.",
                    "Multimedia Tampering Localization Based on the Perturbation in Reverse Processing.",
                    "Discovering Image Semantics from Web Pages Using a Text Mining Approach.",
                    "Creating Customized Metasearch Engines on Demand Using SE-LEGO.",
                    "SQL-Relay: An Event-Driven Rule-Based Database Gateway.",
                    "CyberETL: Towards Visual Debugging Transformations in Data Integration."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "3rd WAIM 2002",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2002",
                "sub_name": "Advances in Web-Age Information Management, Third International Conference, WAIM 2002, Beijing, China, August 11-13, 2002, Proceedings.",
                "count": 42,
                "papers": [
                    "Efficient Supporting XML Query and Keyword Search in Relational Database Systems.",
                    "Performance Evaluation of a DOM-Based XML Database: Storage, Indexing and Query Optimization.",
                    "Structural Map: A New Index for Efficient XML Path Expression Processing.",
                    "An Advanced Discrete Model for Uncertain Spatial Data.",
                    "A Spatio-Temporal Representation Scheme for Content- and Semantic-Based Video Retrieval on Moving Objects' Trajectories.",
                    "Efficient Access Technique Using Levelized Data in Web-Based GIS.",
                    "Using PR-Tree and HPIR to Manage Coherence of Semantic Cache for Location Dependent Data in Mobile Database.",
                    "Towards Efficient Re-mining of Frequent Patterns upon Threshold Changes.",
                    "Mining Predicate Association Rule by Gene Expression Programming.",
                    "Learning with Concept Hierarchies in Probabilistic Relational Data Mining.",
                    "An Empirical Study of Learning-Based Web Search.",
                    "Outlier Detection Integrating Semantic Knowledge.",
                    "Extracting Information from Semistructured Data.",
                    "Maintaining Consistency of Integrated XML Trees.",
                    "Extract Frequent Pattern from Simple Graph Data.",
                    "XML-Based Data Rendering Engine for Content Management System.",
                    "Text Distinguishers Used in an Interactive Meta Search Engine.",
                    "Team Work Oriented Flexible Workflow Management System.",
                    "EROICA: A Rule-Based Approach to Organizational Policy Management in Workflow Systems.",
                    "The Admon-Time Workflow Client: Why Do We Need the Third Type of Workflow Client Designated for Administration and Monitoring Services?",
                    "Progressive Content Delivery for Mobile E-services.",
                    "GeneAround: A Browsing System for Gene Annotation Using XML Technologies.",
                    "What Difference Heuristics Make: Maintenance-Cost View-Selection Revisited.",
                    "Representing Conceptual Multidimensional Properties Using the Common Warehouse Metamodel (CWM).",
                    "OLAP Query Processing Algorithm Based on Relational Storage.",
                    "Querying and Clustering Very Large Data Sets Using Dynamic Bucketing Approach.",
                    "CBCM: A Cell-Based Clustering Method for Data Mining Applications.",
                    "C2VA: Trim High Dimensional Indexes.",
                    "Topic Exploration and Distillation for Web Search by a Similarity-Based Analysis.",
                    "Efficient and Simple Encodings for the Web Graph.",
                    "Object-Extraction-Based Hidden Web Information Retrieval.",
                    "An Improved Usage-Based Ranking.",
                    "On Linear-Spline Based Histograms.",
                    "A General and Efficient Approach for Solving Nearest Neighbor Problem in the Vague Query System.",
                    "A Client-Based Web-Cache Management System.",
                    "Immediate and Partial Validation Mechanism for the Conflict Resolution of Update Operations in XML Databases.",
                    "Relaxed Atomic Commit for Real-Time Transactions in Mobile Computing Environment.",
                    "Real-Time Facial Patterns Mining and Emotion Tracking.",
                    "Data Reduction and Noise Filtering for Predicting Times Series.",
                    "Exploiting the Intrinsic Irreversibility of Adaptive Technologies to Enhance the Security of Digital Watermarking.",
                    "Web-Linkage Viewer: Finding Graph Structures in the Web.",
                    "GDWFMS: A Workflow System for Submitting Graphs and Documents."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "2nd WAIM 2001",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2001",
                "sub_name": "Advances in Web-Age Information Management, Second International Conference, WAIM 2001, Xi'an, China, July 9-11, 2001, Proceedings.",
                "count": 37,
                "papers": [
                    "Spatial-Match Iconic Image Retrieval with Ranking in Multimedia Databases.",
                    "Similarity-Based Operators in Image Database Systems.",
                    "An Efficient High-Dimensional Index Structure Using Cell Signatures for Similarity Search.",
                    "Using Object-Relational Database Systems and XML in the Context of an Wireless-Oriented Multimedia Information System.",
                    "Utilizing the Correlation between Query Keywords for Information Retrieval.",
                    "Adjacency Matrix Based Full-Text Indexing Models.",
                    "Goal-Oriented Information Retrieval Using Feedback from Users.",
                    "Classify Web Document by Key Phrase Understanding.",
                    "Deriving High Confidence Rules from Spatial Data Using Peano Count Trees.",
                    "A Distributed Hierarchical Clustering System for Web Mining.",
                    "ARMiner: A Data Mining Tool Based on Association Rules.",
                    "An Integrated Classification Rule Management System for Data Mining.",
                    "Characterizing Web Document Change.",
                    "Identification of Syntactically Similar DTD Elements for Schema Matching.",
                    "An XML Based Electronic Medical Record Integration System.",
                    "Enhancing XML Data Processing in Relational System with Indices.",
                    "A Multidimensional Data Model Supporting Complicated Aggregations.",
                    "Comparing String Similarity Measures for Reducing Inconsistency in Integrating Data from Different Sources.",
                    "Revisit on View Maintenance in Data Warehouses.",
                    "Experiences with a Hybrid Implementation of a Globally Distributed Federated Database System.",
                    "Link Based Clustering of Web Search Results.",
                    "Three-Tier Clustering: An Online Citation Clustering System.",
                    "Introducing Navigation Graphs as a Technique for Improving WWW User Browsing.",
                    "The Evolution of the Contract Net Protocol.",
                    "Semantic Compression of Temporal Data.",
                    "Efficiently Computing Weighted Proximity Relationships in Spatial Databases.",
                    "Compressing the Index - A Simple and yet Efficient Approximation Approach to High-Dimensional Indexing.",
                    "Finding Dense Clusters in Hyperspace: An Approach Based on Row Shuffling.",
                    "Modelling Classification Performance for Large Data Sets.",
                    "Mapping Referential Integrity Constraints from Relational Databases to XML.",
                    "Attribute Value Extraction and Standardization in Data Integration.",
                    "Indexing Attributes and Reordering Profiles for XML Document Filtering and Information Delivery.",
                    "An Approach for Data Filtering Based on Rough Set Theory.",
                    "Web-Based Workflow Evolution in ADOME-WFMS.",
                    "Meta-data Objects as the Basis for System Evolution.",
                    "Adaptive Web Meta-search Enhanced by Constraint-Based Query Constructing and Mapping.",
                    "A Mixed Data Dissemination Strategy for Mobile Computing Systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "1st WAIM 2000",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/waim/2000",
                "sub_name": "Web-Age Information Management, First International Conference, WAIM 2000, Shanghai, China, June 21-23, 2000, Proceedings.",
                "count": 43,
                "papers": [
                    "Visual Data Mining for Business Intelligence Applications.",
                    "Parallel Data Mining on Large Scale PC Cluster.",
                    "XML Query Languages in Practice: An Evaluation.",
                    "A Two-Level Method for Clustering DTDs.",
                    "XML Queries via SQL.",
                    "Inferring DTD to Facilitate User-Oriented XML Document Query.",
                    "An Object Oriented Multidimensional Data Model for OLAP.",
                    "Applying Object-Oriented Conceptual Modeling Techniques to the Design of Multidimensional Databases and OLAP Applications.",
                    "An Optimal Locking Scheme in Object-Oriented Database Systems.",
                    "An Efficient Distributed Algorithm for Computing Association Rules.",
                    "Mining Association Rules with Negative Items Using Interest Measure.",
                    "Probabilistic Approach to Association Rules in Incomplete Databases.",
                    "Discovering Sequential Patterns from Non-Uniform Databases.",
                    "An Effective Approach to Mining Exeption Class Association Rules.",
                    "Integrated Data Management and Enterprise Models.",
                    "A Virtual Private Network for Virtual Enterprise Information Systems.",
                    "Adaptive Online Retail Web Site Based on Hidden Markov Model.",
                    "A Protocol for Untraceable Electronic Cash.",
                    "Materializing Web Data for OLAP and DSS.",
                    "Hierachically Classifying Chinese Web Documents without Dictionary Support and Segmentation Procedure.",
                    "Web Clustering and Association Rule Discovery for Web Broadcast.",
                    "A Non-Euclidean Model for Web Retrieval.",
                    "Advanced Replacement Policies for WWW Caching.",
                    "Extending Rectangle Join Algorithms for Rectilinear Polygons.",
                    "HMT: Modeling Temporal Aspects in Hypermedia Applications.",
                    "Hana Tree: A Dynamic and Robust Access Method for Spatial Data Handling.",
                    "MADGIS: A New Architecture for Distributed GIS under Internet Environment.",
                    "Global View Maintenance by Using Inference Relationship among Views.",
                    "Maintaining Materialized Views for Data Warehouses with Multiple Remote Sources.",
                    "Using Loglinear Models to Compress Datacube.",
                    "Materialized View Selection in a Data Warehouse.",
                    "ExSight: Highly Accurate Object Based Image Retrieval System Enhanced by Redundant Object Extraction.",
                    "Applying Anaphora Resolution to Question Answering and Information Retrieval Systems.",
                    "MB+Tree: A Dynamically Updatable Metric Index for Similarity Searches.",
                    "An Information Store and Retrieval Facility on CORBA.",
                    "Retrieving Content Directly from Antique Book Images.",
                    "Schema Based Data Storage and Query Optimization for Semi-structured Data.",
                    "Automatic Wrapper Generation for Web Search Engines.",
                    "Multi-level Schema Extraction for Heterogenous Semi-structured Data.",
                    "Rough Set Based WebCT Learning.",
                    "MultiAgent Systems for Coalition Support.",
                    "A Fast Globally Supervised Learning Algorithm for Gaussian Mixture Models.",
                    "Optimizing Classifiers by Genetic Algorithms."
                ]
            }
        ]
    }
]