[
    {
        "year": "2021",
        "name": "22nd WISE 2021",
        "info": "Melbourne, VIC, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2021-1",
                "sub_name": "Web Information Systems Engineering - WISE 2021 - 22nd International Conference on Web Information Systems Engineering, WISE 2021, Melbourne, VIC, Australia, October 26-29, 2021, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "Crowdsourcing Software Vulnerability Discovery: Models, Dimensions, and Directions.",
                    "Expertise-Aware Crowdsourcing Taxonomy Enrichment.",
                    "Transaction Confirmation Time Estimation in the Bitcoin Blockchain.",
                    "Automatic Malicious Worker Detection in Crowdsourced Paraphrases.",
                    "A Blockchain-Based Approach for Trust Management in Collaborative Business Processes.",
                    "Exploiting Unblocking Checkpoint for Fault-Tolerance in Pregel-Like Systems.",
                    "A Low-Latency Metadata Service for Geo-Distributed File Systems.",
                    "XTuning: Expert Database Tuning System Based on Reinforcement Learning.",
                    "CELA: An Accurate Learned Cardinality Estimator with Strong Generalization Ability and Dimensional Adaptability.",
                    "Cost-Based Lightweight Storage Automatic Decision for In-Database Machine Learning.",
                    "NP-PROV: Neural Processes with Position-Relevant-Only Variances.",
                    "A Minority Class Boosted Framework for Adaptive Access Control Decision-Making.",
                    "Recognizing Hand Gesture in Still Infrared Images by CapsNet.",
                    "Vertical Federated Principal Component Analysis on Feature-Wise Distributed Data.",
                    "Anchoring-and-Adjustment to Improve the Quality of Significant Features.",
                    "Data Mining Based Artificial Intelligent Technique for Identifying Abnormalities from Brain Signal Data.",
                    "Where Should I Go? A Deep Learning Approach to Personalize Type-Based Facet Ranking for POI Suggestion.",
                    "Modeling Without Sharing Privacy: Federated Neural Machine Translation.",
                    "Encoding the Meaning Triangle (Object, Entity, and Concept) as the Semantic Foundation for Entity Alignment.",
                    "Incorporating Network Structure with Node Information for Semi-supervised Anomaly Detection on Attributed Graphs.",
                    "OntoSP: Ontology-Based Semantic-Aware Partitioning on RDF Graphs.",
                    "Optimal Subgraph Matching Queries over Distributed Knowledge Graphs Based on Partial Evaluation.",
                    "Enhancing both Local and Global Entity Linking Models with Attention.",
                    "HyperJOIE: Two-View Hyperbolic Knowledge Graph Embedding with Entities and Concepts Jointly.",
                    "IOPE: Interactive Ontology Population and Enrichment Guided by Ontological Constraints.",
                    "Controversy Detection: A Text and Graph Neural Network Based Approach.",
                    "GMGCN: Gated Memory Graph Convolutional Network for Passenger Demand Prediction.",
                    "Event Detection in Social Media via Graph Neural Network.",
                    "Knowledge-Guided Fraud Detection Using Semi-supervised Graph Neural Network.",
                    "MSSF-GCN: Multi-scale Structural and Semantic Information Fusion Graph Convolutional Network for Controversy Detection.",
                    "A Syntax-Aware Encoder for Authorship Attribution.",
                    "Graph Attentive Leaping Connection Network for Chinese Short Text Semantic Classification.",
                    "Graph Ordering: Towards the Optimal by Learning.",
                    "Fast Approximate All Pairwise CoSimRanks via Random Projection.",
                    "Critical Nodes Identification in Large Networks: An Inclination-Based Model.",
                    "LPMA - An Efficient Data Structure for Dynamic Graph on GPUs.",
                    "Updating Maximal $(\\varDelta , \\gamma )$-Cliques of a Temporal Network Efficiently.",
                    "Web of Students: Class-Level Friendship Network Discovery from Educational Big Data.",
                    "Event Cube for Suicidal Event Analysis: A Case Study.",
                    "Cross-modal Attention Network with Orthogonal Latent Memory for Rumor Detection.",
                    "OMT: An Operate-Based Approach for Modelling Multi-topic Influence Diffusion in Online Social Networks.",
                    "Modeling User Profiles Through Multiple Types of User Interaction Behaviors.",
                    "HACK: A Hierarchical Model for Fake News Detection.",
                    "An Efficient Approach for Spatial Trajectory Anonymization.",
                    "Developing a Deep Learning Based Approach for Anomalies Detection from EEG Data.",
                    "Dynamic Transit Flow Graph Prediction in Spatial-Temporal Network.",
                    "Disatra: A Real-Time Distributed Abstract Trajectory Clustering.",
                    "Extra-Budget Aware Task Assignment in Spatial Crowdsourcing.",
                    "Expert Recommendations with Temporal Dynamics of User Interest in CQA."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2021-2",
                "sub_name": "Web Information Systems Engineering - WISE 2021 - 22nd International Conference on Web Information Systems Engineering, WISE 2021, Melbourne, VIC, Australia, October 26-29, 2021, Proceedings, Part II.",
                "count": 42,
                "papers": [
                    "Efficient Feature Interactions Learning with Gated Attention Transformer.",
                    "Interactive Pose Attention Network for Human Pose Transfer.",
                    "Exploiting Intra and Inter-field Feature Interaction with Self-Attentive Network for CTR Prediction.",
                    "AMBD: Attention Based Multi-Block Deep Learning Model for Warehouse Dwell Time Prediction.",
                    "Performance Evaluation of Pre-trained Models in Sarcasm Detection Task.",
                    "News Popularity Prediction with Local-Global Long-Short-Term Embedding.",
                    "An Efficient Method for Indoor Layout Estimation with FPN.",
                    "Lightweight Network Traffic Classification Model Based on Knowledge Distillation.",
                    "RAU: An Interpretable Automatic Infection Diagnosis of COVID-19 Pneumonia with Residual Attention U-Net.",
                    "Comparison the Performance of Classification Methods for Diagnosis of Heart Disease and Chronic Conditions.",
                    "Capturing Multi-granularity Interests with Capsule Attentive Network for Sequential Recommendation.",
                    "Multi-Task Learning with Personalized Transformer for Review Recommendation.",
                    "ADQ-GNN: Next POI Recommendation by Fusing GNN and Area Division with Quadtree.",
                    "MGSAN: A Multi-granularity Self-attention Network for Next POI Recommendation.",
                    "HRFA: Don't Ignore Strangers with Different Views.",
                    "MULTIPLE: Multi-level User Preference Learning for List Recommendation.",
                    "Deep News Recommendation with Contextual User Profiling and Multifaceted Article Representation.",
                    "Intent-Aware Visualization Recommendation for Tabular Data.",
                    "Existence Conditions for Hidden Feedback Loops in Online Recommender Systems.",
                    "Retrieval-Based Factorization Machines for CTR Prediction.",
                    "Adversarial Training for a Hybrid Approach to Aspect-Based Sentiment Analysis.",
                    "A Dual Reinforcement Network for Classical and Modern Chinese Text Style Transfer.",
                    "Representation Learning for Short Text Clustering.",
                    "ReAct: A Review Comment Dataset for Actionability (and more).",
                    "Document-Level Relation Extraction with Entity Enhancement and Context Refinement.",
                    "TDM-CFC: Towards Document-Level Multi-label Citation Function Classification.",
                    "NOCOL - Nonnegative Orthogonal Constraint Outlier Learning.",
                    "Semantic Parsing with Syntax Graph of Logical Forms.",
                    "Case Study of Few-Shot Learning in Text Recognition Models.",
                    "Detecting Document Versions and Their Ordering in a Collection.",
                    "Focus on Misinformation: Improving Medical Experts' Efficiency of Misinformation Detection.",
                    "Sensory Monitoring of Physiological Functions Using IoT Based on a Model in Petri Nets.",
                    "A Multi-perspective Model of Smart Products for Designing Web-Based Services on the Production Chain.",
                    "A Multi-view Learning Approach for the Autonomic Management of Big Services.",
                    "Towards a Deep Learning-Driven Service Discovery Framework for the Social Internet of Things: A Context-Aware Approach.",
                    "Graph Data Mining in Recommender Systems.",
                    "Emerging Applications in Healthcare and Their Implications to Academia and Practice.",
                    "GPUGraphX: A GPU-Aided Distributed Graph Processing System.",
                    "SQL2Cypher: Automated Data and Query Migration from RDBMS to GDBMS.",
                    "MOBA Game Analysis System Based on Neural Networks.",
                    "FedAggs: Optimizing Aggregate Queries Evaluation in Federated RDF Systems.",
                    "JUST-Studio: A Platform for Spatio-Temporal Data Map Designing and Application Building."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st WISE 2020",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2020-1",
                "sub_name": "Web Information Systems Engineering - WISE 2020 - 21st International Conference, Amsterdam, The Netherlands, October 20-24, 2020, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "Higher-Order Graph Convolutional Embedding for Temporal Networks.",
                    "RolNE: Improving the Quality of Network Embedding with Structural Role Proximity.",
                    "Weighted Meta-Path Embedding Learning for Heterogeneous Information Networks.",
                    "A Graph Embedding Based Real-Time Social Event Matching Model for EBSNs Recommendation.",
                    "Competitor Mining from Web Encyclopedia: A Graph Embedding Approach.",
                    "Fine-Grained Semantics-Aware Heterogeneous Graph Neural Networks.",
                    "DynGCN: A Dynamic Graph Convolutional Network Based on Spatial-Temporal Modeling.",
                    "NeuLP: An End-to-End Deep-Learning Model for Link Prediction.",
                    "PLSGAN: A Power-Law-modified Sequential Generative Adversarial Network for Graph Generation.",
                    "User Profile Linkage Across Multiple Social Platforms.",
                    "Budgeted Influence Maximization with Tags in Social Networks.",
                    "Modeling Implicit Communities from Geo-Tagged Event Traces Using Spatio-Temporal Point Processes.",
                    "Detecting Social Spammers in Sina Weibo Using Extreme Deep Factorization Machine.",
                    "Clustering Hashtags Using Temporal Patterns.",
                    "Nonnegative Residual Matrix Factorization for Community Detection.",
                    "Fast Algorithm for Distance Dynamics-Based Community Detection.",
                    "A Hybrid Index for Distance Queries.",
                    "DySky: Dynamic Skyline Queries on Uncertain Graphs.",
                    "Leveraging Double Simulation to Efficiently Evaluate Hybrid Patterns on Data Graphs.",
                    "Knowledge-Infused Pre-trained Models for KG Completion.",
                    "TransMVG: Knowledge Graph Embedding Based on Multiple-Valued Gates.",
                    "ADKT: Adaptive Deep Knowledge Tracing.",
                    "MULCE: Multi-level Canonicalization with Embeddings of Open Knowledge Bases.",
                    "Encoding Knowledge Graph Entity Aliases in Attentive Neural Network for Wikidata Entity Linking.",
                    "Improving Entity Linking with Graph Networks.",
                    "Accurate Indoor Positioning Prediction Using the LSTM and Grey Model.",
                    "Bus Travel-Time Prediction Based on Deep Spatio-Temporal Model.",
                    "TraSP: A General Framework for Online Trajectory Similarity Processing.",
                    "Indicators for Measuring Tourist Mobility.",
                    "Modeling Local and Global Flow Aggregation for Traffic Flow Forecasting.",
                    "NSA-Net: A NetFlow Sequence Attention Network for Virtual Private Network Traffic Detection.",
                    "Spatial and Temporal Pricing Approach for Tasks in Spatial Crowdsourcing.",
                    "Attention-Based High-Order Feature Interactions to Enhance the Recommender System for Web-Based Knowledge-Sharing Service.",
                    "Designing Context-Based Services for Resilient Cyber Physical Production Systems.",
                    "A Novel Repair-Based Multi-objective Algorithm for QoS-Constrained Distributed Data-Intensive Web Service Composition.",
                    "Heuristics Based Mosaic of Social-Sensor Services for Scene Reconstruction.",
                    "Fast Build Top-k Lightweight Service-Based Systems.",
                    "Comparison of Text-Based and Feature-Based Semantic Similarity Between Android Apps.",
                    "Subjective Metrics-Based Cloud Market Performance Prediction.",
                    "Towards Web-Scale and Energy-Efficient Hybrid SDNs: Deployment Optimization and Fine-Grained Link State Management."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2020-2",
                "sub_name": "Web Information Systems Engineering - WISE 2020 - 21st International Conference, Amsterdam, The Netherlands, October 20-24, 2020, Proceedings, Part II.",
                "count": 41,
                "papers": [
                    "TaskGenie: Crowd-Powered Task Generation for Struggling Search.",
                    "Search Engine Similarity Analysis: A Combined Content and Rankings Approach.",
                    "Evaluating Similarity Measures for Dataset Search.",
                    "Towards Efficient Retrieval of Top-k Entities in Systems of Engagement.",
                    "A Compare-Aggregate Model with External Knowledge for Query-Focused Summarization.",
                    "An Active Learning Based Hybrid Neural Network for Joint Information Extraction.",
                    "ABLA: An Algorithm for Repairing Structure-Based Locators Through Attribute Annotations.",
                    "Automatic Action Extraction for Short Text Conversation Using Unsupervised Learning.",
                    "Topic Analysis by Exploring Headline Information.",
                    "A Text Mining Approach to Extract and Rank Innovation Insights from Research Projects.",
                    "Automatic Complex Word Identification Using Implicit Feedback from User Copy Operations.",
                    "A Densely Connected Encoder Stack Approach for Multi-type Legal Machine Reading Comprehension.",
                    "Privacy-Preserving Data Generation and Sharing Using Identification Sanitizer.",
                    "Robust Blockchain-Based Cross-Platform Audio Copyright Protection System Using Content-Based Fingerprint.",
                    "Distributed Differential Evolution for Anonymity-Driven Vertical Fragmentation in Outsourced Data Storage.",
                    "A Graph Data Privacy-Preserving Method Based on Generative Adversarial Networks.",
                    "Channel Correlation Based Robust Audio Watermarking Mechanism for Stereo Signals.",
                    "Adaptive Online Learning for Vulnerability Exploitation Time Prediction.",
                    "Double-Wing Mixture of Experts for Streaming Recommendations.",
                    "Modelling Local and Global Dependencies for Next-Item Recommendations.",
                    "Why-Not Questions & Explanations for Collaborative Filtering.",
                    "Learning from Multiple Graphs of Student and Book Interactions for Campus Book Recommendation.",
                    "A Clustering-Based Collaborative Filtering Recommendation Algorithm via Deep Learning User Side Information.",
                    "Path-Based Academic Paper Recommendation.",
                    "A Slice-Based Method to Speed Up Join View Maintenance for Transactions.",
                    "A Chunk-Based Hash Table Caching Method for In-Memory Hash Joins.",
                    "An Asynchronous View Maintenance Approach Based on IO Sharing.",
                    "AQapprox: Aggregation Queries Approximation with Distribution-Aware Online Sampling.",
                    "LogRank+: A Novel Approach to Support Business Process Event Log Sampling.",
                    "ProvONE+: A Provenance Model for Scientific Workflows.",
                    "Fair Outlier Detection.",
                    "A New Effective and Efficient Measure for Outlying Aspect Mining.",
                    "Time Series Data Cleaning Based on Dynamic Speed Constraints.",
                    "Predicting MOOCs Dropout with a Deep Model.",
                    "RFRSF: Employee Turnover Prediction Based on Random Forests and Survival Analysis.",
                    "A Deep Sequence-to-Sequence Method for Aircraft Landing Speed Prediction Based on QAR Data.",
                    "Fine-grained Multi-label Sexism Classification Using Semi-supervised Learning.",
                    "aDFR: An Attention-Based Deep Learning Model for Flight Ranking.",
                    "Dealing with Ratio Metrics in A/B Testing at the Presence of Intra-user Correlation and Segments.",
                    "Risk Monitoring Services of Discharged SARS-CoV-2 Patients.",
                    "UAVFog-Assisted Data-Driven Disaster Response: Architecture, Use Case, and Challenges."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th WISE 2019",
        "info": "Hong Kong, SAR, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2019",
                "sub_name": "Web Information Systems Engineering - WISE 2019 - 20th International Conference, Hong Kong, China, November 26-30, 2019, Proceedings.",
                "count": 50,
                "papers": [
                    "GroExpert: A Novel Group-Aware Experts Identification Approach in Crowdsourcing.",
                    "Detecting Fraudulent Accounts on Blockchain: A Supervised Approach.",
                    "Locking Mechanism for Concurrency Conflicts on Hyperledger Fabric.",
                    "Handling Conditional Queries on Hyperledger Fabric Efficiently.",
                    "Learning to Fuse Multiple Semantic Aspects from Rich Texts for Stock Price Prediction.",
                    "Transfer Learning via Feature Selection Based Nonnegative Matrix Factorization.",
                    "Learning Restricted Deterministic Regular Expressions with Counting.",
                    "Generating Adversarial Examples by Adversarial Networks for Semi-supervised Learning.",
                    "Dual Path Convolutional Neural Network for Student Performance Prediction.",
                    "A Case Based Deep Neural Network Interpretability Framework and Its User Study.",
                    "Personalized Book Recommendation Based on a Deep Learning Model and Metadata.",
                    "DINRec: Deep Interest Network Based API Recommendation Approach for Mashup Creation.",
                    "Co-purchaser Recommendation Based on Network Embedding.",
                    "Community-Based Recommendations on Twitter: Avoiding the Filter Bubble.",
                    "Memory-Augmented Attention Network for Sequential Recommendation.",
                    "Multi-head Attentive Social Recommendation.",
                    "CPL: A Combined Framework of Pointwise Prediction and Learning to Rank for top-N Recommendations with Implicit Feedback.",
                    "RTIM: A Real-Time Influence Maximization Strategy.",
                    "LSCMiner: Efficient Low Support Closed Itemsets Mining.",
                    "Pattern Filtering Attention for Distant Supervised Relation Extraction via Online Clustering.",
                    "Adaptive Rule Adaptation in Unstructured and Dynamic Environments.",
                    "Shadowed Authorization Policies - A Disaster Waiting to Happen?",
                    "A Dynamic Decision-Making Method Based on Ensemble Methods for Complex Unbalanced Data.",
                    "Collaborative Wireframing for Model-Driven Web Engineering.",
                    "Handling Disagreement in Ontologies-Based Reasoning via Argumentation.",
                    "A Cost-Efficient Multi-cloud Orchestrator for Benchmarking Containerized Web-Applications.",
                    "Highlighting Weasel Sentences for Promoting Critical Information Seeking on the Web.",
                    "Generating an Evolving Skills Network from Job Adverts for High-Demand Skillset Discovery.",
                    "Picture News Collection: A Dataset for Automatic Picture News Thumbnail Selection.",
                    "A Graph-Based Approach to Explore Relationship Between Hashtags and Images.",
                    "RDF Graph Anonymization Robust to Data Linkage.",
                    "WebEL: Improving Entity Linking with Extra Web Contexts.",
                    "Entity Disambiguation Based on Parse Tree Neighbours on Graph Attention Network.",
                    "Bibliographic Name Disambiguation with Graph Convolutional Network.",
                    "Semi-supervised Graph Embedding for Multi-label Graph Node Classification.",
                    "Structural Role Enhanced Attributed Network Embedding.",
                    "Context-Aware Temporal Knowledge Graph Embedding.",
                    "Interaction Graph Neural Network for News Recommendation.",
                    "Gated Relational Graph Neural Network for Semi-supervised Learning on Knowledge Graphs.",
                    "Multiple Interaction Attention Model for Open-World Knowledge Graph Completion.",
                    "OntoDS: An Ontology-Aware Distributed Storage Scheme for RDF Graphs.",
                    "Learning Relational Fractals for Deep Knowledge Graph Embedding in Online Social Networks.",
                    "Parameter-Free Structural Diversity Search.",
                    "CoreCube: Core Decomposition in Multilayer Graphs.",
                    "Computing Maximum Independent Sets over Large Sparse Graphs.",
                    "Fast Algorithms for Intimate-Core Group Search in Weighted Graphs.",
                    "Unsupervised Ontology- and Sentiment-Aware Review Summarization.",
                    "Enriching the Context: Methods of Improving the Non-contextual Assessment of Sentence Credibility.",
                    "ConceptMap: A Conceptual Approach for Formulating User Preferences in Large Information Spaces.",
                    "Helpfulness Prediction for Online Reviews with Explicit Content-Rating Interaction."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2019s",
                "sub_name": "Web Information Systems Engineering - WISE 2019 Workshop, Demo, and Tutorial, Hong Kong and Macau, China, January 19-22, 2020, Revised Selected Papers.",
                "count": 15,
                "papers": [
                    "Knowledge Graph Data Management: Models, Methods, and Systems.",
                    "Local Differential Privacy: Tools, Challenges, and Opportunities.",
                    "Intelligent Knowledge Lakes: The Age of Artificial Intelligence and Big Data.",
                    "Tourism Analysis on Graphs with Neo4Tourism.",
                    "Personalised Drug Prescription for Dental Clinics Using Word Embedding.",
                    "NRGQP: A Graph-Based Query Platform for Network Reachability.",
                    "ReInCre: Enhancing Collaborative Filtering Recommendations by Incorporating User Rating Credibility.",
                    "SLIND+: Stable LINk Detection.",
                    "Efficient Privacy-Preserving Skyline Queries over Outsourced Cloud.",
                    "Leveraging Pattern Mining Techniques for Efficient Keyword Search on Data Graphs.",
                    "Range Nearest Neighbor Query with the Direction Constraint.",
                    "Cloud Service Access Frequency Estimation Based on a Stream Filtering Method.",
                    "Influence Maximization Based on Community Closeness in Social Networks.",
                    "Can Reinforcement Learning Enhance Social Capital?",
                    "A Novel Event Detection Model Based on Graph Convolutional Network."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "19th WISE 2018",
        "info": "Dubai, United Arab Emirates",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2018-1",
                "sub_name": "Web Information Systems Engineering - WISE 2018 - 19th International Conference, Dubai, United Arab Emirates, November 12-15, 2018, Proceedings, Part I.",
                "count": 34,
                "papers": [
                    "Inter-organizational Business Processes Managed by Blockchain.",
                    "Decentralized Voting: A Self-tallying Voting System Using a Smart Contract on the Ethereum Blockchain.",
                    "Enabling Blockchain for Efficient Spatio-Temporal Query Processing.",
                    "A Robust Spatio-Temporal Verification Protocol for Blockchain.",
                    "Towards an End-to-End IoT Data Privacy-Preserving Framework Using Blockchain Technology.",
                    "i2kit: A Deployment Tool with the Simplicity of Containers and the Security of Virtual Machines.",
                    "Gradient Correlation: Are Ensemble Classifiers More Robust Against Evasion Attacks in Practical Settings?",
                    "An Improved Lightweight RFID Authentication Protocol for Internet of Things.",
                    "Dynamic Transitions of States for Context-Sensitive Access Control Decision.",
                    "CoRank: A Coupled Dual Networks Approach to Trust Evaluation on Twitter.",
                    "Social Context-Aware Trust Prediction: Methods for Identifying Fake News.",
                    "Privacy Preserving Social Network Against Dopv Attacks.",
                    "A Hybrid Approach for Detecting Spammers in Online Social Networks.",
                    "DUAL: A Deep Unified Attention Model with Latent Relation Representations for Fake News Detection.",
                    "Extracting Representative User Subset of Social Networks Towards User Characteristics and Topological Features.",
                    "Group Identity Matching Across Heterogeneous Social Networks.",
                    "NANE: Attributed Network Embedding with Local and Global Information.",
                    "Topical Authority-Sensitive Influence Maximization.",
                    "SensorTree: Bursty Propagation Trees as Sensors for Protest Event Detection.",
                    "Claim Retrieval in Twitter.",
                    "PUB: Product Recommendation with Users' Buying Intents on Microblogs.",
                    "Learning Concept Hierarchy from Short Texts Using Context Coherence.",
                    "Eliminating Temporal Conflicts in Uncertain Temporal Knowledge Graphs.",
                    "Renovating Watts and Strogatz Random Graph Generation by a Sequential Approach.",
                    "Which Type of Classifier to Use for Networked Data, Connectivity Based or Feature Based?",
                    "Diversified and Verbalized Result Summarization for Semantic Association Search.",
                    "Main Content Extraction from Heterogeneous Webpages.",
                    "Bootstrapped Multi-level Distant Supervision for Relation Extraction.",
                    "On the Discovery of Continuous Truth: A Semi-supervised Approach with Partial Ground Truths.",
                    "Web Page Template and Data Separation for Better Maintainability.",
                    "Combining Contextual Information by Self-attention Mechanism in Convolutional Neural Networks for Text Classification.",
                    "Cpriori: An Index-Based Framework to Extract the Generalized Center Strings.",
                    "Topic-Net Conversation Model.",
                    "A Hybrid Model Reuse Training Approach for Multilingual OCR."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2018-2",
                "sub_name": "Web Information Systems Engineering - WISE 2018 - 19th International Conference, Dubai, United Arab Emirates, November 12-15, 2018, Proceedings, Part II.",
                "count": 35,
                "papers": [
                    "SARFM: A Sentiment-Aware Review Feature Mapping Approach for Cross-Domain Recommendation.",
                    "Integrating Collaborative Filtering and Association Rule Mining for Market Basket Recommendation.",
                    "Unified User and Item Representation Learning for Joint Recommendation in Social Network.",
                    "Geographical Proximity Boosted Recommendation Algorithms for Real Estate.",
                    "Cross-domain Recommendation with Consistent Knowledge Transfer by Subspace Alignment.",
                    "D-ECG: A Dynamic Framework for Cardiac Arrhythmia Detection from IoT-Based ECGs.",
                    "Jointly Predicting Affective and Mental Health Scores Using Deep Neural Networks of Visual Cues on the Web.",
                    "Preserving Data Privacy and Security in Australian My Health Record System: A Quality Health Care Implication.",
                    "A Framework for Processing Cumulative Frequency Queries over Medical Data Streams.",
                    "Knowledge-Driven Automated Web Service Composition - An EDA-Based Approach.",
                    "A CP-Net Based Qualitative Composition Approach for an IaaS Provider.",
                    "LIFE-MP: Online Virtual Machine Consolidation with Multiple Resource Usages in Cloud Environments.",
                    "Stance and Credibility Based Trust in Social-Sensor Cloud Services.",
                    "StrDip: A Fast Data Stream Clustering Algorithm Using the Dip Test of Unimodality.",
                    "Classification and Annotation of Open Internet of Things Datastreams.",
                    "Efficient Auto-Increment Keys Generation for Distributed Log-Structured Storage Systems.",
                    "A Parallel Joinless Algorithm for Co-location Pattern Mining Based on Group-Dependent Shard.",
                    "Improving Maximum Classifier Discrepancy by Considering Joint Distribution for Domain Adaptation.",
                    "Density Biased Sampling with Locality Sensitive Hashing for Outlier Detection.",
                    "A Novel Technique of Using Coupled Matrix and Greedy Coordinate Descent for Multi-view Data Representation.",
                    "Data-Augmented Regression with Generative Convolutional Network.",
                    "Towards Automatic Complex Feature Engineering.",
                    "Entity Linking Facing Incomplete Knowledge Base.",
                    "User Identity Linkage with Accumulated Information from Neighbouring Anchor Links.",
                    "Mining High-Quality Fine-Grained Type Information from Chinese Online Encyclopedias.",
                    "Semantics-Enabled Personalised Urban Data Exploration.",
                    "Recommendation for MOOC with Learner Neighbors and Learning Series.",
                    "In-depth Exploration of Engagement Patterns in MOOCs.",
                    "Topic Evolution Models for Long-Running MOOCs.",
                    "Neuroscientific User Models: The Source of Uncertain User Feedback and Potentials for Improving Web Personalisation.",
                    "Modeling New and Old Editors' Behaviors in Different Languages of Wikipedia.",
                    "A Novel Incremental Dictionary Learning Method for Low Bit Rate Speech Streaming.",
                    "Identifying Price Index Classes for Electricity Consumers via Dynamic Gradient Boosting.",
                    "Big Data Exploration for Smart Manufacturing Applications.",
                    "Dark Web Markets: Turning the Lights on AlphaBay."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2018quat",
                "sub_name": "Data Quality and Trust in Big Data - 5th International Workshop, QUAT 2018, Held in Conjunction with WISE 2018, Dubai, UAE, November 12-15, 2018, Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "A Novel Data Quality Metric for Minimality.",
                    "Automated Schema Quality Measurement in Large-Scale Information Systems.",
                    "Email Importance Evaluation in Mailing List Discussions.",
                    "SETTRUST: Social Exchange Theory Based Context-Aware Trust Prediction in Online Social Networks.",
                    "CNR: Cross-network Recommendation Embedding User's Personality.",
                    "Firefly Algorithm with Proportional Adjustment Strategy.",
                    "A Formal Taxonomy of Temporal Data Defects.",
                    "Data-Intensive Computing Acceleration with Python in Xilinx FPGA.",
                    "Delone and McLean IS Success Model for Evaluating Knowledge Sharing."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "18th WISE 2017",
        "info": "Puschino, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2017-1",
                "sub_name": "Web Information Systems Engineering - WISE 2017 - 18th International Conference, Puschino, Russia, October 7-11, 2017, Proceedings, Part I.",
                "count": 36,
                "papers": [
                    "A Refined Method for Detecting Interpretable and Real-Time Bursty Topic in Microblog Stream.",
                    "Connecting Targets to Tweets: Semantic Attention-Based Model for Target-Specific Stance Detection.",
                    "A Network Based Stratification Approach for Summarizing Relevant Comment Tweets of News Articles.",
                    "Interpreting Reputation Through Frequent Named Entities in Twitter.",
                    "Discovering and Tracking Active Online Social Groups.",
                    "Dynamic Relationship Building: Exploitation Versus Exploration on a Social Network.",
                    "Social Personalized Ranking Embedding for Next POI Recommendation.",
                    "Assessment of Prediction Techniques: The Impact of Human Uncertainty.",
                    "Incremental Structural Clustering for Dynamic Networks.",
                    "Extractive Summarization via Overlap-Based Optimized Picking.",
                    "Spatial Information Recognition in Web Documents Using a Semi-supervised Machine Learning Method.",
                    "When Will a Repost Cascade Settle Down?",
                    "Mining Co-location Patterns with Dominant Features.",
                    "Maximal Sub-prevalent Co-location Patterns and Efficient Mining Algorithms.",
                    "Overlapping Communities Meet Roles and Respective Behavioral Patterns in Networks with Node Attributes.",
                    "Efficient Approximate Entity Matching Using Jaro-Winkler Distance.",
                    "Long-Term Multi-objective Task Scheduling with Diff-Serv in Hybrid Clouds.",
                    "Online Cost-Aware Service Requests Scheduling in Hybrid Clouds for Cloud Bursting.",
                    "Adaptive Deployment of Service-Based Processes into Cloud Federations.",
                    "Towards a Public Cloud Services Registry.",
                    "Location-Based Top-k Term Querying over Sliding Window.",
                    "A Kernel-Based Approach to Developing Adaptable and Reusable Sensor Retrieval Systems for the Web of Things.",
                    "Reliable Retrieval of Top-k Tags.",
                    "Estimating Support Scores of Autism Communities in Large-Scale Web Information Systems.",
                    "DTRP: A Flexible Deep Framework for Travel Route Planning.",
                    "Taxi Route Recommendation Based on Urban Traffic Coulomb's Law.",
                    "Efficient Order-Sensitive Activity Trajectory Search.",
                    "Time Series Classification by Modeling the Principal Shapes.",
                    "Effective Caching of Shortest Travel-Time Paths for Web Mapping Mashup Systems.",
                    "Discovering Hierarchical Subgraphs of K-Core-Truss.",
                    "Efficient Subgraph Matching on Non-volatile Memory.",
                    "Influenced Nodes Discovery in Temporal Contact Network.",
                    "Tracking Clustering Coefficient on Dynamic Graph via Incremental Random Walk.",
                    "Event Cube - A Conceptual Framework for Event Modeling and Analysis.",
                    "Cross-Domain and Cross-Modality Transfer Learning for Multi-domain and Multi-modality Event Detection.",
                    "Determining Repairing Sequence of Inconsistencies in Content-Related Data."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2017-2",
                "sub_name": "Web Information Systems Engineering - WISE 2017 - 18th International Conference, Puschino, Russia, October 7-11, 2017, Proceedings, Part II.",
                "count": 45,
                "papers": [
                    "Real-Time Target Tracking Through Mobile Crowdsensing.",
                    "Crowdsourced Entity Alignment: A Decision Theory Based Approach.",
                    "A QoS-Aware Online Incentive Mechanism for Mobile Crowd Sensing.",
                    "Iterative Reduction Worker Filtering for Crowdsourced Label Aggregation.",
                    "Semantic Web Datatype Inference: Towards Better RDF Matching.",
                    "Cross-Cultural Web Usability Model.",
                    "How Fair Is Your Network to New and Old Objects?: A Modeling of Object Selection in Web Based User-Object Networks.",
                    "Modeling Complementary Relationships of Cross-Category Products for Personal Ranking.",
                    "Eliminating Incorrect Cross-Language Links in Wikipedia.",
                    "Combining Local and Global Features in Supervised Word Sense Disambiguation.",
                    "A Concurrent Interdependent Service Level Agreement Negotiation Protocol in Dynamic Service-Oriented Computing Environments.",
                    "A New Static Web Caching Mechanism Based on Mutual Dependency Between Result Cache and Posting List Cache.",
                    "A Large-Scale Visual Check-In System for TV Content-Aware Web with Client-Side Video Analysis Offloading.",
                    "A Robust and Fast Reputation System for Online Rating Systems.",
                    "The Automatic Development of SEO-Friendly Single Page Applications Based on HIJAX Approach.",
                    "Towards Intelligent Web Crawling - A Theme Weight and Bayesian Page Rank Based Approach.",
                    "Efficient Multi-version Storage Engine for Main Memory Data Store.",
                    "WeDGeM: A Domain-Specific Evaluation Dataset Generator for Multilingual Entity Linking Systems.",
                    "Extracting Web Content by Exploiting Multi-Category Characteristics.",
                    "PrivacySafer: Privacy Adaptation for HTML5 Web Applications.",
                    "Anonymity-Based Privacy-Preserving Task Assignment in Spatial Crowdsourcing.",
                    "Understanding Evasion Techniques that Abuse Differences Among JavaScript Implementations.",
                    "Mining Representative Patterns Under Differential Privacy.",
                    "A Survey on Security as a Service.",
                    "Exploring the Impact of Co-Experiencing Stressor Events for Teens Stress Forecasting.",
                    "SGMR: Sentiment-Aligned Generative Model for Reviews.",
                    "An Ontology-Enhanced Hybrid Approach to Aspect-Based Sentiment Analysis.",
                    "DARE to Care: A Context-Aware Framework to Track Suicidal Ideation on Social Media.",
                    "Local Top-N Recommendation via Refined Item-User Bi-Clustering.",
                    "HOMMIT: A Sequential Recommendation for Modeling Interest-Transferring via High-Order Markov Model.",
                    "Modeling Implicit Communities in Recommender Systems.",
                    "Coordinating Disagreement and Satisfaction in Group Formation for Recommendation.",
                    "Factorization Machines Leveraging Lightweight Linked Open Data-Enabled Features for Top-N Recommendations.",
                    "A Fine-Grained Latent Aspects Model for Recommendation: Combining Each Rating with Its Associated Review.",
                    "Auxiliary Service Recommendation for Online Flight Booking.",
                    "How Does Fairness Matter in Group Recommendation.",
                    "Exploiting Users' Rating Behaviour to Enhance the Robustness of Social Recommendation.",
                    "A Study on Securing Software Defined Networks.",
                    "A Verifiable Ranked Choice Internet Voting System.",
                    "Privacy Preserving Location Recommendations.",
                    "Botnet Command and Control Architectures Revisited: Tor Hidden Services and Fluxing.",
                    "My Face is Mine: Fighting Unpermitted Tagging on Personal/Group Photos in Social Media.",
                    "Cryptographic Access Control in Electronic Health Record Systems: A Security Implication.",
                    "SDN-based Dynamic Policy Specification and Enforcement for Provisioning SECaaS in Cloud.",
                    "Topic Detection with Locally Weighted Semi-supervised Collective Learning."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th WISE 2016",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2016-1",
                "sub_name": "Web Information Systems Engineering - WISE 2016 - 17th International Conference, Shanghai, China, November 8-10, 2016, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "Attribute-Based Influence Maximization in Social Networks.",
                    "Twitter Normalization via 1-to-N Recovering.",
                    "A Data Cleaning Method for CiteSeer Dataset.",
                    "Towards Understanding URL Resources in Recent Sina Weibo.",
                    "Nonparametric Bayesian Probabilistic Latent Factor Model for Group Recommender Systems.",
                    "Joint User Knowledge and Matrix Factorization for Recommender Systems.",
                    "GEMRec: A Graph-Based Emotion-Aware Music Recommendation Approach.",
                    "Domain Dictionary-Based Topic Modeling for Social Text.",
                    "Towards an Impact-Driven Quality Control Model for Imbalanced Crowdsourcing Tasks.",
                    "Modeling and Analyzing Engagement in Social Network Challenges.",
                    "Select, Link and Rank: Diversified Query Expansion and Entity Ranking Using Wikipedia.",
                    "Multi-dimension Diversification in Legal Information Retrieval.",
                    "Generating Multiple Diverse Summaries.",
                    "Diversifying the Results of Keyword Queries on Linked Data.",
                    "Semantic Similarity of Workflow Traces with Various Granularities.",
                    "Intermediate Semantics Based Distance Metric Learning for Video Annotation and Similarity Measurements.",
                    "A Community Detection Algorithm Considering Edge Betweenness and Vertex Similarity.",
                    "Measuring and Ensuring Similarity of User Interfaces: The Impact of Web Layout.",
                    "Semantic Context-Aware Recommendation via Topic Models Leveraging Linked Open Data.",
                    "Optimizing Factorization Machines for Top-N Context-Aware Recommendations.",
                    "Taxonomy Tree Based Similarity Measurement of Textual Attributes of Items for Recommender Systems.",
                    "A Personalized Recommendation Algorithm for User-Preference Similarity Through the Semantic Analysis.",
                    "Learning-Based SPARQL Query Performance Prediction.",
                    "Can Online Emotions Predict the Stock Market in China?",
                    "Predicting Replacement of Smartphones with Mobile App Usage.",
                    "Real Time Prediction on Revisitation Behaviors of Short-Term Type Commodities.",
                    "Parallel Materialization of Datalog Programs with Spark for Scalable Reasoning.",
                    "A Data Type-Driven Property Alignment Framework for Product Duplicate Detection on the Web.",
                    "A Semantic Data Parallel Query Method Based on Hadoop.",
                    "A Strategy to Improve Accuracy of Multi-dimensional Feature Forecasting in Big Data Stream Computing Environments.",
                    "Automatic Creation and Analysis of a Linked Data Cloud Diagram.",
                    "Fast Multi-keywords Search over Encrypted Cloud Data.",
                    "A Scalable Parallel Semantic Reasoning Algorithm-Based on RDFS Rules on Hadoop.",
                    "Cloud Resource Allocation from the User Perspective: A Bare-Bones Reinforcement Learning Approach.",
                    "Event Phase Extraction and Summarization.",
                    "ESAP: A Novel Approach for Cross-Platform Event Dissemination Trend Analysis Between Social Network and Search Engine.",
                    "Learning Event Profile for Improving First Story Detection in Twitter Stream.",
                    "A Novel Approach of Discovering Local Community Using Node Vector Model.",
                    "Labeled Phrase Latent Dirichlet Allocation.",
                    "WTEN: An Advanced Coupled Tensor Factorization Strategy for Learning from Imbalanced Data.",
                    "Mining Actionable Knowledge Using Reordering Based Diversified Actionable Decision Trees.",
                    "Improving Distant Supervision of Relation Extraction with Unsupervised Methods."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2016-2",
                "sub_name": "Web Information Systems Engineering - WISE 2016 - 17th International Conference, Shanghai, China, November 8-10, 2016, Proceedings, Part II.",
                "count": 36,
                "papers": [
                    "Dynamic Topic-Based Sentiment Analysis of Large-Scale Online News.",
                    "Improving Object and Event Monitoring on Twitter Through Lexical Analysis and User Profiling.",
                    "Aspect-Based Sentiment Analysis Using Lexico-Semantic Patterns.",
                    "Multilevel Browsing of Folksonomy-Based Digital Collections.",
                    "Faderank: An Incremental Algorithm for Ranking Twitter Users.",
                    "Personalized Re-ranking of Tweets.",
                    "Ranking Microblog Users via URL Biased Posts.",
                    "Identifying Implicit Enterprise Users from the Imbalanced Social Data.",
                    "Understanding Factors That Affect Web Traffic via Twitter.",
                    "Analysis of Teens' Chronic Stress on Micro-blog.",
                    "Large-Scale Stylistic Analysis of Formality in Academia and Social Media.",
                    "Discriminative Cues for Different Stages of Smoking Cessation in Online Community.",
                    "POL: A Pattern Oriented Load-Shedding for Semantic Data Stream Processing.",
                    "Unsupervised Blocking of Imbalanced Datasets for Record Matching.",
                    "Partially Decompressing Binary Interpolative Coding for Fast Query Processing.",
                    "Using Changesets for Incremental Maintenance of Linkset Views.",
                    "Graph-Based Metric Embedding for Next POI Recommendation.",
                    "Temporal Pattern Based QoS Prediction.",
                    "Searching for Data Sources for the Semantic Enrichment of Trajectories.",
                    "On Impact of Weather on Human Mobility in Cities.",
                    "Minimum Spanning Tree on Uncertain Graphs.",
                    "A Block-Based Edge Partitioning for Random Walks Algorithms over Large Social Graphs.",
                    "Differentially Private Network Data Release via Stochastic Kronecker Graph.",
                    "An Executable Specification for SPARQL.",
                    "Towards a Scalable Framework for Artifact-Centric Business Process Management Systems.",
                    "Bridging Semantic Gap Between App Names: Collective Matrix Factorization for Similar Mobile App Recommendation.",
                    "Summarizing Multimedia Content.",
                    "Bridging Enterprise and Software Engineering Through an User-Centered Design Perspective.",
                    "Region Profile Based Geo-Spatial Analytic Search.",
                    "Segmentation and Enhancement of Low Quality Fingerprint Images.",
                    "Feature Selection and Bleach Time Modelling of Paper Pulp Using Tree Based Learners.",
                    "Trust Model of Wireless Sensor Networks Based on Shannon Entropy.",
                    "Assessing the Quality and Reliability of Visual Estimates in Determining Plant Cover on Railway Embankments.",
                    "Community-Based Message Transmission with Energy Efficient in Opportunistic Networks.",
                    "A Multi-Semantic Classification Model of Reviews Based on Directed Weighted Graph.",
                    "Data Warehouse Quality Assessment Using Contexts."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16th WISE 2015",
        "info": "Miami, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2015-1",
                "sub_name": "Web Information Systems Engineering - WISE 2015 - 16th International Conference, Miami, FL, USA, November 1-3, 2015, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "Grouping Product Aspects from Short Texts Using Multiple Classifiers.",
                    "Time-Dependent Popular Routes Based Trajectory Outlier Detection.",
                    "Temporally Enhanced Ontologies in OWL: A Shared Conceptual Model and Reference Implementation.",
                    "HV: A Feature Based Method for Trajectory Dataset Profiling.",
                    "A Dynamically Extensible Open Cross-Document Link Service.",
                    "Twitter Sarcasm Detection Exploiting a Context-Based Model.",
                    "Ranked Reverse Boolean Spatial Keyword Nearest Neighbors Search.",
                    "GraSS: An Efficient Method for RDF Subgraph Matching.",
                    "FreeS: A Fast Algorithm to Discover Frequent Free Subtrees Using a Novel Canonical Form.",
                    "Time-Sensitive Topic Derivation in Twitter.",
                    "OSCAR: OpenStreetMap Planet at Your Fingertips via OSm Cell ARrangements.",
                    "Creating Diverse Product Review Summaries: A Graph Approach.",
                    "Implicit Trust and Distrust Prediction for Recommender Systems.",
                    "Combining Syntactic and Semantic Evidence for Improving Matching over Linked Data Sources.",
                    "An Efficient Location-Aware Publish/Subscribe Index with Boolean Expressions.",
                    "EPC Graph Information Service - Enhanced Object Traceability on Unified and Linked EPCIS Events.",
                    "A Mashup Architecture with Modeling and Simulation as a Service.",
                    "Temporal PageRank on Social Networks.",
                    "Improving Marketing Interactions by Mining Sequences.",
                    "A Majority of Wrongs Doesn't Make It Right - On Crowdsourcing Quality for Skewed Domain Tasks.",
                    "Modelling Processes of Big Data Analytics.",
                    "WISEngineering: Achieving Scalability and Extensibility in Massive Online Learning.",
                    "A Non-parametric Approach to the Multi-channel Attribution Problem.",
                    "A Dynamic-Static Approach of Model Fusion for Document Similarity Computation.",
                    "Genetic-Based Approach for ATS and SLA-aware Web Services Composition.",
                    "Crawling Ranked Deep Web Data Sources.",
                    "Influence Maximization in Signed Social Networks.",
                    "Analyzing File-to-File Relation Network in Malware Detection.",
                    "Similarity-Based Context-Aware Recommendation.",
                    "ECS: A Framework for Diversified and Relevant Search in the Internet of Things.",
                    "Sense and Focus: Towards Effective Location Inference and Event Detection on Twitter.",
                    "A Hybrid Feature Selection Method for Predicting User Influence on Twitter.",
                    "Classifying Perspectives on Twitter: Immediate Observation, Affection, and Speculation.",
                    "Evaluating k Nearest Neighbor Query on Road Networks with no Information Leakage.",
                    "Similarity Search over Personal Process Description Graph.",
                    "A Multilingual Approach to Discover Cross-Language Links in Wikipedia.",
                    "Adaptive Focused Crawling of Linked Data.",
                    "Trust-Based Coalition Formation for Dynamic Service Composition in Social Networks.",
                    "Towards a Burglary Risk Profiler Using Demographic and Spatial Factors.",
                    "Extract Knowledge About Geo-Location Using Context and Content Information of Geo-Tagged Social Media."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2015-2",
                "sub_name": "Web Information Systems Engineering - WISE 2015 - 16th International Conference, Miami, FL, USA, November 1-3, 2015, Proceedings, Part II.",
                "count": 44,
                "papers": [
                    "The Influence of Client Platform on Web Page Content: Measurements, Analysis, and Implications.",
                    "Aspect and Ratings Inference with Aspect Ratings: Supervised Generative Models for Mining Hotel Reviews.",
                    "A Web-Based Application for Semantic-Driven Food Recommendation with Reference Prescriptions.",
                    "Incorporating Cohesiveness into Keyword Search on Linked Data.",
                    "Privacy-Enhancing Range Query Processing over Encrypted Cloud Databases.",
                    "Multi-Window Based Ensemble Learning for Classification of Imbalanced Streaming Data.",
                    "A Dynamic Key Length Based Approach for Real-Time Security Verification of Big Sensing Data Stream.",
                    "Detecting Internet Hidden Paid Posters Based on Group and Individual Characteristics.",
                    "A Soft Subspace Clustering Method for Text Data Using a Probability Based Feature Weighting Scheme.",
                    "Using Web Collaboration to Create New Physical Learning Objects.",
                    "A Custom Browser Architecture to Execute Web Navigation Sequences.",
                    "File Relation Graph Based Malware Detection Using Label Propagation.",
                    "Cross-Domain Collaborative Recommendation by Transfer Learning of Heterogeneous Feedbacks.",
                    "Research on Automate Discovery of Deep Web Interfaces.",
                    "Discovering Functional Dependencies in Vertically Distributed Big Data.",
                    "Semi-supervised Document Clustering via Loci.",
                    "Differentiating Sub-groups of Online Depression-Related Communities Using Textual Cues.",
                    "A New Webpage Classification Model Based on Visual Information Using Gestalt Laws of Grouping.",
                    "Extracting Records and Posts from Forum Pages with Limited Supervision.",
                    "Improving Relation Extraction by Using an Ontology Class Hierarchy Feature.",
                    "Crisis Mapping During Natural Disasters via Text Analysis of Social Media Messages.",
                    "Tweet Location Inference Based on Contents and Temporal Association.",
                    "Finding Influential Users and Popular Contents on Twitter.",
                    "Exploring Social Network Information for Solving Cold Start in Product Recommendation.",
                    "The Detection of Multiple Dim Small Targets Based on Iterative Density Clustering and SURF Descriptor.",
                    "Collaborative Content-Based Method for Estimating User Reputation in Online Forums.",
                    "Fusion of Big RDF Data: A Semantic Entity Resolution and Query Rewriting-Based Inference Approach.",
                    "Enhancing Social Recommendation with Sentiment Communities.",
                    "Trending Topics Rank Prediction.",
                    "Moving Video Mapper and City Recorder with Geo-Referenced Videos.",
                    "WebGC Gossiping on Browsers Without a Server [Live Demo/Poster].",
                    "Service Discovery for Spontaneous Communities in Pervasive Environments.",
                    "C3PO: A Network and Application Framework for Spontaneous and Ephemeral Social Networks.",
                    "Towards a Unified Framework for Data Cleaning and Data Privacy.",
                    "A Data Quality Framework for Customer Relationship Analytics.",
                    "Inter-rater Reliability in Determining the Types of Vegetation on Railway Trackbeds.",
                    "Reliability of Manual Assessments in Determining the Types of Vegetation on Railway Tracks.",
                    "A Comparison of Patent Classifications with Clustering Analysis.",
                    "Combination of Evaluation Methods for Assessing the Quality of Service for Express Delivery Industry.",
                    "Geographical Constraint and Temporal Similarity Modeling for Point-of-Interest Recommendation.",
                    "A Classification-Based Demand Trend Prediction Model in Cloud Computing.",
                    "Query Monitoring and Analysis for Database Privacy - A Security Automata Model Approach.",
                    "Correlation-Based Deep Learning for Multimedia Semantic Concept Detection.",
                    "Social Network Privacy: Issues and Measurement."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15th WISE 2014",
        "info": "Thessaloniki, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2014-1",
                "sub_name": "Web Information Systems Engineering - WISE 2014 - 15th International Conference, Thessaloniki, Greece, October 12-14, 2014, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "Coupled Item-Based Matrix Factorization.",
                    "A Lot of Slots - Outliers Confinement in Review-Based Systems.",
                    "A Unified Model for Community Detection of Multiplex Networks.",
                    "Mining Domain-Specific Dictionaries of Opinion Words.",
                    "A Community Detection Algorithm Based on the Similarity Sequence.",
                    "A Self-learning Clustering Algorithm Based on Clustering Coefficient.",
                    "Detecting Hierarchical Structure of Community Members by Link Pattern Expansion Method.",
                    "An Effective TF/IDF-Based Text-to-Text Semantic Similarity Measure for Text Classification.",
                    "Automatically Annotating Structured Web Data Using a SVM-Based Multiclass Classifier.",
                    "Mining Discriminative Itemsets in Data Streams.",
                    "Modelling Visit Similarity Using Click-Stream Data: A Supervised Approach.",
                    "BOSTER: An Efficient Algorithm for Mining Frequent Unordered Induced Subtrees.",
                    "Phrase Queries with Inverted + Direct Indexes.",
                    "Ranking Based Activity Trajectory Search.",
                    "Topical Pattern Based Document Modelling and Relevance Ranking.",
                    "A Decremental Search Approach for Large Scale Dynamic Ridesharing.",
                    "Model-Based Search and Ranking of Web APIs across Multiple Repositories.",
                    "Common Neighbor Query-Friendly Triangulation-Based Large-Scale Graph Compression.",
                    "Continuous Monitoring of Top-k Dominating Queries over Uncertain Data Streams.",
                    "Keyword Search over Web Documents Based on Earth Mover's Distance.",
                    "iPoll: Automatic Polling Using Online Search.",
                    "Comparing the Predictive Capability of Social and Interest Affinity for Recommendations.",
                    "End-User Browser-Side Modification of Web Pages.",
                    "Mobile Phone Recommendation Based on Phone Interest.",
                    "Two Approaches to the Dataset Interlinking Recommendation Problem.",
                    "Exploiting Perceptual Similarity: Privacy-Preserving Cooperative Query Personalization.",
                    "Identifying Explicit Features for Sentiment Analysis in Consumer Reviews.",
                    "Facet Tree for Personalized Web Documents Organization.",
                    "Mobile Web User Behavior Modeling.",
                    "Effect of Mood, Social Connectivity and Age in Online Depression Community via Topic and Linguistic Analysis.",
                    "A Review Selection Method Using Product Feature Taxonomy.",
                    "A Genetic Programming Approach for Learning Semantic Information Extraction Rules from News.",
                    "Ontology-Based Management of Conflicting Products in Pixel Advertising.",
                    "Exploiting Semantic Result Clustering to Support Keyword Search on Linked Data.",
                    "Discovering Semantic Mobility Pattern from Check-in Data.",
                    "An Offline Optimal SPARQL Query Planning Approach to Evaluate Online Heuristic Planners.",
                    "Agents, Models and Semantic Integration in Support of Personal eHealth Knowledge Spaces.",
                    "Probabilistic Associations as a Proxy for Semantic Relatedness.",
                    "A Hybrid Model for Learning Semantic Relatedness Using Wikipedia-Based Features.",
                    "An Ontology-Based Approach for Product Entity Resolution on the Web."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2014-2",
                "sub_name": "Web Information Systems Engineering - WISE 2014 - 15th International Conference, Thessaloniki, Greece, October 12-14, 2014, Proceedings, Part II.",
                "count": 40,
                "papers": [
                    "Predicting Elections from Social Networks Based on Sub-event Detection and Sentiment Analysis.",
                    "Sonora: A Prescriptive Model for Message Authoring on Twitter.",
                    "A Fuzzy Model for Selecting Social Web Services.",
                    "Insights into Entity Name Evolution on Wikipedia.",
                    "Assessing the Credibility of Nodes on Multiple-Relational Social Networks.",
                    "Result Diversification for Tweet Search.",
                    "WikipEvent: Leveraging Wikipedia Edit History for Event Detection.",
                    "Feature Based Sentiment Analysis of Tweets in Multiple Languages.",
                    "Incorporating the Position of Sharing Action in Predicting Popular Videos in Online Social Networks.",
                    "An Evolution-Based Robust Social Influence Evaluation Method in Online Social Networks.",
                    "A Framework for Linking Educational Medical Objects: Connecting Web2.0 and Traditional Education.",
                    "An Ensemble Model for Cross-Domain Polarity Classification on Twitter.",
                    "A Faceted Crawler for the Twitter Service.",
                    "Diversifying Microblog Posts.",
                    "MultiMasher: Providing Architectural Support and Visual Tools for Multi-device Mashups.",
                    "MindXpres: An Extensible Content-Driven Cross-Media Presentation Platform.",
                    "Open Cross-Document Linking and Browsing Based on a Visual Plug-in Architecture.",
                    "Cost-Based Join Algorithm Selection in Hadoop.",
                    "Consistent Freshness-Aware Caching for Multi-Object Requests.",
                    "ε-Controlled-Replicate: An ImprovedControlled-Replicate Algorithm for Multi-way Spatial Join Processing on Map-Reduce.",
                    "REST as an Alternative to WSRF: A Comparison Based on the WS-Agreement Standard.",
                    "Enabling Cross-Platform Mobile Application Development: A Context-Aware Middleware.",
                    "GEAP: A Generic Approach to Predicting Workload Bursts for Web Hosted Events.",
                    "High-Payload Image-Hiding Scheme Based on Best-Block Matching and Multi-layered Syndrome-Trellis Codes.",
                    "Educational Forums at a Glance: Topic Extraction and Selection.",
                    "PDist-RIA Crawler: A Peer-to-Peer Distributed Crawler for Rich Internet Applications.",
                    "Understand the City Better: Multimodal Aspect-Opinion Summarization for Travel.",
                    "Event Processing over a Distributed JSON Store: Design and Performance.",
                    "Cleaning Environmental Sensing Data Streams Based on Individual Sensor Reliability.",
                    "Managing Incentives in Social Computing Systems with PRINGL.",
                    "Consumer Monitoring of Infrastructure Performance in a Public Cloud.",
                    "Business Export Orientation Detection through Web Content Analysis.",
                    "Towards Real Time Contextual Advertising.",
                    "On String Prioritization in Web-Based User Interface Localization.",
                    "Affective, Linguistic and Topic Patterns in Online Autism Communities.",
                    "A Product-Customer Matching Framework for Web 2.0 Applications.",
                    "Rapid Development of Interactive Applications Based on Online Social Networks.",
                    "Introducing the Public Transport Domain to the Web of Data.",
                    "Measuring and Mitigating Product Data Inaccuracy in Online Retailing.",
                    "WISE 2014 Challenge: Multi-label Classification of Print Media Articles to Topics."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2014w",
                "sub_name": "Web Information Systems Engineering - WISE 2014 Workshops - 15th International Workshops IWCSN 2014, Org2 2014, PCS 2014, and QUAT 2014, Thessaloniki, Greece, October 12-14, 2014, Revised Selected Papers.",
                "count": 19,
                "papers": [
                    "Semi-supervised Learning Algorithm for Binary Relevance Multi-label Classification.",
                    "On the Information Diffusion Between Web-Based Social Networks.",
                    "Generic Private Social Network for Knowledge Management.",
                    "Analysis of Event Logs: Behavioral Graphs.",
                    "Delineating Worker-Centered Organizational Work: Blending BPMS and Social Software Features.",
                    "Compliance of the LinkedIn Privacy Policy with the Principles of the ISO 29100: 2011 Standard.",
                    "The Use of Social Tagging in Social Business Process Management.",
                    "SocIoS API: A Data Aggregator for Accessing User Generated Content from Online Social Networks.",
                    "Integrating Social Media and Open Data in a Cloud-Based Platform for Public Sector Advertising.",
                    "A Survey on Approaches to Modeling Artifact-Centric Business Processes.",
                    "A Connectivity Based Recommendation Approach for Data Service Mashups.",
                    "Using Incentives to Analyze Social Web Services' Behaviors.",
                    "Creating and Modelling Personal Socio-Economic Networks in On-Line Banking.",
                    "Cloud-Based Video Monitoring Framework: An Approach Based on Software-Defined Networking for Addressing Scalability Problems.",
                    "Context-Awareness in Task Automation Services by Distributed Event Processing.",
                    "Data Streams Quality Evaluation for the Generation of Alarms in Health Domain.",
                    "Multilayer and Multi-agent Data Fusion in WSN.",
                    "Strategies for Data Quality Monitoring in Business Processes.",
                    "Quality Improvement Framework for Business Oriented Geo-spatial Data."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th WISE 2013",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2013-1",
                "sub_name": "Web Information Systems Engineering - WISE 2013 - 14th International Conference, Nanjing, China, October 13-15, 2013, Proceedings, Part I.",
                "count": 46,
                "papers": [
                    "Entity Correspondence with Second-Order Markov Logic.",
                    "Learning Social Relationship Strength via Matrix Co-Factorization with Multiple Kernels.",
                    "NEXIR: A Novel Web Extraction Rule Language toward a Three-Stage Web Data Extraction Model.",
                    "Heterogeneous Metric Learning for Cross-Modal Multimedia Retrieval.",
                    "Efficient Online Novelty Detection in News Streams.",
                    "Detecting Opinion Drift from Chinese Web Comments Based on Sentiment Distribution Computing.",
                    "Feature Extraction from Micro-blogs for Comparison of Products and Services.",
                    "Directional Context Helps: Guiding Semantic Relatedness Computation by Asymmetric Word Associations.",
                    "The Heterogeneous Cluster Ensemble Method Using Hubness for Clustering Text Documents.",
                    "Exploiting User Queries for Search Result Clustering.",
                    "Towards Context-Aware Social Recommendation via Trust Networks.",
                    "Personalized Recommendation on Multi-Layer Context Graph.",
                    "Recommending Tripleset Interlinking through a Social Network Approach.",
                    "Improving Rocchio Algorithm for Updating User Profile in Recommender Systems.",
                    "Time-Aware Travel Attraction Recommendation.",
                    "CGMF: Coupled Group-Based Matrix Factorization for Recommender System.",
                    "Authenticating Users of Recommender Systems Using Naive Bayes.",
                    "Taxonomy Based Personalized News Recommendation: Novelty and Diversity.",
                    "Distinguishing Social Ties in Recommender Systems by Graph-Based Algorithms.",
                    "Personalized Location-Aware QoS Prediction for Web Services Using Probabilistic Matrix Factorization.",
                    "Verifying Transactional Requirements of Web Service Compositions Using Temporal Logic Templates.",
                    "Transitional Resource Meta-model: Generating Restful Service to Implement Complex Activity.",
                    "UCOSAIS: A Framework for User-Centered Online Service Advertising Information Search.",
                    "Near Duplicate Text Detection Using Frequency-Biased Signatures.",
                    "Reconciling Folksonomic Tagging with Taxa for Bioacoustic Annotations.",
                    "Multi-relational PageRank for Tree Structure Sense Ranking.",
                    "Towards Content-Aware SPARQL Query Caching for Semantic Web Applications.",
                    "A Generic Tree-Like Index Framework in the Cloud.",
                    "Optimization of XML Queries by Using Semantics in XML Schemas and the Document Structure.",
                    "Semantic Entity Identification in Large Scale Data via Statistical Features and DT-SVM.",
                    "Efficient Computation of Multiple XML Keyword Queries.",
                    "Soft Cardinality Constraints on XML Data - How Exceptions Prove the Business Rule.",
                    "A Framework for Processing Uncertain RFID Data in Supply Chain Management.",
                    "An Ontology-Based Approach to Context-Aware Access Control for Software Services.",
                    "A Novel Method for Finding Similarities between Unordered Trees Using Matrix Data Model.",
                    "Semantic Inversion in XML Keyword Search with General Conditional Random Fields.",
                    "Automatically Training Form Classifiers.",
                    "Page-Level Wrapper Verification for Unsupervised Web Data Extraction.",
                    "Co-Learning Ranking for Query-Based Retrieval.",
                    "Fine-Grained Access Control for RDF Data on Mobile Devices.",
                    "Overview of the WISE 2013 Challenge.",
                    "Entity Extraction within Plain-Text Collections WISE 2013 Challenge - T1: Entity Linking Track.",
                    "ELS: An Efficient Entity Linking System.",
                    "Combining POS Tagging, Lucene Search and Similarity Metrics for Entity Linking.",
                    "Predicting Microblog User's Age Based on Text Information.",
                    "Predicting Users' Age Range in Micro-blog Network."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2013-2",
                "sub_name": "Web Information Systems Engineering - WISE 2013 - 14th International Conference, Nanjing, China, October 13-15, 2013, Proceedings, Part II.",
                "count": 47,
                "papers": [
                    "An Evaluation of Aggregation Techniques in Crowdsourcing.",
                    "Propagated Opinion Retrieval in Twitter.",
                    "Diversifying Tag Selection Result for Tag Clouds by Enhancing both Coverage and Dissimilarity.",
                    "Community Detection in Multi-relational Social Networks.",
                    "Community Detection in Social Media by Leveraging Interactions and Intensities.",
                    "A Novel and Model Independent Approach for Efficient Influence Maximization in Social Networks.",
                    "iPLUG: Personalized List Recommendation in Twitter.",
                    "The Irreducible Spine(s) of Undirected Networks.",
                    "Soc Web: Efficient Monitoring of Social Network Activities.",
                    "A Multiple Feature Integration Model to Infer Occupation from Social Media Records.",
                    "Recommending Interesting Landmarks Based on Geo-tags from Photo Sharing Sites.",
                    "Topical Discussions on Unstructured Microblogs: Analysis from a Geographical Perspective.",
                    "Discovering Correlated Entities from News Archives.",
                    "High Quality Microblog Extraction Based on Multiple Features Fusion and Time-Frequency Transformation.",
                    "Exploiting Structural Similarity for Automatic Information Extraction from Lists.",
                    "A Minwise Hashing Method for Addressing Relationship Extraction from Text.",
                    "Generating a Conceptual Representation of a Legacy Web Application.",
                    "AKMiner: Domain-Specific Knowledge Graph Mining from Academic Literatures.",
                    "CDR Analysis Based Telco Churn Prediction and Customer Behavior Insights: A Case Study.",
                    "Novel Client-Cloud Architecture for Scalable Instance-Intensive Workflow Systems.",
                    "A Study on the Evolution of Cooperation in Networks.",
                    "Supporting Adaptation Patterns in the Event-Driven Business Process Modeling Paradigm.",
                    "An Improved Genetic Algorithm for Service Selection under Temporal Constraints in Cloud Computing.",
                    "GEAM: A General and Event-Related Aspects Model for Twitter Event Detection.",
                    "Bitemporal Complex Event Processing of Web Event Advertisements.",
                    "An Approach for Bursty and Self-similar Workload Generation.",
                    "Spatio-temporal Event Modeling and Ranking.",
                    "Processing Ubiquitous Personal Event Streams to Provide User-Controlled Support.",
                    "On Co-occurrence Pattern Discovery from Spatio-temporal Event Stream.",
                    "The Icecite Research Paper Management System.",
                    "A Middleware for Managing Big-Data Flows.",
                    "WYSIWYM Authoring of Structured Content Based on Schema.org.",
                    "Probabilistic n-of-N Skyline Computation over Uncertain Data Streams.",
                    "An Approach for Sponsored Search Auctions Based on the Coalitional Game Theory.",
                    "Current Attitude Prediction Model Based on Game Theory.",
                    "Towards Automatic Client-Side Feature Reuse.",
                    "Solving Complex Decision-Making Problems through Agent-Matrices Cooperation.",
                    "A Cloud System for Community Extraction from Super-Large Scale Social Networks.",
                    "An Educational Tool for an Interactive Faceted Exploration of DBpedia Life Sciences Data.",
                    "DataEx: Interactive Relationship Explorer of Freebase Knowledge Repository.",
                    "Disambiguating Authors in Academic Search Engines.",
                    "A Toolkit for Simplified Web-Services Programming.",
                    "KPMCF: A Learning Model for Measuring Social Relationship Strength.",
                    "PeaCE-Ful Web Event Extraction and Processing.",
                    "KNOWLE: Searching News in the Search Pattern of Knowledge Flow.",
                    "Document Analytics through Entity Resolution.",
                    "Imagilar: A Real-Time Image Similarity Search System on Mobile Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2013w",
                "sub_name": "Web Information Systems Engineering - WISE 2013 Workshops - WISE 2013 International Workshops BigWebData, MBC, PCS, STeH, QUAT, SCEH, and STSC 2013, Nanjing, China, October 13-15, 2013, Revised Selected Papers.",
                "count": 40,
                "papers": [
                    "Large-Scale Complex Reasoning with Semantics: Approaches and Challenges.",
                    "Using Semantic Techology for Consistency Checking of Road Signs.",
                    "HG-Bitmap Join Index: A Hybrid GPU/CPU Bitmap Join Index Mechanism for OLAP.",
                    "Semantic and Qualitative Spatial Reasoning Based Road Network Modeling.",
                    "A System to Generate Mobile Data Based on Real User Behavior.",
                    "Introducing a New Scalable Data-as-a-Service Cloud Platform for Enriching Traditional Text Mining Techniques by Integrating Ontology Modelling and Natural Language Processing.",
                    "Towards Fine-Grained Verification of Application Mobility.",
                    "Matrix Factorization for User Behavior Analysis of Location-Based Social Network.",
                    "Understanding User Behavior through URL Analysis in Sina Tweets.",
                    "Towards Evaluating the Performance of Higher Education: From a Non-financial Perspective.",
                    "Dynamically Predicting the Deadlines in Time-Constrained Workflows.",
                    "A Task Selecting Algorithm for Personal Schedules in Workflow Systems.",
                    "Entity Identification in Deep Web.",
                    "Situation-Aware Data Service Composition Based on Service Hyperlinks.",
                    "Research on Service-Content-Based Web Service Selection Method.",
                    "A Petri Net Based Execution Engine for Web Service Composition.",
                    "A Method of Optimizing Multi-tenant Database Query Access.",
                    "Cloud-Based Massive Electricity Data Mining and Consumption Pattern Discovery.",
                    "Modelling Web Service Personalization with Rule Nets.",
                    "Conceptual Graph: An Approach to Improve Quality of Business Services Modeling.",
                    "Making Recommendations on Microblogs through Topic Modeling.",
                    "A Computational Model for Trust-Based Collaborative Filtering - An Empirical Study on Hotel Recommendations.",
                    "How to Decide Upon Stopping a Heuristic Algorithm in Facility-Location Problems?",
                    "How Does Different Algorithm Work When Applied on the Different Road Networks When Optimal Location of Facilities Is Searched for in Rural Areas?",
                    "Multi-indexed Graph Based Knowledge Storage System.",
                    "A Novel Approach for Customer Segmentation Based on Biclustering.",
                    "A Systematic Literature Review of Data Mining Applications in Healthcare.",
                    "Community-Based Scholar Recommendation Modeling in Academic Social Network Sites.",
                    "A Privacy Protection Solution for the Balance of Performance and Security in Cloud Computing.",
                    "Enhancing Modularity Optimization via Local Close-Knit Structures.",
                    "Detecting Hotspots in Insulin-Like Growth Factors 1 Research through MetaMap and Data Mining Technologies.",
                    "An Integrated Biomedical Ontology Mapping Strategy Based on Multiple Mapping Methods.",
                    "Generation of Semantic Data from Guidelines for Rational Use of Antibiotics.",
                    "Design and Implementation of Visualization Tools for Advanced Patient Data Generator.",
                    "Semantic Approach for Rational Use of Antibiotics: A Perspective from Clinical Research.",
                    "Using Semantic Technology for Automatic Verification of Road Signs.",
                    "A Semantically-Enabled System for Road Sign Management.",
                    "Interface Design of Semantic System for Road Sign Management.",
                    "A Linked Data-Based Framework for Personalized Services Information Retrieval in Smart City.",
                    "Taxi Travel Purpose Estimation and Characteristic Analysis Based on Multi-source Data and Semantic Reasoning - A Case Study of Beijing."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th WISE 2012",
        "info": "Paphos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2012",
                "sub_name": "Web Information Systems Engineering - WISE 2012 - 13th International Conference, Paphos, Cyprus, November 28-30, 2012. Proceedings.",
                "count": 75,
                "papers": [
                    "Improving the Performance of Pipelined Query Processing with Skipping.",
                    "Learning to Find Comparable Entities on the Web.",
                    "Sentiment Analysis by Augmenting Expectation Maximisation with Lexical Knowledge.",
                    "Event-Driven Ontology Updating.",
                    "BiCWS: Mining Cognitive Differences from Bilingual Web Search Results.",
                    "Towards a User-Centric Social Approach to Web Services Composition, Execution, and Monitoring.",
                    "On the Use of Optimal Stopping Theory for Improving Cache Consistency.",
                    "Diversifying User Comments on News Articles.",
                    "Spelling Suggestion for XML Keyword Search Based on Pairwise Keyword Summaries.",
                    "An Extended Compact TVP Index for Finding Top-k Nearest Neighbors over XML Data Tree.",
                    "Architecture-Driven Modeling of Adaptive Collaboration Structures in Large-Scale Social Web Applications.",
                    "Modeling Sovereign RFID Data Streams in Collaborative Traceable Networks.",
                    "Cost-Effective Provisioning and Scheduling of Deadline-Constrained Applications in Hybrid Clouds.",
                    "Good Quality Complementary Information for Multilingual Wikipedia.",
                    "Generating Tourism Path from Trajectories and Geo-Photos.",
                    "A Framework and a Language for On-Line Analytical Processing on Graphs.",
                    "Scenario-Driven Development of Context-Aware Adaptive Web Services.",
                    "WebPut: Efficient Web-Based Data Imputation.",
                    "Representing Service-Relationships as First Class Entities in Service Orchestrations.",
                    "Assembling the Optimal Sentiment Classifiers.",
                    "Panoramic Image Search by Similarity and Adjacency for Similar Landscape Discovery.",
                    "A Framework for Distributed Managing Uncertain Data in RFID Traceability Networks.",
                    "Controlled Knowledge Base Enrichment from Web Documents.",
                    "The Impact of Conceptualization on Text Classification.",
                    "Efficient Execution of Web Navigation Sequences.",
                    "Today's Top \"RESTful\" Services and Why They Are Not RESTful.",
                    "Event Aware Workload Prediction: A Study Using Auction Events.",
                    "Like-Minded Communities: Bringing the Familiarity and Similarity together.",
                    "Enterprise COllaboration and INteroperability (COIN) Platform: Two Case Studies in the Marine Shipping Domain.",
                    "VAM-aaS: Online Cloud Services Security Vulnerability Analysis and Mitigation-as-a-Service.",
                    "The Role of Twitter in YouTube Videos Diffusion.",
                    "Evaluating Web Archive Search Systems.",
                    "Improving Recall of Regular Expressions for Information Extraction.",
                    "Trade-Off Analysis of Elasticity Approaches for Cloud-Based Business Applications.",
                    "Extraction and Evaluation of Candidate Named Entities in Search Engine Queries.",
                    "Automated Information Extraction from Web APIs Documentation.",
                    "Exploring Content Dependencies to Better Balance Performance and Freshness in Web Database Applications.",
                    "Improving On-Demand Learning to Rank through Parallelism.",
                    "Topic-Sensitive Hidden-Web Crawling.",
                    "Can Social Features Help Learning to Rank YouTube Videos?",
                    "An Empirical Study for Determining Relevant Features for Sentiment Summarization of Online Conversational Documents.",
                    "A Meta-plugin for Bespoke Data Management in WordPress.",
                    "mNIR: Diversifying Search Results Based on a Mixture of Novelty, Intention and Relevance.",
                    "Computing Scientometrics in Large-Scale Academic Search Engines with MapReduce.",
                    "Analyzing the Effectiveness of Graph Metrics for Anomaly Detection in Online Social Networks.",
                    "An Unsupervised Technique to Extract Information from Semi-structured Web Pages.",
                    "A Space-Efficient Indexing Algorithm for Boolean Query Processing.",
                    "Detecting Wikipedia Vandalism with a Contributing Efficiency-Based Approach.",
                    "Definition and Enactment of Instance-Spanning Process Constraints.",
                    "Predicting Application Performance for Multi-vendor Clouds Using Dwarf Benchmarks.",
                    "Experiences in Building an Event-Driven and Deployable Platform as a Service.",
                    "Integrating Feature Analysis and Background Knowledge to Recommend Similarity Functions.",
                    "Securing Data Warehouses from Web-Based Intrusions.",
                    "Majority-Rule-Based Web Service Selection.",
                    "Memory-Efficient Index for Cache Invalidation Mechanism with OpenJPA.",
                    "Towards Proactive Cross-Layer Service Adaptation.",
                    "Search Intent Discovery by Structurization of Community QA Contents.",
                    "An Investigation on Repost Activity Prediction for Social Media Events.",
                    "Logical Model of Relationship for Online Social Networks and Performance Optimizing of Queries - WISE 2012 Challenge - T1: Performance Track Scalability Winner.",
                    "Predicting Retweet Behavior in Weibo Social Network.",
                    "On the Prediction of Re-tweeting Activities in Social Networks - A Report on WISE 2012 Challenge.",
                    "Acolyte: An In-Memory Social Network Query System.",
                    "Accelerating Queries over Microblog Dataset via Grouping and Indexing Techniques.",
                    "Classification-Based Prediction on the Retweet Actions over Microblog Dataset.",
                    "Predicting Retweeting Behavior Based on Autoregressive Moving Average Model.",
                    "A Fast and High Throughput SQL Query System for Big Data.",
                    "Do-It-Yourself Content Delivery Network Orchestrator.",
                    "The Semantic Web Linker: A Multilingual and Multisource Framework.",
                    "SMART: Supporting the Design and Execution of User-Centric Service-Based Applications.",
                    "WPPS: A Framework for Web Page Processing.",
                    "Information Systems for Knowledge Workers: The Kpeople Enterprise 2.0 Tool.",
                    "Intelligent and Semantic Real-Time Process of the Greek LOD for Enhancing Citizen Awareness in Public Expenditures.",
                    "PoliMaR-Web: Multi-source Semantic Matchmaking of Web APIs.",
                    "ODCleanStore: A Framework for Managing and Providing Integrated Linked Data on the Web.",
                    "An Interactive Exploratory System with Real-Time Preference Elicitation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th WISE 2011",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2012-w",
                "sub_name": "Web Information Systems Engineering - WISE 2011 and 2012 Workshops - Combined WISE 2011 and WISE 2012 Workshops, Sydney Australia, October 12-14, 2011 and Paphos, Cyprus, November 28-30, 2012, Revised Selected Papers.",
                "count": 35,
                "papers": [
                    "Preface to the Advance Reasoning Technology for eScience (ART-2012) Workshop.",
                    "Real-Time and Self-Adaptive Stream Data Analysis - (Invited Talk).",
                    "An Approach for Distributed Parallelization of Large-Scale Semantic Web Reasoners Based on MPI.",
                    "Making Web-Scale Semantic Reasoning More Service-Oriented: The Large Knowledge Collider.",
                    "Towards Integrating Emotion into Intelligent Context.",
                    "Contextual Modelling in Context-Aware Recommender Systems: A Generic Approach.",
                    "Introduction to the Proceedings of the Workshop on Cloud-enabled Business Process Management (CeBPM) 2012.",
                    "Collaborative Process Design in Cloud Environment.",
                    "Towards a Trust-Manager Service for Hybrid Clouds.",
                    "Challenges for Migrating to the Service Cloud Paradigm: An Agile Perspective.",
                    "Cloud Storage of Artifact Annotations to Support Case Managers in Knowledge-Intensive Business Processes.",
                    "Designing an SLA Protocol with Renegotiation to Maximize Revenues for the CMAC Platform.",
                    "Levi - A Workflow Engine Using BPMN 2.0.",
                    "Proceedings of the 1st International Workshop on Engineering Semantic Enterprise (ESE) 2012.",
                    "A Semantic-Based Architecture for Managing Knowledge-Intensive Organizations: The ARISTOTELE Platform.",
                    "ICOM: A Framework for Integrated Collaborative Work Environments.",
                    "Knowledge-Based Semantification of Business Communications in ERP Environments.",
                    "Ubiquitous Service Capability Modeling and Similarity Based Searching.",
                    "Introduction to the Proceedings of the Workshop on Social Web Analytics for Trend Detection (SoWeTrend) 2012.",
                    "Associating Items with Scenes Identified in Social Q&A Data.",
                    "An Epistemic Equivalence for Predictive Social Networks Analysis.",
                    "Dynamic Clustering Process to Calculate Affinity Degree of Users as Basis of a Social Network Recommender.",
                    "Data Leak Aware Crowdsourcing in Social Network.",
                    "Big Data and Cloud.",
                    "A Service Oriented Framework for Animating Big Spatiotemporal Datasets.",
                    "Searching Frequent Itemsets by Clustering Data: Towards a Parallel Approach Using Mapreduce.",
                    "Introduction to the Proceedings of the 5th International Workshop on Personalization in Cloud and Service Computing (PCS) 2011.",
                    "Towards a Taxonomy Framework of Evolution for SOA Solution: From a Practical Point of View.",
                    "A Hierarchical Representation for Indexing Data Condensed Semantically from Physically Massive Data Out of Sensor Networks on the Rove.",
                    "An Auxiliary Storage Subsystem of Storage Space Hidden for User Data to Distributed Computing Systems.",
                    "Introduction to the Proceedings of the Workshop on User-Focused Service Engineering, Consumption and Aggregation (USECA) 2011.",
                    "Data Visualisation Techniques for Exploratory Analysis Processes.",
                    "Form Annotation Framework for Form-Based Process Automation.",
                    "A Web Services Variability Description Language (WSVL) for Business Users Oriented Service Customization.",
                    "Towards a Service Framework for Remote Sales Support via Augmented Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2011",
                "sub_name": "Web Information System Engineering - WISE 2011 - 12th International Conference, Sydney, Australia, October 13-14, 2011. Proceedings.",
                "count": 35,
                "papers": [
                    "Finding Homoglyphs - A Step towards Detecting Unicode-Based Visual Spoofing Attacks.",
                    "Holistic Approaches to Identifying the Sentiment of Blogs Using Opinion Words.",
                    "Characterizing Web Syndication Behavior and Content.",
                    "Software-as-a-Service in Small and Medium Enterprises: An Empirical Attitude Assessment.",
                    "Trust-Based Probabilistic Query Answering.",
                    "Top-K Possible Shortest Path Query over a Large Uncertain Graph.",
                    "Training a Named Entity Recognizer on the Web.",
                    "Exploiting Available Memory and Disk for Scalable Instant Overview Search.",
                    "Unsupervised User-Generated Content Extraction by Dependency Relationships.",
                    "Sentiment Analysis with a Multilingual Pipeline.",
                    "Achieving Multi-tenanted Business Processes in SaaS Applications.",
                    "TOAST: A Topic-Oriented Tag-Based Recommender System.",
                    "Prefix-Based Node Numbering for Temporal XML.",
                    "Transparent Mobile Querying of Online RDF Sources Using Semantic Indexing and Caching.",
                    "An Automation Support for Creating Configurable Process Models.",
                    "Graph-Based Named Entity Linking with Wikipedia.",
                    "Prediction of Age, Sentiment, and Connectivity from Social Media Text.",
                    "Word Sense Disambiguation for Automatic Taxonomy Construction from Text-Based Web Corpora.",
                    "A Composite Self-organisation Mechanism in an Agent Network.",
                    "From Interface Mockups to Web Application Models.",
                    "Automatic Web Information Extraction Based on Rules.",
                    "An Artifact-Centric View-Based Approach to Modeling Inter-organizational Business Processes.",
                    "Enhance Web Pages Genre Identification Using Neighboring Pages.",
                    "Stepwise and Asynchronous Runtime Optimization of Web Service Compositions.",
                    "Supporting Sharing of Browsing Information and Search Results in Mobile Collaborative Searches.",
                    "GTrust: An Innovated Trust Model for Group Services Selection in Web-Based Service-Oriented Environments.",
                    "Trust as a Service: A Framework for Trust Management in Cloud Environments.",
                    "Quality Driven Web Services Replication Using Directed Acyclic Graph Coding.",
                    "OntoAssist: Leveraging Crowds for Ontology-Based Search.",
                    "MashSheet: Mashups in Your Spreadsheet.",
                    "SOAC Engine: A System to Manage Composite Web Service Authorization.",
                    "A Change Analysis Tool for Service-Based Business Processes.",
                    "A Novel Approach for Interacting with Linked Open Data.",
                    "Cloud Broker: Helping You Buy Better.",
                    "FACTUS: Faceted Twitter User Search Using Twitter Lists."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th WISE 2010",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2010",
                "sub_name": "Web Information Systems Engineering - WISE 2010 - 11th International Conference, Hong Kong, China, December 12-14, 2010. Proceedings.",
                "count": 54,
                "papers": [
                    "Providing Scalable Database Services on the Cloud.",
                    "Search and Social Integration.",
                    "Elements of a Spatial Web.",
                    "The Ubiquitous DBMS.",
                    "Building Web Services Middleware with Predictable Service Execution.",
                    "Event Driven Monitoring for Service Composition Infrastructures.",
                    "On Identifying and Reducing Irrelevant Information in Service Composition and Execution.",
                    "Propagation of Data Protection Requirements in Multi-stakeholder Web Services Systems.",
                    "Refining Graph Partitioning for Social Network Clustering.",
                    "Fast Detection of Size-Constrained Communities in Large Networks.",
                    "Evolutionary Taxonomy Construction from Dynamic Tag Space.",
                    "Co-clustering for Weblogs in Semantic Space.",
                    "A Linear-Chain CRF-Based Learning Approach for Web Opinion Mining.",
                    "An Unsupervised Sentiment Classifier on Summarized or Full Reviews.",
                    "Neighborhood-Restricted Mining and Weighted Application of Association Rules for Recommenders.",
                    "Semantically Enriched Event Based Model for Web Usage Mining.",
                    "Effective and Efficient Keyword Query Interpretation Using a Hybrid Graph.",
                    "From Keywords to Queries: Discovering the User's Intended Meaning.",
                    "Efficient Interactive Smart Keyword Search.",
                    "Relevant Answers for XML Keyword Search: A Skyline Approach.",
                    "A Children-Oriented Re-ranking Method for Web Search Engines.",
                    "TURank: Twitter User Ranking Based on User-Tweet Graph Analysis.",
                    "Identifying and Ranking Possible Semantic and Common Usage Categories of Search Engine Queries.",
                    "Best-Effort Refresh Strategies for Content-Based RSS Feed Aggregation.",
                    "Mashup-Aware Corporate Portals.",
                    "When Conceptual Model Meets Grammar: A Formal Approach to Semi-structured Data Modeling.",
                    "Crowdsourced Web Augmentation: A Security Model.",
                    "Design of Negotiation Agents Based on Behavior Models.",
                    "High Availability Data Model for P2P Storage Network.",
                    "Modeling Multiple Users' Purchase over a Single Account for Collaborative Filtering.",
                    "Interaction-Based Collaborative Filtering Methods for Recommendation in Online Dating.",
                    "Developing Trust Networks Based on User Tagging Information for Recommendation Making.",
                    "Towards Three-Stage Recommender Support for Online Consumers: Implications from a User Study.",
                    "Query Relaxation for Star Queries on RDF.",
                    "Efficient and Adaptable Query Workload-Aware Management for RDF Data.",
                    "RaUL: RDFa User Interface Language - A Data Processing Model for Web Applications.",
                    "Synchronising Personal Data with Web 2.0 Data Sources.",
                    "An Artifact-Centric Approach to Generating Web-Based Business Process Driven User Interfaces.",
                    "A Pattern-Based Temporal XML Query Language.",
                    "A Data Mining Approach to XML Dissemination.",
                    "Semantic Transformation Approach with Schema Constraints for XPath Query Axes.",
                    "Domain-Specific Language for Context-Aware Web Applications.",
                    "Enishi: Searching Knowledge about Relations by Complementarily Utilizing Wikipedia and the Web.",
                    "Potential Role Based Entity Matching for Dataspaces Search.",
                    "Personalized Resource Search by Tag-Based User Profile and Resource Profile.",
                    "Incremental Structured Web Database Crawling via History Versions.",
                    "An Architectural Style for Process-Intensive Web Information Systems.",
                    "Model-Driven Development of Adaptive Service-Based Systems with Aspects and Rules.",
                    "An Incremental Approach for Building Accessible and Usable Web Applications.",
                    "CPH-VoD: A Novel CDN-P2P-Hybrid Architecture Based VoD Scheme.",
                    "A Combined Semi-pipelined Query Processing Architecture for Distributed Full-Text Retrieval.",
                    "Towards Flexible Mashup of Web Applications Based on Information Extraction and Transfer.",
                    "On Maximal Contained Rewriting of Tree Pattern Queries Using Views.",
                    "Implementing Automatic Error Recovery Support for Rich Web Clients."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2010-w",
                "sub_name": "Web Information Systems Engineering - WISE 2010 Workshops - WISE 2010 International Symposium WISS, and International Workshops CISE, MBC, Hong Kong, China, December 12-14, 2010, Revised Selected Papers.",
                "count": 40,
                "papers": [
                    "Strategic Points to Minimize Time Cost for Decision Making under Asynchronous Time Constraints.",
                    "A Recommender System for Infrequent Purchased Products based on User Navigation and Product Review Data.",
                    "Forming Buyer Coalition Schemes with Ontologies in E-Marketplaces.",
                    "Toward a Framework for Assessing E-Marketplace Service Quality.",
                    "Relaxing Queries Based on XML Structure and Content Preferences.",
                    "Automatic Extraction Rules Generation Based on XPath Pattern Learning.",
                    "An XML-Based Representational Document Format for FRBR.",
                    "A Framework for XML Schema Integration via Conceptual Model.",
                    "Probability Distribution-Based QoS Analysis for Web Service Composition.",
                    "A New Approach to Populate a Semantic Service Registry.",
                    "From ASTD Access Control Policies to WS-BPEL Processes Deployed in a SOA Environment.",
                    "Business Rules for Creating Process Flexibility: Mapping RIF Rules and BDI Rules.",
                    "NTLM: A Time-Enhanced Language Model Based Ranking Approach for Web Search.",
                    "Is Vote Effective? An Empirical Study of Community Deliberation in Social Webs.",
                    "Image123: A \"Web1.0+Web2.0+Semantic Web\" Based Image Retrieval System.",
                    "Developing Semantic Rich Internet Applications Using a Model-Driven Approach.",
                    "Multi-facets Quality Assessment of Online Opinionated Expressions.",
                    "Providing Flexible Tradeoff for Provenance Tracking.",
                    "Using Patterns in the Behavior of the Random Surfer to Detect Webspam Beneficiaries.",
                    "Unsupervised Segmentation of Bibliographic Elements with Latent Permutations.",
                    "Refactoring ActionScript for Improving Application Execution Time.",
                    "RESTful, Resource-Oriented Architectures: A Model-Driven Approach.",
                    "Service-Based Integration in Event-Driven Manufacturing Environments.",
                    "Towards a Quality Service Layer for Web 2.0.",
                    "A Smart User Interface for Service-Oriented Web.",
                    "Adoption of Information Technology Policies in the Tourism Sector in the Era of WEB2.0.",
                    "An Abbreviate Representation for Semantically Indexing of Physically Massive Data Out of Sensor Networks on the Rove.",
                    "Detection of Web Communities from Community Cores.",
                    "Extracting Hidden Information Based on Comparing Web with UGC.",
                    "A Timeline-Based Algorithm for Personalized Tag Recommendation.",
                    "Personalized Book Recommendations Created by Using Social Media Data.",
                    "Requirements Engineering for Cloud Computing: A Comparison Framework.",
                    "Cloudle: An Ontology-Enhanced Cloud Service Search Engine.",
                    "CryptoDSPs for Cloud Privacy.",
                    "Dynamic Resource Scheduling and Workflow Management in Cloud Computing.",
                    "A Security and High-Availability Layer for Cloud Storage.",
                    "A New Automatic Train Identification System Based on RFID.",
                    "A New Method for Business Process Mining Based on State Equation.",
                    "Checking Order Constraints in Collaborative Workflow with Invariant Analysis.",
                    "Alert-Based Hiker Status System."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10th WISE 2009",
        "info": "Poznan, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2009",
                "sub_name": "Web Information Systems Engineering - WISE 2009, 10th International Conference, Poznan, Poland, October 5-7, 2009. Proceedings.",
                "count": 58,
                "papers": [
                    "Blighted Virtual Neighborhoods and Other Threats to Online Social Experiences.",
                    "Cloud Computing.",
                    "Beyond Search: Web-Scale Business Analytics.",
                    "Storyboarding - High-Level Engineering of Web Information Systems.",
                    "Web Queries: From a Web of Data to a Semantic Web.",
                    "Toward a Unified View of Data and Services.",
                    "Maximizing Utility for Content Delivery Clouds.",
                    "Aggregation of Document Frequencies in Unstructured P2P Networks.",
                    "Processes Are Data: A Programming Model for Distributed Applications.",
                    "OfficeObjects Service Broker - An Intelligent Service Integration Platform.",
                    "PSILOC World Traveler: Overcoming the Challenges of Adopting Wide-Scale Mobile Solutions.",
                    "ETSI Industry Specification Group on Autonomic Network Engineering for the Self-managing Future Internet (ETSI ISG AFI).",
                    "Facing Tagging Data Scattering.",
                    "Clustering of Social Tagging System Users: A Topic and Time Based Approach.",
                    "Spectral Clustering in Social-Tagging Systems.",
                    "Semantic Weaving for Context-Aware Web Service Composition.",
                    "Multi-synchronous Collaborative Semantic Wikis.",
                    "Facing the Technological Challenges of Web 2.0: A RIA Model-Driven Engineering Approach.",
                    "Intent-Based Categorization of Search Results Using Questions from Web Q&A Corpus.",
                    "TermCloud for Enhancing Web Search.",
                    "Seeing Past Rivals: Visualizing Evolution of Coordinate Terms over Time.",
                    "A Novel Visualization Method for Distinction of Web News Sentiment.",
                    "Visually Lossless HTML Compression.",
                    "Enhancing Web Search by Aggregating Results of Related Web Queries.",
                    "Extracting Structured Data from Web Pages with Maximum Entropy Segmental Markov Model.",
                    "Blog Ranking Based on Bloggers' Knowledge Level for Providing Credible Information.",
                    "Multi-source Remote Sensing Images Data Integration and Sharing Using Agent Service.",
                    "An Integrated Declarative Approach to Web Services Composition and Monitoring.",
                    "Formal Identification of Right-Grained Services for Service-Oriented Modeling.",
                    "Start Trusting Strangers? Bootstrapping and Prediction of Trust.",
                    "Finding Comparative Facts and Aspects for Judging the Credibility of Uncertain Facts.",
                    "Query Evaluation on Probabilistic RDF Databases.",
                    "Recommending Improvements to Web Applications Using Quality-Driven Heuristic Search.",
                    "A Web Recommender System for Recommending, Predicting and Personalizing Music Playlists.",
                    "Verification of Composite Services with Temporal Consistency Checking and Temporal Satisfaction Estimation.",
                    "Adaptive Rich User Interfaces for Human Interaction in Business Processes.",
                    "Personalizing the Interface in Rich Internet Applications.",
                    "Towards Improving Web Search: A Large-Scale Exploratory Study of Selected Aspects of User Search Behavior.",
                    "An Architecture for Open Cross-Media Annotation Services.",
                    "Video Search by Impression Extracted from Social Annotation.",
                    "Single Pattern Generating Heuristics for Pixel Advertisements.",
                    "Generation of Specifications Forms through Statistical Learning for a Universal Services Marketplace.",
                    "An Urban Planning Web Viewer Based on AJAX.",
                    "Data Center Hosting Services Governance Portal and Google Map-Based Collaborations.",
                    "Focused Search in Digital Archives.",
                    "Automated Ontology-Driven Metasearch Generation with Metamorph.",
                    "Integrated Environment for Visual Data-Level Mashup Development.",
                    "Concept of Competency Examination System in Virtual Laboratory Environment.",
                    "Integrating a Usability Model into Model-Driven Web Development Processes.",
                    "Entry Pairing in Inverted File.",
                    "STC+ and NM-STC: Two Novel Online Results Clustering Methods for Web Searching.",
                    "Spatio-Temporal-Thematic Analysis of Citizen Sensor Data: Challenges and Experiences.",
                    "Visual Mining of Web Logs with DataTube2.",
                    "Keys in XML: Capturing Identification and Uniqueness.",
                    "Query Expansion Based on Query Log and Small World Characteristic.",
                    "E-Biology Workflows with Calvin.",
                    "Security Policy Definition Framework for SOA-Based Systems.",
                    "Engineering Accessibility in Web Content Management System Environments."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9th WISE 2008",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2008",
                "sub_name": "Web Information Systems Engineering - WISE 2008, 9th International Conference, Auckland, New Zealand, September 1-3, 2008. Proceedings.",
                "count": 33,
                "papers": [
                    "Data Quality in Web Information Systems.",
                    "XML Storage and Processing on Mobile Devices.",
                    "Approximate Information Filtering in Peer-to-Peer Networks.",
                    "Achieving Effective Multi-term Queries for Fast DHT Information Retrieval.",
                    "Efficiently Handling Dynamics in Distributed Link Based Authority Analysis.",
                    "Online Outlier Detection Based on Relative Neighbourhood Dissimilarity.",
                    "Behavioural Targeting in On-Line Advertising: An Empirical Study.",
                    "Integrating Multiple Data Sources for Stock Prediction.",
                    "Intra/Inter-document Change Awareness for Co-authoring of Web Sites.",
                    "Requirements for Rich Internet Application Design Methodologies.",
                    "SyncRerank: Reranking Multi Search Results Based on Vertical and Horizontal Propagation of User Intention.",
                    "Web-Based Measure of Semantic Relatedness.",
                    "Locally Expandable Allocation of Folksonomy Tags in a Directed Acyclic Graph.",
                    "Computing Relaxed Answers on RDF Databases.",
                    "Semantically Enhanced Entity Ranking.",
                    "Discovering Pathways of Service Oriented Biological Processes.",
                    "Supporting Judgment of Fact Trustworthiness Considering Temporal and Sentimental Aspects.",
                    "Improving Mobile Web-IR Using Access Concentration Sites in Search Results.",
                    "Can Social Tagging Improve Web Image Search?.",
                    "Mashing Up Context-Aware Web Applications: A Component-Based Development Approach.",
                    "Correlating Time-Related Data Sources with Co-clustering.",
                    "Context-Aware Mashups for Mobile Devices.",
                    "A Semantic Overlay for Service Discovery across Web Information Systems.",
                    "Filtering Techniques for Rewriting XPath Queries Using Views.",
                    "Efficient Top-k Data Sources Ranking for Query on Deep Web.",
                    "Optimizing Distributed Top-k Queries.",
                    "POEMS: Peer-Based Overload Management.",
                    "Improving Web Service Discovery by Using Semantic Models.",
                    "BPEL4RBAC: An Authorisation Specification for WS-BPEL.",
                    "A Workflow-Based Approach for Creating Complex Web Wrappers.",
                    "Contained Rewritings of XPath Queries Using Views Revisited.",
                    "Addressing New Concerns in Model-Driven Web Engineering Approaches.",
                    "A Web-Based Automated System for Industry and Occupation Coding."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2008-w",
                "sub_name": "Web Information Systems Engineering - WISE 2008 Workshops, WISE 2008 International Workshops, Auckland, New Zealand, September 1-4, 2008. Proceedings.",
                "count": 21,
                "papers": [
                    "E-BAG 2008 Workshop PC Chairs' Message.",
                    "Service Computing for the Service Economy.",
                    "Minimizing the Impact of Change on User Productivity.",
                    "Mobile Payment: Towards a Customer-Centric Model.",
                    "Ontological Vulnerability Assessment.",
                    "Process Model Elicitation and a Reading Technique for Web Usability Inspections.",
                    "Ranking People Based on Metadata Analysis of Search Results.",
                    "IWWUA 2008 Workshop PC Chairs' Message.",
                    "Beyond Conformance: The Role of Accessibility Evaluation Methods.",
                    "A Systematic Review of Usability Evaluation in Web Development.",
                    "Identifying Semantic Constructs in Web Documents to Improve Web Site Accessibility.",
                    "Improving the Usability of Novel Web Software: An Industrial Case Study of an Institutional Repository.",
                    "Measuring Web Accessibility by Estimating Severity of Barriers.",
                    "Modelling Web-Based Systems Requirements Using WRM.",
                    "Towards an Ontology-Based Approach for Dealing with Web Guidelines.",
                    "MEM&LCW 2008 Workshop PC Chairs' Message.",
                    "A Web Based Mashup Platform for Enterprise 2.0.",
                    "Bill Organiser Portal: A Case Study on End-User Composition.",
                    "Extending Services Delivery with Lightweight Composition.",
                    "Fixed-Mobile Hybrid Mashups: Applying the REST Principles to Mobile-Specific Resources.",
                    "Engineering Issues for the Web 2.0."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th WISE 2007",
        "info": "Nancy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2007",
                "sub_name": "Web Information Systems Engineering - WISE 2007, 8th International Conference on Web Information Systems Engineering, Nancy, France, December 3-7, 2007, Proceedings.",
                "count": 58,
                "papers": [
                    "On Tree Pattern Query Rewriting Using Views.",
                    "Querying Capability Modeling and Construction of Deep Web Sources.",
                    "Optimization of Bounded Continuous Search Queries Based on Ranking Distributions.",
                    "Evaluating Rater Credibility for Reputation Assessment of Web Services.",
                    "An Approach to Trust Based on Social Networks.",
                    "A New Reputation-Based Trust Management Mechanism Against False Feedbacks in Peer-to-Peer Systems.",
                    "Freshness-Aware Caching in a Cluster of J2EE Application Servers.",
                    "Collaborative Cache Based on Path Scores.",
                    "Similarity-Based Document Distribution for Efficient Distributed Information Retrieval.",
                    "BEIRA: A Geo-semantic Clustering Method for Area Summary.",
                    "Building the Presentation-Tier of Rich Web Applications with Hierarchical Components.",
                    "WeBrowSearch: Toward Web Browser with Autonomous Search.",
                    "A Domain-Driven Approach for Detecting Event Patterns in E-Markets: A Case Study in Financial Market Surveillance.",
                    "Adaptive Email Spam Filtering Based on Information Theory.",
                    "Time Filtering for Better Recommendations with Small and Sparse Rating Matrices.",
                    "A Survey of UML Models to XML Schemas Transformations.",
                    "Structural Similarity Evaluation Between XML Documents and DTDs.",
                    "Using Clustering and Edit Distance Techniques for Automatic Web Data Extraction.",
                    "A Semantic Approach and a Web Tool for Contextual Annotation of Photos Using Camera Phones.",
                    "Formal Specification of OWL-S with Object-Z: The Dynamic Aspect.",
                    "An Approach for Combining Ontology Learning and Semantic Tagging in the Ontology Development Process: eGovernment Use Case.",
                    "Term Rewriting for Web Information Systems - Termination and Church-Rosser Property.",
                    "Development of a Collaborative and Constraint-Based Web Configuration System for Personalized Bundling of Products and Services.",
                    "SRI@work: Efficient and Effective Routing Strategies in a PDMS.",
                    "Learning Management System Based on SCORM, Agents and Mining.",
                    "A Web-Based Learning Resource Service System Based on Mobile Agent.",
                    "Wikipedia Mining for an Association Web Thesaurus Construction.",
                    "Economically Enhanced Resource Management for Internet Service Utilities.",
                    "Enhancing Web Services Performance Using Adaptive Quality of Service Management.",
                    "Coverage and Timeliness Analysis of Search Engines with Webpage Monitoring Results.",
                    "Managing Process Customizability and Customization: Model, Language and Process.",
                    "A WebML-Based Approach for the Development of Web GIS Applications.",
                    "An Object-Oriented Version Model for Context-Aware Data Management.",
                    "Extending XML Triggers with Path-Granularity.",
                    "A Replicated Study Comparing Web Effort Estimation Techniques.",
                    "Development Process of the Operational Version of PDQM.",
                    "A New Reputation Mechanism Against Dishonest Recommendations in P2P Systems.",
                    "A Framework for Business Operations Management Systems.",
                    "A Practical Method and Tool for Systems Engineering of Service-Oriented Applications.",
                    "A Layered Service Process Model for Managing Variation and Change in Service Provider Operations.",
                    "Providing Personalized Mashups Within the Context of Existing Web Applications.",
                    "Wooki: A P2P Wiki-Based Collaborative Writing Tool.",
                    "Creating and Managing Ontology Data on the Web: A Semantic Wiki Approach.",
                    "Web Service Composition: A Reality Check.",
                    "MyQoS: A Profit Oriented Framework for Exploiting Customer Behavior in Online e-Commerce Environments.",
                    "Task Assignment on Parallel QoS Systems.",
                    "Autonomic Admission Control for Congested Request Processing Systems.",
                    "Towards Performance Efficiency in Safe XML Update.",
                    "From Crosscutting Concerns to Web Systems Models.",
                    "Generating Extensional Definitions of Concepts from Ostensive Definitions by Using Web.",
                    "Modeling Distributed Events in Data-Intensive Rich Internet Applications.",
                    "Privacy Inspection and Monitoring Framework for Automated Business Processes.",
                    "Digging the Wild Web: An Interactive Tool for Web Data Consolidation.",
                    "A Web-Based Learning Information System - AHKME.",
                    "A Recommender System with Interest-Drifting.",
                    "Improving Revisitation Browsers Capability by Using a Dynamic Bookmarks Personal Toolbar.",
                    "Hierarchical Co-clustering for Web Queries and Selected URLs.",
                    "Navigating Among Search Results: An Information Content Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2007-w",
                "sub_name": "Web Information Systems Engineering - WISE 2007 Workshops, WISE 2007 International Workshops, Nancy, France, December 3, 2007, Proceedings.",
                "count": 50,
                "papers": [
                    "Workshop PC Chairs' Message.",
                    "QDex: A Database Profiler for Generic Bio-data Exploration and Quality Aware Integration.",
                    "ProtocolDB: Storing Scientific Protocols with a Domain Ontology.",
                    "An Ontology-Driven Annotation of Data Tables.",
                    "Using Ontology with Semantic Web Services to Support Modeling in Systems Biology.",
                    "Data in Astronomy: From the Pipeline to the Virtual Observatory.",
                    "Workshop PC Chairs' Message.",
                    "How Do Users Express Goals on the Web? - An Exploration of Intentional Structures in Web Search.",
                    "Publishing and Sharing Ontology-Based Information in a Collaborative Multimedia Document Management System.",
                    "Sequence Disunification and Its Application in Collaborative Schema Construction.",
                    "Mapping Metadata for SWHi: Aligning Schemas with Library Metadata for a Historical Ontology.",
                    "Workshop PC Chairs' Message.",
                    "Conceptual Model of Risk: Towards a Risk Modelling Language.",
                    "A Critical Analysis of Latest Advances in Building Trusted P2P Networks Using Reputation Systems.",
                    "Deriving XACML Policies from Business Process Models.",
                    "Enforcing Policies and Guidelines in Web Portals: A Case Study.",
                    "Workflow Abstraction for Privacy Preservation.",
                    "Using Control Patterns in Business Processes Compliance.",
                    "A Framework for Evidence Lifecycle Management.",
                    "Collaboration for Human-Centric eGovernment Workflows.",
                    "Workshop PC Chairs' Message.",
                    "How to Create a WSMO-Based Semantic Service Without Knowing WSML.",
                    "Goal-Based Visualization and Browsing for Semantic Web Services.",
                    "Agile Elicitation of Semantic Goals by Wiki.",
                    "User-Friendly Semantic Annotation in Business Process Modeling.",
                    "Semantic Web Service Discovery for Business Process Models.",
                    "Web Service Search: Who, When, What, and How.",
                    "Workshop PC Chairs' Message.",
                    "User Modeling for Attending Functional Diversity for ALL in Higher Education.",
                    "Exploiting Profile Modeling for Web-Based Information Systems.",
                    "Learning Implicit User Interests Using Ontology and Search History for Personalization.",
                    "Contextual User Profile for Adapting Information in Nomadic Environments.",
                    "A Contextual User Model for Web Personalization.",
                    "Citation-Based Methods for Personalized Search in Digital Libraries.",
                    "Personalized Information Access Through Flexible and Interoperable Profiles.",
                    "A Tool for Statistical Analysis of Navigational Modelling for Web Site Personalization and Reengineering.",
                    "\"Watch the Document on the Wall!\" An Analytical Model for Health Care Documents on Large Displays.",
                    "Workshop PC Chairs' Message.",
                    "Incremental Quality Improvement in Web Applications Using Web Model Refactoring.",
                    "Inclusive Usability Techniques in Requirements Analysis of Accessible Web Applications.",
                    "A Visual Ontology-Driven Interface for a Web Sign Language Dictionary.",
                    "Improvement of a Web Engineering Method Through Usability Patterns.",
                    "Flex RIA Development and Usability Evaluation.",
                    "Usability and Accessibility Evaluations Along the eLearning Cycle.",
                    "Web Accessibility Evaluation Via XSLT.",
                    "Analyzing Tool Support for Inspecting Accessibility Guidelines During the Development Process of Web Sites.",
                    "Quality of Web Usability Evaluation Methods: An Empirical Study on MiLE+.",
                    "An Assessment of the Currency of Free Science Information on the Web.",
                    "Including Routes in Web Information Systems as a Way to Improve the Navigability: An Empirical Study.",
                    "A Generic Approach to Improve Navigational Model Usability Based Upon Requirements and Metrics."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th WISE 2006",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2006",
                "sub_name": "Web Information Systems - WISE 2006, 7th International Conference on Web Information Systems Engineering, Wuhan, China, October 23-26, 2006, Proceedings.",
                "count": 57,
                "papers": [
                    "Internet-Scale Data Distribution: Some Research Problems.",
                    "Towards Next-Generation Search Engines and Browsers - Search Beyond Media Types and Places.",
                    "Building a Domain Independent Platform for Collecting Domain Specific Data from the Web.",
                    "A Web Search Method Based on the Temporal Relation of Query Keywords.",
                    "Meta-search Based Web Resource Discovery for Object-Level Vertical Search.",
                    "PreCN: Preprocessing Candidate Networks for Efficient Keyword Search over Databases.",
                    "Searching Coordinate Terms with Their Context from the Web.",
                    "A Semantic Matching of Information Segments for Tolerating Error Chinese Words.",
                    "Block-Based Similarity Search on the Web Using Manifold-Ranking.",
                    "Design and Implementation of Preference-Based Search.",
                    "Topic-Based Website Feature Analysis for Enterprise Search from the Web.",
                    "Fault-Tolerant Orchestration of Transactional Web Services.",
                    "Supporting Effective Operation of E-Governmental Services Through Workflow and Knowledge Management.",
                    "DOPA: A Data-Driven and Ontology-Based Method for Ad Hoc Process Awareness in Web Information Systems.",
                    "A Transaction-Aware Coordination Protocol for Web Services Composition.",
                    "Unstoppable Stateful PHP Web Services.",
                    "Quantified Matchmaking of Heterogeneous Services.",
                    "Pattern Based Property Specification and Verification for Service Composition.",
                    "Detecting the Web Services Feature Interactions.",
                    "Exploiting Rating Behaviors for Effective Collaborative Filtering.",
                    "Exploiting Link Analysis with a Three-Layer Web Structure Model.",
                    "Concept Hierarchy Construction by Combining Spectral Clustering and Subsumption Estimation.",
                    "Automatic Hierarchical Classification of Structured Deep Web Databases.",
                    "A Robust Web-Based Approach for Broadcasting Downward Messages in a Large-Scaled Company.",
                    "Buffer-Preposed QoS Adaptation Framework and Load Shedding Techniques over Streams.",
                    "Cardinality Computing: A New Step Towards Fully Representing Multi-sets by Bloom Filters.",
                    "An Efficient Scheme to Completely Avoid Re-labeling in XML Updates.",
                    "Modeling Portlet Aggregation Through Statecharts.",
                    "Calculation of Target Locations for Web Resources.",
                    "Efficient Bid Pricing Based on Costing Methods for Internet Bid Systems.",
                    "An Enhanced Super-Peer Model for Digital Library Construction.",
                    "Offline Web Client: Approach, Design and Implementation Based on Web System.",
                    "A Latent Image Semantic Indexing Scheme for Image Retrieval on the Web.",
                    "Hybrid Method for Automated News Content Extraction from the Web.",
                    "A Hybrid Sentence Ordering Strategy in Multi-document Summarization.",
                    "Document Fragmentation for XML Streams Based on Query Statistics.",
                    "A Heuristic Approach for Topical Information Extraction from News Pages.",
                    "Defining a Data Quality Model for Web Portals.",
                    "Finding Reliable Recommendations for Trust Model.",
                    "Self-Updating Hash Chains and Their Implementations.",
                    "Modeling Web-Based Applications Quality: A Probabilistic Approach.",
                    "Monitoring Interactivity in a Web-Based Community.",
                    "A Metamodel-Based Approach for Extracting Ontological Semantics from UML Models.",
                    "Deeper Semantics Goes a Long Way: Fuzzified Representation and Matching of Color Descriptions for Online Clothing Search.",
                    "Semantically Integrating Portlets in Portals Through Annotation.",
                    "A Self-organized Semantic Clustering Approach for Super-Peer Networks.",
                    "Using Categorial Context-SHOIQ(D+) DL to Migrate Between the Context-Aware Scenes.",
                    "SCEND: An Efficient Semantic Cache to Adequately Explore Answerability of Views.",
                    "Clustered Chain Path Index for XML Document: Efficiently Processing Branch Queries.",
                    "Region-Based Coding for Queries over Streamed XML Fragments.",
                    "PrefixTreeESpan: A Pattern Growth Algorithm for Mining Embedded Subtrees.",
                    "Evaluating Interconnection Relationship for Path-Based XML Retrieval.",
                    "User Models: A Contribution to Pragmatics of Web Information Systems Design.",
                    "XUPClient - A Thin Client for Rich Internet Applications.",
                    "2D/3D Web Visualization on Mobile Devices.",
                    "Web Driving: An Image-Based Opportunistic Web Browser That Visualizes a Peripheral Information Space.",
                    "Blogouse: Turning the Mouse into a Copy&Blog Device."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2006-w",
                "sub_name": "Web Information Systems - WISE 2006 Workshops, WISE 2006 International Workshops, Wuhan, China, October 23-26, 2006, Proceedings.",
                "count": 31,
                "papers": [
                    "Efficient Filtering Query Indexing in Data Stream.",
                    "Modelling and Guaranteeing Quality of Service over Data Streams.",
                    "Research on Prediction Models over Distributed Data Streams.",
                    "A Grid-Based Subspace Clustering Algorithm for High-Dimensional Data Streams.",
                    "Mining h-Dimensional Enhanced Semantic Association Rule Based on Immune-Based Gene Expression Programming.",
                    "An Efficient Algorithm for Distributed Incremental Updating of Frequent Item-Sets on Massive Database.",
                    "Mining Maximum Frequent Access Patterns in Web Logs Based on Unique Labeled Tree.",
                    "Short Documents Clustering in Very Large Text Databases.",
                    "A Simple Yet Efficient Approach for Maximal Frequent Subtrees Extraction from a Collection of XML Documents.",
                    "A Web-Based Transformation System for Massive Scientific Data.",
                    "Supporting Complex Query with Structured Overlays in Schema-Based P2P System.",
                    "DRO+: A Systemic and Economical Approach to Improve Availability of Massive Database Systems.",
                    "Research and Implement of Real-Time Data Loading System IMIL.",
                    "Blogs in American Academic Libraries: An Overview of Their Present Status and Possible Future Use.",
                    "Rebuilding the Library OPAC.",
                    "Web Content Mining for Market Intelligence Acquiring from B2C Websites.",
                    "Design of Chinese Word Segmentation System Based on Improved Chinese Converse Dictionary and Reverse Maximum Matching Algorithm.",
                    "Cross-Media Database Retrieval System Based on TOTEM.",
                    "Semantic Query Planning Mechanism on XML Based Web Information Systems.",
                    "Analysis on the Construction of Management Modes of E-Government Information Exchange in China.",
                    "Aggregated Framework of Enterprise Information System Based on Synergic Theory.",
                    "Web Personalization Based on Artificial Psychology.",
                    "Grid Resource Management Based on Mobile Agent.",
                    "The Use of Intelligent Information Access Technologies in Digital Libraries.",
                    "Encryption and Program Realization of Information Resources in DRM.",
                    "Knowledge Organization Systems and Interfaces of Digital Libraries in China.",
                    "Study on Distribution Model of Internet Information Resources in China.",
                    "Collaborative User Tracking for Community Organization on Blogosphere: A Case Study of eLearning@BlogGrid.",
                    "Adaptive UI Storytelling System Using MOL.",
                    "Construction of a Distributed Learning Resource Management System Based on RSS Technology.",
                    "A Semantic Web Application to Automate the Construction of Didactic Material for Web-Based Education System."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6. WISE 2005",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2005",
                "sub_name": "Web Information Systems Engineering - WISE 2005, 6th International Conference on Web Information Systems Engineering, New York, NY, USA, November 20-22, 2005, Proceedings.",
                "count": 87,
                "papers": [
                    "Mining Communities on the Web Using a Max-Flow and a Site-Oriented Framework.",
                    "A Web Recommendation Technique Based on Probabilistic Latent Semantic Analysis.",
                    "Constructing Interface Schemas for Search Interfaces of Web Databases.",
                    "Temporal Ranking of Search Engine Results.",
                    "Evaluation of Result Merging Strategies for Metasearch Engines.",
                    "Decomposition-Based Optimization of Reload Strategies in the World Wide Web.",
                    "An Ontological Approach for Defining Agents for Collaborative Applications.",
                    "Improving Web Data Annotations with Spreading Activation.",
                    "Semantic Partitioning of Web Pages.",
                    "A Formal Ontology Reasoning with Individual Optimization: A Realization of the Semantic Web.",
                    "oMAP: Combining Classifiers for Aligning Automatically OWL Ontologies.",
                    "Semantic Web Technologies for Interpreting DNA Microarray Analyses: The MEAT System.",
                    "Extracting Global Policies for Efficient Access Control of XML Documents.",
                    "Querying and Repairing Inconsistent XML Data.",
                    "Towards Automatic Generation of Rules for Incremental Maintenance of XML Views of Relational Data.",
                    "A Methodological Approach for Incorporating Adaptive Navigation Techniques into Web Applications.",
                    "A Web Service Support to Collaborative Process with Semantic Information.",
                    "Server-Side Caching Strategies for Online Auction Sites.",
                    "Maintaining Consistency Under Isolation Relaxation of Web Services Transactions.",
                    "Binding and Execution of Web Service Compositions.",
                    "Handling Transactional Properties in Web Service Composition.",
                    "XFlow: An XML-Based Document-Centric Workflow.",
                    "Optimization of XSLT by Compact Specialization and Combination.",
                    "Extracting Web Data Using Instance-Based Learning.",
                    "PRoBe: Multi-dimensional Range Queries in P2P Networks.",
                    "An Infrastructure for Reactive Information Environments.",
                    "LoT-RBAC: A Location and Time-Based RBAC Model.",
                    "Document Re-ranking by Generality in Bio-medical Information Retrieval.",
                    "Representing and Reasoning About Privacy Abstractions.",
                    "Conceptual Query Refinement: The Basic Model.",
                    "Peer-to-Peer Technology Usage in Web Service Discovery and Matchmaking.",
                    "A Contract-Based Approach for Monitoring Collaborative Web Services Using Commitments in the Event Calculus.",
                    "Asynchronous Web Services Communication Patterns in Business Protocols.",
                    "Towards the Automation of E-Negotiation Processes Based on Web Services - A Modeling Approach.",
                    "Modeling of User Acceptance of Consumer E-Commerce Website.",
                    "A Collaborative Recommender System Based on User Association Clusters.",
                    "Space-Limited Ranked Query Evaluation Using Adaptive Pruning.",
                    "Automated Retraining Methods for Document Classification and Their Parameter Tuning.",
                    "NET - A System for Extracting Web Data from Flat and Nested Data Records.",
                    "Blog Map of Experiences: Extracting and Geographically Mapping Visitor Experiences from Urban Blogs.",
                    "Reliable Multicast and Its Probabilistic Model for Job Submission in Peer-to-Peer Grids.",
                    "Peer-Sensitive ObjectRank - Valuing Contextual Information in Social Networks.",
                    "Automatic Performance Tuning for J2EE Application Server Systems.",
                    "Xebu: A Binary Format with Schema-Based Optimizations for XML Data.",
                    "Maintaining Versions of Dynamic XML Documents.",
                    "Identifying Value Mappings for Data Integration: An Unsupervised Approach.",
                    "Relaxing Result Accuracy for Performance in Publish/Subscribe Systems.",
                    "Using Non-random Associations for Predicting Latency in WANs.",
                    "An Online Face Recognition System Using Multiple Compressed Images over the Internet.",
                    "The Information Market: Its Basic Concepts and Its Challenges.",
                    "List Data Extraction in Semi-structured Document.",
                    "Optimization Issues for Keyword Search over Tree-Structured Documents.",
                    "Semantic Integration of Schema Conforming XML Data Sources.",
                    "Extract Salient Words with WordRank for Effective Similarity Search in Text Data.",
                    "Intensional P2P Mappings Between RDF Ontologies.",
                    "Meta-modeling of Educational Practices for Adaptive Web Based Education Systems.",
                    "An On-line Intelligent Recommendation System for Digital Products Using Fuzzy Logic.",
                    "Consensus Making on the Semantic Web: Personalization and Community Support.",
                    "Dictionary-Based Voting Text Categorization in a Chemistry-Focused Search Engine.",
                    "An Approach to Securely Interconnect Geo Web Services.",
                    "Automatic Keyword Extraction by Server Log Analysis.",
                    "Approximate Intensional Representation of Web Search Results.",
                    "A Unique Design for High-Performance Decentralized Resources Locating: A Topological Perspective.",
                    "Searching the Web Through User Information Spaces.",
                    "REBIEX: Record Boundary Identification and Extraction Through Pattern Mining.",
                    "Discovering the Biomedical Deep Web.",
                    "A Potential IRI Based Phishing Strategy.",
                    "Multiway Iceberg Cubing on Trees.",
                    "Building a Semantic-Rich Service-Oriented Manufacturing Environment.",
                    "Building a Semantic Web System for Scientific Applications: An Engineering Approach.",
                    "A SOAP Container Model for e-Business Messaging Requirements.",
                    "An Empirical Study of Security Threats and Countermeasures in Web Services-Based Services Oriented Architectures.",
                    "Collaborative End-Point Service Modulation System (COSMOS).",
                    "A Process-Driven e-Business Service Integration System and Its Application to e-Logistics Services.",
                    "BPM and SOA: Synergies and Challenges.",
                    "Web Performance Indicator by Implicit User Feedback - Application and Formal Approach.",
                    "Discovering the Most Frequent Patterns of Executions in Business Processes Described in BPEL.",
                    "CONFIOUS: Managing the Electronic Submission and Reviewing Process of Scientific Conferences.",
                    "Tool Support for Model-Driven Development of Web Applications.",
                    "Web Personalization: My Own Web Based on Open Content Platform.",
                    "An Effective Approach for Content Delivery in an Evolving Intranet Environment - A Case Study of the Largest Telecom Company in Taiwan.",
                    "Achieving Decision Consistency Across the SOA-Based Enterprise Using Business Rules Management Systems.",
                    "Service Design, Implementation and Description (Tutorial).",
                    "WISE-2005 Tutorial: Web Content Mining.",
                    "An Introduction to Data Grid Management Systems.",
                    "Are We Ready for the Service Oriented Architecture?.",
                    "Data Engineering Approach to Design of Web Services."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2005-w",
                "sub_name": "Web Information Systems Engineering - WISE 2005 Workshops, WISE 2005 International Workshops, New York, NY, USA, November 20-22, 2005, Proceedings.",
                "count": 28,
                "papers": [
                    "Ontology for the Selection of e-Processes.",
                    "Managing Web GIS Quality.",
                    "A Reusability Model for Portlets.",
                    "Towards Using Simulation for Enhancing Web Information Systems' Utility.",
                    "Adaptive Multimedia Content Delivery in Ubiquitous Environments.",
                    "Incorporating the Timeliness Quality Dimension in Internet Query Systems.",
                    "SOAP Request Scheduling for Differentiated Quality of Service.",
                    "Portraying Algorithms with Leonardo Web.",
                    "Multilingual Sentence Hunter.",
                    "Design and Implementation of a Web-Board System for the Adaptive School Web Site Construction.",
                    "Developing Web-Based Learning Scenarios Using the IMS Learning Design: The ASK-LDT Environment.",
                    "Towards the Use of Web Services to Support the Provision of Learning Environments in Educational Modeling Languages.",
                    "A Framework for Monitoring the Unsupervised Educational Process and Adapting the Content and Activities to Students' Needs.",
                    "Web-Based Assessment Tests Supporting Learning.",
                    "A Personalized Mobile Learning System Using Multi-agent.",
                    "Collaborative Web-Based Nursing Practice Learning System.",
                    "Learning Object and Dynamic E-Learning Service Technologies for Simulation-Based Medical Instruction.",
                    "Time - Space Trade-Offs in Scaling up RDF Schema Reasoning.",
                    "OWLIM - A Pragmatic Semantic Repository for OWL.",
                    "Scaling the Kowari Metastore.",
                    "A Method for Performing an Exhaustive Evaluation of RDF(S) Importers.",
                    "Towards Automatic Generation of Semantic Types in Scientific Workflows.",
                    "A Semantic Distance Measure for Matching Web Services.",
                    "A Web Mining Method Based on Personal Ontology for Semi-structured RDF.",
                    "SPARQL Query Processing with Conventional Relational Database Systems.",
                    "Scalable Instance Retrieval for the Semantic Web by Approximation.",
                    "Reordering Query and Rule Patterns for Query Answering in a Rete-Based Inference Engine.",
                    "Scalable Peer-to-Peer RDF Query Algorithm."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2004",
                "sub_name": "Web Information Systems - WISE 2004, 5th International Conference on Web Information Systems Engineering, Brisbane, Australia, November 22-24, 2004, Proceedings.",
                "count": 77,
                "papers": [
                    "What Does It Mean to \"Measure Performance\"?",
                    "Trustworthy Computing (Extended Abstract).",
                    "Towards Next Generation Web Information Retrieval.",
                    "Making XML an Information Modeling Language.",
                    "Web Information Exchange Diagrams for UML.",
                    "A User Service Oriented Method to Model Web Information Systems.",
                    "The Power of Media Types.",
                    "Scenario Matching Using Functional Substitutability in Web Services.",
                    "Three Kinds of E-wallets for a NetPay Micro-Payment System.",
                    "Information Assurance in Federated Identity Management: Experimentations and Issues.",
                    "Query-Log Based Authority Analysis for Web Information Search.",
                    "XML Signature Extensibility Using Custom Transforms.",
                    "Extraction of Cognitively-Significant Place Names and Regions from Web-Based Physical Proximity Co-occurrences.",
                    "Query Based Chinese Phrase Extraction for Site Search.",
                    "Extracting Business Rules from Web Product Descriptions.",
                    "Wrapping HTML Tables into XML.",
                    "Vague Event-Based Related News Detection.",
                    "A Web Based Platform for the Design of Administrational Reference Process Models.",
                    "Technologies for Online Issuing Service of Documents.",
                    "AutoDBT: A Framework for Automatic Testing of Web Database Applications.",
                    "Web-Based Surgical Simulation of Craniofacial CT Data.",
                    "Applications of Data Mining in Web Services.",
                    "A Framework for the Relational Implementation of Tree Algebra to Retrieve Structured Document Fragments.",
                    "An Efficient OLAP Query Processing Technique Using Measure Attribute Indexes.",
                    "Preserving Aggregation Semantic Constraints in XML Document Update.",
                    "Exploiting PageRank at Different Block Level.",
                    "Multi-type Features Based Web Document Clustering.",
                    "Clustering Transactional XML Data with Semantically-Enriched Content and Structural Features.",
                    "Schema-Less, Semantics-Based Change Detection for XML Documents.",
                    "Discovering Minimal Infrequent Structures from XML Documents.",
                    "Temporal Web Page Summarization.",
                    "Web Pre-fetching Using Adaptive Weight Hybrid-Order Markov Model.",
                    "Text Categorization Based on Domain Ontology.",
                    "AC-Tree: An Adaptive Structural Join Index.",
                    "Approximate Query Answering for a Heterogeneous XML Document Base.",
                    "Optimization of XML Transformations Using Template Specialization.",
                    "Materialized View Maintenance for XML Documents.",
                    "An Efficient Algorithm for Clustering XML Schemas.",
                    "Google's \"I'm Feeling Lucky\", Truly a Gamble?",
                    "A Knowledge-Based Framework for the Rapid Development of Conversational Recommenders.",
                    "Categorizing Web Information on Subject with Statistical Language Modeling.",
                    "Optimizing Web Search Using Spreading Activation on the Clickthrough Data.",
                    "AVATAR: An Advanced Multi-agent Recommender System of Personalized TV Contents by Semantic Reasoning.",
                    "An Online Adaptive Method for Personalization of Search Engines.",
                    "Management of Serviceflow in a Flexible Way.",
                    "Recovery Nets: Towards Self-Adaptive Workflow Systems.",
                    "Structuring the Development of Inter-organizational Systems.",
                    "Contemplating Open Source Enterprise Systems.",
                    "Managing Changes to Virtual Enterprises on the Semantic Web.",
                    "A Reflective Approach to Keeping Business Characteristics in Business-End Service Composition.",
                    "A Domain Framework for Representation of Web System Impacts.",
                    "Knowledge Management in the Business Process Negotiation.",
                    "A Web Service Oriented Integration Approach for Enterprise and Business-to-Business Applications.",
                    "A Two-Phase Sampling Technique to Improve the Accuracy of Text Similarities in the Categorisation of Hidden Web Databases.",
                    "Capturing Web Dynamics by Regular Approximation.",
                    "Deep Crawling in the Semantic Web: In Search of Deep Knowledge.",
                    "Designing Localized Web Sites.",
                    "Scaling Dynamic Web Content Provision Using Elapsed-Time-Based Content Degradation.",
                    "Component Reconfiguration Tool for Software Product Lines with XML Technology.",
                    "Generating Multidimensional Schemata from Relational Aggregation Queries.",
                    "Semantics Based Conformance Assessment of ebXML Business Processes.",
                    "Usage Scenarios and Goals for Ontology Definition Metamodel.",
                    "XML Schema Matching Based on Incremental Ontology Update.",
                    "Spam Mail Filtering System Using Semantic Enrichment.",
                    "Integrating Ontology Knowledge into a Query Algebra for Multimedia Meta Objects.",
                    "Toward Semantic Web Services for Multimedia Adaptation.",
                    "A Lightweight Encryption Algorithm for Mobile Online Multimedia Devices.",
                    "Aspect-ARM: An Aspect-Oriented Active Rule System for Heterogeneous Multimedia Information.",
                    "Opportunistic Search with Semantic Fisheye Views.",
                    "A Graphical XQuery Language Using Nested Windows.",
                    "Grouping in MetaXQuery.",
                    "Search in Unstructured Peer-to-Peer Networks.",
                    "A Formal Model for the Grid Security Infrastructure.",
                    "SPSS: A Case of Semantic Peer-to-Peer Search System.",
                    "An Efficient Broadcast Algorithm Based on Connected Dominating Set in Unstructured Peer-to-Peer Network.",
                    "A Time-Based Peer Trust Evaluation in P2P E-commerce Environments.",
                    "Fault Resilience of Structured P2P Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2004-w",
                "sub_name": "Web Information Systems - WISE 2004 Workshops: WISE 2004 International Workshops, Brisbane, Australia, November 22-24, 2004. Proceedings.",
                "count": 26,
                "papers": [
                    "A Framework for Semantic Grid Service Discovery.",
                    "Toward a Formal Common Information Model Ontology.",
                    "On Using Conceptual Modeling for Ontologies.",
                    "MetaData Pro: Ontology-Based Metadata Processing for Web Resources.",
                    "Service-Oriented Semantic Peer-to-Peer Systems.",
                    "Towards Cross-Domain Security Properties Supported by Ontologies.",
                    "Open Knowledge Exchange for Workforce Development.",
                    "ShanghaiGrid Portal: The Current Stage of Building Information Grid Portal.",
                    "Learning Communities Support by Mobile Systems Based on Peer-to-Peer Networks.",
                    "A Context-Adaptive Model for Mobile Learning Applications.",
                    "MobiLearn: An Open Approach for Structuring Content for Mobile Learning Environments.",
                    "Smart Virtual Counterparts for Learning Communities.",
                    "Design and Implementation of Mobile Class Web Site for Promoting Communication.",
                    "A Personal Knowledge Assistant for Knowledge Storing, Integrating, and Querying.",
                    "Facilitating Collaborative Learning in Virtual (and Sometimes Mobile) Environments.",
                    "A Fundamental Web-Board System Toward the Adaptive Mobile School Web Site.",
                    "Mobile Computer-Assisted Language Learning Courseware for Korean Language Learners.",
                    "The Co-design Approach to WIS Development in E-business and E-learning Applications.",
                    "Using KCPM for Defining and Integrating Domain Ontologies.",
                    "Mobile Content Adaptation as an Optimisation Problem.",
                    "Applying Database Semantics to the WWW.",
                    "X-Square: A Hybrid Three-Dimensional Bitmap Indexing for XML Document Retrieval.",
                    "An Economy-Based Accounting System for Grid Computing Environments.",
                    "QoS-Based Message-Oriented Middleware for Web Services.",
                    "Incorporating QoS Specifications in Service Discovery.",
                    "QoS Based Pricing for Web Services."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th WISE 2003",
        "info": "Roma, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2003",
                "sub_name": "4th International Conference on Web Information Systems Engineering, WISE 2003, Rome, Italy, December 10-12, 2003.",
                "count": 53,
                "papers": [
                    "Service-Oriented Computing: Concepts, Characteristics and Directions.",
                    "Curated Databases.",
                    "WEB Sites Generate Dialogues! (Between Users and the Site).",
                    "Documents as Processes: A Unification of the Entire Web Service Stack.",
                    "Efficient Computation of Aggregate Structural Joins.",
                    "A Graphical Environment to Query XML Data with XQuery.",
                    "On the Role of Query Refinement in Searching for Information: The Librarian Agent Query Refinement Process.",
                    "MMWA: A Software Sizing Model for Web Applications.",
                    "ProxyTeller: A Proxy Placement Tool for Content Delivery under Performance Constraints.",
                    "Estimating Computation Times in Data Intensive E-Services.",
                    "A Dynamic Content Integration Language for Video Data and Web Content.",
                    "Publishing and Querying the Histories of Archived Relational Databases in XML.",
                    "Translating Content-Based Authorizations for XML Documents.",
                    "Enhancing Text Classification Using Synopses Extraction.",
                    "Crawling for Domain-Specific Hidden Web Resources.",
                    "A Lightweight Tool for Easy Web Site Navigation.",
                    "Flexible Interface Matching for Web-Service Discovery.",
                    "Agent Architectures to Support Collaborative Processes.",
                    "From Task-Oriented to Goal-Oriented Web Requirements Analysis.",
                    "WINK: A Web-Based System for Collaborative Project Management in Virtual Enterprises.",
                    "Concurrent Browsing of Bilingual Web Sites by Content-Synchronization and Difference-Detection.",
                    "Traversing the Web: Mobility Heuristics for Visually Impaired Surfers.",
                    "Switching Over to Paper: A New Web Channel.",
                    "Using a Layered Approach for Interoperability on the Semantic Web.",
                    "Supporting Model-Based Construction of Semantic-Enabled Web Applications.",
                    "Ontology Generation from Tables.",
                    "Semantic Web Services: Reflections on Web Service Mediation and Composition.",
                    "The Many Faces of Mapping and Translation for Semantic Web Services.",
                    "Search Types and Context of Use in the Semantic Web.",
                    "Managed Utility Computing.",
                    "Metadata-Driven Middleware for Web Services.",
                    "Performance Issues in Integrating a Capital Market Surveillance System Using Web Services.",
                    "Efficient Commit Processing of Web Transactions Using Priority Scheduling Mechanism.",
                    "A Rule Based Approach to the Service Composition Life-Cycle.",
                    "TERRA-ACQUA, Adaptable Definition and Execution of Workflows.",
                    "MAIS: Multichannel Adaptive Information Systems.",
                    "CodeX: An Approach for Debugging XSLT Transformations.",
                    "Quantifiers in XQuery.",
                    "Collaboration and Undo: The Web Workspace Paradigm.",
                    "Dynamic Virtual Storage Grid for Mobile Web Access.",
                    "Association Rules Mining for Name Entity Recognition.",
                    "Enabling Data Quality Notification in Cooperative Information Systems through aWeb-Service Based Architecture.",
                    "DIS@DIS: A System for Semantic Data Integration under Integrity Constraints.",
                    "D. I. C. E. and Co.In.S.: A Data Integration Cache Engine for a Content Integration System.",
                    "SymOntoX: A Web-Ontology Tool for eBusiness Domains.",
                    "A Reference Architecture for Knowledge Management-Based Web Systems.",
                    "ServiceCom: A Tool for Service Composition Reuse and Specialization.",
                    "The HyperHotel Application Built over D.I.C.E. and Co.In.S..",
                    "Web HorizoN: The Design of a 3D GIS Web Solution.",
                    "SemanticWeb Services: Facts and Fiction.",
                    "Conceptual Modelling of Web Applications, Workflows and Web Services.",
                    "Data Stream Query Processing.",
                    "Semantic Web Processes: Semantics Enabled Annotation, Discovery, Composition and Orchestration of Web Scale Processes."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2003w",
                "sub_name": "4th International Conference on Web Information Systems Engineering Workshops, WISE 2003 Workshops, Rome, Italy, December 13, 2003.",
                "count": 31,
                "papers": [
                    "A family of smart maps.",
                    "Optimization of geographic area to a Web page for two-dimensional range query processing.",
                    "Trajectory representation in location-based services: problems & solution.",
                    "Implementation and evaluation of an adaptive neighborhood information retrieval system for mobile users.",
                    "Fast indexing and updating method for moving objects on road networks.",
                    "Services-based data management in a global computing environment.",
                    "Distributed geo-referenced information accessing and integrating based on mobile agents and GML.",
                    "Web services for accuracy-based spatial query rewriting in a wrapper-mediator system.",
                    "Extensible platform for location based services provisioning.",
                    "Viewer-based directional querying for mobile applications.",
                    "Management of multi-resolution data in a mobile spatial information visualization system.",
                    "Pocket Panorama: 3D GIS on a handheld device.",
                    "Modular neural networks for map-matched GPS positioning.",
                    "Web services QoS: external SLAs and internal policies or: how do we deliver what we promise?",
                    "An approach to modeling Web service QoS and provision price.",
                    "Verity: a QoS metric for selecting Web services and providers.",
                    "Managing QoS through prioritization in Web services.",
                    "A concept for QoS integration in Web services.",
                    "A Framework for classifying and comparing Web services procurement platforms.",
                    "A quality model for e-Service based multi-channel adaptive information systems.",
                    "Assessing Web services quality for call-by-call outsourcing.",
                    "Usability of Web services.",
                    "An advanced architecture for push services.",
                    "A middleware architecture for inter ad-hoc networks communication.",
                    "Challenges in designing of cooperative mobile information systems for the risk map of Italian cultural heritage.",
                    "Designing adaptable geographic objects for mobile applications.",
                    "Extending WebML for modeling multi-channel context-aware Web applications.",
                    "Metatemplate driven multi-channel presentation.",
                    "Users' choice of channel in person-to-person communication.",
                    "E-service classification techniques to support discovery in a mobile multichannel environment.",
                    "Mobile adaptive information systems on MANET: what we need as basic layer?"
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "3rd WISE 2002",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2002-1",
                "sub_name": "3rd International Conference on Web Information Systems Engineering, WISE 2002, Singapore, December 12-14, 2002, Proceedings.",
                "count": 36,
                "papers": [
                    "Web services and data integration.",
                    "From Marketplaces to Web Services.",
                    "PTC : Proxies that Transcode and Cache in Heterogeneous Web Client Environments.",
                    "An Update-Risk Based Approach to TTL Estimation in Web Caching.",
                    "Semantic collaborative web caching.",
                    "A Stochastic Approach for Modeling and Computing Web Communities.",
                    "Online and Incremental Mining of Separately-Grouped Web Access Logs.",
                    "A Unified Framework for Web Link Analysis.",
                    "Topic Extraction from News Archive Using TF*PDF Algorithm.",
                    "Applying the Site Information to the Information Retrieval from the Web.",
                    "Evaluating and Enhancing Meta-Search Performance in Digital Libraries.",
                    "Path Locks for XML Document Collaboration.",
                    "UTML: Unified Transaction Modeling Language.",
                    "Towards Declarative XML Querying.",
                    "Querying Web Data - The WebQA Approach.",
                    "Evaluating and Selecting Web Sources as External Information Resources of a Data Warehouse.",
                    "A Unified Framework for Clustering Heterogeneous Web Objects.",
                    "RAL: an Algebra for Querying RDF.",
                    "Ontology-Based Automatic Classification for the Web Pages: Design, Implementation and Evaluation.",
                    "Extended Faceted Taxonomies for Web Catalogs.",
                    "Semantic Query Formulation and Evaluation for XML Databases.",
                    "Optimized Translation of XPath into Algebraic Expressions Parameterized by Programs Containing Navigational Primitives.",
                    "Processing XML View Queries Including User-defined Foreign Functions.",
                    "Database Support for Spatial Generalisation for WWW and Mobile Applications.",
                    "Storing and Maintaining Semistructured Data Efficiently in an Object-Relational Database.",
                    "Cluster-Based Delta Compression of a Collection of Files.",
                    "An MDP-based Peer-to-Peer Search Server Network.",
                    "A Content-Based Resource Location Mechanism in PeerIS.",
                    "Towards Translating Authorizations for Transformed XML Documents.",
                    "Formal Authorization Allocation Approaches for Role-Based Access Control Based on Relational Algebra Operations.",
                    "Data-rich Section Extraction from HTML pages.",
                    "BINGO!: Bookmark-Induced Gathering of Information.",
                    "Context-Dependent Web Bookmarks and Their Usage as Queries.",
                    "An Empirical Study on the Design Effort of Web Applications.",
                    "A RDF-based Model for Expressing Spatio-Temporal Relations Between Web Sites.",
                    "Fuzzy Cognitive Agents for Personalized Recommendation."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2002-2",
                "sub_name": "3rd International Conference on Web Information Systems Engineering Workshops, WISE 2002 Workshops, Singapore, December 11, 2002, Proceedings.",
                "count": 31,
                "papers": [
                    "Frequent Update and Efficient Retrieval: an Oxymoron on Moving Object Indexes?",
                    "G-Snake Double Transformation (GDT) Model for Semi-Automatic Registration of Internet Maps.",
                    "Classification of Web Pages with Geographic Scope and Level of Details for Mobile Cache Management.",
                    "Target3D : Interactive Visulaization over the World Wide Web.",
                    "Participatory Decision-Making for Ecological Planning.",
                    "VGE: A New Communication Platform for General Public.",
                    "Web Locality Based Ranking Utilizing Location Names and Link Structure.",
                    "Bus Catcher: a Context Sensitive Prototype System for Public Transportation Users.",
                    "GIS and GPS Integration and Mobile Handset Positioning.",
                    "Design and Implementation of a WAP GIS Framework.",
                    "The Share-Loc Project: a WAP-based maritime location system.",
                    "Design and Implementation of Map Visualization Objects in Component-based WebGIS.",
                    "Spatio-Temporal Information Integration in XML.",
                    "A Formal Verification Strategy for Crash Recovery in Web-Database Applications.",
                    "Efficiency and Performance of Web Cache Reporting Strategies.",
                    "Ranking of Web Data in a Web Warehouse.",
                    "Taxonomies in Operation, Design, and Meta-Design.",
                    "Information Concepts for Content Management.",
                    "Elegant Decision Tree Algorithm for Classification in Data Mining.",
                    "Conceptual Modeling for Semistructured Data.",
                    "Discovering Associations in XML Data.",
                    "Ontology-based Web Annotation Framework for HyperLink Structures.",
                    "An XML Specification Language to Support a Virtual Marketplace of Data Mining E-Services.",
                    "A Matrix Approach for Hierarchical Web Page Clustering Based on Hyperlinks.",
                    "Evaluating Web Access Log Mining Algorithms: A Cognitive Approach.",
                    "Two Odds-Radio-Based Text Classification Algorithms.",
                    "Mining Web Logs for Personalized Site Maps.",
                    "Log Mining to Improve the Performance of Site Search.",
                    "On Enhancing Searching for Information in an Information Portal by Tracking Users' Activities.",
                    "Search for FlashTM Movies on the Web.",
                    "Extracting Relevant Information for a Domain-specific Search Service using Knowledge-based Mining Techniques."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "2nd WISE 2001",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2001-1",
                "sub_name": "Proceedings of the 2nd International Conference on Web Information Systems Engineering, WISE'01, Organized by WISE Society and Kyoto University, Kyoto, Japan, 3-6 December 2001, Volume 1 (Main program).",
                "count": 37,
                "papers": [
                    "Design and Implementation of a PKI-Based End-to-End Secure Infrastructure for Mobile E-Commerce.",
                    "Semantic Models for Knowledge Management.",
                    "Integration of Multiple Dissemination-Based Information Sources Using Source Data Arrival Properties.",
                    "Mediators over Ontology-Based Information Sources.",
                    "A Semantic Taxonomy-Based Personalizable Meta-Search Agent.",
                    "A Consumer Scalable Anonymity Payment Scheme with Role-Based Access Control.",
                    "A 2-Phase Evaluation Model for Agent-Mediated Internet Marketplaces.",
                    "A Flexible Workflow Model for Process-Oriented Applications.",
                    "Digest Making Method Based on Turning Point Analysis.",
                    "Web-Based Multimedia Retrieval: Balancing Out between Common Knowledge and Personalized Views.",
                    "XML-Based Video Annotation System for Language Learning Environment.",
                    "Use Link-Based Clustering to Improve Web Search Results.",
                    "A Meta-Search Method Reinforced by Cluster Descriptors.",
                    "A Probabilistic Approach for Discovering Authoritative Web Pages.",
                    "An Edition Control Policy Model for Scientific Collaborative Databases.",
                    "An On-Line Sign Language Communication System.",
                    "XML Structures for Relational Data.",
                    "Mapping DTDs to Object-Oriented Schemas.",
                    "Designing Semistructured Databases Using ORA-SS Model.",
                    "Extension Mechanism in Extensible XML Query Language X2QL.",
                    "Observing Transaction-Time Semantics with TTXPath.",
                    "XForms in X-Smiles.",
                    "Algebraic XML Construction in Natix.",
                    "Design and Evaluation of an Example-Based Graphical Manipulation Framework for XML.",
                    "Storing and Querying Multiversion XML Documents using Durable Node Numbers.",
                    "Support IR Query Refinement by Partial Keyword Set.",
                    "A Rough Set-Based Hybrid Method to Text Categorization.",
                    "Using Online Relevance Feedback to Build Effective Personalized Metasearch Engine.",
                    "MOT: Memory Online Tracing of Web Information System.",
                    "Fast Online Dynamic Association Rule Mining.",
                    "Real-Time Web Usage Mining: A Heuristic Based Distributed Miner.",
                    "An Approach to Relate the Web Communities through Bipartite Graphs.",
                    "Using Link Types in Web Page Ranking and Filtering.",
                    "A Cognitive Study of Information Seeking Processes in the WWW: The Effects of Searcher's Knowledge and Experience.",
                    "Authentic Publication of XML Document Data.",
                    "Using Weight-Controlled Token Matching to Extract Data from HTML Files.",
                    "A Unified Framework for Data Translation over the Web."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2001-2",
                "sub_name": "Proceedings of the 2nd International Conference on Web Information Systems Engineering, WISE'01, Organized by WISE Society and Kyoto University, Kyoto, Japan, 3-6 December 2001, Volume 2 (Workshops).",
                "count": 28,
                "papers": [
                    "A Model for Web Spatial Data Integration.",
                    "Web-Based Inference Rules for Processing Conceptual Geographical Relationships.",
                    "A GML-Based Open Architecture for Building a Geographical Information Search Engine over the Internet.",
                    "ISMART(tm) + i-Spatia(tm) - Information Server: Deploying Integrated Web-Based Spatial Applications within an Oracle Database Environment.",
                    "Semantic and Interoperable WebGIS.",
                    "Representation and Display of Geospatial Information: A Comparison of ArcXML and SVG.",
                    "Accessing to Spatial Data in Mobile Environment.",
                    "Developing GIS-Supported Location-Based Services.",
                    "\"GIS on the Fly\" to Realize Wireless GIS Network by Java Mobile Phone.",
                    "Intelligent Visual Data Analysis Service in the Internet.",
                    "Exploratory Geospatial Analysis Using GeoVISTA Studio: From a Desktop to the Web.",
                    "Towards Geoservices Portals MEDIAMAPS: WGIS Trends for Business Applications.",
                    "A Framework for a Multidimensional OLAP Model using Topic Maps.",
                    "Adaptive Context Aware Legal Work Environments - Basis for Developing Legal Live Spaces on the Web.",
                    "Making the VoiceWeb Smarter - Integrating Intelligent Component Technologies and VoiceXML.",
                    "Web Semantics in e-Government: A Tour d'Horizon on Essential Feature.",
                    "Web Metadata Semantics - On the Road to Well-Formed Topic Maps.",
                    "Persistent Topic Maps for Knowledge and Web Content Management.",
                    "Specifying Ontologies: Linguistic Aspects in Problem-Driven Knowledge Engineering.",
                    "Network Monitoring in Broadband Network.",
                    "Load Balancing Policies for Multiple Home Agents Mobile IP Networks.",
                    "Experimental Results on a Constrained Based Sequential Pattern Mining for Telecommunication Alarm Data.",
                    "Developing Digital Libraries for University Education - Tsinghua Architecture Digital Library Study.",
                    "The Design and Realization of E-Journals' Categorizing and Navigating System.",
                    "A Scheme to Construct a Global File System.",
                    "New Organizations for IT-related R&D at Osaka University.",
                    "On the Newly Established Graduate School of Information Science and Technology of the University of Tokyo.",
                    "Some Information Systems and Projects of Kyoto University."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "1st WISE 2000",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wise/2000-1",
                "sub_name": "WISE 2000, Proceedings of the First International Conference on Web Information Systems Engineering, Volume I (Main Program), Hong Kong, China, June 19-21, 2000.",
                "count": 64,
                "papers": [
                    "Streaming Real-Time Audio and Video Data with Transformation-Based Error Concealment and Reconstruction.",
                    "Hyperdatabases.",
                    "A Middleware Approach for Combining Heterogeneous Data Sources-Integration of Generic Query and Predefined Function Access.",
                    "Efficient Web-Based Access to Multiple Geographic Databases Through Automatically Generated Wrappers.",
                    "Multicache-Based Content Management for Web Caching.",
                    "Shift it to the Server!-Let the Database Server Update Your Websites.",
                    "Optimal Placement of Proxies of Replicated Web Servers in the Internet.",
                    "XML Schema Directory: A Data Structure for XML Data Processing.",
                    "XML Content Management Based on Object-Relational Database Technology.",
                    "Interoperability and Semi-Structured Data in an Open Web-Based Agent Information System.",
                    "Distributed Object-Oriented Schema for XML-Based Electronic Catalog Sharing Semantics among Businesses.",
                    "Architecture of a Content Management Server for XML Document Applications.",
                    "XML based Text TV.",
                    "A Semantic Similarity Approach to Electronic Document Modeling and Integration.",
                    "Global Atlas: Calibrating and Indexing Documents from the Internet in the Cartographic Paradigm.",
                    "Dynamic Aspects of Documents of the Brazilian Web.",
                    "A Role-Based Access Control Model for XML Repositories.",
                    "Logging and Signing Document-Transfers on the WWW-A Trusted Third Party Gateway.",
                    "Using Class Decompilers to Facilitate the Security of Java Applications!",
                    "The Most Efficient Uniquely Decipherable Encoding Schemes.",
                    "A Web-Based Transactional Workflow Monitoring System.",
                    "Web Interface-Driven Cooperative Exeption Handling in ADOME Workflow Management System.",
                    "Timed Workflow: Concept, Model, and Method.",
                    "Consistency Preserving in Transaction Processing on the Web.",
                    "A Transaction Management Scheme with Mark in Decision Supporting Environments.",
                    "WebSail: From On-Line Learning to Web Search.",
                    "WhatNext: A Prediction System for Web Requests Using N-gram Sequence Models.",
                    "Searching the Web Using a Map.",
                    "A Semantic Associative Search Method for WWW Information Resources.",
                    "Querying Multiple Databases Dynamically on the World Wide Web.",
                    "QUERYAID: A Query Formulation Model for and by Reuse.",
                    "A Web Site Indexing Process for an Internet Information Retrieval Agent System.",
                    "Modelling the Webspace of an Intranet.",
                    "Modeling Business Processes for Web-based Information System Development.",
                    "Concept Hierarchical based Text Database Categorization in a Metasearch Engine Environment.",
                    "Model and Research Issues for Refreshing a Very Large Website.",
                    "Automatic Generation of Ontology based Annotations in XML and Their Use in Retrieval Systems.",
                    "Visualization of Web-based Workspace Structures.",
                    "Visualization of Linear Time-Oriented Data: A Survey.",
                    "Database and Modelling Strategy: A Compliant Way for Display Optimisation.",
                    "Supporting a Focus+Context Interaction Style for Spatial Databases.",
                    "Visualization and Control Functions for Distributed Database Systems.",
                    "Visual Support for Text Information Retrieval based on Matrix's Singular Value Decomposition.",
                    "A Visual Representation of Search-Engine Queries and Their Results.",
                    "Metadata Management Concept for Multidimensional OLAP Data based on Object-Oriented Concepts.",
                    "Mining Term Association Rules for Automatic Global Query Expansion: Methodology and Preliminary Results.",
                    "A Model for Evaluating Materialized View Maintenance Algorithms.",
                    "A Signature Representation and Indexing Scheme of Color-Spatial Information for Similar Image Retrieval.",
                    "VideoMAP*: A Web-based Architecture for a Spatio-Temporal Video Database Management System.",
                    "Conflict Control Locking in Distributed Cooperative Graphics Editors.",
                    "Interactive Graphics for Web based Applications.",
                    "Optional and Responsive Locking in Distributed Collaborative Object Graphics Editing Systems.",
                    "Speech Recognition Using Artificial Neural Networks.",
                    "Advertising Services in the Internet Marketplace.",
                    "Automatic Genration of Reliable E-Commerce Payment Processes.",
                    "Developing Web-Aware Systems.",
                    "A Fast and Flexible Framework of Scripting for Web Application Development: A Preliminary Experience Report.",
                    "Future Smart-Organizations: A Virtual Tourism Enterprise.",
                    "Design of Data-Intesive Web-based Information Services.",
                    "A Static Java Classifier Analyzer.",
                    "Internet EDI Implementation to Support Multiple Document Standards for R&D Project Management.",
                    "A Whole Correlation Structure of Asymptotically Self-Similar Traffic in Communication Networks.",
                    "Supporting Online Web-based Teamwork in Offline Mobile Mode Too.",
                    "Towards an Integrated Systems Approach for Mobile Traveller Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/wise/2000-2",
                "sub_name": "WISE 2000, Proceedings of the First International Conference on Web Information Systems Engineering, Volume II, Hong Kong, China, June 19-21, 2000.",
                "count": 31,
                "papers": [
                    "Conceptual Levels of SGML Tags: A Proposed Taxonomy based on the Tagging in the Orlando Project.",
                    "Web Data Cleansing and Preparation for Ontology Extraction using WordNet.",
                    "Using Contextual Semantics to Automate the Web Document Search and Analysis.",
                    "Web Documents Categorization using Fuzzy Representation and HAC.",
                    "A Cognitive Model for Adaptive Hypermedia Systems.",
                    "Data Mining Algorithms for Web Pre-Fetching.",
                    "Object-Oriented Mediator Queries to XML Data.",
                    "WebReader: A Mechanism for Automating the Search and Collecting Information from the World Wide Web.",
                    "Constraint Databases.",
                    "Creating Data Exchange Standards with XML: A Waste?",
                    "Developing an XML Gateway for Business-to-Business Commerce.",
                    "An Extended Conceptual Model for Fuzzy Data Modeling.",
                    "Analysis of Distributed Database Access Histories for Buffer Allocation.",
                    "Signature Coding for Meta Objects.",
                    "Structured Web Pages Management for Efficient Data Retrieval.",
                    "Shared XML Documents in Service Centers of the Future.",
                    "Schema Extraction for Multimedia XML Document Retrieval.",
                    "Online Web Mining Transactions Association Rules using Frame Metadata Model.",
                    "Data Mining and XML: Current and Future Issues.",
                    "A Web Based System for Managing University Research Centre Web Sites.",
                    "Generation of Java Beans to Access XML Data.",
                    "Electronic Commerce Solution for Small Businesses.",
                    "Reverse Software Engineering with UML for Web Site Maintenance.",
                    "Smart-Web.",
                    "Synchronous Distance Education: Enhancing Speaking Skills via Internet-based Real Time Technology.",
                    "Development of Web Customize System for Sharing Educational Resources.",
                    "Modular Development of Multimedia Courseware.",
                    "Real-Time Quiz Functions for Dynamic Group Guidance in Distance Learning Systems.",
                    "A Principled Approach for Formative Web Learning Assessment and Adaptive Tutoring.",
                    "Personalized Courseware Construction based on Web Data Mining.",
                    "Database Support of Web Course Development with Design Patterns."
                ]
            }
        ]
    }
]