[
    {
        "year": "2022",
        "name": "15th WSDM 2022",
        "info": "Virtual Event / Tempe, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2022",
                "sub_name": "WSDM '22: The Fifteenth ACM International Conference on Web Search and Data Mining, Virtual Event / Tempe, AZ, USA, February 21 - 25, 2022.",
                "count": 210,
                "papers": [
                    "Ethical Challenges in AI.",
                    "Knowledge is Power: Symbolic Knowledge Distillation, Commonsense Morality, & Multimodal Script Knowledge.",
                    "Graph Neural Network Research at AWS AI.",
                    "k-Clustering with Fair Outliers.",
                    "Wikipedia Reader Navigation: When Synthetic Data Is Enough.",
                    "Harvesting More Answer Spans from Paragraph beyond Annotation.",
                    "Sampling Multiple Nodes in Large Networks: Beyond Random Walks.",
                    "'It's on the tip of my tongue': A new Dataset for Known-Item Retrieval.",
                    "CAN: Feature Co-Action Network for Click-Through Rate Prediction.",
                    "Towards Understanding and Answering Comparative Questions.",
                    "Graph Collaborative Reasoning.",
                    "A Personalized Cross-Platform Post Style Transfer Method Based on Transformer and Bi-Attention Mechanism.",
                    "Modeling Scale-free Graphs with Hyperbolic Geometry for Knowledge-aware Recommendation.",
                    "Estimating Causal Effects of Multi-Aspect Online Reviews with Multi-Modal Proxies.",
                    "Causal Mediation Analysis with Hidden Confounders.",
                    "AdaptKT: A Domain Adaptable Method for Knowledge Tracing.",
                    "An Adaptive Unified Allocation Framework for Guaranteed Display Advertising.",
                    "The Datasets Dilemma: How Much Do We Really Know About Recommendation Datasets?",
                    "S-Walk: Accurate and Scalable Session-based Recommendation with Random Walks.",
                    "ANTHEM: Attentive Hyperbolic Entity Model for Product Search.",
                    "Beyond NED: Fast and Effective Search Space Reduction for Complex Question Answering over Knowledge Bases.",
                    "Towards Robust Graph Neural Networks for Noisy Graphs with Sparse Labels.",
                    "Predicting Human Mobility via Graph Convolutional Dual-attentive Networks.",
                    "Deep-QPP: A Pairwise Interaction-based Deep Learning Model for Supervised Query Performance Prediction.",
                    "Improving Personalized Search with Dual-Feedback Network.",
                    "Combinatorial Bandits under Strategic Manipulations.",
                    "Understanding and Improvement of Adversarial Training for Network Embedding from an Optimization Perspective.",
                    "Semi-supervised Stance Detection of Tweets Via Distant Network Supervision.",
                    "External Evaluation of Ranking Models under Extreme Position-Bias.",
                    "Modeling Users' Contextualized Page-wise Feedback for Click-Through Rate Prediction in E-commerce Search.",
                    "Variational User Modeling with Slow and Fast Features.",
                    "How Do You Test a Test?: A Multifaceted Examination of Significance Tests.",
                    "Efficient Graph Convolution for Joint Node Representation Learning and Clustering.",
                    "Leveraging Multi-view Inter-passage Interactions for Neural Document Ranking.",
                    "HeteroQA: Learning towards Question-and-Answering through Multiple Information Sources via Heterogeneous Graph Modeling.",
                    "Toward Pareto Efficient Fairness-Utility Trade-off in Recommendation through Reinforcement Learning.",
                    "Differentially Private Ensemble Classifiers for Data Streams.",
                    "Multi-Scale Variational Graph AutoEncoder for Link Prediction.",
                    "Learning Multi-granularity Consecutive User Intent Unit for Session-based Recommendation.",
                    "Outside In: Market-aware Heterogeneous Graph Neural Network for Employee Turnover Prediction.",
                    "Dy-HIEN: Dynamic Evolution based Deep Hierarchical Intention Network for Membership Prediction.",
                    "Keyword Assisted Embedded Topic Model.",
                    "It Is Different When Items Are Older: Debiasing Recommendations When Selection Bias and User Preferences Are Dynamic.",
                    "POLE: Polarized Embedding for Signed Networks.",
                    "Triangle Graph Interest Network for Click-through Rate Prediction.",
                    "On Generalizing Static Node Embedding to Dynamic Settings.",
                    "KGNN: Harnessing Kernel-based Networks for Semi-supervised Graph Classification.",
                    "Leveraging World Events to Predict E-Commerce Consumer Demand under Anomaly.",
                    "GAGE: Geometry Preserving Attributed Graph Embeddings.",
                    "Query Interpretations from Entity-Linked Segmentations.",
                    "An Unsupervised Detection Framework for Chinese Jargons in the Darknet.",
                    "ConsistSum: Unsupervised Opinion Summarization with the Consistency of Aspect, Sentiment and Semantic.",
                    "Cluster-Aware Heterogeneous Information Network Embedding.",
                    "Doubly Robust Off-Policy Evaluation for Ranking Policies under the Cascade Behavior Model.",
                    "Introducing the Expohedron for Efficient Pareto-optimal Fairness-Utility Amortizations in Repeated Rankings.",
                    "Multi-Resolution Attention for Personalized Item Search.",
                    "Linear, or Non-Linear, That is the Question!",
                    "Efficient Two-stage Label Noise Reduction for Retrieval-based Tasks.",
                    "Differential Query Semantic Analysis: Discovery of Explicit Interpretable Knowledge from E-Com Search Logs.",
                    "Collaborative Curating for Discovery and Expansion of Visual Clusters.",
                    "A Cooperative Neural Information Retrieval Pipeline with Knowledge Enhanced Automatic Query Reformulation.",
                    "Unsupervised Cross-Domain Adaptation for Response Selection Using Self-Supervised and Adversarial Training.",
                    "RecGURU: Adversarial Learning of Generalized User Representations for Cross-Domain Recommendation.",
                    "Graph Embedding with Hierarchical Attentive Membership.",
                    "Surrogate Representation Learning with Isometric Mapping for Gray-box Graph Adversarial Attacks.",
                    "Improving Knowledge Tracing with Collaborative Information.",
                    "An Ensemble Model for Combating Label Noise.",
                    "Non-stationary Continuum-armed Bandits for Online Hyperparameter Optimization.",
                    "The Multi-vehicle Ride-Sharing Problem.",
                    "Ada-GNN: Adapting to Local Patterns for Improving Graph Neural Networks.",
                    "RLMob: Deep Reinforcement Learning for Successive Mobility Prediction.",
                    "ComGA: Community-Aware Attributed Graph Anomaly Detection.",
                    "VAE++: Variational AutoEncoder for Heterogeneous One-Class Collaborative Filtering.",
                    "Adversarial Attack on Graph Neural Networks as An Influence Maximization Problem.",
                    "Diversified Subgraph Query Generation with Group Fairness.",
                    "Learning Fair Node Representations with Graph Counterfactual Fairness.",
                    "Deep Graph-level Anomaly Detection by Glocal Knowledge Distillation.",
                    "Fast Learning of MNL Model from General Partial Rankings with Application to Network Formation Modeling.",
                    "Pretraining Multi-modal Representations for Chinese NER Task with Cross-Modality Attention.",
                    "Speaker and Time-aware Joint Contextual Learning for Dialogue-act Classification in Counselling Conversations.",
                    "Learning Relevant Questions for Conversational Product Search using Deep Reinforcement Learning.",
                    "MTLTS: A Multi-Task Framework To Obtain Trustworthy Summaries From Crisis-Related Microblogs.",
                    "Reconfiguration Problems on Submodular Functions.",
                    "Heterogeneous Global Graph Neural Networks for Personalized Session-based Recommendation.",
                    "Reinforcement Learning over Sentiment-Augmented Knowledge Graphs towards Accurate and Explainable Recommendation.",
                    "EvoKG: Jointly Modeling Event Time and Network Structure for Reasoning over Temporal Knowledge Graphs.",
                    "Scope-aware Re-ranking with Gated Attention in Feed.",
                    "Contrastive Learning for Representation Degeneration Problem in Sequential Recommendation.",
                    "A Simple but Effective Bidirectional Framework for Relational Triple Extraction.",
                    "Time Masking for Temporal Language Models.",
                    "On Sampling Collaborative Filtering Datasets.",
                    "Understanding and Mitigating the Effect of Outliers in Fair Ranking.",
                    "Enumerating Fair Packages for Group Recommendations.",
                    "Retrieving Black-box Optimal Images from External Databases.",
                    "Evaluating Mixed-initiative Conversational Search Systems via User Simulation.",
                    "Diversified Query Generation Guided by Knowledge Graph.",
                    "Finding a Concise, Precise, and Exhaustive Set of Near Bi-Cliques in Dynamic Graphs.",
                    "Using Conjunctions for Faster Disjunctive Top-k Queries.",
                    "Attributed Graph Modeling with Vertex Replacement Grammars.",
                    "Sequential Modeling with Multiple Attributes for Watchlist Recommendation in E-Commerce.",
                    "Show Me the Whole World: Towards Entire Item Space Exploration for Interactive Personalized Recommendations.",
                    "Choosing the Best of Both Worlds: Diverse and Novel Recommendations through Multi-Objective Reinforcement Learning.",
                    "Efficient Reachability Query with Extreme Labeling Filter.",
                    "MonLAD: Money Laundering Agents Detection in Transaction Streams.",
                    "Graph Few-shot Class-incremental Learning.",
                    "Uncovering Causal Effects of Online Short Videos on Consumer Behaviors.",
                    "Friend Story Ranking with Edge-Contextual Local Graph Convolutions.",
                    "DAME: Domain Adaptation for Matching Entities.",
                    "A New Class of Polynomial Activation Functions of Deep Learning for Precipitation Forecasting.",
                    "Learning-To-Ensemble by Contextual Rank Aggregation in E-Commerce.",
                    "Knowledge Enhanced Sports Game Summarization.",
                    "MtCut: A Multi-Task Framework for Ranked List Truncation.",
                    "A Sequence-to-Sequence Model for Large-scale Chinese Abbreviation Database Construction.",
                    "Personalized Long-distance Fuel-efficient Route Recommendation Through Historical Trajectories Mining.",
                    "Hierarchical Imitation Learning via Subgoal Representation Learning for Dynamic Treatment Recommendation.",
                    "Structure Meets Sequences: Predicting Network of Co-evolving Sequences.",
                    "Scalable Graph Topology Learning via Spectral Densification.",
                    "Profiling the Design Space for Graph Neural Networks based Collaborative Filtering.",
                    "Contrastive Meta Learning with Behavior Multiplicity for Recommendation.",
                    "A Cooperative-Competitive Multi-Agent Framework for Auto-bidding in Online Advertising.",
                    "Crowdsourcing-based Multi-Device Communication Cooperation for Mobile High-Quality Video Enhancement.",
                    "Improving the Applicability of Knowledge-Enhanced Dialogue Generation Systems by Using Heterogeneous Knowledge from Multiple Sources.",
                    "Towards Unbiased and Robust Causal Ranking for Recommender Systems.",
                    "Long Short-Term Temporal Meta-learning in Online Recommendation.",
                    "A Peep into the Future: Adversarial Future Encoding in Recommendation.",
                    "Supervised Advantage Actor-Critic for Recommender Systems.",
                    "Informed Multi-context Entity Alignment.",
                    "Identifying Cost-effective Debunkers for Multi-stage Fake News Mitigation Campaigns.",
                    "MAF: A General Matching and Alignment Framework for Multimodal Named Entity Recognition.",
                    "Translating Human Mobility Forecasting through Natural Language Generation.",
                    "Lightweight Composite Re-Ranking for Efficient Keyword Search with BERT.",
                    "Few-shot Link Prediction in Dynamic Networks.",
                    "MAVE: A Product Dataset for Multi-source Attribute Value Extraction.",
                    "Interpretable Relation Learning on Heterogeneous Graphs.",
                    "Fast Semantic Matching via Flexible Contextualized Interaction.",
                    "Assessing Algorithmic Biases for Musical Version Identification.",
                    "Directed Network Embedding with Virtual Negative Edges.",
                    "Bringing Your Own View: Graph Contrastive Learning without Prefabricated Data Augmentations.",
                    "Sentiment Analysis of Fashion Related Posts in Social Media.",
                    "Community Trend Prediction on Heterogeneous Graph in E-commerce.",
                    "Learning Discrete Representations via Constrained Clustering for Effective and Efficient Dense Retrieval.",
                    "Geometric Inductive Matrix Completion: A Hyperbolic Approach with Unified Message Passing.",
                    "ESC-GAN: Extending Spatial Coverage of Physical Sensors.",
                    "MotifClass: Weakly Supervised Text Classification with Higher-order Metadata Information.",
                    "Leaving No One Behind: A Multi-Scenario Multi-Task Meta Learning Approach for Advertiser Modeling.",
                    "Learning Concept Prerequisite Relations from Educational Data via Multi-Head Attention Variational Graph Auto-Encoders.",
                    "A GNN-based Multi-task Learning Framework for Personalized Video Search.",
                    "GraSP: Optimizing Graph-based Nearest Neighbor Search with Subgraph Sampling and Pruning.",
                    "CMT-Net: A Mutual Transition Aware Framework for Taxicab Pick-ups and Drop-offs Co-Prediction.",
                    "PipAttack: Poisoning Federated Recommender Systems for Manipulating Item Promotion.",
                    "A Counterfactual Modeling Framework for Churn Prediction.",
                    "Towards Fair Classifiers Without Sensitive Attributes: Exploring Biases in Related Features.",
                    "ST-GSP: Spatial-Temporal Global Semantic Representation Learning for Urban Flow Prediction.",
                    "Multi-Sparse-Domain Collaborative Recommendation via Enhanced Comprehensive Aspect Preference Learning.",
                    "Joint Learning of E-commerce Search and Recommendation with a Unified Graph Neural Network.",
                    "AngHNE: Representation Learning for Bipartite Heterogeneous Networks with Angular Loss.",
                    "Learning Transferable Node Representations for Attribute Extraction from Web Documents.",
                    "C²-CRS: Coarse-to-Fine Contrastive Learning for Conversational Recommender System.",
                    "Fighting Mainstream Bias in Recommender Systems via Local Fine Tuning.",
                    "Personalized Transfer of User Preferences for Cross-domain Recommendation.",
                    "DualDE: Dually Distilling Knowledge Graph Embedding for Faster and Cheaper Reasoning.",
                    "A Neighborhood-Attention Fine-grained Entity Typing for Knowledge Graph Completion.",
                    "Improving Session Search by Modeling Multi-Granularity Historical Query Change.",
                    "Improving Text Generation via Neural Discourse Planning.",
                    "Robust Graph Learning for Misbehavior Detection.",
                    "GNNs for Node Clustering in Signed and Directed Networks.",
                    "Towards Practical Robustness Evaluation and Robustness Enhancing.",
                    "From Uni-relational to Multi-relational Graph Neural Networks.",
                    "Trustworthy Machine Learning: Fairness and Robustness.",
                    "Obtaining Robust Models from Imbalanced Data.",
                    "Fair Graph Representation Learning with Imbalanced and Biased Data.",
                    "Doctoral Consortium of WSDM'22: Exploring the Bias of Adversarial Defenses.",
                    "Quality Assurance of a German COVID-19 Question Answering Systems using Component-based Microbenchmarking.",
                    "iLFQA: A Platform for Efficient and Accurate Long-Form Question Answering.",
                    "Web Search via an Efficient and Effective Brain-Machine Interface.",
                    "Aligning the Research and Practice of Building Search Applications: Elasticsearch and Pyserini.",
                    "Building Multi-turn Query Interpreters for E-commercial Chatbots with Sparse-to-dense Attentive Modeling.",
                    "Automating ETL and Mining of Ethereum Blockchain Network.",
                    "a2RegInf: An Interactive System for Maximizing Influence within Arbitrary Number of Arbitrary Shaped Query Regions.",
                    "Node Co-occurrence based Graph Neural Networks for Knowledge Graph Link Prediction.",
                    "PrivacyCheck v3: Empowering Users with Higher-Level Understanding of Privacy Policies.",
                    "RGRecSys: A Toolkit for Robustness Evaluation of Recommender Systems.",
                    "Fair-SRS: A Fair Session-based Recommendation System.",
                    "Crowd_Frame: A Simple and Complete Framework to Deploy Complex Crowdsourcing Tasks Off-the-shelf.",
                    "An Interactive Knowledge Graph Based Platform for COVID-19 Clinical Research.",
                    "Personalized Information Retrieval for Touristic Attractions in Augmented Reality.",
                    "Search and Discovery in Personal Email Collections.",
                    "Graph Minimally-supervised Learning.",
                    "Graph Neural Networks for Recommender System.",
                    "A Tutorial on Stance Detection.",
                    "Half-Day Tutorial on Combating Online Hate Speech: The Role of Content, Networks, Psychology, User Behavior, etc.",
                    "Fact-Checking, Fake News, Propaganda, Media Bias, and the COVID-19 Infodemic.",
                    "Modern Theoretical Tools for Understanding and Designing Next-generation Information Retrieval System.",
                    "The Pit Stop Problem: How to Plan Your Next Road Trip.",
                    "Predicting Users' Gender and Age based on Mobile Tasks.",
                    "Towards a Cross-domain Semantically Interoperable Ecosystem.",
                    "Exploration in Recommender Systems.",
                    "Studying Long-Term User Behaviour Using Dynamic Time Warping for Customer Retention.",
                    "AI & Public Data for Humanitarian and Emergency Response.",
                    "Scalable Attribute Extraction at Instacart.",
                    "A Practical Guide to Robust Multimodal Machine Learning and Its Application in Education.",
                    "Mining Frequent Patterns on Knowledge Graphs.",
                    "Near Real Time AI Personalization for Notifications at LinkedIn.",
                    "Successes and Opportunities in Enterprise AI.",
                    "Experiments with Predictive Long Term Guardrail Metrics.",
                    "Challenges in Data Production for AI with Human-in-the-Loop.",
                    "Rethink e-Commerce Search.",
                    "The Incentives Platform at Lyft.",
                    "Graph Neural Networks for the Global Economy with Microsoft DeepGraph.",
                    "The Rise of Data Observability: Architecting the Future of Data Trust."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "14th WSDM 2021",
        "info": "Virtual Event, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2021",
                "sub_name": "WSDM '21, The Fourteenth ACM International Conference on Web Search and Data Mining, Virtual Event, Israel, March 8-12, 2021.",
                "count": 158,
                "papers": [
                    "Some Thoughts on Computational Natural Language in the 21st Century.",
                    "Beyond Web Search: How Email Search is Different and Why it Matters.",
                    "Harnessing Big Data for Personalized Medicine.",
                    "Population-Scale Study of Human Needs During the COVID-19 Pandemic: Analysis and Implications.",
                    "Ad Delivery Algorithms: The Hidden Arbiters of Political Messaging.",
                    "Towards Ordinal Suicide Ideation Detection on Social Media.",
                    "DeepXML: A Deep Extreme Multi-Label Learning Framework Applied to Short Text Documents.",
                    "Semi-Supervised Text Classification via Self-Pretraining.",
                    "DECAF: Deep Extreme Classification with Label Features.",
                    "Modeling Across-Context Attention For Long-Tail Query Classification in E-commerce.",
                    "On the Impact of Predicate Complexity in Crowdsourced Classification Tasks.",
                    "Beyond Point Estimate: Inferring Ensemble Prediction Variation from Neuron Activation Strength in Recommender Systems.",
                    "Popularity-Opportunity Bias in Collaborative Filtering.",
                    "A Black-Box Attack Model for Visually-Aware Recommender Systems.",
                    "Leave No User Behind: Towards Improving the Utility of Recommender Systems for Non-mainstream Users.",
                    "Real-time Relevant Recommendation Suggestion.",
                    "User Response Models to Improve a REINFORCE Recommender System.",
                    "Diverse User Preference Elicitation with Multi-Armed Bandits.",
                    "RePBubLik: Reducing Polarized Bubble Radius with Link Insertions.",
                    "Node Similarity Preserving Graph Convolutional Networks.",
                    "BiTe-GCN: A New GCN Architecture via Bidirectional Convolution of Topology and Features on Text-Rich Networks.",
                    "Deconfounding with Networked Observational Data in a Dynamic Environment.",
                    "Balanced Influence Maximization in the Presence of Homophily.",
                    "Learning and Updating Node Embedding on Dynamic Heterogeneous Information Network.",
                    "Online Experimentation with Surrogate Metrics: Guidelines and a Case Study.",
                    "CONQ: CONtinuous Quantile Treatment Effects for Large-Scale Online Controlled Experiments.",
                    "Causal Transfer Random Forest: Combining Logged Data and Randomized Experiments for Robust Prediction.",
                    "Relation-aware Meta-learning for E-commerce Market Segment Demand Prediction with Limited Records.",
                    "Credit Risk and Limits Forecasting in E-Commerce Consumer Lending Service via Multi-view-aware Mixture-of-experts Nets.",
                    "Shifting Consumption towards Diverse Content on Music Streaming Platforms.",
                    "Chebyshev Accelerated Spectral Clustering.",
                    "Theoretical Understandings of Product Embedding for E-commerce Machine Learning.",
                    "Pre-Training Graph Neural Networks for Cold-Start Users and Items Representation.",
                    "Long-Term Effect Estimation with Surrogate Representation.",
                    "PROP: Pre-training with Representative Words Prediction for Ad-hoc Retrieval.",
                    "Bilateral Variational Autoencoder for Collaborative Filtering.",
                    "Generative Models are Unsupervised Predictors of Page Quality: A Colossal-Scale Study.",
                    "Generating Tips from Product Reviews.",
                    "Discovering Undisclosed Paid Partnership on Social Media via Aspect-Attentive Sponsored Post Learning.",
                    "Quotebank: A Corpus of Quotations from a Decade of News.",
                    "Abstractive Opinion Tagging.",
                    "Contextualizing Trending Entities in News Stories.",
                    "Question Rewriting for Conversational Question Answering.",
                    "Adapting User Preference to Online Feedback in Multi-round Conversational Recommendation.",
                    "Denoising Implicit Feedback for Recommendation.",
                    "Origin-Aware Next Destination Recommendation with Personalized Preference Attention.",
                    "Event-Driven Query Expansion.",
                    "An Efficient and Effective Framework for Session-based Social Recommendation.",
                    "Split-Treatment Analysis to Rank Heterogeneous Causal Effects for Prospective Interventions.",
                    "Explain and Predict, and then Predict Again.",
                    "Combating Selection Biases in Recommender Systems with a Few Unbiased Ratings.",
                    "Practical Compositional Fairness: Understanding Fairness in Multi-Component Recommender Systems.",
                    "Towards Long-term Fairness in Recommendation.",
                    "Online Post-Processing in Rankings for Fair Utility Maximization.",
                    "Unifying Online and Counterfactual Learning to Rank: A Novel Counterfactual Estimator that Effectively Utilizes Online Interventions.",
                    "Bias-Variance Decomposition for Ranking.",
                    "Non-Clicks Mean Irrelevant? Propensity Ratio Scoring As a Correction.",
                    "Unbiased Learning to Rank in Feeds Recommendation.",
                    "Interpretable Ranking with Generalized Additive Models.",
                    "Improving Cloud Storage Search with User Activity.",
                    "Temporal Cross-Effects in Knowledge Tracing.",
                    "FACE-KEG: Fact Checking Explained using KnowledgE Graphs.",
                    "Learning Dynamic Embeddings for Temporal Knowledge Graphs.",
                    "Personalized Food Recommendation as Constrained Question Answering over a Large-scale Food Knowledge Graph.",
                    "Improving Multi-hop Knowledge Base Question Answering by Learning Intermediate Supervision Signals.",
                    "Beyond Relevance: Trustworthy Answer Selection via Consensus Verification.",
                    "Long Horizon Forecasting with Temporal Point Processes.",
                    "Time-Series Event Prediction with Evolutionary State Graph.",
                    "F-FADE: Frequency Factorization for Anomaly Detection in Edge Streams.",
                    "Sparse-Interest Network for Sequential Recommendation.",
                    "Explainable Multivariate Time Series Classification: A Deep Neural Network Which Learns to Attend to Important Variables As Well As Time Intervals.",
                    "Modeling Inter-station Relationships with Attentive Temporal Graph Convolutional Network for Air Quality Prediction.",
                    "Bipartite Graph Embedding via Mutual Information Maximization.",
                    "Centrality with Diversity.",
                    "Filter Pruning via Probabilistic Model-based Optimization for Accelerating Deep Convolutional Neural Networks.",
                    "Federated Deep Knowledge Tracing.",
                    "Fast Disjunctive Candidate Generation Using Live Block Filtering.",
                    "Say No to the Discrimination: Learning Fair Graph Neural Networks with Limited Sensitive Attribute Information.",
                    "A Unifying Framework to Identify Dense Subgraphs on Streams: Graph Nuclei to Hypergraph Cores.",
                    "Adversarial Immunization for Certifiable Robustness on Graphs.",
                    "Triangular Bidword Generation for Sponsored Search Auction.",
                    "Learning User Representations with Hypercuboids for Recommender Systems.",
                    "Heterogeneous Hypergraph Embedding for Graph Classification.",
                    "Local Collaborative Autoencoders.",
                    "Exploring the Subgraph Density-Size Trade-off via the Lovaśz Extension.",
                    "Balance Maximization in Signed Networks via Edge Deletions.",
                    "DeepIS: Susceptibility Estimation on Social Networks.",
                    "Hierarchical Metadata-Aware Document Categorization under Weak Supervision.",
                    "Learning to Drop: Robust Graph Neural Network via Topological Denoising.",
                    "AutoCite: Multi-Modal Representation Fusion for Contextual Citation Generation.",
                    "Unsupervised Attributed Network Embedding via Cross Fusion.",
                    "Predicting Crowd Flows via Pyramid Dilated Deeper Spatial-temporal Network.",
                    "Joint Subgraph-to-Subgraph Transitions: Generalizing Triadic Closure for Powerful and Interpretable Graph Modeling.",
                    "FluxEV: A Fast and Effective Unsupervised Framework for Time-Series Anomaly Detection.",
                    "GraphSMOTE: Imbalanced Node Classification on Graphs with Graph Neural Networks.",
                    "CalibreNet: Calibration Networks for Multilingual Sequence Labeling.",
                    "Modeling Context Pair Interaction for Pairwise Tasks on Graphs.",
                    "HeteGCN: Heterogeneous Graph Convolutional Networks for Text Classification.",
                    "Towards Scalable Spectral Embedding and Data Visualization via Spectral Coarsening.",
                    "I2PS: An Online Item Intelligent Publishing System in Consumer to Consumer (C2C) Transaction Platform.",
                    "FinSense: An Assistant System for Financial Journalists and Investors.",
                    "TwiScraper: A Collaborative Project to Enhance Twitter Data Collection.",
                    "SoMin.ai: Personality-Driven Content Generation Platform.",
                    "ColorfulFeedback: Enhancing Interest Prediction Performance through Multi-dimensional Labeled Feedback from Users.",
                    "WULAI-QA: Web Understanding and Learning with AI towards Document-based Question Answering against COVID-19.",
                    "Category Recognition in E-Commerce using Sequence-to-Sequence Hierarchical Classification.",
                    "AnaSearch: Extract, Retrieve and Visualize Structured Results from Unstructured Text for Analytical Queries.",
                    "A Practical Federated Learning Framework for Small Number of Stakeholders.",
                    "GPR: Global Personalized Restaurant Recommender System Leveraging Billions of Financial Transactions.",
                    "Birdspotter: A Tool for Analyzing and Labeling Twitter Users.",
                    "DeepLight: Deep Lightweight Feature Interactions for Accelerating CTR Predictions in Ad Serving.",
                    "Alleviating Cold-Start Problems in Recommendation through Pseudo-Labelling over Knowledge Graph.",
                    "β-Cores: Robust Large-Scale Bayesian Data Summarization in the Presence of Outliers.",
                    "How to Measure Your App: A Couple of Pitfalls and Remedies in Measuring App Performance in Online Controlled Experiments.",
                    "Decomposed Collaborative Filtering: Modeling Explicit and Implicit Factors For Recommender Systems.",
                    "Explainable Recommendation with Comparative Constraints on Product Aspects.",
                    "Mining the Stars: Learning Quality Ratings with User-facing Explanations for Vacation Rentals.",
                    "Multi-Interactive Attention Network for Fine-grained Feature Learning in CTR Prediction.",
                    "Optimizing Multiple Performance Metrics with Deep GSP Auctions for E-commerce Advertising.",
                    "Enhancing Neural Recommender Models through Domain-Specific Concordance.",
                    "QueryBlazer: Efficient Query Autocompletion Framework.",
                    "Explanation as a Defense of Recommendation.",
                    "Heterogeneous Graph Augmented Multi-Scenario Sharing Recommendation with Tree-Guided Expert Networks.",
                    "Toward User Engagement Optimization in 2D Presentation.",
                    "Temporal Meta-path Guided Explainable Recommendation.",
                    "WoMG: A Library for Word-of-Mouth Cascades Generation.",
                    "All the Wiser: Fake News Intervention Using User Reading Preferences.",
                    "Community Connect: A Mock Social Media Platform to Study Online Behavior.",
                    "Exploring Personal Knowledge Extraction from Conversations with CHARM.",
                    "Real-time Streaming of Gait Assessment for Parkinson's Disease.",
                    "AttentionFlow: Visualising Influence in Networks of Time Series.",
                    "Providing Actionable Feedback in Hiring Marketplaces using Generative Adversarial Networks.",
                    "Privacy Monitoring Service for Conversations.",
                    "Evently: Modeling and Analyzing Reshare Cascades with Hawkes Processes.",
                    "A Semantic Layer Querying Tool.",
                    "Data-Sharing Economy: Value-Addition from Data meets Privacy.",
                    "Multilingual and Multimodal Hate Speech Analysis in Twitter.",
                    "Deep Recommender Systems Utilizing Side Information.",
                    "Interpretability and Effectiveness of Machine Learning Methods for Sequence Mining in Various Domains.",
                    "Multimodal Machine Learning for Drug Knowledge Discovery.",
                    "Fairness-Aware Recommendation in Multi-Sided Platforms.",
                    "Graph Mining with Graph Neural Networks.",
                    "Towards Dynamic User Intention in Sequential Recommendation.",
                    "Personalization in Practice: Methods and Applications.",
                    "Deep Learning for Anomaly Detection: Challenges, Methods, and Opportunities.",
                    "WSDM 2021 Tutorial on Systematic Challenges and Computational Solutions on Bias and Unfairness in Peer Review.",
                    "WSDM 2021 Tutorial on Conversational Recommendation Systems.",
                    "Beyond Probability Ranking Principle: Modeling the Dependencies among Documents.",
                    "Scalable Graph Neural Networks with Deep Graph Library.",
                    "Information to Wisdom: Commonsense Knowledge Extraction and Compilation.",
                    "Advances in Bias-aware Recommendation on the Web.",
                    "Neural Structured Learning: Training Neural Networks with Structured Signals.",
                    "Pretrained Transformers for Text Ranking: BERT and Beyond.",
                    "WebTour 2021 Workshop on Web Tourism.",
                    "Integrity 2021: Integrity in Social Networks and Media.",
                    "The 1st International Workshop on Machine Reasoning: International Machine Reasoning Conference (MRC 2021).",
                    "Overview of the Supporting and Understanding of Conversational Dialogues (SUD) Workshop.",
                    "L2D 2021: First International Workshop on Enabling Data-Driven Decisions from Learning on the Web."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2021webtour",
                "sub_name": "Proceedings of the Workshop on Web Tourism co-located with the 14th ACM International WSDM Conference (WSDM 2021), Jerusalem, Israel, March 12, 2021.",
                "count": 14,
                "papers": [
                    "Generating Multi-Day Round Trip Itineraries for Tourists.",
                    "TripRec - A Recommender System for Planning Composite City Trips Based on Travel Mobility Analysis.",
                    "An Interactive Dashboard for Traveler Mobility Analysis.",
                    "Evaluation Framework for Improving 360 Virtual Tours User Experience.",
                    "Tourist recommendations with a touch of SPICE: A TRS with Deep Cultural Understanding.",
                    "Booking.com WSDM WebTour 2021 Challenge.",
                    "Using Deep Learning to Win the Booking.com WSDM WebTour21 Challenge on Sequential Recommendations.",
                    "Modeling Multi-Destination Trips with Sketch-Based Model.",
                    "Explore next destination prediction.",
                    "Data Augmentation Using Many-To-Many RNNs for Session-Aware Recommender Systems.",
                    "Attention-based neural re-ranking approach for next city in trip recommendations.",
                    "Weighted Averaging of Various LSTM Models for Next Destination Recommendation.",
                    "Combining RNN with Transformer for Modeling Multi-Leg Trips.",
                    "Hybrid Model with Time Modeling for Sequential Recommender Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2021l2d",
                "sub_name": "Proceedings of the First International Workshop on Enabling Data-Driven Decisions from Learning on the Web co-located with the 14th ACM International Conference on Web Search and Data Mining (WSDM 2021), Jerusalem, Israel, March 12, 2021 - moved online.",
                "count": 6,
                "papers": [
                    "Incorporating Wide Context Information for Deep Knowledge Tracing using Attentional Bi-interaction.",
                    "Collaboration Patterns in Students' Teams Working on Business Cases.",
                    "Modelling Student Behavior in Synchronous Online Learning during the COVID-19 Pandemic.",
                    "Learning Testing Model using Test Generators and Mobile Applications.",
                    "Test Students' Attention in Class using a Mobile Application.",
                    "Designing Intelligent Systems for Online Education: Open Challenges and Future Directions."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "13th WSDM 2020",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2020",
                "sub_name": "WSDM '20: The Thirteenth ACM International Conference on Web Search and Data Mining, Houston, TX, USA, February 3-7, 2020.",
                "count": 130,
                "papers": [
                    "From Missing Data to Boltzmann Distributions and Time Dynamics: The Statistical Physics of Recommendation.",
                    "Computer Vision for Fashion: From Individual Recommendations to World-wide Trends.",
                    "Veridical Data Science.",
                    "Can Deep Learning Only Be Neural Networks?",
                    "Language-Agnostic Representation Learning for Product Search on E-Commerce Platforms.",
                    "Recurrent Attention Walk for Semi-supervised Classification.",
                    "Outlier Resistant Unsupervised Deep Architectures for Attributed Network Embedding.",
                    "Privacy-Aware Recommendation with Private-Attribute Protection using Adversarial Learning.",
                    "LouvainNE: Hierarchical Louvain Method for High Quality and Scalable Network Embedding.",
                    "Comparative Web Search Questions.",
                    "A Stochastic Treatment of Learning to Rank Scoring Functions.",
                    "Popularity Prediction on Social Platforms with Coupled Graph Neural Networks.",
                    "Why Do People Buy Seemingly Irrelevant Items in Voice Product Search?: On the Relation between Product Relevance and Customer Satisfaction in eCommerce.",
                    "A Context-Aware Click Model for Web Search.",
                    "Parameter Tuning in Personal Search Systems.",
                    "Context-aware Deep Model for Joint Mobility and Time Prediction.",
                    "Analyzing the Impact of Filter Bubbles on Social Network Polarization.",
                    "ENTYFI: Entity Typing in Fictional Texts.",
                    "Joint Recognition of Names and Publications in Academic Homepages.",
                    "Can A User Guess What Her Followers Want?",
                    "Meta-Learning with Dynamic-Memory-Based Prototypical Network for Few-Shot Event Detection.",
                    "Epidemic Graph Convolutional Network.",
                    "All You Need Is Low (Rank): Defending Against Adversarial Attacks on Graphs.",
                    "Privacy- and Utility-Preserving Textual Analysis via Calibrated Multivariate Perturbations.",
                    "Recurrent Memory Reasoning Network for Expert Finding in Community Question Answering.",
                    "PRINCE: Provider-side Interpretability with Counterfactual Explanations in Recommender Systems.",
                    "JNET: Learning User Representations via Joint Network Embedding and Topic Embedding.",
                    "TSA: A Truthful Mechanism for Social Advertising.",
                    "Hierarchical User Profiling for E-commerce Recommender Systems.",
                    "Learning Individual Causal Effects from Networked Observational Data.",
                    "Crowd Worker Strategies in Relevance Judgment Tasks.",
                    "Consistency-Aware Recommendation for User-Generated Item List Continuation.",
                    "Debiasing Word Embeddings from Sentiment Associations in Names.",
                    "The Power of Pivoting for Exact Clique Counting.",
                    "Ultra Fine-Grained Image Semantic Embedding.",
                    "Modeling Information Cascades with Self-exciting Processes via Generalized Epidemic Models.",
                    "Retrieving Top Weighted Triangles in Graphs.",
                    "Estimation-Action-Reflection: Towards Deep Interaction Between Conversational and Recommender Systems.",
                    "Interpretable Click-Through Rate Prediction through Hierarchical Attention.",
                    "Time Interval Aware Self-Attention for Sequential Recommendation.",
                    "DDTCDR: Deep Dual Transfer Cross Domain Recommendation.",
                    "Automatic Speaker Recognition with Limited Data.",
                    "Adversarial Learning to Compare: Self-Attentive Prospective Customer Recommendation in Location based Social Networks.",
                    "Incremental Filter Pruning via Random Walk for Accelerating Deep Convolutional Neural Networks.",
                    "Initialization for Network Embedding: A Graph Partition Approach.",
                    "Balanced Influence Maximization in Attributed Social Network Based on Sampling.",
                    "End-to-End Deep Reinforcement Learning based Recommendation with Supervised Embedding.",
                    "Deep Multi-Graph Clustering via Attentive Cross-Graph Association.",
                    "Jointly Optimized Neural Coreference Resolution with Mutual Attention.",
                    "Beyond Statistical Relations: Integrating Knowledge Relations into Style Correlations for Multi-Label Music Style Classification.",
                    "MRAEA: An Efficient and Robust Entity Alignment Approach for Cross-lingual Knowledge Graph.",
                    "Separate and Attend in Personal Email Search.",
                    "Predicting Human Mobility via Attentive Convolutional Network.",
                    "Efficiently Counting Vertex Orbits of All 5-vertex Subgraphs, by EVOKE.",
                    "Extreme Regression for Dynamic Search Advertising.",
                    "Sequential Recommendation with Dual Side Neighbor-based Collaborative Relation Modeling.",
                    "Stepwise Reasoning for Multi-Relation Question Answering over Knowledge Graph with Weak Supervision.",
                    "A Structural Graph Representation Learning Framework.",
                    "Toward Activity Discovery in the Personal Web.",
                    "Unbiased Recommender Learning from Missing-Not-At-Random Implicit Feedback.",
                    "Inf-VAE: A Variational Autoencoder Framework to Integrate Homophily and Influence in Diffusion Prediction.",
                    "DySAT: Deep Neural Representation Learning on Dynamic Graphs via Self-Attention Networks.",
                    "RecVAE: A New Variational Autoencoder for Top-N Recommendations with Implicit Feedback.",
                    "Text Recognition Using Anonymous CAPTCHA Answers.",
                    "Ad Close Mitigation for Improved User Experience in Native Advertisements.",
                    "ADMM SLIM: Sparse Recommendations for Many Users.",
                    "Label Distribution Augmented Maximum Likelihood Estimation for Reading Comprehension.",
                    "Influence Maximization with Spontaneous User Adoption.",
                    "LARA: Attribute-to-feature Adversarial Learning for New-item Recommendation.",
                    "Fast Item Ranking under Neural Network based Measures.",
                    "Transferring Robustness for Graph Neural Network Against Poisoning Attacks.",
                    "HyperML: A Boosting Metric Learning Approach in Hyperbolic Space for Recommender Systems.",
                    "Addressing Marketing Bias in Product Recommendations.",
                    "User Recommendation in Content Curation Platforms.",
                    "Key Opinion Leaders in Recommendation Systems: Opinion Elicitation and Diffusion.",
                    "Time to Shop for Valentine's Day: Shopping Occasions and Sequential Recommendation in E-commerce.",
                    "Metrics, User Models, and Satisfaction.",
                    "PERQ: Predicting, Explaining, and Rectifying Failed Questions in KB-QA Systems.",
                    "Product Knowledge Graph Embedding for E-commerce.",
                    "Knowledge-aware Complementary Product Representation Learning.",
                    "Model Compression with Two-stage Multi-teacher Knowledge Distillation for Web Question Answering System.",
                    "Relation Learning on Social Networks with Multi-Modal Graph Edge Variational Autoencoders.",
                    "Sampling Subgraphs with Guaranteed Treewidth for Accurate and Efficient Graphical Inference.",
                    "Learning a Joint Search and Recommendation Model from User-Item Interactions.",
                    "Nearly Linear Time Algorithm for Mean Hitting Times of Random Walks on a Graph.",
                    "Distilling Structured Knowledge into Embeddings for Explainable and Accurate Recommendation.",
                    "AutoBlock: A Hands-off Blocking Framework for Entity Matching.",
                    "Temporal Context-Aware Representation Learning for Question Routing.",
                    "Improving the Estimation of Tail Ratings in Recommender System with Multi-Latent Representations.",
                    "Investigating Examination Behavior in Mobile Search.",
                    "GREASE: A Generative Model for Relevance Search over Knowledge Graphs.",
                    "Enhancing Re-finding Behavior with External Memories for Personalized Search.",
                    "Listwise Learning to Rank by Exploring Unique Ratings.",
                    "Sequential Modeling of Hierarchical User Intention and Preference for Next-item Recommendation.",
                    "Pseudo Dyna-Q: A Reinforcement Learning Framework for Interactive Recommendation.",
                    "personality2vec: Enabling the Analysis of Behavioral Disorders in Social Networks.",
                    "FAQAugmenter: Suggesting Questions for Enterprise FAQ Pages.",
                    "Entities with Quantities: Extraction, Search, and Ranking.",
                    "WebShapes: Network Visualization with 3D Shapes.",
                    "Athena: A Ranking Enabled Scholarly Search System.",
                    "OpenNIR: A Complete Neural Ad-Hoc Ranking Pipeline.",
                    "Illustrate Your Story: Enriching Text with Images.",
                    "SPread: Automated Financial Metric Extraction and Spreading Tool from Earnings Reports.",
                    "VISION-KG: Topic-centric Visualization System for Summarizing Knowledge Graph.",
                    "Capreolus: A Toolkit for End-to-End Neural Ad Hoc Retrieval.",
                    "Deep Bayesian Data Mining.",
                    "Adversarial Machine Learning in Recommender Systems (AML-RecSys).",
                    "Practice of Efficient Data Collection via Crowdsourcing: Aggregation, Incremental Relabelling, and Pricing.",
                    "Challenges, Best Practices and Pitfalls in Evaluating Results of Online Controlled Experiments.",
                    "Intelligible Machine Learning and Knowledge Discovery Boosted by Visual Means.",
                    "Learning with Small Data.",
                    "Web-scale Knowledge Collection.",
                    "Learning and Reasoning on Graph for Recommendation.",
                    "Deep Learning for Anomaly Detection.",
                    "ConvERSe'20: The WSDM 2020 Workshop on Conversational Systems for E-Commerce Recommendations and Search.",
                    "SUM'20: State-based User Modelling.",
                    "Overview of the Health Search and Data Mining (HSDM 2020) Workshop.",
                    "Workshop on Privacy in NLP (PrivateNLP 2020).",
                    "Integrity 2020: Integrity in Social Networks and Media.",
                    "NLP4REC: The WSDM 2020 Workshop on Natural Language Processing for Recommendations.",
                    "Impact of Online Job Search and Job Reviews on Job Decision.",
                    "User Intent Inference for Web Search and Conversational Agents.",
                    "Temporal Pattern of Retweet(s) Help to Maximize Information Diffusion in Twitter.",
                    "Beyond Sessions: Exploiting Hybrid Contextual Information for Web Search.",
                    "Network Analysis with Negative Links.",
                    "Decision Boundary of Deep Neural Networks: Challenges and Opportunities.",
                    "Think like a Human: Constructing Cognitive-oriented Retrieval Model for Web Search.",
                    "Hybrid Utility Function for Unexpected Recommendations.",
                    "Overlapping Community Detection in Static and Dynamic Networks.",
                    "Learning from Heterogeneous Networks: Methods and Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2020hsdm",
                "sub_name": "Proceedings of the ACM WSDM 2020 Health Search and Data Mining Workshop, co-located with the 13th ACM International WSDM Conference, HSDM@WSDM 2020, Houston, TX, USA, February 3, 2020.",
                "count": 8,
                "papers": [
                    "Machine Learning for Healthcare: Beyond i.i.d. Prediction.",
                    "Applying Information Retrieval to the Electronic Health Record for Cohort Discovery and Rare Disease Detection.",
                    "Comparing Rule-based, Feature-based and Deep Neural Methods for De-identification of Dutch Medical Records.",
                    "Healthcare NER Models Using Language Model Pretraining.",
                    "Lung Nodule Classification Using Convolutional Autoencoder and Clustering Augmented Learning Method(CALM).",
                    "A Query Taxonomy Describes Performance of Patient-Level Retrieval from Electronic Health Record Data.",
                    "Streaming Gait Assessment for Parkinson's Disease.",
                    "Clustering Large-scale Diverse Electronic Medical Records to Aid Annotation for Generic Named Entity Recognition."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2020privatenlp",
                "sub_name": "Proceedings of the PrivateNLP 2020: Workshop on Privacy in Natural Language Processing - Colocated with WSDM 2020, Houston, USA, Feb 7, 2020.",
                "count": 10,
                "papers": [
                    "Preserving Privacy in Analyses of Textual Data.",
                    "Perfectly Privacy-Preserving AI What Is It and How Do We Achieve It?",
                    "Calibrating Mechanisms for Privacy Preserving Text Analysis.",
                    "Privacy-Aware Personalized Entity Representations for Improved User Understanding.",
                    "A User-Centric and Sentiment Aware Privacy-Disclosure Detection Framework based on Multi-input Neural Network.",
                    "Classification of Encrypted Word Embeddings using Recurrent Neural Networks.",
                    "Is It Possible to Preserve Privacy in the Age of AI?",
                    "Perfectly Privacy-Preserving AI What Is It and How Do We Achieve It?",
                    "Hyperbolic Embeddings for Preserving Privacy and Utility in Text.",
                    "Privacy-Preserving Textual Analysis via Calibrated Perturbations."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "12th WSDM 2019",
        "info": "Melbourne, VIC, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2019",
                "sub_name": "Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining, WSDM 2019, Melbourne, VIC, Australia, February 11-15, 2019.",
                "count": 121,
                "papers": [
                    "Attending to What Matters.",
                    "Responsible Data Science.",
                    "Alexa Everywhere: AI for Daily Convenience.",
                    "Privacy-Preserving WSDM.",
                    "Reinforcement Learning to Rank.",
                    "Fast Dictionary-Based Compression for Inverted Indexes.",
                    "Joint Optimization of Cascade Ranking Models.",
                    "WassRank: Listwise Document Ranking Using Optimal Transport Theory.",
                    "MSA: Jointly Detecting Drug Name and Adverse Drug Reaction Mentioning Tweets with Multi-Head Self-Attention.",
                    "Integrating Local Context and Global Cohesiveness for Open Information Extraction.",
                    "Knowledge Graph Enhanced Community Detection and Characterization.",
                    "Representation Interpretation with Spatial Encoding and Multimodal Analytics.",
                    "CORALS: Who Are My Potential New Customers? Tapping into the Wisdom of Customers' Decisions.",
                    "Lightweight Lexical and Semantic Evidence for Detecting Classes Among Wikipedia Articles.",
                    "ExFaKT: A Framework for Explaining Facts over Knowledge Graphs and Text.",
                    "Interaction Embeddings for Prediction and Explanation in Knowledge Graphs.",
                    "Knowledge Graph Embedding Based Question Answering.",
                    "Relevance Search over Schema-Rich Knowledge Graphs.",
                    "A State Transition Model for Mobile Notifications via Survival Analysis.",
                    "Clustered Monotone Transforms for Rating Factorization.",
                    "Sparsemax and Relaxed Wasserstein for Topic Sparsity.",
                    "RecWalk: Nearly Uncoupled Random Walks for Top-N Recommendation.",
                    "Modeling Temporal Evidence from External Collections.",
                    "Asynchronous Training of Word Embeddings for Large Text Corpora.",
                    "Social Attentional Memory Network: Modeling Aspect- and Friend-Level Differences in Recommendation.",
                    "Uncovering Hidden Structure in Sequence Data via Threading Recurrent Models.",
                    "Neural Based Statement Classification for Biased Language.",
                    "Enabling Privacy-Preserving Sharing of Genomic Data for GWASs in Decentralized Networks.",
                    "Protecting User Privacy: An Approach for Untraceable Web Browsing History and Unambiguous User Profiles.",
                    "Spiral of Silence in Recommender Systems.",
                    "Fighting Fire with Fire: Using Antidote Data to Improve Polarization and Fairness of Recommender Systems.",
                    "FAIRY: A Framework for Understanding Relationships Between Users' Actions and their Social Feeds.",
                    "Federated Online Learning to Rank with Evolution Strategies.",
                    "On the Complexity of Opinions and Online Discussions.",
                    "Multi-Representation Fusion Network for Multi-Turn Response Selection in Retrieval-Based Chatbots.",
                    "More Than Just Words: Modeling Non-Textual Characteristics of Podcasts.",
                    "Attitude Detection for One-Round Conversation: Jointly Extracting Target-Polarity Pairs.",
                    "Sampling Methods for Counting Temporal Motifs.",
                    "The Local Closure Coefficient: A New Perspective On Network Clustering.",
                    "Beyond News Contents: The Role of Social Context for Fake News Detection.",
                    "All Those Wasted Hours: On Task Abandonment in Crowdsourcing.",
                    "CoReRank: Ranking to Detect Users Involved in Blackmarket-Based Collusive Retweeting Activities.",
                    "XBully: Cyberbullying Detection within a Multi-Modal Context.",
                    "Homogeneity-Based Transmissive Process to Model True and False News in Social Networks.",
                    "Interactive Anomaly Detection on Attributed Networks.",
                    "Random Spatial Network Models for Core-Periphery Structure.",
                    "A General View for Network Embedding as Matrix Factorization.",
                    "SimGNN: A Neural Network Approach to Fast Graph Similarity Computation.",
                    "Co-Embedding Attributed Networks.",
                    "Weakly Supervised Co-Training of Query Rewriting andSemantic Matching for e-Commerce.",
                    "Review-Driven Answer Generation for Product-Related Questions in E-Commerce.",
                    "Offline Evaluation to Make Decisions About PlaylistRecommendation Algorithms.",
                    "Product-Aware Answer Generation in E-Commerce Question-Answering.",
                    "Linked Variational AutoEncoders for Inferring Substitutable and Supplementary Items.",
                    "When People Change their Mind: Off-Policy Evaluation in Non-stationary Recommendation Environments.",
                    "Top-K Off-Policy Correction for a REINFORCE Recommender System.",
                    "Genie: An Open Box Counterfactual Policy Estimator for Optimizing Sponsored Search Marketplace.",
                    "Estimating Position Bias without Intrusive Interventions.",
                    "Off-Policy Evaluation of Probabilistic Identity Data in Lookalike Modeling.",
                    "A Sequential Test for Selecting the Better Variant: Online A/B testing, Adaptive Allocation, and Continuous Monitoring.",
                    "How A/B Tests Could Go Wrong: Automatic Diagnosis of Invalid Online Experiments.",
                    "Investment Recommendation System for Low-Liquidity Online Peer to Peer Lending (P2PL) Marketplaces.",
                    "Gated Attentive-Autoencoder for Content-Aware Recommendation.",
                    "Slice: Scalable Linear Extreme Classifiers Trained on 100 Million Labels for Related Searches.",
                    "Neural Tensor Factorization for Temporal Interaction Learning.",
                    "Shaping Feedback Data in Recommender Systems with Interventions Based on Information Foraging Theory.",
                    "Session-Based Social Recommendation via Dynamic Graph Attention Networks.",
                    "Recurrent Recommendation with Local Coherence.",
                    "Taxonomy-Aware Multi-Hop Reasoning Networks for Sequential Recommendation.",
                    "A Simple Convolutional Generative Network for Next Item Recommendation.",
                    "Time is of the Essence: A Joint Hierarchical RNN and Point Process Model for Time and Item Predictions.",
                    "Sequential Variational Autoencoders for Collaborative Filtering.",
                    "Learning Personalized Topical Compositions with Item Response Theory.",
                    "Why the World Reads Wikipedia: Beyond English Speakers.",
                    "Characterizing and Predicting Email Deferral Behavior.",
                    "Task Duration Estimation.",
                    "The Influence of Image Search Intents on User Behavior and Satisfaction.",
                    "Neural Demographic Prediction using Search Query.",
                    "Domain Switch-Aware Holistic Recurrent Neural Network for Modeling Multi-Domain User Behavior.",
                    "Domain Adaptation for Commitment Detection in Email.",
                    "Learning to Transform, Combine, and Reason in Open-Domain Question Answering.",
                    "SHNE: Representation Learning for Semantic-Associated Heterogeneous Networks.",
                    "Learning to Selectively Transfer: Reinforced Transfer Learning for Deep Text Matching.",
                    "Spring-Electrical Models For Link Prediction.",
                    "Solving the Sparsity Problem in Recommendations via Cross-Domain Item Embedding Based on Co-Clustering.",
                    "Discovering Correlations between Sparse Features in Distant Supervision for Relation Extraction.",
                    "Across-Time Comparative Summarization of News Articles.",
                    "Crosslingual Document Embedding as Reduced-Rank Ridge Regression.",
                    "CluWords: Exploiting Semantic Word Clustering Representation for Enhanced Topic Modeling.",
                    "ATAR: Aspect-Based Temporal Analog Retrieval System for Document Archives.",
                    "clstk: The Cross-Lingual Summarization Tool-Kit.",
                    "EXS: Explainable Search Using Local Model Agnostic Interpretability.",
                    "FaceOff: Assisting the Manifestation Design of Web Graphical User Interface.",
                    "Intelligent Traffic Analytics: From Monitoring to Controlling.",
                    "Interactive Visualization of Urban Areas of Interest: A Parameter-Free and Efficient Footprint Method.",
                    "Pleasant Route Suggestion based on Color and Object Rates.",
                    "NAIRS: A Neural Attentive Interpretable Recommendation System.",
                    "Structured Search in Annotated Document Collections.",
                    "TopExNet: Entity-Centric Network Topic Exploration in News Streams.",
                    "VisCrime: A Crime Visualisation System for Crime Trajectory from Multi-Dimensional Sources.",
                    "Visualizing Graph Differences from Social Media Streams.",
                    "Bridging Models for Popularity Prediction on Social Media.",
                    "Comparative Summarisation of Rich Media Collections.",
                    "Designing the Cogno-Web Observatory: To Characterize the Dynamics of Online Social Cognition.",
                    "How is Attention Allocated?: Data-Driven Studies of Popularity and Engagement in Online Videos.",
                    "Linking Epidemic Models and Hawkes Point Processes for Modeling Information Diffusion.",
                    "Listwise vs Pagewise: Towards Better Ranking Strategies for Heterogeneous Search Results.",
                    "Overlapping Community Detection in Static and Dynamic Social Networks.",
                    "Preference Elicitation Strategy for Conversational Recommender System.",
                    "User Behavior Modeling for Web Image Search.",
                    "Causal Inference and Counterfactual Reasoning (3hr Tutorial).",
                    "Conducting Laboratory Experiments Properly with Statistical Tools: An Easy Hands-On Tutorial.",
                    "Deep Learning for Matching in Search and Recommendation.",
                    "Fairness-Aware Machine Learning: Practical Challenges and Lessons Learned.",
                    "Fake News: Fundamental Theories, Detection Strategies and Challenges.",
                    "WSDM 2019 Tutorial on Health Search (HS2019): A Full-Day from Consumers to Clinicians.",
                    "Privacy-preserving Data Mining in Industry.",
                    "The 1st International Workshop on Context-Aware Recommendation Systems with Big Data Analytics (CARS-BDA).",
                    "DAPA: The WSDM 2019 Workshop on Deep Matching in Practical Applications.",
                    "IDM-WSDM 2019: Workshop on Interactive Data Mining.",
                    "Task Intelligence Workshop @ WSDM 2019."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2019idm",
                "sub_name": "Proceedings of the Workshop on Interactive Data Mining, IDM@WSDM 2019, Melbourne, VIC, Australia, February 15, 2019.",
                "count": 5,
                "papers": [
                    "Smart Farm: A System for Proactive Management of Raw Milk Quality.",
                    "Interactive Clustering for Exploring Multiple Data Streams at Different Time Scales and Granularity.",
                    "Incremental Causal Discovery and Visualization.",
                    "Interactive feature extraction for diagnostic trouble codes in predictive maintenance: A case study from automotive domain.",
                    "Interactive-COSMO: Consensus Self-Organized Models for Fault Detection with Expert Feedback."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "11th WSDM 2018",
        "info": "Marina Del Rey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2018",
                "sub_name": "Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining, WSDM 2018, Marina Del Rey, CA, USA, February 5-9, 2018.",
                "count": 115,
                "papers": [
                    "A Call to Arms: Embrace Assistive AI Systems!",
                    "On the Power of Massive Text Data.",
                    "Theoretical Impediments to Machine Learning With Seven Sparks from the Causal Revolution.",
                    "Conversations, Machine Learning and Privacy: LinkedIn's Path Towards Transforming Interaction with Its Members.",
                    "From Search to Research: Direct Answers, Perspectives and Dialog.",
                    "Scalable Algorithms in the Age of Big Data and Network Sciences: Characterization, Primitives, and Techniques.",
                    "WSDM Cup 2018: Music Recommendation and Churn Prediction.",
                    "Performance Analysis of a Privacy Constrained kNN Recommendation Using Data Sketches.",
                    "Can you Trust the Trend?: Discovering Simpson's Paradoxes in Social Data.",
                    "Deep Neural Architecture for Multi-Modal Retrieval based on Joint Embedding Space for Text and Images.",
                    "A Discrete Choice Model for Subset Selection.",
                    "Latent Cross: Making Use of Context in Recurrent Recommender Systems.",
                    "Consistent Transformation of Ratio Metrics for Efficient Online Controlled Experiments.",
                    "Neural Graph Learning: Training Neural Networks Using Graphs.",
                    "Sketch 'Em All: Fast Approximate Similarity Search for Dynamic Data Streams.",
                    "Fast Coreset-based Diversity Maximization under Matroid Constraints.",
                    "Putting Data in the Driver's Seat: Optimizing Earnings for On-Demand Ride-Hailing.",
                    "Improving Negative Sampling for Word Representation using Self-embedded Features.",
                    "Sequential Recommendation with User Memory Networks.",
                    "VISIR: Visual and Semantic Image Label Refinement.",
                    "Convolutional Neural Networks for Soft-Matching N-Grams in Ad-hoc Search.",
                    "Demographics and Dynamics of Mechanical Turk Workers.",
                    "Joint Generative-Discriminative Aggregation Model for Multi-Option Crowd Labels.",
                    "Predicting Audio Advertisement Quality.",
                    "Cognitive Biases in Crowdsourcing.",
                    "User Profiling through Deep Multimodal Fusion.",
                    "Orienteering Algorithms for Generating Travel Itineraries.",
                    "Unsubscription: A Simple Way to Ease Overload in Email.",
                    "Offline A/B Testing for Recommender Systems.",
                    "Care to Share?: Learning to Rank Personal Photos for Public Sharing.",
                    "Identifying Informational vs. Conversational Questions on Community Question Answering Archives.",
                    "Robust Transfer Learning for Cross-domain Collaborative Filtering Using Multiple Rating Patterns Approximation.",
                    "Ballpark Crowdsourcing: The Wisdom of Rough Group Comparisons.",
                    "Collaborative Filtering via Additive Ordinal Regression.",
                    "Who Will Share My Image?: Predicting the Content Diffusion Path in Online Social Networks.",
                    "Listening to Chaotic Whispers: A Deep Learning Framework for News-oriented Stock Trend Prediction.",
                    "Exploring Expert Cognition for Attributed Network Embedding.",
                    "Co-PACRR: A Context-Aware Neural IR Model for Ad-hoc Retrieval.",
                    "Recommendation in Heterogeneous Information Networks Based on Generalized Random Walk Model and Bayesian Personalized Ranking.",
                    "Fast and Scalable Distributed Loopy Belief Propagation on Real-World Graphs.",
                    "Combating Crowdsourced Review Manipulators: A Neighborhood-Based Approach.",
                    "Topic Chronicle Forest for Topic Discovery and Tracking.",
                    "Leveraging the Crowd to Detect and Reduce the Spread of Fake News and Misinformation.",
                    "REV2: Fraudulent User Prediction in Rating Platforms.",
                    "Web Search of Fashion Items with Multimodal Querying.",
                    "Joint Non-negative Matrix Factorization for Learning Ideological Leaning on Twitter.",
                    "Bayesian Optimization for Optimizing Retrieval Systems.",
                    "Streaming Link Prediction on Dynamic Attributed Networks.",
                    "Inferring Dockless Shared Bike Distribution in New Cities.",
                    "Multi-Dimensional Network Embedding with Hierarchical Structure.",
                    "Query Driven Algorithm Selection in Early Stage Retrieval.",
                    "Index Compression Using Byte-Aligned ANS Coding and Two-Dimensional Contexts.",
                    "Fusing Diversity in Recommendations in Heterogeneous Information Networks.",
                    "Neural Personalized Ranking for Image Recommendation.",
                    "Learning to Discover Domain-Specific Web Content.",
                    "Extreme Multi-label Learning with Label Features for Warm-start Tagging, Ranking & Recommendation.",
                    "DSANLS: Accelerating Distributed Nonnegative Matrix Factorization via Sketching.",
                    "Network Embedding as Matrix Factorization: Unifying DeepWalk, LINE, PTE, and node2vec.",
                    "Curriculum Learning for Heterogeneous Star Network Embedding via Deep Reinforcement Learning.",
                    "Leveraging Implicit Contribution Amounts to Facilitate Microfinancing Requests.",
                    "FACH: Fast Algorithm for Detecting Cohesive Hierarchies of Communities in Large Networks.",
                    "Measuring the Latency of Depression Detection in Social Media.",
                    "Peeling Bipartite Networks for Dense Subgraph Discovery.",
                    "Short-Term Satisfaction and Long-Term Coverage: Understanding How Users Tolerate Algorithmic Exploration.",
                    "CrossFire: Cross Media Joint Friend and Item Recommendations.",
                    "Modeling Time to Open of Emails with a Latent State for User Engagement Level.",
                    "Shortcutting Label Propagation for Distributed Connected Components.",
                    "User Intent, Behaviour, and Perceived Satisfaction in Product Search.",
                    "Logician: A Unified End-to-End Neural Approach for Open-Domain Information Extraction.",
                    "Personalized Top-N Sequential Recommendation via Convolutional Sequence Embedding.",
                    "sSketch: A Scalable Sketching Technique for PCA in the Cloud.",
                    "Hyperbolic Representation Learning for Fast and Efficient Neural Question Answering.",
                    "SHINE: Signed Heterogeneous Information Network Embedding for Sentiment Link Prediction.",
                    "A Unified Processing Paradigm for Interactive Location-based Web Search.",
                    "Position Bias Estimation for Unbiased Learning to Rank in Personal Search.",
                    "A Path-constrained Framework for Discriminating Substitutable and Complementary Products in E-commerce.",
                    "Customer Purchase Behavior Prediction from Payment Datasets.",
                    "Tracing Fake-News Footprints: Characterizing Social Media Messages by How They Propagate.",
                    "Indirect Supervision for Relation Extraction using Question-Answer Pairs.",
                    "Why People Search for Images using Web Search Engines.",
                    "OpenRec: A Modular Framework for Extensible and Adaptable Recommendation Algorithms.",
                    "Dynamic Word Embeddings for Evolving Semantic Discovery.",
                    "Modelling Domain Relationships for Transfer Learning on Retrieval-based Question Answering Systems in E-commerce.",
                    "Review-Aware Answer Prediction for Product-Related Questions Incorporating Aspects.",
                    "Neural Ranking Models with Multiple Document Fields.",
                    "Discrete Deep Learning for Fast Content-Aware Recommendation.",
                    "Micro Behaviors: A New Perspective in E-commerce Recommender Systems.",
                    "Predicting Multi-step Citywide Passenger Demands Using Attention-based Neural Networks.",
                    "Event Mining over Distributed Text Streams.",
                    "Connectivity in Complex Networks: Measures, Inference and Optimization.",
                    "Automatic Ranking of Information Retrieval Systems.",
                    "Mining Twitter for Fine-Grained Political Opinion Polarity Classification, Ideology Detection and Sarcasm Detection.",
                    "Beyond Who and What: Data Driven Approaches for User Characterization.",
                    "Engagement and Incentives in Online Community: Observational Data, Prediction Models, and Field Experiments.",
                    "Exploiting Human Mobility Patterns for Point-of-Interest Recommendation.",
                    "Percolator: Scalable Pattern Discovery in Dynamic Graphs.",
                    "Conversational Semantic Search: Looking Beyond Web Search, Q&A and Dialog Systems.",
                    "Supporting Large-scale Geographical Visualization in a Multi-granularity Way.",
                    "Collabot: Personalized Group Chat Summarization.",
                    "Influence Maximization in Online Social Networks.",
                    "Differential Privacy for Information Retrieval.",
                    "Neural Networks for Information Retrieval.",
                    "Tutorial on Metrics of User Engagement: Applications to News, Search and E-Commerce.",
                    "Network Science of Teams: Characterization, Prediction, and Optimization.",
                    "A Critical Review of Online Social Data: Biases, Methodological Pitfalls, and Ethical Boundaries.",
                    "Athlytics: Winning in Sports with Data.",
                    "Mining Knowledge Graphs From Text.",
                    "The 5th International Workshop on Social Web for Disaster Management(SWDM'18): Collective Sensing, Trust, and Resilience in Global Crises.",
                    "First Workshop on Knowledge Base Construction, Mining and Reasoning.",
                    "HeteroNAM: International Workshop on Heterogeneous Networks Analysis and Mining.",
                    "LearnIR: WSDM 2018 Workshop on Learning from User Interactions.",
                    "MIS2: Misinformation and Misbehavior Mining on the Web.",
                    "Workshop on Two-sided Marketplace Optimization: Search, Pricing, Matching & Growth.",
                    "GTA3 2018: Workshop on Graph Techniques for Adversarial Activity Analytics.",
                    "IFUP: Workshop on Multi-dimensional Information Fusion for User Modeling and Personalization."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "10th WSDM 2017",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2017",
                "sub_name": "Proceedings of the Tenth ACM International Conference on Web Search and Data Mining, WSDM 2017, Cambridge, United Kingdom, February 6-10, 2017.",
                "count": 104,
                "papers": [
                    "Ten Years of Wisdom.",
                    "Enterprise Employee Training via Project Team Formation.",
                    "iPhone's Digital Marketplace: Characterizing the Big Spenders.",
                    "Raising Graphs From Randomness to Reveal Information Networks.",
                    "How Smart Does Your Profile Image Look?: Estimating Intelligence from Social Network Profile Images.",
                    "Anticipating Information Needs Based on Check-in Activity.",
                    "RedQueen: An Online Algorithm for Smart Broadcasting in Social Networks.",
                    "Uncovering the Dynamics of Crowdlearning and the Value of Knowledge.",
                    "Leveraging Behavioral Factorization and Prior Knowledge for Community Discovery and Profiling.",
                    "Reducing Controversy by Connecting Opposing Views.",
                    "Detecting and Characterizing Eating-Disorder Communities on Social Media.",
                    "The Influence of Early Respondents: Information Cascade Effects in Online Event Scheduling.",
                    "Evolution of Ego-networks in Social Media with Link Recommendations.",
                    "Link Prediction with Cardinality Constraint.",
                    "Learning Parametric Models for Context-Aware Query Auto-Completion via Hawkes Processes.",
                    "Does Document Relevance Affect the Searcher's Perception of Time?",
                    "Generating Illustrative Snippets for Open Data on the Web.",
                    "Investigation of User Search Behavior While Facing Heterogeneous Search Services.",
                    "Click Through Rate Prediction for Local Search Results.",
                    "Document Retrieval Model Through Semantic Linking.",
                    "A Concise Integer Linear Programming Formulation for Implicit Search Result Diversification.",
                    "A Comparison of Document-at-a-Time and Score-at-a-Time Query Evaluation.",
                    "ANNE: Improving Source Code Search using Entity Retrieval Approach.",
                    "Partitioning and Segment Organization Strategies for Real-Time Selective Search on Document Streams.",
                    "Modeling Event Importance for Ranking Daily News Events.",
                    "A Cost Model for Long-Term Compressed Data Retention.",
                    "Neural Models for Full Text Search.",
                    "Reliable Medical Diagnosis from Crowdsourcing: Discover Trustworthy Answers from Non-Experts.",
                    "PRED: Periodic Region Detection for Mobility Modeling of Social Media Users.",
                    "Applying Space Syntax to Online Mapping Tools.",
                    "Semantic-aware Query Processing for Activity Trajectories.",
                    "Keeping Apace with Progress in Natural Language Processing.",
                    "Task-Guided and Path-Augmented Heterogeneous Network Embedding for Author Identification.",
                    "Beyond the Words: Predicting User Personality from Heterogeneous Information.",
                    "German Typographers vs. German Grammar: Decomposition of Wikipedia Category Labels into Attribute-Value Pairs.",
                    "Comparative Document Analysis for Large Text Corpora.",
                    "Constructing and Embedding Abstract Event Causality Networks from Text Snippets.",
                    "Fun Facts: Automatic Trivia Fact Extraction from Wikipedia.",
                    "Related Event Discovery.",
                    "Lightweight Multilingual Entity Extraction and Linking.",
                    "Predicting Completeness in Knowledge Bases.",
                    "Synthesis of Forgiving Data Extractors.",
                    "Concept Embedded Convolutional Semantic Model for Question Retrieval.",
                    "Summarizing Answers in Non-Factoid Community Question-Answering.",
                    "Multi-Column Convolutional Neural Networks with Causality-Attention for Why-Question Answering.",
                    "Joint Deep Modeling of Users and Items Using Reviews for Recommendation.",
                    "Multi-Product Utility Maximization for Economic Recommendation.",
                    "Groove Radio: A Bayesian Hierarchical Model for Personalized Playlist Generation.",
                    "Temporally Factorized Network Modeling for Evolutionary Network Analysis.",
                    "Not Enough Data?: Joint Inferring Multiple Diffusion Networks via Network Generation Priors.",
                    "Online Matrix Completion for Signed Link Prediction.",
                    "Social Collaborative Viewpoint Regression with Explainable Recommendations.",
                    "Recurrent Recommender Networks.",
                    "Bartering Books to Beers: A Recommender System for Exchange Platforms.",
                    "Neural Survival Recommender.",
                    "Directed Edge Recommender System.",
                    "Machine Learning at Amazon.",
                    "Online Actions with Offline Impact: How Online Social Networks Influence Online and Offline User Behavior.",
                    "Social Incentive Optimization in Online Social Networks.",
                    "Counting Graphlets: Space vs Time.",
                    "Representation Learning with Pair-wise Constraints for Collaborative Ranking.",
                    "Statistical Spoken Dialogue Systems and the Challenges for Machine Learning.",
                    "Primum Non Nocere: Healthcare In The Digital Age.",
                    "Managing Risk of Bidding in Display Advertising.",
                    "Predicting Online Purchase Conversion for Retargeting.",
                    "Motifs in Temporal Networks.",
                    "Modeling Air Travel Choice Behavior with Mixed Kernel Density Estimations.",
                    "Location Influence in Location-based Social Networks.",
                    "Probabilistic Social Sequential Model for Tour Recommendation.",
                    "Trustworthy Analysis of Online A/B Tests: Pitfalls, challenges and solutions.",
                    "Learning Sensitive Combinations of A/B Test Metrics.",
                    "Real-Time Bidding by Reinforcement Learning in Display Advertising.",
                    "Deep Memory Networks for Attitude Identification.",
                    "D-Cube: Dense-Block Detection in Terabyte-Scale Tensors.",
                    "Modeling Document Networks with Tree-Averaged Copula Regularization.",
                    "Multilinear Factorization Machines for Multi-Task Multi-View Learning.",
                    "Algorithms for Active Classifier Selection: Maximizing Recall with Precision Constraints.",
                    "DiSMEC: Distributed Sparse Machines for Extreme Multi-label Classification.",
                    "Label Informed Attributed Network Embedding.",
                    "Embedding of Embedding (EOE): Joint Embedding for Coupled Heterogeneous Networks.",
                    "Random Semantic Tensor Ensemble for Scalable Knowledge Graph Link Prediction.",
                    "S-HOT: Scalable High-Order Tucker Decomposition.",
                    "Unsupervised Ranking using Graph Structures and Node Attributes.",
                    "Unbiased Learning-to-Rank with Biased Feedback.",
                    "Learning from User Interactions in Personal Search via Attribute Parameterization.",
                    "Delving Deep into Personal Photo and Video Search.",
                    "Harnessing the Power of Data Science through Research.",
                    "Neural Text Embeddings for Information Retrieval.",
                    "Utilizing Knowledge Graphs in Text-centricInformation Retrieval.",
                    "Social Media Anomaly Detection: Challenges and Solutions.",
                    "Workshop on Scholarly Web Mining (SWM 2017).",
                    "Mining Actionable Insights from Social Networksat WSDM 2017.",
                    "1st International Workshop on Search and Mining Terrorist Online Content & Advances in Data Science for Cyber Security and Risk on the Web.",
                    "WSDM 2017 Workshop on Mining Online Health Reports: MOHRS 2017.",
                    "WSDM Cup 2017: Vandalism Detection and Triple Scoring.",
                    "Beyond Query Logs: Recommendation and Evaluation.",
                    "Recommender Systems: Research Direction.",
                    "Modeling Source Code to Support Retrieval-Based Applications.",
                    "Scalable Text Analysis.",
                    "Quantifying and Bursting the Online Filter Bubble.",
                    "New Probabilistic Models for Recommender Systems with Rich Contextual and Content Information.",
                    "Mining Medical Causality for Diagnosis Assistance.",
                    "Adapting Information Retrieval to User Signals via Stochastic Models.",
                    "Modeling Navigation in Information Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2017swm",
                "sub_name": "Proceedings of the 1st Workshop on Scholarly Web Mining, SWM@WSDM 2017, Cambridge, United Kingdom, February 10, 2017.",
                "count": 8,
                "papers": [
                    "Describing Data Processing Pipelines in Scientific Publications for Big Data Injection.",
                    "Scalable Algorithm for Probabilistic Overlapping Community Detection.",
                    "Effectively identifying users' research interests for scholarly reference management and discovery.",
                    "Building recommender systems for scholarly information.",
                    "ScholarBase: Towards a Cross-Domain Knowledgebase for Linked Scholarly Data.",
                    "Citations and Readership are Poor Indicators of Research Excellence: Introducing TrueImpactDataset, a New Dataset for Validating Research Evaluation Metrics.",
                    "Predicting MeSH Beyond MEDLINE.",
                    "Linking Mathematical Expressions to Wikipedia."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "9th WSDM 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2016",
                "sub_name": "Proceedings of the Ninth ACM International Conference on Web Search and Data Mining, San Francisco, CA, USA, February 22-25, 2016.",
                "count": 93,
                "papers": [
                    "Large-Scale Deep Learning For Building Intelligent Computer Systems.",
                    "Who Will Reply to/Retweet This Tweet?: The Dynamics of Intimacy from Online Social Interactions.",
                    "Cross-modality Consistent Regression for Joint Visual-Textual Sentiment Analysis of Social Multimedia.",
                    "How Relevant is the Irrelevant Data: Leveraging the Tagging Data for a Learning-to-Rank Model.",
                    "Quantifying Controversy in Social Media.",
                    "Understanding and Identifying Advocates for Political Campaigns on Social Media.",
                    "Exploiting New Sentiment-Based Meta-level Features for Effective Sentiment Analysis.",
                    "Mobile App Tagging.",
                    "CCCF: Improving Collaborative Filtering via Scalable User-Item Co-Clustering.",
                    "On the Efficiency of the Information Networks in Social Media.",
                    "Modeling and Predicting Learning Behavior in MOOCs.",
                    "Beyond Ranking: Optimizing Whole-Page Presentation.",
                    "Understanding User Attention and Engagement in Online News Reading.",
                    "Publication Date Prediction through Reverse Engineering of the Web.",
                    "To Suggest, or Not to Suggest for Queries with Diverse Intents: Optimizing Search Result Presentation.",
                    "Term-by-Term Query Auto-Completion for Mobile Search.",
                    "Collaborative Denoising Auto-Encoders for Top-N Recommender Systems.",
                    "Personalized PageRank Estimation and Search: A Bidirectional Approach.",
                    "Your Cart tells You: Inferring Demographic Attributes from Purchase Data.",
                    "Reducing Click and Skip Errors in Search Result Ranking.",
                    "Hierarchical Semi-supervised Classification with Incomplete Class Hierarchies.",
                    "Is Mail The Next Frontier In Search And Data Mining?",
                    "Portrait of an Online Shopper: Understanding and Predicting Consumer Behavior.",
                    "Evolution of Privacy Loss in Wikipedia.",
                    "Keynote Speaker Bio.",
                    "Modeling Intransitivity in Matchup and Comparison Data.",
                    "Crowdsourcing High Quality Labels with a Tight Budget.",
                    "Project Success Prediction in Crowdfunding Environments.",
                    "Probabilistic Group Recommendation Model for Crowdfunding Domains.",
                    "Quality Management in Crowdsourcing using Gold Judges Behavior.",
                    "On Obtaining Effort Based Judgements for Information Retrieval.",
                    "A Semantic Graph based Topic Model for Question Retrieval in Community Question Answering.",
                    "Modeling Check-in Preferences with Multidimensional Knowledge: A Minimax Entropy Approach.",
                    "You've got Mail, and Here is What you Could do With It!: Analyzing and Predicting Actions on Email Messages.",
                    "Hierarchical Label Propagation and Discovery for Machine Generated Email.",
                    "Enforcing k-anonymity in Web Mail Auditing.",
                    "An Information-Theoretic Approach to Individual Sequential Data Sanitization.",
                    "Improving IP Geolocation using Query Logs.",
                    "Geographic Segmentation via Latent Poisson Factor Model.",
                    "Scaling up Link Prediction with Ensembles.",
                    "DiFacto: Distributed Factorization Machines.",
                    "Distributed Balanced Partitioning via Linear Embedding.",
                    "Kangaroo: Workload-Aware Processing of Range Data and Range Queries in Hadoop.",
                    "Feedback Control of Real-Time Display Advertising.",
                    "Multi-Score Position Auctions.",
                    "Multi-view Machines.",
                    "Transductive Classification on Heterogeneous Information Networks with Edge Betweenness-based Normalization.",
                    "The Troll-Trust Model for Ranking in Signed Networks.",
                    "Multileave Gradient Descent for Fast Online Learning to Rank.",
                    "AMiner: Toward Understanding Big Scholar Data.",
                    "Serving a Billion Personalized News Feeds.",
                    "The Predictive Power of Massive Data about our Fine-Grained Behavior.",
                    "Information Evolution in Social Networks.",
                    "Nonlinear Laplacian for Digraphs and its Applications to Network Analysis.",
                    "Querying and Tracking Influencers in Social Streams.",
                    "Centrality-Aware Link Recommendations.",
                    "Relational Learning with Social Status Analysis.",
                    "Equality and Social Mobility in Twitter Discussion Groups.",
                    "Learning Distributed Representations of Data in Community Question Answering for Question Retrieval.",
                    "Inferring Latent Triggers of Purchases with Consideration of Social Effects and Media Advertisements.",
                    "Towards Modelling Language Innovation Acceptance in Online Social Networks.",
                    "Discriminative Learning of Infection Models.",
                    "Representation Learning for Information Diffusion through Social Networks: an Embedded Cascade Model.",
                    "Ensemble Models for Data-driven Prediction of Malware Infections.",
                    "WSDM Cup 2016: Entity Ranking Challenge.",
                    "Dynamic Collective Entity Representations for Entity Ranking.",
                    "Relationship Queries on Extended Knowledge Graphs.",
                    "Improving Website Hyperlink Structure Using Server Logs.",
                    "Long-tail Vocabulary Dictionary Extraction from the Web.",
                    "Semantic Documents Relatedness using Concept Graph Representation.",
                    "EgoSet: Exploiting Word Ego-networks and User-generated Ontology for Multifaceted Set Expansion.",
                    "Extracting Search Query Patterns via the Pairwise Coupled Topic Model.",
                    "The Past and Future of Systems for Current Events.",
                    "Barbara Made the News: Mining the Behavior of Crowds for Time-Aware Learning to Rank.",
                    "Wiggins: Detecting Valuable Information in Dynamic Networks Using Limited Resources.",
                    "Understanding Offline Political Systems by Mining Online Political Data.",
                    "Click Models for Web Search and their Applications to IR: WSDM 2016 Tutorial.",
                    "Query Understanding for Search on All Devices at WSDM 2016.",
                    "TargetAd2016: 2nd International Workshop on Ad Targeting at Scale.",
                    "WSDM 2016 Workshop on the Ethics of Online Experimentation.",
                    "Second Workshop on Search and Exploration of X-Rated Information (SEXI'16): WSDM Workshop Summary.",
                    "Mining Complaints to Improve a Product: a Study about Problem Phrase Extraction from User Reviews.",
                    "Web-scale Multimedia Search for Internet Video Content.",
                    "Affective Computing of Image Emotion Perceptions.",
                    "Event Search and Analytics: Detecting Events in Semantically Annotated Corpora for Search & Analytics.",
                    "Understanding Diffusion Processes: Inference and Theory.",
                    "E-commerce Product Recommendation by Personalized Promotion and Total Surplus Maximization.",
                    "Detecting Social Media Icebergs by Their Tips: Rumors, Persuasion Campaigns, and Information Needs.",
                    "User Modeling in Large Social Networks.",
                    "Feature Generation and Selection on the Heterogeneous Graph for Music Recommendation.",
                    "Temporal Formation and Evolution of Online Communities.",
                    "Mining the Web for Intelligent Problem Solving for Programmers.",
                    "Optimizing Search Interactions within Professional Social Networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "8th WSDM 2015",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2015",
                "sub_name": "Proceedings of the Eighth ACM International Conference on Web Search and Data Mining, WSDM 2015, Shanghai, China, February 2-6, 2015.",
                "count": 64,
                "papers": [
                    "Making Sense of Big Data with the Berkeley Data Analytics Stack.",
                    "New Directions in Recommender Systems.",
                    "Big Data: New Paradigm or \"Sound and Fury, Signifying Nothing\"?",
                    "Delayed-Dynamic-Selective (DDS) Prediction for Reducing Extreme Tail Latency in Web Search.",
                    "MergeRUCB: A Method for Large-Scale Online Ranker Evaluation.",
                    "Engagement Periodicity in Search Engine Usage: Analysis and its Application to Search Quality Evaluation.",
                    "Toward Predicting the Outcome of an A/B Experiment for Search Relevance.",
                    "Optimal Space-time Tradeoffs for Inverted Indexes.",
                    "Understanding and Predicting Graded Search Satisfaction.",
                    "Robust Tree-based Causal Inference for Complex Ad Effectiveness Analysis.",
                    "The Power of Random Neighbors in Social Networks.",
                    "Negative Link Prediction in Social Media.",
                    "Sarcasm Detection on Twitter: A Behavioral Modeling Approach.",
                    "Modeling and Predicting Retweeting Dynamics on Microblogging Platforms.",
                    "On Integrating Network and Community Discovery.",
                    "On the Accuracy of Hyper-local Geotagging of Social Media Content.",
                    "Learning from User Interactions.",
                    "Learning to Recommend Related Entities to Search Users.",
                    "Will This Paper Increase Your h-index?: Scientific Impact Prediction.",
                    "Concept Graph Learning from Educational Data.",
                    "Review Synthesis for Micro-Review Summarization.",
                    "Fast and Space-Efficient Entity Linking for Queries.",
                    "On Tag Recommendation for Expertise Profiling: A Case Study in the Scientific Domain.",
                    "FLAME: A Probabilistic Model Combining Aspect Based Opinion Mining and Collaborative Filtering.",
                    "Semantic Matching in APP Search.",
                    "Boosting Search with Deep Understanding of Contents and Users.",
                    "Driven by Food: Modeling Geographic Choice.",
                    "Hiring Behavior Models for Online Labor Markets.",
                    "Just in Time Recommendations: Modeling the Dynamics of Boredom in Activity Streams.",
                    "Leveraging In-Batch Annotation Bias for Crowdsourced Active Learning.",
                    "Listwise Approach for Rank Aggregation in Crowdsourcing.",
                    "WorkerRank: Using Employer Implicit Judgements to Infer Worker Reputation.",
                    "The Information Life of Social Networks.",
                    "User Modeling for a Personal Assistant.",
                    "Predicting The Next App That You Are Going To Use.",
                    "You Are Where You Go: Inferring Demographic Attributes from Location Check-ins.",
                    "SimApp: A Framework for Detecting Similar Mobile Applications by Online Kernel Learning.",
                    "Personalized Mobile App Recommendation: Reconciling App Functionality and User Privacy Preference.",
                    "Inferring Movement Trajectories from GPS Snippets.",
                    "Regressing Towards Simpler Prediction Systems.",
                    "Global Optimization for Display Ad.",
                    "Back to the Past: Supporting Interpretations of Forgotten Stories by Time-aware Re-Contextualization.",
                    "Diluted Treatment Effect Estimation for Trigger Analysis in Online Controlled Experiments.",
                    "Inverting a Steady-State.",
                    "Automatic Gloss Finding for a Knowledge Base using Ontological Constraints.",
                    "Finding Subgraphs with Maximum Total Density and Limited Overlap.",
                    "Modeling Website Popularity Competition in the Attention-Activity Marketplace.",
                    "Exploring the Space of Topic Coherence Measures.",
                    "Dynamic Information Retrieval Modeling.",
                    "Scalability and Efficiency Challenges in Large-Scale Web Search Engines.",
                    "Offline Evaluation and Optimization for Interactive Systems.",
                    "Real-Time Bidding: A New Frontier of Computational Advertising Research.",
                    "Learning About Health and Medicine from Internet Data.",
                    "Distributed Graph Algorithmics: Theory and Practice.",
                    "DL-WSDM'15: Workshop on Deep Learning for Web Search and Data Mining.",
                    "HIA'15: Heterogeneous Information Access Workshop at WSDM 2015.",
                    "WSDM'15 Workshop Summary / Scalable Data Analytics: Theory and Applications.",
                    "The 2nd workshop on Vertical Search Relevance at WSDM 2015.",
                    "An Approach to the Problem of Annotation of Research Publications.",
                    "Incorporating Phrase-level Sentiment Analysis on Textual Reviews for Personalized Recommendation.",
                    "Mining Groups Stability in Ubiquitous and Social Environments: Communities, Classes and Clusters.",
                    "Sentiment-Specific Representation Learning for Document-Level Sentiment Analysis.",
                    "Chronological Scientific Information Recommendation via Supervised Dynamic Topic Modeling.",
                    "Topics, Tasks & Beyond: Learning Representations for Personalization."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "7th WSDM 2014",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2014",
                "sub_name": "Seventh ACM International Conference on Web Search and Data Mining, WSDM 2014, New York, NY, USA, February 24-28, 2014.",
                "count": 80,
                "papers": [
                    "Data that matter: opportunities in crisis informatics research.",
                    "Improving the efficiency of multi-site web search engines.",
                    "A self-adapting latency/power tradeoff model for replicated search engines.",
                    "Heterogeneous graph-based intent learning with queries, web pages and Wikipedia concepts.",
                    "Exploiting user disagreement for web search evaluation: an experimental approach.",
                    "Improving search relevance for short queries in community question answering.",
                    "Struggling or exploring?: disambiguating long search sessions.",
                    "Democracy is good for ranking: towards multi-view rank learning and adaptation in web search.",
                    "Relative confidence sampling for efficient on-line ranker evaluation.",
                    "Adapting deep RankNet for personalized search.",
                    "Search engine click spam detection based on bipartite graph propagation.",
                    "Sampling dilemma: towards effective data sampling for click prediction in sponsored search.",
                    "Exploiting contextual factors for click modeling in sponsored search.",
                    "Predicting response in mobile advertising with hierarchical importance-aware factorization machine.",
                    "Partner tiering in display advertising.",
                    "Estimating ad group performance in sponsored search.",
                    "Scalable hierarchical multitask learning algorithms for conversion optimization in display advertising.",
                    "An efficient framework for online advertising effectiveness measurement and comparison.",
                    "LASER: a scalable response prediction platform for online advertising.",
                    "Discovering common motifs in cursor movement data for improving web search.",
                    "Modeling dwell time to predict click-level satisfaction.",
                    "User modeling in search logs via a nonparametric bayesian approach.",
                    "The last click: why users give up information network navigation.",
                    "Lessons from the journey: a query log analysis of within-session learning.",
                    "Scalable K-Means by ranked retrieval.",
                    "Taxonomy discovery for personalized recommendation.",
                    "Who likes it more?: mining worth-recommending items from long tails by modeling relative preference.",
                    "On building entity recommender systems using user click log and freebase knowledge.",
                    "Improving pairwise learning for item recommendation from implicit feedback.",
                    "Personalized entity recommendation: a heterogeneous information network approach.",
                    "Social collaborative retrieval.",
                    "Transferring heterogeneous links across location-based social networks.",
                    "Customized tour recommendations in urban areas.",
                    "Detecting cohesive and 2-mode communities indirected and undirected networks.",
                    "FENNEL: streaming graph partitioning for massive scale graphs.",
                    "A few good predictions: selective node labeling in a social network.",
                    "Active learning for networked data based on non-progressive diffusion model.",
                    "Learning latent representations of nodes for classifying in heterogeneous social networks.",
                    "Prediction in a microblog hybrid network using bonacich potential.",
                    "Learning social network embeddings for predicting information diffusion.",
                    "Modeling opinion dynamics in social networks.",
                    "Fast approximation of betweenness centrality through sampling.",
                    "Effective co-betweenness centrality computation.",
                    "Chinese-English mixed text normalization.",
                    "Sentiment analysis on evolving social streams: how self-report imbalances can help.",
                    "Entity linking at the tail: sparse signals, unknown entities, and phrase models.",
                    "Latent dirichlet allocation based diversified retrieval for e-commerce search.",
                    "Supervised N-gram topic model.",
                    "Going beyond Corr-LDA for detecting specific comments on news & blogs.",
                    "Nonparametric bayesian upstream supervised multi-modal topic models.",
                    "Spatial compactness meets topical consistency: jointly modeling links and content for community detection.",
                    "Scalable topic-specific influence analysis on microblogs.",
                    "WebChild: harvesting and organizing commonsense knowledge from the web.",
                    "Using linked data to mine RDF from wikipedia's tables.",
                    "Knowledge-based graph document modeling.",
                    "Trust, but verify: predicting contribution quality for knowledge base construction and curation.",
                    "Modelling growth of urban crowd-sourced information.",
                    "Inferring the impacts of social media on crowdfunding.",
                    "Understanding and promoting micro-finance activities in Kiva.org.",
                    "Who watches (and shares) what on youtube? and when?: using twitter to understand youtube viewership.",
                    "Detecting non-gaussian geographical topics in tagged photo collections.",
                    "Ranking in heterogeneous social media.",
                    "Visualizing brand associations from web community photos.",
                    "Is a picture really worth a thousand words?: - on the role of images in e-commerce.",
                    "Integration of large scale knowledge bases using probabilistic graphical models.",
                    "Strategy in action: analyzing online search behavior bymining search strategies.",
                    "On discovering non-obvious recommendations: using unexpectedness and neighborhood selection methods in collaborative filtering systems.",
                    "Exploratory search with semantic transformations using collaborative knowledge bases.",
                    "Search by multiple examples.",
                    "Behavioral data mining and network analysis in massive online games.",
                    "Exploration and mining of web repositories.",
                    "Big graph mining for the web and social media: algorithms, anomaly detection, and applications.",
                    "Diversity and novelty in web search, recommender systems and data streams.",
                    "Multilingual probabilistic topic modeling and its applications in web mining and search.",
                    "Entity linking and retrieval for semantic search.",
                    "Log-based personalization: the 4th web search click data (WSCD) workshop.",
                    "Web-scale classification: web classification in the big data era.",
                    "1st workshop on diffusion networks and cascade analytics.",
                    "Workshop on large-scale and distributed systems for information retrieval (LSDS-IR 2014).",
                    "Data design for personalization: current challenges and emerging opportunities."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "6th WSDM 2013",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2013",
                "sub_name": "Sixth ACM International Conference on Web Search and Data Mining, WSDM 2013, Rome, Italy, February 4-8, 2013.",
                "count": 95,
                "papers": [
                    "The virtual lab.",
                    "Information-theoretic measures of influence based on content dynamics.",
                    "Characterizing and curating conversation threads: expansion, focus, volume, re-entry.",
                    "Structure and dynamics of information pathways in online media.",
                    "Cascade-based community detection.",
                    "Patent partner recommendation in enterprise social networks.",
                    "Exploiting homophily effect for trust prediction.",
                    "Efficient and effective retrieval using selective pruning.",
                    "Document selection for tiered indexing in commerce search.",
                    "Quasi-succinct indices.",
                    "Identifying users' topical tasks in web search.",
                    "Differences in search engine evaluations between query owners and non-owners.",
                    "Optimizing top-k document retrieval strategies for block-max indexes.",
                    "Improving the sensitivity of online controlled experiments by utilizing pre-experiment data.",
                    "Playing by the rules: mining query associations to predict search performance.",
                    "NCDawareRank: a novel ranking method that exploits the decomposable structure of the web.",
                    "Rank quantization.",
                    "Time-sensitive web image ranking and retrieval via dynamic multi-task regression.",
                    "Absence time and user engagement: evaluating ranking functions.",
                    "Reusing historical interaction data for faster online learning to rank for IR.",
                    "Pairwise ranking aggregation in a crowdsourced setting.",
                    "Optimizing parallel algorithms for all pairs similarity search.",
                    "Bursty subgraphs in social networks.",
                    "Sharding social networks.",
                    "Arrival and departure dynamics in social networks.",
                    "Three findings regarding privacy online.",
                    "Optimized interleaving for online retrieval evaluation.",
                    "Mining the web to predict future events.",
                    "Studying inter-national mobility through IP geolocation.",
                    "From machu_picchu to \"rafting the urubamba river\": anticipating information needs via the entity-query graph.",
                    "Personalizing atypical web search sessions.",
                    "Expediting search trend detection via prediction of query counts.",
                    "News recommendation via hypergraph learning: encapsulation of user behavior and news content.",
                    "Group sparse topical coding: from code to topic.",
                    "TYPiMatch: type-specific unsupervised learning of keys and key values for heterogeneous web data integration.",
                    "Robust query rewriting using anchor data.",
                    "Wiki3C: exploiting wikipedia for context-aware concept categorization.",
                    "Crawling deep web entity pages.",
                    "Using early view patterns to predict the popularity of youtube videos.",
                    "Geo topic model: joint modeling of user's activity area and interests for location recommendation.",
                    "Latent factor models with additive and hierarchically-smoothed user preferences.",
                    "App recommendation: a contest between satisfaction and temptation.",
                    "Threading machine generated email.",
                    "Predicting content change on the web.",
                    "Triplex transfer learning: exploiting both shared and distinct concepts for text classification.",
                    "Have you done anything like that?: predicting performance using inter-category reputation.",
                    "Learning multiple-question decision trees for cold-start recommendation.",
                    "Online multi-modal distance learning for scalable multimedia retrieval.",
                    "Unsupervised graph-based topic labelling using dbpedia.",
                    "Estimating content concreteness for finding comprehensible documents.",
                    "Translating related words to videos and back through latent topics.",
                    "What's in a name?: an unsupervised approach to link users across communities.",
                    "Big data, lifelong machine learning and transfer learning.",
                    "Balanced label propagation for partitioning massive graphs.",
                    "GOP primary season on twitter: \"popular\" political sentiment in social media.",
                    "Towards Twitter context summarization with user influence models.",
                    "Exploiting social relations for sentiment analysis in microblogging.",
                    "Connecting comments and tags: improved modeling of social tagging systems.",
                    "Co-factorization machines: modeling user interests and predicting individual decisions in Twitter.",
                    "Wikipedia entity expansion and attribute extraction from the web using semi-supervised learning.",
                    "Retweet or not?: personalized tweet re-ranking.",
                    "Overlapping community detection at scale: a nonnegative matrix factorization approach.",
                    "LaFT-tree: perceiving the expansion trace of one's circle of friends in online social networks.",
                    "A peek into the future: predicting the evolution of popularity in user generated content.",
                    "Online community detection in social sensing.",
                    "Distinguishing topical and social groups based on common identity and bond theory.",
                    "Modeling the impact of lifestyle on health at scale.",
                    "Collective inference for network data with copula latent markov networks.",
                    "Influence diffusion dynamics and influence maximization in social networks with friend and foe relationships.",
                    "Modeling dynamic behavior in large evolving graphs.",
                    "On the streaming complexity of computing local clustering coefficients.",
                    "Learning query and document similarities from click-through bipartite graph with metadata.",
                    "Optimizing budget constrained spend in search advertising.",
                    "Characterizing and supporting cross-device search tasks.",
                    "Learning to rank for spatiotemporal search.",
                    "Maguro, a system for indexing and searching over very large text collections.",
                    "Sponsored search auctions.",
                    "On the prediction of popularity of trends and hits for user generated videos.",
                    "On the quest of discovering cultural trails in social media.",
                    "Towards web-scale structured web data extraction.",
                    "Building user profiles to improve user experience in recommender systems.",
                    "Web usage mining for enhancing search-result delivery and helping users to find interesting web content.",
                    "Advanced graph mining for community evaluation in social networks and the web.",
                    "Anomaly, event, and fraud detection in large network datasets.",
                    "Models and algorithms for social influence analysis.",
                    "Data-driven political science.",
                    "Exploring structure and content on the web: extraction and integration of the semi-structured web.",
                    "Temporal web dynamics and its application to information retrieval.",
                    "(big) usage data in web search.",
                    "Econometric analysis and digital marketing: how tomeasure the effectiveness of an ad.",
                    "WSCD2013: workshop on web search click data 2013.",
                    "3rd workshop on context-awareness in retrieval and recommendation.",
                    "Workshop on large-scale and distributed systems for information retrieval (LSDS-IR 2013).",
                    "Workshop on semantic personalized information management (SPIM'13).",
                    "Search and exploration of X-Rated information (SEXI 2013)."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "5th WSDM 2012",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2012",
                "sub_name": "Proceedings of the Fifth International Conference on Web Search and Web Data Mining, WSDM 2012, Seattle, WA, USA, February 8-12, 2012.",
                "count": 86,
                "papers": [
                    "Nowcasting the macroeconomy with search engine data.",
                    "Spatially-aware indexing for image object retrieval.",
                    "Auralist: introducing serendipity into music recommendation.",
                    "Efficient misbehaving user detection in online video chat services.",
                    "Beyond co-occurrence: discovering and visualizing tag relationships from geo-spatial and temporal similarities.",
                    "Object matching in tweets with spatial models.",
                    "Beyond 100 million entities: large-scale blocking-based resolution for heterogeneous data.",
                    "Mining contrastive opinions on political texts using cross-perspective topic model.",
                    "Coupled temporal scoping of relational facts.",
                    "Overcoming browser cookie churn with clustering.",
                    "mTrust: discerning multi-faceted trust in a connected world.",
                    "Of hammers and nails: an empirical comparison of three paradigms for processing large graphs.",
                    "Pairwise cross-domain factor model for heterogeneous transfer ranking.",
                    "Scalable inference in latent variable models.",
                    "Learning recommender systems with adaptive regularization.",
                    "Collaborative ranking.",
                    "From chatter to headlines: harnessing the real-time web for personalized news recommendation.",
                    "ETF: extended tensor factorization model for personalizing prediction of review helpfulness.",
                    "Multi-relational matrix factorization using bayesian personalized ranking for social network data.",
                    "Comment spam detection by sequence mining.",
                    "Mining slang and urban opinion words and phrases from cQA services: an optimization approach.",
                    "No search result left behind: branching behavior with browser tabs.",
                    "Characterizing web content, user interests, and search behavior by reading level and topic.",
                    "Topical clustering of search results.",
                    "To each his own: personalized content selection based on text comprehensibility.",
                    "WebSets: extracting sets of entities from the web using unsupervised information extraction.",
                    "Selecting actions for resource-bounded information extraction using reinforcement learning.",
                    "Online selection of diverse results.",
                    "Overlapping clusters for distributed computation.",
                    "Sponsored search auctions with conflict constraints.",
                    "Post-click conversion modeling and analysis for non-guaranteed delivery display advertising.",
                    "Incorporating revisiting behaviors into click models.",
                    "A noise-aware click model for web search.",
                    "Personalized click model through collaborative filtering.",
                    "Fair and balanced: learning to present news stories.",
                    "Extracting search-focused key n-grams for relevance ranking in web search.",
                    "Query suggestion by constructing term-transition graphs.",
                    "Language models for keyword search over data graphs.",
                    "Large-scale analysis of individual and task differences in search result page examination strategies.",
                    "Sequence clustering and labeling for unsupervised query intent discovery.",
                    "IR system evaluation using nugget-based test collections.",
                    "Tapping into knowledge base for concept feedback: leveraging conceptnet to improve search results for difficult queries.",
                    "Domain bias in web search.",
                    "Optimized top-k processing with global page scores on block-max indexes.",
                    "Probabilistic models for personalizing web search.",
                    "Effective query formulation with multiple information sources.",
                    "Learning to rank with multi-aspect relevance for vertical search.",
                    "Beyond ten blue links: enabling user click modeling in federated web search.",
                    "Finding the right consumer: optimizing for conversion in display advertising campaigns.",
                    "Fast top-k retrieval for model based recommendation.",
                    "Relational click prediction for sponsored search.",
                    "\"I loan because...\": understanding motivations for pro-social lending.",
                    "Correlating financial time series with micro-blogging activity.",
                    "Harmony and dissonance: organizing the people's voices on political controversies.",
                    "Identifying content for planned events across social media sites.",
                    "Daily deals: prediction, social diffusion, and reputational ramifications.",
                    "On clustering heterogeneous social media objects with outlier links.",
                    "Adding semantics to microblog posts.",
                    "Exploring social influence via posterior effect of word-of-mouth recommendations.",
                    "Find me opinion sources in blogosphere: a unified framework for opinionated blog feed retrieval.",
                    "Understanding cyclic trends in social choices.",
                    "Maximizing product adoption in social networks.",
                    "Answers, not links: extracting tips from yahoo! answers to address how-to web queries.",
                    "A straw shows which way the wind blows: ranking potentially popular items from early votes.",
                    "A large-scale sentiment analysis for Yahoo! answers.",
                    "What's in a hashtag?: content based prediction of the spread of ideas in microblogging communities.",
                    "Tips, dones and todos: uncovering user profiles in foursquare.",
                    "When will it happen?: relationship prediction in heterogeneous information networks.",
                    "The life and death of online groups: predicting group growth and longevity.",
                    "Evaluating search in personal social media collections.",
                    "Learning evolving and emerging topics in social media: a dynamic nmf approach with temporal regularization.",
                    "Effects of user similarity in social media.",
                    "How user behavior is related to social affinity.",
                    "Finding your friends and following them to where you are.",
                    "How to win friends and influence people, truthfully: influence maximization mechanisms for social networks.",
                    "Inferring social ties across heterogenous networks.",
                    "The secret life of social links.",
                    "Exploration and discovery of user-generated content in large information spaces.",
                    "Computational advertising: leveraging user interaction & contextual factors for improved ad relevance & targeting.",
                    "The early bird gets the buzz: detecting anomalies and emerging trends in information networks.",
                    "Characterizing and harnessing peer-production of information in social tagging systems.",
                    "Mining, searching and exploiting collaboratively generated content on the web.",
                    "Collaborative information seeking: understanding users, systems, and content.",
                    "Machine learning for query-document matching in search.",
                    "2nd international workshop on diversity in document retrieval (DDR 2012).",
                    "WSCD 2012: workshop on web search click data 2012."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "4th WSDM 2011",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2011",
                "sub_name": "Proceedings of the Forth International Conference on Web Search and Web Data Mining, WSDM 2011, Hong Kong, China, February 9-12, 2011.",
                "count": 91,
                "papers": [
                    "Crowdsourcing 101: putting the WSDM of crowds to work for you.",
                    "Introduction to display advertising: a half-day tutorial.",
                    "Crowdsourcing for search and data mining.",
                    "User modeling for web applications.",
                    "Exploiting statistical and relational information on the web and in social media.",
                    "Web retrieval: the role of users.",
                    "Mining billion-node graphs: patterns, generators and tools.",
                    "Who uses web search for what: and how.",
                    "Personalizing web search using long term browsing history.",
                    "#TwitterSearch: a comparison of microblog search and web search.",
                    "Identifying topical authorities in microblogs.",
                    "Correcting for missing data in information cascades.",
                    "Everyone's an influencer: quantifying influence on twitter.",
                    "A comparative analysis of cascade measures for novelty and diversity.",
                    "Understanding and predicting personal navigation.",
                    "Quality-biased ranking of web documents.",
                    "Ranking from pairs and triplets: information quality, evaluation methods and query complexity.",
                    "Bing dialog model: intent, knowledge and user interaction.",
                    "We feel fine and searching the emotional web.",
                    "Efficient indexing of repeated n-grams.",
                    "Batch query processing for web search engines.",
                    "Detecting duplicate web documents using clickthrough data.",
                    "KMV-peer: a robust and adaptive peer-selection algorithm.",
                    "Understanding temporal query dynamics.",
                    "Patterns of temporal variation in online media.",
                    "Using graded-relevance metrics for evaluating community QA answer selection.",
                    "Mining social images with distance metric learning for automated image tagging.",
                    "Dynamic relationship and event discovery.",
                    "Joint training for open-domain extraction on the web: exploiting overlap when supervision is limited.",
                    "Scalable knowledge harvesting with high precision and high recall.",
                    "Mining named entities with temporally correlated bursts from multilingual web news streams.",
                    "Dynamic ranked retrieval.",
                    "Optimizing two-dimensional search results presentation.",
                    "Result enrichment in commerce search using browse trails.",
                    "Identifying task-based sessions in search engine query logs.",
                    "Recommender systems with social regularization.",
                    "Unbiased offline evaluation of contextual-bandit-based news article recommendation algorithms.",
                    "Efficient online ad serving in a display advertising exchange.",
                    "Trend analysis model: trend consists of temporal words, topics, and timestamps.",
                    "Topical semantics of twitter links.",
                    "Evaluating the visual quality of web pages using a computational aesthetic approach.",
                    "Clustering product features for opinion mining.",
                    "Materializing multi-relational databases from the web using taxonomic queries.",
                    "What blogs tell us about websites: a demographics study.",
                    "Cross lingual text classification by mining multilingual topics from wikipedia.",
                    "Multidimensional mining of large-scale search logs: a topic-concept cube approach.",
                    "Optimizing merchant revenue with rebates.",
                    "Searchable web sites recommendation.",
                    "Inferring search behaviors using partially observable markov model with duration (POMD).",
                    "Learning website hierarchies for keyword enrichment in contextual advertising.",
                    "Action prediction and identification from mining temporal user behaviors.",
                    "Collective extraction from heterogeneous web lists.",
                    "CMAP: effective fusion of quality and relevance for multi-criteria recommendation.",
                    "CoBayes: bayesian knowledge corroboration with assessors of unknown areas of expertise.",
                    "Multi-dimensional search result diversification.",
                    "Improving social bookmark search using personalised latent variable language models.",
                    "Strength of social influence in trust networks in product review sites.",
                    "A combined topical/non-topical approach to identifying web sites for children.",
                    "Bid generation for advanced match in sponsored search.",
                    "Let web spammers expose themselves.",
                    "Efficient entity resolution for large heterogeneous information spaces.",
                    "Web-scale table census and classification.",
                    "A probabilistic approach for learning folksonomies from structured data.",
                    "Linking online news and social media.",
                    "Document assignment in multi-site search engines.",
                    "Transient crowd discovery on the real-time social web.",
                    "Adaptive bootstrapping of recommender systems using decision trees.",
                    "Predicting future reviews: sentiment analysis models for collaborative filtering.",
                    "Learning similarity function for rare queries.",
                    "A two-view learning approach for image tag ranking.",
                    "Supervised random walks: predicting and recommending links in social networks.",
                    "OOLAM: an opinion oriented link analysis model for influence persona discovery.",
                    "eBay: an E-commerce marketplace as a complex network.",
                    "A framework for quantitative analysis of cascades on networks.",
                    "Scalable clustering of news search results.",
                    "Large-scale hierarchical text classification without labelled data.",
                    "Low-order tensor decompositions for social tagging recommendation.",
                    "Shopping for products you don't know you need.",
                    "On composition of a federated web search result page: using online users to provide pairwise preference for heterogeneous verticals.",
                    "Stochastic query covering.",
                    "Learning to re-rank web search results with multiple pairwise features.",
                    "The tube over time: characterizing popularity growth of youtube videos.",
                    "Citation recommendation without author supervision.",
                    "Query suggestion for E-commerce sites.",
                    "An algorithmic treatment of strong queries.",
                    "Enhanced email spam filtering through combining similarity graphs.",
                    "LambdaMerge: merging the results of query reformulations.",
                    "Normalizing web product attributes and discovering domain ontology with minimal effort.",
                    "Aspect and sentiment unification model for online review analysis.",
                    "Searching patterns for relation extraction over the web: rediscovering the pattern-relation duality.",
                    "On the selection of tags for tag clouds."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "3rd WSDM 2010",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2010",
                "sub_name": "Proceedings of the Third International Conference on Web Search and Web Data Mining, WSDM 2010, New York, NY, USA, February 4-6, 2010.",
                "count": 45,
                "papers": [
                    "Leveraging temporal dynamics of document content in relevance ranking.",
                    "Towards recency ranking in web search.",
                    "Ranking mechanisms in twitter-like forums.",
                    "Learning concept importance using a weighted dependence model.",
                    "Query reformulation using anchor text.",
                    "Tagging human knowledge.",
                    "Precomputing search features for fast and accurate query classification.",
                    "I tag, you tag: translating tags for advanced user models.",
                    "Pairwise interaction tensor factorization for personalized tag recommendation.",
                    "fLDA: matrix factorization through latent dirichlet allocation.",
                    "Coupled semi-supervised learning for information extraction.",
                    "Adapting information bottleneck method for automatic construction of domain-oriented sentiment lexicon.",
                    "Data-oriented content query system: searching for data into text on the web.",
                    "Corroborating information from disagreeing views.",
                    "Ranking with query-dependent loss for web search.",
                    "IntervalRank: isotonic regression with listwise and pairwise constraints.",
                    "An optimization framework for query recommendation.",
                    "Improving quality of training data for learning to rank using click-through data.",
                    "A model to estimate intrinsic document relevance from the clickthrough logs of a web search engine.",
                    "Large scale query log analysis of re-finding.",
                    "Anatomy of the long tail: ordinary people with extraordinary tastes.",
                    "Inferring search behaviors using partially observable Markov (POM) model.",
                    "Beyond DCG: user behavior as a predictor of a successful search.",
                    "Measuring the reusability of test collections.",
                    "Learning influence probabilities in social networks.",
                    "You are who you know: inferring user profiles in online social networks.",
                    "TwitterRank: finding topic-sensitive influential twitterers.",
                    "Folks in Folksonomies: social link prediction from shared metadata.",
                    "GeoFolk: latent spatial semantics in web 2.0 social media.",
                    "Learning similarity metrics for event identification in social media.",
                    "Early online identification of attention gathering items in social media.",
                    "Evolution of two-sided markets.",
                    "A novel click model and its applications to online advertising.",
                    "Adaptive weighing designs for keyword value computation.",
                    "Automatic generation of bid phrases for online advertising.",
                    "Personalized click prediction in sponsored search.",
                    "Improving ad relevance in sponsored search.",
                    "Revisiting globally sorted indexes for efficient document retrieval.",
                    "Learning URL patterns for webpage de-duplication.",
                    "On compressing the textual web.",
                    "A sketch-based distance oracle for web-scale graphs.",
                    "Early exit optimizations for additive machine learned ranking systems.",
                    "SBotMiner: large scale search bot detection.",
                    "Gathering and ranking photos of named entities with high precision, high recall, and diversity.",
                    "Boilerplate detection using shallow text features."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "2nd WSDM 2009",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2009",
                "sub_name": "Proceedings of the Second International Conference on Web Search and Web Data Mining, WSDM 2009, Barcelona, Spain, February 9-11, 2009.",
                "count": 38,
                "papers": [
                    "Challenges in building large-scale information retrieval systems: invited talk.",
                    "Online social networks: modeling and mining: invited talk.",
                    "Harvesting, searching, and ranking knowledge on the web: invited talk.",
                    "Diversifying search results.",
                    "Discovering and using groups to improve personalized search.",
                    "Adaptive subjective triggers for opinionated document retrieval.",
                    "Query by document.",
                    "Wikipedia pages as entry points for book search.",
                    "Clustering the tagged web.",
                    "Classifying tags using open content resources.",
                    "Cross-language query classification using web search for exogenous knowledge.",
                    "Improving music genre classification using collaborative tagging data.",
                    "Information arbitrage across multi-lingual Wikipedia.",
                    "Measuring the similarity between implicit semantic relations using web search engines.",
                    "A model for fast web mining prototyping.",
                    "Efficient multiple-click models in web search.",
                    "Characterizing the influence of domain expertise on web search behavior.",
                    "Quality-aware collaborative question answering: methods and evaluation.",
                    "A new visual search interface for web browsing.",
                    "Mining user web search activity with layered bayesian networks or how to capture a click in its context.",
                    "Generating labels from clicks.",
                    "Integration of news content into web results.",
                    "Mining common topics from multiple asynchronous text streams.",
                    "Predicting the readability of short web summaries.",
                    "Effective latent space graph-based re-ranking model with global consistency.",
                    "Top-k aggregation using intersections of ranked inputs.",
                    "Is Wikipedia link structure different?",
                    "Less is more: sampling the neighborhood graph makes SALSA better and faster.",
                    "Camera brand congruence in the Flickr social graph.",
                    "Finding text reuse on the web.",
                    "Speeding up algorithms on compressed web graphs.",
                    "The web changes everything: understanding the dynamics of web content.",
                    "User Browsing Graph: Structure, Evolution and Application.",
                    "Remembering what we like: Toward an agent-based model of Web traffic.",
                    "Time Will Tell: Leveraging Temporal Expressions in IR.",
                    "Contrasting Controlled Vocabulary and Tagging: Experts Choose the Right Names to Label the Wrong Things.",
                    "On Stability, Clarity, and Co-occurrence of Self-Tagging.",
                    "Tagging with Queries: How and Why?"
                ]
            },
            {
                "sub_name_abbr": "conf/wsdm/2009wscd",
                "sub_name": "Proceedings of the 2009 workshop on Web Search Click Data, WSCD@WSDM 2009, Barcelona, Spain, February 9, 2009.",
                "count": 14,
                "papers": [
                    "Survey and evaluation of query intent detection methods.",
                    "Analysis of long queries in a large scale search log.",
                    "Distinguishing humans from robots in web search logs: preliminary results using query rates and intervals.",
                    "Incremental learning to rank with partially-labeled data.",
                    "Generating unambiguous URL clusters from web search.",
                    "Topic-specific analysis of search queries.",
                    "Optimising topical query decomposition.",
                    "Search shortcuts using click-through data.",
                    "Query suggestions using query-flow graphs.",
                    "Using query logs and click data to create improved document descriptions.",
                    "Intentional query suggestion: making user goals more explicit during search.",
                    "Usefulness of quality click-through data for training.",
                    "Comparative analysis of clicks and judgments for IR evaluation.",
                    "Tailoring click models to user goals."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "1st WSDM 2008",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wsdm/2008",
                "sub_name": "Proceedings of the International Conference on Web Search and Web Data Mining, WSDM 2008, Palo Alto, California, USA, February 11-12, 2008.",
                "count": 26,
                "papers": [
                    "Web information management: past, present and future.",
                    "Machine reading at web scale.",
                    "Crawl ordering by search impact.",
                    "On placing skips optimally in expectation.",
                    "Disorder inequality: a combinatorial approach to nearest neighbor search.",
                    "Beyond basic faceted search.",
                    "Entropy of search logs: how hard is search? with personalization? with backoff?",
                    "Fast learning of document ranking functions with the committee perceptron.",
                    "Ranking web sites with real user traffic.",
                    "SoftRank: optimizing non-smooth rank metrics.",
                    "An experimental comparison of click position-bias models.",
                    "A scalable pattern mining approach to web graph compression with communities.",
                    "Collaboration over time: characterizing and modeling network evolution.",
                    "Preferential behavior in online groups.",
                    "Connectivity structure of bipartite graphs via the KNC-plot.",
                    "Deep classifier: automatically categorizing search results into large-scale hierarchies.",
                    "Personal name classification in web queries.",
                    "Understanding temporal aspects in document classification.",
                    "On ranking controversies in wikipedia: models and evaluation.",
                    "Finding high-quality content in social media.",
                    "Can social bookmarking improve web search?",
                    "Identifying the influential bloggers in a community.",
                    "Opinion spam and analysis.",
                    "A holistic lexicon-based approach to opinion mining.",
                    "An empirical analysis of sponsored search performance in search engine advertising.",
                    "Advertising keyword suggestion based on concept hierarchy."
                ]
            }
        ]
    }
]