[
    {
        "year": "2021",
        "name": "19th ACNS 2021",
        "info": "Kamakura, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2021-1",
                "sub_name": "Applied Cryptography and Network Security - 19th International Conference, ACNS 2021, Kamakura, Japan, June 21-24, 2021, Proceedings, Part I.",
                "count": 18,
                "papers": [
                    "Adaptive-ID Secure Hierarchical ID-Based Authenticated Key Exchange Under Standard Assumptions Without Random Oracles.",
                    "Analysis of Client-Side Security for Long-Term Time-Stamping Services.",
                    "Towards Efficient and Strong Backward Private Searchable Encryption with Secure Enclaves.",
                    "CECMLP: New Cipher-Based Evaluating Collaborative Multi-layer Perceptron Scheme in Federated Learning.",
                    "Blind Polynomial Evaluation and Data Trading.",
                    "Coin-Based Multi-party Fair Exchange.",
                    "P2DEX: Privacy-Preserving Decentralized Cryptocurrency Exchange.",
                    "W-OTS+ Up My Sleeve! A Hidden Secure Fallback for Cryptocurrency Wallets.",
                    "Terrorist Attacks for Fake Exposure Notifications in Contact Tracing Systems.",
                    "Unlinkable and Invisible γ-Sanitizable Signatures.",
                    "Partially Structure-Preserving Signatures: Lower Bounds, Constructions and More.",
                    "An Efficient Certificate-Based Signature Scheme in the Standard Model.",
                    "SnakeGX: A Sneaky Attack Against SGX Enclaves.",
                    "Telepathic Headache: Mitigating Cache Side-Channel Attacks on Convolutional Neural Networks.",
                    "Efficient FPGA Design of Exception-Free Generic Elliptic Curve Cryptosystems.",
                    "Access Control Encryption from Group Encryption.",
                    "Password Protected Secret Sharing from Lattices.",
                    "Efficient Homomorphic Conversion Between (Ring) LWE Ciphertexts."
                ]
            },
            {
                "sub_name_abbr": "conf/acns/2021-2",
                "sub_name": "Applied Cryptography and Network Security - 19th International Conference, ACNS 2021, Kamakura, Japan, June 21-24, 2021, Proceedings, Part II.",
                "count": 19,
                "papers": [
                    "Breaking and Fixing Third-Party Payment Service for Mobile Apps.",
                    "DSS: Discrepancy-Aware Seed Selection Method for ICS Protocol Fuzzing.",
                    "Threat for the Secure Remote Password Protocol and a Leak in Apple's Cryptographic Library.",
                    "Privacy-Preserving Data Aggregation with Probabilistic Range Validation.",
                    "LLVM-Based Circuit Compilation for Practical Secure Computation.",
                    "An Efficient Passive-to-Active Compiler for Honest-Majority MPC over Rings.",
                    "Experimental Review of the IKK Query Recovery Attack: Assumptions, Recovery Rate and Improvements.",
                    "Efficient Methods to Search for Best Differential Characteristics on SKINNY.",
                    "Towards Efficient LPN-Based Symmetric Encryption.",
                    "A Differentially Private Hybrid Approach to Traffic Monitoring.",
                    "Proactive Detection of Phishing Kit Traffic.",
                    "Vestige: Identifying Binary Code Provenance for Vulnerability Detection.",
                    "SoK: Auditability and Accountability in Distributed Payment Systems.",
                    "Defending Web Servers Against Flash Crowd Attacks.",
                    "TurboIKOS: Improved Non-interactive Zero Knowledge and Post-quantum Signatures.",
                    "Cryptanalysis of the Binary Permuted Kernel Problem.",
                    "Security Comparisons and Performance Analyses of Post-quantum Signature Algorithms.",
                    "Tighter Proofs for the SIGMA and TLS 1.3 Key Exchange Protocols.",
                    "Improved Structured Encryption for SQL Databases via Hybrid Indexing."
                ]
            },
            {
                "sub_name_abbr": "conf/acns/2021w",
                "sub_name": "Applied Cryptography and Network Security Workshops - ACNS 2021 Satellite Workshops, AIBlock, AIHWS, AIoTS, CIMSS, Cloud S&P, SCI, SecMT, and SiMLA, Kamakura, Japan, June 21-24, 2021, Proceedings.",
                "count": 30,
                "papers": [
                    "Shaping Blockchain Technology for Securing Supply Chains.",
                    "The Obfuscation Method of User Identification System.",
                    "Proof of Assets in the Diem Blockchain.",
                    "An Identity-Based Blind Signature Scheme with Message Recovery from Pairings.",
                    "A Good Anvil Fears No Hammer: Automated Rowhammer Detection Using Unsupervised Deep Learning.",
                    "Model Evasion Attacks Against Partially Encrypted Deep Neural Networks in Isolated Execution Environment.",
                    "On Reverse Engineering Neural Network Implementation on GPU.",
                    "On the Importance of Pooling Layer Tuning for Profiling Side-Channel Analysis.",
                    "Towards Real-Time Deep Learning-Based Network Intrusion Detection on FPGA.",
                    "Towards Trained Model Confidentiality and Integrity Using Trusted Execution Environments.",
                    "Quantum Computing Threat Modelling on a Generic CPS Setup.",
                    "Cyber-Attack Case Studies on Dynamic Voltage Restorer in Smart Grid.",
                    "Attacklets to Test Anomaly Detectors for Critical Infrastructure.",
                    "WiP: Distributed Intrusion Detection System for TCP/IP-Based Connections in Industrial Environments Using Self-organizing Maps.",
                    "Demand Manipulation Attack Resilient Privacy Aware Smart Grid Using PUFs and Blockchain.",
                    "BFV, CKKS, TFHE: Which One is the Best for a Secure Neural Network Evaluation in the Cloud?",
                    "Memory Deduplication as a Protective Factor in Virtualized Systems.",
                    "A (Bit)slice of Rainbow.",
                    "Cryptanalysis of a Lattice-Based Group Signature with Verifier-Local Revocation Achieving Full Security.",
                    "An Efficient Proactive Secret Sharing Scheme for Cloud Storage.",
                    "PoliCT: Flexible Policy in Certificate Transparency Enabling Lightweight Self-monitor.",
                    "Aggregate Signature with Traceability of Devices Dynamically Generating Invalid Signatures.",
                    "Combating the OS-Level Malware in Mobile Devices by Leveraging Isolation and Steganography.",
                    "Pass-As-You-Go: A Direct Anonymous Attestation-Based Untraceable Contactless Transit Pass.",
                    "Towards Demystifying Adversarial Robustness of Binarized Neural Networks.",
                    "Kryptonite: An Adversarial Attack Using Regional Focus.",
                    "POSTER: Resistance Analysis of Two AES-Like Against the Boomerang Attack.",
                    "POSTER: LHSA: Lightweight Hardware Security Arbitrator.",
                    "POSTER: Another Look at Boyar-Peralta's Algorithm.",
                    "POSTER: Optimizing Device Implementation of Linear Layers with Automated Tools."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "18th ACNS 2020",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2020-1",
                "sub_name": "Applied Cryptography and Network Security - 18th International Conference, ACNS 2020, Rome, Italy, October 19-22, 2020, Proceedings, Part I.",
                "count": 24,
                "papers": [
                    "Communication-Efficient Proactive Secret Sharing for Dynamic Groups with Dishonest Majorities.",
                    "Random Walks and Concurrent Zero-Knowledge.",
                    "Secure and Efficient Delegation of Elliptic-Curve Pairing.",
                    "Tweaking Key-Alternating Feistel Block Ciphers.",
                    "Lesamnta-LW Revisited: Improved Security Analysis of Primitive and New PRF Mode.",
                    "Efficient AGCD-Based Homomorphic Encryption for Matrix and Vector Arithmetic.",
                    "Trapdoor Delegation and HIBE from Middle-Product LWE in Standard Model.",
                    "Rotational Cryptanalysis on MAC Algorithm Chaskey.",
                    "How Not to Create an Isogeny-Based PAKE.",
                    "ACE in Chains: How Risky Is CBC Encryption of Binary Executable Files?",
                    "Classical Misuse Attacks on NIST Round 2 PQC - The Power of Rank-Based Schemes.",
                    "Offline Witness Encryption with Semi-adaptive Security.",
                    "Efficient Anonymous Multi-group Broadcast Encryption.",
                    "Improving the Efficiency of Re-randomizable and Replayable CCA Secure Public Key Encryption.",
                    "New Methods and Abstractions for RSA-Based Forward Secure Signatures.",
                    "Minting Mechanism for Proof of Stake Blockchains.",
                    "Timed Signatures and Zero-Knowledge Proofs - Timestamping in the Blockchain Era -.",
                    "An Efficient Secure Division Protocol Using Approximate Multi-bit Product and New Constant-Round Building Blocks.",
                    "Improved Building Blocks for Secure Multi-party Computation Based on Secret Sharing with Honest Majority.",
                    "A Practical Approach to the Secure Computation of the Moore-Penrose Pseudoinverse over the Rationals.",
                    "Saber on ESP32.",
                    "The Lattice-Based Digital Signature Scheme qTESLA.",
                    "Secure Two-Party Computation in a Quantum World.",
                    "Further Optimizations of CSIDH: A Systematic Approach to Efficient Strategies, Permutations, and Bound Vectors."
                ]
            },
            {
                "sub_name_abbr": "conf/acns/2020-2",
                "sub_name": "Applied Cryptography and Network Security - 18th International Conference, ACNS 2020, Rome, Italy, October 19-22, 2020, Proceedings, Part II.",
                "count": 22,
                "papers": [
                    "A Breach into the Authentication with Built-in Camera (ABC) Protocol.",
                    "A Practical System for Privacy-Preserving Video Surveillance.",
                    "Biometric-Authenticated Searchable Encryption.",
                    "\\(\\mathsf {BioLocker}\\): A Practical Biometric Authentication Mechanism Based on 3D Fingervein.",
                    "Accelerating Forward and Backward Private Searchable Encryption Using Trusted Execution.",
                    "Cluster-Based Anonymization of Knowledge Graphs.",
                    "Same Point Composable and Nonmalleable Obfuscated Point Functions.",
                    "A Concise Bounded Anonymous Broadcast Yielding Combinatorial Trace-and-Revoke Schemes.",
                    "Multi-Device for Signal.",
                    "On the Cryptographic Deniability of the Signal Protocol.",
                    "Powerless Security.",
                    "Watching the Weak Link into Your Home: An Inspection and Monitoring Toolkit for TR-069.",
                    "The Naked Sun: Malicious Cooperation Between Benign-Looking Processes.",
                    "Quality Evaluation of Cyber Threat Intelligence Feeds.",
                    "Game Theory-Based Approach for Defense Against APTs.",
                    "MemShield: GPU-Assisted Software Memory Encryption.",
                    "Super Root: A New Stealthy Rooting Technique on ARM Devices.",
                    "Towards Automated Augmentation and Instrumentation of Legacy Cryptographic Executables.",
                    "When TLS Meets Proxy on Mobile.",
                    "Human Factors in Homograph Attack Recognition.",
                    "Publicly Evaluatable Perceptual Hashing.",
                    "TrollThrottle - Raising the Cost of Astroturfing."
                ]
            },
            {
                "sub_name_abbr": "conf/acns/2020w",
                "sub_name": "Applied Cryptography and Network Security Workshops - ACNS 2020 Satellite Workshops, AIBlock, AIHWS, AIoTS, Cloud S&P, SCI, SecMT, and SiMLA, Rome, Italy, October 19-22, 2020, Proceedings.",
                "count": 31,
                "papers": [
                    "Towards a Formally Verified Implementation of the MimbleWimble Cryptocurrency Protocol.",
                    "Secure Management of IoT Devices Based on Blockchain Non-fungible Tokens and Physical Unclonable Functions.",
                    "Bitcoin Blockchain Steganographic Analysis.",
                    "Dynamic Group Key Agreement for Resource-constrained Devices Using Blockchains.",
                    "Tokenization of Real Estate Using Blockchain Technology.",
                    "Practical Side-Channel Based Model Extraction Attack on Tree-Based Machine Learning Algorithm.",
                    "Controlling the Deep Learning-Based Side-Channel Analysis: A Way to Leverage from Heuristics.",
                    "A Comparison of Weight Initializers in Deep Learning-Based Side-Channel Analysis.",
                    "Leakage Assessment Through Neural Estimation of the Mutual Information.",
                    "Evolvable Hardware Architectures on FPGA for Side-Channel Security.",
                    "Simple Electromagnetic Analysis Against Activation Functions of Deep Neural Networks.",
                    "Performance Analysis of Multilayer Perceptron in Profiling Side-Channel Analysis.",
                    "The Forgotten Hyperparameter: - Introducing Dilated Convolution for Boosting CNN-Based Side-Channel Attacks.",
                    "ARM-AFL: Coverage-Guided Fuzzing Framework for ARM-Based IoT Devices.",
                    "Post-exploitation and Persistence Techniques Against Programmable Logic Controller.",
                    "Investigation of Cyber Attacks on a Water Distribution System.",
                    "Computing Neural Networks with Homomorphic Encryption and Verifiable Computing.",
                    "Attribute-Based Symmetric Searchable Encryption.",
                    "Towards Inclusive Privacy Protections in the Cloud.",
                    "A Study on Microarchitectural Covert Channel Vulnerabilities in Infrastructure-as-a-Service.",
                    "On New Zero-Knowledge Proofs for Fully Anonymous Lattice-Based Group Signature Scheme with Verifier-Local Revocation.",
                    "Proofs of Ownership on Encrypted Cloud Data via Intel SGX.",
                    "On the Verification of Signed Messages.",
                    "Applications and Developments of the Lattice Attack in Side Channel Attacks.",
                    "Exploring the Security of Certificate Transparency in the Wild.",
                    "DaVinci: Android App Analysis Beyond Frida via Dynamic System Call Instrumentation.",
                    "MobHide: App-Level Runtime Data Anonymization on Mobile.",
                    "Evaluation of the Adoption and Privacy Risks of Google Prompts.",
                    "On the Evolution of Security Issues in Android App Versions.",
                    "Unsupervised Labelling of Stolen Handwritten Digit Embeddings with Density Matching.",
                    "Minority Reports Defense: Defending Against Adversarial Patches."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th ACNS 2019",
        "info": "Bogota, Colombia",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2019",
                "sub_name": "Applied Cryptography and Network Security - 17th International Conference, ACNS 2019, Bogota, Colombia, June 5-7, 2019, Proceedings.",
                "count": 29,
                "papers": [
                    "Rate-Optimizing Compilers for Continuously Non-malleable Codes.",
                    "Re: What's Up Johnny? - Covert Content Attacks on Email End-to-End Encryption.",
                    "Cryptanalysis of ForkAES.",
                    "Short Lattice-Based One-out-of-Many Proofs and Applications to Ring Signatures.",
                    "Hierarchical Attribute-Based Signatures: Short Keys and Optimal Signature Length.",
                    "Raptor: A Practical Lattice-Based (Linkable) Ring Signature.",
                    "Parallelizable MACs Based on the Sum of PRPs with Security Beyond the Birthday Bound.",
                    "DynOpVm: VM-Based Software Obfuscation with Dynamic Opcode Mapping.",
                    "Hide and Seek: An Architecture for Improving Attack-Visibility in Industrial Control Systems.",
                    "A Modular Hybrid Learning Approach for Black-Box Security Testing of CPS.",
                    "PassGAN: A Deep Learning Approach for Password Guessing.",
                    "Uncle-Block Attack: Blockchain Mining Threat Beyond Block Withholding for Rational and Uncooperative Miners.",
                    "Longitudinal Analysis of Misuse of Bitcoin.",
                    "Faster Multiplication in \\mathbb Z_2^m[x] on Cortex-M4 to Speed up NIST PQC Candidates.",
                    "Generic and Practical Key Establishment from Lattice.",
                    "One Sample Ring-LWE with Rounding and Its Application to Key Exchange.",
                    "Masking Dilithium - Efficient Implementation and Side-Channel Evaluation.",
                    "Proxy Re-Encryption and Re-Signatures from Lattices.",
                    "DL-Extractable UC-Commitment Schemes.",
                    "A New Encoding Framework for Predicate Encryption with Non-linear Structures in Prime Order Groups.",
                    "Unbounded Inner-Product Functional Encryption with Succinct Keys.",
                    "Password-Authenticated Public-Key Encryption.",
                    "Public Immunization Against Complete Subversion Without Random Oracles.",
                    "Strong Leakage and Tamper-Resilient PKE from Refined Hash Proof System.",
                    "Benchmarking Privacy Preserving Scientific Operations.",
                    "Turbospeedz: Double Your Online SPDZ! Improving SPDZ Using Function Dependent Preprocessing.",
                    "pRate: Anonymous Star Rating with Rating Secrecy.",
                    "Masking Fuzzy-Searchable Public Databases.",
                    "Homomorphic Training of 30, 000 Logistic Regression Models."
                ]
            },
            {
                "sub_name_abbr": "conf/acns/2019w",
                "sub_name": "Applied Cryptography and Network Security Workshops - ACNS 2019 Satellite Workshops, SiMLA, Cloud S&P, AIBlock, and AIoTS, Bogota, Colombia, June 5-7, 2019, Proceedings.",
                "count": 10,
                "papers": [
                    "Risk-Based Static Authentication in Web Applications with Behavioral Biometrics and Session Context Analytics.",
                    "Using Honeypots in a Decentralized Framework to Defend Against Adversarial Machine-Learning Attacks.",
                    "Graphene: A Secure Cloud Communication Architecture.",
                    "A Survey on Machine Learning Applications for Software Defined Network Security.",
                    "A New Proof of Work for Blockchain Based on Random Multivariate Quadratic Equations.",
                    "B SIEM-IoT: A Blockchain-Based and Distributed SIEM for the Internet of Things.",
                    "Towards Blockchained Challenge-Based Collaborative Intrusion Detection.",
                    "Enhancement to the Privacy-Aware Authentication for Wi-Fi Based Indoor Positioning Systems.",
                    "Design of a FDIA Resilient Protection Scheme for Power Networks by Securing Minimal Sensor Set.",
                    "Strong Leakage Resilient Encryption by Hiding Partial Ciphertext."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th ACNS 2018",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2018",
                "sub_name": "Applied Cryptography and Network Security - 16th International Conference, ACNS 2018, Leuven, Belgium, July 2-4, 2018, Proceedings.",
                "count": 36,
                "papers": [
                    "A Cryptographic Analysis of the WireGuard Protocol.",
                    "Distributed SSH Key Management with Proactive RSA Threshold Signatures.",
                    "Non-interactive Zaps of Knowledge.",
                    "Formal Verification of Side-Channel Countermeasures via Elementary Circuit Transformations.",
                    "Drive-By Key-Extraction Cache Attacks from Portable Code.",
                    "On the Ineffectiveness of Internal Encodings - Revisiting the DCA Attack on White-Box Cryptography.",
                    "Continuously Non-malleable Codes with Split-State Refresh.",
                    "Efficient Unconditionally Secure Signatures Using Universal Hashing.",
                    "Floppy-Sized Group Signatures from Lattices.",
                    "On the Security Notions for Homomorphic Signatures.",
                    "Invisible Sanitizable Signatures and Public-Key Encryption are Equivalent.",
                    "Delegatable Attribute-Based Anonymous Credentials from Dynamically Malleable Signatures.",
                    "Privacy-Preserving Ridge Regression with only Linearly-Homomorphic Encryption.",
                    "Privacy-Preserving Plaintext-Equality of Low-Entropy Inputs.",
                    "Nothing Refreshes Like a RePSI: Reactive Private Set Intersection.",
                    "New Protocols for Secure Equality Test and Comparison.",
                    "Minimising Communication in Honest-Majority MPC by Batchwise Multiplication Verification.",
                    "Best of Both Worlds in Secure Computation, with Low Communication Overhead.",
                    "3PC ORAM with Low Latency, Low Bandwidth, and Fast Batch Retrieval.",
                    "MergeMAC: A MAC for Authentication with Strict Time Constraints and Limited Bandwidth.",
                    "KangarooTwelve: Fast Hashing Based on Keccak-p.",
                    "Related-Key Boomerang Attacks on Full ANU Lightweight Block Cipher.",
                    "Generic Round-Function-Recovery Attacks for Feistel Networks over Small Domains.",
                    "Differential Cryptanalysis of Round-Reduced Sparx-64/128.",
                    "Can Caesar Beat Galois? - Robustness of CAESAR Candidates Against Nonce Reusing and High Data Complexity Attacks.",
                    "Improved Anonymous Broadcast Encryptions - Tight Security and Shorter Ciphertext.",
                    "Time-Based Direct Revocable Ciphertext-Policy Attribute-Based Encryption with Short Revocation List.",
                    "Almost Tight Multi-Instance Multi-Ciphertext Identity-Based Encryption on Lattices.",
                    "In-Region Authentication.",
                    "Formal Analysis of Distance Bounding with Secure Hardware.",
                    "KRB-CCN: Lightweight Authentication and Access Control for Private Content-Centric Networks.",
                    "Assentication: User De-authentication and Lunchtime Attack Mitigation with Seated Posture Biometric.",
                    "Stateful Multi-client Verifiable Computation.",
                    "VeriCount: Verifiable Resource Accounting Using Hardware and Software Isolation.",
                    "Message-Locked Encryption with File Update.",
                    "DogFish: Decentralized Optimistic Game-theoretic FIle SHaring."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th ACNS 2017",
        "info": "Kanazawa, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2017",
                "sub_name": "Applied Cryptography and Network Security - 15th International Conference, ACNS 2017, Kanazawa, Japan, July 10-12, 2017, Proceedings.",
                "count": 34,
                "papers": [
                    "Sampling from Arbitrary Centered Discrete Gaussians for Lattice-Based Cryptography.",
                    "Simple Security Definitions for and Constructions of 0-RTT Key Exchange.",
                    "TOPPSS: Cost-Minimal Password-Protected Secret Sharing Based on Threshold OPRF.",
                    "Secure and Efficient Pairing at 256-Bit Security Level.",
                    "No Free Charge Theorem: A Covert Channel via USB Charging Cable on Mobile Devices.",
                    "Are You Lying: Validating the Time-Location of Outdoor Images.",
                    "Lights, Camera, Action! Exploring Effects of Visual Distractions on Completion of Security Tasks.",
                    "A Pilot Study of Multiple Password Interference Between Text and Map-Based Passwords.",
                    "Hierarchical Key Assignment with Dynamic Read-Write Privilege Enforcement and Extended KI-Security.",
                    "A Novel GPU-Based Implementation of the Cube Attack - Preliminary Results Against Trivium.",
                    "Related-Key Impossible-Differential Attack on Reduced-Round Skinny.",
                    "Faster Secure Multi-party Computation of AES and DES Using Lookup Tables.",
                    "An Experimental Study of the BDD Approach for the Search LWE Problem.",
                    "Efficiently Obfuscating Re-Encryption Program Under DDH Assumption.",
                    "Lattice-Based Group Signatures: Achieving Full Dynamicity with Ease.",
                    "Breaking and Fixing Mobile App Authentication with OAuth2.0-based Protocols.",
                    "Adaptive Proofs Have Straightline Extractors (in the Random Oracle Model).",
                    "More Efficient Construction of Bounded KDM Secure Encryption.",
                    "Signature Schemes with Randomized Verification.",
                    "Trade-Offs for S-Boxes: Cryptographic Properties and Side-Channel Resilience.",
                    "A Practical Chosen Message Power Analysis Approach Against Ciphers with the Key Whitening Layers.",
                    "Side-Channel Attacks Meet Secure Network Protocols.",
                    "Lattice-Based DAPS and Generalizations: Self-enforcement in Signature Schemes.",
                    "Forward-Secure Searchable Encryption on Labeled Bipartite Graphs.",
                    "Bounds in Various Generalized Settings of the Discrete Logarithm Problem.",
                    "An Enhanced Binary Characteristic Set Algorithm and Its Applications to Algebraic Cryptanalysis.",
                    "SCRAPE: Scalable Randomness Attested by Public Entities.",
                    "cMix: Mixing with Minimal Real-Time Asymmetric Cryptographic Operations.",
                    "Almost Optimal Oblivious Transfer from QA-NIZK.",
                    "OnionPIR: Effective Protection of Sensitive Metadata in Online Communication Networks.",
                    "Accountable Storage.",
                    "Maliciously Secure Multi-Client ORAM.",
                    "Legacy-Compliant Data Authentication for Industrial Control System Traffic.",
                    "Multi-client Oblivious RAM Secure Against Malicious Servers."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "14th ACNS 2016",
        "info": "Guildford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2016",
                "sub_name": "Applied Cryptography and Network Security - 14th International Conference, ACNS 2016, Guildford, UK, June 19-22, 2016. Proceedings.",
                "count": 35,
                "papers": [
                    "On the Security of the Algebraic Eraser Tag Authentication Protocol.",
                    "A Cryptographic Analysis of UMTS/LTE AKA.",
                    "Low-Cost Mitigation Against Cold Boot Attacks for an Authentication Token.",
                    "Two More Efficient Variants of the J-PAKE Protocol.",
                    "Hash-Based TPM Signatures for the Quantum World.",
                    "Fuzzy Signatures: Relaxing Requirements and a New Construction.",
                    "Foundations of Fully Dynamic Group Signatures.",
                    "A Lattice-Based Group Signature Scheme with Message-Dependent Opening.",
                    "Threshold-Optimal DSA/ECDSA Signatures and an Application to Bitcoin Wallet Security.",
                    "Legally Fair Contract Signing Without Keystones.",
                    "Why Software DoS Is Hard to Fix: Denying Access in Embedded Android Platforms.",
                    "Network Anomaly Detection Using Unsupervised Feature Selection and Density Peak Clustering.",
                    "More Efficient Constructions for Inner-Product Encryption.",
                    "Attribute Based Encryption with Direct Efficiency Tradeoff.",
                    "Turing Machines with Shortcuts: Efficient Attribute-Based Encryption for Bounded Functions.",
                    "Offline Witness Encryption.",
                    "Deterministic Public-Key Encryption Under Continual Leakage.",
                    "Better Preprocessing for Secure Multiparty Computation.",
                    "Trinocchio: Privacy-Preserving Outsourcing by Distributed Verifiable Computation.",
                    "Verifiable Multi-party Computation with Perfectly Private Audit Trail.",
                    "Practical Fault-Tolerant Data Aggregation.",
                    "Accelerating Homomorphic Computations on Rational Numbers.",
                    "New Techniques for Non-interactive Shuffle and Range Arguments.",
                    "Constrained PRFs for Unbounded Inputs with Short Keys.",
                    "Wide Trail Design Strategy for Binary MixColumns - Enhancing Lower Bound of Number of Active S-boxes.",
                    "Automatic Search of Linear Trails in ARX with Applications to SPECK and Chaskey.",
                    "Square Attack on 7-Round Kiasu-BC.",
                    "On the Design Rationale of Simon Block Cipher: Integral Attacks and Impossible Differential Attacks against Simon Variants.",
                    "Correlation Power Analysis of Lightweight Block Ciphers: From Theory to Practice.",
                    "Assisted Identification of Mode of Operation in Binary Code with Dynamic Data Flow Slicing.",
                    "Parallel Implementation of BDD Enumeration for LWE.",
                    "Memory Carving in Embedded Devices: Separate the Wheat from the Chaff.",
                    "CAPTCHaStar! A Novel CAPTCHA Based on Interactive Shape Discovery.",
                    "TMGuard: A Touch Movement-Based Security Mechanism for Screen Unlock Patterns on Smartphones.",
                    "Gesture-Based Continuous Authentication for Wearable Devices: The Smart Glasses Use Case."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "13th ACNS 2015",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2015",
                "sub_name": "Applied Cryptography and Network Security - 13th International Conference, ACNS 2015, New York, NY, USA, June 2-5, 2015, Revised Selected Papers.",
                "count": 33,
                "papers": [
                    "Universally Verifiable Multiparty Computation from Threshold Homomorphic Cryptosystems.",
                    "Communication-Optimal Proactive Secret Sharing for Dynamic Groups.",
                    "Round-Optimal Password-Based Group Key Exchange Protocols in the Standard Model.",
                    "Generic Construction of UC-Secure Oblivious Transfer.",
                    "Non-malleability Under Selective Opening Attacks: Implication and Separation.",
                    "A Signature Scheme with a Fuzzy Private Key.",
                    "Practical Ciphertext-Policy Attribute-Based Encryption: Traitor Tracing, Revocation, and Large Universe.",
                    "Zero-Knowledge Authenticated Order Queries and Order Statistics on a List.",
                    "Private Database Access with HE-over-ORAM Architecture.",
                    "Accumulable Optimistic Fair Exchange from Verifiably Encrypted Homomorphic Signatures.",
                    "LightCore: Lightweight Collaborative Editing Cloud Services for Sensitive Data.",
                    "Violating Consumer Anonymity: Geo-Locating Nodes in Named Data Networking.",
                    "Post-Quantum Forward-Secure Onion Routing - (Future Anonymity in Today's Budget).",
                    "Scalable Divisible E-cash.",
                    "Recovering Lost Device-Bound Credentials.",
                    "Analysis of Boomerang Differential Trails via a SAT-Based Constraint Solver URSA.",
                    "Time-Memory Trade-Off Attack on the GSM A5/1 Stream Cipher Using Commodity GPGPU - (Extended Abstract).",
                    "Evaluation and Cryptanalysis of the Pandaka Lightweight Cipher.",
                    "Cryptographic Enforcement of Information Flow Policies Without Public Information.",
                    "A Fully Decentralized Data Usage Control Enforcement Infrastructure.",
                    "Oblivion: Mitigating Privacy Leaks by Controlling the Discoverability of Online Information.",
                    "Exploiting Eye Tracking for Smartphone Authentication.",
                    "Optimal Proximity Proofs Revisited.",
                    "Replacement Attacks: Automatically Impeding Behavior-Based Malware Specifications.",
                    "Partial Key Exposure Attacks on CRT-RSA: Better Cryptanalysis to Full Size Encryption Exponents.",
                    "Differential Power Analysis of a McEliece Cryptosystem.",
                    "Arithmetic Addition over Boolean Masking - Towards First- and Second-Order Resistance in Hardware.",
                    "Foundations of Reconfigurable PUFs.",
                    "mrPUF: A Novel Memristive Device Based Physical Unclonable Function.",
                    "On the XOR of Multiple Random Permutations.",
                    "Robust Pseudo-Random Number Generators with Input Secure Against Side-Channel Attacks.",
                    "Leakage-Resilient Cryptography over Large Finite Fields: Theory and Practice.",
                    "Secrecy Without Perfect Randomness: Cryptography with (Bounded) Weak Sources."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "12th ACNS 2014",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2014",
                "sub_name": "Applied Cryptography and Network Security - 12th International Conference, ACNS 2014, Lausanne, Switzerland, June 10-13, 2014. Proceedings.",
                "count": 33,
                "papers": [
                    "New Modular Compilers for Authenticated Key Exchange.",
                    "Password-Based Authenticated Key Exchange without Centralized Trusted Setup.",
                    "A Linear Algebra Attack to Group-Ring-Based Key Exchange Protocols.",
                    "Improved Constructions of PRFs Secure Against Related-Key Attacks.",
                    "Verifiable Multi-server Private Information Retrieval.",
                    "Certified Bitcoins.",
                    "Leakage Resilient Proofs of Ownership in Cloud Storage, Revisited.",
                    "Private Message Transmission Using Disjoint Paths.",
                    "Partial Key Exposure Attacks on Takagi's Variant of RSA.",
                    "New Partial Key Exposure Attacks on CRT-RSA with Large Public Exponents.",
                    "Bit-Flip Faults on Elliptic Curve Base Fields, Revisited.",
                    "All-but-One Dual Projective Hashing and Its Applications.",
                    "Distributed Smooth Projective Hashing and Its Application to Two-Server Password Authenticated Key Exchange.",
                    "Sakura: A Flexible Coding for Tree Hashing.",
                    "Reset Indifferentiability from Weakened Random Oracle Salvages One-Pass Hash Functions.",
                    "Memoryless Unbalanced Meet-in-the-Middle Attacks: Impossible Results and Applications.",
                    "On the (In)Equivalence of Impossible Differential and Zero-Correlation Distinguishers for Feistel- and Skipjack-Type Ciphers.",
                    "Improved Cryptanalysis on Reduced-Round GOST and Whirlpool Hash Function.",
                    "Differential Cryptanalysis and Linear Distinguisher of Full-Round Zorro.",
                    "Detecting Hidden Leakages.",
                    "Improving Intrusion Detection Systems for Wireless Sensor Networks.",
                    "MoTE-ECC: Energy-Scalable Elliptic Curve Cryptography for Wireless Sensor Networks.",
                    "BackRef: Accountability in Anonymous Communication Networks.",
                    "WebTrust - A Comprehensive Authenticity and Integrity Framework for HTTP.",
                    "A Revocable Group Signature Scheme from Identity-Based Revocation Techniques: Achieving Constant-Size Revocation List.",
                    "Faster Batch Verification of Standard ECDSA Signatures Using Summation Polynomials.",
                    "On Updatable Redactable Signatures.",
                    "Practical Signatures from the Partial Fourier Recovery Problem.",
                    "Activity Spoofing and Its Defense in Android Smartphones.",
                    "Polymorphism as a Defense for Automated Attack of Websites.",
                    "Fragmentation Considered Leaking: Port Inference for DNS Poisoning.",
                    "Delegating a Pairing Can Be Both Secure and Efficient.",
                    "Automatic Protocol Selection in Secure Two-Party Computations."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "11th ACNS 2013",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2013",
                "sub_name": "Applied Cryptography and Network Security - 11th International Conference, ACNS 2013, Banff, AB, Canada, June 25-28, 2013. Proceedings.",
                "count": 35,
                "papers": [
                    "Transparent, Distributed, and Replicated Dynamic Provable Data Possession.",
                    "Client-Controlled Cryptography-as-a-Service in the Cloud.",
                    "CloudHKA: A Cryptographic Approach for Hierarchical Access Control in Cloud Computing.",
                    "Computing on Authenticated Data for Adjustable Predicates.",
                    "Towards Efficient Private Distributed Computation on Unbounded Input Streams - (Extended Abstract).",
                    "From Oblivious AES to Efficient and Secure Database Join in the Multiparty Setting.",
                    "Private Database Queries Using Somewhat Homomorphic Encryption.",
                    "BLAKE2: Simpler, Smaller, Fast as MD5.",
                    "Cryptophia's Short Combiner for Collision-Resistant Hash Functions.",
                    "Generic Attacks for the Xor of k Random Permutations.",
                    "Preimage Attacks on Feistel-SP Functions: Impact of Omitting the Last Network Twist.",
                    "Constructing Practical Signcryption KEM from Standard Assumptions without Random Oracles.",
                    "Sequential Aggregate Signatures Made Shorter.",
                    "How to Share a Lattice Trapdoor: Threshold Protocols for Signatures and (H)IBE.",
                    "Toward Practical Group Encryption.",
                    "Experimental Analysis of Attacks on Next Generation Air Traffic Communication.",
                    "Launching Generic Attacks on iOS with Approved Third-Party Applications.",
                    "Hardware Architectures for MSP430-Based Wireless Sensor Nodes Performing Elliptic Curve Cryptography.",
                    "Beyond Full Disk Encryption: Protection on Security-Enhanced Commodity Processors.",
                    "NEON Implementation of an Attribute-Based Encryption Scheme.",
                    "Fast and Maliciously Secure Two-Party Computation Using the GPU.",
                    "Comparing the Pairing Efficiency over Composite-Order and Prime-Order Elliptic Curves.",
                    "FROST - Forensic Recovery of Scrambled Telephones.",
                    "Attacking Atmel's CryptoMemory EEPROM with Special-Purpose Hardware.",
                    "Keystroke Timing Analysis of on-the-fly Web Apps.",
                    "Terrorism in Distance Bounding: Modeling Terrorist-Fraud Resistance.",
                    "CrowdShare: Secure Mobile Resource Sharing.",
                    "Remotegrity: Design and Use of an End-to-End Verifiable Remote Voting System.",
                    "Exposure-Resilient One-Round Tripartite Key Exchange without Random Oracles.",
                    "Public Key Exchange Using Semidirect Product of (Semi)Groups.",
                    "Leakage Resilient IBE and IPE under the DLIN Assumption.",
                    "Batch Proofs of Partial Knowledge.",
                    "Efficient Signatures of Knowledge and DAA in the Standard Model.",
                    "Analysis and Improvement of Lindell's UC-Secure Commitment Schemes.",
                    "Primeless Factoring-Based Cryptography - -Solving the Complexity Bottleneck of Public-Key Generation-."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "10th ACNS 2012",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2012",
                "sub_name": "Applied Cryptography and Network Security - 10th International Conference, ACNS 2012, Singapore, June 26-29, 2012. Proceedings.",
                "count": 33,
                "papers": [
                    "Security Analysis of a Multi-factor Authenticated Key Exchange Protocol.",
                    "Breaking an Animated CAPTCHA Scheme.",
                    "Contextual OTP: Mitigating Emerging Man-in-the-Middle Attacks with Wireless Hardware Tokens.",
                    "RIKE: Using Revocable Identities to Support Key Escrow in PKIs.",
                    "TreVisor - OS-Independent Software-Based Full Disk Encryption Secure against Main Memory Attacks.",
                    "Authenticated Encryption: How Reordering Can Impact Performance.",
                    "Length-Doubling Ciphers and Tweakable Ciphers.",
                    "Extending Higher-Order Integral: An Efficient Unified Algorithm of Constructing Integral Distinguishers for Block Ciphers.",
                    "Security Enhancements by OR-Proof in Identity-Based Identification.",
                    "Identity-Based Extractable Hash Proofs and Their Applications.",
                    "On Structural Signatures for Tree Data Structures.",
                    "Inner-Product Lossy Trapdoor Functions and Applications.",
                    "On the Joint Security of Signature and Encryption Schemes under Randomness Reuse: Efficiency and Security Amplification.",
                    "Secure Accumulators from Euclidean Rings without Trusted Setup.",
                    "Linear Fault Analysis of Block Ciphers.",
                    "Cryptanalysis of 256-Bit Key HyRAL via Equivalent Keys.",
                    "Distinguishers beyond Three Rounds of the RIPEMD-128/-160 Compression Functions.",
                    "Zero-Value Point Attacks on Kummer-Based Cryptosystem.",
                    "PICARO - A Block Cipher Allowing Efficient Higher-Order Side-Channel Resistance.",
                    "Wide Collisions in Practice.",
                    "A General Construction for 1-Round δ-RMT and (0, δ)-SMT.",
                    "A Prefiltering Approach to Regular Expression Matching for Network Security Systems.",
                    "iHTTP: Efficient Authentication of Non-confidential HTTP Traffic.",
                    "ARC: Protecting against HTTP Parameter Pollution Attacks Using Application Request Caches.",
                    "Tracking the Trackers: Fast and Scalable Dynamic Analysis of Web Content for Privacy Violations.",
                    "The Shy Mayor: Private Badges in GeoSocial Networks.",
                    "Detecting Social Spam Campaigns on Twitter.",
                    "A New Framework for Privacy of RFID Path Authentication.",
                    "GHB #: A Provably Secure HB-Like Lightweight Authentication Protocol.",
                    "Knox: Privacy-Preserving Auditing for Shared Data with Large Groups in the Cloud.",
                    "SPICE - Simple Privacy-Preserving Identity-Management for Cloud Environment.",
                    "A Practical Smart Metering System Supporting Privacy Preserving Billing and Load Monitoring.",
                    "Private Computation of Spatial and Temporal Power Consumption with Smart Meters."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "9th ACNS 2011",
        "info": "Nerja, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2011",
                "sub_name": "Applied Cryptography and Network Security - 9th International Conference, ACNS 2011, Nerja, Spain, June 7-10, 2011. Proceedings.",
                "count": 31,
                "papers": [
                    "Inferring Protocol State Machine from Network Traces: A Probabilistic Approach.",
                    "A Specification Based Intrusion Detection Framework for Mobile Phones.",
                    "Misuse Detection in Consent-Based Networks.",
                    "Cold Boot Key Recovery by Solving Polynomial Systems with Noise.",
                    "Exponent Blinding Does Not Always Lift (Partial) Spa Resistance to Higher-Level Security.",
                    "Cryptanalysis of the Atmel Cipher in SecureMemory, CryptoMemory and CryptoRF.",
                    "Cache Timing Analysis of RC4.",
                    "Secure Efficient Multiparty Computing of Multivariate Polynomials and Applications.",
                    "Private Discovery of Common Social Contacts.",
                    "Sanitizable Signatures in XML Signature - Performance, Mixing Properties, and Revisiting the Property of Transparency.",
                    "Double-Trapdoor Anonymous Tags for Traceable Signatures.",
                    "Hierarchical Identity-Based Chameleon Hash and Its Applications.",
                    "Efficient Generic Constructions of Signcryption with Insider Security in the Multi-user Setting.",
                    "Quantitatively Analyzing Stealthy Communication Channels.",
                    "Fully Non-interactive Onion Routing with Forward-Secrecy.",
                    "Generic Fully Simulatable Adaptive Oblivious Transfer.",
                    "Simple and Efficient Single Round almost Perfectly Secure Message Transmission Tolerating Generalized Adversary.",
                    "Relaxed Security Notions for Signatures of Knowledge.",
                    "LBlock: A Lightweight Block Cipher.",
                    "On Hiding a Plaintext Length by Preencryption.",
                    "Fighting Pirates 2.0.",
                    "Security Notions for Broadcast Encryption.",
                    "Towards User-Friendly Credential Transfer on Open Credential Platforms.",
                    "Non-transferable User Certification Secure against Authority Information Leaks and Impersonation Attacks.",
                    "Composable Security Analysis of OS Services.",
                    "Practical Attacks on the Maelstrom-0 Compression Function.",
                    "Linear Analysis of Reduced-Round CubeHash.",
                    "On the Indifferentiability of Fugue and Luffa.",
                    "Analysis of Message Injection in Stream Cipher-Based Hash Functions.",
                    "Secure Authenticated Comparisons.",
                    "Public-Key Encryption with Delegated Search."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "8th ACNS 2010",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2010",
                "sub_name": "Applied Cryptography and Network Security, 8th International Conference, ACNS 2010, Beijing, China, June 22-25, 2010. Proceedings.",
                "count": 32,
                "papers": [
                    "On the Broadcast and Validity-Checking Security of pkcs#1 v1.5 Encryption.",
                    "How to Construct Interval Encryption from Binary Tree Encryption.",
                    "Shrinking the Keys of Discrete-Log-Type Lossy Trapdoor Functions.",
                    "Trapdoor Sanitizable Signatures Made Easy.",
                    "Generic Constructions for Verifiably Encrypted Signatures without Random Oracles or NIZKs.",
                    "Redactable Signatures for Tree-Structured Data: Definitions and Constructions.",
                    "Impossible Differential Cryptanalysis on Feistel Ciphers with SP and SPS Round Functions.",
                    "Multi-trail Statistical Saturation Attacks.",
                    "Multiset Collision Attacks on Reduced-Round SNOW 3G and SNOW 3G (+) .",
                    "High Performance GHASH Function for Long Messages.",
                    "Principles on the Security of AES against First and Second-Order Differential Power Analysis.",
                    "Adaptive Chosen-Message Side-Channel Attacks.",
                    "Secure Multiplicative Masking of Power Functions.",
                    "Batch Groth-Sahai.",
                    "Efficient and Secure Evaluation of Multivariate Polynomials and Applications.",
                    "Efficient Implementation of the Orlandi Protocol.",
                    "Improving the Round Complexity of Traitor Tracing Schemes.",
                    "Password Based Key Exchange Protocols on Elliptic Curves Which Conceal the Public Parameters.",
                    "Okamoto-Tanaka Revisited: Fully Authenticated Diffie-Hellman with Minimal Overhead.",
                    "Deniable Internet Key Exchange.",
                    "A New Human Identification Protocol and Coppersmith's Baby-Step Giant-Step Algorithm.",
                    "Secure Sketch for Multiple Secrets.",
                    "A Message Recognition Protocol Based on Standard Assumptions.",
                    "Affiliation-Hiding Key Exchange with Untrusted Group Authorities.",
                    "Privacy-Preserving Group Discovery with Linear Complexity.",
                    "Two New Efficient PIR-Writing Protocols.",
                    "Regulatory Compliant Oblivious RAM.",
                    "Revisiting Unpredictability-Based RFID Privacy Models.",
                    "On RFID Privacy with Mutual Authentication and Tag Corruption.",
                    "Social Network-Based Botnet Command-and-Control: Emerging Threats and Countermeasures.",
                    "COP: A Step toward Children Online Privacy.",
                    "A Hybrid Method to Detect Deflation Fraud in Cost-Per-Action Online Advertising."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "7th ACNS 2009",
        "info": "Paris-Rocquencourt, France",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2009",
                "sub_name": "Applied Cryptography and Network Security, 7th International Conference, ACNS 2009, Paris-Rocquencourt, France, June 2-5, 2009. Proceedings.",
                "count": 32,
                "papers": [
                    "Group Key Exchange Enabling On-Demand Derivation of Peer-to-Peer Keys.",
                    "Session-state Reveal Is Stronger Than Ephemeral Key Reveal: Attacking the NAXOS Authenticated Key Exchange Protocol.",
                    "Secure Pairing of \"Interface-Constrained\" Devices Resistant against Rushing User Behavior.",
                    "How to Extract and Expand Randomness: A Summary and Explanation of Existing Results.",
                    "Novel Precomputation Schemes for Elliptic Curve Cryptosystems.",
                    "Practical Secure Evaluation of Semi-private Functions.",
                    "Secure Hamming Distance Based Computation and Its Applications.",
                    "Efficient Robust Private Set Intersection.",
                    "A New Variant of the Cramer-Shoup KEM Secure against Chosen Ciphertext Attack.",
                    "An Efficient Identity-Based Online/Offline Encryption Scheme.",
                    "Dual-Policy Attribute Based Encryption.",
                    "Construction of Threshold Public-Key Encryptions through Tag-Based Encryptions.",
                    "Malyzer: Defeating Anti-detection for Application-Level Malware Analysis.",
                    "A New Message Recognition Protocol with Self-recoverability for Ad Hoc Pervasive Networks.",
                    "Breaking Two k-Resilient Traitor Tracing Schemes with Sublinear Ciphertext Size.",
                    "Tracing and Revoking Pirate Rebroadcasts.",
                    "Efficient Deniable Authentication for Signatures.",
                    "Homomorphic MACs: MAC-Based Integrity for Network Coding.",
                    "Algorithmic Tamper Proof (ATP) Counter Units for Authentication Devices Using PIN.",
                    "Performance Measurements of Tor Hidden Services in Low-Bandwidth Access Networks.",
                    "Cryptanalysis of Twister.",
                    "Cryptanalysis of CubeHash.",
                    "Collision Attack on Boole.",
                    "Integrity Protection for Revision Control.",
                    "Fragility of the Robust Security Network: 802.11 Denial of Service.",
                    "Fast Packet Classification Using Condition Factorization.",
                    "Choosing NTRUEncrypt Parameters in Light of Combined Lattice Reduction and MITM Approaches.",
                    "Broadcast Attacks against Lattice-Based Cryptosystems.",
                    "Partial Key Exposure Attack on CRT-RSA.",
                    "How to Compare Profiled Side-Channel Attacks?.",
                    "Theoretical and Practical Aspects of Mutual Information Based Side Channel Analysis.",
                    "Attacking ECDSA-Enabled RFID Devices."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "6th ACNS 2008",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2008",
                "sub_name": "Applied Cryptography and Network Security, 6th International Conference, ACNS 2008, New York, NY, USA, June 3-6, 2008. Proceedings.",
                "count": 30,
                "papers": [
                    "On the Effectiveness of Internal Patching Against File-Sharing Worms.",
                    "Peeking Through the Cloud: DNS-Based Estimation and Its Applications.",
                    "Pushback for Overlay Networks: Protecting Against Malicious Insiders.",
                    "PPAA: Peer-to-Peer Anonymous Authentication.",
                    "Generic Constructions of Stateful Public Key Encryption and Their Applications.",
                    "Traceable and Retrievable Identity-Based Encryption.",
                    "Attribute-Based Encryption with Partially Hidden Encryptor-Specified Access Structures.",
                    "Attacking Reduced Round SHA-256.",
                    "Dakota- Hashing from a Combination of Modular Arithmetic and Symmetric Cryptography.",
                    "Getting the Best Out of Existing Hash Functions; or What if We Are Stuck with SHA?.",
                    "Replay Attack in a Fair Exchange Protocol.",
                    "Improved Conditional E-Payments.",
                    "Anonymity in Transferable E-cash.",
                    "Generic Security-Amplifying Methods of Ordinary Digital Signatures.",
                    "New Differential-Algebraic Attacks and Reparametrization of Rainbow.",
                    "TrapdoorSanitizable Signatures and Their Application to Content Protection.",
                    "Multi-factor Authenticated Key Exchange.",
                    "Repelling Detour Attack Against Onions with Re-encryption.",
                    "Analysis of EAP-GPSK Authentication Protocol.",
                    "Efficient Device Pairing Using \"Human-Comparable\" Synchronized Audiovisual Patterns.",
                    "PUF-HB: A Tamper-Resilient HB Based Authentication Protocol.",
                    "An Authentication Scheme Based on the Twisted Conjugacy Problem.",
                    "Restricted Queries over an Encrypted Index with Applications to Regulatory Compliance.",
                    "A Practical and Efficient Tree-List Structure for Public-Key Certificate Validation.",
                    "On the Security of the CCM Encryption Mode and of a Slight Variant.",
                    "wNAF*, an Efficient Left-to-Right Signed Digit Recoding Algorithm.",
                    "A Very Compact \"Perfectly Masked\" S-Box for AES.",
                    "Steel, Cast Iron and Concrete: Security Engineering for Real World Wireless Sensor Networks.",
                    "Traceable Privacy of Recent Provably-Secure RFID Protocols.",
                    "The Security of EPC Gen2 Compliant RFID Protocols."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "5th ACNS 2007",
        "info": "Zhuhai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2007",
                "sub_name": "Applied Cryptography and Network Security, 5th International Conference, ACNS 2007, Zhuhai, China, June 5-8, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "Generic Transformation to Strongly Unforgeable Signatures.",
                    "Efficient Generic On-Line/Off-Line Signatures Without Key Exposure.",
                    "Merkle Signatures with Virtually Unlimited Signature Capacity.",
                    "Midpoints Versus Endpoints: From Protocols to Firewalls.",
                    "An Adversary Aware and Intrusion Detection Aware Attack Model Ranking Scheme.",
                    "Analyzing an Electronic Cash Protocol Using Applied Pi Calculus.",
                    "Cryptanalysis of the TRMC-4 Public Key Cryptosystem.",
                    "Estimating the Prime-Factors of an RSA Modulus and an Extension of the Wiener Attack.",
                    "A Timing Attack on Blakley's Modular Multiplication Algorithm, and Applications to DSA.",
                    "Protecting AES Software Implementations on 32-Bit Processors Against Power Analysis.",
                    "Constant-Round Authenticated Group Key Exchange with Logarithmic Computation Complexity.",
                    "Preventing Collusion Attacks on the One-Way Function Tree (OFT) Scheme.",
                    "Bayesian Methods for Practical Traitor Tracing.",
                    "A New Protocol for Conditional Disclosure of Secrets and Its Applications.",
                    "An Unconditionally Secure Protocol for Multi-Party Set Intersection.",
                    "Privacy-Preserving Set Union.",
                    "Universal Accumulators with Efficient Nonmembership Proofs.",
                    "Unlinkable Secret Handshakes and Key-Private Group Key Management Schemes.",
                    "Identity-Based Proxy Re-encryption.",
                    "A More Natural Way to Construct Identity-Based Identification Schemes.",
                    "Tweaking TBE/IBE to PKE Transforms with Chameleon Hash Functions.",
                    "Certified E-Mail Protocol in the ID-Based Setting.",
                    "Efficient Content Authentication in Peer-to-Peer Networks.",
                    "An Identity-Based Signcryption Scheme for Multi-domain Ad Hoc Networks.",
                    "Efficient Self-healing Key Distribution with Revocation for Wireless Sensor Networks Using One Way Key Chains.",
                    "BAP: Broadcast Authentication Using Cryptographic Puzzles.",
                    "Compressed XTR.",
                    "Sliding Window Method for NTRU.",
                    "Efficient Certificateless Signature Schemes.",
                    "Security Mediated Certificateless Signatures.",
                    "Gradually Convertible Undeniable Signatures."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "4th ACNS 2006",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2006",
                "sub_name": "Applied Cryptography and Network Security, 4th International Conference, ACNS 2006, Singapore, June 6-9, 2006, Proceedings.",
                "count": 33,
                "papers": [
                    "Adaptive Detection of Local Scanners.",
                    "Probabilistic Proof of an Algorithm to Compute TCP Packet Round-Trip Time for Intrusion Detection.",
                    "DSO: Dependable Signing Overlay.",
                    "Do Broken Hash Functions Affect the Security of Time-Stamping Schemes?",
                    "A Handy Multi-coupon System.",
                    "An Efficient Single-Key Pirates Tracing Scheme Using Cover-Free Families.",
                    "Efficient Memory Bound Puzzles Using Pattern Databases.",
                    "Effect of Malicious Synchronization.",
                    "Misusing Unstructured P2P Systems to Perform DoS Attacks: The Network That Never Forgets.",
                    "Password Based Server Aided Key Exchange .",
                    "Secure Password-Based Authenticated Group Key Agreement for Data-Sharing Peer-to-Peer Networks.",
                    "Stateful Subset Cover.",
                    "The Rainbow Attack on Stream Ciphers Based on Maiorana-McFarland Functions.",
                    "Breaking a New Instance of TTM Cryptosystems.",
                    "Cryptanalysis of the N-Party Encrypted Diffie-Hellman Key Exchange Using Different Passwords.",
                    "An AES Smart Card Implementation Resistant to Power Analysis Attacks.",
                    "Physical Security Bounds Against Tampering.",
                    "Flexible Exponentiation with Resistance to Side Channel Attacks.",
                    "An Improved Poly1305 MAC.",
                    "Certificateless Public-Key Signature: Security Model and Efficient Construction.",
                    "High Diffusion Cipher: Encryption and Error Correction in a Single Cryptographic Primitive.",
                    "Authentication for Paranoids: Multi-party Secret Handshakes.",
                    "On the Security of the Authentication Module of Chinese WLAN Standard Implementation Plan.",
                    "W3Bcrypt: Encryption as a Stylesheet.",
                    "Combinatorial Structures for Design of Wireless Sensor Networks.",
                    "Public Key Cryptography Sans Certificates in Ad Hoc Networks.",
                    "Location-Aware Key Management Using Multi-layer Grids for Wireless Sensor Networks.",
                    "A General Methodology for Pipelining the Point Multiplication Operation in Curve Based Cryptography.",
                    "Results on Almost Resilient Functions.",
                    "Real Perfect Contrast Visual Secret Sharing Schemes with Reversing.",
                    "On Optimizing the Security-Throughput Trade-Off in Wireless Networks with Adversaries.",
                    "Improving the Randomized Initial Point Countermeasure Against DPA.",
                    "Syntax-Driven Private Evaluation of Quantified Membership Queries."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "3rd ACNS 2005",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2005",
                "sub_name": "Applied Cryptography and Network Security, Third International Conference, ACNS 2005, New York, NY, USA, June 7-10, 2005, Proceedings.",
                "count": 35,
                "papers": [
                    "Two-Server Password-Only Authenticated Key Exchange.",
                    "Strengthening Password-Based Authentication Protocols Against Online Dictionary Attacks.",
                    "Cryptanalysis of an Improved Client-to-Client Password-Authenticated Key Exchange (C2C-PAKE) Scheme.",
                    "Efficient Security Mechanisms for Overlay Multicast-Based Content Distribution.",
                    "A Traitor Tracing Scheme Based on RSA for Fast Decryption.",
                    "N-Party Encrypted Diffie-Hellman Key Exchange Using Different Passwords.",
                    "Messin' with Texas Deriving Mother's Maiden Names Using Public Records.",
                    "Mitigating Network Denial-of-Service Through Diversity-Based Traffic Management.",
                    "Searching for High-Value Rare Events with Uncheatable Grid Computing.",
                    "Digital Signatures Do Not Guarantee Exclusive Ownership.",
                    "Thompson's Group and Public Key Cryptography.",
                    "Rainbow, a New Multivariable Polynomial Signature Scheme.",
                    "Badger - A Fast and Provably Secure MAC.",
                    "IDS False Alarm Reduction Using Continuous and Discontinuous Patterns.",
                    "Indexing Information for Data Forensics.",
                    "Model Generalization and Its Implications on Intrusion Detection.",
                    "Intrusion-Resilient Secure Channels.",
                    "Optimal Asymmetric Encryption and Signature Paddings.",
                    "Efficient and Leakage-Resilient Authenticated Key Transport Protocol Based on RSA.",
                    "Identity Based Encryption Without Redundancy.",
                    "OACerts: Oblivious Attribute Certificates.",
                    "Dynamic k-Times Anonymous Authentication.",
                    "Efficient Anonymous Roaming and Its Security Analysis.",
                    "Quantifying Security in Hybrid Cellular Networks.",
                    "Off-Line Karma: A Decentralized Currency for Peer-to-peer and Grid Applications.",
                    "Building Reliable Mix Networks with Fair Exchange.",
                    "SCARE of the DES.",
                    "Robust Key Extraction from Physical Uncloneable Functions.",
                    "Efficient Constructions for One-Way Hash Chains.",
                    "Privacy Preserving Keyword Searches on Remote Encrypted Data.",
                    "An Efficient Solution to the Millionaires' Problem Based on Homomorphic Encryption.",
                    "Non-interactive Zero-Knowledge Arguments for Voting.",
                    "Short Signature and Universal Designated Verifier Signature Without Random Oracles.",
                    "Efficient Identity Based Ring Signature.",
                    "New Signature Schemes with Coupons and Tight Reduction."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "2nd ACNS 2004",
        "info": "Yellow Mountain, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2004",
                "sub_name": "Applied Cryptography and Network Security, Second International Conference, ACNS 2004, Yellow Mountain, China, June 8-11, 2004, Proceedings.",
                "count": 36,
                "papers": [
                    "CamouflageFS: Increasing the Effective Key Length in Cryptographic Filesystems on the Cheap.",
                    "Private Keyword-Based Push and Pull with Applications to Anonymous Communication.",
                    "Secure Conjunctive Keyword Search over Encrypted Data.",
                    "Evaluating Security of Voting Schemes in the Universal Composability Framework.",
                    "Verifiable Shuffles: A Formal Model and a Paillier-Based Efficient Construction with Provable Security.",
                    "On the Security of Cryptosystems with All-or-Nothing Transform.",
                    "Centralized Management of Virtual Security Zones in IP Networks.",
                    "S-RIP: A Secure Distance Vector Routing Protocol.",
                    "A Pay-per-Use DoS Protection Mechanism for the Web.",
                    "Limited Verifier Signature from Bilinear Pairings.",
                    "Deniable Ring Authentication Revisited.",
                    "A Fully-Functional Group Signature Scheme over Only Known-Order Group.",
                    "Some Observations on Zap and Its Applications.",
                    "Security Measurements of Steganographic Systems.",
                    "X2Rep: Enhanced Trust Semantics for the XRep Protocol.",
                    "One-Round Protocols for Two-Party Authenticated Key Exchange.",
                    "Password Authenticated Key Exchange Using Quadratic Residues.",
                    "Key Agreement Using Statically Keyed Authenticators.",
                    "Low-Latency Cryptographic Protection for SCADA Communications.",
                    "A Best Practice for Root CA Key Update in PKI.",
                    "SQLrand: Preventing SQL Injection Attacks.",
                    "Cryptanalysis of a Knapsack Based Two-Lock Cryptosystem.",
                    "Success Probability in Chi2-Attacks.",
                    "More Generalized Clock-Controlled Alternating Step Generator.",
                    "FDLKH: Fully Decentralized Key Management Scheme on Logical Key Hierarchy.",
                    "Unconditionally Non-interactive Verifiable Secret Sharing Secure against Faulty Majorities in the Commodity Based Model.",
                    "Cryptanalysis of Two Anonymous Buyer-Seller Watermarking Protocols and an Improvement for True Anonymity.",
                    "Security Analysis of CRT-Based Cryptosystems.",
                    "Cryptanalysis of the Countermeasures Using Randomized Binary Signed Digits.",
                    "Weaknesses of a Password-Authenticated Key Exchange Protocol between Clients with Different Passwords.",
                    "Advanced Packet Marking Mechanism with Pushback for IP Traceback.",
                    "A Parallel Intrusion Detection System for High-Speed Networks.",
                    "A Novel Framework for Alert Correlation and Understanding.",
                    "An Improved Algorithm for uP + vQ Using JSF13.",
                    "New Table Look-Up Methods for Faster Frobenius Map Based Scalar Multiplication Over GF(pn).",
                    "Batch Verification for Equality of Discrete Logarithms and Threshold Decryptions."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "1st ACNS 2003",
        "info": "Kunming, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acns/2003",
                "sub_name": "Applied Cryptography and Network Security, First International Conference, ACNS 2003. Kunming, China, October 16-19, 2003, Proceedings.",
                "count": 32,
                "papers": [
                    "Multi-party Computation from Any Linear Secret Sharing Scheme Unconditionally Secure against Adaptive Adversary: The Zero-Error Case.",
                    "Optimized Chi2-Attack against RC6.",
                    "Anonymity-Enhanced Pseudonym System.",
                    "Using Feedback to Improve Masquerade Detection.",
                    "Efficient Presentation of Multivariate Audit Data for Intrusion Detection of Web-Based Internet Services.",
                    "An IP Traceback Scheme Integrating DPM and PPM.",
                    "Improved Scalable Hash Chain Traversal.",
                    "Round Optimal Distributed Key Generation of Threshold Cryptosystem Based on Discrete Logarithm Problem.",
                    "On the Security of Two Threshold Signature Schemes with Traceable Signers.",
                    "Proxy and Threshold One-Time Signatures.",
                    "A Threshold GQ Signature Scheme.",
                    "Generalized Key-Evolving Signature Schemes or How to Foil an Armed Adversary.",
                    "A Ring Signature Scheme Based on the Nyberg-Rueppel Signature Scheme.",
                    "Modelling and Evaluating Trust Relationships in Mobile Agents Based Systems.",
                    "An Authorization Model for E-consent Requirement in a Health Care Application.",
                    "PLI: A New Framework to Protect Digital Content for P2P Networks.",
                    "Improved Algebraic Traitor Tracing Scheme.",
                    "Common Vulnerability Markup Language.",
                    "Trust on Web Browser: Attack vs. Defense.",
                    "Security Protocols for Biometrics-Based Cardholder Authentication in Smartcards.",
                    "Does It Need Trusted Third Party? Design of Buyer-Seller Watermarking Protocol without Trusted Third Party.",
                    "Using OCSP to Secure Certificate-Using Transactions in M-commerce.",
                    "Differential Fault Analysis on A.E.S.",
                    "Side-Channel Attack on Substitution Blocks.",
                    "Timing Attack against Implementation of a Parallel Algorithm for Modular Exponentiation.",
                    "A Fast Correlation Attack for LFSR-Based Stream Ciphers.",
                    "Making the Key Agreement Protocol in Mobile ad hoc Network More Efficient.",
                    "An Efficient Tree-Based Group Key Agreement Using Bilinear Map.",
                    "A Key Recovery Mechanism for Reliable Group Key Management.",
                    "Efficient Software Implementation of LFSR and Boolean Function and Its Application in Nonlinear Combiner Model.",
                    "Efficient Distributed Signcryption Scheme as Group Signcryption.",
                    "Architectural Enhancements for Montgomery Multiplication on Embedded RISC Processors."
                ]
            }
        ]
    }
]