[
    {
        "year": "2021",
        "name": "37th ACSAC 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2021",
                "sub_name": "ACSAC '21: Annual Computer Security Applications Conference, Virtual Event, USA, December 6 - 10, 2021.",
                "count": 80,
                "papers": [
                    "Stealing Machine Learning Models: Attacks and Countermeasures for Generative Adversarial Networks.",
                    "The Many-faced God: Attacking Face Verification System with Embedding and Image Recovery.",
                    "Two Souls in an Adversarial Image: Towards Universal Adversarial Example Detection using Multi-view Inconsistency.",
                    "Efficient, Private and Robust Federated Learning.",
                    "Morphence: Moving Target Defense Against Adversarial Examples.",
                    "Heterogeneous-PAKE: Bridging the Gap between PAKE Protocols and Their Real-World Deployment.",
                    "A formal analysis of IKEv2's post-quantum extension.",
                    "Optimized Paillier's Cryptosystem with Fast Encryption and Decryption.",
                    "Towards Practical Post-quantum Signatures for Resource-Limited Internet of Things.",
                    "VASA: Vector AES Instructions for Security Applications.",
                    "Program Obfuscation via ABI Debiasing.",
                    "A Look Back on a Function Identification Problem.",
                    "SoftMark: Software Watermarking via a Binary Function Relocation.",
                    "Dynamic Taint Analysis versus Obfuscated Self-Checking.",
                    "Dicos: Discovering Insecure Code Snippets from Stack Overflow Posts by Leveraging User Discussions.",
                    "ARID: Anonymous Remote IDentification of Unmanned Aerial Vehicles.",
                    "Sipster: Settling IOU Privately and Quickly with Smart Meters.",
                    "TEEKAP: Self-Expiring Data Capsule using Trusted Execution Environment.",
                    "BAPM: Block Attention Profiling Model for Multi-tab Website Fingerprinting Attacks on Tor.",
                    "Try before You Buy: Privacy-preserving Data Evaluation on Cloud-based Machine Learning Data Marketplace.",
                    "VIA: Analyzing Device Interfaces of Protected Virtual Machines.",
                    "Rocky: Replicating Block Devices for Tamper and Failure Resistant Edge-based Virtualized Desktop Infrastructure.",
                    "On Detecting Growing-Up Behaviors of Malicious Accounts in Privacy-Centric Mobile Social Networks.",
                    "ReCFA: Resilient Control-Flow Attestation.",
                    "Practical Attestation for Edge Devices Running Compute Heavy Machine Learning Applications.",
                    "Is Visualization Enough? Evaluating the Efficacy of MUD-Visualizer in Enabling Ease of Deployment for Manufacturer Usage Description (MUD).",
                    "A Cross-role and Bi-national Analysis on Security Efforts and Constraints of Software Development Projects.",
                    "An Efficient Man-Machine Recognition Method Based On Mouse Trajectory Feature De-redundancy.",
                    "OPay: an Orientation-based Contactless Payment Solution Against Passive Attacks.",
                    "What's in a Cyber Threat Intelligence sharing platform?: A mixed-methods user experience investigation of MISP.",
                    "They See Me Rollin': Inherent Vulnerability of the Rolling Shutter in CMOS Image Sensors.",
                    "Evaluating the Effectiveness of Protection Jamming Devices in Mitigating Smart Speaker Eavesdropping Attacks Using Gaussian White Noise.",
                    "S2-CAN: Sufficiently Secure Controller Area Network.",
                    "Crypto-Chain: A Relay Resilience Framework for Smart Vehicles.",
                    "Advanced System Resiliency Based on Virtualization Techniques for IoT Devices.",
                    "Global Feature Analysis and Comparative Evaluation of Freestyle In-Air-Handwriting Passcode for User Authentication.",
                    "2D-2FA: A New Dimension in Two-Factor Authentication.",
                    "Group Time-based One-time Passwords and its Application to Efficient Privacy-Preserving Proof of Location.",
                    "Digit Semantics based Optimization for Practical Password Cracking Tools.",
                    "Systematization of Password ManagerUse Cases and Design Paradigms.",
                    "Eluding ML-based Adblockers With Actionable Adversarial Examples.",
                    "BadNL: Backdoor Attacks against NLP Models with Semantic-preserving Improvements.",
                    "MISA: Online Defense of Trojaned Models using Misattributions.",
                    "Detecting Audio Adversarial Examples with Logit Noising.",
                    "Can We Leverage Predictive Uncertainty to Detect Dataset Shift and Adversarial Examples in Android Malware Detection?",
                    "TLB Poisoning Attacks on AMD Secure Encrypted Virtualization.",
                    "Reinhardt: Real-time Reconfigurable Hardware Architecture for Regular Expression Matching in DPI.",
                    "Understanding the Threats of Trojaned Quantized Neural Network in Model Supply Chains.",
                    "FlexFilt: Towards Flexible Instruction Filtering for Security.",
                    "RingRAM: A Unified Hardware SecurityPrimitive for IoT Devices that Gets Better with Age.",
                    "SODA: A System for Cyber Deception Orchestration and Automation.",
                    "Reproducible and Adaptable Log Data Generation for Sound Cybersecurity Experiments.",
                    "Obfuscation Revealed: Leveraging Electromagnetic Signals for Obfuscated Malware Classification.",
                    "CommanderGabble: A Universal Attack Against ASR Systems Leveraging Fast Speech.",
                    "Physical Logic Bombs in 3D Printers via Emerging 4D Techniques.",
                    "SolSaviour: A Defending Framework for Deployed Defective Smart Contracts.",
                    "Improving Streaming Cryptocurrency Transaction Classification via Biased Sampling and Graph Feedback.",
                    "Mitosis: Practically Scaling Permissioned Blockchains.",
                    "An Exploration of ARM System-Level Cache and GPU Side Channels.",
                    "LaserShark: Establishing Fast, Bidirectional Communication into Air-Gapped Systems.",
                    "Rupair: Towards Automatic Buffer Overflow Detection and Rectification for Rust.",
                    "Keeping Safe Rust Safe with Galeed.",
                    "DistAppGaurd: Distributed Application Behaviour Profiling in Cloud-Based Environment.",
                    "ICS3Fuzzer: A Framework for Discovering Protocol Implementation Bugs in ICS Supervisory Software by Fuzzing.",
                    "argXtract: Deriving IoT Security Configurations via Automated Static Analysis of Stripped ARM Cortex-M Binaries.",
                    "On Key Reinstallation Attacks over 4G LTE Control-Plane: Feasibility and Negative Impact.",
                    "Security of Multicarrier Time-of-Flight Ranging.",
                    "Don't hand it Over: Vulnerabilities in the Handover Procedure of Cellular Telecommunications.",
                    "Time to Rethink the Design of Qi Standard? Security and Privacy Vulnerability Analysis of Qi Wireless Charging.",
                    "Detecting and Characterizing SMS Spearphishing Attacks.",
                    "Characterizing Improper Input Validation Vulnerabilities of Mobile Crowdsourcing Services.",
                    "Towards Stalkerware Detection with Precise Warnings.",
                    "Repack Me If You Can: An Anti-Repackaging Solution Based on Android Virtualization.",
                    "Westworld: Fuzzing-Assisted Remote Dynamic Symbolic Execution of Smart Apps on IoT Cloud Platforms.",
                    "The Emperor's New Autofill Framework: A Security Analysis of Autofill on iOS and Android.",
                    "FINN: Fingerprinting Network Flows using Neural Networks.",
                    "MAppGraph: Mobile-App Classification on Encrypted Network Traffic using Deep Graph Convolution Neural Networks.",
                    "SMap: Internet-wide Scanning for Spoofing.",
                    "MineHunter: A Practical Cryptomining Traffic Detection Algorithm Based on Time Series Tracking.",
                    "Platform-Oblivious Anti-Spam Gateway."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "36th ACSAC 2020",
        "info": "Virtual Event / Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2020",
                "sub_name": "ACSAC '20: Annual Computer Security Applications Conference, Virtual Event / Austin, TX, USA, 7-11 December, 2020.",
                "count": 70,
                "papers": [
                    "The Tangled Genealogy of IoT Malware.",
                    "Spotlight: Malware Lead Generation at Scale.",
                    "App-Agnostic Post-Execution Semantic Analysis of Android In-Memory Forensics Artifacts.",
                    "AVclass2: Massive Malware Tag Extraction from AV Labels.",
                    "Advanced Windows Methods on Malware Detection and Classification.",
                    "Betrayed by the Guardian: Security and Privacy Risks of Parental Control Solutions.",
                    "Talek: Private Group Messaging with Hidden Access Patterns.",
                    "Towards a Practical Differentially Private Collaborative Phone Blacklisting System.",
                    "Towards Realistic Membership Inferences: The Case of Survey Data.",
                    "Quantifying measurement quality and load distribution in Tor.",
                    "SAIBERSOC: Synthetic Attack Injection to Benchmark and Evaluate the Performance of Security Operation Centers.",
                    "Measurements of the Most Significant Software Security Weaknesses.",
                    "This is Why We Can't Cache Nice Things: Lightning-Fast Threat Hunting using Suspicion-Based Hierarchical Storage.",
                    "CDL: Classified Distributed Learning for Detecting Security Attacks in Containerized Applications.",
                    "On the Forensic Validity of Approximated Audit Logs.",
                    "More Than Just Good Passwords? A Study on Usability and Security Perceptions of Risk-based Authentication.",
                    "Double Patterns: A Usable Solution to Increase the Security of Android Unlock Patterns.",
                    "Understanding User Perceptions of Security and Privacy for Group Chat: A Survey of Users in the US and UK.",
                    "Widely Reused and Shared, Infrequently Updated, and Sometimes Inherited: A Holistic View of PIN Authentication in Digital Lives and Beyond.",
                    "Up2Dep: Android Tool Support to Fix Insecure Code Dependencies.",
                    "On the Feasibility of Automating Stock Market Manipulation.",
                    "Dragonblood is Still Leaking: Practical Cache-based Side-Channel in the Wild.",
                    "DeepSIM: GPS Spoofing Detection on UAVs using Satellite Imagery Matching.",
                    "Certified Copy? Understanding Security Risks of Wi-Fi Hotspot based Android Data Clone Services.",
                    "DPIFuzz: A Differential Fuzzing Framework to Detect DPI Elusion Strategies for QUIC.",
                    "A Flexible Framework for Expediting Bug Finding by Leveraging Past (Mis-)Behavior to Discover New Bugs.",
                    "Cupid : Automatic Fuzzer Selection for Collaborative Fuzzing.",
                    "Probabilistic Naming of Functions in Stripped Binaries.",
                    "Guide Me to Exploit: Assisted ROP Exploit Generation for ActionScript Virtual Machine.",
                    "Practical Fine-Grained Binary Code Randomization†.",
                    "Faulty Point Unit: ABI Poisoning Attacks on Intel SGX.",
                    "Reboot-Oriented IoT: Life Cycle Management in Trusted Execution Environment for Disposable IoT devices.",
                    "RusTEE: Developing Memory-Safe ARM TrustZone Applications.",
                    "HeapExpo: Pinpointing Promoted Pointers to Prevent Use-After-Free Vulnerabilities.",
                    "ρFEM: Efficient Backward-edge Protection Using Reversed Forward-edge Mappings.",
                    "Constrained Concealment Attacks against Reconstruction-based Anomaly Detectors in Industrial Control Systems.",
                    "Workflow Integration Alleviates Identity and Access Management in Serverless Computing.",
                    "Privacy-Preserving Production Process Parameter Exchange.",
                    "Efficient Oblivious Substring Search via Architectural Support.",
                    "SERENIoT: Distributed Network Security Policy Management and Enforcement for Smart Homes.",
                    "Effect of Security Controls on Patching Window: A Causal Inference based Approach.",
                    "NoSQL Breakdown: A Large-scale Analysis of Misconfigured NoSQL Services.",
                    "GuardSpark++: Fine-Grained Purpose-Aware Access Control for Secure Data Sharing and Analysis in Spark.",
                    "Understanding Promotion-as-a-Service on GitHub.",
                    "Query-Efficient Black-Box Attack Against Sequence-Based Malware Classifiers.",
                    "FPSelect: Low-Cost Browser Fingerprints for Mitigating Dictionary Attacks against Web Authentication Mechanisms.",
                    "Security Study of Service Worker Cross-Site Scripting.",
                    "CAPS: Smoothly Transitioning to a More Resilient Web PKI.",
                    "dStyle-GAN: Generative Adversarial Network based on Writing and Photography Styles for Drug Identification in Darknet Markets.",
                    "Session Key Distribution Made Practical for CAN and CAN-FD Message Authentication.",
                    "LeakyPick: IoT Audio Spy Detector.",
                    "IvoriWatch: Exploring Transparent Integrity Verification of Remote User Input Leveraging Wearables.",
                    "Verify&Revive: Secure Detection and Recovery of Compromised Low-end Embedded Devices.",
                    "FirmAE: Towards Large-Scale Emulation of IoT Firmware for Dynamic Analysis.",
                    "Device-agnostic Firmware Execution is Possible: A Concolic Execution Approach for Peripheral Emulation.",
                    "Set It and Forget It! Turnkey ECC for Instant Integration.",
                    "Practical Over-Threshold Multi-Party Private Set Intersection.",
                    "Secure and Verifiable Inference in Deep Neural Networks.",
                    "ZeroAUDIT.",
                    "Policy-based Chameleon Hash for Blockchain Rewriting with Black-box Accountability.",
                    "WearID: Low-Effort Wearable-Assisted Authentication of Voice Commands via Cross-Domain Comparison without Training.",
                    "Imperio: Robust Over-the-Air Adversarial Examples for Automatic Speech Recognition Systems.",
                    "Measuring the Effectiveness of Privacy Policies for Voice Assistant Applications.",
                    "Voicefox: Leveraging Inbuilt Transcription to Enhance the Security of Machine-Human Speaker Verification against Voice Synthesis Attacks.",
                    "VibLive: A Continuous Liveness Detection for Secure Voice User Interface in IoT Environment.",
                    "Februus: Input Purification Defense Against Trojan Attacks on Deep Neural Network Systems.",
                    "NoiseScope: Detecting Deepfake Images in a Blind Setting.",
                    "StegoNet: Turn Deep Neural Network into a Stegomalware.",
                    "SEEF-ALDR: A Speaker Embedding Enhancement Framework via Adversarial Learning based Disentangled Representation.",
                    "Attacking Graph-Based Classification without Changing Existing Connections."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "35th ACSAC 2019",
        "info": "San Juan, PR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2019",
                "sub_name": "Proceedings of the 35th Annual Computer Security Applications Conference, ACSAC 2019, San Juan, PR, USA, December 09-13, 2019.",
                "count": 60,
                "papers": [
                    "Proof of aliveness.",
                    "Co-evaluation of pattern matching algorithms on IoT devices with embedded GPUs.",
                    "Aegis: a context-aware security framework for smart home systems.",
                    "Defeating hidden audio channel attacks on voice assistants via audio-induced surface vibrations.",
                    "TF-BIV: transparent and fine-grained binary integrity verification in the cloud.",
                    "Nibbler: debloating binary shared libraries.",
                    "Function boundary detection in stripped binaries.",
                    "VPS: excavating high-level C++ constructs from low-level binaries to protect dynamic dispatching.",
                    "STRIP: a defence against trojan attacks on deep neural networks.",
                    "How to prove your model belongs to you: a blind-watermark based framework to protect intellectual property of DNN.",
                    "D2NN: a fine-grained dual modular redundancy framework for deep neural networks.",
                    "Model inversion attacks against collaborative inference.",
                    "Systematic comparison of symbolic execution systems: intermediate representation and its generation.",
                    "How to kill symbolic deobfuscation for free (or: unleashing the potential of path-oriented protections).",
                    "Sleak: automating address space layout derandomization.",
                    "SIP shaker: software integrity protection composition.",
                    "Detecting organized eCommerce fraud using scalable categorical clustering.",
                    "SIMPLE: single-frame based physical layer identification for intrusion detection and prevention on in-vehicle networks.",
                    "Improving intrusion detectors by crook-sourcing.",
                    "JStap: a static pre-filter for malicious JavaScript detection.",
                    "Koinonia: verifiable e-voting with long-term privacy.",
                    "Whisper: a unilateral defense against VoIP traffic re-identification attacks.",
                    "Privacy preserving substring search protocol with polylogarithmic communication cost.",
                    "Revisiting utility metrics for location privacy-preserving mechanisms.",
                    "Detecting (absent) app-to-app authentication on cross-device short-distance channels.",
                    "An empirical study of SMS one-time password authentication in Android apps.",
                    "Challenge-response behavioral mobile authentication: a comparative study of graphical patterns and cognitive games.",
                    "AppVeto: mobile application self-defense through resource access veto.",
                    "Progressive processing of system-behavioral query.",
                    "SecDATAVIEW: a secure big data workflow management system for heterogeneous computing environments.",
                    "Mining least privilege attribute based access control policies.",
                    "MalRank: a measure of maliciousness in SIEM-based knowledge graphs.",
                    "Cubismo: decloaking server-side malware via cubist program analysis.",
                    "Neurlux: dynamic malware analysis without feature engineering.",
                    "A game of \"Cut and Mouse\": bypassing antivirus by simulating user inputs.",
                    "My script engines know what you did in the dark: converting engines into script API tracers.",
                    "BakingTimer: privacy analysis of server-side request processing time.",
                    "PDoT: private DNS-over-TLS with TEE support.",
                    "Casino royale: a deep exploration of illegal online gambling.",
                    "Leveraging locality of reference for certificate revocation.",
                    "Opening Pandora's box through ATFuzzer: dynamic analysis of AT interface for Android smartphones.",
                    "SRFuzzer: an automatic fuzzing framework for physical SOHO router devices to discover multi-type vulnerabilities.",
                    "Premadoma: an operational solution for DNS registries to prevent malicious domain registrations.",
                    "Coordinated dataflow protection for ultra-high bandwidth science networks.",
                    "Analyzing control flow integrity with LLVM-CFI.",
                    "Mitigating data leakage by protecting memory-resident sensitive data.",
                    "FRAMER: a tagged-pointer capability system with memory safety applications.",
                    "FuzzBuilder: automated building greybox fuzzing environment for C/C++ library.",
                    "The chatty-sensor: a provably-covert channel in cyber physical systems.",
                    "HDMI-walk: attacking HDMI distribution networks via consumer electronic control protocol.",
                    "Out of control: stealthy attacks against robotic vehicles protected by control-based techniques.",
                    "WooKey: designing a trusted and efficient USB device.",
                    "EIGER: automated IOC generation for accurate and interpretable endpoint malware detection.",
                    "\"Your hashed IP address: Ubuntu.\": perspectives on transparency tools for online advertising.",
                    "Will you trust this TLS certificate?: perceptions of people working in IT.",
                    "I know what you did last login: inconsistent messages tell existence of a target's account to insiders.",
                    "Speculator: a tool to analyze speculative execution attacks and mitigations.",
                    "Survivor: a fine-grained intrusion response and recovery approach for commodity operating systems.",
                    "Robust keystroke transcription from the acoustic side-channel.",
                    "DR.SGX: automated and adjustable side-channel protection for SGX using data location randomization."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "34th ACSAC 2018",
        "info": "San Juan, PR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2018",
                "sub_name": "Proceedings of the 34th Annual Computer Security Applications Conference, ACSAC 2018, San Juan, PR, USA, December 03-07, 2018.",
                "count": 60,
                "papers": [
                    "Shredder: Breaking Exploits through API Specialization.",
                    "Type-After-Type: Practical and Complete Type-Safe Memory Reuse.",
                    "On the Effectiveness of Type-based Control Flow Integrity.",
                    "Practical Integrity Protection with Oblivious Hashing.",
                    "Typing-Proof: Usable, Secure and Low-Cost Two-Factor Authentication Based on Keystroke Timings.",
                    "Latent Typing Biometrics in Online Collaboration Services.",
                    "Beware of Your Screen: Anonymous Fingerprinting of Device Screens for Off-line Payment Protection.",
                    "A Measurement Study of Authentication Rate-Limiting Mechanisms of Modern Websites.",
                    "Accurate Malware Detection by Extreme Abstraction.",
                    "Using Loops For Malware Classification Resilient to Feature-unaware Perturbations.",
                    "MADE: Security Analytics for Enterprise Threat Detection.",
                    "LOBO: Evaluation of Generalization Deficiencies in Twitter Bot Classifiers.",
                    "Side-Channel Analysis of SM2: A Late-Stage Featurization Case Study.",
                    "MicroWalk: A Framework for Finding Side Channels in Binaries.",
                    "Analyzing Cache Side Channels Using Deep Neural Networks.",
                    "MemCloak: Practical Access Obfuscation for Untrusted Memory.",
                    "StateDroid: Stateful Detection of Stealthy Attacks in Android Apps via Horn-Clause Verification.",
                    "Improving Accuracy of Android Malware Detection with Lightweight Contextual Awareness.",
                    "A Large Scale Investigation of Obfuscation Use in Google Play.",
                    "Why Johnny Can't Make Money With His Contents: Pitfalls of Designing and Implementing Content Delivery Apps.",
                    "An Extensive Evaluation of the Internet's Open Proxies.",
                    "SENSS Against Volumetric DDoS Attacks.",
                    "Wi Not Calling: Practical Privacy and Availability Attacks in Wi-Fi Calling.",
                    "Tracking Users across the Web via TLS Session Resumption.",
                    "Towards Automated Generation of Exploitation Primitives for Web Browsers.",
                    "RAPID: Resource and API-Based Detection Against In-Browser Miners.",
                    "A Multi-tab Website Fingerprinting Attack.",
                    "Raising the Bar: Evaluating Origin-wide Security Manifests.",
                    "SHIELD: A Framework for Efficient and Secure Machine Learning Classification in Constrained Environments.",
                    "Model Extraction Warning in MLaaS Paradigm.",
                    "Poisoning Attacks to Graph-Based Recommender Systems.",
                    "I Know What You See: Power Side-Channel Attack on Convolutional Neural Network Accelerators.",
                    "Hiding in the Shadows: Empowering ARM for Stealthy Virtual Machine Introspection.",
                    "A Measurement Study on Linux Container Security: Attacks and Countermeasures.",
                    "Secure Out-of-band Remote Management of Virtual Machines with Transparent Passthrough.",
                    "Prime+Count: Novel Cross-world Covert Channels on ARM TrustZone.",
                    "Comparing Video Based Shoulder Surfing with Live Simulation.",
                    "Do Social Disorders Facilitate Social Engineering?: A Case Study of Autism and Phishing Attacks.",
                    "I Need this Back, Later!: An Exploration of Practical Secret Sharing.",
                    "Take It or Leave It: A Survey Study on Operating System Upgrade Practices.",
                    "TIFF: Using Input Type Inference To Improve Fuzzing.",
                    "Mapping to Bits: Efficiently Detecting Type Confusion Errors.",
                    "A Heuristic Framework to Detect Concurrency Vulnerabilities.",
                    "ICSD: An Automatic System for Insecure Code Snippet Detection in Stack Overflow over Heterogeneous Information Network.",
                    "Crystal (ball): I Look at Physics and Predict Control Flow! Just-Ahead-Of-Time Controller Recovery.",
                    "Noise Matters: Using Sensor and Process Noise Fingerprint to Detect Stealthy Cyber Attacks and Authenticate sensors in CPS.",
                    "Finding Dependencies between Cyber-Physical Domains for Security Testing of Industrial Control Systems.",
                    "Pointing in the Right Direction - Securing Memory Accesses in a Faulty World.",
                    "Lprov: Practical Library-aware Provenance Tracing.",
                    "Now You See Me: Real-time Dynamic Function Call Detection.",
                    "An Historical Analysis of the SEAndroid Policy Evolution.",
                    "IAC: On the Feasibility of Utilizing Neural Signals for Access Control.",
                    "Finding The Greedy, Prodigal, and Suicidal Contracts at Scale.",
                    "Osiris: Hunting for Integer Bugs in Ethereum Smart Contracts.",
                    "SmarTor: Smarter Tor with Smart Contracts: Improving resilience of topology distribution in the Tor network.",
                    "Obscuro: A Bitcoin Mixer using Trusted Execution Environments.",
                    "There's a Hole in that Bucket!: A Large-scale Analysis of Misconfigured S3 Buckets.",
                    "DeDoS: Defusing DoS with Dispersion Oriented Software.",
                    "Improving security and usability of passphrases with guided word choice.",
                    "On The Systematic Development and Evaluation Of Password Security Awareness-Raising Materials."
                ]
            },
            {
                "sub_name_abbr": "conf/acsac/2018ssprew",
                "sub_name": "Proceedings of the 8th Software Security, Protection, and Reverse Engineering Workshop, San Juan, PR, USA, December 3-4, 2018.",
                "count": 6,
                "papers": [
                    "DoSE: Deobfuscation based on Semantic Equivalence.",
                    "gExtractor: Towards Automated Extraction of Malware Deception Parameters.",
                    "Identifying Input-Dependent Jumps from Obfuscated Execution using Dynamic Data Flow Graphs.",
                    "SysTaint: Assisting Reversing of Malicious Network Communications.",
                    "On-Device Detection via Anomalous Environmental Factors.",
                    "Leave It to Weaver."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "33rd ACSAC 2017",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2017",
                "sub_name": "Proceedings of the 33rd Annual Computer Security Applications Conference, Orlando, FL, USA, December 4-8, 2017.",
                "count": 48,
                "papers": [
                    "n-Auth: Mobile Authentication Done Right.",
                    "Exploitation and Mitigation of Authentication Schemes Based on Device-Public Information.",
                    "A Secure Mobile Authentication Alternative to Biometrics.",
                    "Machine-Learning-Guided Typestate Analysis for Static Use-After-Free Detection.",
                    "Breaking and Fixing Destructive Code Read Defenses.",
                    "QUASAR: Quantitative Attack Space Analysis and Reasoning.",
                    "Kakute: A Precise, Unified Information Flow Analysis System for Big-data Security.",
                    "Marmite: Spreading Malicious File Reputation Through Download Graphs.",
                    "TTPDrill: Automatic and Accurate Extraction of Threat Actions from Unstructured Text of CTI Sources.",
                    "Supplementing Modern Software Defenses with Stack-Pointer Sanity.",
                    "Protecting COTS Binaries from Disclosure-guided Code Reuse Attacks.",
                    "Piston: Uncooperative Remote Runtime Patching.",
                    "Proxy Re-Encryption Based on Homomorphic Encryption.",
                    "Measuring Popularity of Cryptographic Libraries in Internet-Wide Scans.",
                    "Spinner: Semi-Automatic Detection of Pinning without Hostname Verification.",
                    "Predicting Cyber Threats with Virtual Security Products.",
                    "Smoke Detector: Cross-Product Intrusion Detection With Weak Indicators.",
                    "I Like It, but I Hate It: Employee Perceptions Towards an Institutional Transition to BYOD Second-Factor Authentication.",
                    "VulCAN: Efficient Component Authentication and Software Isolation for Automotive Control Networks.",
                    "Automated Analysis of Secure Internet of Things Protocols.",
                    "HoloPair: Securing Shared Augmented Reality Using Microsoft HoloLens.",
                    "Objective Metrics and Gradient Descent Algorithms for Adversarial Examples in Machine Learning.",
                    "Mitigating Evasion Attacks to Deep Neural Networks via Region-based Classification.",
                    "Malware Detection in Adversarial Settings: Exploiting Feature Evolutions and Confusions in Android Apps.",
                    "Grid Shock: Coordinated Load-Changing Attacks on Power Grids: The Non-Smart Power Grid is Vulnerable to Cyber Attacks as Well.",
                    "Orpheus: Enforcing Cyber-Physical Execution Semantics to Defend Against Data-Oriented Attacks.",
                    "TRAKS: A Universal Key Management Scheme for ERTMS.",
                    "Supporting Transparent Snapshot for Bare-metal Malware Analysis on Mobile Devices.",
                    "Droid-AntiRM: Taming Control Flow Anti-analysis to Support Automated Dynamic Analysis of Android Malware.",
                    "SecureDroid: Enhancing Security of Machine Learning-based Detection against Adversarial Android Malware Attacks.",
                    "DECANTeR: DEteCtion of Anomalous outbouNd HTTP TRaffic by Passive Application Fingerprinting.",
                    "Picky Attackers: Quantifying the Role of System Properties on Intruder Behavior.",
                    "Co-processor-based Behavior Monitoring: Application to the Detection of Attacks Against the System Management Mode.",
                    "RevARM: A Platform-Agnostic ARM Binary Rewriter for Security Applications.",
                    "Secure and Efficient Software-based Attestation for Industrial Control Devices with ARM Processors.",
                    "ECFI: Asynchronous Control Flow Integrity for Programmable Logic Controllers.",
                    "Lean On Me: Mining Internet Service Dependencies From Large-Scale DNS Data.",
                    "A Security-Mode for Carrier-Grade SDN Controllers.",
                    "RESECT: Self-Learning Traffic Filters for IP Spoofing Defense.",
                    "Towards Baselines for Shoulder Surfing on Mobile Authentication.",
                    "On the Pitfalls of End-to-End Encrypted Communications: A Study of Remote Key-Fingerprint Verification.",
                    "Here Is Your Fingerprint!: Actual Risk versus User Perception of Latent Fingerprints and Smudges Remaining on Smartphones.",
                    "Protecting Against Malicious Bits On the Wire: Automatically Generating a USB Protocol Parser for a Production Kernel.",
                    "Nioh: Hardening The Hypervisor by Filtering Illegal I/O Requests to Virtual Devices.",
                    "Analysis of SEAndroid Policies: Combining MAC and DAC in Android.",
                    "Commoner Privacy And A Study On Network Traces.",
                    "The Devil's in The Details: Placing Decoy Routers in the Internet.",
                    "Ex-Ray: Detection of History-Leaking Browser Extensions."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "32nd ACSAC 2016",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2016",
                "sub_name": "Proceedings of the 32nd Annual Conference on Computer Security Applications, ACSAC 2016, Los Angeles, CA, USA, December 5-9, 2016.",
                "count": 48,
                "papers": [
                    "Formal security analysis of smart embedded systems.",
                    "An ultra-lightweight white-box encryption scheme for securing resource-constrained IoT devices.",
                    "A multi-cloud based privacy-preserving data publishing scheme for the internet of things.",
                    "ELAR: extremely lightweight auditing and repairing for cloud security.",
                    "Pileus: protecting user resources from vulnerable cloud services.",
                    "Bootstrapping and maintaining trust in the cloud.",
                    "Decomposition of MAC address structure for granular device inference.",
                    "Timing-based reconnaissance and defense in software-defined networks.",
                    "RevProbe: detecting silent reverse proxies in malicious server infrastructures.",
                    "Life-experience passwords (LEPs).",
                    "Using image saliency and regions of interest to encourage stronger graphical passwords.",
                    "CPAC: securing critical infrastructure with cyber-physical access control.",
                    "Catching predators at watering holes: finding and understanding strategically compromised websites.",
                    "The Achilles heel of OAuth: a multi-platform study of OAuth-based authentication.",
                    "Adaptive encrypted traffic fingerprinting with bi-directional dependence.",
                    "Code obfuscation against symbolic execution attacks.",
                    "VulPecker: an automated vulnerability detection system based on code similarity analysis.",
                    "EvilCoder: automated bug insertion.",
                    "On the (in)security of the latest generation implantable cardiac defibrillators and how to secure them.",
                    "Multi-receiver GPS spoofing detection: error models and realization.",
                    "Location-enhanced authentication using the IoT: because you cannot be in two places at once.",
                    "Theft-resilient mobile wallets: transparently authenticating NFC users with tapping gesture biometrics.",
                    "Gametrics: towards attack-resilient behavioral authentication with simple cognitive games.",
                    "Device fingerprinting for augmenting web authentication: classification and analysis of methods.",
                    "Practical and secure dynamic searchable encryption via oblivious access on distributed data structure.",
                    "CoKey: fast token-based cooperative cryptography.",
                    "The cloudier side of cryptographic end-to-end verifiable voting: a security analysis of Helios.",
                    "ShieldFS: a self-healing, ransomware-aware filesystem.",
                    "Cypider: building community-based cyber-defense infrastructure for android malware detection.",
                    "Intelligent, automated red team emulation.",
                    "You can promote, but you can't hide: large-scale abused app detection in mobile app stores.",
                    "Swords and shields: a study of mobile game hacks and existing defenses.",
                    "Understanding and defending the binder attack surface in Android.",
                    "Inferring browser activity and status through remote monitoring of storage usage.",
                    "Amplifying side channels through performance degradation.",
                    "Efficient, adversarial neighbor discovery using logical channels on Microsoft Azure.",
                    "VTPin: practical VTable hijacking protection for binaries.",
                    "LMP: light-weighted memory protection with hardware assistance.",
                    "FASE: functionality-aware security enforcement.",
                    "Reliably determining data leakage in the presence of strong attackers.",
                    "Sanitizing data is not enough!: towards sanitizing structural artifacts in flash media.",
                    "Auror: defending against poisoning attacks in collaborative deep learning systems.",
                    "A security analysis of automated chinese turing tests.",
                    "The cross domain desktop compositor: using hardware-based video compositing for a multi-level secure user interface.",
                    "CASTLE: CA signing in a touch-less environment.",
                    "Spicy: a unified deep packet inspection framework for safely dissecting all your data.",
                    "Trace-free memory data structure forensics via past inference and future speculations.",
                    "HERCULE: attack story reconstruction via community discovery on correlated log graph."
                ]
            },
            {
                "sub_name_abbr": "conf/acsac/2016ssprew",
                "sub_name": "Proceedings of the 6th Workshop on Software Security, Protection, and Reverse Engineering, SSPREW@ACSAC 2016, Los Angeles, California, USA, December 5-6, 2016.",
                "count": 8,
                "papers": [
                    "Metadata recovery from obfuscated programs using machine learning.",
                    "Finding the needle in the heap: combining static analysis and dynamic symbolic execution to trigger use-after-free.",
                    "Detecting rootkits with the RAI runtime application inventory.",
                    "White-box cryptography: practical protection on hostile hosts.",
                    "Active Android malware analysis: an approach based on stochastic games.",
                    "Buffer overflow attack's power consumption signatures.",
                    "Tightly-coupled self-debugging software protection.",
                    "Comparing the effectiveness of commercial obfuscators against MATE attacks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "31st ACSAC 2015",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2015",
                "sub_name": "Proceedings of the 31st Annual Computer Security Applications Conference, Los Angeles, CA, USA, December 7-11, 2015.",
                "count": 47,
                "papers": [
                    "Evaluating the Flexibility of the Java Sandbox.",
                    "Emerging Image Game CAPTCHAs for Resisting Automated and Human-Solver Relay Attacks.",
                    "On the Security and Usability of Crypto Phones.",
                    "Decentralized Authorization and Privacy-Enhanced Routing for Information-Centric Networks.",
                    "Know Your Achilles' Heel: Automatic Detection of Network Critical Services.",
                    "Proactive Security Analysis of Changes in Virtualized Infrastructures.",
                    "Vulnerability Assessment of OAuth Implementations in Android Applications.",
                    "BareDroid: Large-Scale Analysis of Android Apps on Real Devices.",
                    "Experimental Study with Real-world Data for Android App Security Analysis using Machine Learning.",
                    "Control Flow and Code Integrity for COTS binaries: An Effective Defense Against Real-World ROP Attacks.",
                    "A Principled Approach for ROP Defense.",
                    "Defeating ROP Through Denial of Stack Pivot.",
                    "Handling Reboots and Mobility in 802.15.4 Security.",
                    "Using Channel State Information for Tamper Detection in the Internet of Things.",
                    "Using Visual Challenges to Verify the Integrity of Security Cameras.",
                    "JaTE: Transparent and Efficient JavaScript Confinement.",
                    "Cross-Site Framing Attacks.",
                    "Covert Botnet Command and Control Using Twitter.",
                    "AuDroid: Preventing Attacks on Audio Channels in Mobile Devices.",
                    "On the Robustness of Mobile Device Fingerprinting: Can Mobile Users Escape Modern Web-Tracking Mechanisms?",
                    "Grab 'n Run: Secure and Practical Dynamic Code Loading for Android Applications.",
                    "Provenance-based Integrity Protection for Windows.",
                    "MOSE: Live Migration Based On-the-Fly Software Emulation.",
                    "Privacy-preserving Virtual Machine.",
                    "Soteria: Offline Software Protection within Low-cost Embedded Devices.",
                    "PIE: Parser Identification in Embedded Systems.",
                    "Defending Against Malicious USB Firmware with GoodUSB.",
                    "Proximity Verification for Contactless Access Control and Authentication Systems.",
                    "Scalable and Secure Concurrent Evaluation of History-based Access Control Policies.",
                    "Entity-Based Access Control: supporting more expressive access control policies.",
                    "Is Bigger Better? Comparing User-Generated Passwords on 3x3 vs. 4x4 Grid Sizes for Android's Pattern Unlock.",
                    "ErsatzPasswords: Ending Password Cracking and Detecting Password Leakage.",
                    "PARS: A Uniform and Open-source Password Analysis and Research System.",
                    "Binary Code Continent: Finer-Grained Control Flow Integrity for Stripped Binaries.",
                    "ShrinkWrap: VTable Protection without Loose Ends.",
                    "DynaGuard: Armoring Canary-based Protections against Brute-force Attacks.",
                    "Towards Analyzing the Input Validation Vulnerabilities associated with Android System Services.",
                    "MorphDroid: Fine-grained Privacy Verification.",
                    "MobiPluto: File System Friendly Deniable Storage for Mobile Devices.",
                    "Analyzing and Modeling Longitudinal Security Data: Promise and Pitfalls.",
                    "Accurate, Low Cost and Instrumentation-Free Security Audit Logging for Windows.",
                    "SeSQLite: Security Enhanced SQLite: Mandatory Access Control for Android databases.",
                    "Combining Differential Privacy and Secure Multiparty Computation.",
                    "Secure and Efficient Key Derivation in Portfolio Authentication Schemes Using Blakley Secret Sharing.",
                    "Getting to know your Card: Reverse-Engineering the Smart-Card Application Protocol Data Unit.",
                    "Logical Partitions on Many-Core Platforms.",
                    "Hardware-assisted Memory Tracing on New SoCs Embedding FPGA Fabrics."
                ]
            },
            {
                "sub_name_abbr": "conf/acsac/2015pprew",
                "sub_name": "Proceedings of the 5th Program Protection and Reverse Engineering Workshop, PPREW@ACSAC, Los Angeles, CA, USA, December 8, 2015.",
                "count": 9,
                "papers": [
                    "Applying Software Protection to White-Box Cryptography.",
                    "InputFinder: Reverse Engineering Closed Binaries using Hardware Performance Counters.",
                    "A Complement to Enhanced Instruction Register File against Embedded Software Falsification.",
                    "Repeatable Reverse Engineering with PANDA.",
                    "Lightweight heuristics to retrieve parameter associations from binaries.",
                    "Flowtables: Program Skeletal Inversion for Defeat of Interprocedural Analysis with Unique Metamorphism.",
                    "OpSeq: Android Malware Fingerprinting.",
                    "Pinpointing and Hiding Surprising Fragments in an Obfuscated Program.",
                    "Enriching reverse engineering through visual exploration of Android binaries."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "30th ACSAC 2014",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2014",
                "sub_name": "Proceedings of the 30th Annual Computer Security Applications Conference, ACSAC 2014, New Orleans, LA, USA, December 8-12, 2014.",
                "count": 48,
                "papers": [
                    "Taking two-factor to the next level: protecting online poker, banking, healthcare and other applications.",
                    "Hot-hardening: getting more out of your security settings.",
                    "Challenges and implications of verifiable builds for security-critical open-source software.",
                    "Cloud radar: near real-time detection of security failures in dynamic virtualized infrastructures.",
                    "Scippa: system-centric IPC provenance on Android.",
                    "Android security framework: extensible multi-layered access control on Android.",
                    "Towards a scalable resource-driven approach for detecting repackaged Android applications.",
                    "TroGuard: context-aware protection against web-based socially engineered trojans.",
                    "Spam ain't as diverse as it seems: throttling OSN spam with templates underneath.",
                    "A taste of tweets: reverse engineering Twitter spammers.",
                    "New models of cache architectures characterizing information leakage from cache side channels.",
                    "ICE: a passive, high-speed, state-continuity scheme.",
                    "Interrupt-oriented bugdoor programming: a minimalist approach to bugdooring embedded systems firmware.",
                    "Through the eye of the PLC: semantic security monitoring for industrial processes.",
                    "CPS: market analysis of attacks against demand response in the smart grid.",
                    "CPS: driving cyber-physical systems to unsafe operating conditions by timing DoS attacks on sensor signals.",
                    "Uncovering network tarpits with degreaser.",
                    "Network dialog minimization and network dialog diffing: two novel primitives for network security applications.",
                    "Lightweight authentication of freshness in outsourced key-value stores.",
                    "SEER: practical memory virus scanning as a service.",
                    "MACE: high-coverage and robust memory analysis for commodity operating systems.",
                    "Assisted deletion of related content.",
                    "Morpheus: automatically generating heuristics to detect Android emulators.",
                    "Design and implementation of an Android host-based intrusion prevention system.",
                    "MoRePriv: mobile OS support for application personalization and privacy.",
                    "IMSI-catch me if you can: IMSI-catcher-catchers.",
                    "Advanced Wi-Fi attacks using commodity hardware.",
                    "Whitewash: outsourcing garbled circuit generation for mobile devices.",
                    "Using automatic speech recognition for attacking acoustic CAPTCHAs: the trade-off between usability and security.",
                    "Understanding visual perceptions of usability and security of Android's graphical password pattern.",
                    "It's the psychology stupid: how heuristics explain software vulnerabilities and how priming can illuminate developer's blind spots.",
                    "Exploring and mitigating privacy threats of HTML5 geolocation API.",
                    "Differentially private data aggregation with optimal utility.",
                    "On the privacy provisions of Bloom filters in lightweight bitcoin clients.",
                    "OSPF vulnerability to persistent poisoning attacks: a systematic analysis.",
                    "Less is more: cipher-suite negotiation for DNSSEC.",
                    "DNS authentication as a service: preventing amplification attacks.",
                    "Relation extraction for inferring access control rules from natural language artifacts.",
                    "Centrality metrics of importance in access behaviors and malware detections.",
                    "Scalability, fidelity and stealth in the DRAKVUF dynamic malware analysis system.",
                    "Towards automated integrity protection of C++ virtual function tables in binary programs.",
                    "Leveraging semantic signatures for bug search in binary programs.",
                    "IntFlow: improving the accuracy of arithmetic error detection using information flow tracking.",
                    "CPS: beyond usability: applying value sensitive design based methods to investigate domain characteristics for security for implantable cardiac devices.",
                    "A security evaluation of AIS automated identification system.",
                    "NodeSentry: least-privilege library integration for server-side JavaScript.",
                    "TrueClick: automatically distinguishing trick banners from genuine download links.",
                    "JShield: towards real-time and vulnerability-based detection of polluted drive-by download attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/acsac/2014pprew",
                "sub_name": "Proceedings of the 4th Program Protection and Reverse Engineering Workshop, PPREW@ACSAC 2014, New Orleans, LA, USA, December 9, 2014.",
                "count": 7,
                "papers": [
                    "Mixed-Mode Malware and Its Analysis.",
                    "A Framework for Understanding Dynamic Anti-Analysis Defenses.",
                    "SILK: high level of abstraction leakage simulator for side channel analysis.",
                    "Multi-App Security Analysis with FUSE: Statically Detecting Android App Collusion.",
                    "Probing the Limits of Virtualized Software Protection.",
                    "HCODE: Hardware-Enhanced Real-Time CFI.",
                    "Intellectual Property Protection in Additive Layer Manufacturing: Requirements for Secure Outsourcing."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "29th ACSAC 2013",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2013",
                "sub_name": "Annual Computer Security Applications Conference, ACSAC '13, New Orleans, LA, USA, December 9-13, 2013.",
                "count": 36,
                "papers": [
                    "Systems thinking for safety and security.",
                    "AFrame: isolating advertisements from mobile applications in Android.",
                    "The man who was there: validating check-ins in location-based services.",
                    "Discovery of emergent malicious campaigns in cellular networks.",
                    "Message in a bottle: sailing past censorship.",
                    "k-subscription: privacy-preserving microblogging browsing through obfuscation.",
                    "MyCloud: supporting user-configured privacy protection in cloud computing.",
                    "Extraction of statistically significant malware behaviors.",
                    "DUET: integration of dynamic and static analyses for malware clustering with cluster ensembles.",
                    "SigMal: a static signal processing based malware triage.",
                    "CPS: an efficiency-motivated attack against autonomous vehicular transportation.",
                    "CPS: stateful policy enforcement for control system device usage.",
                    "Revisiting graphical passwords for augmenting, not replacing, text passwords.",
                    "Pitfalls in the automated strengthening of passwords.",
                    "A building code for building code: putting what we know works to work.",
                    "PRIME: private RSA infrastructure for memory-less encryption.",
                    "Do I know you?: efficient and privacy-preserving common friend-finder protocols and applications.",
                    "GPU and CPU parallelization of honest-but-curious secure two-party computation.",
                    "No attack necessary: the surprising dynamics of SSL trust relationships.",
                    "Socket overloading for fun and cache-poisoning.",
                    "Beehive: large-scale log analysis for detecting suspicious activity in enterprise networks.",
                    "Uncovering access control weaknesses and flaws with security-discordant software clones.",
                    "A portable user-level approach for system-wide integrity protection.",
                    "Subverting system authentication with context-aware, reactive virtual machine introspection.",
                    "Seeing is not believing: visual verifications through liveness analysis using mobile devices.",
                    "Crossover: secure and usable user interface for mobile devices with multiple isolated OS personalities.",
                    "PatchDroid: scalable third-party security patches for Android devices.",
                    "A comprehensive black-box methodology for testing the forensic characteristics of solid-state drives.",
                    "Implementation and implications of a stealth hard-drive backdoor.",
                    "SPIDER: stealthy binary program instrumentation and debugging via hardware virtualization.",
                    "DR BACA: dynamic role based access control for Android.",
                    "Control-flow restrictor: compiler-based CFI for iOS.",
                    "FireDroid: hardening security in almost-stock Android.",
                    "SilverLine: preventing data leaks from compromised web applications.",
                    "Validating web content with senser.",
                    "Auto-FBI: a user-friendly approach for secure access to sensitive content on the web."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "28th ACSAC 2012",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2012",
                "sub_name": "28th Annual Computer Security Applications Conference, ACSAC 2012, Orlando, FL, USA, 3-7 December 2012.",
                "count": 46,
                "papers": [
                    "JSand: complete client-side sandboxing of third-party JavaScript without browser modifications.",
                    "One year of SSL internet measurement.",
                    "Dissecting ghost clicks: ad fraud via misdirected human clicks.",
                    "Permission evolution in the Android ecosystem.",
                    "Practicality of accelerometer side channels on smartphones.",
                    "Analysis of the communication between colluding applications on modern smartphones.",
                    "Enabling trusted scheduling in embedded systems.",
                    "TRESOR-HUNT: attacking CPU-bound encryption.",
                    "When hardware meets software: a bulletproof solution to forensic memory acquisition.",
                    "Tapas: design, implementation, and usability evaluation of a password manager.",
                    "On automated image choice for secure and usable graphical passwords.",
                    "Building better passwords using probabilistic techniques.",
                    "Cloud-based push-styled mobile botnets: a case study of exploiting the cloud to device messaging service.",
                    "Disclosure: detecting botnet command and control servers through large-scale NetFlow analysis.",
                    "Security economics: a personal perspective.",
                    "Trust engineering: rejecting the tyranny of the weakest link.",
                    "SensorSift: balancing sensor data privacy and utility in automated face understanding.",
                    "Biometric authentication on a mobile device: a study of user effort, error and task disruption.",
                    "BetterAuth: web authentication revisited.",
                    "Using memory management to detect and extract illegitimate code for malware analysis.",
                    "Down to the bare metal: using processor features for binary analysis.",
                    "Augmenting vulnerability analysis of binary code.",
                    "ThinAV: truly lightweight mobile cloud-based anti-malware.",
                    "Abusing cloud-based browsers for fun and profit.",
                    "Iris: a scalable cloud file system with efficient integrity checks.",
                    "Malicious PDF detection using metadata and structural features.",
                    "Jarhead analysis and detection of malicious Java applets.",
                    "Hi-Fi: collecting high-fidelity whole-system provenance.",
                    "Transforming commodity security policies to enforce Clark-Wilson integrity.",
                    "CodeShield: towards personalized application whitelisting.",
                    "Using automated model analysis for reasoning about security of web protocols.",
                    "Securing untrusted code via compiler-agnostic binary rewriting.",
                    "Code shredding: byte-granular randomization of program layout for detecting code-reuse attacks.",
                    "Distributed application tamper detection via continuous software updates.",
                    "VAMO: towards a fully automated malware clustering validity analysis.",
                    "Towards network containment in malware analysis systems.",
                    "Lines of malicious code: insights into the malicious software industry.",
                    "Generalized vulnerability extrapolation using abstract syntax trees.",
                    "XIAO: tuning code clones at hands of engineers in practice.",
                    "Self-healing multitier architectures using cascading rescue points.",
                    "Twitter games: how successful spammers pick targets.",
                    "All your face are belong to us: breaking Facebook's social authentication.",
                    "Enabling private conversations on Twitter.",
                    "Separation virtual machine monitors.",
                    "Efficient protection of kernel data structures via object partitioning.",
                    "TrueErase: per-file secure deletion for the storage data path."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "27th ACSAC 2011",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2011",
                "sub_name": "Twenty-Seventh Annual Computer Security Applications Conference, ACSAC 2011, Orlando, FL, USA, 5-9 December 2011.",
                "count": 42,
                "papers": [
                    "Understanding the prevalence and use of alternative plans in malware with network games.",
                    "FORECAST: skimming off the malware cream.",
                    "Detecting malware's failover C&C strategies with squeeze.",
                    "Distilling critical attack graph surface iteratively through minimum-cost SAT solving.",
                    "RIPE: runtime intrusion prevention evaluator.",
                    "Hit 'em where it hurts: a live security exercise on cyber situational awareness.",
                    "\"Mix-in-Place\" anonymous networking using secure function evaluation.",
                    "Security through amnesia: a software-based solution to the cold boot attack on disk encryption.",
                    "Private search in the real world.",
                    "The socialbot network: when bots socialize for fame and money.",
                    "Detecting and resolving privacy conflicts for collaborative data sharing in online social networks.",
                    "Social snapshots: digital forensics for online social networks.",
                    "A peel of onion.",
                    "The science of cyber security experimentation: the DETER project.",
                    "Facing the facts about image type in recognition-based graphical passwords.",
                    "PhorceField: a phish-proof password ceremony.",
                    "Dynamic sample size detection in continuous authentication using sequential sampling.",
                    "Improving robustness of DNS to software vulnerabilities.",
                    "Enabling secure VM-vTPM migration in private clouds.",
                    "Exposing invisible timing-based traffic watermarks with BACKLIT.",
                    "Exploring the potential benefits of expanded rate limiting in Tor: slow and steady wins the race with Tortoise.",
                    "\"Super nodes\" in Tor: existence and security implication.",
                    "Smart metering de-pseudonymization.",
                    "SEMAGE: a new image-based two-factor CAPTCHA.",
                    "BLOCK: a black-box approach for detection of state violation attacks towards web applications.",
                    "A server- and browser-transparent CSRF defense for web 2.0 applications.",
                    "ASIDE: IDE support for web application security.",
                    "Tracking payment card data flow using virtual machine state introspection.",
                    "An empirical study of visual security cues to prevent the SSLstripping attack.",
                    "AdSentry: comprehensive and flexible confinement of JavaScript-based advertisements.",
                    "WebJail: least-privilege integration of third-party components in web mashups.",
                    "Key escrow from a safe distance: looking back at the Clipper Chip.",
                    "Reliable telemetry in white spaces using remote attestation.",
                    "Don't Bump, Shake on It: the exploitation of a popular accelerometer-based smart phone exchange and its secure replacement.",
                    "Attacks on WebView in the Android system.",
                    "Mitigating code-reuse attacks with control-flow locking.",
                    "deRop: removing return-oriented programming from malware.",
                    "Static detection of malicious JavaScript-bearing PDF documents.",
                    "Nexat: a history-based approach to predict attacker actions.",
                    "From prey to hunter: transforming legacy embedded devices into exploitation sensor grids.",
                    "BareBox: efficient malware analysis on bare-metal.",
                    "Automated remote repair for mobile malware."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "26th ACSAC 2010",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2010",
                "sub_name": "Twenty-Sixth Annual Computer Security Applications Conference, ACSAC 2010, Austin, Texas, USA, 6-10 December 2010.",
                "count": 42,
                "papers": [
                    "Detecting spammers on social networks.",
                    "Toward worm detection in online social networks.",
                    "Who is tweeting on Twitter: human, bot, or cyborg?",
                    "Cujo: efficient detection and prevention of drive-by-download attacks.",
                    "Fast and practical instruction-set randomization for commodity systems.",
                    "G-Free: defeating return-oriented programming through gadget-less binaries.",
                    "Towards practical anonymous password authentication.",
                    "Securing interactive sessions using mobile device through visual channel and visual inspection.",
                    "Exploring usability effects of increasing security in click-based graphical passwords.",
                    "Security analysis of a fingerprint-protected USB drive.",
                    "A quantitative analysis of the insecurity of embedded network devices: results of a wide-area scan.",
                    "Multi-vendor penetration testing in the advanced metering infrastructure.",
                    "Network intrusion detection: dead or alive?",
                    "Barriers to science in security.",
                    "Friends of an enemy: identifying local members of peer-to-peer botnets using mutual contacts.",
                    "The case for in-the-lab botnet experimentation: creating and taking down a 3000-node botnet.",
                    "Conficker and beyond: a large-scale empirical study.",
                    "Spam mitigation using spatio-temporal reputations from blacklist history.",
                    "Breaking e-banking CAPTCHAs.",
                    "FIRM: capability-based inline mediation of Flash behaviors.",
                    "T-DRE: a hardware trusted computing base for direct recording electronic vote machines.",
                    "Hardware assistance for trustworthy systems through 3-D integration.",
                    "SCA-resistant embedded processors: the next generation.",
                    "Porscha: policy oriented secure content handling in Android.",
                    "Kells: a protection framework for portable data.",
                    "Keeping data secret under full compromise using porter devices.",
                    "Familiarity breeds contempt: the honeymoon effect and the role of legacy code in zero-day vulnerabilities.",
                    "Quantifying information leaks in software.",
                    "Analyzing and improving Linux kernel memory protection: a model checking approach.",
                    "Back to Berferd.",
                    "Comprehensive shellcode detection using runtime heuristics.",
                    "Cross-layer comprehensive intrusion harm analysis for production workload server systems.",
                    "Forenscope: a framework for live forensics.",
                    "A multi-user steganographic file system on untrusted shared storage.",
                    "Heap Taichi: exploiting memory allocation granularity in heap-spraying attacks.",
                    "SCOBA: source code based attestation on custom software.",
                    "Paranoid Android: versatile protection for smartphones.",
                    "Exploiting smart-phone USB connectivity for fun and profit.",
                    "Defending DSSS-based broadcast communication against insider jammers via delayed seed-disclosure.",
                    "Always up-to-date: scalable offline patching of VM images in a compute cloud.",
                    "A framework for testing hardware-software security architectures.",
                    "Two methodologies for physical penetration testing using social engineering."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "25th ACSAC 2009",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2009",
                "sub_name": "Twenty-Fifth Annual Computer Security Applications Conference, ACSAC 2009, Honolulu, Hawaii, USA, 7-11 December 2009.",
                "count": 48,
                "papers": [
                    "A Network Access Control Mechanism Based on Behavior Profiles.",
                    "RoleVAT: Visual Assessment of Practical Need for Role Based Access Control.",
                    "How to Securely Break into RBAC: The BTG-RBAC Model.",
                    "Computer-Related Risk Futures.",
                    "Evaluation of a DPA-Resistant Prototype Chip.",
                    "FPValidator: Validating Type Equivalence of Function Pointers on the Fly.",
                    "Surgically Returning to Randomized lib(c).",
                    "SecureMR: A Service Integrity Assurance Framework for MapReduce.",
                    "Justifying Integrity Using a Virtual Machine Verifier.",
                    "Scalable Web Content Attestation.",
                    "A Study of User-Friendly Hash Comparison Schemes.",
                    "Modeling Modern Network Attacks and Countermeasures Using Attack Graphs.",
                    "Evaluating Network Security With Two-Layer Attack Graphs.",
                    "Unifying Broadcast Encryption and Traitor Tracing for Content Protection.",
                    "Detecting Software Theft via System Call Based Birthmarks.",
                    "Reflections on UNIX Vulnerabilities.",
                    "The Good, the Bad, And the Ugly: Stepping on the Security Scale.",
                    "A New Approach for Anonymous Password Authentication.",
                    "On the Security of PAS (Predicate-Based Authentication Service).",
                    "BAF: An Efficient Publicly Verifiable Secure Audit Logging Scheme for Distributed Systems.",
                    "FIRE: FInding Rogue nEtworks.",
                    "Active Botnet Probing to Identify Obscure Command and Control Channels.",
                    "TrustGraph: Trusted Graphics Subsystem for High Assurance Systems.",
                    "RAD: Reflector Attack Defense Using Message Authentication Codes.",
                    "A Guided Tour Puzzle for Denial of Service Prevention.",
                    "Online Signature Generation for Windows Systems.",
                    "Protecting Commodity Operating System Kernels from Vulnerable Device Drivers.",
                    "Detecting Malicious Flux Service Networks through Passive Analysis of Recursive DNS Traces.",
                    "Identification of Bot Commands by Run-Time Execution Monitoring.",
                    "Transparent Encryption for External Storage Media with Key Management Adapted to Mobile Use.",
                    "Semantically Rich Application-Centric Security in Android.",
                    "Leveraging Cellular Infrastructure to Improve Fraud Prevention.",
                    "Analyzing and Detecting Malicious Flash Advertisements.",
                    "Symmetric Cryptography in Javascript.",
                    "Analyzing Information Flow in JavaScript-Based Browser Extensions.",
                    "Java Security: A Ten Year Retrospective.",
                    "Secure Web 2.0 Content Sharing Beyond Walled Gardens.",
                    "Enabling Secure Secret Sharing in Distributed Online Social Networks.",
                    "Deploying and Monitoring DNS Security (DNSSEC).",
                    "MAVMM: Lightweight and Purpose Built VMM for Malware Analysis.",
                    "Protecting Kernel Code and Data with a Virtualization-Aware Collaborative Operating System.",
                    "HIMA: A Hypervisor-Based Integrity Measurement Agent.",
                    "Online Sketching of Network Flows for Real-Time Stepping-Stone Detection.",
                    "SHELF: Preserving Business Continuity and Availability in an Intrusion Recovery System.",
                    "An Empirical Approach to Modeling Uncertainty in Intrusion Analysis.",
                    "The Design of a Trustworthy Voting System.",
                    "Privacy through Noise: A Design Space for Private Identification.",
                    "A Survey of Vendor Software Assurance Practices."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "24th ACSAC 2008",
        "info": "Anaheim, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2008",
                "sub_name": "Twenty-Fourth Annual Computer Security Applications Conference, ACSAC 2008, Anaheim, California, USA, 8-12 December 2008.",
                "count": 45,
                "papers": [
                    "Structuring for Strategic Cyber Defense: A Cyber Manhattan Project Blueprint.",
                    "Practical Applications of Bloom Filters to the NIST RDS and Hard Drive Triage.",
                    "Systematic Signature Engineering by Re-use of Snort Signatures.",
                    "Analysing the Performance of Security Solutions to Reduce Vulnerability Exposure Window.",
                    "New Side Channels Targeted at Passwords.",
                    "PinUP: Pinning User Files to Known Applications.",
                    "Defending Against Attacks on Main Memory Persistence.",
                    "Automatic Inference and Enforcement of Kernel Data Structure Invariants.",
                    "VICI Virtual Machine Introspection for Cognitive Immunity.",
                    "Soft-Timer Driven Transient Kernel Control Flow Attacks and Defense.",
                    "On Purely Automated Attacks and Click-Based Graphical Passwords.",
                    "YAGP: Yet Another Graphical Password Strategy.",
                    "Privacy-Aware Biometrics: Design and Implementation of a Multimodal Verification System.",
                    "Improving the Efficiency of Capture-Resistant Biometric Authentication Based on Set Intersection.",
                    "ProActive Access Control for Business Process-Driven Environments.",
                    "Assessing Quality of Policy Properties in Verification of Access Control Policies.",
                    "Please Permit Me: Stateless Delegated Authorization in Mashups.",
                    "Implementing ACL-Based Policies in XACML.",
                    "Execution Trace-Driven Automated Attack Signature Generation.",
                    "Improving Security Visualization with Exposure Map Filtering.",
                    "Attack Grammar: A New Approach to Modeling and Analyzing Network Attack Sequences.",
                    "Host-Centric Model Checking for Network Vulnerability Analysis.",
                    "The Role Hierarchy Mining Problem: Discovery of Optimal Role Hierarchies.",
                    "Permission Set Mining: Discovering Practical and Useful Roles.",
                    "Enforcing Role-Based Access Control Policies in Web Services with UML and OCL.",
                    "Addressing Low Base Rates in Intrusion Detection via Uncertainty-Bounding Multi-Step Analysis.",
                    "Toward Automatic Generation of Intrusion Detection Verification Rules.",
                    "STILL: Exploit Code Detection via Static Taint and Initialization Analyses.",
                    "McBoost: Boosting Scalability in Malware Collection and Analysis Using Statistical Classification of Executables.",
                    "MalTRAK: Tracking and Eliminating Unknown Malware.",
                    "Preventing Information Leaks through Shadow Executions.",
                    "XSSDS: Server-Side Detection of Cross-Site Scripting Attacks.",
                    "Anti-Phishing in Offense and Defense.",
                    "OMOS: A Framework for Secure Communication in Mashup Applications.",
                    "Behavior-Profile Clustering for False Alert Reduction in Anomaly Detection Sensors.",
                    "Bluetooth Network-Based Misuse Detection.",
                    "Bridging the Gap between Data-Flow and Control-Flow Analysis for Anomaly Detection.",
                    "Epilogue for RFC 1281, Guidelines for the Secure Operation of the Internet.",
                    "The Evolution of System-Call Monitoring.",
                    "PAS: Predicate-Based Authentication Services Against Powerful Passive Adversaries.",
                    "pwdArmor: Protecting Conventional Password-Based Authentications.",
                    "DARE: A Framework for Dynamic Authentication of Remote Executions.",
                    "Instruction Set Extensions for Enhancing the Performance of Symmetric-Key Cryptography.",
                    "A Survey to Guide Group Key Protocol Development.",
                    "Transaction Oriented Text Messaging with Trusted-SMS."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "23rd ACSAC 2007",
        "info": "Miami Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2007",
                "sub_name": "23rd Annual Computer Security Applications Conference (ACSAC 2007), December 10-14, 2007, Miami Beach, Florida, USA.",
                "count": 44,
                "papers": [
                    "So You Think You Can Dance?",
                    "Establishing and Sustaining System Integrity via Root of Trust Installation.",
                    "Tampering with Special Purpose Trusted Computing Devices: A Case Study in Optical Scan E-Voting.",
                    "Toward a Medium-Robustness Separation Kernel Protection Profile.",
                    "Improving Signature Testing through Dynamic Data Flow Analysis.",
                    "HoneyIM: Fast Detection and Suppression of Instant Messaging Malware in Enterprise-Like Networks.",
                    "Feature Omission Vulnerabilities: Thwarting Signature Generation for Polymorphic Worms.",
                    "Toward Realistic and Artifact-Free Insider-Threat Data.",
                    "Database Isolation and Filtering against Data Corruption Attacks.",
                    "Sania: Syntactic and Semantic Analysis for Automated Testing against SQL Injection.",
                    "Closed-Circuit Unobservable Voice over IP.",
                    "SSARES: Secure Searchable Automated Remote Email Storage.",
                    "The Design and Development of an Undercover Multipurpose Anti-spoofing Kit (UnMask).",
                    "Efficiency Issues of Rete-Based Expert Systems for Misuse Detection.",
                    "Tracking Darkports for Network Defense.",
                    "Personal Privacy without Computational Obscurity: Rethinking Privacy Protection Strategies for Open Information Networks.",
                    "Distributed Secure Systems: Then and Now.",
                    "Extensible Pre-authentication Kerberos.",
                    "Quarantining Untrusted Entities: Dynamic Sandboxing Using LEAP.",
                    "Retrofitting the IBM POWER Hypervisor to Support Mandatory Access Control.",
                    "Extending the Java Virtual Machine to Enforce Fine-Grained Security Policies in Mobile Devices.",
                    "Countering False Accusations and Collusion in the Detection of In-Band Wormholes.",
                    "Efficient Distributed Detection of Node Replication Attacks in Sensor Networks.",
                    "Security Usability Principles for Vulnerability Analysis and Risk Assessment.",
                    "Breaking Visual CAPTCHAs with Naive Pattern Recognition Algorithms.",
                    "Combining Static and Dynamic Analysis for Automatic Identification of Precise Access-Control Policies.",
                    "Routing in the Dark: Pitch Black.",
                    "Centralized Security Labels in Decentralized P2P Networks.",
                    "A Taxonomy of Botnet Structures.",
                    "An Overview of the Annex System.",
                    "Efficient Detection of Delay-Constrained Relay Nodes.",
                    "Bonsai: Balanced Lineage Authentication.",
                    "Secure Input for Web Applications.",
                    "Secure and Flexible Monitoring of Virtual Machines.",
                    "Automated Format String Attack Prevention for Win32/X86 Binaries.",
                    "MetaAware: Identifying Metamorphic Malware.",
                    "Limits of Static Analysis for Malware Detection.",
                    "OmniUnpack: Fast, Generic, and Safe Unpacking of Malware.",
                    "Channels: Runtime System Infrastructure for Security-Typed Languages.",
                    "Automated Security Debugging Using Program Structural Constraints.",
                    "Fine-Grained Information Flow Analysis and Enforcement in a Java Virtual Machine.",
                    "Automated Vulnerability Analysis: Leveraging Control Flow for Evolutionary Input Crafting.",
                    "The Age of Data: Pinpointing Guilty Bytes in Polymorphic Buffer Overflows on Heap or Stack.",
                    "Spector: Automatically Analyzing Shell Code."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "22nd ACSAC 2006",
        "info": "Miami Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2006",
                "sub_name": "22nd Annual Computer Security Applications Conference (ACSAC 2006), 11-15 December 2006, Miami Beach, Florida, USA.",
                "count": 44,
                "papers": [
                    "Privacy and Security in Public Health: Maintaining the Delicate Balance between Personal Privacy and Population Safety.",
                    "Shamon: A System for Distributed Mandatory Access Control.",
                    "A Framework for a Collaborative DDoS Defense.",
                    "V-COPS: A Vulnerability-Based Cooperative Alert Distribution System.",
                    "Delegate: A Proxy Based Architecture for Secure Website Access from an Untrusted Machine.",
                    "KLASSP: Entering Passwords on a Spyware Infected Machine Using a Shared-Secret Proxy.",
                    "Vulnerability Analysis of MMS User Agents.",
                    "Backtracking Algorithmic Complexity Attacks against a NIDS.",
                    "NetSpy: Automatic Generation of Spyware Signatures for NIDS.",
                    "Detecting Policy Violations through Traffic Analysis.",
                    "Practical Attack Graph Generation for Network Defense.",
                    "Secure Distributed Cluster Formation in Wireless Sensor Networks.",
                    "Specification-Based Intrusion Detection in WLANs.",
                    "From Languages to Systems: Understanding Practical Application Development in Security-typed Languages.",
                    "An Internet Voting System Supporting User Privacy.",
                    "A Study of Access Control Requirements for Healthcare Systems Based on Audit Trails from Access Logs.",
                    "Engineering Sufficiently Secure Computing.",
                    "A Module System for Isolating Untrusted Software Extensions.",
                    "How to Automatically and Accurately Sandbox Microsoft IIS.",
                    "Data Sandboxing: A Technique for Enforcing Confidentiality Policies.",
                    "On Detecting Camouflaging Worm.",
                    "Bluetooth Worms: Models, Dynamics, and Defense Implications.",
                    "Back to the Future: A Framework for Automatic Malware Removal and System Repair.",
                    "Static Detection of Vulnerabilities in x86 Executables.",
                    "Foreign Code Detection on the Windows/X86 Platform.",
                    "PolyUnpack: Automating the Hidden-Code Extraction of Unpack-Executing Malware.",
                    "Fifteen Years after TX: A Look Back at High Assurance Multi-Level Secure Windowing.",
                    "Risks of Untrustworthiness.",
                    "Address-Space Randomization for Windows Systems.",
                    "Address Space Layout Permutation (ASLP): Towards Fine-Grained Randomization of Commodity Software.",
                    "Known/Chosen Key Attacks against Software Instruction Set Randomization.",
                    "Automatic Evaluation of Intrusion Detection Systems.",
                    "Offloading IDS Computation to the GPU.",
                    "Anomaly Based Web Phishing Page Detection.",
                    "Addressing SMTP-Based Mass-Mailing Activity within Enterprise Networks.",
                    "Using Attribute-Based Access Control to Enable Attribute-Based Messaging.",
                    "Enhancing Collaborative Spam Detection with Bloom Filters.",
                    "Extended Protection against Stack Smashing Attacks without Performance Loss.",
                    "PAST: Probabilistic Authentication of Sensor Timestamps.",
                    "Towards Database Firewall: Mining the Damage Spreading Patterns.",
                    "A General Dynamic Information Flow Tracking Framework for Security Applications.",
                    "Covert and Side Channels Due to Processor Architecture.",
                    "CryptoPage: An Efficient Secure Architecture with Memory Encryption, Integrity and Information Leakage Protection.",
                    "Protecting Privacy in Key-Value Search Systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "21st ACSAC 2005",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2005",
                "sub_name": "21st Annual Computer Security Applications Conference (ACSAC 2005), 5-9 December 2005, Tucson, AZ, USA.",
                "count": 60,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Message from Conference Chair.",
                    "Conference Committee.",
                    "Program Committee.",
                    "Tutorial Committee.",
                    "Reviewers.",
                    "Speaker Biographies.",
                    "We Need Assurance!",
                    "Model Checking An Entire Linux Distribution for Security Violations.",
                    "Strengthening Software Self-Checksumming via Self-Modifying Code.",
                    "Countering Trusting Trust through Diverse Double-Compiling.",
                    "A Framework for Detecting Network-based Code Injection Attacks Targeting Windows and UNIX.",
                    "Exploiting Independent State For Network Intrusion Detection.",
                    "A Host-Based Approach to Network Attack Chaining Analysis.",
                    "A Nitpicker's guide to a minimal-complexity secure GUI.",
                    "A User-level Framework for Auditing and Monitoring.",
                    "TARP: Ticket-based Address Resolution Protocol.",
                    "Verify Results of Network Intrusion Alerts Using Lightweight Protocol Analysis.",
                    "Replay Attack in TCG Specification and Solution.",
                    "Code Security Analysis of a Biometric Authentication System Using Automated Theorem Provers.",
                    "Automated and Safe Vulnerability Assessment.",
                    "Understanding Complex Network Attack Graphs through Clustered Adjacency Matrices.",
                    "Intrusion Detection in RBAC-administered Databases.",
                    "How Does Information Assurance R&D Impact Information Assurance in Practice? Follow the money - Where does it Go - What is our ROI?",
                    "User-Centered Security: Stepping Up to the Grand Challenge.",
                    "ScriptGen: an automated script generation tool for honeyd.",
                    "Automatic Generation of Buffer Overflow Attack Signatures: An Approach Based on Program Behavior Models.",
                    "Evolving Successful Stack Overflow Attacks for Vulnerability Testing.",
                    "Java for Mobile Devices: A Security Study.",
                    "Lessons Learned: A Security Analysis of the Internet Chess Club.",
                    "Building Evidence Graphs for Network Forensics Analysis.",
                    "Multi-Level Security Requirements for Hypervisors.",
                    "Building a MAC-Based Security Architecture for the Xen Open-Source Hypervisor.",
                    "e-NeXSh: Achieving an Effectively Non-Executable Stack and Heap via System-Call Policing.",
                    "Dynamic Taint Propagation for Java.",
                    "An Integrity Verification Scheme for DNS Zone file based on Security Impact Analysis.",
                    "Paranoid: A Global Secure File Access Control System.",
                    "How to Develop a Career in Information Assurance and How to Advance in this Field.",
                    "Looking Back at the Bell-La Padula Model.",
                    "The Pump: A Decade of Covert Fun.",
                    "Design and Implementation of an Extrusion-based Break-In Detector for Personal Computers.",
                    "Detecting Intra-enterprise Scanning Worms based on Address Resolution.",
                    "Stealth Breakpoints.",
                    "Highlights from the 2005 New Security Paradigms Workshop.",
                    "mSSL: Extending SSL to Support Data Sharing Among Collaborative Clients.",
                    "Layering Public Key Distribution Over Secure DNS using Authenticated Delegation.",
                    "PorKI: Making User PKI Safe on Machines of Heterogeneous Trustworthiness.",
                    "Uniform Application-level Access Control Enforcement of Organizationwide Policies.",
                    "Using Continuous Biometric Verification to Protect Interactive Login Sessions.",
                    "Improved Port Knocking with Strong Authentication.",
                    "Graphical Passwords: A Survey.",
                    "Have the cake and eat it too - Infusing usability into text-password based authentication systems.",
                    "Fault Attacks on Dual-Rail Encoded Systems.",
                    "Survivability Architecture of a Mission Critical System: The DPASA Example.",
                    "Generating Policies for Defense in Depth.",
                    "Defensive Execution of Transactional Processes against Attacks.",
                    "Privacy Requirements Implemented with a JavaCard.",
                    "Privacy-Preserving Alert Correlation: A Concept Hierarchy Based Approach.",
                    "Securing Email Archives through User Modeling."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "20th ACSAC 2004",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2004",
                "sub_name": "20th Annual Computer Security Applications Conference (ACSAC 2004), 6-10 December 2004, Tucson, AZ, USA.",
                "count": 41,
                "papers": [
                    "The Trustworthy Computing Security Development Lifecycle.",
                    "An Intrusion Detection Tool for AODV-Based Ad hoc Wireless Networks.",
                    "Automatic Generation and Analysis of NIDS Attacks.",
                    "Reasoning About Complementary Intrusion Evidence.",
                    "Towards Secure Design Choices for Implementing Graphical Passwords.",
                    "Visualizing and Identifying Intrusion Context from System Calls Trace.",
                    "Visualizing Enterprise-Wide Security (VIEWS).",
                    "A Dynamic Technique for Eliminating Buffer Overflow Vulnerabilities (and Other Memory Errors).",
                    "Detecting Kernel-Level Rootkits Through Binary Analysis.",
                    "Detecting Exploit Code Execution in Loadable Kernel Modules.",
                    "The Relationship of System & Product Specifications and Evaluations.",
                    "Using Predators to Combat Worms and Viruses: A Simulation-Based Study.",
                    "High-Fidelity Modeling of Computer Network Worms.",
                    "Worm Detection, Early Warning and Response Based on Local Victim Information.",
                    "Cozilet: Transparent Encapsulation to Prevent Abuse of Trusted Applets.",
                    "Extracting Attack Manifestations to Determine Log Data Requirements for Intrusion Detection.",
                    "Detecting Attacks That Exploit Application-Logic Errors Through Application-Level Auditing.",
                    "Design, Implementation, and Evaluation of A Repairable Database Management System.",
                    "RACOON: Rapidly Generating User Command Data For Anomaly Detection From Customizable Templates.",
                    "If A1 is the Answer, What was the Question? An Edgy Na?f's Retrospective on Promulgating the Trusted Computer Systems Evaluation Criteria.",
                    "A Look Back at \"Security Problems in the TCP/IP Protocol Suite\".",
                    "Vulnerabilities and Security Threats in Structured Overlay Networks: A Quantitative Analysis.",
                    "Securing Java RMI-Based Distributed Applications.",
                    ".NET Security: Lessons Learned and Missed from Java.",
                    "Tracing the Root of \"Rootable\" Processes.",
                    "Open-Source Applications of TCPA Hardware.",
                    "Security Policies to Mitigate Insider Threat in the Document Control Domain.",
                    "Nabs: A System for Detecting Resource Abuses via Characterization of Flow Content Type.",
                    "Static Analyzer of Vicious Executables (SAVE).",
                    "CTCP: A Transparent Centralized TCP/IP Architecture for Network Security.",
                    "The Cyber Enemy Within ... Countering the Threat from Malicious Insiders.",
                    "Correlating Intrusion Events and Building Attack Scenarios Through Attack Graph Distances.",
                    "Alert Correlation through Triggering Events and Common Resources.",
                    "Attack Plan Recognition and Prediction Using Causal Networks.",
                    "Themes and Highlights of the New Security Paradigms Workshop 2004.",
                    "PEACE: A Policy-Based Establishment of Ad-hoc Communities.",
                    "Role-Based Delegation Model/ Hierarchical Roles (RBDM1).",
                    "Mohammad A. Al-Kahtani, Ravi Sandhu.",
                    "Designing Good Deceptions in Defense of Information Systems.",
                    "A Serial Combination of Anomaly and Misuse IDSes Applied to HTTP Traffic.",
                    "Securing a Remote Terminal Application with a Mobile Trusted Device."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "19th ACSAC 2003",
        "info": "Las Vegas, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2003",
                "sub_name": "19th Annual Computer Security Applications Conference (ACSAC 2003), 8-12 December 2003, Las Vegas, NV, USA.",
                "count": 43,
                "papers": [
                    "MLS-PCA: A High Assurance Security Architecture for Future Avionics.",
                    "Bayesian Event Classification for Intrusion Detection.",
                    "Intrusion Detection: A Bioinformatics Approach.",
                    "A Stateful Intrusion Detection System for World-Wide Web Servers.",
                    "Behavioral Authentication of Server Flows.",
                    "A Multi-View Tool for Checking the Security Semantics of Router Configurations.",
                    "S-ARP: a Secure Address Resolution Protocol.",
                    "Design, Implementation and Test of an Email Virus Throttle.",
                    "Efficient Minimum-Cost Network Hardening Via Exploit Dependency Graphs.",
                    "An IP Traceback Technique against Denial-of-Service Attacks.",
                    "Forum Session: Security for Wireless Sensor Networks.",
                    "An Intrusion-Tolerant Password Authentication System.",
                    "Modeling of Multiple Agent based Cryptographic Key Recovery Protocol.",
                    "Practical Random Number Generation in Software.",
                    "Multi-Version Attack Recovery for Workflow System.",
                    "Automatic Reassembly of Document Fragments via Context Based Statistical Models.",
                    "Automated Analysis for Digital Forensic Science: Semantic Integrity Checking.",
                    "Honeypots: Catching the Insider Threat.",
                    "Isolated Program Execution: An Application Transparent Approach for Executing Untrusted Programs.",
                    "How to unwittingly sign non-repudiable documents with Java applications.",
                    "Making Secure TCP Connections Resistant to Server Failures.",
                    "PSOS Revisited.",
                    "A Failure to Learn from the Past.",
                    "Collaborative Intrusion Detection System (CIDS): A Framework for Accurate and Efficient IDS.",
                    "Attack Signature Matching and Discovery in Systems Employing Heterogeneous IDS.",
                    "Log Correlation for Intrusion Detection: A Proof of Concept.",
                    "Protecting Personal Data: Can IT Security Management Standards Help?",
                    "An Editor for Adaptive XML-Based Policy Management of IPsec.",
                    "Security Design in Online Games.",
                    "Security Analysis of the SAML Single Sign-on Browser/Artifact Profile.",
                    "Scalable and Efficient PKI for Inter-Organizational Communication.",
                    "A Policy Validation Framework for Enterprise Authorization Specification.",
                    "Themes and Highlights of the New Security Paradigms Workshop 2003.",
                    "Goalkeeper: Close-In Interface Protection.",
                    "Poly2 Paradigm: A Secure Network Service Architecture.",
                    "Defending Embedded Systems Against Buffer Overflow via Hardware/Software.",
                    "Experimenting with a Policy-Based HIDS Based on an Information Flow Control Model.",
                    "An Experience Developing an IDS Stimulator for the Black-Box Testing of Network Intrusion Detection Systems.",
                    "Synthesizing Test Data for Fraud Detection Systems.",
                    "Differential Data Protection for Dynamic Distributed Application.",
                    "Usable Access Control for the World Wide Web.",
                    "Modelling Contexts in the Or-BAC Model.",
                    "Miracle Cures and Toner Cartridges: Finding Solutions to the Spam Problem."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "18th ACSAC 2002",
        "info": "Las Vegas, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2002",
                "sub_name": "18th Annual Computer Security Applications Conference (ACSAC 2002), 9-13 December 2002, Las Vegas, NV, USA.",
                "count": 41,
                "papers": [
                    "GOSSIB vs. IP Traceback Rumors.",
                    "Composable Tools For Network Discovery and Security Analysis.",
                    "Representing TCP/IP Connectivity For Topological Analysis of Network Security.",
                    "Regulating E-Commerce through Certified Contracts.",
                    "With Gaming Technology towards Secure User Interfaces.",
                    "Protecting Web Usage of Credit Cards Using One-Time Pad Cookie Encryption.",
                    "Throttling Viruses: Restricting propagation to defeat malicious mobile code.",
                    "Enforcing Resource Bound Safety for Mobile SNMP Agents.",
                    "Security of Internet Location Management.",
                    "Wireless Security: Vulnerabilities and Countermeasures.",
                    "LOCK : An Historical Perspective.",
                    "A Practical Approach to Identifying Storage and Timing Channels: Twenty Years Later.",
                    "Thirty Years Later: Lessons from the Multics Security Evaluation.",
                    "Controlled Physical Random Functions.",
                    "A Security Architecture for Object-Based Distributed Systems.",
                    "A Secure Directory Service based on Exclusive Encryption.",
                    "Penetration Testing: A Duet.",
                    "Protecting Data from Malicious Software.",
                    "Safe Virtual Execution Using Software Dynamic Translation.",
                    "Digging For Worms, Fishing For Answers.",
                    "A Framework for Organisational Control Principles.",
                    "Reusable Components for Developing Security-Aware Application.",
                    "A Context-Aware Security Architecture for Emerging Applications.",
                    "Voice over IPsec: Analysis and Solutions.",
                    "Networking in The Solar Trust Model: Determining Optimal Trust Paths in a Decentralized Trust Network.",
                    "Gender-Preferential Text Mining of E-mail Discourse.",
                    "Enterprise Engineering And Security: Enterprise Frameworks and Architectures, and IA Patterns.",
                    "Themes and Highlights of the New Security Paradigms Workshop 2002.",
                    "Evaluating the Impact of Automated Intrusion Response Mechanisms.",
                    "Architectures for Intrusion Tolerant Database Systems.",
                    "Detecting and Defending against Web-Server Fingerprinting.",
                    "Advanced Features for Enterprise-Wide Role-Based Access Control.",
                    "Access Control for Active Spaces.",
                    "A Model for Attribute-Based User-Role Assignment.",
                    "Intrusion Detection: Current Capabilities and Future Directions.",
                    "Did You Ever Have To Make Up Your Mind? What Notes Users Do When Faced With A Security Decision.",
                    "A Financial Institution's Legacy Mainframe Access Control System in Light of the Proposed NIST RBAC Standard.",
                    "Security Architecture of the Austrian Citizen Card Concept.",
                    "Malicious Code Detection for Open Firmware.",
                    "Beyond the Perimeter: the Need for Early Detection of Denial of Service Attacks.",
                    "A Toolkit for Detecting and Analyzing Malicious Software."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "17th ACSAC 2001",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2001",
                "sub_name": "17th Annual Computer Security Applications Conference (ACSAC 2001), 11-14 December 2001, New Orleans, Louisiana, USA.",
                "count": 47,
                "papers": [
                    "IntruDetector: A Software Platform for Testing Network Intrusion Detection Algorithms.",
                    "Mining Alarm Clusters to Improve Alarm Handling Efficiency.",
                    "Managing Alerts in a Multi-Intrusion Detection Environmen.",
                    "Implementing the Intrusion Detection Exchange Protocol.",
                    "Information Flow Analysis of Component-Structured Applications.",
                    "Security Policy Enforcement at the File System Level in the Windows NT Operating System Family.",
                    "Java Security Extensions for a Java Server in a Hostile Environment.",
                    "Genoa TIE, Advanced Boundary Controller Experiment.",
                    "A JCA-Based Implementation Framework for Threshold Cryptography.",
                    "The Performance Measurement of Cryptographic Primitives on Palm Devices.",
                    "Privacy-Preserving Cooperative Statistical Analysis.",
                    "Experiences Implementing a Common Format for IDS Alerts.",
                    "Detecting Conflicts in a Role-Based Delegation Model.",
                    "Engineering of Role/Permission Assignments.",
                    "A Framework for Multiple Authorization Types in a Healthcare Application System.",
                    "Determining Privileges of Mobile Agents.",
                    "Introduction to Classic Papers.",
                    "Building Reliable Secure Computing Systems out of Unreliable Insecure Components.",
                    "A Security Model for Military Message Systems: Retrospective.",
                    "An Information Flow Tool for Gypsy.",
                    "Information Security: Science, Pseudoscience, and Flying Pigs.",
                    "DAIS: A Real-Time Data Attack Isolation System for Commercial Database Applications.",
                    "Watcher: The Missing Piece of the Security Puzzle.",
                    "eXpert-BSM: A Host-Based Intrusion Detection Solution for Sun Solaris.",
                    "Temporal Signatures for Intrusion Detection.",
                    "Securing Web Servers against Insider Attack .",
                    "Enabling Hierarchical and Bulk-Distribution for Watermarked Content.",
                    "CONSEPP: CONvenient and Secure Electronic Payment Protocol Based on X9.59.",
                    "Wired versus Wireless Security: The Internet, WAP and iMode for E-Commerce.",
                    "A Component-Based Architecture for Secure Data Publication.",
                    "The Authorization Service of Tivoli Policy Director.",
                    "Architecture and Applications for a Distributed Embedded Firewall.",
                    "How Useful is Software Fault Injection for Evaluating the Security of COTS Products?",
                    "Security Vendor CTOs: Perspectives, Opinions, and Lessons Learned.",
                    "Practical Automated Filter Generation to Explicitly Enforce Implicit Input Assumptions.",
                    "Why Information Security is Hard-An Economic Perspective.",
                    "Abuse-Case-Based Assurance Arguments.",
                    "A Regulated Approach to Certificate Management.",
                    "Restricting Access with Certificate Attributes in Multiple Root Environments-A Recipe for Certificate Masquerading.",
                    "Secure Blue: An Architecture for a Scalable, Reliable, High Volume SSL Internet Server.",
                    "Secure Anonymous Group Infrastructure for Common and Future Internet Applications.",
                    "Mitigating Distributed Denial of Service Attacks with Dynamic Resource Pricing.",
                    "Requirements for a General Framework for Response to Distributed Denial-of-Service.",
                    "Trustworthiness in Distributed Electronic Healthcare Records-Basis for Shared Care.",
                    "Application Intrusion Detection using Language Library Calls.",
                    "Verifiable Identifiers in Middleware Security.",
                    "Computing Without Wires (Or Even a Net): The Pitfalls, Potentials, and Practicality of Wireless Networking."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "16th ACSAC 2000",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/2000",
                "sub_name": "16th Annual Computer Security Applications Conference (ACSAC 2000), 11-15 December 2000, New Orleans, Louisiana, USA.",
                "count": 42,
                "papers": [
                    "Security Against Compelled Disclosure.",
                    "Security Agility in Response to Intrusion Detection.",
                    "Two State-based Approaches to Program-based Anomaly Detection.",
                    "Denial of Service Protection - The Nozzle.",
                    "Virtual Enterprise Networks: The Next Generation of Secure Enterprise Networking.",
                    "Enabling Secure On-Line DNS Dynamic Update.",
                    "Layering Boundary Protections: An Experiment in Information Assurance.",
                    "Extending Java for Package based Access Control.",
                    "Secure Smart Homes using Jini and UIUC SESAME.",
                    "Implementing Security Policies using the Safe Areas of Computation Approach.",
                    "Policy Mediation for Multi-Enterprise Environments.",
                    "Protection Profiles for Remailer Mixes -Do the New Evaluation Criteria Help?",
                    "Binding Identities and Attributes using Digitally Signed Certificates.",
                    "Applications in Health Care using Public-Key Certificates and Attribute Certificates.",
                    "Scalable Policy Driven and General Purpose Public Key Infrastructure (PKI).",
                    "A Policy-based Access Control Mechanism for the Corporate Web.",
                    "Dynamic Access Control through Petri Net Workflows.",
                    "Framework for Role-based Delegation Models.",
                    "A Network Audit System for Host-based Intrusion Detection (NASHID) in Linux.",
                    "Less Harm, Less Worry or How to Improve Network Security by Bounding System Offensiveness.",
                    "A Self-Extension Monitoring for Security Management.",
                    "Security Architecture for Federated Cooperative Information Systems.",
                    "Secure Compartmented Data Access over an Untrusted Network using a COTS-based Architecture.",
                    "Security Architectures for Controlled Digital Information Dissemination.",
                    "Using Operating System Wrappers to Increase the Resiliency to Commercial Firewalls.",
                    "On Computer Viral Infection and the Effect of Immunization.",
                    "ITS4: A Static Vulnerability Scanner for C and C++ Code.",
                    "A Novel Approach to On-Line Status Authentication of Public-Key Certificates.",
                    "A Reliable, Scalable General-Purpose Certificate Store.",
                    "Introducing Decryption Authority into PKI.",
                    "Using Attribute Certificates with Mobile Policies in Electronic Commerce Applications.",
                    "Experience with Software Watermarking.",
                    "Efficient Commerce Protocols based on One-Time Pads.",
                    "Policy-based Authentication and Authorization: Secure Access to the Network Infrastructure.",
                    "Calculating Costs for Quality of Security Service.",
                    "Usability Meets Security -The Identity-Manager as Your Personal Security Assistant for the Internet.",
                    "A Flexible Access Control Service for Java Mobile Code.",
                    "Personal Security Environment on Palm PDA.",
                    "History-based Distributed Filtering - A Tagging Approach to Network-Level Access Control.",
                    "The Chinese Remainder Theorem and its Application in a High-Speed RSA Crypto Chip.",
                    "Fair On-line Gambling.",
                    "An High-Speed ECC-based Wireless Authentication Protocol on an ARM Microprocessor."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "15th ACSAC 1999",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1999",
                "sub_name": "15th Annual Computer Security Applications Conference (ACSAC 1999), 6-10 December 1999, Scottsdale, AZ, USA.",
                "count": 43,
                "papers": [
                    "How to Cheat at the Lottery (or, Massively Parallel Requirements Engineering).",
                    "Modular Fair Exchange Protocols for Electronic Commerce.",
                    "Trustworthy Access Control with Untrustworthy Web Servers.",
                    "A Language for Modeling Secure Business Transactions.",
                    "Safe Areas of Computation for Secure Computing with Insecure Applications.",
                    "Architecture and Concepts of the ARGuE Guard.",
                    "Using Abuse Case Models for Security Requirements Analysis.",
                    "A Parallel Packet Screen for High Speed Networks.",
                    "An Asynchronous Distributed Access Control Architecture for IP over ATM Networks.",
                    "Secure Communications in ATM Networks.",
                    "Using Checkable Types in Automatic Protocol Analysis.",
                    "SCR: A Practical Approach to Building a High Assurance COMSEC System.",
                    "Application-Level Isolation Using Data Inconsistency Detection.",
                    "A Prototype Secure Workflow Server.",
                    "Napoleon: A Recipe for Workflow.",
                    "Tools to Support Secure Enterprise Computing.",
                    "An Effective Defense Against First Party Attacks in Public-Key Algorithms.",
                    "Towards a Practical, Secure, and Very Large Scale Online Election.",
                    "Design of LAN-Lock, A System for Securing Wireless Networks.",
                    "Toward a Taxonomy and Costing Method for Security Services.",
                    "TrustedBox: A Kernel-Level Integrity Checker.",
                    "Adding Availability to Log Services of Untrusted Machines.",
                    "Policy-Based Management: Bridging the Gap.",
                    "Security Policy Coordination for Heterogeneous Information Systems.",
                    "The ARBAC99 Model for Administration of Roles.",
                    "A Distributed Certificate Management System (DCMS) Supporting Group-Based Access Controls.",
                    "Fast Checking of Individual Certificate Revocation on Small Systems.",
                    "A Model of Certificate Revocation.",
                    "Information Security Education for the Next Millennium: Building the Next Generation of Practitioners (Forum).",
                    "Generic Support for PKIX Certificate Management in CDSA.",
                    "Efficient Certificate Status Handling Within PKIs: An Application to Public Administration Services.",
                    "User Authentication and Authorization in the Java(tm) Platform.",
                    "Transactions in Java Card.",
                    "Legal and Technical Responses to Protecting the U. S. Critical Infrastructures (Panel).",
                    "A Middleware Approach to Asynchronous and Backward Compatible Detection and Prevention of ARP Cache Poisoning.",
                    "A Resource Access Decision Service for CORBA-Based Distributed Systems.",
                    "Non-repudiation Evidence Generation for CORBA using XML.",
                    "Security Relevancy Analysis on the Registry of Windows NT 4.0.",
                    "Security Architecture Development and Results for a Distributed Modeling and Simulation System .",
                    "SecurSight: An Architecture for Secure Information Access.",
                    "SAM: Security Adaptation Manager .",
                    "An Application of Machine Learning to Network Intrusion Detection.",
                    "A Process State-Transition Analysis and Its Application to Intrusion Detection."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "14th ACSAC 1998",
        "info": "Scottsdale, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1998",
                "sub_name": "14th Annual Computer Security Applications Conference (ACSAC 1998), 7-11 December 1998, Scottsdale, AZ, USA.",
                "count": 35,
                "papers": [
                    "How to Increase Security in Mobile Networks by Anomaly Detection.",
                    "An Architecture for Intrusion Detection Using Autonomous Agents.",
                    "NetSTAT: A Network-Based Intrusion Detection Approach.",
                    "The RRA97 Model for Role-Based Administration of Role Hierarchies.",
                    "Role-Based Access Control Framework for Network Enterprises.",
                    "Concentric Supervision of Security Applications: A New Security Management Paradigm.",
                    "Application-Level Isolation to Cope with Malicious Database Users.",
                    "Maintaining Security in Firm Real-Time Database Systems.",
                    "Towards an Infrastructure for MLS Distributed Computing.",
                    "Protecting Web Servers from Security Holes in Server-Side Includes.",
                    "Rule-Based Filtering for Java Applets.",
                    "Controlling Applets' Behavior in a Browser.",
                    "Wachet auf! Computer Security and the Millenium.",
                    "A Scheme for Analyzing Electronic Payment Systems.",
                    "Multifunctional Smart Cards for Electronic Commerce-Application of the Role and Task-Based Security Model.",
                    "Modeling Secure and Fair Electronic Commerce.",
                    "Security Architecture for a Virtual Heterogeneous Machine.",
                    "Authorization in Enterprise-Wide Distributed System: A Practical Design and Application.",
                    "Private Desktops and Shared Store.",
                    "A Hardware-Independent Encryption Model for ATM Devices.",
                    "Secure Signaling and Access Control for ATM Networks.",
                    "Security Services in an Open Service Environment.",
                    "ID-Based Cryptographic Schemes Using a Non-Interactive Public-Key Distribution System.",
                    "Two Improved Algorithms and Hardware Implementations for Key Distribution Using Extended Programmable Cellular Automata.",
                    "Complexity Measure of Encryption Keys Used for Securing Computer Networks.",
                    "Detecting Anomalous and Unknown Intrusions Against Programs.",
                    "Intrusion Detection Applying Machine Learning to Solaris Audit Data.",
                    "Selection Criteria for Intrusion Detection Systems.",
                    "Anonymous Secure E-Voting Over a Network.",
                    "The Solar Trust Model: Authentication Without Limitation.",
                    "Mutual Authentication, Confidentiality, and Key Management (MACKMAN) System for Mobile Computing and Wireless Communication.",
                    "An Environment for the Specification and Analysis of Cryptoprotocols.",
                    "A Practical Approach to Measuring Assurance.",
                    "A Certified E-Mail Protocol.",
                    "Electronic Submission Protocol Based on Temporal Accountability."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "13th ACSAC 1997",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1997",
                "sub_name": "13th Annual Computer Security Applications Conference (ACSAC 1997), 8-12 December 1997, San Diego, CA, USA.",
                "count": 29,
                "papers": [
                    "Micro-Digital Money for Electronic Commerce.",
                    "Secure and Efficient Digital Coins.",
                    "The Secure Distribution of Digital Contents.",
                    "Simple Assured Bastion Hosts.",
                    "Kernel and Shell-Based Applications Integrity Assurance.",
                    "Risk Assessment for Large Heterogeneous Systems.",
                    "Securing an Object Relational Database.",
                    "Supporting Secure Canonical Upgrade Policies in Multilevel Secure Object Stores.",
                    "Incremental Assurance for Multilevel Applications.",
                    "An Efficient Message Authentication Scheme for Link State Routing.",
                    "Detection and Classification of TCP/IP Network Services.",
                    "Achieving User Privacy in Mobile Networks.",
                    "Domain and Type Enforcement Firewalls.",
                    "A Reference Model for Firewall Technology.",
                    "Using Type Enforcement to Assure a Configurable Guard.",
                    "Implementing RBAC on a Type Enforced System.",
                    "Lattice Based Models for Controlled Sharing of Confidential Information in the Saudi Hajj System.",
                    "Using Kernel Hypervisors to Secure Applications.",
                    "Applying the DOD Goal Security Architecture as a Methodology for the Development of System and Enterprise Security Architecture.",
                    "An Architecture for Multilevel Secure Interoperability.",
                    "Using Web Technologies in Two MLS Environments: A Security Analysis.",
                    "On the Key Recovery of the Key Escrow System.",
                    "Threshold and Generalized DSS Signatures without a Trusted Party.",
                    "An Improved E-Mail Security Protocol.",
                    "Remote Electronic Gambling.",
                    "Ethical Responsibilities and Legal Liabilities of Network Security Professionals.",
                    "PCASSO: Applying and Extending State-of-the-Art Security in the Healthcare Domain.",
                    "Doc, Wyatt, and Virgil: Prototyping Storage Jamming Defenses.",
                    "Protecting Unattended Computers Without Software."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "12th ACSAC 1996",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1996",
                "sub_name": "12th Annual Computer Security Applications Conference (ACSAC 1996), 9-13 December 1996, San Diego, CA, USA.",
                "count": 28,
                "papers": [
                    "An Evaluation of the Java Security Model.",
                    "Implementing Security Policy in a Large Defense Procurement.",
                    "An Authenticated Camera.",
                    "A Case Study Of Two Nrl Pump Prototypes.",
                    "Asymmetric Isolation.",
                    "Starlight: Interactive Link.",
                    "Common Criteria Activities and Alternative Assurance.",
                    "SSE-CMM Pilot Results.",
                    "Security Measures For The Austrian \"Paychip\" Electronic Purse Application.",
                    "On The Design Of Secure Electronic Payment Schemes For Internet.",
                    "Innovative Secure Payments On The Internet Using The German Electronic Purse.",
                    "Proxies For Anonymous Routing.",
                    "esign Choices For Symmetric Key Based Inter-Domain Authentication Protocols In Distributed Systems.",
                    "Verifying The Correctness Of Cryptographic Protocols Using \"Convince\".",
                    "Security Issues in an EDI Environment.",
                    "Security and the National Telecommunications Infrastructure.",
                    "Using Fortezza For Transparent File Encryption.",
                    "An Extended Capability Architecture To Enforce Dynamic Access Control Policies.",
                    "SIGMA: Security For Distributed Object Interoperability Between Trusted And Untrusted Systems.",
                    "Operation chain link: the deployment of a firewall at Hanscom Air Force Base.",
                    "Mandatory Protection for Internet Server Software.",
                    "Using a Proxy X Server to Facilitate COTS Application Integration.",
                    "A Comparison of Multilevel Structured Query Language (SQL) Implementations.",
                    "A Role-Based Secure Database Design Tool.",
                    "Case-Based Reasoning for Intrusion Detection.",
                    "A Modular Covert Channel Analysis Methodology for Trusted DG/UXTM.",
                    "Formal Techniques for an ITSEC-E4 Secure Gateway.",
                    "Major Questions in Applying the SSE-CMM."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "10th ACSAC 1994",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1994",
                "sub_name": "10th Annual Computer Security Applications Conference, ACSAC 1994, 5-9 December, 1994 Orlando, FL, USA.",
                "count": 32,
                "papers": [
                    "A practical approach to high assurance multilevel secure computing service.",
                    "Security concerns for distributed systems.",
                    "Security for the Common Object Request Broker Architecture (CORBA).",
                    "Composing system integrity using I/O automata.",
                    "Applying the Abadi-Lamport composition theorem in real-world secure system integration environments.",
                    "Role-based access control: a multi-dimensional view.",
                    "Secure system composition: five practical initiatives.",
                    "Architectural impact on performance of a multilevel database system.",
                    "Benchmarking multilevel secure database systems using the MITRE benchmark.",
                    "Organizing MLS databases from a data modelling point of view.",
                    "A practical approach to user authentication.",
                    "Audit reduction and misuse detection in heterogeneous environments: framework and application.",
                    "The design of an audit trail analysis tool.",
                    "Automated detection of vulnerabilities in privileged programs by execution monitoring.",
                    "Networked information discovery and retrieval tools: security capabilities and needs.",
                    "Property-based testing of privileged programs.",
                    "STU-III-multilevel secure computer interface.",
                    "A prototype multilevel-secure DoD directory.",
                    "A validated security policy modeling approach.",
                    "A secure Email gateway (building an RCAS external interface).",
                    "The MITRE security perimeter.",
                    "EINet: a secure, open network for electronic commerce.",
                    "System-of-systems security engineering.",
                    "AOS: an avionics operating system for multi-level secure real-time environments.",
                    "The effects of trusted technology on distributed applications.",
                    "Availability: theory and fundamentals for practical evaluation and use.",
                    "Ops/Intel interface lessons learned: the integrator's perspective.",
                    "Using security models to investigate CMW design and implementation.",
                    "Performance analysis of a method for high level prevention of traffic analysis using measurements from a campus network.",
                    "Where we stand in multilevel security (MLS): requirements, approaches, issues, and lessons learned.",
                    "Editorial: why bad things happen to good systems, and what to do about it.",
                    "Editorial: a view of cryptography in TCSEC products."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "9th ACSAC 1993",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1993",
                "sub_name": "Ninth Annual Computer Security Applications Conference, ACSAC 1993, 6-10 Decemver, 1993, Orlando, Florida, USA.",
                "count": 28,
                "papers": [
                    "COMPUSEC, a personal view.",
                    "Integration of security services into the NORAD/USSPACECOM technical infrastructure: a case study.",
                    "A methodology for the use of single level RDBMS software in a multi-level secured system.",
                    "Migrating a commercial-off-the-shelf application to a multilevel secure environment.",
                    "Operational requirements for multilevel security.",
                    "Specification issues of secure systems.",
                    "Security policy in a complex logistics procurement.",
                    "Using logics to detect implementation-dependent flaws [cryptographic protocol design].",
                    "A second look at the SDNS key management protocol.",
                    "Transparent cosignatures for electronic documents.",
                    "MLS file service for network data sharing.",
                    "Heterogeneous workstation to STU-III prototype.",
                    "Transmission schedules to prevent traffic analysis.",
                    "Effects of multilevel security on real-time applications.",
                    "Real-time trust with 'System Build': lessons learned.",
                    "Modeling constructs for describing a complex system-of-systems.",
                    "On the shortest path to network security.",
                    "A rigorous approach to determining objects.",
                    "The rationale behind the Canadian criteria.",
                    "Expressive power of the single-object typed access matrix model.",
                    "Representation of mental health application access policy in a monotonic model.",
                    "Applying noninterference to composition of systems: a more practical approach.",
                    "MultiView model for object-oriented database.",
                    "Database design and MLS DBMSs: an unhappy alliance?",
                    "The deductive filter approach to MLS database prototyping.",
                    "User interface for a high assurance, windowing system.",
                    "C2 auditing in the X Display Manager.",
                    "Improved password mechanisms through expert system technology."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "8th ACSAC 1992",
        "info": "San Antonio, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1992",
                "sub_name": "Eighth Annual Computer Security Applications Conference, ACSAC 1992, November 30 - December 4, 1992, San Antonio, Texas, USA.",
                "count": 24,
                "papers": [
                    "Computer security myths mythtakes or 'The real security problem is...'.",
                    "Secure system architectures and integration.",
                    "Trustable computing in next-generation avionic architectures.",
                    "Security Products (Security Pro) Transition Analysis Facility (STAF): Pragmatic concepts for MLS technology transition.",
                    "Integrating cryptography into trusted systems: A criteria approach.",
                    "Security test and evaluation for multilevel-mode accreditation: Lessons learned.",
                    "An overview of the AMC WWMCCS CAT Guard.",
                    "A conceptual model for computer security risk analysis.",
                    "An application of qualitative risk analysis to computer security for the commercial sector.",
                    "Security constraint processing during multilevel secure database design.",
                    "Providing security in a phone book database using triggers.",
                    "Trusted RUBIX architecture and policy model interpretation.",
                    "Secure composition of systems.",
                    "Performance analysis of a method for high level prevention of traffic analysis.",
                    "Implementing transaction control expressions by checking for absence of access rights.",
                    "A comparison of trusted X security policies, architectures, and interoperability.",
                    "A cautionary note on image downgrading.",
                    "Access control and applications on trusted systems.",
                    "SNPP: A simple network payment protocol.",
                    "Dealing with the dynamics of security: Flexibility with utility in an MLS LAN.",
                    "Standards for computer systems security: An interoperability analysis of SDNS SP3 and ISO NLSP.",
                    "Paradigms for verification of authorization at source of electronic documents in an integrated environment.",
                    "A generic virus scanner for C++.",
                    "Penetration state transition analysis: A rule-based intrusion detection approach."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "7th ACSAC 1991",
        "info": "San Antonio, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1991",
                "sub_name": "Seventh Annual Computer Security Applications Conference, ACSAC 1991, 2-6 December, 1991, San Antonio, Texas, USA.",
                "count": 24,
                "papers": [
                    "A single-level scheduler for the replicated architecture for multilevel-secure databases.",
                    "Using polyinstantiation to develop an MLS application.",
                    "Security constraint processing during the update operation in a multilevel secure database management system.",
                    "Towards trusted cut and paste in the X Window System.",
                    "A prototype B3 trusted X Window System.",
                    "An implementation of access control using a salient feature of primes.",
                    "Network auditing: issues and recommendations.",
                    "Real-time anomaly detection using a nonparametric pattern recognition approach.",
                    "An audit model for object-oriented databases.",
                    "High level prevention of traffic analysis.",
                    "Security modelling using hierarchical state machines.",
                    "Modeling internal controls of automated teller machine (ATM) systems: A computerized decision aid for design and evaluation.",
                    "Verification of the security of a secure network component.",
                    "To Bell and back: developing a formal security policy model for a C 2 system.",
                    "A distributed implementation of the extended schematic protection model.",
                    "A multilevel secure relational data model based on views.",
                    "Domain reduction dependencies: A new type of dependency for statistical database security.",
                    "Complete containment sets and their application to the inference problem.",
                    "Fielding multilevel security into command and control systems.",
                    "Proposed security for critical Air Force missions.",
                    "Considerations for applying disk encryptors to environments subject to hostile overrun.",
                    "Security considerations in the acquisition of computer systems.",
                    "Observations on integrating multilevel secure components into system high distributed systems.",
                    "Rebus passwords."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "6th ACSAC 1990",
        "info": "Tucson, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1990",
                "sub_name": "Sixth Annual Computer Security Applications Conference, ACSAC 1990, 3-7 December, 1990, Tucson, Arizona, USA.",
                "count": 45,
                "papers": [
                    "Professional certification for computer security professionals.",
                    "Professional certification for security practitioners.",
                    "Extending the creation operation in the Schematic Protection Model.",
                    "ICCP Systems Security specialty exam.",
                    "A solution to the cascade problem for dynamic network.",
                    "An example application of the trusted network interpretation.",
                    "A security analysis of the NTP protocol version 2.",
                    "Formal specification and verification of control software for cryptographic equipment.",
                    "Hierarchical group oriented key management method HGK.",
                    "Integrating cryptography in the trusted computing base.",
                    "On models for a trusted application system.",
                    "A multilevel security model for a distributed object-oriented system.",
                    "Entropy as a measure of database information.",
                    "Secure query processing in distributed database management systems-design and performance studies.",
                    "Update semantics for multilevel relations.",
                    "Natural change in dynamic databases as a deterrent to compromise by trackers.",
                    "Architecture for an embedded secure data base management system.",
                    "Single-level multiversion schedulers for multilevel secure database systems.",
                    "Multilevel security for knowledge based systems.",
                    "ODA and POSIX: label liaisons.",
                    "Network management security.",
                    "The lowdown on lower layer security protocols.",
                    "The Canadian trusted computer product evaluation criteria.",
                    "MLS and trust issues at the user interface in MLS AISs.",
                    "An advanced process model's application to trusted X Window system development.",
                    "A prototype for Trusted X labeling policies.",
                    "An evaluation system for the physical security of computing systems.",
                    "A brief comparison of two different environmental guidelines for determining 'levels of trust' [computer security].",
                    "CERTS: a comparative evaluation method for risk management methodologies and tools.",
                    "Is your computer being misused? A survey of current intrusion detection system technology.",
                    "IDES: a progress report [Intrusion-Detection Expert System].",
                    "Probabilistic measure on aggregations [data security].",
                    "Software checking with the Auditor's Aid.",
                    "A comparison of type enforcement and Unix setuid implementation of well-formed transactions.",
                    "Software safety and security.",
                    "A comparison of secure UNIX operating systems.",
                    "Process Execution Controls: revisited.",
                    "Security pipeline interface (SPI).",
                    "An authorization plan for commercial service systems.",
                    "An n-grid model for group authorization.",
                    "Model of access control policy for civil agencies.",
                    "A multilevel-mode system for space applications: lessons learned.",
                    "Successful acquisition of certifiable application systems (or: How not to shake hands with the tar baby).",
                    "Informal top-level specifications for trusted application systems.",
                    "Rehosting existing command and control systems into a multilevel secure environment."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "5th ACSAC 1989",
        "info": "Tucson, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acsac/1989",
                "sub_name": "Fifth Annual Computer Security Applications Conference, ACSAC 1989, 4-8 December, 1989, Westward Look Resort, Tucson, Arizona, USA.",
                "count": 61,
                "papers": [
                    "RADC database security workshop oracle corporation homework problem solution.",
                    "Computer security and air traffic automation.",
                    "A perspective on integrity mechanisms.",
                    "Does TCB subsetting enhance trust?",
                    "Integrity panel position paper.",
                    "A summary of the Unisys experience with GEMSOS.",
                    "Assessment of security requirements for sensitive systems.",
                    "Electronic messaging security: a comparison of three approaches.",
                    "A summary of the LDV solution to the homework problem.",
                    "Auditing: a relevant contribution to trusted database management systems.",
                    "TCB subset architecture.",
                    "Challenges faced today by computer security practitioners.",
                    "Secure database design: an implementation using a secure DBMS.",
                    "Secure database design panel.",
                    "End-to-end encryption at the network layer.",
                    "A security standard for LANs.",
                    "A structured risk analysis approach to resolve the data protection and integrity issues for computer-aided acquisition logistics support (CALS).",
                    "Electronic information security in a digital environment.",
                    "The CALS Data Protection and Integrity Industry Working Group.",
                    "Data protection requirements in computer-aided acquisition and logistic support.",
                    "Human issues.",
                    "Implementing sensitive but unclassified security, today-a workshop proposal.",
                    "The role of vulnerability in risk management.",
                    "Intrusion and anomaly detection in trusted systems.",
                    "A model of security monitoring.",
                    "An approach for evaluating the security of an Air Force type network.",
                    "Security standards for open systems.",
                    "Protection of call detail records data in federal telecommunications.",
                    "Security audit for embedded avionics systems.",
                    "Development of a multi level data generation application for GEMSOS.",
                    "Designing a trusted client-server distributed network.",
                    "The security policy of the secure distributed operating system prototype.",
                    "Considerations on TCB subsetting.",
                    "Gemini developers: facts, myths, and war stories.",
                    "Process execution controls as a mechanism to ensure consistency.",
                    "Architectural support of fine-grained secure computing.",
                    "Access control by Boolean expression evaluation.",
                    "ADP security within the Customs Service.",
                    "Software methodology for development of a trusted BMS: identification of critical problems.",
                    "Developing trusted systems using DOD-STD-2167A.",
                    "Security issues and Ada runtime support.",
                    "A risk driven process model for the development of trusted systems.",
                    "Issues in distributed database security.",
                    "Secure query processing in intelligent database management systems.",
                    "TCB subsets: the next step.",
                    "Multi-party conflict: the problem and its solutions.",
                    "Network authentication tokens.",
                    "A survey of commercially available secure LAN products.",
                    "Applying the TNI to system certification and accreditation.",
                    "An extended cryptographic key generation scheme for multilevel data security.",
                    "Two new efficient cryptosystems based on Rabin's scheme: alternatives to RSA cryptosystem.",
                    "Evaluation issues for an integrated 'INFOSEC' product.",
                    "Chinese wall security policy-an aggressive model.",
                    "Security model consistency in secure object-oriented systems.",
                    "Security model development environment.",
                    "Report from the second RADC database security workshop.",
                    "Multilevel secure database design: a practical application.",
                    "Security approach for rapid prototyping in multilevel secure systems.",
                    "The trusted server approach to multilevel security.",
                    "Use of privacy-enhanced mail for software distribution.",
                    "Secure automated document delivery."
                ]
            }
        ]
    }
]