[
    {
        "year": "2021",
        "name": "27th ASIACRYPT 2021",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2021-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2021 - 27th International Conference on the Theory and Application of Cryptology and Information Security, Singapore, December 6-10, 2021, Proceedings, Part I.",
                "count": 23,
                "papers": [
                    "On the Hardness of the NTRU Problem.",
                    "A Geometric Approach to Linear Cryptanalysis.",
                    "Lattice Enumeration for Tower NFS: A 521-Bit Discrete Logarithm Computation.",
                    "Partial Key Exposure Attack on Short Secret Exponent CRT-RSA.",
                    "A Formula for Disaster: A Unified Approach to Elliptic Curve Special-Point-Based Attacks.",
                    "Cryptanalysis of an Oblivious PRF from Supersingular Isogenies.",
                    "A Practical Key-Recovery Attack on 805-Round Trivium.",
                    "Algebraic Attacks on Rasta and Dasta Using Low-Degree Equations.",
                    "Automatic Classical and Quantum Rebound Attacks on AES-Like Hashing by Exploiting Related-Key Differentials.",
                    "Clustering Effect in Simon and Simeck.",
                    "New Attacks on LowMC Instances with a Single Plaintext/Ciphertext Pair.",
                    "Convexity of Division Property Transitions: Theory, Algorithms and Compact Models.",
                    "Strong and Tight Security Guarantees Against Integral Distinguishers.",
                    "Massive Superpoly Recovery with Nested Monomial Predictions.",
                    "Quantum Linearization Attacks.",
                    "Generic Framework for Key-Guessing Improvements.",
                    "On the Non-tightness of Measurement-Based Reductions for Key Encapsulation Mechanism in the Quantum Random Oracle Model.",
                    "Redeeming Reset Indifferentiability and Applications to Post-quantum Security.",
                    "Franchised Quantum Money.",
                    "Quantum Computationally Predicate-Binding Commitments with Application in Quantum Zero-Knowledge Arguments for NP.",
                    "Quantum Encryption with Certified Deletion, Revisited: Public Key, Attribute-Based, and Classical Communication.",
                    "Tight Adaptive Reprogramming in the QROM.",
                    "QCB: Efficient Quantum-Secure Authenticated Encryption."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2021-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2021 - 27th International Conference on the Theory and Application of Cryptology and Information Security, Singapore, December 6-10, 2021, Proceedings, Part II.",
                "count": 24,
                "papers": [
                    "Secure and Efficient Software Masking on Superscalar Pipelined Processors.",
                    "Fault-Injection Attacks Against NIST's Post-Quantum Cryptography Round 3 KEM Candidates.",
                    "Divided We Stand, United We Fall: Security Analysis of Some SCA+SIFA Countermeasures Against SCA-Enhanced Fault Template Attacks.",
                    "Efficient Leakage-Resilient MACs Without Idealized Assumptions.",
                    "DEFAULT: Cipher Level Resistance Against Differential Fault Attack.",
                    "Dynamic Random Probing Expansion with Quasi Linear Asymptotic Complexity.",
                    "Homomorphic Secret Sharing for Multipartite and General Adversary Structures Supporting Parallel Evaluation of Low-Degree Polynomials.",
                    "Improved Single-Round Secure Multiplication Using Regenerating Codes.",
                    "Garbling, Stacked and Staggered - Faster k-out-of-n Garbled Function Evaluation.",
                    "Better Security-Efficiency Trade-Offs in Permutation-Based Two-Party Computation.",
                    "Two-Round Adaptively Secure MPC from Isogenies, LPN, or CDH.",
                    "Reverse Firewalls for Adaptively Secure MPC Without Setup.",
                    "On Time-Lock Cryptographic Assumptions in Abelian Hidden-Order Groups.",
                    "Astrolabous: A Universally Composable Time-Lock Encryption Scheme.",
                    "Identity-Based Encryption for Fair Anonymity Applications: Defining, Implementing, and Applying Rerandomizable RCCA-Secure IBE.",
                    "Simulation-Based Bi-Selective Opening Security for Public Key Encryption.",
                    "Key Encapsulation Mechanism with Tight Enhanced Security in the Multi-user Setting: Impossibility Result and Optimal Tightness.",
                    "Hierarchical Integrated Signature and Encryption - (or: Key Separation vs. Key Reuse: Enjoy the Best of both Worlds).",
                    "Tardigrade: An Atomic Broadcast Protocol for Arbitrary Network Conditions.",
                    "Onion Routing with Replies.",
                    "Private Join and Compute from PIR with Default.",
                    "Generalized Channels from Limited Blockchain Scripts and Adaptor Signatures.",
                    "ConTra Corona: Contact Tracing against the Coronavirus by Bridging the Centralized-Decentralized Divide for Stronger Privacy.",
                    "Cryptographic Analysis of the Bluetooth Secure Connection Protocol Suite."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2021-3",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2021 - 27th International Conference on the Theory and Application of Cryptology and Information Security, Singapore, December 6-10, 2021, Proceedings, Part III.",
                "count": 23,
                "papers": [
                    "Lunar: A Toolbox for More Efficient Universal and Updatable zkSNARKs and Commit-and-Prove Extensions.",
                    "Gentry-Wichs is Tight: a Falsifiable Non-adaptively Sound SNARG.",
                    "Proofs for Inner Pairing Products and Applications.",
                    "Snarky Ceremonies.",
                    "Efficient NIZKs for Algebraic Sets.",
                    "Bit Security as Computational Cost for Winning Games with High Probability.",
                    "Giving an Adversary Guarantees (Or: How to Model Designated Verifier Signatures in a Composable Framework).",
                    "How to Build a Trapdoor Function from an Encryption Scheme.",
                    "Beyond Software Watermarking: Traitor-Tracing for Pseudorandom Functions.",
                    "Batching Base Oblivious Transfers.",
                    "Algebraic Adversaries in the Universal Composability Framework.",
                    "Luby-Rackoff Backwards with More Users and More Security.",
                    "Double-Block-Length Hash Function for Minimum Memory Size.",
                    "Toward a Fully Secure Authenticated Encryption Scheme from a Pseudorandom Permutation.",
                    "Tight Security for Key-Alternating Ciphers with Correlated Sub-keys.",
                    "FAST: Secure and High Performance Format-Preserving Encryption and Tokenization.",
                    "Fine-Tuning the ISO/IEC Standard LightMAC.",
                    "Categorization of Faulty Nonce Misuse Resistant Message Authentication.",
                    "Balanced Non-adjacent Forms.",
                    "Efficient Boolean Search over Encrypted Data with Reduced Leakage.",
                    "Revisiting Homomorphic Encryption Schemes for Finite Fields.",
                    "Transciphering Framework for Approximate Homomorphic Encryption.",
                    "Improved Programmable Bootstrapping with Larger Precision and Efficient Arithmetic Circuits for TFHE."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2021-4",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2021 - 27th International Conference on the Theory and Application of Cryptology and Information Security, Singapore, December 6-10, 2021, Proceedings, Part IV.",
                "count": 25,
                "papers": [
                    "NTRU Fatigue: How Stretched is Overstretched?",
                    "Faster Dual Lattice Attacks for Solving LWE with Applications to CRYSTALS.",
                    "Lattice Sieving via Quantum Random Walks.",
                    "A Systematic Approach and Analysis of Key Mismatch Attacks on Lattice-Based NIST Candidate KEMs.",
                    "Gladius: LWR Based Efficient Hybrid Public Key Encryption with Distributed Decryption.",
                    "Lattice-Based Group Encryption with Full Dynamicity and Message Filtering Policy.",
                    "A New Variant of Unbalanced Oil and Vinegar Using Quotient Ring: QR-UOV.",
                    "Shorter Lattice-Based Group Signatures via \"Almost Free\" Encryption and Other Optimizations.",
                    "Séta: Supersingular Encryption from Torsion Attacks.",
                    "SHealS and HealS: Isogeny-Based PKEs from a Key Validation Method for SIDH.",
                    "Adaptive Security via Deletion in Attribute-Based Encryption: Solutions from Search Assumptions in Bilinear Groups.",
                    "Public Key Encryption with Flexible Pattern Matching.",
                    "Bounded Collusion ABE for TMs from IBE.",
                    "Digital Signatures with Memory-Tight Security in the Multi-challenge Setting.",
                    "(Compact) Adaptively Secure FE for Attribute-Weighted Sums from k-Lin.",
                    "Boosting the Security of Blind Signature Schemes.",
                    "PrORAM - Fast P(logn) Authenticated Shares ZK ORAM.",
                    "Compressed $\\varSigma $-Protocols for Bilinear Group Arithmetic Circuits and Application to Logarithmic Transparent Threshold Signatures.",
                    "Promise $\\varSigma $-Protocol: How to Construct Efficient Threshold ECDSA from Encryptions Based on Class Groups.",
                    "The One-More Discrete Logarithm Assumption in the Generic Group Model.",
                    "Verifiably-Extractable OWFs and Their Applications to Subversion Zero-Knowledge.",
                    "Chain Reductions for Multi-signatures and the HBMS Scheme.",
                    "Symmetric Key Exchange with Full Forward Security and Robust Synchronization.",
                    "Security Analysis of CPace.",
                    "Modular Design of Role-Symmetric Authenticated Key Exchange Protocols."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th ASIACRYPT 2020",
        "info": "Kobe, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2020-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2020 - 26th International Conference on the Theory and Application of Cryptology and Information Security, Daejeon, South Korea, December 7-11, 2020, Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "Finding Collisions in a Quantum World: Quantum Black-Box Separation of Collision-Resistance and One-Wayness.",
                    "New Results on Gimli: Full-Permutation Distinguishers and Improved Collisions.",
                    "SQISign: Compact Post-quantum Signatures from Quaternions and Isogenies.",
                    "Public-Key Generation with Verifiable Randomness.",
                    "Simulation-Sound Arguments for LWE and Applications to KDM-CCA2 Security.",
                    "CCA-Secure (Puncturable) KEMs from Encryption with Non-Negligible Decryption Errors.",
                    "Possibility and Impossibility Results for Receiver Selective Opening Secure PKE in the Multi-challenge Setting.",
                    "Security Reductions for White-Box Key-Storage in Mobile Payments.",
                    "Circular Security Is Complete for KDM Security.",
                    "Scalable Ciphertext Compression Techniques for Post-quantum KEMs and Their Applications.",
                    "Post-Quantum Verification of Fujisaki-Okamoto.",
                    "A New Decryption Failure Attack Against HQC.",
                    "A Bit-Vector Differential Model for the Modular Addition by a Constant.",
                    "Mind the Propagation of States - New Automatic Search Tool for Impossible Differentials and Impossible Polytopic Transitions.",
                    "An Algebraic Formulation of the Division Property: Revisiting Degree Evaluations, Cube Attacks, and Key-Independent Sums.",
                    "An Algebraic Attack on Ciphers with Low-Degree Round Functions: Application to Full MiMC.",
                    "Improvements of Algebraic Attacks for Solving the Rank Decoding and MinRank Problems.",
                    "Lower Bounds on the Degree of Block Ciphers.",
                    "Towards Closing the Security Gap of Tweak-aNd-Tweak (TNT).",
                    "Minimizing the Two-Round Tweakable Even-Mansour Cipher.",
                    "Beyond Birthday Bound Secure Fresh Rekeying: Application to Authenticated Encryption.",
                    "Tight Security Analysis of 3-Round Key-Alternating Cipher with a Single Permutation.",
                    "Improved Security Analysis for Nonce-Based Enhanced Hash-then-Mask MACs.",
                    "On the Adaptive Security of MACs and PRFs.",
                    "How to Build Optimally Secure PRFs Using Block Ciphers.",
                    "SILVER - Statistical Independence and Leakage Verification.",
                    "Cryptanalysis of Masked Ciphers: A Not So Random Idea.",
                    "Packed Multiplication: How to Amortize the Cost of Side-Channel Masking?",
                    "Side Channel Information Set Decoding Using Iterative Chunking - Plaintext Recovery from the \"Classic McEliece\" Hardware Reference Implementation."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2020-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2020 - 26th International Conference on the Theory and Application of Cryptology and Information Security, Daejeon, South Korea, December 7-11, 2020, Proceedings, Part II.",
                "count": 27,
                "papers": [
                    "Incrementally Aggregatable Vector Commitments and Applications to Verifiable Decentralized Storage.",
                    "Non-committing Encryption with Constant Ciphertext Expansion from Standard Assumptions.",
                    "Collusion Resistant Trace-and-Revoke for Arbitrary Identities from Standard Assumptions.",
                    "Subvert KEM to Break DEM: Practical Algorithm-Substitution Attacks on Public-Key Encryption.",
                    "Unbounded HIBE with Tight Security.",
                    "Multi-client Oblivious RAM with Poly-logarithmic Communication.",
                    "Privacy-Preserving Pattern Matching on Encrypted Data.",
                    "Efficient Homomorphic Comparison Methods with Optimal Complexity.",
                    "Practical Exact Proofs from Lattices: New Techniques to Exploit Fully-Splitting Rings.",
                    "Towards Classical Hardness of Module-LWE: The Linear Rank Case.",
                    "Lattice-Based E-Cash, Revisited.",
                    "Twisted-PHS: Using the Product Formula to Solve Approx-SVP in Ideal Lattices.",
                    "Simpler Statistically Sender Private Oblivious Transfer from Ideals of Cyclotomic Integers.",
                    "Cryptographic Group Actions and Applications.",
                    "B-SIDH: Supersingular Isogeny Diffie-Hellman Using Twisted Torsion.",
                    "Calamari and Falafl: Logarithmic (Linkable) Ring Signatures from Isogenies and Lattices.",
                    "Radical Isogenies.",
                    "Oblivious Pseudorandom Functions from Isogenies.",
                    "SiGamal: A Supersingular Isogeny-Based PKE and Its Application to a PRF.",
                    "Estimating Quantum Speedups for Lattice Sieves.",
                    "A Combinatorial Approach to Quantum Random Functions.",
                    "Improved Classical and Quantum Algorithms for Subset-Sum.",
                    "Security Limitations of Classical-Client Delegated Quantum Computing.",
                    "Quantum Circuit Implementations of AES with Fewer Qubits.",
                    "Quantum Collision Attacks on AES-Like Hashing with Low Quantum Random Access Memories.",
                    "Fuzzy Asymmetric Password-Authenticated Key Exchange.",
                    "Two-Pass Authenticated Key Exchange with Explicit Authentication and Tight Security."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2020-3",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2020 - 26th International Conference on the Theory and Application of Cryptology and Information Security, Daejeon, South Korea, December 7-11, 2020, Proceedings, Part III.",
                "count": 29,
                "papers": [
                    "MOTIF: (Almost) Free Branching in GMW - Via Vector-Scalar Multiplication.",
                    "Maliciously Secure Matrix Multiplication with Applications to Private Deep Learning.",
                    "On the Exact Round Complexity of Best-of-Both-Worlds Multi-party Computation.",
                    "MPC with Synchronous Security and Asynchronous Responsiveness.",
                    "Secure MPC: Laziness Leads to GOD.",
                    "Asymptotically Good Multiplicative LSSS over Galois Rings and Applications to MPC over $\\mathbb {Z}/p^k\\mathbb {Z} $.",
                    "Towards Efficiency-Preserving Round Compression in MPC - Do Fewer Rounds Mean More Computation?",
                    "Circuit Amortization Friendly Encodingsand Their Application to Statistically Secure Multiparty Computation.",
                    "Efficient Fully Secure Computation via Distributed Zero-Knowledge Proofs.",
                    "Efficient and Round-Optimal Oblivious Transfer and Commitment with Adaptive Security.",
                    "ALBATROSS: Publicly AttestabLe BATched Randomness Based On Secret Sharing.",
                    "Secret-Shared Shuffle.",
                    "Adaptively Secure Inner Product Encryption from LWE.",
                    "Unbounded Dynamic Predicate Compositions in ABE from Standard Assumptions.",
                    "Succinct and Adaptively Secure ABE for ABP from k-Lin.",
                    "Inner-Product Functional Encryption with Fine-Grained Access Control.",
                    "MoniPoly - An Expressive q-SDH-Based Anonymous Attribute-Based Credential System.",
                    "The Direction of Updatable Encryption Does Not Matter Much.",
                    "Improving Speed and Security in Updatable Encryption Schemes.",
                    "CCA Updatable Encryption Against Malicious Re-encryption Attacks.",
                    "Determining the Core Primitive for Optimally Secure Ratcheting.",
                    "Cryptography from One-Way Communication: On Completeness of Finite Channels.",
                    "Succinct Functional Commitment for a Large Class of Arithmetic Circuits.",
                    "Crowd Verifiable Zero-Knowledge and End-to-End Verifiable Multiparty Computation.",
                    "Non-interactive Composition of Sigma-Protocols via Share-then-Hash.",
                    "Succinct Diophantine-Satisfiability Arguments.",
                    "Individual Simulations.",
                    "KVaC: Key-Value Commitments for Blockchains and Beyond.",
                    "Catalic: Delegated PSI Cardinality with Applications to Contact Tracing."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th ASIACRYPT 2019",
        "info": "Kobe, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2019-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2019 - 25th International Conference on the Theory and Application of Cryptology and Information Security, Kobe, Japan, December 8-12, 2019, Proceedings, Part I.",
                "count": 24,
                "papers": [
                    "Streamlined Blockchains: A Simple and Elegant Approach (A Tutorial and Survey).",
                    "Wave: A New Family of Trapdoor One-Way Preimage Sampleable Functions Based on Codes.",
                    "Middle-Product Learning with Rounding Problem and Its Applications.",
                    "A Novel CCA Attack Using Decryption Errors Against LAC.",
                    "Towards Attribute-Based Encryption for RAMs from LWE: Sub-linear Decryption, and More.",
                    "4-Round Luby-Rackoff Construction is a qPRP.",
                    "Indifferentiability of Truncated Random Permutations.",
                    "Anomalies and Vector Space Search: Tools for S-Box Analysis.",
                    "CSI-FiSh: Efficient Isogeny Based Signatures Through Class Group Computations.",
                    "Verifiable Delay Functions from Supersingular Isogenies and Pairings.",
                    "Strongly Secure Authenticated Key Exchange from Supersingular Isogenies.",
                    "Dual-Mode NIZKs from Obfuscation.",
                    "Output Compression, MPC, and iO for Turing Machines.",
                    "Collusion Resistant Watermarking Schemes for Cryptographic Functionalities.",
                    "Valiant's Universal Circuits Revisited: An Overall Improvement and a Lower Bound.",
                    "The Broadcast Message Complexity of Secure Multiparty Computation.",
                    "Beyond Honest Majority: The Round Complexity of Fair and Robust Multi-party Computation.",
                    "Card-Based Cryptography Meets Formal Verification.",
                    "Quantum Algorithms for the Approximate k-List Problem and Their Application to Lattice Sieving.",
                    "Quantum Attacks Without Superposition Queries: The Offline Simon's Algorithm.",
                    "Quantum Random Oracle Model with Auxiliary Input.",
                    "QFactory: Classically-Instructed Remote Secret Qubits Preparation.",
                    "Quisquis: A New Design for Anonymous Cryptocurrencies.",
                    "Divisible E-Cash from Constrained Pseudo-Random Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2019-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2019 - 25th International Conference on the Theory and Application of Cryptology and Information Security, Kobe, Japan, December 8-12, 2019, Proceedings, Part II.",
                "count": 23,
                "papers": [
                    "Collision Resistant Hashing from Sub-exponential Learning Parity with Noise.",
                    "New Code-Based Privacy-Preserving Cryptographic Constructions.",
                    "An LLL Algorithm for Module Lattices.",
                    "Order-LWE and the Hardness of Ring-LWE with Entropic Secrets.",
                    "On the Non-existence of Short Vectors in Random Module Lattices.",
                    "Forkcipher: A New Primitive for Authenticated Encryption of Very Short Messages.",
                    "Anonymous AE.",
                    "Sponges Resist Leakage: The Case of Authenticated Encryption.",
                    "Dual Isogenies and Their Application to Public-Key Compression for Isogeny-Based Cryptography.",
                    "Optimized Method for Computing Odd-Degree Isogenies on Edwards Curves.",
                    "Hard Isogeny Problems over RSA Moduli and Groups with Infeasible Inversion.",
                    "On Kilian's Randomization of Multilinear Map Encodings.",
                    "Cryptanalysis of CLT13 Multilinear Maps with Independent Slots.",
                    "Algebraic XOR-RKA-Secure Pseudorandom Functions from Post-Zeroizing Multilinear Maps.",
                    "Numerical Method for Comparison on Homomorphically Encrypted Numbers.",
                    "Multi-Key Homomorphic Encryption from TFHE.",
                    "Homomorphic Encryption for Finite Automata.",
                    "Efficient Explicit Constructions of Multipartite Secret Sharing Schemes.",
                    "Perfectly Secure Oblivious RAM with Sublinear Bandwidth Overhead.",
                    "How to Correct Errors in Multi-server PIR.",
                    "UC-Secure Multiparty Computation from One-Way Functions Using Stateless Tokens.",
                    "Efficient UC Commitment Extension with Homomorphism for Free (and Applications).",
                    "Scalable Private Set Union from Symmetric-Key Techniques."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2019-3",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2019 - 25th International Conference on the Theory and Application of Cryptology and Information Security, Kobe, Japan, December 8-12, 2019, Proceedings, Part III.",
                "count": 25,
                "papers": [
                    "Approximate Trapdoors for Lattices and Smaller Hash-and-Sign Signatures.",
                    "Decisional Second-Preimage Resistance: When Does SPR Imply PRE?",
                    "Structure-Preserving Signatures on Equivalence Classes from Standard Assumptions.",
                    "Simple and Efficient KDM-CCA Secure Public Key Encryption.",
                    "Non-Committing Encryption with Quasi-Optimal Ciphertext-Rate Based on the DDH Problem.",
                    "Structure-Preserving and Re-randomizable RCCA-Secure Public Key Encryption and Its Applications.",
                    "iUC: Flexible Universal Composability Made Simple.",
                    "Leakage Resilience of the Duplex Construction.",
                    "A Critical Analysis of ISO 17825 ('Testing Methods for the Mitigation of Non-invasive Attack Classes Against Cryptographic Modules').",
                    "Location, Location, Location: Revisiting Modeling and Exploitation for Location-Based Side Channel Leakages.",
                    "Simple Refreshing in the Noisy Leakage Model.",
                    "The Exchange Attack: How to Distinguish Six Rounds of AES with 2^88.2 Chosen Plaintexts.",
                    "Algebraic Cryptanalysis of STARK-Friendly Designs: Application to MARVELlous and MiMC.",
                    "MILP-aided Method of Searching Division Property Using Three Subsets and Applications.",
                    "Cryptanalysis of GSM Encryption in 2G/3G Networks Without Rainbow Tables.",
                    "Tightly Secure Inner Product Functional Encryption: Multi-input and Function-Hiding Constructions.",
                    "Public-Key Function-Private Hidden Vector Encryption (and More).",
                    "Multi-Client Functional Encryption for Linear Functions in the Standard Model from LWE.",
                    "From Single-Input to Multi-client Inner-Product Functional Encryption.",
                    "Rate-1 Trapdoor Functions from the Diffie-Hellman Problem.",
                    "The Local Forking Lemma and Its Application to Deterministic Encryption.",
                    "Fine-Grained Cryptography Revisited.",
                    "Shorter QA-NIZK and SPS with Tighter Security.",
                    "Efficient Noninteractive Certification of RSA Moduli and Beyond.",
                    "Shorter Pairing-Based Arguments Under Standard Assumptions."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th ASIACRYPT 2018",
        "info": "Brisbane, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2018-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2018 - 24th International Conference on the Theory and Application of Cryptology and Information Security, Brisbane, QLD, Australia, December 2-6, 2018, Proceedings, Part I.",
                "count": 21,
                "papers": [
                    "Block Cipher Invariants as Eigenvectors of Correlation Matrices.",
                    "Practical Attacks Against the Walnut Digital Signature Scheme.",
                    "Two Attacks on Rank Metric Code-Based Schemes: RankSign and an IBE Scheme.",
                    "An Efficient Structural Attack on NIST Submission DAGS.",
                    "Pattern Matching on Encrypted Streams.",
                    "SQL on Structurally-Encrypted Databases.",
                    "Parameter-Hiding Order Revealing Encryption.",
                    "Revisiting Key-Alternating Feistel Ciphers for Shorter Keys and Multi-user Security.",
                    "Short Variable Length Domain Extenders with Beyond Birthday Bound Security.",
                    "Building Quantum-One-Way Functions from Block Ciphers: Davies-Meyer and Merkle-Damgård Constructions.",
                    "Tweakable Block Ciphers Secure Beyond the Birthday Bound in the Ideal Cipher Model.",
                    "ZCZ - Achieving n-bit SPRP Security with a Minimal Number of Tweakable-Block-Cipher Calls.",
                    "Measuring, Simulating and Exploiting the Head Concavity Phenomenon in BKZ.",
                    "Quantum Lattice Enumeration and Tweaking Discrete Pruning.",
                    "On the Hardness of the Computational Ring-LWR Problem and Its Applications.",
                    "On the Statistical Leak of the GGH13 Multilinear Map and Some Variants.",
                    "LWE Without Modular Reduction and Improved Side-Channel Attacks Against BLISS.",
                    "Quantum Algorithms for the k -xor Problem.",
                    "Hidden Shift Quantum Cryptanalysis and Implications.",
                    "Arya: Nearly Linear-Time Zero-Knowledge Proofs for Correct Program Execution.",
                    "Improved (Almost) Tightly-Secure Simulation-Sound QA-NIZK with Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2018-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2018 - 24th International Conference on the Theory and Application of Cryptology and Information Security, Brisbane, QLD, Australia, December 2-6, 2018, Proceedings, Part II.",
                "count": 25,
                "papers": [
                    "Programming the Demirci-Selçuk Meet-in-the-Middle Attack with Constraints.",
                    "Cryptanalysis of MORUS.",
                    "New MILP Modeling: Improved Conditional Cube Attacks on Keccak-Based Constructions.",
                    "On the Concrete Security of Goldreich's Pseudorandom Generator.",
                    "A Framework for Achieving KDM-CCA Secure Public-Key Encryption.",
                    "Understanding and Constructing AKE via Double-Key Key Encapsulation Mechanism.",
                    "Identity-Based Encryption Tightly Secure Under Chosen-Ciphertext Attacks.",
                    "Short Digital Signatures and ID-KEMs via Truncation Collision Resistance.",
                    "Tighter Security Proofs for GPV-IBE in the Quantum Random Oracle Model.",
                    "New Instantiations of the CRYPTO 2017 Masking Schemes.",
                    "Statistical Ineffective Fault Attacks on Masked AES with Fault Countermeasures.",
                    "Tight Private Circuits: Achieving Probing Security with the Least Refreshing.",
                    "Attacks and Countermeasures for White-box Designs.",
                    "Signatures with Flexible Public Key: Introducing Equivalence Classes for Public Keys.",
                    "Compact Multi-signatures for Smaller Blockchains.",
                    "Multi-key Homomorphic Signatures Unforgeable Under Insider Corruption.",
                    "Attribute-Based Signatures for Unbounded Languages from Standard Assumptions.",
                    "Learning Strikes Again: The Case of the DRS Signature Scheme.",
                    "How to Securely Compute with Noisy Leakage in Quasilinear Complexity.",
                    "Leakage-Resilient Cryptography from Puncturable Primitives and Obfuscation.",
                    "Unbounded Inner Product Functional Encryption from Bilinear Maps.",
                    "Adaptively Simulation-Secure Attribute-Hiding Predicate Encryption.",
                    "Improved Inner-Product Encryption with Adaptive Security and Full Attribute-Hiding.",
                    "Decentralized Multi-Client Functional Encryption for Inner Product.",
                    "Practical Fully Secure Unrestricted Inner Product Functional Encryption Modulo p."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2018-3",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2018 - 24th International Conference on the Theory and Application of Cryptology and Information Security, Brisbane, QLD, Australia, December 2-6, 2018, Proceedings, Part III.",
                "count": 19,
                "papers": [
                    "On Multiparty Garbling of Arithmetic Circuits.",
                    "$$\\mathsf {Free\\ }{} \\mathtt{IF} $$ : How to Omit Inactive Branches and Implement S -Universal Garbled Circuit (Almost) for Free.",
                    "Secure Computation with Low Communication from Cross-Checking.",
                    "Concretely Efficient Large-Scale MPC with Active Security (or, TinyKeys for TinyOT).",
                    "Non-interactive Secure Computation from One-Way Functions.",
                    "Simple and Efficient Two-Server ORAM.",
                    "More is Less: Perfectly Secure Oblivious Algorithms in the Multi-server Setting.",
                    "A Universally Composable Framework for the Privacy of Email Ecosystems.",
                    "State Separation for Code-Based Game-Playing Proofs.",
                    "Security of the Blockchain Against Long Delay Attack.",
                    "Homomorphic Secret Sharing for Low Degree Polynomials.",
                    "Constructing Ideal Secret Sharing Schemes Based on Chinese Remainder Theorem.",
                    "Optimal Linear Multiparty Conditional Disclosure of Secrets Protocols.",
                    "Towards Practical Key Exchange from Ordinary Isogeny Graphs.",
                    "CSIDH: An Efficient Post-Quantum Commutative Group Action.",
                    "Computing Supersingular Isogenies on Kummer Surfaces.",
                    "Robustly Reusable Fuzzy Extractor from Standard Assumptions.",
                    "Simple and More Efficient PRFs with Tight Security from LWE and Matrix-DDH.",
                    "Simulatable Channels: Extended Security that is Universally Composable and Easier to Prove."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd ASIACRYPT 2017",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2017-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2017 - 23rd International Conference on the Theory and Applications of Cryptology and Information Security, Hong Kong, China, December 3-7, 2017, Proceedings, Part I.",
                "count": 27,
                "papers": [
                    "Identification Protocols and Signature Schemes Based on Supersingular Isogeny Problems.",
                    "An Existential Unforgeable Signature Scheme Based on Multivariate Quadratic Equations.",
                    "Post-quantum Security of Fiat-Shamir.",
                    "Improved Conditional Cube Attacks on Keccak Keyed Modes with MILP Method.",
                    "Automatic Search of Bit-Based Division Property for ARX Ciphers and Word-Based Division Property.",
                    "Collisions and Semi-Free-Start Collisions for Round-Reduced RIPEMD-160.",
                    "Linear Cryptanalysis of DES with Asymmetries.",
                    "Yoyo Tricks with AES.",
                    "New Key Recovery Attacks on Minimal Two-Round Even-Mansour Ciphers.",
                    "Large Modulus Ring-LWE ≥ Module-LWE.",
                    "Revisiting the Expected Cost of Solving uSVP and Applications to LWE.",
                    "Coded-BKW with Sieving.",
                    "Sharper Bounds in Lattice-Based Cryptography Using the Rényi Divergence.",
                    "Faster Packed Homomorphic Operations and Efficient Circuit Bootstrapping for TFHE.",
                    "Homomorphic Encryption for Arithmetic of Approximate Numbers.",
                    "Quantum Fully Homomorphic Encryption with Verification.",
                    "Access Control Encryption for General Policies from Standard Assumptions.",
                    "Strengthening Access Control Encryption.",
                    "Adaptive Oblivious Transfer with Access Control from Lattice Assumptions.",
                    "On the Depth of Oblivious Parallel RAM.",
                    "Low Cost Constant Round MPC Combining BMR and Oblivious Transfer.",
                    "Maliciously Secure Oblivious Linear Function Evaluation with Constant Overhead.",
                    "Oblivious Hashing Revisited, and Applications to Asymptotically Efficient ORAM and OPRAM.",
                    "Authenticated Encryption in the Face of Protocol and Side Channel Leakage.",
                    "Consolidating Inner Product Masking.",
                    "The First Thorough Side-Channel Hardware Trojan.",
                    "Amortizing Randomness Complexity in Private Circuits."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2017-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2017 - 23rd International Conference on the Theory and Applications of Cryptology and Information Security, Hong Kong, China, December 3-7, 2017, Proceedings, Part II.",
                "count": 23,
                "papers": [
                    "Kummer for Genus One over Prime Order Fields.",
                    "ABE with Tag Made Easy - Concise Framework and New Instantiations in Prime-Order Groups.",
                    "Towards a Classification of Non-interactive Computational Assumptions in Cyclic Groups.",
                    "An Efficient Pairing-Based Shuffle Argument.",
                    "Efficient Ring Signatures in the Standard Model.",
                    "Grover Meets Simon - Quantumly Attacking the FX-construction.",
                    "Quantum Multicollision-Finding Algorithm.",
                    "An Efficient Quantum Collision Search Algorithm and Implications on Symmetric Cryptography.",
                    "Quantum Resource Estimates for Computing Elliptic Curve Discrete Logarithms.",
                    "qDSA: Small and Secure Digital Signatures with Curve-Based Diffie-Hellman Key Pairs.",
                    "A Simple and Compact Algorithm for SIDH with Arbitrary Degree Isogenies.",
                    "Faster Algorithms for Isogeny Problems Using Torsion Point Images.",
                    "Beyond Hellman's Time-Memory Trade-Offs with Applications to Proofs of Space.",
                    "The Sleepy Model of Consensus.",
                    "Instantaneous Decentralized Poker.",
                    "More Efficient Universal Circuit Constructions.",
                    "Efficient Scalable Constant-Round MPC via Garbled Circuits.",
                    "Overlaying Conditional Circuit Clauses for Secure Computation.",
                    "JIMU: Faster LEGO-Based Secure Computation Using Additive Homomorphic Hashes.",
                    "Analyzing Multi-key Security Degradation.",
                    "Full-State Keyed Duplex with Built-In Multi-user Support.",
                    "Improved Security for OCB3.",
                    "The Iterated Random Function Problem."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2017-3",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2017 - 23rd International Conference on the Theory and Applications of Cryptology and Information Security, Hong Kong, China, December 3-7, 2017, Proceedings, Part III.",
                "count": 16,
                "papers": [
                    "A Subversion-Resistant SNARK.",
                    "Two-Round PAKE from Approximate SPH and Instantiations from Lattices.",
                    "Tightly-Secure Signatures from Five-Move Identification Protocols.",
                    "On the Untapped Potential of Encoding Predicates by Arithmetic Circuits and Their Applications.",
                    "The Minimum Number of Cards in Practical Card-Based Protocols.",
                    "Succinct Spooky Free Compilers Are Not Black Box Sound.",
                    "Non-Interactive Multiparty Computation Without Correlated Randomness.",
                    "Optimal-Rate Non-Committing Encryption.",
                    "Preventing CLT Attacks on Obfuscation with Linear Overhead.",
                    "Two-Message Witness Indistinguishability and Secure Computation in the Plain Model from New Assumptions.",
                    "Zero-Knowledge Arguments for Lattice-Based PRFs and Applications to E-Cash.",
                    "Linear-Time Zero-Knowledge Proofs for Arithmetic Circuit Satisfiability.",
                    "How to Use Metaheuristics for Design of Symmetric-Key Primitives.",
                    "Cycle Slicer: An Algorithm for Building Permutations on Special Domains.",
                    "Symmetrically and Asymmetrically Hard Cryptography.",
                    "Blockcipher-Based MACs: Beyond the Birthday Bound Without Message Length."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd ASIACRYPT 2016",
        "info": "Hanoi, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2016-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2016 - 22nd International Conference on the Theory and Application of Cryptology and Information Security, Hanoi, Vietnam, December 4-8, 2016, Proceedings, Part I.",
                "count": 33,
                "papers": [
                    "Faster Fully Homomorphic Encryption: Bootstrapping in Less Than 0.1 Seconds.",
                    "A General Polynomial Selection Method and New Asymptotic Complexities for the Tower Number Field Sieve Algorithm.",
                    "On the Security of Supersingular Isogeny Cryptosystems.",
                    "Simpira v2: A Family of Efficient Permutations Using the AES Round Function.",
                    "Towards Practical Whitebox Cryptography: Optimizing Efficiency and Space Hardness.",
                    "Efficient and Provable White-Box Primitives.",
                    "MiMC: Efficient Encryption and Cryptographic Hashing with Minimal Multiplicative Complexity.",
                    "Balloon Hashing: A Memory-Hard Function Providing Provable Protection Against Sequential Attacks.",
                    "Linear Structures: Applications to Cryptanalysis of Round-Reduced Keccak.",
                    "When Are Fuzzy Extractors Possible?",
                    "More Powerful and Reliable Second-Level Statistical Randomness Tests for NIST SP 800-22.",
                    "Trick or Tweak: On the (In)security of OTR's Tweaks.",
                    "Universal Forgery and Key Recovery Attacks on ELmD Authenticated Encryption Algorithm.",
                    "Statistical Fault Attacks on Nonce-Based Authenticated Encryption Schemes.",
                    "Authenticated Encryption with Variable Stretch.",
                    "Salvaging Weak Security Bounds for Blockcipher-Based Constructions.",
                    "How to Build Fully Secure Tweakable Blockciphers from Classical Blockciphers.",
                    "Design Strategies for ARX with Provable Bounds: Sparx and LAX.",
                    "Side-Channel Analysis Protection and Low-Latency in Action - - Case Study of PRINCE and Midori -.",
                    "Characterisation and Estimation of the Key Rank Distribution in the Context of Side Channel Evaluations.",
                    "Taylor Expansion of Maximum Likelihood Attacks for Masked and Shuffled Implementations.",
                    "Unknown-Input Attacks in the Parallel Setting: Improving the Security of the CHES 2012 Leakage-Resilient PRF.",
                    "A New Algorithm for the Unbalanced Meet-in-the-Middle Problem.",
                    "Applying MILP Method to Searching Integral Distinguishers Based on Division Property for 6 Lightweight Block Ciphers.",
                    "Reverse Cycle Walking and Its Applications.",
                    "Optimization of \\mathsf LPN Solving Algorithms.",
                    "The Kernel Matrix Diffie-Hellman Assumption.",
                    "Cryptographic Applications of Capacity Theory: On the Optimality of Coppersmith's Method for Univariate Polynomials.",
                    "A Key Recovery Attack on MDPC with CCA Security Using Decoding Errors.",
                    "A Tale of Two Shares: Why Two-Share Threshold Implementation Seems Worthwhile - and Why It Is Not.",
                    "Cryptographic Reverse Firewall via Malleable Smooth Projective Hash Functions.",
                    "Efficient Public-Key Cryptography with Bounded Leakage and Tamper Resilience.",
                    "Public-Key Cryptosystems Resilient to Continuous Tampering and Leakage of Arbitrary Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2016-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2016 - 22nd International Conference on the Theory and Application of Cryptology and Information Security, Hanoi, Vietnam, December 4-8, 2016, Proceedings, Part II.",
                "count": 34,
                "papers": [
                    "Nonlinear Invariant Attack - Practical Attack on Full SCREAM, iSCREAM, and Midori64.",
                    "Cliptography: Clipping the Power of Kleptographic Attacks.",
                    "Zero-Knowledge Accumulators and Set Algebra.",
                    "Zero-Knowledge Arguments for Matrix-Vector Relations and Lattice-Based Group Encryption.",
                    "From 5-Pass MQ -Based Identification to MQ -Based Signatures.",
                    "Collapse-Binding Quantum Commitments Without Random Oracles.",
                    "Digital Signatures Based on the Hardness of Ideal Lattice Problems in All Rings.",
                    "Adaptive Oblivious Transfer and Generalization.",
                    "Selective Opening Security from Simulatable Data Encapsulation.",
                    "Selective-Opening Security in the Presence of Randomness Failures.",
                    "Efficient KDM-CCA Secure Public-Key Encryption for Polynomial Functions.",
                    "Structure-Preserving Smooth Projective Hashing.",
                    "Signature Schemes with Efficient Protocols and Dynamic Group Signatures from Lattice Assumptions.",
                    "Towards Tightly Secure Lattice Short Signature and Id-Based Encryption.",
                    "From Identification to Signatures, Tightly: A Framework and Generic Transforms.",
                    "How to Obtain Fully Structure-Preserving (Automorphic) Signatures from Structure-Preserving Ones.",
                    "Multi-key Homomorphic Authenticators.",
                    "Multi-input Functional Encryption with Unbounded-Message Security.",
                    "Verifiable Functional Encryption.",
                    "Dual System Encryption Framework in Prime-Order Groups via Computational Pair Encodings.",
                    "Efficient IBE with Tight Reduction to Standard Assumption in the Multi-challenge Setting.",
                    "Déjà Q All Over Again: Tighter and Broader Reductions of q-Type Assumptions.",
                    "Partitioning via Non-linear Polynomial Functions: More Compact IBEs from Ideal Lattices and Bilinear Maps.",
                    "How to Generate and Use Universal Samplers.",
                    "Iterated Random Oracle: A Universal Approach for Finding Loss in Security Reduction.",
                    "NIZKs with an Untrusted CRS: Security in the Face of Parameter Subversion.",
                    "Universal Composition with Responsive Environments.",
                    "A Shuffle Argument Secure in the Generic Model.",
                    "Efficient Public-Key Distance Bounding Protocol.",
                    "Indistinguishable Proofs of Work or Knowledge.",
                    "Size-Hiding Computation for Multiple Parties.",
                    "How to Circumvent the Two-Ciphertext Lower Bound for Linear Garbling Schemes.",
                    "Constant-Round Asynchronous Multi-Party Computation Based on One-Way Functions.",
                    "Reactive Garbling: Foundation, Instantiation, Application."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st ASIACRYPT 2015",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2015-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2015 - 21st International Conference on the Theory and Application of Cryptology and Information Security, Auckland, New Zealand, November 29 - December 3, 2015, Proceedings, Part I.",
                "count": 32,
                "papers": [
                    "Improved Security Proofs in Lattice-Based Cryptography: Using the Rényi Divergence Rather Than the Statistical Distance.",
                    "Multi-input Functional Encryption for Unbounded Arity Functions.",
                    "Multi-party Key Exchange for Unbounded Parties from Indistinguishability Obfuscation.",
                    "Adaptively Secure Puncturable Pseudorandom Functions in the Standard Model.",
                    "Multilinear and Aggregate Pseudorandom Functions: New Constructions and Improved Security.",
                    "New Realizations of Somewhere Statistically Binding Hashing and Positional Accumulators.",
                    "Computing Individual Discrete Logarithms Faster in GF(p n ) with the NFS-DL Algorithm.",
                    "Multiple Discrete Logarithm Problems with Auxiliary Inputs.",
                    "Solving Linear Equations Modulo Unknown Divisors: Revisited.",
                    "Fourℚ: Four-Dimensional Decompositions on a ℚ-curve over the Mersenne Prime.",
                    "Efficient Fully Structure-Preserving Signatures for Large Messages.",
                    "A Provably Secure Group Signature Scheme from Code-Based Assumptions.",
                    "Type 2 Structure-Preserving Signature Schemes Revisited.",
                    "Design Principles for HFEv- Based Multivariate Signature Schemes.",
                    "Oblivious Network RAM and Leveraging Parallelism to Achieve Obliviousness.",
                    "Three-Party ORAM for Secure Computation.",
                    "On Cut-and-Choose Oblivious Transfer and Its Variants.",
                    "An Asymptotically Optimal Method for Converting Bit Encryption to Multi-Bit Encryption.",
                    "Selective Opening Security for Receivers.",
                    "Function-Hiding Inner Product Encryption.",
                    "Idealizing Identity-Based Encryption.",
                    "A Framework for Identity-Based Encryption with Almost Tight Security.",
                    "Riding on Asymmetry: Efficient ABE for Branching Programs.",
                    "Conversions Among Several Classes of Predicate Encryption and Applications to ABE with Various Compactness Tradeoffs.",
                    "QA-NIZK Arguments in Asymmetric Groups: New Tools and New Constructions.",
                    "Dual-System Simulation-Soundness with Applications to UC-PAKE and More.",
                    "Secret Sharing and Statistical Zero Knowledge.",
                    "Compactly Hiding Linear Spans - Tightly Secure Constant-Size Simulation-Sound QA-NIZK Proofs and Applications.",
                    "A Unified Approach to MPC with Preprocessing Using OT.",
                    "Secure Computation from Millionaire.",
                    "Garbling Scheme for Formulas with Constant Size of Garbled Gates.",
                    "Card-Based Cryptographic Protocols Using a Minimal Number of Cards."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2015-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2015 - 21st International Conference on the Theory and Application of Cryptology and Information Security, Auckland, New Zealand, November 29 - December 3, 2015, Proceedings, Part II.",
                "count": 32,
                "papers": [
                    "Key-Recovery Attacks on ASASA.",
                    "The Tower Number Field Sieve.",
                    "On the Impact of Known-Key Attacks on Hash Functions.",
                    "Generic Security of NMAC and HMAC with Input Whitening.",
                    "On the Optimality of Non-Linear Computations of Length-Preserving Encryption Schemes.",
                    "Beyond-Birthday-Bound Security for Tweakable Even-Mansour Ciphers with Linear Tweak and Key Mixing.",
                    "An Inverse-Free Single-Keyed Tweakable Enciphering Scheme.",
                    "On Black-Box Complexity of Universally Composable Security in the CRS Model.",
                    "Public Verifiability in the Covert Model (Almost) for Free.",
                    "Limits of Extractability Assumptions with Distributional Auxiliary Input.",
                    "Composable and Modular Anonymous Credentials: Definitions and Practical Constructions.",
                    "ASCA, SASCA and DPA with Enumeration: Which One Beats the Other and When?",
                    "Counting Keys in Parallel After a Side Channel Attack.",
                    "A Unified Metric for Quantifying Information Leakage of Cryptographic Devices Under Power Analysis Attacks.",
                    "How Secure is AES Under Leakage.",
                    "A Synthetic Indifferentiability Analysis of Interleaved Double-Key Even-Mansour Ciphers.",
                    "Midori: A Block Cipher for Low Energy.",
                    "Optimally Secure Block Ciphers from Ideal Primitives.",
                    "Security of Full-State Keyed Sponge and Duplex: Applications to Authenticated Encryption.",
                    "Heuristic Tool for Linear Cryptanalysis with Applications to CAESAR Candidates.",
                    "Collision Attacks Against CAESAR Candidates - Forgery and Key-Recovery Against AEZ and Marble.",
                    "Optimized Interpolation Attacks on LowMC.",
                    "Another Tradeoff Attack on Sprout-Like Stream Ciphers.",
                    "Reverse-Engineering of the Cryptanalytic Attack Used in the Flame Super-Malware.",
                    "Analysis of SHA-512/224 and SHA-512/256.",
                    "Tradeoff Cryptanalysis of Memory-Hard Functions.",
                    "Property Preserving Symmetric Encryption Revisited.",
                    "Refinements of the k-tree Algorithm for the Generalized Birthday Problem.",
                    "How to Sequentialize Independent Parallel Attacks? - Biased Distributions Have a Phase Transition.",
                    "Pure Differential Privacy for Rectangle Queries via Private Partitions.",
                    "Implementing Candidate Graded Encoding Schemes from Ideal Lattices.",
                    "New Circular Security Counterexamples from Decision Linear and Learning with Errors."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th ASIACRYPT 2014",
        "info": "Kaoshiung, Taiwan, R.O.C.",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2014-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2014 - 20th International Conference on the Theory and Application of Cryptology and Information Security, Kaoshiung, Taiwan, R.O.C., December 7-11, 2014. Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "Solving LPN Using Covering Codes.",
                    "Algebraic Attack against Variants of McEliece with Goppa Polynomial of a Special Form.",
                    "Bivariate Polynomials Modulo Composites and Their Applications.",
                    "Cryptographic Schemes Based on the ASASA Structure: Black-Box, White-Box, and Public-Key (Extended Abstract).",
                    "Beyond 2 c/2 Security in Sponge-Based Authenticated Encryption Modes.",
                    "How to Securely Release Unverified Plaintext in Authenticated Encryption.",
                    "Forging Attacks on Two Authenticated Encryption Schemes COBRA and POET.",
                    "Low Probability Differentials and the Cryptanalysis of Full-Round CLEFIA-128.",
                    "Automatic Security Evaluation and (Related-key) Differential Characteristic Search: Application to SIMON, PRESENT, LBlock, DES(L) and Other Bit-Oriented Block Ciphers.",
                    "Scrutinizing and Improving Impossible Differential Attacks: Applications to CLEFIA, Camellia, LBlock and Simon.",
                    "A Simplified Representation of AES.",
                    "Simulatable Leakage: Analysis, Pitfalls, and New Constructions.",
                    "Multi-target DPA Attacks: Pushing DPA Beyond the Limits of a Desktop Computer.",
                    "GLV/GLS Decomposition, Power Analysis, and Attacks on ECDSA Signatures with Single-Bit Nonce Bias.",
                    "Soft Analytical Side-Channel Attacks.",
                    "On the Enumeration of Double-Base Chains with Applications to Elliptic Curve Cryptography.",
                    "Kummer Strikes Back: New DH Speed Records.",
                    "Jacobian Coordinates on Genus 2 Curves.",
                    "Mersenne Factorization Factory.",
                    "Improving the Polynomial time Precomputation of Frobenius Representation Discrete Logarithm Algorithms - Simplified Setting for Small Characteristic Finite Fields.",
                    "Big Bias Hunting in Amazonia: Large-Scale Computation and Exploitation of RC4 Biases (Invited Paper).",
                    "Multi-user Collisions: Applications to Discrete Logarithm, Even-Mansour and PRINCE.",
                    "Cryptanalysis of Iterated Even-Mansour Schemes with Two Keys.",
                    "Meet-in-the-Middle Attacks on Generic Feistel Constructions.",
                    "XLS is Not a Strong Pseudorandom Permutation.",
                    "Structure-Preserving Signatures on Equivalence Classes and Their Application to Anonymous Credentials.",
                    "On Tight Security Proofs for Schnorr Signatures.",
                    "Square Span Programs with Applications to Succinct NIZK Arguments.",
                    "Better Zero-Knowledge Proofs for Lattice Encryption and Their Application to Group Signatures."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2014",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2014 - 20th International Conference on the Theory and Application of Cryptology and Information Security, Kaoshiung, Taiwan, R.O.C., December 7-11, 2014, Proceedings, Part II.",
                "count": 27,
                "papers": [
                    "Concise Multi-challenge CCA-Secure Encryption and Signatures with Almost Tight Security.",
                    "Efficient Identity-Based Encryption over NTRU Lattices.",
                    "Order-Preserving Encryption Secure Beyond One-Wayness.",
                    "Statistically-secure ORAM with Õ(log2 n) Overhead.",
                    "Adaptive Security of Constrained PRFs.",
                    "Poly-Many Hardcore Bits for Any One-Way Function and a Framework for Differing-Inputs Obfuscation.",
                    "Using Indistinguishability Obfuscation via UCEs.",
                    "Indistinguishability Obfuscation versus Multi-bit Point Obfuscation with Auxiliary Input.",
                    "Bootstrapping Obfuscators via Fast Pseudorandom Functions.",
                    "Homomorphic Authenticated Encryption Secure against Chosen-Ciphertext Attack.",
                    "Authenticating Computation on Groups: New Homomorphic Primitives and Applications.",
                    "Compact VSS and Efficient Homomorphic UC Commitments.",
                    "Round-Optimal Password-Protected Secret Sharing and T-PAKE in the Password-Only Model.",
                    "Secret-Sharing for NP.",
                    "Tweaks and Keys for Block Ciphers: The TWEAKEY Framework.",
                    "Memory-Demanding Password Scrambling.",
                    "Side-Channel Analysis of Multiplications in GF(2128) - Application to AES-GCM.",
                    "Higher-Order Threshold Implementations.",
                    "Masks Will Fall Off - Higher-Order Optimal Distinguishers.",
                    "Black-Box Separations for One-More (Static) CDH and Its Generalization.",
                    "Black-Box Separations for Differentially Private Protocols.",
                    "Composable Security of Delegated Quantum Computation.",
                    "All-But-Many Encryption - A New Framework for Fully-Equipped UC Commitments.",
                    "Multi-valued Byzantine Broadcast: The t < n Case.",
                    "Fairness versus Guaranteed Output Delivery in Secure Multiparty Computation.",
                    "Actively Secure Private Function Evaluation.",
                    "Efficient, Oblivious Data Structures for MPC."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th ASIACRYPT 2013",
        "info": "Bengaluru, India",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2013-1",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2013 - 19th International Conference on the Theory and Application of Cryptology and Information Security, Bengaluru, India, December 1-5, 2013, Proceedings, Part I.",
                "count": 27,
                "papers": [
                    "Shorter Quasi-Adaptive NIZK Proofs for Linear Subspaces.",
                    "Constant-Round Concurrent Zero Knowledge in the Bounded Player Model.",
                    "Succinct Non-Interactive Zero Knowledge Arguments from Span Programs and Linear Error-Correcting Codes.",
                    "Families of Fast Elliptic Curves from ℚ-curves.",
                    "Four-Dimensional GLV via the Weil Restriction.",
                    "Discrete Gaussian Leftover Hash Lemma over Infinite Domains.",
                    "New Insight into the Isomorphism of Polynomial Problem IP1S and Its Use in Cryptography.",
                    "Constructing Confidential Channels from Authenticated Channels - Public-Key Encryption Revisited.",
                    "Reset Indifferentiability and Its Consequences.",
                    "Computational Fuzzy Extractors.",
                    "Efficient One-Way Secret-Key Agreement and Private Channel Coding via Polarization.",
                    "SPHF-Friendly Non-interactive Commitments.",
                    "Self-Updatable Encryption: Time Constrained Access Control with Hidden Attributes and Better Efficiency.",
                    "Function-Private Subspace-Membership Encryption and Its Applications.",
                    "Random Projections, Graph Sparsification, and Differential Privacy.",
                    "Notions of Black-Box Reductions, Revisited.",
                    "Adaptive and Concurrent Secure Computation from New Adaptive, Non-malleable Commitments.",
                    "Key Recovery Attacks on 3-round Even-Mansour, 8-step LED-128, and Full AES2.",
                    "Key Difference Invariant Bias in Block Ciphers.",
                    "Leaked-State-Forgery Attack against the Authenticated Encryption Algorithm ALE.",
                    "A Modular Framework for Building Variable-Input-Length Tweakable Ciphers.",
                    "Parallelizable and Authenticated Online Ciphers.",
                    "How to Construct an Ideal Cipher from a Small Set of Public Permutations.",
                    "Generic Key Recovery Attack on Feistel Scheme.",
                    "Does My Device Leak Information? An a priori Statistical Power Analysis of Leakage Detection Tests.",
                    "Behind the Scene of Side Channel Attacks.",
                    "SCARE of Secret Ciphers with SPN Structures."
                ]
            },
            {
                "sub_name_abbr": "conf/asiacrypt/2013-2",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2013 - 19th International Conference on the Theory and Application of Cryptology and Information Security, Bengaluru, India, December 1-5, 2013, Proceedings, Part II.",
                "count": 27,
                "papers": [
                    "New Generic Attacks against Hash-Based MACs.",
                    "Cryptanalysis of HMAC/NMAC-Whirlpool.",
                    "Lattice-Based Group Signatures with Logarithmic Signature Size.",
                    "The Fiat-Shamir Transformation in a Quantum World.",
                    "On the Security of One-Witness Blind Signature Schemes.",
                    "Unconditionally Secure and Universally Composable Commitments from Physical Assumptions.",
                    "Functional Encryption from (Small) Hardware Tokens.",
                    "Bounded Tamper Resilience: How to Go beyond the Algebraic Barrier.",
                    "Tamper Resilient Circuits: The Adversary at the Gates.",
                    "Efficient General-Adversary Multi-Party Computation.",
                    "Fair and Efficient Secure Multiparty Computation with Reputation Systems.",
                    "Between a Rock and a Hard Place: Interpolating between MPC and FHE.",
                    "Building Lossy Trapdoor Functions from Lossy Encryption.",
                    "Pseudorandom Generators from Regular One-Way Functions: New Constructions with Improved Parameters.",
                    "Constrained Pseudorandom Functions and Their Applications.",
                    "Fully Homomorphic Message Authenticators.",
                    "Non-uniform Cracks in the Concrete: The Power of Free Precomputation.",
                    "Factoring RSA Keys from Certified Smart Cards: Coppersmith in the Wild.",
                    "Naturally Rehearsing Passwords.",
                    "Leakage-Resilient Chosen-Ciphertext Secure Public-Key Encryption from Hash Proof System and One-Time Lossy Filter.",
                    "On Continual Leakage of Discrete Log Representations.",
                    "Hiding the Input-Size in Secure Two-Party Computation.",
                    "Secure Two-Party Computation with Reusable Bit-Commitments, via a Cut-and-Choose with Forge-and-Lose Technique - (Extended Abstract).",
                    "A Heuristic for Finding Compatible Differential Paths with Application to HAS-160.",
                    "Improved Cryptanalysis of Reduced RIPEMD-160.",
                    "Limited-Birthday Distinguishers for Hash Functions - Collisions beyond the Birthday Bound Can Be Meaningful.",
                    "On Diamond Structures and Trojan Message Attacks."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th ASIACRYPT 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2012",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2012 - 18th International Conference on the Theory and Application of Cryptology and Information Security, Beijing, China, December 2-6, 2012. Proceedings.",
                "count": 45,
                "papers": [
                    "Pairing-Based Cryptography: Past, Present, and Future.",
                    "Some Mathematical Mysteries in Lattices.",
                    "Constant-Size Structure-Preserving Signatures: Generic Constructions and Simple Assumptions.",
                    "Dual Form Signatures: An Approach for Proving Security from Static Assumptions.",
                    "Breaking Pairing-Based Cryptosystems Using η T Pairing over GF(397).",
                    "On the (Im)possibility of Projecting Property in Prime-Order Setting.",
                    "Optimal Reductions of Some Decisional Problems to the Rank Problem.",
                    "Signature Schemes Secure against Hard-to-Invert Leakage.",
                    "Completeness for Symmetric Two-Party Functionalities - Revisited.",
                    "Adaptively Secure Garbling with Applications to One-Time Programs and Secure Outsourcing.",
                    "The Generalized Randomized Iterate and Its Application to New Efficient Constructions of UOWHFs from Regular One-Way Functions.",
                    "Perfect Algebraic Immune Functions.",
                    "Differential Analysis of the LED Block Cipher.",
                    "PRINCE - A Low-Latency Block Cipher for Pervasive Computing Applications - Extended Abstract.",
                    "Analysis of Differential Attacks in ARX Constructions.",
                    "Integral and Multidimensional Linear Distinguishers with Correlation Zero.",
                    "Differential Attacks against Stream Cipher ZUC.",
                    "An Asymptotically Tight Security Analysis of the Iterated Even-Mansour Cipher.",
                    "3kf9: Enhancing 3GPP-MAC beyond the Birthday Bound.",
                    "Understanding Adaptivity: Random Systems Revisited.",
                    "RKA Security beyond the Linear Barrier: IBE, Encryption and Signatures.",
                    "Fully Secure Unbounded Inner-Product and Attribute-Based Encryption.",
                    "Computing on Authenticated Data: New Privacy Definitions and Constructions.",
                    "A Coding-Theoretic Approach to Recovering Noisy RSA Keys.",
                    "Certifying RSA.",
                    "Faster Gaussian Lattice Sampling Using Lazy Floating-Point Arithmetic.",
                    "Learning a Zonotope and More: Cryptanalysis of NTRUSign Countermeasures.",
                    "On Polynomial Systems Arising from a Weil Descent.",
                    "ECM at Work.",
                    "IND-CCA Secure Cryptography Based on a Variant of the LPN Problem.",
                    "Provable Security of the Knudsen-Preneel Compression Functions.",
                    "Optimal Collision Security in Double Block Length Hashing with Single Length Key.",
                    "Bicliques for Permutations: Collision and Preimage Attacks in Stronger Settings.",
                    "Investigating Fundamental Security Requirements on Whirlpool: Improved Preimage and Collision Attacks.",
                    "Generic Related-Key Attacks for HMAC.",
                    "The Five-Card Trick Can Be Done with Four Cards.",
                    "A Mix-Net from Any CCA2 Secure Cryptosystem.",
                    "How Not to Prove Yourself: Pitfalls of the Fiat-Shamir Heuristic and Applications to Helios.",
                    "Sequential Aggregate Signatures with Lazy Verification from Trapdoor Permutations - (Extended Abstract).",
                    "Commitments and Efficient Zero-Knowledge Proofs from Learning Parity with Noise.",
                    "Calling Out Cheaters: Covert Security with Public Verifiability.",
                    "A Unified Framework for UC from Only OT.",
                    "Four-Dimensional Gallant-Lambert-Vanstone Scalar Multiplication.",
                    "Shuffling against Side-Channel Attacks: A Comprehensive Study with Cautionary Note.",
                    "Theory and Practice of a Leakage Resilient Masking Scheme."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th ASIACRYPT 2011",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2011",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2011 - 17th International Conference on the Theory and Application of Cryptology and Information Security, Seoul, South Korea, December 4-8, 2011. Proceedings.",
                "count": 40,
                "papers": [
                    "BKZ 2.0: Better Lattice Security Estimates.",
                    "Functional Encryption for Inner Product Predicates from Learning with Errors.",
                    "Random Oracles in a Quantum World.",
                    "Lossy Encryption: Constructions from General Assumptions and Efficient Selective Opening Chosen Ciphertext Security.",
                    "Structure Preserving CCA Secure Encryption and Applications.",
                    "Decoding Random Linear Codes in $\\tilde{\\mathcal{O}}(2^{0.054n})$.",
                    "Lower and Upper Bounds for Deniable Public-Key Encryption.",
                    "Bridging Broadcast Encryption and Group Key Agreement.",
                    "On the Joint Security of Encryption and Signature, Revisited.",
                    "Polly Cracker, Revisited.",
                    "Oblivious RAM with O((logN)3) Worst-Case Cost.",
                    "Noiseless Database Privacy.",
                    "The Preimage Security of Double-Block-Length Compression Functions.",
                    "Rebound Attack on JH42.",
                    "Second-Order Differential Collisions for Reduced SHA-256.",
                    "Finding SHA-2 Characteristics: Searching through a Minefield of Contradictions.",
                    "Cryptanalysis of ARMADILLO2.",
                    "An Experimentally Verified Attack on Full Grain-128 Using Dedicated Reconfigurable Hardware.",
                    "Biclique Cryptanalysis of the Full AES.",
                    "Tag Size Does Matter: Attacks and Proofs for the TLS Record Protocol.",
                    "Resettable Cryptography in Constant Rounds - The Case of Zero Knowledge.",
                    "Two Provers in Isolation.",
                    "Efficient Zero-Knowledge Arguments from Two-Tiered Homomorphic Commitments.",
                    "A Framework for Practical Universally Composable Zero-Knowledge Protocols.",
                    "Non-interactive and Re-usable Universally Composable String Commitments with Adaptive Security.",
                    "Cryptography Secure against Related-Key Attacks and Tampering.",
                    "Counting Points on Genus 2 Curves with Real Multiplication.",
                    "On the Efficiency of Bit Commitment Reductions.",
                    "Secure Communication in Multicast Graphs.",
                    "Constant-Round Private Function Evaluation with Linear Complexity.",
                    "Constant-Rounds, Linear Multi-party Computation for Exponentiation and Modulo Reduction with Perfect Security.",
                    "Computational Verifiable Secret Sharing Revisited.",
                    "Natural Generalizations of Threshold Secret Sharing.",
                    "Separating Short Structure-Preserving Signatures from Non-interactive Assumptions.",
                    "Short Signatures from Weaker Assumptions.",
                    "Practical Key-Recovery for All Possible Parameters of SFLASH.",
                    "The Leakage-Resilience Limit of a Computational Problem Is Equal to Its Unpredictability Entropy.",
                    "Leakage-Resilient Cryptography from the Inner-Product Extractor.",
                    "Program Obfuscation with Leaky Hardware.",
                    "BiTR: Built-in Tamper Resilience."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th ASIACRYPT 2010",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2010",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2010 - 16th International Conference on the Theory and Application of Cryptology and Information Security, Singapore, December 5-9, 2010. Proceedings.",
                "count": 35,
                "papers": [
                    "Rotational Rebound Attacks on Reduced Skein.",
                    "Finding Second Preimages of Short Messages for Hamsi-256.",
                    "Non-full-active Super-Sbox Analysis: Applications to ECHO and Grøstl.",
                    "Advanced Meet-in-the-Middle Preimage Attacks: First Results on Full Tiger, and Improved Results on MD4 and SHA-2.",
                    "Collision Attacks against the Knudsen-Preneel Compression Functions.",
                    "Improved Generic Attacks on Unbalanced Feistel Schemes with Expanding Functions.",
                    "The World Is Not Enough: Another Look on Second-Order DPA.",
                    "Conditional Differential Cryptanalysis of NLFSR-Based Cryptosystems.",
                    "A Byte-Based Guess and Determine Attack on SOSEMANUK.",
                    "Improved Single-Key Attacks on 8-Round AES-192 and AES-256.",
                    "Constant-Size Commitments to Polynomials and Their Applications.",
                    "Computationally Secure Pattern Matching in the Presence of Malicious Adversaries.",
                    "Linear-Complexity Private Set Intersection Protocols Secure in Malicious Model.",
                    "Generic Compilers for Authenticated Key Exchange.",
                    "A Forward-Secure Symmetric-Key Derivation Protocol - How to Improve Classical DUKPT.",
                    "Efficient String-Commitment from Weak Bit-Commitment.",
                    "On the Static Diffie-Hellman Problem on Elliptic Curves over Extension Fields.",
                    "Random Oracles with(out) Programmability.",
                    "Short Pairing-Based Non-interactive Zero-Knowledge Arguments.",
                    "Short Non-interactive Zero-Knowledge Proofs.",
                    "Optimistic Concurrent Zero Knowledge.",
                    "Faster Fully Homomorphic Encryption.",
                    "A Group Signature Scheme from Lattice Assumptions.",
                    "Lattice-Based Blind Signatures.",
                    "The Round Complexity of Verifiable Secret Sharing: The Statistical Case.",
                    "General Perfectly Secure Message Transmission Using Linear Codes.",
                    "On Invertible Sampling and Adaptive Security.",
                    "Multiparty Computation for Modulo Reduction without Bit-Decomposition and a Generalization to Bit-Decomposition.",
                    "A Closer Look at Anonymity and Robustness in Encryption Schemes.",
                    "Limitations on Transformations from Composite-Order to Prime-Order Groups: The Case of Round-Optimal Blind Signatures.",
                    "The Semi-Generic Group Model and Applications to Pairing-Based Cryptography.",
                    "The Degree of Regularity of HFE Systems.",
                    "Structured Encryption and Controlled Disclosure.",
                    "Leakage Resilient ElGamal Encryption.",
                    "Efficient Public-Key Cryptography in the Presence of Key Leakage."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "15th ASIACRYPT 2009",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2009",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2009, 15th International Conference on the Theory and Application of Cryptology and Information Security, Tokyo, Japan, December 6-10, 2009. Proceedings.",
                "count": 41,
                "papers": [
                    "Related-Key Cryptanalysis of the Full AES-192 and AES-256.",
                    "The Key-Dependent Attack on Block Ciphers.",
                    "Cascade Encryption Revisited.",
                    "Quantum-Secure Coin-Flipping and Applications.",
                    "On the Power of Two-Party Quantum Cryptography.",
                    "Security Bounds for the Design of Code-Based Cryptosystems.",
                    "Rebound Attack on the Full Lane Compression Function.",
                    "Rebound Distinguishers: Results on the Full Whirlpool Compression Function.",
                    "MD5 Is Weaker Than Weak: Attacks on Concatenated Combiners.",
                    "The Intel AES Instructions Set and the SHA-3 Candidates.",
                    "Group Encryption: Non-interactive Realization in the Standard Model.",
                    "On Black-Box Constructions of Predicate Encryption from Trapdoor Permutations.",
                    "Hierarchical Predicate Encryption for Inner-Products.",
                    "Hedged Public-Key Encryption: How to Protect against Bad Randomness.",
                    "Secure Two-Party Computation Is Practical.",
                    "Secure Multi-party Computation Minimizing Online Rounds.",
                    "Improved Non-committing Encryption with Applications to Adaptively Secure Protocols.",
                    "Non-malleable Statistically Hiding Commitment from Any One-Way Function.",
                    "Proofs of Storage from Homomorphic Identification Protocols.",
                    "Simple Adaptive Oblivious Transfer without Random Oracle.",
                    "Improved Generic Algorithms for 3-Collisions.",
                    "A Modular Design for Hash Functions: Towards Making the Mix-Compress-Mix Approach Practical.",
                    "How to Confirm Cryptosystems Security: The Original Merkle-Damgård Is Still Alive!",
                    "On the Analysis of Cryptographic Assumptions in the Generic Ring Model.",
                    "Zero Knowledge in the Random Oracle Model, Revisited.",
                    "A Framework for Universally Composable Non-committing Blind Signatures.",
                    "Cryptanalysis of the Square Cryptosystems.",
                    "Factoring pq2 with Quadratic Forms: Nice Cryptanalyses.",
                    "Attacking Power Generators Using Unravelled Linearization: When Do We Output Too Much?",
                    "Security Notions and Generic Constructions for Client Puzzles.",
                    "Foundations of Non-malleable Hash and One-Way Functions.",
                    "Improved Cryptanalysis of Skein.",
                    "Linearization Framework for Collision Attacks: Application to CubeHash and MD6.",
                    "Preimages for Step-Reduced SHA-2.",
                    "Fiat-Shamir with Aborts: Applications to Lattice and Factoring-Based Signatures.",
                    "Efficient Public Key Encryption Based on Ideal Lattices.",
                    "Smooth Projective Hashing and Password-Based Authenticated Key Exchange from Lattices.",
                    "PSS Is Secure against Random Fault Attacks.",
                    "Cache-Timing Template Attacks.",
                    "Memory Leakage-Resilient Encryption Based on Physically Unclonable Functions.",
                    "Signature Schemes with Bounded Leakage Resilience."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th ASIACRYPT 2008",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2008",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2008, 14th International Conference on the Theory and Application of Cryptology and Information Security, Melbourne, Australia, December 7-11, 2008. Proceedings.",
                "count": 34,
                "papers": [
                    "MPC vs. SFE : Unconditional and Computational Security.",
                    "Strongly Multiplicative and 3-Multiplicative Linear Secret Sharing Schemes.",
                    "Graph Design for Secure Multiparty Computation over Non-Abelian Groups.",
                    "Some Perspectives on Complexity-Based Cryptography.",
                    "A Modular Security Analysis of the TLS Handshake Protocol.",
                    "Ambiguous Optimistic Fair Exchange.",
                    "Compact Proofs of Retrievability.",
                    "On the Security of HB# against a Man-in-the-Middle Attack.",
                    "Hash Functions from Sigma Protocols and Improvements to VSH.",
                    "Slide Attacks on a Class of Hash Functions.",
                    "Basing PRFs on Constant-Query Weak PRFs: Minimizing Assumptions for Efficient Symmetric Cryptography.",
                    "Universally Composable Adaptive Oblivious Transfer.",
                    "A Linked-List Approach to Cryptographically Secure Elections Using Instant Runoff Voting.",
                    "Towards Robust Computation on Encrypted Data.",
                    "Efficient Protocols for Set Membership and Range Proofs.",
                    "Preimage Attacks on 3, 4, and 5-Pass HAVAL.",
                    "How to Fill Up Merkle-Damgård Hash Functions.",
                    "Limits of Constructive Security Proofs.",
                    "Efficient Chosen Ciphertext Secure Public Key Encryption under the Computational Diffie-Hellman Assumption.",
                    "Twisted Edwards Curves Revisited.",
                    "On the Validity of the phi-Hiding Assumption in Cryptographic Protocols.",
                    "Chosen Ciphertext Security with Optimal Ciphertext Overhead.",
                    "Concurrently Secure Identification Schemes Based on the Worst-Case Hardness of Lattice Problems.",
                    "Rigorous and Efficient Short Lattice Vectors Enumeration.",
                    "Solving Linear Equations Modulo Divisors: On Factoring Given Any Bits.",
                    "An Infinite Class of Balanced Functions with Optimal Algebraic Immunity, Good Immunity to Fast Algebraic Attacks and Good Nonlinearity.",
                    "An Improved Impossible Differential Attack on MISTY1.",
                    "Generalized Identity Based and Broadcast Encryption Schemes.",
                    "Speeding Up the Pollard Rho Method on Prime Fields.",
                    "Sufficient Conditions for Intractability over Black-Box Groups: Generic Lower Bounds for Generalized DL and DH Problems.",
                    "OAEP Is Secure under Key-Dependent Messages.",
                    "Cryptanalysis of Sosemanuk and SNOW 2.0 Using Linear Masks.",
                    "A New Attack on the LEX Stream Cipher.",
                    "Breaking the F-FCSR-H Stream Cipher in Real Time."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th ASIACRYPT 2007",
        "info": "Kuching, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2007",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2007, 13th International Conference on the Theory and Application of Cryptology and Information Security, Kuching, Malaysia, December 2-6, 2007, Proceedings.",
                "count": 35,
                "papers": [
                    "A Kilobit Special Number Field Sieve Factorization.",
                    "When e-th Roots Become Easier Than Factoring.",
                    "Faster Addition and Doubling on Elliptic Curves.",
                    "A Non-interactive Shuffle with Pairing Based Verifiability.",
                    "On Privacy Models for RFID.",
                    "Obtaining Universally Compoable Security: Towards the Bare Bones of Trust.",
                    "A Simple Variant of the Merkle-Damgård Scheme with a Permutation.",
                    "Seven-Property-Preserving Iterated Hashing: ROX.",
                    "How to Build a Hash Function from Any Collision-Resistant Function.",
                    "Fully Anonymous Group Signatures Without Random Oracles.",
                    "Group Encryption.",
                    "Identity-Based Broadcast Encryption with Constant Size Ciphertexts and Private Keys.",
                    "Boosting Merkle-Damgård Hashing for Message Authentication.",
                    "On Efficient Message Authentication Via Block Cipher Design Techniques.",
                    "Symmetric Key Cryptography on Modern Graphics Hardware.",
                    "Blind Identity-Based Encryption and Simulatable Oblivious Transfer.",
                    "Multi-party Indirect Indexing and Applications.",
                    "Two-Party Computing with Encrypted Data.",
                    "Known-Key Distinguishers for Some Block Ciphers.",
                    "Generic Attacks on Unbalanced Feistel Schemes with Expanding Functions.",
                    "On Tweaking Luby-Rackoff Blockciphers.",
                    "Secure Protocols with Asymmetric Trust.",
                    "Simple and Efficient Perfectly-Secure Asynchronous MPC.",
                    "Efficient Byzantine Agreement with Faulty Minority.",
                    "Information-Theoretic Security Without an Honest Majority.",
                    "Black-Box Extension Fields and the Inexistence of Field-Homomorphic One-Way Permutations.",
                    "Concurrent Statistical Zero-Knowledge Arguments for NP from One Way Functions.",
                    "Anonymous Quantum Communication.",
                    "Authenticated Key Exchange and Key Encapsulation in the Standard Model.",
                    "Miniature CCA2 PK Encryption: Tight Security Without Redundancy.",
                    "Bounded CCA2-Secure Encryption.",
                    "Relations Among Notions of Non-malleability for Encryption.",
                    "Cryptanalysis of the Tiger Hash Function.",
                    "Cryptanalysis of Grindahl.",
                    "A Key Recovery Attack on Edon80."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "12th ASIACRYPT 2006",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2006",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2006, 12th International Conference on the Theory and Application of Cryptology and Information Security, Shanghai, China, December 3-7, 2006, Proceedings.",
                "count": 30,
                "papers": [
                    "Finding SHA-1 Characteristics: General Results and Applications.",
                    "Improved Collision Search for SHA-0.",
                    "Forgery and Partial Key-Recovery Attacks on HMAC and NMAC Using Hash Collisions.",
                    "New Guess-and-Determine Attack on the Self-Shrinking Generator.",
                    "On the (In)security of Stream Ciphers Based on Arrays and Modular Addition.",
                    "Construction and Analysis of Boolean Functions of 2t+1 Variables with Maximum Algebraic Immunity.",
                    "Secure Sketch for Biometric Templates.",
                    "The 2-Adic CM Method for Genus 2 Curves with Application to Cryptography.",
                    "Extending Scalar Multiplication Using Double Bases.",
                    "HIBE With Short Public Parameters Without Random Oracle.",
                    "Forward-Secure and Searchable Broadcast Encryption with Short Ciphertexts and Private Keys.",
                    "On the Generic Construction of Identity-Based Signatures with Additional Properties.",
                    "On the Provable Security of an Efficient RSA-Based Pseudorandom Generator.",
                    "On the Security of OAEP.",
                    "Relationship Between Standard Model Plaintext Awareness and Message Hiding.",
                    "On the Equivalence of RSA and Factoring Regarding Generic Ring Algorithms.",
                    "Trading One-Wayness Against Chosen-Ciphertext Security in Factoring-Based Encryption.",
                    "A Strategy for Finding Roots of Multivariate Polynomials with New Applications in Attacking RSA Variants.",
                    "Indifferentiable Security Analysis of Popular Hash Functions with Prefix-Free Padding.",
                    "Multi-Property-Preserving Hash Domain Extension and the EMD Transform.",
                    "Combining Compression Functions and Block Cipher-Based Hash Functions.",
                    "A Scalable Password-Based Group Key Exchange Protocol in the Standard Model.",
                    "A Weakness in Some Oblivious Transfer and Zero-Knowledge Protocols.",
                    "Almost Optimum Secret Sharing Schemes Secure Against Cheating for Arbitrary Secret Distribution.",
                    "KFC - The Krazy Feistel Cipher.",
                    "Generic Attacks on Unbalanced Feistel Schemes with Contracting Functions.",
                    "New Cryptanalytic Results on IDEA.",
                    "New Approach for Selectively Convertible Undeniable Signature Schemes.",
                    "Simulation-Sound NIZK Proofs for a Practical Language and Constant Size Group Signatures.",
                    "Analysis of One Popular Group Signature Scheme."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th ASIACRYPT 2005",
        "info": "Chennai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2005",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2005, 11th International Conference on the Theory and Application of Cryptology and Information Security, Chennai, India, December 4-8, 2005, Proceedings.",
                "count": 37,
                "papers": [
                    "Discrete-Log-Based Signatures May Not Be Equivalent to Discrete Log.",
                    "Do All Elliptic Curves of the Same Order Have the Same Difficulty of Discrete Log?",
                    "Adapting Density Attacks to Low-Weight Knapsacks.",
                    "Efficient and Secure Elliptic Curve Point Multiplication Using Double-Base Chains.",
                    "Upper Bounds on the Communication Complexity of Optimally Resilient Cryptographic Multiparty Computation.",
                    "Graph-Decomposition-Based Frameworks for Subset-Cover Broadcast Encryption and Efficient Instantiations.",
                    "Revealing Additional Information in Two-Party Computations.",
                    "Gate Evaluation Secret Sharing and Secure One-Round Two-Party Computation.",
                    "Parallel Multi-party Computation from Linear Multi-secret Sharing Schemes.",
                    "Updatable Zero-Knowledge Databases.",
                    "Simple and Tight Bounds for Information Reconciliation and Privacy Amplification.",
                    "Quantum Anonymous Transmissions.",
                    "Privacy-Preserving Graph Algorithms in the Semi-honest Model.",
                    "Spreading Alerts Quietly and the Subgroup Escape Problem.",
                    "A Sender Verifiable Mix-Net and a New Proof of a Shuffle.",
                    "Universally Anonymizable Public-Key Encryption.",
                    "Fast Computation of Large Distributions and Its Cryptographic Applications.",
                    "An Analysis of the XSL Algorithm.",
                    "New Applications of Time Memory Data Tradeoffs.",
                    "Linear Cryptanalysis of the TSC Family of Stream Ciphers.",
                    "A Practical Attack on the Fixed RC4 in the WEP Mode.",
                    "A Near-Practical Attack Against B Mode of HBB.",
                    "New Improvements of Davies-Murphy Cryptanalysis.",
                    "A Related-Key Rectangle Attack on the Full KASUMI.",
                    "Some Attacks Against a Double Length Hash Proposal.",
                    "A Failure-Friendly Design Principle for Hash Functions.",
                    "Identity-Based Hierarchical Strongly Key-Insulated Encryption and Its Application.",
                    "Efficient and Provably-Secure Identity-Based Signatures and Signcryption from Bilinear Maps.",
                    "Verifier-Local Revocation Group Signature Schemes with Backward Unlinkability from Bilinear Maps.",
                    "Modular Security Proofs for Key Agreement Protocols.",
                    "A Simple Threshold Authenticated Key Exchange from Short Secrets.",
                    "Examining Indistinguishability-Based Proof Models for Key Establishment Protocols.",
                    "Server-Aided Verification: Theory and Practice.",
                    "Errors in Computational Complexity Proofs for Protocols.",
                    "Universal Designated Verifier Signature Proof (or How to Efficiently Prove Knowledge of a Signature).",
                    "Efficient Designated Confirmer Signatures Without Random Oracles or General Zero-Knowledge Proofs.",
                    "Universally Convertible Directed Signatures."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th ASIACRYPT 2004",
        "info": "Jeju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2004",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2004, 10th International Conference on the Theory and Application of Cryptology and Information Security, Jeju Island, Korea, December 5-9, 2004, Proceedings.",
                "count": 37,
                "papers": [
                    "On Feistel Ciphers Using Optimal Diffusion Mappings Across Multiple Rounds.",
                    "Efficient Instantiations of Tweakable Blockciphers and Refinements to Modes OCB and PMAC.",
                    "Eliminating Random Permutation Oracles in the Even-Mansour Cipher.",
                    "Towards Plaintext-Aware Public-Key Encryption Without Random Oracles.",
                    "OAEP 3-Round: A Generic and Secure Asymmetric Encryption Padding.",
                    "Stream Ciphers: Dead or Alive?",
                    "On the Generalized Linear Equivalence of Functions Over Finite Fields.",
                    "Sieving Using Bucket Sort.",
                    "Right-Invariance: A Property for Probabilistic Analysis of Cryptography Based on Infinite Groups.",
                    "Practical Two-Party Computation Based on the Conditional Gate.",
                    "Privacy in Non-private Environments.",
                    "Asynchronous Proactive Cryptosystems Without Agreement (Extended Abstract).",
                    "Lattice-Based Threshold-Changeability for Standard Shamir Secret-Sharing Schemes.",
                    "Masking Based Domain Extenders for UOWHFs: Bounds and Constructions.",
                    "Higher Order Universal One-Way Hash Functions.",
                    "The MD2 Hash Function Is Not One-Way.",
                    "New Approaches to Password Authenticated Key Exchange Based on RSA.",
                    "Constant-Round Authenticated Group Key Exchange for Dynamic Groups.",
                    "A Public-Key Black-Box Traitor Tracing Scheme with Sublinear Ciphertext Size Against Self-Defensive Pirates.",
                    "Batching Schnorr Identification Scheme with Applications to Privacy-Preserving Authorization and Low-Bandwidth Communication Devices.",
                    "Secret Handshakes from CA-Oblivious Encryption.",
                    "k-Times Anonymous Authentication (Extended Abstract).",
                    "The XL-Algorithm and a Conjecture from Commutative Algebra.",
                    "Comparison Between XL and Gröbner Basis Algorithms.",
                    "Generic Homomorphic Undeniable Signatures.",
                    "Efficient and Provably Secure Trapdoor-Free Group Signature Schemes from Bilinear Pairings.",
                    "On the Security of MOR Public Key Cryptosystem.",
                    "Cryptanalyzing the Polynomial-Reconstruction Based Public-Key System Under Optimal Parameter Choice.",
                    "Colluding Attacks to a Payment Protocol and Two Signature Exchange Schemes.",
                    "Information Security in Korea IT839 Strategy.",
                    "How Far Can We Go Beyond Linear Cryptanalysis?",
                    "The Davies-Murphy Power Attack.",
                    "Time-Memory Trade-Off Attacks on Multiplications and T-Functions.",
                    "Cryptanalysis of Bluetooth Keystream Generator Two-Level E0.",
                    "On Provably Secure Time-Stamping Schemes.",
                    "Strong Conditional Oblivious Transfer and Computing on Intervals.",
                    "Improved Setup Assumptions for 3-Round Resettable Zero Knowledge."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th ASIACRYPT 2003",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2003",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2003, 9th International Conference on the Theory and Application of Cryptology and Information Security, Taipei, Taiwan, November 30 - December 4, 2003, Proceedings.",
                "count": 33,
                "papers": [
                    "Chosen-Ciphertext Security without Redundancy.",
                    "Some RSA-Based Encryption Schemes with Tight Security Reduction.",
                    "A Simple Public-Key Cryptosystem with a Double Trapdoor Decryption Mechanism and Its Applications.",
                    "Factoring Estimates for a 1024-Bit RSA Modulus.",
                    "Index Calculus Attack for Hyperelliptic Curves of Small Genus.",
                    "Parallelizing Explicit Formula for Arithmetic in the Jacobian of Hyperelliptic Curves.",
                    "Tate Pairing Implementation for Hyperelliptic Curves y2 = xp-x + d.",
                    "The AGM-X0(N) Heegner Point Lifting Algorithm and Elliptic Curve Point Counting.",
                    "Key Management Schemes for Stateless Receivers Based on Time Varying Heterogeneous Logical Key Hierarchy.",
                    "Leakage-Resilient Authenticated Key Establishment Protocols.",
                    "Untraceable Fair Network Payment Protocols with Off-Line TTP.",
                    "Incremental Multiset Hash Functions and Their Application to Memory Integrity Checking.",
                    "New Parallel Domain Extenders for UOWHF.",
                    "Cryptanalysis of 3-Pass HAVAL.",
                    "Efficient Group Signatures without Trapdoors.",
                    "Accumulating Composites and Improved Group Signing.",
                    "Almost Uniform Density of Power Residues and the Provable Security of ESIGN.",
                    "Rotations and Translations of Number Field Sieve Polynomials.",
                    "On Class Group Computations Using the Number Field Sieve.",
                    "The Secret and Beauty of Ancient Chinese Padlocks.",
                    "A Traceable Block Cipher.",
                    "A New Attack against Khazad.",
                    "An Efficient Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack.",
                    "Sequential Key Derivation Patterns for Broadcast Encryption and Key Predistribution Schemes.",
                    "Boneh et al.'s k-Element Aggregate Extraction Assumption Is Equivalent to the Diffie-Hellman Assumption.",
                    "On Diophantine Complexity and Statistical Zero-Knowledge Arguments.",
                    "Verifiable Homomorphic Oblivious Transfer and Private Equality Test.",
                    "Generalized Powering Functions and Their Application to Digital Signatures.",
                    "Certificateless Public Key Cryptography.",
                    "A Complete and Explicit Security Reduction Algorithm for RSA-Based Cryptosystems.",
                    "The Insecurity of Esign in Practical Implementations.",
                    "Efficient One-Time Proxy Signatures.",
                    "Universal Designated-Verifier Signatures."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "8th ASIACRYPT 2002",
        "info": "Queenstown, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2002",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2002, 8th International Conference on the Theory and Application of Cryptology and Information Security, Queenstown, New Zealand, December 1-5, 2002, Proceedings.",
                "count": 36,
                "papers": [
                    "Analysis of Bernstein's Factorization Circuit.",
                    "A Variant of the Cramer-Shoup Cryptosystem for Groups of Unknown Order.",
                    "Looking beyond XTR.",
                    "Bounds for Robust Metering Schemes and Their Relationship with A-code.",
                    "Unconditionally Secure Anonymous Encryption and Group Authentication.",
                    "Adapting the Weaknesses of the Random Oracle Model to the Generic Group Model.",
                    "On the Impossibilities of Basing One-Way Permutations on Central Cryptographic Primitives.",
                    "A Statistically-Hiding Integer Commitment Scheme Based on Groups with Hidden Order.",
                    "Efficient Oblivious Transfer in the Bounded-Storage Model.",
                    "In How Many Ways Can You Write Rijndael?",
                    "On the Security of Rijndael-Like Structures against Differential and Linear Cryptanalysis.",
                    "Threshold Cryptosystems Based on Factoring.",
                    "Non-interactive Distributed-Verifier Proofs and Proving Relations among Commitments.",
                    "Asynchronous Secure Communication Tolerating Mixed Adversaries.",
                    "Amplified Boomerang Attack against Reduced-Round SHACAL.",
                    "Enhancing Differential-Linear Cryptanalysis.",
                    "Cryptanalysis of Block Ciphers with Overdefined Systems of Equations.",
                    "Analysis of Neural Cryptography.",
                    "The Hardness of Hensel Lifting: The Case of RSA and Discrete Logarithm.",
                    "A Comparison and a Combination of SST and AGM Algorithms for Counting Points of Elliptic Curves in Characteristic 2.",
                    "A General Formula of the (t, n)-Threshold Visual Secret Sharing Scheme.",
                    "On Unconditionally Secure Robust Distributed Key Distribution Centers.",
                    "Short Signatures in the Random Oracle Model.",
                    "The Provable Security of Graph-Based One-Time Signatures and Extensions to Algebraic Signature Schemes.",
                    "Transitive Signatures Based on Factoring and RSA.",
                    "1-out-of-n Signatures from a Variety of Keys.",
                    "A Revocation Scheme with Minimal Storage at Receivers.",
                    "Optimistic Mixing for Exit-Polls.",
                    "Improved Construction of Nonlinear Resilient S-Boxes.",
                    "An Upper Bound on the Number of m-Resilient Boolean Functions.",
                    "Group Diffie-Hellman Key Exchange Secure against Dictionary Attacks.",
                    "Secure Channels Based on Authenticated Encryption Schemes: A Simple Characterization.",
                    "ID-Based Blind Signature and Ring Signature from Pairings.",
                    "Hierarchical ID-Based Cryptography.",
                    "Crypto-integrity.",
                    "Gummy and Conductive Silicone Rubber Fingers."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7th ASIACRYPT 2001",
        "info": "Gold Coast, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2001",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2001, 7th International Conference on the Theory and Application of Cryptology and Information Security, Gold Coast, Australia, December 9-13, 2001, Proceedings.",
                "count": 34,
                "papers": [
                    "Cryptanalysis of the NTRU Signature Scheme (NSS) from Eurocrypt 2001.",
                    "On the Insecurity of a Server-Aided RSA Protocol.",
                    "The Modular Inversion Hidden Number Problem.",
                    "Secure Human Identification Protocols.",
                    "Unbelievable Security. Matching AES Security Using Public Key Systems.",
                    "A Probable Prime Test with Very High Confidence for n equiv 1 mod 4.",
                    "Computation of Discrete Logarithms in F2607.",
                    "Speeding Up XTR.",
                    "An Efficient Implementation of Braid Groups.",
                    "How to Achieve a McEliece-Based Digital Signature Scheme.",
                    "Efficient Traitor Tracing Algorithms Using List Decoding.",
                    "Security of Reduced Version of the Block Cipher Camellia against Truncated and Impossible Differential Cryptanalysis.",
                    "Known-IV Attacks on Triple Modes of Operation of Block Ciphers.",
                    "Generic Attacks on Feistel Schemes.",
                    "A Compact Rijndael Hardware Architecture with S-Box Optimization.",
                    "Provable Security of KASUMI and 3GPP Encryption Mode f8.",
                    "Efficient and Mutually Authenticated Key Exchange for Low Power Computing Devices.",
                    "Provably Authenticated Group Diffie-Hellman Key Exchange - The Dynamic Case.",
                    "Fully Distributed Threshold RSA under Standard Assumptions.",
                    "Adaptive Security in the Threshold Setting: From Cryptosystems to Signature Schemes.",
                    "Threshold Cryptosystems Secure against Chosen-Ciphertext Attacks.",
                    "Oblivious Polynomial Evaluation and Oblivious Neural Learning.",
                    "Mutually Independent Commitments.",
                    "Efficient Zero-Knowledge Authentication Based on a Linear Algebra Problem MinRank.",
                    "Responsive Round Complexity and Concurrent Zero-Knowledge.",
                    "Practical Construction and Analysis of Pseudo-Randomness Primitives.",
                    "Autocorrelation Coefficients and Correlation Immunity of Boolean Functions.",
                    "An Extension of Kedlaya's Point-Counting Algorithm to Superelliptic Curves.",
                    "Supersingular Curves in Cryptography.",
                    "Short Signatures from the Weil Pairing.",
                    "Self-Blindable Credential Certificates from the Weil Pairing.",
                    "How to Leak a Secret.",
                    "Key-Privacy in Public-Key Encryption.",
                    "Provably Secure Fair Blind Signatures with Tight Revocation."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th ASIACRYPT 2000",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/2000",
                "sub_name": "Advances in Cryptology - ASIACRYPT 2000, 6th International Conference on the Theory and Application of Cryptology and Information Security, Kyoto, Japan, December 3-7, 2000, Proceedings.",
                "count": 47,
                "papers": [
                    "Cryptanalytic Time/Memory/Data Tradeoffs for Stream Ciphers.",
                    "Cryptanalysis of the RSA Schemes with Short Secret Exponent from Asiacrypt '99.",
                    "Why Textbook ElGamal and RSA Encryption Are Insecure.",
                    "Cryptanalysis of the TTM Cryptosystem.",
                    "Attacking and Repairing Batch Verification Schemes.",
                    "Cryptography Everywhere.",
                    "Security of Signed ElGamal Encryption.",
                    "From Fixed-Length to Arbitrary-Length RSA Padding Schemes.",
                    "Towards Signature-Only Signature Schemes.",
                    "A New Forward-Secure Digital Signature Scheme.",
                    "Unconditionally Secure Digital Signature Schemes Admitting Transferability.",
                    "Efficient Secure Multi-party Computation.",
                    "Mix and Match: Secure Function Evaluation via Ciphertexts.",
                    "A Length-Invariant Hybrid Mix.",
                    "Attack for Flash MIX.",
                    "Distributed Oblivious Transfer.",
                    "Key Improvements to XTR.",
                    "Security of Cryptosystems Based on Class Groups of Imaginary Quadratic Orders.",
                    "Weil Descent of Elliptic Curves over Finite Fields of Characteristic Three.",
                    "Construction of Hyperelliptic Curves with CM and Its Application to Cryptosystems.",
                    "Provable Security for the Skipjack-like Structure against Differential Cryptanalysis and Linear Cryptanalysis.",
                    "On the Pseudorandomness of Top-Level Schemes of Block Ciphers.",
                    "Exploiting Multiples of the Connection Polynomial in Word-Oriented Stream Ciphers.",
                    "Encode-Then-Encipher Encryption: How to Exploit Nonces or Redundancy in Plaintexts for Efficient Cryptography.",
                    "Verifiable Encryption, Group Encryption, and Their Applications to Separable Group Signatures and Signature Sharing Schemes.",
                    "Addition of ElGamal Plaintexts.",
                    "Improved Methods to Perform Threshold RSA.",
                    "Commital Deniable Proofs and Electronic Campaign Finance.",
                    "Provably Secure Metering Scheme.",
                    "CRYPTREC Project - Cryptographic Evaluation Project for the Japanese Electronic Government.",
                    "Anonymous Fingerprinting with Direct Non-repudiation.",
                    "Efficient Anonymous Fingerprinting with Group Signatures.",
                    "Increasing the Power of the Dealer in Non-interactive Zero-Knowledge Proof Systems.",
                    "Zero-Knowledge and Code Obfuscation.",
                    "A Note on Security Proofs in the Generic Model.",
                    "On Relationships among Avalanche, Nonlinearity, and Correlation Immunity.",
                    "Cryptanalysis of the Yi-Lam Hash.",
                    "Power Analysis, What Is Now Possible....",
                    "Concrete Security Characterizations of PRFs and PRPs: Reductions and Applications.",
                    "The Security of Chaffing and Winnowing.",
                    "Authenticated Encryption: Relations among Notions and Analysis of the Generic Composition Paradigm.",
                    "Increasing the Lifetime of a Key: A Comparative Analysis of the Security of Re-keying Techniques.",
                    "Proofs of Security for the Unix Password Hashing Algorithm.",
                    "Trapdooring Discrete Logarithms on Elliptic Curves over Rings.",
                    "Strengthening McEliece Cryptosystem.",
                    "Password-Authenticated Key Exchange Based on RSA.",
                    "Round-Efficient Conference Key Agreement Protocols with Provable Security."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "ASIACRYPT 1999",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1999",
                "sub_name": "Advances in Cryptology - ASIACRYPT '99, International Conference on the Theory and Applications of Cryptology and Information Security, Singapore, November 14-18, 1999, Proceedings.",
                "count": 32,
                "papers": [
                    "Modulus Search for Elliptic Curve Cryptosystems.",
                    "On the Lai-Massey Scheme.",
                    "On Cryptographically Secure Vectorial Boolean Functions.",
                    "Equivalent Keys of HPC.",
                    "Cryptanalysis of Five Rounds of CRYPTON Using Impossible Differentials.",
                    "Cryptanalysis of Two Cryptosystems Based on Group Actions.",
                    "Probabilistic Higher Order Differential Attack and Higher Order Bent Functions.",
                    "Fast Algorithms for Elliptic Curve Cryptosystems over Binary Finite Field.",
                    "Optimizing the Menezes-Okamoto-Vanstone (MOV) Algorithm for Non-supersingular Elliptic Curves.",
                    "Speeding up the Discrete Log Computation on Curves with Automorphisms.",
                    "ECC: Do We Need to Count?",
                    "Elliptic Scalar Multiplication Using Point Halving.",
                    "On the Design of RSA with Short Secret Exponent.",
                    "Efficient Public-Key Cryptosystems Provably Secure Against Active Adversaries.",
                    "Adaptively-Secure Optimal-Resilience Proactive RSA.",
                    "Factorization of RSA-140 Using the Number Field Sieve.",
                    "How to Prove That a Committed Number Is Prime.",
                    "Reducing Logarithms in Totally Non-maximal Imaginary Quadratic Orders to Logarithms in Finite Fields.",
                    "General Adversaries in Unconditional Multi-party Computation.",
                    "Approximation Hardness and Secure Communication in Broadcast Channels.",
                    "Mix-Networks on Permutation Networks.",
                    "Secure Communication in an Unknown Network Using Certificates.",
                    "Linear Complexity versus Pseudorandomness: On Beth and Dai's Result.",
                    "A Class of Explicit Perfect Multi-sequences.",
                    "Cryptanalysis of LFSR-Encrypted Codes with Unknown Combining Function.",
                    "Doing More with Fewer Bits.",
                    "A Quick Group Key Distribution Scheme with \"Entity Revocation\".",
                    "An Efficient Hierarchical Identity-Based Key-Sharing Method Resistant against Collusion-Attacks.",
                    "Periodical Multi-secret Threshold Cryptosystems.",
                    "A Signature Scheme with Message Recovery as Secure as Discrete Logarithm.",
                    "A3-Codes under Collusion Attacks.",
                    "Broadcast Authentication in Group Communication."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "ASIACRYPT 1998",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1998",
                "sub_name": "Advances in Cryptology - ASIACRYPT '98, International Conference on the Theory and Applications of Cryptology and Information Security, Beijing, China, October 18-22, 1998, Proceedings.",
                "count": 33,
                "papers": [
                    "Generating RSA Moduli with a Predetermined Portion.",
                    "Generation of Shared RSA Keys by Two Parties.",
                    "An Attack on RSA Given a Small Fraction of the Private Key Bits.",
                    "C*-+ and HM: Variations Around Two Schemes of T. Matsumoto and H. Imai.",
                    "ECC/DLP and Fractoring-Based Cryptography: A Tale of Two Families (Abstract).",
                    "Efficient Elliptic Curve Exponentiation Using Mixed Coordinates.",
                    "Efficient Implementation of Schoof's Algorithm.",
                    "Design of Hyperelliptic Cryptosystems in Small Characteristic and a Software Implementation over F2n.",
                    "Construction of Secure Elliptic Cryptosystems Using CM Tests and Liftings.",
                    "Elliptic Curve Discrete Logarithms and the Index Calculus.",
                    "Cryptanalysis of Rijmen-Preneel Trapdoor Ciphers.",
                    "Improved Truncated Differential Attacks on SAFER.",
                    "Optimal Resistance Against the Davies and Murphy Attack.",
                    "A Group Signature Scheme with Improved Efficiency.",
                    "A Study on the Proposed Korean Digital Signature Algorithm.",
                    "Cryptanalysis of the Original McEliece Cryptosystem.",
                    "Improving the Security of the McEliece Public-Key Cryptosystem.",
                    "Cryptanalysis in Prime Order Subgroups of Z*n.",
                    "Weak Invertibiity of Finite Automata and Cryptanalysis on FAPKC.",
                    "Bounds and Constructions for Multireceiver Authentication Codes.",
                    "Fair Off-Line e-cash Made Easy.",
                    "Off-Line Fair Payment Protocols Using Convertible Signatures.",
                    "Efficient Fair Exchange with Verifiable Confirmation of Signatures.",
                    "Adaptively Secure Oblivious Transfer.",
                    "ML-Sequences over Rings Z/(2e)*: I. Constructions of Nondegenerative ML-Sequences II. Injectiveness of Compression Mappings of New Classes.",
                    "Analysis Methods for (Alleged) RC4.",
                    "Reduced Complexity Correlation Attacks on Two Clock-Controlled Generators.",
                    "A New Efficient All-Or-Nothing Disclosure of Secrets Protocol.",
                    "The Béguin-Quisquater Server-Aided RSA Protocol from Crypto '95 is not Secure.",
                    "Equitable Key Escrow with Limited Time Span (or, How to Enforce Time Expiration Cryptographically).",
                    "Audio and Optical Cryptography.",
                    "Strong Security Against Active Attacks in Information-Theoretic Secret-Key Agreement.",
                    "Some Bounds and a Construction for Secure Broadcast Encryption."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "ASIACRYPT 1996",
        "info": "Kyongju, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1996",
                "sub_name": "Advances in Cryptology - ASIACRYPT '96, International Conference on the Theory and Applications of Cryptology and Information Security, Kyongju, Korea, November 3-7, 1996, Proceedings.",
                "count": 34,
                "papers": [
                    "A Message Recovery Signature Scheme Equivalent to DSA over Elliptic Curves.",
                    "Cryptographic Protocols Based on Real-Quadratic A-fields.",
                    "Minding your p's and q's.",
                    "Authenticated Multi-Party Key Agreement.",
                    "Cryptography and the Internet: Lessons and Challenges.",
                    "Generating Standard DSA Signatures Without Long Inversion.",
                    "A Fast Software Implementation for Arithmetic Operations in GF(2n).",
                    "Hash Functions Based on Block Ciphers and Quaternary Codes.",
                    "Generalized Feistel Networks.",
                    "On Applying Linear Cryptanalysis to IDEA.",
                    "A Multi-Recastable Ticket Scheme for Electronic Elections.",
                    "Some Remarks on a Receipt-Free and Universally Verifiable Mix-Type Voting Scheme.",
                    "Observations on Non-repudiation.",
                    "On the Efficiency of One-Time Digital Signatures.",
                    "A Hidden Cryptographic Assunmption in No-Transferable Indentification Schemes.",
                    "Electronic Money and Key Management from Global and Regional Points of View.",
                    "Limiting the Visible Space Visual Secret Sharing Schemes and Their Application to Human Identification.",
                    "Towards Characterizing When Information-Theoretic Secret Key Agreement Is Possible.",
                    "Key Sharing Based on the Wire-Tap Channel Type II Concept with Noisy Main Channel.",
                    "Generalization of Higher Order SAC to Vector Output Boolean Functions.",
                    "On the Correlation Immune Functions and Their Nonlinearity.",
                    "How to Date Blind Signatures.",
                    "Provably Secure Blind Signature Schemes.",
                    "Cost-Effective Payment Schemes with Privacy Regulation.",
                    "Mis-representation of Identities in E-cash Schemes and how to Prevent it.",
                    "\"Indirect Discourse Proof\": Achieving Efficient Fair Off-Line E-cash.",
                    "The Validation of Cryptographic Algorithms.",
                    "Convertible Group Signatures.",
                    "How to Utilize the Transformability of Digital Signatures for Solving the Oracle Problem.",
                    "On the Risk of Disruption in Several Multiparty Signature Schemes.",
                    "Correlation Attacks on Cascades of Clock Controlled Shift Registers.",
                    "Conditional Correlation Attack on Nonlinear Filter Generators.",
                    "The Cryptographic Security of the Syndrome Decoding Problem for Rank Distance Codes.",
                    "A World Wide Number Field Sieve Factoring Record: On to 512 Bits."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "ASIACRYPT 1994",
        "info": "Wollongong, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1994",
                "sub_name": "Advances in Cryptology - ASIACRYPT '94, 4th International Conference on the Theory and Applications of Cryptology, Wollongong, Australia, November 28 - December 1, 1994, Proceedings.",
                "count": 36,
                "papers": [
                    "Multifeature Security through Homomorphic Encryption.",
                    "Multiplicative Non-abelian Sharing Schemes and their Application to Threshold Cryptography.",
                    "Lower Bound on the Size of Shares of Nonperfect Secret Sharing Schemes.",
                    "On Sharing Many Secrets (Extended Abstract).",
                    "Combinatorial Interpretation of Secret Sharing Schemes.",
                    "A Correlation Attack on the Binary Sequence Generators with Time-Varying Output Function.",
                    "On the Linear Complexity of Nonlinear Filtered PN-sequences.",
                    "Intrinsic Statistical Weakness of Keystream Generators.",
                    "Semi-bent Functions.",
                    "Structures of Cryptographic Functions with Strong Avalanche Characteristics (Extended Abstract).",
                    "Formal Verification of Cryptographic Protocols: A Survey.",
                    "Efficient Electronic Money (Extended Abstract).",
                    "How to Prevent Buying of Votes in Computer Elections.",
                    "Design and Analysis of Key Exchange Protocols via Secure Channel Identification.",
                    "Zero-Knowledge Proofs of Computational Power in the Shared String Model.",
                    "Information Security Aspects of Spread Spectrum Systems.",
                    "Combinatorial Structure of A-codes with r-fold Security.",
                    "Meta-Message Recovery and Meta-Blind Signature Schemes Based on the Discrete Logarithm Problem and Their Applications.",
                    "A Digital Signature Scheme Based on Linear Error-correcting Block Codes.",
                    "Secure Acceleration of DSS Signatures Using Insecure Server.",
                    "The Magic Words are Squeamish Ossifrage.",
                    "Cryptanalysis of Multiple Modes of Operation.",
                    "Linear Cryptanalysis of LOKI and s2DES.",
                    "Collisions and Inversions for Damgård's Whole Hash Function.",
                    "Attacking the SL2 Hashing Scheme.",
                    "Security of the Center in Key Distribution Schemes.",
                    "Incidence Structures for Key Sharing (Extended Abstract).",
                    "A Public-Key Cryptosystem and a Digital Signature System BAsed on the Lucas Function Analogue to Discrete Logarithms.",
                    "Higher Radix Nonrestoring Modular Multiplication Algorithm and Public-key LSI Architecture with Limited Hardware Resources.",
                    "Low Exponent Attack against Elliptic Curve RSA.",
                    "A Unified Markow Approach to Differential and Linear Cryptanalysis.",
                    "How to Strengthen DES Using Existing Hardware.",
                    "Some Cryptographic Properties of Exponential Functions.",
                    "Factoring: The DNA Solution.",
                    "Can One Design a Signature Scheme Based on Error-Correctin Codes?",
                    "DESV-1: A Variation of the Data Encryption Standard (DES)."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "AUSCRYPT 1992",
        "info": "Gold Coast, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1992",
                "sub_name": "Advances in Cryptology - AUSCRYPT '92, Workshop on the Theory and Application of Cryptographic Techniques, Gold Coast, Queensland, Australia, December 13-16, 1992, Proceedings.",
                "count": 46,
                "papers": [
                    "Treshold Cryptosystems (invited talk).",
                    "Authentication Codes with Perfect Protection.",
                    "Practical Proven Secure Authentication with Arbitration.",
                    "Authentication Codes under Impersonation Attack.",
                    "Cumulative Arrays and Geometric Secret Sharing Schemes.",
                    "Nonperfect Secret Sharing Schemes.",
                    "A Construction of Practical Secret Sharing Schemes using Linear Block Codes.",
                    "HAVAL - A One-Way Hashing Algorithm with Variable Length of Output.",
                    "On the Power of Memory in the Design of Collision Resistant Hash Functions.",
                    "A Practical Digital Multisignature Scheme Based on Discrete Logarithms.",
                    "Group-Oriented Undeniable Signature Schemes without the Assistance of a Mutually Trusted Party.",
                    "Highly Nonlinear 0-1 Balanced Boolean Functions Satisfying Strict Avalanche Criterion.",
                    "Linear Nonequivalence versus Nonlinearity.",
                    "Constructing Large Cryptographically Strong S-boxes.",
                    "Nonasymptotic Estimates of Information Protection Efficiency for the Wire-tape Channel Concept (invited talk).",
                    "Cryptanalysis of LOKI91.",
                    "Cryptanalysis of Summation Generator.",
                    "Secure Addition Sequence and Its Applications on the Server-Aided Secret Computation Protocols.",
                    "Subliminal Channels for Signature Transfer and Their Application to Signature Distribution Schemes.",
                    "A Practical Secret Voting Scheme for Large Scale Elections.",
                    "Privacy for Multi-Party Protocols.",
                    "New Protocols for Electronic Money.",
                    "Modelling and Analyzing Cryprographic Protocols Using Petri Nets.",
                    "On Verifiable Implicit Asking Protocols for RSA Computation.",
                    "Modified Maurer-Yacobi's scheme and its applications.",
                    "The Vulnerability of Geometric Sequences Based on Fields on Odd Characteristic.",
                    "A Fast Cryptographic Checksum Algorithm Based on Stream Ciphers.",
                    "An Approach to the Initial State Reconstruction of a Clock-Controlled Shift Register Based on a Novel Distance Measure.",
                    "Construction of m-ary de Bruijn Sequences (Extendet abstract).",
                    "Information Technology Security Standards - An Australian Perspective.",
                    "Non-Interactive Generation of Shared Pseudorandom Sequences.",
                    "A Generalized Description of DES-based and Benes-based Permutationgenerators.",
                    "Prime Generation with the Demytko-Miller-Trbuvich Algorithm.",
                    "Constructions of Freebly-One-Way Families of Permutations.",
                    "On Bit Correlations Among Preimages of \"Many to One\" One-Way Functions.",
                    "The Fast Cascade Exponentation Algorithm and its Applications on Cryptography.",
                    "The Design of a Conference Key Distribution System.",
                    "Remarks on \"The Design of a Conference Key Distribution System\".",
                    "Public-Key Cryptosystem Based on the Discrete Logarithm Problem.",
                    "Elliptic Curves over Fp Suitable for Cryptosystems.",
                    "The Probability Distribution of the Diffie-Hellman Key.",
                    "A Modular Exponentiation Unit Based on Systolic Arrays.",
                    "A Comparison of Key Distribution Patterns Constructed from Circle Geometries.",
                    "A Block Cipher Method using Combinations of Different Methods under the Control of the User Key.",
                    "An Attack on Two Hash Functions by Zheng-Matsumoto-Imai.",
                    "Primality Testing with Lucas Functions."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "ASIACRYPT 1991",
        "info": "Fujiyoshida, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1991",
                "sub_name": "Advances in Cryptology - ASIACRYPT '91, International Conference on the Theory and Applications of Cryptology, Fujiyoshida, Japan, November 11-14, 1991, Proceedings.",
                "count": 46,
                "papers": [
                    "The Transition from Mechanisms to Electronic Computers, 1940 to 1950.",
                    "Cryptanalysis of LOKI.",
                    "Improving Resistance to Differential Cryptanalysis and the Redesign of LOKI.",
                    "A Method to Estimate the Number of Ciphertext Pairs for Differential Cryptanalysis.",
                    "Construction of DES-like S-boxes Based on Boolean Functions Satisfyieng the SAC.",
                    "The Data Base of Selected Permutations (Extended Abstract).",
                    "A Framework for the Design of One-Way Hash Functions Including Cryptanalysis of Damgård's One-Way Function Based on a Cellular Automaton.",
                    "How to Construct A Family of Strong One Way Permutations.",
                    "On Claw Free Families.",
                    "Sibling Intractable Function Families and Their Applications (Extended Abstract).",
                    "A Digital Multisignature Scheme Based on the Fiat-Shamir Scheme.",
                    "A Generalized Secret Sharing Scheme With Cheater Detection.",
                    "Generalized Threshold Cryptosystems.",
                    "Feistel Type Authentication Codes.",
                    "Research Activities on Cryptology in Korea.",
                    "On Necessary and Sufficient Conditions for the Construction of Super Pseudorandom Permutations.",
                    "A Construction of a Cioher From a Single Pseudorandom Permutation.",
                    "Optima Perfect Randomizers.",
                    "A General Purpose Technique for Locating Key Scheduling Weakness in DES-like Cryptosystems (Extended Abstract).",
                    "Results of Switching-Closure-Test on FEAL (Extended Abstract).",
                    "IC-Cards and Telecommunication Services.",
                    "Cryptanalysis of Several Conference Key Distribution Schemes.",
                    "Revealing Information with Partial Period Correlations (Extended Abstract).",
                    "Extended Majority Voting and Private-Key Algebraic-Code Encryptions.",
                    "A Secure Analog Speech Scrambler Using the Discrete Cosine Transform.",
                    "On Oblivious Transfer Protocol and Its Application for the Exchange of Secrets.",
                    "4 Move Perfect ZKIP of Knowledge with No Assumption.",
                    "On the Complexity of Constant Round ZKIP of Possession of Knowledge.",
                    "On the Power of Two-Local Random Reductions.",
                    "A Note On One-Prover, Instance-Hiding Zero-Knowledge Proof Systems.",
                    "An Efficient Zero-Knowledge Scheme for the Discrete Logarithm Based on Smooth Numbers.",
                    "An Extensin of Zero-Knowledge Proofs and Its Applications.",
                    "Any Language in IP Has a Divertable ZKIP.",
                    "A Multi-Purpose Proof System - for Identity and Membership Proofs.",
                    "Formal Verification of Probabilistic Properties in Cryptographic Protocols (Extended Abstract).",
                    "Cryptography and Machine Learning.",
                    "Speeding up Prime Number Generation.",
                    "Two Efficient Server-Aided Secret Computation Protocols Based on the Addition Sequence.",
                    "On Ordinary Elliptic Curve Cryptosystems.",
                    "Cryptanalysis of Another Knapsack Cryptosystem.",
                    "Collisions for Schnorr's Hash Function FFT-Hash Presented at Crypto '91.",
                    "On NIST's Proposed Digital Signature Standard.",
                    "A Known-Plaintext Attack of FEAL-4 Based on the System of Linear Equations on Difference.",
                    "Simultaneous Attacks in Differential Cryptanalysis (Getting More Pairs Per Encryption).",
                    "Privacy, Cryptographic Pseudonyms, and The State of Health.",
                    "Limitations of the Even-Mansour Construction."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "AUSCRYPT 1990",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/asiacrypt/1990",
                "sub_name": "Advances in Cryptology - AUSCRYPT '90, International Conference on Cryptology, Sydney, Australia, January 8-11, 1990, Proceedings.",
                "count": 39,
                "papers": [
                    "The Implementation of Elliptic Curve Cryptosystems.",
                    "Direct Demonstration of the Power to Break Public-Key Cryptosystems.",
                    "Continued Fractions and the Berlekamp-Massey Algorithm.",
                    "Nonlinear Generators of Binary Sequences with Controllable Complexity and Double Key.",
                    "K-M Sequence is Forwardly Predictable.",
                    "Lower Bounds on the Weight Complexities of Cascaded Binary Sequences.",
                    "Secure User Access Control for Public Networks.",
                    "Formal Specification and Verification of Secure Communication Protocols.",
                    "Network Security Policy Models.",
                    "KEYMEX: An expert system for the design of key management schemes.",
                    "On The Formal Analysis of PKCS Authentication Protocols.",
                    "Some Remarks on Authentication Systems.",
                    "Meet-in-the-Middle Attack on Digital Signature Schemes.",
                    "A Binary Sequence Generator Based on Ziv-Lempel Source Coding.",
                    "A Fast Iterative Algorithm For A Shift Register Initial State Reconstruction Given The Nosiy Output Sequence.",
                    "Parallel Generation of Pseudo-Random Sequences.",
                    "Large Primes in Stream Cipher Cryptography.",
                    "Comparison of Block Ciphers.",
                    "Key Scheduling In Des Type Cryptosystems.",
                    "LOKI - A Cryptographic Primitive for Authentication and Secrecy Applications.",
                    "Permutation Generators of Alternating Groups.",
                    "Showing Credentials without Identification Transfeering Signatures between Unconditionally Unlinkable Pseudonyms.",
                    "A (non-practical) three-pass identification protocol using coding theory.",
                    "Demonstrating Possession without Revealing Factors and its Application.",
                    "Anonymous One-Time Signatures and Flexible Untraceable Electronic Cash.",
                    "Dyadic Matrices and Their Potential Significance in Cryptography.",
                    "A Note on Strong Fibonacci Pseudoprimes.",
                    "On the Significance of the Directed Acyclic Word Graph in Cryptology.",
                    "Solving Equations in Sequences.",
                    "The Practical Application Of State Of The Art Security In Real Environments.",
                    "RSA as a Benchmark for Multiprocessor Machines.",
                    "Range Equations and Range Matrices: a Study in Statistical Database Security.",
                    "Record Encryption in Distributed Databases.",
                    "VLSI Design for Exponentiation in GF (2n).",
                    "A Fast Modular-multiplication Module for Smart Cards.",
                    "Minòs: Extended User Authentication.",
                    "Universal Logic Sequences.",
                    "The Three Faces of Information Security.",
                    "Secure Cryptographic Initialisation."
                ]
            }
        ]
    }
]