[
    {
        "year": "2022",
        "name": "24th CHES 2022",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: IACR Trans. Cryptogr. Hardw. Embed. Syst. 2022",
                "count": 36,
                "papers": [
                    "Quantum Period Finding against Symmetric Primitives in Practice.",
                    "Bypassing Isolated Execution on RISC-V using Side-Channel-Assisted Fault-Injection and Its Countermeasure.",
                    "Can't Touch This: Inertial HSMs Thwart Advanced Physical Attacks.",
                    "CFNTT: Scalable Radix-2/4 NTT Multiplication Architecture with an Efficient Conflict-free Memory Mapping Scheme.",
                    "Multi-moduli NTTs for Saber on Cortex-M3 and Cortex-M4.",
                    "A Constant-time AVX2 Implementation of a Variant of ROLLO.",
                    "MIRACLE: MIcRo-ArChitectural Leakage Evaluation A study of micro-architectural power leakage across many devices.",
                    "Neon NTT: Faster Dilithium, Kyber, and Saber on Cortex-A72 and Apple M1.",
                    "Efficient Implementations of Rainbow and UOV using AVX2.",
                    "A Compact and High-Performance Hardware Architecture for CRYSTALS-Dilithium.",
                    "Curse of Re-encryption: A Generic Power/EM Analysis on Post-Quantum KEMs.",
                    "Generic Hardware Private Circuits Towards Automated Generation of Composable Secure Gadgets.",
                    "Semi-Automatic Locating of Cryptographic Operations in Side-Channel Traces.",
                    "Practical Multiple Persistent Faults Analysis.",
                    "Guessing Bits: Improved Lattice Attacks on (EC)DSA with Nonce Leakage.",
                    "Masked Accelerators and Instruction Set Extensions for Post-Quantum Cryptography.",
                    "A Finer-Grain Analysis of the Leakage (Non) Resilience of OCB.",
                    "Polynomial multiplication on embedded vector architectures.",
                    "ModuloNET: Neural Networks Meet Modular Arithmetic for Efficient Hardware Masking.",
                    "Racing BIKE: Improved Polynomial Multiplication and Inversion in Hardware.",
                    "Automated Generation of Masked Hardware.",
                    "Composite Enclaves: Towards Disaggregated Trusted Execution.",
                    "VITI: A Tiny Self-Calibrating Sensor for Power-Variation Measurement in FPGAs.",
                    "Cryptanalysis of Efficient Masked Ciphers: Applications to Low Latency.",
                    "Will You Cross the Threshold for Me? Generic Side-Channel Assisted Chosen-Ciphertext Attacks on NTRU-based KEMs.",
                    "High-order Table-based Conversion Algorithms and Masking Lattice-based Encryption.",
                    "Highly Vectorized SIKE for AVX-512.",
                    "Redundancy AES Masking Basis for Attack Mitigation (RAMBAM).",
                    "Towards a Formal Treatment of Logic Locking.",
                    "Higher-Order Masked Ciphertext Comparison for Lattice-Based Cryptography.",
                    "Bitslice Masking and Improved Shuffling: How and When to Mix Them in Software?",
                    "Side Channel Attack On Stream Ciphers: A Three-Step Approach To State/Key Recovery.",
                    "ABE Squared: Accurately Benchmarking Efficiency of Attribute-Based Encryption.",
                    "BAT: Small and Fast KEM over NTRU Lattices.",
                    "Transitional Leakage in Theory and Practice Unveiling Security Flaws in Masked Circuits.",
                    "Free Fault Leakages for Deep Exploitation: Algebraic Persistent Fault Analysis on Lightweight Block Ciphers."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "23th CHES 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: IACR Trans. Cryptogr. Hardw. Embed. Syst. 2021",
                "count": 78,
                "papers": [
                    "Compact Dilithium Implementations on Cortex-M3 and Cortex-M4.",
                    "Ranking Loss: Maximizing the Success Rate in Deep Learning Side-Channel Analysis.",
                    "Fill your Boots: Enhanced Embedded Bootloader Exploits via Fault Injection and Binary Analysis.",
                    "Doppelganger Obfuscation - Exploring theDefensive and Offensive Aspects of Hardware Camouflaging.",
                    "The design of scalar AES Instruction Set Extensions for RISC-V.",
                    "Rapidly Verifiable XMSS Signatures.",
                    "DAPA: Differential Analysis aided Power Attack on (Non-) Linear Feedback Shift Registers.",
                    "Fault Injection as an Oscilloscope: Fault Correlation Analysis.",
                    "Polynomial Multiplication in NTRU Prime Comparison of Optimization Strategies on Cortex-M4.",
                    "The Area-Latency Symbiosis: Towards Improved Serial Encryption Circuits.",
                    "Side-Channel Analysis of the Xilinx Zynq UltraScale+ Encryption Engine.",
                    "Re-Consolidating First-Order Masking Schemes Nullifying Fresh Randomness.",
                    "Keep it Unsupervised: Horizontal Attacks Meet Deep Learning.",
                    "Exploring Crypto-Physical Dark Matter and Learning with Physical Rounding Towards Secure and Efficient Fresh Re-Keying.",
                    "Fixslicing AES-like Ciphers New bitsliced AES speed records on ARM-Cortex M and RISC-V.",
                    "Redundant Code-based Masking Revisited.",
                    "Concrete quantum cryptanalysis of binary elliptic curves.",
                    "Machine Learning of Physical Unclonable Functions using Helper Data Revealing a Pitfall in the Fuzzy Commitment Scheme.",
                    "Fault Attacks on CCA-secure Lattice KEMs.",
                    "A White-Box Masking Scheme Resisting Computational and Algebraic Attacks.",
                    "Secure, Accurate, and Practical Narrow-Band Ranging System.",
                    "Provably Secure Hardware Masking in the Transition- and Glitch-Robust Probing Model: Better Safe than Sorry.",
                    "NTT Multiplication for NTT-unfriendly Rings New Speed Records for Saber and NTRU on Cortex-M4 and AVX2.",
                    "Masking in Fine-Grained Leakage Models: Construction, Implementation and Verification.",
                    "Revisiting the functional bootstrap in TFHE.",
                    "Time-Memory Analysis of Parallel Collision Search Algorithms.",
                    "RASSLE: Return Address Stack based Side-channel LEakage.",
                    "New First-Order Secure AES Performance Records.",
                    "A Compact Hardware Implementation of CCA-Secure Key Exchange Mechanism CRYSTALS-KYBER on FPGA.",
                    "Combining Optimization Objectives: New Modeling Attacks on Strong PUFs.",
                    "Speed Reading in the Dark: Accelerating Functional Encryption for Quadratic Functions with Reprogrammable Hardware.",
                    "Online Template Attacks: Revisited.",
                    "Efficiency through Diversity in Ensemble Models applied to Side-Channel Attacks - A Case Study on Public-Key Algorithms -.",
                    "Optimizing BIKE for the Intel Haswell and ARM Cortex-M4.",
                    "Classic McEliece on the ARM Cortex-M4.",
                    "Timing Black-Box Attacks: Crafting Adversarial Examples through Timing Leaks against DNNs on Embedded Devices.",
                    "Security and Trust in Open Source Security Tokens.",
                    "Breaking Masked Implementations with Many Shares on 32-bit Software Platforms or When the Security Order Does Not Matter.",
                    "Pay Attention to Raw Traces: A Deep Learning Architecture for End-to-End Profiling Attacks.",
                    "Analysis and Comparison of Table-based Arithmetic to Boolean Masking.",
                    "AES-LBBB: AES Mode for Lightweight and BBB-Secure Authenticated Encryption.",
                    "Attacking and Defending Masked Polynomial Comparison for Lattice-Based Cryptography.",
                    "Cutting Through the Complexity of Reverse Engineering Embedded Devices.",
                    "Learning Parity with Physical Noise: Imperfections, Reductions and FPGA Prototype.",
                    "Breaking CAS-Lock and Its Variants by Exploiting Structural Traces.",
                    "Denial-of-Service on FPGA-based Cloud Infrastructures - Attack and Defense.",
                    "Information Leakages in Code-based Masking: A Unified Quantification Approach.",
                    "Let's Take it Offline: Boosting Brute-Force Attacks on iPhone's User Authentication through SCA.",
                    "Inconsistency of Simulation and Practice in Delay-based Strong PUFs.",
                    "DL-LA: Deep Learning Leakage Assessment A modern roadmap for SCA evaluations.",
                    "Probing Security through Input-Output Separation and Revisited Quasilinear Masking.",
                    "Improved Leakage-Resistant Authenticated Encryption based on Hardware AES Coprocessors.",
                    "Reinforcement Learning for Hyperparameter Tuning in Deep Learning-based Side-channel Analysis.",
                    "Second-Order SCA Security with almost no Fresh Randomness.",
                    "SEAL-Embedded: A Homomorphic Encryption Library for the Internet of Things.",
                    "Countermeasures against Static Power Attacks - Comparing Exhaustive Logic Balancing and Other Protection Schemes in 28 nm CMOS -.",
                    "Novel Key Recovery Attack on Secure ECDSA Implementation by Exploiting Collisions between Unknown Entries.",
                    "Cross-Device Profiled Side-Channel Attack with Unsupervised Domain Adaptation.",
                    "Structural Attack (and Repair) of Diffused-Input-Blocked-Output White-Box Cryptography.",
                    "Chosen Ciphertext k-Trace Attacks on Masked CCA2 Secure Kyber.",
                    "Over 100x Faster Bootstrapping in Fully Homomorphic Encryption through Memory-centric Optimization with GPUs.",
                    "My other car is your car: compromising the Tesla Model X keyless entry system.",
                    "Masking Kyber: First- and Higher-Order Implementations.",
                    "ROTed: Random Oblivious Transfer for embedded devices.",
                    "Side-Channel Protections for Picnic Signatures.",
                    "An Instruction Set Extension to Support Software-Based Masking.",
                    "Revealing the Weakness of Addition Chain Based Masked SBox Implementations.",
                    "CTIDH: faster constant-time CSIDH.",
                    "Low-Latency Keccak at any Arbitrary Order.",
                    "LifeLine for FPGA Protection: Obfuscated Cryptography for Real-World Security.",
                    "FIVER - Robust Verification of Countermeasures against Fault Injections.",
                    "Scabbard: a suite of efficient learning with rounding key-encapsulation mechanisms.",
                    "The SPEEDY Family of Block Ciphers Engineering an Ultra Low-Latency Cipher from Gate Level for Secure Processor Architectures.",
                    "Higher-Order Lookup Table Masking in Essentially Constant Memory.",
                    "Yoroi: Updatable Whitebox Cryptography.",
                    "Batching CSIDH Group Actions using AVX-512.",
                    "Rainbow on Cortex-M4.",
                    "A Side-Channel Attack on a Masked IND-CCA Secure Saber KEM Implementation."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "22th CHES 2020",
        "info": "Beijing, China (Virtual Event)",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: IACR Trans. Cryptogr. Hardw. Embed. Syst. 2020",
                "count": 60,
                "papers": [
                    "Methodology for Efficient CNN Architectures in Profiling Attacks.",
                    "Recovering the CTR_DRBG state in 256 traces.",
                    "Lightweight Authenticated Encryption Mode of Operation for Tweakable Block Ciphers.",
                    "SITM: See-In-The-Middle Side-Channel Assisted Middle Round Differential Cryptanalysis on SPN Block Ciphers.",
                    "Power Analysis on NTRU Prime.",
                    "Share-slicing: Friend or Foe?",
                    "CAS-Lock: A Security-Corruptibility Trade-off Resilient Logic Locking Scheme.",
                    "Improved Heuristics for Short Linear Programs.",
                    "Cache vs. Key-Dependency: Side Channeling an Implementation of Pilsung.",
                    "TEDT, a Leakage-Resist AEAD Mode for High Physical Security Applications.",
                    "Bluethunder: A 2-level Directional Predictor Based Side-Channel Attack against SGX.",
                    "A Comprehensive Study of Deep Learning for Side-Channel Analysis.",
                    "Side-Channel Countermeasures' Dissection and the Limits of Closed Source Security Evaluations.",
                    "A Fast and Accurate Guessing Entropy Estimation Algorithm for Full-key Recovery.",
                    "Highly Efficient Architecture of NewHope-NIST on FPGA using Low-Complexity NTT/INTT.",
                    "FENL: an ISE to mitigate analogue micro-architectural leakage.",
                    "Dismantling DST80-based Immobiliser Systems.",
                    "Efficient and Private Computations with Code-Based Masking.",
                    "Persistent Fault Attack in Practice.",
                    "When one vulnerable primitive turns viral: Novel single-trace attacks on ECDSA and RSA.",
                    "Time-memory trade-off in Toom-Cook multiplication: an application to module-lattice based cryptography.",
                    "A Compact and Scalable Hardware/Software Co-design of SIKE.",
                    "FEDS: Comprehensive Fault Attack Exploitability Detection for Software Implementations of Block Ciphers.",
                    "Low-Latency Hardware Masking with Application to AES.",
                    "On the Security Goals of White-Box Cryptography.",
                    "Strengthening Sequential Side-Channel Attacks Through Change Detection.",
                    "Investigating Profiled Side-Channel Attacks Against the DES Key Schedule.",
                    "A Novel Evaluation Metric for Deep Learning-Based Side Channel Analysis and Its Extended Application to Imbalanced Data.",
                    "Splitting the Interpose PUF: A Novel Modeling Attack Strategy.",
                    "CPAmap: On the Complexity of Secure FPGA Virtualization, Multi-Tenancy, and Physical Design.",
                    "Revisiting a Methodology for Efficient CNN Architectures in Profiling Attacks.",
                    "JackHammer: Efficient Rowhammer on Heterogeneous FPGA-CPU Platforms.",
                    "The Long and Winding Path to Secure Implementation of GlobalPlatform SCP10.",
                    "ISA Extensions for Finite Field Arithmetic Accelerating Kyber and NewHope on RISC-V.",
                    "Single-Trace Attacks on Keccak.",
                    "Parameterized Hardware Accelerators for Lattice-Based Cryptography and Their Application to the HW/SW Co-Design of qTESLA.",
                    "Generic Side-channel attacks on CCA-secure lattice-based PKE and KEMs.",
                    "Cortex-M4 optimizations for {R, M} LWE schemes.",
                    "Understanding Screaming Channels: From a Detailed Analysis to Improved Attacks.",
                    "Fixslicing: A New GIFT Representation Fast Constant-Time Implementations of GIFT and GIFT-COFB on ARM Cortex-M.",
                    "From A to Z: Projective coordinates leakage in the wild.",
                    "Defeating State-of-the-Art White-Box Countermeasures with Advanced Gray-Box Attacks.",
                    "High-Speed Masking for Polynomial Comparison in Lattice-based KEMs.",
                    "Protecting against Statistical Ineffective Fault Attacks.",
                    "A Hybrid-CPU-FPGA-based Solution to the Recovery of Sha256crypt-hashed Passwords.",
                    "On the spectral features of robust probing security.",
                    "Plaintext: A Missing Feature for Enhancing the Power of Deep Learning in Side-Channel Analysis? Breaking multiple layers of side-channel countermeasures.",
                    "Rejection Sampling Schemes for Extracting Uniform Distribution from Biased PUFs.",
                    "Second-Order Masked Lookup Table Compression Scheme.",
                    "Improving the Performance of the Picnic Signature Scheme.",
                    "Faster Montgomery and double-add ladders for short Weierstrass curves.",
                    "Modeling Soft Analytical Side-Channel Attacks from a Coding Theory Viewpoint.",
                    "RISQ-V: Tightly Coupled RISC-V Accelerators for Post-Quantum Cryptography.",
                    "Minerva: The curse of ECDSA nonces Systematic analysis of lattice attacks on noisy leakage of bit-length of ECDSA nonces.",
                    "DANA Universal Dataflow Analysis for Gate-Level Netlist Reverse Engineering.",
                    "Strength in Numbers: Improving Generalization with Ensembles in Machine Learning-based Profiled Side-channel Analysis.",
                    "Retrofitting Leakage Resilient Authenticated Encryption to Microcontrollers.",
                    "Remove Some Noise: On Pre-processing of Side-channel Measurements with Autoencoders.",
                    "Unrolled Cryptography on Silicon A Physical Security Analysis.",
                    "High-speed Instruction-set Coprocessor for Lattice-based Key Encapsulation Mechanism: Saber in Hardware."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "21th CHES 2019",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: IACR Trans. Cryptogr. Hardw. Embed. Syst. 2019",
                "count": 42,
                "papers": [
                    "Improving CEMA using Correlation Optimization.",
                    "M&M: Masks and Macs against Physical Attacks.",
                    "Secure Physical Enclosures from Covers with Tamper-Resistance.",
                    "SMT Attack: Next Generation Attack on Obfuscated Circuits with Capabilities and Performance Beyond the SAT Attacks.",
                    "3-Share Threshold Implementation of AES S-box without Fresh Randomness.",
                    "Return of the Hidden Number Problem. A Widespread and Novel Key Extraction Attack on ECDSA and DSA.",
                    "Implementing RLWE-based Schemes Using an RSA Co-Processor.",
                    "The Curse of Class Imbalance and Conflicting Metrics with Machine Learning for Side-channel Evaluations.",
                    "Error Amplification in Code-based Cryptography.",
                    "Practical Evaluation of Protected Residue Number System Scalar Multiplication.",
                    "AuCPace: Efficient verifier-based PAKE protocol tailored for the IIoT.",
                    "Best Information is Most Successful Mutual Information and Success Rate in Side-Channel Analysis.",
                    "Secure Data Retrieval on the Cloud: Homomorphic Encryption meets Coresets.",
                    "Non-Profiled Deep Learning-based Side-Channel attacks with Sensitivity Analysis.",
                    "Deep Learning to Evaluate Secure RSA Implementations.",
                    "Towards Globally Optimized Masking: From Low Randomness to Low Noise Rate or Probe Isolating Multiplications with Reduced Randomness and Security against Horizontal Attacks.",
                    "Shaping the Glitch: Optimizing Voltage Fault Injection Attacks.",
                    "Analysis and Improvement of Differential Computation Attacks against Internally-Encoded White-Box Implementations.",
                    "Glitch-Resistant Masking Revisited or Why Proofs in the Robust Probing Model are Needed.",
                    "Reducing a Masked Implementation's Effective Security Order with Setup Manipulations And an Explanation Based on Externally-Amplified Couplings.",
                    "Multi-Tuple Leakage Detection and the Dependent Signal Issue.",
                    "Fully Automated Differential Fault Analysis on Software Implementations of Block Ciphers.",
                    "New Insights to Key Derivation for Tamper-Evident Physical Unclonable Functions.",
                    "Fast, Furious and Insecure: Passive Keyless Entry and Start Systems in Modern Supercars.",
                    "Covert Gates: Protecting Integrated Circuits with Undetectable Camouflaging.",
                    "Consolidating Security Notions in Hardware Masking.",
                    "Make Some Noise. Unleashing the Power of Convolutional Neural Networks for Profiled Side-channel Analysis.",
                    "NTTRU: Truly Fast NTRU Using NTT.",
                    "Static Power SCA of Sub-100 nm CMOS ASICs and the Insecurity of Masking Schemes in Low-Noise Environments.",
                    "Exploring the Effect of Device Aging on Static Power Analysis Attacks.",
                    "Software Toolkit for HFE-based Multivariate Schemes.",
                    "Leaky Noise: New Side-Channel Attack Vectors in Mixed-Signal IoT Devices.",
                    "Fast constant-time gcd computation and modular inversion.",
                    "Security on Plastics: Fake or Real?",
                    "Sapphire: A Configurable Crypto-Processor for Post-Quantum Lattice-based Protocols.",
                    "Electromagnetic Information Extortion from Electronic Devices Using Interceptor and Its Countermeasure.",
                    "New Circuit Minimization Techniques for Smaller and Faster AES SBoxes.",
                    "On-Device Power Analysis Across Hardware Security Domains. Stop Hitting Yourself.",
                    "Fast and simple constant-time hashing to the BLS12-381 elliptic curve.",
                    "Novel Side-Channel Attacks on Quasi-Cyclic Code-Based Cryptography.",
                    "Cache-Timing Attacks on RSA Key Generation.",
                    "The Interpose PUF: Secure PUF Design against State-of-the-art Machine Learning Attacks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "20th CHES 2018",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: IACR Trans. Cryptogr. Hardw. Embed. Syst. 2018",
                "count": 48,
                "papers": [
                    "Fast FPGA Implementations of Diffie-Hellman on the Kummer Surface of a Genus-2 Curve.",
                    "FPGA-based Accelerator for Post-Quantum Signature Scheme SPHINCS-256.",
                    "High Order Masking of Look-up Tables with Common Shares.",
                    "EM Analysis in the IoT Context: Lessons Learned from an Attack on Thread.",
                    "A Cautionary Note When Looking for a Truly Reconfigurable Resistive RAM PUF.",
                    "Linear Repairing Codes and Side-Channel Attacks.",
                    "Practical CCA2-Secure and Masked Ring-LWE Implementation.",
                    "Mixing Additive and Multiplicative Masking for Probing Secure Polynomial Evaluation Methods.",
                    "Leakage Detection with the x2-Test.",
                    "CRYSTALS-Dilithium: A Lattice-Based Digital Signature Scheme.",
                    "Rhythmic Keccak: SCA Security and Low Latency in HW.",
                    "Generic Low-Latency Masking in Hardware.",
                    "Improved High-Order Conversion From Boolean to Arithmetic Masking.",
                    "Dismantling the AUT64 Automotive Cipher.",
                    "High-Performance FV Somewhat Homomorphic Encryption on GPUs: An Implementation using CUDA.",
                    "Fault Attacks Made Easy: Differential Fault Analysis Automation on Assembly Code.",
                    "Hardware Masking, Revisited.",
                    "Attacking GlobalPlatform SCP02-compliant Smart Cards Using a Padding Oracle Attack.",
                    "CacheQuote: Efficiently Recovering Long-term Secrets of SGX EPID via Cache Attacks.",
                    "SAEB: A Lightweight Blockcipher-Based AEAD Mode of Operation.",
                    "Beetle Family of Lightweight and Secure Authenticated Encryption Ciphers.",
                    "ExpFault: An Automated Framework for Exploitable Fault Characterization in Block Ciphers.",
                    "Stealthy Opaque Predicates in Hardware - Obfuscating Constant Expressions at Negligible Overhead.",
                    "Smashing the Implementation Records of AES S-box.",
                    "Preface to TCHES 2018.",
                    "SIDH on ARM: Faster Modular Multiplications for Faster Post-Quantum Supersingular Isogeny Key Exchange.",
                    "Differential Fault Attacks on Deterministic Lattice Signatures.",
                    "FPGAhammer: Remote Voltage Fault Attacks on Shared FPGAs, suitable for DFA on AES.",
                    "Data Flow Oriented Hardware Design of RNS-based Polynomial Multiplication for SHE Acceleration.",
                    "Composable Masking Schemes in the Presence of Physical Defaults & the Robust Probing Model.",
                    "On Recovering Affine Encodings in White-Box Implementations.",
                    "Persistent Fault Analysis on Block Ciphers.",
                    "Cold Boot Attacks on Ring and Module LWE Keys Under the NTT.",
                    "Evaluation and Monitoring of Free Running Oscillators Serving as Source of Randomness.",
                    "Saber on ARM CCA-secure module lattice-based key encapsulation on ARM.",
                    "ES-TRNG: A High-throughput, Low-area True Random Number Generator based on Edge Sampling.",
                    "On the Difficulty of FSM-based Hardware Obfuscation.",
                    "New Bleichenbacher Records: Fault Attacks on qDSA Signatures.",
                    "Standard Lattice-Based Key Encapsulation on Embedded Devices.",
                    "Extending Glitch-Free Multiparty Protocols to Resist Fault Injection Attacks.",
                    "Multiplicative Masking for AES in Hardware.",
                    "FACE: Fast AES CTR mode Encryption Techniques based on the Reuse of Repetitive Data.",
                    "Side-Channel Attacks on Post-Quantum Signature Schemes based on Multivariate Quadratic Equations - Rainbow and UOV -.",
                    "Low Randomness Masking and Shuffling: An Evaluation Using Mutual Information.",
                    "SIFA: Exploiting Ineffective Fault Inductions on Symmetric Cryptography.",
                    "Key Extraction Using Thermal Laser Stimulation A Case Study on Xilinx Ultrascale FPGAs.",
                    "Spin Me Right Round Rotational Symmetry for FPGA-Specific AES.",
                    "Efficient Side-Channel Protections of ARX Ciphers."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th CHES 2017",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2017",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2017 - 19th International Conference, Taipei, Taiwan, September 25-28, 2017, Proceedings.",
                "count": 33,
                "papers": [
                    "A Side-Channel Assisted Cryptanalytic Attack Against QcBits.",
                    "Improved Blind Side-Channel Analysis by Exploitation of Joint Distributions of Leakages.",
                    "Convolutional Neural Networks with Data Augmentation Against Jitter-Based Countermeasures - Profiling Attacks Without Pre-processing.",
                    "CacheZoom: How SGX Amplifies the Power of Cache Attacks.",
                    "High-Order Conversion from Boolean to Arithmetic Masking.",
                    "Reconciling d+1 Masking in Hardware and Software.",
                    "Changing of the Guards: A Simple and Efficient Method for Achieving Uniformity in Threshold Sharing.",
                    "Generalized Polynomial Decomposition for S-boxes with Application to Side-Channel Countermeasures.",
                    "Nanofocused X-Ray Beam to Reprogram Secure Circuits.",
                    "Novel Bypass Attack and BDD-based Tradeoff Analysis Against All Known Logic Locking Attacks.",
                    "McBits Revisited.",
                    "High-Speed Key Encapsulation from NTRU.",
                    "FPGA-based Key Generator for the Niederreiter Cryptosystem Using Binary Goppa Codes.",
                    "Blockcipher-Based Authenticated Encryption: How Small Can We Go?",
                    "Gimli : A Cross-Platform Permutation.",
                    "GIFT: A Small Present - Towards Reaching the Limit of Lightweight Encryption.",
                    "Making Password Authenticated Key Exchange Suitable for Resource-Constrained Industrial Control Devices.",
                    "Back to Massey: Impressively Fast, Scalable and Tight Security Evaluation Tools.",
                    "Fast Leakage Assessment.",
                    "Your Rails Cannot Hide from Localized EM: How Dual-Rail Logic Fails on FPGAs.",
                    "How to Break Secure Boot on FPGA SoCs Through Malicious Hardware.",
                    "Illusion and Dazzle: Adversarial Optical Channel Exploits Against Lidars for Automotive Applications.",
                    "Hacking in the Blind: (Almost) Invisible Runtime User Interface Attacks.",
                    "On the Security of Carrier Phase-Based Ranging.",
                    "Single-Trace Side-Channel Attacks on Masked Lattice-Based Encryption.",
                    "A Systematic Approach to the Side-Channel Analysis of ECC Implementations with Worst-Case Horizontal Attacks.",
                    "Sliding Right into Disaster: Left-to-Right Sliding Windows Leak.",
                    "Faster Homomorphic Function Evaluation Using Non-integral Base Encoding.",
                    "Hiding Secrecy Leakage in Leaky Helper Data.",
                    "Very High Order Masking: Efficient Implementation and Security Evaluation.",
                    "PRESENT Runs Fast - Efficient and Secure Implementation in Software.",
                    "Four \\mathbb Q on Embedded Devices with Strong Countermeasures Against Side-Channel Attacks.",
                    "Bit-Sliding: A Generic Technique for Bit-Serial Implementations of SPN-based Primitives - Applications to AES, PRESENT and SKINNY."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th CHES 2016",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2016",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2016 - 18th International Conference, Santa Barbara, CA, USA, August 17-19, 2016, Proceedings.",
                "count": 30,
                "papers": [
                    "Correlated Extra-Reductions Defeat Blinded Regular Exponentiation.",
                    "Horizontal Side-Channel Attacks and Countermeasures on the ISW Masking Scheme.",
                    "Towards Easy Leakage Certification.",
                    "Simple Key Enumeration (and Rank Estimation) Using Histograms: An Integrated Approach.",
                    "Physical Layer Group Key Agreement for Automotive Controller Area Networks.",
                    "- vatiCAN - Vetted, Authenticated CAN Bus.",
                    "Mitigating SAT Attack on Logic Locking.",
                    "No Place to Hide: Contactless Probing of Secret Data on FPGAs.",
                    "Strong 8-bit Sboxes with Efficient Masking in Hardware.",
                    "Masking AES with d+1 Shares in Hardware.",
                    "Differential Computation Analysis: Hiding Your White-Box Designs is Not Enough.",
                    "Antikernel: A Decentralized Secure Hardware-Software Operating System Architecture.",
                    "Software Implementation of Koblitz Curves over Quadratic Fields.",
                    "QcBits: Constant-Time Small-Key Code-Based Cryptography.",
                    "\\mu Kummer: Efficient Hyperelliptic Signatures and Key Exchange on Microcontrollers.",
                    "Flush, Gauss, and Reload - A Cache Attack on the BLISS Lattice-Based Signature Scheme.",
                    "CacheBleed: A Timing Attack on OpenSSL Constant Time RSA.",
                    "Cache Attacks Enable Bulk Key Recovery on the Cloud.",
                    "Strong Machine Learning Attack Against PUFs with No Mathematical Model.",
                    "Efficient Fuzzy Extraction of PUF-Induced Secrets: Theory and Applications.",
                    "Run-Time Accessible DRAM PUFs in Commodity Devices.",
                    "On the Multiplicative Complexity of Boolean Functions and Bitsliced Higher-Order Masking.",
                    "Reducing the Number of Non-linear Multiplications in Masking Schemes.",
                    "Faster Evaluation of SBoxes via Common Shares.",
                    "Four ℚ on FPGA: New Hardware Speed Records for Elliptic Curve Cryptography over Large Prime Characteristic Fields.",
                    "A High Throughput/Gate AES Hardware Architecture by Compressing Encryption and Decryption Datapaths - Toward Efficient CBC-Mode Implementation.",
                    "Efficient High-Speed WPA2 Brute Force Attacks Using Scalable Low-Cost FPGA Clustering.",
                    "EnCounter: On Breaking the Nonce Barrier in Differential Fault Analysis with a Case-Study on PAEQ.",
                    "Curious Case of Rowhammer: Flipping Secret Exponent Bits Using Timing Analysis.",
                    "A Design Methodology for Stealthy Parametric Trojans and Its Application to Bug Attacks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th CHES 2015",
        "info": "Saint-Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2015",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2015 - 17th International Workshop, Saint-Malo, France, September 13-16, 2015, Proceedings.",
                "count": 34,
                "papers": [
                    "Robust Profiling for DPA-Style Attacks.",
                    "Less is More - Dimensionality Reduction from a Theoretical Perspective.",
                    "Blind Source Separation from Single Measurements Using Singular Spectrum Analysis.",
                    "Highly Efficient GF(28) Inversion Circuit Based on Redundant GF Arithmetic and Its Application to AES Design.",
                    "NaCl's Crypto_box in Hardware.",
                    "Lightweight Coprocessor for Koblitz Curves: 283-Bit ECC Including Scalar Conversion with only 4300 Gates.",
                    "Single Base Modular Multiplication for Efficient Hardware RNS Implementations of ECC.",
                    "Accelerating Homomorphic Evaluation on Reconfigurable Hardware.",
                    "Modular Hardware Architecture for Somewhat Homomorphic Function Evaluation.",
                    "Accelerating LTV Based Homomorphic Encryption in Reconfigurable Hardware.",
                    "Stealing Keys from PCs Using a Radio: Cheap Electromagnetic Attacks on Windowed Exponentiation.",
                    "Exclusive Exponent Blinding May Not Suffice to Prevent Timing Attacks on RSA.",
                    "Who Watches the Watchmen?: Utilizing Performance Monitors for Compromising Keys of RSA on Intel Platforms.",
                    "Improved Cryptanalysis of the DECT Standard Cipher.",
                    "Practical Key Recovery for Discrete-Logarithm Based Authentication Schemes from Random Nonce Bits.",
                    "The Simeck Family of Lightweight Block Ciphers.",
                    "TriviA: A Fast and Secure Authenticated Encryption Scheme.",
                    "A Physical Approach for Stochastic Modeling of TERO-Based TRNG.",
                    "Predictive Models for Min-entropy Estimation.",
                    "Improved Side-Channel Analysis of Finite-Field Multiplication.",
                    "Evaluation and Improvement of Generic-Emulating DPA Attacks.",
                    "Transient-Steady Effect Attack on Block Ciphers.",
                    "Assessment of Hiding the Higher-Order Leakages in Hardware - What Are the Achievements Versus Overheads?",
                    "Multi-variate High-Order Attacks of Shuffled Tables Recomputation.",
                    "Leakage Assessment Methodology - A Clear Roadmap for Side-Channel Evaluations.",
                    "Secure Key Generation from Biased PUFs.",
                    "The Gap Between Promise and Reality: On the Insecurity of XOR Arbiter PUFs.",
                    "End-To-End Design of a PUF-Based Privacy Preserving Authentication Protocol.",
                    "Improved Test Pattern Generation for Hardware Trojan Detection Using Genetic Algorithm and Boolean Satisfiability.",
                    "DPA, Bitslicing and Masking at 1 GHz.",
                    "SoC It to EM: ElectroMagnetic Side-Channel Attacks on a Complex System-on-Chip.",
                    "Finding the AES Bits in the Haystack: Reverse Engineering and SCA Using Voltage Contrast.",
                    "Efficient Ring-LWE Encryption on 8-Bit AVR Processors.",
                    "A Masked Ring-LWE Implementation."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th CHES 2014",
        "info": "Busan, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2014",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2014 - 16th International Workshop, Busan, South Korea, September 23-26, 2014. Proceedings.",
                "count": 33,
                "papers": [
                    "EM Attack Is Non-invasive? - Design Methodology and Validity Verification of EM Attack Sensor.",
                    "A New Framework for Constraint-Based Probabilistic Template Side Channel Attacks.",
                    "How to Estimate the Success Rate of Higher-Order Side-Channel Attacks.",
                    "Good Is Not Good Enough - Deriving Optimal Distinguishers from Communication Theory.",
                    "\"Ooh Aah... Just a Little Bit\" : A Small Amount of Side Channel Can Go a Long Way.",
                    "Destroying Fault Invariant with Randomization - A Countermeasure for AES Against Differential Fault Attacks.",
                    "Reversing Stealthy Dopant-Level Circuits.",
                    "Constructing S-boxes for Lightweight Cryptography with Feistel Structure.",
                    "A Statistical Model for Higher Order DPA on Masked Devices.",
                    "Fast Evaluation of Polynomials over Binary Finite Fields and Application to Side-Channel Countermeasures.",
                    "Secure Conversion between Boolean and Arithmetic Masking of Any Order.",
                    "Making RSA-PSS Provably Secure against Non-random Faults.",
                    "Side-Channel Attack against RSA Key Generation Algorithms.",
                    "Get Your Hands Off My Laptop: Physical Side-Channel Key-Extraction Attacks on PCs.",
                    "RSA Meets DPA: Recovering RSA Secret Keys from Noisy Analog Data.",
                    "Simple Power Analysis on AES Key Expansion Revisited.",
                    "Efficient Pairings and ECC for Embedded Systems.",
                    "Curve41417: Karatsuba Revisited.",
                    "Cofactorization on Graphics Processing Units.",
                    "Enhanced Lattice-Based Signatures on Reconfigurable Hardware.",
                    "Compact Ring-LWE Cryptoprocessor.",
                    "ICEPOLE: High-Speed, Hardware-Oriented Authenticated Encryption.",
                    "FPGA Implementations of SPRING - And Their Countermeasures against Side-Channel Attacks.",
                    "FOAM: Searching for Hardware-Optimal SPN Structures and Components with a Fair Comparison.",
                    "Secure Lightweight Entity Authentication with Strong PUFs: Mission Impossible?",
                    "Efficient Power and Timing Side Channels for Physical Unclonable Functions.",
                    "Physical Characterization of Arbiter PUFs.",
                    "Bitline PUF: Building Native Challenge-Response PUF Capability into Any SRAM.",
                    "Embedded Evaluation of Randomness in Oscillator Based Elementary TRNG.",
                    "Entropy Evaluation for Oscillator-Based True Random Number Generators.",
                    "Side-Channel Leakage through Static Power - Should We Care about in Practice?",
                    "Gate-Level Masking under a Path-Based Leakage Metric.",
                    "Early Propagation and Imbalanced Routing, How to Diminish in FPGAs."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th CHES 2013",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2013",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2013 - 15th International Workshop, Santa Barbara, CA, USA, August 20-23, 2013. Proceedings.",
                "count": 27,
                "papers": [
                    "On the Simplicity of Converting Leakages from Multivariate to Univariate - (Case Study of a Glitch-Resistant Masking Scheme).",
                    "Success through Confidence: Evaluating the Effectiveness of a Side-Channel Attack.",
                    "Profiling DPA: Efficacy and Efficiency Trade-Offs.",
                    "Non-invasive Spoofing Attacks for Anti-lock Braking Systems.",
                    "An Accurate Probabilistic Reliability Model for Silicon PUFs.",
                    "A High Reliability PUF Using Hot Carrier Injection Based Response Reinforcement.",
                    "On the Effectiveness of the Remanence Decay Side-Channel to Clone Memory-Based PUFs.",
                    "Pushing the Limits of SHA-3 Hardware Implementations to Fit on RFID.",
                    "Fides: Lightweight Authenticated Cipher with Side-Channel Resistance for Constrained Hardware.",
                    "On Measurable Side-Channel Leaks Inside ASIC Design Primitives.",
                    "A Very High Speed True Random Number Generator with Entropy Assessment.",
                    "Stealthy Dopant-Level Hardware Trojans.",
                    "A Differential Fault Attack on MICKEY 2.0.",
                    "Improving Modular Inversion in RNS Using the Plus-Minus Method.",
                    "McBits: Fast Constant-Time Code-Based Cryptography.",
                    "Smaller Keys for Code-Based Cryptography: QC-MDPC McEliece Implementations on Embedded Devices.",
                    "Sleuth: Automated Verification of Software Power Analysis Countermeasures.",
                    "Lambda Coordinates for Binary Elliptic Curves.",
                    "High-Performance Scalar Multiplication Using 8-Dimensional GLV/GLS Decomposition.",
                    "On the Implementation of Unified Arithmetic on Binary Huff Curves.",
                    "Inverting the Final Exponentiation of Tate Pairings on Ordinary Elliptic Curves Using Faults.",
                    "Block Ciphers That Are Easier to Mask: How Far Can We Go?",
                    "Masking vs. Multiparty Computation: How Large Is the Gap for AES?",
                    "Analysis and Improvement of the Generic Higher-Order Masking Scheme of FSE 2012.",
                    "Using Bleichenbacher\"s Solution to the Hidden Number Problem to Attack Nonce Leaks in 384-Bit ECDSA.",
                    "A New Model for Error-Tolerant Side-Channel Cube Attacks.",
                    "Leakage-Resilient Symmetric Encryption via Re-keying."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th CHES 2012",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2012",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2012 - 14th International Workshop, Leuven, Belgium, September 9-12, 2012. Proceedings.",
                "count": 32,
                "papers": [
                    "3D Hardware Canaries.",
                    "Breakthrough Silicon Scanning Discovers Backdoor in Military Chip.",
                    "Simple Photonic Emission Analysis of AES - Photonic Side Channel Analysis for the Rest of Us.",
                    "Compiler Assisted Masking.",
                    "Threshold Implementations of All 3 ×3 and 4 ×4 S-Boxes.",
                    "How Far Should Theory Be from Practice? - Evaluation of a Countermeasure.",
                    "Efficient and Provably Secure Methods for Switching from Arithmetic to Boolean Masking.",
                    "A Differential Fault Attack on the Grain Family of Stream Ciphers.",
                    "Algebraic Side-Channel Attacks Beyond the Hamming Weight Leakage Model.",
                    "Selecting Time Samples for Multivariate DPA Attacks.",
                    "Unified and Optimized Linear Collision Attacks and Their Application in a Non-profiled Setting.",
                    "Towards Super-Exponential Side-Channel Security with Efficient Leakage-Resilient PRFs.",
                    "Practical Leakage-Resilient Symmetric Cryptography.",
                    "A Statistical Model for DPA with Novel Algorithmic Confusion Analysis.",
                    "Practical Security Analysis of PUF-Based Two-Player Protocols.",
                    "Soft Decision Error Correction for Compact Memory-Based PUFs Using a Single Enrollment.",
                    "PUFs: Myth, Fact or Busted? A Security Evaluation of Physically Unclonable Functions (PUFs) Cast in Silicon.",
                    "PUFKY: A Fully Functional PUF-Based Cryptographic Key Generator.",
                    "NEON Crypto.",
                    "Towards One Cycle per Bit Asymmetric Encryption: Code-Based Cryptography on Reconfigurable Hardware.",
                    "Solving Quadratic Equations with XL on Parallel Architectures.",
                    "Efficient Implementations of MQPKS on Constrained Devices.",
                    "Towards Green Cryptography: A Comparison of Lightweight Ciphers from the Energy Viewpoint.",
                    "Lightweight Cryptography for the Cloud: Exploit the Power of Bitslice Implementation.",
                    "Low-Latency Encryption - Is \"Lightweight = Light + Wait\"?",
                    "Attacking RSA-CRT Signatures with Faults on Montgomery Multiplication.",
                    "Reduce-by-Feedback: Timing Resistant and DPA-Aware Modular Multiplication Plus: How to Break RSA by DPA.",
                    "Side Channel Attack to Actual Cryptanalysis: Breaking CRT-RSA with Low Weight Decryption Exponents.",
                    "Pushing the Limits of High-Speed GF(2 m ) Elliptic Curve Scalar Multiplication on FPGAs.",
                    "On the Design of Hardware Building Blocks for Modern Lattice-Based Encryption Schemes.",
                    "Practical Lattice-Based Cryptography: A Signature Scheme for Embedded Systems.",
                    "An Efficient Countermeasure against Correlation Power-Analysis Attacks with Randomized Montgomery Operations for DF-ECC Processor."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th CHES 2011",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2011",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2011 - 13th International Workshop, Nara, Japan, September 28 - October 1, 2011. Proceedings.",
                "count": 33,
                "papers": [
                    "An Exploration of Mechanisms for Dynamic Cryptographic Instruction Set Extension.",
                    "FPGA-Based True Random Number Generation Using Circuit Metastability with Adaptive Feedback Control.",
                    "Generic Side-Channel Countermeasures for Reconfigurable Devices.",
                    "Improved Collision-Correlation Power Analysis on First Order Protected AES.",
                    "Higher-Order Glitches Free Implementation of the AES Using Secure Multi-party Computation Protocols.",
                    "Protecting AES with Shamir's Secret Sharing Scheme.",
                    "A Fast and Provably Secure Higher-Order Masking of AES S-Box.",
                    "Software Implementation of Binary Elliptic Curves: Impact of the Carry-Less Multiplier on Scalar Multiplication.",
                    "High-Speed High-Security Signatures.",
                    "To Infinity and Beyond: Combined Attack on ECC Using Points of Low Order.",
                    "Random Sampling for Short Lattice Vectors on Graphics Cards.",
                    "Extreme Enumeration on GPU and in Clouds - - How Many Dollars You Need to Break SVP Challenges -.",
                    "Modulus Fault Attacks against RSA-CRT Signatures.",
                    "Breaking Mifare DESFire MF3ICD40: Power Analysis and Templates in the Real World.",
                    "Information Theoretic and Security Analysis of a 65-Nanometer DDSLL AES S-Box.",
                    "Thwarting Higher-Order Side Channel Analysis with Additive and Multiplicative Maskings.",
                    "Extractors against Side-Channel Attacks: Weak or Strong?",
                    "Standardization Works for Security Regarding the Electromagnetic Environment.",
                    "Meet-in-the-Middle and Impossible Differential Fault Analysis on AES.",
                    "On the Power of Fault Sensitivity Analysis and Collision Side-Channel Attacks in a Combined Setting.",
                    "spongent: A Lightweight Hash Function.",
                    "The LED Block Cipher.",
                    "Piccolo: An Ultra-Lightweight Blockcipher.",
                    "Lightweight and Secure PUF Key Storage Using Limits of Machine Learning.",
                    "Recyclable PUFs: Logically Reconfigurable PUFs.",
                    "Uniqueness Enhancement of PUF Responses Based on the Locations of Random Outputting RS Latches.",
                    "MECCA: A Robust Low-Overhead PUF Using Embedded Memory Array.",
                    "FPGA Implementation of Pairings Using Residue Number System and Lazy Reduction.",
                    "High Speed Cryptoprocessor for η T Pairing on 128-bit Secure Supersingular Elliptic Curves over Characteristic Two Fields.",
                    "Fast Multi-precision Multiplication for Public-Key Cryptography on Embedded Microprocessors.",
                    "Small Public Keys and Fast Verification for $\\mathcal{M}$ ultivariate $\\mathcal{Q}$ uadratic Public Key Systems.",
                    "Throughput vs. Area Trade-offs in High-Speed Architectures of Five Round 3 SHA-3 Candidates Implemented Using Xilinx and Altera FPGAs.",
                    "Efficient Hashing Using the AES Instruction Set."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th CHES 2010",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2010",
                "sub_name": "Cryptographic Hardware and Embedded Systems, CHES 2010, 12th International Workshop, Santa Barbara, CA, USA, August 17-20, 2010. Proceedings.",
                "count": 30,
                "papers": [
                    "Quark: A Lightweight Hash.",
                    "PRINTcipher: A Block Cipher for IC-Printing.",
                    "Sponge-Based Pseudo-Random Number Generators.",
                    "A High Speed Coprocessor for Elliptic Curve Scalar Multiplications over \\mathbbFp\\mathbb{F}_p.",
                    "Co-Z Addition Formulæ and Binary Ladders on Elliptic Curves - (Extended Abstract).",
                    "Efficient Techniques for High-Speed Elliptic Curve Cryptography.",
                    "Analysis and Improvement of the Random Delay Countermeasure of CHES 2009.",
                    "New Results on Instruction Cache Attacks.",
                    "Correlation-Enhanced Power Analysis Collision Attack.",
                    "Side-Channel Analysis of Six SHA-3 Candidates.",
                    "Flash Memory 'Bumping' Attacks.",
                    "Self-referencing: A Scalable Side-Channel Approach for Hardware Trojan Detection.",
                    "When Failure Analysis Meets Side-Channel Attacks.",
                    "Fast Exhaustive Search for Polynomial Systems in F2.",
                    "256 Bit Standardized Crypto for 650 GE - GOST Revisited.",
                    "Mixed Bases for Efficient Inversion in \\mathbb F((22)2) and Conversion Matrices of SubBytes of AES.",
                    "Developing a Hardware Evaluation Method for SHA-3 Candidates.",
                    "Fair and Comprehensive Methodology for Comparing Hardware Performance of Fourteen Round Two SHA-3 Candidates Using FPGAs.",
                    "Performance Analysis of the SHA-3 Candidates on Exotic Multi-core Architectures.",
                    "XBX: eXternal Benchmarking eXtension for the SUPERCOP Crypto Benchmarking Framework.",
                    "Public Key Perturbation of Randomized RSA Implementations.",
                    "Fault Sensitivity Analysis.",
                    "An Alternative to Error Correction for SRAM-Like PUFs.",
                    "New High Entropy Element for FPGA Based True Random Number Generators.",
                    "The Glitch PUF: A New Delay-PUF Architecture Exploiting Glitch Shapes.",
                    "Garbled Circuits for Leakage-Resilience: Hardware Implementation and Evaluation of One-Time Programs - (Full Version).",
                    "ARMADILLO: A Multi-purpose Cryptographic Primitive Dedicated to Hardware.",
                    "Provably Secure Higher-Order Masking of AES.",
                    "Algebraic Side-Channel Analysis in the Presence of Errors.",
                    "Coordinate Blinding over Large Prime Fields."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th CHES 2009",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2009",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2009, 11th International Workshop, Lausanne, Switzerland, September 6-9, 2009, Proceedings.",
                "count": 32,
                "papers": [
                    "Faster and Timing-Attack Resistant AES-GCM.",
                    "Accelerating AES with Vector Permute Instructions.",
                    "SSE Implementation of Multivariate PKCs on Modern x86 CPUs.",
                    "MicroEliece: McEliece for Embedded Devices.",
                    "Physical Unclonable Functions and Secure Processors.",
                    "Practical Electromagnetic Template Attack on HMAC.",
                    "First-Order Side-Channel Attacks on the Permutation Tables Countermeasure.",
                    "Algebraic Side-Channel Attacks on the AES: Why Time also Matters in DPA.",
                    "Differential Cluster Analysis.",
                    "Known-Plaintext-Only Attack on RSA-CRT with Montgomery Multiplication.",
                    "A New Side-Channel Attack on RSA Prime Generation.",
                    "An Efficient Method for Random Delay Generation in Embedded Software.",
                    "Higher-Order Masking and Shuffling for Software Implementations of Block Ciphers.",
                    "A Design Methodology for a DPA-Resistant Cryptographic LSI with RSL Techniques.",
                    "A Design Flow and Evaluation Framework for DPA-Resistant Instruction Set Extensions.",
                    "Crypto Engineering: Some History and Some Case Studies.",
                    "Hardware Accelerator for the Tate Pairing in Characteristic Three Based on Karatsuba-Ofman Multipliers.",
                    "Faster -Arithmetic for Cryptographic Pairings on Barreto-Naehrig Curves.",
                    "Designing an ASIP for Cryptographic Pairings over Barreto-Naehrig Curves.",
                    "KATAN and KTANTAN - A Family of Small and Efficient Hardware-Oriented Block Ciphers.",
                    "Programmable and Parallel ECC Coprocessor Architecture: Tradeoffs between Area, Speed and Security.",
                    "Elliptic Curve Scalar Multiplication Combining Yao's Algorithm and Double Bases.",
                    "The Frequency Injection Attack on Ring-Oscillator-Based True Random Number Generators.",
                    "Low-Overhead Implementation of a Soft Decision Helper Data Algorithm for SRAM PUFs.",
                    "CDs Have Fingerprints Too.",
                    "The State-of-the-Art in IC Reverse Engineering.",
                    "Trojan Side-Channels: Lightweight Hardware Trojans through Side-Channel Engineering.",
                    "MERO: A Statistical Approach for Hardware Trojan Detection.",
                    "On Tamper-Resistance from a Theoretical Viewpoint.",
                    "Mutual Information Analysis: How, When and Why?.",
                    "Fault Attacks on RSA Signatures with Partially Unknown Messages.",
                    "Differential Fault Analysis on DES Middle Rounds."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th CHES 2008",
        "info": "Washington, D.C., USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2008",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2008, 10th International Workshop, Washington, D.C., USA, August 10-13, 2008. Proceedings.",
                "count": 29,
                "papers": [
                    "Attack and Improvement of a Secure S-Box Calculation Based on the Fourier Transform.",
                    "Collision-Based Power Analysis of Modular Exponentiation Using Chosen-Message Pairs.",
                    "Multiple-Differential Side-Channel Collision Attacks on AES.",
                    "Time-Area Optimized Public-Key Engines: -Cryptosystems as Replacement for Elliptic Curves?.",
                    "Ultra High Performance ECC over NIST Primes on Commercial FPGAs.",
                    "Exploiting the Power of GPUs for Asymmetric Cryptography.",
                    "High-Performance Concurrent Error Detection Scheme for AES Hardware.",
                    "A Lightweight Concurrent Fault Detection Scheme for the AES S-Boxes Using Normal Basis.",
                    "RSA with CRT: A New Cost-Effective Solution to Thwart Fault Attacks.",
                    "A Design for a Physical RNG with Robust Entropy Estimators.",
                    "Fast Digital TRNG Based on Metastable Ring Oscillator.",
                    "Efficient Helper Data Key Extractor on FPGAs.",
                    "The Carry Leakage on the Randomized Exponent Countermeasure.",
                    "Recovering Secret Keys from Weak Side Channel Traces of Differing Lengths.",
                    "Attacking State-of-the-Art Software Countermeasures-A Case Study for AES.",
                    "Binary Edwards Curves.",
                    "A Real-World Attack Breaking A5/1 within Hours.",
                    "Hash Functions and RFID Tags: Mind the Gap.",
                    "A New Bit-Serial Architecture for Field Multiplication Using Polynomial Bases.",
                    "A Very Compact Hardware Implementation of the MISTY1 Block Cipher.",
                    "Light-Weight Instruction Set Extensions for Bit-Sliced Cryptography.",
                    "Power and Fault Analysis Resistance in Hardware through Dynamic Reconfiguration.",
                    "RFID and Its Vulnerability to Faults.",
                    "Perturbating RSA Public Keys: An Improved Attack.",
                    "Divided Backend Duplication Methodology for Balanced Dual Rail Routing.",
                    "Using Subspace-Based Template Attacks to Compare and Combine Power and Electromagnetic Information Leakages.",
                    "Mutual Information Analysis.",
                    "RSA-Past, Present, Future.",
                    "A Vision for Platform Security."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9th CHES 2007",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2007",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2007, 9th International Workshop, Vienna, Austria, September 10-13, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "A First-Order DPA Attack Against AES in Counter Mode with Unknown Initial Counter.",
                    "Gaussian Mixture Models for Higher-Order Side Channel Analysis.",
                    "Side Channel Cryptanalysis of a Higher Order Masking Scheme.",
                    "High-Speed True Random Number Generation with Logic Gates Only.",
                    "FPGA Intrinsic PUFs and Their Use for IP Protection.",
                    "Evaluation of the Masked Logic Style MDPL on a Prototype Chip.",
                    "Masking and Dual-Rail Logic Don't Add Up.",
                    "DPA-Resistance Without Routing Constraints?",
                    "On the Power of Bitslice Implementation on Intel Core2 Processor.",
                    "Highly Regular Right-to-Left Algorithms for Scalar Multiplication.",
                    "MAME: A Compression Function with Reduced Hardware Requirements.",
                    "Collision Attacks on AES-Based MAC: Alpha-MAC.",
                    "Secret External Encodings Do Not Prevent Transient Fault Analysis.",
                    "Two New Techniques of Side-Channel Cryptanalysis.",
                    "AES Encryption Implementation and Analysis on Commodity Graphics Processing Units.",
                    "Multi-gigabit GCM-AES Architecture Optimized for FPGAs.",
                    "Arithmetic Operators for Pairing-Based Cryptography.",
                    "FPGA Design of Self-certified Signature Verification on Koblitz Curves.",
                    "How to Maximize the Potential of FPGA Resources for Modular Exponentiation.",
                    "TEC-Tree: A Low-Cost, Parallelizable Tree for Efficient Defense Against Memory Replay Attacks.",
                    "Power Analysis Resistant AES Implementation with Instruction Set Extensions.",
                    "Power and EM Attacks on Passive 13.56 MHz RFID Devices.",
                    "RFID Noisy Reader How to Prevent from Eavesdropping on the Communication?",
                    "RF-DNA: Radio-Frequency Certificates of Authenticity.",
                    "CAIRN 2: An FPGA Implementation of the Sieving Step in the Number Field Sieve Method.",
                    "Collision Search for Elliptic Curve Discrete Logarithm over GF(2 m ) with FPGA.",
                    "A Hardware-Assisted Realtime Attack on A5/2 Without Precomputations.",
                    "Differential Behavioral Analysis.",
                    "Information Theoretic Evaluation of Side-Channel Resistant Logic Styles.",
                    "On the Implementation of a Fast Prime Generation Algorithm.",
                    "PRESENT: An Ultra-Lightweight Block Cipher."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8th CHES 2006",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2006",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2006, 8th International Workshop, Yokohama, Japan, October 10-13, 2006, Proceedings.",
                "count": 35,
                "papers": [
                    "Template Attacks in Principal Subspaces.",
                    "Templates vs. Stochastic Methods.",
                    "Towards Security Limits in Side-Channel Attacks.",
                    "HIGHT: A New Block Cipher Suitable for Low-Resource Device.",
                    "Integer Factoring Utilizing PC Cluster.",
                    "Optically Enhanced Position-Locked Power Analysis.",
                    "Pinpointing the Side-Channel Leakage of Masked AES Hardware Implementations.",
                    "A Generalized Method of Differential Fault Attack Against AES Cryptosystem.",
                    "Breaking Ciphers with COPACOBANA - A Cost-Optimized Parallel Code Breaker.",
                    "Implementing the Elliptic Curve Method of Factoring in Reconfigurable Hardware.",
                    "Implementing Cryptographic Pairings on Smartcards.",
                    "SPA-Resistant Scalar Multiplication on Hyperelliptic Curve Cryptosystems Combining Divisor Decomposition Technique and Joint Regular Form.",
                    "Fast Generation of Prime Numbers on Portable Devices: An Update.",
                    "A Proposition for Correlation Power Analysis Enhancement.",
                    "High-Resolution Side-Channel Attack Using Phase-Based Waveform Matching.",
                    "Cache-Collision Timing Attacks Against AES.",
                    "Provably Secure S-Box Implementation Based on Fourier Transform.",
                    "The Outer Limits of RFID Security.",
                    "Three-Phase Dual-Rail Pre-charge Logic.",
                    "Dual-Rail Random Switching Logic: A Countermeasure to Reduce Side Channel Leakage.",
                    "Security Evaluation of DPA Countermeasures Using Dual-Rail Pre-charge Logic Style.",
                    "Instruction Set Extensions for Efficient AES Implementation on 32-bit Processors.",
                    "NanoCMOS-Molecular Realization of Rijndael.",
                    "Improving SHA-2 Hardware Implementations.",
                    "Offline Hardware/Software Authentication for Reconfigurable Platforms.",
                    "Why One Should Also Secure RSA Public Key Elements.",
                    "Power Attack on Small RSA Public Exponent.",
                    "Unified Point Addition Formulæ and Side-Channel Attacks.",
                    "Read-Proof Hardware from Protective Coatings.",
                    "Path Swapping Method to Improve DPA Resistance of Quasi Delay Insensitive Asynchronous Circuits.",
                    "Automated Design of Cryptographic Devices Resistant to Multiple Side-Channel Attacks.",
                    "Challenges for Trusted Computing.",
                    "Superscalar Coprocessor for High-Speed Curve-Based Cryptography.",
                    "Hardware/Software Co-design of Elliptic Curve Cryptography on an 8051 Microcontroller.",
                    "FPGA Implementation of Point Multiplication on Koblitz Curves Using Kleinian Integers."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th CHES 2005",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2005",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2005, 7th International Workshop, Edinburgh, UK, August 29 - September 1, 2005, Proceedings.",
                "count": 32,
                "papers": [
                    "Resistance of Randomized Projective Coordinates Against Power Analysis.",
                    "Templates as Master Keys.",
                    "A Stochastic Model for Differential Side Channel Cryptanalysis.",
                    "A New Baby-Step Giant-Step Algorithm and Some Applications to Cryptanalysis.",
                    "Further Hidden Markov Model Cryptanalysis.",
                    "Energy-Efficient Software Implementation of Long Integer Modular Arithmetic.",
                    "Short Memory Scalar Multiplication on Koblitz Curves.",
                    "Hardware/Software Co-design for Hyperelliptic Curve Cryptography (HECC) on the 8051µP.",
                    "SHARK: A Realizable Special Hardware Sieving Device for Factoring 1024-Bit Integers.",
                    "Scalable Hardware for Sparse Systems of Linear Equations, with Applications to Integer Factorization.",
                    "Design of Testable Random Bit Generators.",
                    "Successfully Attacking Masked AES Hardware Implementations.",
                    "Masked Dual-Rail Pre-charge Logic: DPA-Resistance Without Routing Constraints.",
                    "Masking at Gate Level in the Presence of Glitches.",
                    "Bipartite Modular Multiplication.",
                    "Fast Truncated Multiplication for Cryptographic Applications.",
                    "Using an RSA Accelerator for Modular Inversion.",
                    "Comparison of Bit and Word Level Algorithms for Evaluating Unstructured Functions over Finite Rings.",
                    "EM Analysis of Rijndael and ECC on a Wireless Java-Based PDA.",
                    "Security Limits for Compromising Emanations.",
                    "Security Evaluation Against Electromagnetic Analysis at Design Time.",
                    "On Second-Order Differential Power Analysis.",
                    "Improved Higher-Order Side-Channel Attacks with FPGA Experiments.",
                    "Secure Data Management in Trusted Computing.",
                    "Data Remanence in Flash Memory Devices.",
                    "Prototype IC with WDDL and Differential Routing - DPA Resistance Assessment.",
                    "DPA Leakage Models for CMOS Logic Circuits.",
                    "The \"Backend Duplication\" Method.",
                    "Hardware Acceleration of the Tate Pairing in Characteristic Three.",
                    "Efficient Hardware for the Tate Pairing Calculation in Characteristic Three.",
                    "AES on FPGA from the Fastest to the Smallest.",
                    "A Very Compact S-Box for AES."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th CHES 2004",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2004",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2004: 6th International Workshop Cambridge, MA, USA, August 11-13, 2004. Proceedings.",
                "count": 32,
                "papers": [
                    "Towards Efficient Second-Order Power Analysis.",
                    "Correlation Power Analysis with a Leakage Model.",
                    "Power Analysis of an FPGA: Implementation of Rijndael: Is Pipelining a DPA Countermeasure?",
                    "Long Modular Multiplication for Cryptographic Applications.",
                    "Leak Resistant Arithmetic.",
                    "Efficient Linear Array for Multiplication in GF(2m) Using a Normal Basis for Elliptic Curve Cryptography.",
                    "Low-Power Elliptic Curve Cryptography Using Scaled Modular Arithmetic.",
                    "A Low-Cost ECC Coprocessor for Smartcards.",
                    "Comparing Elliptic Curve Cryptography and RSA on 8-bit CPUs.",
                    "Instruction Set Extensions for Fast Arithmetic in Finite Fields GF( p) and GF(2m).",
                    "Aspects of Hyperelliptic Curves over Large Prime Fields in Software Implementations.",
                    "A Collision-Attack on AES: Combining Side Channel- and Differential-Attack.",
                    "Enhancing Collision Attacks.",
                    "Simple Power Analysis of Unified Code for ECC Double and Add.",
                    "DPA on n-Bit Sized Boolean and Arithmetic Operations and Its Application to IDEA, RC6, and the HMAC-Construction.",
                    "Side-Channel Attacks in ECC: A General Technique for Varying the Parametrization of the Elliptic Curve.",
                    "Switching Blindings with a View Towards IDEA.",
                    "Fault Analysis of Stream Ciphers.",
                    "A Differential Fault Attack Against Early Rounds of (Triple-)DES.",
                    "An Offset-Compensated Oscillator-Based Random Bit Source for Security Applications.",
                    "Improving the Security of Dual-Rail Circuits.",
                    "A New Attack with Side Channel Leakage During Exponent Recoding Computations.",
                    "Defeating Countermeasures Based on Randomized BSD Representations.",
                    "Pipelined Computation of Scalar Multiplication in Elliptic Curve Cryptosystems.",
                    "Efficient Countermeasures against RPA, DPA, and SPA.",
                    "Strong Authentication for RFID Systems Using the AES Algorithm.",
                    "TTS: High-Speed Signatures on a Low-Cost Smart Card.",
                    "XTR Implementation on Reconfigurable Hardware.",
                    "Concurrent Error Detection Schemes for Involution Ciphers.",
                    "Public Key Authentication with One (Online) Single Addition.",
                    "Attacking DSA Under a Repeated Bits Assumption.",
                    "How to Disembed a Program?"
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5th CHES 2003",
        "info": "Cologne, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2003",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2003, 5th International Workshop, Cologne, Germany, September 8-10, 2003, Proceedings.",
                "count": 33,
                "papers": [
                    "The Security Challenges of Ubiquitous Computing.",
                    "Multi-channel Attacks.",
                    "Hidden Markov Model Cryptanalysis.",
                    "Power-Analysis Attacks on an FPGA - First Experimental Results.",
                    "Hardware to Solve Sparse Systems of Linear Equations over GF(2).",
                    "Cryptanalysis of DES Implemented on Computers with Cache.",
                    "A Differential Fault Attack Technique against SPN Structures, with Application to the AES and KHAZAD.",
                    "A New Algorithm for Switching from Arithmetic to Boolean Masking.",
                    "DeKaRT: A New Paradigm for Key-Dependent Reversible Circuits.",
                    "Parity-Based Concurrent Error Detection of Substitution-Permutation Network Block Ciphers.",
                    "Securing Encryption Algorithms against DPA at the Logic Level: Next Generation Smart Card Technology.",
                    "Security Evaluation of Asynchronous Circuits.",
                    "Design and Implementation of a True Random Number Generator Based on Digital Circuit Artifacts.",
                    "True Random Number Generators Secure in a Changing Environment.",
                    "How to Predict the Output of a Hardware Random Number Generator.",
                    "On Low Complexity Bit Parallel Polynomial Basis Multipliers.",
                    "Efficient Modular Reduction Algorithm in IFq[x] and Its Application to \"Left to Right\" Modular Multiplication in IF2[x].",
                    "Faster Double-Size Modular Multiplication from Euclidean Multipliers.",
                    "Efficient Exponentiation for a Class of Finite Fields GF(2 n) Determined by Gauss Periods.",
                    "GCD-Free Algorithms for Computing Modular Inverses.",
                    "Attacking Unbalanced RSA-CRT Using SPA.",
                    "The Doubling Attack - Why Upwards Is Better than Downwards.",
                    "An Analysis of Goubin's Refined Power Analysis Attack.",
                    "A New Type of Timing Attack: Application to GPS.",
                    "Unified Hardware Architecture for 128-Bit Block Ciphers AES and Camellia.",
                    "Very Compact FPGA Implementation of the AES Algorithm.",
                    "Efficient Implementation of Rijndael Encryption in Reconfigurable Hardware: Improvements and Design Tradeoffs.",
                    "Hyperelliptic Curve Cryptosystems: Closing the Performance Gap to Elliptic Curves.",
                    "Countermeasures against Differential Power Analysis for Hyperelliptic Curve Cryptosystems.",
                    "A Practical Countermeasure against Address-Bit Differential Power Analysis.",
                    "A More Flexible Countermeasure against Side Channel Attacks Using Window Method.",
                    "On the Security of PKCS#11.",
                    "Attacking RSA-Based Sessions in SSL/TLS."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4th CHES 2002",
        "info": "Redwood Shores, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2002",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2002, 4th International Workshop, Redwood Shores, CA, USA, August 13-15, 2002, Revised Papers.",
                "count": 43,
                "papers": [
                    "CHES: Past, Present, and Future.",
                    "Optical Fault Induction Attacks.",
                    "Template Attacks.",
                    "The EM Side-Channel(s).",
                    "Enhanced Montgomery Multiplication.",
                    "New Algorithm for Classical Modular Inverse.",
                    "Increasing the Bitlength of a Crypto-Coprocessor.",
                    "Enhancing Simple Power-Analysis Attacks on Elliptic Curve Cryptosystems.",
                    "Implementation of Elliptic Curve Cryptography with Built-In Counter Measures against Side Channel Attacks.",
                    "Secure Elliptic Curve Implementations: An Analysis of Resistance to Power-Attacks in a DSP Processor.",
                    "Address-Bit Differential Power Analysis of Cryptographic Schemes OK-ECDH and OK-ECDSA.",
                    "2Gbit/s Hardware Realizations of RIJNDAEL and SERPENT: A Comparative Analysis.",
                    "Efficient Software Implementation of AES on 32-Bit Platforms.",
                    "An Optimized S-Box Circuit Architecture for Low Power AES Design.",
                    "Simplified Adaptive Multiplicative Masking for AES.",
                    "Multiplicative Masking and Power Analysis of AES.",
                    "Keeping Secrets in Hardware: The Microsoft Xbox™ Case Study.",
                    "A DPA Attack against the Modular Reduction within a CRT Implementation of RSA.",
                    "Further Results and Considerations on Side Channel Attacks on RSA.",
                    "Fault Attacks on RSA with CRT: Concrete Results and Practical Countermeasures.",
                    "Some Security Aspects of the M IST Randomized Exponentiation Algorithm.",
                    "The Montgomery Powering Ladder.",
                    "DPA Countermeasures by Improving the Window Method.",
                    "Efficient Subgroup Exponentiation in Quadratic and Sixth Degree Extensions.",
                    "On the Efficient Generation of Elliptic Curves over Prime Fields.",
                    "An End-to-End Systems Approach to Elliptic Curve Cryptography.",
                    "A Low-Power Design for an Elliptic Curve Digital Signature Chip.",
                    "A Reconfigurable System on Chip Implementation for Elliptic Curve Cryptography over GF(2n).",
                    "Genus Two Hyperelliptic Curve Coprocessor.",
                    "True Random Number Generator Embedded in Reconfigurable Hardware.",
                    "Evaluation Criteria for True (Physical) Random Number Generators Used in Cryptographic Applications.",
                    "A Hardware Random Number Generator.",
                    "RFID Systems and Security and Privacy Implications.",
                    "A New Class of Invertible Mappings.",
                    "Scalable and Unified Hardware to Compute Montgomery Inverse in GF(p) and GF(2).",
                    "Dual-Field Arithmetic Unit for GF(p) and GF(2m).",
                    "Error Detection in Polynomial Basis Multipliers over Binary Extension Fields.",
                    "Hardware Implementation of Finite Fields of Characteristic Three.",
                    "Preventing Differential Analysis in GLV Elliptic Curve Scalar Multiplication.",
                    "Randomized Signed-Scalar Multiplication of ECC to Resist Power Attacks.",
                    "Fast Multi-scalar Multiplication Methods on Elliptic Curves with Precomputation Strategy Using Montgomery Trick.",
                    "Experience Using a Low-Cost FPGA Design to Crack DES Keys.",
                    "A Time-Memory Tradeoff Using Distinguished Points: New Analysis & FPGA Results."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3rd CHES 2001",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2001",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2001, Third International Workshop, Paris, France, May 14-16, 2001, Proceedings.",
                "count": 33,
                "papers": [
                    "Protecting Embedded Systems - The Next Ten Years.",
                    "A Sound Method for Switching between Boolean and Arithmetic Masking.",
                    "Fast Primitives for Internal Data Scrambling in Tamper Resistant Hardware.",
                    "Random Register Renaming to Foil DPA.",
                    "Randomized Addition-Subtraction Chains as a Countermeasure against Power Attacks.",
                    "Architectural Optimization for a 1.82Gbits/sec VLSI Implementation of the AES Rijndael Algorithm.",
                    "High Performance Single-Chip FPGA Rijndael Algorithm Implementations.",
                    "Two Methods of Rijndael Implementation in Reconfigurable Hardware.",
                    "Pseudo-random Number Generation on the IBM 4758 Secure Crypto Coprocessor.",
                    "Efficient Online Tests for True Random Number Generators.",
                    "The Hessian Form of an Elliptic Curve.",
                    "Efficient Elliptic Curve Cryptosystems from a Scalar Multiplication Algorithm with Recovery of the y-Coordinate on a Montgomery-Form Elliptic Curve.",
                    "Generating Elliptic Curves of Prime Order.",
                    "New Directions in Croptography.",
                    "A New Low Complexity Parallel Multiplier for a Class of Finite Fields.",
                    "Efficient Rijndael Encryption Implementation with Composite Field Arithmetic.",
                    "High-Radix Design of a Scalable Modular Multiplier.",
                    "A Bit-Serial Unified Multiplier Architecture for Finite Fields GF(p) and GF(2m).",
                    "Attacks on Cryptoprocessor Transaction Sets.",
                    "Bandwidth-Optimal Kleptographic Attacks.",
                    "Electromagnetic Analysis: Concrete Results.",
                    "NTRU in Constrained Devices.",
                    "Transparent Harddisk Encryption.",
                    "Sliding Windows Succumbs to Big Mac Attack.",
                    "Universal Exponentiation Algorithm.",
                    "An Implementation of DES and AES, Secure against Some Attacks.",
                    "Efficient Implementation of \"Large\" Stream Cipher Systems.",
                    "Tradeoffs in Parallel and Serial Implementations of the International Data Encryption Algorithm IDEA.",
                    "A Scalable GF(p) Elliptic Curve Processor Architecture for Programmable Hardware.",
                    "Implementation of RSA Algorithm Based on RNS Montgomery Multiplication.",
                    "Protections against Differential Analysis for Elliptic Curve Cryptography.",
                    "Preventing SPA/DPA in ECC Systems Using the Jacobi Form.",
                    "Hessian Elliptic Curves and Side-Channel Attacks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "2nd CHES 2000",
        "info": "Worcester, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/2000",
                "sub_name": "Cryptographic Hardware and Embedded Systems - CHES 2000, Second International Workshop, Worcester, MA, USA, August 17-18, 2000, Proceedings.",
                "count": 27,
                "papers": [
                    "Software Implementation of Elliptic Curve Cryptography over Binary Fields.",
                    "Implementation of Elliptic Curve Cryptographic Coprocessor over GF(2m) on an FPGA.",
                    "A High Performance Reconfigurable Elliptic Curve Processor for GF(2m).",
                    "Fast Implementation of Elliptic Curve Defined over GF(pm) on CalmRISC with MAC2424 Coprocessor.",
                    "Protecting Smart Cards from Passive Power Analysis with Detached Power Supplies.",
                    "Smartly Analyzing the Simplicity and the Power of Simple Power Analysis on Smartcards.",
                    "Power Analysis Attacks and Algorithmic Approaches to their Countermeasures for Koblitz Curve Cryptosystems.",
                    "A Timing Attack against RSA with the Chinese Remainder Theorem.",
                    "A Comparative Study of Performance of AES Final Candidates Using FPGAs.",
                    "A Dynamic FPGA Implementation of the Serpent Block Cipher.",
                    "A 12 Gbps DES Encryptor/Decryptor Core in an FPGA.",
                    "A 155 Mbps Triple-DES Network Encryptor.",
                    "An Energy Efficient Reconfigurable Public-Key Cryptograhpy Processor Architecture.",
                    "High-Speed RSA Hardware Based on Barret's Modular Reduction Method.",
                    "Data Integrity in Hardware for Modular Arithmetic.",
                    "A Design for Modular Exponentiation Coprocessor in Mobile Telecommunication Terminals.",
                    "How to Explain Side-Channel Leakage to Your Kids.",
                    "On Boolean and Arithmetic Masking against Differential Power Analysis.",
                    "Using Second-Order Power Analysis to Attack DPA Resistant Software.",
                    "Differential Power Analysis in the Presence of Hardware Countermeasures.",
                    "Montgomery Multiplier and Squarer in GF(2m).",
                    "A Scalable and Unified Multiplier Architecture for Finite Fields GF(p) and GF(2m).",
                    "Montgomery Exponentiation with no Final Subtractions: Improved Results.",
                    "Physical Security Devices for Computer Subsystems: A Survey of Attacks and Defences.",
                    "Software-Hardware Trade-Offs: Application to A5/1 Cryptanalysis.",
                    "MiniPASS: Authentication and Digital Signatures in a Constrained Environment.",
                    "Efficient Generation of Prime Numbers."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "1st CHES 1999",
        "info": "Worcester, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ches/1999",
                "sub_name": "Cryptographic Hardware and Embedded Systems, First International Workshop, CHES'99, Worcester, MA, USA, August 12-13, 1999, Proceedings.",
                "count": 29,
                "papers": [
                    "We Need Assurance.",
                    "Factoring Large Numbers with the Twinkle Device (Extended Abstract).",
                    "DES Cracking on the Transmogrifier 2a.",
                    "Modelling the Crypto-Processor from Design to Synthesis.",
                    "A DES ASIC Suitable for Network Encryption at 10 Gbps and Beyond.",
                    "Hardware Design and Performance Estimation of the 128-bit Block Cipher Crypton.",
                    "Fast Implementation of Public-Key Cryptography ona DSP TMS320C6201.",
                    "How to Implement Cost-Effective and Secure Public Key Cryptosystems.",
                    "Montgomery's Multiplication Technique: How to Make It Smaller and Faster.",
                    "A Scalable Architecture for Montgomery Multiplication.",
                    "Arithmetic Design for Permutation Groups.",
                    "Fast Multiplication in Finite Fields GF(2N).",
                    "Efficient Finite Field Basis Conversion Involving Dual Bases.",
                    "Power Analysis Attacks of Modular Exponentiation in Smartcards.",
                    "DES and Differential Power Analysis (The \"Duplication\" Method).",
                    "IPA: A New Class of Power Attacks.",
                    "Security Evaluation Schemas for the Public and Private Market with a Focus on Smart Card Systems.",
                    "A Design of Reliable True Random Number Generator for Cryptographic Applications.",
                    "Random Number Generators Founded on Signal and Information Theory.",
                    "A High-Performance Flexible Architecture for Cryptography.",
                    "CryptoBooster: A Reconfigurable and Modular Cryptographic Coprocessor.",
                    "Elliptic Curve Scalar Multiplier Design Using FPGAs.",
                    "Highly Regular Architectures for Finite Field Computation Using Redundant Basis.",
                    "Low Complexity Bit-Parallel Finite Field Arithmetic Using Polynomial Basis.",
                    "Resistance against Differential Power Analysis for Elliptic Curve Cryptosystems.",
                    "Probing Attacks on Tamper-Resistant Devices.",
                    "Fast Multiplication on Elliptic Curves over GF(2m) without Precomputation.",
                    "NICE - New Ideal Coset Encryption.",
                    "Encryption with Statistical Self-Synchronization in Synchronous Broadband Networks."
                ]
            }
        ]
    }
]