[
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2022",
        "info": "2022: Volume 90",
        "count": 38,
        "papers": [
            "A family of linear codes from constant dimension subspace codes.",
            "Functional encryption for set intersection in the multi-client setting.",
            "Weight distributions and weight hierarchies of a family of p-ary linear codes.",
            "Improved lower bound for locating-dominating codes in binary Hamming spaces.",
            "Parameters and characterizations of hulls of some projective narrow-sense BCH codes.",
            "Improving the Gaudry-Schost algorithm for multidimensional discrete logarithms.",
            "MDS symbol-pair codes from repeated-root cyclic codes.",
            "An improvement of the Diffie-Hellman noncommutative protocol.",
            "SAND: an AND-RX Feistel lightweight block cipher supporting S-box-based security evaluations.",
            "Pseudo-embeddings and quadratic sets of quadrics.",
            "Extending Coggia-Couvreur attack on Loidreau's rank-metric cryptosystem.",
            "LWE from non-commutative group rings.",
            "A note on \"Cryptographically strong permutations from the butterfly structure\".",
            "Generic transformation from broadcast encryption to round-optimal deniable ring authentication.",
            "New binary self-dual codes of lengths 80, 84 and 96 from composite matrices.",
            "Quantum codes from $\\mathbb {Z}_2\\mathbb {Z}_2[u]/\\langle u^4 \\rangle $-cyclic codes.",
            "Difference matrices with five rows over finite abelian groups.",
            "A generic method for investigating nonsingular Galois NFSRs.",
            "The neighbor graph of binary self-dual codes.",
            "A study of the separating property in Reed-Solomon codes by bounding the minimum distance.",
            "Integral characteristics by keyspace partitioning.",
            "Correction to: CCZ equivalence of power functions.",
            "Correction to: Cameron-Liebler sets of k-spaces in ${{\\, \\mathrm{PG}\\, }}(n, q)$.",
            "A state bit recovery algorithm with TMDTO attack on Lizard and Grain-128a.",
            "From primary to dual affine variety codes over the Klein quartic.",
            "Regular complete permutation polynomials over ${\\mathbb {F}}_{2^{n}}$.",
            "Efficient quantum homomorphic encryption scheme with flexible evaluators and its simulation.",
            "Mosaics of combinatorial designs for information-theoretic security.",
            "Cameron-Liebler k-sets in subspaces and non-existence conditions.",
            "Two secondary constructions of bent functions without initial conditions.",
            "Linear codes from support designs of ternary cyclic codes.",
            "On the design and security of Lee metric McEliece cryptosystems.",
            "On subset-resilient hash function families.",
            "On the locality of quasi-cyclic codes over finite fields.",
            "The geometric field of linearity of linear sets.",
            "Indifferentiable hashing to ordinary elliptic ${\\mathbb {F}}_{\\!q}$-curves of j=0 with the cost of one exponentiation in ${\\mathbb {F}}_{\\!q}$.",
            "Nearly optimal balanced quaternary sequence pairs of prime period N=uiv 5±od 8.",
            "Uniqueness of the inversive plane of order sixty-four."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2021",
        "info": "2021: Volume 89",
        "count": 133,
        "papers": [
            "A construction method of balanced rotation symmetric Boolean functions on arbitrary even number of variables with optimal algebraic immunity.",
            "Generalized isotopic shift construction for APN functions.",
            "Differentially low uniform permutations from known 4-uniform functions.",
            "A new rank metric for convolutional codes.",
            "Bent and ${{\\mathbb {Z}}}_{2^k}$-Bent functions from spread-like partitions.",
            "Improved upper bounds for parent-identifying set systems and separable codes.",
            "The complete hierarchical locality of the punctured Simplex code.",
            "Further clarification on Mantin's Digraph Repetition Bias in RC4.",
            "Common information, matroid representation, and secret sharing for matroid ports.",
            "On metric regularity of Reed-Muller codes.",
            "Steiner systems and configurations of points.",
            "On the c-differential uniformity of certain maps over finite fields.",
            "Extended Galbraith's test on the anonymity of IBE schemes from higher residuosity.",
            "Two kinds of constructions of directed strongly regular graphs.",
            "Evaluation codes and their basic parameters.",
            "Towards the Complete Determination of Next-to-Minimal Weights of Projective Reed-Muller Codes.",
            "The MILP-aided conditional differential attack and its application to Trivium.",
            "The complex conjugate invariants of Clifford groups.",
            "Low-rank parity-check codes over Galois rings.",
            "Greedy weights for matroids.",
            "Beyond-birthday security for permutation-based Feistel networks.",
            "A direct proof of APN-ness of the Kasami functions.",
            "Distance Distributions of Cyclic Orbit Codes.",
            "On the weight distribution of some minimal codes.",
            "Classifying sets of class [1, q+1, 2q+1, q2+q+1]2 in PG(r, q), $r\\ge 3$.",
            "Hermitian-lifted codes.",
            "Abelian difference sets with the symmetric difference property.",
            "Maximal sets of mutually orthogonal frequency squares.",
            "PIR Codes with Short Block Length.",
            "An extending theorem for s-resolvable t-designs.",
            "Generalized Hadamard full propelinear codes.",
            "Characterization and classification of optimal LCD codes.",
            "Roulette games and depths of words over finite commutative rings.",
            "Grain-like structures with minimal and maximal period sequences.",
            "The 2-adic complexity of Yu-Gong sequences with interleaved structure and optimal autocorrelation magnitude.",
            "Variants of Wegman-Carter message authentication code supporting variable tag lengths.",
            "Cryptographically strong permutations from the butterfly structure.",
            "Design-theoretic analogies between codes, lattices, and vertex operator algebras.",
            "Constructions of doubly resolvable Steiner quadruple systems.",
            "Asymmetric entanglement-assisted quantum codes: bound and constructions.",
            "Some constructions of quantum MDS codes.",
            "New families of self-dual codes.",
            "A note on Assmus-Mattson type theorems.",
            "On the Resilience of Even-Mansour to Invariant Permutations.",
            "SO-CCA secure PKE from pairing based all-but-many lossy trapdoor functions.",
            "Lattice-based zero-knowledge arguments for additive and multiplicative relations.",
            "Near-MDS codes from elliptic curves.",
            "(In)security of concrete instantiation of Lin17's functional encryption scheme from noisy multilinear maps.",
            "Robustly reusable fuzzy extractor with imperfect randomness.",
            "A scalable post-quantum hash-based group signature.",
            "Self-dual codes over ${\\mathbb {F}}_2[u]/\\langle u^4 \\rangle $ and Jacobi forms over a totally real subfield of ${\\mathbb {Q}}(\\zeta _8)$.",
            "Traceable ring signatures: general framework and post-quantum security.",
            "Flag-transitive 4-designs and PSL(2, q) groups.",
            "Cameron-Liebler sets in bilinear forms graphs.",
            "Differential spectra of a class of power permutations with characteristic 5.",
            "Some classes of power functions with low c-differential uniformity over finite fields.",
            "s-Elusive codes in Hamming graphs.",
            "On certain self-orthogonal AG codes with applications to Quantum error-correcting codes.",
            "Average of complete joint weight enumerators and self-dual codes.",
            "Flag-transitive, point-imprimitive 2-(v, k, λ ) symmetric designs with k and λ prime powers.",
            "Binary Hamming codes and Boolean designs.",
            "LIGA: a cryptosystem based on the hardness of rank-metric list and interleaved decoding.",
            "A Legendre pair of length 77 using complementary binary matrices with fixed marginals.",
            "Cryptanalysis of the extension field cancellation cryptosystem.",
            "Correction to: Cubic bent functions outside the completed Maiorana-McFarland class.",
            "The dual of an evaluation code.",
            "Breaking LWC candidates: sESTATE and Elephant in quantum setting.",
            "Construction of MDS matrices from generalized Feistel structures.",
            "Construction of lightweight involutory MDS matrices.",
            "Wide minimal binary linear codes from the general Maiorana-McFarland class.",
            "Equivalence classes of Niho bent functions.",
            "Adaptively secure revocable hierarchical IBE from k-linear assumption.",
            "Novel generic construction of leakage-resilient PKE scheme with CCA security.",
            "Composite matrices from group rings, composite G-codes and constructions of self-dual codes.",
            "Good polynomials for optimal LRC of low locality.",
            "Large sets with multiplicity.",
            "On the properties of generalized cyclotomic binary sequences of period 2pm.",
            "The projective general linear group ${\\mathrm {PGL}}(2, 2^m)$ and linear codes of length 2m+1.",
            "Privacy-preserving data splitting: a combinatorial approach.",
            "Simple and efficient FE for quadratic functions.",
            "Hamming weight distributions of multi-twisted codes over finite fields.",
            "A construction for circulant type dropout designs.",
            "Scattered subspaces and related codes.",
            "Security analysis of Subterranean 2.0.",
            "Breaking tweakable enciphering schemes using Simon's algorithm.",
            "Tag-based ABE in prime-order groups via pair encoding.",
            "Adaptively secure lattice-based revocable IBE in the QROM: compact parameters, tight security, and anonymity.",
            "A family of projective two-weight linear codes.",
            "Binary linear codes with few weights from Boolean functions.",
            "Correction to: Good polynomials for optimal LRC of low locality.",
            "Balancedly splittable orthogonal designs and equiangular tight frames.",
            "Construction of MDS twisted Reed-Solomon codes and LCD MDS codes.",
            "Generalized threshold secret sharing and finite geometry.",
            "On ideal homomorphic secret sharing schemes and their decomposition.",
            "Cryptanalysis of a code-based full-time signature.",
            "Proposing an MILP-based method for the experimental verification of difference-based trails: application to SPECK, SIMECK.",
            "Locally Recoverable Codes correcting many erasures over small fields.",
            "Möbius and coboundary polynomials for matroids.",
            "A new family of EAQMDS codes constructed from constacyclic codes.",
            "MDS or NMDS self-dual codes from twisted generalized Reed-Solomon codes.",
            "Twisted cubic and point-line incidence matrix in $\\mathrm {PG}(3, q)$.",
            "Construction of LDPC convolutional codes via difference triangle sets.",
            "Improved indifferentiability security proof for 3-round tweakable Luby-Rackoff.",
            "Extended cyclic codes, maximal arcs and ovoids.",
            "Construction of binary LCD codes, ternary LCD codes and quaternary Hermitian LCD codes.",
            "Vectorial bent functions and partial difference sets.",
            "Cyclic orbit flag codes.",
            "Public key encryption with filtered equality test revisited.",
            "Egalitarian Steiner triple systems for data popularity.",
            "Efficient identity-based encryption with Hierarchical key-insulation from HIBE.",
            "Some conditions for absence of affine functions in NFSR output stream.",
            "Optimal binary LCD codes.",
            "A new method for secondary constructions of vectorial bent functions.",
            "Bounding the length of impossible differentials for SPN block ciphers.",
            "Linear complementary pairs of codes over rings.",
            "Nonexistence of perfect permutation codes under the Kendall τ-metric.",
            "Cyclic codes and some new entanglement-assisted quantum MDS codes.",
            "Grassmannian codes from paired difference sets.",
            "Fast, compact, and expressive attribute-based encryption.",
            "Boomerang uniformity of a class of power maps.",
            "New PcN and APcN functions over finite fields.",
            "Binary signed-digit integers and the Stern diatomic sequence.",
            "Walsh spectrum and nega spectrum of complementary arrays.",
            "Five families of the narrow-sense primitive BCH codes over finite fields.",
            "Three classes of balanced vectorial semi-bent functions.",
            "New partitionings of complete designs.",
            "The first families of highly symmetric Kirkman Triple Systems whose orders fill a congruence class.",
            "Bounds for flag codes.",
            "An improved degree evaluation method of NFSR-based cryptosystems.",
            "Pseudorandom functions in NC class from the standard LWE assumption.",
            "Existence of primitive normal pairs with one prescribed trace over finite fields.",
            "On security properties of all-or-nothing transforms.",
            "Binomial permutations over finite fields with even characteristic."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2020",
        "info": "2020: Volume 88",
        "count": 137,
        "papers": [
            "Some remarks on non projective Frobenius algebras and linear codes.",
            "Arcs and tensors.",
            "Characterising hyperbolic hyperplanes of a non-singular quadric in PG(4, q).",
            "Construction of girth-8 (3, L)-QC-LDPC codes of smallest CPM size using column multipliers.",
            "A proof of the Beierle-Kranz-Leander conjecture related to lightweight multiplication in $\\mathbb {F}_{2^n}$.",
            "A lower bound on permutation codes of distance n-1.",
            "Necessary conditions for the existence of group-invariant Butson Hadamard matrices and a new family of perfect arrays.",
            "Troika: a ternary cryptographic hash function.",
            "Optimal optical orthogonal signature pattern codes with weight three and cross-correlation constraint one.",
            "Linear ℓ-intersection pairs of codes and their applications.",
            "Further results on the equivalence between Galois NFSRs and Fibonacci NFSRs.",
            "New cube distinguishers on NFSR-based stream ciphers.",
            "Metrical properties of self-dual bent functions.",
            "Several new permutation quadrinomials over finite fields of odd characteristic.",
            "Galois hulls of linear codes over finite fields.",
            "Four classes of minimal binary linear codes with wmin/wmax<1/2 derived from Boolean functions.",
            "Linear codes over signed graphs.",
            "On some conjectures about optimal ternary cyclic codes.",
            "Constructing permutation arrays using partition and extension.",
            "Cryptanalysis of elliptic curve hidden number problem from PKC 2017.",
            "A multi-authority approach to various predicate encryption types.",
            "Mutually orthogonal latin squares based on cellular automata.",
            "A class of narrow-sense BCH codes over $\\mathbb {F}_q$ of length $\\frac{q^m-1}{2}$.",
            "On four codes with automorphism group PΣ L(3, 4) and pseudo-embeddings of the large Witt designs.",
            "Ramanujan graphs and expander families constructed from p-ary bent functions.",
            "Discrete antiderivatives for functions over $\\mathop {{\\mathbb {F}}}_p^n$.",
            "Snake-in-the-box codes under the ℓ ∞ -metric for rank modulation.",
            "Modular lattice signatures, revisited.",
            "A new algorithm on the minimal rational fraction representation of feedback with carry shift registers.",
            "Combinatorial t-designs from quadratic functions.",
            "Shift-inequivalent decimations of the Sidelnikov-Lempel-Cohn-Eastman sequences.",
            "Perfect sequence covering arrays.",
            "Subspaces intersecting in at most a point.",
            "Generic constructions of $\\mathbb {Z}$-bent functions.",
            "Linear codes of 2-designs associated with subcodes of the ternary generalized Reed-Muller codes.",
            "Cryptanalysis of a rank-based signature with short public keys.",
            "Rank-metric codes, linear sets, and their duality.",
            "Protecting data privacy in publicly verifiable delegation of matrix and polynomial functions.",
            "Random construction of partial MDS codes.",
            "σ-LCD codes over finite chain rings.",
            "Linear codes from ruled sets in finite projective spaces.",
            "New nonexistence results on (m, n)-generalized bent functions.",
            "Small weight code words arising from the incidence of points and hyperplanes in PG(n, q).",
            "On a duality for codes over non-abelian groups.",
            "The sizes of maximal (v, k, k-2, k-1) optical orthogonal codes.",
            "Do non-free LCD codes over finite commutative Frobenius rings exist?",
            "On equivalence of maximum additive symmetric rank-distance codes.",
            "Multimedia IPP codes with efficient tracing.",
            "Full classification of permutation rational functions and complete rational functions of degree three over finite fields.",
            "Improved (semi-free-start/near-) collision and distinguishing attacks on round-reduced RIPEMD-160.",
            "On the smoothing parameter and last minimum of random orthogonal lattices.",
            "2-(v, 5; m) spontaneous emission error designs.",
            "Flag-transitive block designs with prime replication number and almost simple groups.",
            "Properties of constacyclic codes under the Schur product.",
            "All in the C* family.",
            "On the number of resolvable Steiner triple systems of small 3-rank.",
            "Cocks-Pinch curves of embedding degrees five to eight and optimal ate pairing computation.",
            "Predicting truncated multiple recursive generators with unknown parameters.",
            "Generalized related-key rectangle attacks on block ciphers with linear key schedule: applications to SKINNY and GIFT.",
            "New MDS self-dual codes over finite fields of odd characteristic.",
            "Six constructions of asymptotically optimal codebooks via the character sums.",
            "Partially APN functions with APN-like polynomial representations.",
            "Quantum attacks on some feistel block ciphers.",
            "On a class of isomorphic NFSRs.",
            "Block transitive codes attaining the Tsfasman-Vladut-Zink bound.",
            "Linear codes with few weights from cyclotomic classes and weakly regular bent functions.",
            "Relative generalized Hamming weights of affine Cartesian codes.",
            "Cryptanalysis of a system based on twisted Reed-Solomon codes.",
            "Affine equivalence for quadratic rotation symmetric Boolean functions.",
            "A geometric approach to rank metric codes and a classification of constant weight codes.",
            "On optimal weak algebraic manipulation detection codes and weighted external difference families.",
            "IBE with tight security against selective opening and chosen-ciphertext attacks.",
            "Revisiting Gilbert's known-key distinguisher.",
            "Subgroup perfect codes in Cayley sum graphs.",
            "Longest subsequences shared by two de Bruijn sequences.",
            "Foreword - Special Issue: Codes, Cryptology and Curves in honour of Ruud Pellikaan.",
            "Uniform encodings to elliptic curves and indistinguishable point representation.",
            "Wei-type duality theorems for rank metric codes.",
            "Hamming and simplex codes for the sum-rank metric.",
            "Construction of self-dual matrix codes.",
            "Power error locating pairs.",
            "Weierstrass semigroup at m+1 rational points in maximal curves which cannot be covered by the Hermitian curve.",
            "Isometry-dual flags of AG codes.",
            "Steane-enlargement of quantum codes from the Hermitian function field.",
            "High dimensional affine codes whose square has a designed minimum distance.",
            "Monomial-Cartesian codes and their duals, with applications to LCD codes, quantum codes, and locally recoverable codes.",
            "Computing sharp recovery structures for locally recoverable codes.",
            "Editorial: Coding and Cryptography 2019.",
            "Cubic bent functions outside the completed Maiorana-McFarland class.",
            "Permutations on finite fields with invariant cycle structure on lines.",
            "Two classes of optimal LRCs with information (r, t)-locality.",
            "Constructions of optimal locally recoverable codes via Dickson polynomials.",
            "Subspace packings: constructions and bounds.",
            "Upper bounds for energies of spherical codes of given cardinality and separation.",
            "Proving the biases of Salsa and ChaCha in differential attack.",
            "Cryptanalysis of a code-based one-time signature.",
            "Counting Boolean functions with faster points.",
            "On non-binary traceability set systems.",
            "Message randomization and strong security in quantum stabilizer-based secret sharing for classical secrets.",
            "Codes with locality from cyclic extensions of Deligne-Lusztig curves.",
            "The geometric approach to the existence of some quaternary Griesmer codes.",
            "On the security of a Loidreau rank metric code based encryption scheme.",
            "Boomerang uniformity of popular S-box constructions.",
            "An algorithm for decoding skew Reed-Solomon codes with respect to the skew metric.",
            "A general framework for secondary constructions of bent and plateaued functions.",
            "On q-ary bent and plateaued functions.",
            "On equivalency of zero-divisor codes via classifying their idempotent generator.",
            "On 2-parent-identifying set systems of block size 4.",
            "Analysis of DeepBKZ reduction for finding short lattice vectors.",
            "Relative t-designs in Johnson association schemes for P-polynomial structure.",
            "Characterizations and constructions of triple-cycle permutations of the form xrh(xs).",
            "Caps and progression-free sets in ${{\\mathbb {Z}}}_m^n$.",
            "On constructions and properties of (n, m)-functions with maximal number of bent components.",
            "Enumerating extensions of mutually orthogonal Latin squares.",
            "Linearly equivalent S-boxes and the division property.",
            "On the boomerang uniformity of quadratic permutations.",
            "Classification of self-dual cyclic codes over the chain ring ℤp[u]/ u3 >.",
            "LCD codes and self-orthogonal codes in generalized dihedral group algebras.",
            "The phantom of differential characteristics.",
            "On post-processing in the quantum algorithm for computing short discrete logarithms.",
            "Symmetries of biplanes.",
            "Access balancing in storage systems by labeling partial Steiner systems.",
            "Doubly resolvable Steiner quadruple systems of orders 22n+1.",
            "Deletion correcting codes meet the Littlewood-Offord problem.",
            "Linear complementary pair of group codes over finite chain rings.",
            "Fast computation of linear approximation over certain composition functions and applications to SNOW 2.0 and SNOW 3G.",
            "Tightly CCA-secure encryption scheme in a multi-user setting with corruptions.",
            "Binary primitive LCD BCH codes.",
            "Optimal minimal linear codes from posets.",
            "Two families of two-weight codes over $\\mathbb {Z}_4$.",
            "Wide-sense 2-frameproof codes.",
            "Maximal nonassociativity via fields.",
            "A polymatroid approach to generalized weights of rank metric codes.",
            "Construction of isodual codes from polycirculant matrices.",
            "Rédei permutations with cycles of the same length.",
            "Construction of single-deletion-correcting DNA codes using CIS codes.",
            "On the inverses of Kasami and Bracken-Leander exponents."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2019",
        "info": "2019: Volume 87",
        "count": 183,
        "papers": [
            "Secure simultaneous bit extraction from Koblitz curves.",
            "Several classes of linear codes with a few weights from defining sets over $$\\mathbb {F}_p+u\\mathbb {F}_p$$ F p + u F p.",
            "Involutory differentially 4-uniform permutations from known constructions.",
            "Sets of mutually orthogonal Sudoku frequency squares.",
            "Phased unitary Golay pairs, Butson Hadamard matrices and a conjecture of Ito's.",
            "Polynomial interpolation of the generalized Diffie-Hellman and Naor-Reingold functions.",
            "How many weights can a linear code have?",
            "Improved bounds on 2-frameproof codes with length 4.",
            "Constructions of optimal Ferrers diagram rank metric codes.",
            "Publicly verifiable searchable symmetric encryption based on efficient cryptographic components.",
            "New results on the state cycles of Trivium.",
            "On the q-bentness of Boolean functions.",
            "Self-dual codes better than the Gilbert-Varshamov bound.",
            "Editorial: Special issue on coding and cryptography.",
            "Two notions of differential equivalence on Sboxes.",
            "On APN exponents, characterizations of differentially uniform functions by the Walsh transform, and related cyclic-difference-set-like structures.",
            "Differential attacks: using alternative operations.",
            "On circulant involutory MDS matrices.",
            "Construction and search of balanced Boolean functions on even number of variables towards excellent autocorrelation profile.",
            "Duplication-correcting codes.",
            "On spherical codes with inner products in a prescribed interval.",
            "The covering radii of a class of binary cyclic codes and some BCH codes.",
            "Combinatorial metrics: MacWilliams-type identities, isometries and extension property.",
            "The sextuply shortened binary Golay code is optimal.",
            "Some results on Fruit.",
            "Classification of optimal (v, k, 1) binary cyclically permutable constant weight codes with $$k=5, $$ k = 5 , 6 and 7 and small lengths.",
            "Classifying optimal binary subspace codes of length 8, constant dimension 4 and minimum distance 6.",
            "The graph structure of Chebyshev polynomials over finite fields and applications.",
            "On $$\\mathbb {Z}_{2^s}$$ Z 2 s -linear Hadamard codes: kernel and partial classification.",
            "The functional graph of linear maps over finite fields and applications.",
            "Signature codes for weighted noisy adder channel, multimedia fingerprinting and compressed sensing.",
            "Linear codes from weakly regular plateaued functions and their secret sharing schemes.",
            "A distance between channels: the average error of mismatched channels.",
            "Types of spreads and duality of the parallelisms of PG(3, 5) with automorphisms of order 13.",
            "Local distributions for eigenfunctions and perfect colorings of q-ary Hamming graph.",
            "Dense families of modular curves, prime numbers and uniform symmetric tensor rank of multiplication in certain finite fields.",
            "Evaluating Bernstein-Rabin-Winograd polynomials.",
            "Improved syndrome decoding of lifted $$L$$ L -interleaved Gabidulin codes.",
            "Totally decomposed cumulative Goppa codes with improved estimations.",
            "Improved power decoding of interleaved one-point Hermitian codes.",
            "Almost involutory recursive MDS diffusion layers.",
            "Gaps between prime numbers and tensor rank of multiplication in finite fields.",
            "Improved decoding and error floor analysis of staircase codes.",
            "Improved user-private information retrieval via finite geometry.",
            "A new lower bound for the smallest complete (k, n)-arc in $$\\mathrm {PG}(2, q)$$ PG ( 2 , q ).",
            "Identifying an unknown code by partial Gaussian elimination.",
            "Preface to the special issue on finite geometries.",
            "An Erdős-Ko-Rado theorem for the group $$\\hbox {PSU}(3, q)$$ PSU ( 3 , q ).",
            "On disjoint (v, k, k-1) difference families.",
            "Non-existence of partial difference sets in Abelian groups of order 8p3.",
            "Fano Kaleidoscopes and their generalizations.",
            "Conditions for the existence of spreads in projective Hjelmslev spaces.",
            "Linear codes from Denniston maximal arcs.",
            "Maximal arcs and extended cyclic codes.",
            "The weight spectrum of certain affine Grassmann codes.",
            "The classification of Steiner triple systems on 27 points with 3-rank 24.",
            "Linear codes close to the Griesmer bound and the related geometric structures.",
            "Codes correcting restricted errors.",
            "Relative blocking sets of unions of Baer subplanes.",
            "On the cylinder conjecture.",
            "A variation of the dual hyperoval Sc using presemifields.",
            "Three homogeneous embeddings of DW (2n-1, 2).",
            "Cubic surfaces over small finite fields.",
            "Obituary of Jacques Wolfmann (1932-2018).",
            "The vertex-isoperimetric number of the incidence and non-incidence graphs of unitals.",
            "A variant of the Galbraith-Ruprai algorithm for discrete logarithms with improved complexity.",
            "Orthogonal one-factorizations of complete multipartite graphs.",
            "On non-full-rank perfect codes over finite fields.",
            "Identity-based encryption with hierarchical key-insulation in the standard model.",
            "Cryptanalysis of MORUS.",
            "A recursive construction for difference systems of sets.",
            "Cryptanalysis of the CLR-cryptosystem.",
            "A construction of q-ary linear codes with irreducible cyclic codes.",
            "Covers and partial transversals of Latin squares.",
            "On binary de Bruijn sequences from LFSRs with arbitrary characteristic polynomials.",
            "Using Bernstein-Vazirani algorithm to attack block ciphers.",
            "The linear complexity of generalized cyclotomic binary sequences of period pn.",
            "Primitive idempotent tables of cyclic and constacyclic codes.",
            "Cyclic groups are CI-groups for balanced configurations.",
            "On the cycle index and the weight enumerator.",
            "Almost difference sets in nonabelian groups.",
            "The extension theorem for Lee and Euclidean weight codes over integer residue rings.",
            "MILP-aided cube-attack-like cryptanalysis on Keccak Keyed modes.",
            "Beyond-birthday secure domain-preserving PRFs from a single permutation.",
            "Local bounds for the optimal information ratio of secret sharing schemes.",
            "Simulation-based selective opening security for receivers under chosen-ciphertext attacks.",
            "Key-homomorphic signatures: definitions and applications to multiparty signatures and non-interactive zero-knowledge.",
            "Existence of frame-derived H-designs.",
            "Minimum weight codewords in dual algebraic-geometric codes from the Giulietti-Korchmáros curve.",
            "Trace codes over Z4, and Boolean functions.",
            "Correction to: Miklós-Manickam-Singhi conjectures on partial geometries.",
            "Variations of the Primitive Normal Basis Theorem.",
            "A recursive construction of permutation polynomials over Fq2 with odd characteristic related to Rédei functions.",
            "Optimal 2-D (n × m , 3 , 2 , 1)-optical orthogonal codes and related equi-difference conflict avoiding codes.",
            "On existence theorems for simple t-designs.",
            "Lifted projective Reed-Solomon codes.",
            "Constructing infinite families of low differential uniformity (n, m)-functions with m > n / 2.",
            "A secure and efficient on-line/off-line group key distribution protocol.",
            "Multi-user security bound for filter permutators in the random oracle model.",
            "A new family of partial difference sets in 3-groups.",
            "Erasure combinatorial batch codes based on nonadaptive group testing.",
            "Factorization of a class of composed polynomials.",
            "Equiangular tight frames from group divisible designs.",
            "Maximal contrast color visual secret sharing schemes.",
            "Improved Singleton bound on frequency hopping sequences and optimal constructions.",
            "Correction to: Improved Singleton bound on frequency hopping sequences and optimal constructions.",
            "Polynomial time bounded distance decoding near Minkowski's bound in discrete logarithm lattices.",
            "A trigonometric sum sharp estimate and new bounds on the nonlinearity of some cryptographic Boolean functions.",
            "Codes with the rank metric and matroids.",
            "Nearly optimal robust secret sharing.",
            "Weightwise perfectly balanced functions with high weightwise nonlinearity profile.",
            "Optimal binary constant weight codes and affine linear groups over finite fields.",
            "Cameron-Liebler sets of k-spaces in $${{\\mathrm{PG}}}(n, q)$$ PG ( n , q ).",
            "Additive perfect codes in Doob graphs.",
            "Transitive PSL(2, 11)-invariant k-arcs in PG(4, q).",
            "Uniqueness of codes using semidefinite programming.",
            "An algorithmic framework for the generalized birthday problem.",
            "At most three-weight binary linear codes from generalized Moisio's exponential sums.",
            "Almost designs and their links with balanced incomplete block designs.",
            "Quantum encryption and generalized Shannon impossibility.",
            "On some quadratic APN functions.",
            "On line covers of finite projective and polar spaces.",
            "On (t, L)-fold perfect authentication and secrecy codes with arbitration.",
            "Projective Reed-Muller type codes on higher dimensional scrolls.",
            "Transparency order for Boolean functions: analysis and construction.",
            "Continuous leakage-resilient identity-based encryption with leakage amplification.",
            "A new distance-regular graph of diameter 3 on 1024 vertices.",
            "Correction to: A new distance-regular graph of diameter 3 on 1024 vertices.",
            "New lower bounds for permutation arrays using contraction.",
            "On KM-arcs in non-Desarguesian projective planes.",
            "Simple Schnorr multi-signatures with applications to Bitcoin.",
            "The dual-containing primitive BCH codes with the maximum designed distance and their applications to quantum codes.",
            "Linear (2, p, p)-AONTs exist for all primes p.",
            "On equivalence of cyclic codes, generalization of a quasi-twisted search algorithm, and new linear codes.",
            "On the third greedy weight of 4-dimensional codes.",
            "An attack on the Walnut digital signature algorithm.",
            "A new construction of zero-difference balanced functions and two applications.",
            "On the uniqueness of a type of cascade connection representations for NFSRs.",
            "Theory of supports for linear codes endowed with the sum-rank metric.",
            "Hadamard matrices, d-linearly independent sets and correlation-immune Boolean functions with minimum Hamming weights.",
            "A note on good permutation codes from Reed-Solomon codes.",
            "Linked systems of symmetric group divisible designs of type II.",
            "Steganographic schemes from perfect codes on Cayley graphs.",
            "A coding theoretic approach to the uniqueness conjecture for projective planes of prime order.",
            "A correction to: on the linear complexity of the Sidelnikov-Lempel-Cohn-Eastman sequences.",
            "Three-weight codes, triple sum sets, and strongly walk regular graphs.",
            "Generalized binary arrays from quasi-orthogonal cocycles.",
            "Construction and enumeration for self-dual cyclic codes over Z4 of oddly even length.",
            "On the weight distribution of second order Reed-Muller codes and their relatives.",
            "Partitioned difference families versus zero-difference balanced functions.",
            "A probabilistic analysis on a lattice attack against DSA.",
            "A new polynomial-time variant of LLL with deep insertions for decreasing the squared-sum of Gram-Schmidt lengths.",
            "Matrix theory for minimal trellises.",
            "Hamming correlation properties of the array structure of Sidelnikov sequences.",
            "A new Gaussian sampling for trapdoor lattices with arbitrary modulus.",
            "Binary additive MRD codes with minimum distance n-1 must contain a semifield spread set.",
            "Linear complexity of generalized cyclotomic sequences of period 2pm.",
            "Further study on the maximum number of bent components of vectorial functions.",
            "A general private information retrieval scheme for MDS coded databases with colluding servers.",
            "New theoretical bounds and constructions of permutation codes under block permutation metric.",
            "Further Results on the Morgan-Mullen Conjecture.",
            "Partial geometric designs from group actions.",
            "The maximum length of circuit codes with long bit runs and a new characterization theorem.",
            "Provable security against impossible differential and zero correlation linear cryptanalysis of some feistel structures.",
            "Functional repair codes: a view from projective geometry.",
            "Flag-transitive 2-designs from PSL(2, q) with block size 4.",
            "Constructions and uses of incomplete pairwise balanced designs.",
            "A new piggybacking design for systematic MDS storage codes.",
            "New covering codes of radius R, codimension tR and $$tR+\\frac{R}{2}$$, and saturating sets in projective spaces.",
            "Steiner systems $$S(2, 4, \\frac{3^m-1}{2})$$ and 2-designs from ternary linear codes of length $$\\frac{3^m-1}{2}$$.",
            "Some (almost) optimally extendable linear codes.",
            "Recursive constructions for s-resolvable t-designs.",
            "Practical $$\\mathsf {MP} \\text{- }\\mathsf {LWE} $$ -based encryption balancing security-risk versus efficiency.",
            "Strongly leakage resilient authenticated key exchange, revisited.",
            "Efficient explicit constructions of compartmented secret sharing schemes.",
            "Multidimensional quasi-twisted codes: equivalent characterizations and their relation to multidimensional convolutional codes.",
            "On the geometry of full points of abstract unitals.",
            "New rank codes based encryption scheme using partial circulant matrices.",
            "More accurate results on the provable security of AES against impossible differential cryptanalysis.",
            "Necessary field size and probability for MDP and complete MDP convolutional codes.",
            "Construction of resilient Boolean functions in odd variables with strictly almost optimal nonlinearity.",
            "Linear codes with small hulls in semi-primitive case.",
            "Linear complementary dual codes over rings."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2018",
        "info": "2018: Volume 86",
        "count": 155,
        "papers": [
            "Weight distribution of rank-metric codes.",
            "Timed-release computational secret sharing and threshold encryption.",
            "On the asymptotic complexity of solving LWE.",
            "Mosaics of combinatorial designs.",
            "Functional encryption for computational hiding in prime order groups via pair encodings.",
            "Constructions of good entanglement-assisted quantum error correcting codes.",
            "The closest vector problem in tensored root lattices of type A and in their duals.",
            "On the covering radius of the third order Reed-Muller code RM(3, 7).",
            "Multi point AG codes on the GK maximal curve.",
            "Switched graphs of some strongly regular graphs related to the symplectic graph.",
            "Combinatorial repairability for threshold schemes.",
            "Multi-point codes over Kummer extensions.",
            "Derivation of Cameron-Liebler line classes.",
            "Preface to the special issue on network coding and designs.",
            "The order of the automorphism group of a binary q -analog of the Fano plane is at most two.",
            "A new series of large sets of subspace designs over the binary field.",
            "Network coding with flags.",
            "MDS 2D convolutional codes with optimal 1D horizontal projections.",
            "Concatenation of convolutional codes and rank metric codes for multi-shot network coding.",
            "Extension of Overbeck's attack for Gabidulin-based cryptosystems.",
            "On the genericity of maximum rank distance and Gabidulin codes.",
            "Message encoding and retrieval for spread and cyclic orbit codes.",
            "Coding for locality in reconstructing permutations.",
            "Anticode-based locally repairable codes with high availability.",
            "Editor's note.",
            "On Bonisoli's theorem and the block codes of Steiner triple systems.",
            "Z2-double cyclic codes.",
            "Strengthening the security of authenticated key exchange against bad randomness.",
            "Tightly CCA-secure identity-based encryption with ciphertext pseudorandomness.",
            "Few associative triples, isotopisms and groups.",
            "Partial permutation decoding for binary linear and $$Z_4$$ Z 4 -linear Hadamard codes.",
            "Extension sets, affine designs, and Hamada's conjecture.",
            "A family of semifields in odd characteristic.",
            "Connecting tweakable and multi-key blockcipher security.",
            "Improved, black-box, non-malleable encryption from semantic security.",
            "CCZ equivalence of power functions.",
            "New families of balanced symmetric functions and a generalization of Cusick, Li and Stǎnicǎ's conjecture.",
            "Infinite families of 3-designs from a type of five-weight code.",
            "Improved meet-in-the-middle attacks on reduced-round Kalyna-128/256 and Kalyna-256/512.",
            "Analysing and exploiting the Mantin biases in RC4.",
            "The primitive idempotents and weight distributions of irreducible constacyclic codes.",
            "Constructions of almost secure frameproof codes with applications to fingerprinting schemes.",
            "Combinatorial constructions of packings in Grassmannian spaces.",
            "A link between combinatorial designs and three-weight linear codes.",
            "A correction on the determination of the weight enumerator polynomial of some irreducible cyclic codes.",
            "New constructions of MDS symbol-pair codes.",
            "New nonbinary code bounds based on divisibility arguments.",
            "Codes with a pomset metric and constructions.",
            "Complexities of normal bases constructed from Gauss periods.",
            "Asymptotic and constructive methods for covering perfect hash families and covering arrays.",
            "Fast construction of binary ring FCSRs for hardware stream ciphers.",
            "Key alternating ciphers based on involutions.",
            "Properties of two Shannon's ciphers.",
            "On m-ovoids of regular near polygons.",
            "Four classes of linear codes from cyclotomic cosets.",
            "Solving the FCSR synthesis problem for multi-sequences by lattice basis reduction.",
            "An Assmus-Mattson theorem for codes over commutative association schemes.",
            "Constructions of cyclic quaternary constant-weight codes of weight three and distance four.",
            "Binary extremal self-dual codes of length 60 and related codes.",
            "Constructing permutation arrays from groups.",
            "On the elliptic curve endomorphism generator.",
            "Gowers U3 norm of some classes of bent Boolean functions.",
            "Cyclotomic construction of strong external difference families in finite fields.",
            "On intriguing sets of finite symplectic spaces.",
            "A generalization of the normal rational curve in PG(d, qn) and its associated non-linear MRD codes.",
            "A recursive construction for simple t-designs using resolutions.",
            "On two-weight Z2k -codes.",
            "On data complexity of distinguishing attacks versus message recovery attacks on stream ciphers.",
            "On some constacyclic codes over $$\\mathbb {Z}_{4}\\left[ u\\right] /\\left\\langle u^{2}-1\\right\\rangle $$ , their $Z4 images, and new codes.",
            "On self-dual double circulant codes.",
            "Constructions of cyclic constant dimension codes.",
            "A construction of group divisible designs with block sizes 3 to 7.",
            "Conditional cube attack on round-reduced River Keyak.",
            "Miklós-Manickam-Singhi conjectures on partial geometries.",
            "New optimal binary sequences with period 4p via interleaving Ding-Helleseth-Lam sequences.",
            "Leakage-resilient attribute based encryption in prime-order groups via predicate encodings.",
            "A framework for constructing partial geometric difference sets.",
            "A characterization of ℤ2ℤ2[u]-linear codes.",
            "Polynomial-time key recovery attack on the Faure-Loidreau scheme based on Gabidulin codes.",
            "A note on almost difference sets in nonabelian groups.",
            "Super-strong RKA secure MAC, PKE and SE from tag-based hash proof system.",
            "Cyclic DNA codes over the ring 𝔽2+u𝔽2+v𝔽2+uv𝔽2+v2𝔽2+uv2𝔽2.",
            "Hermitian rank distance codes.",
            "New generalized cyclotomic binary sequences of period p2.",
            "Combinatorial constructions of optimal (m, n, 4, 2) optical orthogonal signature pattern codes.",
            "The autocorrelation properties of single cycle polynomial T-functions.",
            "Upper bound of the length of truncated impossible differentials for AES.",
            "A method to calculate differential uniformity for permutations.",
            "On MDS linear complementary dual codes and entanglement-assisted quantum codes.",
            "Unbiased orthogonal designs.",
            "Permutation polynomials of the type g(xs) over 𝔽q2n.",
            "On a conjecture of differentially 8-uniform power functions.",
            "Chosen ciphertext secure keyed-homomorphic public-key cryptosystems.",
            "Boolean functions with maximum algebraic immunity: further extensions of the Carlet-Feng construction.",
            "Self-reciprocal polynomials and coterm polynomials.",
            "New upper bounds for parent-identifying codes and traceability codes.",
            "A construction for optimal c-splitting authentication and secrecy codes.",
            "Flag-transitive point-primitive automorphism groups of non-symmetric 2-(v, k, 3) designs.",
            "Rank metric codes and zeta functions.",
            "On the (in)efficiency of non-interactive secure multiparty computation.",
            "Generalized Gabidulin codes over fields of any characteristic.",
            "The second Feng-Rao number for codes coming from telescopic semigroups.",
            "On the p-ary (cubic) bent and plateaued (vectorial) functions.",
            "Unweighted linear congruences with distinct coordinates and the Varshamov-Tenengolts codes.",
            "Hadamard full propelinear codes of type Q; rank and kernel.",
            "Zero-correlation attacks: statistical models independent of the number of approximations.",
            "On critical exponents of Dowling matroids.",
            "Flag-transitive point-quasiprimitive 2-(v, k, 2) designs.",
            "On the number of inequivalent Gabidulin codes.",
            "Improved cryptanalysis of rank metric schemes based on Gabidulin codes.",
            "Solving a class of modular polynomial equations and its relation to modular inversion hidden number problem and inversive congruential generator.",
            "Duality of codes supported on regular lattices, with an application to enumerative combinatorics.",
            "On group codes with complementary duals.",
            "Flags of almost affine codes and the two-party wire-tap channel of type II.",
            "Fourier transforms and bent functions on finite groups.",
            "Group rings, G-codes and constructions of self-dual and formally self-dual codes.",
            "A class of negacyclic BCH codes and its application to quantum codes.",
            "Linear codes from simplicial complexes.",
            "Some new Kirkman signal sets.",
            "Homomorphic signatures with sublinear public keys via asymmetric programmable hash functions.",
            "On counting subring-submodules of free modules over finite commutative frobenius rings.",
            "Group divisible designs with large block sizes.",
            "Hermitian LCD codes from cyclic codes.",
            "The point decomposition problem over hyperelliptic curves - Toward efficient computation of discrete logarithms in even characteristic.",
            "AG codes and AG quantum codes from the GGS curve.",
            "A non-commutative cryptosystem based on quaternion algebras.",
            "New constructions of permutation polynomials of the form xr h(x q - 1) over 𝔽q2.",
            "Revocable hierarchical identity-based encryption with shorter private keys and update keys.",
            "The linear complexity of a class of binary sequences with optimal autocorrelation.",
            "Cover attacks for elliptic curves with cofactor two.",
            "Nonlinear diffusion layers.",
            "On self-dual negacirculant codes of index two and four.",
            "Reusable fuzzy extractor from the decisional Diffie-Hellman assumption.",
            "Three-weight ternary linear codes from a family of cyclic difference sets.",
            "Practical witness encryption for algebraic languages or how to encrypt under Groth-Sahai proofs.",
            "How to build time-lock encryption.",
            "A CCA-secure key-policy attribute-based proxy re-encryption in the adaptive corruption model for dropbox data sharing system.",
            "Euclidean and Hermitian LCD MDS codes.",
            "On explicit minimum weight bases for extended cyclic codes related to Gold functions.",
            "Covering arrays of strength three from extended permutation vectors.",
            "Multiset combinatorial batch codes.",
            "Lexicodes over finite principal ideal rings.",
            "Group invariant weighing matrices.",
            "Analysis of the single-permutation encrypted Davies-Meyer construction.",
            "Frame difference families and resolvable balanced incomplete block designs.",
            "Tweaking a block cipher: multi-user beyond-birthday-bound security in the standard model.",
            "Non-symmetric 2-designs admitting a two-dimensional projective linear group.",
            "A ring-like cascade connection and a class of NFSRs with the same cycle structures.",
            "Pseudocodeword-free criterion for codes with cycle-free Tanner graph.",
            "Speeding up Huff form of elliptic curves.",
            "A note on the weight spectrum of the Schubert code Cα(2, m).",
            "Linear codes over Fq[x]/(x2) and GR(p2, m) reaching the Griesmer bound.",
            "Some results on generalized strong external difference families.",
            "Constructions of complete permutation polynomials.",
            "On the second Feng-Rao distance of Algebraic Geometry codes related to Arf semigroups."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2017",
        "info": "2017: Volumes\n82,\n83,\n84,\n85",
        "count": 146,
        "papers": [
            "Editorial: Special issue on coding and cryptography.",
            "Reflection ciphers.",
            "Improving algebraic attacks on stream ciphers based on linear feedback shift register over $$\\mathbb {F}_{2^k}$$ F 2 k.",
            "Upper bounds on the complexity of algebraic cryptanalysis of ciphers with a low multiplicative complexity.",
            "MacWilliams Extension Theorem for MDS codes over a vector space alphabet.",
            "Lower bound of covering radius of binary irreducible Goppa codes.",
            "On the direct construction of recursive MDS matrices.",
            "Redefining the transparency order.",
            "Improving impossible-differential attacks against Rijndael-160 and Rijndael-224.",
            "Revisiting (nested) Roos bias in RC4 key scheduling algorithm.",
            "On some permutation binomials and trinomials over $$\\mathbb {F}_{2^n}$$ F 2 n.",
            "Improved elliptic curve hashing and point representation.",
            "Towards a general construction of recursive MDS diffusion layers.",
            "Cover-free codes and separating system codes.",
            "Symmetric disjunctive list-decoding codes.",
            "Almost cover-free codes and designs.",
            "Hasse-Weil bound for additive cyclic codes.",
            "Idempotent and p-potent quadratic functions: distribution of nonlinearity and co-dimension.",
            "Signature codes for noisy multiple access adder channel.",
            "Optimal software-implemented Itoh-Tsujii inversion for $$\\mathbb {F}_{2^{m}}$$ F 2 m.",
            "Joint data and key distribution of simple, multiple, and multidimensional linear cryptanalysis test statistic and its impact to data complexity.",
            "Observing biases in the state: case studies with Trivium and Trivia-SC.",
            "Security proof of the canonical form of self-synchronizing stream ciphers.",
            "Row reduction applied to decoding of rank-metric and subspace codes.",
            "Energy bounds for codes and designs in Hamming spaces.",
            "Antiderivative functions over $$\\mathbb {F}_{2^n}$$ F 2 n.",
            "Algebraic decoding of folded Gabidulin codes.",
            "A code-based group signature scheme.",
            "Improving the security and efficiency of block ciphers based on LS-designs.",
            "A generalization of combinatorial designs and related codes.",
            "On affine sub-families of Grain-like structures.",
            "Fourier transforms and bent functions on faithful actions of finite abelian groups.",
            "How to make a linear network code (strongly) secure.",
            "Generic constructions for partitioned difference families with applications: a unified combinatorial approach.",
            "A new method for decomposition in the Jacobian of small genus hyperelliptic curves.",
            "On the conjecture on APN functions and absolute irreducibility of polynomials.",
            "Construction of a (k, n)-visual cryptography scheme.",
            "Nonexistence of generalized bent functions from ℤ2n to ℤm.",
            "Complete weight enumerators of a family of three-weight linear codes.",
            "Sudoku-like arrays, codes and orthogonality.",
            "The adjacency graphs of some feedback shift registers.",
            "Cryptanalysis of Dual RSA.",
            "Direct constructions of large sets of Kirkman triple systems.",
            "Affine-invariant strictly cyclic Steiner quadruple systems.",
            "Codes with the identifiable parent property for multimedia fingerprinting.",
            "Complete weight enumerators of a class of linear codes.",
            "On MDS convolutional codes over Zpr.",
            "On linear codes admitting large automorphism groups.",
            "A case study in almost-perfect security for unconditionally secure communication.",
            "On the automorphism groups of the Z2 Z4 -linear 1-perfect and Preparata-like codes.",
            "Asynchronous channel hopping systems from difference sets.",
            "Explicit factorizations of cyclotomic polynomials over finite fields.",
            "Three new classes of optimal frequency-hopping sequence sets.",
            "On the completeness of plane cubic curves over finite fields.",
            "Intersection sets, three-character multisets and associated codes.",
            "An iterative algorithm for parametrization of shortest length linear shift registers over finite chain rings.",
            "Evaluation of the Hamming weights of a class of linear codes based on Gauss sums.",
            "A new counting method to bound the number of active S-boxes in Rijndael and 3D.",
            "Primitive semifields of order 24e.",
            "Optimal collision security in double block length hashing with single length key.",
            "Generic attacks on the Lai-Massey scheme.",
            "Some new results on permutation polynomials over finite fields.",
            "On the number of irreducible linear transformation shift registers.",
            "On the snake-in-the-box codes for rank modulation under Kendall's τ -metric.",
            "Truncated differential based known-key attacks on round-reduced SIMON.",
            "Simple t-designs: a recursive construction for arbitrary t.",
            "Quantum MDS codes with large minimum distance.",
            "An optimal representation for the trace zero subgroup.",
            "The structure of the minimum size supertail of a subspace partition.",
            "Multiple point compression on elliptic curves.",
            "A projection decoding of a binary extremal self-dual code of length 40.",
            "Twofold triple systems without 2-intersecting Gray codes.",
            "Construction of binary linear codes via rational function fields.",
            "On the roots and minimum rank distance of skew cyclic codes.",
            "Extending permutation arrays: improving MOLS bounds.",
            "Proof of a conjecture of Kløve on permutation codes under the Chebychev distance.",
            "Linear codes with few weights from inhomogeneous quadratic functions.",
            "Editor's note.",
            "Preface to the special issue dedicated to Andries E. Brouwer.",
            "Light tails and the Hermitian dual polar graphs.",
            "New lower bounds for the Shannon capacity of odd cycles.",
            "Relative t-designs in binary Hamming association scheme H(n, 2).",
            "Distance mean-regular graphs.",
            "Distance-regular Cayley graphs with least eigenvalue -2.",
            "Semidefinite bounds for nonbinary codes based on quadruples.",
            "The uniqueness of a distance-regular graph with intersection array {32, 27, 8, 1;1, 4, 27, 32} and related results.",
            "ℤ4-codes and their Gray map images as orthogonal arrays.",
            "Characterizations of the Suzuki tower near polygons.",
            "A generalization of a theorem of Neumaier.",
            "On the maximality of a set of mutually orthogonal Sudoku Latin Squares.",
            "The graphs with all but two eigenvalues equal to -2 or 0.",
            "On resolvable Steiner 2-designs and maximal arcs in projective planes.",
            "Godsil-McKay switching and twisted Grassmann graphs.",
            "Integral automorphisms of affine spaces over finite fields.",
            "On eigenvalues of Seidel matrices and Haemers' conjecture.",
            "On almost small and almost large super-Vandermonde sets in GF(q).",
            "A non-Schurian coherent configuration on 14 points exists.",
            "Implementing Brouwer's database of strongly regular graphs.",
            "Bounding basis reduction properties.",
            "Rank error-correcting pairs.",
            "The Smith group of the hypercube graph.",
            "The spurs of D. H. Lehmer - Hamiltonian paths in neighbor-swap graphs of permutations.",
            "Cryptanalysis of multilinear maps from ideal lattices: revisited.",
            "Doubly resolvable Steiner quadruple systems and related designs.",
            "The BEL-rank of finite semifields.",
            "Constructions of maximum distance separable symbol-pair codes using cyclic and constacyclic codes.",
            "On the power of rewinding simulators in functional encryption.",
            "Construction of low-hit-zone frequency hopping sequences with optimal partial Hamming correlation by interleaving techniques.",
            "Near-complete external difference families.",
            "Higher order differentiation over finite fields with applications to generalising the cube attack.",
            "Classification of partial difference sets in Abelian groups of order 4p2.",
            "Quantum MDS codes with relatively large minimum distance from Hermitian self-orthogonal codes.",
            "Galois self-dual constacyclic codes.",
            "Partial spread and vectorial generalized bent functions.",
            "Perfect contrast XOR-based visual cryptography schemes via linear algebra.",
            "Efficient revocable identity-based encryption via subset difference methods.",
            "Lattices from codes over Zq : generalization of constructions D, D' and D ¯.",
            "Improved upper bounds for partial spreads.",
            "Collineations of finite 2-affine planes.",
            "Complete mappings and Carlitz rank.",
            "A combinatorial problem related to sparse systems of equations.",
            "Strong authenticated key exchange with auxiliary inputs.",
            "A note on the strong authenticated key exchange with auxiliary inputs.",
            "On the construction of quantum constacyclic codes.",
            "Cyclic subspace codes via subspace polynomials.",
            "Equivalences among plateaued APN functions.",
            "Constructions of optimal low-hit-zone frequency hopping sequence sets.",
            "Linearly embeddable designs.",
            "Bounds and constructions of t-spontaneous emission error designs.",
            "Anonymous and leakage resilient IBE and IPE.",
            "New optical orthogonal signature pattern codes with maximum collision parameter 2 and weight 4.",
            "Nonlinear functions and difference sets on group actions.",
            "Construction for de Bruijn sequences with large stage.",
            "Some properties of skew codes over finite fields.",
            "Stretching de Bruijn sequences.",
            "The graph of minimal distances of bent functions and its properties.",
            "Large sets of Kirkman triple systems of prime power sizes.",
            "On symmetric BIBDs with the same 3-concurrence.",
            "Covering arrays from m-sequences and character sums.",
            "Strongly regular graphs from classical generalized quadrangles.",
            "Nonexistence of two classes of generalized bent functions.",
            "Consolidation for compact constraints and Kendall tau LP decodable permutation codes.",
            "On equivalence of negaperiodic Golay pairs.",
            "New bounds of permutation codes under Hamming metric and Kendall's τ -metric.",
            "Mapping prefer-opposite to prefer-one de Bruijn sequences.",
            "There is exactly one $${\\mathbb {Z}}_2{\\mathbb {Z}}_4$$-cyclic 1-perfect code."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2016",
        "info": "2016: Volumes\n78,\n79,\n80,\n81",
        "count": 140,
        "papers": [
            "Editorial for the 25th anniversary issue.",
            "Four decades of research on bent functions.",
            "Recent progress on the elliptic curve discrete logarithm problem.",
            "Technical history of discrete logarithms in small characteristic finite fields - The road from subexponential to quasi-polynomial complexity.",
            "Cryptocash, cryptocurrencies, and cryptocontracts.",
            "Disjoint difference families and their applications.",
            "A survey of some applications of finite fields.",
            "Almost perfect and planar functions.",
            "Finite field constructions of combinatorial arrays.",
            "A survey of the multiplier conjecture.",
            "Sequences with small correlation.",
            "(Secure) Linear network coding multicast - A theoretical minimum and some open problems.",
            "Galois geometries and coding theory.",
            "Quantum cryptography beyond quantum key distribution.",
            "q-Analogs of t-wise balanced designs from Borel subgroups.",
            "More constructions of differentially 4-uniform permutations on 𝔽22k.",
            "Optimal combinatorial batch codes based on block designs.",
            "Computing isogenies between supersingular elliptic curves over 𝔽p.",
            "Extended security arguments for signature schemes.",
            "A two-fold cover of strongly regular graphs with spreads and association schemes of class five.",
            "Conics arising from external points and their binary codes.",
            "Generic constructions of integrated PKE and PEKS.",
            "On subspace codes.",
            "On the spectral immunity of periodic sequences restricted to binary annihilators.",
            "Building indifferentiable compression functions from the PGV compression functions.",
            "On BEL-configurations and finite semifields.",
            "Exceptional planar polynomials.",
            "A class of quaternary linear codes improving known minimum distances.",
            "Quadratic zero-difference balanced functions, APN functions and strongly regular graphs.",
            "A new family of tight sets in Q+(5, q).",
            "Partially user-irrepressible sequence sets and conflict-avoiding codes.",
            "The automorphism group of an extremal [120, 60, 24] code does not contain elements of order 29.",
            "Weight enumerator of some irreducible cyclic codes.",
            "Weight distribution of cyclic codes with arbitrary number of generalized Niho type zeroes.",
            "The weight distribution of a family of p-ary cyclic codes.",
            "Optimal equi-difference conflict-avoiding codes of weight four.",
            "Effective compression maps for torus-based cryptography.",
            "Existence of optimal strong partially balanced 3-designs with block size four.",
            "An upper bound of the value of t of the support t-designs of extremal binary doubly even self-dual codes.",
            "The homogeneous weight partition and its character-theoretic dual.",
            "An efficient IBE scheme with tight security reduction in the random oracle model.",
            "Structural cryptanalysis of McEliece schemes with compact keys.",
            "Self-dual codes from extended orbit matrices of symmetric designs.",
            "Self-updatable encryption with short public parameters and its extensions.",
            "Binary codes of the symplectic generalized quadrangle of even order.",
            "On the automorphisms of order 15 for a binary self-dual [96, 48, 20] code.",
            "Projective polynomials, a projection construction and a family of semifields.",
            "Two-weight codes, graphs and orthogonal arrays.",
            "Unreal BH(n, 6)'s and Hadamard matrices.",
            "Generalized weights and the Ball-Blokhuis congruence.",
            "Improved indifferentiability security bound for the JH mode.",
            "Polly Cracker, revisited.",
            "Strongly separable codes.",
            "On automorphism groups of divisible designs acting regularly on the set of point classes.",
            "Symmetric designs admitting flag-transitive and point-primitive automorphism groups associated to two dimensional projective special groups.",
            "A class of five-weight cyclic codes and their weight distribution.",
            "Optimal strongly conflict-avoiding codes of even length and weight three.",
            "MaxMinMax problem and sparse equations over finite fields.",
            "Editorial: finite geometries.",
            "On the extendability of particular classes of constant dimension codes.",
            "Further results on rational points of the curve yqn-y=γ xqh+1 - α over 𝔽qm.",
            "3-Nets realizing a diassociative loop in a projective plane.",
            "The structure of dual Grassmann codes.",
            "Automorphisms of strongly regular graphs with applications to partial difference sets.",
            "Complete (k, 3)-arcs from quartic curves.",
            "Hyperplanes of Hermitian dual polar spaces of rank 3 containing a quad.",
            "On the extendability of quasidivisible Griesmer arcs.",
            "Entry-faithful 2-neighbour transitive codes.",
            "Simultaneous diagonalization of conics in PG(2, q) - A finite-geometry approach for simultaneous diagonalization of symmetric 3 × 3 matrices in GF(q).",
            "The packings of PG(3, 3).",
            "Non-linear maximum rank distance codes.",
            "Extending some induced substructures of an inversive plane.",
            "Transitive hyperovals.",
            "Higgledy-piggledy subspaces and uniform subspace designs.",
            "New binary h-generator quasi-cyclic codes by augmentation and new minimum distance bounds.",
            "Almost separating and almost secure frameproof codes over q-ary alphabets.",
            "Tightly secure signatures and public-key encryption.",
            "On small gaps between the elements of multiplicative subgroups of finite fields.",
            "Constructions of complex equiangular lines from mutually unbiased bases.",
            "Perfect codes in Doob graphs.",
            "Generalized closest substring encryption.",
            "On constructions and parameters of symmetric configurations vk.",
            "A general check digit system based on finite groups.",
            "Constructions and analysis of some efficient t - (k, n)∗-visual cryptographic schemes using linear algebraic techniques.",
            "Rank-metric codes and their duality theory.",
            "Switchings of semifield multiplications.",
            "On Jacobi sums, difference sets and partial difference sets in Galois domains.",
            "A construction and decomposition of orthogonal arrays with non-prime-power numbers of symbols on the complement of a Baer subplane.",
            "Complete weight enumerators of some cyclic codes.",
            "Characterising pointsets in PG(4, q) that correspond to conics.",
            "Homomorphic AES evaluation using the modified LTV scheme.",
            "Squaring attacks on McEliece public-key cryptosystems using quasi-cyclic codes of even dimension.",
            "Codes over F4+vF4 and some DNA applications.",
            "Convolutional block codes with cryptographic properties over the semi-direct product ℤ/Nℤ ⋊ ℤ/Mℤ.",
            "Barker sequences of odd length.",
            "Dimensional dual hyperovals in classical polar spaces.",
            "Hamiltonicity and cycle extensions in 0-block-intersection graphs of balanced incomplete block designs.",
            "Partial geometric designs with prescribed automorphisms.",
            "Non-special subsets of the set of points of a curve defined over a finite field.",
            "Meet-in-the-middle attacks on 10-round AES-256.",
            "Comparison of perfect table cryptanalytic tradeoff algorithms.",
            "Extended dual system group and shorter unbounded hierarchical identity based encryption.",
            "On the lifted Zetterberg code.",
            "Asymptotic existence results for primitive completely normal elements in extensions of Galois fields.",
            "Extended meet-in-the-middle attacks on some Feistel constructions.",
            "Authentication codes based on resilient Boolean maps.",
            "A Latin square autotopism secret sharing scheme.",
            "Two classes of cyclic codes and their weight enumerator.",
            "Graph-theoretic design and analysis of key predistribution schemes.",
            "Switched symplectic graphs and their 2-ranks.",
            "Policy-based signature scheme from lattices.",
            "A reduction of Semigroup DLP to classic DLP.",
            "SL2 homomorphic hash functions: worst case to average case reduction and short collision search.",
            "Separating invertible key derivations from non-invertible ones: sequential indifferentiability of 3-round Even-Mansour.",
            "A note on relative hemisystems of Hermitian generalised quadrangles.",
            "New infinite series of 2-designs over the binary and ternary field.",
            "Complete weight enumerators of some linear codes and their applications.",
            "A generalization of Kung's theorem.",
            "Blind attribute-based encryption and oblivious transfer with fine-grained access control.",
            "A class of cyclic codes whose duals have five zeros.",
            "Construction of extremal self-dual codes over ℤ8 and ℤ16.",
            "On the linear complexity profile of some sequences derived from elliptic curves.",
            "On the equivalence of linear sets.",
            "Linear codes with two or three weights from quadratic Bent functions.",
            "The fullrank value function.",
            "Bounds and constructions for 3¯-separable codes with length 3.",
            "Multisequences with high joint nonlinear complexity.",
            "Kernels and ranks of cyclic and negacyclic quaternary codes.",
            "On generalized Howell designs with block size three.",
            "New criterion for diffusion property and applications to improved GFS and EGFN.",
            "Suzuki-invariant codes from the Suzuki curve.",
            "Near weights on higher dimensional varieties.",
            "Veronese subspace codes.",
            "Index bounds for character sums of polynomials over finite fields.",
            "On the geometric constructions of optimal linear codes.",
            "Flag-transitive non-symmetric 2-designs with (r, λ)=1 and sporadic socle.",
            "Total perfect codes in Cayley graphs.",
            "Large classes of permutation polynomials over Fq2.",
            "Improving algorithm 2 in multidimensional (zero-correlation) linear cryptanalysis using χ2-method.",
            "Complementary information set codes over GF(p)."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2015",
        "info": "2015: Volumes\n74,\n75,\n76,\n77",
        "count": 155,
        "papers": [
            "On cyclic codes over the ring Zp[u] / 〈uk〉.",
            "Two series of equitable symbol weight codes meeting the Plotkin bound.",
            "New bounds on 2-separable codes of length 2.",
            "A generalized birthday approach for efficiently finding linear relations in ℓ-sequences.",
            "On the minimum number of points covered by a set of lines in PG(2, q).",
            "Binary and q-ary Tardos codes, revisited.",
            "A geometric protocol for cryptography with cards.",
            "Spectrum of sizes for perfect 2-deletion-correcting codes of length 4.",
            "Symmetric doubly dual hyperovals have an odd rank.",
            "False Negative probabilities in Tardos codes.",
            "Beyond eCK: perfect forward secrecy under actor compromise and ephemeral-key reveal.",
            "ETRU: NTRU over the Eisenstein integers.",
            "Group divisible designs with block size four and group type gum1.",
            "Erratum to: Intersection of Hamming codes avoiding Hamming subcodes.",
            "A class of minimal cyclic codes over finite fields.",
            "Semi-cyclic holey group divisible designs with block size three.",
            "On the complexity of the BKW algorithm on LWE.",
            "On self-dual constacyclic codes over finite fields.",
            "Compression of periodic complementary sequences and applications.",
            "Optimum commutative group codes.",
            "Anonymous HIBE with short ciphertexts: full security in prime order groups.",
            "On embeddings of minimum dimension of PG(n, q) × PG(n, q).",
            "Lower bounds on the minimum distance of long codes in the Lee metric.",
            "Constructing self-dual codes over Fq[u]/(ut).",
            "Further results on the distinctness of modulo 2 reductions of primitive sequences over Z/(232-1).",
            "Decoding mixed errors and erasures in permutation codes.",
            "Extending Brickell-Davenport theorem to non-perfect secret sharing schemes.",
            "Quasi-abelian codes.",
            "On the bounds and achievability about the ODPC of GRM(2,m)∗over prime fields for increasing message length.",
            "Computing in degree 2k-extensions of finite fields of odd characteristic.",
            "Classification of self-dual codes of length 50 with an automorphism of odd prime order.",
            "Paley type sets from cyclotomic classes and Arasu-Dillon-Player difference sets.",
            "On graphs and codes preserved by edge local complementation.",
            "Optimal assignment schemes for general access structures based on linear programming.",
            "Building blockcipher from small-block tweakable blockcipher.",
            "Highly nonlinear functions.",
            "New extremal binary self-dual codes of length 64 from R3-lifts of the extended binary Hamming code.",
            "On generator matrices and parity check matrices of generalized integer codes.",
            "On the linear complexity of Legendre-Sidelnikov sequences.",
            "Secret sharing on the d-dimensional cube.",
            "Comment on \"Identity-based non-interactive key distribution with forward security\".",
            "On point-transitive and transitive deficiency one parallelisms of PG (3, 4).",
            "Xing-Ling codes, duals of their subcodes, and good asymmetric quantum codes.",
            "Two families of nearly optimal codebooks.",
            "Hardness of learning problems over Burnside groups of exponent 3.",
            "Planar functions and perfect nonlinear monomials over finite fields.",
            "Perfect codes in the discrete simplex.",
            "Demi-matroids from codes over finite Frobenius rings.",
            "Optimal three-dimensional optical orthogonal codes of weight three.",
            "On relative constant-weight codes.",
            "Sequences of irreducible polynomials without prescribed coefficients over odd prime fields.",
            "New lower bounds on the aperiodic Hamming correlations of frequency hopping sequences with low hit zone.",
            "Speeding up deciphering by hypergraph ordering.",
            "One-point Klein codes and their serial-in-serial-out systematic encoding.",
            "On affine sub-families of the NFSR in Grain.",
            "A new family of relative hemisystems on the Hermitian surface.",
            "4-Cycle decompositions of (λ+m)Kv+u \\ λKv.",
            "A construction of a partial difference set in the extraspecial groups of order p3 with exponent p2.",
            "On extremal self-dual codes of length 120.",
            "A method for constructing self-dual codes over ℤ2m.",
            "The weight distribution of a family of p-ary cyclic codes.",
            "On the construction of Griesmer codes of dimension 5.",
            "Functions which are PN on infinitely many extensions of 𝔽p, p odd.",
            "Enumeration of linear transformation shift registers.",
            "Generalized residue and t-residue codes and their idempotent generators.",
            "Point compression for the trace zero subgroup over a small degree extension field.",
            "Construction of minimal non-abelian left group codes.",
            "New results on nonexistence of generalized bent functions.",
            "Hanani triple packings and optimal q-ary codes of constant weight three.",
            "Self-embeddings of Hamming Steiner triple systems of small order and APN permutations.",
            "Triple arrays and Youden squares.",
            "On small line sets with few odd-points.",
            "The largest Erdős-Ko-Rado sets in 2-(v, k, 1) designs.",
            "New cube root algorithm based on the third order linear recurrence relations in finite fields.",
            "Permutation codes invariant under isometries.",
            "Difference matrices related to Sophie Germain primes p using functions on the fields F2p+1.",
            "False positive probabilities in q-ary Tardos codes: comparison of attacks.",
            "Fourier-reflexive partitions and MacWilliams identities for additive codes.",
            "Worst-case to average-case reductions for module lattices.",
            "Foreword: Computer Algebra in Coding Theory and Cryptography.",
            "Efficient representation of binary nonlinear codes: constructions and minimum distance computation.",
            "Heuristic decoding of linear codes using commutative algebra.",
            "Optimal codes as Tanner codes with cyclic component codes.",
            "An improvement of the Feng-Rao bound for primary codes.",
            "The second generalized Hamming weight of certain Castle codes.",
            "Quantum codes from affine variety codes and their subfield-subcodes.",
            "Hamming codes for wet paper steganography.",
            "Theory of 2-rotation symmetric cubic Boolean functions.",
            "2-(v, k, 1) Designs with a point-primitive rank 3 automorphism group of affine type.",
            "On some bounds on the minimum distance of cyclic codes over finite fields.",
            "MJH: a faster alternative to MDC-2.",
            "Search problems in vector spaces.",
            "Theta functions and symmetric weight enumerators for codes over imaginary quadratic fields.",
            "Mutually unbiased weighing matrices.",
            "Monomial isomorphisms of cyclic codes.",
            "Permutation decoding of ℤ2ℤ4-linear codes.",
            "Two constructions of balanced Boolean functions with optimal algebraic immunity, high nonlinearity and good behavior against fast algebraic attacks.",
            "A new iterative computer search algorithm for good quasi-twisted codes.",
            "LLL for ideal lattices: re-evaluation of the security of Gentry-Halevi's FHE scheme.",
            "New pseudo-planar binomials in characteristic two and related schemes.",
            "Weighted maximum matchings and optimal equi-difference conflict-avoiding codes.",
            "On a 5-design related to a putative extremal doubly even self-dual code of length a multiple of 24.",
            "Differential cryptanalysis of PRESENT-like cipher.",
            "Bentness and nonlinearity of functions on finite groups.",
            "Almost universal forgery attacks on AES-based MAC's.",
            "An investigation of the tangent splash of a subplane of PG(2, q3).",
            "Strongly secure authenticated key exchange from factoring, codes, and lattices.",
            "On the automorphisms of designs constructed from finite simple groups.",
            "Codes over rings and Hermitian lattices.",
            "Plateaued functions and one-and-half difference sets.",
            "Diagonally cyclic equitable rectangles.",
            "Enhanced Boolean functions suitable for the filter model of pseudo-random generator.",
            "Completely reducible super-simple designs with block size five and index two.",
            "Practical-time attacks against reduced variants of MISTY1.",
            "A class of six-weight cyclic codes and their weight distribution.",
            "A methodology for differential-linear cryptanalysis and its applications.",
            "Tactical decompositions of designs over finite fields.",
            "Verifiably encrypted signatures with short keys based on the decisional linear problem and obfuscation for encrypted VES.",
            "Bent vectorial functions and linear codes from o-polynomials.",
            "Differentially 4-uniform bijections by permuting the inverse function.",
            "Fixed argument pairing inversion on elliptic curves.",
            "Semisimple multivariable 𝔽q-linear codes over 𝔽ql.",
            "Minimal logarithmic signatures for the unitary group Un(q).",
            "Entanglement-assisted quantum codes from arbitrary binary linear codes.",
            "Linear representations of subgeometries.",
            "The completion determination of optimal (3, 4)-packings.",
            "Proving TLS-attack related open biases of RC4.",
            "Sequences with good correlation property based on depth and interleaving techniques.",
            "Explicit factorization of xn-1 ∈ 𝔽q[x].",
            "Guest Editorial: Special Issue in Honor of Scott A. Vanstone.",
            "On tight bounds for binary frameproof codes.",
            "Almost 2-perfect 6-cycle systems.",
            "Primitive normal bases for quartic and cubic extensions: a geometric approach.",
            "Perfect hash families of strength three with three rows from varieties on finite projective geometries.",
            "Enumeration of Kerdock codes of length 64.",
            "Maximal arcs and quasi-symmetric designs.",
            "Finding shortest lattice vectors faster using quantum search.",
            "Quantifying the security advantage of password expiration policies.",
            "Square integer Heffter arrays with empty cells.",
            "Isogenies of abelian varieties over finite fields.",
            "Linearly homomorphic structure-preserving signatures and their applications.",
            "Optimal low-power coding for error correction and crosstalk avoidance in on-chip data buses.",
            "High-speed Curve25519 on 8-bit, 16-bit, and 32-bit microcontrollers.",
            "Some primality tests that eluded Lucas.",
            "PASS-Encrypt: a public key cryptosystem based on partial evaluation of polynomials.",
            "The asymptotic existence of DR(v, k, k-1)-BIBDs.",
            "Batch verifiable computation of outsourced functions.",
            "The random oracle model: a twenty-year retrospective.",
            "Open problems in hash function security.",
            "Reflections on slide with a twist attacks.",
            "Further results on the number of rational points of hyperelliptic supersingular curves in characteristic 2.",
            "Zero-knowledge proofs of knowledge for group homomorphisms.",
            "Normal forms of hyperelliptic curves of genus 3.",
            "Power map permutations and the discrete log problem.",
            "Achieving short ciphertexts or short secret-keys for adaptively secure general inner-product encryption."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2014",
        "info": "2014: Volumes\n70,\n71,\n72,\n73",
        "count": 178,
        "papers": [
            "Editorial: 3rd International Castle Meeting on Coding Theory and Applications.",
            "Sphere coverings and identifying codes.",
            "Bounds on collaborative decoding of interleaved Hermitian codes and virtual extension.",
            "Codes associated with circulant graphs and permutation decoding.",
            "Hulls of codes from incidence matrices of connected regular graphs.",
            "Fast skew-feedback shift-register synthesis.",
            "On the classification of the extremal self-dual codes over small fields with 2-transitive automorphism groups.",
            "A generalization of Lee codes.",
            "Geometric WOM codes and coding strategies for multilevel flash memories.",
            "Characterization of the automorphism group of quaternary linear Hadamard codes.",
            "On the Geil-Matsumoto bound and the length of AG codes.",
            "Classification and nonexistence results for linear codes with prescribed minimum distances.",
            "New families of completely regular codes and their corresponding distance regular coset graphs.",
            "New binary codes from extended Goppa codes.",
            "On the subfield subcodes of Hermitian codes.",
            "Information sets in abelian codes: defining sets and Groebner basis.",
            "Evaluation codes defined by finite families of plane valuations at infinity.",
            "On the unique representation of very strong algebraic geometry codes.",
            "Modified Niederreiter type of GPT cryptosystem based on reducible rank codes.",
            "Realization of 2D convolutional codes of rate $$\\frac{1}{n}$$ by separable Roesser models.",
            "Internal differential collision attacks on the reduced-round Grøstl-0 hash function.",
            "Proofs of two conjectures on the dimensions of binary codes.",
            "Local duality theorem for q-ary 1-perfect codes.",
            "The exponent of a polarizing matrix constructed from the Kronecker product.",
            "Signcryption schemes with threshold unsigncryption, and applications.",
            "On self-dual cyclic codes over finite chain rings.",
            "On the distinctness of modular reductions of primitive sequences over Z/(232-1).",
            "Linear hulls with correlation zero and linear cryptanalysis of block ciphers.",
            "Finite number of fibre products of Kummer covers and curves with many points over finite fields.",
            "Linear codes using skew polynomials with automorphisms and derivations.",
            "Note on the size of binary Armstrong codes.",
            "Affine cartesian codes.",
            "On the functional codes defined by quadrics and Hermitian varieties.",
            "Constructing rate 1/p systematic binary quasi-cyclic codes based on the matroid theory.",
            "Fully homomorphic SIMD operations.",
            "Optimal symmetric Tardos traitor tracing schemes.",
            "Asymptotic behaviour of codes in rank metric over finite fields.",
            "On some new m-spotty Lee weight enumerators.",
            "On (k, n)*-visual cryptography scheme.",
            "On the largest affine sub-families of a family of NFSR sequences.",
            "Construction of rotation symmetric Boolean functions with optimal algebraic immunity and high nonlinearity.",
            "Matrix product codes over finite commutative Frobenius rings.",
            "A new bound on the minimum distance of cyclic codes using small-minimum-distance cyclic codes.",
            "Inner balance of symmetric designs.",
            "Decoding interleaved Reed-Solomon codes beyond their joint error-correcting capability.",
            "Group divisible designs in MOLS of order ten.",
            "Lattice-based completely non-malleable public-key encryption in the standard model.",
            "Combinatorial constructions for optimal 2-D optical orthogonal codes with AM-OPPTS property.",
            "Provable certificateless generalized signcryption scheme.",
            "The relation and transformation between hierarchical inner product encryption and spatial encryption.",
            "Room squares with super-simple property.",
            "T-functions revisited: new criteria for bijectivity/transitivity.",
            "Towards factoring in $${SL(2, \\, \\mathbb{F}_{2^n})}$$.",
            "A unified approach to combinatorial key predistribution schemes for sensor networks.",
            "Long term confidentiality: a survey.",
            "Mutually orthogonal Latin squares based on general linear groups.",
            "A new class of near-optimal partial Fourier codebooks from an almost difference set.",
            "Linear spaces and transversal designs: k-anonymous combinatorial configurations for anonymous database search notes.",
            "Erratum to: Linear spaces and transversal designs: $$k$$ -anonymous combinatorial configurations for anonymous database search.",
            "Cheating detectable threshold scheme against most powerful cheaters for long secrets.",
            "A characterisation of tangent subplanes of PG(2, q 3).",
            "Editorial: Special issue on finite geometries in honor of Frank De Clerck.",
            "Remarks on polarity designs.",
            "The Kakeya problem: a gap in the spectrum and classification of the smallest examples.",
            "Maximal partial line spreads of non-singular quadrics.",
            "Coset intersection of irreducible plane cubics.",
            "The largest Erdős-Ko-Rado sets of planes in finite projective and finite classical polar spaces.",
            "Some large partial ovoids of Q-(5, q), for odd q.",
            "The non-existence of some NMDS codes and the extremal sizes of complete (n, 3)-arcs in PG(2, 16).",
            "On unitals in PG(2, q2) stabilized by a homology group.",
            "Sporadic neighbour-transitive codes in Johnson graphs.",
            "Linear groups as right multiplication groups of quasifields.",
            "Walk-regular divisible design graphs.",
            "A p-adic condition on the weight of a codeword of a linear code.",
            "Some blocking semiovals of homology type in planes of square order.",
            "The multicovering radius problem for some types of discrete structures.",
            "Relative symplectic subquadrangle hemisystems of the Hermitian surface.",
            "On the relative profiles of a linear code and a subcode.",
            "Constructing differentially 4-uniform permutations over GF(22m ) from quadratic APN permutations over GF(22m+1).",
            "Double k-sets in symplectic generalized quadrangles.",
            "Boolean functions with MacWilliams duality.",
            "Optimal conflict-avoiding codes of odd length and weight three.",
            "On the maximum size of Erdős-Ko-Rado sets in $$H(2d+1, q^2)$$.",
            "A non-cyclic triple-error-correcting BCH-like code and some minimum distance results.",
            "Relative one-weight linear codes.",
            "Combinatorial solutions providing improved security for the generalized Russian cards problem.",
            "Existence of super-simple OA $$_{\\lambda }(3, 5, v)^{\\prime }$$ s.",
            "2-Ranks of incidence matrices associated with conics in finite projective planes.",
            "Covering of subspaces by subspaces.",
            "New sets of frequency-hopping sequences with optimal Hamming correlation.",
            "$$\\mathbb{Z }_2\\mathbb{Z }_4$$ -Additive formally self-dual codes.",
            "Transitive $$\\text{ PSL}(2, 7)$$ -invariant 42-arcs in 3-dimensional projective spaces.",
            "Equations for coefficients of tactical decomposition matrices for t-designs.",
            "Stanley-Reisner resolution of constant weight linear codes.",
            "A class of 1-generator repeated root quasi-cyclic codes.",
            "Kirkman frames having hole type $$h^{u} m^{1}$$ for $$h \\equiv 0 {\\, \\, \\mathrm{mod}\\, 12}\\, $$.",
            "The weight distributions of a class of cyclic codes II.",
            "On the support designs of extremal binary doubly even self-dual codes.",
            "Proper circulant weighing matrices of weight $$p^2$$.",
            "On the sharpness of Bruen's bound for intersection sets in Desarguesian affine spaces.",
            "Codes over an infinite family of rings with a Gray map.",
            "Constructions of almost difference sets from finite fields.",
            "Kötter interpolation in skew polynomial rings.",
            "Skeleton simplicial evaluation codes.",
            "On the non-existence of maximal difference matrices of deficiency 1.",
            "1-Overlap cycles for Steiner triple systems.",
            "A systematic method of constructing Boolean functions with optimal algebraic immunity based on the generator matrix of the Reed-Muller code.",
            "The Ubiquity of the Orders of Fractional Semifields of Even Characteristic.",
            "List decoding of number field codes.",
            "A tight bound for frameproof codes viewed in terms of separating hash families.",
            "Naive configurations.",
            "The structure of quaternary quantum caps.",
            "Lexicodes over rings.",
            "Neighbour-transitive codes in Johnson graphs.",
            "A note on composed products of polynomials over finite fields.",
            "On the classification of extremal doubly even self-dual codes with 2-transitive automorphism groups.",
            "The exact values of the optimal average information ratio of perfect secret-sharing schemes for tree-based access structures.",
            "Construction of codes from Arakelov geometry.",
            "The $$k$$ -error linear complexity distribution for $$2^n$$ -periodic binary sequences.",
            "Admissible parameters of symmetric designs satisfying $$v=4(k-\\lambda )+2$$ and symmetric designs with inner balance.",
            "Revisiting key schedule's diffusion in relation with round function's diffusion.",
            "Construction of relative difference sets and Hadamard groups.",
            "On the collision and preimage security of MDC-4 in the ideal cipher model.",
            "Counting codes over rings.",
            "Low-hit-zone frequency hopping sequence sets with optimal partial Hamming correlation properties.",
            "Cryptographic puzzles and DoS resilience, revisited.",
            "Bent functions on partial spreads.",
            "New infinite families of hyperovals on $$\\mathcal H (3, q^2), q$$ H ( 3 , q 2 ) , q odd.",
            "Nonexistence of some quantum jump codes with specified parameters.",
            "New $$M$$ M -ary sequences with low autocorrelation from interleaved technique.",
            "A family of elliptic curve pseudorandom binary sequences.",
            "Erratum to: On the second weight of generalized Reed-Muller codes.",
            "Editorial: special issue on coding and cryptography.",
            "On low weight codewords of generalized affine and projective Reed-Muller codes.",
            "On the arithmetic Walsh coefficients of Boolean functions.",
            "On discrete Fourier transform, ambiguity, and Hamming-autocorrelation of pseudorandom sequences.",
            "Linear covering codes and error-correcting codes for limited-magnitude errors.",
            "PotLLL: a polynomial time version of LLL with deep insertions.",
            "New inequalities for $$q$$ q -ary constant-weight codes.",
            "Small secret exponent attack on RSA variant with modulus N=prq.",
            "On the geometry of balls in the Grassmannian and list decoding of lifted Gabidulin codes.",
            "Quantum codes from nearly self-orthogonal quaternary linear codes.",
            "Wiretap lattice codes from number fields with no small norm elements.",
            "Connections between Construction D and related constructions of lattices.",
            "On the exact number of solutions of certain linearized equations.",
            "Generation of full cycles by a composition of NLFSRs.",
            "More differentially 6-uniform power functions.",
            "Multi-trial Guruswami-Sudan decoding for generalised Reed-Solomon codes.",
            "Paillier-based publicly verifiable (non-interactive) secret sharing.",
            "List and unique error-erasure decoding of interleaved Gabidulin codes with interpolation techniques.",
            "On transform-domain error and erasure correction by Gabidulin codes.",
            "A matrix approach for constructing quadratic APN functions.",
            "A new large class of functions not APN infinitely often.",
            "On the rank of incidence matrices in projective Hjelmslev spaces.",
            "Improved algorithms for finding low-weight polynomial multiples in F2[x] and some cryptographic applications.",
            "Distinguisher-based attacks on public-key cryptosystems using Reed-Solomon codes.",
            "Towards the optimality of Feistel ciphers with substitution-permutation functions.",
            "Zero-correlation linear cryptanalysis of reduced-round LBlock.",
            "Exponents of polar codes using algebraic geometric code kernels.",
            "Projective interpolation of polynomial vectors and improved key recovery attack on SFLASH.",
            "Spatial encryption supporting non-monotone access structure.",
            "The weight distributions of some cyclic codes with three or four nonzeros over 𝔽3.",
            "Mutually disjoint t-designs and t-SEEDs from extremal doubly-even self-dual codes.",
            "A construction for t-fold perfect authentication codes with arbitration.",
            "New optimal constructions of conflict-avoiding codes of odd length and weight 3.",
            "Extremal properties of t-SEEDs and recursive constructions.",
            "Difference sets with few character values.",
            "New results and applications for multi-secret sharing schemes.",
            "Linear algebraic techniques to construct monochrome visual cryptographic schemes for general access structure and its applications to color images.",
            "Divisible difference families from Galois rings GR(4, n) and Hadamard matrices.",
            "Shorter identity-based encryption via asymmetric pairings.",
            "A construction for strength-3 covering arrays from linear feedback shift register sequences.",
            "Cameron-Liebler line classes in PG(n, 4).",
            "New binary self-dual codes of lengths 50-60.",
            "Full analysis of PRINTcipher with respect to invariant subspace attack: efficient key recovery and countermeasures.",
            "Any network code comes from an algebraic curve taking osculating spaces.",
            "Erratum to: On the support designs of extremal binary doubly even self-dual codes.",
            "Erratum to: Linear covering codes and error-correcting codes for limited-magnitude errors."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2013",
        "info": "2013: Volumes\n66,\n67,\n68,\n69",
        "count": 104,
        "papers": [
            "Editorial.",
            "Algebraic decoding of negacyclic codes over $${\\mathbb Z_4}$$.",
            "Constructive spherical codes near the Shannon bound.",
            "Non-free extensions of the simplex codes over a chain ring with four elements.",
            "New ring-linear codes from dualization in projective Hjelmslev geometries.",
            "Fast decoding of Gabidulin codes.",
            "Generalized Feistel networks revisited.",
            "CCZ and EA equivalence between mappings over finite Abelian groups.",
            "On CCZ-equivalence of addition mod 2 n.",
            "On divisibility of exponential sums of polynomials of special type over fields of characteristic 2.",
            "Characteristics of invariant weights related to code equivalence over rings.",
            "Cryptanalytic results on 'Dual CRT' and 'Common Prime' RSA.",
            "Generalization of Matsui's Algorithm 1 to linear hull for key-alternating block ciphers.",
            "Weighted Reed-Muller codes revisited.",
            "Bounding the number of points on a curve using a generalization of Weierstrass semigroups.",
            "A construction of bent functions from plateaued functions.",
            "A new construction of bent functions based on $${\\mathbb{Z}}$$ -bent functions.",
            "Quadratic functions with prescribed spectra.",
            "A complete characterization of irreducible cyclic orbit codes and their Plücker embedding.",
            "Evaluation codes from smooth quadric surfaces and twisted Segre varieties.",
            "The selfnegadual properties of generalised quadratic Boolean functions.",
            "The non-gap sequence of a subcode of a generalized Reed-Solomon code.",
            "Complete tree subset difference broadcast encryption scheme and its analysis.",
            "Three-dimensional cyclic Fire codes.",
            "On the number of lattice points in a small sphere and a recursive lattice decoding algorithm.",
            "Class of generalized Goppa codes perfect in weighted Hamming metric.",
            "Multivariate public key cryptosystems from diophantine equations.",
            "A family of quadriphase sequences of period 4(2 n - 1) with low correlation and large linear span.",
            "Difference sets over Galois rings with odd extension degrees and characteristic an even power of 2.",
            "Constructing quasi-cyclic codes from linear algebra theory.",
            "Construction of balanced Boolean functions with high nonlinearity and good autocorrelation properties.",
            "Binary codes of some strongly regular subgraphs of the McLaughlin graph.",
            "Key predistribution schemes for distributed sensor networks via block designs.",
            "Hemisystems of small flock generalized quadrangles.",
            "Obituary: Daniel R. Hughes (1927-2012).",
            "Obituary: Marialuisa J. de Resmini (1939-2012).",
            "The complexity of the graph access structures on six participants.",
            "On the affine equivalence relation between two classes of Boolean functions with optimal algebraic immunity.",
            "Moments of the support weight distribution of linear codes.",
            "Speeding up elliptic curve discrete logarithm computations with point halving.",
            "Group homomorphic encryption: characterizations, impossibility results, and applications.",
            "Further results on the existence of nested orthogonal arrays.",
            "Anonymity and one-way authentication in key exchange protocols.",
            "Simple and exact formula for minimum loop length in Ate i pairing based on Brezing-Weng curves.",
            "Mass formula and structure of self-dual codes over Z2s.",
            "On the linear complexity of binary threshold sequences derived from Fermat quotients.",
            "On the linear complexity and the autocorrelation of generalized cyclotomic binary sequences of length 2p m.",
            "Generating pairing-friendly parameters for the CM construction of genus 2 curves over prime fields.",
            "Cryptanalysis of the Stream Cipher LEX.",
            "Families of twisted tensor product codes.",
            "Neighbour transitivity on codes in Hamming graphs.",
            "Predicting masked linear pseudorandom number generators over finite fields.",
            "Editorial: Finite geometries.",
            "On large maximal partial ovoids of the parabolic quadric Q(4, q).",
            "Small tight sets of hyperbolic quadrics.",
            "A small minimal blocking set in PG(n, pt), spanning a (t-1)-space, is linear.",
            "Cameron-Liebler line classes.",
            "Permanent formulae from the Veronesean.",
            "Three families of multiple blocking sets in Desarguesian projective planes of even order.",
            "Arcs in AG(2, q) determining few directions.",
            "Transitive A 6-invariant k-arcs in PG(2, q).",
            "More translation planes and semifields from Dembowski-Ostrom polynomials.",
            "The existence of maximal (q 2, 2)-arcs in projective Hjelmslev planes over chain rings of length 2 and odd prime characteristic.",
            "Symmetric diameter two graphs with affine-type vertex-quasiprimitive automorphism group.",
            "Abelian and non-abelian Paley type group schemes.",
            "A new product construction for partial difference sets.",
            "New invariants for incidence structures.",
            "On the classification of nonsingular 2×2×2×2 hypercubes.",
            "Nonfactorizable nonsingular hypercubes.",
            "Finite semifields and nonsingular tensors.",
            "On certain forms and quadrics related to symplectic dual polar spaces in characteristic 2.",
            "The pseudo-hyperplanes and homogeneous pseudo-embeddings of the generalized quadrangles of order (3, t).",
            "Vertex opposition in spherical buildings.",
            "Local half Moufang quadrangles.",
            "Lax embeddings of the Hermitian unital.",
            "On optimal (v, 5, 2, 1) optical orthogonal codes.",
            "Codes from incidence matrices of graphs.",
            "Towards the classification of self-dual bent functions in eight variables.",
            "On the minimum length of ternary linear codes.",
            "Cryptanalysis of HFE, multi-HFE and variants for odd and even characteristic.",
            "Ternary self-orthogonal codes of dual distance three and ternary quantum codes of distance three.",
            "A new existence proof for Steiner quadruple systems.",
            "Bent and generalized bent Boolean functions.",
            "Permutation codes with specified packing radius.",
            "Simple algorithms for decoding systematic Reed-Solomon codes.",
            "Generalized Hermitian codes.",
            "The dimension of subcode-subfields of shortened generalized Reed-Solomon codes.",
            "A remark on symplectic semifield planes and Z 4-linear codes.",
            "New optimal [52, 26, 10] self-dual codes.",
            "Additive semisimple multivariable codes over $${\\mathbb{F}_4}$$.",
            "New results on variants of covering codes in Sierpiński graphs.",
            "GBRDs over supersolvable groups and solvable groups of order prime to 3.",
            "Composed products and factors of cyclotomic polynomials over finite fields.",
            "Gauss periods and codebooks from generalized cyclotomic sets of order four.",
            "A new frequency-hopping sequence set based upon generalized cyclotomy.",
            "Obituary: Hanfried Lenz (1916-2013).",
            "On a conjecture of Butler and Graham.",
            "Code constructions and existence bounds for relative generalized Hamming weight.",
            "A note on rational normal curves totally tangent to a Hermitian variety.",
            "The supertail of a subspace partition.",
            "Algebraic attacks on a class of stream ciphers with unknown output function.",
            "AES side-channel countermeasure using random tower field constructions.",
            "A new multi-linear universal hash family.",
            "Improved bounds for separating hash families."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2012",
        "info": "2012: Volumes\n62,\n63,\n64,\n65",
        "count": 116,
        "papers": [
            "Memoryless near-collisions via coding theory.",
            "On the existence of self-dual permutation codes of finite groups.",
            "New MDS self-dual codes over finite fields.",
            "Gauss periods as constructions of low complexity normal bases.",
            "Some progress on the existence of 1-rotational Steiner triple systems.",
            "Turyn type Williamson matrices up to order 99.",
            "Skew quasi-cyclic codes over Galois rings.",
            "A stability theorem for lines in Galois planes of prime order.",
            "A new class of 3-fold perfect splitting authentication codes.",
            "A generalized extension theorem for linear codes.",
            "The equivalence between optimal detecting arrays and super-simple OAs.",
            "Optimal constant weight covering codes and nonuniform group divisible 3-designs with block size four.",
            "Negacyclic self-dual codes over finite chain rings.",
            "The factorization of the permanent of a matrix with minimal rank in prime characteristic.",
            "The square root Diffie-Hellman problem.",
            "A new class of quaternary LCZ sequence sets.",
            "Constructions of covering arrays of strength five.",
            "Intersection of Hamming codes avoiding Hamming subcodes.",
            "Aspects of the Segre variety S1, 1, 1(2).",
            "Geometric and design-theoretic aspects of semibent functions II.",
            "On cyclic codes of length 22r-1 with two zeros whose dual codes have three weights.",
            "Multi-party computation with conversion of secret sharing.",
            "Nonexistence of CW(110, 100).",
            "A construction for modified generalized Hadamard matrices using QGH matrices.",
            "Fault analysis of Trivium.",
            "Asymptotic analysis on the normalized k-error linear complexity of binary sequences.",
            "Steiner triple systems satisfying the 4-vertex condition.",
            "Wei-type duality theorems for matroids.",
            "On invariant notions of Segre varieties in binary projective spaces.",
            "Using rational idempotents to show Turyn's bound is sharp.",
            "A low-memory algorithm for finding short product representations in finite groups.",
            "On the number of designs with affine parameters.",
            "A group ring construction of the [48, 24, 12] type II linear block code.",
            "The binary extremal self-dual codes of lengths 38 and 40.",
            "Pseudorandom vector sequences of maximal period generated by triangular polynomial dynamical systems.",
            "On quasi-symmetric designs with intersection difference three.",
            "On explicit factors of cyclotomic polynomials over finite fields.",
            "A note on cyclic codes over GR(p 2, m) of length p k.",
            "Cyclic codes over R k.",
            "On-line secret sharing.",
            "The characterisation of the smallest two fold blocking sets in PG(n, 2).",
            "A characterisation result on a particular class of non-weighted minihypers.",
            "Small weight codewords in the dual code of points and hyperplanes in PG(n, q), q even.",
            "Classification of self dual quadratic bent functions.",
            "Round-efficient perfectly secure message transmission scheme against general adversary.",
            "Construction of cyclotomic codebooks nearly meeting the Welch bound.",
            "Improved distinguishers for HC-128.",
            "A new table of permutation codes.",
            "On the optimization of bipartite secret sharing schemes.",
            "Affine equivalence for rotation symmetric Boolean functions with 2 k variables.",
            "MacWilliams duality and a Gleason-type theorem on self-dual bent functions.",
            "Semicyclic 4-GDDs and related two-dimensional optical orthogonal codes.",
            "Weight enumeration of codes from finite spaces.",
            "Implementing the 4-dimensional GLV method on GLS elliptic curves with j-invariant 0.",
            "Cyclic block designs with block size 3 from Skolem-type sequences.",
            "Two classes of optimal two-dimensional OOCs.",
            "Scroll codes over curves of higher genus: reducible and superstable vector bundles.",
            "Accusation probabilities in Tardos codes: beyond the Gaussian approximation.",
            "Further results on planar DO functions and commutative semifields.",
            "Divisibility of polynomials over finite fields and combinatorial applications.",
            "Preface: geometry, combinatorial designs and cryptology.",
            "Projective k-arcs and 2-level secret-sharing schemes.",
            "Singer 8-arcs of Mathon type in PG(2, 27).",
            "42-arcs in PG(2, q) left invariant by PSL(2, 7).",
            "Two forms related to the symplectic dual polar space in odd characteristic.",
            "Collineations of polar spaces with restricted displacements.",
            "A decomposition of the universal embedding space for the near polygon $${{\\mathbb H}_n}$$.",
            "An essay on self-dual generalized quadrangles.",
            "Quotients of incidence geometries.",
            "Self-dual codes from circulant matrices.",
            "New restrictions on possible orders of circulant Hadamard matrices.",
            "Irreducible pseudo 2-factor isomorphic cubic bipartite graphs.",
            "Security of message authentication codes in the presence of key-dependent messages.",
            "On the complexity of the herding attack and some related attacks on hash functions.",
            "Identity-based non-interactive key distribution with forward security.",
            "Pseudorandom number generators based on random covers for finite groups.",
            "On quasigroups with few associative triples.",
            "On the reducibility of some composite polynomials over finite fields.",
            "Construction of highly nonlinear resilient S-boxes with given degree.",
            "A geometric proof of a theorem on antiregularity of generalized quadrangles.",
            "Extremal sizes of subspace partitions.",
            "On the binary codes with parameters of triply-shortened 1-perfect codes.",
            "A counterexample concerning the 3-error linear complexity of 2 n -periodic binary sequences.",
            "On construction of involutory MDS matrices from Vandermonde Matrices in GF(2 q ).",
            "Hyperovals of Hermitian polar spaces.",
            "Preface: Geometric and algebraic combinatorics.",
            "On sets of vectors of a finite vector space in which every subset of basis size is a basis II.",
            "A Hamada type characterization of the classical geometric designs.",
            "Extremal 1-codes in distance-regular graphs of diameter 3.",
            "Distance-regular graphs with intersection arrays {52, 35, 16; 1, 4, 28} and {69, 48, 24; 1, 4, 46} do not exist.",
            "A relationship between the diameter and the intersection number c 2 for a distance-regular graph.",
            "Spectral characterization of a graph on the flags of the eleven point biplane.",
            "The graph with spectrum 141 240 (-4)10 (-6)9.",
            "On the limit points of the smallest eigenvalues of regular graphs.",
            "An excess theorem for spherical 2-designs.",
            "Nomura algebras of nonsymmetric Hadamard models.",
            "The generating rank of the space of short vectors in the Leech lattice mod 2.",
            "Symplectic polarities of buildings of type E 6.",
            "The pseudo-hyperplanes and homogeneous pseudo-embeddings of AG(n, 4) and PG(n, 4).",
            "Planes in which every quadrangle lies on a unique Baer subplane.",
            "Preface: Richard M. Wilson, Special issue honoring his 65th birthday.",
            "A note on marking lines in [k] n - In honor of Rick Wilson's 65th birthday.",
            "A lemma on binomial coefficients and applications to Lee weights modulo 2 e of codes over $${\\mathbb{Z}_4}$$.",
            "On the chromatic number of q-Kneser graphs.",
            "Trails of triples in partial triple systems.",
            "Coding with injections.",
            "The maximum order of adjacency matrices of graphs with a given rank.",
            "The de Bruijn-Erdős theorem for hypergraphs.",
            "Pseudocyclic and non-amorphic fusion schemes of the cyclotomic association schemes.",
            "Eigenvalues and expansion of bipartite graphs.",
            "Proof of a conjecture of Segre and Bartocci on monomial hyperovals in projective planes.",
            "On theorems of Delsarte-McEliece and Chevalley-Warning-Ax-Katz.",
            "Constructions for retransmission permutation arrays.",
            "Forbidden configurations and Steiner designs.",
            "Studying designs via multisets.",
            "Boolean autoencoders and hypercube clustering complexity."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2011",
        "info": "2011: Volumes\n58,\n59,\n60,\n61",
        "count": 90,
        "papers": [
            "An equivalence of Ward's bound and its application.",
            "Generalized oblivious transfer by secret sharing.",
            "Quaternary 1-generator quasi-cyclic codes.",
            "Computing bilinear pairings on elliptic curves with automorphisms.",
            "On Lai-Massey and quasi-Feistel ciphers.",
            "The cocyclic Hadamard matrices of order less than 40.",
            "New results on optimal (v, 4, 2, 1) optical orthogonal codes.",
            "Quasi-symmetric designs with the difference of block intersection numbers two.",
            "Primitive polynomials, singer cycles and word-oriented linear feedback shift registers.",
            "Optimal difference systems of sets and partition-type cyclic difference packings.",
            "An invariant for matrices and sets of points in prime characteristic.",
            "Redundant τ-adic expansions I: non-adjacent digit sets and their applications to scalar multiplication.",
            "Hadamard matrices of order 32 and extremal ternary self-dual codes.",
            "A condition for arcs and MDS codes.",
            "Erratum to: A variant of Digital Signature Algorithm.",
            "Cyclic codes over F2+uF2+vF2+uvF2.",
            "Inner-product encryption under standard assumptions.",
            "On EA-equivalence of certain permutations to power mappings.",
            "A trade-off between collision probability and key size in universal hashing using polynomials.",
            "On the k-error linear complexity of sequences with period 2pn over GF(q).",
            "Improved hidden vector encryption with short ciphertexts and tokens.",
            "Completely reducible super-simple designs with block size four and related super-simple packings.",
            "Editorial.",
            "Accurate estimates of the data complexity and success probability for various cryptanalyses.",
            "On unbalanced Feistel networks with contracting MDS diffusion.",
            "Correlation of the two-prime Sidel'nikov sequence.",
            "CCZ-equivalence of bent vectorial functions and related constructions.",
            "Relating three nonlinearity parameters of vectorial functions and building APN functions from bent functions.",
            "A family of constacyclic ternary quasi-perfect codes with covering radius 3.",
            "Directed graph representation of half-rate additive codes over GF(4).",
            "Quaternary Golay sequence pairs I: even length.",
            "Quaternary Golay sequence pairs II: odd length.",
            "Critique of the related-key attack concept.",
            "How (Not) to design strong-RSA signatures.",
            "Lower bounds on the size of spheres of permutations under the Chebychev distance.",
            "Counting all bent functions in dimension eight 99270589265934370305785861242880.",
            "Bounds on the degree of APN polynomials: the case of x-1 + g(x).",
            "On zeros of Kloosterman sums.",
            "Some observations on HC-128.",
            "Classification and generation of disturbance vectors for collision attacks against SHA-1.",
            "A new class of bent and hyper-bent Boolean functions in polynomial forms.",
            "Two optimal one-error-correcting codes of length 13 that are not doubly shortened perfect codes.",
            "A class of authentication codes with secrecy.",
            "Association schemes arising from bent functions.",
            "On the correlation distribution of Delsarte-Goethals sequences.",
            "Sparse Boolean equations and circuit lattices.",
            "A conjecture about binary strings and its applications on constructing Boolean functions with optimal algebraic immunity.",
            "Notions and relations for RKA-secure permutation and function families.",
            "A pair of disjoint 3-GDDs of type gtu1.",
            "Comments on Harn-Lin's cheating detection scheme.",
            "Structural properties and enumeration of 1-generator generalized quasi-cyclic codes.",
            "On binary linear r-identifying codes.",
            "A family of non class-regular symmetric transversal designs of spread type.",
            "Cubic and higher degree bounds for codes and (t, m, s)-nets.",
            "The (related-key) impossible boomerang attack and its application to the AES block cipher.",
            "New designs of frequency hopping sequences with low hit zone.",
            "A recursive construction of nonbinary de Bruijn sequences.",
            "An alternative class of irreducible polynomials for optimal extension fields.",
            "Minimal logarithmic signatures for classical groups.",
            "Non-Existence of isomorphisms between certain unitals.",
            "Exact point-distributions over the complex sphere.",
            "Designs having the parameters of projective and affine spaces.",
            "Generalized modified Gold sequences.",
            "Fully collusion-resistant traitor tracing scheme with shorter ciphertexts.",
            "A generalization of a result of Dembowski and Wagner.",
            "A new class of splitting 3-designs.",
            "On Lagrangian-Grassmannian codes.",
            "Decoding permutation arrays with ternary vectors.",
            "Towards the classification of rank 2 semifields 6-dimensional over their center.",
            "Maximum distance separable codes over Z4 and Z2 ×\\mathbbZ4.",
            "Some cyclic codes of length 2pn.",
            "On the distribution of the coefficients of normal forms for Frobenius expansions.",
            "Semi-Pappus configurations; combinatorial generalizations of the Pappus configuration.",
            "An application of coding theory to estimating Davenport constants.",
            "Further results on support weights of certain subcodes.",
            "The non-existence of Griesmer codes with parameters close to codes of Belov type.",
            "Binary formally self-dual odd codes.",
            "List decodability at small radii.",
            "Optimal complexity of secret sharing schemes with four minimal qualified subsets.",
            "Commutative semifields from projection mappings.",
            "Fractional dimensions in semifields of odd order.",
            "A general method for construction of (t, n)-threshold visual secret sharing schemes for color images.",
            "About computation of the linear complexity of generalized cyclotomic sequences with period pn+1.",
            "On the equivalence of quadratic APN functions.",
            "Swan-like results for binomials and trinomials over finite fields of odd characteristic.",
            "Existence of GBRDs with block size 4 and BRDs with block size 5.",
            "Irreducible compositions of polynomials over finite fields.",
            "On weight distributions of perfect colorings and completely regular codes.",
            "The linear span of the frequency hopping sequences in optimal sets.",
            "Hamilton cycles in restricted block-intersection graphs."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2010",
        "info": "2010: Volumes\n54,\n55,\n56,\n57",
        "count": 88,
        "papers": [
            "The classical 1-system of Q-(7, q) and two-character sets.",
            "Notes on the value function.",
            "A special class of T-matrices.",
            "Security analysis of word problem-based cryptosystems.",
            "On constructions for optimal two-dimensional optical orthogonal codes.",
            "Linear codes over F2+uF2+vF2+uvF2.",
            "On the number of distinct elliptic curves in some families.",
            "The maximum size of a partial 3-spread in a finite vector space over GF(2).",
            "Equidistant frequency permutation arrays and related constant composition codes.",
            "Efficient discrete logarithm based multi-signature scheme in the plain public key model.",
            "A study of (x(q + 1), x; 2, q)-minihypers.",
            "Generalized Reed-Muller codes over Zq.",
            "Z2Z4-linear codes: generator matrices and duality.",
            "Parameter choices and a better bound on the list size in the Guruswami-Sudan algorithm for algebraic geometry codes.",
            "New semifields, PN and APN functions.",
            "A new Yang number and consequences.",
            "Efficient hybrid encryption from ID-based encryption.",
            "Twisted Fano spaces and their classification, linear completions of systems of triangle perspectives.",
            "Linear codes with covering radius 3.",
            "Minimal codewords in Reed-Muller codes.",
            "Some low-density parity-check codes derived from finite geometries.",
            "New results on large sets of Kirkman triple systems.",
            "Polarities and unitals in the Coulter-Matthews planes.",
            "Optimal (k, n) visual cryptographic schemes for general k.",
            "The group fixing a completely regular line-oval.",
            "More efficient DDH pseudorandom generators.",
            "Expected values for the rational complexity of finite binary sequences.",
            "Existence of resolvable H-designs with group sizes 2, 3, 4 and 6.",
            "Special issue dedicated to Spyros Magliveras on the occasion of his 70th birthday.",
            "A spectrum result on minimal blocking sets with respect to the planes of PG(3, q), q odd.",
            "A characterization of the Grassmann embedding of H(q), with q even.",
            "The number of designs with geometric parameters grows exponentially.",
            "Comparing two pairing-based aggregate signature schemes.",
            "Practical unconditionally secure two-channel message authentication.",
            "A note on the security of MST3.",
            "Covering arrays from cyclotomy.",
            "Adjacency matrices of polarity graphs and of other C4-free graphs of large size.",
            "Block-transitive designs in affine spaces.",
            "Minimal logarithmic signatures for finite groups of Lie type.",
            "Enumeration of orthogonal Buekenhout unitals.",
            "Infinite family of large complete arcs in PG(2, qn), with q odd and n > 1 odd.",
            "Enclosings of lambda-fold 4-cycle systems.",
            "Further progress on difference families with block size 4 or 5.",
            "Modified generalized Hadamard matrices and constructions for transversal designs.",
            "Short cycles in repeated exponentiation modulo a prime.",
            "Z2Z4linear codes: rank and kernel.",
            "Reduction for primitive flag-transitive (v, k, 4)-symmetric designs.",
            "NTRU over rings beyond \\mathbbZ{\\mathbb{Z}}.",
            "On Lander's conjecture for difference sets whose order is a power of 2 or 3.",
            "Galois geometries and applications.",
            "In memoriam, András Gács.",
            "On linear sets on a projective line.",
            "Some two-character sets.",
            "Ovoidal blocking sets and maximal partial ovoids of Hermitian varieties.",
            "On some open problems on maximal curves.",
            "Whirlwind: a new cryptographic hash function.",
            "On multiple caps in finite projective spaces.",
            "Multiple blocking sets and multisets in Desarguesian planes.",
            "On hyperovals of polar spaces.",
            "Notes on APN functions, semibiplanes and dimensional dual hyperovals.",
            "The small weight codewords of the functional codes associated to non-singular Hermitian varieties.",
            "Small point sets of PG(n, q3) intersecting each k-subspace in 1 mod q points.",
            "A tight asymptotic bound on the size of constant-weight conflict-avoiding codes.",
            "On incidence structures of nonsingular points and hyperbolic lines of ovoids in finite orthogonal spaces.",
            "On quadratic APN functions and dimensional dual hyperovals.",
            "On uniformly resolvable designs with block sizes 3 and 4.",
            "Codes with girth 8 Tanner graph representation.",
            "A note on the reducibility of binary affine polynomials.",
            "Designs associated with maximum independent sets of a graph.",
            "AG codes from vector bundles.",
            "Alternating groups and flag-transitive triplanes.",
            "Weight distribution moments of random linear/coset codes.",
            "Anonymity in shared symmetric key primitives.",
            "On the minimum distance graph of an extended Preparata code.",
            "New bounds for codes over finite Frobenius rings.",
            "On the binary codes with parameters of doubly-shortened 1-perfect codes.",
            "Minimum distance of Hermitian two-point codes.",
            "Optimal and perfect difference systems of sets from q-ary sequences with difference-balanced property.",
            "H-designs with the properties of resolvability or (1, 2)-resolvability.",
            "Some results concerning cryptographically significant mappings over GF(2n).",
            "On extended algebraic immunity.",
            "On the security of the Feng-Liao-Yang Boolean functions with optimal algebraic immunity against fast algebraic attacks.",
            "The cost of false alarms in Hellman and rainbow tradeoffs.",
            "Self-dual codes with automorphism of order 3 having 8 cycles.",
            "On the intersection of a Hermitian curve with a conic.",
            "Permutations of finite fields for check digit systems.",
            "Geometric and design-theoretic aspects of semibent functions I.",
            "Existence of directed BIBDs with block size 7 and related perfect 5-deletion-correcting codes of length 7."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2009",
        "info": "2009: Volumes\n50,\n51,\n52,\n53",
        "count": 91,
        "papers": [
            "The second generalized Hamming weight for two-point codes on a Hermitian curve.",
            "Characterizations of Hermitian varieties by intersection numbers.",
            "A class of optimal constant composition codes from GDRPs.",
            "MDS codes over finite principal ideal rings.",
            "Some results on skew Hadamard difference sets.",
            "The existence of generalized mix functions.",
            "A variant of Boneh-Franklin IBE with a tight reduction in the random oracle model.",
            "Codes defined by forms of degree 2 on non-degenerate Hermitian varieties in \\mathbbP4(\\mathbbFq){\\mathbb{P}^{4}(\\mathbb{F}_q)}.",
            "Modular independence and generator matrices for codes over \\mathbb Zm{\\mathbb {Z}_m}.",
            "Johnson type bounds on constant dimension codes.",
            "Generalized MacWilliams identities and their applications to perfect binary codes.",
            "Tight sets, weighted m -covers, weighted m -ovoids, and minihypers.",
            "On self-orthogonal group ring codes.",
            "The alignment problem of visual cryptography schemes.",
            "A simple derivation of the MacWilliams identity for linear ordered codes and orthogonal arrays.",
            "A family of crooked functions.",
            "Maximal values of generalized algebraic immunity.",
            "Uniqueness of some cyclic projective planes.",
            "Skew codes of prescribed distance or rank.",
            "A two-to-one map and abelian affine difference sets.",
            "The number of self-dual codes over Zp3{Z_{p^3}}.",
            "Computing pairings using x -coordinates only.",
            "Provable security of block ciphers against linear cryptanalysis: a mission impossible?",
            "Covering arrays of strength 3 and 4 from holey difference matrices.",
            "Efficient p th root computations in finite fields of characteristic p.",
            "Complete ( q 2 + q + 8)/2-caps in the spaces PG (3, q ), q = 2 (mod 3) an odd prime, and a complete 20-cap in PG (3, 5).",
            "A note on the crosscorrelation of maximal length FCSR sequences.",
            "A class of optimal linear codes of length one above the Griesmer bound.",
            "On tight projective designs.",
            "Remarks on a cyclotomic sequence.",
            "103-configurations and projective realizability of multiplied configurations.",
            "Independence of vectors in codes over rings.",
            "The nonexistence of near-extremal formally self-dual codes.",
            "Existence of (2, 8) GWhD( v ) and (4, 8) GWhD( v ) with v .0, 1 (mod 8){v \\equiv 0, 1 (mod 8)}.",
            "A variant of Digital Signature Algorithm.",
            "2-(31, 15, 7), 2-(35, 17, 8) and 2-(36, 15, 6) designs with automorphisms of odd prime order, and their related Hadamard matrices and codes.",
            "Some constructions on the Hermitian surface.",
            "Polarities, quasi-symmetric designs, and Hamada's conjecture.",
            "The cubic Segre variety in PG(5, 2).",
            "A hemisystem of a nonclassical generalised quadrangle.",
            "Upper bounds for parent-identifying set systems.",
            "Difference sets with n = 5  p  r .",
            "Efficient RFID authentication protocols based on pseudorandom sequence generators.",
            "Some designs and codes invariant under the groups S 9 and A 8.",
            "On orthogonal generalized equitable rectangles.",
            "Gold codes, Hadamard partitions and the security of CDMA systems.",
            "Multilevel and multidimensional Hadamard matrices.",
            "Strong difference families, difference covers, and their applications for relative difference families.",
            "Polynomial techniques for investigation of spherical designs.",
            "An intrinsical description of group codes.",
            "Finite field elements of high order arising from modular curves.",
            "Establishing the broadcast efficiency of the Subset Difference Revocation Scheme.",
            "Ideal secret sharing schemes whose minimal qualified subsets have at most three participants.",
            "Detection and identification of cheaters in ( t , n ) secret sharing scheme.",
            "Linear hash families and forbidden configurations.",
            "On circulant self-dual codes over small fields.",
            "A generalization of Meshulam's theorem on subsets of finite abelian groups with no 3-term arithmetic progression.",
            "Indivisible plexes in latin squares.",
            "Optimal grid holey packings with block size 3 and 4.",
            "There exists no self-dual [24, 12, 10] code over \\mathbb F5{{\\mathbb F}_5}.",
            "On proper secrets, ( t , k )-bases and linear codes.",
            "Enumerating and decoding perfect linear Lee codes.",
            "Paley type partial difference sets in non p-groups.",
            "A new extension theorem for 3-weight modulo q linear codes over Fq.",
            "Unbalanced digit sets and the closest choice strategy for minimal weight integer representations.",
            "Weighted codes in Lee metrics.",
            "On the relations between non-interactive key distribution, identity-based encryption and trapdoor discrete log groups.",
            "Pure partial planes of order 6 with 25 lines.",
            "Linearity properties of binary FCSR sequences.",
            "The subconstituent algebra of strongly regular graphs associated with a Latin square.",
            "Optimal conflict-avoiding codes of length n = 0 (mod 16) and weight 3.",
            "An application of the O'Nan-Scott theorem to the group generated by the round functions of an AES-like cipher.",
            "Further properties of several classes of Boolean functions with optimum algebraic immunity.",
            "An improvement of discrete Tardos fingerprinting codes.",
            "A generalized Gleason-Pierce-Ward theorem.",
            "The Diffie-Hellman problem and generalization of Verheul's theorem.",
            "Special subsets of difference sets with particular emphasis on skew Hadamard difference sets.",
            "Unitary designs and codes.",
            "On improved asymptotic bounds for codes from global function fields.",
            "Combinatorial generalizations of generalized quadrangles of order (2, 2).",
            "On the maximality of linear codes.",
            "Necessary and sufficient conditions for the existence of a class of partitions of a finite vector space.",
            "Characterization of 2n-periodic binary sequences with fixed 2-error or 3-error linear complexity.",
            "On algebras admitting a complete set of near weights, evaluation codes, and Goppa codes.",
            "On numerical semigroups and the redundancy of improved codes correcting generic errors.",
            "Multiple blocking sets in finite projective spaces and improvements to the Griesmer bound for linear codes.",
            "A new optimal quaternary sequence family of length 2(2n - 1) obtained from the orthogonal transformation of Families B and C.",
            "Wieferich pairs and Barker sequences.",
            "On maximal curves with Frobenius dimension 3.",
            "Commitment and authentication systems.",
            "An impossibility result on graph secret sharing."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2008",
        "info": "2008: Volumes\n46,\n47,\n48,\n49",
        "count": 100,
        "papers": [
            "Existence of (v, K1(3) union {w*})-PBDs and its applications.",
            "Probabilistic algorithm for finding roots of linearized polynomials.",
            "Small weight codewords in the codes arising from Desarguesian projective planes.",
            "On perfect p-ary codes of length p+1.",
            "Reducing the calculation of the linear complexity of u 2 v -periodic binary sequences to Games-Chan algorithm.",
            "A coding problem in steganography.",
            "G-Perfect nonlinear functions.",
            "Explicit constructions for perfect hash families.",
            "Codebooks from almost difference sets.",
            "mth -Root subgeometry partitions.",
            "Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes.",
            "Elliptic near-MDS codes over F5.",
            "Designs from subcode supports of linear codes.",
            "The covering radius of extreme binary 2-surjective codes.",
            "On the Ree Unital.",
            "Generalized balanced tournament designs and related codes.",
            "The geometry of some two-character sets.",
            "Maximal caps in AG (6, 3).",
            "On the intersection of two subgeometries of PG ( n , q ).",
            "Crooked binomials.",
            "Homogeneous factorisations of Johnson graphs.",
            "Obtaining a secure and efficient key agreement protocol from (H)MQV and NAXOS.",
            "Williamson matrices up to order 59.",
            "Cryptographic properties of nonlinear pseudorandom number generators.",
            "New negative Latin square type partial difference sets in nonelementary abelian 2-groups and 3-groups.",
            "Finite geometries.",
            "Non-isomorphic semipartial geometries.",
            "Divisible designs from twisted dual numbers.",
            "Partial ovoids and partial spreads in hermitian polar spaces.",
            "The combinatorial properties of the hyperplanes of DW (5, q) arising from embedding.",
            "Regular partitions of (weak) finite generalized polygons.",
            "A 51-dimensional embedding of the Ree-Tits generalized octagon.",
            "Classification of line-transitive point-imprimitive linear spaces with line size at most 12.",
            "Coprimitive sets and inextendable codes.",
            "Sequences in abelian groups G of odd order without zero-sum subsequences of length exp ( G ).",
            "On cyclic caps in 4-dimensional projective spaces.",
            "On the geometry of the exceptional group G 2( q ), q even.",
            "On the graph of a function in many variables over a finite field.",
            "A characterization of quadrics by intersection numbers.",
            "On automorphism groups of certain Goppa codes.",
            "Twisted tensor product codes.",
            "A generalized quadrangle of order (s, t) with center of transitivity is an elation quadrangle if s <= t.",
            "Two results on maximum nonlinear functions.",
            "Generalized quadrangles admitting a sharply transitive Heisenberg group.",
            "On the Phan system of the Schur cover of SU(4, 32).",
            "Generalized hexagons and Singer geometries.",
            "Random constructions and density results.",
            "Examples of rank 3 product action transitive decompositions.",
            "Ring geometries, two-weight codes, and strongly regular graphs.",
            "On the existence of nearly Kirkman triple systems with subsystems.",
            "Another construction for large sets of Kirkman triple systems.",
            "On self-dual codes over F5.",
            "2-idempotent 3-quasigroups with a conjugate invariant subgroup consisting of a single cycle of length four.",
            "On vector space partitions and uniformly resolvable designs.",
            "Improved versions of Tardos' fingerprinting scheme.",
            "Note on the existence of translation nets.",
            "Preface.",
            "The relative generalized Hamming weight of linear q -ary codes and their subcodes.",
            "Undetected error probability of q -ary constant weight codes.",
            "Binary permutation sequences as subsets of Levenshtein codes, spectral null codes, run-length limited codes and constant weight codes.",
            "Binary self-dual codes with automorphisms of order 23.",
            "On the minimum size of binary codes with length 2 R + 4 and covering radius R.",
            "Attacks and counter-attacks on the GPT public key cryptosystem.",
            "From graph states to two-graph states.",
            "Sets of disjoint snakes based on a Reed-Muller code and covering the hypercube.",
            "On the code generated by the incidence matrix of points and hyperplanes in PG(n, q) and its dual.",
            "Maximum distance separable poset codes.",
            "Further translation planes of order 192 admitting SL(2, 5), obtained by nest replacement.",
            "Attacks on the RC4 stream cipher.",
            "On orthogonal resolutions of the classical Steiner quadruple system SQS(16).",
            "A synthetic indifferentiability analysis of some block-cipher-based hash functions.",
            "Distorting symmetric designs.",
            "On the second weight of generalized Reed-Muller codes.",
            "Some combinatorial constructions for optimal perfect deletion-correcting codes.",
            "Editorial: In memory of Hans Dobbertin.",
            "Bent functions embedded into the recursive framework of ℤ-bent functions.",
            "More DD difference sets.",
            "Periodic multisequences with large error linear complexity.",
            "On solving sparse algebraic equations over finite fields.",
            "Systematic authentication codes using additive polynomials.",
            "Bundles, presemifields and nonlinear functions.",
            "Idempotents in the neighbourhood of Patterson-Wiedemann functions having Walsh spectra zeros.",
            "Error and erasure correcting algorithms for rank codes.",
            "On non-negligible bias of the first output byte of RC4 towards the first three bytes of the secret key.",
            "Skew Hadamard designs and their codes.",
            "Solving Multiple Right Hand Sides linear equations.",
            "Edge local complementation and equivalence of binary linear codes.",
            "Extractors for binary elliptic curves.",
            "Characterization results on arbitrary non-weighted minihypers and on linear codes meeting the Griesmer bound.",
            "The trace of an optimal normal element and low complexity normal bases.",
            "Error detection and error correction procedures for the advanced encryption standard.",
            "Efficient public key encryption with smallest ciphertext expansion from factoring.",
            "Composition of recursions and nonlinear complexity of periodic binary sequences.",
            "A family of ternary quasi-perfect BCH codes.",
            "On the classification of APN functions up to dimension five.",
            "Semantic security for the McEliece cryptosystem without random oracles.",
            "Flat tori, lattices and bounds for commutative group codes.",
            "An improved list decoding algorithm for the second order Reed-Muller codes and its applications.",
            "On Boolean functions with the sum of every two of them being bent.",
            "On binary Kloosterman sums divisible by 3."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2007",
        "info": "2007: Volumes\n42,\n43,\n44,\n45",
        "count": 95,
        "papers": [
            "Lifting of divisible designs.",
            "A result on the weight distributions of binary quadratic residue codes.",
            "The design of composite permutations with applications to DES-like S-boxes.",
            "On binary signed digit representations of integers.",
            "Improved lower bounds on sizes of single-error correcting codes.",
            "Small weight codewords in LDPC codes defined by (dual) classical generalized quadrangles.",
            "Extremal self-dual codes of length 64 through neighbors and covering radii.",
            "Veronese embedding and two-character sets.",
            "Certificateless signature: a new security model and an improved generic construction.",
            "A direct approach to linear programming bounds for codes and tms-nets.",
            "Quasi-affine symmetric designs.",
            "Reed-Muller codes and Barnes-Wall lattices: Generalized multilevel constructions and representation over GF(2q).",
            "Remarks on the k-error linear complexity of pn-periodic sequences.",
            "Sliding-window dynamic frameproof codes.",
            "Symplectic spread-based generalized Kerdock codes.",
            "Construction of deletion correcting codes using generalized Reed-Solomon codes and their subcodes.",
            "Efficient pairing computation on supersingular Abelian varieties.",
            "Cyclic codes over the rings Z2+uZ2 and Z2+uZ2 + u2Z2.",
            "The linear programming bound for codes over finite Frobenius rings.",
            "LDPC codes from the Hermitian curve.",
            "Sequential and dynamic frameproof codes.",
            "New classes of 2-weight cyclic codes.",
            "Maximal partial packings of Z2n with perfect codes.",
            "Constructions of intriguing sets of polar spaces from field reduction and derivation.",
            "The characterization of binary constant weight codes meeting the bound of Fu and Shen.",
            "Classification of (0, 2)-geometries embedded in AG (3, q).",
            "On 2-(n2, 2n, 2n-1) designs with three intersection numbers.",
            "Divisible designs with dual translation group.",
            "Low-density attack revisited.",
            "Cryptanalyzing the polynomial-reconstruction based public-key system under optimal parameter choice.",
            "There are no Barker arrays having more than two dimensions.",
            "A geometric approach to finding new lower bounds of A(n, d, w).",
            "Butson Hadamard matrices with partially cyclic core.",
            "On the structure of 1-designs with at most two block intersection numbers.",
            "A construction for large sets of disjoint Kirkman triple systems.",
            "On the minimum length of some linear codes.",
            "Algebraic-geometry codes, one-point codes, and evaluation codes.",
            "Weights modulo p  e  of linear codes over rings.",
            "Projective aspects of the AES inversion.",
            "Preface.",
            "The uniqueness of 1-systems of W 5( q ) satisfying the BLT-property, with q odd.",
            "A design and a geometry for the group Fi 22.",
            "Mixed partitions and related designs.",
            "A translation plane of order 192 admitting SL(2, 5), obtained by 12-nest replacement.",
            "A characterization of truncated projective geometries as flag-transitive PG *. PG -geometries.",
            "Simplectic spreads and finite semifields.",
            "Pseudo-Paley graphs and skew Hadamard difference sets from presemifields.",
            "On the Hughes-Kleinfeld and Knuth's semifields two-dimensional over a weak nucleus.",
            "Translation planes of order q2 admitting a two-transitive orbit of length q+1 on the line at infinity.",
            "On the nonexistence of certain Hughes generalized quadrangles.",
            "Blocking Sets in PG(r, qn).",
            "The flag-transitive symmetric designs with 45 points, blocks of size 12, and 3 blocks on every point pair.",
            "A lower bound for the minimum weight of the dual 7-ary code of a projective plane of order 49.",
            "On solvable minimally transitive permutation groups.",
            "A rank six geometry related to the McLaughlin sporadic simple group.",
            "Duals of quasi-3 designs are not necessarily quasi-3.",
            "A geometric approach to classifying Griesmer codes.",
            "Characterization results on small blocking sets of the polar spaces Q +(2 n + 1, 2) and Q +(2 n + 1, 3).",
            "Golay complementary array pairs.",
            "Finite structures with prescribed numbers of orbits of their automorphism group.",
            "What is a design? How should we classify them?",
            "A nearfield-free definition of regular Hughes planes and some embeddings of PG(3, q) in Hughes planes of order q 4.",
            "ID-based cryptography using symmetric primitives.",
            "Simple 3-designs and PSL(2, q) with q == 1 (mod 4).",
            "Planar polynomials for commutative semifields with specified nuclei.",
            "A partial plane of order 6 constructed from the icosahedron.",
            "On 3-chromatic distance-regular graphs.",
            "Abelian difference sets of order n dividing lambda.",
            "Division of trinomials by pentanomials and orthogonal arrays.",
            "Parallel Itoh-Tsujii multiplicative inversion algorithm for a special class of trinomials.",
            "Constructions for large sets of L -intersecting Steiner triple systems.",
            "G -projectable and Lambda-projectable binary linear block codes.",
            "On optimal codes with w-identifiable parent property.",
            "New lower bounds for multiple coverings.",
            "A sequence approach to linear perfect hash families.",
            "A weighted version of a result of Hamada on minihypers and on linear codes meeting the Griesmer bound.",
            "Existence of Z-cyclic 3PDTWh(p) for Prime p == 1 (mod 4).",
            "Kirkman frames having hole type hu m1 for small h.",
            "Constructions for generalized Steiner systems GS (3, 4, v , 2).",
            "Inferring sequences produced by a linear congruential generator on elliptic curves missing high-order bits.",
            "A search algorithm for linear codes: progressive dimension growth.",
            "On repeated-root multivariable codes over a finite chain ring.",
            "The psi-associate X# of a flat X in PG(n , 2).",
            "Construction of MDS self-dual codes over Galois rings.",
            "On the number of pairwise non-isomorphic minimal blocking sets in PG(2, q).",
            "Errata for \"The linear programming bound for codes over finite Frobenius rings\".",
            "On tau-adic representations of integers.",
            "Constructions and bounds on linear error-block codes.",
            "Towards generating secure keys for braid cryptography.",
            "On binary self-dual codes of lengths 60, 62, 64 and 66 having an automorphism of order 9.",
            "Generalized mix functions and orthogonal equitable rectangles.",
            "Codes from curves with total inflection points.",
            "Scroll codes.",
            "Necessary and sufficient conditions for tight equi-difference conflict-avoiding codes of weight three.",
            "A new class of optimal 3-splitting authentication codes."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2006",
        "info": "2006: Volumes\n38,\n39,\n40,\n41",
        "count": 101,
        "papers": [
            "Self-Orthogonal 3-(56, 12, 65) Designs and Extremal Doubly-Even Self-Dual Codes of Length 56.",
            "Linear Codes over Fq[u]/(us) with Respect to the Rosenbloom-Tsfasman Metric.",
            "(6, 3)-MDS Codes over an Alphabet of Size 4.",
            "Index Calculation Attacks on RSA Signature and Encryption.",
            "The Two-Point Codes on a Hermitian Curve with the Designed Minimum Distance.",
            "Asymptotic Determination of the Last Packing Number of Quadruples.",
            "Higher Weights for Ternary and Quaternary Self-Dual Codes*.",
            "Sublines of Prime Order Contained in the Set of Internal Points of a Conic.",
            "A Full Rank Perfect Code of Length 31.",
            "On Ovoids of Parabolic Quadrics.",
            "The Round Functions of Cryptosystem PGM Generate the Symmetric Group.",
            "Some Notes on the Linear Complexity of Sidel'nikov-Lempel-Cohn-Eastman Sequences.",
            "Distance-Regular (0, alpha)-Reguli.",
            "A Characterization of the Complement of a Hyperbolic Quadric in PG (3, q), for q Odd.",
            "Generating More MNT Elliptic Curves.",
            "Cheating in Visual Cryptography.",
            "A Fuzzy Vault Scheme.",
            "Some Observations on the Theory of Cryptographic Hash Functions.",
            "A New Characterization of Semi-bent and Bent Functions on Finite Fields*.",
            "Exponentially Many Hadamard Designs.",
            "Quasi-Cyclic Codes from a Finite Affine Plane.",
            "A Generalization of Niho's Theorem.",
            "On the Algebraic Structure of Quasi-cyclic Codes IV: Repeated Roots.",
            "Co-Orthogonal Codes.",
            "A New Class of Optimal 3-splitting Authentication Codes.",
            "A Low-Memory Algorithm for Point Counting on Picard Curves.",
            "Self-Reciprocal Irreducible Pentanomials Over F2.",
            "Communication-Computation Trade-off in Executing ECDSA in a Contactless Smartcard.",
            "Subregular Spreads of Hermitian Unitals.",
            "Classification and Constructions of Complete Caps in Binary Spaces.",
            "The Automorphism Group of Plane Algebraic Curves with Singer Automorphisms.",
            "Existence of Z-cyclic 3PTWh (p) for any Prime p congruent 1 (mod 4).",
            "On Relative Difference Sets in Dihedral Groups.",
            "Codes Over the p-adic Integers.",
            "Generalized Quadrangles with an Abelian Singer Group.",
            "Sharing Multiple Secrets: Models, Schemes and Analysis.",
            "On RSA Moduli with Prescribed Bit Patterns.",
            "Cyclic Codes Over Z4 of Even Length.",
            "On the Linear Complexity Profile of Nonlinear Congruential Pseudorandom Number Generators with Dickson Polynomials.",
            "Codes with a Certain Weight-preserving Transitive Group of Automorphisms.",
            "Super-simple (nu, 5, 5) Designs.",
            "Trading Inversions for Multiplications in Elliptic Curve Cryptography.",
            "A-Codes from Rational Functions over Galois Rings.",
            "Improvements on Generalized Hamming Weights of Some Trace Codes.",
            "Luby-Rackoff Revisited: On the Use of Permutations as Inner Functions of a Feistel Scheme.",
            "A Series of Regular Hadamard Matrices.",
            "Speeding up Exponentiation using an Untrusted Computational Resource.",
            "Efficient Computation of Roots in Finite Fields.",
            "A Geometric Construction of the Hyperbolic Fibrations Associated with a Flock, q Even.",
            "The Polynomial Degree of the GrassmannianG1, n, 2.",
            "Erratum for \"A Family of Complete Caps in PG(n, 2)\".",
            "The Complete Determination of the Minimum Distance of Two-Point Codes on a Hermitian Curve.",
            "On the Number of Optimal Base 2 Representations of Integers.",
            "Basic Theory in Construction of Boolean Functions with Maximum Possible Annihilator Immunity.",
            "Asymptotic Nonlinearity of Boolean Functions.",
            "Authentication Schemes from Highly Nonlinear Functions.",
            "Basic Properties of the (t, n)-Threshold Visual Secret Sharing Scheme with Perfect Reconstruction of Black Pixels.",
            "Distributed Ring Signatures from General Dual Access Structures.",
            "Latin Squares without Orthogonal Mates.",
            "The Existence of Latin Squares without Orthogonal Mates.",
            "On the Construction of Permutation Arrays via Mappings from Binary Vectors to Permutations.",
            "A Construction of Optimal Constant Composition Codes.",
            "Constructions of External Difference Families and Disjoint Difference Families.",
            "There are 1239 Steiner Triple Systems STS(31) of 2-rank 27.",
            "Generalised Cumulative Arrays in Secret Sharing.",
            "The Existence of (nu, 6, lambda)-Perfect Mendelsohn Designs with lambda > 1.",
            "A Flaw in the Use of Minimal Defining Sets for Secret Sharing Schemes.",
            "Error Probabilities for Bounded Distance Decoding.",
            "Optimal (2, n) visual cryptographic schemes.",
            "The number of transversals in a Latin square.",
            "On the security of stepwise triangular systems.",
            "GOB designs for authentication codes with arbitration.",
            "On the classification of perfect codes: side class structures.",
            "The polynomial degree of the Grassmannian G(1, n, q) of lines in finite projective space PG(n, q).",
            "LDPC codes generated by conics in the classical projective plane.",
            "Fast decoding of quasi-perfect Lee distance codes.",
            "On the k-error linear complexity over \\mathbbFp of Legendre and Sidelnikov sequences.",
            "Secret sharing schemes with partial broadcast channels.",
            "Constructing codes identifying sets of vertices.",
            "Roux-type constructions for covering arrays of strengths three and four.",
            "Projective two-weight codes with small parameters and their corresponding graphs.",
            "A random construction for permutation codes and the covering radius.",
            "Pairs of codes with prescribed Hamming distances and coincidences.",
            "New constructions of optimal self-dual binary codes of length 54.",
            "Circulant weighing matrices of weight 22t.",
            "Subregular planes admitting elations.",
            "Isometric embeddings of Zpk in the Hamming space FpN and Zpk-linear codes.",
            "Uncoverings-by-bases for base-transitive permutation groups.",
            "Combinatorial characterizations of one-coincidence frequency-hopping sequences.",
            "Distance-transitive dihedrants.",
            "New quasi-symmetric designs constructed using mutually orthogonal Latin squares and Hadamard matrices.",
            "Evaluation codes and plane valuations.",
            "Explicit constructions of separating hash families from algebraic curves over finite fields.",
            "Self-dual codes over Z8 and Z9.",
            "A sequence of one-point codes from a tower of function fields.",
            "Embeddings of resolvable group divisible designs with block size 3.",
            "Sparse polynomials, redundant bases, gauss periods, and efficient exponentiation of primitive elements for small characteristic finite fields.",
            "Applications of representation theory to wireless communications.",
            "New classes of self-complementary codes and quasi-symmetric designs.",
            "On universally decodable matrices for space-time coding.",
            "Some constructions of systematic authentication codes using galois rings."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2005",
        "info": "2005: Volumes\n34,\n35,\n36,\n37",
        "count": 100,
        "papers": [
            "On the Minimum Size of Some Minihypers and Related Linear Codes.",
            "Secret Sharing Schemes with Three or Four Minimal Qualified Subsets.",
            "Elements of Prescribed Order, Prescribed Traces and Systems of Rational Functions Over Finite Fields.",
            "Systematic Construction of q-Analogs of t-(v, k, lambda)-Designs.",
            "Symmetric (4,4)-Nets and Generalized Hadamard Matrices Over Groups of Order 4.",
            "Fq-linear Cyclic Codes over Fqm: DFT Approach.",
            "Group Divisible Designs with Block Size Four and Group Type gum1 with Minimum m.",
            "Preface.",
            "The Combinatorics of Dom de Caen.",
            "Distance Regular Covers of Complete Graphs from Latin Squares.",
            "A Computer-Assisted Proof of the Uniqueness of the Perkel Graph.",
            "Some Interlacing Results for the Eigenvalues of Distance-regular graphs.",
            "On Meta-Thin Association Schemes.",
            "The Classification of Flats in PG(9, 2) which are External to the Grassmannian G1, 4, 2.",
            "Graphs With Least Eigenvalue -2: A New Proof of the 31 Forbidden Subgraphs Theorem.",
            "Algebraic Characterizations of Graph Regularity Conditions.",
            "A Solution of a Problem of A. E. Brouwer.",
            "Square-Free Non-Cayley Numbers. On Vertex-Transitive Non-Cayley Graphs of Square-Free Order.",
            "Some Characterizations of Finite Hermitian Veroneseans.",
            "Hyperbolic Fibrations and q-Clans.",
            "Two Linear Transformations each Tridiagonal with Respect to an Eigenbasis of the other; Comments on the Parameter Array.",
            "A Note on the Tight Spherical 7-Design in R23 and 5-Design in R7*.",
            "Blocking Structures of Hermitian Varieties.",
            "Vectorial Approach to Fast Correlation Attacks.",
            "Double Arrays, Triple Arrays and Balanced Grids.",
            "A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares.",
            "How to Mask the Structure of Codes for a Cryptographic Use.",
            "Support Weight Enumerators and Coset Weight Distributions of Isodual Codes.",
            "On the Linear Complexity and Multidimensional Distribution of Congruential Generators over Elliptic Curves.",
            "Generic Groups, Collision Resistance, and ECDSA.",
            "Modified Alternating vec{k}-generators.",
            "Extendability of Ternary Linear Codes.",
            "A New Method for Constructing Williamson Matrices.",
            "On Goppa Codes and Weierstrass Gaps at Several Points.",
            "New Constructions for IPP Codes.",
            "New Results on Codes with Covering Radius 1 and Minimum Distance 2.",
            "A Family of Complete Caps in PG(n, 2).",
            "The Near Resolvable 2-(13, 4, 3) Designs and Thirteen-Player Whist Tournaments.",
            "Resolvable Maximum Packings with Quadruples.",
            "A Recursive Construction for New Symmetric Designs.",
            "Optimal Colored Threshold Visual Cryptography Schemes.",
            "Trialities and 1-Systems of Q+(7, q).",
            "A General Approach to Robust Web Metering.",
            "On the Non-existence of Semiregular Relative Difference Sets in Groups with All Sylow Subgroups Cyclic.",
            "Elliptic Curve Cryptosystems in the Presence of Permanent and Transient Faults.",
            "Characterization of SDP Designs That Yield Certain Spin Models.",
            "The General Pay-Word: A Micro-payment Scheme Based on n-dimension One-way Hash Chain.",
            "Binary Fingerprinting Codes.",
            "Existence of Generalized Steiner Systems GS(2, 4, v, 2).",
            "On the Spectrum of the Sizes of Maximal Partial Line Spreads in PG(2n, q), n >= 3.",
            "On a More General Characterisation of Steiner Systems.",
            "Nonlinearity of Some Invariant Boolean Functions.",
            "Type II Codes over Z/2kZ, Invariant Rings and Theta Series.",
            "Block Primitive 2-(v, k, 1) Designs Admitting a Ree Group of Characteristic Two.",
            "The Field Descent Method.",
            "Concatenating Indicators of Flats for Designing Cryptographic Functions.",
            "Local Schur's Lemma and Commutative Semifields.",
            "On Linear Codes over Z2s.",
            "Hyperelliptic Curves with Compact Parameters.",
            "Distributing the Encryption and Decryption of a Block Cipher.",
            "Nonexistence of [n, 5, d]q Codes Attaining the Griesmer Bound for q4-2q2-2q+1 <= d <= q4-2q2-q.",
            "A Public Key Cryptosystem Based On A Subgroup Membership Problem.",
            "Proof of Conjectures on the True Dimension of Some Binary Goppa Codes.",
            "Two New Four-Error-Correcting Binary Codes.",
            "Finite Field Elements with Specified Order and Traces.",
            "One (96, 20, 4)-symmetric Design and related Nonabelian Difference Sets.",
            "On the Construction of Linear q-ary Lexicodes.",
            "On the Non-linearity of Power Functions.",
            "Bounds for Covering Codes over Large Alphabets.",
            "Constructions of Small Complete Caps in Binary Projective Spaces.",
            "Signcryption with Non-interactive Non-repudiation.",
            "Toward the Determination of the Minimum Distance of Two-Point Codes on a Hermitian Curve.",
            "Elliptic Curves Suitable for Pairing Based Cryptography.",
            "On the Existence of Large Sets of t-designs of Prime Sizes.",
            "Forbidden (0, 1)-vectors in Hyperplanes of Rn: The unrestricted case.",
            "XOR-based Visual Cryptography Schemes.",
            "Symmetric Weighing Matrices Constructed using Group Matrices.",
            "A Family of Binary (t, m, s)-Nets of Strength 5.",
            "Check Character Systems using Quasigroups: I.",
            "MRD Hashing.",
            "Kernels and p-Kernels of pr-ary 1-Perfect Codes.",
            "Slim Near Polygons.",
            "Cyclic Difference Packing and Covering Arrays.",
            "The Classification of Symmetric Transversal Designs STD4[12; 3]'s.",
            "Asymptotically Good Codes from Generalized Algebraic-Geometry Codes.",
            "Double Arrays, Triple Arrays and Balanced Grids with v=r+c - 1.",
            "Highly Nonlinear Resilient Functions Through Disjoint Codes in Projective Spaces.",
            "Non Existence of Triangle Free Quasi-symmetric Designs.",
            "Remark on a 5-Design Related to a Putative Extremal Doubly-Even Self-Dual [96, 48, 20] Code.",
            "An Optimal Multisecret Threshold Scheme Construction.",
            "Matrix Groups Related to the Quaternion Group and Spherical Orbit Codes.",
            "Check Character Systems Using Quasigroups: II.",
            "On the Minimum Length of some Linear Codes of Dimension 5.",
            "Codes from Generalized Hexagons.",
            "Piecewise Constructions of Bent and Almost Optimal Boolean Functions.",
            "Near-Extremal Formally Self-Dual Even Codes of Lengths 24 and 32.",
            "Weierstrass Semigroups and Codes from a Quotient of the Hermitian Curve.",
            "On the Number of Trace-One Elements in Polynomial Bases for F2n.",
            "Weak Keys in MST1.",
            "The Existence of a Symmetric Transversal Design STD7[21; 3]."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2004",
        "info": "2004: Volumes\n31,\n32,\n33",
        "count": 69,
        "papers": [
            "Extensions of Generalized Product Caps.",
            "Minimal Blocking Sets in PG(2, 8) and Maximal Partial Spreads in PG(3, 8).",
            "A Lower Bound on the Greedy Weights of Product Codes.",
            "On the Orthogonality of Geometric Codes.",
            "Correlation Analysis of the Alternating Step Generator.",
            "An Assmus-Mattson-Type Approach for Identifying 3-Designs from Linear Codes over Z4.",
            "Efficient Undeniable Signature Schemes Based on Ideal Arithmetic in Quadratic Orders.",
            "On a Class of Traceability Codes.",
            "Affine Planes and Flag Linear Spaces.",
            "On the Minimum Weight of Codes over F5 Constructed from Certain Conference Matrices.",
            "Boolean Functions with Five Controllable Cryptographic Properties.",
            "Affine Rank 3 Groups on Symmetric Designs.",
            "On Koetter's Algorithm and the Computation of Error Values.",
            "Ovals and Hyperovals in Desarguesian Nets.",
            "The p-Rank of the Incidence Matrix of Intersecting Linear Subspaces.",
            "Partial Ovoids in Classical Finite Polar Spaces.",
            "Register Synthesis for Algebraic Feedback Shift Registers Based on Non-Primes.",
            "Spreads of T2(o), alpha-flocks and Ovals.",
            "Small Point Sets that Meet All Generators of W(2n+1, iq).",
            "Key Distribution Patterns Using Tangent Circle Structures.",
            "On the Computation of Square Roots in Finite Fields.",
            "The Classification of Some Perfect Codes.",
            "Symplectic Spreads.",
            "Design of Self-Healing Key Distribution Schemes.",
            "On the Action of the Groups GL(n+1, q), PGL(n+1, q), SL(n+1, q) and PSL(n+1, q) on PG(n, qt).",
            "Constructions for Permutation Codes in Powerline Communications.",
            "Cover-Free Families and Topology-Transparent Scheduling for MANETs.",
            "Remarks on Singer Cyclic Groups and Their Normalizers.",
            "On (0, alpha)-Geometries and Dual Semipartial Geometries Fully Embedded in an Affine Space.",
            "Planar Oval Sets in Desarguesian Planes of Even Order.",
            "The Lovász Local Lemma and Its Applications to some Combinatorial Arrays.",
            "Anonymous Membership Broadcast Schemes.",
            "SPG-Reguli Satisfying the Polar Property and a New Semipartial Geometry.",
            "Nets of Small Degree Without Ovals.",
            "Enumeration of t-Designs Through Intersection Matrices.",
            "Self-Orthogonal and Self-Dual Codes Constructed via Combinatorial Designs and Diophantine Equations.",
            "On the Security of Two Public Key Cryptosystems Using Non-Abelian Groups.",
            "On Non-Polynomial Latin Squares.",
            "Regular Hadamard Matrices Generating Infinite Families of Symmetric Designs.",
            "Some Indecomposable t-Designs.",
            "Hyperbolic Ovals in Finite Planes.",
            "Minimum Covering for Hexagon Triple Systems.",
            "Amalgams of Cubic Bipartite Graphs.",
            "Resolvable t-Designs.",
            "On a Bound of Cover-Free Families.",
            "On t-Covering Arrays.",
            "LDPC Codes from Triangle-Free Line Sets.",
            "Spreads and Ovoids Translation with Respect to Disjoint Flags.",
            "Parallel Symmetric Attack on NTRU using Non-Deterministic Lattice Reduction.",
            "The Quintic Grassmannian G{1, 4, 2} in PG(9, 2).",
            "Multiple Blocking Sets in PG(n, q), n>3.",
            "On the p-Ranks and Characteristic Polynomials of Cyclic Difference Sets.",
            "A Proof of Simmons' Conjecture.",
            "Maximum Distance Codes in Matn, s(Zk) with a Non-Hamming Metric and Uniform Distributions.",
            "The Non-Existence of Maximal Sets of Four Mutually Orthogonal Latin Squares of Order 8.",
            "A Sequence of Unique Quaternary Griesmer Codes.",
            "On the Weight Hierarchy of Product Codes.",
            "How Many Bits have to be Changed to Decrease the Linear Complexity?.",
            "Periodicity and Correlation Properties of d-FCSR Sequences.",
            "On the Covering Radius of Ternary Extremal Self-Dual Codes.",
            "Eigenvalues of Finite Projective Planes with an Abelian Cartesian Group.",
            "On the Linear Codes Arising from Schubert Varieties.",
            "Parameter Inequalities for Orthogonal Arrays with Mixed Levels.",
            "New Cyclic Difference Sets with Singer Parameters Constructed from d-Homogeneous Functions.",
            "Towards a Uniform Description of Several Group Based Cryptographic Primitives.",
            "Three Constructions of Authentication Codes with Perfect Secrecy.",
            "A Linear Algebraic Approach to Metering Schemes.",
            "Security of Signature Schemes in a Multi-User Setting.",
            "Self-Reciprocal Irreducible Polynomials Over Finite Fields."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2003",
        "info": "2003: Volumes\n28,\n29,\n30",
        "count": 59,
        "papers": [
            "A New NP-Complete Problem and Public-Key Identification.",
            "Short Polynomial Representations for Square Roots Modulo rho.",
            "Looking for Difference Sets in Groups with Dihedral Images.",
            "On a Particular Class of Minihypers and Its Applications. I. The Result for General varrho.",
            "Doubly beta-Derived Translation Planes.",
            "A New Family of Cyclic Difference Sets with Singer Parameters in Characteristic Three.",
            "On Binary Resilient Functions.",
            "An Efficient Protocol for Authenticated Key Agreement.",
            "Linear Complexity of the Discrete Logarithm.",
            "Quasi-Symmetric Designs with Good Blocks and Intersection Number One.",
            "Extremal Self-Dual [50, 25, 10] Codes with Automorphisms of Order 3 and Quasi-Symmetric 2-(49, 9, 6) Designs.",
            "Extremal Self-Dual Codes over F2 × F2.",
            "On the Security of Digital Signature Schemes Based on Error-Correcting Codes.",
            "Improvement of the Delsarte Bound for t-Designs When It Is Not the Best Bound Possible.",
            "Providing Anonymity in Unconditionally Secure Secret Sharing Schemes.",
            "3-Designs from the Z4-Goethals Codes via a New Kloosterman Sum Identity.",
            "Hypercubic 4 and 5-Designs from Double-Error-Correcting BCH Codes.",
            "Designs and Representation of the Symmetric Group.",
            "Taking pth Roots Modulo Polynomials over Finite Fields.",
            "Finite Geometries.",
            "Complete Spans on Hermitian Varieties.",
            "Forbidden (0, 1)-Vectors in Hyperplanes of Rn: The Restricted Case.",
            "Cone Dependence - A Basic Combinatorial Concept.",
            "Symmetries of BLT-Sets.",
            "A New Class of Designs Which Protect against Quantum Jumps.",
            "Projective Planes, Coverings and a Network Problem.",
            "On Sets without Tangents in Galois Planes of Even Order.",
            "The Largest Cap in AG(4, 4) and Its Uniqueness.",
            "Results on Maximal Partial Spreads in PG(3, p3) and on Related Minihypers.",
            "On Maximal Partial Spreads in PG(n, q).",
            "On (q + t, t)-Arcs of Type (0, 2, t).",
            "Some New Maximal Sets of Mutually Orthogonal Latin Squares.",
            "On the Linear Complexity of the Sidelnikov-Lempel-Cohn-Eastman Sequences.",
            "On Optimal Codes Over the Field with Five Elements.",
            "The Residually Weakly Primitive Geometries of M22.",
            "On 1-Systems of Q(6, q), q Even.",
            "Some Remarks on Steiner Systems.",
            "On the Characterization of the Folded Halved Cubes by Their Intersection Arrays.",
            "Symmetry in Generalized Quadrangles.",
            "A Note on MDS Codes, n-Arcs and Complete Designs.",
            "A Representation of a Family of Secret Sharing Matroids.",
            "Exact Bounds on the Sizes of Covering Codes.",
            "A Practical Protocol for Advantage Distillation and Information Reconciliation.",
            "A Geometric Relationship Between Equivalent Spreads.",
            "Meeting the Welch and Karystinos-Pados Bounds on DS-CDMA Binary Signature Sets.",
            "On x6 + x + a in Characteristic Three.",
            "Some New Results on Optimal Codes Over F5.",
            "On the Algebraic Structure of Quasi-cyclic Codes II: Chain Rings.",
            "On a Class of Symmetric Balanced Generalized Weighing Matrices.",
            "New Extremal Type I Codes of Lengths 40, 42, and 44.",
            "Upper Bounds on the Dual Distance of BCH(255, k).",
            "A Criterion for Designs in {\\tf=\"P101461\" Z}_4-codes on the Symmetrized Weight Enumerator.",
            "Designs in Additive Codes over GF(4).",
            "The Insecurity of the Elliptic Curve Digital Signature Algorithm with Partially Known Nonces.",
            "On the Sporadic Semifield Flock.",
            "Construction of Symmetric Balanced Squares with Blocksize More than One.",
            "Towards Practical Non-Interactive Public-Key Cryptosystems Using Non-Maximal Imaginary Quadratic Orders.",
            "On the Construction of Some Type II Codes over Z4×Z4.",
            "Cyclic Relative Difference Sets and their p-Ranks."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2002",
        "info": "2002: Volumes\n25,\n26,\n27",
        "count": 55,
        "papers": [
            "On the Automorphisms of Order 2 with Fixed Points for the Extremal Self-Dual Codes of Length 24m.",
            "Threshold Visual Cryptography Schemes with Specified Whiteness Levels of Reconstructed Pixels.",
            "Polynomial Interpolation of the Discrete Logarithm.",
            "Symmetric Designs Attached to Four-Weight Spin Models.",
            "A Correction to \"Incidence Matrices and Collineations of Finite Projective Planes\" by Chat Yin Ho, Designs, Codes and Cryptography, 18 (1999).",
            "Lower Bounds on the State Complexity of Geometric Goppa Codes.",
            "On Circulant Complex Hadamard Matrices.",
            "Minihypers and Linear Codes Meeting the Griesmer Bound: Improvements to Results of Hamada, Helleseth and Maekawa.",
            "Orthogonal Designs and Type II Codes over Z2k.",
            "Secret Sharing Schemes with Detection of Cheaters for a General Access Structure.",
            "The Theory of Cyclic Codes and a Generalization to Additive Codes.",
            "Itoh-Tsujii Inversion in Standard Basis and Its Application in Cryptography and Codes.",
            "A Signature Scheme Based on the Intractability of Computing Roots.",
            "On Complete Arcs Arising from Plane Curves.",
            "A Theorem Concerning Nets Arising from Generalized Quadrangles with a Regular Point.",
            "Ring-Valued Assignments to the Points of a t-Design.",
            "Covering Sequences of Boolean Functions and Their Cryptographic Significance.",
            "Linear Key Predistribution Schemes.",
            "Constructions of Nested Partial Difference Sets with Galois Rings.",
            "Hermitian Veronesean Schemes.",
            "Preface: In Honour of Ronald C. Mullin.",
            "The Existence of Four HMOLS with Equal Sized Holes.",
            "Balanced Incomplete Block Designs with Block Size 9 and lambda=2, 4, 8.",
            "An Enumeration of Binary Self-Dual Codes of Length 32.",
            "On the Security of the Digital Signature Algorithm.",
            "Constructions and Bounds for Unconditionally Secure Non-Interactive Commitment Schemes.",
            "Cyclic Designs with Block Size 4 and Related Optimal Optical Orthogonal Codes.",
            "Kirkman Packing Designs KPD ({3, 5*}, v).",
            "Homogeneous Bent Functions, Invariants, and Designs.",
            "General Constructions for Double Group Divisible Designs and Double Frames.",
            "The Existence of Kirkman Squares-Doubly Resolvable (v, 3, 1)-BIBDs.",
            "Subcodes of the Projective Generalized Reed-Muller Codes Spanned by Minimum-Weight Vectors.",
            "Arcs and Ovals from Abelian Groups.",
            "A Rigorous Proof of the Waterloo Algorithm for the Discrete Logarithm Problem.",
            "On Large Sets of v-1 L-Intersecting Steiner Triple Systems of Order v.",
            "A Note on Geometric Structures of Linear Ordered Orthogonal Arrays and (T, M, S)-Nets of Low Strength.",
            "n Group-Divisible Designs with Block Size Four and Group-Type gum1.",
            "Finite Linear Spaces II.",
            "On Orthogonal Double Covers of Graphs.",
            "Modular Arithmetic on Elements of Small Norm in Quadratic Fields.",
            "Partitioning Sets of Triples into Small Planes.",
            "Enumeration of 2-(9, 3, lambda) Designs and Their Resolutions.",
            "Ranks of q-Ary 1-Perfect Codes.",
            "Existence of Perfect 4-Deletion-Correcting Codes with Length Six.",
            "Parity Encoding of Binary Sequences.",
            "Packing Arrays and Packing Designs.",
            "On Perfect Codes: Rank and Kernel.",
            "Transversal-Free Translation Nets.",
            "A New Approach for Visual Cryptography.",
            "Key-Dependent S-Boxes and Differential Cryptanalysis.",
            "A 2-(22, 8, 4) Design Cannot Have a 2-(10, 4, 4) Subdesign.",
            "Bounds on the Covering Radius of Linear Codes.",
            "elf-Complementary Balanced Codes and Quasi-Symmetric Designs.",
            "A New Construction of Central Relative (pa, pa, pa, 1)-Difference Sets.",
            "Classifying Subspaces of Hamming Spaces."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2001",
        "info": "2001: Volumes\n22,\n23,\n24",
        "count": 75,
        "papers": [
            "All Lambda-Designs With are Type-1.",
            "Veronese Varieties Over Finite Fields and Their Projections.",
            "Characterization of Linear Structures.",
            "Bounds and Combinatorial Structure of Multi-Receiver-Codes.",
            "Linear Frameworks for Block Ciphers.",
            "Codes over and Improvements to the Bounds on Ternary Linear Codes.",
            "Weierstrass Pairs and Minimum Distance of Goppa Codes.",
            "Some Estimates for Character Sums and Applications.",
            "Something About All or Nothing (Transforms).",
            "The Nonexistence of a [207, 4, 165] Code over GF(5).",
            "A New Proof of the Assmus-Mattson Theorem for Non-Binary Codes.",
            "On Sylow Subgroups of Abelian Affine Difference Sets.",
            "On the Nonexistence of q-ary Linear Codes of Dimension Five.",
            "Two-Transitive Parallelisms.",
            "Primitive Rank 3 Groups on Symmetric Designs.",
            "There Exists a Simple Non Trivial t-design with an Arbitrarily Large Automorphism Group for Every t.",
            "On Perfect Codes and Related Concepts.",
            "Cryptography in Quadratic Function Fields.",
            "Combinatorial Bounds on Authentication Codes with Arbitration.",
            "Almost Desarguesian Maximal Partial Spreads.",
            "New Constructions of Covering Codes.",
            "On the Use of RSA as a Secret Key Cryptosystem.",
            "A Maximal Partial Spread of Size 45 in PG(3, 7).",
            "On the Linear Complexity of the Power Generator.",
            "Binary Optimal Odd Formally Self-Dual Codes.",
            "Upper and Lower Bounds on Maximum Nonlinearity of n-input m-output Boolean Function.",
            "Some Triple Block Intersection Numbers of Paley 2-Designs of QN-type.",
            "The Extended Euclidian Algorithm on Polynomials, and the Computational Efficiency of Hyperelliptic Cryptosystems.",
            "A Note on Certain 2-Groups with Hadamard Difference Sets.",
            "All qm-ary Cyclic Codes with Cyclic q-ary Image Are Known.",
            "A Combinatorial Construction for Perfect Deletion-Correcting Codes.",
            "Bounds for the Multicovering Radii of Reed-Muller Codes with Applications to Stream Ciphers.",
            "On Some Properties of the Shrinking Generator.",
            "A New Family of Ternary Sequences with Ideal Two-level Autocorrelation Function.",
            "Optimal Ternary Linear Rate 1/2 Codes.",
            "On String Replacement Exponentiation.",
            "Hyperplane Sections of Kantor's Unitary Ovoids.",
            "Large Caps in Small Spaces.",
            "On Certain Schur Rings of Dimension 4.",
            "On the Distance Distributions of BCH Codes and Their Duals.",
            "Perfect Cayley Designs as Generalizations of Perfect Mendelsohn Designs.",
            "Characterizations of Translation Generalized Quadrangles.",
            "Values of Minors of (1, -1) Incidence Matrices of SBIBDs and Their Application to the Growth Problem.",
            "Lattice Attacks on Digital Signature Schemes.",
            "A Proof of the Jungnickel-Tonchev Conjecture on Quasi-Multiple Quasi-Symmetric Designs.",
            "How to Choose Secret Parameters for RSA-Type Cryptosystems over Elliptic Curves.",
            "A Difference Set in.",
            "Classification of Formally Self-Dual Even Codes of Lengths up to 16.",
            "Error-Correcting Codes over an Alphabet of Four Elements.",
            "Affine Invariant and Cyclic Codes over -adic Numbers and Finite Rings.",
            "Structure Theorems for Group Ring Codes with an Application to Self-Dual Codes.",
            "Trellis Structure and Higher Weights of Extremal Self-Dual Codes.",
            "On the Internal Nuclei of Sets in is Odd.",
            "Maximal Weight Divisors of Projective Reed-Muller Codes.",
            "On the Composition of Matroids and Ideal Secret Sharing Schemes.",
            "Generalized Steiner Systems GS(2, 4, v, 2) with a Prime Power equiv 7 (mod 12).",
            "True Dimension of Some Binary Quadratic Trace Goppa Codes.",
            "The Invariants of the Clifford Groups.",
            "Minimal Blocking Sets in Projective Spaces of Square Order.",
            "Successive Minimization of the State Complexity of the Self-dual Lattices Using Korkin-Zolotarev Reduced Basis.",
            "On the Existence and Construction of Tight Fourth Order Quadrature Rules for the Sphere.",
            "Cocyclic Codes of Length 40.",
            "The Weight Distribution of C5(1, n).",
            "On Codes Identifying Sets of Vertices in Hamming Spaces.",
            "On (q2+q+2, q+2)-arcs in the Projective Plane PG(2, q).",
            "The Existence of a Bush-Type Hadamard Matrix of Order 324 and Two New Infinite Classes of Symmetric Designs.",
            "Curves in Projective Spaces and Almost MDS Codes.",
            "Bijections Between Group Rings Preserving Character Sums.",
            "Improved Schemes for Visual Cryptography.",
            "On the Linear Complexity of the Naor-Reingold Pseudo-random Function from Elliptic Curves.",
            "Difference Families.",
            "An Upper Bound on the Number of Iterations for Transforming a Boolean Function of Degree Greater or Equal Than 4 to a Function of Degree 3.",
            "The Structure of 1-Generator Quasi-Twisted Codes and New Linear Codes.",
            "Verifiable Partial Escrow of Integer Factors.",
            "Trace Representation of Legendre Sequences."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "2000",
        "info": "2000: Volumes\n19,\n20,\n21",
        "count": 49,
        "papers": [
            "HOPs and COPs: Room frames with partitionable transversals.",
            "A Gap in GRM Code Weight Distributions.",
            "Relating Differential Distribution Tables to Other Properties of of Substitution Boxes.",
            "Guest Editorial.",
            "Information Security, Mathematics, and Public-Key Cryptography.",
            "Integer Factoring.",
            "Discrete Logarithms: The Past and the Future.",
            "The Diffie-Hellman Protocol.",
            "The State of Elliptic Curve Cryptography.",
            "Efficient Arithmetic on Koblitz Curves.",
            "The Xedni Calculus and the Elliptic Curve Discrete Logarithm Problem.",
            "Analysis of the Xedni Calculus Attack.",
            "Pencils of Hyperconics in Projective Planes of Characteristic Two.",
            "Difference Sets in Z4m and F22m.",
            "Automorphisms of Constant Weight Codes and of Divisible Designs.",
            "Binary Quasi-Cyclic Goppa Codes.",
            "On the Key Equation Over a Commutative Ring.",
            "Mixed Partitions of Projective Geometries.",
            "Parallel Multiplication in using Polynomial Residue Arithmetic.",
            "Cryptanalysis of the Matsumoto and Imai Public Key Scheme of Eurocrypt'98.",
            "Maximum Kirkman Signal Sets for Synchronous Uni-Polar Multi-User Communication Systems.",
            "Linear Codes and Their Coordinate Ordering.",
            "Bent Functions, Partial Difference Sets, and Quasi-Frobenius Local Rings.",
            "Hiding Cliques for Cryptographic Security.",
            "Combinatorial Classification of Optimal Authentication Codes with Arbitration.",
            "The Non-Collinearity Graph of the (8, 2) Quadric Is Uniquely Geometrisable.",
            "Small Blocking Sets in PG(2, p).",
            "New Colored Visual Secret Sharing Schemes.",
            "Preface.",
            "Jaap Seidel 80.",
            "Spherical Designs and Generalized Sum-Free Sets in Abelian Groups.",
            "Perfect Baer Subplane Partitions and Three-Dimensional Flag-Transitive Planes.",
            "The Newton Polygon of Plane Curves with Many Rational Points.",
            "Locally Paley Graphs.",
            "The Search for Pseudo Orthogonal Latin Squares of Order Six.",
            "A Characterization of Association Schemes from Affine Spaces.",
            "Two-Weight Codes, Partial Geometries and Steiner Systems.",
            "Epimorphisms of Generalized Polygons Part 1: Geometrical Characterizations.",
            "Strongly Regular Graphs and Designs with Three Intersection Numbers.",
            "A Local Approach to 1-Homogeneous Graphs.",
            "Equilateral Dimension of the Rectilinear Space.",
            "Optimal Subcodes of Second Order Reed-Muller Codes and Maximal Linear Spaces of Bivectors of Maximal Rank.",
            "Minimum Distance Bounds for -Regular Codes.",
            "On Isomorphisms between Coxeter Groups.",
            "Constructions for Octonion and Exceptional Jordan Algebras.",
            "Large Families of Cospectral Graphs.",
            "Subsets of PG(n, 2) and Maximal Partial Spreads in PG(4, 2).",
            "New Linear Codes Over and and Improvements on Bounds.",
            "On 1-Blocking Sets in PG(n, q), n >= 3."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1999",
        "info": "1999: Volumes\n16,\n17,\n18",
        "count": 68,
        "papers": [
            "Some Results on NQR Codes.",
            "Constant Weight Codes and Group Divisible Designs.",
            "New Linear Codes with Covering Radius 2 and Odd Basis.",
            "Cyclic Ostrom Spreads.",
            "Efficient Rabin-type Digital Signature Scheme.",
            "Constructing Covering Codes with Given Automorphisms.",
            "Detection of Cheaters in Vector Space Secret Sharing Schemes.",
            "The Weight Enumerator of Linear Codes over GF Having Generator Matrix over GF.",
            "Binomial Moments of the Distance Distribution and the Probability of Undetected Error.",
            "Some and BIBD Constructions.",
            "Correlation-Immune and Resilient Functions Over a Finite Alphabet and Their Applications in Cryptography.",
            "41 is the Largest Size of a Cap in PG(4, 4).",
            "On Minimal Realization Over a Finite Chain Ring.",
            "Switching Equivalence Classes of Perfect Codes.",
            "Construction of Certain Cyclic Distance-Preserving Codes Having Linear-Algebraic Characteristics.",
            "Some Sets of Type in Cubic Order Planes.",
            "Jacobi Polynomials, Type II Codes, and Designs.",
            "Covering Arrays of Strength Three.",
            "How to Play M13?",
            "On The Correlation of Binary Sequences.",
            "Construction of Extremal Type II Codes over Z.",
            "Designs in Product Association Schemes.",
            "Properties of Codes from Difference Sets in 2-Groups.",
            "Edward F. Assmus, Jr. (1931-1998).",
            "Long Binary Linear Codes and Large Caps in Projective Space.",
            "Williamson Matrices and a Conjecture of Ito's.",
            "On a Family of Covering Extended Building Sets.",
            "An Introduction to Divisible Codes.",
            "On the Minimum Distances of Non-Binary Cyclic Codes.",
            "On the Characterization of Linear Uniquely Decodable Codes.",
            "On Embeddings of the Flag Geometries of Projective Planes in Finite Projective Spaces.",
            "Minimum Weight and Dimension Formulas for Some Geometric Codes.",
            "Linear Perfect Codes and a Characterization of the Classical Designs.",
            "The Eigenspaces of the Bose-Mesner-Algebras of the Association Schemes corresponding to Projective Spaces and Polar Spaces.",
            "An Extension Theorem for Linear Codes.",
            "Building Symmetric Designs With Building Sets.",
            "Another Proof of Kasami's Theorem.",
            "A Steiner 5-Design on 36 Points.",
            "Binary Codes of Strongly Regular Graphs.",
            "Maximally Nonlinear Functions and Bent Functions.",
            "A Bose-Burton Theorem for Elliptic Polar Spaces.",
            "Multiplicative Difference Sets via Additive Characters.",
            "On Unitals with Many Baer Sublines.",
            "Complete Systems of Lines on a Hermitian Surface over a Finite Field.",
            "On Linear Goethals Codes and Kloosterman Sums.",
            "Signed Hypergraph Designs and Diagonal Forms for Some Incidence Matrices.",
            "The Universal Embedding Dimension of the Near Polygon on the 1-Factors of a Complete Graph.",
            "Editorial.",
            "Answering a Question of Pott on Almost Perfect Sequences.",
            "On Harmonic Weight Enumerators of Binary Codes.",
            "The Automorphism Groups of BCH Codes and of Some Affine-Invariant Codes Over Extension Fields.",
            "Some Observations on Quasi-3 Designs and Hadamard Matrices.",
            "Triads, Flocks of Conics and Q.",
            "Antichain Codes.",
            "Semiregular Large Sets.",
            "Association Schemes Related to Kasami Codes and Kerdock Sets.",
            "Split Weight Enumerators for the Preparata Codes with Applications to Designs.",
            "On the Classification of Extremal Even Formally Self-Dual Codes.",
            "A General Polynomial Sieve.",
            "Incidence Matrices and Collineations of Finite Projective Planes.",
            "Some Upper Bounds on the Covering Radii of Linear Codes Over and Their Applications.",
            "Hypergraphical Codes Arising from Binary Trades.",
            "Directed-Packings and Directed -Steiner Systems.",
            "Partial-Spreads in.",
            "Flag-Transitive Affine Planes of Order 64.",
            "A Class of Perfect Ternary Constant-Weight Codes.",
            "On Perfect Ternary Constant Weight Codes.",
            "On the Embedding of -Arcs is Maximal Arcs."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1998",
        "info": "1998: Volumes\n13,\n14,\n15",
        "count": 67,
        "papers": [
            "Balanced Incomplete Block Designs with Block Size 7.",
            "Linearly Derived Steiner Triple Systems.",
            "Caps and Colouring Steiner Triple Systems.",
            "Characterizing the Hermitian and Ree Unitals on 28 Points.",
            "A Number Theoretic Conjecture and the Existence of S-Cyclic Steiner Quadruple Systems.",
            "On Orthogonal Double Covers of Graphs.",
            "Bounds and Characterizations of Authentication/Secrecy Schemes.",
            "New Families of Semi-Regular Relative Difference Sets.",
            "Decoding Affine Variety Codes Using Gröbner Bases.",
            "A Recursive Construction for 2-Designs.",
            "The Nonexistence of Ternary [38, 6, 23] Codes.",
            "Skew-Hadamard Matrices and the Smith Normal Form.",
            "Equiorthogonal Frequency Hypercubes: Preliminary Theory.",
            "The Collinearity Graph of the O-(8, 2) Quadric Is Not Geometrisable.",
            "Linear Sections of the Finite Veronese Varieties and Authentication Systems Defined Using Geometry.",
            "The Covering Radius of Ternary Cyclic Codes with Length up to 25.",
            "Analysis of Iterated Modular Exponentiation: The Orbits of xalpha mod N.",
            "A Construction of Difference Sets.",
            "Note on Periodic Complementary Sets of Binary Sequences.",
            "Classification of Extremal Double Circulant Self-Dual Codes of Lengths 64 to 72.",
            "New Extremal Type II Codes over Z4.",
            "Bounds on Spectra of Codes with Known Dual Distance.",
            "Three Systems for Threshold Generation of Authenticators.",
            "Quasideterminant Characterization of MDS Group Codes over Abelian Groups.",
            "Perfect Mendelsohn Packing Designs with Block Size Five.",
            "A Subclass of Binary Goppa Codes with Improved Estimation of the Code Dimension.",
            "Computing Linear Codes and Unitals.",
            "Reducing the Elliptic Curve Cryptosystem of Meyer-Müuller to the Cryptosystem of Rabin-Williams.",
            "Montgomery Multplication in GF(2k).",
            "On Upper Bounds for Minimum Distances and Covering Radius of Non-binary Codes.",
            "Existence of Perfect 3-Deletion-Correcting Codes.",
            "Difference Sets and Hyperovals.",
            "On Generalized Hamming Weights for Galois Ring Linear Codes.",
            "On the Non-Existence of Certain Cameron-Liebler Line Classes in PG(3, q).",
            "An Alternate Characterization of the Bentness of Binary Functions, with Uniqueness.",
            "Point Code Minimum Steiner Triple Systems.",
            "A Technique for Constructing Symmetric Designs.",
            "Discrete Logarithm Based Cryptosystems in Quadratic Function Fields of Characteristic 2.",
            "Almost Affine Codes.",
            "An Inequality on the Coding Gain of Densest Lattice Packings in Successive Dimensions.",
            "Enumeration, Construction and Random Generation of Block Codes.",
            "Shared Secret Reconstruction.",
            "Weights of Abelian Codes.",
            "Root Counting, the DFT and the Linear Complexity of Nonlinear Filtering.",
            "Some New Results on Key Distribution Patterns and Broadcast Encryption.",
            "Unconditionally Secure Group Authentication.",
            "Simple 8-Designs with Small Parameters.",
            "On Lower Bounds for the Redundancy of Optimal Codes.",
            "Weight Hierarchies of Linear Codes Satisfying the Chain Condition.",
            "Multiround Unconditionally Secure Authentication.",
            "New Combinatorial Bounds for Authentication Codes and Key Predistribution Schemes.",
            "How to Build Robust Shared Control Systems.",
            "Codes, Bent Functions and Permutations Suitable For DES-like Cryptosystems.",
            "New Constructions of Disjoint Distinct Difference Sets.",
            "Existence of Difference Families with a Prime Power.",
            "An Infinite Family of 3-Designs from Preparata Codes over Z.",
            "Codes from Affine Permutation Groups.",
            "Cocyclic Generalised Hadamard Matrices and Central Relative Difference Sets.",
            "Two New Infinite Families of 3-Designs from Kerdock Codes over Z.",
            "Abelian Difference Sets Without Self-conjugacy.",
            "Partial Unitals and Related Structures in Desarguesian Planes.",
            "On Lower Bounds For Covering Codes.",
            "The Nonexistence of Some Optimal Ternary Codes of Dimension Five.",
            "Construction of Weighing Matrices (17, 9) Having the Intersection Number 8.",
            "Nested Optimal -Packings and -Coverings of Pairs with Triples.",
            "Lower Bounds for Transversal Covers.",
            "A General Decomposition Construction for Incomplete Secret Sharing Schemes."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1997",
        "info": "1997: Volumes\n10,\n11,\n12",
        "count": 63,
        "papers": [
            "The Length of Primitive BCH Codes with Minimal Covering Radius.",
            "On the Enumeration and Generation of Nonweight Equivalent Rate ½ Convolutional Codes.",
            "Two Remarks on Blocking Sets and Nuclei in Planes of Prime Order.",
            "A Necessary and Sufficient Condition for the Existence of Some Ternary [n, k, d] Codes Meeting the Greismer Bound.",
            "On the Incidence Matrix of the Ree Unital.",
            "Classification of Some Optimal Ternary Linear Codes of Small Length.",
            "Lexicographic Order and Linearity.",
            "Special Issue #2 Dedicated to Hanfried Lenz - Preface.",
            "Some Multiply Derived Translation Planes with SL(2, 5) as an Inherited Collineation Group in the Translation Complement.",
            "A Theory of Nets for Polyhedra and Polytopes Related to Incidence Geometries.",
            "Check Character Systems Using Chevalley Groups.",
            "Partitioning Quadrics, Symmetric Group Divisible Designs and Caps.",
            "Construction of a (64, 237, 12) Code via Galois Rings.",
            "Planar Functions and Planes of Lenz-Barlotti Class II.",
            "On GMW Designs and Cyclic Hadamard Designs.",
            "Maximal Partial Spreads and Flocks.",
            "Pairwise Balanced Designs with Consecutive Block Sizes.",
            "Difference Sets Corresponding to a Class of Symmetric Designs.",
            "Unitals and Unitary Polarities in Symmetric Designs.",
            "Embedding the Linear Structure of Planar Spaces into Projective Spaces.",
            "Existence of Incomplete Transversal Designs with Block Size Five and Any Index lambda.",
            "Blocking Sets in (v, {2, 4}, 1)-Designs.",
            "Linear Codes with Non-Uniform Error Correction Capability.",
            "An Approximate Distribution for the Maximum Order Complexity.",
            "Codes of Small Defect.",
            "On the Limit of Maximal Density of Sequences with a Perfect Linear Complexity Profile.",
            "State Spaces of Convolutional Codes.",
            "From a (G, k, 1) to a (Ck + G, k, 1) Difference Family.",
            "On Resolvable Difference Families.",
            "Classification of Extremal Double Circulant Formally Self-Dual Even Codes.",
            "The Existence of Partitioned Generalized Balanced Tournament Designs with Block Size 3.",
            "A Family of Semi-Regular Divisible Difference Sets.",
            "Codes with a Disparity Property.",
            "Tight Bounds on the Information Rate of Secret Sharing Schemes.",
            "Resolvable Balanced Incomplete Block Designs with Block Size 8.",
            "Weight Enumerators of Double Circulant Codes and New Extremal Self-Dual Codes.",
            "A New Table of Binary/Ternary Mixed Covering Codes.",
            "Constructions and Properties of k out of n Visual Secret Sharing Schemes.",
            "Universal Hashing and Geometric Codes.",
            "A Generalization of Rational Interpolation Problem and the Solution of the Welch-Berlekamp Key Equation.",
            "On the Dealer's Randomness Required in Secret Sharing Schemes.",
            "The Correspondence between Projective Codes and 2-weight Codes.",
            "Using the Simplex Code to Construct Relative Difference Sets in 2-groups.",
            "Trading Signed Designs and Some new 4-(12, 5, 4) Designs.",
            "Cross-Correlations of Quadratic Form Sequences in Odd Characteristic.",
            "Some New Optimal Ternary Linear Codes.",
            "A General Zero-Knowledge Scheme.",
            "On the Binary Self-Dual Codes with an Automorphism of Order 2.",
            "Hadamard Matrices from Weighing Matrices via Signed Groups.",
            "Large Sets of Mutually Almost Disjoint Steiner Triple Systems Not From Steiner Quadruple Systems.",
            "Generalized Hadamard Matrices.",
            "The Reed-Muller Code R(1, 7) Is Normal.",
            "On the Achievement of the Griesmer Bound.",
            "Normal Rational Curves over Prime Fields.",
            "On Sparse Parity Check Matrices.",
            "Split Orthogonal Arrays and Maximum Independent Resilient Systems of Functions.",
            "A Linear Construction of Secret Sharing Schemes.",
            "Special Issue: Selected Areas in Cryptography - Introduction.",
            "On Some Methods for Unconditionally Secure Key Distribution and Broadcast Encryption.",
            "MD2 Is not Secure without the Checksum Byte.",
            "On Weaknesses of Non-surjective Round Functions.",
            "Resistance of a CAST-Like Encryption Algorithm to Linear and Differential Cryptanalysis.",
            "Constructing Symmetric Ciphers Using the CAST Design Procedure."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1996",
        "info": "1996: Volumes\n7,\n8,\n9",
        "count": 69,
        "papers": [
            "Special Issue Dedicated to Gustavus J. Simmons - Foreword to this issue.",
            "The National Security Establishment and the Development of Public-Key Cryptography.",
            "\"And Now For Something Completely Different\" (The Egyptologist and the Cryptographer: A Personal Reminiscence).",
            "Watching the Bhang Meter and Flying through Dirt.",
            "A Formal Language for Cryptographic Protocol Requirements.",
            "Message Recovery for Signature Schemes Based on the Discrete Logarithm Problem.",
            "Authentication Codes in Plaintext and Chosen-Content Attacks.",
            "Authentication Schemes, Perfect Local Randomizers, Perfect Secrecy and Secret Sharing Schemes.",
            "Characterizing the Structures of Cryptographic Functions Satisfying the Propagation Criterion for Almost All Vectors.",
            "Redundant Integer Representations and Fast Exponentiation.",
            "Key-Exchange in Real Quadratic Congruence Function Fields.",
            "Fast Decoding Algorithms for First Order Reed-Muller and Related Codes.",
            "On the Automorphism Groups of Affine-Invariant Codes.",
            "New Good Rage (m-1)/pm Ternary and Quaternary Quasi-Cyclic Codes.",
            "The Nonexistence of Ternary [50, 5, 32] Codes.",
            "Combinatorial Characterizations of Authentication Codes II.",
            "Special Issue Dedicated to Hanfried Lenz - Preface.",
            "A Life's Work in Geometry: An Homage to Hanfried Lenz.",
            "Impossibility of a Certain Cyclotomic Equation with Applications to Difference Sets.",
            "On the Binary Codes of Steiner Triple Systems.",
            "Orthogonal Partitions in Designed Experiments.",
            "Regulus-free Spreads of PG(3, q).",
            "Designs, Codes and Crypts - A Puzzle Altogether.",
            "5-Cycle Systems with Holes.",
            "Stories about Groups and Sequences.",
            "Groups Admitting a Kantor Family and a Factorized Normal Subgroup.",
            "Spreads in Strongly Regular Graphs.",
            "Codes Based on Complete Graphs.",
            "A Construction of Partial Difference Sets in Zp2 × Zp2 × . × Zp2.",
            "On the Characterization of AG(n, q) by its Parameters as a Nearly Triply Regular Design.",
            "The Fundamental Theorem of q-Clan Geometry.",
            "Extension of Gravity Centers Configuration to Steiner Triple Systems.",
            "Constructions of Partial Difference Sets and Relative Difference Sets Using Galois Rings.",
            "m-Systems and Partial m-Systems of Polar Spaces.",
            "Piotrowski's Infinite Series of Steiner Quadruple Systems Revisited.",
            "Achieving Rights Untransferability with Client-Independent Servers.",
            "Existence of New Extremal Doubly-Even Codes and Extremal Singly-Even Codes.",
            "The Covering Radius of R(1, 9) in R(4, 9).",
            "McEliece Public Key Cryptosystems Using Algebraic-Geometric Codes.",
            "Constructions of Group Divisible Designs.",
            "New Classes of Groups Containing Menon Difference Sets.",
            "On Cyclic Caps in Projective Spaces.",
            "Special Issue Containing Papers Presented at the Second Upper Michigan Combinatorics Workshop on Designs, Codes and Geometries - Preface.",
            "Designs and Codes: An update.",
            "Some t-Homogeneous Sets of Permutations.",
            "Forcing Linearity on Greedy Codes.",
            "Oval Designs in Desarguesian Projective Planes.",
            "Concerning Difference Matrices.",
            "Hadamard Matrices and Dihedral Groups.",
            "Self-Orthogonal Greedy Codes.",
            "On the Minimal Number of Even Submatrices of 0-1 Matrices.",
            "k-Arcs, Hyperovals, Partial Flocks and Flocks.",
            "A Generalization of a Theorem of Dehon for Simple t-Designs.",
            "A New Approach to the Main Conjecture on Algebraic-Geometric MDS Codes.",
            "Singly-Even Self-Dual Codes of Length 40.",
            "Almost MDS Codes.",
            "The New Minimum Distance Bounds of Goppa Codes and Their Decoding.",
            "Spectral-Null Codes and Null Spaces of {Hadamard} Submatrices.",
            "Dickson Polynomials, Completely Normal Polynomials and the Cyclic Module Structure of Specific Extensions of Finite Fields.",
            "Stickelberger Codes.",
            "On the Number of Representations of Matroids over Finite Fields.",
            "Giuseppe Tallini (1930-1995).",
            "Combinatorial Problems in Infinite Spaces.",
            "A Note on Sequences with the Shift and Add Property.",
            "Codes with the Same Weight Distributions as the Goethals Codes and the Delsarte-Goethals Codes.",
            "Perfect Secret Sharing Schemes on Five Participants.",
            "A Construction for Multisecret Threshold Schemes.",
            "A Non-interactive Public-Key Distribution System.",
            "On cn-2.c* Geometries of Order 2."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1995",
        "info": "1995: Volumes\n5,\n6",
        "count": 37,
        "papers": [
            "Difference Sets in {Abelian} Groups of p-Rank Two.",
            "A Powerful Method for Constructing Difference Families and Optimal Optical Orthogonal Codes.",
            "Quasi-Symmetric Designs Related to the Triangular Graph.",
            "On Quasi-Symmetric 2-(28, 12, 11) and 2-(36, 16, 12) Designs.",
            "The Translation Planes of Order 49.",
            "Can Montgomery Parasites Be Avoided? A Design Methodology Based on Key and Cryptosystem Modifications.",
            "On Covering Designs with Block Size 5 and Index 5.",
            "Complete Variable-Length \"Fix-Free\" Codes.",
            "Perfect Factors in the de Bruijn Graph.",
            "On the p-Ranks of Net Graphs.",
            "Nonisomorphic Complete Sets of F-Rectangles with Prime Power Dimensions.",
            "A Perfect Threshold Secret Sharing Scheme to Identify Cheaters.",
            "Thwarts in Transversal Designs.",
            "The Structure of Weighing Matrices Having Large Weights.",
            "Bounds on the Sizes of Constant Weight Covering Codes.",
            "Three Characterizations of Non-binary Correlation-Immune and Resilient Functions.",
            "On Perfect t-Shift Codes in Abelian Groups.",
            "Key Distribution Patterns Using Minkowski Planes.",
            "On the Construction of Authentication and Secrecy Codes.",
            "On the Construction of Perfect Deletion-Correcting Codes Using Design Theory.",
            "Modular and p-adic Cyclic Codes.",
            "Severely Denting the Gabidulin Version of the McEliece Public Key Cryptosystem.",
            "New Constructions for De Bruijn Tori.",
            "On (pa, p, pa, pa-1)-Relative Difference Sets.",
            "Anticodes for the Grassman and Bilinear Forms Graphs.",
            "New Extremal Doubly-Even [64, 32, 12] Codes.",
            "The Existence of Extremal Self-Dual [50, 25, 10] Codes and Quasi-Symmetric 2-(49, 9, 6) Designs.",
            "Explicit N-Polynomials of 2-Power Degree over Finite Fields, I.",
            "A Public-Key Cryptosystem Utilizing Cyclotomic Fields.",
            "Directed Packings with Block Size 5 and Even v.",
            "On the Information Rate of Perfect Secret Sharing Schemes.",
            "On Symmetric Incidence Matrices of Projective Planes.",
            "On the Classification of Geometric Codes by Polynomial Functions.",
            "Authentication Codes for Nontrusting Parties Obtained from Rank Metric Codes.",
            "Two New Bounds on the Size of Binary Codes with a Minimum Distance of Three.",
            "Sets of Type (m, n) in the Affine and Projective Planes of Order Nine.",
            "Kernels of Nonlinear Hamming Codes."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1994",
        "info": "1994: Volume\n4",
        "count": 27,
        "papers": [
            "Some New 2-Resolvable Steiner Quadruple Systems.",
            "Decoding Perfect Maps.",
            "Quaternary Constructions for the Binary Single-Error-Correcting Codes of Julin, Best and Others.",
            "On Designs and Formally Self-Dual Codes.",
            "On the [28, 7, 12] Binary Self-Complementary Codes and Their Residuals.",
            "A Shift Register Construction of Unconditionally Secure Authentication Codes.",
            "Geometric Secret Sharing Schemes and Their Duals.",
            "Translation Planes of Order 27.",
            "A Coding Theoretic Solution to the 36 Officer Problem.",
            "On Completely Free Elements in Finite Fields.",
            "On Row-Cyclic Codes with Algebraic Structure.",
            "On the Rigidity of Spherical t-Designs that Are Orbits of Finite Reflection Groups.",
            "A Counter-Example to a Recent Result on the q-ary Image of a qs-ary Cyclic Code.",
            "Some Constructions for Key Distribution Patterns.",
            "Maximal Three-Independent Subsets of {0, 1, 2}.",
            "A Binary Perfect Code of Length 15 and Codimension 0.",
            "A Survey of Partial Difference Sets.",
            "On Evaluating the Linear Complexity of a Sequence of Least Period 2n.",
            "An Optimal Ternary [69, 5, 45] Code and Related Codes.",
            "The Weight Hierarchies of the Projective Codes from Nondegenerate Quadrics.",
            "A Bruen Chain for q = 19.",
            "An Exponent Bound on Skew Hadamard Abelian Difference Sets.",
            "A New Class of Symmetric (nu, k, lambda)-Designs.",
            "On Sequences with Zero Autocorrelation.",
            "Constructing c-ary Perfect Factors.",
            "Universal Hashing and Authentication Codes.",
            "Hash Functions and Cayley Graphs."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1993",
        "info": "1993: Volume\n3",
        "count": 30,
        "papers": [
            "The Connectivity of the Block-Intersection Graphs of Designs.",
            "Single Change Covering Designs.",
            "Subsquares in Orthogonal Latin Squares as Subspaces in Affine Geometries: A Generalization of an Equivalence of Bose.",
            "The Lower bound of the Quadratic Spans of DeBruijn Sequences.",
            "Existence Results for Generalized Balanced Tournament Designs with Block Size 3.",
            "Non-symmetric 2-Designs Modulo 2.",
            "Nonexistence of Certain Symmetrical Spherical Codes.",
            "A Weak Difference Set Construction for Higher Dimensional Designs.",
            "A Sharpening of the Johnson Bound for Binary Linear Codes and Nonexistence of Linear Codes with Preparata Parameters.",
            "Cubic Arcs in Cubic Nets.",
            "Incomplete Sums, DC-Constrained Codes, and Codes that Maintain Synchronization.",
            "Codes of Steiner Triple and Quadruple Systems.",
            "On 2-Level Secret Sharing.",
            "Partially-Bent Functions.",
            "Necessary Conditions for Menon Difference Sets.",
            "Some Characterizations of Quasi-Symmetric Designs with a Spread.",
            "Further Results on the Covering Radii of the Reed-Muller Codes.",
            "On the Size of a Maximal Partial Spread.",
            "Classifications of Spreads of PG(3, 4) \\ PG(3, 2).",
            "The GF(p)-Dimension of the Codes Generated by the Classical Point-Line Geometries over GP(p).",
            "The Spectrum of Maximal Partial Steiner Triple Systems.",
            "How to Avoid the Cheaters Succeeding in the Key Sharing Scheme.",
            "Spreads and Group Divisible Designs.",
            "The Automorphism Groups of the Delsarte-Goethals Codes.",
            "Bounds for Binary Multiple Covering Codes.",
            "The Last Packing Number of Quadruples, and Cyclic SQS.",
            "Nets and Their Codes.",
            "Self-Dual Bases in Fqn.",
            "Cross-Correlations of Geometric Sequences in Characteristic Two.",
            "A Note on New Semi-Regular Divisible Difference Sets."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1992",
        "info": "1992: Volume\n2",
        "count": 28,
        "papers": [
            "Hermitian Codes as Generalized Reed-Solomon Codes.",
            "Generalized Perfect Arrays and {Menon} Difference Sets.",
            "On Quasi-Symmetric Designs.",
            "Optimal Ternary Quasi-Cyclic Codes.",
            "A Note on the Nonexistence of Barker Sequences.",
            "Authentication and Authenticated Key Exchanges.",
            "A Complete Classification of Symmetric (31, 10, 3) Designs.",
            "Optimal Ternary Linear Codes.",
            "Varieties of Quasigroups Arising from 2-Perfect m-Cycle Systems.",
            "The Explicit Construction of Irreducible Polynomials over Finite Fields.",
            "Combinatorial Characterizations of Authentication Codes.",
            "Quasi-Symmetric Designs and the Smith Normal Form.",
            "Some Inequalities about the Covering Radius of Reed-Muller Codes.",
            "On the Construction of [q4 + q2 - q, 5, q4 - q3 + q2 - 2q; q]-Codes Meeting the Griesmer Bound.",
            "Self-Witnessing Polynomial-Time Complexity and Prime Factorization.",
            "Concerning Multiplier Automorphisms of Cyclic Steiner Triple Systems.",
            "A Characterization of the Primals in PG(m, 2).",
            "On the Existence of Periodic Complementary Binary Sequences.",
            "On Abelian Difference Set Codes.",
            "Classical Codes as Ideals in Group Algebras.",
            "Design Machines: Algebraically Well Described Interconnection Networks.",
            "On the Rank of Truncated Incidence Matrices of Linear Spaces.",
            "Optimal Normal Bases.",
            "Relations between Two Perfect Ternary Sequence Constructions.",
            "Construction of Cartesian Authentication Codes from Unitary Geometry.",
            "An Explication of Secret Sharing Schemes.",
            "On the p-Rank of Incidence Matrices and a Bound of Bruen and Ott.",
            "Note on a Question by S. Bagchi and B. Bagchi."
        ]
    },
    {
        "name": "Designs, Codes and Cryptography",
        "year": "1991",
        "info": "1991: Volume\n1",
        "count": 26,
        "papers": [
            "Bruck Nets, Codes, and Characters of Loops.",
            "Covering Radius and Dual Distance.",
            "Computation of Discrete Logarithms in Prime Fields.",
            "Four Pairwise Balanced Designs.",
            "Some Remarks on Orders of Projective Planes, Planar Difference Sets and Multipliers.",
            "A Simple Proof of the Delsarte Inequalities.",
            "On Quasiregular Collineation Groups of Projective Planes.",
            "Improvement of Bruck's Completion Theorem.",
            "A Note on Products of Relative Difference Sets.",
            "Cyclic Steiner Quadruple Systems and Köhler's Orbit Graphs.",
            "Fractal Properties of the Singular Function s(u).",
            "Halving PGL(2, 2f), f odd: A Series of Cryptocodes.",
            "A Class of Self-Orthogonal 2-Sequencings.",
            "Linear Cyclic Codes of Wordlength v over GF(qs) Which are Also Linear Cyclic Codes of Worklength sv oper GF(q).",
            "The Jamison Method in Galois Geometries.",
            "The Classification of Doubly Trabsitive Affine Designs.",
            "Constructions of Large Translation Nets with Nonabelian Translation Groups.",
            "Dimensional Linear Spaces Whose Automophism Groups is (Line, Hyperplane)-Flag Transitive.",
            "Exponential Number of Quasi-Symmetric SDP Designs and Codes Meeting.",
            "Hermitian Varieties as Codewords.",
            "A Remark on the Intersection Arrays of Distance Regular Graphs and the Distance Regular Graphs of Diameter d=3i-1 with bi=1 kan k>2.",
            "Diagram Geometries for Sharply n-Transitive Sets of Permutations or of Mappings.",
            "Desarguesian Finite Generalized Quadrangles are Classical or Dual Classical.",
            "Some Highly Symmetric Authentication Perpendicular Arrays.",
            "McFarland's Conjecture on Abelian Difference Sets with Multiplier -1.",
            "Difference Sets in Dihedral Groups."
        ]
    }
]