[
	{
		"year": "2021",
		"name": "51st DSN 2021",
		"info": "Taipei, Taiwan",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2021",
				"sub_name": "51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2021, Taipei, Taiwan, June 21-24, 2021.",
				"count": 49,
				"papers": [
					"Keynote I: Advances in memory state-preserving fault tolerance.",
					"A Low-cost Fault Corrector for Deep Neural Networks through Range Restriction.",
					"Toward Intrusion Tolerance as a Service: Confidentiality in Partially Cloud-Based BFT Systems.",
					"PID-Piper: Recovering Robotic Vehicles from Physical Attacks.",
					"GARFIELD: System Support for Byzantine Machine Learning (Regular Paper).",
					"Plinius: Secure and Persistent Machine Learning Model Training.",
					"Decamouflage: A Framework to Detect Image-Scaling Attacks on CNN.",
					"MILR: Mathematically Induced Layer Recovery for Plaintext Space Error Correction of CNNs.",
					"Fast IPv6 Network Periphery Discovery and Security Implications.",
					"A Comprehensive Study of Bugs in Software Defined Networks.",
					"Enabling Novel Interconnection Agreements with Path-Aware Networking Architectures.",
					"Self-Healing Protocol: Repairing Schedules Online after Link Failures in Time-Triggered Networks.",
					"The Master and Parasite Attack.",
					"PatchDB: A Large-Scale Security Patch Dataset.",
					"PDGraph: A Large-Scale Empirical Study on Project Dependency of Security Vulnerabilities.",
					"OCTOPOCS: Automatic Verification of Propagated Vulnerable Code Using Reformed Proofs of Concept.",
					"NVCache: A Plug-and-Play NVMM-based I/O Booster for Legacy Systems.",
					"K2: Reading Quickly from Storage Across Many Datacenters.",
					"Horus: Non-Intrusive Causal Analysis of Distributed Systems Logs.",
					"Asteria: Deep Learning-based AST-Encoding for Cross-platform Binary Code Similarity Detection.",
					"Sentiment Analysis based Error Detection for Large-Scale Systems.",
					"Time-Window Based Group-Behavior Supported Method for Accurate Detection of Anomalous Users.",
					"General Feature Selection for Failure Prediction in Large-scale SSD Deployment.",
					"Data-centric Reliability Management in GPUs.",
					"NVBitFI: Dynamic Fault Injection for GPUs.",
					"Revealing GPUs Vulnerabilities by Combining Register-Transfer and Software-Level Fault Injection.",
					"Examining Failures and Repairs on Supercomputers with Multi-GPU Compute Nodes.",
					"An Application Agnostic Defense Against the Dark Arts of Cryptojacking.",
					"Catch You With Cache: Out-of-VM Introspection to Trace Malicious Executions.",
					"Towards Optimal Use of Exception Handling Information for Function Detection.",
					"CloudSkulk: A Nested Virtual Machine Based Rootkit and Its Detection.",
					"FIRestarter: Practical Software Crash Recovery with Targeted Library-level Fault Injection.",
					"WazaBee: attacking Zigbee networks by diverting Bluetooth Low Energy chips.",
					"InjectaBLE: Injecting malicious traffic into established Bluetooth Low Energy connections.",
					"Glitching Demystified: Analyzing Control-flow-based Glitching Attacks and Defenses.",
					"Practical and Efficient in-Enclave Verification of Privacy Compliance.",
					"ADAM-CS: Advanced Asynchronous Monotonic Counter Service.",
					"EncDBDB: Searchable Encrypted, Fast, Compressed, In-Memory Database Using Enclaves.",
					"Conservative Confidence Bounds in Safety, from Generalised Claims of Improvement & Statistical Evidence.",
					"Model Checking the Multi-Formalism Language FIGARO.",
					"Avis: In-Situ Model Checking for Unmanned Aerial Vehicles.",
					"Data-driven Design of Context-aware Monitors for Hazard Prediction in Artificial Pancreas Systems.",
					"Sanitizing the IoT Cyber Security Posture: An Operational CTI Feed Backed up by Internet Measurements.",
					"Physics-Aware Security Monitoring against Structural Integrity Attacks in 3D Printers.",
					"Compromised Computers Meet Voice Assistants: Stealthily Exfiltrating Data as Voice over Telephony.",
					"BigMap: Future-proofing Fuzzers with Efficient Large Maps.",
					"When Program Analysis Meets Bytecode Search: Targeted and Efficient Inter-procedural Analysis of Modern Android Apps in BackDroid.",
					"Hiding in the Particles: When Return-Oriented Programming Meets Program Obfuscation.",
					"Statically Detecting JavaScript Obfuscation and Minification Techniques in the Wild."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2021s",
				"sub_name": "51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2021, Taipei, Taiwan, June 21-24, 2021 - Supplemental Volume.",
				"count": 26,
				"papers": [
					"Cleaning the NVD: Comprehensive Quality Assessment, Improvements, and Analyses.",
					"Systemically Evaluating the Robustness of ML-based IoT Malware Detectors.",
					"Detecting Operational Adversarial Examples for Reliable Deep Learning.",
					"Iteratively Checking Program Properties Involving Non-Boolean Values.",
					"Negotiating PQC for DNSSEC.",
					"Spatio-Temporal Split Learning.",
					"Mitigation of Automotive Control Modules Hardware Replacement-based Attacks Through Hardware Signature.",
					"Machine Learning Analysis of IP ID Applications.",
					"S-ADA: Software as an Autonomous, Dependable and Affordable System.",
					"Finding Web Application Vulnerabilities with an Ensemble Fuzzing.",
					"Towards Automated Software Testing with Generative Adversarial Networks.",
					"A Useful Parametric Family to Characterize NHPP-based Software Reliability Models.",
					"Model-based design, analysis and assessment framework for safety-critical systems.",
					"On The Local Sensitivity Analysis for Phase Expansion.",
					"Designing Adversarial Attack and Defence for Robust Android Malware Detection Models.",
					"AMD EPYC™ 7002 Series - A Processor with Improved Soft Error Resilience.",
					"Near-Realtime Server Reboot Monitoring and Root Cause Analysis in a Large-Scale System.",
					"The Importance of Safety Invariants in Robustness Testing Autonomy Systems.",
					"BACGraph: Automatic Extraction of Object Relationships in the BACnet Protocol.",
					"A Matter of Trust: Verification of Security and Performance for Network Platform as a Service.",
					"SymPLe: Complexity-Aware Design for Safety Critical I&C Systems.",
					"Hardware Support for Low-Cost Memory Safety.",
					"SERMiner : A Framework for Early-stage Reliability Estimation for IBM Processors.",
					"TQEA: Temporal Quantum Error Analysis.",
					"Overdrive Fault Attacks on GPUs.",
					"Simulation-based Fault Injection in Advanced Driver Assistance Systems Modelled in SUMO."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2021w",
				"sub_name": "51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2021, Taipei, Taiwan, June 21-24, 2021.",
				"count": 33,
				"papers": [
					"Third International Workshop on Data-Centric Dependability and Security (DCDS).",
					"7th International Workshop on Safety and Security of Intelligent Vehicles - SSIV 2021.",
					"International Workshop On Application of Intelligent Technology in Security - AITS 2021.",
					"Fourth International Workshop on Dependable and Secure Machine Learning - DSML 2021.",
					"Workshop on Safer Autonomous Systems: Special theme: safety-aware design and validation of autonomous systems.",
					"USB-IDS-1: a Public Multilayer Dataset of Labeled Network Flows for IDS Evaluation.",
					"SMS Goes Nuclear: Fortifying SMS-Based MFA in Online Account Ecosystem.",
					"Statistical Approach For Cloud Security: Microsoft Office 365 audit logs case study.",
					"Vehicular Platoon Communication: Cybersecurity Threats and Open Challenges.",
					"SaSeVAL: A Safety/Security-Aware Approach for Validation of Safety-Critical Systems.",
					"Suraksha: A Quantitative AV Safety Evaluation Framework to Analyze Safety Implications of Perception Design Choices.",
					"Evaluation of a Fail-Over Mechanism for 1oo2D Architectures in Highly-Automated Driving.",
					"Safety Verification of Neural Network Controlled Systems.",
					"Certifying Emergency Landing for Safe Urban UAV.",
					"CyberGSN: A Semi-formal Language for Specifying Safety Cases.",
					"A Safety Architecture for Centralized E/E Architectures.",
					"Ant Hole: Data Poisoning Attack Breaking out the Boundary of Face Cluster.",
					"Authenticating Mobile Wireless Device Through Per-packet Channel State Information.",
					"Whether the sensitive information statement of the IoT privacy policy is consistent with the actual behavior.",
					"BBregLocator: A Vulnerability Detection System Based on Bounding Box Regression.",
					"Insight into traffic security: A correlation discovery of urban spatial features and traffic flow patterns.",
					"Automatically Constructing Peer Slices via Semanticand Context-Aware Security Checks in the Linux Kernel.",
					"Detection Algorithm of the Mimicry Attack based on Variational Auto-Encoder.",
					"Sensitive Instruction Detection Based on the Context of IoT Sensors.",
					"Network Intrusion Detection Based on Active Semi-supervised Learning.",
					"A Statistical Learning Model with Deep Learning Characteristics.",
					"A Queueing Analysis of Multi-model Multi-input Machine Learning Systems.",
					"An Approach for Peer-to-Peer Federated Learning.",
					"Poisoning Attacks via Generative Adversarial Text to Image Synthesis.",
					"Fault-Tolerant Low-Precision DNNs using Explainable AI.",
					"Byzantine Fault-Tolerant Distributed Machine Learning with Norm-Based Comparative Gradient Elimination.",
					"RADICS: Runtime Assurance of Distributed Intelligent Control Systems.",
					"Detecting Deep Neural Network Defects with Data Flow Analysis."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "50th DSN 2020",
		"info": "Valencia, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2020",
				"sub_name": "50th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2020, Valencia, Spain, June 29 - July 2, 2020.",
				"count": 48,
				"papers": [
					"KShot: Live Kernel Patching with SMM and SGX.",
					"CDN Backfired: Amplification Attacks Based on HTTP Range Requests.",
					"Online Payments by Merely Broadcasting Messages.",
					"Comprehensive Java Metadata Tracking for Attack Detection and Repair.",
					"TraceSanitizer - Eliminating the Effects of Non-Determinism on Error Propagation Analysis.",
					"JSKernel: Fortifying JavaScript against Web Concurrency Attacks via a Kernel-Like Structure.",
					"Scarecrow: Deactivating Evasive Malware via Its Own Evasive Logic.",
					"CATI: Context-Assisted Type Inference from Stripped Binaries.",
					"PolygraphMR: Enhancing the Reliability and Dependability of CNNs.",
					"ML-Driven Malware that Targets AV Safety.",
					"Leaky DNN: Stealing Deep-Learning Model Secret with GPU Context-Switching Side-Channel.",
					"An Experimental Study of Reduced-Voltage Operation in Modern FPGAs for Neural Network Acceleration.",
					"Quantifying DNN Model Robustness to the Real-World Threats.",
					"The Mystery of the Failing Jobs: Insights from Operational Data from Two University-Wide Computing Systems.",
					"Reliable, Efficient Recovery for Complex Services with Replicated Subsystems.",
					"HAMS: High Availability for Distributed Machine Learning Service Graphs.",
					"Fine-Grained Fault Tolerance for Resilient pVM-Based Virtual Machine Monitors.",
					"Data-Driven Model-Based Analysis of the Ethereum Verifier's Dilemma.",
					"SMACS: Smart Contract Access Control Service.",
					"Smart Contracts on the Move.",
					"Impact of Geo-Distribution and Mining Pools on Blockchains: A Study of Ethereum.",
					"Ephemeral Exit Bridges for Tor.",
					"The Impact of DNS Insecurity on Time.",
					"Depending on HTTP/2 for Privacy? Good Luck!",
					"Diving into Email Bomb Attack.",
					"HardSnap: Leveraging Hardware Snapshotting for Embedded Systems Security Testing.",
					"iScanU: A Portable Scanner for Undocumented Instructions on RISC Processors.",
					"Libspector : Context-Aware Large-Scale Network Traffic Analysis of Android Applications.",
					"Foosball Coding: Correcting Shift Errors and Bit Flip Errors in 3D Racetrack Memory.",
					"Extreme Protection Against Data Loss with Single-Overlap Declustered Parity.",
					"Chaser: An Enhanced Fault Injection Tool for Tracing Soft Errors in MPI Applications.",
					"ProFIPy: Programmable Software Fault Injection as-a-Service.",
					"Hybrid Firmware Analysis for Known Mobile and IoT Security Vulnerabilities.",
					"Real-Time Context-Aware Detection of Unsafe Events in Robot-Assisted Surgery.",
					"Scalable Approach to Enhancing ICS Resilience by Network Diversity.",
					"Cross-App Interference Threats in Smart Homes: Categorization, Detection and Handling.",
					"From Byzantine Replication to Blockchain: Consensus is Only the Beginning.",
					"EPIC: Efficient Asynchronous BFT with Adaptive Security.",
					"On Incentive Compatible Role-Based Reward Distribution in Algorand.",
					"FSTR: Funds Skewness Aware Transaction Routing for Payment Channel Networks.",
					"SeGShare: Secure Group File Sharing in the Cloud using Enclaves.",
					"Omega: a Secure Event Ordering Service for the Edge.",
					"Trust Management as a Service: Enabling Trusted Execution in the Face of Byzantine Stakeholders.",
					"UPA: An Automated, Accurate and Efficient Differentially Private Big-Data Mining System.",
					"Enhancing Reliability-Aware Speedup Modelling via Replication.",
					"Service-Based Resilience for Embedded IoT Networks.",
					"Mining Multivariate Discrete Event Sequences for Knowledge Discovery and Anomaly Detection.",
					"Learning to Reliably Deliver Streaming Data with Apache Kafka."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2020s",
				"sub_name": "50th Annual IEEE-IFIP International Conference on Dependable Systems and Networks, DSN 2020, Valencia, Spain, June 29 - July 2, 2020 - Supplemental Volume.",
				"count": 35,
				"papers": [
					"Robustness Inside Out Testing.",
					"Towards Host Intrusion Detection for Embedded Industrial Systems.",
					"The Monitor as Key Architecture Element for Safe Self-Driving Cars.",
					"Predicting Remediations for Hardware Failures in Large-Scale Datacenters.",
					"ZTE-Predictor: Disk Failure Prediction System Based on LSTM.",
					"Neuraltran: Optimal Data Transformation for Privacy-Preserving Machine Learning by Leveraging Neural Networks.",
					"Simulating Reliability of IoT Networks with RelIoT.",
					"Performance-Aware Wi-Fi Problem Diagnosis and Mitigation through Peer-to-Peer Data Sharing.",
					"Fundamental Challenges of Cyber-Physical Systems Security Modeling.",
					"Ontology Configuration Management for Knowledge-Centric Systems Engineering in Industry.",
					"Secure Consensus Generation with Distributed DoH.",
					"Design and Performance Analysis of Software Defined Networking Based Web Services Adopting Moving Target Defense.",
					"Tomographic Measuring Sensors System for Analysis and Visualization of Technological Processes.",
					"MPC for Securing Internet Infrastructure.",
					"Pitfalls of Provably Secure Systems in Internet the Case of Chronos-NTP.",
					"SIMBA: An Efficient Simulator for Blockchain Applications.",
					"Fault Tree Analysis: Identifying Maximum Probability Minimal Cut Sets with MaxSAT.",
					"Impact of Coding Styles on Behaviours of Static Analysis Tools for Web Applications.",
					"A Novel Graphical Security Model for Evolving Cyber Attacks in Internet of Things.",
					"The Effect of Motion on PPG Heart Rate Sensors.",
					"Reliability Analysis of Edge Scenarios Using Pedestrian Mobility.",
					"Improving the Dependability of the ECG Signal for Classification of Heart Diseases.",
					"Safeguarding Data Consistency at the Edge.",
					"Depending on HTTP/2 for Privacy? Good Luck!",
					"Towards Practical Privacy-Preserving Collaborative Machine Learning at a Scale.",
					"What Exactly Determines the Type? Inferring Types with Context.",
					"Impact of Geo-Distribution and Mining Pools on Blockchains: A Study of Ethereum - Practical Experience Report and Ongoing PhD Work.",
					"CanvasMirror: Secure Integration of Third-Party Libraries in a WebVR Environment.",
					"A Framework for Risk Assessment in Augmented Reality-Equipped Socio-Technical Systems.",
					"Cross-Layer Soft-Error Resilience Analysis of Computing Systems.",
					"The InterPlanetary File System and the Filecoin Network.",
					"Into the Unknown: Unsupervised Machine Learning Algorithms for Anomaly-Based Intrusion Detection.",
					"Software-Only Triple Diverse Redundancy on GPUs for Autonomous Driving Platforms.",
					"A Machine Learning-Based Error Model of Voltage-Scaled Circuits.",
					"An Overview of the Risk Posed by Thermal Neutrons to the Reliability of Computing Devices."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2020w",
				"sub_name": "50th Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2020, Valencia, Spain, June 29 - July 2, 2020.",
				"count": 25,
				"papers": [
					"Third International Workshop on Dependable and Secure Machine Learning - DSML 2020.",
					"Workshop on High-performance Computing Platforms for Dependable Autonomous Systems.",
					"Second International Workshop on Data-Centric Dependability and Security (DCDS).",
					"6th International Workshop on Safety and Security of Intelligent Vehicles - SSIV 2020.",
					"TAaMR: Targeted Adversarial Attack against Multimedia Recommender Systems.",
					"On The Generation of Unrestricted Adversarial Examples.",
					"Blackbox Attacks on Reinforcement Learning Agents Using Approximated Temporal Information.",
					"PyTorchFI: A Runtime Perturbation Tool for DNNs.",
					"Online Verification through Model Checking of Medical Critical Intelligent Systems.",
					"BlurNet: Defense by Filtering the Feature Maps.",
					"Association Rule Mining with Differential Privacy.",
					"Pelican: A Deep Residual Network for Network Intrusion Detection.",
					"Open Source Hardware: An Opportunity For Critical Systems.",
					"Development of a NOEL-V RISC-V SoC Targeting Space Applications.",
					"Safe and secure software updates on high-performance embedded systems.",
					"Approaching certification of complex systems.",
					"AI Safety Landscape From short-term specific system engineering to long-term artificial general intelligence.",
					"AI and Reliability Trends in Safety-Critical Autonomous Systems on Ground and Air.",
					"Reward Tuning for self-adaptive Policy in MDP based Distributed Decision-Making to ensure a Safe Mission Planning.",
					"The Quantitative Risk Norm - A Proposed Tailoring of HARA for ADS.",
					"Analysis of Cybersecurity Mechanisms with respect to Dependability and Security Attributes.",
					"Exploring Fault Parameter Space Using Reinforcement Learning-based Fault Injection.",
					"Flexible Deployment and Enforcement of Flight and Privacy Restrictions for Drone Applications.",
					"Conceptual Design of Human-Drone Communication in Collaborative Environments.",
					"A hierarchical fault tolerant architecture for an autonomous robot."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "49th DSN 2019",
		"info": "Portland, Oregon, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2019",
				"sub_name": "49th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2019, Portland, OR, USA, June 24-27, 2019.",
				"count": 54,
				"papers": [
					"GreenFlag: Protecting 3D-Racetrack Memory from Shift Errors.",
					"Understanding and Modeling On-Die Error Correction in Modern DRAM: An Experimental Study Using Real Devices.",
					"Demystifying Soft Error Assessment Strategies on ARM CPUs: Microarchitectural Fault Injection vs. Neutron Beam Experiments.",
					"A Multiversion Programming Inspired Approach to Detecting Audio Adversarial Examples.",
					"Classifying Malware Represented as Control Flow Graphs using Deep Graph Convolutional Neural Network.",
					"ZK-GanDef: A GAN Based Zero Knowledge Adversarial Training Defense for Neural Networks.",
					"Efficient Treatment of Uncertainty in System Reliability Analysis using Importance Measures.",
					"Extensions of Network Reliability Analysis.",
					"An Online Approach to Estimate Parameters of Phase-Type Distributions.",
					"ML-Based Fault Injection for Autonomous Vehicles: A Case for Bayesian Fault Injection.",
					"Deep Validation: Toward Detecting Real-World Corner Cases for Deep Neural Networks.",
					"SOTER: A Runtime Assurance Framework for Programming Safe Robotics Systems.",
					"OneFile: A Wait-Free Persistent Transactional Memory.",
					"Sparkle: Speculative Deterministic Concurrency Control for Partially Replicated Transactional Stores.",
					"White-Box Atomic Multicast.",
					"Fault Tolerance Through Redundant Execution on COTS Multicores: Exploring Trade-Offs.",
					"ParaMedic: Heterogeneous Parallel Error Correction.",
					"gem5-Approxilyzer: An Open-Source Tool for Application-Level Soft Error Analysis.",
					"Your IoTs Are (Not) Mine: On the Remote Binding Between IoT Devices and Users.",
					"BenchIoT: A Security Benchmark for the Internet of Things.",
					"Exploiting Memory Corruption Vulnerabilities in Connman for IoT Devices.",
					"Rigorous, Effortless and Timely Assessment of Cellular Network Changes.",
					"An Eventually Perfect Failure Detector for Networks of Arbitrary Topology Connected with ADD Channels Using Time-To-Live Values.",
					"Bonsai: Efficient Fast Failover Routing Using Small Arborescences.",
					"SATIN: A Secure and Trustworthy Asynchronous Introspection on Multi-Core ARM Processors.",
					"DeviceVeil: Robust Authentication for Individual USB Devices Using Physical Unclonable Functions.",
					"Multilayer ROP Protection Via Microarchitectural Units Available in Commodity Hardware.",
					"Deploying Intrusion-Tolerant SCADA for the Power Grid.",
					"Reaching Data Confidentiality and Model Accountability on the CalTrain.",
					"Tell Me More Than Just Assembly! Reversing Cyber-Physical Execution Semantics of Embedded IoT Controller Software Binaries.",
					"Exploiting Latency and Error Tolerance of GPGPU Applications for an Energy-Efficient DRAM.",
					"Leveraging Transverse Reads to Correct Alignment Faults in Domain Wall Memories.",
					"SuDoku: Tolerating High-Rate of Transient Failures for Enabling Scalable STTRAM.",
					"NeXUS: Practical and Secure Access Control on Untrusted Storage Platforms using Client-Side SGX.",
					"TEE-Perf: A Profiler for Trusted Execution Environments.",
					"EPA-RIMM : An Efficient, Performance-Aware Runtime Integrity Measurement Mechanism for Modern Server Platforms.",
					"Pseudo-Honeypot: Toward Efficient and Scalable Spam Sniffer.",
					"Controller-Oblivious Dynamic Access Control in Software-Defined Networks.",
					"BorderPatrol: Securing BYOD using Fine-Grained Contextual Information.",
					"Characterizing and Understanding HPC Job Failures Over The 2K-Day Life of IBM BlueGene/Q System.",
					"Detecting \"0-Day\" Vulnerability: An Empirical Study of Secret Security Patch in OSS.",
					"Where Are You Taking Me? Behavioral Analysis of Open DNS Resolvers.",
					"POLaR: Per-Allocation Object Layout Randomization.",
					"The Strength of Weak Randomization: Easily Deployable, Efficiently Searchable Encryption with Minimal Leakage.",
					"HeapTherapy+: Efficient Handling of (Almost) All Heap Vulnerabilities Using Targeted Calling-Context Encoding.",
					"FabZK: Supporting Privacy-Preserving, Auditable Smart Contracts in Hyperledger Fabric.",
					"Fast Predictive Repair in Erasure-Coded Storage.",
					"SBFT: A Scalable and Decentralized Trust Infrastructure.",
					"UChecker: Automatically Detecting PHP-Based Unrestricted File Upload Vulnerabilities.",
					"PrivAnalyzer: Measuring the Efficacy of Linux Privilege Use.",
					"1dVul: Discovering 1-Day Vulnerabilities through Binary Patches.",
					"Revisiting Client Puzzles for State Exhaustion Attacks Resilience.",
					"Robust Anomaly Detection on Unreliable Data.",
					"Pupillography as Indicator of Programmers' Mental Effort and Cognitive Overload."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2019i",
				"sub_name": "49th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN (Industry Track) 2019, Portland, OR, USA, June 24-27, 2019.",
				"count": 7,
				"papers": [
					"Detecting Failures of Neural Machine Translation in the Absence of Reference Translations.",
					"A Parser for Deep Packet Inspection of IEC-104: A Practical Solution for Industrial Applications.",
					"Detecting Attacks Against Safety-Critical ADAS Based on In-Vehicle Network Message Patterns.",
					"LAB to SOC: Robust Features for Dynamic Malware Detection.",
					"Characterizing and Modeling Reliability of Declustered RAID for HPC Storage Systems.",
					"System Restore in a Multi-cloud Data Pipeline Platform.",
					"Neferion: Time Bound, Fail-Safe and Deterministic Propagation of Network Connectivity Policies Across Large Multi-datacenter Networks."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2019s",
				"sub_name": "49th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2019, Portland, OR, USA, June 24-27, 2019, Supplemental Volume.",
				"count": 17,
				"papers": [
					"Automatically Validating the Effectiveness of Software Diversity Schemes.",
					"Privacy-Preserving Deep Learning Computation for Geo-Distributed Medical Big-Data Platforms.",
					"A Quantitative Approach for Medical Imaging Device Security Assessment.",
					"The STAR-Guardian Network for the Protection of Long-Life Cyber-Physical Systems.",
					"Privacy and Security of Connected Vehicles in Intelligent Transportation System.",
					"Towards Cognitive Security Defense from Data.",
					"Towards Predicting the Impact of Roll-Forward Failure Recovery for HPC Applications.",
					"SDN-Based IP Shuffling Moving Target Defense with Multiple SDN Controllers.",
					"Consistent BFT Performance for Blockchains.",
					"Bayesian Neural Network Based Encrypted Traffic Classification using Initial Handshake Packets.",
					"P4AIG: Circuit-Level Verification of P4 Programs.",
					"Short-Liveness of Error Propagation in Kernel Can Improve Operating Systems Availability.",
					"Towards a Bayesian Approach for Assessing Fault Tolerance of Deep Neural Networks.",
					"Retrospectively Documenting SAFEGUARD's Possession of the Overarching Properties.",
					"On the Trend of Resilience for GPU-Dense Systems.",
					"On the Estimation of Complex Circuits Functional Failure Rate by Machine Learning Techniques.",
					"Generation of Stressmarks for Early Stage Soft-Error Modeling."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2019w",
				"sub_name": "49th Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2019, Portland, OR, USA, June 24-27, 2019.",
				"count": 15,
				"papers": [
					"Enhancing Information Sharing and Visualization Capabilities in Security Data Analytic Platforms.",
					"Design of a Classification Model for a Twitter-Based Streaming Threat Monitor.",
					"System Misuse Detection Via Informed Behavior Clustering and Modeling.",
					"Adversarial Video Captioning.",
					"Malware Evasion Attack and Defense.",
					"Mixed Strategy Game Model Against Data Poisoning Attacks.",
					"NV-DNN: Towards Fault-Tolerant DNN Systems with N-Version Programming.",
					"N-Version Machine Learning Models for Safety Critical Systems.",
					"Novelty Detection via Network Saliency in Visual-Based Deep Learning.",
					"Using Intuition from Empirical Properties to Simplify Adversarial Training Defense.",
					"Component-Level ASIL Decomposition for Automotive Architectures.",
					"Autonomous Maneuver Coordination Via Vehicular Communication.",
					"Reliability-Driven Task Assignment in Vehicular Crowdsourcing: A Matching Game.",
					"Predictive Runtime Simulation for Building Trust in Cooperative Autonomous Systems.",
					"Enabling Security Checking of Automotive ECUs with Formal CSP Models."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "48th DSN 2018",
		"info": "Luxembourg City, Luxembourg",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2018",
				"sub_name": "48th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2018, Luxembourg City, Luxembourg, June 25-28, 2018.",
				"count": 62,
				"papers": [
					"Wren: Nonblocking Reads in a Partitioned Transactional Causally Consistent Data Store.",
					"Code-Dependent and Architecture-Dependent Reliability Behaviors.",
					"Modeling Soft-Error Propagation in Programs.",
					"Byzantine Fault-Tolerant Atomic Multicast.",
					"A Byzantine Fault-Tolerant Ordering Service for the Hyperledger Fabric Blockchain Platform.",
					"Troxy: Transparent Access to Byzantine Fault-Tolerant Systems.",
					"RDMC: A Reliable RDMA Multicast for Large Objects.",
					"Shiraz: Exploiting System Reliability and Application Resilience Characteristics to Improve Large Scale System Throughput.",
					"Machine Learning Models for GPU Error Prediction in a Large Scale HPC System.",
					"Understanding and Analyzing Interconnect Errors and Network Congestion on a Large Scale HPC System.",
					"Fast Hypervisor Recovery Without Reboot.",
					"ZOE: Content-Based Anomaly Detection for Industrial Control Systems.",
					"Cost-Benefit Analysis of Moving-Target Defense in Power Grids.",
					"Algorithmic Attack Synthesis Using Hybrid Dynamics of Power Grid Critical Infrastructures.",
					"On the Challenges of Building a BFT SCADA.",
					"RECAST: Random Entanglement for Censorship-Resistant Archival STorage.",
					"Alpha Entanglement Codes: Practical Erasure Codes to Archive Data in Unreliable Environments.",
					"Migrating SGX Enclaves with Persistent State.",
					"IBBE-SGX: Cryptographic Group Access Control Using Trusted Execution Environments.",
					"OWL: Understanding and Detecting Concurrency Attacks.",
					"FAROS: Illuminating In-memory Injection Attacks via Provenance-Based Whole-System Dynamic Information Flow Tracking.",
					"To Detect Stack Buffer Overflow with Polymorphic Canaries.",
					"Network-Attack-Resilient Intrusion-Tolerant SCADA for the Power Grid.",
					"Branching Bisimulation and Concurrent Object Verification.",
					"Modeling Input-Dependent Error Propagation in Programs.",
					"Efficient Transient Analysis of a Class of Compositional Fluid Stochastic Petri Nets.",
					"Importance Sampling of Interval Markov Chains.",
					"Low Overhead Tag Error Mitigation for GPU Architectures.",
					"DAVOS: EDA Toolkit for Dependability Assessment, Verification, Optimisation and Selection of Hardware Models.",
					"A Framework for Evaluating Software on Reduced Margins Hardware.",
					"Parallel Error Detection Using Heterogeneous Cores.",
					"Measuring IPv6 DNS Reconnaissance Attacks and Preventing Them Using DNS Guard.",
					"Your Remnant Tells Secret: Residual Resolution in DDoS Protection Services.",
					"Effective Topology Tampering Attacks and Defenses in Software-Defined Networks.",
					"EndBox: Scalable Middlebox Functions Using Client-Side Trusted Execution.",
					"FragDroid: Automated User Interface Interaction with Activity and Fragment Analysis in Android Applications.",
					"How Reliable is My Wearable: A Fuzz Testing-Based Study.",
					"Localizing Function Errors in Mobile Apps with User Reviews.",
					"DTaint: Detecting the Taint-Style Vulnerability in Embedded Device Firmware.",
					"Deceptive Secret Sharing.",
					"MobiCeal: Towards Secure and Practical Plausibly Deniable Encryption on Mobile Devices.",
					"Collaborative Filtering Under a Sybil Attack: Similarity Metrics do Matter!",
					"Specification-Based Protocol Obfuscation.",
					"Obfuscated VBA Macro Detection Using Machine Learning.",
					"Evaluating Self-Adaptive Authorisation Infrastructures Through Gamification.",
					"POWERALERT: Integrity Checking Using Power Measurement and a Game-Theoretic Strategy.",
					"Generating Cloud Monitors from Models to Secure Clouds.",
					"Falcon: A Practical Log-Based Analysis Tool for Distributed Systems.",
					"Pleiades: Distributed Structural Invariants at Scale.",
					"The Tortoise and the Hare: Characterizing Synchrony in Distributed Environments (Practical Experience Report).",
					"Inferring, Characterizing, and Investigating Internet-Scale Malicious IoT Device Activities: A Network Telescope Perspective.",
					"RoboADS: Anomaly Detection Against Sensor and Actuator Misbehaviors in Mobile Robots.",
					"Hands Off the Wheel in Autonomous Vehicles?: A Systems Perspective on over a Million Miles of Field Data.",
					"Impact of Software Approximations on the Resiliency of a Video Summarization System.",
					"Detecting and Identifying Faulty IoT Devices in Smart Home with Context Extraction.",
					"Divide and Conquer for Fast SRLG Disjoint Routing.",
					"Practical Experience: Methodologies for Measuring Route Origin Validation.",
					"In Production Performance Testing of SDN Control Plane for Telecom Operators.",
					"A Reexamination of Internationalized Domain Names: The Good, the Bad and the Ugly.",
					"Manufacturing Resilient Bi-Opaque Predicates Against Symbolic Execution.",
					"PreInfer: Automatic Inference of Preconditions via Symbolic Analysis.",
					"DexLego: Reassembleable Bytecode Extraction for Aiding Static Analysis."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2018w",
				"sub_name": "48th Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2018, Luxembourg, June 25-28, 2018.",
				"count": 64,
				"papers": [
					"Foreword for the Industry Track.",
					"Autonomous Driving System : Model Based Safety Analysis.",
					"Measuring and Exploiting Guardbands of Server-Grade ARMv8 CPU Cores and DRAMs.",
					"Hardening the Core: Understanding and Detection of XNU Kernel Vulnerabilities.",
					"Hardware Remediation at Scale.",
					"Cross-Stack Threat Sensing for Cyber Security and Resilience.",
					"Lifeguard: Local Health Awareness for More Accurate Failure Detection.",
					"Diagnosing Failures of Cloud Management Actions.",
					"ConfEx: Towards Automating Software Configuration Analytics in the Cloud.",
					"A Large-Scale System for Real-Time Glucose Monitoring.",
					"Challenges of DB2 Restore in a Distributed Systems Environment and Engineered Solutions.",
					"Dependability in a Multi-tenant Multi-framework Deep Learning as-a-Service Platform.",
					"EUBra-BIGSEA, A Cloud-Centric Big Data Scientific Research Platform.",
					"SWAMP: Smart Water Management Platform Overview and Security Challenges.",
					"ATMOSPHERE: Adaptive, Trustworthy, Manageable, Orchestrated, Secure, Privacy-Assuring, Hybrid Ecosystem for REsilient Cloud Computing.",
					"SecureCloud: Secure Big Data Processing in Untrusted Clouds.",
					"AVFI: Fault Injection for Autonomous Vehicles.",
					"Reconfiguration Strategies for Critical Adaptive Distributed Embedded Systems.",
					"Towards Lightweight Temporal and Fault Isolation in Mixed-Criticality Systems with Real-Time Containers.",
					"Finding Top-k Most Frequent Items in Distributed Streams in the Time-Sliding Window Model.",
					"Mixing Time and Spatial Redundancy Over Time Sensitive Networking.",
					"Stateless Security Risk Assessment for Dynamic Networks.",
					"Using Diverse Detectors for Detecting Malicious Web Scraping Activity.",
					"On Verifying and Assuring the Cloud SLA by Evaluating the Performance of SaaS Web Services Across Multi-cloud Providers.",
					"Sources of Variation in Error Sensitivity Measurements, Significant or Not?",
					"Towards Dynamic End-to-End Privacy Preserving Data Classification.",
					"HIT: Hybrid-Mode Information Flow Tracking with Taint Semantics Extraction and Replay.",
					"An Analysis of Automated Software Diversity Using Unstructured Text Analytics.",
					"Random Mining Group Selection to Prevent 51% Attacks on Bitcoin.",
					"PRESEnCE: A Framework for Monitoring, Modelling and Evaluating the Performance of Cloud SaaS Web Services.",
					"Mu-Transaction Sagas in Derecho.",
					"Enhanced Dependability Evaluation Through Krylov Methods and Matrix Functions: The Case of Load-Sharing Systems.",
					"Design, Development and Implementation of a Network Intrusion Detection Tool for Air Traffic Management Systems.",
					"Best of SELSE 2018 Introduction.",
					"Hamartia: A Fast and Accurate Error Injection Framework.",
					"Low Cost Transient Fault Protection Using Loop Output Prediction.",
					"Parity++: Lightweight Error Correction for Last Level Caches.",
					"BCRB 2018 introduction.",
					"Protecting Early Stage Proof-of-Work Based Public Blockchain.",
					"Challenges and Pitfalls of Partitioning Blockchains.",
					"Towards Model-Driven Engineering of Smart Contracts for Cyber-Physical Systems.",
					"Latency-Aware Leader Selection for Geo-Replicated Byzantine Fault-Tolerant Systems.",
					"Towards Low-Latency Byzantine Agreement Protocols Using RDMA.",
					"Visualizing BFT SMR Distributed Systems - Example of BFT-SMaRt.",
					"Dynamic State Partitioning in Parallelized Byzantine Fault Tolerance.",
					"CERTS 2018 Introduction.",
					"A Systematic Way to Incorporate Security in Safety Analysis.",
					"Design for Dependability Through Error Propagation Space Exploration.",
					"Validating and Securing DLMS/COSEM Implementations with the ValiDLMS Framework.",
					"Real-Time Security Through a TEE.",
					"DSML 2018 Introduction.",
					"Fairness and Transparency of Machine Learning for Trustworthy Cloud Services.",
					"Model, Data and Reward Repair: Trusted Machine Learning for Markov Decision Processes.",
					"On the Limitation of MagNet Defense Against L1-Based Adversarial Examples.",
					"DCN: Detector-Corrector Network Against Evasion Attacks on Deep Neural Networks.",
					"SSIV 2018 Introduction.",
					"Risk Assessment and Security Countermeasures for Vehicular Instrument Clusters.",
					"Detection of Automotive CAN Cyber-Attacks by Identifying Packet Timing Anomalies in Time Windows.",
					"Fuzz Testing for Automotive Cyber-Security.",
					"Evaluating Optical Flow Vectors Under Varying Computer-Generated Snow Intensities and Pixel Density for Autonomous Vehicles.",
					"Prototyping Automotive Smart Ecosystems.",
					"Model-Based Dependability Analysis of Unmanned Aerial Vehicles - A Case Study.",
					"On the Safety of Automotive Systems Incorporating Machine Learning Based Components: A Position Paper.",
					"FMEDA-Based Fault Injection and Data Analysis in Compliance with ISO-26262."
				]
			},
			{
				"sub_name_abbr": "conf/hipeac/2018mils",
				"sub_name": "International Workshop on MILS: Architecture and Assurance for Secure Systems, MILS@DSN 2018, Luxembourg, June 25, 2018.",
				"count": 8,
				"papers": [
					"A Platform Approach for Fusing Safety and Security on a Solid Foundation.",
					"Classic and Adaptive AUTOSAR in MILS terms.",
					"Enabling Civil/Military Cooperation in Crisis Management.",
					"A Reference Architecture for Integrating Safety and Security Applications on Railway Command and Control Systems.",
					"In Search for a Simple Secure Protocol for Safety-Critical High-Assurance Applications.",
					"Cybersecurity in the Railway Sector.",
					"A Model-based Approach to Certification of Adaptive MILS.",
					"Towards adaptive MILS System: Model- Based Design, Verification and Run-Time Adaptation: Slides."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "47th DSN 2017",
		"info": "Denver, CO, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2017",
				"sub_name": "47th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2017, Denver, CO, USA, June 26-29, 2017.",
				"count": 55,
				"papers": [
					"Information Leakage in Encrypted Deduplication via Frequency Analysis.",
					"Privacy Disclosure through Smart Meters: Reactive Power Based Attack and Defense.",
					"What Can We Learn from Four Years of Data Center Hardware Failures?",
					"Fast Atomic Multicast.",
					"Speeding up Consensus by Chasing Fast Decisions.",
					"Secure Causal Atomic Broadcast, Revisited.",
					"Reducing the \"Tax\" of Reliability: A Hardware-Aware Method for Agile Data Persistence in Mobile Devices.",
					"Exploring the Potential for Collaborative Data Compression and Hard-Error Tolerance in PCM Memories.",
					"One Bit is (Not) Enough: An Empirical Study of the Impact of Single and Multiple Bit-Flip Errors.",
					"StatSym: Vulnerable Path Discovery through Statistics-Guided Symbolic Execution.",
					"Dependability-Aware Design Space Exploration for Optimal Synthesis Parameters Tuning.",
					"pbSE: Phase-Based Symbolic Execution.",
					"IM-Visor: A Pre-IME Guard to Prevent IME Apps from Stealing Sensitive Keystrokes Using TrustZone.",
					"Rollback and Forking Detection for Trusted Execution Environments Using Lightweight Collective Memory.",
					"Secure Tera-scale Data Crunching with a Small TCB.",
					"Concolic Execution on Small-Size Binaries: Challenges and Empirical Study.",
					"Towards Automated Discovery of Crash-Resistant Primitives in Binary Executables.",
					"Function Interface Analysis: A Principled Approach for Function Recognition in COTS Binaries.",
					"Multimodal Indexable Encryption for Mobile Cloud-Based Applications.",
					"Secure Live Migration of SGX Enclaves on Untrusted Cloud.",
					"ContainerLeaks: Emerging Security Threats of Information Leakages in Container Clouds.",
					"Athena: A Framework for Scalable Anomaly Detection in Software-Defined Networks.",
					"Multi-level Anomaly Detection in Industrial Control Systems via Package Signatures and LSTM Networks.",
					"Random Walk Based Fake Account Detection in Online Social Networks.",
					"Towards Secure and Verifiable Database-Driven Spectrum Sharing.",
					"Implicit Smartphone User Authentication with Sensors and Contextual Machine Learning.",
					"Sensor-Based Implicit Authentication of Smartphone Users.",
					"REMAX: Reachability-Maximizing P2P Detection of Erroneous Readings in Wireless Sensor Networks.",
					"Agora: A Dependable High-Performance Coordination Service for Multi-cores.",
					"Load-Optimal Local Fast Rerouting for Resilient Networks.",
					"JMake: Dependable Compilation for Kernel Janitors.",
					"Counting in the Dark: DNS Caches Discovery and Enumeration in the Internet.",
					"Entropy-Based Security Analytics: Measurements from a Critical Information System.",
					"Exploring the Long Tail of (Malicious) Software Downloads.",
					"Ghost Installer in the Shadow: Security Analysis of App Installation on Android.",
					"DyDroid: Measuring Dynamic Code Loading and Its Security Implications in Android Applications.",
					"JGRE: An Analysis of JNI Global Reference Exhaustion Vulnerabilities in Android.",
					"I Know Nothing about You But Here is What You Might Like.",
					"What You See is Not What You Get! Thwarting Just-in-Time ROP with Chameleon.",
					"DynaMiner: Leveraging Offline Infection Analytics for On-the-Wire Malware Detection.",
					"Statistical Model Checking for Hybrid Petri Nets with Multiple General Transitions.",
					"Deadline-Aware Multipath Communication: An Optimization Problem.",
					"Regular: Attacker-Induced Traffic Flow Instability in a Stream of Semi-Automated Vehicles.",
					"Smart Maintenance via Dynamic Fault Tree Analysis: A Case Study on Singapore MRT System.",
					"RL-BLH: Learning-Based Battery Control for Cost Savings and Privacy Preservation for Smart Meters.",
					"Compromising Security of Economic Dispatch in Power System Operations.",
					"Fex: A Software Systems Evaluator.",
					"Demonstrating a Tool for Injection Attack Prevention in MySQL.",
					"Zipr: Efficient Static Binary Rewriting for Security.",
					"ATTAIN: An Attack Injection Framework for Software-Defined Networking.",
					"The Balance Attack or Why Forkable Blockchains are Ill-Suited for Consortium.",
					"Voiceprint: A Novel Sybil Attack Detection Method Based on RSSI for VANETs.",
					"Analysing Selfishness Flooding with SEINE.",
					"Detecting Passive Cheats in Online Games via Performance-Skillfulness Inconsistency.",
					"Analyzing Operational Behavior of Stateful Protocol Implementations for Detecting Semantic Bugs."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2017w",
				"sub_name": "47th Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2017, Denver, CO, USA, June 26-29, 2017.",
				"count": 41,
				"papers": [
					"SSIV 2017 Welcome.",
					"Safe Landing of Fixed Wing UAVs.",
					"Byzantine Agreement Service for Cooperative Wireless Embedded Systems.",
					"Assuring Fully Autonomous Vehicles Safety by Design: The Autonomous Vehicle Control (AVC) Module Strategy.",
					"Deterministic Ethernet: Addressing the Challenges of Asynchronous Sensing in Sensor Fusion Systems.",
					"Towards Adaptive Fault Tolerance on ROS for Advanced Driver Assistance Systems.",
					"Threat Intelligence for Bluetooth-Enabled Systems with Automotive Applications: An Empirical Study.",
					"RADIANCE Welcome.",
					"Discovering and Mitigating New Attack Paths Using Graphical Security Models.",
					"Evaluating Security and Availability of Multiple Redundancy Designs when Applying Security Patches.",
					"Quantitative Evaluation of QoS Prediction in IoT.",
					"An Integrated Approach for Resilience in Industrial Control Systems.",
					"Towards an Ontology-Based Definition of Data Anonymization Policy for Cloud Computing and Big Data.",
					"MARITACA: From Textual Use Case Descriptions to Behavior Models.",
					"RSVP: Soft Error Resilient Power Savings at Near-Threshold Voltage Using Register Vulnerability.",
					"Software-Defined HoneyNet: Towards Mitigating Link Flooding Attacks.",
					"TDSC: Two-Stage DDoS Detection and Defense System Based on Clustering.",
					"The Many Conflicting Visions of 'Safety Case'.",
					"RFID Tag Grouping Protocols Made Private.",
					"Off-Path Caching for File Versioning in Named Data Networking.",
					"Portable SDN Testbed Prototype.",
					"A Framework for SDN Network Evaluation.",
					"Document Faults: An Extension of the Taxonomy of Dependable and Secure Computing.",
					"Opportunities and Challenges of Third-Party Sustainment of Critical Software in Dependable Systems.",
					"RT Level vs. Microarchitecture-Level Reliability Assessment: Case Study on ARM(R) Cortex(R)-A9 CPU.",
					"Faster Exact Reliability Computation.",
					"Providing Resiliency to Orchestration and Automation Engines in Hybrid Cloud.",
					"Uptime-Optimized Cloud Architecture as a Brokered Service.",
					"Enhancing Anomaly Diagnosis of Automatic Train Supervision System Based on Operation Log.",
					"Automating DRAM Fault Mitigation By Learning From Experience.",
					"FUsing Hybrid Remote Attestation with a Formally Verified Microkernel: Lessons Learned.",
					"MAS: Mobile-Apps Assessment and Analysis System.",
					"A Visit to the Jungle of Terminology.",
					"Modeling Error Propagation in Programs.",
					"Automated Program Diversity Using Program Synthesis.",
					"Student Research Paper: Evaluation of the Dependability of Critical Infrastructures Using Hybrid Petri Nets with Random Variables and Stochastic Simulation.",
					"Enabling Low Degraded Read Latency and Fast Recovery for Erasure Coded Cloud Storage Systems.",
					"Special Session at DSN for the Best Papers from SELSE 2017.",
					"Evaluation and Mitigation of Soft-Errors in Neural Network-Based Object Detection in Three GPU Architectures.",
					"DRAM Scaling Error Evaluation Model Using Various Retention Time.",
					"Deep Healing: Ease the BTI and EM Wearout Crisis by Activating Recovery."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "46th DSN 2016",
		"info": "Toulouse, France",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2016",
				"sub_name": "46th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2016, Toulouse, France, June 28 - July 1, 2016.",
				"count": 58,
				"papers": [
					"A Quantitative Methodology for Security Monitor Deployment.",
					"Dynamic Scalable State Machine Replication.",
					"OSIRIS: Efficient and Consistent Recovery of Compartmentalized Operating Systems.",
					"Towards a Scalable and Write-Free Multi-version Checkpointing Scheme in Solid State Drives.",
					"Elastic Parity Logging for SSD RAID Arrays.",
					"OI-RAID: A Two-Layer RAID Architecture towards Fast Recovery and High Reliability.",
					"StorM: Enabling Tenant-Defined Cloud Storage Middle-Box Services.",
					"Process-Oriented Non-intrusive Recovery for Sporadic Operations on Cloud.",
					"Network Recovery After Massive Failures.",
					"JURY: Validating Controller Actions in Software-Defined Networks.",
					"SDNShield: Reconciliating Configurable Application Permissions for SDN App Markets.",
					"Can't Touch This: Consistent Network Updates for Multiple Policies.",
					"HSFI: Accurate Fault Injection Scalable to Large Code Bases.",
					"Making Fast Consensus Generally Faster.",
					"ePVF: An Enhanced Program Vulnerability Factor Methodology for Cross-Layer Resilience Analysis.",
					"Methuselah Flash: Rewriting Codes for Extra Long Storage Lifetime.",
					"Enabling Deep Voltage Scaling in Delay Sensitive L1 Caches.",
					"ReadDuo: Constructing Reliable MLC Phase Change Memory through Fast and Robust Readout.",
					"Leveraging ECC to Mitigate Read Disturbance, False Reads and Write Faults in STT-RAM.",
					"SuperGlue: IDL-Based, System-Level Fault Tolerance for Embedded Systems.",
					"PARBOR: An Efficient System-Level Technique to Detect Data-Dependent Failures in DRAM.",
					"Efficient Algorithm-Based Fault Tolerance for Sparse Matrix Operations.",
					"Formal Analysis for Dependable Supervisory Control and Data Acquisition in Smart Grids.",
					"A Model-Based Approach to Support Safety-Related Decisions in the Petroleum Domain.",
					"Mean Field Approximation of Uncertain Stochastic Models.",
					"Uncovering Dynamic Fault Trees.",
					"Power-Capping Aware Checkpointing: On the Interplay Among Power-Capping, Temperature, Reliability, Performance, and Energy.",
					"Reconsidering Single Failure Recovery in Clustered File Systems.",
					"Managing Data Center Tickets: Prediction and Active Sizing.",
					"A Privacy Analysis of Google and Yandex Safe Browsing.",
					"PUPPIES: Transformation-Supported Personalized Privacy Preserving Partial Image Sharing.",
					"Modeling Privacy and Tradeoffs in Multichannel Secret Sharing Protocols.",
					"On False Data Injection Attacks Against Railway Traction Power Systems.",
					"Targeted Attacks on Teleoperated Surgical Robots: Dynamic Model-Based Detection and Mitigation.",
					"F-DETA: A Framework for Detecting Electricity Theft Attacks in Smart Grids.",
					"Secure Identification of Actively Executed Code on a Generic Trusted Component.",
					"Secure and Efficient Multi-Variant Execution Using Hardware-Assisted Process Virtualization.",
					"Overhaul: Input-Driven Access Control for Better Privacy on Traditional Operating Systems.",
					"Kizzle: A Signature Compiler for Detecting Exploit Kits.",
					"A Sharper Sense of Self: Probabilistic Reasoning of Program Behaviors for Anomaly Detection with Context Sensitivity.",
					"BAYWATCH: Robust Beaconing Detection to Identify Infected Hosts in Large-Scale Enterprise Networks.",
					"DomainProfiler: Discovering Domain Names Abused in Future.",
					"FTP: The Forgotten Cloud.",
					"Practical, Formal Synthesis and Automatic Enforcement of Security Policies for Android.",
					"Don't Just BYOD, Bring-Your-Own-App Too! Protection via Virtual Micro Security Perimeters.",
					"Can We Trust the Privacy Policies of Android Apps?",
					"Repackage-Proofing Android Apps.",
					"Measuring the Role of Greylisting and Nolisting in Fighting Spam.",
					"Malware Slums: Measurement and Analysis of Malware on Traffic Exchanges.",
					"Secure Point-of-Care Medical Diagnostics via Trusted Sensing and Cyto-Coded Passwords.",
					"fuzzyPSM: A New Password Strength Meter Using Fuzzy Probabilistic Context-Free Grammars.",
					"Balancing Security and Performance for Agility in Dynamic Threat Environments.",
					"Rekeying for Encrypted Deduplication Storage.",
					"Equipping WAP with WEAPONS to Detect Vulnerabilities: Practical Experience Report.",
					"Characterizing the Consistency of Online Services (Practical Experience Report).",
					"ELZAR: Triple Modular Redundancy Using Intel AVX (Practical Experience Report).",
					"An Evaluation Study on Log Parsing and Its Use in Log Mining.",
					"Reliability-Centered Maintenance of the Electrically Insulated Railway Joint via Fault Tree Analysis: A Practical Experience Report."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2016w",
				"sub_name": "46th Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2016, Toulouse, France, June 28 - July 1, 2016.",
				"count": 61,
				"papers": [
					"Introduction to RADIANCE 2016.",
					"Use of Similarity Measure to Suggest the Existence of Duplicate User Stories in the Srum Process.",
					"Code Change History and Software Vulnerabilities.",
					"Hierarchical Model and Sensitivity Analysis for a Cloud-Based VoD Streaming Service.",
					"SOASales: A SOA System for Research Purposes.",
					"A Bayesian Networks Based Method for Ship Reliability Assessment.",
					"Scalable Robustness.",
					"D-MBTDD: An Approach for Reusing Test Artefacts in Evolving System.",
					"Introduction to RSDA 2016.",
					"Comparing Detection Capabilities of AntiVirus Products: An Empirical Study with Different Versions of Products from the Same Vendors.",
					"An Application of Unsupervised Fraud Detection to Passenger Name Records.",
					"MimeoDroid: Large Scale Dynamic App Analysis on Cloned Devices via Machine Learning Classifiers.",
					"Error Monitoring for Legacy Mission-Critical Systems.",
					"SDC is in the Eye of the Beholder: A Survey and Preliminary Study.",
					"Classifying Virtual Machine Managers by Overhead.",
					"Hunting Killer Tasks for Cloud System through Behavior Pattern Learning.",
					"Introduction to DISN 2016.",
					"Ground Control to Major Faults: Towards a Fault Tolerant and Adaptive SDN Control Network.",
					"Experience with 3 SDN Controllers in an Enterprise Setting.",
					"Availability Modelling of Software-Defined Backbone Networks.",
					"Routing-Verification-as-a-Service (RVaaS): Trustworthy Routing Despite Insecure Providers.",
					"KAR: Key-for-Any-Route, a Resilient Routing System.",
					"NetCo: Reliable Routing With Unreliable Routers.",
					"Introduction to ReSA4CI 2016.",
					"An Architecture for Semi-Automatic Collaborative Malware Analysis for CIs.",
					"Diverse Compiling for Software-Based Recovery of Permanent Faults in COTS Processors.",
					"Quantification and Analysis of Interdependency in Cyber-Physical Systems.",
					"On the Feasibility of Distinguishing Between Process Disturbances and Intrusions in Process Control Systems Using Multivariate Statistical Process Control.",
					"Introduction to SSIV 2016.",
					"In-Vehicle Real-Time Fog Computing.",
					"An Effective Two-Level Redundancy Approach for FlexRay Network Systems.",
					"Designing Security for In-vehicle Networks: A Body Control Module (BCM) Centered Viewpoint.",
					"IEEE 802.11n vs. IEEE 802.15.4: A Study on Communication QoS to Provide Safe FANETs.",
					"On the Validation of a UAV Collision Avoidance System Developed by Model-Based Optimization: Challenges and a Tentative Partial Solution.",
					"Safety Engineering for Autonomous Vehicles.",
					"A Distributed Avionics Communication Network.",
					"HARP: High Availability Registration Platform for Software Defined Infrastructure.",
					"Secure Embedded Hypervisor Based Systems for Automotive.",
					"Software Safety Assessment and Probabilities.",
					"AUTOSAR for Connected and Autonomous Vehicles: The AUTOSAR Adaptive Platform.",
					"Evaluation of EEE Reliability Prediction Models for Space Applications.",
					"An Uncrewed Aerial Vehicle Attack Scenario and Trustworthy Repair Architecture.",
					"Transformation of Failure Propagation Models into Fault Trees for Safety Evaluation Purposes.",
					"The Concept of a Software-Free Resilience Infrastructure for Cyber-Physical Systems.",
					"A System for the Security Protection of Embedded Binary Programs.",
					"Trusted Software Repair for System Resiliency.",
					"Resiliency Challenges in Accelerating Carrier-Grade Networks with SDN.",
					"A Triple Core Lock-Step (TCLS) ARM® Cortex®-R5 Processor for Safety-Critical and Ultra-Reliable Applications.",
					"Improving DRAM Fault Characterization through Machine Learning.",
					"Towards Black-Box Anomaly Detection in Virtual Network Functions.",
					"Profiling Memory Vulnerability of Big-Data Applications.",
					"Common Safety Method for Risk Evaluation and Assessment (CSM-RA) and Hazard Analysis Tutorial: Managing Effectively Significant Changes in a Railway System.",
					"DSN 2016 Tutorial: Reliability and Availability Modeling in Practice.",
					"Activating Protection and Exercising Recovery Against Large-Scale Outages on the Cloud.",
					"Measuring Resiliency through Field Data: Techniques, Tools and Challenges.",
					"Building Highly-Available Distributed SDN Applications with ONOS.",
					"DSN 2016 Tutorial: Resilience for Scientific Computing: From Theory to Practice.",
					"A Unified Framework for Error Correction in On-chip Memories.",
					"Special Session at DSN for the Best Papers from SELSE 2016.",
					"Software-Defined Error-Correcting Codes.",
					"External Assessment of QoS Provisioning in Distributed Cloud Services."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "45th DSN 2015",
		"info": "Rio de Janeiro, Brazil",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2015",
				"sub_name": "45th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2015, Rio de Janeiro, Brazil, June 22-25, 2015.",
				"count": 54,
				"papers": [
					"Leveraging State Information for Automated Attack Discovery in Transport Protocol Implementations.",
					"Δ-Encoding: Practical Encoded Processing.",
					"Measuring and Understanding Extreme-Scale Application Resilience: A Field Study of 5, 000, 000 HPC Application Runs.",
					"Understanding and Exploiting Spatial Properties of System Failures on Extreme-Scale HPC Systems.",
					"Detection of Early-Stage Enterprise Infection by Mining Large-Scale Log Data.",
					"LEAPS: Detecting Camouflaged Attacks with Statistical Learning Guided by Program Analysis.",
					"OnionBots: Subverting Privacy Infrastructure for Cyber Attacks.",
					"A Statistical Approach for Timed Reachability in AADL Models.",
					"Scalable Analysis of Fault Trees with Dynamic Features.",
					"The Power of Evil Choices in Bloom Filters.",
					"Secure Dynamic Software Loading and Execution Using Cross Component Verification.",
					"Parallax: Implicit Code Integrity Verification Using Return-Oriented Programming.",
					"TIP-Code: A Three Independent Parity Code to Tolerate Triple Disk Failures with Optimal Update Complextiy.",
					"Enabling Efficient and Reliable Transition from Replication to Erasure Coding for Clustered File Systems.",
					"Grouping-Based Elastic Striping with Hotness Awareness for Improving SSD RAID Performance.",
					"Joza: Hybrid Taint Inference for Defeating Web Application SQL Injection Attacks.",
					"Private Browsing Mode Not Really That Private: Dealing with Privacy Breach Caused by Browser Extensions.",
					"Test-Based Interoperability Certification for Web Services.",
					"Understanding the Dark Side of Big Data Clusters: An Analysis beyond Failures.",
					"Improving Reliability with Dynamic Syndrome Allocation in Intelligent Software Defined Data Centers.",
					"Experiences with Building Disaster Recovery for Enterprise-Class Clouds.",
					"FloodGuard: A DoS Attack Prevention Extension in Software-Defined Networks.",
					"Enhancing Software Dependability and Security with Hardware Supported Instruction Address Space Randomization.",
					"Hide & Share: Landmark-Based Similarity for Private KNN Computation.",
					"Energy Resilience Modelling for Smart Houses.",
					"Impact of Malfunction on the Energy Efficiency of Batch Processing Systems.",
					"phpSAFE: A Security Analysis Tool for OOP Web Application Plugins.",
					"BAAT: Towards Dynamically Managing Battery Aging in Green Datacenters.",
					"Avoiding Pitfalls in Fault-Injection Based Comparison of Program Susceptibility to Soft Errors.",
					"Warped-RE: Low-Cost Error Detection and Correction in GPUs.",
					"Decomposable Trust for Android Applications.",
					"Reducing Refresh Power in Mobile Devices with Morphable ECC.",
					"TrustICE: Hardware-Assisted Isolated Computing Environments on Mobile Devices.",
					"Delving into Internet DDoS Attacks by Botnets: Characterization and Analysis.",
					"Consensus Refined.",
					"Segugio: Efficient Behavior-Based Tracking of Malware-Control Domains in Large ISP Networks.",
					"Revisiting Memory Errors in Large-Scale Production Data Centers: Analysis and Modeling of New Trends from the Field.",
					"AVATAR: A Variable-Retention-Time (VRT) Aware Refresh for DRAM Systems.",
					"Read Disturb Errors in MLC NAND Flash Memory: Characterization, Mitigation, and Recovery.",
					"Fine-Grained Characterization of Faults Causing Long Latency Crashes in Programs.",
					"User-Constraint and Self-Adaptive Fault Tolerance for Event Stream Processing Systems.",
					"Lightweight Memory Checkpointing.",
					"HeapTherapy: An Efficient End-to-End Solution against Heap Buffer Overflows.",
					"Smart-TV Security Analysis: Practical Experiments.",
					"On the Metrics for Benchmarking Vulnerability Detection Tools.",
					"Formal Assurance Arguments: A Solution in Search of a Problem?",
					"A Quality Control Engine for Complex Physical Systems.",
					"Discovering and Visualizing Operations Processes with POD-Discovery and POD-Viz.",
					"Incinerator - Eliminating Stale References in Dynamic OSGi Applications.",
					"Risk Assessment of Buffer \"Heartbleed\" Over-Read Vulnerabilities.",
					"Workshop on Dependability Issues on SDN and NFV (DISN).",
					"Workshop on Model Based Design for Cyber-Physical Systems (MB4CP).",
					"Workshop on Recent Advances in the DependabIlity AssessmeNt of Complex systEms (RADIANCE).",
					"Workshop on Safety and Security of Intelligent Vehicles (SSIV)."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2015w",
				"sub_name": "IEEE International Conference on Dependable Systems and Networks Workshops, DSN Workshops 2015, Rio de Janeiro, Brazil, June 22-25, 2015.",
				"count": 27,
				"papers": [
					"MB4CP 2015 Keynote I: Dependability Modeling and Analysis Methods Integrated in Model-Driven Industrial Architectural Frameworks.",
					"MB4CP 2015 Keynote II: Resilience of Cyber-Physical Energy Systems.",
					"SeReNe: On Establishing Secure and Resilient Networking Services for an SDN-based Multi-tenant Datacenter Environment.",
					"Video on Demand Hosted in Private Cloud: Availability Modeling and Sensitivity Analysis.",
					"Implementation of Failure Detector Based on Network Function Virtualization.",
					"RADIANCE 2015 Keynote: Challenges in Engineering Dependable Self-Adaptive System.",
					"Service Deterioration Analysis (SDA): An Early Development Phase Dependability Analysis Method.",
					"Quantifying the Impact of External Attacks on a Distributed Automatic Track Warning System.",
					"An Approach to Clustering and Sequencing of Textual Requirements.",
					"Semi-automatic Generation of Extended Finite State Machines from Natural Language Standard Documents.",
					"An Asset-Based Development Approach for Availability and Safety Analysis on a Flood Alert System.",
					"Cost Prediction for V&V and Certification Processes.",
					"Assessment of Defect Type influence in Complex and Integrated Space Systems: Analysis Based on ODC and ISVV Issues.",
					"A Virtual Fault Injection Framework for Reliability-Aware Software Development.",
					"Towards Assessing Representativeness of Fault Injection-Generated Failure Data for Online Failure Prediction.",
					"Studying the Propagation of Failures in SOAs.",
					"SSIV 2015 Keynote I: On the Security of Critical Cyber-Physical Systems.",
					"Using Data Integrity as an Improvement Characteristic to Assess the Safety of ADS-B-based Systems.",
					"A Learning-Based Autonomous Control System Approach for Collision Avoidance within an Unmanned Aircraft.",
					"Using Simulation, Fault Injection and Property-Based Testing to Evaluate Collision Avoidance of a Quadcopter System.",
					"Advantages in Crash Severity Prediction Using Vehicle to Vehicle Communication.",
					"Heading Controller for a Fixed Wing UAV with Reduced Control Surfaces Based on ANFIS.",
					"SSIV 2015 Keynote II: From Embedded Systems to Autonomous Cooperating Objects.",
					"Model-Based Membership Verification in Vehicular Platoons.",
					"Software Faults Emulation at Model-Level: Towards Automated Software FMEA.",
					"The Use of a Graphic Processing Unit (GPU) in a Real Time Visual Odometry Application.",
					"Improving Intelligent Vehicle Dependability by Means of Infrastructure-Induced Tests."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "44th DSN 2014",
		"info": "Atlanta, GA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2014",
				"sub_name": "44th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2014, Atlanta, GA, USA, June 23-26, 2014.",
				"count": 82,
				"papers": [
					"Failure Analysis of Virtual and Physical Machines: Patterns, Causes and Characteristics.",
					"Reliability and Security Monitoring of Virtual Machines Using Hardware Architectural Invariants.",
					"Lazy Checkpointing: Exploiting Temporal Locality in Failures to Mitigate Checkpointing Overheads on Extreme-Scale Systems.",
					"Titan: Enabling Low Overhead and Multi-faceted Network Fingerprinting of a Bot.",
					"pSigene: Webcrawling to Generalize SQL Injection Signatures.",
					"Probabilistic Inference for Obfuscated Network Attack Sequences.",
					"Anomaly Characterization in Large Scale Networks.",
					"SAND: A Fault-Tolerant Streaming Architecture for Network Traffic Analytics.",
					"An Adaptable Rule Placement for Software-Defined Networks.",
					"Detecting Malicious Javascript in PDF through Document Instrumentation.",
					"Scriptless Timing Attacks on Web Browser Privacy.",
					"Automatically Fixing C Buffer Overflows Using Program Transformations.",
					"Application-Level Autonomic Hardware to Predict and Preempt Software Attacks on Industrial Control Systems.",
					"Monitor Based Oracles for Cyber-Physical System Testing: Practical Experience Report.",
					"Security Threat Analytics and Countermeasure Synthesis for Power System State Estimation.",
					"You Can Call but You Can't Hide: Detecting Caller ID Spoofing Attacks.",
					"On Tracking Information Flows through JNI in Android Applications.",
					"Optical Delusions: A Study of Malicious QR Codes in the Wild.",
					"A Reliable 3D MLC PCM Architecture with Resistance Drift Predictor.",
					"Mitigating Write Disturbance in Super-Dense Phase Change Memories.",
					"WL-Reviver: A Framework for Reviving any Wear-Leveling Techniques in the Face of Failures on Phase Change Memory.",
					"Performance Sensitive Replication in Geo-distributed Cloud Datastores.",
					"POD-Diagnosis: Error Diagnosis of Sporadic Operations on Cloud Applications.",
					"Catch Me If You Can: A Cloud-Enabled DDoS Defense.",
					"Secure Ranked Multi-keyword Search for Multiple Data Owners in Cloud Computing.",
					"S-MATCH: Verifiable Privacy-Preserving Profile Matching for Mobile Social Services.",
					"Social Puzzles: Context-Based Access Control in Online Social Networks.",
					"Mining Historical Issue Repositories to Heal Large-Scale Online Service Systems.",
					"Understanding Interoperability Issues of Web Service Frameworks.",
					"Scalable State-Machine Replication.",
					"Clock-RSM: Low-Latency Inter-datacenter State Machine Replication Using Loosely Synchronized Physical Clocks.",
					"State Machine Replication for the Masses with BFT-SMART.",
					"Hardware-Software Integrated Diagnosis for Intermittent Hardware Faults.",
					"Quantifying the Accuracy of High-Level Fault Injection Techniques for Hardware Faults.",
					"Hard Drive Failure Prediction Using Classification and Regression Trees.",
					"Developing Correctly Replicated Databases Using Formal Tools.",
					"The Energy Efficiency of Database Replication Protocols.",
					"Degraded-First Scheduling for MapReduce in Erasure-Coded Storage Clusters.",
					"Warped-Shield: Tolerating Hard Faults in GPGPUs.",
					"A-ABFT: Autonomous Algorithm-Based Fault Tolerance for Matrix Multiplications on Graphics Processing Units.",
					"Impact of GPUs Parallelism Management on Safety-Critical and HPC Applications Reliability.",
					"Characterizing Application Memory Error Vulnerability to Optimize Datacenter Cost via Heterogeneous-Reliability Memory.",
					"Ocasta: Clustering Configuration Settings for Error Recovery.",
					"FACE-CHANGE: Application-Driven Dynamic Kernel View Switching in a Virtual Machine.",
					"Model Checking Stochastic Automata for Dependability and Performance Measures.",
					"Scalable Security Models for Assessing Effectiveness of Moving Target Defenses.",
					"A Novel Variable Ordering Heuristic for BDD-based K-Terminal Reliability.",
					"Adaptive Low-Power Architecture for High-Performance and Reliable Embedded Computing.",
					"HV Code: An All-Around MDS Code to Improve Efficiency and Reliability of RAID-6 Systems.",
					"Replication-Based Fault-Tolerance for Large-Scale Graph Processing.",
					"System Call Redirection: A Practical Approach to Meeting Real-World Virtual Machine Introspection Needs.",
					"Interoperability between Fingerprint Biometric Systems: An Empirical Study.",
					"DNS Noise: Measuring the Pervasiveness of Disposable Domains in Modern DNS Traffic.",
					"Lessons Learned from the Analysis of System Failures at Petascale: The Case of Blue Waters.",
					"GemFI: A Fault Injection Tool for Studying the Behavior of Applications on Unreliable Substrates.",
					"A Design and Implementation of an Assurance Case Language.",
					"Recovery for Failures in Rolling Upgrade on Clouds.",
					"Crosscheck: Hardening Replicated Multithreaded Services.",
					"NV-Hypervisor: Hypervisor-Based Persistence for Virtual Machines.",
					"A Markov Decision Process Approach for Optimal Data Backup Scheduling.",
					"Availability Evaluation of Digital Library Cloud Services.",
					"Defects per Million (DPM) Evaluation for a Cloud Dealing with VM Failures Using Checkpointing.",
					"Predicting Incident Reports for IT Help Desk.",
					"What Vulnerability Do We Need to Patch First?",
					"What Logs Should You Look at When an Application Fails? Insights from an Industrial Case Study.",
					"Towards a Taxonomy of Cloud Recovery Strategies.",
					"Toward Design Decisions to Enable Deployability: Empirical Study of Three Projects Reaching for the Continuous Delivery Holy Grail.",
					"Coarse-Grained Energy Modeling of Rollback/Recovery Mechanisms.",
					"Grid-Oriented Process Clustering System for Partial Message Logging.",
					"Evaluating the Error Resilience of Parallel Programs.",
					"Comparison Criticality in Sorting Algorithms.",
					"Radiation Sensitivity of High Performance Computing Applications on Kepler-Based GPGPUs.",
					"HeteroCheckpoint: Efficient Checkpointing for Accelerator-Based Systems.",
					"Harnessing Unreliable Cores in Heterogeneous Architecture: The PyDac Programming Model and Runtime.",
					"Design and Evaluation of FA-MPI, a Transactional Resilience Scheme for Non-blocking MPI.",
					"Extreme-Scale Viability of Collective Communication for Resilient Task Scheduling and Work Stealing.",
					"Distributed Implementation of Wide-Area Monitoring Algorithms for Power Systems Using a US-Wide ExoGENI-WAMS Testbed.",
					"Stateful Data Delivery Service for Wide Area Monitoring and Control Applications.",
					"Hybrid Control Network Intrusion Detection Systems for Automated Power Distribution Systems.",
					"Towards Secure Metering Data Analysis via Distributed Differential Privacy.",
					"An Integrated Security Framework for GOSS Power Grid Analytics Platform.",
					"Ironstack: Performance, Stability and Security for Power Grid Data Networks."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "43rd DSN 2013",
		"info": "Budapest, Hungary",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2013",
				"sub_name": "2013 43rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), Budapest, Hungary, June 24-27, 2013.",
				"count": 72,
				"papers": [
					"Performability analysis of RAID10 versus RAID6.",
					"EagleEye: Towards mandatory security monitoring in virtualized datacenter environment.",
					"Application-driven TCP recovery and non-stop BGP.",
					"PHYS: Profiled-HYbrid Sampling for soft error reliability benchmarking.",
					"The Third International Workshop on Dependability of Clouds, Data Centers and Virtual Machine Technology DCDV 2013.",
					"Towards secure monitoring and control systems: Diversify!",
					"Evasive bots masquerading as human beings on the web.",
					"Redefining web browser principals with a Configurable Origin Policy.",
					"Security implications of memory deduplication in a virtualized environment.",
					"Lilliput meets brobdingnagian: Data center systems management through mobile devices.",
					"simFI: From single to simultaneous software fault injections.",
					"Increasing network resiliency by optimally assigning diverse variants to routing nodes.",
					"SIDE: Isolated and efficient execution of unmodified device drivers.",
					"Design of event-based Intrusion Detection System on OpenFlow Network.",
					"Analysis of bugs in Apache Virtual Computing Lab.",
					"Guaranteeing Proper-Temporal-Embedding safety rules in wireless CPS: A hybrid formal modeling approach.",
					"Lightweight message tracing for debugging wireless sensor networks.",
					"Hector: Detecting Resource-Release Omission Faults in error-handling code for systems software.",
					"Stress balancing to mitigate NBTI effects in register files.",
					"Towards SDN enabled network control delegation in clouds.",
					"Distal: A framework for implementing fault-tolerant distributed algorithms.",
					"An algorithmic approach to error localization and partial recomputation for low-overhead fault tolerance.",
					"Message from the general chair.",
					"Fitting second-order acyclic Marked Markovian Arrival Processes.",
					"Fault detection and localization in distributed systems using invariant relationships.",
					"Consistency or latency? A quantitative analysis of replication systems based on replicated state machines.",
					"Improving SSD reliability with RAID via Elastic Striping and Anywhere Parity.",
					"DRIP: A framework for purifying trojaned kernel drivers.",
					"SPECTRE: A dependable introspection framework via System Management Mode.",
					"Fault-tolerance characteristics of data center network topologies using fault regions.",
					"Implementing the ADVISE security modeling formalism in Möbius.",
					"FTSPM: A Fault-Tolerant ScratchPad Memory.",
					"Lumpability of fluid models with heterogeneous agent types.",
					"Message from the DCCS program chair.",
					"Locality matters: Reducing Internet traffic graphs using location analysis.",
					"Reading between the lines of failure logs: Understanding how HPC systems fail.",
					"A practical characterization of a NASA SpaceCube application through fault emulation and laser testing.",
					"Intrusion detection and honeypots in nested virtualization environments.",
					"CloudPD: Problem determination and diagnosis in shared dynamic clouds.",
					"Geo-replicated storage with scalable deferred update replication.",
					"State-of-the-practice in data center virtualization: Toward a better understanding of VM usage.",
					"WirelessHART modeling and performance evaluation.",
					"Generative software-based memory error detection and correction for operating system data structures.",
					"Increasing the trustworthiness of commodity hardware through software.",
					"Manipulating semantic values in kernel data structures: Attack assessments and implications.",
					"Seamless kernel updates.",
					"Addressing memory exhaustion failures in Virtual Machines in a cloud environment.",
					"Availability study on cloud computing environments: Live migration as a rejuvenation mechanism.",
					"Mitigating access-driven timing channels in clouds using StopWatch.",
					"Evaluating Xilinx SEU Controller Macro for fault injection.",
					"Network traffic anomaly detection based on growing hierarchical SOM.",
					"Why is my smartphone slow? On the fly diagnosis of underperformance on the mobile Internet.",
					"An adaptive approach to dependable circuits for a digital power control.",
					"Modeling and analysing operation processes for dependability.",
					"The architecture of a resilience infrastructure for computing and communication systems.",
					"Operating SECDED-based caches at ultra-low voltage with FLAIR.",
					"DATAFLASKS: An epidemic dependable key-value substrate.",
					"Model-based performance analysis of local re-execution scheme in offloading system.",
					"Automating the debugging of datacenter applications with ADDA.",
					"A review of cloud deployment models for e-learning systems.",
					"A view on the past and future of fault injection.",
					"An empirical investigation of fault repairs and mitigations in space mission system software.",
					"Complementing static and dynamic analysis approaches for better network defense.",
					"A logic for model-checking mean-field models.",
					"Detecting malicious landing pages in Malware Distribution Networks.",
					"Chasing the optimum in replicated in-memory transactional platforms via protocol adaptation.",
					"Dependability models for designing disaster tolerant cloud computing systems.",
					"Uniform node sampling service robust against collusions of malicious nodes.",
					"Message from the PDS program chair.",
					"Error detector placement for soft computation.",
					"Practical automated vulnerability monitoring using program state invariants.",
					"Crossing the threshold: Detecting network malfeasance via sequential hypothesis testing."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2013w",
				"sub_name": "43rd Annual IEEE/IFIP Conference on Dependable Systems and Networks Workshop, DSN Workshops 2013, Budapest, Hungary, June 24-27, 2013.",
				"count": 38,
				"papers": [
					"A framework for runtime V&V in business-critical Service Oriented Architectures.",
					"BARLEY: Modelling program behavior with resource usage.",
					"Fault-tolerant broadcast algorithms for the virtual hypercube topology.",
					"Improving the dependability of FPGA-based real-time embedded systems with partial dynamic reconfiguration.",
					"Detecting and tolerating data corruptions due to device driver defects.",
					"IOCheck: A framework to enhance the security of I/O devices at runtime.",
					"Workshop on reliability and security data analysis RSDA 2013.",
					"Data fusion-base anomay detection in networked critical infrastructures.",
					"Investigating DNS traffic anomalies for malicious activities.",
					"Scalable security analysis in hierarchical attack representation model using centrality measures.",
					"Automatic collection of failure data from the iOS platform.",
					"Towards evaluating the impact of data quality on service applications.",
					"Golden-run alignment for analysis of robustness testing results: dealing with diagnostics issues.",
					"Reducing service failures by failure and workload aware load balancing in SaaS clouds.",
					"Storage-efficient data replica number computation for multi-level priority data in distributed storage systems.",
					"Predicting job completion times using system logs in supercomputing clusters.",
					"Reliable mission deployment in vulnerable distributed systems.",
					"Practical Experiences with real-world systems: Security in the world of reliable and safe systems.",
					"Interoperability in fingerprint recognition: A large-scale empirical study.",
					"SAFE: Shoulder-surfing attack filibustered with ease.",
					"2nd workshop on open resilient human-aware cyber-physical systems.",
					"Keynote: Toward vehicle automation ADAS, the new challenges.",
					"Autonomous Emergency Braking: A System-of-Systems perspective.",
					"Keynote: Detecting cognitive state for operators of cyber-physical systems: Design of experiments.",
					"Survey on security threats and protection mechanisms in embedded automotive networks.",
					"On reliability analysis of leader election protocols for virtual traffic lights.",
					"The KARYON project: Predictable and safe coordination in cooperative vehicular systems.",
					"Driver performance in the presence of adaptive cruise control related failures: Implications for safety analysis and fault tolerance.",
					"Towards Systems Resilience.",
					"FORISK: Formalizing information security risk and compliance management.",
					"Key issues in service systems resilience.",
					"SCoRe: An across-the-board metric for computer systems resilience benchmarking.",
					"Model-based evaluation of system resilience.",
					"Resilience modeling by means of a set of recursive functions.",
					"Behavioral aspects for agent-based models of resilient urban systems.",
					"An intrusion-tolerant firewall design for protecting SIEM systems.",
					"Community-based resilient electricity sharing: Optimal spatial clustering.",
					"Cyber security problem based on Multi-Objective Distributed Constraint Optimization technique."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "42nd DSN 2012",
		"info": "Boston, MA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2012",
				"sub_name": "IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2012, Boston, MA, USA, June 25-28, 2012.",
				"count": 51,
				"papers": [
					"Instrumenting AUTOSAR for dependability assessment: A guidance framework.",
					"Binary mutation testing through dynamic translation.",
					"DS-Bench Toolset: Tools for dependability benchmarking with simulation and assurance.",
					"Multi-Ring Paxos.",
					"Adaptive algorithms for diagnosing large-scale failures in computer networks.",
					"Mitigating the impact of ambient noise on Wireless Mesh Networks using adaptive link-quality-based packet replication.",
					"Practical scrubbing: Getting to the bad sector at the right time.",
					"Robust data sharing with key-value stores.",
					"A framework for efficient evaluation of the fault tolerance of deduplicated storage systems.",
					"Error injection-based study of soft error propagation in AMD Bulldozer microprocessor module.",
					"Understanding soft error propagation using Efficient vulnerability-driven fault injection.",
					"Characterization of the error resiliency of power grid substation devices.",
					"High-performance parallel accelerator for flexible and efficient run-time monitoring.",
					"Automatic fault characterization via abnormality-enhanced classification.",
					"Draco: Statistical diagnosis of chronic problems in large distributed systems.",
					"Model-driven consolidation of Java workloads on multicores.",
					"Finite horizon analysis of infinite CTMDPs.",
					"Toward comprehensive and accurate simulation performance prediction of parallel file systems.",
					"Scalable deferred update replication.",
					"Latent fault detection in large scale services.",
					"Keep net working - on a dependable and fast networking stack.",
					"A cost-based heterogeneous recovery scheme for distributed storage systems with RAID-6 codes.",
					"A new symbolic approach for network reliability analysis.",
					"A study of soft error consequences in hard disk drives.",
					"Heuristics for optimizing matrix-based erasure codes for fault-tolerant storage systems.",
					"Algorithmic approaches to low overhead fault detection for sparse linear algebra.",
					"Perspectives on software safety case development for unmanned aircraft.",
					"Scalable optimal countermeasure selection using implicit enumeration on attack countermeasure trees.",
					"EliMet: Security metric elicitation in power grid critical infrastructures by observing system administrators' responsive behavior.",
					"Time-efficient and cost-effective network hardening using attack graphs.",
					"Taming Mr Hayes: Mitigating signaling based attacks on smartphones.",
					"A cross-layer approach for IP network protection.",
					"Epiphany: A location hiding architecture for protecting critical services from DDoS attacks.",
					"Assessing time coalescence techniques for the analysis of supercomputer logs.",
					"Optimization of data collection strategies for model-based evaluation and decision-making.",
					"Filtering log data: Finding the needles in the Haystack.",
					"RDIS: A recursively defined invertible set scheme to tolerate multiple stuck-at faults in resistive memory.",
					"RePRAM: Re-cycling PRAM faulty blocks for extended lifetime.",
					"VARIUS-NTV: A microarchitectural model to capture the increased sensitivity of manycores to process variations at near-threshold voltages.",
					"Mitigating random variation with spare RIBs: Redundant intermediate bitslices.",
					"Lightweight cooperative logging for fault replication in concurrent programs.",
					"Confidentiality of event data in policy-based monitoring.",
					"Continuous authentication for mouse dynamics: A pattern-growth approach.",
					"NINEPIN: Non-invasive and energy efficient performance isolation in virtualized servers.",
					"ExtraTime: Modeling and analysis of wearout due to transistor aging at microarchitecture-level.",
					"CFIMon: Detecting violation of control flow integrity using performance counters.",
					"BLOCKWATCH: Leveraging similarity in parallel programs for error detection.",
					"Low-cost program-level detectors for reducing silent data corruptions.",
					"Safeguarding academic accounts and resources with the University Credential Abuse Auditing System.",
					"A dependability analysis of hardware-assisted polling integrity checking systems.",
					"An empirical study of the robustness of Inter-component Communication in Android."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2012w",
				"sub_name": "IEEE/IFIP International Conference on Dependable Systems and Networks Workshops, DSN 2012, Boston, MA, USA, June 25-28, 2012.",
				"count": 38,
				"papers": [
					"Invited talk: Challenges in Medical Cyber-Physical Systems.",
					"Invited talk: Virtual coaches in health care.",
					"Invited talk: A model and simulation for user-centric automation devices and systems.",
					"Smart checklists for human-intensive medical systems.",
					"Towards resiliency in embedded medical monitoring devices.",
					"A rigorous approach to the design of resilient cyber-physical systems through co-simulation.",
					"Physical attack protection with human-secure virtualization in data centers.",
					"MILS-related information flow control in the avionic domain: A view on security-enhancing software architectures.",
					"Chaotic-identity maps for robustness estimation of exascale computations.",
					"Asynchronous checkpoint migration with MRNet in the Scalable Checkpoint / Restart Library.",
					"Does partial replication pay off?",
					"Energy considerations in checkpointing and fault tolerance protocols.",
					"A programming model for resilience in extreme scale computing.",
					"ROSE: : FTTransform - A source-to-source translation framework for exascale fault-tolerance research.",
					"A message-logging protocol for multicore systems.",
					"An evaluation of difference and threshold techniques for efficient checkpoints.",
					"On the complexity of scheduling checkpoints for computational workflows.",
					"Design and implementation of a hardware checkpoint/restart core.",
					"A scalable double in-memory checkpoint and restart scheme towards exascale.",
					"Avoiding common security flaws in composed service-oriented systems.",
					"Improving resilience of SOA services along space-time dimensions.",
					"People-oriented cyber security.",
					"A model for security analysis of smart meters.",
					"On limitations of using cloud storage for data replication.",
					"Towards incorporating human intelligence into online security solutions.",
					"A security analysis of Amazon's Elastic Compute Cloud service.",
					"The TClouds architecture: Open and resilient cloud-of-clouds computing.",
					"Toward a high availability cloud: Techniques and challenges.",
					"Dependability as a cloud service - a modular approach.",
					"Osprey: Operating system for predictable clouds.",
					"Defending against VM rollback attack.",
					"TinyChecker: Transparent protection of VMs against hypervisor failures with nested virtualization.",
					"Utilizing linear subspaces to improve cloud security.",
					"Evidence of log integrity in policy-based security monitoring.",
					"TRONE: Trustworthy and Resilient Operations in a Network Environment.",
					"An independent verification of errors and vulnerabilities in SaaS cloud.",
					"A study of fault-tolerance characteristics of data center networks.",
					"Models for dependability and sustainability analysis of data center cooling architectures."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "41st DSN 2011",
		"info": "Hong Kong, China",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2011",
				"sub_name": "Proceedings of the 2011 IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2011, Hong Kong, China, June 27-30 2011.",
				"count": 59,
				"papers": [
					"Uni-directional trusted path: Transaction confirmation on just one device.",
					"Boundless memory allocations for memory safety and high availability.",
					"A methodology for the generation of efficient error detection mechanisms.",
					"Fault tolerant WSN-based structural health monitoring.",
					"Online detection of multi-component interactions in production systems.",
					"An empirical study of the performance, security and privacy implications of domain name prefetching.",
					"Efficient model checking of fault-tolerant distributed protocols.",
					"Unified debugging of distributed systems with Recon.",
					"Improving Log-based Field Failure Data Analysis of multi-node computing systems.",
					"An analysis of signature overlaps in Intrusion Detection Systems.",
					"Detecting stealthy P2P botnets using statistical traffic fingerprints.",
					"Applying game theory to analyze attacks and defenses in virtual coordinate systems.",
					"CEC: Continuous eventual checkpointing for data stream processing operators.",
					"Coercing clients into facilitating failover for object delivery.",
					"Phase-based reboot: Reusing operating system execution phases for cheap reboot-based recovery.",
					"Communix: A framework for collaborative deadlock immunity.",
					"CloudVal: A framework for validation of virtualization environment in cloud infrastructure.",
					"Helmet: A resistance drift resilient architecture for multi-level cell phase change memory system.",
					"HDP code: A Horizontal-Diagonal Parity Code to Optimize I/O load balancing in RAID-6.",
					"LLS: Cooperative integration of wear-leveling and salvaging for PCM main memory.",
					"Get off my prefix! the need for dynamic, gerontocratic policies in inter-domain routing.",
					"Zab: High-performance broadcast for primary-backup systems.",
					"Deadline-aware scheduling for Software Transactional Memory.",
					"A combinatorial approach to detecting buffer overflow vulnerabilities.",
					"Cross-layer resilience using wearout aware design flow.",
					"Transparent dynamic binding with fault-tolerant cache coherence protocol for chip multiprocessors.",
					"Fault injection-based assessment of aspect-oriented implementation of fault tolerance.",
					"A framework for early stage quality-fault tolerance analysis of embedded control systems.",
					"Characterization of logical masking and error propagation in combinational circuits and effects on system vulnerability.",
					"A scalable availability model for Infrastructure-as-a-Service cloud.",
					"Modeling and evaluating targeted attacks in large scale dynamic systems.",
					"Incremental quantitative verification for Markov decision processes.",
					"Hypervisor-assisted application checkpointing in virtualized environments.",
					"OS diversity for intrusion tolerance: Myth or reality?",
					"Resource and virtualization costs up in the cloud: Models and design choices.",
					"WaRR: A tool for high-fidelity web application record and replay.",
					"Aaron: An adaptable execution environment.",
					"Toward dependability benchmarking of partitioning operating systems.",
					"Modeling stream processing applications for dependability evaluation.",
					"Modeling and analysis of the impact of failures in Electric Power Systems organized in interconnected regions.",
					"High performance state-machine replication.",
					"How secure are networked office devices?",
					"A combinatorial approach to network covert communications with applications in Web Leaks.",
					"Crash graphs: An aggregated view of multiple crashes to improve crash triage.",
					"Amplifying limited expert input to sanitize large network traces.",
					"Analysis of security data from a large computing organization.",
					"Coerced Cache Eviction and discreet mode journaling: Dealing with misbehaving disks.",
					"Impact of temperature on hard disk drive reliability in large datacenters.",
					"Merging ultra-low duty cycle networks.",
					"Modeling time correlation in passive network loss tomography.",
					"Simple bounds for a transient queue.",
					"Approximate analysis of blocking queueing networks with temporal dependence.",
					"5th Workshop on Recent Advances in Intrusion-Tolerant Systems WRAITS 2011.",
					"Introduction to the fifth workshop on dependable and secure nanocomputing.",
					"The First International Workshop on Dependability of Clouds, data centers and Virtual Computing Environments.",
					"Seventh workshop on hot topics in system dependability (HotDep'11).",
					"WOSD 2011 the first international workshop on open systems dependability.",
					"Third workshop on proactive failure avoidance, recovery, and maintenance (PFARM).",
					"5th international workshop on adaptive and dependable mobile ubiquitous systems ADAMUS 2011."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2011w",
				"sub_name": "IEEE/IFIP International Conference on Dependable Systems and Networks Workshops (DSN-W 2011), Hong Kong, China, June 27-30, 2011.",
				"count": 59,
				"papers": [
					"5th Workshop on recent advances in intrusion-tolerant systems WRAITS 2011.",
					"The time-free approach to Byzantine failure detection in dynamic networks.",
					"Managing business health in the presence of malicious attacks.",
					"From Byzantine fault tolerance to intrusion tolerance (a position paper).",
					"Anomaly-based intrusion detection in software as a service.",
					"Combining intrusion detection and recovery for enhancing system dependability.",
					"A cloud-based intrusion detection and response system for mobile phones.",
					"Continuous mission-oriented assessment (CMA) of assurance.",
					"Introduction to the fifth workshop on dependable and secure nanocomputing.",
					"Study of the effects of SET induced faults on submicron technologies.",
					"Investigating the impact of process variations on an asynchronous Time-Triggered-Protocol controller.",
					"Comparing the effects of intermittent and transient hardware faults on programs.",
					"Level of confidence evaluation and its usage for Roll-back Recovery with Checkpointing optimization.",
					"A digitalized management mechanism for low-cost low-power multiple-voltage 3D designs.",
					"An efficient and reliable 1.5-way processor by fusion of space and time redundancies.",
					"A non-volatile microcontroller with integrated floating-gate transistors.",
					"Built-in fine resolution clipping with calibration technique for high-speed testing by using wireless testers.",
					"Genetic algorithm based approach for segmented testing.",
					"Model-based fault injection for failure effect analysis - Evaluation of dependable SRAM for vehicle control units.",
					"The first international workshop on dependability of clouds, data centers and virtual computing environments: DCDV 2011.",
					"CAWRM: A remote mirroring system based on AoDI volume.",
					"An epidemic approach to dependable key-value substrates.",
					"The case for dynamic security solutions in public cloud workflow deployments.",
					"Recursive virtual machines for advanced security mechanisms.",
					"Designing SCIT architecture pattern in a Cloud-based environment.",
					"Lucy in the sky without diamonds: Stealing confidential data in the cloud.",
					"Performance problems online detection in cloud computing systems via analyzing request execution paths.",
					"Identifying faults in large-scale distributed systems by filtering noisy error logs.",
					"Enhancing application robustness in Infrastructure-as-a-Service clouds.",
					"Power-performance trade-offs in IaaS cloud: A scalable analytic approach.",
					"A virtual resource placement service.",
					"Seventh workshop on hot topics in system dependability (HotDep'11).",
					"Integrated end-to-end dependability in the Loris storage stack.",
					"Scalable Byzantine fault-tolerant storage.",
					"Lock-free transactional support for large-scale storage systems.",
					"TO BEnchmark or NOT TO BEnchmark security: That is the question.",
					"Automated vulnerability discovery in distributed systems.",
					"Limiting cache-based side-channel in multi-tenant cloud using dynamic page coloring.",
					"Exterminating bugs via collective information recycling.",
					"Platform-wide deadlock immunity for mobile phones.",
					"Enabling sophisticated analyses of ×86 binaries with RevGen.",
					"Secure MMU: Architectural support for memory isolation among virtual machines.",
					"Transactional memory for dependable embedded systems.",
					"WOSD 2011: The first international workshop on open systems dependability.",
					"On finding vestiges of Internet backbone failures for optimizing wide area data replication.",
					"Performance modeling and benchmarking of bank intermediary business on high-performance fault-tolerant computers.",
					"Composite dependability modeling for in-vehicle networks.",
					"Architecting resilient computing systems: Overall approach and open issues.",
					"Fault model of foreign function interface across different domains.",
					"Enforcing dependable operations by model checking a visualization layer.",
					"Third workshop on proactive failure avoidance, recovery, and maintenance (PFARM).",
					"Practical online failure prediction for Blue Gene/P: Period-based vs event-driven.",
					"Detecting resource leaks through dynamical mining of resource usage patterns.",
					"DynaPlan: Resource placement for application-level clustering.",
					"5th International workshop on adaptive and dependable mobile ubiquitous systems ADAMUS 2011.",
					"Adaptive collaborative sensing using mobile phones and stationary sensors.",
					"Enabling on-line dependability assessment of Android smart phones.",
					"A novel design of node-disjoint multi-path QoS routing in multi-hop ad hoc networks.",
					"Privacy leakage in two-party group nearest neighbor queries."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "40th DSN 2010",
		"info": "Chicago, IL, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2010",
				"sub_name": "Proceedings of the 2010 IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2010, Chicago, IL, USA, June 28 - July 1 2010.",
				"count": 69,
				"papers": [
					"Scalable RFID systems: a privacy-preserving protocol with constant-time identification.",
					"Detecting selfish carrier-sense behavior in WiFi networks by passive monitoring.",
					"Detecting Sybil nodes in wireless networks with physical layer network coding.",
					"Observable non-Sybil quorums construction in one-hop wireless ad hoc networks.",
					"Reliable MLC NAND flash memories based on nonlinear t-error-correcting codes.",
					"Code-M: A non-MDS erasure code scheme to support fast recovery from up to two-disk failures in storage systems.",
					"Decoding STAR code for tolerating simultaneous disk failure and silent errors.",
					"Diverse Partial Memory Replication.",
					"Data recovery for web applications.",
					"Programming support and adaptive checkpointing for high-throughput data services with log-based recovery.",
					"StageWeb: Interweaving pipeline stages into a wearout and variation tolerant CMP fabric.",
					"Architecting reliable multi-core network-on-chip for small scale processing technology.",
					"Energy-efficient fault tolerance in chip multiprocessors using Critical Value Forwarding.",
					"A fast and accurate multi-cycle soft error rate estimation approach to resilient embedded systems design.",
					"Bit-slice logic interleaving for spatial multi-bit soft-error tolerance.",
					"WearMon: Reliability monitoring using adaptive critical path testing.",
					"A numerical optimization-based methodology for application robustification: Transforming applications for error tolerance.",
					"Blue Banana: resilience to avatar mobility in distributed MMOGs.",
					"Efficient eventual consistency in Pahoehoe, an erasure-coded key-blob archive.",
					"Using correlated surprise to infer shared influence.",
					"Keystroke biometrics with number-pad input.",
					"Using Bayesian networks for cyber security analysis.",
					"A study of the internal and external effects of concurrency bugs.",
					"AutomaDeD: Automata-based debugging for dissimilar parallel tasks.",
					"Detecting vulnerabilities in C programs using trace-based testing.",
					"Mash-IF: Practical information-flow control within client-side mashups.",
					"DataGuard: Dynamic data attestation in wireless sensor networks.",
					"iProve: A scalable technique for consumer-verifiable software guarantees.",
					"Reuse-oriented camouflaging trojan: Vulnerability detection and attack construction.",
					"Detection of botnets using combined host- and network-level information.",
					"Dependable connection setup for network capabilities.",
					"Why software hangs and what can be done with it.",
					"Finding stable cliques of PlanetLab nodes.",
					"Who is peeping at your passwords at Starbucks? - To catch an evil twin access point.",
					"Improving privacy and lifetime of PCM-based main memory.",
					"Generic construction of consensus algorithms for benign and Byzantine faults.",
					"Scrooge: Reducing the costs of fast Byzantine replication in presence of unresponsive replicas.",
					"Zzyzx: Scalable fault tolerance through Byzantine locking.",
					"Doubly-expedited one-step Byzantine consensus.",
					"A passive approach to wireless device fingerprinting.",
					"Exploiting diverse observation perspectives to get insights on the malware landscape.",
					"Combined performance and risk analysis for border management applications.",
					"Experimental validation of a fault tolerant microcomputer system against intermittent faults.",
					"Evaluating repair strategies for a water-treatment facility using Arcade.",
					"Application of a fault injection based dependability assessment process to a commercial safety critical nuclear reactor protection system.",
					"Measurement-based analysis of fault and error sensitivities of dynamic memory.",
					"Representativeness analysis of injected software faults in complex software.",
					"An empirical investigation of fault types in space mission system software.",
					"Assessing and improving the effectiveness of logs for the analysis of software faults.",
					"Statistical guarantees of performance for MIMO designs.",
					"Transient fault models and AVF estimation revisited.",
					"A unified model for timing speculation: Evaluating the impact of technology scaling, CMOS design style, and fault recovery mechanism.",
					"Performance and availability aware regeneration for cloud based multitier applications.",
					"Adaptive on-line software aging prediction based on machine learning.",
					"Correlating failures with asynchronous changes for root cause analysis in enterprise environments.",
					"Ring Paxos: A high-throughput atomic broadcast protocol.",
					"Turquois: Byzantine consensus in wireless ad hoc networks.",
					"Diversity-inspired clustering for self-healing MANETs: Motivation, protocol, and performability evaluation.",
					"GOOFI-2: A tool for experimental dependability assessment.",
					"Studying application-library interaction and behavior with LibTrac.",
					"Experiences with a CANoe-based fault injection framework for AUTOSAR.",
					"Empirical characterization of uncongested optical lambda networks and 10GbE commodity endpoints.",
					"On/off process modeling of IP network failures.",
					"An automated technique to support the verification and validation of simulation models.",
					"Model checking CSLTA with Deterministic and Stochastic Petri Nets.",
					"1st workshop on fault-tolerance for HPC at extreme scale FTXS 2010.",
					"Second workshop on proactive failure avoidance, recovery, and maintenance (PFARM).",
					"Fourth workshop on dependable and secure nanocomputing.",
					"4th workshop on recent advances in intrusion-tolerant systems WRAITS 2010."
				]
			},
			{
				"sub_name_abbr": "conf/dsn/2010w",
				"sub_name": "IEEE/IFIP International Conference on Dependable Systems and Networks Workshops (DSN-W 2010), Chicago, Illinois, USA, June 28 - July 1, 2010.",
				"count": 31,
				"papers": [
					"Quantifying effectiveness of failure prediction and response in HPC systems: Methodology and example.",
					"Accurate fault prediction of BlueGene/P RAS logs via geometric reduction.",
					"A practical failure prediction with location and lead time for Blue Gene/P.",
					"Distributed object storage rebuild analysis via simulation with GOBS.",
					"See applications run and throughput jump: The case for redundant computing in HPC.",
					"Aspect oriented software fault tolerance and analytically redundant design framework.",
					"A translation of State Machines to temporal fault trees.",
					"Fast entropy based alert detection in super computer logs.",
					"Qualitative performance control in supervised IT infrastructures.",
					"Adaptive monitoring in microkernel OSs.",
					"Hybrid, recursive, nested monitoring of control systems using Petri nets and particle filters.",
					"Rejuvenation with workload migration.",
					"CacheMind: Fast performance recovery using a virtual machine monitor.",
					"Massive statistical process variations: A grand challenge for testing nanoelectronic circuits.",
					"Towards understanding the effects of intermittent hardware faults on programs.",
					"Gate input reconfiguration for combating soft errors in combinational circuits.",
					"Verification of soft error detection mechanism through fault injection on hardware emulation platform.",
					"Pair and swap: An approach to graceful degradation for dependable chip multiprocessors.",
					"Implementation of self-healing asynchronous circuits at the example of a video-processing algorithm.",
					"Fault tolerant communication in 3D integrated systems.",
					"Towards self-timed logic in the Time-Triggered Protocol.",
					"A concept of a trust management architecture to increase the robustness of nano age devices.",
					"Analysis of the effect of Java software faults on security vulnerabilities and their detection by commercial web vulnerability scanner tool.",
					"Analysis of a Markov decision process model for intrusion tolerance.",
					"On rootkit and malware detection in smartphones.",
					"SCIT and IDS architectures for reduced data ex-filtration.",
					"RAVE: Replicated antivirus engine.",
					"Realizing S-Reliability for services via recovery-driven intrusion tolerance mechanism.",
					"Assessing the attack resilience capabilities of a fortified primary-backup system.",
					"A security evaluation of a novel resilient web serving architecture: Lessons learned through industry/academia collaboration.",
					"Survivability and information assurance in the cloud."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "39th DSN 2009",
		"info": "Estoril/Lisbon, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2009",
				"sub_name": "Proceedings of the 2009 IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2009, Estoril, Lisbon, Portugal, June 29 - July 2, 2009.",
				"count": 76,
				"papers": [
					"Future prospects of research on security and dependability.",
					"Dependability - How does the market value it?",
					"WSEC DNS: Protecting recursive DNS resolvers from poisoning attacks.",
					"Exception triggered DoS attacks on wireless networks.",
					"HC-BGP: A light-weight and flexible scheme for securing prefix ownership.",
					"Fault isolation for device drivers.",
					"WYSIWIB: A declarative approach to finding API protocols and bugs in Linux code.",
					"Exploiting refactoring in formal verification.",
					"Maximizing system lifetime by battery scheduling.",
					"Safety modeling and evaluation of Automated Highway Systems.",
					"Evaluating the impact of Undetected Disk Errors in RAID systems.",
					"Vulnerability & attack injection for web applications.",
					"Dependability in the cloud: Challenges and opportunities.",
					"Decoupling Dynamic Information Flow Tracking with a dedicated coprocessor.",
					"Remote attestation to dynamic system properties: Towards providing complete system integrity evidence.",
					"Comparing anomaly-detection algorithms for keystroke dynamics.",
					"Providing transactional quality of service in event stream processing middleware.",
					"Language level checkpointing support for stream processing applications.",
					"Verme: Worm containment in overlay networks.",
					"Flexible multicast authentication for time-triggered embedded control network applications.",
					"Data management mechanisms for embedded system gateways.",
					"Low overhead Soft Error Mitigation techniques for high-performance and aggressive systems.",
					"An energy efficient circuit level technique to protect register file from MBUs and SETs in embedded processors.",
					"Xprobe2++: Low volume remote network information gathering tool.",
					"Deterministic high-speed simulation of complex systems including fault-injection.",
					"Intrusion-tolerant self-healing devices for critical infrastructure protection.",
					"Design and development of a proof-of-concept platooning application using the HIDENETS architecture.",
					"Dynamic content web applications: Crash, failover, and recovery analysis.",
					"A QoS-aware fault tolerant middleware for dependable service composition.",
					"Efficient resource management on template-based web servers.",
					"Stretching gossip with live streaming.",
					"A self-diagnosis technique using Reed-Solomon codes for self-repairing chips.",
					"Sharing end-user negative symptoms for improving overlay network dependability.",
					"Automatic fault detection and diagnosis in complex software systems by information-theoretic monitoring.",
					"From assessment to standardised benchmarking: Will it happen? What could we do about it?",
					"On the effectiveness of structural detection and defense against P2P-based botnets.",
					"Spam detection in voice-over-IP calls through semi-supervised clustering.",
					"Blue-Watchdog: Detecting Bluetooth worm propagation in public areas.",
					"A linguistic analysis engine for natural language use case description and its application to dependability analysis in industrial use cases.",
					"Precise request tracing and performance debugging for multi-tier services of black boxes.",
					"Report generation for simulation traces with Traviando.",
					"Möbius 2.3: An extensible tool for dependability, security, and performance evaluation of large and complex system models.",
					"Fitness-guided path exploration in dynamic symbolic execution.",
					"System safety as an emergent property in composite systems.",
					"LFI: A practical and general library-level fault injector.",
					"Fluid modeling and control for server system performance and availability.",
					"Parametric NdRFT for the derivation of optimal repair strategies.",
					"MAP-AMVA: Approximate mean value analysis of bursty systems.",
					"Overloading vulnerability of VoIP networks.",
					"On the effectiveness of low latency anonymous network in the presence of timing attack.",
					"RRE: A game-theoretic intrusion Response and Recovery Engine.",
					"Power supply induced common cause faults-experimental assessment of potential countermeasures.",
					"Emµcode: Masking hard faults in complex functional units.",
					"Processor reliability enhancement through compiler-directed register file peak temperature reduction.",
					"A low-tech solution to avoid the severe impact of transient errors on the IP interconnect.",
					"A simple equation for estimating reliability of an N+1 redundant array of independent disks (RAID).",
					"Fail-Aware Untrusted Storage.",
					"An efficient XOR-scheduling algorithm for erasure codes encoding.",
					"Replacing linear Hamming codes by robust nonlinear codes results in a reliability improvement of memories.",
					"VNsnap: Taking snapshots of virtual networked environments with minimal downtime.",
					"Fast memory state synchronization for virtualization-based fault tolerance.",
					"I-JVM: a Java Virtual Machine for component isolation in OSGi.",
					"ICT resilience of power control systems: experimental results from the CRUTIAL testbeds.",
					"Analyzing the process of installing rogue software.",
					"Using web security scanners to detect vulnerabilities in web services.",
					"System log pre-processing to improve failure prediction.",
					"Effectiveness of machine checks for error diagnostics.",
					"An end-to-end approach for the automatic derivation of application-aware error detectors.",
					"Workshop on proactive failure avoidance, recovery and maintenance (PFARM).",
					"Second workshop on Compiler and Architectural Techniques for Application Reliability and Security (CATARS).",
					"Fast Abstracts.",
					"Fifth Workshop on Hot Topics in System Dependability (HotDep 2009).",
					"Third workshop on dependable and secure nanocomputing.",
					"Workshop on Architecting Dependable Systems (WADS 2009).",
					"3rd Workshop on Recent Advances on Intrusion-Tolerant Systems WRAITS 2009.",
					"Student Forum."
				]
			},
			{
				"sub_name_abbr": "conf/icse/2009wads",
				"sub_name": "Architecting Dependable Systems VII.",
				"count": 13,
				"papers": [
					"Self-healing for Pervasive Computing Systems.",
					"Self Organization and Self Maintenance of Mobile Ad Hoc Networks through Dynamic Topology Control.",
					"Data Backup for Mobile Nodes: A Cooperative Middleware and an Experimentation Platform.",
					"Identification of Security Requirements in Systems of Systems by Functional Security Analysis.",
					"Implementing Reliability: The Interaction of Requirements, Tactics and Architecture Patterns.",
					"A Framework for Flexible and Dependable Service-Oriented Embedded Systems.",
					"Architecting Robustness and Timeliness in a New Generation of Aerospace Systems.",
					"Architecting Dependable Systems with Proactive Fault Management.",
					"ASDF: An Automated, Online Framework for Diagnosing Performance Problems.",
					"Is Collaborative QoS the Solution to the SOA Dependability Dilemma?",
					"Software Assumptions Failure Tolerance: Role, Strategies, and Visions.",
					"Architecting Dependable Systems Using Reflective Computing: Lessons Learnt and Some Challenges.",
					"Architecting and Validating Dependable Systems: Experiences and Visions."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "38th DSN 2008",
		"info": "Anchorage, Alaska, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2008",
				"sub_name": "The 38th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2008, June 24-27, 2008, Anchorage, Alaska, USA, Proceedings.",
				"count": 69,
				"papers": [
					"Message from the conference general chair and coordinator.",
					"Message from the DCCS program chair.",
					"Message from the PDS program chair.",
					"Dependability on the last frontier.",
					"Automotive Enhanced Vision Systems - Issues arising from placing users in the loop.",
					"Coverage of a microarchitecture-level fault check regimen in a superscalar processor.",
					"Analysis and solutions to issue queue process variation.",
					"Trace-based microarchitecture-level diagnosis of permanent hardware faults.",
					"A study of cognitive resilience in a JPEG compressor.",
					"Scheduling algorithms for unpredictably heterogeneous CMP architectures.",
					"Automated duplicate detection for bug tracking systems.",
					"Validation of hardware error recovery mechanisms for the SPARC64 V microprocessor.",
					"Using likely program invariants to detect hardware errors.",
					"Detouring: Translating software to circumvent hard faults in simple cores.",
					"Towards assessing the security of DBMS configurations.",
					"Experiences with formal specification of fault-tolerant file systems.",
					"Using an assurance case to support independent assessment of the transition to a new GPS ground control system.",
					"Silent Data Corruption - Myth or reality?",
					"End-system tools for enhancing email reliability.",
					"Tempest: Towards early identification of failure-prone binaries.",
					"Statistical Fault Injection.",
					"An accurate flip-flop selection technique for reducing logic SER.",
					"Combined circuit and microarchitecture techniques for effective soft error robustness in SMT processors.",
					"Reliability of flat XOR-based erasure codes on heterogeneous devices.",
					"ConfErr: A tool for assessing resilience to human configuration errors.",
					"Enhanced server fault-tolerance for improved user experience.",
					"Towards an understanding of anti-virtualization and anti-debugging behavior in modern malware.",
					"Security through redundant data diversity.",
					"Byzantine replication under attack.",
					"A robust and lightweight stable leader election service for dynamic systems.",
					"A fast restart mechanism for checkpoint/recovery protocols in networked environments.",
					"Tempest: Soft state replication in the service tier.",
					"AGIS: Towards automatic generation of infection signatures.",
					"Convicting exploitable software vulnerabilities: An efficient input provenance based approach.",
					"Mapping software faults with web security vulnerabilities.",
					"A fault-tolerant directory-based cache coherence protocol for CMP architectures.",
					"Probabilistic quorum systems in wireless ad hoc networks.",
					"BAR primer.",
					"Improving dependability of network configuration through policy classification.",
					"Traffic grooming in WDM mesh networks with guaranteed survivability.",
					"Implementation and evaluation of a distributed and cooperative load-balancing mechanism for dependable volunteer computing.",
					"An integrated approach to resource pool management: Policies, efficiency and quality metrics.",
					"Scheduling for performance and availability in systems with temporal dependent workloads.",
					"Hot-spot prediction and alleviation in distributed stream processing applications.",
					"On localization attacks to Internet Threat Monitors: An information-theoretic framework.",
					"Automatic security assessment of critical cyber-infrastructures.",
					"Evaluating email's feasibility for botnet command and control.",
					"Scaling file systems to support petascale clusters: A dependability analysis to support informed design choices.",
					"WS-DREAM: A distributed reliability assessment Mechanism for Web Services.",
					"A log mining approach to failure analysis of enterprise telephony systems.",
					"Integration and evaluation of Multi-Instance-Precommit schemes within postgreSQL.",
					"Toward an understanding of the processing delay of peer-to-peer relay nodes.",
					"TCP covert timing channels: Design and detection.",
					"A smart triggering scheme to reduce service interruption during heterogeneous handovers.",
					"On representing knowledge in the dependability domain: a panel discussion.",
					"Evaluating availability under quasi-heavy-tailed repair times.",
					"Anomaly? application change? or workload change? towards automated detection of application performance anomaly and change.",
					"Survivability quantification of communication services.",
					"SymPLFIED: Symbolic program-level fault injection and error detection framework.",
					"A characterization of instruction-level error derating and its implications for error detection.",
					"Enhancing data availability in disk drives through background activities.",
					"Analyzing the effects of disk-pointer corruption.",
					"Architectural dependability evaluation with Arcade.",
					"An information-theoretic approach to detecting performance anomalies and changes for large-scale distributed web services.",
					"A recurrence-relation-based reward model for performability evaluation of embedded systems.",
					"International Workshop on Resilience Assessment and Dependability Benchmarking (RADB 2008).",
					"Workshop on compiler and architectural techniques for application reliability and security (CATARS).",
					"Second workshop on dependable and secure nanocomputing.",
					"Workshop on Architecting Dependable Systems (WADS 2008)."
				]
			},
			{
				"sub_name_abbr": "conf/icse/2008wads",
				"sub_name": "Architecting Dependable Systems VI.",
				"count": 13,
				"papers": [
					"A System of Architectural Patterns for Scalable, Consistent and Highly Available Multi-Tier Service-Oriented Infrastructures.",
					"Towards Self-adaptation for Dependable Service-Oriented Systems.",
					"Architecting Dependable Access Control Systems for Multi-domain Computing Environments.",
					"Soft Constraints for Dependable Service Oriented Architectures.",
					"Robustness Validation in Service-Oriented Architectures.",
					"A Self-repair Architecture for Cluster Systems.",
					"Handling Software Faults with Redundancy.",
					"A Uniform Approach to Security and Fault-Tolerance Specification and Analysis.",
					"A Comprehensive Exploration of Challenges in Architecture-Based Reliability Estimation.",
					"Weak Behavioral Equivalences for Verifying Secure and Performance-Aware Component-Based Systems.",
					"Architecting Security with Paradigm.",
					"Trust-Based and Context-Aware Authentication in a Software Architecture for Context and Proximity-Aware Services.",
					"Compositional Verification of Architectural Refactorings."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "37th DSN 2007",
		"info": "Edinburgh, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2007",
				"sub_name": "The 37th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2007, 25-28 June 2007, Edinburgh, UK, Proceedings.",
				"count": 92,
				"papers": [
					"Science and Engineering: A Collusion of Cultures.",
					"Augmenting Branch Predictor to Secure Program Execution.",
					"A Firewall for Routers: Protecting against Routing Misbehavior.",
					"An Architectural Approach to Preventing Code Injection Attacks.",
					"Failure Resilience for Device Drivers.",
					"Fault Tolerance Connectors for Unreliable Web Services.",
					"Robustness and Security Hardening of COTS Software Libraries.",
					"Automatic Verification and Discovery of Byzantine Consensus Protocols.",
					"Knowledge Connectivity vs. Synchrony Requirements for Fault-Tolerant Agreement in Unknown Networks.",
					"Communication Predicates: A High-Level Abstraction for Coping with Transient and Dynamic Faults.",
					"Synchronous Consensus with Mortal Byzantines.",
					"Reliability Techniques for RFID-Based Object Tracking Applications.",
					"Profiling Attacker Behavior Following SSH Compromises.",
					"Dependability Assessment of Grid Middleware.",
					"Assessing Robustness of Web-Services Infrastructures.",
					"Protecting Cryptographic Keys from Memory Disclosure Attacks.",
					"Fault Tolerant Planning for Critical Robots.",
					"Insights into the Sensitivity of the BRAIN (Braided Ring Availability Integrity Network) - On Platform Robustness in Extended Operation.",
					"A Tunable Add-On Diagnostic Protocol for Time-Triggered Systems.",
					"Enhanced Reliability Modeling of RAID Storage Systems.",
					"On a Modeling Framework for the Analysis of Interdependencies in Electric Power Systems.",
					"Superscalar Processor Performance Enhancement through Reliable Dynamic Clock Frequency Tuning.",
					"Determining Fault Tolerance of XOR-Based Erasure Codes Efficiently.",
					"Fault Tolerant Approaches to Nanoelectronic Programmable Logic Arrays.",
					"Concilium: Collaborative Diagnosis of Broken Overlay Routes.",
					"R-Sentry: Providing Continuous Sensor Services against Random Node Failures.",
					"A Fast Rejuvenation Technique for Server Consolidation with Virtual Machines.",
					"A Cost-Effective Dependable Microcontroller Architecture with Instruction-Level Rollback for Soft Error Recovery.",
					"Architecture-Level Soft Error Analysis: Examining the Limits of Common Assumptions.",
					"Feedback Redundancy: A Power Efficient SEU-Tolerant Latch Design for Deep Sub-Micron Technologies.",
					"Using Register Lifetime Predictions to Protect Register Files against Soft Errors.",
					"Using Process-Level Redundancy to Exploit Multiple Cores for Transient Fault Tolerance.",
					"Inherent Time Redundancy (ITR): Using Program Repetition for Low-Overhead Fault Tolerance.",
					"Utilizing Dynamically Coupled Cores to Form a Resilient Chip Multiprocessor.",
					"BlackJack: Hard Error Detection with Redundant Threads on SMT.",
					"Confidence: Its Role in Dependability Cases for Risk Assessment.",
					"Assurance Based Development of Critical Systems.",
					"Multiprocessors May Reduce System Dependability under File-Based Race Condition Attacks.",
					"Understanding Resiliency of Internet Topology against Prefix Hijack Attacks.",
					"User Discrimination through Structured Writing on PDAs.",
					"How to Choose a Timing Model?",
					"Electing an Eventual Leader in an Asynchronous Shared Memory System.",
					"Minimizing Response Time for Quorum-System Protocols over Wide-Area Networks.",
					"HyParView: A Membership Protocol for Reliable Gossip-Based Broadcast.",
					"A Lightweight Mechanism for Dependable Communication in Untrusted Networks.",
					"Dynamic Cross-Realm Authentication for Multi-Party Service Interactions.",
					"Enhancing DNS Resilience against Denial of Service Attacks.",
					"Automatic Cookie Usage Setting with CookiePicker.",
					"Greedy Receivers in IEEE 802.11 Hotspots.",
					"Emergent Structure in Unstructured Epidemic Multicast.",
					"The Case for FEC-Based Reliable Multicast in Wireless Mesh Networks.",
					"On the Selection of Error Model(s) for OS Robustness Evaluation.",
					"Experimental Risk Assessment and Comparison Using Software Fault Injection.",
					"Foundations of Measurement Theory Applied to the Evaluation of Dependability Attributes.",
					"A Framework for Architecture-Level Lifetime Reliability Modeling.",
					"Processor-Level Selective Replication.",
					"Robustness Testing of the Windows DDK.",
					"SLAM: Sleep-Wake Aware Local Monitoring in Sensor Networks.",
					"What Supercomputers Say: A Study of Five System Logs.",
					"How Do Mobile Phones Fail? A Failure Data Analysis of Symbian OS Smart Phones.",
					"A Real-Time Network Traffic Profiling System.",
					"RAS by the Yard.",
					"Web Services Wind Tunnel: On Performance Testing Large-Scale Stateful Web Services.",
					"Application of Software Watchdog as a Dependability Software Service for Automotive Safety Relevant Systems.",
					"Evaluating the Impact of Simultaneous Round Participation and Decentralized Decision on the Performance of Consensus.",
					"On the Cost of Modularity in Atomic Broadcast.",
					"Eventually k-Bounded Wait-Free Distributed Daemons.",
					"Measuring Availability in Optimistic Partition-Tolerant Systems with Data Constraints.",
					"Scaling and Continuous Availability in Database Server Clusters through Multiversion Replication.",
					"Improving Recoverability in Multi-tier Storage Systems.",
					"Portable and Efficient Continuous Data Protection for Network File Servers.",
					"Variational Bayesian Approach for Interval Estimation of NHPP-Based Software Reliability Models.",
					"Dynamic Fault Tree Analysis Using Input/Output Interactive Markov Chains.",
					"Uniformity by Construction in the Analysis of Nondeterministic Stochastic Systems.",
					"A Reinforcement Learning Approach to Automatic Error Recovery.",
					"On the Quality of Service of Crash-Recovery Failure Detectors.",
					"E2EProf: Automated End-to-End Performance Management for Enterprise Systems.",
					"Bounding Peer-to-Peer Upload Traffic in Client Networks.",
					"Performability Models for Multi-Server Systems with High-Variance Repair Durations.",
					"Computing Battery Lifetime Distributions.",
					"Quantifying the Effectiveness of Mobile Phone Virus Response Mechanisms.",
					"DSN 2007 Tutorials.",
					"DSN 2007 Workshops.",
					"Workshop on Dependable Application Support for Self-Organizing Networks (DASSON 2007).",
					"Third Workshop on Hot Topics in System Dependability HotDep'07.",
					"Workshop on Architecting Dependable Systems (WADS 2007).",
					"Assurance Cases for Security: The Metrics Challenge.",
					"Workshop on Dependable and Secure Nanocomputing.",
					"Student Forum.",
					"Fast Abstracts.",
					"The National Programme for Information Technology in the UK Health Service: Dependability Challenges and Strategies.",
					"Industry Session."
				]
			},
			{
				"sub_name_abbr": "conf/icse/2007wads",
				"sub_name": "Architecting Dependable Systems V [the book is a result from the WADS 2007 and the Third Workshop on the Role of Software Architecture for Testing and Analysis].",
				"count": 14,
				"papers": [
					"The CRUTIAL Architecture for Critical Information Infrastructures.",
					"A Middleware Improved Technology (MIT) to Mitigate Interdependencies between Critical Infrastructures.",
					"Evaluation of Critical Infrastructures: Challenges and Viable Approaches.",
					"Analysis of a Redundant Architecture for Critical Infrastructure Protection.",
					"A Robust Semantic Overlay Network for Microgrid Control Applications.",
					"Architecting Dependable and Secure Systems Using Virtualization.",
					"Model-Based Approaches for Dependability in Ad-Hoc Mobile Networks and Services.",
					"Design, Implementation and Deployment of State Machines Using a Generative Approach.",
					"Handling Emergent Nondeterminism in Replicated Services.",
					"Toward Architecture Evaluation through Ontology-Based Requirements-Level Scenarios.",
					"Combining Formal Verification and Testing for Correct Legacy Component Integration in Mechatronic UML.",
					"Plug-and-Play Architectural Design and Verification.",
					"Data Flow-Based Validation of Web Services Compositions: Perspectives and Examples.",
					"Using Architecture Analysis to Evolve Complex Industrial Systems."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "DSN 2006",
		"info": "Philadelphia, Pennsylvania, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2006",
				"sub_name": "2006 International Conference on Dependable Systems and Networks (DSN 2006), 25-28 June 2006, Philadelphia, Pennsylvania, USA, Proceedings.",
				"count": 73,
				"papers": [
					"Welcome Message from the General Chair.",
					"Welcome Message from the Conference Coordinator.",
					"Conference Organizers.",
					"Message from the Dependable Computing and Communications Symposium (DCCS) Program Chair.",
					"DCCS Program Committee.",
					"List of Reviewers for DCCS.",
					"William C. Carter Award.",
					"Message from the Performance and Dependability Symposium (PDS) Program Chair.",
					"PDS Program Committee.",
					"List of Reviewers for PDS.",
					"Delivering Dependability: A Moving Target.",
					"Efficient High Hamming Distance CRCs for Embedded Networks.",
					"Memory-Conscious Reliable Execution on Embedded Chip Multiprocessors.",
					"Static Analysis to Enforce Safe Value Flow in Embedded Control Systems.",
					"The Startup Problem in Fault-Tolerant Time-Triggered Communication.",
					"A Reconfigurable Generic Dual-Core Architecture.",
					"A Dependable System Architecture for Safety-Critical Respiratory-Gated Radiation Therapy.",
					"User Interface Defect Detection by Hesitation Analysis.",
					"Dynamic Verification of Memory Consistency in Cache-Coherent Multithreaded Computer Architectures.",
					"Automatic Instruction-Level Software-Only Recovery.",
					"Exploring Fault-Tolerant Network-on-Chip Architectures.",
					"Scaling Byzantine Fault-Tolerant Replication toWide Area Networks.",
					"Optimal Resilience for Erasure-Coded Byzantine Distributed Storage.",
					"Lucky Read/Write Access to Robust Atomic Storage.",
					"One-step Consensus with Zero-Degradation.",
					"Consensus with Byzantine Failures and Little System Synchrony.",
					"Solving Atomic Broadcast with Indirect Consensus.",
					"Eventual Leader Election with Weak Assumptions on Initial Knowledge, Communication Reliability, and Synchrony.",
					"Hotspots: The Root Causes of Non-Uniformity in Self-Propagating Malware.",
					"A Multi-Resolution Approach for Worm Detection and Containment.",
					"Honeypot-Aware Advanced Botnet Construction and Maintenance.",
					"Barbarians in the Gate: An Experimental Validation of NIC-based Distributed Firewall Performance and Flood Tolerance.",
					"HoVer Erasure Codes For Disk Arrays.",
					"Storage Allocation in Unreliable Peer-to-Peer Systems.",
					"Reliability for Networked Storage Nodes.",
					"A large-scale study of failures in high-performance computing systems.",
					"Tracking Probabilistic Correlation of Monitoring Data for Fault Detection in Complex Systems.",
					"Efficiently Detecting All Dangling Pointer Uses in Production Servers.",
					"In-Register Duplication: Exploiting Narrow-Width Value for Improving Register File Reliability.",
					"Run-Time Reconfiguration for Emulating Transient Faults in VLSI Systems.",
					"CADRE: Cycle-Accurate Deterministic Replay for Hardware Debugging.",
					"Collecting and Analyzing Failure Data of Bluetooth Personal Area Networks.",
					"Improving BGP Convergence Delay for Large-Scale Failures.",
					"Secure Split Assignment Trajectory Sampling: A Malicious Router Detection System.",
					"A General Framework for Scalability and Performance Analysis of DHT Routing Systems.",
					"Dependability Analysis of Virtual Memory Systems.",
					"Assessment of the Effect of Memory Page Retirement on System RAS Against Hardware Faults.",
					"Designing dependable storage solutions for shared application environments.",
					"A Statistical Analysis of Attack Data to Separate Attacks.",
					"VoIP Intrusion Detection Through Interacting Protocol State Machines.",
					"Mitigating Active Attacks Towards Client Networks Using the Bitmap Filter.",
					"Accurate and Automated System Call Policy-Based Intrusion Prevention.",
					"BlueGene/L Failure Analysis and Prediction Models.",
					"Performance Assurance via Software Rejuvenation: Monitoring, Statistics and Algorithms.",
					"Automatic Recovery Using Bounded Partially Observable Markov Decision Processes.",
					"Using Attack Injection to Discover New Vulnerabilities.",
					"Assessing the Attack Threat due to IRC Channels.",
					"An Approach for Detecting and Distinguishing Errors versus Attacks in Sensor Networks.",
					"A Component-Level Path Composition Approach for Efficient Transient Analysis of Large CTMCs.",
					"Evaluating the Performability of Systems with Background Jobs.",
					"A Contribution Towards Solving the Web Workload Puzzle.",
					"Empirical and Analytical Evaluation of Systems with Multiple Unreliable Servers.",
					"R-Opus: A Composite Framework for Application Performability and QoS in Shared Resource Pools.",
					"Cost-Effective Configuration of Content Resiliency Services Under Correlated Failures.",
					"High Throughput Total Order Broadcast for Cluster Environments.",
					"Improving the Fault Resilience of Overlay Multicast for Media Streaming.",
					"Randomized Intrusion-Tolerant Asynchronous Services.",
					"A Performance Study on the Signal-On-Fail Approach to Imposing Total Order in the Streets of Byzantium.",
					"Workshop on Applied Software Reliability (WASR).",
					"Workshop on Architecting Dependable Systems (WADS).",
					"Workshop on Empirical Evaluation of Dependability and Security (WEEDS).",
					"Student Forum.",
					"Fast Abstracts."
				]
			},
			{
				"sub_name_abbr": "conf/icse/2006wads",
				"sub_name": "Architecting Dependable Systems IV [the book is a result of the ICSE 2006 and DSN 2006 workshops].",
				"count": 18,
				"papers": [
					"Architecting Dependable Systems with the SAE Architecture Analysis and Description Language (AADL).",
					"A System Dependability Modeling Framework Using AADL and GSPNs.",
					"Towards Improving Dependability of Automotive Systems by Using the EAST-ADL Architecture Description Language.",
					"The View Glue.",
					"A Component-Based Approach to Verification and Validation of Formal Software Models.",
					"A Pattern-Based Approach for Modeling and Analyzing Error Recovery.",
					"Architectural Fault Tolerance Using Exception Handling.",
					"Model-Centric Development of Highly Available Software Systems.",
					"An Outline of an Architecture-Based Method for Optimizing Dependability Attributes of Software-Intensive Systems.",
					"A Distributed Monitoring System for Enhancing Security and Dependability at Architectural Level.",
					"Architecting Dynamic Reconfiguration in Dependable Systems.",
					"Ecotopia: An Ecological Framework for Change Management in Distributed Systems.",
					"Generic-Events Architecture: Integrating Real-World Aspects in Event-Based Systems.",
					"Flexible Communication Architecture for Dependable Time-Triggered Systems.",
					"Business Process Monitoring for Dependability.",
					"Achieving Dependable Systems by Synergistic Development of Architectures and Assurance Cases.",
					"Towards Evidence-Based Architectural Design for Safety-Critical Software Applications.",
					"Extending Failure Modes and Effects Analysis Approach for Reliability Analysis at the Software Architecture Design Level."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "DSN 2005",
		"info": "Yokohama, Japan",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2005",
				"sub_name": "2005 International Conference on Dependable Systems and Networks (DSN 2005), 28 June - 1 July 2005, Yokohama, Japan, Proceedings.",
				"count": 95,
				"papers": [
					"Welcome Message from the General Chair and Conference Coordinator.",
					"Conference Organizers.",
					"Message from the Dependable Computing and Communications Symposium (DCCS) Program Chair.",
					"DCCS Program Committee.",
					"DCCS Reviewers.",
					"W.C. Carter Award.",
					"Message from the Performance and Dependability Symposium (PDS) Program Co-Chairs.",
					"PDS Steering and Program Committees.",
					"PDS Reviewers.",
					"Observation of Local and Distant Earthquakes and Tsunami Warning System.",
					"Assured Reconfiguration of Fail-Stop Systems.",
					"NonStop® Advanced Architecture.",
					"How Fast Can Eventual Synchrony Lead to Consensus?.",
					"ReStore: Symptom Based Soft Error Detection in Microprocessors.",
					"Combining Error Masking and Error Detection Plus Recovery to Combat Soft Errors in Static CMOS Circuits.",
					"On-Line Detection of Control-Flow Errors in SoCs by Means of an Infrastructure IP Core.",
					"User Interface Dependability through Goal-Error Prevention.",
					"Stability Monitoring and Analysis of Learning in an Adaptive System.",
					"Effective Testing and Debugging Techniques for a Group Communication System.",
					"Error Propagation Profiling of Operating Systems.",
					"How Resilient are Distributed f Fault/Intrusion-Tolerant Systems?",
					"Towards a Theory of Insider Threat Assessment.",
					"Constructing Multi-Layered Boundary to Defend Against Intrusive Anomalies: An Autonomic Detection Coordinator.",
					"A Model of Stateful Firewalls and Its Properties.",
					"GoCast: Gossip-Enhanced Overlay Multicast for Fast and Dependable Group Communication.",
					"SMRP: Fast Restoration of Multicast Sessions from Persistent Failures.",
					"Efficient Byzantine Broadcast in Wireless Ad-Hoc Networks.",
					"Internet Routing Anomaly Detection and Visualization.",
					"Assessing the Performance of Erasure Codes in the Wide-Area.",
					"Finding Critical Traffic Matrices.",
					"A Distributed State Monitoring Service for Adaptive Application Management.",
					"Definition and Specification of Accrual Failure Detectors.",
					"The Effects of Algorithmic Diversity on Anomaly Detector Performance.",
					"On Partial Protection in Groomed Optical WDM Mesh Networks.",
					"Resilient Routing Layers for Recovery in Packet Networks.",
					"Perturbation-Resistant and Overlay-Independent Resource Discovery.",
					"Cruz: Application-Transparent Distributed Checkpoint-Restart on Standard Operating Systems.",
					"A Multi-Level Meta-Object Protocol for Fault-Tolerance in Complex Architectures.",
					"Crash Data Collection: A Windows Case Study.",
					"Scalable and Robust WLAN Connectivity Using Access Point Array.",
					"Ringing out Fault Tolerance. A New Ring Network for Superior Low-Cost Dependability.",
					"A System Demonstration of ST-TCP.",
					"A Data-Centric Approach to Checksum Reuse for Array-Intensive Applications.",
					"Small Parity-Check Erasure Codes - Exploration and Observations.",
					"Using Erasure Codes Efficiently for Storage in a Distributed System.",
					"Coverage and the Use of Cyclic Redundancy Codes in Ultra-Dependable Systems.",
					"Authenticated System Calls.",
					"Detecting Stealth Software with Strider GhostBuster.",
					"Defeating Memory Corruption Attacks via Pointer Taintedness Detection.",
					"Checking Array Bound Violation Using Segmentation Hardware.",
					"Dependability Benchmarking of Computing Systems - Panel Statement.",
					"Fast Byzantine Consensus.",
					"A Hybrid and Adaptive Model for Fault-Tolerant Distributed Computing.",
					"Adaptive Indulgent Consensus.",
					"Microarchitecture-Based Introspection: A Technique for Transient-Fault Tolerance in Microprocessors.",
					"Reversible Fault-Tolerant Logic.",
					"Co-Design Based Approach to Improve Robustness in Networked Control Systems.",
					"H-RAFT - Heuristic Reachability Analysis for Fault Tolerance Protocols Modelled in SDL.",
					"Filtering Failure Logs for a BlueGene/L Prototype.",
					"Design Time Reliability Analysis of Distributed Fault Tolerance Algorithms.",
					"SoftArch: An Architecture Level Tool for Modeling and Analyzing Soft Errors.",
					"ADEPTS: Adaptive Intrusion Response Using Attack Graphs in an E-Commerce Environment.",
					"Neutralization of Errors and Attacks in Wireless Ad Hoc Networks.",
					"Modeling and Automated Containment of Worms.",
					"Fatih: Detecting and Isolating Malicious Routers.",
					"Combining Response Surface Methodology with Numerical Models for Optimization of Class-Based Queueing Systems.",
					"On a Method for Mending Time to Failure Distributions.",
					"A Performability-Oriented Software Rejuvenation Framework for Distributed Applications.",
					"Optimizing the Pulsing Denial-of-Service Attacks.",
					"Towards a Security Benchmark for Database Management Systems.",
					"An Experimental Evaluation to Determine if Port Scans are Precursors to an Attack.",
					"LITEWORP: A Lightweight Countermeasure for the Wormhole Attack in Multihop Wireless Networks.",
					"Experimental Evaluation of the QoS of Failure Detectors on Wide Area Network.",
					"Probabilistic QoS Guarantees for Supercomputing Systems.",
					"Ensembles of Models for Automated Diagnosis of System Performance Problems.",
					"A Framework for Node-Level Fault Tolerance in Distributed Real-Time Systems.",
					"Experimental Dependability Evaluation of a Fail-Bounded Jet Engine Control System for Unmanned Aerial Vehicles.",
					"TIBFIT: Trust Index Based Fault Tolerance for Arbitrary Data Faults in Sensor Networks.",
					"Improving TCP Performance for Multihop Wireless Networks.",
					"A Spatial Fluid-Based Framework to Analyze Large-Scale Wireless Sensor Networks.",
					"Are You Still There? - A Lightweight Algorithm to Monitor Node Presence in Self-Configuring Networks.",
					"A Novel Approach for Fitting Probability Distributions to Real Trace Data with the EM Algorithm.",
					"Model Checking Markov Reward Models with Impulse Rewards.",
					"A Wavefront Parallelisation of CTMC Solution Using MTBDDs.",
					"Lumping Matrix Diagram Representations of Markov Models.",
					"Neutron SER Characterization of Microprocessors.",
					"Microprocessor Sensitivity to Failures: Control vs Execution and Combinational vs Sequential Logic.",
					"Engineering Over-Clocking: Reliability-Performance Trade-Offs for High-Performance Register Files.",
					"Analysis of Probabilistic Trapezoid Protocol for Data Replication.",
					"Testing the Dependability and Performance of Group Communication Based Database Replication Protocols.",
					"Model-Based Failure Analysis of Journaling File Systems.",
					"Modeling Coordinated Checkpointing for Large-Scale Supercomputers.",
					"Workshop on Dependable Software - Tools and Methods - Workshop Abstract.",
					"Workshop on Hot Topics in System Depend - Workshop Abstract.",
					"Workshop on Assurance of Networking Systems Dependability Service Level Agreements - Workshop Abstract."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "DSN 2004",
		"info": "Florence, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2004",
				"sub_name": "2004 International Conference on Dependable Systems and Networks (DSN 2004), 28 June - 1 July 2004, Florence, Italy, Proceedings.",
				"count": 96,
				"papers": [
					"Recent Discoveries from Paxos.",
					"Performance and Dependability of Structured Peer-to-Peer Overlays.",
					"Robust Aggregation Protocols for Large-Scale Overlay Networks.",
					"Impact of Path Diversity on Multi-homed and Overlay Networks.",
					"Fault Detection and Isolation Techniques for Quasi Delay-Insensitive Circuits.",
					"Tolerating Hard Faults in Microprocessor Array Structures.",
					"Characterizing the Effects of Transient Faults on a High-Performance Processor Pipeline.",
					"Dynamic Quarantine of Internet Worms.",
					"HOURS: Achieving DoS Resilience in an Open Service Hierarchy.",
					"Robust Protection against Fault-Injection Attacks on Smart Cards Implementing the Advanced Encryption Standard.",
					"A Defense-Centric Taxonomy Based on Attack Manifestations.",
					"A Practical Analysis of Low-Density Parity-Check Erasure Codes for Wide-Area Storage Applications.",
					"A Decentralized Algorithm for Erasure-Coded Virtual Disks.",
					"Efficient Byzantine-Tolerant Erasure-Coded Storage.",
					"Cyclic Redundancy Code (CRC) Polynomial Selection For Embedded Networks.",
					"Fault Tolerant Computation on Ensemble Quantum Computers.",
					"The Recursive NanoBox Processor Grid: A Reliable System Architecture for Unreliable Nanotechnology Devices.",
					"The Impact of Technology Scaling on Lifetime Reliability.",
					"Model Checking a Fault-Tolerant Startup Algorithm: From Design Exploration To Exhaustive Fault Simulation.",
					"Verifying Web Applications Using Bounded Model Checking.",
					"Automated Synthesis of Multitolerance.",
					"Exposing and Eliminating Vulnerabilities to Denial of Service Attacks in Secure Gossip-Based Multicast.",
					"Data-Aware Multicast.",
					"Timed Uniform Consensus Resilient to Crash and Timing Faults.",
					"Caching-Enhanced Scalable Reliable Multicast.",
					"The Effect of Testing on Reliability of Fault-Tolerant Software.",
					"Quantifying the Reliability of Proven SPIDER Group Membership Service Guarantees.",
					"Generic Faultloads Based on Software Faults for Dependability Benchmarking.",
					"Improving System Dependability with Functional Alternatives.",
					"Cheap Paxos.",
					"The Join Problem in Dynamic Network Algorithms.",
					"A Framework for Dynamic Byzantine Storage.",
					"Dependable Initialization of Large-Scale Distributed Software.",
					"A Bi-Criteria Scheduling Heuristic for Distributed Embedded Systems under Reliability and Real-Time Constraints.",
					"Proactive Recovery in Distributed CORBA Applications.",
					"Assured Reconfiguration of Embedded Real-Time Software.",
					"Fault Tolerance Tradeoffs in Moving from Decentralized to Centralized Embedded Systems.",
					"Fault Diversity among Off-The-Shelf SQL Database Servers.",
					"Does Your Result Checker Really Check?",
					"Experience with Evaluating Human-Assisted Recovery Processes.",
					"Automated System Design for Availability.",
					"Secure Distributed DNS.",
					"SCIDIVE: A Stateful and Cross Protocol Intrusion Detection Architecture for Voice-over-IP Environments.",
					"A Portable Implementation Framework for Intrusion-Resilient Database Management Systems.",
					"A Qualitative Analysis of the Intrusion-Tolerance Capabilities of the MAFTIA Architecture.",
					"FRTR: A Scalable Mechanism for Global Routing Table Consistency.",
					"On Failure Dependent Protection in Optical Grooming Networks.",
					"Analyses of the Reverse Path Forwarding Routing Algorithm.",
					"Delivering Packets During The Routing Convergence Latency Interval Through Highly Connected Detours.",
					"An Adaptive Algorithm for Efficient Message Diffusion in Unreliable Environments.",
					"Efficient Hierarchic Management For Reconfiguration of Networked Information Systems.",
					"Collective Endorsement and the Dissemination Problem in Malicious Environments.",
					"Support for Mobility and Fault Tolerance in Mykil.",
					"Implementing Simple Replication Protocols using CORBA Portable Interceptors and Java Serialization.",
					"In Advance Activation of Backup Channels for Real-Time Transmission.",
					"Why PCs Are Fragile and What We Can Do About It: A Study of Windows Registry Problems.",
					"Dependable Adaptive Real-Time Applications in Wormhole-based Systems.",
					"High Throughput Byzantine Fault Tolerance.",
					"An Architectural Framework for Providing Reliability and Security Support.",
					"Diverse Firewall Design.",
					"Component Middleware to Support Non-repudiable Service Interactions.",
					"Customizing Dependability Attributes for Mobile Service Platforms.",
					"Discovering 1-FT Routes in Mobile Ad Hoc Networks.",
					"Intrusion Tolerance and Anti-Traffic Analysis Strategies For Wireless Sensor Networks.",
					"Safety Optimization: A Combination of Fault Tree Analysis and Optimization Techniques.",
					"Repairable Fault Tree for the Automatic Evaluation of Repair Policies.",
					"Availability Measurement and Modeling for An Application Server.",
					"Benchmarking The Dependability of Windows NT4, 2000 and XP.",
					"Checkpointing of Control Structures in Main Memory Database Systems.",
					"Hierarchical Computation of Interval Availability and Related Metrics.",
					"Model Checking Action- and State-Labelled Markov Chains.",
					"Model Checking Dependability Attributes of Wireless Group Communication.",
					"Min-Max Checkpoint Placement under Incomplete Failure Information.",
					"Assessing the Impact of Dynamic Power Management on the Functionality and the Performance of Battery-Powered Appliances.",
					"An SLA-Oriented Capacity Planning Tool for Streaming Media Services.",
					"QoS of Timeout-Based Self-Tuned Failure Detectors: The Effects of the Communication Delay Predictor and the Safety Margin.",
					"Optimal Object State Transfer - Recovery Policies for Fault Tolerant Distributed Systems.",
					"Failure Data Analysis of a Large-Scale Heterogeneous Server Environment.",
					"Evaluating the Impact of Limited Resource on the Performance of Flooding in Wireless Sensor Networks.",
					"Fault Tolerant Energy Aware Data Dissemination Protocol in Sensor Networks.",
					"Cluster-Based Failure Detection Service for Large-Scale Ad Hoc Wireless Network Applications.",
					"A Markov Reward Model for Reliable Synchronous Dataflow System Design.",
					"A Method for Performance Analysis of Earliest-Deadline-First Scheduling Policy.",
					"An Efficient Algorithm for the Transient Analysis of a Class of Deterministic Stochastic Petri Nets.",
					"Analysis of Second-Order Markov Reward Models.",
					"On Benchmarking the Dependability of Automotive Engine Control Applications.",
					"Characterization of the Impact of Faulty Drivers on the Robustness of the Linux Kernel.",
					"A Framework for Evaluating Storage System Dependability.",
					"Error Sensitivity of the Linux Kernel Executing on PowerPC G4 and Pentium 4 Processors.",
					"Workshop on Interdisciplinary Approaches to Achieving and Analysing System Dependability.",
					"DIWANS: Workshop on Dependability Issues in Wireless Ad Hoc Networks and Sensor Networks.",
					"Twin Workshops on Architecting Dependable Systems (WADS 2004).",
					"Workshop on Fault Diagnosis and Tolerance in Cryptography.",
					"Workshop on Assurance Cases: Best Practices, Possible Obstacles, and Future Opportunities.",
					"Student Forum.",
					"Fast Abstracts."
				]
			},
			{
				"sub_name_abbr": "conf/icse/2004wads",
				"sub_name": "Architecting Dependable Systems III [the book is a result of the ICSE 2004 and DSN 2004 workshops].",
				"count": 16,
				"papers": [
					"Semantics-Aware Services for the Mobile Computing Environment.",
					"The Role of Agreements in IT Management Software.",
					"Toward Undoing in Composite Web Services.",
					"Architecting Web Services Applications for Improving Availability.",
					"Dependable Composite Web Services with Components Upgraded Online.",
					"Adaptable Analysis of Dependable System Architectures Through Monitoring.",
					"Runtime Verification of Statechart Implementations.",
					"A Framework for Ensuring and Improving Dependability in Highly Distributed Systems.",
					"Enabling Safe Dynamic Component-Based Software Adaptation.",
					"Architecting and Implementing Versatile Dependability.",
					"A Feature-Oriented Alternative to Implementing Reliability Connector Wrappers.",
					"Concerning Predictability in Dependable Component-Based Systems: Classification of Quality Attributes.",
					"Architecture-Based Reliability Prediction for Service-Oriented Computing.",
					"Fault Injection Approach Based on Architectural Dependencies.",
					"Problem Structure and Dependable Architecture.",
					"The Lost Art of Abstraction."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "DSN 2003",
		"info": "San Francisco, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2003",
				"sub_name": "2003 International Conference on Dependable Systems and Networks (DSN 2003), 22-25 June 2003, San Francisco, CA, USA, Proceedings.",
				"count": 84,
				"papers": [
					"Masquerade Detection Using Enriched Command Lines.",
					"Decision-Support for Certification by Calculating the Evidential Volume of a Product.",
					"Multi-Legged Arguments: The Impact of Diversity upon Confidence in Dependability Arguments.",
					"Reliable Broadcast in a Computational Hybrid Model with Byzantine Faults, Crashes, and Recoveries.",
					"Adaptive Gossip-Based Broadcast.",
					"Scalably Supporting Durable Subscriptions in a Publish/Subscribe System.",
					"Pragmatic Fault Tolerance for Railway Control and Safety Protection of the Channel Tunnel.",
					"Dependability Assessment of Safety-Critical System Software by Static Analysis Methods.",
					"Integrating Recovery Strategies into a Primary Substation Automation System.",
					"The OLAP and Data Warehousing Approaches for Analysis and Sharing of Results from Dependability Evaluation Experiments.",
					"Building SWIFI Tools from Temporal Logic Specifications.",
					"Definition of Software Fault Emulation Operators: A Field Data Study.",
					"Robustness Benchmarking for Hardware Maintenance Events.",
					"Evaluation of Fault Handling of the Time-Triggered Architecture with Bus and Star Topology.",
					"LSRP: Local Stabilization in Shortest Path Routing.",
					"A Preemptive Deterministic Scheduling Algorithm for Multithreaded Replicas.",
					"An Algorithm for Automatically Obtaining Distributed and Fault-Tolerant Static Schedules.",
					"Detection and Handling of MAC Layer Misbehavior in Wireless Networks.",
					"A Study of Packet Delivery Performance during Routing Convergence.",
					"Low Overhead Fault Tolerant Networking in Myrinet.",
					"Dependable and Secure Data Storage and Retrieval in Mobile, Wireless Networks.",
					"Design, Implementation, and Evaluation of Repairable File Service.",
					"From Crash Tolerance to Authenticated Byzantine Tolerance: A Structured Approach, the Cost and Benefits.",
					"Adaptive Software Rejuvenation: Degradation Model and Rejuvenation Scheme.",
					"Human-Machine Diversity in the Use of Computerised Advisory Systems: A Case Study.",
					"RAMBO II: Rapidly Reconfigurable Atomic Memory for Dynamic Networks.",
					"The Design of Wearable Systems: A Shift in Development Effort.",
					"Dynamic Verification of End-to-End Multiprocessor Invariants.",
					"ICR: In-Cache Replication for Enhancing Data Cache Reliability.",
					"Benchmarking the Dependability of Different OLTP Systems.",
					"Persistent-State Checkpoint Comparison for Troubleshooting Configuration Failures.",
					"HEALERS: A Toolkit for Enhancing the Robustness and Security of Existing Applications.",
					"The Anacapa System.",
					"Node Failure Detection and Membership in CANELy.",
					"Design and Implementation of a Consistent Time Service for Fault-Tolerant Distributed Systems.",
					"Asynchronous Implementation of Failure Detectors.",
					"Communication Strategies for Heartbeat-Style Failure Detectors in Wireless Ad Hoc Networks.",
					"TCP Server Fault Tolerance Using Connection Migration to a Backup Server.",
					"Transparent TCP Connection Failover.",
					"Engineering Fault-Tolerant TCP/IP Servers Using FT-TCP.",
					"N-Way Fail-Over Infrastructure for Reliable Servers and Routers.",
					"On the Design of Robust Integrators for Fail-Bounded Control Systems.",
					"A Fault-Tolerant Java Virtual Machine.",
					"Towards Implementing Multi-Layer Reflection for Fault-Tolerance.",
					"Automatic Detection and Masking of Non-Atomic Exception Handling.",
					"Characterization of Linux Kernel Behavior under Errors.",
					"Reproducible Dependability Benchmarking Experiments Based on Unambiguous Benchmark Setup Descriptions.",
					"A Hybrid Fault Injection Approach Based on Simulation and Emulation Co-operation.",
					"Pre-Processing Input Data to Augment Fault Tolerance in Space Applications.",
					"Duplex: A Reusable Fault Tolerance Extension Framework for Network Access Devices.",
					"Reliable Communication in Overlay Networks.",
					"Dependability Enhancement for IEEE 802.11 Wireless LAN with Redundancy Techniques.",
					"Cost-Optimization of the IPv4 Zeroconf Protocol.",
					"Evaluating the Condition-Based Approach to Solve Consensus.",
					"How Bad Are Wrong Suspicions? Towards Adaptive Distributed Protocols.",
					"A Combinatorial Method for the Evaluation of Yield of Fault-Tolerant Systems-on-Chip.",
					"Real-Time Estimation of Event-Driven Traffic Latency Distributions when Layered on Static Schedules.",
					"ParEs - A Parameter-Estimation-Tool.",
					"Compiler-Directed Program-Fault Coverage for Highly Available Java Internet Services.",
					"A Data-Driven Finite State Machine Model for Analyzing Security Vulnerabilities.",
					"Probabilistic Validation of an Intrusion-Tolerant Replication System.",
					"An Abstract Interpretation-Based Timing Validation of Hard Real-Time Avionics Software.",
					"Performance Analysis of a Hierarchical Failure Detector.",
					"Comparison of Failure Detectors and Group Membership: Performance Study of Two Atomic Broadcast Algorithms.",
					"Opportunity-Adaptive QoS Enhancement in Satellite Constellations: A Case Study.",
					"Jaca - A Software Fault Injection Tool.",
					"GOOFI: Generic Object-Oriented Fault Injection Tool.",
					"INERTE: Integrated NExus-Based Real-Time Fault Injection Tool for Embedded Systems.",
					"Hardware Fault Injection with UMLinux.",
					"On Integrating the MÖBIUS and MODEST Modeling Tools.",
					"Dependable LQNS: A Performability Modeling Tool for Layered Systems.",
					"ETMCC: Model Checking Performability Properties of Markov Chains.",
					"A Methodology for Dependability and Performability Analysis in SAM.",
					"Reliability Analysis of Fault-Tolerant Systems with Common-Cause Failures.",
					"Validation of Approximate Dependability Models of a RAID Architecture with Orthogonal Organization.",
					"A User-Perceived Availability Evaluation of a Web Based Travel Agency.",
					"Software Aging and Multifractality of Memory Resources.",
					"Deadlock Resolution via Exceptions for Dependable Java Applications.",
					"A Voltage Scheduling Heuristic for Real-Time Task Graphs.",
					"On Dynamic Assignment of Impatient Customers to Parallel Queues.",
					"PoDSy 2003: Principles of Dependable Systems.",
					"Model Checking for Dependable Software-Intensive Systems.",
					"First Workshop on the Design of Self-Managing Systems.",
					"Self-Stabilization Workshop."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "DSN 2002",
		"info": "Washington, DC, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2002",
				"sub_name": "2002 International Conference on Dependable Systems and Networks (DSN 2002), 23-26 June 2002, Bethesda, MD, USA, Proceedings.",
				"count": 98,
				"papers": [
					"Exactly-once Delivery in a Content-based Publish-Subscribe System.",
					"An Adaptive Framework for Tunable Consistency and Timeliness Using Replication.",
					"Generic Timing Fault Tolerance using a Timely Computing Base.",
					"Lessons Learned in Building a Fault-Tolerant CORBA System.",
					"Model Checking Safety Properties of Servo-Loop Control Systems.",
					"Formal Development of an Embedded Verifier for Java Card Byte Code.",
					"Detection of Invalid Routing Announcement in the Internet.",
					"An Adaptive Architecture for Monitoring and Failure Analysis of High-Speed Networks.",
					"Edge-Based Fault Detection in a DiffServ Network.",
					"An Evaluation of Connectivity in Mobile Wireless Ad Hoc Networks.",
					"Model Checking Performability Properties.",
					"Process Modelling to Support Dependability Arguments.",
					"On the Use of Disaster Prediction for Failure-Tolerance in Feedback Control Systems.",
					"On the Placement of Software Mechanisms for Detection of Data Errors.",
					"Robust Software - No More Excuses.",
					"An Automated Approach to Increasing the Robustness of C Libraries.",
					"Secure Intrusion-tolerant Replication on the Internet.",
					"Coordination of Mobile Processes with Mobile Groups.",
					"Optimizing Buffer Management for Reliable Multicast.",
					"Reliability and Survivability in the Reduced Ship?s Crew by Virtual Presence System.",
					"Impact of Deep Submicron Technology on Dependability of VLSI Circuits.",
					"Experimental Evaluation of Time-redundant Execution for a Brake-by-wire Application.",
					"Masquerade Detection Using Truncated Command Lines.",
					"Quantifying the Cost of Providing Intrusion Tolerance in Group Communication Systems.",
					"Developing a Heterogeneous Intrusion Tolerant CORBA System.",
					"Distributed Object Middleware to Support Dependable Information Sharing between Organisations.",
					"Dependability and the Grid: Issues and Challenges.",
					"MAFALDA-RT: A Tool for Dependability Assassment of Real-Time Systems.",
					"Mr. Fusion: A Programmable Data Fusion Middleware Subsystem with a Tunable Statistical Profiling Service.",
					"A Dependable SNMP-based Tool for Distributed Network Management.",
					"The Design and Implementation of an Intrusion Tolerant System.",
					"Reducing the Cost of Group Communication with Semantic View Synchrony.",
					"SWIM: Scalable Weakly-consistent Infection-style Process Group Membership Protocol.",
					"Probabilistic Multicast.",
					"Experimental Evaluation of a COTS System for Space Application.",
					"Experimental Analysis of the Errors Induced into Linux by Three Fault Injection Techniques.",
					"Reliability and Availability Analysis for the JPL Remote Exploration and Experimentation System.",
					"A Realistic Look At Failure Detectors.",
					"Implementation and Performance Evaluation of an Adaptable Failure Detector.",
					"A Versatile and Modular Consensus Protoco.",
					"Small Byzantine Quorum Systems.",
					"Modeling the Effect of Technology Trends on the Soft Error Rate of Combinational Logic.",
					"Detecting Processor Hardware Faults by Means of Automatically Generated Virtual Duplex Systems.",
					"A Portable and Fault-Tolerant Microprocessor Based on the SPARC V8 Architecture.",
					"Soft Error Sensitivity Characterization for Microprocessor Dependability Enhancement Strategy.",
					"Track-Based Disk Logging.",
					"Transactional Rollback for Language-Based Systems.",
					"Time-Constrained Failure Diagnosis in Distributed Embedded Systems.",
					"32-Bit Cyclic Redundancy Codes for Internet Applications.",
					"Measuring End-User Availability on the Web: Practical Experience.",
					"Advanced Pattern Recognition for Detection of Complex Software Aging Phenomena in Online Transaction Processing Servers.",
					"Jaca: A Reflective Fault Injection Tool Based on Patterns.",
					"Automatic Generation of Availability Models in RAScad.",
					"Evaluating the Security Threat of Firewall Data Corruption Caused by Transient Errors.",
					"Modeling and Quantification of Security Attributes of Software Systems.",
					"Stepwise Construction and Refinement of Dependability Models.",
					"Ditto Processor.",
					"CAVEAT: A Tool for Software Validation.",
					"CLAIRE: An Event-Driven Simulation Tool for Test and Validation of Software Programs.",
					"C-Sim - The C Language Enhancement for Discrete-Time Simulations.",
					"DrawNet++: A Flexible Framework for Building Dependability Models.",
					"Libsafe: Transparent System-wide Protection Against Buffer Overflow Attacks.",
					"NFTAPE: Networked Fault Tolerance and Performance Evaluator.",
					"PhFit: A General Phase-type Fitting Tool.",
					"SHARPE 2002: Symbolic Hierarchical Automated Reliability and Performance Evaluator.",
					"SMART: Stochastic Model-checking Analyzer for Reliability and Timing.",
					"SREPT: A Tool for Software Reliability Estimation and Prediction.",
					"Xception? - Enhanced Automated Fault-Injection Environment.",
					"Performance Analysis of a Consensus Algorithm Combining Stochastic Activity Networks and Measurements.",
					"Performability Analysis of Guarded-Operation Duration: A Successive Model-Translation Approach.",
					"A Simple Characterization of Provably Efficient Prefetching Algorithms.",
					"Joint Panel - IPDS and Workshop on Dependability Benchmarking.",
					"An Experimental Evaluation of the REE SIFT Environment for Spaceborne Applications.",
					"Pinpoint: Problem Determination in Large, Dynamic Internet Services.",
					"Reducing Recovery Time in a Small Recursively Restartable System.",
					"Recovery and Performance Balance of a COTS DBMS in the Presence of Operator Faults.",
					"The Scale Factor: A New Degree of Freedom in Phase Type Approximation.",
					"Efficient State Space Generation of GSPNs using Decision Diagrams.",
					"An Adaptive Decomposition Approach for the Analysis of Stochastic Petri Nets.",
					"Parallel Randomization for Large Structured Markov Chains.",
					"Test and Development Process Retrospective - A Case Study using ODC Triggers.",
					"Impact of Fault Management Server and Its Failure-related Parameters on High-Availability Communication Systems.",
					"Analysis of Failure and Recovery Rates in a Wireless Telecommunications System.",
					"Application Performance using End-to-End User Level Monitoring.",
					"Resource Management Policies in GPRS Wireless Internet Access Systems.",
					"Evaluating the Impact of Different Document Types on the Performance of Web Cache Replacement Schemes.",
					"A Validation of the Pseudo Self-Similar Traffic Model.",
					"Evaluation of the Maximum Level Reached by a Queue Over a Finite Period.",
					"Modeling the Coverage and Effectiveness of Fault-Management Architectures in Layered Distributed Systems.",
					"Self-Organizing Systems with Self-Diagnosability.",
					"A Compositional Approach to Monitoring Distributed Systems.",
					"Validation and Evaluation of a Software Solution for Fault Tolerant Distributed Synchronization.",
					"Intrusion Tolerant Systems Workshop.",
					"Workshop on Dependability and Robotics.",
					"Dependability of E-Commerce Systems.",
					"Workshop on Dependability Benchmarking.",
					"Workshop on Dependable Middleware-Based Systems.",
					"Scalable, Uniterruptible Computin."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "DSN 2001",
		"info": "Göteborg, Sweden",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2001",
				"sub_name": "2001 International Conference on Dependable Systems and Networks (DSN 2001) (formerly: FTCS), 1-4 July 2001, Göteborg, Sweden, Proceedings.",
				"count": 55,
				"papers": [
					"The Reliability of Diverse Systems: A Contribution Using Modelling of the Fault Creation Process.",
					"Difficulties Measuring Software Risk in an Industrial Environment.",
					"Techniques for Estimation of Design Diversity for Combinational Logic Circuits.",
					"Concurrent Error Detection in Fast Unitary Transform Algorithms.",
					"Fault-Tolerant High-Performance Matrix Multiplication: Theory and Practice.",
					"How to Model Link Failures: A Perception-Based Fault Model.",
					"Dependability of Mobile Networks and Services: Can We Rely on Them?",
					"A Checkpointing Tool for Palm Operating System.",
					"Model-Based Synthesis of Fault Trees from Matlab-Simulink Models.",
					"GOOFI: Generic Object-Oriented Fault Injection Tool.",
					"Quantifying the Reliability of Embedded Systems by Automated Analysis.",
					"Avoiding Priority Inversion on the Processing of Requests by Active Replicated Servers.",
					"A Dynamic Replica Selection Algorithm for Tolerating Timing Faults.",
					"Online Reconfiguration in Replicated Databases Based on Group Communication.",
					"Improving Driver Robustness: An Evaluation of the Devil Approach.",
					"Robustness Testing and Hardening of CORBA ORB Implementations.",
					"Constructing Self-Testable Software Components.",
					"An Approach for Analysing the Propagation of Data Errors in Software.",
					"Enhancing Survivability of Security Services Using Redundanc.",
					"Distributing Trust on the Internet .",
					"Protection of Software-Based Survivability Mechanisms.",
					"Intrusion-Tolerant Group Management in Enclaves.",
					"FATOMAS-A Fault-Tolerant Mobile Agent System Based on the Agent-Dependent Approach.",
					"A Framework for Database Audit and Control Flow Checking for a Wireless Telephone Network Controller.",
					"Analysis of the Effects of Outages on the Quality of Service of GPRS Network Systems.",
					"A Secure and Highly Available Distributed Store for Meeting Diverse Data Storage Needs.",
					"State Synchronization and Recovery for Strongly Consistent Replicated CORBA Objects.",
					"A Procedure-Based Dynamic Software Update.",
					"Design and Evaluation of Routing Schemes for Dependable Real-Time Connections.",
					"Performance Evaluation of Dependable Real-Time Communication with Elastic QoS.",
					"Experimental Evaluation of the Fail-Silent Behavior of a Distributed Real-Time Run-Time Support Built from COTS Components.",
					"A Study of Failure Models in Feedback Control Systems.",
					"A Strategy for Testing MetaObject Protocols in Reflective Architectures.",
					"Applicability of Non-Specification-Based Approaches to Logic Testing for Software.",
					"Reducing Critical Failures for Control Algorithms Using Executable Assertions and Best Effort Recover.",
					"Run-Time Fault Detection in Monitor Based Concurrent Programming.",
					"Synergistic Coordination between Software and Hardware Fault Tolerance Techniques.",
					"Performance Validation of Fault-Tolerance Software: A Compositional Approach.",
					"Graybox Stabilization.",
					"REESE: A Method of Soft Error Detection in Microprocessors.",
					"A Fault Tolerant Approach to Microprocessor Design.",
					"An Experimental Study of Security Vulnerabilities Caused by Errors.",
					"Scalable Fault-Tolerant Aggregation in Large Process Groups.",
					"Lightweight Probabilistic Broadcast.",
					"Middleware Support for Voting and Data Fusion.",
					"The SIMBA User Alert Service Architecture for Dependable Alert Delivery.",
					"Recovery in Fault-Tolerant Distributed Microcontrollers.",
					"Ensuring Dependable Processor Performance: An Experience Report on Pre-Silicon Performance Validation.",
					"The Design and Use of Persistent Memory on the DNCP Hardware Fault-Tolerant Platform.",
					"alidating the Intel® Pentium® 4 Microprocessor.",
					"Software-Implemented Fault Injection Methodology for Design and Validation of System Fault Tolerance.",
					"Hazard Analysis in Object Oriented Design of Dependable Systems.",
					"Byzantine Fault Tolerance Can Be Fast.",
					"Performance Evaluation of Exception Handling in I/O Libraries.",
					"Business Meeting: IEEE Technical Committee on Fault Tolerance."
				]
			}
		]
	},
	{
		"year": "2000",
		"name": "DSN 2000",
		"info": "New York, NY, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/dsn/2000",
				"sub_name": "2000 International Conference on Dependable Systems and Networks (DSN 2000) (formerly FTCS-30 and DCCA-8), 25-28 June 2000, New York, NY, USA.",
				"count": 65,
				"papers": [
					"Transparent Redundancy in the Time-Triggered Architecture.",
					"Resource Scheduling in Dependable Integrated Modular Avionics.",
					"Executable Assertions for Detecting Data Errors in Embedded Control Systems.",
					"Experiences with Group Communication Middleware.",
					"Towards Dependable Home Networking: An Experience Report.",
					"Design, Implementation, and Performance of Checkpointing in NetSolve.",
					"Efficient Incremental Checkpointing of Java Programs.",
					"A C/C++ Source-to-Source Compiler for Dependable Applications.",
					"Assessment of the Applicability of COTS Microprocessors in High-Confidence Computing Systems: A Case Study.",
					"Evaluating COTS Standards for Design of Dependable Systems.",
					"Whither Generic Recovery from Application Faults? A Fault Study using Open-Source Software.",
					"Software-Implemented Fault Detection for High-Performance Space Applications.",
					"An Automatic SPIN Validation of a Safety Critical Railway Control System.",
					"Sensitivity Analysis on Dependencies in Dynamic Availability Models for Large Systems.",
					"Fault-Tolerant Execution of Mobile Agents.",
					"Exploiting Non-Determinism for Reliability of Mobile Agent Systems.",
					"A New Rolling Stock Architecture Using Safety Computers and Networks.",
					"Reliability-Availability-Serviceability Characteristics of a Compressed-Memory System.",
					"A Fault Tolerant Signal Processing Computer.",
					"Performability of Algorithms for Connection Admission Control.",
					"On the Quality of Service of Failure Detectors.",
					"Fault-Secure Scheduling of Arbitrary Task Graphs to Multiprocessor Systems.",
					"Diagnosis of Regular Structures.",
					"OFTT: A Fault Tolerance Middleware Toolkit for Process Monitoring and Control Windows NT Applications.",
					"DEEM: A Tool for the Dependability Modeling and Evaluation of Multiple Phased Systems.",
					"Loki: A State-Driven Fault Injector for Distributed Systems.",
					"Sensitivity Analysis for System Design Improvement.",
					"Joint Evaluation of Performance and Robustness of a COTS DBMS through Fault-Injection.",
					"Robustness Testing of the Microsoft Win32 API.",
					"From Crash Fault-Tolerance to Arbitrary-Fault Tolerance: Towards a Modular Approach.",
					"Dynamic Byzantine Quorum Systems.",
					"A Tool Suite for Diagnosis and Testing of Software Design Specifications.",
					"Enabling Automated Analysis through the Formalization of Object-Oriented Modeling Diagrams.",
					"Deadlock Detection of EFSMs Using Simultaneous Reachability Analysis.",
					"A Low Latency, Loss Tolerant Architecture and Protocol for Wide Area Group Communication.",
					"A Reliable Many-to-Many Multicast Protocol for Group Communication over ATM Networks.",
					"A Gossip-Based Reliable Multicast for Large-Scale High-Throughput Applications.",
					"Fault-Tolerant Ethernet for IP-Based Process Control: A Demonstration.",
					"Demonstration of the Remote Exploration and Experimentation (REE) Fault-Tolerant Parallel-Processing Supercomputer for Spacecraft Onboard Scientific Data Processing.",
					"Test-Point Insertion to Enhance Test Compaction for Scan Designs.",
					"Method to Recover Internet Packet Losses Using (n, n - 1, m) Convolutional Codes.",
					"One-Shot Reed-Solomon Decoding for High-Performance Dependable Systems.",
					"A Fault Injection Approach Based on Reflective Programming.",
					"On the Emulation of Software Faults by Software Fault Injection.",
					"Reliability Testing of Applications on Windows NT.",
					"Implementing Flexible Object Group Invocation in Networked Systems.",
					"Implementing e-Transactions with Asynchronous Replication.",
					"Data Replication Strategies for Fault Tolerance and Availability on Commodity Clusters.",
					"Designing High-Performance & Reliable Superscalar Architectures: The out of Order Reliable Superscalar (O3RS) Approach.",
					"Fault Tolerance through Re-Execution in Multiscalar Architecture.",
					"A Fault Tolerance Infrastructure for Dependable Computing with High-Performance COTS Components.",
					"Synthesis of Interconnection Networks: A Novel Approach.",
					"The Best of Both Worlds: A Hybrid Approach to Solve Consensus.",
					"Synchronous System and Perfect Failure Detector: Solvability and Efficiency Issue.",
					"he Timely Computing Base: Timely Actions in the Presence of Uncertain Timeliness.",
					"Reconfiguration Based Failure Restoration in Wavelength-Routed WDM Networks.",
					"Towards Continuous Availability of Internet Services through Availability Domains.",
					"Issues in Interoperability and Performance Verification in a Multi-ORB Telecommunications Environment.",
					"Algorithms for Improving the Dependability of Firewall and Filter Rule Lists.",
					"Dynamic-Distributed Differentiated Service for Multimedia Applications.",
					"Testing for Software Vulnerability Using Environment Perturbation.",
					"Survivability Analysis of Network Specifications.",
					"Benchmarking Anomaly-Based Detection Systems.",
					"Avoiding Loss of Fairness Owing to Process Crashes in Fair Data Exchange Protocols.",
					"A Formal-Specification Based Approach for Protecting the Domain Name System."
				]
			}
		]
	}
]