[
    {
        "year": "2021",
        "name": "26th ESORICS 2021",
        "info": "Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2021-1",
                "sub_name": "Computer Security - ESORICS 2021 - 26th European Symposium on Research in Computer Security, Darmstadt, Germany, October 4-8, 2021, Proceedings, Part I.",
                "count": 36,
                "papers": [
                    "More Efficient Post-quantum KEMTLS with Pre-distributed Public Keys.",
                    "How to (Legally) Keep Secrets from Mobile Operators.",
                    "A Formal Security Analysis of Session Resumption Across Hostnames.",
                    "Caught in the Web: DoS Vulnerabilities in Parsers for Structured Data.",
                    "PoW-How: An Enduring Timing Side-Channel to Evade Online Malware Sandboxes.",
                    "Characterizing GPU Overclocking Faults.",
                    "ARIstoteles - Dissecting Apple's Baseband Interface.",
                    "webFuzz: Grey-Box Fuzzing for Web Applications.",
                    "My Fuzzer Beats Them All! Developing a Framework for Fair Evaluation and Comparison of Fuzzers.",
                    "Rope: Covert Multi-process Malware Execution with Return-Oriented Programming.",
                    "Towards Automating Code-Reuse Attacks Using Synthesized Gadget Chains.",
                    "Peeler: Profiling Kernel-Level Events to Detect Ransomware.",
                    "Mingling of Clear and Muddy Water: Understanding and Detecting Semantic Confusion in Blackhat SEO.",
                    "An Explainable Online Password Strength Estimator.",
                    "Detecting Video-Game Injectors Exchanged in Game Cheating Communities.",
                    "Revocable Policy-Based Chameleon Hash.",
                    "Fair Peer-to-Peer Content Delivery via Blockchain.",
                    "Conclave: A Collective Stake Pool Protocol.",
                    "Probabilistic Micropayments with Transferability.",
                    "MiniLedger: Compact-Sized Anonymous and Auditable Distributed Payments.",
                    "Succinct Scriptable NIZK via Trusted Hardware.",
                    "CONTRA: Defending Against Poisoning Attacks in Federated Learning.",
                    "Romoa: Robust Model Aggregation for the Resistance of Federated Learning to Model Poisoning Attacks.",
                    "FLOD: Oblivious Defender for Private Byzantine-Robust Federated Learning with Dishonest-Majority.",
                    "[inline-graphic not available: see fulltext] : Towards Secure and Lightweight Deep Learning as a Medical Diagnostic Service.",
                    "TAFA: A Task-Agnostic Fingerprinting Algorithm for Neural Networks.",
                    "DA3G: Detecting Adversarial Attacks by Analysing Gradients.",
                    "Common Component in Black-Boxes Is Prone to Attacks.",
                    "LiMNet: Early-Stage Detection of IoT Botnets with Lightweight Memory Networks.",
                    "Adversarial Activity Detection Using Keystroke Acoustics.",
                    "Tell Me How You Re-Charge, I Will Tell You Where You Drove To: Electric Vehicles Profiling Based on Charging-Current Demand.",
                    "CAN-SQUARE - Decimeter Level Localization of Electronic Control Units on CAN Buses.",
                    "Shadow-Catcher: Looking into Shadows to Detect Ghost Objects in Autonomous Vehicle 3D Sensing.",
                    "AutoGuard: A Dual Intelligence Proactive Anomaly Detection at Application-Layer in 5G Networks.",
                    "MORTON: Detection of Malicious Routines in Large-Scale DNS Traffic.",
                    "Iterative Selection of Categorical Variables for Log Data Anomaly Detection."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2021-2",
                "sub_name": "Computer Security - ESORICS 2021 - 26th European Symposium on Research in Computer Security, Darmstadt, Germany, October 4-8, 2021, Proceedings, Part II.",
                "count": 35,
                "papers": [
                    "Bestie: Very Practical Searchable Encryption with Forward and Backward Security.",
                    "Geo-DRS: Geometric Dynamic Range Search on Spatial Data with Backward and Content Privacy.",
                    "Efficient Multi-client Order-Revealing Encryption and Its Applications.",
                    "Versatile and Sustainable Timed-Release Encryption and Sequential Time-Lock Puzzles (Extended Abstract).",
                    "Multipath TLS 1.3.",
                    "SyLPEnIoT: Symmetric Lightweight Predicate Encryption for Data Privacy Applications in IoT Environments.",
                    "Security Analysis of SFrame.",
                    "Attribute-Based Conditional Proxy Re-encryption in the Standard Model Under LWE.",
                    "Lattice-Based HRA-secure Attribute-Based Proxy Re-Encryption in Standard Model.",
                    "Server-Aided Revocable Attribute-Based Encryption Revised: Multi-User Setting and Fully Secure.",
                    "Precomputation for Rainbow Tables has Never Been so Fast.",
                    "Cache-Side-Channel Quantification and Mitigation for Quantum Cryptography.",
                    "Genetic Algorithm Assisted State-Recovery Attack on Round-Reduced Xoodyak.",
                    "Moving the Bar on Computationally Sound Exclusive-Or.",
                    "Optimal Verifiable Data Streaming Protocol with Data Auditing.",
                    "One-More Unforgeability of Blind ECDSA.",
                    "MPC-in-Multi-Heads: A Multi-Prover Zero-Knowledge Proof System - (or: How to Jointly Prove Any NP Statements in ZK).",
                    "Complexity and Performance of Secure Floating-Point Polynomial Evaluation Protocols.",
                    "SERVAS! Secure Enclaves via RISC-V Authenticryption Shield.",
                    "Privacy-Preserving Gradient Descent for Distributed Genome-Wide Analysis.",
                    "Privug: Using Probabilistic Programming for Quantifying Leakage in Privacy Risk Analysis.",
                    "Transparent Electricity Pricing with Privacy.",
                    "CoinJoin in the Wild - An Empirical Analysis in Dash.",
                    "One-Time Traceable Ring Signatures.",
                    "PACE with Mutual Authentication - Towards an Upgraded eID in Europe.",
                    "Secure Random Sampling in Differential Privacy.",
                    "Training Differentially Private Neural Networks with Lottery Tickets.",
                    "Locality Sensitive Hashing with Extended Differential Privacy.",
                    "MLS Group Messaging: How Zero-Knowledge Can Secure Updates.",
                    "More Efficient Amortization of Exact Zero-Knowledge Proofs for LWE.",
                    "Zero Knowledge Contingent Payments for Trained Neural Networks.",
                    "Identity-Based Identity-Concealed Authenticated Key Exchange.",
                    "Privacy-Preserving Authenticated Key Exchange: Stronger Privacy and Generic Constructions.",
                    "Correlated Randomness Teleportation via Semi-trusted Hardware - Enabling Silent Multi-party Computation.",
                    "Polynomial Representation Is Tricky: Maliciously Secure Private Set Intersection Revisited."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2021dpm",
                "sub_name": "Data Privacy Management, Cryptocurrencies and Blockchain Technology - ESORICS 2021 International Workshops, DPM 2021 and CBT 2021, Darmstadt, Germany, October 8, 2021, Revised Selected Papers.",
                "count": 23,
                "papers": [
                    "Best Security Measures to Reduce Cyber-Incident and Data Breach Risks.",
                    "Synthesizing Privacy-Preserving Location Traces Including Co-locations.",
                    "Quantitative Rubric for Privacy Policy Analysis.",
                    "Rethinking the Limits of Mobile Operating System Permissions.",
                    "Interdependent Privacy Issues Are Pervasive Among Third-Party Applications.",
                    "SPGC: An Integrated Framework of Secure Computation and Differential Privacy for Collaborative Learning.",
                    "A k-Anonymised Federated Learning Framework with Decision Trees.",
                    "Anonymizing Machine Learning Models.",
                    "A New Privacy Enhancing Beacon Scheme in V2X Communication.",
                    "Next Generation Data Masking Engine.",
                    "Towards a Formal Approach for Data Minimization in Programs (Short Paper).",
                    "Virtual ASICs: Generalized Proof-of-Stake Mining in Cryptocurrencies.",
                    "Asymmetric Asynchronous Byzantine Consensus.",
                    "Using Degree Centrality to Identify Market Manipulation on Bitcoin.",
                    "Augmenting MetaMask to Support TLS-endorsed Smart Contracts.",
                    "Smart Contracts for Incentivized Outsourcing of Computation.",
                    "Anonymous Sidechains.",
                    "Filling the Tax Gap via Programmable Money.",
                    "Impact of Delay Classes on the Data Structure in IOTA.",
                    "Secure Static Content Delivery for CDN Using Blockchain Technology.",
                    "Lattice-Based Proof-of-Work for Post-Quantum Blockchains.",
                    "Blockchain-Based Two-Factor Authentication for Credit Card Validation.",
                    "Homomorphic Decryption in Blockchains via Compressed Discrete-Log Lookup Tables."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2021cicps",
                "sub_name": "Computer Security. ESORICS 2021 International Workshops - CyberICPS, SECPRE, ADIoT, SPOSE, CPS4CIP, and CDT&SECOMANE, Darmstadt, Germany, October 4-8, 2021, Revised Selected Papers.",
                "count": 32,
                "papers": [
                    "Communication and Cybersecurity Testbed for Autonomous Passenger Ship.",
                    "A Cybersecurity Ontology to Support Risk Information Gathering in Cyber-Physical Systems.",
                    "GLASS: Towards Secure and Decentralized eGovernance Services Using IPFS.",
                    "Integrated Design Framework for Facilitating Systems-Theoretic Process Analysis.",
                    "Attack Path Analysis and Cost-Efficient Selection of Cybersecurity Controls for Complex Cyberphysical Systems.",
                    "Analysis of Cyber Security Features in Industry 4.0 Maturity Models.",
                    "Cybersafety Analysis of a Natural Language User Interface for a Consumer Robotic System.",
                    "Integrating Privacy-By-Design with Business Process Redesign.",
                    "Disclosing Social and Location Attributes on Social Media: The Impact on Users' Privacy.",
                    "BioPrivacy: Development of a Keystroke Dynamics Continuous Authentication System.",
                    "Privacy and Informational Self-determination Through Informed Consent: The Way Forward.",
                    "Building a Privacy Testbed: Use Cases and Design Considerations.",
                    "Assessing Vulnerabilities and IoT-Enabled Attacks on Smart Lighting Systems.",
                    "TAESim: A Testbed for IoT Security Analysis of Trigger-Action Environment.",
                    "Adversarial Command Detection Using Parallel Speech Recognition Systems.",
                    "Security Measuring System for IoT Devices.",
                    "Battery Depletion Attacks on NB-IoT Devices Using Interference.",
                    "Security- and Privacy-Aware IoT Application Placement and User Assignment.",
                    "Room Identification with Personal Voice Assistants (Extended Abstract).",
                    "Why IT Security Needs Therapy.",
                    "Transferring Update Behavior from Smartphones to Smart Consumer Devices.",
                    "Organisational Contexts of Energy Cybersecurity.",
                    "SMILE - Smart eMaIl Link Domain Extractor.",
                    "A Semantic Model for Embracing Privacy as Contextual Integrity in the Internet of Things (Short Paper).",
                    "Data Protection Impact Assessments in Practice - Experiences from Case Studies.",
                    "Resilience Quantification for Critical Infrastructure: Exemplified for Airport Operations.",
                    "Severity Level Assessment from Semantically Fused Video Content Analysis for Physical Threat Detection in Ground Segments of Space Systems.",
                    "Diminisher: A Linux Kernel Based Countermeasure for TAA Vulnerability.",
                    "The Rise of ICS Malware: A Comparative Analysis.",
                    "Framework Proposal to Measure the Stress as Adversarial Factor on Cyber Decision Making.",
                    "Measuring the Impact of Tactical Denial of Sustainability.",
                    "A Mathematical Framework for Evaluation of SOAR Tools with Limited Survey Data."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "25th ESORICS 2020",
        "info": "Guildford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2020-1",
                "sub_name": "Computer Security - ESORICS 2020 - 25th European Symposium on Research in Computer Security, ESORICS 2020, Guildford, UK, September 14-18, 2020, Proceedings, Part I.",
                "count": 36,
                "papers": [
                    "Pine: Enabling Privacy-Preserving Deep Packet Inspection on TLS with Rule-Hiding and Fast Connection Establishment.",
                    "Bulwark: Holistic and Verified Security Monitoring of Web Protocols.",
                    "A Practical Model for Collaborative Databases: Securely Mixing, Searching and Computing.",
                    "Deduplication-Friendly Watermarking for Multimedia Data in Public Clouds.",
                    "DANTE: A Framework for Mining and Monitoring Darknet Traffic.",
                    "Efficient Quantification of Profile Matching Risk in Social Networks Using Belief Propagation.",
                    "Anonymity Preserving Byzantine Vector Consensus.",
                    "CANSentry: Securing CAN-Based Cyber-Physical Systems against Denial and Spoofing Attacks.",
                    "Distributed Detection of APTs: Consensus vs. Clustering.",
                    "Designing Reverse Firewalls for the Real World.",
                    "Follow the Blue Bird: A Study on Threat Data Published on Twitter.",
                    "Dynamic and Secure Memory Transformation in Userspace.",
                    "Understanding the Security Risks of Docker Hub.",
                    "DE-auth of the Blue! Transparent De-authentication Using Bluetooth Low Energy Beacon.",
                    "Similarity of Binaries Across Optimization Levels and Obfuscation.",
                    "HART: Hardware-Assisted Kernel Module Tracing on Arm.",
                    "Zipper Stack: Shadow Stacks Without Shadow.",
                    "Restructured Cloning Vulnerability Detection Based on Function Semantic Reserving and Reiteration Screening.",
                    "LegIoT: Ledgered Trust Management Platform for IoT.",
                    "PrivColl: Practical Privacy-Preserving Collaborative Machine Learning.",
                    "An Efficient 3-Party Framework for Privacy-Preserving Neural Network Inference.",
                    "Deep Learning Side-Channel Analysis on Large-Scale Traces - A Case Study on a Polymorphic AES.",
                    "Towards Poisoning the Neural Collaborative Filtering-Based Recommender Systems.",
                    "Data Poisoning Attacks Against Federated Learning Systems.",
                    "Interpretable Probabilistic Password Strength Meters via Deep Learning.",
                    "Polisma - A Framework for Learning Attribute-Based Access Control Policies.",
                    "A Framework for Evaluating Client Privacy Leakages in Federated Learning.",
                    "An Accountable Access Control Scheme for Hierarchical Content in Named Data Networks with Revocation.",
                    "PGC: Decentralized Confidential Payment System with Auditability.",
                    "Secure Cloud Auditing with Efficient Ownership Transfer.",
                    "Encrypt-to-Self: Securely Outsourcing Storage.",
                    "PGLP: Customizable and Rigorous Location Privacy Through Policy Graph.",
                    "Where Are You Bob? Privacy-Preserving Proximity Testing with a Napping Party.",
                    "Distributed PCFG Password Cracking.",
                    "Your PIN Sounds Good! Augmentation of PIN Guessing Strategies via Audio Leakage.",
                    "GDPR - Challenges for Reconciling Legal Rules with Technical Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2020-2",
                "sub_name": "Computer Security - ESORICS 2020 - 25th European Symposium on Research in Computer Security, ESORICS 2020, Guildford, UK, September 14-18, 2020, Proceedings, Part II.",
                "count": 36,
                "papers": [
                    "Automatic Generation of Sources Lemmas in Tamarin: Towards Automatic Proofs of Security Protocols.",
                    "When Is a Test Not a Proof?",
                    "Hardware Fingerprinting for the ARINC 429 Avionic Bus.",
                    "Semantic Definition of Anonymity in Identity-Based Encryption and Its Relation to Indistinguishability-Based Definition.",
                    "SHECS-PIR: Somewhat Homomorphic Encryption-Based Compact and Scalable Private Information Retrieval.",
                    "Puncturable Encryption: A Generic Construction from Delegatable Fully Key-Homomorphic Encryption.",
                    "Linear Attack on Round-Reduced DES Using Deep Learning.",
                    "Detection by Attack: Detecting Adversarial Samples by Undercover Attack.",
                    "Big Enough to Care Not Enough to Scare! Crawling to Attack Recommender Systems.",
                    "Active Re-identification Attacks on Periodically Released Dynamic Social Graphs.",
                    "Fooling Primality Tests on Smartcards.",
                    "An Optimizing Protocol Transformation for Constructor Finite Variant Theories in Maude-NPA.",
                    "On the Privacy Risks of Compromised Trigger-Action Platforms.",
                    "Plenty of Phish in the Sea: Analyzing Potential Pre-attack Surfaces.",
                    "Towards Post-Quantum Security for Cyber-Physical Systems: Integrating PQC into Industrial M2M Communication.",
                    "CSH: A Post-quantum Secret Handshake Scheme from Coding Theory.",
                    "A Verifiable and Practical Lattice-Based Decryption Mix Net with External Auditing.",
                    "A Lattice-Based Key-Insulated and Privacy-Preserving Signature Scheme with Publicly Derived Public Key.",
                    "Post-Quantum Adaptor Signatures and Payment Channel Networks.",
                    "Linear-Complexity Private Function Evaluation is Practical.",
                    "Certifying Decision Trees Against Evasion Attacks by Program Analysis.",
                    "They Might NOT Be Giants Crafting Black-Box Adversarial Examples Using Particle Swarm Optimization.",
                    "Understanding Object Detection Through an Adversarial Lens.",
                    "Signatures with Tight Multi-user Security from Search Assumptions.",
                    "Biased RSA Private Keys: Origin Attribution of GCD-Factorable Keys.",
                    "MAC-in-the-Box: Verifying a Minimalistic Hardware Design for MAC Computation.",
                    "Evaluating the Effectiveness of Heuristic Worst-Case Noise Analysis in FHE.",
                    "How to Model the Bribery Attack: A Practical Quantification Method in Blockchain.",
                    "Updatable Blockchains.",
                    "PrivacyGuard: Enforcing Private Data Usage Control with Blockchain and Attested Off-Chain Contract Execution.",
                    "Identity-Based Authenticated Encryption with Identity Confidentiality.",
                    "Securing DNSSEC Keys via Threshold ECDSA from Generic MPC.",
                    "On Private Information Retrieval Supporting Range Queries.",
                    "2-hop Blockchain: Combining Proof-of-Work and Proof-of-Stake Securely.",
                    "Generic Superlight Client for Permissionless Blockchains.",
                    "LNBot: A Covert Hybrid Botnet on Bitcoin Lightning Network for Fun and Profit."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2020etaa",
                "sub_name": "Emerging Technologies for Authorization and Authentication - Third International Workshop, ETAA 2020, Guildford, UK, September 18, 2020, Proceedings.",
                "count": 10,
                "papers": [
                    "Deep Learning Based Sequential Mining for User Authentication in Web Applications.",
                    "An Interoperable Architecture for Usable Password-Less Authentication.",
                    "auth.js: Advanced Authentication for the Web.",
                    "Automated and Secure Integration of the OpenID Connect iGov Profile in Mobile Native Applications.",
                    "Micro-Id-Gym: A Flexible Tool for Pentesting Identity Management Protocols in the Wild and in the Laboratory.",
                    "IFTTT Privacy Checker.",
                    "A Comparison Among Policy Editors for Attributed Based Access Control Model.",
                    "Automatic Firewalls' Configuration Using Argumentation Reasoning.",
                    "On Results of Data Aggregation Operations.",
                    "The Cost of Having Been Pwned: A Security Service Provider's Perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2020cicps",
                "sub_name": "Computer Security - ESORICS 2020 International Workshops, CyberICPS, SECPRE, and ADIoT, Guildford, UK, September 14-18, 2020, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "Integrated Analysis of Safety and Security Hazards in Automotive Systems.",
                    "Attack Path Analysis for Cyber Physical Systems.",
                    "Identifying and Analyzing Implicit Interactions in a Wastewater Dechlorination System.",
                    "A Survey of Cryptography-Based Authentication for Smart Grid Communication.",
                    "Cybersecurity Awareness Platform with Virtual Coach and Automated Challenge Assessment.",
                    "IoT Vulnerability Scanning: A State of the Art.",
                    "Learning from Vulnerabilities - Categorising, Understanding and Detecting Weaknesses in Industrial Control Systems.",
                    "Self Adaptive Privacy in Cloud Computing Environments: Identifying the Major Socio-Technical Concepts.",
                    "Definition and Verification of Security Configurations of Cyber-Physical Systems.",
                    "GDPR Compliance: Proposed Guidelines for Cloud-Based Health Organizations.",
                    "Aligning the Concepts of Risk, Security and Privacy Towards the Design of Secure Intelligent Transport Systems.",
                    "Identifying Implicit Vulnerabilities Through Personas as Goal Models.",
                    "Cooperative Speed Estimation of an RF Jammer in Wireless Vehicular Networks.",
                    "Extended Abstract: Towards Physical-Layer Authentication for Backscatter Devices.",
                    "P2Onto: Making Privacy Policies Transparent.",
                    "Extended Abstract - Transformers: Intrusion Detection Data in Disguise."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2020dpm",
                "sub_name": "Data Privacy Management, Cryptocurrencies and Blockchain Technology - ESORICS 2020 International Workshops, DPM 2020 and CBT 2020, Guildford, UK, September 17-18, 2020, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "Fairness-Aware Privacy-Preserving Record Linkage.",
                    "Differentially Private Profiling of Anonymized Customer Purchase Records.",
                    "P-Signature-Based Blocking to Improve the Scalability of Privacy-Preserving Record Linkage.",
                    "Utility Promises of Self-Organising Maps in Privacy Preserving Data Mining.",
                    "Multi-criteria Optimization Using l-diversity and t-closeness for k-anonymization.",
                    "ArchiveSafe: Mass-Leakage-Resistant Storage from Proof-of-Work.",
                    "Joint Obfuscation for Privacy Protection in Location-Based Social Networks.",
                    "Modeling and Analyzing the Corona-Virus Warning App with the Isabelle Infrastructure Framework.",
                    "Extracting Speech from Motion-Sensitive Sensors.",
                    "PDP-ReqLite: A Lightweight Approach for the Elicitation of Privacy and Data Protection Requirements.",
                    "Towards Multiple Pattern Type Privacy Protection in Complex Event Processing Through Event Obfuscation Strategies.",
                    "GPS-Based Behavioral Authentication Utilizing Distance Coherence.",
                    "Short Paper: Integrating the Data Protection Impact Assessment into the Software Development Lifecycle.",
                    "Citizens as Data Donors: Maximizing Participation Through Privacy Assurance and Behavioral Change - (Short Paper).",
                    "Tracking the Invisible: Privacy-Preserving Contact Tracing to Control the Spread of a Virus.",
                    "Privacy Policy Classification with XLNet (Short Paper).",
                    "Every Query Counts: Analyzing the Privacy Loss of Exploratory Data Analyses.",
                    "TxChain: Efficient Cryptocurrency Light Clients via Contingent Transaction Aggregation.",
                    "VRF-Based Mining Simple Non-outsourceable Cryptocurrency Mining.",
                    "On the Selection of the LN Client Implementation Parameters.",
                    "Privacy Preserving Netting Protocol for Inter-bank Payments.",
                    "Triptych: Logarithmic-Sized Linkable Ring Signatures with Applications.",
                    "Moderated Redactable Blockchains: A Definitional Framework with an Efficient Construct.",
                    "Radium: Improving Dynamic PoW Targeting.",
                    "Proof of No-Work: How to Incentivize Individuals to Stay at Home.",
                    "Fundamental Properties of the Layer Below a Payment Channel Network.",
                    "Zerojoin: Combining Zerocoin and CoinJoin.",
                    "Who Let theDOGSOut: Anonymous but Auditable Communications Using Group Signature Schemes with Distributed Opening.",
                    "Tracking Mixed Bitcoins."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2020detips",
                "sub_name": "Computer Security - ESORICS 2020 International Workshops, DETIPS, DeSECSys, MPS, and SPOSE, Guildford, UK, September 17-18, 2020, Revised Selected Papers.",
                "count": 19,
                "papers": [
                    "IMC: A Classification of Identity Management Approaches.",
                    "Keeping it Human: A Focus Group Study of Public Attitudes Towards AI in Banking.",
                    "Creative Toolkits for TIPS.",
                    "Post-quantum Certificates for Electronic Travel Documents.",
                    "Development of Trust Infrastructures for Virtual Asset Service Providers.",
                    "Risk Assessment of Sharing Cyber Threat Intelligence.",
                    "kUBI: A Framework for Privacy and Transparency in Sensor-Based Business Models for Consumers: A Pay-How-You-Drive Example.",
                    "Verifiable Contracting - A Use Case for Onboarding and Contract Offering in Financial Services with eIDAS and Verifiable Credentials.",
                    "ICITPM: Integrity Validation of Software in Iterative Continuous Integration Through the Use of Trusted Platform Module (TPM).",
                    "Making Picnic Feasible for Embedded Devices.",
                    "Sandboxing the Cyberspace for Cybersecurity Education and Learning.",
                    "CloudVaults: Integrating Trust Extensions into System Integrity Verification for Cloud-Based Environments.",
                    "Twizzle - A Multi-purpose Benchmarking Framework for Semantic Comparisons of Multimedia Object Pairs.",
                    "You've Got Nothing on Me! Privacy Friendly Face Recognition Reloaded.",
                    "OR-Benchmark: An Open and Reconfigurable Digital Watermarking Benchmarking Framework.",
                    "Nothing Standard About It: An Analysis of Minimum Security Standards in Organizations.",
                    "The Bigger Picture: Approaches to Inter-organizational Data Protection Impact Assessment.",
                    "Systematic Scenario Creation for Serious Security-Awareness Games.",
                    "Analysing Simulated Phishing Campaigns for Staff."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th ESORICS 2019",
        "info": "Luxembourg",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2019-1",
                "sub_name": "Computer Security - ESORICS 2019 - 24th European Symposium on Research in Computer Security, Luxembourg, September 23-27, 2019, Proceedings, Part I.",
                "count": 38,
                "papers": [
                    "Privacy-Enhanced Machine Learning with Functional Encryption.",
                    "Towards Secure and Efficient Outsourcing of Machine Learning Classification.",
                    "Confidential Boosting with Random Linear Classifiers for Outsourced User-Generated Data.",
                    "BDPL: A Boundary Differentially Private Layer Against Machine Learning Model Extraction Attacks.",
                    "The Leakage-Resilience Dilemma.",
                    "A Taxonomy of Attacks Using BGP Blackholing.",
                    "Local Obfuscation Mechanisms for Hiding Probability Distributions.",
                    "A First Look into Privacy Leakage in 3D Mixed Reality Data.",
                    "Flexible Signatures: Making Authentication Suitable for Real-Time Environments.",
                    "DGM: A Dynamic and Revocable Group Merkle Signature.",
                    "Puncturable Proxy Re-Encryption Supporting to Group Messaging Service.",
                    "Generic Traceable Proxy Re-encryption and Accountable Extension in Consensus Network.",
                    "Side-Channel Aware Fuzzing.",
                    "NetSpectre: Read Arbitrary Memory over Network.",
                    "maskVerif: Automated Verification of Higher-Order Masking in Presence of Physical Defaults.",
                    "Automated Formal Analysis of Side-Channel Attacks on Probabilistic Systems.",
                    "A Formal Model for Checking Cryptographic API Usage in JavaScript.",
                    "Contingent Payments on a Public Ledger: Models and Reductions for Automated Verification.",
                    "Symbolic Analysis of Terrorist Fraud Resistance.",
                    "Secure Communication Channel Establishment: TLS 1.3 (over TCP Fast Open) vs. QUIC.",
                    "Where to Look for What You See Is What You Sign? User Confusion in Transaction Security.",
                    "On the Security and Applicability of Fragile Camera Fingerprints.",
                    "Attacking Speaker Recognition Systems with Phoneme Morphing.",
                    "Practical Bayesian Poisoning Attacks on Challenge-Based Collaborative Intrusion Detection Networks.",
                    "A Framework for Evaluating Security in the Presence of Signal Injection Attacks.",
                    "Formalizing and Proving Privacy Properties of Voting Protocols Using Alpha-Beta Privacy.",
                    "ProCSA: Protecting Privacy in Crowdsourced Spectrum Allocation.",
                    "Breaking Unlinkability of the ICAO 9303 Standard for e-Passports Using Bisimilarity.",
                    "Symmetric-Key Corruption Detection: When XOR-MACs Meet Combinatorial Group Testing.",
                    "Finding Flaws from Password Authentication Code in Android Apps.",
                    "Identifying Privilege Separation Vulnerabilities in IoT Firmware with Symbolic Execution.",
                    "iCAT: An Interactive Customizable Anonymization Tool.",
                    "Monitoring the GDPR.",
                    "Incentives for Harvesting Attack in Proof of Work Mining Pools.",
                    "A Lattice-Based Linkable Ring Signature Supporting Stealth Addresses.",
                    "Annotary: A Concolic Execution System for Developing Secure Smart Contracts.",
                    "PDFS: Practical Data Feed Service for Smart Contracts.",
                    "Towards a Marketplace for Secure Outsourced Computations."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2019-2",
                "sub_name": "Computer Security - ESORICS 2019 - 24th European Symposium on Research in Computer Security, Luxembourg, September 23-27, 2019, Proceedings, Part II.",
                "count": 29,
                "papers": [
                    "Automatically Identifying Security Checks for Detecting Kernel Semantic Bugs.",
                    "Uncovering Information Flow Policy Violations in C Programs (Extended Abstract).",
                    "BinEye: Towards Efficient Binary Authorship Characterization Using Deep Learning.",
                    "Static Detection of Uninitialized Stack Variables in Binary Code.",
                    "Towards Automated Application-Specific Software Stacks.",
                    "Identity-Based Encryption with Security Against the KGC: A Formal Model and Its Instantiation from Lattices.",
                    "Forward-Secure Puncturable Identity-Based Encryption for Securing Cloud Emails.",
                    "Feistel Structures for MPC, and More.",
                    "Arithmetic Garbling from Bilinear Maps.",
                    "SEPD: An Access Control Model for Resource Sharing in an IoT Environment.",
                    "Nighthawk: Transparent System Introspection from Ring -3.",
                    "Proactivizer: Transforming Existing Verification Tools into Efficient Solutions for Runtime Security Enforcement.",
                    "Enhancing Security and Dependability of Industrial Networks with Opinion Dynamics.",
                    "Dynamic Searchable Symmetric Encryption with Forward and Stronger Backward Privacy.",
                    "Towards Efficient Verifiable Forward Secure Searchable Symmetric Encryption.",
                    "Generic Multi-keyword Ranked Search on Encrypted Cloud Data.",
                    "An Efficiently Searchable Encrypted Data Structure for Range Queries.",
                    "GDPiRated - Stealing Personal Information On- and Offline.",
                    "Location Privacy-Preserving Mobile Crowd Sensing with Anonymous Reputation.",
                    "OCRAM-Assisted Sensitive Data Protection on ARM-Based Platform.",
                    "Privacy-Preserving Collaborative Medical Time Series Analysis Based on Dynamic Time Warping.",
                    "IoT-Friendly AKE: Forward Secrecy and Session Resumption Meet Symmetric-Key Cryptography.",
                    "Strongly Secure Identity-Based Key Exchange with Single Pairing Operation.",
                    "A Complete and Optimized Key Mismatch Attack on NIST Candidate NewHope.",
                    "Breakdown Resilience of Key Exchange Protocols: NewHope, TLS 1.3, and Hybrids.",
                    "The Risks of WebGL: Analysis, Evaluation and Detection.",
                    "Mime Artist: Bypassing Whitelisting for the Web with JavaScript Mimicry Attacks.",
                    "Fingerprint Surface-Based Detection of Web Bot Detectors.",
                    "Testing for Integrity Flaws in Web Sessions."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2019dpm",
                "sub_name": "Data Privacy Management, Cryptocurrencies and Blockchain Technology - ESORICS 2019 International Workshops, DPM 2019 and CBT 2019, Luxembourg, September 26-27, 2019, Proceedings.",
                "count": 25,
                "papers": [
                    "PINFER: Privacy-Preserving Inference - Logistic Regression, Support Vector Machines, and More, over Encrypted Data.",
                    "Integral Privacy Compliant Statistics Computation.",
                    "Towards Data Anonymization in Data Mining via Meta-heuristic Approaches.",
                    "Skiplist Timing Attack Vulnerability.",
                    "A Study on Subject Data Access in Online Advertising After the GDPR.",
                    "On Privacy Risks of Public WiFi Captive Portals.",
                    "User Perceptions of Security and Usability of Mobile-Based Single Password Authentication and Two-Factor Authentication.",
                    "Graph Perturbation as Noise Graph Addition: A New Perspective for Graph Anonymization.",
                    "Towards Minimising Timestamp Usage In Application Software - A Case Study of the Mattermost Application.",
                    "Card-Based Cryptographic Protocols with the Minimum Number of Rounds Using Private Operations.",
                    "TEE-Based Distributed Watchtowers for Fraud Protection in the Lightning Network.",
                    "Payment Networks as Creation Games.",
                    "An Efficient Micropayment Channel on Ethereum.",
                    "Extending Atomic Cross-Chain Swaps.",
                    "A Minimal Core Calculus for Solidity Contracts.",
                    "Multi-stage Contracts in the UTXO Model.",
                    "The Operational Cost of Ethereum Airdrops.",
                    "Blockchain Driven Platform for Energy Distribution in a Microgrid.",
                    "Practical Mutation Testing for Smart Contracts.",
                    "Online Payment Network Design.",
                    "A Multi-protocol Payment System to Facilitate Financial Inclusion.",
                    "Simulation Extractability in Groth's zk-SNARK.",
                    "Auditable Credential Anonymity Revocation Based on Privacy-Preserving Smart Contracts.",
                    "Bonded Mining: Difficulty Adjustment by Miner Commitment.",
                    "12 Angry Miners."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2019etaa",
                "sub_name": "Emerging Technologies for Authorization and Authentication - Second International Workshop, ETAA 2019, Luxembourg City, Luxembourg, September 27, 2019, Proceedings.",
                "count": 11,
                "papers": [
                    "Logics to Reason Formally About Trust Computation and Manipulation.",
                    "An Authorization Framework for Cooperative Intelligent Transport Systems.",
                    "A Framework for the Validation of Access Control Systems.",
                    "The Structure and Agency Policy Language (SAPL) for Attribute Stream-Based Access Control (ASBAC).",
                    "NoCry: No More Secure Encryption Keys for Cryptographic Ransomware.",
                    "Security Requirements for Store-on-Client and Verify-on-Server Secure Biometric Authentication.",
                    "Reflexive Memory Authenticator: A Proposal for Effortless Renewable Biometrics.",
                    "Collaborative Authentication Using Threshold Cryptography.",
                    "MuFASA: A Tool for High-level Specification and Analysis of Multi-factor Authentication Protocols.",
                    "A Risk-Driven Model to Minimize the Effects of Human Factors on Smart Devices.",
                    "A Formal Security Analysis of the p=uiv p Authentication Protocol for Decentralized Key Distribution and End-to-End Encrypted Email."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2019iosec",
                "sub_name": "Computer Security - ESORICS 2019 International Workshops, IOSec, MSTEC, and FINSEC, Luxembourg City, Luxembourg, September 26-27, 2019, Revised Selected Papers.",
                "count": 18,
                "papers": [
                    "A Comprehensive Technical Survey of Contemporary Cybersecurity Products and Solutions.",
                    "CyberSure: A Framework for Liability Based Trust.",
                    "Deploying Fog-to-Cloud Towards a Security Architecture for Critical Infrastructure Scenarios.",
                    "Event-Based Remote Attacks in HTML5-Based Mobile Apps.",
                    "Horizontal Attacks Against ECC: From Simulations to ASIC.",
                    "Web Servers Protection Using Anomaly Detection for HTTP Requests.",
                    "You Shall Not Register! Detecting Privacy Leaks Across Registration Forms.",
                    "A Model Driven Approach for Cyber Security Scenarios Deployment.",
                    "Difficult XSS Code Patterns for Static Code Analysis Tools.",
                    "An Open and Flexible CyberSecurity Training Laboratory in IT/OT Infrastructures.",
                    "PROTECT - An Easy Configurable Serious Game to Train Employees Against Social Engineering Attacks.",
                    "Model-Driven Cyber Range Training: A Cyber Security Assurance Perspective.",
                    "Towards the Insurance of Healthcare Systems.",
                    "The THREAT-ARREST Cyber-Security Training Platform.",
                    "dAPTaset: A Comprehensive Mapping of APT-Related Data.",
                    "Blockchain Based Sharing of Security Information for Critical Infrastructures of the Finance Sector.",
                    "Bunkers: Jail Application Level Firewall for the Mitigation and Identification of Service Takeover Attacks on HardenedBSD.",
                    "A Language-Based Approach to Prevent DDoS Attacks in Distributed Financial Agent Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2019cicps",
                "sub_name": "Computer Security - ESORICS 2019 International Workshops, CyberICPS, SECPRE, SPOSE, and ADIoT, Luxembourg City, Luxembourg, September 26-27, 2019 Revised Selected Papers.",
                "count": 27,
                "papers": [
                    "Anomaly Detection for Industrial Control Systems Using Sequence-to-Sequence Neural Networks.",
                    "Reflective Attenuation of Cyber-Physical Attacks.",
                    "Distributed UCON in CoAP and MQTT Protocols.",
                    "Towards the Creation of a Threat Intelligence Framework for Maritime Infrastructures.",
                    "Connect and Protect: Requirements for Maritime Autonomous Surface Ship in Urban Passenger Transportation.",
                    "Simulation-Based Evaluation of DDoS Against Smart Grid SCADAs.",
                    "Identifying Safety and Human Factors Issues in Rail Using IRIS and CAIRIS.",
                    "How Not to Use a Privacy-Preserving Computation Platform: Case Study of a Voting Application.",
                    "A Proposed Privacy Impact Assessment Method Using Metrics Based on Organizational Characteristics.",
                    "A Conceptual Redesign of a Modelling Language for Cyber Resiliency of Healthcare Systems.",
                    "Shaping Digital Identities in Social Networks: Data Elements and the Role of Privacy Concerns.",
                    "GDPR Compliance: Proposed Technical and Organizational Measures for Cloud Providers.",
                    "On the Applicability of Security and Privacy Threat Modeling for Blockchain Applications.",
                    "Privacy, Security, Legal and Technology Acceptance Requirements for a GDPR Compliance Platform.",
                    "Uncertainty-Aware Authentication Model for IoT.",
                    "From ISO/IEC 27002: 2013 Information Security Controls to Personal Data Protection Controls: Guidelines for GDPR Compliance.",
                    "On the Trade-Off Between Privacy and Utility in Mobile Services: A Qualitative Study.",
                    "Analysis of Automation Potentials in Privacy Impact Assessment Processes.",
                    "An Insight into Decisive Factors in Cloud Provider Selection with a Focus on Security.",
                    "Discrete Event Simulation of Jail Operations in Pursuit of Organizational Culture Change.",
                    "A Basic Theory of Lightweight Hierarchical Key Predistribution Scheme.",
                    "Adversarial Examples for Hardware-Trojan Detection at Gate-Level Netlists.",
                    "Selective Forwarding Attack on IoT Home Security Kits.",
                    "Denial-of-Service Attacks and Countermeasures in the RPL-Based Internet of Things.",
                    "Study of DNS Rebinding Attacks on Smart Home Devices.",
                    "Anomaly Detection in the HVAC System Operation by a RadViz Based Visualization-Driven Approach.",
                    "Secure Location Verification: Why You Want Your Verifiers to Be Mobile."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd ESORICS 2018",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2018-1",
                "sub_name": "Computer Security - 23rd European Symposium on Research in Computer Security, ESORICS 2018, Barcelona, Spain, September 3-7, 2018, Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "CastSan: Efficient Detection of Polymorphic C++ Object Type Confusions with LLVM.",
                    "On Leveraging Coding Habits for Effective Binary Authorship Attribution.",
                    "Synthesis of a Permissive Security Monitor.",
                    "MobileFindr: Function Similarity Identification for Reversing Mobile Binaries.",
                    "Strain: A Secure Auction for Blockchains.",
                    "Channels: Horizontal Scaling and Confidentiality on Permissioned Blockchains.",
                    "Stay On-Topic: Generating Context-Specific Fake Restaurant Reviews.",
                    "Efficient Proof Composition for Verifiable Computation.",
                    "Navigating the Samsung TrustZone and Cache-Attacks on the Keymaster Trustlet.",
                    "Combination of Hardware and Software: An Efficient AES Implementation Resistant to Side-Channel Attacks on All Programmable SoC.",
                    "How Secure Is Green IT? The Case of Software-Based Energy Side Channels.",
                    "Phishing Attacks Modifications and Evolutions.",
                    "SILK-TV: Secret Information Leakage from Keystroke Timing Videos.",
                    "A Formal Approach to Analyzing Cyber-Forensics Evidence.",
                    "Beneath the Bonnet: A Breakdown of Diagnostic Security.",
                    "Extending Automated Protocol State Learning for the 802.11 4-Way Handshake.",
                    "Automatic Detection of Various Malicious Traffic Using Side Channel Features on TCP Packets.",
                    "PwIN - Pwning Intel piN: Why DBI is Unsuitable for Security Applications.",
                    "POR for Security Protocol Equivalences - Beyond Action-Determinism.",
                    "Automated Identification of Desynchronisation Attacks on Shared Secrets.",
                    "Stateful Protocol Composition.",
                    "Towards Understanding Privacy Implications of Adware and Potentially Unwanted Programs.",
                    "Anonymous Single-Sign-On for n Designated Services with Traceability.",
                    "Efficiently Deciding Equivalence for Standard Primitives and Phases.",
                    "DigesTor: Comparing Passive Traffic Analysis Attacks on Tor.",
                    "Deriving a Cost-Effective Digital Twin of an ICS to Facilitate Security Evaluation.",
                    "Tracking Advanced Persistent Threats in Critical Infrastructures Through Opinion Dynamics.",
                    "Hide Your Hackable Smart Home from Remote Attacks: The Multipath Onion IoT Gateways.",
                    "SCIoT: A Secure and sCalable End-to-End Management Framework for IoT Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018-2",
                "sub_name": "Computer Security - 23rd European Symposium on Research in Computer Security, ESORICS 2018, Barcelona, Spain, September 3-7, 2018, Proceedings, Part II.",
                "count": 27,
                "papers": [
                    "Workflow-Aware Security of Integrated Mobility Services.",
                    "Emulation-Instrumented Fuzz Testing of 4G/LTE Android Mobile Devices Guided by Reinforcement Learning.",
                    "PIAnalyzer: A Precise Approach for PendingIntent Vulnerability Analysis.",
                    "Investigating Fingerprinters and Fingerprinting-Alike Behaviour of Android Applications.",
                    "Towards Efficient Verifiable Conjunctive Keyword Search for Large Encrypted Database.",
                    "Order-Revealing Encryption: File-Injection Attack and Forward Security.",
                    "SEISMIC: SEcure In-lined Script Monitors for Interrupting Cryptojacks.",
                    "Detecting and Characterizing Web Bot Traffic in a Large E-commerce Marketplace.",
                    "Dissemination of Authenticated Tree-Structured Data with Privacy Protection and Fine-Grained Control in Outsourced Databases.",
                    "Efficient and Secure Outsourcing of Differentially Private Data Publication.",
                    "Symmetric Searchable Encryption with Sharing and Unsharing.",
                    "Dynamic Searchable Symmetric Encryption Schemes Supporting Range Queries with Forward (and Backward) Security.",
                    "Breaking Message Integrity of an End-to-End Encryption Scheme of LINE.",
                    "Scalable Wildcarded Identity-Based Encryption.",
                    "Logarithmic-Size Ring Signatures with Tight Security from the DDH Assumption.",
                    "RiffleScrambler - A Memory-Hard Password Storing Function.",
                    "Practical Strategy-Resistant Privacy-Preserving Elections.",
                    "Formal Analysis of Vote Privacy Using Computationally Complete Symbolic Attacker.",
                    "Location Proximity Attacks Against Mobile Targets: Analytical Bounds and Attacker Strategies.",
                    "Constant-Round Client-Aided Secure Comparison Protocol.",
                    "Towards Practical RAM Based Secure Computation.",
                    "Improved Signature Schemes for Secure Multi-party Computation with Certified Inputs.",
                    "Stealthy Probing-Based Verification (SPV): An Active Approach to Defending Software Defined Networks Against Topology Poisoning Attacks.",
                    "Trust Anchors in Software Defined Networks.",
                    "Concessive Online/Offline Attribute Based Encryption with Cryptographic Reverse Firewalls - Secure and Efficient Fine-Grained Access Control on Corrupted Machines.",
                    "Making Any Attribute-Based Encryption Accountable, Efficiently.",
                    "Decentralized Policy-Hiding ABE with Receiver Privacy."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018dpm",
                "sub_name": "Data Privacy Management, Cryptocurrencies and Blockchain Technology - ESORICS 2018 International Workshops, DPM 2018 and CBT 2018, Barcelona, Spain, September 6-7, 2018, Proceedings.",
                "count": 31,
                "papers": [
                    "Succinctly Verifiable Sealed-Bid Auction Smart Contract.",
                    "Blockchain-Based Fair Certified Notifications.",
                    "On Symbolic Verification of Bitcoin's script Language.",
                    "Self-reproducing Coins as Universal Turing Machine.",
                    "Split Payments in Payment Networks.",
                    "Payment Network Design with Fees.",
                    "Atomic Information Disclosure of Off-Chained Computations Using Threshold Encryption.",
                    "Contour: A Practical System for Binary Transparency.",
                    "What Blockchain Alternative Do You Need?",
                    "Valuable Puzzles for Proofs-of-Work.",
                    "A Poisoning Attack Against Cryptocurrency Mining Pools.",
                    "Using Economic Risk to Model Miner Hash Rate Allocation in Cryptocurrencies.",
                    "Avoiding Deadlocks in Payment Channel Networks.",
                    "Coloured Ring Confidential Transactions.",
                    "Pitchforks in Cryptocurrencies: - Enforcing Rule Changes Through Offensive Forking- and Consensus Techniques (Short Paper).",
                    "Towards an Effective Privacy Impact and Risk Assessment Methodology: Risk Analysis.",
                    "Privacy Risk Assessment: From Art to Science, by Metrics.",
                    "Bootstrapping Online Trust: Timeline Activity Proofs.",
                    "Post-processing Methods for High Quality Privacy-Preserving Record Linkage.",
                    "\\delta -DOCA: Achieving Privacy in Data Streams.",
                    "Data Oblivious Genome Variants Search on Intel SGX.",
                    "Developing GDPR Compliant Apps for the Edge.",
                    "YaPPL - A Lightweight Privacy Preference Language for Legally Sufficient and Automated Consent Provision in IoT Scenarios.",
                    "PrivacyGuard: Enforcing Private Data Usage with Blockchain and Attested Execution.",
                    "A Performance and Resource Consumption Assessment of Secret Sharing Based Secure Multiparty Computation.",
                    "Privacy-Preserving Trade Chain Detection.",
                    "FHE-Compatible Batch Normalization for Privacy Preserving Deep Learning.",
                    "A General Algorithm for k-anonymity on Dynamic Databases.",
                    "On Security of Anonymous Invitation-Based System.",
                    "Probabilistic Metric Spaces for Privacy by Design Machine Learning Algorithms: Modeling Database Changes.",
                    "Lifelogging Protection Scheme for Internet-Based Personal Assistants."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018etaa",
                "sub_name": "Emerging Technologies for Authorization and Authentication - First International Workshop, ETAA@ESORICS 2018, Barcelona, Spain, September 7, 2018, Proceedings.",
                "count": 10,
                "papers": [
                    "Authentication and Authorization for Interoperable IoT Architectures.",
                    "Bringing Access Control Tree to Big Data.",
                    "SnapAuth: A Gesture-Based Unobtrusive Smartwatch User Authentication Scheme.",
                    "A Protocol to Strengthen Password-Based Authentication.",
                    "Managing Private Credentials by Privacy-Preserving Biometrics.",
                    "Policy Support for Autonomous Swarms of Drones.",
                    "A Logic-Based Reasoner for Discovering Authentication Vulnerabilities Between Interconnected Accounts.",
                    "Towards a Framework for Testing the Security of IoT Devices Consistently.",
                    "Misuse Detection in a Simulated IaaS Environment.",
                    "Dissuading Stolen Password Reuse."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018cicps",
                "sub_name": "Computer Security - ESORICS 2018 International Workshops, CyberICPS 2018 and SECPRE 2018, Barcelona, Spain, September 6-7, 2018, Revised Selected Papers.",
                "count": 13,
                "papers": [
                    "Improving SIEM for Critical SCADA Water Infrastructures Using Machine Learning.",
                    "Cyber-Attacks Against the Autonomous Ship.",
                    "EPIC: An Electric Power Testbed for Research and Training in Cyber Physical Systems Security.",
                    "A Hardware Based Solution for Freshness of Secure Onboard Communication in Vehicles.",
                    "Enhancing Usage Control for Performance: An Architecture for Systems of Systems.",
                    "Comparative Study of Machine Learning Methods for In-Vehicle Intrusion Detection.",
                    "SDN-Enabled Virtual Data Diode.",
                    "Realistic Data Generation for Anomaly Detection in Industrial Settings Using Simulations.",
                    "Sealed Computation: Abstract Requirements for Mechanisms to Support Trustworthy Cloud Computing.",
                    "Understanding Challenges to Adoption of the Protection Poker Software Security Game.",
                    "An Experimental Evaluation of Bow-Tie Analysis for Cybersecurity Requirements.",
                    "Towards General Scheme for Data Sharing Agreements Empowering Privacy-Preserving Data Analysis of Structured CTI.",
                    "Run-Time Monitoring of Data-Handling Violations."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018issa",
                "sub_name": "Security and Safety Interplay of Intelligent Software Systems - ESORICS 2018 International Workshops, ISSA/CSITS@ESORICS 2018, Barcelona, Spain, September 6-7, 2018, Revised Selected Papers.",
                "count": 11,
                "papers": [
                    "Towards Safety and Security Co-engineering - Challenging Aspects for a Consistent Intertwining.",
                    "Understanding Common Automotive Security Issues and Their Implications.",
                    "SysML Model Transformation for Safety and Security Analysis.",
                    "The Challenge of Safety Tactics Synchronization for Cooperative Systems.",
                    "SAM: A Security Abstraction Model for Automotive Software Systems.",
                    "CAN-FD-Sec: Improving Security of CAN-FD Protocol.",
                    "INCANTA - INtrusion Detection in Controller Area Networks with Time-Covert Authentication.",
                    "Detection of Injection Attacks in Compressed CAN Traffic Logs.",
                    "Key is in the Air: Hacking Remote Keyless Entry Systems.",
                    "Surveying Aviation Professionals on the Security of the Air Traffic Control System.",
                    "On the Security of MIL-STD-1553 Communication Bus."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2018padg",
                "sub_name": "Policy-Based Autonomic Data Governance [extended papers from the Second International Workshop on Policy-based Autonomic Data Governance, PADG@ESORICS 2018, September 6, 2018, Barcelona, Spain].",
                "count": 11,
                "papers": [
                    "AGENP: An ASGrammar-based GENerative Policy Framework.",
                    "Value of Information: Quantification and Application to Coalition Machine Learning.",
                    "Self-Generating Policies for Machine Learning in Coalition Environments.",
                    "Can N-Version Decision-Making Prevent the Rebirth of HAL 9000 in Military Camo? Using a \"Golden Rule\" Threshold to Prevent AI Mission Individuation.",
                    "Simulating User Activity for Assessing Effect of Sampling on DB Activity Monitoring Anomaly Detection.",
                    "FADa-CPS - Faults and Attacks Discrimination in Cyber Physical Systems.",
                    "Techniques and Systems for Anomaly Detection in Database Systems.",
                    "Towards Enabling Trusted Artificial Intelligence via Blockchain.",
                    "Secure Model Fusion for Distributed Learning Using Partial Homomorphic Encryption.",
                    "Policy-Based Identification of IoT Devices' Vendor and Type by DNS Traffic Analysis.",
                    "Redundancy as a Measure of Fault-Tolerance for the Internet of Things: A Review."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22nd ESORICS 2017",
        "info": "Oslo, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2017-1",
                "sub_name": "Computer Security - ESORICS 2017 - 22nd European Symposium on Research in Computer Security, Oslo, Norway, September 11-15, 2017, Proceedings, Part I.",
                "count": 27,
                "papers": [
                    "From Intrusion Detection to Software Design.",
                    "Justifying Security Measures - a Position Paper.",
                    "The Once and Future Onion.",
                    "Tightly Secure Ring-LWE Based Key Encapsulation with Short Ciphertexts.",
                    "Tree-Based Cryptographic Access Control.",
                    "Source Code Authorship Attribution Using Long Short-Term Memory Based Networks.",
                    "Is My Attack Tree Correct?",
                    "Server-Aided Secure Computation with Off-line Parties.",
                    "We Are Family: Relating Information-Flow Trackers.",
                    "Labeled Homomorphic Encryption - Scalable and Privacy-Preserving Processing of Outsourced Data.",
                    "MTD CBITS: Moving Target Defense for Cloud-Based IT Systems.",
                    "Modular Verification of Protocol Equivalence in the Presence of Randomness.",
                    "Non-interactive Provably Secure Attestations for Arbitrary RSA Prime Generation Algorithms.",
                    "Reusing Nonces in Schnorr Signatures - (and Keeping It Secure...).",
                    "WebPol: Fine-Grained Information Flow Policies for Web Browsers.",
                    "Verifying Constant-Time Implementations by Abstract Interpretation.",
                    "Mirage: Toward a Stealthier and Modular Malware Analysis Sandbox for Android.",
                    "Zero Round-Trip Time for the Extended Access Control Protocol.",
                    "Server-Supported RSA Signatures for Mobile Devices.",
                    "Verifiable Document Redacting.",
                    "Securing Data Analytics on SGX with Randomization.",
                    "DeltaPhish: Detecting Phishing Webpages in Compromised Websites.",
                    "Secure Authentication in the Grid: A Formal Analysis of DNP3: SAv5.",
                    "Per-Session Security: Password-Based Cryptography Revisited.",
                    "AVR Processors as a Platform for Language-Based Security.",
                    "A Better Composition Operator for Quantitative Information Flow Analyses.",
                    "Analyzing the Capabilities of the CAN Attacker."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2017-2",
                "sub_name": "Computer Security - ESORICS 2017 - 22nd European Symposium on Research in Computer Security, Oslo, Norway, September 11-15, 2017, Proceedings, Part II.",
                "count": 30,
                "papers": [
                    "Automated Analysis of Equivalence Properties for Security Protocols Using Else Branches.",
                    "Quantifying Web Adblocker Privacy.",
                    "More Efficient Structure-Preserving Signatures - Or: Bypassing the Type-III Lower Bounds.",
                    "Adversarial Examples for Malware Detection.",
                    "PerfWeb: How to Violate Web Privacy with Hardware Performance Events.",
                    "Acoustic Data Exfiltration from Speakerless Air-Gapped Computers via Covert Hard-Drive Noise ('DiskFiltration').",
                    "DOMPurify: Client-Side Protection Against XSS and Markup Injection.",
                    "Preventing DNS Amplification Attacks Using the History of DNS Queries with SDN.",
                    "A Traceability Analysis of Monero's Blockchain.",
                    "Multi-rate Threshold FlipThem.",
                    "Practical Keystroke Timing Attacks in Sandboxed JavaScript.",
                    "On-Demand Time Blurring to Support Side-Channel Defense.",
                    "VuRLE: Automatic Vulnerability Detection and Repair by Learning from Examples.",
                    "Link-Layer Device Type Classification on Encrypted Wireless Traffic with COTS Radios.",
                    "LeaPS: Learning-Based Proactive Security Auditing for Clouds.",
                    "Identifying Multiple Authors in a Binary Program.",
                    "Secure IDS Offloading with Nested Virtualization and Deep VM Introspection.",
                    "Privacy Implications of Room Climate Data.",
                    "Network Intrusion Detection Based on Semi-supervised Variational Auto-Encoder.",
                    "No Sugar but All the Taste! Memory Encryption Without Architectural Support.",
                    "Inference-Proof Updating of a Weakened View Under the Modification of Input Parameters.",
                    "Preventing Advanced Persistent Threats in Complex Control Networks.",
                    "Shortfall-Based Optimal Placement of Security Resources for Mobile IoT Scenarios.",
                    "Boot Attestation: Secure Remote Reporting with Off-The-Shelf IoT Sensors.",
                    "RingCT 2.0: A Compact Accumulator-Based (Linkable Ring Signature) Protocol for Blockchain Cryptocurrency Monero.",
                    "SePCAR: A Secure and Privacy-Enhancing Protocol for Car Access Provision.",
                    "Privacy-Preserving Decision Trees Evaluation via Linear Functions.",
                    "Stringer: Measuring the Importance of Static Data Comparisons to Detect Backdoors and Undocumented Functionality.",
                    "Generic Constructions for Fully Secure Revocable Attribute-Based Encryption.",
                    "Enforcing Input Correctness via Certification in Garbled Circuit Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2017dpm",
                "sub_name": "Data Privacy Management, Cryptocurrencies and Blockchain Technology - ESORICS 2017 International Workshops, DPM 2017 and CBT 2017, Oslo, Norway, September 14-15, 2017, Proceedings.",
                "count": 26,
                "papers": [
                    "A Proof Calculus for Attack Trees in Isabelle.",
                    "Confidentiality of Interactions in Concurrent Object-Oriented Systems.",
                    "Using Oblivious RAM in Genomic Studies.",
                    "Towards Efficient and Secure Encrypted Databases: Extending Message-Locked Encryption in Three-Party Model.",
                    "Searchable Encrypted Relational Databases: Risks and Countermeasures.",
                    "Private Verification of Access on Medical Data: An Initial Study.",
                    "Default Privacy Setting Prediction by Grouping User's Attributes and Settings Preferences.",
                    "δ-privacy: Bounding Privacy Leaks in Privacy Preserving Data Mining.",
                    "Threshold Single Password Authentication.",
                    "Towards a Toolkit for Utility and Privacy-Preserving Transformation of Semi-structured Data Using Data Pseudonymization.",
                    "Privacy Dashcam - Towards Lawful Use of Dashcams Through Enforcement of External Anonymization.",
                    "DLoc: Distributed Auditing for Data Location Compliance in Cloud.",
                    "Inonymous: Anonymous Invitation-Based System.",
                    "PCS , A Privacy-Preserving Certification Scheme.",
                    "Order-Preserving Encryption Using Approximate Integer Common Divisors.",
                    "Privacy-Preserving Deterministic Automata Evaluation with Encrypted Data Blocks.",
                    "Securing Proof-of-Stake Blockchain Protocols.",
                    "Merged Mining: Curse or Cure?",
                    "Atomically Trading with Roger: Gambling on the Success of a Hardfork.",
                    "In Code We Trust? - Measuring the Control Flow Immutability of All Smart Contracts Deployed on Ethereum.",
                    "Who Am I? Secure Identity Registration on Distributed Ledgers.",
                    "A User-Centric System for Verified Identities on the Bitcoin Blockchain.",
                    "Towards a Concurrent and Distributed Route Selection for Payment Channel Networks.",
                    "Graphene: A New Protocol for Block Propagation Using Set Reconciliation.",
                    "Short Paper: Revisiting Difficulty Control for Blockchain Systems.",
                    "Secure Event Tickets on a Blockchain."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2017cicps",
                "sub_name": "Computer Security - ESORICS 2017 International Workshops, CyberICPS 2017 and SECPRE 2017, Oslo, Norway, September 14-15, 2017, Revised Selected Papers.",
                "count": 17,
                "papers": [
                    "Towards End-to-End Data Protection in Low-Power Networks.",
                    "Development of an Embedded Platform for Secure CPS Services.",
                    "Introducing Usage Control in MQTT.",
                    "Towards Security Threats that Matter.",
                    "A Methodology to Assess Vulnerabilities and Countermeasures Impact on the Missions of a Naval System.",
                    "STRIDE to a Secure Smart Grid in a Hybrid Cloud.",
                    "Stealthy Deception Attacks Against SCADA Systems.",
                    "On Ladder Logic Bombs in Industrial Control Systems.",
                    "Enforcing Memory Safety in Cyber-Physical Systems.",
                    "Supporting the Human in Cyber Defence.",
                    "CRBP-OpType: A Constrained Approximate Search Algorithm for Detecting Similar Attack Patterns.",
                    "Multistage Downstream Attack Detection in a Cyber Physical System.",
                    "A UML Profile for Privacy-Aware Data Lifecycle Models.",
                    "Evaluation of a Security and Privacy Requirements Methodology Using the Physics of Notation.",
                    "What Users Want: Adapting Qualitative Research Methods to Security Policy Elicitation.",
                    "An Anti-pattern for Misuse Cases.",
                    "Decision-Making in Security Requirements Engineering with Constrained Goal Models."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2017secse",
                "sub_name": "Proceedings of the International Workshop on Secure Software Engineering in DevOps and Agile Development co-located with the 22nd European Symposium on Research in Computer Security (ESORICS 2017), Oslo, Norway, September 14, 2017.",
                "count": 6,
                "papers": [
                    "Research Challenges in Empowering Agile Teams with Security Knowledge Based on Public and Private Information Sources.",
                    "Comparing Capability of Static Analysis Tools to Detect Security Weaknesses in Mobile Applications.",
                    "Teaching Secure Software Development Through an Online Course.",
                    "Managing Security Work in Scrum: Tensions and Challenges.",
                    "SLA-Based Continuous Security Assurance in Multi-Cloud DevOps.",
                    "SECBENCH: A Database of Real Security Vulnerabilities."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21st ESORICS 2016",
        "info": "Heraklion, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2016-1",
                "sub_name": "Computer Security - ESORICS 2016 - 21st European Symposium on Research in Computer Security, Heraklion, Greece, September 26-30, 2016, Proceedings, Part I.",
                "count": 30,
                "papers": [
                    "Understanding Cross-Channel Abuse with SMS-Spam Support Infrastructure Attribution.",
                    "Toward an Efficient Website Fingerprinting Defense.",
                    "Proactive Verification of Security Compliance for Clouds Through Pre-computation: Application to OpenStack.",
                    "Comparing Password Ranking Algorithms on Real-World Password Datasets.",
                    "Scalable Two-Factor Authentication Using Historical Data.",
                    "On the Implications of Zipf's Law in Passwords.",
                    "PPOPM: More Efficient Privacy Preserving Outsourced Pattern Matching.",
                    "An Efficient Non-interactive Multi-client Searchable Encryption with Support for Boolean Queries.",
                    "Efficient Encrypted Keyword Search for Multi-user Data Sharing.",
                    "Membrane: A Posteriori Detection of Malicious Code Loading by Memory Paging Analysis.",
                    "Mobile Application Impersonation Detection Using Dynamic User Interface Extraction.",
                    "A Machine Learning Approach for Detecting Third-Party Trackers on the Web.",
                    "Privately Outsourcing Exponentiation to a Single Server: Cryptanalysis and Optimal Constructions.",
                    "Attribute-Based Signatures for Supporting Anonymous Certification.",
                    "Privacy Preserving Computation in Cloud Using Noise-Free Fully Homomorphic Encryption (FHE) Schemes.",
                    "Lightweight Delegatable Proofs of Storage.",
                    "Anonymous RAM.",
                    "Efficient Sanitizable Signatures Without Random Oracles.",
                    "Intentio Ex Machina: Android Intent Access Control via an Extensible Application Hook.",
                    "Hey, You, Get Off of My Image: Detecting Data Residue in Android Images.",
                    "NaClDroid: Native Code Isolation for Android Applications.",
                    "AsyncShock: Exploiting Synchronisation Bugs in Intel SGX Enclaves.",
                    "Stay in Your Cage! A Sound Sandbox for Third-Party Libraries on Android.",
                    "Android Permission Recommendation Using Transitive Bayesian Inference Model.",
                    "Spot the Difference: Secure Multi-execution and Multiple Facets.",
                    "On Reductions from Multi-Domain Noninterference to the Two-Level Case.",
                    "Flexible Manipulation of Labeled Values for Information-Flow Control Libraries.",
                    "Let's Face It: Faceted Values for Taint Tracking.",
                    "IFuzzer: An Evolutionary Interpreter Fuzzer Using Genetic Programming.",
                    "Automated Multi-architectural Discovery of CFI-Resistant Code Gadgets."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2016-2",
                "sub_name": "Computer Security - ESORICS 2016 - 21st European Symposium on Research in Computer Security, Heraklion, Greece, September 26-30, 2016, Proceedings, Part II.",
                "count": 30,
                "papers": [
                    "Towards Efficient Evaluation of a Time-Driven Cache Attack on Modern Processors.",
                    "More Practical and Secure History-Independent Hash Tables.",
                    "On Manufacturing Resilient Opaque Constructs Against Static Analysis.",
                    "Robust Password-Protected Secret Sharing.",
                    "Compiling Low Depth Circuits for Practical Secure Computation.",
                    "Secure Computation of MIPS Machine Code.",
                    "Insynd: Improved Privacy-Preserving Transparency Logging.",
                    "Secure Logging Schemes and Certificate Transparency.",
                    "Banishing Misaligned Incentives for Validating Reports in Bug-Bounty Platforms.",
                    "Efficient Numerical Frameworks for Multi-objective Cyber Security Planning.",
                    "On Bitcoin Security in the Presence of Broken Cryptographic Primitives.",
                    "DRE-ip: A Verifiable E-Voting Scheme Without Tallying Authorities.",
                    "When Are Three Voters Enough for Privacy Properties?",
                    "Efficient Zero-Knowledge Contingent Payments in Cryptocurrencies Without Scripts.",
                    "LeiA: A Lightweight Authentication Protocol for CAN.",
                    "Privacy, Discovery, and Authentication for the Internet of Things.",
                    "Secure Code Updates for Mesh Networked Commodity Low-End Embedded Devices.",
                    "Authenticated Key Agreement Mediated by a Proxy Re-encryptor for the Internet of Things.",
                    "Information Control by Policy-Based Relational Weakening Templates.",
                    "Quantifying Location Privacy Leakage from Transaction Prices.",
                    "A Formal Treatment of Privacy in Video Data.",
                    "On Attacker Models and Profiles for Cyber-Physical Systems.",
                    "Towards the Automated Verification of Cyber-Physical Security Protocols: Bounding the Number of Timed Intruders.",
                    "Safeguarding Structural Controllability in Cyber-Physical Control Systems.",
                    "The Beauty or The Beast? Attacking Rate Limits of the Xen Hypervisor.",
                    "Autocomplete Injection Attack.",
                    "Breaking into the KeyStore: A Practical Forgery Attack Against Android KeyStore.",
                    "Traceable CP-ABE with Short Ciphertexts: How to Catch People Selling Decryption Devices on eBay Efficiently.",
                    "Server-Aided Revocable Attribute-Based Encryption.",
                    "Online/Offline Public-Index Predicate Encryption for Fine-Grained Mobile Access Control."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2016dpm",
                "sub_name": "Data Privacy Management and Security Assurance - 11th International Workshop, DPM 2016 and 5th International Workshop, QASA 2016, Heraklion, Crete, Greece, September 26-27, 2016, Proceedings.",
                "count": 17,
                "papers": [
                    "Metrics for Transparency.",
                    "Understanding Bifurcation of Slow Versus Fast Cyber-Attackers.",
                    "Decomposing Global Quantitative Properties into Local Ones.",
                    "Efficient SAT-Based Pre-image Enumeration for Quantitative Information Flow in Programs.",
                    "Controlled Management of Confidentiality-Preserving Relational Interactions.",
                    "Privacy-Preserving Abuse Detection in Future Decentralised Online Social Networks.",
                    "Privacy-Preserving Targeted Mobile Advertising: Formal Models and Analysis.",
                    "Searchable Encryption for Biometric Identification Revisited.",
                    "On the User Acceptance of Privacy-Preserving Attribute-Based Credentials - A Qualitative Study.",
                    "Investigating the Animation of Application Permission Dialogs: A Case Study of Facebook.",
                    "Securing Multiparty Protocols Against the Exposure of Data to Honest Parties.",
                    "Secure Frequent Pattern Mining by Fully Homomorphic Encryption with Ciphertext Packing.",
                    "Isabelle Modelchecking for Insider Threats.",
                    "Managing and Presenting User Attributes over a Decentralized Secure Name System.",
                    "PRIAM: A Privacy Risk Analysis Methodology.",
                    "A Study from the Data Anonymization Competition Pwscup 2015.",
                    "Refactoring Preserves Security."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2016cybericps",
                "sub_name": "Security of Industrial Control Systems and Cyber-Physical Systems - Second International Workshop, CyberICPS 2016, Heraklion, Crete, Greece, September 26-30, 2016, Revised Selected Papers.",
                "count": 7,
                "papers": [
                    "Security of Cyber-Physical Systems - From Theory to Testbeds and Validation.",
                    "Critical Infrastructure Protection: A Holistic Methodology for Greece.",
                    "A Security Policy Infrastructure for Tactical Service Oriented Architectures.",
                    "Physical Attestation and Authentication to Detect Cheating in Resource Constrained Smart Micro-grids.",
                    "Decentralised Scheduling of Power Consumption in Micro-grids: Optimisation and Security.",
                    "Security Issues and Mitigation in Ethernet POWERLINK.",
                    "Secure Communication and Authentication Against Off-line Dictionary Attacks in Smart Grid Systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20th ESORICS 2015",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2015-1",
                "sub_name": "Computer Security - ESORICS 2015 - 20th European Symposium on Research in Computer Security, Vienna, Austria, September 21-25, 2015, Proceedings, Part I.",
                "count": 27,
                "papers": [
                    "Towards Security of Internet Naming Infrastructure.",
                    "Waiting for CSP - Securing Legacy Web Applications with JSAgents.",
                    "Analyzing the BrowserID SSO System with Primary Identity Providers Using an Expressive Model of the Web.",
                    "A Practical Approach for Adaptive Data Structure Layout Randomization.",
                    "Trustworthy Prevention of Code Injection in Linux on Embedded Devices.",
                    "Practical Memory Deduplication Attacks in Sandboxed Javascript.",
                    "Computational Soundness for Interactive Primitives.",
                    "Verifiably Encrypted Signatures: Security Revisited and a New Construction.",
                    "Interleaving Cryptanalytic Time-Memory Trade-Offs on Non-uniform Distributions.",
                    "Efficient Message Authentication Codes with Combinatorial Group Testing.",
                    "Symmetric-Key Based Proofs of Retrievability Supporting Public Verification.",
                    "DTLS-HIMMO: Achieving DTLS Certificate Security with Symmetric Key Overhead.",
                    "Short Accountable Ring Signatures Based on DDH.",
                    "Updatable Hash Proof System and Its Applications.",
                    "Server-Aided Revocable Identity-Based Encryption.",
                    "Efficient Zero-Knowledge Proofs for Commitments from Learning with Errors over Rings.",
                    "Making Any Identity-Based Encryption Accountable, Efficiently.",
                    "Practical Threshold Password-Authenticated Secret Sharing Protocol.",
                    "On Security of Content-Based Video Stream Authentication.",
                    "Oblivious Maximum Bipartite Matching Size Algorithm with Applications to Secure Fingerprint Identification.",
                    "Practical Invalid Curve Attacks on TLS-ECDH.",
                    "Challenging the Trustworthiness of PGP: Is the Web-of-Trust Tear-Proof?",
                    "Transforming Out Timing Leaks, More or Less.",
                    "Small Tweaks Do Not Help: Differential Power Analysis of MILENAGE Implementations in 3G/4G USIM Cards.",
                    "Should Cyber-Insurance Providers Invest in Software Security?",
                    "Lightweight and Flexible Trust Assessment Modules for the Internet of Things.",
                    "Confidence Analysis for Nuclear Arms Control: SMT Abstractions of Bayesian Belief Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2015-2",
                "sub_name": "Computer Security - ESORICS 2015 - 20th European Symposium on Research in Computer Security, Vienna, Austria, September 21-25, 2015, Proceedings, Part II.",
                "count": 32,
                "papers": [
                    "FP-Block: Usable Web Privacy by Controlling Browser Fingerprinting.",
                    "Mind-Reading: Privacy Attacks Exploiting Cross-App KeyEvent Injections.",
                    "Enabling Privacy-Assured Similarity Retrieval over Millions of Encrypted Records.",
                    "Privacy-Preserving Link Prediction in Decentralized Online Social Networks.",
                    "Privacy-Preserving Observation in Public Spaces.",
                    "Privacy-Preserving Context-Aware Recommender Systems: Analysis and New Solutions.",
                    "Rich Queries on Encrypted Data: Beyond Exact Matches.",
                    "Extended Proxy-Assisted Approach: Achieving Revocable Fine-Grained Encryption of Cloud Data.",
                    "Batch Verifiable Computation of Polynomials on Outsourced Data.",
                    "CloudBI: Practical Privacy-Preserving Outsourcing of Biometric Identification in the Cloud.",
                    "Typing and Compositionality for Security Protocols: A Generalization to the Geometric Fragment.",
                    "Checking Trace Equivalence: How to Get Rid of Nonces?",
                    "Attribute Based Broadcast Encryption with Short Ciphertext and Decryption Key.",
                    "Accountable Authority Ciphertext-Policy Attribute-Based Encryption with White-Box Traceability and Public Auditing in the Cloud.",
                    "DexHunter: Toward Extracting Hidden Code from Packed Android Applications.",
                    "Identifying Arbitrary Memory Access Vulnerabilities in Privilege-Separated Software.",
                    "vBox: Proactively Establishing Secure Channels Between Wireless Devices Without Prior Knowledge.",
                    "Accurate Specification for Robust Detection of Malicious Behavior in Mobile Environments.",
                    "A Bytecode Interpreter for Secure Program Execution in Untrusted Main Memory.",
                    "Learning from Others: User Anomaly Detection Using Anomalous Samples from Other Users.",
                    "Towards Attack-Resistant Peer-Assisted Indoor Localization.",
                    "Leveraging Real-Life Facts to Make Random Passwords More Memorable.",
                    "The Emperor's New Password Creation Policies: An Evaluation of Leading Web Services and the Effect of Role in Resisting Against Online Guessing.",
                    "A Theory of Gray Security Policies.",
                    "Factorization of Behavioral Integrity.",
                    "Checking Interaction-Based Declassification Policies for Android Using Symbolic Execution.",
                    "Enhancing Java Runtime Environment for Smart Cards Against Runtime Attacks.",
                    "Making Bitcoin Exchanges Transparent.",
                    "Web-to-Application Injection Attacks on Android: Characterization and Detection.",
                    "All Your Voices are Belong to Us: Stealing Voices to Fool Humans and Machines.",
                    "Balloon: A Forward-Secure Append-Only Persistent Authenticated Data Structure.",
                    "On the Fly Design and Co-simulation of Responses Against Simultaneous Attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2015dpm",
                "sub_name": "Data Privacy Management, and Security Assurance - 10th International Workshop, DPM 2015, and 4th International Workshop, QASA 2015, Vienna, Austria, September 21-22, 2015. Revised Selected Papers.",
                "count": 21,
                "papers": [
                    "Data Protection in Cloud Scenarios.",
                    "Composable Bounds on Information Flow from Distribution Differences.",
                    "Quantitative Analysis of Network Security with Abstract Argumentation.",
                    "Security-Based Adaptation of Multi-cloud Applications.",
                    "AdIDoS - Adaptive and Intelligent Fully-Automatic Detection of Denial-of-Service Weaknesses in Web Services.",
                    "An Integrated Reward and Reputation Mechanism for MCS Preserving Users' Privacy.",
                    "Stronger Security for Sanitizable Signatures.",
                    "Some Remarks and Ideas About Monetization of Sensitive Data.",
                    "A Novel Approach to Data Revocation on the Internet.",
                    "PerfectDedup: Secure Data Deduplication.",
                    "Privacy-Preserving Biometric Authentication and Matching via Lattice-Based Encryption.",
                    "Comprehensive and Improved Secure Biometric System Using Homomorphic Encryption.",
                    "On the Privacy of Horizontally Partitioned Binary Data-Based Privacy-Preserving Collaborative Filtering.",
                    "Privacy Threats in E-Shopping (Position Paper).",
                    "Comparison-Based Privacy: Nudging Privacy in Social Media (Position Paper).",
                    "Can you Really Anonymize the Donors of Genomic Data in Today's Digital World?",
                    "User-Centric Privacy-Preserving Collection and Analysis of Trajectory Data.",
                    "The Leaking Battery - A Privacy Analysis of the HTML5 Battery Status API.",
                    "Secure Refactoring with Java Information Flow.",
                    "You Never Surf Alone. Ubiquitous Tracking of Users' Browsing Habits.",
                    "LockPic: Privacy Preserving Photo Sharing in Social Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2015cyberics",
                "sub_name": "Security of Industrial Control Systems and Cyber Physical Systems - First Workshop, CyberICS 2015 and First Workshop, WOS-CPS 2015, Vienna, Austria, September 21-22, 2015, Revised Selected Papers.",
                "count": 11,
                "papers": [
                    "The Economics of Cybersecurity: From the Public Good to the Revenge of the Industry.",
                    "Teaching Industrial Control System Security Using Collaborative Projects.",
                    "Trust Establishment in Cooperating Cyber-Physical Systems.",
                    "Security Monitoring for Industrial Control Systems.",
                    "WirelessHART NetSIM: A WirelessHART SCADA-Based Wireless Sensor Networks Simulator.",
                    "Remote Attestation for Embedded Systems.",
                    "LiMon - Lightweight Authentication for Tire Pressure Monitoring Sensors.",
                    "Umbra: Embedded Web Security Through Application-Layer Firewalls.",
                    "Towards Standardising Firewall Reporting.",
                    "Forensics in Industrial Control System: A Case Study.",
                    "An Attack Execution Model for Industrial Control Systems Security Assessment."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19th ESORICS 2014",
        "info": "Wroclaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2014-1",
                "sub_name": "Computer Security - ESORICS 2014 - 19th European Symposium on Research in Computer Security, Wroclaw, Poland, September 7-11, 2014. Proceedings, Part I.",
                "count": 30,
                "papers": [
                    "Detecting Malicious Domains via Graph Inference.",
                    "Empirically Measuring WHOIS Misuse.",
                    "EncDNS: A Lightweight Privacy-Preserving Name Resolution Service.",
                    "Ubic: Bridging the Gap between Digital Cryptography and the Physical World.",
                    "Updaticator: Updating Billions of Devices by an Efficient, Scalable and Secure Software Update Distribution over Untrusted Cache-enabled Networks.",
                    "Local Password Validation Using Self-Organizing Maps.",
                    "Verifiable Delegation of Computations with Storage-Verification Trade-off.",
                    "Identity-Based Encryption with Post-Challenge Auxiliary Inputs for Secure Cloud Applications and Sensor Networks.",
                    "Verifiable Computation over Large Database with Incremental Updates.",
                    "DroidMiner: Automated Mining and Characterization of Fine-grained Malicious Behaviors in Android Applications.",
                    "Detecting Targeted Smartphone Malware with Behavior-Triggering Stochastic Models.",
                    "TrustDump: Reliable Memory Acquisition on Smartphones.",
                    "A Framework to Secure Peripherals at Runtime.",
                    "StealthGuard: Proofs of Retrievability with Hidden Watchdogs.",
                    "An Efficient Cloud-Based Revocable Identity-Based Proxy Re-encryption Scheme for Public Clouds Data Sharing.",
                    "Verifiable Computation on Outsourced Encrypted Data.",
                    "Verifiable Computation with Reduced Informational Costs and Computational Costs.",
                    "Detangling Resource Management Functions from the TCB in Privacy-Preserving Virtualization.",
                    "Securely Outsourcing Exponentiations with Single Untrusted Program for Cloud Storage.",
                    "Quantitative Workflow Resiliency.",
                    "Who Is Touching My Cloud.",
                    "A Fast Single Server Private Information Retrieval Protocol with Low Communication Cost.",
                    "Privacy-Preserving Complex Query Evaluation over Semantically Secure Encrypted Data.",
                    "Authorized Keyword Search on Encrypted Data.",
                    "Double-Authentication-Preventing Signatures.",
                    "Statistical Properties of Pseudo Random Sequences and Experiments with PHP and Debian OpenSSL.",
                    "Efficient Hidden Vector Encryption with Constant-Size Ciphertext.",
                    "Enabling Short Fragments for Uncoordinated Spread Spectrum Communication.",
                    "Fingerprinting Far Proximity from Radio Emissions.",
                    "A Cross-Layer Key Establishment Scheme in Wireless Mesh Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2014-2",
                "sub_name": "Computer Security - ESORICS 2014 - 19th European Symposium on Research in Computer Security, Wroclaw, Poland, September 7-11, 2014. Proceedings, Part II.",
                "count": 28,
                "papers": [
                    "Public-Key Revocation and Tracing Schemes with Subset Difference Methods Revisited.",
                    "NORX: Parallel and Scalable AEAD.",
                    "Even More Practical Secure Logging: Tree-Based Seekable Sequential Key Generators.",
                    "Large Universe Ciphertext-Policy Attribute-Based Encryption with White-Box Traceability.",
                    "PPDCP-ABE: Privacy-Preserving Decentralized Ciphertext-Policy Attribute-Based Encryption.",
                    "Practical Direct Chosen Ciphertext Secure Key-Policy Attribute-Based Encryption with Public Ciphertext Test.",
                    "Privacy-Preserving Auditing for Attribute-Based Credentials.",
                    "What's the Gist? Privacy-Preserving Aggregation of User Profiles.",
                    "Challenging Differential Privacy: The Case of Non-interactive Mechanisms.",
                    "Optimality and Complexity of Inference-Proof Data Filtering and CQE.",
                    "New Insight to Preserve Online Survey Accuracy and Privacy in Big Data Era.",
                    "Software Countermeasures for Control Flow Integrity of Smart Card C Codes.",
                    "LeakWatch: Estimating Information Leakage from Java Programs.",
                    "SigPath: A Memory Graph Based Approach for Program Data Introspection and Modification.",
                    "ID-Based Two-Server Password-Authenticated Key Exchange.",
                    "Modelling Time for Authenticated Key Exchange Protocols.",
                    "Zero-Knowledge Password Policy Checks and Verifier-Based PAKE.",
                    "Bitcoin Transaction Malleability and MtGox.",
                    "Election Verifiability for Helios under Weaker Trust Assumptions.",
                    "CoinShuffle: Practical Decentralized Coin Mixing for Bitcoin.",
                    "LESS Is More: Host-Agent Based Simulator for Large-Scale Evaluation of Security Systems.",
                    "Detecting Insider Information Theft Using Features from File Access Logs.",
                    "SRID: State Relation Based Intrusion Detection for False Data Injection Attacks in SCADA.",
                    "Click Fraud Detection on the Advertiser Side.",
                    "Botyacc: Unified P2P Botnet Detection Using Behavioural Analysis and Graph Analysis.",
                    "Feature-Distributed Malware Attack: Risk and Defence.",
                    "RootkitDet: Practical End-to-End Defense against Kernel Rootkits in a Cloud Environment.",
                    "Modeling Network Diversity for Evaluating the Robustness of Networks against Zero-Day Attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2014-8872",
                "sub_name": "Data Privacy Management, Autonomous Spontaneous Security, and Security Assurance - 9th International Workshop, DPM 2014, 7th International Workshop, SETOP 2014, and 3rd International Workshop, QASA 2014, Wroclaw, Poland, September 10-11, 2014. Revised Selected Papers.",
                "count": 23,
                "papers": [
                    "Research and Challenges on Bitcoin Anonymity.",
                    "Data Trustworthiness - Approaches and Research Challenges.",
                    "Assurance Requirements for Mutual User and Service Provider Authentication.",
                    "Group Discounts Compatible with Buyer Privacy.",
                    "The Crypto-Democracy and the Trustworthy (Position Paper).",
                    "Configuration Behavior of Restrictive Default Privacy Settings on Social Network Sites - Analyzing the Combined Effect of Default Settings and Interface Style.",
                    "Towards Inherent Privacy Awareness in Workflows.",
                    "Index Optimization for L-Diversified Database-as-a-Service.",
                    "Privacy-Preserving Loyalty Programs.",
                    "Secure Improved Cloud-Based RFID Authentication Protocol.",
                    "Environment-Reactive Malware Behavior: Detection and Categorization.",
                    "Metric for Security Activities Assisted by Argumentative Logic.",
                    "Calculating Adversarial Risk from Attack Trees: Control Strength and Probabilistic Attackers.",
                    "Analysis of Social Engineering Threats with Attack Graphs.",
                    "Introducing Probabilities in Controller Strategies.",
                    "Automatically Calculating Quantitative Integrity Measures for Imperative Programs.",
                    "Risk-Aware Information Disclosure.",
                    "Probabilistic Modelling of Humans in Security Ceremonies.",
                    "High-Level Simulation for Multiple Fault Injection Evaluation.",
                    "Towards an Image Encryption Scheme with Content-Based Image Retrieval Properties.",
                    "A-PPL: An Accountability Policy Language.",
                    "Privacy-Preserving Electronic Toll System with Dynamic Pricing for Low Emission Zones.",
                    "Association Rule Mining on Fragmented Database."
                ]
            },
            {
                "sub_name_abbr": "conf/badgers/2014",
                "sub_name": "Third International Workshop on Building Analysis Datasets and Gathering Experience Returns for Security, BADGERS@ESORICS 2014, Wroclaw, Poland, September 11, 2014.",
                "count": 8,
                "papers": [
                    "ANDRUBIS - 1, 000, 000 Apps Later: A View on Current Android Malware Behaviors.",
                    "Security and Privacy Measurements in Social Networks: Experiences and Lessons Learned.",
                    "Classification of SSL Servers based on their SSL Handshake for Automated Security Assessment.",
                    "Are We Missing Labels? A Study of the Availability of Ground-Truth in Network Security Research.",
                    "EyeBit: Eye-Tracking Approach for Enforcing Phishing Prevention Habits.",
                    "The Vulnerability Dataset of a Large Software Ecosystem.",
                    "MATATABI: Multi-layer Threat Analysis Platform with Hadoop.",
                    "Collaborative Repository for Cybersecurity Data and Threat Information."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18th ESORICS 2013",
        "info": "Egham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2013",
                "sub_name": "Computer Security - ESORICS 2013 - 18th European Symposium on Research in Computer Security, Egham, UK, September 9-13, 2013. Proceedings.",
                "count": 43,
                "papers": [
                    "Practical Covertly Secure MPC for Dishonest Majority - Or: Breaking the SPDZ Limits.",
                    "Practical and Employable Protocols for UC-Secure Circuit Evaluation over ℤn.",
                    "Privacy-Preserving Accountable Computation.",
                    "Verifying Web Browser Extensions' Compliance with Private-Browsing Mode.",
                    "A Quantitative Evaluation of Privilege Separation in Web Browser Designs.",
                    "Estimating Asset Sensitivity by Profiling Users.",
                    "Practical Secure Logging: Seekable Sequential Key Generators.",
                    "Request-Based Comparable Encryption.",
                    "Ensuring File Authenticity in Private DFA Evaluation on Encrypted Files in the Cloud.",
                    "HI-CFG: Construction by Binary Analysis and Application to Attack Polymorphism.",
                    "AnDarwin: Scalable Detection of Semantically Similar Android Applications.",
                    "BISTRO: Binary Component Extraction and Embedding for Software Security Applications.",
                    "Vulnerable Delegation of DNS Resolution.",
                    "Formal Approach for Route Agility against Persistent Attackers.",
                    "Plug-and-Play IP Security - Anonymity Infrastructure instead of PKI.",
                    "Managing the Weakest Link - A Game-Theoretic Approach for the Mitigation of Insider Threats.",
                    "Automated Security Proofs for Almost-Universal Hash for MAC Verification.",
                    "Bounded Memory Protocols and Progressing Collaborative Systems.",
                    "Universally Composable Key-Management.",
                    "A Cryptographic Analysis of OPACITY - (Extended Abstract).",
                    "Symbolic Probabilistic Analysis of Off-Line Guessing.",
                    "ASICS: Authenticated Key Exchange Security Incorporating Certification Systems.",
                    "Efficient Privacy-Enhanced Familiarity-Based Recommender System.",
                    "Privacy-Preserving User Data Oriented Services for Groups with Dynamic Participation.",
                    "Privacy-Preserving Matching of Community-Contributed Content.",
                    "Ballot Secrecy and Ballot Independence Coincide.",
                    "Election Verifiability or Ballot Privacy: Do We Need to Choose?",
                    "Enforcing Privacy in the Presence of Others: Notions, Formalisations and Relations.",
                    "Mining Malware Specifications through Static Reachability Analysis.",
                    "Patrol: Revealing Zero-Day Attack Paths through Network-Wide System Object Dependencies.",
                    "Measuring and Detecting Malware Downloads in Live Network Traffic.",
                    "Automated Certification of Authorisation Policy Resistance.",
                    "Fine-Grained Access Control System Based on Outsourced Attribute-Based Encryption.",
                    "Purpose Restrictions on Information Use.",
                    "Distributed Shuffling for Preserving Access Confidentiality.",
                    "Range Extension Attacks on Contactless Smart Cards.",
                    "CellFlood: Attacking Tor Onion Routers on the Cheap.",
                    "Nowhere to Hide: Navigating around Privacy in Online Social Networks.",
                    "Current Events: Identifying Webpages by Tapping the Electrical Outlet.",
                    "Eliminating Cache-Based Timing Attacks with Instruction-Based Scheduling.",
                    "Data-Confined HTML5 Applications.",
                    "KQguard: Binary-Centric Defense against Kernel Queue Injection Attacks.",
                    "Run-Time Enforcement of Information-Flow Properties on Android - (Extended Abstract)."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2013-8247",
                "sub_name": "Data Privacy Management and Autonomous Spontaneous Security - 8th International Workshop, DPM 2013, and 6th International Workshop, SETOP 2013, Egham, UK, September 12-13, 2013, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "Quantifying and Measuring Anonymity.",
                    "Performance Evaluation of Primitives for Privacy-Enhancing Cryptography on Current Smart-Cards and Smart-Phones.",
                    "Practical Packing Method in Somewhat Homomorphic Encryption.",
                    "Collaborative and Privacy-Aware Sensing for Observing Urban Movement Patterns.",
                    "Parallel Implementation of GC-Based MPC Protocols in the Semi-Honest Setting.",
                    "Privacy Analysis of a Hidden Friendship Protocol.",
                    "Anonymous and Transferable Electronic Ticketing Scheme.",
                    "Privacy-Preserving Publish/Subscribe: Efficient Protocols in a Distributed Model.",
                    "Privacy-Preserving Processing of Raw Genomic Data.",
                    "Using Search Results to Microaggregate Query Logs Semantically.",
                    "Legal Issues About Metadata Data Privacy vs Information Security.",
                    "Privacy-Preserving Multi-Party Reconciliation Secure in the Malicious Model.",
                    "Differentially Private Smart Metering with Battery Recharging.",
                    "AppGuard - Fine-Grained Policy Enforcement for Untrusted Android Applications.",
                    "Reference Monitors for Security and Interoperability in OAuth 2.0.",
                    "Remote Biometrics for Robust Persistent Authentication.",
                    "Classifying Android Malware through Subgraph Mining.",
                    "Introducing Probabilities in Contract-Based Approaches for Mobile Application Security.",
                    "Advanced Detection Tool for PDF Threats.",
                    "Enforcing Input Validation through Aspect Oriented Programming.",
                    "Lightweight Cryptography for Embedded Systems - A Comparative Analysis.",
                    "A Simulation of Document Detection Methods and Reducing False Positives for Private Stream Searching.",
                    "Dynamic Anonymous Index for Confidential Data.",
                    "Are On-Line Personae Really Unlinkable?",
                    "On the Privacy of Private Browsing - A Forensic Approach.",
                    "Privacy-Preserving Trust Management Mechanisms from Private Matching Schemes."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17th ESORICS 2012",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2012",
                "sub_name": "Computer Security - ESORICS 2012 - 17th European Symposium on Research in Computer Security, Pisa, Italy, September 10-12, 2012. Proceedings.",
                "count": 50,
                "papers": [
                    "Modeling and Enhancing Android's Permission System.",
                    "Hardening Access Control and Data Protection in GFS-like File Systems.",
                    "Attack of the Clones: Detecting Cloned Applications on Android Markets.",
                    "Boosting the Permissiveness of Dynamic Information-Flow Tracking by Testing.",
                    "Effective Symbolic Protocol Analysis via Equational Irreducibility Conditions.",
                    "Deciding Epistemic and Strategic Properties of Cryptographic Protocols.",
                    "Satisfiability and Feasibility in a Relationship-Based Workflow Authorization Model.",
                    "Deciding Security for a Fragment of ASLan.",
                    "A Probabilistic Framework for Localization of Attackers in MANETs.",
                    "Robust Probabilistic Fake Packet Injection for Receiver-Location Privacy in WSN.",
                    "Privacy-Aware Message Exchanges for Geographically Routed Human Movement Networks.",
                    "Trust No One Else: Detecting MITM Attacks against SSL/TLS without Third-Parties.",
                    "X.509 Forensics: Detecting and Localising the SSL/TLS Men-in-the-Middle.",
                    "A Practical Man-In-The-Middle Attack on Signal-Based Key Generation Protocols.",
                    "The Silence of the LANs: Efficient Leakage Resilience for IPsec VPNs.",
                    "Security of Patched DNS.",
                    "Revealing Abuses of Channel Assignment Protocols in Multi-channel Wireless Networks: An Investigation Logic Approach.",
                    "Exploring Linkability of User Reviews.",
                    "Formal Analysis of Privacy in an eHealth Protocol.",
                    "PRIVATUS: Wallet-Friendly Privacy Protection for Smart Meters.",
                    "SHARP: Private Proximity Test and Secure Handshake with Cheat-Proof Location Tags.",
                    "Secure Proximity Detection for NFC Devices Based on Ambient Sensor Data.",
                    "Enhancing Location Privacy for Electric Vehicles (at the Right time).",
                    "Design and Implementation of a Terrorist Fraud Resilient Distance Bounding System.",
                    "Applying Divertibility to Blind Ballot Copying in the Helios Internet Voting System.",
                    "Defining Privacy for Weighted Votes, Single and Multi-voter Coercion.",
                    "TorScan: Tracing Long-Lived Connections and Differential Scanning Attacks.",
                    "Introducing the gMix Open Source Framework for Mix Implementations.",
                    "Secure and Efficient Outsourcing of Sequence Comparisons.",
                    "Third-Party Private DFA Evaluation on Encrypted Files in the Cloud.",
                    "New Algorithms for Secure Outsourcing of Modular Exponentiations.",
                    "Towards Symbolic Encryption Schemes.",
                    "Decision Procedures for Simulatability.",
                    "Model-Checking Bisimulation-Based Information Flow Properties for Infinite State Systems.",
                    "Identity-Based Traitor Tracing with Short Private Key and Short Ciphertext.",
                    "Identity-Based Encryption with Master Key-Dependent Message Security and Leakage-Resilience.",
                    "Unique Group Signatures.",
                    "Relations among Notions of Privacy for RFID Authentication Protocols.",
                    "PE(AR)2: Privacy-Enhanced Anonymous Authentication with Reputation and Revocation.",
                    "Dismantling iClass and iClass Elite.",
                    "Evaluation of Standardized Password-Based Key Derivation against Parallel Processing Platforms.",
                    "Beyond eCK: Perfect Forward Secrecy under Actor Compromise and Ephemeral-Key Reveal.",
                    "Bleichenbacher's Attack Strikes again: Breaking PKCS#1 v1.5 in XML Encryption.",
                    "On the Security of Password Manager Database Formats.",
                    "Scalable Telemetry Classification for Automated Malware Detection.",
                    "Abstraction-Based Malware Analysis Using Rewriting and Model Checking.",
                    "Detecting Phishing Emails the Natural Language Way.",
                    "JVM-Portable Sandboxing of Java's Native Libraries.",
                    "Codejail: Application-Transparent Isolation of Libraries with Tight Program Interactions.",
                    "SocialImpact: Systematic Analysis of Underground Social Dynamics."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2012-7731",
                "sub_name": "Data Privacy Management and Autonomous Spontaneous Security, 7th International Workshop, DPM 2012, and 5th International Workshop, SETOP 2012, Pisa, Italy, September 13-14, 2012. Revised Selected Papers.",
                "count": 23,
                "papers": [
                    "Fair Anonymous Authentication for Location Based Services.",
                    "Enhancing Privacy in LTE Paging System Using Physical Layer Identification.",
                    "Post-hoc User Traceability Analysis in Electronic Toll Pricing Systems.",
                    "An Efficient and Secure Coding-Based Authenticated Encryption Scheme.",
                    "Proposal of Non-invasive Fingerprint Age Determination to Improve Data Privacy Management in Police Work from a Legal Perspective Using the Example of Germany.",
                    "Differential Privacy in Tripartite Interaction: A Case Study with Linguistic Minorities in Canada.",
                    "EsPRESSo: Efficient Privacy-Preserving Evaluation of Sample Set Similarity.",
                    "SlopPy: Slope One with Privacy.",
                    "A Semi-lattice Model for Multi-lateral Security.",
                    "Prioritized Execution of Privacy Policies.",
                    "What Websites Know About You.",
                    "Automating Privacy Enforcement in Cloud Platforms.",
                    "Evaluation of Jif and Joana as Information Flow Analyzers in a Model-Driven Approach.",
                    "Analyzing HTTP User Agent Anomalies for Malware Detection.",
                    "AS5: A Secure Searchable Secret Sharing Scheme for Privacy Preserving Database Outsourcing.",
                    "Configuration Assessment as a Service.",
                    "Automated Smartphone Security Configuration.",
                    "On the Detectability of Weak DoS Attacks in Wireless Sensor Networks.",
                    "μSec: A Security Protocol for Unicast Communication in Wireless Sensor Networks.",
                    "Security Monitoring for Content-Centric Networking.",
                    "Towards Session-Aware RBAC Delegation: Function Switch.",
                    "Policy Chain for Securing Service Oriented Architectures.",
                    "Towards a Temporal Response Taxonomy."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16th ESORICS 2011",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2011",
                "sub_name": "Computer Security - ESORICS 2011 - 16th European Symposium on Research in Computer Security, Leuven, Belgium, September 12-14, 2011. Proceedings.",
                "count": 36,
                "papers": [
                    "Secure Localization Using Dynamic Verifiers.",
                    "WiFiHop - Mitigating the Evil Twin Attack through Multi-hop Detection.",
                    "Investigation of Signal and Message Manipulations on the Wireless Channel.",
                    "Protecting Private Web Content from Embedded Scripts.",
                    "Preventing Web Application Injections with Complementary Character Coding.",
                    "Automatic and Precise Client-Side Protection against CSRF Attacks.",
                    "Timing Is Everything: The Importance of History Detection.",
                    "Reclaiming the Blogosphere, TalkBack: A Secure LinkBack Protocol for Weblogs.",
                    "A Systematic Analysis of XSS Sanitization in Web Application Frameworks.",
                    "Who Wrote This Code? Identifying the Authors of Program Binaries.",
                    "Secure and Efficient Protocols for Iris and Fingerprint Identification.",
                    "Linear Obfuscation to Combat Symbolic Execution.",
                    "DriverGuard: A Fine-Grained Protection on I/O Flows.",
                    "Time-Storage Trade-Offs for Cryptographically-Enforced Access Control.",
                    "Socially Constructed Trust for Distributed Authorization.",
                    "Fully Secure Multi-authority Ciphertext-Policy Attribute-Based Encryption without Random Oracles.",
                    "How to Aggregate the CL Signature Scheme.",
                    "Key Exchange in IPsec Revisited: Formal Analysis of IKEv1 and IKEv2.",
                    "Adapting Helios for Provable Ballot Privacy.",
                    "Remote Timing Attacks Are Still Practical.",
                    "Multi-run Security.",
                    "Automated Information Flow Analysis of Virtualized Infrastructures.",
                    "Scalable Analysis of Attack Scenarios.",
                    "Usability of Display-Equipped RFID Tags for Security Purposes.",
                    "Forcing Johnny to Login Safely - Long-Term User Study of Forcing and Training Login Mechanisms.",
                    "Towards a Mechanism for Incentivating Privacy.",
                    "Investigating the OpenPGP Web of Trust.",
                    "A Practical Complexity-Theoretic Analysis of Mix Systems.",
                    "A Light-Weight Solution to Preservation of Access Pattern Privacy in Un-trusted Clouds.",
                    "Optimizing Mixing in Pervasive Networks: A Graph-Theoretic Perspective.",
                    "A New RFID Privacy Model.",
                    "Quantitative Information Flow, with a View.",
                    "To Release or Not to Release: Evaluating Information Leaks in Aggregate Human-Genome Data.",
                    "Don't Reveal My Intension: Protecting User Privacy Using Declarative Preferences during Distributed Query Processing.",
                    "Supporting Concurrency in Private Data Outsourcing.",
                    "Privacy-Preserving DNS: Analysis of Broadcast, Range Queries and Mix-Based Protection Methods."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2011-7122",
                "sub_name": "Data Privacy Management and Autonomous Spontaneus Security - 6th International Workshop, DPM 2011, and 4th International Workshop, SETOP 2011, Leuven, Belgium, September 15-16, 2011, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Privacy Challenges in RFID.",
                    "Fake Injection Strategies for Private Phonetic Matching.",
                    "A Design Phase for Data Sharing Agreements.",
                    "A Privacy-Protecting Architecture for Collaborative Filtering via Forgery and Suppression of Ratings.",
                    "On the Complexity of Aggregating Information for Authentication and Profiling.",
                    "Secure and Privacy-Aware Searching in Peer-to-Peer Networks.",
                    "On the Security of Mutual Authentication Protocols for RFID Systems: The Case of Wei et al.'s Protocol.",
                    "Inference-Proof View Update Transactions with Minimal Refusals.",
                    "Representation-Independent Data Usage Control.",
                    "Using Personal Portfolios to Manage Customer Data.",
                    "Using Requirements Engineering in an Automatic Security Policy Derivation Process.",
                    "Web Services Verification and Prudent Implementation.",
                    "Evolving Security Requirements in Multi-layered Service-Oriented-Architectures.",
                    "Risk-Based Auto-delegation for Probabilistic Availability.",
                    "Intra-role Progression in RBAC: An RPG-Like Access Control Scheme.",
                    "Distributed Orchestration of Web Services under Security Constraints.",
                    "On the Key Schedule Strength of PRESENT.",
                    "A Traffic Regulation Method Based on MRA Signatures to Reduce Unwanted Traffic from Compromised End-User Machines.",
                    "Network Securing against Threatening Requests.",
                    "A Workflow Checking Approach for Inherent Privacy Awareness in Network Monitoring.",
                    "Controlling Data Dissemination.",
                    "A Framework of Deployment Strategy for Hierarchical WSN Security Management."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15th ESORICS 2010",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2010",
                "sub_name": "Computer Security - ESORICS 2010, 15th European Symposium on Research in Computer Security, Athens, Greece, September 20-22, 2010. Proceedings.",
                "count": 42,
                "papers": [
                    "A New Framework for RFID Privacy.",
                    "Readers Behaving Badly - Reader Revocation in PKI-Based RFID Systems.",
                    "Privacy-Preserving, Taxable Bank Accounts.",
                    "Formal Analysis of Privacy for Vehicular Mix-Zones.",
                    "IntPatch: Automatically Fix Integer-Overflow-to-Buffer-Overflow Vulnerability at Compile-Time.",
                    "A Theory of Runtime Enforcement, with Results.",
                    "Enforcing Secure Object Initialization in Java.",
                    "Flexible Scheduler-Independent Security.",
                    "Secure Multiparty Linear Programming Using Fixed-Point Arithmetic.",
                    "A Certifying Compiler for Zero-Knowledge Proofs of Knowledge Based on Sigma-Protocols.",
                    "Short Generic Transformation to Strongly Unforgeable Signature in the Standard Model.",
                    "DR@FT: Efficient Remote Attestation Framework for Dynamic Systems.",
                    "Website Fingerprinting and Identification Using Ordered Feature Sequences.",
                    "Web Browser History Detection as a Real-World Privacy Threat.",
                    "On the Secrecy of Spread-Spectrum Flow Watermarks.",
                    "Traffic Analysis against Low-Latency Anonymity Networks Using Available Bandwidth Estimation.",
                    "A Hierarchical Adaptive Probabilistic Approach for Zero Hour Phish Detection.",
                    "Kamouflage: Loss-Resistant Password Management.",
                    "Sequential Protocol Composition in Maude-NPA.",
                    "Verifying Security Property of Peer-to-Peer Systems Using CSP.",
                    "Modeling and Analyzing Security in the Presence of Compromising Adversaries.",
                    "On Bounding Problems of Quantitative Information Flow.",
                    "On E-Vote Integrity in the Case of Malicious Voter Computers.",
                    "Election Verifiability in Electronic Voting Protocols.",
                    "Pretty Good Democracy for More Expressive Voting Schemes.",
                    "Efficient Multi-dimensional Key Management in Broadcast Services.",
                    "Caught in the Maze of Security Standards.",
                    "User-Role Reachability Analysis of Evolving Administrative Role Based Access Control.",
                    "An Authorization Framework Resilient to Policy Evaluation Failures.",
                    "Optimistic Fair Exchange with Multiple Arbiters.",
                    "Speaker Recognition in Encrypted Voice Streams.",
                    "Evaluating Adversarial Partitions.",
                    "Providing Mobile Users' Anonymity in Hybrid Networks.",
                    "Complexity of Anonymity for Security Protocols.",
                    "k-Zero Day Safety: Measuring the Security Risk of Networks against Unknown Attacks.",
                    "Are Security Experts Useful? Bayesian Nash Equilibria for Network Security Games with Limited Information.",
                    "RatFish: A File Sharing Protocol Provably Secure against Rational Users.",
                    "A Service Dependency Model for Cost-Sensitive Intrusion Response.",
                    "Secure Code Update for Embedded Devices via Proofs of Secure Erasure.",
                    "D(e|i)aling with VoIP: Robust Prevention of DIAL Attacks.",
                    "Low-Cost Client Puzzles Based on Modular Exponentiation.",
                    "Expressive, Efficient and Obfuscation Resilient Behavior Based IDS."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2010-6514",
                "sub_name": "Data Privacy Management and Autonomous Spontaneous Security - 5th International Workshop, DPM 2010 and 3rd International Workshop, SETOP 2010, Athens, Greece, September 23, 2010, Revised Selected Papers.",
                "count": 18,
                "papers": [
                    "Towards Knowledge Intensive Data Privacy.",
                    "Privacy in Data Publishing.",
                    "A User-Oriented Anonymization Mechanism for Public Data.",
                    "FAANST: Fast Anonymizing Algorithm for Numerical Streaming DaTa.",
                    "Secret-Sharing Hardware Improves the Privacy of Network Monitoring.",
                    "Non-uniform Stepping Approach to RFID Distance Bounding Problem.",
                    "E-Ticketing Scheme for Mobile Devices with Exculpability.",
                    "Privacy Enforcement and Analysis for Functional Active Objects.",
                    "L-PEP: A Logic to Reason about Privacy-Enhancing Cryptography Protocols.",
                    "Surveillance, Privacy and the Law of Requisite Variety.",
                    "A Notation for Policies Using Feature Structures.",
                    "Securing P2P Storage with a Self-organizing Payment Scheme.",
                    "STARS: A Simple and Efficient Scheme for Providing Transparent Traceability and Anonymity to Reputation Systems.",
                    "DualTrust: A Distributed Trust Model for Swarm-Based Autonomic Computing Systems.",
                    "MIRAGE: A Management Tool for the Analysis and Deployment of Network Security Policies.",
                    "A DSL for Specifying Autonomic Security Management Strategies.",
                    "Secure and Scalable RFID Authentication Protocol.",
                    "Some Ideas on Virtualized System Security, and Monitors."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th ESORICS 2009",
        "info": "Saint-Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2009",
                "sub_name": "Computer Security - ESORICS 2009, 14th European Symposium on Research in Computer Security, Saint-Malo, France, September 21-23, 2009. Proceedings.",
                "count": 42,
                "papers": [
                    "Learning More about the Underground Economy: A Case-Study of Keyloggers and Dropzones.",
                    "User-Centric Handling of Identity Agent Compromise.",
                    "The Coremelt Attack.",
                    "Type-Based Analysis of PIN Processing APIs.",
                    "Declassification with Explicit Reference Points.",
                    "Tracking Information Flow in Dynamic Tree Structures.",
                    "Lightweight Opportunistic Tunneling (LOT).",
                    "Hide and Seek in Time - Robust Covert Timing Channels.",
                    "Authentic Time-Stamps for Archival Storage.",
                    "Towards a Theory of Accountability and Audit.",
                    "Reliable Evidence: Auditability by Typing.",
                    "PCAL: Language Support for Proof-Carrying Authorization Systems.",
                    "ReFormat: Automatic Reverse Engineering of Encrypted Messages.",
                    "Protocol Normalization Using Attribute Grammars.",
                    "Automatically Generating Models for Botnet Detection.",
                    "Dynamic Enforcement of Abstract Separation of Duty Constraints.",
                    "Usable Access Control in Collaborative Environments: Authorization Based on People-Tagging.",
                    "Requirements and Protocols for Inference-Proof Interactions in Information Systems.",
                    "A Privacy Preservation Model for Facebook-Style Social Network Systems.",
                    "New Privacy Results on Synchronized RFID Authentication Protocols against Tag Tracing.",
                    "Secure Pseudonymous Channels.",
                    "Enabling Public Verifiability and Data Dynamics for Storage Security in Cloud Computing.",
                    "Content Delivery Networks: Protection or Threat?",
                    "Model-Checking DoS Amplification for VoIP Session Initiation.",
                    "The Wisdom of Crowds: Attacks and Optimal Constructions.",
                    "Secure Evaluation of Private Linear Branching Programs with Medical Applications.",
                    "Keep a Few: Outsourcing Data While Maintaining Confidentiality.",
                    "Data Structures with Unpredictable Timing.",
                    "WORM-SEAL: Trustworthy Data Retention and Verification for Regulatory Compliance.",
                    "Corruption-Localizing Hashing.",
                    "Isolating JavaScript with Filters, Rewriting, and Wrappers.",
                    "An Effective Method for Combating Malicious Scripts Clickbots.",
                    "Client-Side Detection of XSS Worms by Monitoring Payload Propagation.",
                    "Formal Indistinguishability Extended to the Random Oracle Model.",
                    "Computationally Sound Analysis of a Probabilistic Contract Signing Protocol.",
                    "Attribute-Sets: A Practically Motivated Enhancement to Attribute-Based Encryption.",
                    "A Generic Security API for Symmetric Key Management on Cryptographic Devices.",
                    "ID-Based Secure Distance Bounding and Localization.",
                    "Secure Ownership and Ownership Transfer in RFID Systems.",
                    "Cumulative Attestation Kernels for Embedded Systems.",
                    "Super-Efficient Aggregating History-Independent Persistent Authenticated Dictionaries.",
                    "Set Covering Problems in Role-Based Access Control."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2010-5939",
                "sub_name": "Data Privacy Management and Autonomous Spontaneous Security, 4th International Workshop, DPM 2009 and Second International Workshop, SETOP 2009, St. Malo, France, September 24-25, 2009, Revised Selected Papers.",
                "count": 19,
                "papers": [
                    "The UNESCO Chair in Data Privacy Research in Vehicular Networks.",
                    "Privacy Management for Global Organizations.",
                    "Obligation Language and Framework to Enable Privacy-Aware SOA.",
                    "Distributed Privacy-Preserving Methods for Statistical Disclosure Control.",
                    "Towards a Privacy-Preserving National Identity Card.",
                    "Using SAT-Solvers to Compute Inference-Proof Database Instances.",
                    "A Quantitative Analysis of Indistinguishability for a Continuous Domain Biometric Cryptosystem.",
                    "A Spatial Cloaking Framework Based on Range Search for Nearest Neighbor Search.",
                    "Visualizing Privacy Implications of Access Control Policies in Social Network Systems.",
                    "Contextual Privacy Management in Extended Role Based Access Control Model.",
                    "Dynamic Security Rules for Geo Data.",
                    "Medical Image Integrity Control Combining Digital Signature and Lossless Watermarking.",
                    "ASRBAC: A Security Administration Model for Mobile Autonomic Networks (MAutoNets).",
                    "Untraceable Tags Based on Mild Assumptions.",
                    "Security Threat Mitigation Trends in Low-Cost RFID Systems.",
                    "An Effective TCP/IP Fingerprinting Technique Based on Strange Attractors Classification.",
                    "DDoS Defense Mechanisms: A New Taxonomy.",
                    "RDyMASS: Reliable and Dynamic Enforcement of Security Policies for Mobile Agent Systems.",
                    "Achieving Life-Cycle Compliance of Service-Oriented Architectures: Open Issues and Challenges."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th ESORICS 2008",
        "info": "Málaga, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2008",
                "sub_name": "Computer Security - ESORICS 2008, 13th European Symposium on Research in Computer Security, Málaga, Spain, October 6-8, 2008. Proceedings.",
                "count": 37,
                "papers": [
                    "Multiprimary Support for the Availability of Cluster-Based Stateful Firewalls Using FT-FW.",
                    "Identifying Critical Attack Assets in Dependency Attack Graphs.",
                    "Online Risk Assessment of Intrusion Scenarios Using D-S Evidence Theory.",
                    "Strongly-Resilient and Non-interactive Hierarchical Key-Agreement in MANETs.",
                    "Efficient Handling of Adversary Attacks in Aggregation Applications.",
                    "Symmetric Key Approaches to Securing BGP - A Little Bit Trust Is Enough.",
                    "Dismantling MIFARE Classic.",
                    "A Browser-Based Kerberos Authentication Scheme.",
                    "CROO: A Universal Infrastructure and Protocol to Detect Identity Fraud.",
                    "Disclosure Analysis and Control in Statistical Databases.",
                    "TRACE: Zero-Down-Time Database Damage Tracking, Quarantine, and Cleansing with Negligible Run-Time Overhead.",
                    "Access Control Friendly Query Verification for Outsourced Data Publishing.",
                    "Sharemind: A Framework for Fast Privacy-Preserving Computations.",
                    "Modeling Privacy Insurance Contracts and Their Utilization in Risk Management for ICT Firms.",
                    "Remote Integrity Check with Dishonest Storage Server.",
                    "A Low-Variance Random-Walk Procedure to Provide Anonymity in Overlay Networks.",
                    "RFID Privacy Models Revisited.",
                    "A New Formal Proof Model for RFID Location Privacy.",
                    "Distributed Authorization by Multiparty Trust Negotiation.",
                    "Compositional Refinement of Policies in UML - Exemplified for Access Control.",
                    "On the Security of Delegation in Access Control Systems.",
                    "Termination-Insensitive Noninterference Leaks More Than Just a Bit.",
                    "Security Provisioning in Pervasive Environments Using Multi-objective Optimization.",
                    "Improved Security Notions and Protocols for Non-transferable Identification.",
                    "Human Readable Paper Verification of Prêt à Voter.",
                    "A Distributed Implementation of the Certified Information Access Service.",
                    "Exploring User Reactions to New Browser Cues for Extended Validation Certificates.",
                    "A Framework for the Analysis of Mix-Based Steganographic File Systems.",
                    "An Adaptive Policy-Based Approach to SPIT Management.",
                    "Structured Peer-to-Peer Overlay Networks: Ideal Botnets Command and Control Infrastructures?.",
                    "Eureka: A Framework for Enabling Static Malware Analysis.",
                    "New Considerations about the Correct Design of Turbo Fingerprinting Codes.",
                    "Formally Bounding the Side-Channel Leakage in Unknown-Message Attacks.",
                    "Cryptographic Protocol Explication and End-Point Projection.",
                    "State Space Reduction in the Maude-NRL Protocol Analyzer.",
                    "Code-Carrying Authorization.",
                    "CPU Bugs, CPU Backdoors and Consequences on Security."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2008pilba",
                "sub_name": "Proceedings of the 1st International Workshop on Privacy in Location-Based Applications, Malaga, Spain, October 9, 2008.",
                "count": 9,
                "papers": [
                    "Preface.",
                    "Invited Talk Extended Abstract: Safety and Privacy in Vehicular Communications.",
                    "Location Privacy in Location-Based Services: Beyond TTP-based Schemes.",
                    "Privacy in Georeferenced Context-aware Services: A Survey.",
                    "Pattern-Preserving k-Anonymization of Sequences and its Application to Mobil- ity Data Mining.",
                    "On the Impact of User Movement Simulations in the Evaluation of LBS Privacy- Preserving Techniques.",
                    "A Multi-Path Approach for k-Anonymity in Mobile Hybrid Networks.",
                    "User Privacy in Transport Systems Based on RFID E-Tickets.",
                    "The CURUPIRA-2 Block Cipher for Constrained Platforms: Specification and Benchmarking."
                ]
            },
            {
                "sub_name_abbr": "conf/esorics/2009-5599",
                "sub_name": "Privacy in Location-Based Applications, Research Issues and Emerging Trends [This book was partially born out of the First International Workshop on Privacy in Location-Based Applications (PiLBA 2008) held in Malaga, Spain, in October 2008, in conjunction with the 13th European Symposium on Research in Computer Security].",
                "count": 9,
                "papers": [
                    "Anonymity and Historical-Anonymity in Location-Based Services.",
                    "Location Privacy Techniques in Client-Server Architectures.",
                    "Private Information Retrieval Techniques for Enabling Location Privacy in Location-Based Services.",
                    "Privacy Preservation over Untrusted Mobile Networks.",
                    "Access Control in Location-Based Services.",
                    "Location Privacy in RFID Applications.",
                    "Privacy in Georeferenced Context-Aware Services: A Survey.",
                    "Safety and Privacy in Vehicular Communications.",
                    "Privacy Preserving Publication of Moving Object Data."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th ESORICS 2007",
        "info": "Dresden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2007",
                "sub_name": "Computer Security - ESORICS 2007, 12th European Symposium On Research In Computer Security, Dresden, Germany, September 24-26, 2007, Proceedings.",
                "count": 40,
                "papers": [
                    "Trustworthy Services and the Biological Analogy.",
                    "Security of Multithreaded Programs by Compilation.",
                    "Efficient Proving for Practical Distributed Access-Control Systems.",
                    "Maintaining High Performance Communication Under Least Privilege Using Dynamic Perimeter Control.",
                    "Pragmatic XML Access Control Using Off-the-Shelf RDBMS.",
                    "Conditional Privacy-Aware Role Based Access Control.",
                    "Satisfiability and Resiliency in Workflow Systems.",
                    "Completeness of the Authentication Tests.",
                    "SilentKnock: Practical, Provably Undetectable Authentication.",
                    "Generalized Key Delegation for Hierarchical Identity-Based Encryption.",
                    "Change-Impact Analysis of Firewall Policies.",
                    "Fragmentation and Encryption to Enforce Privacy in Data Storage.",
                    "Information Confinement, Privacy, and Security in RFID Systems.",
                    "A Logic for State-Modifying Authorization Policies.",
                    "Inductive Proofs of Computational Secrecy.",
                    "What, Indeed, Is Intransitive Noninterference?",
                    "Traceability and Integrity of Execution in Distributed Workflow Management Systems.",
                    "Dynamic Information Flow Control Architecture for Web Applications.",
                    "Cloak: A Ten-Fold Way for Reliable Covert Communications.",
                    "Efficient Password-Based Authenticated Key Exchange Without Public Information.",
                    "Improved Anonymous Timed-Release Encryption.",
                    "Encryption Techniques for Secure Database Outsourcing.",
                    "Click Passwords Under Investigation.",
                    "Graphical Password Authentication Using Cued Click Points.",
                    "Obligations and Their Interaction with Programs.",
                    "On the Privacy of Concealed Data Aggregation.",
                    "Synthesizing Secure Protocols.",
                    "A Cryptographic Model for Branching Time Security Properties - The Case of Contract Signing Protocols.",
                    "Security Evaluation of Scenarios Based on the TCG's TPM Specification.",
                    "Analyzing Side Channel Leakage of Masked Implementations with Stochastic Methods.",
                    "Insider Attacks Enabling Data Broadcasting on Crypto-Enforced Unicast Links.",
                    "Towards Modeling Trust Based Decisions: A Game Theoretic Approach.",
                    "Extending the Common Services of eduGAIN with a Credential Conversion Service.",
                    "Incorporating Temporal Capabilities in Existing Key Management Schemes.",
                    "A Policy Language for Distributed Usage Control.",
                    "Countering Statistical Disclosure with Receiver-Bound Cover Traffic.",
                    "Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack.",
                    "Modular Access Control Via Strategic Rewriting.",
                    "On the Automated Correction of Security Protocols Susceptible to a Replay Attack.",
                    "Adaptive Soundness of Static Equivalence."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th ESORICS 2006",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2006",
                "sub_name": "Computer Security - ESORICS 2006, 11th European Symposium on Research in Computer Security, Hamburg, Germany, September 18-20, 2006, Proceedings.",
                "count": 32,
                "papers": [
                    "Finding Peer-to-Peer File-Sharing Using Coarse Network Behaviors.",
                    "Timing Analysis in Low-Latency Mix Networks: Attacks and Defenses.",
                    "TrustedPals: Secure Multiparty Computation Implemented with Smart Cards.",
                    "Private Information Retrieval Using Trusted Hardware.",
                    "Bridging the Gap Between Inter-communication Boundary and Internal Trusted Components.",
                    "License Transfer in OMA-DRM.",
                    "Enhanced Security Architecture for Music Distribution on Mobile.",
                    "A Formal Model of Access Control for Mobile Interactive Devices.",
                    "Discretionary Capability Confinement.",
                    "Minimal Threshold Closure.",
                    "Reducing the Dependence of SPKI/SDSI on PKI.",
                    "Delegation in Role-Based Access Control.",
                    "Applying a Security Requirements Engineering Process.",
                    "Modeling and Evaluating the Survivability of an Intrusion Tolerant Database System.",
                    "A Formal Framework for Confidentiality-Preserving Refinement.",
                    "Timing-Sensitive Information Flow Analysis for Synchronous Systems.",
                    "HBAC: A Model for History-Based Access Control and Its Model Checking.",
                    "From Coupling Relations to Mated Invariants for Checking Information Flow.",
                    "A Linear Logic of Authorization and Knowledge.",
                    "Prêt à Voter with Re-encryption Mixes.",
                    "Secure Key-Updating for Lazy Revocation.",
                    "Key Derivation Algorithms for Monotone Access Structures in Cryptographic File Systems.",
                    "Cryptographically Sound Security Proofs for Basic and Public-Key Kerberos.",
                    "Deriving Secrecy in Key Establishment Protocols.",
                    "Limits of the BRSIM/UC Soundness of Dolev-Yao Models with Hashes.",
                    "Conditional Reactive Simulatability.",
                    "SessionSafe: Implementing XSS Immune Session Handling.",
                    "Policy-Driven Memory Protection for Reconfigurable Hardware.",
                    "Privacy-Preserving Queries on Encrypted Data.",
                    "Analysis of Policy Anomalies on Distributed Network Security Setups.",
                    "Assessment of a Vulnerability in Iterative Servers Enabling Low-Rate DoS Attacks.",
                    "Towards an Information-Theoretic Framework for Analyzing Intrusion Detection Systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th ESORICS 2005",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2005",
                "sub_name": "Computer Security - ESORICS 2005, 10th European Symposium on Research in Computer Security, Milan, Italy, September 12-14, 2005, Proceedings.",
                "count": 28,
                "papers": [
                    "Computerized Voting Machines: A View from the Trenches.",
                    "XML Access Control with Policy Matching Tree.",
                    "Semantic Access Control Model: A Formal Specification.",
                    "A Generic XACML Based Declarative Authorization Scheme for Java.",
                    "Specification and Validation of Authorisation Constraints Using UML and OCL.",
                    "Unified Index for Mobile Object Data and Authorizations.",
                    "On Obligations.",
                    "A Practical Voter-Verifiable Election Scheme.",
                    "Machine-Checked Security Proofs of Cryptographic Signature Schemes.",
                    "Sanitizable Signatures.",
                    "Limits of the Cryptographic Realization of Dolev-Yao-Style XOR.",
                    "Security-Typed Languages for Implementation of Cryptographic Protocols: A Case Study.",
                    "Augmented Oblivious Polynomial Evaluation Protocol and Its Applications.",
                    "Using Attack Trees to Identify Malicious Attacks from Authorized Insiders.",
                    "An Efficient and Unified Approach to Correlating, Hypothesizing, and Predicting Intrusion Alerts.",
                    "Towards a Theory of Intrusion Detection.",
                    "On Scalability and Modularisation in the Modelling of Network Security Systems.",
                    "Sybil-Resistant DHT Routing.",
                    "Botnet Tracking: Exploring a Root-Cause Methodology to Prevent Distributed Denial-of-Service Attacks.",
                    "Quantifying Probabilistic Information Flow in Computational Reactive Systems.",
                    "Enforcing Non-safety Security Policies with Program Monitors.",
                    "Soundness of Formal Encryption in the Presence of Key-Cycles.",
                    "Privacy Preserving Clustering.",
                    "Abstractions Preserving Parameter Confidentiality.",
                    "Minimal Disclosure in Hierarchical Hippocratic Databases with Delegation.",
                    "Security Notions for Disk Encryption.",
                    "Local View Attack on Anonymous Communication.",
                    "Browser Model for Security Analysis of Browser-Based Protocols."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th ESORICS 2004",
        "info": "Sophia Antipolis, French Riviera, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2004",
                "sub_name": "Computer Security - ESORICS 2004, 9th European Symposium on Research Computer Security, Sophia Antipolis, France, September 13-15, 2004, Proceedings.",
                "count": 27,
                "papers": [
                    "Incorporating Dynamic Constraints in the Flexible Authorization Framework.",
                    "Access-Condition-Table-Driven Access Control for XML Databases.",
                    "An Algebra for Composing Enterprise Privacy Policies.",
                    "Deriving, Attacking and Defending the GDOI Protocol.",
                    "Better Privacy for Trusted Computing Platforms: (Extended Abstract).",
                    "A Cryptographically Sound Dolev-Yao Style Security Proof of the Otway-Rees Protocol.",
                    "A Formalization of Anonymity and Onion Routing.",
                    "Breaking Cauchy Model-Based JPEG Steganography with First Order Statistics.",
                    "Comparison Between Two Practical Mix Designs.",
                    "Signature Bouquets: Immutability for Aggregated/Condensed Signatures.",
                    "Towards a Theory of Data Entanglement: (Extended Abstract).",
                    "Portable and Flexible Document Access Control Mechanisms.",
                    "Possibilistic Information Flow Control in the Presence of Encrypted Communication.",
                    "Information Flow Control Revisited: Noninfluence = Noninterference + Nonleakage.",
                    "Security Property Based Administrative Controls.",
                    "A Vector Model of Trust for Developing Trustworthy Systems.",
                    "Parameterized Authentication.",
                    "Combinatorial Design of Key Distribution Mechanisms for Wireless Sensor Networks.",
                    "Hindering Eavesdropping via IPv6 Opportunistic Encryption.",
                    "On the Role of Key Schedules in Attacks on Iterated Ciphers.",
                    "A Public-Key Encryption Scheme with Pseudo-random Ciphertexts.",
                    "A Host Intrusion Prevention System for Windows Operating Systems.",
                    "Re-establishing Trust in Compromised Systems: Recovering from Rootkits That Trojan the System Call Table.",
                    "ARCHERR: Runtime Environment Driven Program Safety.",
                    "Sets, Bags, and Rock and Roll: Analyzing Large Data Sets of Network Data.",
                    "Redundancy and Diversity in Security.",
                    "Discovering Novel Attack Strategies from INFOSEC Alerts."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8th ESORICS 2003",
        "info": "Gjøvik, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2003",
                "sub_name": "Computer Security - ESORICS 2003, 8th European Symposium on Research in Computer Security, Gjøvik, Norway, October 13-15, 2003, Proceedings.",
                "count": 19,
                "papers": [
                    "Signature and Access Control Policies for XML Documents.",
                    "Authorization and Access Control in Adaptive Workflows.",
                    "Flexible Regulation of Distributed Coalitions.",
                    "Initiator-Resilient Universally Composable Key Exchange.",
                    "Multi-round Secure-Light Broadcast Exclusion Protocol with Pre-processing.",
                    "Precisely Answering Multi-dimensional Range Queries without Privacy Breaches.",
                    "Passive Attack Analysis for Connection-Based Anonymity Systems.",
                    "Rapid Mixing and Security of Chaum's Visual Electronic Voting.",
                    "Towards Accountable Management of Privacy and Identity Information.",
                    "A Toolkit for Managing Enterprise Privacy Policies.",
                    "Authenticating Mandatory Access Controls and Preserving Privacy for a High-Assurance Smart Card.",
                    "Hardware Encapsulation of Security Services.",
                    "A Formal Security Model of the Infineon SLE 88 Smart Card Memory Managment.",
                    "Bridging Model-Based and Language-Based Security.",
                    "An On-the-Fly Model-Checker for Security Protocol Analysis.",
                    "Symmetric Authentication within a Simulatable Cryptographic Library.",
                    "An Improved Reference Flow Control Model for Policy-Based Intrusion Detection.",
                    "Visualisation for Intrusion Detection.",
                    "On the Detection of Anomalous System Call Arguments."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "7th ESORICS 2002",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2002",
                "sub_name": "Computer Security - ESORICS 2002, 7th European Symposium on Research in Computer Security, Zurich, Switzerland, October 14-16, 2002, Proceedings.",
                "count": 16,
                "papers": [
                    "Computational Probabilistic Non-interference.",
                    "Bit-Slice Auction Circuit.",
                    "Confidentiality Policies and Their Enforcement for Controlled Query Evaluation.",
                    "Cardinality-Based Inference Control in Sum-Only Data Cubes.",
                    "Outbound Authentication for Programmable Secure Coprocessors.",
                    "Hamming Weight Attacks on Cryptographic Hardware - Breaking Masking Defense.",
                    "A Fully Compliant Research Implementation of the P3P Standard for Privacy Protection: Experiences and Recommendations.",
                    "Authentication for Distributed Web Caches.",
                    "Analysing a Stream Authentication Protocol Using Model Checking.",
                    "Equal To The Task?",
                    "TINMAN: A Resource Bound Security Checking System for Mobile Code.",
                    "Confidentiality-Preserving Refinement is Compositional - Sometimes.",
                    "Formal Security Analysis with Interacting State Machines.",
                    "Decidability of Safety in Graph-Based Models for Access Control.",
                    "Inter-Packet Delay Based Correlation for Tracing Encrypted Connections through Stepping Stones.",
                    "Learning Fingerprints for a Database Intrusion Detection System."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th ESORICS 2000",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/2000",
                "sub_name": "Computer Security - ESORICS 2000, 6th European Symposium on Research in Computer Security, Toulouse, France, October 4-6, 2000, Proceedings.",
                "count": 19,
                "papers": [
                    "Checking Secure Interactions of Smart Card Applets.",
                    "Verification of a Formal Security Model for Multiapplicative Smart Cards.",
                    "How Much Negotiation and Detail Can Users Handle? Experiences with Security Negotiation and the Granularity of Access Control in Communications.",
                    "Secure Anonymous Signature-Based Transactions.",
                    "Metering Schemes for General Access Structures.",
                    "A Typed Access Control Model for CORBA.",
                    "Safety Analysis of the Dynamic-Typed Access Matrix Model.",
                    "A Formal Model for Role-Based Access Control Using Graph Transformation.",
                    "A Formal Semantics for SPKI.",
                    "Formal Verification of Cardholder Registration in SET.",
                    "Automating Data Independence.",
                    "Finding a Connection Chain for Tracing Intruders.",
                    "A Full Bandwidth ATM Firewall.",
                    "Analysing Time Dependent Security Properties in CSP Using PVS.",
                    "Unwinding Possibilistic Security Properties.",
                    "Authentication and Confidentiality via IPSEC.",
                    "A Security Framework for a Mobile Agent System.",
                    "A Distributed Access Control Model for Java.",
                    "Using Reflection as a Mechanism for Enforcing Security Policies in Mobile Code."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th ESORICS 1998",
        "info": "Louvain-la-Neuve, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/1998",
                "sub_name": "Computer Security - ESORICS 98, 5th European Symposium on Research in Computer Security, Louvain-la-Neuve, Belgium, September 16-18, 1998, Proceedings.",
                "count": 24,
                "papers": [
                    "Fixed vs. Variable-Length Patterns for Detecting Suspicious Process Behavior.",
                    "A Tool for Pro-active Defense Against the Buffer Overrun Attack.",
                    "A Kernelized Architecture for Multilevel Secure Application Policies.",
                    "Dealing with Multi-policy Security in Large Open Distributed Systems.",
                    "A Flexible Method for Information System Security Policy Specification.",
                    "On the Security of Some Variants of the RSA Signature Scheme.",
                    "Side Channel Cryptanalysis of Product Ciphers.",
                    "On the Security of Digital Tachographs.",
                    "An Authorization Model and Its Formal Semantics.",
                    "Authorization in CORBA Security.",
                    "Rules for Designing Multilevel Object-Oriented Databases.",
                    "Byte Code Verification for Java Smart Card Based on Model Checking.",
                    "Towards Formalizing the Java Security Architecture of JDK 1.2.",
                    "EUROMED-JAVA: Trusted Third Party Services for Securing Medical Java Applets.",
                    "MPEG PTY-Marks: Cheap Detection of Embedded Copyright Data in DVD-Video.",
                    "DHWM: A Scheme for Managing Watermarking Keys in the Aquarelle Multimedia Distributed System.",
                    "The \"Ticket\" Concept for Copy Control Based on Embedded Signalling.",
                    "Panel Session: Watermarking.",
                    "Authentication and Payment in Future Mobile Systems.",
                    "Distributed Temporary Pseudonyms: A New Approach for Protecting Location Information in Mobile Communication Networks.",
                    "A Mix-Mediated Anonymity Service and Its Payment.",
                    "A Subjective Metric of Authentication.",
                    "A Sound Logic for Analysing Electronic Commerce Protocols.",
                    "Kerberos Version 4: Inductive Analysis of the Secrecy Goals."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th ESORICS 1996",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/1996",
                "sub_name": "Computer Security - ESORICS 96, 4th European Symposium on Research in Computer Security, Rome, Italy, September 25-27, 1996, Proceedings.",
                "count": 23,
                "papers": [
                    "Development of a Secure Electronic Marketplace for Europe.",
                    "Light-Weight Micro-cash Payment for the Internet.",
                    "Digital Payment Systems with Passive Anonymity-Revoking Trustees.",
                    "An Authorization Model for Workflows.",
                    "Role Hierarchies and Constraints for Lattice-Based Access Controls.",
                    "A Multilevel Security Model for Distributed Object Systems.",
                    "An Authorization Model for Federated Systems.",
                    "Security for Mobile Agents: Authentication and State Appraisal.",
                    "Server-Supported Signatures.",
                    "Limitations of the Approach of Solving a Network's Security Problem with a Firewall.",
                    "Sleepy Network-Layer Authentication Service for IPSEC.",
                    "Certified Electronic Mail.",
                    "Distributed Proctoring.",
                    "Merging Heterogeneous Security Orderings.",
                    "CSP and Anonymity.",
                    "Formal Semantics for Authentication Logics.",
                    "Threat Scenarios as a Means to Formally Develop Secure Systems.",
                    "The Impact of Multilevel Security on Database Buffer Management.",
                    "Enhancing the Controlled Disclosure of Sensitive Information.",
                    "Secure Concurrency Control in MLS Databases with Two Versions of Data.",
                    "Authors' Rights and Copyright Protection.",
                    "Modelling a Public-Key Infrastructure.",
                    "Analyzing the Needham-Schroeder Public-Key Protocol: A Comparison of Two Approaches."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "3rd ESORICS 1994",
        "info": "Brighton, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/1994",
                "sub_name": "Computer Security - ESORICS 94, Third European Symposium on Research in Computer Security, Brighton, UK, November 7-9, 1994, Proceedings.",
                "count": 26,
                "papers": [
                    "Valuation of Trust in Open Networks.",
                    "Security Versus Performance Requirements in Data Communications Systems.",
                    "Non-Interference Through Determinism.",
                    "Compile-Time Detection of Information Flow in Sequential Programs.",
                    "Security Through Type Analysis.",
                    "Designing Secure Key Exchange Protocols.",
                    "Robust and Secure Password and Key Change Method.",
                    "Beacon Based Authentication.",
                    "Authentication via Multi-Service Tickets in the Kuperee Server.",
                    "Oblivious Signatures.",
                    "A Calculus for Secure Channel Establishment in Open Networks.",
                    "On Strengthening Authentication Protocols to Foil Cryptanalysis.",
                    "An Efficient Electronic Payment System Protecting Privacy.",
                    "The ESPRIT Project CAFE - High Security Digital Payment Systems.",
                    "Liability and Computer Security: Nine Principles.",
                    "Implementing Secure Dependencies over a Network by Designing a Distributed Security SubSystem.",
                    "A Secure Medium Access Control Protocol: Security vs Performances.",
                    "Distributed File System over a Multilevel Secure Architecture - Problems and Solutions.",
                    "On the Expressive Power of the Unary Transformation Model.",
                    "Privilege Graph: an Extension to the Typed Access Matrix Model.",
                    "A Consideration of the Modes of Operation for Secure Systems.",
                    "Mark-and-Sweep Garbage Collection in Multilevel Secure Object-Oriented Database Systems.",
                    "Decomposition of Multilevel Objects in an Object-Oriented Database.",
                    "Supporting Object-Based High-Assurance Write-up in Multilevel Databases for the Replicated Architecture.",
                    "Aggregation in Relational Databases: Controlled Disclosure of Sensitive Information.",
                    "Information Flow Controls vs Interference Controls: An Integrated Approach."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "2nd ESORICS 1992",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/1992",
                "sub_name": "Computer Security - ESORICS 92, Second European Symposium on Research in Computer Security, Toulouse, France, November 23-25, 1992, Proceedings.",
                "count": 24,
                "papers": [
                    "Towards Security in an Open Systems Federation.",
                    "Type-Level Access Controls for Distributed Structurally Object-Oriented Database Systems.",
                    "On the Chinese Wall Model.",
                    "Formal Methods and Automated Tool for Timing-Channel Identification in TCB Source Code.",
                    "Separating the Specification and Implementation Phases in Cryptology.",
                    "Formal Specification of Security Requirements using the Theory of Normative Positions.",
                    "Breaking the Traditional Computer Security Barriers.",
                    "Verification and Modelling of Authentication Protocols.",
                    "KryptoKnight Authentication and Key Distribution System.",
                    "Associating Metrics to Certification Paths.",
                    "An Object-Oriented View of Fragmented Data Processing for Fault and Intrusion Tolerance in Distributed Systems.",
                    "The Development and Testing of the Identity-Based Conference Key Distribution System for the RHODOS Distributed System.",
                    "Policy Enforcement in Stub Autonomous Domains.",
                    "Freshness Assurance of Authentication Protocols.",
                    "A Formal Framework for Authentication.",
                    "Timely Authentication in Distributed Systems.",
                    "Polyinstantation for Cover Stories.",
                    "On Transaction Processing for Multilevel Secure Replicated Databases.",
                    "Security Constraint Processing in Multilevel Secure AMAC Schemata.",
                    "M2S: A Machine for Multilevel Security.",
                    "GDoM: a Multilevel Document Manager.",
                    "UEPS - A Second Generation Electronic Wallet.",
                    "A Hardware Design Model for Cryptographic Algorithms.",
                    "ASAX: Software Architecture and Rule-Based Language for Universal Audit Trail Analysis."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "1st ESORICS 1990",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esorics/1990",
                "sub_name": "ESORICS 90 - First European Symposium on Research in Computer Security, October 24-26, 1990, Toulouse, France.",
                "count": 24,
                "papers": [
                    "The SeaView Secure Database System: A Progress Report.",
                    "Relational Database Granularity.",
                    "Group-Oriented Discretionary Access Controls for Distributed Structurally Object-Oriented Database Systems.",
                    "A General Framework for Database Security.",
                    "A General Mechanism for Access Control: Its Relationship to Secure System Concepts.",
                    "An Object-Oriented Architecture to Support System Reliability and Security.",
                    "Security Kernel Design and Implementation in the IBM PC Environment.",
                    "Authentication and Access Control in a Distributed System.",
                    "A Security Reclassifier for a Local Area Network.",
                    "An Intrusion-Tolerant Security Server for an Open Distributed System.",
                    "An Architecture for a Trusted Network.",
                    "Using Deducibility in Secure Network Modelling.",
                    "CHIMÆRA: A Network Security Model.",
                    "An Epistemic and Deontic Logic for Reasoning about Computer Security.",
                    "A Calculus of Information Flow.",
                    "Better Login Protocols for Computer Networks.",
                    "An Identity-Based Scheme Providing Zero-Knowledge Authentication and Authenticated Key Exchange.",
                    "Pseudorandom Permutations Based on the D.E.S. Scheme.",
                    "Towards an Object Oriented Development Environment for Secure Applications.",
                    "A Case Study in the Formal Refinement of a Distributed Secure System.",
                    "Epistemic Verification of Cryptographic Protocols.",
                    "Methodology \"Minerve Security\" - Evaluation Process of Software Security.",
                    "Managing Computer Security: How Can Research Help?",
                    "Harmonised Criteria for the Security Evaluation of IT Systems and Products."
                ]
            }
        ]
    }
]