[
	{
		"year": "2021",
		"name": "EUROCRYPT 2021",
		"info": "Zagreb, Croatia",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2021-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2021 - 40th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, October 17-21, 2021, Proceedings, Part I.",
				"count": 28,
				"papers": [
					"Non-interactive Zero Knowledge from Sub-exponential DDH.",
					"On the (in)security of ROS.",
					"New Representations of the AES Key Schedule.",
					"Analysing the HPKE Standard.",
					"Tightly-Secure Authenticated Key Exchange, Revisited.",
					"Aggregatable Distributed Key Generation.",
					"Decentralized Multi-authority ABE for DNFs from LWE.",
					"Compact, Efficient and UC-Secure Isogeny-Based Oblivious Transfer.",
					"One-Way Functions and Malleability Oracles: Hidden Shift Attacks on Isogeny-Based Protocols.",
					"Sieving for Twin Smooth Integers with Solutions to the Prouhet-Tarry-Escott Problem.",
					"Delay Encryption.",
					"The Nested Subset Differential Attack - A Practical Direct Attack Against LUOV Which Forges a Signature Within 210 Minutes.",
					"Improved Cryptanalysis of UOV and Rainbow.",
					"Cryptanalytic Applications of the Polynomial Method for Solving Multivariate Equation Systems over GF(2).",
					"Round-Optimal Blind Signatures in the Plain Model from Classical and Quantum Standard Assumptions.",
					"Post-Quantum Multi-Party Computation.",
					"A 2n/2-Time Algorithm for $\\sqrt{n}$-SVP and $\\sqrt{n}$-Hermite SVP, and an Improved Time-Approximation Tradeoff for (H)SVP.",
					"New Lattice Two-Stage Sampling Technique and Its Applications to Functional Encryption - Stronger Security and Smaller Ciphertexts.",
					"On Bounded Distance Decoding with Predicate: Breaking the \"Lattice Barrier\" for the Hidden Number Problem.",
					"On the Ideal Shortest Vector Problem over Random Rational Primes.",
					"Efficient Bootstrapping for Approximate Homomorphic Encryption with Non-sparse Keys.",
					"High-Precision Bootstrapping of RNS-CKKS Homomorphic Encryption Using Optimal Minimax Polynomial Approximation and Inverse Sine Function.",
					"On the Security of Homomorphic Encryption on Approximate Numbers.",
					"The Rise of Paillier: Homomorphic Secret Sharing and Public-Key Silent OT.",
					"Improved Linear Approximations to ARX Ciphers and Attacks Against ChaCha.",
					"Rotational Cryptanalysis from a Differential-Linear Perspective - Practical Distinguishers for Round-Reduced FRIET, Xoodoo, and Alzette.",
					"Automatic Search of Meet-in-the-Middle Preimage Attacks on AES-like Hashing.",
					"A Deeper Look at Machine Learning-Based Cryptanalysis."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2021-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2021 - 40th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, October 17-21, 2021, Proceedings, Part II.",
				"count": 31,
				"papers": [
					"Ciminion: Symmetric Encryption Based on Toffoli-Gates over Large Finite Fields.",
					"Mind the Middle Layer: The HADES Design Strategy Revisited.",
					"Password Hashing and Preprocessing.",
					"Compactness of Hashing Modes and Efficiency Beyond Merkle Tree.",
					"Three Third Generation Attacks on the Format Preserving Encryption Scheme FF3.",
					"Cryptanalysis of the GPRS Encryption Algorithms GEA-1 and GEA-2.",
					"Pre-computation Scheme of Window τNAF for Koblitz Curves Revisited.",
					"Dummy Shuffling Against Algebraic Attacks in White-Box Implementations.",
					"Advanced Lattice Sieving on GPUs, with Tensor Cores.",
					"Fast Verification of Masking Schemes in Characteristic Two.",
					"On the Power of Expansion: More Efficient Constructions in the Random Probing Model.",
					"Leakage-Resilience of the Shamir Secret-Sharing Scheme Against Physical-Bit Leakages.",
					"Leakage Resilient Value Comparison with Application to Message Authentication.",
					"The Mother of All Leakages: How to Simulate Noisy Leakages via Bounded Leakage (Almost) for Free.",
					"Message-Recovery Laser Fault Injection Attack on the Classic McEliece Cryptosystem.",
					"Multi-source Non-malleable Extractors and Applications.",
					"Secure Software Leasing.",
					"Oblivious Transfer Is in MiniQCrypt.",
					"Security Analysis of Quantum Lightning.",
					"Classical vs Quantum Random Oracles.",
					"On the Compressed-Oracle Technique, and Post-Quantum Security of Proofs of Sequential Work.",
					"Classical Proofs of Quantum Knowledge.",
					"Order-C Secure Multiparty Computation for Highly Repetitive Circuits.",
					"The More the Merrier: Reducing the Cost of Large Scale MPC.",
					"Multiparty Reusable Non-interactive Secure Computation from LWE.",
					"Unbounded Multi-party Computation from Learning with Errors.",
					"Generic Compiler for Publicly Verifiable Covert Multi-Party Computation.",
					"Constant-Overhead Unconditionally Secure Multiparty Computation Over Binary Fields.",
					"Breaking the Circuit Size Barrier for Secure Computation Under Quasi-Polynomial LPN.",
					"Function Secret Sharing for Mixed-Mode and Fixed-Point Secure Computation.",
					"VOLE-PSI: Fast OPRF and Circuit-PSI from Vector-OLE."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2021-3",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2021 - 40th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, October 17-21, 2021, Proceedings, Part III.",
				"count": 19,
				"papers": [
					"sf LogStack: Stacked Garbling with O(b log b) Computation.",
					"Large Scale, Actively Secure Computation from LPN and Free-XOR Garbled Circuits.",
					"Threshold Garbled Circuits and Ad Hoc Secure Computation.",
					"Indistinguishability Obfuscation from Simple-to-State Hard Problems: New Assumptions, New Techniques, and Simplification.",
					"Candidate Obfuscation via Oblivious LWE Sampling.",
					"Black-Box Non-interactive Non-malleable Commitments.",
					"Non-interactive Distributional Indistinguishability (NIDI) and Non-malleable Commitments.",
					"Public-Coin Statistical Zero-Knowledge Batch Verification Against Malicious Verifiers.",
					"Efficient Range Proofs with Transparent Setup from Bounded Integer Commitments.",
					"Towards Accountability in CRS Generation.",
					"Robust Property-Preserving Hash Functions for Hamming Distance and More.",
					"Alibi: A Flaw in Cuckoo-Hashing Based Hierarchical ORAM Schemes and a Solution.",
					"Structured Encryption and Dynamic Leakage Suppression.",
					"Dynamic Ad Hoc Clock Synchronization.",
					"TARDIS: A Foundation of Time-Lock Puzzles in UC.",
					"On the Power of Multiple Anonymous Messages: Frequency Estimation and Selection in the Shuffle Model of Differential Privacy.",
					"Non-Interactive Anonymous Router.",
					"Bifurcated Signatures: Folding the Accountability vs. Anonymity Dilemma into a Single Private Signing Scheme.",
					"Abuse Resistant Law Enforcement Access Systems."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "EUROCRYPT 2020",
		"info": "Zagreb, Croatia",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2020-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2020 - 39th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, May 10-14, 2020, Proceedings, Part I.",
				"count": 27,
				"papers": [
					"Mathematics and Cryptography: A Marriage of Convenience? - Invited Talk.",
					"Optimal Broadcast Encryption from Pairings and LWE.",
					"Private Information Retrieval with Sublinear Online Time.",
					"Candidate iO from Homomorphic Encryption Schemes.",
					"Indistinguishability Obfuscation Without Maps: Attacks and Fixes for Noisy Linear FE.",
					"Combiners for Functional Encryption, Unconditionally.",
					"Impossibility Results for Lattice-Based Functional Encryption Schemes.",
					"Mind the Composition: Birthday Bound Attacks on EWCDMD and SoKAC21.",
					"Improving Key-Recovery in Linear Attacks: Application to 28-Round PRESENT.",
					"New Slide Attacks on Almost Self-similar Ciphers.",
					"The Retracing Boomerang Attack.",
					"Extracting Randomness from Extractor-Dependent Sources.",
					"How to Extract Useful Randomness from Unreliable Sources.",
					"Low Error Efficient Computational Extractors in the CRS Model.",
					"Tight Time-Space Lower Bounds for Finding Multiple Collision Pairs and Their Applications.",
					"Tight Security Bounds for Double-Block Hash-then-Sum MACs.",
					"Modeling for Three-Subset Division Property Without Unknown Subset - Improved Cube Attacks Against Trivium and Grain-128AEAD.",
					"Blackbox Secret Sharing Revisited: A Coding-Theoretic Approach with Application to Expansionless Near-Threshold Schemes.",
					"Evolving Ramp Secret Sharing with a Small Gap.",
					"Lower Bounds for Leakage-Resilient Secret Sharing.",
					"Friet: An Authenticated Encryption Scheme with Built-in Fault Detection.",
					"Fault Template Attacks on Block Ciphers Exploiting Fault Propagation.",
					"Security of Hedged Fiat-Shamir Signatures Under Fault Attacks.",
					"Transparent SNARKs from DARK Compilers.",
					"SPARKs: Succinct Parallelizable Arguments of Knowledge.",
					"Marlin: Preprocessing zkSNARKs with Universal and Updatable SRS.",
					"Fractal: Post-quantum and Transparent Recursive Proofs from Holography."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2020-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2020 - 39th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, May 10-14, 2020, Proceedings, Part II.",
				"count": 28,
				"papers": [
					"Separate Your Domains: NIST PQC KEMs, Oracle Cloning and Read-Only Indifferentiability.",
					"On the Memory-Tightness of Hashed ElGamal.",
					"Blind Schnorr Signatures and Signed ElGamal Encryption in the Algebraic Group Model.",
					"On Instantiating the Algebraic Group Model from Falsifiable Assumptions.",
					"Resource-Restricted Cryptography: Revisiting MPC Bounds in the Proof-of-Work Era.",
					"Efficient Constructions for Almost-Everywhere Secure Computation.",
					"The Price of Active Security in Cryptographic Protocols.",
					"Succinct Non-interactive Secure Computation.",
					"Finding Hash Collisions with Quantum Computers by Using Differential Trails with Smaller Probability than Birthday Bound.",
					"Implementing Grover Oracles for Quantum Key Search on AES and LowMC.",
					"Optimal Merging in Quantum k-xor and k-xor-sum Algorithms.",
					"On the Quantum Complexity of the Continuous Hidden Subgroup Problem.",
					"Formalizing Data Deletion in the Context of the Right to Be Forgotten.",
					"OptORAMa: Optimal Oblivious RAM.",
					"On the Streaming Indistinguishability of a Random Permutation and a Random Function.",
					"He Gives C-Sieves on the CSIDH.",
					"Quantum Security Analysis of CSIDH.",
					"Rational Isogenies from Irrational Endomorphisms.",
					"Hardness of LWE on General Entropic Distributions.",
					"Key-Homomorphic Pseudorandom Functions from LWE with Small Modulus.",
					"Integral Matrix Gram Root and Lattice Gaussian Sampling Without Floats.",
					"TNT: How to Tweak a Block Cipher.",
					"On a Generalization of Substitution-Permutation Networks: The HADES Design Strategy.",
					"Lightweight Authenticated Encryption Mode Suitable for Threshold Implementation.",
					"PSI from PaXoS: Fast, Malicious Private Set Intersection.",
					"Two-Round Oblivious Transfer from CDH or LPN.",
					"Private Aggregation from Fewer Anonymous Messages.",
					"Broadcast-Optimal Two-Round MPC."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2020-3",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2020 - 39th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Zagreb, Croatia, May 10-14, 2020, Proceedings, Part III.",
				"count": 27,
				"papers": [
					"(One) Failure Is Not an Option: Bootstrapping the Search for Failures in Lattice-Based Encryption Schemes.",
					"Key Recovery from Gram-Schmidt Norm Leakage in Hash-and-Sign Signatures over NTRU Lattices.",
					"An Algebraic Attack on Rank Metric Code-Based Cryptosystems.",
					"Low Weight Discrete Logarithm and Subset Sum in 20.65n with Polynomial Memory.",
					"Continuous Verifiable Delay Functions.",
					"Generic-Group Delay Functions Require Hidden-Order Groups.",
					"Sigma Protocols for MQ, PKP and SIS, and Fishy Signature Schemes.",
					"Signatures from Sequential-OR Proofs.",
					"Compact Adaptively Secure ABE from k-Lin: Beyond NC1 and Towards NL.",
					"Adaptively Secure ABE for DFA from k-Lin and More.",
					"Tornado: Automatic Generation of Probing-Secure Masked Bitsliced Implementations.",
					"Side-Channel Masking with Pseudo-Random Generator.",
					"Compact NIZKs from Standard Assumptions on Bilinear Maps.",
					"New Constructions of Statistical NIZKs: Dual-Mode DV-NIZKs and More.",
					"Non-interactive Zero-Knowledge in Pairing-Free Groups from Weaker Assumptions.",
					"Everybody's a Target: Scalability in Public-Key Encryption.",
					"Security Under Message-Derived Keys: Signcryption in iMessage.",
					"Double-Base Chains for Scalar Multiplications on Elliptic Curves.",
					"Stacked Garbling for Disjunctive Zero-Knowledge Proofs.",
					"Which Languages Have 4-Round Fully Black-Box Zero-Knowledge Arguments from One-Way Functions?",
					"Statistical ZAPR Arguments from Bilinear Maps.",
					"Statistical ZAP Arguments.",
					"Statistical Zaps and New Oblivious Transfer Protocols.",
					"Measure-Rewind-Measure: Tighter Quantum Random Oracle Model Proofs for One-Way to Hiding and CCA Security.",
					"Secure Multi-party Quantum Computation with a Dishonest Majority.",
					"Efficient Simulation of Random States and Random Unitaries.",
					"Quantum-Access-Secure Message Authentication via Blind-Unforgeability."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "EUROCRYPT 2019",
		"info": "Darmstadt, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2019-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2019 - 38th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Darmstadt, Germany, May 19-23, 2019, Proceedings, Part I.",
				"count": 24,
				"papers": [
					"Compact Adaptively Secure ABE for \\mathsf NC^1 from k-Lin.",
					"Unbounded Dynamic Predicate Compositions in Attribute-Based Encryption.",
					"(R)CCA Secure Updatable Encryption with Integrity Protection.",
					"Aurora: Transparent Succinct Arguments for R1CS.",
					"The Double Ratchet: Security Notions, Proofs, and Modularization for the Signal Protocol.",
					"Efficient Ratcheting: Almost-Optimal Guarantees for Secure Messaging.",
					"Indistinguishability Obfuscation Without Multilinear Maps: New Methods for Bootstrapping and Instantiation.",
					"Sum-of-Squares Meets Program Obfuscation, Revisited.",
					"How to Leverage Hardness of Constant-Degree Expanding Polynomials over \\mathbb R R to build i풪 i O.",
					"XOR-Counts and Lightweight Multiplication with Fixed Elements in Binary Finite Fields.",
					"DLCT: A New Tool for Differential-Linear Cryptanalysis.",
					"Linear Equivalence of Block Ciphers with Partial Non-Linear Layers: Application to LowMC.",
					"Distributed Differential Privacy via Shuffling.",
					"Lower Bounds for Differentially Private RAMs.",
					"Beyond Birthday Bound Secure MAC in Faulty Nonce Model.",
					"Tight Time-Memory Trade-Offs for Symmetric Encryption.",
					"Non-Malleable Codes Against Bounded Polynomial Time Tampering.",
					"Continuous Non-Malleable Codes in the 8-Split-State Model.",
					"Correlated-Source Extractors and Cryptography with Correlated-Random Tapes.",
					"Revisiting Non-Malleable Secret Sharing.",
					"Multi-party Virtual State Channels.",
					"Aggregate Cash Systems: A Cryptographic Investigation of Mimblewimble.",
					"Proof-of-Stake Protocols for Privacy-Aware Blockchains.",
					"Consensus Through Herding."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2019-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2019 - 38th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Darmstadt, Germany, May 19-23, 2019, Proceedings, Part II.",
				"count": 26,
				"papers": [
					"Homomorphic Secret Sharing from Lattices Without FHE.",
					"Improved Bootstrapping for Approximate Homomorphic Encryption.",
					"Minicrypt Primitives with Algebraic Structure and Applications.",
					"Attacks only Get Better: How to Break FF3 on Large Domains.",
					"Session Resumption Protocols and Efficient Forward Security for TLS 1.3 0-RTT.",
					"An Analysis of NIST SP 800-90A.",
					"Computationally Volume-Hiding Structured Encryption.",
					"Locality-Preserving Oblivious RAM.",
					"Private Anonymous Data Access.",
					"Reversible Proofs of Sequential Work.",
					"Incremental Proofs of Sequential Work.",
					"Tight Proofs of Space and Replication.",
					"Founding Secure Computation on Blockchains.",
					"Uncovering Algebraic Structures in the MPC Landscape.",
					"Quantum Circuits for the CSIDH: Optimizing Quantum Evaluation of Isogenies.",
					"A Quantum-Proof Non-malleable Extractor - With Application to Privacy Amplification Against Active Quantum Adversaries.",
					"A Note on the Communication Complexity of Multiparty Computation in the Correlated Randomness Model.",
					"Degree 2 is Complete for the Round-Complexity of Malicious MPC.",
					"Two Round Information-Theoretic MPC with Malicious Security.",
					"Designated-Verifier Pseudorandom Generators, and Their Applications.",
					"Reusable Designated-Verifier NIZKs for all NP from CDH.",
					"Designated Verifier/Prover and Preprocessing NIZKs from Diffie-Hellman Assumptions.",
					"Building an Efficient Lattice Gadget Toolkit: Subgaussian Sampling and More.",
					"Approx-SVP in Ideal Lattices with Pre-processing.",
					"The General Sieve Kernel and New Records in Lattice Reduction.",
					"Misuse Attacks on Post-quantum Cryptosystems."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2019-3",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2019 - 38th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Darmstadt, Germany, May 19-23, 2019, Proceedings, Part III.",
				"count": 26,
				"papers": [
					"On ELFs, Deterministic Encryption, and Correlated-Input Security.",
					"New Techniques for Efficient Trapdoor Functions and Applications.",
					"Symbolic Encryption with Pseudorandom Keys.",
					"Covert Security with Public Verifiability: Faster, Leaner, and Simpler.",
					"Efficient Circuit-Based PSI with Linear Communication.",
					"An Algebraic Approach to Maliciously Secure Private Set Intersection.",
					"On Finding Quantum Multi-collisions.",
					"On Quantum Advantage in Information Theoretic Single-Server PIR.",
					"Verifier-on-a-Leash: New Schemes for Verifiable Delegated Quantum Computation, with Quasilinear Resources.",
					"Ring Signatures: Logarithmic-Size, No Setup - from Standard Assumptions.",
					"Group Signatures Without NIZK: From Lattices in the Standard Model.",
					"A Modular Treatment of Blind Signatures from Identification Schemes.",
					"Efficient Verifiable Delay Functions.",
					"Quantum Lightning Never Strikes the Same State Twice.",
					"Secret-Sharing Schemes for General and Uniform Access Structures.",
					"Towards Optimal Robust Secret Sharing with Security Against a Rushing Adversary.",
					"Simple Schemes in the Bounded Storage Model.",
					"From Collisions to Chosen-Prefix Collisions Application to Full SHA-1.",
					"Preimage Attacks on Round-Reduced Keccak-224/256 via an Allocating Approach.",
					"bison Instantiating the Whitened Swap-Or-Not Construction.",
					"Worst-Case Hardness for LPN and Cryptographic Hashing via Code Smoothing.",
					"New Techniques for Obfuscating Conjunctions.",
					"Distributional Collision Resistance Beyond One-Way Functions.",
					"Multi-target Attacks on the Picnic Signature Scheme and Related Protocols.",
					"Durandal: A Rank Metric Based Signature Scheme.",
					"SeaSign: Compact Isogeny Signatures from Class Group Actions."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "EUROCRYPT 2018",
		"info": "Tel Aviv, Israel",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2018-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2018 - 37th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Tel Aviv, Israel, April 29 - May 3, 2018 Proceedings, Part I.",
				"count": 22,
				"papers": [
					"On the Bit Security of Cryptographic Primitives.",
					"On the Gold Standard for Security of Universal Steganography.",
					"Memory Lower Bounds of Reductions Revisited.",
					"Fiat-Shamir and Correlation Intractability from Strong KDM-Secure Encryption.",
					"Shortest Vector from Lattice Sieving: A Few Dimensions for Free.",
					"On the Ring-LWE and Polynomial-LWE Problems.",
					"Faster Gaussian Sampling for Trapdoor Lattices with Arbitrary Modulus.",
					"Short, Invertible Elements in Partially Splitting Cyclotomic Rings and Applications to Lattice-Based Zero-Knowledge Proofs.",
					"Random Oracles and Non-uniformity.",
					"Another Step Towards Realizing Random Oracles: Non-malleable Point Obfuscation.",
					"The Wonderful World of Global Random Oracles.",
					"Homomorphic Lower Digits Removal and Improved FHE Bootstrapping.",
					"Homomorphic SIM ^2 D Operations: Single Instruction Much More Data.",
					"Bootstrapping for Approximate Homomorphic Encryption.",
					"Full Indifferentiable Security of the Xor of Two or More Random Permutations Using the \\chi ^2 Method.",
					"An Improved Affine Equivalence Algorithm for Random Permutations.",
					"Optimal Forgeries Against Polynomial-Based MACs and GCM.",
					"Revisiting AES-GCM-SIV: Multi-user Security, Faster Key Derivation, and Better Bounds.",
					"Unbounded ABE via Bilinear Entropy Expansion, Revisited.",
					"Anonymous IBE, Leakage Resilience and Circular Security from New Assumptions.",
					"Towards Breaking the Exponential Barrier for General Secret Sharing.",
					"Improving the Linear Programming Technique in the Search for Lower Bounds in Secret Sharing."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2018-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2018 - 37th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Tel Aviv, Israel, April 29 - May 3, 2018 Proceedings, Part II.",
				"count": 25,
				"papers": [
					"Thunderella: Blockchains with Optimistic Instant Confirmation.",
					"But Why Does It Work? A Rational Protocol Design Treatment of Bitcoin.",
					"Ouroboros Praos: An Adaptively-Secure, Semi-synchronous Proof-of-Stake Blockchain.",
					"Sustained Space Complexity.",
					"Multi-Collision Resistant Hash Functions and Their Applications.",
					"Collision Resistant Hashing for Paranoids: Dealing with Multiple Collisions.",
					"Synchronized Aggregate Signatures from the RSA Assumption.",
					"More Efficient (Almost) Tightly Secure Structure-Preserving Signatures.",
					"The Communication Complexity of Private Simultaneous Messages, Revisited.",
					"The Complexity of Multiparty PSM Protocols and Related Models.",
					"Formal Verification of Masked Hardware Implementations in the Presence of Glitches.",
					"Masking the GLP Lattice-Based Signature Scheme at Any Order.",
					"Masking Proofs Are Tight and How to Exploit it in Security Evaluations.",
					"The Discrete-Logarithm Problem with Preprocessing.",
					"Simple Proofs of Sequential Work.",
					"Two-Round Multiparty Secure Computation from Minimal Assumptions.",
					"k-Round Multiparty Computation from k-Round Oblivious Transfer via Garbled Interactive Circuits.",
					"Adaptively Secure Garbling with Near Optimal Online Complexity.",
					"A New Approach to Black-Box Concurrent Secure Computation.",
					"Obfustopia Built on Secret-Key Functional Encryption.",
					"Limits on Low-Degree Pseudorandom Generators (Or: Sum-of-Squares Meets Program Obfuscation).",
					"Boomerang Connectivity Table: A New Cryptanalysis Tool.",
					"Correlation Cube Attacks: From Weak-Key Distinguisher to Key Recovery.",
					"The Missing Difference Problem, and Its Applications to Counter Mode Encryption.",
					"Fast Near Collision Attack on the Grain v1 Stream Cipher."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2018-3",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2018 - 37th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Tel Aviv, Israel, April 29 - May 3, 2018 Proceedings, Part III.",
				"count": 22,
				"papers": [
					"On the Existence of Three Round Zero-Knowledge Proofs.",
					"Statistical Witness Indistinguishability (and more) in Two Messages.",
					"An Efficiency-Preserving Transformation from Honest-Verifier Statistical Zero-Knowledge to Statistical Zero-Knowledge.",
					"Efficient Maliciously Secure Multiparty Computation for RAM.",
					"Efficient Circuit-Based PSI via Cuckoo Hashing.",
					"Overdrive: Making SPDZ Great Again.",
					"Efficient Designated-Verifier Non-interactive Zero-Knowledge Proofs of Knowledge.",
					"Quasi-Optimal SNARGs via Linear Multi-Prover Interactive Proofs.",
					"Untagging Tor: A Formal Treatment of Onion Encryption.",
					"Exploring the Boundaries of Topology-Hiding Computation.",
					"Supersingular Isogeny Graphs and Endomorphism Rings: Reductions and Solutions.",
					"On the Complexity of Simulating Auxiliary Input.",
					"Fuzzy Password-Authenticated Key Exchange.",
					"Bloom Filter Encryption and Applications to Efficient Forward-Secret 0-RTT Key Exchange.",
					"OPAQUE: An Asymmetric PAKE Protocol Secure Against Pre-computation Attacks.",
					"Unforgeable Quantum Encryption.",
					"Tightly-Secure Key-Encapsulation Mechanism in the Quantum Random Oracle Model.",
					"A Concrete Treatment of Fiat-Shamir Signatures in the Quantum Random-Oracle Model.",
					"Non-malleable Randomness Encoders and Their Applications.",
					"Non-malleable Codes from Average-Case Hardness: $${\\mathsf {A}}{\\mathsf {C}}^0$$ , Decision Trees, and Streaming Space-Bounded Tampering.",
					"Naor-Reingold Goes Public: The Complexity of Known-Key Security.",
					"Updatable Encryption with Post-Compromise Security."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "EUROCRYPT 2017",
		"info": "Paris, France",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2017-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2017 - 36th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Paris, France, April 30 - May 4, 2017, Proceedings, Part I.",
				"count": 24,
				"papers": [
					"Revisiting Lattice Attacks on Overstretched NTRU Parameters.",
					"Short Generators Without Quantum Computers: The Case of Multiquadratics.",
					"Computing Generator in Cyclotomic Integer Rings - A Subfield Algorithm for the Principal Ideal Problem in L|Δ𝕂|(½) and Application to the Cryptanalysis of a FHE Scheme.",
					"Robust Transforming Combiners from Indistinguishability Obfuscation to Functional Encryption.",
					"From Minicrypt to Obfustopia via Private-Key Functional Encryption.",
					"Projective Arithmetic Functional Encryption and Indistinguishability Obfuscation from Degree-5 Multilinear Maps.",
					"Computation of a 768-Bit Prime Field Discrete Logarithm.",
					"A Kilobit Hidden SNFS Discrete Logarithm Computation.",
					"Improved Private Set Intersection Against Malicious Adversaries.",
					"Formal Abstractions for Attested Execution Secure Processors.",
					"One-Shot Verifiable Encryption from Lattices.",
					"Short Stickelberger Class Relations and Application to Ideal-SVP.",
					"Concurrently Composable Security with Shielded Super-Polynomial Simulators.",
					"Unconditional UC-Secure Computation with (Stronger-Malicious) PUFs.",
					"Private Puncturable PRFs from Standard Lattice Assumptions.",
					"Constraint-Hiding Constrained PRFs for NC1 from LWE.",
					"Amortized Complexity of Zero-Knowledge Proofs Revisited: Achieving Linear Soundness Slack.",
					"Sublinear Zero-Knowledge Arguments for RAM Programs.",
					"Parallel Implementations of Masking Schemes and the Bounded Moment Leakage Model.",
					"How Fast Can Higher-Order Masking Be in Software?",
					"Multi-input Inner-Product Functional Encryption from Pairings.",
					"Simplifying Design and Analysis of Complex Predicate Encryption Schemes.",
					"Twisted μ4-Normal Form for Elliptic Curves.",
					"Efficient Compression of SIDH Public Keys."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2017-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2017 - 36th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Paris, France, April 30 - May 4, 2017, Proceedings, Part II.",
				"count": 22,
				"papers": [
					"On Removing Graded Encodings from Functional Encryption.",
					"Functional Encryption: Deterministic to Randomized Functions from Simple Assumptions.",
					"Random Sampling Revisited: Lattice Enumeration with Discrete Pruning.",
					"On Dual Lattice Attacks Against Small-Secret LWE and Parameter Choices in HElib and SEAL.",
					"Small CRT-Exponent RSA Revisited.",
					"Group-Based Secure Computation: Optimizing Rounds, Communication, and Computation.",
					"On the Exact Round Complexity of Self-composable Two-Party Computation.",
					"High-Throughput Secure Three-Party Computation for Malicious Adversaries and an Honest Majority.",
					"Conditional Cube Attack on Reduced-Round Keccak Sponge Function.",
					"A New Structural-Differential Property of 5-Round AES.",
					"Removing the Strong RSA Assumption from Arguments over the Integers.",
					"Magic Adversaries Versus Individual Reduction: Science Wins Either Way.",
					"The Multi-user Security of Double Encryption.",
					"Public-Seed Pseudorandom Permutations.",
					"Cryptography with Updates.",
					"Fixing Cracks in the Concrete: Random Oracles with Auxiliary Input, Revisited.",
					"Modifying an Enciphering Scheme After Deployment.",
					"Separating Semantic and Circular Security for Symmetric-Key Bit Encryption from the Learning with Errors Assumption.",
					"Toward Fine-Grained Blackbox Separations Between Semantic and Circular-Security Notions.",
					"A Note on Perfect Correctness by Derandomization.",
					"Decentralized Anonymous Micropayments.",
					"Analysis of the Blockchain Protocol in Asynchronous Networks."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2017-3",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2017 - 36th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Paris, France, April 30 - May 4, 2017, Proceedings, Part III.",
				"count": 21,
				"papers": [
					"Depth-Robust Graphs and Their Cumulative Memory Complexity.",
					"Scrypt Is Maximally Memory-Hard.",
					"Quantum-Secure Symmetric-Key Cryptography Based on Hidden Shifts.",
					"Boolean Searchable Symmetric Encryption with Worst-Case Sub-linear Complexity.",
					"Patchable Indistinguishability Obfuscation: iO for Evolving Software.",
					"Breaking the Sub-Exponential Barrier in Obfustopia.",
					"New Impossible Differential Search Tool from Design and Cryptanalysis Aspects - Revealing Structural Properties of Several Ciphers.",
					"New Collision Attacks on Round-Reduced Keccak.",
					"Lattice-Based SNARGs and Their Application to More Efficient Obfuscation.",
					"Cryptanalyses of Candidate Branching Program Obfuscators.",
					"Quantum Authentication and Encryption with Key Recycling - Or: How to Re-use a One-Time Pad Even if P=NP - Safely & Feasibly.",
					"Quantum Authentication with Key Recycling.",
					"Relativistic (or 2-Prover 1-Round) Zero-Knowledge Protocol for \\mathsf NP Secure Against Quantum Adversaries.",
					"Faster Secure Two-Party Computation in the Single-Execution Setting.",
					"Non-interactive Secure 2PC in the Offline/Online and Batch Settings.",
					"Hashing Garbled Circuits for Free.",
					"Adaptive Partitioning.",
					"0-RTT Key Exchange with Full Forward Secrecy.",
					"Computational Integrity with a Public Random String from Quasi-Linear PCPs.",
					"Ad Hoc PSM Protocols: Secure Computation Without Coordination.",
					"Topology-Hiding Computation Beyond Logarithmic Diameter."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "EUROCRYPT 2016",
		"info": "Vienna, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2016-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2016 - 35th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Vienna, Austria, May 8-12, 2016, Proceedings, Part I.",
				"count": 31,
				"papers": [
					"Tightly CCA-Secure Encryption Without Pairings.",
					"Indistinguishability Obfuscation from Constant-Degree Graded Encoding Schemes.",
					"Essentially Optimal Robust Secret Sharing with Maximal Corruptions.",
					"Provably Robust Sponge-Based PRNGs and KDFs.",
					"Reusable Fuzzy Extractors for Low-Entropy Distributions.",
					"Provably Weak Instances of Ring-LWE Revisited.",
					"Faster Algorithms for Solving LPN.",
					"Provable Security Evaluation of Structures Against Impossible Differential and Zero Correlation Linear Cryptanalysis.",
					"Polytopic Cryptanalysis.",
					"From Improved Leakage Detection to the Detection of Points of Interests in Leakage Traces.",
					"Improved Masking for Tweakable Blockciphers with Applications to Authenticated Encryption.",
					"Sanitization of FHE Ciphertexts.",
					"Towards Stream Ciphers for Efficient FHE with Low-Noise Ciphertexts.",
					"Improved Differential-Linear Cryptanalysis of 7-Round Chaskey with Partitioning.",
					"Reverse-Engineering the S-Box of Streebog, Kuznyechik and STRIBOBr1.",
					"Complete Addition Formulas for Prime Order Elliptic Curves.",
					"New Complexity Trade-Offs for the (Multiple) Number Field Sieve Algorithm in Non-Prime Fields.",
					"Freestart Collision for Full SHA-1.",
					"New Attacks on the Concatenation and XOR Hash Combiners.",
					"Cryptanalysis of the New CLT Multilinear Map over the Integers.",
					"Cryptanalysis of GGH Map.",
					"Hash-Function Based PRFs: AMAC and Its Multi-User Security.",
					"On the Influence of Message Length in PMAC's Security Bounds.",
					"Lucky Microseconds: A Timing Attack on Amazon's s2n Implementation of TLS.",
					"An Analysis of OpenSSL's Random Number Generator.",
					"Safely Exporting Keys from Secure Channels - On the Security of EAP-TLS and TLS Key Exporters.",
					"Valiant's Universal Circuit is Practical.",
					"Nonce-Based Cryptography: Retaining Security When Randomness Fails.",
					"Honey Encryption Beyond Message Recovery Security.",
					"Improved Progressive BKZ Algorithms and Their Precise Cost Estimation by Sharp Simulator.",
					"Practical, Predictable Lattice Basis Reduction."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2016-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2016 - 35th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Vienna, Austria, May 8-12, 2016, Proceedings, Part II.",
				"count": 31,
				"papers": [
					"Zero-Knowledge Arguments for Lattice-Based Accumulators: Logarithmic-Size Ring Signatures and Group Signatures Without Trapdoors.",
					"Adaptively Secure Identity-Based Encryption from Lattices with Asymptotically Shorter Public Parameters.",
					"Online/Offline OR Composition of Sigma Protocols.",
					"Constant-Round Leakage-Resilient Zero-Knowledge from Collision Resistance.",
					"Constrained Pseudorandom Functions for Unconstrained Inputs.",
					"Pseudorandom Functions in Almost Constant Depth from Low-Noise LPN.",
					"Secure Computation from Elastic Noisy Channels.",
					"All Complete Functionalities are Reversible.",
					"On the Power of Hierarchical Identity-Based Encryption.",
					"On the Impossibility of Tight Cryptographic Reductions.",
					"On the Size of Pairing-Based Non-interactive Arguments.",
					"Efficient Zero-Knowledge Arguments for Arithmetic Circuits in the Discrete Log Setting.",
					"On the Complexity of Scrypt and Proofs of Space in the Parallel Random Oracle Model.",
					"Anonymous Traitor Tracing: How to Embed Arbitrary Information in a Key.",
					"Unconditionally Secure Computation with Reduced Interaction.",
					"The Exact Round Complexity of Secure Computation.",
					"On the Composition of Two-Prover Commitments, and Applications to Multi-round Relativistic Commitments.",
					"Computationally Binding Quantum Commitments.",
					"Structural Lattice Reduction: Generalized Worst-Case to Average-Case Reductions and Homomorphic Cryptosystems.",
					"Recovering Short Generators of Principal Ideals in Cyclotomic Rings.",
					"Circuit Compilers with O(1/\\log (n)) Leakage Rate.",
					"Randomness Complexity of Private Circuits for Multiplication.",
					"10-Round Feistel is Indifferentiable from an Ideal Cipher.",
					"Indifferentiability of Confusion-Diffusion Networks.",
					"Fair and Robust Multi-party Computation Using a Global Transaction Ledger.",
					"Two Round Multiparty Computation via Multi-key FHE.",
					"Post-zeroizing Obfuscation: New Mathematical Tools, and the Case of Evasive Circuits.",
					"New Negative Results on Differing-Inputs Obfuscation.",
					"Automated Unbounded Analysis of Cryptographic Constructions in the Generic Group Model.",
					"Multi-input Functional Encryption in the Private-Key Setting: Stronger Security from Weaker Assumptions.",
					"Non-malleable Codes for Bounded Depth, Bounded Fan-In Circuits."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "EUROCRYPT 2015",
		"info": "Sofia, Bulgaria",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2015-1",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2015 - 34th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Sofia, Bulgaria, April 26-30, 2015, Proceedings, Part I.",
				"count": 30,
				"papers": [
					"Cryptanalysis of the Multilinear Map over the Integers.",
					"Robust Authenticated-Encryption AEZ and the Problem That It Solves.",
					"On the Behaviors of Affine Equivalent Sboxes Regarding Differential and Linear Attacks.",
					"A Provable-Security Analysis of Intel's Secure Key RNG.",
					"A Formal Treatment of Backdoored Pseudorandom Generators.",
					"Improving NFS for the Discrete Logarithm Problem in Non-prime Finite Fields.",
					"The Multiple Number Field Sieve with Conjugation and Generalized Joux-Lercier Methods.",
					"Better Algorithms for LWE and LWR.",
					"On Computing Nearest Neighbors with Applications to Decoding of Binary Linear Codes.",
					"Cryptanalytic Time-Memory-Data Tradeoffs for FX-Constructions with Applications to PRINCE and PRIDE.",
					"A Generic Approach to Invariant Subspace Attacks: Cryptanalysis of Robin, iSCREAM and Zorro.",
					"Structural Evaluation by Generalized Integral Property.",
					"Cryptanalysis of SP Networks with Partial Non-Linear Layers.",
					"The Sum Can Be Weaker Than Each Part.",
					"SPHINCS: Practical Stateless Hash-Based Signatures.",
					"Making Masking Security Proofs Concrete - Or How to Evaluate the Security of Any Leaking Device.",
					"Ciphers for MPC and FHE.",
					"Verified Proofs of Higher-Order Masking.",
					"Inner Product Masking Revisited.",
					"Fully Homomophic Encryption over the Integers Revisited.",
					"(Batch) Fully Homomorphic Encryption over Integers for Non-Binary Message Spaces.",
					"KDM-CCA Security from RKA Secure Authenticated Encryption.",
					"On the Provable Security of the Iterated Even-Mansour Cipher Against Related-Key and Chosen-Key Attacks.",
					"FHEW: Bootstrapping Homomorphic Encryption in Less Than a Second.",
					"Bootstrapping for HElib.",
					"More Efficient Oblivious Transfer Extensions with Security for Malicious Adversaries.",
					"How to Efficiently Evaluate RAM Programs with Malicious Security.",
					"Cube Attacks and Cube-Attack-Like Cryptanalysis on the Round-Reduced Keccak Sponge Function.",
					"Twisted Polynomials and Forgery Attacks on GCM.",
					"Quadratic Time, Linear Space Algorithms for Gram-Schmidt Orthogonalization and Gaussian Sampling in Structured Lattices."
				]
			},
			{
				"sub_name_abbr": "conf/eurocrypt/2015-2",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2015 - 34th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Sofia, Bulgaria, April 26-30, 2015, Proceedings, Part II.",
				"count": 27,
				"papers": [
					"Universal Signature Aggregators.",
					"Fully Structure-Preserving Signatures and Shrinking Commitments.",
					"Disjunctions for Hash Proof Systems: New Constructions and Applications.",
					"Quasi-Adaptive NIZK for Linear Subspaces Revisited.",
					"Leakage-Resilient Circuits Revisited - Optimal Number of Computing Components Without Leak-Free Hardware.",
					"Noisy Leakage Revisited.",
					"Privacy-Free Garbled Circuits with Applications to Efficient Zero-Knowledge.",
					"Two Halves Make a Whole - Reducing Data Transfer in Garbled Circuits Using Half Gates.",
					"One-Out-of-Many Proofs: Or How to Leak a Secret and Spend a Coin.",
					"The Bitcoin Backbone Protocol: Analysis and Applications.",
					"Linear Secret Sharing Schemes from Error Correcting Codes and Universal Hash Functions.",
					"Function Secret Sharing.",
					"Cluster Computing in Zero Knowledge.",
					"Hosting Services on an Untrusted Cloud.",
					"How to Obfuscate Programs Directly.",
					"End-to-End Verifiable Elections in the Standard Model.",
					"Cryptographic Agents: Towards a Unified Theory of Computing on Encrypted Data.",
					"Executable Proofs, Input-Size Hiding Secure Computation and a New Ideal World.",
					"Semantically Secure Order-Revealing Encryption: Multi-input Functional Encryption Without Obfuscation.",
					"Improved Dual System ABE in Prime-Order Groups via Predicate Encodings.",
					"Resisting Randomness Subversion: Fast Deterministic and Hedged Public-Key Encryption in the Standard Model.",
					"Cryptographic Reverse Firewalls.",
					"Mind the Gap: Modular Machine-Checked Proofs of One-Round Key Exchange Protocols.",
					"Authenticated Key Exchange from Ideal Lattices.",
					"Non-Interactive Zero-Knowledge Proofs in the Quantum Random Oracle Model.",
					"Privacy Amplification in the Isolated Qubits Model.",
					"Generic Hardness of the Multiple Discrete Logarithm Problem."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "EUROCRYPT 2014",
		"info": "Copenhagen, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2014",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2014 - 33rd Annual International Conference on the Theory and Applications of Cryptographic Techniques, Copenhagen, Denmark, May 11-15, 2014. Proceedings.",
				"count": 38,
				"papers": [
					"A Heuristic Quasi-Polynomial Algorithm for Discrete Logarithm in Finite Fields of Small Characteristic.",
					"Polynomial Time Attack on Wild McEliece over Quadratic Extensions.",
					"Symmetrized Summation Polynomials: Using Small Order Torsion Points to Speed Up Elliptic Curve Index Calculus.",
					"Why Proving HIBE Systems Secure Is Difficult.",
					"Identity-Based Encryption Secure against Selective Opening Chosen-Ciphertext Attack.",
					"Key Derivation without Entropy Waste.",
					"Efficient Non-malleable Codes and Key-Derivation for Poly-size Tampering Circuits.",
					"Revocable Quantum Timed-Release Encryption.",
					"Generic Universal Forgery Attack on Iterative Hash-Based MACs.",
					"Links between Truncated Differential and Multidimensional Linear Properties of Block Ciphers and Underlying Attack Complexities.",
					"Faster Compact Diffie-Hellman: Endomorphisms on the x-line.",
					"Replacing a Random Oracle: Full Domain Hash from Indistinguishability Obfuscation.",
					"Protecting Obfuscation against Algebraic Attacks.",
					"GGHLite: More Efficient Multilinear Maps from Ideal Lattices.",
					"Reconsidering Generic Composition.",
					"Parallelizable Rate-1 Authenticated Encryption from Pseudorandom Functions.",
					"Honey Encryption: Security Beyond the Brute-Force Bound.",
					"Sometimes-Recurse Shuffle - Almost-Random Permutations in Logarithmic Expected Time.",
					"Tight Security Bounds for Key-Alternating Ciphers.",
					"The Locality of Searchable Symmetric Encryption.",
					"A Bound for Multiparty Secret Key Agreement and Implications for a Problem of Secure Computing.",
					"Non-Interactive Secure Computation Based on Cut-and-Choose.",
					"Garbled RAM Revisited.",
					"Unifying Leakage Models: From Probing Attacks to Noisy Leakage.",
					"Higher Order Masking of Look-Up Tables.",
					"How to Certify the Leakage of a Chip?",
					"Efficient Round Optimal Blind Signatures.",
					"Key-Versatile Signatures and Applications: RKA, KDM and Joint Enc/Sig.",
					"Non-malleability from Malleability: Simulation-Sound Quasi-Adaptive NIZK Proofs and CCA2-Secure Encryption from Homomorphic Signatures.",
					"Fully Key-Homomorphic Encryption, Arithmetic Circuit ABE and Compact Garbled Circuits.",
					"Dual System Encryption via Doubly Selective Security: Framework, Fully Secure Functional Encryption for Regular Languages, and More.",
					"Multi-input Functional Encryption.",
					"Salvaging Indifferentiability in a Multi-stage Setting.",
					"Déjà Q: Using Dual Systems to Revisit q-Type Assumptions.",
					"Distributed Point Functions and Their Applications.",
					"A Full Characterization of Completeness for Two-Party Randomized Function Evaluation.",
					"On the Complexity of UC Commitments.",
					"Universally Composable Symbolic Analysis for Two-Party Protocols Based on Homomorphic Encryption."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "EUROCRYPT 2013",
		"info": "Athens, Greece",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2013",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2013, 32nd Annual International Conference on the Theory and Applications of Cryptographic Techniques, Athens, Greece, May 26-30, 2013. Proceedings.",
				"count": 42,
				"papers": [
					"Candidate Multilinear Maps from Ideal Lattices.",
					"Lossy Codes and a New Variant of the Learning-With-Errors Problem.",
					"A Toolkit for Ring-LWE Cryptography.",
					"Regularity of Lossy RSA on Subdomains and Its Applications.",
					"Efficient Cryptosystems from 2 k -th Power Residue Symbols.",
					"Deterministic Public-Key Encryption for Adaptively Chosen Plaintext Distributions.",
					"How to Watermark Cryptographic Functions.",
					"Security Evaluations beyond Computing Power.",
					"Masking against Side-Channel Attacks: A Formal Security Proof.",
					"Leakage-Resilient Cryptography from Minimal Assumptions.",
					"Faster Index Calculus for the Medium Prime Case Application to 1175-bit and 1425-bit Finite Fields.",
					"Fast Cryptography in Genus 2.",
					"Graph-Theoretic Algorithms for the \"Isomorphism of Polynomials\" Problem.",
					"Cryptanalysis of Full RIPEMD-128.",
					"New Collision Attacks on SHA-1 Based on Optimal Joint Local-Collision Analysis.",
					"Improving Local Collisions: New Attacks on Reduced SHA-256.",
					"Dynamic Proofs of Retrievability via Oblivious RAM.",
					"Message-Locked Encryption and Secure Deduplication.",
					"Keccak.",
					"Batch Fully Homomorphic Encryption over the Integers.",
					"Practical Homomorphic MACs for Arithmetic Circuits.",
					"Streaming Authenticated Data Structures.",
					"Improved Key Recovery Attacks on Reduced-Round AES in the Single-Key Setting.",
					"New Links between Differential and Linear Cryptanalysis.",
					"Towards Key-Length Extension with Optimal Security: Cascade Encryption and Xor-cascade Encryption.",
					"Ideal-Cipher (Ir)reducibility for Blockcipher-Based Hash Functions.",
					"Limitations of the Meta-reduction Technique: The Case of Schnorr Signatures.",
					"Practical Signatures from Standard Assumptions.",
					"Locally Computable UOWHF with Linear Shrinkage.",
					"Amplification of Chosen-Ciphertext Security.",
					"Circular Chosen-Ciphertext Security with Compact Ciphertexts.",
					"MiniLEGO: Efficient Secure Two-Party Computation from General Assumptions.",
					"How to Hide Circuits in MPC an Efficient Framework for Private Function Evaluation.",
					"Multi-party Computation of Polynomials and Branching Programs without Simultaneous Interaction.",
					"Quantum-Secure Message Authentication Codes.",
					"One-Sided Device-Independent QKD and Position-Based Cryptography from Monogamy Games.",
					"Quadratic Span Programs and Succinct NIZKs without PCPs.",
					"Zero-Knowledge Argument for Polynomial Evaluation with Application to Blacklists.",
					"Resource-Restricted Indifferentiability.",
					"On Concurrently Secure Computation in the Multiple Ideal Query Model.",
					"Universally Composable Secure Computation with (Malicious) Physically Uncloneable Functions.",
					"How to Garble RAM Programs."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "EUROCRYPT 2012",
		"info": "Cambridge, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2012",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2012 - 31st Annual International Conference on the Theory and Applications of Cryptographic Techniques, Cambridge, UK, April 15-19, 2012. Proceedings.",
				"count": 43,
				"papers": [
					"A Tutorial on High Performance Computing Applied to Cryptanalysis - (Invited Talk Abstract).",
					"Another Look at Provable Security.",
					"Cover and Decomposition Index Calculus on Elliptic Curves Made Practical - Application to a Previously Unreachable Curve over $\\mathbb{F}_{p^6}$.",
					"Improving the Complexity of Index Calculus Algorithms in Elliptic Curves over Binary Fields.",
					"Key-Alternating Ciphers in a Provable Setting: Encryption Using a Small Number of Public Permutations - (Extended Abstract).",
					"Efficient and Optimally Secure Key-Length Extension for Block Ciphers via Randomized Cascading.",
					"Fair Computation with Rational Players.",
					"Concurrently Secure Computation in Constant Rounds.",
					"Identity-Based Encryption Resilient to Continual Auxiliary Leakage.",
					"Quantum Proofs of Knowledge.",
					"On Round-Optimal Zero Knowledge in the Bare Public-Key Model.",
					"Robust Coin Flipping.",
					"Unconditionally-Secure Robust Secret Sharing with Compact Shares.",
					"All-But-Many Lossy Trapdoor Functions.",
					"Identity-Based (Lossy) Trapdoor Functions and Applications.",
					"Dual Projective Hashing and Its Applications - Lossy Trapdoor Functions and More.",
					"Efficient Zero-Knowledge Argument for Correctness of a Shuffle.",
					"Malleable Proof Systems and Applications.",
					"Group to Group Commitments Do Not Shrink.",
					"Tools for Simulating Features of Composite Order Bilinear Groups in the Prime Order Setting.",
					"Minimalism in Cryptography: The Even-Mansour Scheme Revisited.",
					"Message Authentication, Revisited.",
					"Property Preserving Symmetric Encryption.",
					"Narrow-Bicliques: Cryptanalysis of Full IDEA.",
					"Cryptanalyses on a Merkle-Damgård Based MAC - Almost Universal Forgery and Distinguishing-H Attacks.",
					"Statistical Tools Flavor Side-Channel Collision Attacks.",
					"Public Key Compression and Modulus Switching for Fully Homomorphic Encryption over the Integers.",
					"Fully Homomorphic Encryption with Polylog Overhead.",
					"Multiparty Computation with Low Communication, Computation and Interaction via Threshold FHE.",
					"Faster Algorithms for Approximate Common Divisors: Breaking Fully-Homomorphic-Encryption Challenges over the Integers.",
					"Decoding Random Binary Linear Codes in 2 n/20: How 1 + 1 = 0 Improves Information Set Decoding.",
					"Optimal Security Proofs for Full Domain Hash, Revisited.",
					"On the Exact Security of Schnorr-Type Signatures in the Random Oracle Model.",
					"Tightly-Secure Signatures from Lossy Identification Schemes.",
					"Adaptively Attribute-Hiding (Hierarchical) Inner Product Encryption.",
					"Scalable Group Signatures with Revocation.",
					"Incremental Deterministic Public-Key Encryption.",
					"Standard Security Does Not Imply Security against Selective-Opening.",
					"Detecting Dangerous Queries: A New Approach for Chosen Ciphertext Security.",
					"Security of Symmetric Encryption in the Presence of Ciphertext Fragmentation.",
					"Trapdoors for Lattices: Simpler, Tighter, Faster, Smaller.",
					"Pseudorandom Functions and Lattices.",
					"Lattice Signatures without Trapdoors."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "EUROCRYPT 2011",
		"info": "Tallinn, Estonia",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2011",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2011 - 30th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Tallinn, Estonia, May 15-19, 2011. Proceedings.",
				"count": 33,
				"papers": [
					"The Arithmetic Codex: Theory and Applications.",
					"Lattice Reduction Algorithms: Theory and Practice.",
					"Efficient Authentication from Hard Learning Problems.",
					"Making NTRU as Secure as Worst-Case Problems over Ideal Lattices.",
					"Faster Explicit Formulas for Computing Pairings over Ordinary Curves.",
					"Pushing the Limits: A Very Compact and a Threshold Implementation of AES.",
					"Fully Leakage-Resilient Signatures.",
					"A Formal Study of Power Variability Issues and Side-Channel Attacks for Nanoscale Devices.",
					"Implementing Gentry's Fully-Homomorphic Encryption Scheme.",
					"Homomorphic Signatures for Polynomial Functions.",
					"Semi-homomorphic Encryption and Multiparty Computation.",
					"Tight Proofs for Signature Schemes without Random Oracles.",
					"Adaptive Pseudo-free Groups and Applications.",
					"Commuting Signatures and Verifiable Encryption.",
					"Secure Authentication from a Weak Key, without Leaking Information.",
					"Secret Keys from Channel Noise.",
					"Almost Optimum t-Cheater Identifiable Secret Sharing Schemes.",
					"On Linear Hulls, Statistical Saturation Attacks, PRESENT and a Cryptanalysis of PUFFIN.",
					"Domain Extension for MACs Beyond the Birthday Barrier.",
					"Statistical Attack on RC4 - Distinguishing WPA.",
					"Improved Generic Algorithms for Hard Knapsacks.",
					"Two-Output Secure Computation with Malicious Adversaries.",
					"Efficient Non-interactive Secure Computation.",
					"Towards a Game Theoretic View of Secure Computation.",
					"Highly-Efficient Universally-Composable Commitments Based on the DDH Assumption.",
					"Concurrent Composition in the Bounded Quantum Storage Model.",
					"Careful with Composition: Limitations of the Indifferentiability Framework.",
					"Efficient Circuit-Size Independent Public Key Encryption with KDM Security.",
					"Key-Dependent Message Security: Generic Amplification and Completeness.",
					"Unbounded HIBE and Attribute-Based Encryption.",
					"Decentralizing Attribute-Based Encryption.",
					"Threshold and Revocation Cryptosystems via Extractable Hash Proofs.",
					"Deniable Encryption with Negligible Detection Probability: An Interactive Construction."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "EUROCRYPT 2010",
		"info": "Monaco / French Riviera",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2010",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2010, 29th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Monaco / French Riviera, May 30 - June 3, 2010. Proceedings.",
				"count": 34,
				"papers": [
					"On Ideal Lattices and Learning with Errors over Rings.",
					"Fully Homomorphic Encryption over the Integers.",
					"Converting Pairing-Based Cryptosystems from Composite-Order Groups to Prime-Order Groups.",
					"Fully Secure Functional Encryption: Attribute-Based Encryption and (Hierarchical) Inner Product Encryption.",
					"Secure Obfuscation for Encrypted Signatures.",
					"Public-Key Encryption in the Bounded-Retrieval Model.",
					"Protecting Circuits from Leakage: the Computationally-Bounded and Noisy Cases.",
					"Partial Fairness in Secure Two-Party Computation.",
					"Secure Message Transmission with Small Public Discussion.",
					"On the Impossibility of Three-Move Blind Signature Schemes.",
					"Efficient Device-Independent Quantum Key Distribution.",
					"New Generic Algorithms for Hard Knapsacks.",
					"Lattice Enumeration Using Extreme Pruning.",
					"Algebraic Cryptanalysis of McEliece Variants with Compact Keys.",
					"Key Recovery Attacks of Practical Complexity on AES-256 Variants with up to 10 Rounds.",
					"Cryptography between Wonderland and Underland.",
					"Automatic Search for Related-Key Differential Characteristics in Byte-Oriented Block Ciphers: Application to AES, Camellia, Khazad and Others.",
					"Plaintext-Dependent Decryption: A Formal Security Treatment of SSH-CTR.",
					"Computational Soundness, Co-induction, and Encryption Cycles.",
					"Encryption Schemes Secure against Chosen-Ciphertext Selective Opening Attacks.",
					"Cryptographic Agility and Its Relation to Circular Encryption.",
					"Bounded Key-Dependent Message Security.",
					"Perfectly Secure Multiparty Computation and the Computational Overhead of Cryptography.",
					"Adaptively Secure Broadcast.",
					"Universally Composable Quantum Multi-party Computation.",
					"A Simple BGN-Type Cryptosystem from LWE.",
					"Bonsai Trees, or How to Delegate a Lattice Basis.",
					"Efficient Lattice (H)IBE in the Standard Model.",
					"Multi-property-preserving Domain Extension Using Polynomial-Based Modes of Operation.",
					"Stam's Collision Resistance Conjecture.",
					"Universal One-Way Hash Functions via Inaccessible Entropy.",
					"Constant-Round Non-malleable Commitments from Sub-exponential One-Way Functions.",
					"Constructing Verifiable Random Functions with Large Input Spaces.",
					"Adaptive Trapdoor Functions and Chosen-Ciphertext Security."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "EUROCRYPT 2009",
		"info": "Cologne, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2009",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2009, 28th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Cologne, Germany, April 26-30, 2009. Proceedings.",
				"count": 34,
				"papers": [
					"Possibility and Impossibility Results for Encryption and Commitment Secure under Selective Opening.",
					"Breaking RSA Generically Is Equivalent to Factoring.",
					"Resettably Secure Computation.",
					"On the Security Loss in Cryptographic Reductions.",
					"On Randomizing Hash Functions to Strengthen the Security of Digital Signatures.",
					"Cryptanalysis of MDC-2.",
					"Cryptanalysis on HMAC/NMAC-MD5 and MD5-MAC.",
					"Finding Preimages in Full MD5 Faster Than Exhaustive Search.",
					"Asymmetric Group Key Agreement.",
					"Adaptive Security in Broadcast Encryption Systems (with Short Ciphertexts).",
					"Traitors Collaborating in Public: Pirates 2.0.",
					"Key Agreement from Close Secrets over Unsecured Channels.",
					"Order-Preserving Symmetric Encryption.",
					"A Double-Piped Mode of Operation for MACs, PRFs and PROs: Security beyond the Birthday Barrier.",
					"On the Security of Cryptosystems with Quadratic Decryption: The Nicest Cryptanalysis.",
					"Cube Attacks on Tweakable Black Box Polynomials.",
					"Smashing SQUASH-0.",
					"Practical Chosen Ciphertext Secure Encryption from Factoring.",
					"Realizing Hash-and-Sign Signatures under Standard Assumptions.",
					"A Public Key Encryption Scheme Secure against Key Dependent Chosen Plaintext and Adaptive Chosen Ciphertext Attacks.",
					"Cryptography without (Hardly Any) Secrets ?",
					"Salvaging Merkle-Damgård for Practical Applications.",
					"On the Security of Padding-Based Encryption Schemes - or - Why We Cannot Prove OAEP Secure in the Standard Model.",
					"Simulation without the Artificial Abort: Simplified Proof and Improved Concrete Security for Waters' IBE Scheme.",
					"On the Portability of Generalized Schnorr Proofs.",
					"A Unified Framework for the Analysis of Side-Channel Key Recovery Attacks.",
					"A Leakage-Resilient Mode of Operation.",
					"ECM on Graphics Cards.",
					"Double-Base Number System for Multi-scalar Multiplications.",
					"Endomorphisms for Faster Elliptic Curve Cryptography on a Large Class of Curves.",
					"Generating Genus Two Hyperelliptic Curves over Large Characteristic Finite Fields.",
					"Verifiable Random Functions from Identity-Based Key Encapsulation.",
					"Optimal Randomness Extraction from a Diffie-Hellman Element.",
					"A New Randomness Extraction Paradigm for Hybrid Encryption."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "EUROCRYPT 2008",
		"info": "Istanbul, Turkey",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2008",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2008, 27th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Istanbul, Turkey, April 13-17, 2008. Proceedings.",
				"count": 31,
				"papers": [
					"A Practical Attack on KeeLoq.",
					"Key Recovery on Hidden Monomial Multivariate Schemes.",
					"Predicting Lattice Reduction.",
					"Efficient Sequential Aggregate Signed Data.",
					"Proving Tight Security for Rabin-Williams Signatures.",
					"Threshold RSA for Dynamic and Ad-Hoc Groups.",
					"Towards Key-Dependent Message Security in the Standard Model.",
					"The Twin Diffie-Hellman Problem and Applications.",
					"Predicate Encryption Supporting Disjunctions, Polynomial Equations, and Inner Products.",
					"Isogenies and the Discrete Logarithm Problem in Jacobians of Genus 3 Hyperelliptic Curves.",
					"On the Indifferentiability of the Sponge Construction.",
					"A New Mode of Operation for Block Ciphers and Length-Preserving MACs.",
					"Security/Efficiency Tradeoffs for Permutation-Based Hashing.",
					"New Key-Recovery Attacks on HMAC/NMAC-MD4 and NMAC-MD5.",
					"Collisions for the LPS Expander Graph Hash Function.",
					"Second Preimage Attacks on Dithered Hash Functions.",
					"Efficient Two Party and Multi Party Computation Against Covert Adversaries.",
					"Almost-Everywhere Secure Computation.",
					"Truly Efficient 2-Round Perfectly Secure Message Transmission Scheme.",
					"Protocols and Lower Bounds for Failure Localization in the Internet.",
					"HB#: Increasing the Security and Efficiency of HB+.",
					"Sub-linear Zero-Knowledge Argument for Correctness of a Shuffle.",
					"Precise Concurrent Zero Knowledge.",
					"Efficient Non-interactive Proof Systems for Bilinear Groups.",
					"Zero-Knowledge Sets with Short Proofs.",
					"Strongly Multiplicative Ramp Schemes from High Degree Rational Points on Curves.",
					"Detection of Algebraic Manipulation with Applications to Robust Secret Sharing and Fuzzy Extractors.",
					"Obfuscating Point Functions with Multibit Output.",
					"Isolated Proofs of Knowledge and Isolated Zero Knowledge.",
					"David and Goliath Commitments: UC Computation for Asymmetric Parties Using Tamper-Proof Hardware.",
					"New Constructions for UC Secure Computation Using Tamper-Proof Hardware."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "EUROCRYPT 2007",
		"info": "Barcelona, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2007",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2007, 26th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Barcelona, Spain, May 20-24, 2007, Proceedings.",
				"count": 33,
				"papers": [
					"Chosen-Prefix Collisions for MD5 and Colliding X.509 Certificates for Different Identities.",
					"Non-trivial Black-Box Combiners for Collision-Resistant Hash-Functions Don't Exist.",
					"The Collision Intractability of MDC-2 in the Ideal-Cipher Model.",
					"An Efficient Protocol for Secure Two-Party Computation in the Presence of Malicious Adversaries.",
					"Revisiting the Efficiency of Malicious Two-Party Computation.",
					"Efficient Two-Party Secure Computation on Committed Inputs.",
					"Universally Composable Multi-party Computation Using Tamper-Proof Hardware.",
					"Generic and Practical Resettable Zero-Knowledge in the Bare Public-Key Model.",
					"Instance-Dependent Verifiable Random Functions and Their Application to Simultaneous Resettability.",
					"Conditional Computational Entropy, or Toward Separating Pseudoentropy from Compressibility.",
					"Zero Knowledge and Soundness Are Symmetric.",
					"Mesh Signatures.",
					"The Power of Proofs-of-Possession: Securing Multiparty Signatures against Rogue-Key Attacks.",
					"Batch Verification of Short Signatures.",
					"Cryptanalysis of SFLASH with Slightly Modified Parameters.",
					"Differential Cryptanalysis of the Stream Ciphers Py, Py6 and Pypy.",
					"Secure Computation from Random Error Correcting Codes.",
					"Round-Efficient Secure Computation in Point-to-Point Networks.",
					"Atomic Secure Multi-party Multiplication with Low Communication.",
					"Cryptanalysis of the Sidelnikov Cryptosystem.",
					"Toward a Rigorous Variation of Coppersmith's Algorithm on Three Variables.",
					"An L (1/3 + epsilon ) Algorithm for the Discrete Logarithm Problem for Low Degree Curves.",
					"General Ad Hoc Encryption from Exponent Inversion IBE.",
					"Non-interactive Proofs for Integer Multiplication.",
					"Ate Pairing on Hyperelliptic Curves.",
					"Ideal Multipartite Secret Sharing Schemes.",
					"Non-wafer-Scale Sieving Hardware for the NFS: Another Attempt to Cope with 1024-Bit.",
					"Divisible E-Cash Systems Can Be Truly Anonymous.",
					"A Fast and Key-Efficient Reduction of Chosen-Ciphertext to Known-Plaintext Security.",
					"Range Extension for Weak PRFs; The Good, the Bad, and the Ugly.",
					"Feistel Networks Made Public, and Applications.",
					"Oblivious-Transfer Amplification.",
					"Simulatable Adaptive Oblivious Transfer."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "EUROCRYPT 2006",
		"info": "St. Petersburg, Russia",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2006",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2006, 25th Annual International Conference on the Theory and Applications of Cryptographic Techniques, St. Petersburg, Russia, May 28 - June 1, 2006, Proceedings.",
				"count": 35,
				"papers": [
					"Security Analysis of the Strong Diffie-Hellman Problem.",
					"Cryptography in Theory and Practice: The Case of Encryption in IPsec.",
					"Polynomial Equivalence Problems: Algorithmic and Theoretical Aspects.",
					"Alien vs. Quine, the Vanishing Circuit and Other Tales from the Industry's Crypt.",
					"Hiding Secret Points Amidst Chaff.",
					"Parallel and Concurrent Security of the HB and HB+ Protocols.",
					"Polling with Physical Envelopes: A Rigorous Analysis of a Human-Centric Protocol.",
					"QUAD: A Practical Stream Cipher with Provable Security.",
					"How to Strengthen Pseudo-random Generators by Using Compression.",
					"Efficient Computation of Algebraic Immunity for Algebraic and Fast Algebraic Attacks.",
					"VSH, an Efficient and Provable Collision-Resistant Hash Function.",
					"Herding Hash Functions and the Nostradamus Attack.",
					"Optimal Reductions Between Oblivious Transfers Using Interactive Hashing.",
					"Oblivious Transfer Is Symmetric.",
					"Symplectic Lattice Reduction and NTRU.",
					"The Function Field Sieve in the Medium Prime Case.",
					"Learning a Parallelepiped: Cryptanalysis of GGH and NTRU Signatures.",
					"The Cramer-Shoup Encryption Scheme Is Plaintext Aware in the Standard Model.",
					"Private Circuits II: Keeping Secrets in Tamperable Circuits.",
					"Composition Implies Adaptive Security in Minicrypt.",
					"Perfect Non-interactive Zero Knowledge for NP.",
					"Language Modeling and Encryption on Packet Switched Networks.",
					"A Provable-Security Treatment of the Key-Wrap Problem.",
					"Luby-Rackoff Ciphers from Weak Round Functions?",
					"The Security of Triple Encryption and a Framework for Code-Based Game-Playing Proofs.",
					"Compact Group Signatures Without Random Oracles.",
					"Practical Identity-Based Encryption Without Random Oracles.",
					"Sequential Aggregate Signatures and Multisignatures Without Random Oracles.",
					"Our Data, Ourselves: Privacy Via Distributed Noise Generation.",
					"On the (Im-)Possibility of Extending Coin Toss.",
					"Efficient Binary Conversion for Paillier Encrypted Values.",
					"Information-Theoretic Conditions for Two-Party Secure Function Evaluation.",
					"Unclonable Group Identification.",
					"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys.",
					"Simplified Threshold RSA with Adaptive and Proactive Security."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "EUROCRYPT 2005",
		"info": "Aarhus, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2005",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2005, 24th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Aarhus, Denmark, May 22-26, 2005, Proceedings.",
				"count": 33,
				"papers": [
					"Cryptanalysis of the Hash Functions MD4 and RIPEMD.",
					"How to Break MD5 and Other Hash Functions.",
					"Collisions of SHA-0 and Reduced SHA-1.",
					"Reducing Complexity Assumptions for Statistically-Hiding Commitment.",
					"Smooth Projective Hashing and Two-Message Oblivious Transfer.",
					"On Robust Combiners for Oblivious Transfer and Other Primitives.",
					"Efficient Identity-Based Encryption Without Random Oracles.",
					"Tag-KEM/DEM: A New Framework for Hybrid Encryption and A New Analysis of Kurosawa-Desmedt KEM.",
					"Secure Remote Authentication Using Biometric Data.",
					"Stronger Security Bounds for Wegman-Carter-Shoup Authenticators.",
					"3-Move Undeniable Signature Scheme.",
					"Group Signatures with Efficient Concurrent Join.",
					"Floating-Point LLL Revisited.",
					"Practical Cryptography in High Dimensional Tori.",
					"A Tool Kit for Finding Small Roots of Bivariate Polynomials over the Integers.",
					"Computational Indistinguishability Between Quantum States and Its Cryptographic Application.",
					"Approximate Quantum Error-Correcting Codes and Secret Sharing Schemes.",
					"Compact E-Cash.",
					"Cryptographic Asynchronous Multi-party Computation with Optimal Resilience (Extended Abstract).",
					"Differential Cryptanalysis for Multivariate Schemes.",
					"A Fast Cryptanalysis of the Isomorphism of Polynomials with One Secret Problem.",
					"Partial Key Exposure Attacks on RSA up to Full Size Exponents.",
					"The RSA Group is Pseudo-Free.",
					"Universally Composable Password-Based Key Exchange.",
					"Mercurial Commitments with Applications to Zero-Knowledge Sets.",
					"Hierarchical Identity Based Encryption with Constant Size Ciphertext.",
					"Fuzzy Identity-Based Encryption.",
					"Second Preimages on n-Bit Hash Functions for Much Less than 2n Work.",
					"Predicting and Distinguishing Attacks on RC4 Keystream Generator.",
					"Related-Key Boomerang and Rectangle Attacks.",
					"On the Impossibility of Highly-Efficient Blockcipher-Based Hash Functions.",
					"Public Traceability in Traitor Tracing Schemes.",
					"One-Way Chain Based Broadcast Encryption Schemes."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "EUROCRYPT 2004",
		"info": "Interlaken, Switzerland",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2004",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2004, International Conference on the Theory and Applications of Cryptographic Techniques, Interlaken, Switzerland, May 2-6, 2004, Proceedings.",
				"count": 36,
				"papers": [
					"Efficient Private Matching and Set Intersection.",
					"Positive Results and Techniques for Obfuscation.",
					"Secure Computation of the k th-Ranked Element.",
					"Short Signatures Without Random Oracles.",
					"Sequential Aggregate Signatures from Trapdoor Permutations.",
					"On the Key-Uncertainty of Quantum Ciphers and the Computational Security of One-Way Quantum Transmission.",
					"The Exact Price for Unconditionally Secure Asymmetric Cryptography.",
					"On Generating the Initial Key in the Bounded-Storage Model.",
					"Practical Large-Scale Distributed Key Generation.",
					"Optimal Communication Complexity of Generic Multicast Key Distribution.",
					"An Uninstantiable Random-Oracle-Model Scheme for a Hybrid-Encryption Problem.",
					"Black-Box Composition Does Not Imply Adaptive Security.",
					"Chosen-Ciphertext Security from Identity-Based Encryption.",
					"Efficient Selective-ID Secure Identity-Based Encryption Without Random Oracles.",
					"Construction of Secure Random Curves of Genus 2 over Prime Fields.",
					"Projective Coordinates Leak.",
					"Security Proofs for Identity-Based Identification and Signature Schemes.",
					"Concurrent Signatures.",
					"The Hierarchy of Key Evolving Signatures and a Characterization of Proxy Signatures.",
					"Public-Key Steganography.",
					"Immunizing Encryption Schemes from Decryption Errors.",
					"Secure Hashed Diffie-Hellman over Non-DDH Groups.",
					"On Simulation-Sound Trapdoor Commitments.",
					"Hash Function Balance and Its Impact on Birthday Attacks.",
					"Multi-party Computation with Hybrid Security.",
					"On the Hardness of Information-Theoretic Multiparty Computation.",
					"Dining Cryptographers Revisited.",
					"Algebraic Attacks and Decomposition of Boolean Functions.",
					"Finding Small Roots of Bivariate Integer Polynomial Equations Revisited.",
					"Public Key Encryption with Keyword Search.",
					"Fuzzy Extractors: How to Generate Strong Keys from Biometrics and Other Noisy Data.",
					"Merkle Tree Traversal in Log Space and Time.",
					"Can We Trust Cryptographic Software? Cryptographic Flaws in GNU Privacy Guard v1.2.3.",
					"Traceable Signatures.",
					"Handcuffing Big Brother: an Abuse-Resilient Transaction Escrow Scheme.",
					"Anonymous Identification in Ad Hoc Groups."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "EUROCRYPT 2003",
		"info": "Warsaw, Poland",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2003",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2003, International Conference on the Theory and Applications of Cryptographic Techniques, Warsaw, Poland, May 4-8, 2003, Proceedings.",
				"count": 39,
				"papers": [
					"Cryptanalysis of the EMD Mode of Operation.",
					"On the Optimality of Linear, Differential, and Sequential Distinguishers.",
					"A Toolbox for Cryptanalysis: Linear and Affine Equivalence Algorithms.",
					"Two-Threshold Broadcast and Detectable Multi-party Computation.",
					"On the Limitations of Universally Composable Two-Party Computation without Set-up Assumptions.",
					"Fair Secure Two-Party Computation.",
					"Facts and Myths of Enigma: Breaking Stereotypes.",
					"Resettable Zero-Knowledge in the Weak Public-Key Model.",
					"Simulatable Commitments and Efficient Concurrent Zero-Knowledge.",
					"Simulation in Quasi-Polynomial Time, and Its Application to Protocol Composition.",
					"Strengthening Zero-Knowledge Protocols Using Signatures.",
					"Nearly One-Sided Tests and the Goldreich-Levin Predicate.",
					"Efficient and Non-malleable Proofs of Plaintext Knowledge and Applications.",
					"A Public Key Encryption Scheme Based on the Polynomial Reconstruction Problem.",
					"A Simpler Construction of CCA2-Secure Public-Key Encryption under General Assumptions.",
					"A Forward-Secure Public-Key Encryption Scheme.",
					"Certificate-Based Encryption and the Certificate Revocation Problem.",
					"CAPTCHA: Using Hard AI Problems for Security.",
					"Concealment and Its Applications to Authenticated Encryption.",
					"Predicting the Shrinking Generator with Fixed Connections.",
					"Algebraic Attacks on Stream Ciphers with Linear Feedback.",
					"Counting Points on Elliptic Curves over Finite Fields of Small Characteristic in Quasi Quadratic Time.",
					"The GHS Attack Revisited.",
					"Improved Algorithms for Efficient Arithmetic on Elliptic Curves Using Fast Endomorphisms.",
					"A Signature Scheme as Secure as the Diffie-Hellman Problem.",
					"Aggregate and Verifiably Encrypted Signatures from Bilinear Maps.",
					"Hypercubic Lattice Reduction and Analysis of GGH and NTRU Signatures.",
					"Why Provable Security Matters?",
					"On the Security of RDSA.",
					"Cryptanalysis of the Public-Key Encryption Based on Braid Groups.",
					"A Theoretical Treatment of Related-Key Attacks: RKA-PRPs, RKA-PRFs, and Applications.",
					"Provably Secure Threshold Password-Authenticated Key Exchange.",
					"A Framework for Password-Based Authenticated Key Exchange.",
					"The Security of Many-Round Luby-Rackoff Pseudo-Random Permutations.",
					"New Bounds in Secret-Key Agreement: The Gap between Formation and Secrecy Extraction.",
					"Round Efficiency of Multi-party Computation with a Dishonest Majority.",
					"Efficient Multi-party Computation over Rings.",
					"Foundations of Group Signatures: Formal Definitions, Simplified Requirements, and a Construction Based on General Assumptions.",
					"Extracting Group Signatures from Traitor Tracing Schemes."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "EUROCRYPT 2002",
		"info": "Amsterdam, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2002",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2002, International Conference on the Theory and Applications of Cryptographic Techniques, Amsterdam, The Netherlands, April 28 - May 2, 2002, Proceedings.",
				"count": 35,
				"papers": [
					"Cryptanalysis of a Pseudorandom Generator Based on Braid Groups.",
					"Potential Weaknesses of the Commutator Key Agreement Protocol Based on Braid Groups.",
					"Extending the GHS Weil Descent Attack.",
					"Universal Hash Proofs and a Paradigm for Adaptive Chosen Ciphertext Secure Public-Key Encryption.",
					"Key-Insulated Public Key Cryptosystems.",
					"On the Security of Joint Signature and Encryption.",
					"AES and the Wide Trail Design Strategy.",
					"Indistinguishability of Random Systems.",
					"How to Fool an Unbounded Adversary with a Short Key.",
					"Cryptography in an Unbounded Computational Model.",
					"Performance Analysis and Parallel Implementation of Dedicated Hash Functions.",
					"Fault Injection and a Timing Channel on an Analysis Technique.",
					"Speeding Up Point Multiplication on Hyperelliptic Curves with Efficiently-Computable Endomorphisms.",
					"Fast Correlation Attacks: An Algorithmic Point of View.",
					"BDD-Based Cryptanalysis of Keystream Generators.",
					"Linear Cryptanalysis of Bluetooth Stream Cipher.",
					"Generic Lower Bounds for Root Extraction and Signature Schemes in General Groups.",
					"Optimal Security Proofs for PSS and Other Signature Schemes.",
					"Cryptanalysis of SFLASH.",
					"Cryptanalysis of the Revised NTRU Signature Scheme.",
					"Dynamic Group Diffie-Hellman Key Exchange under Standard Assumptions.",
					"Universally Composable Notions of Key Exchange and Secure Channels.",
					"On Deniability in Quantum Key Exchange.",
					"A Practice-Oriented Treatment of Pseudorandom Number Generators.",
					"A Block-Cipher Mode of Operation for Parallelizable Message Authentication.",
					"Rethinking PKI: What's Trust Got to Do with It?",
					"Efficient Generic Forward-Secure Signatures with an Unbounded Number Of Time Periods.",
					"From Identification to Signatures via the Fiat-Shamir Transform: Minimizing Assumptions for Security and Forward-Security.",
					"Security Notions for Unconditionally Secure Signature Schemes.",
					"Traitor Tracing with Constant Transmission Rate.",
					"Toward Hierarchical Identity-Based Encryption.",
					"Unconditional Byzantine Agreement and Multi-party Computation Secure against Dishonest Minorities from Scratch.",
					"Perfectly Secure Message Transmission Revisited.",
					"Degree of Composition of Highly Nonlinear Functions and Applications to Higher Order Differential Cryptanalysis.",
					"Security Flaws Induced by CBC Padding - Applications to SSL, IPSEC, WTLS ...."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "EUROCRYPT 2001",
		"info": "Innsbruck, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2001",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2001, International Conference on the Theory and Application of Cryptographic Techniques, Innsbruck, Austria, May 6-10, 2001, Proceeding.",
				"count": 32,
				"papers": [
					"A Memory Efficient Version of Satoh's Algorithm.",
					"Finding Secure Curves with the Satoh-FGH Algorithm and an Early-Abort Strategy.",
					"How Secure Are Elliptic Curves over Composite Extension Fields?",
					"Efficient and Non-interactive Non-malleable Commitment.",
					"How to Convert the Flavor of a Quantum Bit Commitment.",
					"Cryptographic Counters and Applications to Electronic Voting.",
					"An Efficient System for Non-transferable Anonymous Credentials with Optional Anonymity Revocation.",
					"Priced Oblivious Transfer: How to Sell Digital Goods.",
					"A Secure Three-Move Blind Signature Scheme for Polynomially Many Signatures.",
					"Practical Threshold RSA Signatures without a Trusted Dealer.",
					"Hash Functions: From Merkle-Damgård to Shoup.",
					"Key Recovery and Message Attacks on NTRU-Composite.",
					"Evidence that XTR Is More Secure than Supersingular Elliptic Curve Cryptosystems.",
					"NSS: An NTRU Lattice-Based Signature Scheme.",
					"The Bit Security of Paillier's Encryption Scheme and Its Applications.",
					"Assumptions Related to Discrete Logarithms: Why Subtleties Make a Real Difference.",
					"On Adaptive vs. Non-adaptive Security of Multiparty Protocols.",
					"Multiparty Computation from Threshold Homomorphic Encryption.",
					"On Perfect and Adaptive Security in Exposure-Resilient Cryptography.",
					"Cryptanalysis of Reduced-Round MISTY.",
					"The Rectangle Attack - Rectangling the Serpent.",
					"Efficient Amplification of the Security of Weak Pseudo-random Function Generators.",
					"Min-round Resettable Zero-Knowledge in the Public-Key Model.",
					"Structural Cryptanalysis of SASAS.",
					"Hyper-bent Functions.",
					"New Method for Upper Bounding the Maximum Average Linear Hull Probability for SPNs.",
					"Lower Bounds for Multicast Message Authentication.",
					"Analysis of Key-Exchange Protocols and Their Use for Building Secure Channels.",
					"Efficient Password-Authenticated Key Exchange Using Human-Memorable Passwords.",
					"Identification Protocols Secure against Reset Attacks.",
					"Does Encryption with Redundancy Provide Authenticity?",
					"Encryption Modes with Almost Free Message Integrity."
				]
			}
		]
	},
	{
		"year": "2000",
		"name": "EUROCRYPT 2000",
		"info": "Bruges, Belgium",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/2000",
				"sub_name": "Advances in Cryptology - EUROCRYPT 2000, International Conference on the Theory and Application of Cryptographic Techniques, Bruges, Belgium, May 14-18, 2000, Proceeding.",
				"count": 41,
				"papers": [
					"Factorization of a 512-Bit RSA Modulus.",
					"An Algorithm for Solving the Discrete Log Problem on Hyperelliptic Curves.",
					"Analysis and Optimization of the TWINKLE Factoring Device.",
					"Noisy Polynomial Interpolation and Noisy Chinese Remaindering.",
					"A Chosen Messages Attack on the ISO/IEC 9796-1 Signature Scheme.",
					"Cryptanalysis of Countermeasures Proposed for Repairing ISO 9796-1.",
					"Security Analysis of the Gennaro-Halevi-Rabin Signature Scheme.",
					"On the Security of 3GPP Networks.",
					"One-Way Trapdoor Permutations Are Sufficient for Non-trivial Single-Server Private Information Retrieval.",
					"Single Database Private Information Retrieval Implies Oblivious Transfer.",
					"Authenticated Key Exchange Secure against Dictionary Attacks.",
					"Provably Secure Password-Authenticated Key Exchange Using Diffie-Hellman.",
					"Fair Encryption of RSA Keys.",
					"Computing Inverses over a Shared Secret Modulus.",
					"Practical Threshold Signatures.",
					"Adaptively Secure Threshold Cryptography: Introducing Concurrency, Removing Erasures.",
					"Confirmer Signature Schemes Secure against Adaptive Adversaries.",
					"Public-Key Encryption in a Multi-user Setting: Security Proofs and Improvements.",
					"Using Hash Functions as a Hedge against Chosen Ciphertext Attack.",
					"Security Aspects of Practical Quantum Cryptography.",
					"Perfectly Concealing Quantum Bit Commitment from any Quantum One-Way Permutation.",
					"General Secure Multi-party Computation from any Linear Secret-Sharing Scheme.",
					"Minimal-Latency Secure Function Evaluation.",
					"Information-Theoretic Key Agreement: From Weak to Strong Secrecy for Free.",
					"New Attacks on PKCS#1 v1.5 Encryption.",
					"A NICE Cryptanalysis.",
					"Efficient Algorithms for Solving Overdefined Systems of Multivariate Polynomial Equations.",
					"Cryptanalysis of Patarin's 2-Round Public Key System with S Boxes (2R).",
					"Colossus and the German Lorenz Cipher - Code Breaking in WW II.",
					"Efficient Concurrent Zero-Knowledge in the Auxiliary String Model.",
					"Efficient Proofs that a Committed Number Lies in an Interval.",
					"A Composition Theorem for Universal One-Way Hash Functions.",
					"Exposure-Resilient Functions and All-or-Nothing Transforms.",
					"The Sum of PRPs Is a Secure PRF.",
					"Construction of Nonlinear Boolean Functions with Important Cryptographic Properties.",
					"Propagation Characteristics and Correlation-Immunity of Highly Nonlinear Boolean Functions.",
					"Cox-Rower Architecture for Fast Parallel Montgomery Multiplication.",
					"Efficient Receipt-Free Voting Based on Homomorphic Encryption.",
					"How to Break a Practical MIX and Design a New One.",
					"Improved Fast Correlation Attacks Using Parity-Check Equations of Weight 4 and 5.",
					"Advanced Slide Attacks."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "EUROCRYPT 1999",
		"info": "Prague, Czech Republic",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/99",
				"sub_name": "Advances in Cryptology - EUROCRYPT '99, International Conference on the Theory and Application of Cryptographic Techniques, Prague, Czech Republic, May 2-6, 1999, Proceeding.",
				"count": 32,
				"papers": [
					"Cryptanalysis of RSA with Private Key d Less than N0.292.",
					"Cryptanalysis of Skipjack Reduced to 31 Rounds Using Impossible Differentials.",
					"Software Performance of Universal Hash Functions.",
					"Lower Bounds for Oblivious Transfer Reductions.",
					"On the (Im)possibility of Basing Oblivious Transfer and Bit Commitment on Weakened Security Assumptions.",
					"Conditional Oblivious Transfer and Timed-Release Encryption.",
					"An Efficient Threshold Public Key Cryptosystem Secure Against Adaptive Chosen Ciphertext Attack.",
					"Proving in Zero-Knowledge that a Number Is the Product of Two Safe Primes.",
					"Secure Hash-and-Sign Signatures Without the Random Oracle.",
					"A Note on the Limits of Collusion-Resistant Watermarks.",
					"Coin-Based Anonymous Fingerprinting.",
					"On the Performance of Hyperelliptic Cryptosystems.",
					"Fast Elliptic Curve Algorithm Combining Frobenius Map and Table Reference to Adapt to Higher Characteristic.",
					"Comparing the MOV and FR Reductions in Elliptic Curve Cryptography.",
					"Unbalanced Oil and Vinegar Signature Schemes.",
					"Public-Key Cryptosystems Based on Composite Degree Residuosity Classes.",
					"New Public Key Cryptosystems Based on the Dependent-RSA Problems.",
					"Resistance Against General Iterated Attacks.",
					"XOR and Non-XOR Differential Probabilities.",
					"S-boxes with Controllable Nonlinearity.",
					"Secure Distributed Key Generation for Discrete-Log Based Cryptosystems.",
					"Efficient Multiparty Computations Secure Against an Adaptive Adversary.",
					"Distributed Pseudo-random Functions and KDCs.",
					"Improved Fast Correlation Attacks on Stream Ciphers via Convolutional Codes.",
					"Cryptanalysis of an Identification Scheme Based on the Permuted Perceptron Problem.",
					"An Analysis of Exponentiation Based on Formal Languages.",
					"Dealing Necessary and Sufficient Numbers of Cards for Sharing a One-Bit Secret Key.",
					"Computationally Private Information Retrieval with Polylogarithmic Communication.",
					"On the Concurrent Composition of Zero-Knowledge Proofs.",
					"Pseudorandom Function Tribe Ensembles Based on One-Way Permutations: Improvements and Applications.",
					"Secure Communication in Broadcast Channels: The Answer to Franklin and Wright's Question.",
					"Efficient Communication-Storage Tradeoffs for Multicast Encryption."
				]
			}
		]
	},
	{
		"year": "1998",
		"name": "EUROCRYPT 1998",
		"info": "Espoo, Finland",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/98",
				"sub_name": "Advances in Cryptology - EUROCRYPT '98, International Conference on the Theory and Application of Cryptographic Techniques, Espoo, Finland, May 31 - June 4, 1998, Proceeding.",
				"count": 44,
				"papers": [
					"Securing Threshold Cryptosystems against Chosen Ciphertext Attack.",
					"Auto-Recoverable Auto-Certifiable Cryptosystems.",
					"A Practical and Provably Secure Scheme for Publicly Verifiable Secret Sharing and Its Applications.",
					"Equivalence of Counting the Number of Points on Elliptic Curve over the Ring Zn and Factoring n.",
					"Breaking RSA May Not Be Equivalent to Factoring.",
					"Lower Bounds on Generic Algorithms in Groups.",
					"Improved Cryptanalysis of RC5.",
					"Cryptanalysis of the ANSI X9.52 CBCM Mode.",
					"Differential-Linear Weak Key Classes of IDEA.",
					"Divertible Protocols and Atomic Proxy Cryptography.",
					"Optimum Traitor Tracing and Asymmetric Schemes.",
					"On Finding Small Solutions of Modular Multivariate Polynomial Equations.",
					"Computing Discrete Logarithms with Quadratic Number Rings.",
					"Improved Algorithms for Isomorphisms of Polynomials.",
					"Visual Cryptanalysis.",
					"How to Improve an Exponentiation Black-Box.",
					"Speeding up Discrete Log and Factoring Based Schemes via Precomputations.",
					"Fast Batch Verification for Modular Exponentiation and Digital Signatures.",
					"A Formal Treatment of Remotely Keyed Encryption.",
					"Luby-Rackoff Backwards: Increasing Security by Making Block Ciphers Non-invertible.",
					"The Chain & Sum Primitive and Its Applications to MACs and Stream Ciphers.",
					"A Cryptosystem Based on Non-maximal Imaginary Quadratic Orders with Fast Decryption.",
					"A New Public-Key Cryptosystem as Secure as Factoring.",
					"Towards a Better Understanding of One-Wayness: Facing Linear Permutations.",
					"Finding Collisions on a One-Way Street: Can Secure Hash Functions Be Based on General Assumptions?",
					"Secure Communications in Minimal Connectivity Models.",
					"On the Foundations of Oblivious Transfer.",
					"Quorum-Based Secure Multi-party Computation.",
					"Strengthened Security for Blind Signatures.",
					"Generic Constructions for Secure and Efficient Confirmer Signature Schemes.",
					"Security Analysis of a Practical \"on the fly\" Authentication and Signature Generation.",
					"Universally Verifiable Mix-net with Verification Work Indendent of the Number of Mix-servers.",
					"A Practical Mix.",
					"On the Propagation Criterion of Degree l and Order k.",
					"Highly Nonlinear Balanced Boolean Functions with a Good Correlation-Immunity.",
					"Heuristic Design of Cryptographically Strong Balanced Boolean Functions.",
					"Secret Sharing Schemes with Bipartite Access Structure.",
					"Combinatorial Bounds for Broadcast Encryption.",
					"New Results on Multi-Receiver Authentication Codes.",
					"Specialized Integer Factorization.",
					"Security of an Identity-Based Cryptosystem and the Related Reductions.",
					"Easy Come - Easy Go Divisible Cash.",
					"Secure and Efficient Metering.",
					"Optimistic Fair Exchange of Digital Signatures (Extended Abstract)."
				]
			}
		]
	},
	{
		"year": "1997",
		"name": "EUROCRYPT 1997",
		"info": "Konstanz, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/97",
				"sub_name": "Advances in Cryptology - EUROCRYPT '97, International Conference on the Theory and Application of Cryptographic Techniques, Konstanz, Germany, May 11-15, 1997, Proceeding.",
				"count": 34,
				"papers": [
					"Two Attacks on Reduced IDEA.",
					"Combinatorial Properties of Basic Encryption Operations (Extended Abstract).",
					"A New Public-Key Cryptosystem.",
					"On the Importance of Checking Cryptographic Protocols for Faults (Extended Abstract).",
					"Lattice Attacks on NTRU.",
					"Kleptography: Using Cryptography Against Cryptography.",
					"Fast and Secure Immunization Against Adaptive Man-in-the-Middle Impersonation.",
					"Anonymous Fingerprinting.",
					"A Secure and Optimally Efficient Multi-Authority Election Scheme.",
					"Binding ElGamal: A Fraud-Detectable Alternative to Key-Escrow Proposals.",
					"The GCHQ Protocol and Its Problems.",
					"Bucket Hashing with a Small Key Size.",
					"A New Paradigm for Collision-Free Hashing: Incrementality at Reduced Cost.",
					"Smooth Entropy and Rényi Entropy.",
					"Information-Theoretically Secure Secret-Key Agreement by NOT Authenticated Public Discussion.",
					"Linear Statistical Weakness of Alleged RC4 Keystream Generator.",
					"Cryptanalysis of Alleged A5 Stream Cipher.",
					"Lower Bounds for Discrete Logarithms and Related Problems.",
					"Stronger Security Proofs for RSA and Rabin Bits.",
					"Round-Optimal Zero-Knowledge Arguments Based on any One-Way Function.",
					"Efficient Cryptographic Protocols Based on Noisy Channels.",
					"Rapid Demonstration of Linear Relations Connected by Boolean Operators.",
					"Oblivious Transfers and Privacy Amplification.",
					"SHA: A Design for Parallel Architectures?",
					"Fast Arithmetic Architectures for Public-Key Algorithms over Galois Fields GF((2n)m).",
					"Finding Good Random Elliptic Curves for Cryptosystems Defined over F2n.",
					"Incremental Cryptography and Memory Checkers.",
					"Almost k-wise Independent Sample Spaces and Their Cryptologic Applications.",
					"More Correlation-Immune and Resilient Functions over Galois Fields and Galois Rings.",
					"Design of SAC/PC(l) of Order k Boolean Functions and Three Other Cryptographic Criteria.",
					"Distributed \"Magic Ink\" Signatures.",
					"Efficient and Generalized Group Signatures.",
					"Collision-Free Accumulators and Fail-Stop Signature Schemes Without Trees.",
					"Selective Forgery of RSA Signatures Using Redundancy."
				]
			}
		]
	},
	{
		"year": "1996",
		"name": "EUROCRYPT 1996",
		"info": "Saragossa, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/96",
				"sub_name": "Advances in Cryptology - EUROCRYPT '96, International Conference on the Theory and Application of Cryptographic Techniques, Saragossa, Spain, May 12-16, 1996, Proceeding.",
				"count": 34,
				"papers": [
					"Low-Exponent RSA with Related Messages.",
					"Generating EIGamal Signatures Without Knowing the Secret Key.",
					"On the Security of Two MAC Algorithms.",
					"Hidden Fields Equations (HFE) and Isomorphisms of Polynomials (IP): Two New Families of Asymmetric Algorithms.",
					"A Public Key Cryptosystem Based on Elliptic Curves over Z/nZ Equivalent to Factoring.",
					"Public Key Encryption and Signature Schemes Based on Polynomials over Zn.",
					"Multi-Autority Secret-Ballot Elections with Linear Work.",
					"Asymmetric Fingerprinting (Extended Abstract).",
					"Homomorphisms of Secret Sharing Schemes: A Tool for Verifiable Signature Sharing.",
					"Efficient Multiplicative Sharing Schemes.",
					"Equivocable Oblivious Transfer.",
					"Short Discrete Proofs.",
					"Designated Verifier Proofs and Their Applications.",
					"Finding a Small Root of a Univariate Modular Equation.",
					"New Modular Multiplication Algorithms for Fast Modular Exponentiation.",
					"Finding a Small Root of a Bivariate Integer Equation; Factoring with High Bits Known.",
					"Publicly Verifiable Secret Sharing.",
					"Optimum Secret Sharing Scheme Secure against Cheating.",
					"The Security of the Gabidulin Public Key Cryptosystem.",
					"Non-Linear Approximations in Linear Cryptanalysis.",
					"On the Difficulty of Software Key Escrow.",
					"An Efficient Pseudo-Random Generator Provably as Secure as Syndrome Decoding.",
					"On the Existence of Secure Feedback Registers (Extended Abstract).",
					"Fast Low Order Approximation of Cryptographic Functions.",
					"Construction of t-Resilient Functions over a Finite Alphabet.",
					"Auto-Correlations and New Bounds on the Nonlinearity of Boolean Functions.",
					"Foiling Birthday Attacks in Length-Doubling Transformations - Benes: A Non-Reversible Alternative to Feistel.",
					"Session Key Distribution Using Smart Cards.",
					"On Diffie-Hellman Key Agreement with Short Exponents.",
					"On the Security of a Practical Identification Scheme.",
					"Robust Threshold DSS Signatures.",
					"New Convertible Undeniable Signature Schemes.",
					"Security Proofs for Signature Schemes.",
					"The Exact Security of Digital Signatures - HOw to Sign with RSA and Rabin."
				]
			}
		]
	},
	{
		"year": "1995",
		"name": "EUROCRYPT 1995",
		"info": "Saint-Malo, France",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/95",
				"sub_name": "Advances in Cryptology - EUROCRYPT '95, International Conference on the Theory and Application of Cryptographic Techniques, Saint-Malo, France, May 21-25, 1995, Proceeding.",
				"count": 34,
				"papers": [
					"Attacking the Chor-Rivest Cryptosystem by Improved Lattice Reduction.",
					"Convergence in Differential Distributions.",
					"A Generalization of Linear Cryptanalysis and the Applicability of Matsui's Piling-Up Lemma.",
					"On the Efficiency of Group Signatures Providing Information-Theoretic Anonymity.",
					"Verifiable Signature Sharing.",
					"Server (Prover/Signer)-Aided Verification of Identity Proofs and Signatures.",
					"Counting the Number of Points on Elliptic Curves over Finite Fields: Strategies and Performance.",
					"An Implementation of the General Number Field Sieve to Compute Discrete Logarithms mod p.",
					"A Block Lanczos Algorithm for Finding Dependencies Over GF(2).",
					"How to Break Another Provably Secure Payment System.",
					"Quantum Oblivious Mutual Identification.",
					"Securing Traceability of Ciphertexts - Towards a Secure Software Key Escrow System (Extended Abstract).",
					"Secure Multiround Authentication Protocols.",
					"Verifiable Secret Sharing as Secure Computation.",
					"Efficient Secret Sharing Without a Mutually Trusted Authority (Extended Abstract).",
					"General Short Computational Secret Sharing Schemes.",
					"Fair Blind Signatures.",
					"Ripping Coins For a Fair Exchange.",
					"Restrictive Blinding of Secret-Key Certificates.",
					"Towards Fast Correlation Attacks on Irregularly Clocked Shift Registers.",
					"Large Periods Nearly de Bruijn FCSR Sequences.",
					"On Nonlinear Resilient Functions (Extended Abstract).",
					"Combinatorial Bounds for Authentication Codes with Arbitration.",
					"New Hash Functions For Message Authentication.",
					"A2 Codes from Universal Hash Classes.",
					"A New Identification Scheme Based on the Perceptrons Problem.",
					"Fast RSA-type Schemes Based on Singular Cubic Curves y2+axy=m³(mod n).",
					"Relationships Among the Computational Powers of Breaking Discrete Log Cryptosystems.",
					"Universal Hash Functions & Hard Core Bits.",
					"Recycling Random Bits in Composed Perfect Zero-Knowledge.",
					"On the Matsumoto and Imai's Human Identification Scheme.",
					"Receipt-Free Mix-Type Voting Scheme - A Practical Solution to the Implementation of a Voting Booth.",
					"Are Crypto-Accelerators Really Inevitable? 20Bit Zero-Knowledge in Less than a Second on Simple 8-bit Microcontrollers.",
					"Anonymous NIZK Proofs of Knowledge with Preprocessing."
				]
			}
		]
	},
	{
		"year": "1994",
		"name": "EUROCRYPT 1994",
		"info": "Perugia, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/94",
				"sub_name": "Advances in Cryptology - EUROCRYPT '94, Workshop on the Theory and Application of Cryptographic Techniques, Perugia, Italy, May 9-12, 1994, Proceedings.",
				"count": 47,
				"papers": [
					"Visual Cryptography.",
					"The Size of a Share Must Be Large.",
					"A Linear Construction of Perfect Secret Sharing Schemes.",
					"On the Dealer's Randomness Required in Secret Sharing Schemes.",
					"Black Box Cryptanalysis of Hash Networks Based on Multipermutations.",
					"A Practical Attack against Knapsack based Hash Functions (Extended Abstract).",
					"The Blinding of Weak Signatures (Extended Abstract).",
					"Can D.S.A. be Improved? Complexity Trade-Offs with the Digital Signature Standard.",
					"Designated Confirmer Signatures.",
					"Optimal Asymmetric Encryption.",
					"A Multiple-Iterated Trapdoor for Dense Compact Knapsacks.",
					"On the Security of Some Cryptosystems Based on Error-correcting Codes.",
					"Parallel Divertibility of Proofs of Knowledge (Extended Abstract).",
					"Methodology for Digital Money based on General Cryptographic Tools.",
					"New Group Signature Schemes (Extended Abstract).",
					"Message Recovery for Signature Schemes Based on the Discrete Logarithm Problem.",
					"Threshold-Multisignature Schemes where Suspected Forgery Implies Traceability of Adversarial Shareholders.",
					"The Self-Shrinking Generator.",
					"Feedback Registers Based on Ramified Extensions of the 2-Adic Numbers (Extended Abstract).",
					"General Lower Bound for the Linear Complexity of the Product of Shift-Register Sequences.",
					"Embedding and Probabilistic Correlation Attacks on Clock-Controlled Shift Registers.",
					"Near Optimal Unconditionally Secure Authentication.",
					"Authentication Codes in Plaintext and Chosen-content Attacks.",
					"Linking Information Reconciliation and Privacy Amplification (Extended Abstract).",
					"A Secure and Efficient Conference Key Distribution System (Extended Abstract).",
					"Space Requirements for Broadcast Encryption.",
					"How to Break and Repair Leighton and Micali's Key Agreement Protocol.",
					"Single-Term Divisible Electronic Coins.",
					"Formal Requirements for Key Distribution Protocols.",
					"Breaking Efficient Anonymous Channel.",
					"On Matsui's Linear Cryptanalysis.",
					"Links Between Differential and Linear Cryptanalysis.",
					"On Correlation Between the Order of S-boxes and the Strength of DES.",
					"Relationships Among Nonlinear Criteria (Extended Abstract).",
					"Efficient Exponentiation using Procomputation and Vector Addition Chains.",
					"MIMD-Factorisation on Hypercubes.",
					"New Attacks on all Double Block Length Hash Functions of Hash Rate 1, including the Parallel-DM.",
					"New Potentially 'Weak' Keys for DES and LOKI (Extended Abstract).",
					"Blackmailing using Undeniable Signatures.",
					"Blind Signatures Based on the Discrete Logarithm Problem.",
					"Comments on Soviet Encryption Algorithm.",
					"Linear Approximation of Block Ciphers.",
					"Memory Efficient Variants of Public-Key Schemes for Smart Card Applications.",
					"A Systematic Attack on Clock Controlled Cascades.",
					"On A²-Codes Including Arbiter's Attacks.",
					"An Improvement of Davies' Attack on DES.",
					"Q-Deformed Quantum Cryptography."
				]
			}
		]
	},
	{
		"year": "1993",
		"name": "EUROCRYPT 1993",
		"info": "Lofthus, Norway",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/93",
				"sub_name": "Advances in Cryptology - EUROCRYPT '93, Workshop on the Theory and Application of of Cryptographic Techniques, Lofthus, Norway, May 23-27, 1993, Proceedings.",
				"count": 42,
				"papers": [
					"On the Relation between A-Codes and Codes Correcting Independent Errors.",
					"Optimal Authentication Systems.",
					"Factoring Integers Using SIMD Sieves.",
					"A New Elliptic Curve Based Analogue of RSA.",
					"Weakness of a Public-Key Cryptosystem Based on Factorizations of Finite Groups.",
					"Differentially Uniform Mappings for Cryptography.",
					"On Almost Perfect Nonlinear Permutations.",
					"Two New Classes of Bent Functions.",
					"Boolean Functions Satisfying a Higher Order Strict Avalanche Criterion.",
					"Size of Shares and Probability of Cheating in Threshold Schemes.",
					"Nonperfect Secret Sharing Schemes and Matroids.",
					"From the Memoirs of a Norwegian Cryptologist.",
					"On the Linear Complexity of Products of Shift-Register Sequences.",
					"Resynchronization Weaknesses in Synchronous Stream Ciphers.",
					"Blind Synchronization of m-Sequnces with Even Span.",
					"On Constructions and Nonlinearity of Correlation Immune Functions (Extended Abstract).",
					"Practical and Provably Secure Release of a Secret and Exchange of Signatures.",
					"Subliminal Communication is Easy Using the DSA.",
					"Can O.S.S. be Repaired? Proposal for a New Practical Signature Scheme.",
					"On a Limitation of BAN Logic.",
					"Efficient Anonymous Channel and All/Nothing Election Scheme.",
					"Untransferable Rights in a Client-Independent Server Environment.",
					"Interactive Hashing Simplifies Zero-Knowledge Protocol Design.",
					"One-Way Accumulators: A Decentralized Alternative to Digital Sinatures (Extended Abstract).",
					"The Breaking of the AR Hash Function.",
					"Collisions for the Compressin Function of MD5.",
					"How to Find and Avoid Collisions for the Knapsack Hash Function.",
					"Single Term Off-Line Coins.",
					"Improved Privacy in Wallets with Observers (Extended Abstract).",
					"Distance-Bounding Protocols (Extended Abstract).",
					"On the Distribution of Characteristics in Bijective Mappings.",
					"On the Security of the IDEA Block Cipher.",
					"Linear Cryptanalysis Method for DES Cipher.",
					"New Types of Cryptanalytic Attacks Using related Keys (Extended Abstract).",
					"Secret-Key Reconciliation by Public Discussion.",
					"Global, Unpredictable Bit Generation Without Broadcast.",
					"On Schnorr's Preprocessing for Digital Signature Schemes.",
					"Cryptanalysis of the Chang-Wu-Chen Key Distribution System.",
					"An Alternate Explanation of two BAN-logic \"failures\".",
					"The Consequences of Trust in Shared Secret Schemes.",
					"Markov Ciphers and Alternating Groups.",
					"On Key Distribution and Authentication in Mobile Radio Networks."
				]
			}
		]
	},
	{
		"year": "1992",
		"name": "EUROCRYPT 1992",
		"info": "Balatonfüred, Hungary",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/92",
				"sub_name": "Advances in Cryptology - EUROCRYPT '92, Workshop on the Theory and Application of of Cryptographic Techniques, Balatonfüred, Hungary, May 24-28, 1992, Proceedings.",
				"count": 45,
				"papers": [
					"Graph Decompositions and Secret Sharing Schemes.",
					"Classification of Ideal Homomorphic Threshold Schemes over Finite Abelian Groups (Extended Abstract).",
					"FFT Hashing is not Collision-free.",
					"FFT-Hash II, Efficient Cryptographic Hashing.",
					"Hash Function Based on Block Ciphers.",
					"Differential Cryptanalysis Mod 2^32 with Applications to MD5.",
					"A New Method for Known Plaintext Attack of FEAL Cipher.",
					"On the Construction of Highly Nonlinear Permutations.",
					"The One-Round Functions of the DES Generate the Alternating Group.",
					"Correlation via Linear Sequential Circuit Approximation of Combiners with memory.",
					"Convergence of a Bayesian Iterative Error-Correction Procedure on a Noisy Shift register Sequence.",
					"Suffix Tree and String Complexity.",
					"Attacks on Protocols for Server-Aided RSA Computation.",
					"Public-Key Cryptosystems with Very Small Key Length.",
					"Resource Requirements for the Application of Addition Chains in Modulo Exponentiation.",
					"Massively Parallel Elliptic Curve Factorin.",
					"The Eurocrypt '92 Controversial Issue: Trapdoor Primes and Moduli (Panel).",
					"Fast Exponentiation with Precomputation (Extended Abstract).",
					"Batch Diffie-Hellman Key Agreement Systems and their Application to Portable Communications.",
					"High-Speed Implementation Methods for RSA Scheme.",
					"A Simplified and Generalized Treatment of Luby-Rackoff Pseudorandom Permutation Generator.",
					"How to Construct Pseudorandom and Super Pseudorandom Permutations from one Single Pseudorandom Function.",
					"A Construction for Super Pseudorandom Permutations from A Single Pseudorandom Function.",
					"How to Break a \"Secure\" Oblivious Transfer Protocol.",
					"Uniform Results in Polynomial-Time Security.",
					"Cryptographic Protocols Provably Secure Against Dynamic Adversaries.",
					"Secure Bit Commitment Function against Divertibility.",
					"Non-Interactive Circuit Based Proofs and Non-Interactive Perfect Zero-knowledge with Proprocessing.",
					"Tools for Proving Zero Knowledge.",
					"How to Make Efficient Fail-stop Signatures.",
					"Which new RSA Signatures can be Computed from RSA Signatures, Obtained in a Specific Interactive Protocol?",
					"Transferred Cash Grows in Size.",
					"Local Randomness in Candidate One-Way Functions.",
					"How Intractable Is the Discrete Logarithm for a General Finite Group?",
					"Factoring with an Oracle.",
					"Secure Audio Teleconferencing: A Practical Solution.",
					"Secure Conference Key Distribution Schemes for Conspiracy Attack.",
					"A Note on Discrete Logorithms with Special Structure.",
					"A Remark on a Non-interactive Public-Key Distribution System.",
					"Security Bounds for Parallel Versions of Identification Protocols (Extended Abstract).",
					"Information-Theoretic Bounds for Authentication Frauds.",
					"A Generalized Correlation Attack with a Probabilistic Constrained Edit Distance.",
					"Systolic-Arrays for Modular Exponentiation Using Montgomery Method (Extended Abstract).",
					"On the Development of a Fast Elliptic Curve Cryptosystem.",
					"A Montgomery-Suitable Fiat-Shamir-like Authenication Scheme."
				]
			}
		]
	},
	{
		"year": "1991",
		"name": "EUROCRYPT 1991",
		"info": "Brighton, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/91",
				"sub_name": "Advances in Cryptology - EUROCRYPT '91, Workshop on the Theory and Application of of Cryptographic Techniques, Brighton, UK, April 8-11, 1991, Proceedings.",
				"count": 54,
				"papers": [
					"Differential Cryptanalysis of Feal and N-Hash.",
					"Markov Ciphers and Differential Cryptanalysis.",
					"The Knapsack Hash Function proposed at Crypto'89 can be broken.",
					"An Improved Low-Denisty Subset Sum Algorithm.",
					"Cryptanalysis of McEliece's Public-Key Cryptosystem.",
					"On the Security of the Schnorr Scheme using Preprocessing.",
					"Broadcast Interactive Proofs (Extended Abstract).",
					"Direct Zero Knowledge Proofs of Computational Power in Five Rounds.",
					"On the Reversibility of Oblivious Transfer.",
					"Liv-Lempel Complexity for Periodic Sequences and its Cryptographic Application.",
					"A Secret Key Cryptosystem by Iterating a Chaotic Map.",
					"Boolean Functions Satisfying Higher Order Propagation Criteria.",
					"The Maximum Order Complexity of Sequence Ensembles.",
					"The Number of Output Sequences of a Binary Sequence Generator.",
					"Linear Complexity of Periodically Repeated Random Sequences.",
					"On A Fast Correlation Attack on Certain Stream Ciphers.",
					"Analysis of Pseudo Random Sequence Generated by Cellular Automata.",
					"On Binary Sequences from Recursions modulo 2e Made Non-Linear by the Bit-by-Bit XOR Function.",
					"Weakness of Undeniable Signature Schemes (Extended Abstract).",
					"Distributed Provers with Applications to Undeniable Signatures.",
					"Interactive Bi-Proof Systems and Undeniable Signature Schemes.",
					"Group Signatures.",
					"Enhancing Secrecy by Data Compression: Theoretical and Practical Aspects.",
					"Factoring Integers and Computing Discrete Logarithms via Diophantine Approximations.",
					"Some Considerations concerning the Selection of RSA Moduli.",
					"On the Use of Interconnection Networks in Cryptography.",
					"Non Supersingular Elliptic Curves for Public Key Cryptosystems.",
					"Building Elliptic Curves Modulo Large Primes.",
					"On the Complexity of Hyperelliptic Discrete Logarithm Problem.",
					"An Expanded Set of S-box Design Criteria Based on Information Theory and its Relation to Differential-Like Attacks.",
					"Enumerating Nondegenerate Permutations.",
					"Perfect Nonlinear S-Boxes.",
					"A Formal Approach to Security Architectures.",
					"Discrete Logarithm Based Protocols.",
					"Human Identification Through Insecure Channel.",
					"The Automated Cryptanalysis of Analog Speech Scramblers.",
					"A Construction for One Way Hash Functions and Pseudorandom Bit Generators.",
					"ESIGN: An Efficient Digital Signature Implementation for Smard Cards.",
					"New Approaches to the Design of Self-Synchronizing Stream Ciphers.",
					"Randomized Authentication Systems.",
					"Ideals over a Non-Commutative Ring and thier Applications in Cryptology.",
					"Self-Certified Public Keys.",
					"Non-interactive Public-Key Cryptography.",
					"Hash Functions And Graphs With Large Girths.",
					"Dickson Pseudoprimes and Primality Testing.",
					"Equivalent Goppa Codes and Trapdoors to McEliece's Public Key Cryptosystem.",
					"A Threshold Cryptosystem without a Trusted Party (Extended Abstract).",
					"A Comparison of Cryptanalytic Principles Based on Iterative Error-Correction.",
					"Cryptanalysis of the Chaotic-Map Cryptosystem Suggested at EUROCRYPT'91.",
					"How To Broadcast A Secret.",
					"Probabilistic Analysis of Elementary Randimizers.",
					"Race Integrity Primitives Evaluation (RIPE): A Status Report.",
					"The Information Leakage through a Randomly Generated Function.",
					"Some Weaknesses of \"Weaknesses of Undeniable Signatures\"."
				]
			}
		]
	},
	{
		"year": "1990",
		"name": "EUROCRYPT 1990",
		"info": "Aarhus, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/90",
				"sub_name": "Advances in Cryptology - EUROCRYPT '90, Workshop on the Theory and Application of of Cryptographic Techniques, Aarhus, Denmark, May 21-24, 1990, Proceedings.",
				"count": 48,
				"papers": [
					"Yvo Desmedt: All Languages in NP Have Divertible Zero-Knowledge Proofs and Arguments Under Cryptographic Assumptions.",
					"On the Importance of Memory Resources in the Security of Key Exchange Protocols.",
					"Provably Secure Key-Updating Schemes in Identity-Based Systems.",
					"Oblivous Transfer Protecting Secrecy.",
					"Public-Randomness in Public Key Cryptography.",
					"An Interactive Identification Scheme Based on Discrete Logarithms and Factoring.",
					"Factoring With Two Large Primes.",
					"Which New RSA Signatures Can Be Computed From Some Given RSA Signatures?",
					"Implementation of a Key Exchange Protocol Using Some Real Quadratic Fields.",
					"Distributed Primality Proving and the Primality of (23539+1)/3.",
					"Properties of Binary Functions.",
					"How to Construct Pseudorandom Permutations from Single Pseudorandom Functions.",
					"Constructions of Bent Functions and Difference Sets.",
					"Propagation Characteristics of Boolean Functions.",
					"The Linear Complexity Profile and the Jump Complexity of Keystream Sequences.",
					"Lower Bounds for the Linear Complexity of Sequences over Residue Rings.",
					"On the Construction of Run Permuted Sequences.",
					"Correlation Properties of Combiners with Memory in Stream Ciphers.",
					"Correlation Functions of Geometric Sequences.",
					"Exponentiating Faster with Addition Chains.",
					"A Cryptographic Library for the Motorola DSP56000.",
					"VICTOR an Efficient RSA Hardware Implementation.",
					"Experimental Quantum Cryptography.",
					"A Protocol to Set Up Shared Secret Schemes Without the Assistance of a Mutualy Trusted Party.",
					"Lower Bounds for Authentication Codes With Splitting.",
					"Essentially l-Fold Secure Authentication Systems.",
					"On the Construction of Authentication Codes With Secrecy and Codes Withstanding Spoofing Attacks of Order L >= 2.",
					"Cryptanalysis of a Public-Key Cryptosystem Based on Approximations by Rational Numbers.",
					"A Known Plaintext Attack on Two-Key Triple Encryption.",
					"Confirmation that Some Hash Functions Are Not Collision Free.",
					"Inverting the Pseudo Exponentiation.",
					"Cryptosystem for Group Oriented Cryptography.",
					"A Provably-Secure Strongly-Randomized Cipher.",
					"General Public Key Residue Cryptosystems and Mental Poker Protocols.",
					"A Proposal for a New Block Encryption Standard.",
					"A New Trapdoor in Knapsacks.",
					"On the Design of Provably Secure Cryptographic Hash Functions.",
					"Fast Signature Generation With a Fiat Shamir-Like Scheme.",
					"A Remark on a Signature Scheme Where Forgery Can Be Proved.",
					"Membership Authentication for Hierarchical Multigroups Using the Extended Fiat-Shamir Scheme.",
					"Zero-Knowledge Undeniable Signatures.",
					"Precautions Taken Against Various Potential Attacks in ISO/IEC DIS 9796 \"Digital Signature Scheme Giving Message Recovery\".",
					"Software Run-Time Protection: A Cryptographic Issue.",
					"An Identity-based Identification Scheme Based on Discrete Logarithms Modulo a Composite Number.",
					"A Noisy Clock-Controlled Shift Register Cryptanalysis Concept Based on Sequence Comparion Approach.",
					"The MD4 Message Digest Algorithm (Abstract).",
					"A Remark on the Efficiency of Identification Schemes.",
					"On an Implementation of the Mohan-Adiga Algorithm."
				]
			}
		]
	},
	{
		"year": "1989",
		"name": "EUROCRYPT 1989",
		"info": "Houthalen, Belgium",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/89",
				"sub_name": "Advances in Cryptology - EUROCRYPT '89, Workshop on the Theory and Application of of Cryptographic Techniques, Houthalen, Belgium, April 10-13, 1989, Proceedings.",
				"count": 72,
				"papers": [
					"The Adolescence of Public-Key Cryptography (Abstract).",
					"A Secure Public-key Authentication Scheme.",
					"How to Improve Signature Schemes.",
					"A Generalization of El Gamal's Public Key Cryptosystem.",
					"An Identity-Based Key-Exchange Protocol.",
					"How to Keep Authenticity Alive in a Computer Network.",
					"The Use of Fractions in Public-Key Cryptosystems.",
					"A Practical Protocol for Large Group Oriented Networks.",
					"Counting Functions Satisfying a Higher Order Strict Avalanche Criterion.",
					"A Key Distribution System Based On Any One-Way Function (Extended Abstract).",
					"Non-linearity of Exponent Permutations.",
					"Informational Divergence Bounds for Authentication Codes.",
					"2n-Bit Hash-Functions Using n-Bit Symmetric Block Cipher Algorithms.",
					"A Simple Technique for Diffusing Cryptoperiods.",
					"A General Zero-Knowledge Scheme (Extended Abstract).",
					"Divertible Zero Knowledge Interactive Proofs and Commutative Random Self-Reducibility.",
					"Verifiable Disclosure of Secrets and Applications (Abstract).",
					"Practical Zero-Knowledge Proofs: Giving Hints and Using Deficiencies.",
					"An Alternative to the Fiat-Shamir Protocol.",
					"Sorting out Zero-Knowledge.",
					"Everything in NP can be Argued in Perfect Zero-Knowledge in a Bounded Number of Rounds (Extended Abstract).",
					"Zero-Knowledge Proofs of Computational Power (Extended Summary).",
					"More Efficient Match-Making and Satisfiability: The Five Card Trick.",
					"A Single Chip 1024 Bits RSA Processor.",
					"Cryptel - The Practical Protection of an Existing Electronic Mail System.",
					"Technical Security: The Starting Point.",
					"Security in Open Distributed Processing.",
					"A European Call For Cryptographic Algorithms: Ripe; Race Integrity Primitives Evaluation.",
					"Legal Requirements Facing New Signature Technology.",
					"Online Cash Checks.",
					"Efficient Offline Electronic Checks (Extended Abstract).",
					"Unconditional Sender and Recipient Untraceability in Spite of Active Attacks.",
					"Detection of Disrupters in the DC Protocol.",
					"Random Mapping Statistics.",
					"Factoring by Electronic Mail.",
					"Cryptanalysis of Short RSA Secret Exponents (Abstract).",
					"How to Break the Direct RSA-Implementation of Mixes.",
					"An Information-Theoretic Treatment of Homophonic Substitution.",
					"Cryptanalysis of a Modified Rotor Machine.",
					"Cryptanalysis of Video Encryption Based on Space-Filling Curves.",
					"Impossibility and Optimality Results on Constructing Pseudorandom Permutations (Extended Abstract).",
					"On the Security of Schnorr's Pseudo Random Generator.",
					"How Easy is Collision Search? Application to DES (Extended Summary).",
					"Prepositioned Shared Secret and/or Shared Control Schemes.",
					"Some Ideal Secret Sharing Schemes.",
					"Cartesian Authentication Schemes.",
					"How to Say \"No\".",
					"Key Minimal Authentication Systems for Unconditional Secrecy.",
					"Parallel Generation of Recurring Sequences.",
					"Keysystem Sequences with a Good Linear Complexity Profile for Every STrating Point.",
					"On the Complexity of Pseudo-Random Sequences - Or: If You Can Describe a Sequence It Can't be Random.",
					"Feedforward Functions Defined By de Bruijn Sequences.",
					"Nonlinearity Criteria for Cryptographic Functions.",
					"On the Linear Complexity of Feedback Registers (Extended Abstract).",
					"Linear Complexity Profiles and Continued Fractions.",
					"A Fats Correlation Attack on Nonlinearly Feedforward Filtered Shift-Register Sequences.",
					"On the Complexity and Efficiency of a New Key Exchange System.",
					"A New Multiple Key Cipher and an Improved Voting Scheme.",
					"Atkin's Test: News From the Front.",
					"Fast Generation of Secure RSA-Moduli with Almost Maximal Diversity.",
					"Deciphering Bronze Age Scripts of Crete - The Case of Linear A.",
					"Faster Primality Testing (Extended Abstract).",
					"Private-Key Algebraic-Code Cryptosystems with High Information Rates (Extended Abstract).",
					"Zero-Knowledge Procedures for Confidential Access to Medical Records (Extended Summary).",
					"Full Secure Key Exchange and Authentication with no Previously Shared Secrets.",
					"Varying Feedback Shift Registers.",
					"A Cryptanalysis of Stepk, m-Cascades.",
					"Efficient Identification and Signatures for Smart Cards (Abstract).",
					"The Dining Cryptographers in the Disco - Underconditional Sender and Recipient Untraceability with Computationally Secure Serviceability (Abstract).",
					"Some Conditions on the Linear Complexity Profiles of Certain Binary Sequences.",
					"On the Design of Permutation P in DES Type Cryptosystems.",
					"A Fast Elliptic Curve Cryptosystem."
				]
			}
		]
	},
	{
		"year": "1988",
		"name": "EUROCRYPT 1988",
		"info": "Davos, Switzerland",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/88",
				"sub_name": "Advances in Cryptology - EUROCRYPT '88, Workshop on the Theory and Application of of Cryptographic Techniques, Davos, Switzerland, May 25-27, 1988, Proceedings.",
				"count": 40,
				"papers": [
					"Key Agreements Based on Function Composition.",
					"Security of Improved Identity-Based Conference Key Distribution Systems.",
					"Subliminal-Free Authentication and Signature (Extended Abstract).",
					"Zero-Knowledge Proofs of Identity And Veracity of Transaction Receipts.",
					"Authentication Codes with Multiple Arbiters (Extended Abstract).",
					"Some Constructions for Authentication-Secrecy Codes.",
					"Efficient Zero-Knowledge Identification Scheme for Smart Cards.",
					"A Smart Card Implementation of the Fiat-Shamir Identification Scheme.",
					"Manipulations and Errors, Detection and Localization.",
					"Privacy Protected Payments - Realization of a Protocol that Guarantees Payer Anonymity.",
					"A Practical Zero-Knowledge Protocol Fitted to Security Microprocessor Minimizing Both Transmission and Memory.",
					"A Generalized Birthday Attack.",
					"An Interactive Data Exchange Protocol Based on Discrete Exponentiation.",
					"Anonymous and Verifiable Registration in Databases.",
					"Elections with Unconditionally-Secret Ballots and Disruption Equivalent to Breaking RSA.",
					"Passports and Visas Versus IDS (Extended Abstract).",
					"The Probabilistic Theory of Linear Complexity.",
					"A Probabilistic Primality test Based on the Properties of Certain Generalized Lucas Numbers.",
					"On the Construction of Random Number Generators and Random Function Generators.",
					"Factorization of Large Integers on a Massively Parallel Computer.",
					"A Fast Modular Arithmetic Algorithm Using a Residue Table (Extended Abstract).",
					"Fast Exponentiation in GF(2n).",
					"Fast RSA-Hardware: Dream or Reality?",
					"Properties of the Euler Totient Function Modulo 24 and Some of its Cryptographic Implications.",
					"An Observation on the Security of McEliece's Public-Key Cryptosystem.",
					"How to Break Okamoto's Cryptosystem by Reducing Lattice Bases.",
					"Cryptanalysis of F.E.A.L.",
					"Fast Correlation Attacks on Stream Ciphers (Extended Abstract).",
					"A New Class of Nonlinear Functions for Running-key Generators (Extended Abstract).",
					"Windmill Generators: A Generalization and an Observation of How Many There Are.",
					"Lock-In Effect in Cascades of Clock-Controlled Shift-Registers.",
					"Proof of Massey's Conjectured Algorithm.",
					"Linear Recurring m-Arrays.",
					"Substantial Number of Cryptographic Keys and Its Application to Encryption Designs.",
					"A Measure of Semiequivocation.",
					"Some New Classes of Geometric Threshold Schemes.",
					"A Universal Algorithm for Homophonic Coding.",
					"A New Probabilistic Encryption Scheme.",
					"Public Quadratic Polynominal-Tuples for Efficient Signature-Verification and Message-Encryption.",
					"Some Applications of Multiple Key Ciphers."
				]
			}
		]
	},
	{
		"year": "1987",
		"name": "EUROCRYPT 1987",
		"info": "Amsterdam, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/87",
				"sub_name": "Advances in Cryptology - EUROCRYPT '87, Workshop on the Theory and Application of of Cryptographic Techniques, Amsterdam, The Netherlands, April 13-15, 1987, Proceedings.",
				"count": 27,
				"papers": [
					"In Memoriam Tore Herlestam (1929 - 1986).",
					"Alternating Step Generators Controlled by De Bruijn Sequences.",
					"Generation of Binary Sequences with Controllable Complexity and Ideal r-Tupel Distribution.",
					"Some Remarks on the Cross Correlation Analysis of Pseudo Random Generators.",
					"Sequences With Almost Perfect Linear Complexity Profile.",
					"When Shift Registers Clock Themselves.",
					"Finite State Machine Modelling of Cryptographic Systems in Loops.",
					"Random Sources for Cryptographic Systems.",
					"Physical Protection of Cryptographic Devices.",
					"The RSA Cryptography Processor.",
					"Extension of Brickell's Algorithm for Breaking High Density Knapsacks.",
					"On Privacy Homomorphisms (Extended Abstract).",
					"An Improved Protocol for Demonstrating Possession of Discrete Logarithms and Some Generalizations.",
					"A Public Key Analog Cryptosystem.",
					"Message Authentication with Arbitration of Transmitter/Receiver Disputes.",
					"Perfect and Essentially Perfect Authentication Schemes.",
					"Message Authentication and Dynamic Passwords.",
					"IC-Cards in High-Security Applications.",
					"Collision Free Hash Functions and Public Key Signature Schemes.",
					"Hash-Functions Using Modulo-N Operations.",
					"Blinding for Unanticipated Signatures.",
					"Non-Expanding, Key-Minimal, Robustly-Perfect, Linear and Bilinear Ciphers.",
					"Linear Structures in Blockciphers.",
					"Fast Data Encipherment Algorithm FEAL.",
					"Modes of Blockcipher Algorithms and their Protection Against Active Eavesdropping.",
					"Security Considerations in the Design and Implementation of a new DES chip.",
					"High-Performance Interface Architectures for Cryptographic Hardware."
				]
			}
		]
	},
	{
		"year": "1986",
		"name": "EUROCRYPT 1986",
		"info": "Linköping, Sweden",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/86",
				"sub_name": "EUROCRYPT 1986, A Workshop on the Theory and Application of Cryptographic Techniques, Linköping, Sweden, 20-22 May 1986, Paper Abstracts.",
				"count": 0,
				"papers": []
			}
		]
	},
	{
		"year": "1985",
		"name": "EUROCRYPT 1985",
		"info": "Linz, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/85",
				"sub_name": "Advances in Cryptology - EUROCRYPT '85, Workshop on the Theory and Application of of Cryptographic Techniques, Linz, Austria, April 1985, Proceedings.",
				"count": 32,
				"papers": [
					"The Contribution of E. B. Fleissner and A. Figl for Today's Cryptography.",
					"On the History of Cryptography during WW2, and Possible New Directions for Cryptograpic Research.",
					"Efficient Factoring Based on Partial Information.",
					"A Public-Key Cryptosystem based on Shift Register Sequences.",
					"A Comment on Niederreiter's Public Key Cryptosystem.",
					"Implementation Study of Public Key Cryptographic Protection in an Existing Electronic Mail and Document Handling System.",
					"Cryptanalysis of the Dickson Scheme.",
					"Simultaneous Security of Bits in the Discrete Log.",
					"On Public-Key Cryptosystems Built using Polynomial Rings.",
					"Is the Data Encryption Standard a Group? (Preliminary Abstract).",
					"Two New Secret Key Cryptosystems.",
					"Cryptanalysts Representation of Nonlinearly Filtered ML-Sequences.",
					"Authorized Writing for \"Write-Once\" Memories.",
					"On Functions of Linear Shift Register Sequences.",
					"On Feedforward Transforms and p-Fold Periodic p-Arrays.",
					"Generalized Multiplexed Sequences.",
					"A Note On Sequences Generated by Clock Controlled Shift Registers.",
					"Using Algorithms as Keys in Stream Ciphers.",
					"On the Linear Complexity of Combined Shift Register Sequences.",
					"Analysis of a Nonlinear Feedforward Logic for Binary Sequence Generators.",
					"Linear Complexity and Random Sequences.",
					"Engineering Secure Information Systems.",
					"The Chipcard: An Identification Card With Cryptographic Protection.",
					"Encryption: Needs, Requirements, and SOlutions in Banking Networks.",
					"The Role of Encipherment Services in Distributed Systems.",
					"Modelling of Encryption Techniques for Secrecy and Privacy in Multi-User Networks.",
					"Full Encryption in a Personal Computer System.",
					"Showing Credentials Without Identification: SIgnatures Transferred Between Unconditionally Unlinkable Pseudonyms.",
					"Networks Without User Observability: Design Options.",
					"The Verifiability of Two-Party Protocols.",
					"The Practice of Authentication.",
					"Message Protection by Spread Spectrum Modulation in a Packet Voice Radio Link."
				]
			}
		]
	},
	{
		"year": "1984",
		"name": "EUROCRYPT 1984",
		"info": "Paris, France",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/84",
				"sub_name": "Advances in Cryptology: Proceedings of EUROCRYPT 84, A Workshop on the Theory and Application of of Cryptographic Techniques, Paris, France, April 9-11, 1984, Proceedings.",
				"count": 36,
				"papers": [
					"Cryptology and Complexity Theories.",
					"On Cryptosystems Based on Polynomials and Finite Fields.",
					"Algebraical Structures of Cryptographic Transformations.",
					"Non-Linear Non-Commutative Functions for Data Integrity.",
					"Wire-Tap Channel II.",
					"Equivolcations for Homophonic Ciphers.",
					"Propagation Characteristics of the DES.",
					"Linear Ciphers and Random Sequence Generators with Multiple Clocks.",
					"The Stop-and-Go Generator.",
					"Pseudo Random Properties of Cascade Connections of Clock Controlled Shift Registers.",
					"On the Linear Complexity of Cascaded Sequences.",
					"RSA-Bits are 0.5 + epsilon Secure.",
					"On the Number of Close-and-Equal Pairs of Bits in a String.",
					"Fast Cryptanalysis of the Matsumoto-Imai Public Key Scheme.",
					"A New Trapdoor Knapsack Public-Key Cryptosystem.",
					"RSA Chips (Past/Present/Future).",
					"The Quadratic Sieve Factoring Algorithm.",
					"Status Report on Factoring (At the Sandia National Laboratories).",
					"Strong Primes are Easy to Find.",
					"Discrete Logarithms in Finite Fields and Their Cryptographic Significance.",
					"User Functions for the Generation and Distribution of Encipherment Keys.",
					"An Optimal Class of Symmetric Key Generation Systems.",
					"On the Use of the Binary Multiplying Channel in a Private Communication System.",
					"Secrecy and Privacy in a Local Area Network Environment.",
					"The Subliminal Channel and Digital Signature.",
					"A Provably Secure Oblivious Transfer Protocol.",
					"On Concurrent Identification Protocols.",
					"Time-division Multiplexing Scramblers: Selecting Permutations and Testing the Systems.",
					"Security of Transportable Computerized Files.",
					"Encryption and Key Manaagement for the ECS Satellite Service.",
					"An Encryption and Authentication Procedure for Telesurveillance Systems.",
					"A Method of Software Protection Based on the Use of Smart Cards and Cryptographic Techniques.",
					"Smart Card Applications in Security and Data Protection.",
					"Bull CP8 Smart Card Uses in Cryptology.",
					"Estimation of Some Encryption Functions Implemented into Smart Cards.",
					"Smart Cards and Conditional Access."
				]
			}
		]
	},
	{
		"year": "1983",
		"name": "Workshop on Cryptography 1983",
		"info": "Udine, Italy",
		"venues": []
	},
	{
		"year": "1982",
		"name": "Workshop on Cryptography 1982",
		"info": "Burg Feuerstein, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/eurocrypt/82",
				"sub_name": "Cryptography, Proceedings of the Workshop on Cryptography, Burg Feuerstein, Germany, March 29 - April 2, 1982.",
				"count": 26,
				"papers": [
					"Introduction.",
					"Cryptology - Methods and Maxims.",
					"Cryptanalysis of a Kryha Machine.",
					"Enigma Variations.",
					"Encrypting by Random Rotations.",
					"Analog Speech security Systems.",
					"A voice Scrambling System for Testing and Demonstration.",
					"The Rating of Understanding in Secure Voice Communication Systems.",
					"Analysis of Multiple Access Channel using Multiple Level FSK.",
					"Analog Scrambling by the General Fast Fourier Transform.",
					"Stream Ciphers.",
					"Multiplexed Sequences: Some Properties of the Minimum Polynomial.",
					"On Using Prime Polynomials in Crypto Generators.",
					"Communication Security in Remote controlled Computer Systems.",
					"Privacy and Data Protection in Medicine.",
					"Cryptonalysis of the Data Encryption Standard by the Method of Formal Coding.",
					"Are Big S-Boxes Best?",
					"The average Cycle size of the Key-Stream in Output Feedback Encipherment.",
					"Authentication Procedures.",
					"Fast Authentication in a Trapdoor - Knapsack Public Key Cryptosystem.",
					"A new Algorithm for the Solution of the Knapsack Problem.",
					"Trapdoors in Knapsack Cryptosystems.",
					"Is the RSA Scheme Safe?",
					"Ein Effizienzvergleich der Factorisierungsverfahren von Morrison-Brillhart und Schroeppel.",
					"Finite Semigroups and the RSA-Cryptosystem.",
					"How to Share a Secret?"
				]
			}
		]
	}
]