[
    {
        "year": "2021",
        "name": "25th Financial Cryptography 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2021-1",
                "sub_name": "Financial Cryptography and Data Security - 25th International Conference, FC 2021, Virtual Event, March 1-5, 2021, Revised Selected Papers, Part I.",
                "count": 24,
                "papers": [
                    "Attacking the DeFi Ecosystem with Flash Loans for Fun and Profit.",
                    "The Eye of Horus: Spotting and Analyzing Attacks on Ethereum Smart Contracts.",
                    "Timelocked Bribing.",
                    "Shielded Computations in Smart Contracts Overcoming Forks.",
                    "A Formal Model of Algorand Smart Contracts.",
                    "Everything You Ever Wanted to Know About Bitcoin Mixers (But Were Afraid to Ask).",
                    "Perimeter: A Network-Layer Attack on the Anonymity of Cryptocurrencies.",
                    "An Empirical Analysis of Privacy in the Lightning Network.",
                    "Cross-Layer Deanonymization Methods in the Lightning Protocol.",
                    "The Complex Shape of Anonymity in Cryptocurrencies: Case Studies from a Systematic Approach.",
                    "Improving the Efficiency of AES Protocols in Multi-Party Computation.",
                    "Rabbit: Efficient Comparison for Secure Multi-Party Computation.",
                    "Efficient Noise Generation to Achieve Differential Privacy with Applications to Secure Multiparty Computation.",
                    "Specfuscator: Evaluating Branch Removal as a Spectre Mitigation.",
                    "Speculative Dereferencing: Reviving Foreshadow.",
                    "Sigforgery: Breaking and Fixing Data Authenticity in Sigfox.",
                    "Short Paper: Terrorist Fraud in Distance Bounding: Getting Around the Models.",
                    "SoK: Securing Email - A Stakeholder-Based Analysis.",
                    "Zero-Knowledge Proofs for Set Membership: Efficient, Succinct, Modular.",
                    "Generic Plaintext Equality and Inequality Proofs.",
                    "Somewhere Statistically Binding Commitment Schemes with Applications.",
                    "Another Look at Extraction and Randomization of Groth's zk-SNARK.",
                    "BooLigero: Improved Sublinear Zero Knowledge Proofs for Boolean Circuits.",
                    "Mining for Privacy: How to Bootstrap a Snarky Blockchain."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2021-2",
                "sub_name": "Financial Cryptography and Data Security - 25th International Conference, FC 2021, Virtual Event, March 1-5, 2021, Revised Selected Papers, Part II.",
                "count": 30,
                "papers": [
                    "SoK: Communication Across Distributed Ledgers.",
                    "Reparo: Publicly Verifiable Layer to Repair Blockchains.",
                    "Short Paper: Debt Representation in UTXO Blockchains.",
                    "Instant Block Confirmation in the Sleepy Model.",
                    "Blockchain CAP Theorem Allows User-Dependent Adaptivity and Finality.",
                    "PoSAT: Proof-of-Work Availability and Unpredictability, Without the Work.",
                    "Post-Quantum Adaptor Signature for Privacy-Preserving Off-Chain Payments.",
                    "FPPW: A Fair and Privacy Preserving Watchtower for Bitcoin.",
                    "Congestion Attacks in Payment Channel Networks.",
                    "Payment Trees: Low Collateral Payments for Payment Channel Networks.",
                    "Brick: Asynchronous Incentive-Compatible Payment Channels.",
                    "Ignore the Extra Zeroes: Variance-Optimal Mining Pools.",
                    "HaPPY-Mine: Designing a Mining Reward Function.",
                    "Selfish Mining Attacks Exacerbated by Elastic Hash Supply.",
                    "Fraud and Data Availability Proofs: Detecting Invalid Blocks in Light Clients.",
                    "ACeD: Scalable Data Availability Oracle.",
                    "Efficient State Management in Distributed Ledgers.",
                    "Fast Isomorphic State Channels.",
                    "What's in Score for Website Users: A Data-Driven Long-Term Study on Risk-Based Authentication Characteristics.",
                    "DAHash: Distribution Aware Tuning of Password Hashing Costs.",
                    "Short Paper: Organizational Security: Implementing a Risk-Reduction-Based Incentivization Model for MFA Adoption.",
                    "Lost in Transmission: Investigating Filtering of COVID-19 Websites.",
                    "Under the Hood of the Ethereum Gossip Protocol.",
                    "Liquidations: DeFi on a Knife-Edge.",
                    "High-Threshold AVSS with Optimal Communication Complexity.",
                    "Fine-Grained Forward Secrecy: Allow-List/Deny-List Encryption and Applications.",
                    "Faster Homomorphic Encryption over GPGPUs via Hierarchical DGT.",
                    "Multi-instance Publicly Verifiable Time-Lock Puzzle and Its Applications.",
                    "Practical Post-quantum Few-Time Verifiable Random Function with Applications to Algorand.",
                    "Practical Witness-Key-Agreement for Blockchain-Based Dark Pools Financial Trading."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2021w",
                "sub_name": "Financial Cryptography and Data Security. FC 2021 International Workshops - CoDecFin, DeFi, VOTING, and WTSC, Virtual Event, March 5, 2021, Revised Selected Papers.",
                "count": 43,
                "papers": [
                    "Risk Framework for Bitcoin Custody Operation with the Revault Protocol.",
                    "Regulatory Considerations on Centralized Aspects of DeFi Managed by DAOs.",
                    "Collaborative Deanonymization.",
                    "Re: FinCEN Docket Number FINCEN-2020-0020; RIN 1506-AB47; Requirements for Certain Transactions Involving Convertible Virtual Currency or Digital Assets.",
                    "Analyzing FinCEN's Proposed Regulation Relating to AML and KYC Laws.",
                    "Optimal Fees for Geometric Mean Market Makers.",
                    "Market Based Mechanisms for Incentivising Exchange Liquidity Provision.",
                    "Understand Volatility of Algorithmic Stablecoin: Modeling, Verification and Empirical Analysis.",
                    "Measuring Asset Composability as a Proxy for DeFi Integration.",
                    "Demystifying Pythia: A Survey of ChainLink Oracles Usage on Ethereum.",
                    "On Stablecoin Price Processes and Arbitrage.",
                    "Red-Black Coins: Dai Without Liquidations.",
                    "Formal Analysis of Composable DeFi Protocols.",
                    "How to Exploit a DeFi Project.",
                    "DeFi as an Information Aggregator.",
                    "A Game-Theoretic Analysis of Cross-ledger Swaps with Packetized Payments.",
                    "Wendy Grows Up: More Order Fairness.",
                    "Measuring Illicit Activity in DeFi: The Case of Ethereum.",
                    "Global Order Routing on Exchange Networks.",
                    "Towards a Theory of Decentralized Finance.",
                    "Auditing Hamiltonian Elections.",
                    "Cast-as-Intended: A Formal Definition and Case Studies.",
                    "Mobile Voting - Still Too Risky?",
                    "New Standards for E-Voting Systems: Reflections on Source Code Examinations.",
                    "Post-quantum Online Voting Scheme.",
                    "Short Paper: Ballot Secrecy for Liquid Democracy.",
                    "Shorter Lattice-Based Zero-Knowledge Proofs for the Correctness of a Shuffle.",
                    "On-Chain Smart Contract Verification over Tendermint.",
                    "Publicly Verifiable and Secrecy Preserving Periodic Auctions.",
                    "EthVer: Formal Verification of Randomized Ethereum Smart Contracts.",
                    "Absentia: Secure Multiparty Computation on Ethereum.",
                    "Empirical Analysis of On-chain Voting with Smart Contracts.",
                    "Mirroring Public Key Infrastructures to Blockchains for On-Chain Authentication.",
                    "Reactive Key-Loss Protection in Blockchains.",
                    "Merkle Trees Optimized for Stateless Clients in Bitcoin.",
                    "Soft Power: Upgrading Chain Macroeconomic Policy Through Soft Forks.",
                    "Privacy-Preserving Resource Sharing Using Permissioned Blockchains - (The Case of Smart Neighbourhood).",
                    "SoK: Algorithmic Incentive Manipulation Attacks on Permissionless PoW Cryptocurrencies.",
                    "Pay to Win: Cheap, Cross-Chain Bribing Attacks on PoW Cryptocurrencies.",
                    "SoK: Lending Pools in Decentralized Finance.",
                    "Standardized Crypto-Loans on the Cardano Blockchain.",
                    "Fairness in ERC Token Markets: A Case Study of CryptoKitties.",
                    "Coins, Covid, Keynes and K-Shaped Recovery."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "24th Financial Cryptography 2020",
        "info": "Kota Kinabalu, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2020",
                "sub_name": "Financial Cryptography and Data Security - 24th International Conference, FC 2020, Kota Kinabalu, Malaysia, February 10-14, 2020 Revised Selected Papers.",
                "count": 36,
                "papers": [
                    "Leveraging Bitcoin Testnet for Bidirectional Botnet Command and Control Systems.",
                    "Security Analysis on dBFT Protocol of NEO.",
                    "Breaking the Encryption Scheme of the Moscow Internet Voting System.",
                    "Short Paper: XOR Arbiter PUFs Have Systematic Response Bias.",
                    "Selfish Mining Re-Examined.",
                    "Fairness and Efficiency in DAG-Based Cryptocurrencies.",
                    "Stake Shift in Major Cryptocurrencies: An Empirical Study.",
                    "Coded Merkle Tree: Solving Data Availability Attacks in Blockchains.",
                    "Decentralized Privacy-Preserving Netting Protocol on Blockchain for Payment Systems.",
                    "The Arwen Trading Protocols.",
                    "SoK: A Classification Framework for Stablecoin Designs.",
                    "SoK: Layer-Two Blockchain Protocols.",
                    "MicroCash: Practical Concurrent Processing of Micropayments.",
                    "LockDown: Balance Availability Attack Against Lightning Network Channels.",
                    "Ride the Lightning: The Game Theory of Payment Channels.",
                    "How to Profit from Payments Channels.",
                    "Boomerang: Redundancy Improves Latency and Throughput in Payment-Channel Networks.",
                    "DLSAG: Non-interactive Refund Transactions for Interoperable Payment Channels in Monero.",
                    "Cerberus Channels: Incentivizing Watchtowers for Bitcoin.",
                    "Communication-Efficient (Client-Aided) Secure Two-Party Protocols and Its Application.",
                    "Secure Computation of the kth-Ranked Element in a Star Network.",
                    "Insured MPC: Efficient Secure Computation with Financial Penalties.",
                    "Zether: Towards Privacy in a Smart Contract World.",
                    "An Airdrop that Preserves Recipient Privacy.",
                    "RingCT 3.0 for Blockchain Confidential Transaction: Shorter Size and Stronger Security.",
                    "BLAZE: Practical Lattice-Based Blind Signatures for Privacy-Preserving Applications.",
                    "Non-interactive Proofs of Proof-of-Work.",
                    "Proof-of-Burn.",
                    "Non-interactive Cryptographic Timestamping Based on Verifiable Delay Functions.",
                    "Open Market or Ghost Town? The Curious Case of OpenBazaar.",
                    "Exploring the Monero Peer-to-Peer Network.",
                    "Surviving the Cryptojungle: Perception and Management of Risk Among North American Cryptocurrency (Non)Users.",
                    "Address Clustering Heuristics for Ethereum.",
                    "What are the Actual Flaws in Important Smart Contracts (And How Can We Find Them)?",
                    "Characterizing Code Clones in the Ethereum Smart Contract Ecosystem.",
                    "Smart Contracts for Government Processes: Case Study and Prototype Implementation (Short Paper)."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2020w",
                "sub_name": "Financial Cryptography and Data Security - FC 2020 International Workshops, AsiaUSEC, CoDeFi, VOTING, and WTSC, Kota Kinabalu, Malaysia, February 14, 2020, Revised Selected Papers.",
                "count": 42,
                "papers": [
                    "Tale of Two Browsers: Understanding Users' Web Browser Choices in South Korea.",
                    "User-Centered Risk Communication for Safer Browsing.",
                    "Secure Email - A Usability Study.",
                    "The Effects of Cue Utilization and Cognitive Load in the Detection of Phishing Emails.",
                    "Cue Utilization, Phishing Feature and Phishing Email Detection.",
                    "Dis-Empowerment Online: An Investigation of Privacy-Sharing Perceptions and Method Preferences.",
                    "Security and Privacy Awareness in Smart Environments - A Cross-Country Investigation.",
                    "Understanding Perceptions of Smart Devices.",
                    "In Our Employer We Trust: Mental Models of Office Workers' Privacy Perceptions.",
                    "Behaviour of Outsourced Employees as Sources of Information System Security Threats.",
                    "Exploring Effects of Auditory Stimuli on CAPTCHA Performance.",
                    "PassPage: Graphical Password Authentication Scheme Based on Web Browsing Records.",
                    "Empathy as a Response to Frustration in Password Choice.",
                    "Fixing the Fixes: Assessing the Solutions of SAST Tools for Securing Password Storage.",
                    "Incorporating Psychology into Cyber Security Education: A Pedagogical Approach.",
                    "Effectiveness of Multi-stakeholder Discussions for Decentralized Finance: A Conference Report of CoDeFi 2020.",
                    "Multistakeholder Governance for the Internet.",
                    "Future of Finance - From G20 to Practical Implementation of Multi-stakeholder Governance on Blockchain Based Finance.",
                    "Securing Cryptocurrency Exchange: Building up Standard from Huge Failures.",
                    "Origami Voting: A Non-cryptographic Approach to Transparent Ballot Verification.",
                    "Towards Improving the Efficacy of Code-Based Verification in Internet Voting.",
                    "Short Paper: Mechanized Proofs of Verifiability and Privacy in a Paper-Based E-Voting Scheme.",
                    "Sets of Half-Average Nulls Generate Risk-Limiting Audits: SHANGRLA.",
                    "A Note on Risk-Limiting Bayesian Polling Audits for Two-Candidate Elections.",
                    "Vote Selling Resistant Voting.",
                    "Short Paper: An Update on Marked Mix-Nets: An Attack, a Fix and PQ Possibilities.",
                    "Performance of Shuffling: Taking It to the Limits.",
                    "Characterizing Types of Smart Contracts in the Ethereum Landscape.",
                    "Smart Contract Development from the Perspective of Developers: Topics and Issues Discussed on Social Media.",
                    "Bypassing Non-Outsourceable Proof-of-Work Schemes Using Collateralized Smart Contracts.",
                    "Scalable Open-Vote Network on Ethereum.",
                    "How to Dynamically Incentivize Sufficient Level of IoT Security.",
                    "Confidential and Auditable Payments.",
                    "MAPPCN: Multi-hop Anonymous and Privacy-Preserving Payment Channel Network.",
                    "Marlowe: Implementing and Analysing Financial Contracts on Blockchain.",
                    "Load Balancing for Sharded Blockchains.",
                    "The Extended UTXO Model.",
                    "Privacy-Preserving Cross-Chain Atomic Swaps.",
                    "A Blockchain Based Approach to Resource Sharing in Smart Neighbourhoods.",
                    "Enforcing Determinism of Java Smart Contracts.",
                    "Albert, An Intermediate Smart-Contract Language for the Tezos Blockchain.",
                    "A Formally Verified Static Analysis Framework for Compositional Contracts."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "23rd Financial Cryptography 2019",
        "info": "Frigate Bay, St. Kitts and Nevis",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2019",
                "sub_name": "Financial Cryptography and Data Security - 23rd International Conference, FC 2019, Frigate Bay, St. Kitts and Nevis, February 18-22, 2019, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "Biased Nonce Sense: Lattice Attacks Against Weak ECDSA Signatures in Cryptocurrencies.",
                    "Snow White: Robustly Reconfigurable Consensus and Applications to Provably Secure Proof of Stake.",
                    "Compounding of Wealth in Proof-of-Stake Cryptocurrencies.",
                    "Short Paper: I Can't Believe It's Not Stake! Resource Exhaustion Attacks on PoS.",
                    "Short Paper: An Exploration of Code Diversity in the Cryptocurrency Landscape.",
                    "Short Paper: An Empirical Analysis of Blockchain Forks in Bitcoin.",
                    "Detecting Token Systems on Ethereum.",
                    "Measuring Ethereum-Based ERC20 Token Networks.",
                    "New Empirical Traceability Analysis of CryptoNote-Style Blockchains.",
                    "Short Paper: An Empirical Analysis of Monero Cross-chain Traceability.",
                    "PRCash: Fast, Private and Regulated Transactions for Digital Currencies.",
                    "ZLiTE: Lightweight Clients for Shielded Zcash Transactions Using Trusted Execution.",
                    "Designed to Be Broken: A Reverse Engineering Study of the 3D Secure 2.0 Payment Protocol.",
                    "Short Paper: Making Contactless EMV Robust Against Rogue Readers Colluding with Relay Attackers.",
                    "Short Paper: How to Attack PSD2 Internet Banking.",
                    "Your Money or Your Life - Modeling and Analyzing the Security of Electronic Payment in the UC Framework.",
                    "Secure Trick-Taking Game Protocols - How to Play Online Spades with Cheaters.",
                    "ROYALE: A Framework for Universally Composable Card Games with Financial Rewards and Penalties Enforcement.",
                    "Universally Verifiable MPC and IRV Ballot Counting.",
                    "Synchronous Byzantine Agreement with Expected O(1) Rounds, Expected O(n2) Communication, and Optimal Resilience.",
                    "Oblivious PRF on Committed Vector Inputs and Application to Deduplication of Encrypted Data.",
                    "Adaptively Secure Constrained Pseudorandom Functions.",
                    "LARA: A Design Concept for Lattice-Based Encryption.",
                    "Short Paper: The Proof is in the Pudding - Proofs of Work for Solving Discrete Logarithms.",
                    "Minimizing Trust in Hardware Wallets with Two Factor Signatures.",
                    "A Formal Treatment of Hardware Wallets.",
                    "VeriSolid: Correct-by-Design Smart Contracts for Ethereum.",
                    "Bitcoin Security Under Temporary Dishonest Majority.",
                    "VAPOR: A Value-Centric Blockchain that is Scale-out, Decentralized, and Flexible by Design.",
                    "Sprites and State Channels: Payment Networks that Go Faster Than Lightning.",
                    "Echoes of the Past: Recovering Blockchain Metrics from Merged Mining.",
                    "TxProbe: Discovering Bitcoin's Network Topology Using Orphan Transactions.",
                    "Forecasting Suspicious Account Activity at Large-Scale Online Service Providers.",
                    "Thinking Like a Fraudster: Detecting Fraudulent Transactions via Statistical Sequential Features.",
                    "Secure Multiparty PageRank Algorithm for Collaborative Fraud Detection.",
                    "HEALED: HEaling & Attestation for Low-End Embedded Devices.",
                    "One-Time Programs Made Practical.",
                    "Statement Voting.",
                    "Fast Authentication from Aggregate Signatures with Improved Security."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2019w",
                "sub_name": "Financial Cryptography and Data Security - FC 2019 International Workshops, VOTING and WTSC, St. Kitts, St. Kitts and Nevis, February 18-22, 2019, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Two-Party State Channels with Assertions.",
                    "Short Paper: Secure Offline Payments in Bitcoin.",
                    "Proof-of-Work Sidechains.",
                    "You Sank My Battleship! A Case Study to Evaluate State Channels as a Scaling Solution for Cryptocurrencies.",
                    "Game-Theoretic Analysis of an Incentivized Verifiable Computation System.",
                    "Sluggish Mining: Profiting from the Verifier's Dilemma.",
                    "Short Paper: Deploying PayWord on Ethereum.",
                    "SoK: Development of Secure Smart Contracts - Lessons from a Graduate Course.",
                    "Verification-Led Smart Contracts.",
                    "A Java Framework for Smart Contracts.",
                    "Is Solidity Solid Enough?",
                    "Building Executable Secure Design Models for Smart Contracts with Formal Methods.",
                    "SoK: Transparent Dishonesty: Front-Running Attacks on Blockchain.",
                    "Trustee: Full Privacy Preserving Vickrey Auction on Top of Ethereum.",
                    "Election Manipulation 100.",
                    "Bernoulli Ballot Polling: A Manifest Improvement for Risk-Limiting Audits.",
                    "k-Cut: A Simple Approximately-Uniform Method for Sampling Ballots in Post-election Audits.",
                    "How to Assess the Usability Metrics of E-Voting Schemes.",
                    "Improving the Performance of Cryptographic Voting Protocols.",
                    "PrivApollo - Secret Ballot E2E-V Internet Voting.",
                    "End-to-End Verifiable Quadratic Voting with Everlasting Privacy.",
                    "Lattice-Based Proof of a Shuffle."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "22nd Financial Cryptography 2018",
        "info": "Nieuwpoort, Curaçao",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2018",
                "sub_name": "Financial Cryptography and Data Security - 22nd International Conference, FC 2018, Nieuwpoort, Curaçao, February 26 - March 2, 2018, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "\"Major Key Alert!\" Anomalous Keys in Tor Relays.",
                    "On Purpose and by Necessity: Compliance Under the GDPR.",
                    "MP3: A More Efficient Private Presence Protocol.",
                    "Short Unique Signatures from RSA with a Tight Security Reduction (in the Random Oracle Model).",
                    "Weak-Unforgeable Tags for Secure Supply Chain Management.",
                    "Proof of Censorship: Enabling Centralized Censorship-Resistant Content Providers.",
                    "An Economic Study of the Effect of Android Platform Fragmentation on Security Updates.",
                    "The Rules of Engagement for Bug Bounty Programs.",
                    "Why Johnny Doesn't Use Two Factor A Two-Phase Usability Study of the FIDO U2F Security Key.",
                    "High-Precision Privacy-Preserving Real-Valued Function Evaluation.",
                    "Faster Unbalanced Private Set Intersection.",
                    "SWiM: Secure Wildcard Pattern Matching from OT Extension.",
                    "Attacks Against GSMA's M2M Remote Provisioning (Short Paper).",
                    "Rescuing LoRaWAN 1.0.",
                    "Not So Predictable Mining Pools: Attacking Solo Mining Pools by Bagging Blocks and Conning Competitors.",
                    "Practically Efficient Secure Distributed Exponentiation Without Bit-Decomposition.",
                    "A Fourier Analysis Based Attack Against Physically Unclonable Functions.",
                    "On the Computational Complexity of Minimal Cumulative Cost Graph Pebbling.",
                    "Pricing Anonymity.",
                    "A New Look at the Refund Mechanism in the Bitcoin Payment Protocol.",
                    "Anonymous Reputation Systems Achieving Full Dynamicity from Lattices.",
                    "Estimating Profitability of Alternative Cryptocurrencies (Short Paper).",
                    "A Quantitative Analysis of the Impact of Arbitrary Blockchain Content on Bitcoin.",
                    "Decentralization in Bitcoin and Ethereum Networks.",
                    "Anonymous Post-Quantum Cryptocash.",
                    "SpaceMint: A Cryptocurrency Based on Proofs of Space.",
                    "Kaleidoscope: An Efficient Poker Protocol with Payment Distribution and Penalty Enforcement.",
                    "Designing Secure Ethereum Smart Contracts: A Finite State Machine Based Approach.",
                    "A Formal Model of Bitcoin Transactions."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2018w",
                "sub_name": "Financial Cryptography and Data Security - FC 2018 International Workshops, BITCOIN, VOTING, and WTSC, Nieuwpoort, Curaçao, March 2, 2018, Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "Smart Contracts for Bribing Miners.",
                    "A Systematic Approach to Cryptocurrency Fees.",
                    "A Wild Velvet Fork Appears! Inclusive Blockchain Protocol Changes in Practice - (Short Paper).",
                    "Confidential Assets.",
                    "A Multi-party Protocol for Constructing the Public Parameters of the Pinocchio zk-SNARK.",
                    "Analysis of the Bitcoin UTXO Set.",
                    "Hostile Blockchain Takeovers (Short Paper).",
                    "Analyzing the Bitcoin Ponzi Scheme Ecosystem.",
                    "Exploiting Transaction Accumulation and Double Spends for Topology Inference in Bitcoin.",
                    "Egalitarian Society or Benevolent Dictatorship: The State of Cryptocurrency Governance.",
                    "Blockchain-Based Certificate Transparency and Revocation Transparency.",
                    "A Verifiable Shuffle for the GSW Cryptosystem.",
                    "Outsourcing Modular Exponentiation in Cryptographic Web Applications.",
                    "Voting Technologies, Recount Methods and Votes in Wisconsin and Michigan in 2016.",
                    "Towards Everlasting Privacy and Efficient Coercion Resistance in Remote Electronic Voting.",
                    "Modeling a Bulletin Board Service Based on Broadcast Channels with Memory.",
                    "Verifiability of Helios Mixnet.",
                    "Verifiable Sealed-Bid Auction on the Ethereum Blockchain.",
                    "The Scalability of Trustless Trust.",
                    "The Game Among Bribers in a Smart Contract System.",
                    "Lightweight Blockchain Logging for Data-Intensive Applications.",
                    "Proof-Carrying Smart Contracts.",
                    "Comparative Analysis of the Legal Concept of Title Rights in Real Estate and the Technology of Tokens: How Can Titles Become Tokens?",
                    "Ghazal: Toward Truly Authoritative Web Certificates Using Ethereum.",
                    "Toward Cryptocurrency Lending."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "21st Financial Cryptography 2017",
        "info": "Sliema, Malta",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2017",
                "sub_name": "Financial Cryptography and Data Security - 21st International Conference, FC 2017, Sliema, Malta, April 3-7, 2017, Revised Selected Papers.",
                "count": 35,
                "papers": [
                    "An Efficient Self-blindable Attribute-Based Credential Scheme.",
                    "Real Hidden Identity-Based Signatures.",
                    "BehavioCog: An Observation Resistant Authentication Scheme.",
                    "Updatable Tokenization: Formal Definitions and Provably Secure Constructions.",
                    "SecGDB: Graph Encryption for Exact Shortest Distance Queries with Efficient Updates.",
                    "Outsourcing Medical Dataset Analysis: A Possible Solution.",
                    "Homomorphic Proxy Re-Authenticators and Applications to Verifiable Multi-User Data Aggregation.",
                    "A Provably Secure PKCS#11 Configuration Without Authenticated Attributes.",
                    "A Post-quantum Digital Signature Scheme Based on Supersingular Isogenies.",
                    "Optimally Sound Sigma Protocols Under DCRA.",
                    "Economically Optimal Variable Tag Length Message Authentication.",
                    "PEEP: Passively Eavesdropping Private Input via Brainwave Signals.",
                    "Fantastic Timers and Where to Find Them: High-Resolution Microarchitectural Attacks in JavaScript.",
                    "Attacks on Secure Logging Schemes.",
                    "Economy Class Crypto: Exploring Weak Cipher Usage in Avionic Communications via ACARS.",
                    "Short Paper: A Longitudinal Study of Financial Apps in the Google Play Store.",
                    "Short Paper: Addressing Sophisticated Email Attacks.",
                    "Escrow Protocols for Cryptocurrencies: How to Buy Physical Goods Using Bitcoin.",
                    "Trust Is Risk: A Decentralized Financial Trust Platform.",
                    "A Smart Contract for Boardroom Voting with Maximum Voter Privacy.",
                    "Improving Authenticated Dynamic Dictionaries, with Applications to Cryptocurrencies.",
                    "Short Paper: Service-Oriented Sharding for Blockchains.",
                    "The Security of NTP's Datagram Protocol.",
                    "Short Paper: On Deployment of DNS-Based Security Enhancements.",
                    "A Practical Multivariate Blind Signature Scheme.",
                    "Efficient Round-Optimal Blind Signatures in the Standard Model.",
                    "Secure Multiparty Computation from SGX.",
                    "Efficient No-dictionary Verifiable Searchable Symmetric Encryption.",
                    "Faster Homomorphic Evaluation of Discrete Fourier Transforms.",
                    "Short Paper: TLS Ecosystems in Networked Devices vs. Web Servers.",
                    "Unilaterally-Authenticated Key Exchange.",
                    "Formal Modeling and Verification for Domain Validation and ACME.",
                    "Why Banker Bob (Still) Can't Get TLS Right: A Security Analysis of TLS in Leading UK Banking Apps.",
                    "Lavinia: An Audit-Payment Protocol for Censorship-Resistant Storage.",
                    "A Simpler Rate-Optimal CPIR Protocol."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2017w",
                "sub_name": "Financial Cryptography and Data Security - FC 2017 International Workshops, WAHC, BITCOIN, VOTING, WTSC, and TA, Sliema, Malta, April 7, 2017, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "Simple Encrypted Arithmetic Library - SEAL v2.1.",
                    "Towards Privacy-Preserving Multi-party Bartering.",
                    "Multi-level Access in Searchable Symmetric Encryption.",
                    "Privacy-Preserving Computations of Predictive Medical Models with Minimax Approximation and Non-Adjacent Form.",
                    "Private Outsourced Kriging Interpolation.",
                    "An Analysis of FV Parameters Impact Towards Its Hardware Acceleration.",
                    "Controlled Homomorphic Encryption: Definition and Construction.",
                    "ValueShuffle: Mixing Confidential Transactions for Comprehensive Transaction Privacy in Bitcoin.",
                    "Could Network Information Facilitate Address Clustering in Bitcoin?",
                    "Switch Commitments: A Safety Switch for Confidential Transactions.",
                    "(Short Paper) PieceWork: Generalized Outsourcing Control for Proofs of Work.",
                    "Enhancing Bitcoin Transactions with Covenants.",
                    "Decentralized Prediction Market Without Arbiters.",
                    "An Analysis of Bitcoin OP_RETURN Metadata.",
                    "Constant-Deposit Multiparty Lotteries on Bitcoin.",
                    "Exchange Pattern Mining in the Bitcoin Transaction Directed Hypergraph.",
                    "Incentivizing Blockchain Forks via Whale Transactions.",
                    "Mixing Coins of Different Quality: A Game-Theoretic Approach.",
                    "Smart Contracts Make Bitcoin Mining Pools Vulnerable.",
                    "BatchVote: Voting Rules Designed for Auditability.",
                    "Existential Assertions for Voting Protocols.",
                    "Marked Mix-Nets.",
                    "Pseudo-Code Algorithms for Verifiable Re-encryption Mix-Nets.",
                    "Using Selene to Verify Your Vote in JCJ.",
                    "A Roadmap to Fully Homomorphic Elections: Stronger Security, Better Verifiability.",
                    "Enabling Vote Delegation for Boardroom Voting.",
                    "Practical Governmental Voting with Unconditional Integrity and Privacy.",
                    "Findel: Secure Derivative Contracts for Ethereum.",
                    "Decentralized Execution of Smart Contracts: Agent Model Perspective and Its Implications.",
                    "A Concurrent Perspective on Smart Contracts.",
                    "An Empirical Analysis of Smart Contracts: Platforms, Applications, and Design Patterns.",
                    "Trust in Smart Contracts is a Process, As Well.",
                    "Defining the Ethereum Virtual Machine for Interactive Theorem Provers.",
                    "SmartCast: An Incentive Compatible Consensus Protocol Using Smart Contracts.",
                    "On the Feasibility of Decentralized Derivatives Markets.",
                    "A Proof-of-Stake Protocol for Consensus on Bitcoin Subchains.",
                    "X-Platform Phishing: Abusing Trust for Targeted Attacks Short Paper.",
                    "What to Phish in a Subject?",
                    "Unpacking Spear Phishing Susceptibility."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "20th Financial Cryptography 2016",
        "info": "Christ Church, Barbados",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2016",
                "sub_name": "Financial Cryptography and Data Security - 20th International Conference, FC 2016, Christ Church, Barbados, February 22-26, 2016, Revised Selected Papers.",
                "count": 36,
                "papers": [
                    "Understanding Craigslist Rental Scams.",
                    "Graph Analytics for Real-Time Scoring of Cross-Channel Transactional Fraud.",
                    "Android UI Deception Revisited: Attacks and Defenses.",
                    "Introducing Reputation Systems to the Economics of Outsourcing Computations to Rational Workers.",
                    "Accountable Privacy for Decentralized Anonymous Payments.",
                    "Private eCash in Practice (Short Paper).",
                    "Practically Efficient Secure Single-Commodity Multi-market Auctions.",
                    "How to Challenge and Cast Your e-Vote.",
                    "VD-PSI: Verifiable Delegated Private Set Intersection on Outsourced Private Datasets.",
                    "Confidential Benchmarking Based on Multiparty Computation.",
                    "Efficiently Making Secure Two-Party Computation Fair.",
                    "Fast Optimistically Fair Cut-and-Choose 2PC.",
                    "CuriousDroid: Automated User Interface Interaction for Android Application Analysis Sandboxes.",
                    "DroydSeuss: A Mobile Banking Trojan Tracker (Short Paper).",
                    "DroidAuditor: Forensic Analysis of Application-Layer Privilege Escalation Attacks on Android (Short Paper).",
                    "Discrete Choice, Social Interaction, and Policy in Encryption Technology Adoption (Short Paper).",
                    "Failures of Security APIs: A New Case.",
                    "Explicit Optimal Binary Pebbling for One-Way Hash Chain Reversal.",
                    "Factoring as a Service.",
                    "The Self-blindable U-Prove Scheme from FC'14 Is Forgeable (Short Paper).",
                    "A Sound for a Sound: Mitigating Acoustic Side Channel Attacks on Password Keystrokes with Active Sounds.",
                    "Leaky Birds: Exploiting Mobile Application Traffic for Surveillance.",
                    "Footprint Scheduling for Dining-Cryptographer Networks.",
                    "How Anywhere Computing Just Killed Your Phone-Based Two-Factor Authentication.",
                    "Security Keys: Practical Cryptographic Second Factors for the Modern Web.",
                    "Include Me Out: In-Browser Detection of Malicious Third-Party Content Inclusions.",
                    "A Sensitivity-Adaptive ρ-Uncertainty Model for Set-Valued Data.",
                    "Incentive Compatibility of Bitcoin Mining Pool Reward Functions.",
                    "When Cryptocurrencies Mine Their Own Business.",
                    "Optimal Selfish Mining Strategies in Bitcoin.",
                    "A Short Paper on Blind Signatures from Knowledge Assumptions.",
                    "KBID: Kerberos Bracelet Identification (Short Paper).",
                    "The Other Side of the Coin: User Experiences with Bitcoin Security and Privacy.",
                    "Refund Attacks on Bitcoin's Payment Protocol.",
                    "Are Payment Card Contracts Unfair? (Short Paper).",
                    "The Bitcoin Brain Drain: Examining the Use and Abuse of Bitcoin Brain Wallets."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2016w",
                "sub_name": "Financial Cryptography and Data Security - FC 2016 International Workshops, BITCOIN, VOTING, and WAHC, Christ Church, Barbados, February 26, 2016, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Stressing Out: Bitcoin \"Stress Testing\".",
                    "Why Buy When You Can Rent? - Bribery Attacks on Bitcoin-Style Consensus.",
                    "Automated Verification of Electrum Wallet.",
                    "Blindly Signed Contracts: Anonymous On-Blockchain and Off-Blockchain Bitcoin Transactions.",
                    "Proofs of Proofs of Work with Sublinear Complexity.",
                    "Step by Step Towards Creating a Safe Smart Contract: Lessons and Insights from a Cryptocurrency Lab.",
                    "EthIKS: Using Ethereum to Audit a CONIKS Key Transparency Log.",
                    "On Scaling Decentralized Blockchains - (A Position Paper).",
                    "Bitcoin Covenants.",
                    "Cryptocurrencies Without Proof of Work.",
                    "Coercion-Resistant Internet Voting with Everlasting Privacy.",
                    "Selene: Voting with Transparent Verifiability and Coercion-Mitigation.",
                    "On the Possibility of Non-interactive E-Voting in the Public-Key Setting.",
                    "Efficiency Comparison of Various Approaches in E-Voting Protocols.",
                    "Remote Electronic Voting Can Be Efficient, Verifiable and Coercion-Resistant.",
                    "Universal Cast-as-Intended Verifiability.",
                    "Hiding Access Patterns in Range Queries Using Private Information Retrieval and ORAM.",
                    "Optimizing MPC for Robust and Scalable Integer and Floating-Point Arithmetic.",
                    "On-the-fly Homomorphic Batching/Unbatching.",
                    "Using Intel Software Guard Extensions for Efficient Two-Party Secure Function Evaluation.",
                    "CallForFire: A Mission-Critical Cloud-Based Application Built Using the Nomad Framework.",
                    "Cryptographic Solutions for Genomic Privacy."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "19th Financial Cryptography 2015",
        "info": "San Juan, Puerto Rico",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2015",
                "sub_name": "Financial Cryptography and Data Security - 19th International Conference, FC 2015, San Juan, Puerto Rico, January 26-30, 2015, Revised Selected Papers.",
                "count": 34,
                "papers": [
                    "What Satoshi Did Not Know.",
                    "Are You at Risk? Profiling Organizations and Individuals Subject to Targeted Attacks.",
                    "Computer-Supported Cooperative Crime.",
                    "There's No Free Lunch, Even Using Bitcoin: Tracking the Popularity and Profits of Virtual Currency Scams.",
                    "Multi-class Traffic Morphing for Encrypted VoIP Communication.",
                    "Protecting Encrypted Cookies from Compression Side-Channel Attacks.",
                    "Fingerprinting Web Users Through Font Metrics.",
                    "Sorting and Searching Behind the Curtain.",
                    "Resizable Tree-Based Oblivious RAM.",
                    "Sublinear Scaling for Multi-Client Private Information Retrieval.",
                    "Relay Cost Bounding for Contactless EMV Payments.",
                    "Private and Secure Public-Key Distance Bounding - Application to NFC Payment.",
                    "Purchase Details Leaked to PayPal.",
                    "How the Estonian Tax and Customs Board Evaluated a Tax Fraud Detection System Based on Secure Multi-party Computation.",
                    "Tactile One-Time Pad: Leakage-Resilient Authentication for Smartphones.",
                    "User Authentication Using Human Cognitive Abilities.",
                    "Smart and Secure Cross-Device Apps for the Internet of Advanced Things.",
                    "Signatures and Efficient Proofs on Committed Graphs and NP-Statements.",
                    "Efficient Statically-Secure Large-Universe Multi-Authority Attribute-Based Encryption.",
                    "Augmented Learning with Errors: The Untapped Potential of the Error Term.",
                    "BabelCrypt: The Universal Encryption Layer for Mobile Messaging Applications.",
                    "METDS - A Self-contained, Context-Based Detection System for Evil Twin Access Points.",
                    "Market-Driven Code Provisioning to Mobile Secure Hardware.",
                    "On Non-cooperative Genomic Privacy.",
                    "A Short Paper on the Incentives to Share Private Information for Population Estimates.",
                    "Paying the Guard: An Entry-Guard-Based Payment System for Tor.",
                    "Proof-of-Work as Anonymous Micropayment: Rewarding a Tor Relay.",
                    "Privacy Preserving Collaborative Filtering from Asymmetric Randomized Encoding.",
                    "Anonymous and Publicly Linkable Reputation Systems.",
                    "Hard Drive Side-Channel Attacks Using Smartphone Magnetic Field Sensors.",
                    "Hierarchical Deterministic Bitcoin Wallets that Tolerate Key Leakage.",
                    "Secure High-Rate Transaction Processing in Bitcoin.",
                    "Inclusive Block Chain Protocols.",
                    "VeriStream - A Framework for Verifiable Data Streaming."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2015w",
                "sub_name": "Financial Cryptography and Data Security - FC 2015 International Workshops, BITCOIN, WAHC, and Wearable, San Juan, Puerto Rico, January 30, 2015, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "On the Malleability of Bitcoin Transactions.",
                    "Trends, Tips, Tolls: A Longitudinal Study of Bitcoin Transaction Fees.",
                    "ZombieCoin: Powering Next-Generation Botnets with Bitcoin.",
                    "Cuckoo Cycle: A Memory Bound Graph-Theoretic Proof-of-Work.",
                    "When Bitcoin Mining Pools Run Dry - A Game-Theoretic Analysis of the Long-Term Impact of Attacks Between Mining Pools.",
                    "Issues in Designing a Bitcoin-like Community Currency.",
                    "The Bitcoin Market Potential Index.",
                    "Cryptographic Currencies from a Tech-Policy Perspective: Policy Issues and Technical Directions.",
                    "Blindcoin: Blinded, Accountable Mixes for Bitcoin.",
                    "Privacy-Enhancing Overlays in Bitcoin.",
                    "Search-and-Compute on Encrypted Data.",
                    "Accelerating SWHE Based PIRs Using GPUs.",
                    "Combining Secret Sharing and Garbled Circuits for Efficient Private IEEE 754 Floating-Point Computations.",
                    "Cryptanalysis of a (Somewhat) Additively Homomorphic Encryption Scheme Used in PIR.",
                    "Homomorphic Computation of Edit Distance.",
                    "HEtest: A Homomorphic Encryption Testing Framework.",
                    "Users' Privacy Concerns About Wearables - Impact of Form Factor, Sensors and Type of Data Collected.",
                    "On Vulnerabilities of the Security Association in the IEEE 802.15.6 Standard.",
                    "Visual Cryptography and Obfuscation: A Use-Case for Decrypting and Deobfuscating Information Using Augmented Reality.",
                    "Ok Glass, Leave Me Alone: Towards a Systematization of Privacy Enhancing Technologies for Wearable Computing.",
                    "Design and Analysis of Shoulder Surfing Resistant PIN Based Authentication Mechanisms on Google Glass.",
                    "Glass OTP: Secure and Convenient User Authentication on Google Glass."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "18th Financial Cryptography 2014",
        "info": "Christ Church, Barbados",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2014",
                "sub_name": "Financial Cryptography and Data Security - 18th International Conference, FC 2014, Christ Church, Barbados, March 3-7, 2014, Revised Selected Papers.",
                "count": 31,
                "papers": [
                    "Digital Check Forgery Attacks on Client Check Truncation Systems.",
                    "Security Protocols and Evidence: Where Many Payment Systems Fail.",
                    "The Ghosts of Banking Past: Empirical Analysis of Closed Bank Websites.",
                    "Hawk and Aucitas: e-Auction Schemes from the Helios and Civitas e-Voting Schemes.",
                    "Sex, Lies, or Kittens? Investigating the Use of Snapchat's Self-Destructing Messages.",
                    "On the Awareness, Control and Privacy of Shared Photo Metadata.",
                    "Outsmarting Proctors with Smartwatches: A Case Study on Wearable Computing Security.",
                    "A Secure Data Deduplication Scheme for Cloud Storage.",
                    "Confidentiality Issues on a GPU in a Virtualized Environment.",
                    "Elligator Squared: Uniform Points on Elliptic Curves of Prime Order as Uniform Random Strings.",
                    "Elliptic Curve Cryptography in Practice.",
                    "Practical Secure Decision Tree Learning in a Teletreatment Application.",
                    "Scaling Private Set Intersection to Billion-Element Sets.",
                    "Efficient Non-Interactive Zero Knowledge Arguments for Set Operations.",
                    "Garbled Searchable Symmetric Encryption.",
                    "Efficient and Strongly Secure Dynamic Domain-Specific Pseudonymous Signatures for ID Documents.",
                    "A Short Paper on How to Improve U-Prove Using Self-Blindable Certificates.",
                    "Attack on U-Prove Revocation Scheme from FC'13 - Passing Verification by Revoked Users.",
                    "Sample or Random Security - A Security Model for Segment-Based Visual Cryptography.",
                    "You Won't Be Needing These Any More: On Removing Unused Certificates from Trust Stores.",
                    "Challenges in Protecting Tor Hidden Services from Botnet Abuse.",
                    "Identifying Risk Factors for Webserver Compromise.",
                    "Drone to the Rescue: Relay-Resilient Authentication using Ambient Multi-sensing.",
                    "On the (In)Security of Mobile Two-Factor Authentication.",
                    "MoP-2-MoP - Mobile Private Microblogging.",
                    "Privacy Preserving Tâtonnement - A Cryptographic Construction of an Incentive Compatible Market.",
                    "Estimating Systematic Risk in Real-World Networks.",
                    "Majority Is Not Enough: Bitcoin Mining Is Vulnerable.",
                    "BitIodine: Extracting Intelligence from the Bitcoin Network.",
                    "An Analysis of Anonymity in Bitcoin Using P2P Network Traffic.",
                    "Mixcoin: Anonymity for Bitcoin with Accountable Mixes."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2014w",
                "sub_name": "Financial Cryptography and Data Security - FC 2014 Workshops, BITCOIN and WAHC 2014, Christ Church, Barbados, March 7, 2014, Revised Selected Papers.",
                "count": 19,
                "papers": [
                    "How Did Dread Pirate Roberts Acquire and Protect his Bitcoin Wealth?",
                    "Towards Risk Scoring of Bitcoin Transactions.",
                    "Challenges and Opportunities Associated with a Bitcoin-Based Transaction Rating System.",
                    "Bitcoin: A First Legal Analysis - With Reference to German and US-American Law.",
                    "Empirical Analysis of Denial-of-Service Attacks in the Bitcoin Ecosystem.",
                    "Game-Theoretic Analysis of DDoS Attacks Against Bitcoin Mining Pools.",
                    "The Bitcoin P2P Network.",
                    "Fair Two-Party Computations via Bitcoin Deposits.",
                    "Increasing Anonymity in Bitcoin.",
                    "Rational Zero: Economic Security for Zerocoin with Everlasting Anonymity.",
                    "On Offline Payments with Bitcoin (Poster Abstract).",
                    "One Weird Trick to Stop Selfish Miners: Fresh Bitcoins, A Solution for the Honest Miner (Poster Abstract).",
                    "From Bitcoin to the Brixton Pound: History and Prospects for Alternative Currencies (Poster Abstract).",
                    "High-Speed Fully Homomorphic Encryption Over the Integers.",
                    "Practical and Privacy-Preserving Policy Compliance for Outsourced Data.",
                    "Bandwidth Efficient PIR from NTRU.",
                    "Toward Practical Homomorphic Evaluation of Block Ciphers Using Prince.",
                    "A Scalable Implementation of Fully Homomorphic Encryption Built on NTRU.",
                    "Restructuring the NSA Metadata Program."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "17th Financial Cryptography 2013",
        "info": "Okinawa, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2013",
                "sub_name": "Financial Cryptography and Data Security - 17th International Conference, FC 2013, Okinawa, Japan, April 1-5, 2013, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "Can Nature Help Us Solve Risk Management Issues?",
                    "Quantitative Analysis of the Full Bitcoin Transaction Graph.",
                    "Beware the Middleman: Empirical Analysis of Bitcoin-Exchange Risk.",
                    "Evaluating User Privacy in Bitcoin.",
                    "The Importance of Being Earnest [In Security Warnings].",
                    "Exploring Extrinsic Motivation for Better Security: A Usability Study of Scoring-Enhanced Device Pairing.",
                    "RelationGram: Tie-Strength Visualization for User-Controlled Online Identity Authentication.",
                    "Practical Fully Simulatable Oblivious Transfer with Sublinear Communication.",
                    "Unconditionally-Secure Robust Secret Sharing with Minimum Share Size.",
                    "A Scalable Scheme for Privacy-Preserving Aggregation of Time-Series Data.",
                    "\"Give Me Letters 2, 3 and 6!\": Partial Password Implementations and Attacks.",
                    "Hey, You, Get Off of My Clipboard - On How Usability Trumps Security in Android Password Managers.",
                    "Unique Ring Signatures: A Practical Construction.",
                    "Aggregating CL-Signatures Revisited: Extended Functionality and Better Efficiency.",
                    "Accumulators and U-Prove Revocation.",
                    "Towards a Publicly-Verifiable Mix-Net Providing Everlasting Privacy.",
                    "P4R: Privacy-Preserving Pre-Payments with Refunds for Transportation Systems.",
                    "Coupon Collector's Problem for Fault Analysis against AES - High Tolerance for Noisy Fault Injections.",
                    "Mitigating Smart Card Fault Injection with Link-Time Code Rewriting: A Feasibility Study.",
                    "On the Need of Physical Security for Small Embedded Devices: A Case Study with COMP128-1 Implementations in SIM Cards.",
                    "Securely Solving Simple Combinatorial Graph Problems.",
                    "Parallel and Dynamic Searchable Symmetric Encryption.",
                    "GMW vs. Yao? Efficient Secure Two-Party Computation with Low Depth Circuits.",
                    "The Untapped Potential of Trusted Execution Environments on Mobile Devices.",
                    "Stark - Tamperproof Authentication to Resist Keylogging.",
                    "Risks of Offline Verify PIN on Contactless Cards.",
                    "How to Attack Two-Factor Authentication Internet Banking.",
                    "CAge: Taming Certificate Authorities by Inferring Restricted Scopes.",
                    "Interdependent Privacy: Let Me Share Your Data.",
                    "A Secure Submission System for Online Whistleblowing Platforms.",
                    "Securing Anonymous Communication Channels under the Selective DoS Attack.",
                    "PIRMAP: Efficient Private Information Retrieval for MapReduce.",
                    "Avoiding Theoretical Optimality to Efficiently and Privately Retrieve Security Updates.",
                    "Three-Factor User Authentication Method Using Biometrics Challenge Response.",
                    "Synthetic Logs Generator for Fraud Detection in Mobile Transfer Services.",
                    "Onions for Sale: Putting Privacy on the Market.",
                    "Searchable Encryption Supporting General Boolean Expression Queries.",
                    "A Privacy Preserving E-Payment Architecture.",
                    "Communication Services Empowered with a Classical Chaos Based Cryptosystem."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2013w",
                "sub_name": "Financial Cryptography and Data Security - FC 2013 Workshops, USEC and WAHC 2013, Okinawa, Japan, April 1, 2013, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "I Think, Therefore I Am: Usability and Security of Authentication Using Brainwaves.",
                    "Usability and Security of Gaze-Based Graphical Grid Passwords.",
                    "The Impact of Length and Mathematical Operators on the Usability and Security of System-Assigned One-Time PINs.",
                    "QRishing: The Susceptibility of Smartphone Users to QR Code Phishing Attacks.",
                    "\"Comply or Die\" Is Dead: Long Live Security-Aware Principal Agents.",
                    "Information Security as a Credence Good.",
                    "Sorry, I Don't Get It: An Analysis of Warning Message Texts.",
                    "Soulmate or Acquaintance? Visualizing Tie Strength for Trust Inference.",
                    "Awareness about Photos on the Web and How Privacy-Privacy-Tradeoffs Could Help.",
                    "Bootstrapping Trust in Online Dating: Social Verification of Online Dating Profiles.",
                    "SHADE: Secure HAmming DistancE Computation from Oblivious Transfer.",
                    "Garbled Circuits via Structured Encryption.",
                    "On the Minimal Number of Bootstrappings in Homomorphic Circuits.",
                    "Privacy Preserving Data Processing with Collaboration of Homomorphic Cryptosystems.",
                    "Parallel Homomorphic Encryption.",
                    "Targeting FPGA DSP Slices for a Large Integer Multiplier for Integer Based FHE."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "16th Financial Cryptography 2012",
        "info": "Kralendijk, Bonaire",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2012",
                "sub_name": "Financial Cryptography and Data Security - 16th International Conference, FC 2012, Kralendijk, Bonaire, Februray 27-March 2, 2012, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "Social Authentication: Harder Than It Looks.",
                    "The MVP Web-Based Authentication Framework - (Short Paper).",
                    "A Birthday Present Every Eleven Wallets? The Security of Customer-Chosen Banking PINs.",
                    "The Postmodern Ponzi Scheme: Empirical Analysis of High-Yield Investment Programs.",
                    "Deploying Secure Multi-Party Computation for Financial Data Analysis - (Short Paper).",
                    "Cryptographic Rule-Based Trading - (Short Paper).",
                    "Efficient Private Proximity Testing with GSM Location Sketches.",
                    "Metrics for Measuring ISP Badness: The Case of Spam - (Short Paper).",
                    "Congestion-Aware Path Selection for Tor.",
                    "Attacking the Washington, D.C. Internet Voting System.",
                    "Security Audits Revisited.",
                    "Efficient, Compromise Resilient and Append-Only Cryptographic Schemes for Secure Audit Logging.",
                    "On Secure Two-Party Integer Division.",
                    "A Non-interactive Range Proof with Constant Communication.",
                    "Privacy-Preserving Stream Aggregation with Fault Tolerance.",
                    "Dynamic Accumulator Based Discretionary Access Control for Outsourced Storage with Unlinkable Access - (Short Paper).",
                    "Privacy Enhanced Access Control for Outsourced Data Sharing.",
                    "Designing Privacy-Preserving Smart Meters with Low-Cost Microcontrollers.",
                    "Memory-Efficient Garbled Circuit Generation for Mobile Devices.",
                    "Oblivious Decision Programs from Oblivious Transfer: Efficient Reductions.",
                    "UC-Secure Searchable Symmetric Encryption.",
                    "CTL: A Platform-Independent Crypto Tools Library Based on Dataflow Programming Paradigm.",
                    "A Cache Timing Attack on AES in Virtualization Environments.",
                    "Softer Smartcards - Usable Cryptographic Tokens with Secure Execution.",
                    "The PACE|AA Protocol for Machine Readable Travel Documents, and Its Security.",
                    "Oblivious Printing of Secret Messages in a Multi-party Setting.",
                    "Reverse Fuzzy Extractors: Enabling Lightweight Mutual Authentication for PUF-Enabled RFIDs.",
                    "CommitCoin: Carbon Dating Commitments with Bitcoin - (Short Paper).",
                    "Bitter to Better - How to Make Bitcoin a Better Currency."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2012w",
                "sub_name": "Financial Cryptography and Data Security - FC 2012 Workshops, USEC and WECSR 2012, Kralendijk, Bonaire, March 2, 2012, Revised Selected Papers.",
                "count": 13,
                "papers": [
                    "Linguistic Properties of Multi-word Passphrases.",
                    "Understanding the Weaknesses of Human-Protocol Interaction.",
                    "High Stakes: Designing a Privacy Preserving Registry.",
                    "Protected Login.",
                    "Enabling Users to Self-manage Networks: Collaborative Anomaly Detection in Wireless Personal Area Networks.",
                    "A Conundrum of Permissions: Installing Applications on an Android Smartphone.",
                    "Methodology for a Field Study of Anti-malware Software.",
                    "My Privacy Policy: Exploring End-user Specification of Free-form Location Access Rules.",
                    "Spamming for Science: Active Measurement in Web 2.0 Abuse Research.",
                    "A Refined Ethical Impact Assessment Tool and a Case Study of Its Application.",
                    "It's Not Stealing If You Need It: A Panel on the Ethics of Performing Research Using Public Data of Illicit Origin.",
                    "Ethics Committees and IRBs: Boon, or Bane, or More Research Needed?",
                    "Ethical and Secure Data Sharing across Borders."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "15th Financial Cryptography 2011",
        "info": "Gros Islet, St. Lucia",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2011",
                "sub_name": "Financial Cryptography and Data Security - 15th International Conference, FC 2011, Gros Islet, St. Lucia, February 28 - March 4, 2011, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "Collective Exposure: Peer Effects in Voluntary Disclosure of Personal Data.",
                    "It's All about the Benjamins: An Empirical Study on Incentivizing Users to Ignore Security Advice.",
                    "Evaluating the Privacy Risk of Location-Based Services.",
                    "Selections: Internet Voting with Over-the-Shoulder Coercion-Resistance.",
                    "Malice versus AN.ON: Possible Risks of Missing Replay and Integrity Protection.",
                    "Absolute Pwnage: A Short Paper about the Security Risks of Remote Administration Tools.",
                    "A Protocol for Anonymously Establishing Digital Provenance in Reseller Chains (Short Paper).",
                    "Impeding Individual User Profiling in Shopper Loyalty Programs.",
                    "Beyond Risk-Based Access Control: Towards Incentive-Based Access Control.",
                    "Authenticated Key Exchange under Bad Randomness.",
                    "Oblivious Outsourced Storage with Delegation.",
                    "Homomorphic Signatures for Digital Photographs.",
                    "Revisiting the Computational Practicality of Private Information Retrieval.",
                    "Optimal One Round Almost Perfectly Secure Message Transmission (Short Paper).",
                    "A New Approach towards Coercion-Resistant Remote E-Voting in Linear Time.",
                    "An Attack on PUF-Based Session Key Exchange and a Hardware-Based Countermeasure: Erasable PUFs.",
                    "Peeling Away Layers of an RFID Security System.",
                    "Might Financial Cryptography Kill Financial Innovation? - The Curious Case of EMV.",
                    "hPIN/hTAN: A Lightweight and Low-Cost E-Banking Solution against Untrusted Computers.",
                    "Certified Lies: Detecting and Defeating Government Interception Attacks against SSL (Short Paper).",
                    "Proximax: Measurement-Driven Proxy Dissemination (Short Paper).",
                    "BNymble: More Anonymous Blacklisting at Almost No Cost (A Short Paper).",
                    "Towards Secure Bioinformatics Services (Short Paper).",
                    "Quo Vadis? A Study of the Evolution of Input Validation Vulnerabilities in Web Applications.",
                    "Re-evaluating the Wisdom of Crowds in Assessing Web Security.",
                    "Mercury: Recovering Forgotten Passwords Using Personal Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2011w",
                "sub_name": "Financial Cryptography and Data Security - FC 2011 Workshops, RLCPS and WECSR 2011, Rodney Bay, St. Lucia, February 28 - March 4, 2011, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "Cryptographic Protocols: From the Abstract to the Practical to the Actual.",
                    "Toward Real-Life Implementation of Signature Schemes from the Strong RSA Assumption.",
                    "Detailed Cost Estimation of CNTW Attack against EMV Signature Scheme.",
                    "Fast Elliptic Curve Cryptography in OpenSSL.",
                    "Cryptographic Treatment of Private User Profiles.",
                    "An Introspection-Based Memory Scraper Attack against Virtualized Point of Sale Systems.",
                    "A Study on Computational Formal Verification for Practical Cryptographic Protocol: The Case of Synchronous RFID Authentication.",
                    "Biometric Transaction Authentication Protocol: Formal Model Verification and \"Four-Eyes\" Principle Extension.",
                    "Exploration and Field Study of a Password Manager Using Icon-Based Passwords.",
                    "Ethical Issues in E-Voting Security Analysis.",
                    "Computer Security Research with Human Subjects: Risks, Benefits and Informed Consent.",
                    "Human Subjects, Agents, or Bots: Current Issues in Ethics and Computer Security Research.",
                    "Enforced Community Standards for Research on Users of the Tor Anonymity Network.",
                    "Ethical Dilemmas in Take-Down Research.",
                    "Ethical Considerations of Sharing Data for Cybersecurity Research.",
                    "Moving Forward, Building an Ethics Community (Panel Statements)."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "14th Financial Cryptography 2010",
        "info": "Tenerife, Canary Islands, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2010",
                "sub_name": "Financial Cryptography and Data Security, 14th International Conference, FC 2010, Tenerife, Canary Islands, Spain, January 25-28, 2010, Revised Selected Papers.",
                "count": 43,
                "papers": [
                    "Constructive Cryptography - A Primer.",
                    "Security Mechanisms with Selfish Players in Wireless Networks.",
                    "Users Do the Darndest Things: True Stories from the CyLab Usable Privacy and Security Laboratory.",
                    "Multichannel Protocols to Prevent Relay Attacks.",
                    "A Traceability Attack against e-Passports.",
                    "Secure Computation with Fixed-Point Numbers.",
                    "Implementing a High-Assurance Smart-Card OS.",
                    "Unlinkable Priced Oblivious Transfer with Rechargeable Wallets.",
                    "Multiple Denominations in E-cash with Compact Transaction Data.",
                    "What's in a Name?",
                    "Cryptographic Protocol Analysis of AN.ON.",
                    "A CDH-Based Ring Signature Scheme with Short Signatures and Public Keys.",
                    "Practical Private Set Intersection Protocols with Linear Complexity.",
                    "Design and Implementation of a Key-Lifecycle Management System.",
                    "Measuring the Perpetrators and Funders of Typosquatting.",
                    "A Learning-Based Approach to Reactive Security.",
                    "Embedded SFE: Offloading Server and Network Using Hardware Tokens.",
                    "The Phish-Market Protocol: Securely Sharing Attack Data between Competitors.",
                    "Building Incentives into Tor.",
                    "Tree-Homomorphic Encryption and Scalable Hierarchical Secret-Ballot Elections.",
                    "Automatically Preparing Safe SQL Queries.",
                    "PKI Layer Cake: New Collision Attacks against the Global X.509 Infrastructure.",
                    "Three-Round Abuse-Free Optimistic Contract Signing with Everlasting Secrecy.",
                    "Designing for Audit: A Voting Machine with a Tiny TCB.",
                    "Attacking of SmartCard-Based Banking Applications with JavaScript-Based Rootkits.",
                    "Security Applications of Diodes with Unique Current-Voltage Characteristics.",
                    "Verified by Visa and MasterCard SecureCode: Or, How Not to Design Authentication.",
                    "All You Can Eat or Breaking a Real-World Contactless Payment System.",
                    "Shoulder-Surfing Safe Login in a Partially Observable Attacker Model.",
                    "Using Sphinx to Improve Onion Routing Circuit Construction.",
                    "Secure Multiparty AES.",
                    "Modulo Reduction for Paillier Encryptions and Application to Secure Statistical Analysis.",
                    "On Robust Key Agreement Based on Public Key Authentication.",
                    "A Formal Approach for Automated Reasoning about Off-Line and Undetectable On-Line Guessing.",
                    "Signatures of Reputation.",
                    "Intention-Disguised Algorithmic Trading.",
                    "When Information Improves Information Security.",
                    "BetterThanPin: Empowering Users to Fight Phishing (Poster).",
                    "Certification Intermediaries and the Alternative (Poster).",
                    "SeDiCi: An Authentication Service Taking Advantage of Zero-Knowledge Proofs.",
                    "Poster Abstract: Security in Commercial Applications of Vehicular Ad-Hoc Networks.",
                    "Domain Engineering for Automatic Analysis of Financial Applications of Cryptographic Protocols.",
                    "hPIN/hTAN: Low-Cost e-Banking Secure against Untrusted Computers."
                ]
            },
            {
                "sub_name_abbr": "conf/fc/2010w",
                "sub_name": "Financial Cryptography and Data Security, FC 2010 Workshops, RLCPS, WECSR, and WLC 2010, Tenerife, Canary Islands, Spain, January 25-28, 2010, Revised Selected Papers.",
                "count": 24,
                "papers": [
                    "WLC Preface.",
                    "Hummingbird: Ultra-Lightweight Cryptography for Resource-Constrained Devices.",
                    "Lighten Encryption Schemes for Secure and Private RFID Systems.",
                    "Analysis and Improvement of a Pseudorandom Number Generator for EPC Gen2 Tags.",
                    "A Note on a Fatal Error of Optimized LFC Private Information Retrieval Scheme and Its Corrected Results.",
                    "Reliable Food Traceability Using RFID Tagging.",
                    "Lightweight Cryptography and DPA Countermeasures: A Survey.",
                    "Securing the Use of RFID-Enabled Banknotes.",
                    "Increasing Privacy Threats in the Cyberspace: The Case of Italian E-Passports.",
                    "RLCPS Preface.",
                    "SPAKE: A Single-Party Public-Key Authenticated Key Exchange Protocol for Contact-Less Applications.",
                    "A Secure and Privacy-Preserving Targeted Ad-System.",
                    "Cryptographic Cloud Storage.",
                    "Extending IPsec for Efficient Remote Attestation.",
                    "Open Mobile Alliance Secure Content Exchange: Introducing Key Management Constructs and Protocols for Compromise-Resilient Easing of DRM Restrictions.",
                    "How to Evaluate the Security of Real-Life Cryptographic Protocols? - The Cases of ISO/IEC 29128 and CRYPTREC.",
                    "WECSR Preface.",
                    "Preaching What We Practice: Teaching Ethical Decision-Making to Computer Security Professionals.",
                    "A Case Study on Measuring Statistical Data in the Tor Anonymity Network.",
                    "A Case Study in Ethical Decision Making Regarding Remote Mitigation of Botnets.",
                    "Ethical Proactive Threat Research.",
                    "A Framework for Understanding and Applying Ethical Principles in Network and Security Research.",
                    "Ethical Concerns in Computer Security and Privacy Research Involving Human Subjects.",
                    "Ethical Guidelines for Computer Security Researchers: \"Be Reasonable\"."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "13th Financial Cryptography 2009",
        "info": "Accra Beach, Barbados",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2009",
                "sub_name": "Financial Cryptography and Data Security, 13th International Conference, FC 2009, Accra Beach, Barbados, February 23-26, 2009. Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Mitigating Inadvertent Insider Threats with Incentives.",
                    "Deterring Online Advertising Fraud through Optimal Payment in Arrears.",
                    "Privacy-Preserving Information Markets for Computing Statistical Data.",
                    "Achieving Privacy in a Federated Identity Management System.",
                    "Data Hemorrhages in the Health-Care Sector.",
                    "Solving Linear Programs Using Multiparty Computation.",
                    "Private Intersection of Certified Sets.",
                    "Privacy-Preserving Classifier Learning.",
                    "Investments and Trade-offs in the Economics of Information Security.",
                    "Blue versus Red: Towards a Model of Distributed Security Attacks.",
                    "Optimised to Fail: Card Readers for Online Banking.",
                    "Expecting the Unexpected: Towards Robust Credential Infrastructure.",
                    "Optical DNA.",
                    "Passwords: If We're So Smart, Why Are We Still Using Them?",
                    "Defeating Cross-Site Request Forgery Attacks with Browser-Enforced Authenticity Protection.",
                    "Evil Searching: Compromise and Recompromise of Internet Hosts for Phishing.",
                    "Detecting Denial of Service Attacks in Tor.",
                    "Cryptographic Combinatorial Securities Exchanges.",
                    "Cryptographic Combinatorial Clock-Proxy Auctions.",
                    "Secure Multiparty Computation Goes Live.",
                    "Coercion Resistant End-to-end Voting.",
                    "Relations Among Privacy Notions."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "12th Financial Cryptography 2008",
        "info": "Cozumel, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2008",
                "sub_name": "Financial Cryptography and Data Security, 12th International Conference, FC 2008, Cozumel, Mexico, January 28-31, 2008, Revised Selected Papers.",
                "count": 33,
                "papers": [
                    "Quantifying Resistance to the Sybil Attack.",
                    "Evaluating the Wisdom of Crowds in Assessing Phishing Websites.",
                    "Don't Clog the Queue! Circuit Clogging and Mitigation in P2P Anonymity Schemes.",
                    "An Efficient Deniable Key Exchange Protocol (Extended Abstract).",
                    "Revisiting Pairing Based Group Key Exchange.",
                    "Constant-Round Password-Based Authenticated Key Exchange Protocol for Dynamic Groups.",
                    "A Practical Universal Circuit Construction and Secure Evaluation of Private Functions.",
                    "Generalized Non-Interactive Oblivious Transfer Using Count-Limited Objects with Applications to Secure Mobile Agents.",
                    "PBS: Private Bartering Systems.",
                    "Breaking Legacy Banking Standards with Special-Purpose Hardware.",
                    "ePassport: Securing International Contacts with Contactless Chips.",
                    "Good Variants of HB+ Are Hard to Find.",
                    "Augmenting Internet-Based Card Not Present Transactions with Trusted Computing (Extended Abstract).",
                    "Weighing Down \"The Unbearable Lightness of PIN Cracking\".",
                    "Phishwish: A Stateless Phishing Filter Using Minimal Rules.",
                    "Competition and Fraud in Online Advertising Markets.",
                    "Identity Theft: Much Too Easy? A Study of Online Systems in Norway.",
                    "A Proof of Concept Attack against Norwegian Internet Banking Systems.",
                    "Improvement of Efficiency in (Unconditional) Anonymous Transferable E-Cash.",
                    "Proactive RSA with Non-interactive Signing.",
                    "Fair Traceable Multi-Group Signatures.",
                    "Identity-Based Online/Offline Encryption.",
                    "Countermeasures against Government-Scale Monetary Forgery.",
                    "OpenPGP-Based Financial Instruments and Dispute Arbitration.",
                    "An Efficient Anonymous Credential System.",
                    "Practical Anonymous Divisible E-Cash from Bounded Accumulators.",
                    "Panel: Usable Cryptography: Manifest Destiny or Oxymoron?.",
                    "Real Electronic Cash Versus Academic Electronic Cash Versus Paper Cash (Panel Report).",
                    "Securing Web Banking Applications.",
                    "Privacy Threats in Online Stock Quotes.",
                    "A Platform for OnBoard Credentials.",
                    "ST&E Is the Most Cost Effective Measure for Comply with Payment Card Industry (PCI) Data Security Standard.",
                    "Making Quantitative Measurements of Privacy/Analysis Tradeoffs Inherent to Packet Trace Anonymization."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11th Financial Cryptography 2007",
        "info": "Scarborough, Trinidad and Tobago",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2007",
                "sub_name": "Financial Cryptography and Data Security, 11th International Conference, FC 2007, and 1st International Workshop on Usable Security, USEC 2007, Scarborough, Trinidad and Tobago, February 12-16, 2007. Revised Selected Papers.",
                "count": 36,
                "papers": [
                    "Leaving Room for the Bad Guys.",
                    "Vulnerabilities in First-Generation RFID-enabled Credit Cards.",
                    "Conditional E-Cash.",
                    "A Privacy-Protecting Multi-Coupon Scheme with Stronger Protection Against Splitting.",
                    "Panel: RFID Security and Privacy.",
                    "Position Statement in RFID S&P Panel: RFID and the Middleman.",
                    "Position Statement in RFID S&P Panel: Contactless Smart Cards.",
                    "Position Statement in RFID S&P Panel: From Relative Security to Perceived Secure.",
                    "A Model of Onion Routing with Provable Anonymity.",
                    "K-Anonymous Multi-party Secret Handshakes.",
                    "Using a Personal Device to Strengthen Password Authentication from an Untrusted Computer.",
                    "Scalable Authenticated Tree Based Group Key Exchange for Ad-Hoc Groups.",
                    "On Authentication with HMAC and Non-random Properties.",
                    "Hidden Identity-Based Signatures.",
                    "Space-Efficient Private Search with Applications to Rateless Codes.",
                    "Cryptographic Securities Exchanges.",
                    "Improved Multi-party Contract Signing.",
                    "Informant: Detecting Sybils Using Incentives.",
                    "Dynamic Virtual Credit Card Numbers.",
                    "The Unbearable Lightness of PIN Cracking.",
                    "Virtual Economies: Threats and Risks.",
                    "Usable SPACE: Security, Privacy, and Context for the Mobile User.",
                    "Personal Digital Rights Management for Mobile Cellular Devices.",
                    "Certificate Revocation Using Fine Grained Certificate Space Partitioning.",
                    "An Efficient Aggregate Shuffle Argument Scheme.",
                    "Preface.",
                    "An Evaluation of Extended Validation and Picture-in-Picture Phishing Attacks.",
                    "WSKE: Web Server Key Enabled Cookies.",
                    "Usability Analysis of Secure Pairing Methods.",
                    "Low-Cost Manufacturing, Usability, and Security: An Analysis of Bluetooth Simple Pairing and Wi-Fi Protected Setup.",
                    "Empirical Studies on Software Notices to Inform Policy Makers and Usability Designers.",
                    "What Instills Trust? A Qualitative Study of Phishing.",
                    "Phishing IQ Tests Measure Fear, Not Ability.",
                    "Mental Models of Security Risks.",
                    "Improving Usability by Adding Security to Video Conferencing Systems.",
                    "A Sense of Security in Pervasive Computing - Is the Light on When the Refrigerator Door Is Closed?"
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "10th Financial Cryptography 2006",
        "info": "Anguilla, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2006",
                "sub_name": "Financial Cryptography and Data Security, 10th International Conference, FC 2006, Anguilla, British West Indies, February 27-March 2, 2006, Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "Phoolproof Phishing Prevention.",
                    "A Protocol for Secure Public Instant Messaging.",
                    "Using Automated Banking Certificates to Detect Unauthorised Financial Transactions.",
                    "Privacy in Encrypted Content Distribution Using Private Broadcast Encryption.",
                    "A Private Stable Matching Algorithm.",
                    "Private Policy Negotiation.",
                    "Uncheatable Reputation for Distributed Computation Markets.",
                    "An Efficient Publicly Verifiable Mix-Net for Long Inputs.",
                    "Auditable Privacy: On Tamper-Evident Mix Networks.",
                    "A Practical Implementation of Secure Auctions Based on Multiparty Integer Computation.",
                    "Defeating Malicious Servers in a Blind Signatures Based Voting System.",
                    "Pairing Based Threshold Cryptography Improving on Libert-Quisquater and Baek-Zheng.",
                    "Credit Transfer for Market-Based Infrastructure.",
                    "A Note on Chosen-Basis Decisional Diffie-Hellman Assumptions.",
                    "Cryptanalysis of a Partially Blind Signature Scheme or How to Make $100 Bills with $1 and $2 Ones.",
                    "A Generic Construction for Token-Controlled Public Key Encryption.",
                    "Timed-Release and Key-Insulated Public Key Encryption.",
                    "Conditional Encrypted Mapping and Comparing Encrypted Numbers.",
                    "Revisiting Oblivious Signature-Based Envelopes.",
                    "Provably Secure Electronic Cash Based on Blind Multisignature Schemes.",
                    "Efficient Provably Secure Restrictive Partially Blind Signatures from Bilinear Pairings.",
                    "Privacy-Protecting Coupon System Revisited.",
                    "Efficient Broadcast Encryption Scheme with Log-Key Storage.",
                    "Efficient Correlated Action Selection.",
                    "Efficient Cryptographic Protocols Realizing E-Markets with Price Discrimination."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "9th Financial Cryptography 2005",
        "info": "Roseau, The Commonwealth of Dominica",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2005",
                "sub_name": "Financial Cryptography and Data Security, 9th International Conference, FC 2005, Roseau, The Commonwealth of Dominica, February 28 - March 3, 2005, Revised Papers.",
                "count": 33,
                "papers": [
                    "Fraud Within Asymmetric Multi-hop Cellular Networks.",
                    "Protecting Secret Data from Insider Attacks.",
                    "Countering Identity Theft Through Digital Uniqueness, Location Cross-Checking, and Funneling.",
                    "Trust and Swindling on the Internet.",
                    "Identity-Based Partial Message Recovery Signatures (or How to Shorten ID-Based Signatures).",
                    "Time Capsule Signature.",
                    "Policy-Based Cryptography and Applications.",
                    "A Chat at the Old Phishin' Hole.",
                    "Modeling and Preventing Phishing Attacks.",
                    "Helping the Phish Detect the Lure.",
                    "Who'd Phish from the Summit of Kilimanjaro?.",
                    "A Privacy-Protecting Coupon System.",
                    "Testing Disjointness of Private Datasets.",
                    "RFID Traceability: A Multilayer Problem.",
                    "Information-Theoretic Security Analysis of Physical Uncloneable Functions.",
                    "Risk Assurance for Hedge Funds Using Zero Knowledge Proofs.",
                    "Probabilistic Escrow of Financial Transactions with Cumulative Threshold Disclosure.",
                    "Views, Reactions and Impact of Digitally-Signed Mail in e-Commerce.",
                    "Securing Sensitive Data with the Ingrian DataSecure Platform.",
                    "Ciphire Mail Email Encryption and Authentication.",
                    "A User-Friendly Approach to Human Authentication of Messages.",
                    "Approximate Message Authentication and Biometric Entity Authentication.",
                    "Analysis of a Multi-party Fair Exchange Protocol and Formal Proof of Correctness in the Strand Space Model.",
                    "Achieving Fairness in Private Contract Negotiation.",
                    "Small Coalitions Cannot Manipulate Voting.",
                    "Efficient Privacy-Preserving Protocols for Multi-unit Auctions.",
                    "Event Driven Private Counters.",
                    "Secure Distributed Human Computation.",
                    "Secure Multi-attribute Procurement Auction.",
                    "Audit File Reduction Using N-Gram Models.",
                    "Interactive Diffie-Hellman Assumptions with Applications to Password-Based Authentication.",
                    "Secure Biometric Authentication for Weak Computational Devices.",
                    "Panel Summary: Incentives, Markets and Information Security."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "8th Financial Cryptography 2004",
        "info": "Key West, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2004",
                "sub_name": "Financial Cryptography, 8th International Conference, FC 2004, Key West, FL, USA, February 9-12, 2004. Revised Papers.",
                "count": 26,
                "papers": [
                    "Analyzing the Success and Failure of Recent e-Payment Schemes (Abstract).",
                    "Peppercoin Micropayments.",
                    "Microcredits for Verifiable Foreign Service Provider Metering.",
                    "A Privacy-Friendly Loyalty System Based on Discrete Logarithms over Elliptic Curves.",
                    "Addressing Online Dictionary Attacks with Login Histories and Humans-in-the-Loop (Extended Abstract).",
                    "Call Center Customer Verification by Query-Directed Passwords.",
                    "Cryptography and the French Banking Cards: Past, Present, Future.",
                    "PayPass Security and Risk (Abstract).",
                    "The Vector-Ballot e-Voting Approach.",
                    "Efficient Maximal Privacy in Boardroom Voting and Anonymous Broadcast.",
                    "Usability and Acceptability of Biometric Security Systems.",
                    "Mental Models of Computer Security.",
                    "Visualization Tools for Security Administrators.",
                    "Secure Interaction Design.",
                    "Bringing Payment Technology to the Unbanked (Abstract).",
                    "Interleaving Cryptography and Mechanism Design: The Case of Online Auctions.",
                    "Secure Generalized Vickrey Auction without Third-party Servers.",
                    "Electronic National Lotteries.",
                    "Identity-Based Chameleon Hash and Applications.",
                    "Selecting Correlated Random Actions.",
                    "An Efficient and Usable Multi-show Non-transferable Anonymous Credential System.",
                    "The Ephemeral Pairing Problem.",
                    "Mixminion: Strong Anonymity for Financial Cryptography.",
                    "Practical Anonymity for the Masses with MorphMix.",
                    "Timing Attacks in Low-Latency Mix Systems (Extended Abstract).",
                    "Provable Unlinkability against Traffic Analysis."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "7th Financial Cryptography 2003",
        "info": "Guadeloupe, French West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2003",
                "sub_name": "Financial Cryptography, 7th International Conference, FC 2003, Guadeloupe, French West Indies, January 27-30, 2003, Revised Papers.",
                "count": 22,
                "papers": [
                    "Using Trust Management to Support Transferable Hash-Based Micropayments.",
                    "A Micro-Payment Scheme Encouraging Collaboration in Multi-hop Cellular Networks.",
                    "On the Anonymity of Fair Offline E-cash Systems.",
                    "Retrofitting Fairness on the Original RSA-Based E-cash.",
                    "Does Anyone Really Need MicroPayments?",
                    "The Case Against Micropayments.",
                    "On the Economics of Anonymity.",
                    "Squealing Euros: Privacy Protection in RFID-Enabled Banknotes.",
                    "How Much Security Is Enough to Stop a Thief?: The Economics of Outsider Theft via Computer Systems and Networks.",
                    "Cryptanalysis of the OTM Signature Scheme from FC'02.",
                    "\"Man in the Middle\" Attacks on Bluetooth.",
                    "Fault Based Cryptanalysis of the Advanced Encryption Standard (AES).",
                    "Economics, Psychology, and Sociology of Security.",
                    "Timed Fair Exchange of Standard Signatures: [Extended Abstract].",
                    "Asynchronous Optimistic Fair Exchange Based on Revocable Items.",
                    "Fully Private Auctions in a Constant Number of Rounds.",
                    "Secure Generalized Vickrey Auction Using Homomorphic Encryption.",
                    "Trusted Computing Platforms: The Good, the Bad, and the Ugly.",
                    "On TCPA.",
                    "On The Computation-Storage Trade-Offs of Hash Chain Traversal.",
                    "Verifiable Secret Sharing for General Access Structures, with Application to Fully Distributed Proxy Signatures.",
                    "Non-interactive Zero-Sharing with Applications to Private Distributed Decision Making."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "6th Financial Cryptography 2002",
        "info": "Southampton, Bermuda",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2002",
                "sub_name": "Financial Cryptography, 6th International Conference, FC 2002, Southampton, Bermuda, March 11-14, 2002, Revised Papers.",
                "count": 20,
                "papers": [
                    "E-Voting Without 'Cryptography'.",
                    "An Implementation of a Universally Verifiable Electronic Voting Scheme based on Shuffling.",
                    "Financial Instruments in Recommendation Mechanisms.",
                    "Secure Combinatorial Auctions by Dynamic Programming with Polynomial Secret Sharing.",
                    "A Second-price Sealed-bid Auction with the Discriminant of the p0-th Root.",
                    "A Two-Server, Sealed-Bid Auction Protocol.",
                    "Secure Vickrey Auctions without Threshold Trust.",
                    "Almost Optimal Hash Sequence Traversal.",
                    "Cryptographic Primitives Enforcing Communication and Storage Complexity.",
                    "CryptoComputing with Rationals.",
                    "Privacy Tradeoffs: Myth or Reality? Panel.",
                    "An Improved Fast Signature Scheme without Online Multiplication.",
                    "Timed Release of Standard Digital Signatures.",
                    "Quasi-Efficient Revocation in Group Signatures.",
                    "The Dark Side of Threshold Cryptography.",
                    "Split-and-Delegate: Threshold Cryptography for the Masses.",
                    "Redistribution of Mechanical Secret Shares.",
                    "Reliable MIX Cascade Networks through Reputation.",
                    "Offline Payments with Auditable Tracing.",
                    "Fileteller: Paying and Getting Paid for File Storage."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "5th Financial Cryptography 2001",
        "info": "Grand Cayman, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2001",
                "sub_name": "Financial Cryptography, 5th International Conference, FC 2001, Grand Cayman, British West Indies, February 19-22, 2002, Proceedings.",
                "count": 28,
                "papers": [
                    "Amortized E-Cash.",
                    "Offline Micropayments without Trusted Hardware.",
                    "The Practical Problems of Implementing MicroMint.",
                    "Protecting Digital Rights.",
                    "Aspects of Digital Rights Management and the Use of Hardware Security Devices.",
                    "A Solution to the Napster Phenomenon: Why Value Cannot Be Created Absent the Transfer of Subjective Data.",
                    "Golden Times for Digital Rights Management?",
                    "Applicability of Public Key Cryptosystems to Digital Rights Management Applications.",
                    "On the Global Content PMI: Improved Copy-Protected Internet Content Distribution.",
                    "Trust: A Collision of Paradigms.",
                    "On the Security of Homage Group Authentication Protocol.",
                    "Anonymity without 'Cryptography'.",
                    "Fair Tracing without Trustees.",
                    "Why the War on Money Laundering Should Be Aborted.",
                    "Provably Secure Implicit Certificate Schemes.",
                    "Nonmonotonicity, User Interfaces, and Risk Assessment in Certificate Revocation.",
                    "Mutual Authentication for Low-Power Mobile Devices.",
                    "Off-Line Generation of Limited-Use Credit Card Numbers.",
                    "A Security Framework for Card-Based Systems.",
                    "SecureClick: A Web Payment System with Disposable Credit Card Numbers.",
                    "The Business of Electronic Voting.",
                    "Privacy for the Stock Market.",
                    "Secure Distributed Computing in a Commercial Environment.",
                    "Monotone Signatures.",
                    "The Power of RSA Inversion Oracles and the Security of Chaum's RSA-Based Blind Signature Scheme.",
                    "Optimistic Fair Exchange with Transparent Signature Recovery.",
                    "(M+1)st-Price Auction Protocol.",
                    "Non-interactive Private Auctions."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "4th Financial Cryptography 2000",
        "info": "Anguilla, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/2000",
                "sub_name": "Financial Cryptography, 4th International Conference, FC 2000 Anguilla, British West Indies, February 20-24, 2000, Proceedings.",
                "count": 24,
                "papers": [
                    "Efficient Trace and Revoke Schemes.",
                    "Efficient Watermark Detection and Collusion Security.",
                    "Towards More Sensible Anti-circumvention Regulations.",
                    "Self-Escrowed Cash against User Blackmailing.",
                    "Blind, Auditable Membership Proofs.",
                    "Private Selective Payment Protocols.",
                    "Sharing Decryption in the Context of Voting or Lotteries.",
                    "Postal Revenue Collection in the Digital Age.",
                    "Signing on a Postcard.",
                    "Payment Systems: The Next Generation.",
                    "Non-repudiation in SET: Open Issues.",
                    "Statistics and Secret Leakage.",
                    "Analysis of Abuse-Free Contract Signing.",
                    "Asymmetric Currency Rounding.",
                    "The Encryption Debate in Plaintext: National Security and Encryption in the United States and Israel.",
                    "Critical Comments on the European Directive on a Common Framework for Electronic Signatures and Certification Service Providers.",
                    "A Response to ''Can We Eliminate Certificate Revocation Lists?''.",
                    "Self-Scrambling Anonymizers.",
                    "Authentic Attributes with Fine-Grained Anonymity Protection.",
                    "Resource-Efficient Anonymous Group Identification.",
                    "Secret Key Authentication with Software-Only Verification.",
                    "Panel: Public Key Infrastructure: PKIX, Signed XML or Something Else?",
                    "Financial Cryptography in 7 Layers.",
                    "Capability-Based Financial Instruments."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "3rd Financial Cryptography 1999",
        "info": "Anguilla, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/1999",
                "sub_name": "Financial Cryptography, Third International Conference, FC'99, Anguilla, British West Indies, February 1999, Proceedings.",
                "count": 19,
                "papers": [
                    "Experimenting with Electronic Commerce on the PalmPilot.",
                    "Blinding of Credit Card Numbers in the SET Protocol.",
                    "Trustee Tokens: Simple and Practical Anonymous Digital Coin Tracing.",
                    "Flow Control: A New Approach for Anonymity Control in Electronic Cash Systems.",
                    "Risk Management for E-Cash Systems with Partial Real-Time Audit.",
                    "Assessment of Effectiveness of Counterfeit Transaction Detection Systems for Smart Card Based Electronic Cash.",
                    "Reasoning about Public-Key Certification: On Bindings between Entities and Public Keys.",
                    "Online Certificate Status Checking in Financial Transactions: The Case for Re-issuance.",
                    "Playing \"Hide and Seek\" with Stored Keys.",
                    "On Channel Capacity and Modulation of Watermarks in Digital Still Images.",
                    "Towards Making Broadcast Encryption Practical.",
                    "Conditional Access Concepts and Principles.",
                    "Fair Use, Intellectual Property, and the Information Economy (Panel Session Summary).",
                    "Anonymous Authentication of Membership in Dynamic Groups.",
                    "Some Open Issues and New Directions in Group Signatures.",
                    "Anonymous Investing: Hiding the Identities of Stockholders.",
                    "Fair On-Line Auctions without Special Trusted Parties.",
                    "Cryptosystems Robust against \"Dynamic Faults\" Meet Enterprise Needs for Organizational \"Change Control\".",
                    "Improved Magic Ink Signatures Using Hints."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "2nd Financial Cryptography 1998",
        "info": "Anguilla, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/1998",
                "sub_name": "Financial Cryptography, Second International Conference, FC'98, Anguilla, British West Indies, February 23-25, 1998, Proceedings.",
                "count": 23,
                "papers": [
                    "Micropayments via Efficient Coin-Flipping.",
                    "X-Cash: Executable Digital Cash.",
                    "Distributed Trustees and Revocability: A Framework for Internet Payment.",
                    "A Platform for Privately Defined Currencies, Loyalty Credits, and Play Money.",
                    "Assessment of Threats for Smart Card Based Electronic Cash.",
                    "Using a High-Performance, Programmable Secure Coprocessor.",
                    "Secure Group Barter: Multi-party Fair Exchange with Semi-Trusted Neutral Parties.",
                    "A Payment Scheme Using Vouchers.",
                    "A Formal Specification of Requirements for Payment Transactions in the SET Protocol.",
                    "On Assurance Structures for WWW Commerce.",
                    "Certificate Recocation: Mechanics and Meaning.",
                    "Revocation: Options and Challenges.",
                    "On Certificate Revocation and Validation.",
                    "Can We Eliminate Certificate Revocations Lists?",
                    "Group Blind Digital Signatures: A Scalable Solution to Electronic Cash.",
                    "Curbing Junk E-Mail via Secure Classification.",
                    "Publicly Verifiable Lotteries: Applications of Delaying Functions.",
                    "Robustness and Security of Digital Watermarks.",
                    "Beyond Identity: Warranty-Based Digital Signature Transactions.",
                    "Compliance Checking in the PolicyMaker Trust Management System.",
                    "An Efficient Fair Off-Line Electronic Cash System with Extensions to Checks and Wallets with Observers.",
                    "A More Efficient Untraceable E-Cash System with Partially Blind Signatures Based on the Discrete Logarithm Problem.",
                    "Cryptanalysis of SPEED."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st Financial Cryptography 1997",
        "info": "Anguilla, British West Indies",
        "venues": [
            {
                "sub_name_abbr": "conf/fc/1997",
                "sub_name": "Financial Cryptography, First International Conference, FC '97, Anguilla, British West Indies, February 24-28, 1997, Proceedings.",
                "count": 31,
                "papers": [
                    "Anonymity Control in E-Cash Systems.",
                    "How to Make Personalized Web Browising Simple, Secure, and Anonymous.",
                    "Anonymous Networking and Virtual Intranets: Tools for Anonymous Corporations.",
                    "Unlinkable Serial Transactions.",
                    "Efficient Electronic Cash with Restricted Privacy.",
                    "The SPEED Cipher.",
                    "Evaluating the Security of Electronic Money.",
                    "Electronic Cash - Technology Will Denationalise Money.",
                    "Fault Induction Attacks, Tamper Resistance, and Hostile Reverse Engineering in Perspective.",
                    "Some Critical Remarks on \"Dynamic Data Authentication\" as Specified in EMV'96.",
                    "Single-Chip Implementation of a Cryptosystem for Financial Applications.",
                    "Perspectives on Financial Cryptography.",
                    "Auditable Metering with Lightweight Security.",
                    "SVP: A Flexible Micropayment Scheme.",
                    "An Efficient Micropayment System Based on Probabilistic Polling.",
                    "On the Continuum Between On-line and Off-line E-cash Systems - 1.",
                    "Towards Multiple-Payment Schemes for Digital Money.",
                    "Applying Anti-Trust Policies to Increase Trust in a Versatile E-Money System.",
                    "The Uses and Limits of Financial Cryptography: A Law Professor's Perspective.",
                    "Legal Issues in Cryptography.",
                    "Digital Signatures Today.",
                    "An Attorney's Roadmap to the Digital Signature Guidelines.",
                    "Alternative Visions for Legal Signatures and Evidence.",
                    "Money Laundering: Past, Present and Future.",
                    "Electronic Lottery Tickets as Micropayments.",
                    "Strategic Tasks for Government in the Information Age.",
                    "Using Electronic Markets to Achieve Efficient Task Distribution.",
                    "The Gateway Security Model in the Java Electronic Commerce Framework.",
                    "Highly Scalable On-line Payments Via Task Decoupling.",
                    "GUMP: Grand Unified Meta-Protocols Recipes for Simple, Standards-Based Financial Cryptography.",
                    "Secure Netword Communications and Secure Store & Forward Mechanisms with the SAP R/3 System."
                ]
            }
        ]
    }
]