[
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2021",
        "info": "Volume 2021",
        "count": 40,
        "papers": [
            "Atom: A Stream Cipher with Double Key Filter.",
            "Orthros: A Low-Latency PRF.",
            "MOE: Multiplication Operated Encryption with Trojan Resilience.",
            "Misuse-Free Key-Recovery and Distinguishing Attacks on 7-Round Ascon.",
            "Towards Key-recovery-attack Friendly Distinguishers: Application to GIFT-128.",
            "Exploiting Weak Diffusion of Gimli: Improved Distinguishers and Preimage Attacks.",
            "Improved Preimage Attacks on 4-Round Keccak-224/256.",
            "Algebraic Collision Attacks on Keccak.",
            "Accelerating the Search of Differential and Linear Characteristics with the SAT Method.",
            "Quantum Free-Start Collision Attacks on Double Block Length Hashing with Round-Reduced AES-256.",
            "Provably Quantum-Secure Tweakable Block Ciphers.",
            "Resistance of SNOW-V against Fast Correlation Attacks.",
            "On the Relationships between Different Methods for Degree Evaluation.",
            "Rocca: An Efficient AES-based Encryption Scheme for Beyond 5G.",
            "Permutation Based EDM: An Inverse Free BBB Secure PRF.",
            "Comparing Large-unit and Bitwise Linear Approximations of SNOW 2.0 and SNOW 3G and Related Attacks.",
            "Weak Keys in Reduced AEGIS and Tiaoxin.",
            "Improved Rectangle Attacks on SKINNY and CRAFT.",
            "Linear Cryptanalyses of Three AEADs with GIFT-128 as Underlying Primitives.",
            "(Quantum) Collision Attacks on Reduced Simpira v2.",
            "Automated Search Oriented to Key Recovery on Ciphers with Linear Key Schedule Applications to Boomerangs in SKINNY and ForkSkinny.",
            "Maximums of the Additive Differential Probability of Exclusive-Or.",
            "Proving Resistance Against Infinitely Long Subspace Trails: How to Choose the Linear Layer.",
            "Provable Security of SP Networks with Partial Non-Linear Layers.",
            "Algorithm Substitution Attacks: State Reset Detection and Asymmetric Modifications.",
            "On Length Independent Security Bounds for the PMAC Family.",
            "Power Yoga: Variable-Stretch Security of CCM for Energy-Efficient Lightweight IoT.",
            "1, 2, 3, Fork: Counter Mode Variants based on a Generalized Forkcipher.",
            "Cryptanalysis of the SoDark Cipher for HF Radio Automatic Link Establishment.",
            "Improved guess-and-determine and distinguishing attacks on SNOW-V.",
            "Improved Preimage Attacks on 3-Round Keccak-224/256.",
            "Exploring Differential-Based Distinguishers and Forgeries for ASCON.",
            "Boomeyong: Embedding Yoyo within Boomerang and its Applications to Key Recovery Attacks on AES and Pholkos.",
            "PLCrypto: A Symmetric Cryptographic Library for Programmable Logic Controllers.",
            "CTET+: A Beyond-Birthday-Bound Secure Tweakable Enciphering Scheme Using a Single Pseudorandom Permutation.",
            "Perfect Trees: Designing Energy-Optimal Symmetric Encryption Primitives.",
            "Diving Deep into the Weak Keys of Round Reduced Ascon.",
            "Automatic Search of Cubes for Attacking Stream Ciphers.",
            "Statistical Model of Correlation Difference and Related-Key Linear Cryptanalysis.",
            "Improved Security Bound of (E/D)WCDM."
        ]
    },
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2020",
        "info": "Volume 2020",
        "count": 54,
        "papers": [
            "Preface to Volume 2020, Issue 1.",
            "Towards Low-Energy Leakage-Resistant Authenticated Encryption from the Duplex Sponge Construction.",
            "Duel of the Titans: The Romulus and Remus Families of Lightweight AEAD Algorithms.",
            "Combiners for AEAD.",
            "Low AND Depth and Efficient Inverses: a Guide on S-boxes for Low-latency Masking.",
            "Swap and Rotate: Lightweight Linear Layers for SPN-based Blockciphers.",
            "Cryptanalysis of Forkciphers.",
            "Spectral analysis of ZUC-256.",
            "Algebraic and Higher-Order Differential Cryptanalysis of Pyjamask-96.",
            "Cryptanalysis of the Legendre PRF and Generalizations.",
            "On the Feistel Counterpart of the Boomerang Connectivity Table Introduction and Analysis of the FBCT.",
            "Links between Division Property and Other Cube Attack Variants.",
            "Finding Bit-Based Division Property for Ciphers with Complex Linear Layers.",
            "Improved Security Bounds for Generalized Feistel Networks.",
            "Preface to Volume 2020, Special Issue on Designs for the NIST Lightweight Standardisation Process.",
            "Dumbo, Jumbo, and Delirium: Parallel Authenticated Encryption for the Lightweight Circus.",
            "Pyjamask: Block Cipher and Authenticated Encryption with Highly Efficient Masked Implementation.",
            "Xoodyak, a lightweight cryptographic scheme.",
            "SKINNY-AEAD and SKINNY-Hash.",
            "WAGE: An Authenticated Encryption with a Twist.",
            "Saturnin: a suite of lightweight symmetric algorithms for post-quantum security.",
            "Lightweight AEAD and Hashing using the Sparkle Permutation Family.",
            "The Subterranean 2.0 Cipher Suite.",
            "Spook: Sponge-Based Leakage-Resistant Authenticated Encryption with a Masked Tweakable Block Cipher.",
            "ESTATE: A Lightweight and Low Energy Authenticated Encryption Mode.",
            "Isap v2.0.",
            "From Combined to Hybrid: Making Feedback-based AE even Smaller.",
            "On the Composition of Single-Keyed Tweakable Even-Mansour for Achieving BBB Security.",
            "Key Assignment Schemes with Authenticated Encryption, revisited.",
            "Beyond-Birthday-Bound Secure Cryptographic Permutations from Ideal Ciphers with Long Keys.",
            "On the Security of Sponge-type Authenticated Encryption Modes.",
            "Optimizing Implementations of Linear Layers.",
            "Design of Symmetric-Key Primitives for Advanced Cryptographic Protocols.",
            "Dasta - Alternative Linear Layer for Rasta.",
            "Fast Decryption: a New Feature of Misuse-Resistant AE.",
            "Differential Attacks on CRAFT Exploiting the Involutory S-boxes and Tweak Additions.",
            "On the Security Margin of TinyJAMBU with Refined Differential and Linear Cryptanalysis.",
            "Practical seed-recovery for the PCG Pseudo-Random Number Generator.",
            "Extended Truncated-differential Distinguishers on Round-reduced AES.",
            "On the Usage of Deterministic (Related-Key) Truncated Differentials and Multidimensional Linear Approximations for SPN Ciphers.",
            "Exploring Secret Keys in Searching Integral Distinguishers Based on Division Property.",
            "Beyond-Birthday-Bound Security for 4-round Linear Substitution-Permutation Networks.",
            "Efficient MILP Modelings for Sboxes and Linear Layers of SPN ciphers.",
            "Errata to Sound Hashing Modes of Arbitrary Functions, Permutations, and Block Ciphers.",
            "Cryptanalysis of Curl-P and Other Attacks on the IOTA Cryptocurrency.",
            "LM-DAE: Low-Memory Deterministic Authenticated Encryption for 128-bit Security.",
            "Highly Secure Nonce-based MACs from the Sum of Tweakable Block Ciphers.",
            "Forking Tweakable Even-Mansour Ciphers.",
            "Fake Near Collisions Attacks.",
            "Catching the Fastest Boomerangs Application to SKINNY.",
            "Cryptanalysis of LowMC instances using single plaintext/ciphertext pair.",
            "Improved Attacks on sLiSCP Permutation and Tight Bound of Limited Birthday Distinguishers.",
            "Increasing Precision of Division Property.",
            "Tightness of the Suffix Keyed Sponge Bound."
        ]
    },
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2019",
        "info": "Volume 2019",
        "count": 46,
        "papers": [
            "Preface to Volume 2019, Issue 1.",
            "CRAFT: Lightweight Tweakable Block Cipher with Efficient Protection Against DFA Attacks.",
            "libInterMAC: Beyond Confidentiality and Integrity in Practice.",
            "Constructing Low-latency Involutory MDS Matrices with Lightweight Circuits.",
            "Boomerang Connectivity Table Revisited. Application to SKINNY and AES.",
            "Boomerang Switch in Multiple Rounds. Application to AES Variants and Deoxys.",
            "A General Proof Framework for Recent AES Distinguishers.",
            "Zero-Correlation Attacks on Tweakable Block Ciphers with Linear Tweakey Expansion.",
            "Related-Tweak Statistical Saturation Cryptanalysis and Its Application on QARMA.",
            "General Diffusion Analysis: How to Find Optimal Permutations for Generalized Type-II Feistel Schemes.",
            "Partitions in the S-Box of Streebog and Kuznyechik.",
            "PEIGEN - a Platform for Evaluation, Implementation, and Generation of S-boxes.",
            "ZOCB and ZOTR: Tweakable Blockcipher Modes for Authenticated Encryption with Full Absorption.",
            "Quantum Security Analysis of AES.",
            "New Conditional Cube Attack on Keccak Keyed Modes.",
            "The Exact Security of PMAC with Two Powering-Up Masks.",
            "On Beyond-Birthday-Bound Security: Revisiting the Development of ISO/IEC 9797-1 MACs.",
            "Classification of Balanced Quadratic Functions.",
            "Reconstructing an S-box from its Difference Distribution Table.",
            "Efficient Search for Optimal Diffusion Layers of Generalized Feistel Networks.",
            "A new SNOW stream cipher called SNOW-V.",
            "DoveMAC: A TBC-based PRF with Smaller State, Full Security, and High Rate.",
            "Revisit Division Property Based Cube Attacks: Key-Recovery or Distinguishing Attacks?",
            "Cryptanalysis of Plantlet.",
            "New Related-Tweakey Boomerang and Rectangle Attacks on Deoxys-BC Including BDT Effect.",
            "Substitution Attacks against Message Authentication.",
            "New Semi-Free-Start Collision Attack Framework for Reduced RIPEMD-160.",
            "Security of Symmetric Primitives against Key-Correlated Attacks.",
            "Exhaustive Search for Various Types of MDS Matrices.",
            "Deck-Based Wide Block Cipher Modes and an Exposition of the Blinded Keyed Hashing Model.",
            "Efficient Side-Channel Secure Message Authentication with Better Bounds.",
            "Iterative Block Ciphers from Tweakable Block Ciphers with Long Tweaks.",
            "INT-RUP Secure Lightweight Parallel AE Modes.",
            "Release of Unverified Plaintext: Tight Unified Model and Application to ANYDAE.",
            "Lightweight Iterative MDS Matrices: How Small Can We Go?",
            "Improved Security Evaluation of SPN Block Ciphers and its Applications in the Single-key Attack on SKINNY.",
            "Cube-Based Cryptanalysis of Subterranean-SAE.",
            "Security of the Suffix Keyed Sponge.",
            "Vectorized linear approximations for attacks on SNOW 3G.",
            "Weak Keys in the Rekeying Paradigm: Application to COMET and mixFeed.",
            "Comprehensive security analysis of CRAFT.",
            "Improved Meet-in-the-Middle Preimage Attacks against AES Hashing Modes.",
            "Analyzing the Linear Keystream Biases in AEGIS.",
            "Multiple Linear Cryptanalysis Using Linear Statistics.",
            "New Techniques for Searching Differential Trails in Keccak.",
            "Improving the MILP-based Security Evaluation Algorithm against Differential/Linear Cryptanalysis Using A Divide-and-Conquer Approach."
        ]
    },
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2018",
        "info": "Volume 2018",
        "count": 39,
        "papers": [
            "Preface to Volume 2018, Issue 1.",
            "Key-Recovery Attacks on Full Kravatte.",
            "State-Recovery Attacks on Modified Ketje Jr.",
            "Distinguishing Attack on NORX Permutation.",
            "Searching for Subspace Trails and Truncated Differentials.",
            "Multivariate Profiling of Hulls for Linear Cryptanalysis.",
            "Column Parity Mixers.",
            "On the Generalization of Butterfly Structure.",
            "On Efficient Constructions of Lightweight MDS Matrices.",
            "Functional Graphs and Their Applications in Generic Attacks on Iterated Hash Constructions.",
            "Revisiting and Improving Algorithms for the 3XOR Problem.",
            "Frequency-smoothing encryption: preventing snapshot attacks on deterministically encrypted data.",
            "Revisiting Variable Output Length XOR Pseudorandom Function.",
            "Short Non-Malleable Codes from Related-Key Secure Block Ciphers.",
            "Towards Low Energy Stream Ciphers.",
            "ShiftRows Alternatives for AES-like Ciphers and Optimal Cell Permutations for Midori and Skinny.",
            "MDS Matrices with Lightweight Circuits.",
            "Separable Statistics and Multidimensional Linear Cryptanalysis.",
            "Clustering Related-Tweak Characteristics: Application to MANTIS-6.",
            "Mixture Differential Cryptanalysis: a New Approach to Distinguishers and Attacks on round-reduced AES.",
            "Cryptanalysis of AES-PRF and Its Dual.",
            "SUNDAE: Small Universal Deterministic Authenticated Encryption for the Internet of Things.",
            "Double-block Hash-then-Sum: A Paradigm for Constructing BBB Secure PRF.",
            "More Accurate Differential Properties of LED64 and Midori64.",
            "Cryptanalysis of Reduced round SKINNY Block Cipher.",
            "Cryptanalysis of Low-Data Instances of Full LowMCv2.",
            "Cube-Attack-Like Cryptanalysis of Round-Reduced Keccak Using MILP.",
            "Conditional Linear Cryptanalysis - Cryptanalysis of DES with Less Than 242 Complexity.",
            "Generating Graphs Packed with Paths Estimation of Linear Approximations and Differentials.",
            "On the Boomerang Uniformity of Cryptographic Sboxes.",
            "Lightweight and Side-channel Secure 4 × 4 S-Boxes from Cellular Automata Rules.",
            "The design of Xoodoo and Xoofff.",
            "Adiantum: length-preserving encryption for entry-level processors.",
            "Generalized Nonlinear Invariant Attack and a New Design Criterion for Round Constants.",
            "Nonlinear Approximations in Cryptanalysis Revisited.",
            "New Yoyo Tricks with AES-based Permutations.",
            "Key Prediction Security of Keyed Sponges.",
            "Key Assignment Scheme with Authenticated Encryption.",
            "Sound Hashing Modes of Arbitrary Functions, Permutations, and Block Ciphers."
        ]
    },
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2017",
        "info": "Volume 2017",
        "count": 58,
        "papers": [
            "Preface.",
            "The QARMA Block Cipher Family. Almost MDS Matrices Over Rings With Zero Divisors, Nearly Symmetric Even-Mansour Constructions With Non-Involutory Central Rounds, and Search Heuristics for Low-Latency S-Boxes.",
            "LIZARD - A Lightweight Stream Cipher for Power-constrained Devices.",
            "ISAP - Towards Side-Channel Secure Authenticated Encryption.",
            "A Fast Single-Key Two-Level Universal Hash Function.",
            "Design of Lightweight Linear Diffusion Layers from Near-MDS Matrices.",
            "Cryptanalysis of NORX v2.0.",
            "Conditional Cube Attack on Round-Reduced ASCON.",
            "Cryptanalysis of GOST2.",
            "Meet-in-the-Middle Attacks on Reduced-Round Midori64.",
            "SymSum: Symmetric-Sum Distinguishers Against Round Reduced SHA3.",
            "Cube-like Attack on Round-Reduced Initialization of Ketje Sr.",
            "Analysis of AES, SKINNY, and Others with Constraint Programming.",
            "Analysis of Software Countermeasures for Whitebox Encryption.",
            "New techniques for trail bounds and application to differential trails in Keccak.",
            "Optimal Differential Trails in SIMON-like Ciphers.",
            "The Approximate k-List Problem.",
            "A Note on 5-bit Quadratic Permutations' Classification.",
            "Security Notions for Bidirectional Channels.",
            "On The Exact Security of Message Authentication Using Pseudorandom Functions.",
            "Security of Symmetric Primitives under Incorrect Usage of Keys.",
            "Linear Cryptanalysis: Key Schedules and Tweakable Block Ciphers.",
            "SoK: Security Models for Pseudo-Random Number Generators.",
            "Tweakable Blockciphers for Efficient Authenticated Encryptions with Beyond the Birthday-Bound Security.",
            "New Constructions of MACs from (Tweakable) Block Ciphers.",
            "Human-readable Proof of the Related-Key Security of AES-128.",
            "Security of Even-Mansour Ciphers under Key-Dependent Messages.",
            "Turning Online Ciphers Off.",
            "Understanding RUP Integrity of COLM.",
            "Cryptanalysis of PMACx, PMAC2x, and SIVx.",
            "Cryptanalysis of 48-step RIPEMD-160.",
            "Refined Probability of Differential Characteristics Including Dependency Between Multiple Rounds.",
            "Differentially 4-Uniform Permutations with the Best Known Nonlinearity from Butterflies.",
            "Grøstl Distinguishing Attack: A New Rebound Attack of an AES-like Permutation.",
            "Rotational-XOR Cryptanalysis of Reduced-round SPECK.",
            "Security Analysis of SKINNY under Related-Tweakey Settings (Long Paper).",
            "A Security Analysis of Deoxys and its Internal Tweakable Block Ciphers.",
            "Practical Evaluation of FSE 2016 Customized Encoding Countermeasure.",
            "Tight Security Analysis of EHtM MAC.",
            "Analysis and Improvement of Entropy Estimators in NIST SP 800-90B for Non-IID Entropy Sources.",
            "Accurate Estimate of the Advantage of Impossible Differential Attacks.",
            "Boolean functions with restricted input and their robustness; application to the FLIP cipher.",
            "Optimal PRFs from Blockcipher Designs.",
            "Efficient Length Doubling From Tweakable Block Ciphers.",
            "On Leakage-Resilient Authenticated Encryption with Decryption Leakages.",
            "Modes of Operation Suitable for Computing on Encrypted Data.",
            "Farfalle: parallel permutation-based cryptography.",
            "Preimage Attacks on the Round-reduced Keccak with Cross-linear Structures.",
            "Fast Correlation Attacks on Grain-like Small State Stream Ciphers.",
            "Some cryptanalytic results on Lizard.",
            "MILP Modeling for (Large) S-boxes to Optimize Probability of Differential Characteristics.",
            "Optimizing Implementations of Lightweight Building Blocks.",
            "Direct Construction of Optimal Rotational-XOR Diffusion Primitives.",
            "Shorter Linear Straight-Line Programs for MDS Matrices.",
            "Asymptotic Analysis of Plausible Tree Hash Modes for SHA-3.",
            "Reconsidering the Security Bound of AES-GCM-SIV.",
            "Single Key Variant of PMAC_Plus.",
            "ZMAC+ - An Efficient Variable-output-length Variant of ZMAC."
        ]
    },
    {
        "name": "FSE / \nSince 2017, proceedings of this conference are published as articles of IACR Transactions on Symmetric Cryptology.\n",
        "year": "2016",
        "info": "Volume 2016",
        "count": 23,
        "papers": [
            "Cryptanalysis of Haraka.",
            "Chosen-Key Distinguishers on 12-Round Feistel-SP and 11-Round Collision Attacks on Its Hashing Modes.",
            "Invariant Subspace Attack Against Midori64 and The Resistance Criteria for S-box Designs.",
            "Rotational Cryptanalysis in the Presence of Constants.",
            "Quantum Differential and Linear Cryptanalysis.",
            "Lightweight Diffusion Layer: Importance of Toeplitz Matrices.",
            "Is AEZ v4.1 Sufficiently Resilient Against Key-Recovery Attacks?",
            "Stronger Security Variants of GCM-SIV.",
            "Security Analysis of BLAKE2's Modes of Operation.",
            "Haraka v2 - Efficient Short-Input Hashing for Post-Quantum Applications.",
            "OleF: an Inverse-Free Online Cipher. An Online SPRP with an Optimal Inverse-Free Construction.",
            "On Ciphers that Continuously Access the Non-Volatile Key.",
            "Direct construction of quasi-involutory recursive-like MDS matrices from 2-cyclic codes.",
            "Exponential S-Boxes: a Link Between the S-Boxes of BelT and Kuznyechik/Streebog.",
            "Linking Online Misuse-Resistant Authenticated Encryption and Blockwise Attack Models.",
            "The Exact Security of PMAC.",
            "Improved Parameter Estimates for Correlation and Capacity Deviates in Linear Cryptanalysis.",
            "Subspace Trail Cryptanalysis and its Applications to AES.",
            "Multiset-Algebraic Cryptanalysis of Reduced Kuznyechik, Khazad, and secret SPNs.",
            "Practical Key-Recovery Attack on MANTIS5.",
            "Significantly Improved Multi-bit Differentials for Reduced Round Salsa and ChaCha.",
            "Multi-key Analysis of Tweakable Even-Mansour with Applications to Minalpher and OPP.",
            "Meet-in-the-Middle Attacks on Classes of Contracting and Expanding Feistel Constructions."
        ]
    },
    {
        "year": "2017",
        "name": "24. FSE 2017",
        "info": "Tokyo, Japan",
        "venues": []
    },
    {
        "year": "2016",
        "name": "23. FSE 2016",
        "info": "Bochum, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2016",
                "sub_name": "Fast Software Encryption - 23rd International Conference, FSE 2016, Bochum, Germany, March 20-23, 2016, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "New Bounds for Keyed Sponges with Extendable Output: Independence Between Capacity and Message Length.",
                    "RIV for Robust Authenticated Encryption.",
                    "A MAC Mode for Lightweight Block Ciphers.",
                    "Cryptanalysis of the Full Spritz Stream Cipher.",
                    "Attacks Against Filter Generators Exploiting Monomial Mappings.",
                    "Lightweight MDS Generalized Circulant Matrices.",
                    "On the Construction of Lightweight Circulant Involutory MDS Matrices.",
                    "Optimizing S-Box Implementations for Several Criteria Using SAT Solvers.",
                    "Verifiable Side-Channel Security of Cryptographic Implementations: Constant-Time MEE-CBC.",
                    "White-Box Cryptography in the Gray Box - - A Hardware Implementation and its Side Channels -.",
                    "Detecting Flawed Masking Schemes with Leakage Detection Tests.",
                    "There Is Wisdom in Harnessing the Strengths of Your Enemy: Customized Encoding to Thwart Side-Channel Attacks.",
                    "Automatic Search for Key-Bridging Technique: Applications to LBlock and TWINE.",
                    "MILP-Based Automatic Search Algorithms for Differential and Linear Trails for Speck.",
                    "Automatic Search for the Best Trails in ARX: Application to Block Cipher Speck.",
                    "Stream Ciphers: A Practical Solution for Efficient Homomorphic-Ciphertext Compression.",
                    "Efficient Design Strategies Based on the AES Round Function.",
                    "Bit-Based Division Property and Application to Simon Family.",
                    "Algebraic Insights into the Secret Feistel Network.",
                    "Integrals Go Statistical: Cryptanalysis of Full Skipjack Variants.",
                    "Note on Impossible Differential Attacks.",
                    "Improved Linear Hull Attack on Round-Reduced Simon with Dynamic Key-Guessing Techniques.",
                    "Modeling Random Oracles Under Unpredictable Queries.",
                    "Practical Order-Revealing Encryption with Limited Leakage.",
                    "Strengthening the Known-Key Security Notion for Block Ciphers.",
                    "Related-Key Almost Universal Hash Functions: Definitions, Constructions and Applications.",
                    "Key Recovery Attack Against 2.5-Round \\pi -Cipher.",
                    "Cryptanalysis of Reduced NORX.",
                    "Analysis of the Kupyna-256 Hash Function."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "22. FSE 2015",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2015",
                "sub_name": "Fast Software Encryption - 22nd International Workshop, FSE 2015, Istanbul, Turkey, March 8-11, 2015, Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Differential Analysis and Meet-in-the-Middle Attack Against Round-Reduced TWINE.",
                    "Improved Higher-Order Differential Attacks on MISTY1.",
                    "Meet-in-the-Middle Technique for Truncated Differential and Its Applications to CLEFIA and Camellia.",
                    "Protecting Against Multidimensional Linear and Truncated Differential Cryptanalysis by Decorrelation.",
                    "Analysis of Impossible, Integral and Zero-Correlation Attacks on Type-II Generalized Feistel Networks Using the Matrix Method.",
                    "Simpler and More Efficient Rank Estimation for Side-Channel Security Assessment.",
                    "Conversion from Arithmetic to Boolean Masking with Logarithmic Complexity.",
                    "Comb to Pipeline: Fast Software Encryption Revisited.",
                    "Security of the AES with a Secret S-Box.",
                    "Meet-in-the-Middle Attacks and Structural Analysis of Round-Reduced PRINCE.",
                    "Linear Distinguishers in the Key-less Setting: Application to PRESENT.",
                    "Differential-Linear Cryptanalysis of ICEPOLE.",
                    "Cryptanalysis of JAMBU.",
                    "Related-Key Forgeries for Prøst-OTR.",
                    "Practical Cryptanalysis of the Open Smart Grid Protocol.",
                    "Relaxing Full-Codebook Security: A Refined Analysis of Key-Length Extension Schemes.",
                    "The Related-Key Security of Iterated Even-Mansour Ciphers.",
                    "Security of Keyed Sponge Constructions Using a Modular Proof Approach.",
                    "GCM Security Bounds Reconsidered.",
                    "Boosting OMD for Almost Free Authentication of Associated Data.",
                    "Optimally Secure Tweakable Blockciphers.",
                    "On Lightweight Stream Ciphers with Shorter Internal States.",
                    "Lightweight MDS Involution Matrices.",
                    "A New Classification of 4-bit Optimal S-boxes and Its Application to PRESENT, RECTANGLE and SPONGENT.",
                    "Rotational Cryptanalysis of ARX Revisited.",
                    "Internal Differential Boomerangs: Practical Analysis of the Round-Reduced Keccak- f f Permutation.",
                    "New Linear Correlations Related to State Information of RC4 PRGA Using IV in WPA.",
                    "A More Cautious Approach to Security Against Mass Surveillance."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "21. FSE 2014",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2014",
                "sub_name": "Fast Software Encryption - 21st International Workshop, FSE 2014, London, UK, March 3-5, 2014. Revised Selected Papers.",
                "count": 31,
                "papers": [
                    "Direct Construction of Recursive MDS Diffusion Layers Using Shortened BCH Codes.",
                    "LS-Designs: Bitslice Encryption for Efficient Masked Software Implementations.",
                    "SPRING: Fast Pseudorandom Functions from Rounded Ring Products.",
                    "Match Box Meet-in-the-Middle Attack Against KATAN.",
                    "Collision Spectrum, Entropy Loss, T-Sponges, and Cryptanalysis of GLUON-64.",
                    "Improved All-Subkeys Recovery Attacks on FOX, KATAN and SHACAL-2 Block Ciphers.",
                    "Improved Single-Key Attacks on 9-Round AES-192/256.",
                    "CLOC: Authenticated Encryption for Short Input.",
                    "APE: Authenticated Permutation-Based Encryption for Lightweight Cryptography.",
                    "COBRA: A Parallelizable Authenticated Online Cipher Without Block Cipher Inverse.",
                    "Pipelineable On-line Encryption.",
                    "Cryptanalysis of FIDES.",
                    "Security Analysis of Key-Alternating Feistel Ciphers.",
                    "The Related-Key Analysis of Feistel Constructions.",
                    "The Indistinguishability of the XOR of k Permutations.",
                    "Impact of ANSI X9.24-1: 2009 Key Check Value on ISO/IEC 9797-1: 2011 MACs.",
                    "Plaintext Recovery Attacks Against WPA/TKIP.",
                    "Dependence in IV-Related Bytes of RC4 Key Enhances Vulnerabilities in WPA.",
                    "Probabilistic Slide Cryptanalysis and Its Applications to LED-64 and Zorro.",
                    "Improved Linear Sieving Techniques with Applications to Step-Reduced LED-64.",
                    "Differential-Linear Cryptanalysis Revisited.",
                    "Improved Slender-Set Linear Cryptanalysis.",
                    "Cryptanalysis of KLEIN.",
                    "Branching Heuristics in Differential Collision Search with Applications to SHA-512.",
                    "On the Minimum Number of Multiplications Necessary for Universal Hash Functions.",
                    "Collision Attack on 5 Rounds of Grøstl.",
                    "Differential Cryptanalysis of Round-Reduced Simon and Speck.",
                    "Differential Analysis of Block Ciphers SIMON and SPECK.",
                    "Equivalent Key Recovery Attacks Against HMAC and NMAC with Whirlpool Reduced to 7 Rounds.",
                    "Multiple Differential Cryptanalysis of Round-Reduced PRINCE.",
                    "Efficient Fuzzy Search on Encrypted Data."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "20. FSE 2013",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2013",
                "sub_name": "Fast Software Encryption - 20th International Workshop, FSE 2013, Singapore, March 11-13, 2013. Revised Selected Papers.",
                "count": 30,
                "papers": [
                    "Complementing Feistel Ciphers.",
                    "On the Wrong Key Randomisation and Key Equivalence Hypotheses in Matsui's Algorithm 2.",
                    "Cryptanalysis of WIDEA.",
                    "Towards Secure Distance Bounding.",
                    "Reflection Cryptanalysis of PRINCE-Like Ciphers.",
                    "Security Analysis of PRINCE.",
                    "Cryptanalysis of Round-Reduced \\mathttLED.",
                    "Tweakable Blockciphers with Asymptotically Optimal Security.",
                    "Smashing WEP in a Passive Attack.",
                    "Full Plaintext Recovery Attack on Broadcast RC4.",
                    "Time-Memory Trade-Offs for Near-Collisions.",
                    "Collision Attacks on Up to 5 Rounds of SHA-3 Using Generalized Internal Differentials.",
                    "Rotational Cryptanalysis of Round-Reduced Keccak.",
                    "Partial-Collision Attack on the Round-Reduced Compression Function of Skein-256.",
                    "On Weak Keys and Forgery Attacks Against Polynomial-Based MAC Schemes.",
                    "Secure Message Authentication Against Related-Key Attack.",
                    "Attacks and Security Proofs of EAX-Prime.",
                    "Towards Understanding the Known-Key Security of Block Ciphers.",
                    "On Symmetric Encryption with Distinguishable Decryption Failures.",
                    "Minimalism of Software Implementation - Extensive Performance Analysis of Symmetric Primitives on the RL78 Microcontroller.",
                    "Higher-Order Side Channel Security and Mask Refreshing.",
                    "Masking Tables - An Underestimated Security Risk.",
                    "ALE: AES-Based Lightweight Authenticated Encryption.",
                    "Related-Key Attacks Against Full Hummingbird-2.",
                    "A Low Data Complexity Attack on the GMR-2 Cipher Used in the Satellite Phones.",
                    "Improving Key Recovery to 784 and 799 Rounds of Trivium Using Optimized Cube Attacks.",
                    "Near Collision Attack on the Grain v1 Stream Cipher.",
                    "Exhausting Demirci-Selçuk Meet-in-the-Middle Attacks Against Reduced-Round AES.",
                    "A Framework for Automated Independent-Biclique Cryptanalysis.",
                    "A New Criterion for Avoiding the Propagation of Linear Relations Through an Sbox."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "19. FSE 2012",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2012",
                "sub_name": "Fast Software Encryption - 19th International Workshop, FSE 2012, Washington, DC, USA, March 19-21, 2012. Revised Selected Papers.",
                "count": 25,
                "papers": [
                    "\"Provable\" Security against Differential and Linear Cryptanalysis.",
                    "Improved Attacks on Full GOST.",
                    "Zero Correlation Linear Cryptanalysis with Reduced Data Complexity.",
                    "A Model for Structure Attacks, with Applications to PRESENT and Serpent.",
                    "A Methodology for Differential-Linear Cryptanalysis and Its Applications - (Extended Abstract).",
                    "New Observations on Impossible Differential Cryptanalysis of Reduced-Round Camellia.",
                    "Improved Rebound Attack on the Finalist Grøstl.",
                    "(Pseudo) Preimage Attack on Round-Reduced Grøstl Hash Function and Others.",
                    "Practical Cryptanalysis of ARMADILLO2.",
                    "On the (In)Security of IDEA in Various Hashing Modes.",
                    "The Security of Ciphertext Stealing.",
                    "McOE: A Family of Almost Foolproof On-Line Authenticated Encryption Schemes.",
                    "Cycling Attacks on GCM, GHASH and Other Polynomial MACs and Hashes.",
                    "Collision Attacks on the Reduced Dual-Stream Hash Function RIPEMD-128.",
                    "Bicliques for Preimages: Attacks on Skein-512 and the SHA-2 Family.",
                    "Converting Meet-In-The-Middle Preimage Attack into Pseudo Collision Attack: Application to SHA-2.",
                    "UNAF: A Special Set of Additive Differences with Application to the Differential Analysis of ARX.",
                    "ElimLin Algorithm Revisited.",
                    "Short-Output Universal Hash Functions and Their Use in Fast and Secure Data Authentication.",
                    "Lapin: An Efficient Authentication Protocol Based on Ring-LPN.",
                    "Higher-Order Masking Schemes for S-Boxes.",
                    "Recursive Diffusion Layers for Block Ciphers and Hash Functions.",
                    "Unaligned Rebound Attack: Application to Keccak.",
                    "Differential Propagation Analysis of Keccak.",
                    "New Attacks on Keccak-224 and Keccak-256."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "18. FSE 2011",
        "info": "Lyngby, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2011",
                "sub_name": "Fast Software Encryption - 18th International Workshop, FSE 2011, Lyngby, Denmark, February 13-16, 2011, Revised Selected Papers.",
                "count": 23,
                "papers": [
                    "Differential Cryptanalysis of Round-Reduced PRINTcipher: Computing Roots of Permutations.",
                    "Search for Related-Key Differential Characteristics in DES-Like Ciphers.",
                    "Multiple Differential Cryptanalysis: Theory and Practice.",
                    "Fast Correlation Attacks: Methods and Countermeasures.",
                    "Analysis of Reduced-SHAvite-3-256 v2.",
                    "An Improved Algebraic Attack on Hamsi-256.",
                    "Practical Near-Collisions and Collisions on Round-Reduced ECHO-256 Compression Function.",
                    "On Cipher-Dependent Related-Key Attacks in the Ideal-Cipher Model.",
                    "On the Security of Hash Functions Employing Blockcipher Postprocessing.",
                    "Breaking Grain-128 with Dynamic Cube Attacks.",
                    "Cryptanalysis of the Knapsack Generator.",
                    "Attack on Broadcast RC4 Revisited.",
                    "Boomerang Attacks on BLAKE-32.",
                    "Practical Near-Collisions on the Compression Function of BMW.",
                    "Higher-Order Differential Properties of Keccak and Luffa.",
                    "Cryptanalysis of PRESENT-Like Ciphers with Secret S-Boxes.",
                    "A Single-Key Attack on the Full GOST Block Cipher.",
                    "The Software Performance of Authenticated-Encryption Modes.",
                    "Cryptanalysis of Hummingbird-1.",
                    "The Additive Differential Probability of ARX.",
                    "Linear Approximations of Addition Modulo 2n-1.",
                    "Meet-in-the-Middle Preimage Attacks on AES Hashing Modes and an Application to Whirlpool.",
                    "Known-Key Distinguishers on 11-Round Feistel and Collision Attacks on Its Hashing Modes."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "17. FSE 2010",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2010",
                "sub_name": "Fast Software Encryption, 17th International Workshop, FSE 2010, Seoul, Korea, February 7-10, 2010, Revised Selected Papers.",
                "count": 21,
                "papers": [
                    "Cryptanalysis of the DECT Standard Cipher.",
                    "Improving the Generalized Feistel.",
                    "Nonlinear Equivalence of Stream Ciphers.",
                    "Lightweight Privacy Preserving Authentication for RFID Using a Stream Cipher.",
                    "Fast Software AES Encryption.",
                    "Attacking the Knudsen-Preneel Compression Functions.",
                    "Finding Preimages of Tiger Up to 23 Steps.",
                    "Cryptanalysis of ESSENCE.",
                    "Domain Extension for Enhanced Target Collision-Resistant Hash Functions.",
                    "Security Analysis of the Mode of JH Hash Function.",
                    "Enhanced Security Notions for Dedicated-Key Hash Functions: Definitions and Relationships.",
                    "A Unified Method for Improving PRF Bounds for a Class of Blockcipher Based MACs.",
                    "How to Thwart Birthday Attacks against MACs via Small Randomness.",
                    "Constructing Rate-1 MACs from Related-Key Unpredictable Block Ciphers: PGV Model Revisited.",
                    "Higher Order Differential Attack on Step-Reduced Variants of Luffa v1.",
                    "Rebound Attack on Reduced-Round Versions of JH.",
                    "Pseudo-cryptanalysis of the Original Blue Midnight Wish.",
                    "Differential and Invertibility Properties of BLAKE.",
                    "Rotational Cryptanalysis of ARX.",
                    "Another Look at Complementation Properties.",
                    "Super-Sbox Cryptanalysis: Improved Attacks for AES-Like Permutations."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16. FSE 2009",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2009",
                "sub_name": "Fast Software Encryption, 16th International Workshop, FSE 2009, Leuven, Belgium, February 22-25, 2009, Revised Selected Papers.",
                "count": 24,
                "papers": [
                    "Cube Testers and Key Recovery Attacks on Reduced-Round MD6 and Trivium.",
                    "An Efficient State Recovery Attack on X-FCSR-256.",
                    "Key Collisions of the RC4 Stream Cipher.",
                    "Intel's New AES Instructions for Enhanced Performance and Security.",
                    "Blockcipher-Based Hashing Revisited.",
                    "On the Security of Tandem-DM.",
                    "Indifferentiability of Permutation-Based Compression Functions and Tree-Based Modes of Operation, with Applications to MD6.",
                    "Cryptanalysis of RadioGatún.",
                    "Preimage Attacks on Reduced Tiger and SHA-2.",
                    "Cryptanalysis of the LAKE Hash Family.",
                    "New Cryptanalysis of Block Ciphers with Low Algebraic Degree.",
                    "Algebraic Techniques in Differential Cryptanalysis.",
                    "Multidimensional Extension of Matsui's Algorithm 2.",
                    "Meet-in-the-Middle Attacks on SHA-3 Candidates.",
                    "Practical Collisions for EnRUPT.",
                    "The Rebound Attack: Cryptanalysis of Reduced Whirlpool and Grøstl.",
                    "Revisiting the IDEA Philosophy.",
                    "Cryptanalysis of the ISDB Scrambling Algorithm (MULTI2).",
                    "Beyond-Birthday-Bound Security Based on Tweakable Block Cipher.",
                    "Enhanced Target Collision Resistant Hash Functions Revisited.",
                    "MAC Reforgeability.",
                    "New Distinguishing Attack on MAC Using Secret-Prefix Method.",
                    "Fast and Secure CBC-Type MAC Algorithms.",
                    "HBS: A Single-Key Mode of Operation for Deterministic Authenticated Encryption."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15. FSE 2008",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2008",
                "sub_name": "Fast Software Encryption, 15th International Workshop, FSE 2008, Lausanne, Switzerland, February 10-13, 2008, Revised Selected Papers.",
                "count": 30,
                "papers": [
                    "Collisions for Step-Reduced SHA-256.",
                    "Collisions on SHA-0 in One Hour.",
                    "The Hash Function Family LAKE.",
                    "SWIFFT: A Modest Proposal for FFT Hashing.",
                    "A Unified Approach to Related-Key Attacks.",
                    "Algebraic and Slide Attacks on KeeLoq.",
                    "A Meet-in-the-Middle Attack on 8-Round AES.",
                    "Block Ciphers Implementations Provably Secure Against Second Order Side Channel Analysis.",
                    "SQUASH - A New MAC with Provable Security Properties for Highly Constrained Devices Such as RFID Tags.",
                    "Differential Fault Analysis of Trivium.",
                    "Accelerating the Whirlpool Hash Function Using Parallel Table Lookup and Fast Cyclical Permutation.",
                    "Second Preimage Attack on 3-Pass HAVAL and Partial Key-Recovery Attacks on HMAC/NMAC-3-Pass HAVAL.",
                    "Cryptanalysis of LASH.",
                    "A (Second) Preimage Attack on the GOST Hash Function.",
                    "Guess-and-Determine Algebraic Attack on the Self-Shrinking Generator.",
                    "New Form of Permutation Bias and Secret Key Leakage in Keystream Bytes of RC4.",
                    "Efficient Reconstruction of RC4 Keys from Internal States.",
                    "An Improved Security Bound for HCTR.",
                    "How to Encrypt with a Malicious Random Number Generator.",
                    "A One-Pass Mode of Operation for Deterministic Message Authentication- Security beyond the Birthday Barrier.",
                    "Post-Processing Functions for a Biased Physical Random Number Generator.",
                    "Entropy of the Internal State of an FCSR in Galois Representation.",
                    "Bit-Pattern Based Integral Attack.",
                    "Experiments on the Multiple Linear Cryptanalysis of Reduced Round Serpent.",
                    "Impossible Differential Cryptanalysis of CLEFIA.",
                    "MD4 is Not One-Way.",
                    "Improved Indifferentiability Security Analysis of chopMD Hash Function.",
                    "New Techniques for Cryptanalysis of Hash Functions and Improved Attacks on Snefru.",
                    "On the Salsa20 Core Function.",
                    "New Features of Latin Dances: Analysis of Salsa, ChaCha, and Rumba."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14. FSE 2007",
        "info": "Luxembourg, Luxembourg",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2007",
                "sub_name": "Fast Software Encryption, 14th International Workshop, FSE 2007, Luxembourg, Luxembourg, March 26-28, 2007, Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Producing Collisions for Panama, Instantaneously.",
                    "Cryptanalysis of FORK-256.",
                    "The Grindahl Hash Functions.",
                    "Overtaking VEST.",
                    "Cryptanalysis of Achterbahn-128/80.",
                    "Differential-Linear Attacks Against the Stream Cipher Phelix.",
                    "How to Enrich the Message Space of a Cipher.",
                    "Security Analysis of Constructions Combining FIL Random Oracles.",
                    "Bad and Good Ways of Post-processing Biased Physical Random Numbers.",
                    "Improved Slide Attacks.",
                    "A New Class of Weak Keys for Blowfish.",
                    "The 128-Bit Blockcipher CLEFIA (Extended Abstract).",
                    "New Lightweight DES Variants.",
                    "A New Attack on 6-Round IDEA.",
                    "Related-Key Rectangle Attacks on Reduced AES-192 and AES-256.",
                    "An Analysis of XSL Applied to BES.",
                    "On the Security of IV Dependent Stream Ciphers.",
                    "Two General Attacks on Pomaranch-Like Keystream Generators.",
                    "Analysis of QUAD.",
                    "Message Freedom in MD4 and MD5 Collisions: Application to APOP.",
                    "New Message Difference for MD4.",
                    "Algebraic Cryptanalysis of 58-Round SHA-1.",
                    "Algebraic Immunity of S-Boxes and Augmented Functions.",
                    "Generalized Correlation Analysis of Vectorial Boolean Functions.",
                    "An Analytical Model for Time-Driven Cache Attacks.",
                    "Improving the Security of MACs Via Randomized Message Preprocessing.",
                    "New Bounds for PMAC, TMAC, and XCBC.",
                    "Perfect Block Ciphers with Small Blocks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13. FSE 2006",
        "info": "Graz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2006",
                "sub_name": "Fast Software Encryption, 13th International Workshop, FSE 2006, Graz, Austria, March 15-17, 2006, Revised Selected Papers.",
                "count": 27,
                "papers": [
                    "Cryptanalysis of Achterbahn.",
                    "Cryptanalysis of Grain.",
                    "Cryptanalysis of the Stream Cipher DECIM.",
                    "On Feistel Structures Using a Diffusion Switching Mechanism.",
                    "Pseudorandom Permutation Families over Abelian Groups.",
                    "A Zero-Dimensional Gröbner Basis for AES-128.",
                    "Cryptanalysis of the Full HAVAL with 4 and 5 Passes.",
                    "Collisions and Near-Collisions for Reduced-Round Tiger.",
                    "Analysis of Step-Reduced SHA-256.",
                    "Improved Linear Distinguishers for SNOW 2.0.",
                    "Reducing the Space Complexity of BDD-Based Attacks on Keystream Generators.",
                    "Breaking the ICE - Finding Multicollisions in Iterated Concatenated and Expanded (ICE) Hash Functions.",
                    "A New Dedicated 256-Bit Hash Function: FORK-256.",
                    "Some Plausible Constructions of Double-Block-Length Hash Functions.",
                    "Provably Secure MACs from Differentially-Uniform Permutations and AES-Based Implementations.",
                    "Searching for Differential Paths in MD4.",
                    "A Study of the MD5 Attacks: Insights and Improvements.",
                    "The Impact of Carries on the Complexity of Collision Attacks on SHA-1.",
                    "A New Mode of Encryption Providing a Tweakable Strong Pseudo-random Permutation.",
                    "New Blockcipher Modes of Operation with Beyond the Birthday Bound Security.",
                    "The Ideal-Cipher Model, Revisited: An Uninstantiable Blockcipher-Based Hash Function.",
                    "How Far Can We Go on the x64 Processors?",
                    "Computing the Algebraic Immunity Efficiently.",
                    "Upper Bounds on Algebraic Immunity of Boolean Power Functions.",
                    "Chosen-Ciphertext Attacks Against MOSQUITO.",
                    "Distinguishing Attacks on the Stream Cipher Py.",
                    "Resynchronization Attacks on WG and LEX."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12. FSE 2005",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2005",
                "sub_name": "Fast Software Encryption: 12th International Workshop, FSE 2005, Paris, France, February 21-23, 2005, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "A New MAC Construction ALRED and a Specific Instance ALPHA-MAC.",
                    "New Applications of T-Functions in Block Ciphers and Hash Functions.",
                    "The Poly1305-AES Message-Authentication Code.",
                    "Narrow T-Functions.",
                    "A New Class of Single Cycle T-Functions.",
                    "F-FCSR: Design of a New Class of Stream Ciphers.",
                    "Cryptographically Significant Boolean Functions: Construction and Analysis in Terms of Algebraic Immunity.",
                    "The ANF of the Composition of Addition and Multiplication mod 2n with a Boolean Function.",
                    "New Combined Attacks on Block Ciphers.",
                    "Small Scale Variants of the AES.",
                    "Unbiased Random Sequences from Quasigroup String Transformations.",
                    "A New Distinguisher for Clock Controlled Stream Ciphers.",
                    "Analysis of the Bit-Search Generator and Sequence Compression Techniques.",
                    "Some Attacks on the Bit-Search Generator.",
                    "SMASH - A Cryptographic Hash Function.",
                    "Security Analysis of a 2/3-Rate Double Length Compression Function in the Black-Box Model.",
                    "Preimage and Collision Attacks on MD2.",
                    "How to Enhance the Security of the 3GPP Confidentiality and Integrity Algorithms.",
                    "Two-Pass Authenticated Encryption Faster Than Generic Composition.",
                    "Padding Oracle Attacks on CBC-Mode Encryption with Secret and Random IVs.",
                    "Analysis of the Non-linear Part of Mugi.",
                    "Two Attacks Against the HBB Stream Cipher.",
                    "Two Linear Distinguishing Attacks on VMPC and RC4A and Weakness of RC4 Family of Stream Ciphers.",
                    "Impossible Fault Analysis of RC4 and Differential Fault Analysis of RC4.",
                    "Related-Key Rectangle Attacks on Reduced Versions of SHACAL-1 and AES-192.",
                    "New Attacks Against Reduced-Round Versions of IDEA.",
                    "How to Maximize Software Performance of Symmetric Primitives on Pentium III and 4 Processors.",
                    "A Side-Channel Analysis Resistant Description of the AES S-Box.",
                    "DPA Attacks and S-Boxes."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11. FSE 2004",
        "info": "Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2004",
                "sub_name": "Fast Software Encryption, 11th International Workshop, FSE 2004, Delhi, India, February 5-7, 2004, Revised Papers.",
                "count": 31,
                "papers": [
                    "New Cryptographic Primitives Based on Multiword T-Functions.",
                    "Towards a Unifying View of Block Cipher Cryptanalysis.",
                    "Algebraic Attacks on Summation Generators.",
                    "Algebraic Attacks on SOBER-t32 and SOBER-t16 without Stuttering.",
                    "Improving Fast Algebraic Attacks.",
                    "Resistance of S-Boxes against Algebraic Attacks.",
                    "Differential Attacks against the Helix Stream Cipher.",
                    "Improved Linear Consistency Attack on Irregular Clocked Keystream Generators.",
                    "Correlation Attacks Using a New Class of Weak Feedback Polynomials.",
                    "Minimum Distance between Bent and 1-Resilient Boolean Functions.",
                    "Results on Rotation Symmetric Bent and Correlation Immune Boolean Functions.",
                    "A Weakness of the Linear Part of Stream Cipher MUGI.",
                    "Vulnerability of Nonlinear Filter Generators Based on Linear Finite State Machines.",
                    "VMPC One-Way Function and Stream Cipher.",
                    "A New Stream Cipher HC-256.",
                    "A New Weakness in the RC4 Keystream Generator and an Approach to Improve the Security of the Cipher.",
                    "Improving Immunity of Feistel Ciphers against Differential Cryptanalysis by Using Multiple MDS Matrices.",
                    "ICEBERG : An Involutional Cipher Efficient for Block Encryption in Reconfigurable Hardware.",
                    "Related Key Differential Attacks on 27 Rounds of XTEA and Full-Round GOST.",
                    "On the Additive Differential Probability of Exclusive-Or.",
                    "Two Power Analysis Attacks against One-Mask Methods.",
                    "Nonce-Based Symmetric Encryption.",
                    "Ciphers Secure against Related-Key Attacks.",
                    "Cryptographic Hash-Function Basics: Definitions, Implications, and Separations for Preimage Resistance, Second-Preimage Resistance, and Collision Resistance.",
                    "The EAX Mode of Operation.",
                    "CWC: A High-Performance Conventional Authenticated Encryption Mode.",
                    "New Security Proofs for the 3GPP Confidentiality and Integrity Algorithms.",
                    "Cryptanalysis of a Message Authentication Code due to Cary and Venkatesan.",
                    "Fast Software-Based Attacks on SecurID.",
                    "A MAC Forgery Attack on SOBER-128.",
                    "On Linear Approximation of Modulo Sum."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10. FSE 2003",
        "info": "Lund, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2003",
                "sub_name": "Fast Software Encryption, 10th International Workshop, FSE 2003, Lund, Sweden, February 24-26, 2003, Revised Papers.",
                "count": 27,
                "papers": [
                    "Cryptanalysis of IDEA-X/2.",
                    "Differential-Linear Cryptanalysis of Serpent.",
                    "Rectangle Attacks on 49-Round SHACAL-1.",
                    "Cryptanalysis of Block Ciphers Based on SHA-1 and MD5.",
                    "Analysis of Involutional Ciphers: Khazad and Anubis.",
                    "On Plateaued Functions and Their Constructions.",
                    "Linear Redundancy in S-Boxes.",
                    "Loosening the KNOT.",
                    "On the Resynchronization Attack.",
                    "Cryptanalysis of SOBER-t32.",
                    "OMAC: One-Key CBC MAC.",
                    "A Concrete Security Analysis for 3GPP-MAC.",
                    "New Attacks against Standardized MACs.",
                    "Analysis of RMAC.",
                    "A Generic Protection against High-Order Differential Power Analysis.",
                    "A New Class of Collision Attacks and Its Application to DES.",
                    "Further Observations on the Structure of the AES Algorithm.",
                    "Optimal Key Ranking Procedures in a Statistical Cryptanalysis.",
                    "Improving the Upper Bound on the Maximum Differential and the Maximum Linear Hull Probability for SPN Structures and AES.",
                    "Linear Approximations of Addition Modulo 2n.",
                    "Block Ciphers and Systems of Quadratic Equations.",
                    "Turing: A Fast Stream Cipher.",
                    "Rabbit: A New High-Performance Stream Cipher.",
                    "Helix: Fast Encryption and Authentication in a Single Cryptographic Primitive.",
                    "PARSHA-256- - A New Parallelizable Hash Function and a Multithreaded Implementation.",
                    "Practical Symmetric On-Line Encryption.",
                    "The Security of \"One-Block-to-Many\" Modes of Operation."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9. FSE 2002",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2002",
                "sub_name": "Fast Software Encryption, 9th International Workshop, FSE 2002, Leuven, Belgium, February 4-6, 2002, Revised Papers.",
                "count": 21,
                "papers": [
                    "New Results on Boomerang and Rectangle Attacks.",
                    "Multiplicative Differentials.",
                    "Differential and Linear Cryptanalysis of a Reduced-Round SC2000.",
                    "Impossible Differential Cryptanalysis of Reduced Round XTEA and TEA.",
                    "Improved Cryptanalysis of MISTY1.",
                    "Multiple Linear Cryptanalysis of a Reduced Round RC6.",
                    "On the Security of CAMELLIA against the Square Attack.",
                    "Saturation Attacks on Reduced Round Skipjack.",
                    "Integral Cryptanalysis.",
                    "Improved Upper Bounds of Differential and Linear Characteristic Probability for Camellia.",
                    "The Round Functions of RIJNDAEL Generate the Alternating Group.",
                    "Non-cryptographic Primitive for Pseudorandom Permutation.",
                    "BeepBeep: Embedded Real-Time Encryption.",
                    "A New Keystream Generator MUGI.",
                    "Scream: A Software-Efficient Stream Cipher.",
                    "Distinguishing Attacks on SOBER-t16 and t32.",
                    "Linearity Properties of the SOBER-t32 Key Loading.",
                    "A Time-Memory Tradeoff Attack Against LILI-128.",
                    "On the Security of Randomized CBC-MAC Beyond the Birthday Paradox Limit: A New Construction.",
                    "Cryptanalysis of the Modified Version of the Hash Function Proposed at PKC'98.",
                    "Compression and Information Leakage of Plaintext."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8. FSE 2001",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2001",
                "sub_name": "Fast Software Encryption, 8th International Workshop, FSE 2001 Yokohama, Japan, April 2-4, 2001, Revised Papers.",
                "count": 28,
                "papers": [
                    "The Saturation Attack - A Bait for Twofish.",
                    "Linear Cryptanalysis of Reduced Round Serpent.",
                    "Cryptanalysis of the Mercy Block Cipher.",
                    "Producing Collisions for PANAMA.",
                    "The RIPEMD and RIPEMD Improved Variants of MD4 Are Not Collision Free.",
                    "New Constructions of Resilient Boolean Functions with Maximal Nonlinearity.",
                    "Optimized Self-Synchronizing Mode of Operation.",
                    "Fast Encryption and Authentication: XCBC Encryption and XECB Authentication Modes.",
                    "Incremental Unforgeable Encryption.",
                    "ZIP Attacks with Reduced Known Plaintext.",
                    "Cryptanalysis of the SEAL 3.0 Pseudorandom Function Family.",
                    "Cryptanalysis of SBLH.",
                    "A Practical Attack on Broadcast RC4.",
                    "Improved SQUARE Attacks against Reduced-Round HIEROCRYPT.",
                    "Differential Cryptanalysis of Q.",
                    "Differential Cryptanalysis of Nimbus.",
                    "Fast Correlation Attack Algorithm with List Decoding and an Application.",
                    "Bias in the LEVIATHAN Stream Cipher.",
                    "Analysis of SSC2.",
                    "Round Security and Super-Pseudorandomness of MISTY Type Structure.",
                    "New Results on the Pseudorandomness of Some Blockcipher Constructions.",
                    "NESSIE: A European Approach to Evaluate Cryptographic Algorithms.",
                    "Related Key Attacks on Reduced Round KASUMI.",
                    "Security of Camellia against Truncated Differential Cryptanalysis.",
                    "Impossible Differential Cryptanalysis of Zodiac.",
                    "The Block Cipher SC2000.",
                    "Flaws in Differential Cryptanalysis of Skipjack.",
                    "Efficient Algorithms for Computing Differential Properties of Addition."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7. FSE 2000",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/2000",
                "sub_name": "Fast Software Encryption, 7th International Workshop, FSE 2000, New York, NY, USA, April 10-12, 2000, Proceedings.",
                "count": 21,
                "papers": [
                    "Real Time Cryptanalysis of A5/1 on a PC.",
                    "Statistical Analysis of the Alleged RC4 Keystream Generator.",
                    "The Software-Oriented Stream Cipher SSC2.",
                    "Mercy: A Fast Large Block Cipher for Disk Sector Encryption.",
                    "A Statistical Attack on RC6.",
                    "Amplified Boomerang Attacks Against Reduced-Round MARS and Serpent.",
                    "Correlations in RC6 with a Reduced Number of Rounds.",
                    "On the Interpolation Attacks on Block Ciphers.",
                    "Stochastic Cryptanalysis of Crypton.",
                    "Bitslice Ciphers and Power Analysis Attacks.",
                    "Securing the AES Finalists Against Power Analysis Attacks.",
                    "Ciphertext Only Reconstruction of Stream Ciphers Based on Combination Generators.",
                    "A Simple Algorithm for Fast Correlation Attacks on Stream Ciphers.",
                    "A Low-Complexity and High-Performance Algorithm for the Fast Correlation Attack.",
                    "Improved Cryptanalysis of Rijndael.",
                    "On the Pseudorandomness of the AES Finalists - RC6 and Serpent.",
                    "Linear Cryptanalysis of Reduced-Round Versions of the SAFER Block Cipher Family.",
                    "A Chosen-Plaintext Linear Attack on DES.",
                    "Provable Security against Differential and Linear Cryptanalysis for the SPN Structure.",
                    "Unforgeable Encryption and Chosen Ciphertext Secure Modes of Operation.",
                    "Efficient Methods for Generating MARS-Like S-Boxes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6. FSE 1999",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1999",
                "sub_name": "Fast Software Encryption, 6th International Workshop, FSE '99, Rome, Italy, March 24-26, 1999, Proceedings.",
                "count": 22,
                "papers": [
                    "Improved Analysis of Some Simplified Variants of RC6.",
                    "Linear Cryptanalysis of RC5 and RC6.",
                    "A Revised Version of Crypton - Crypton V1.0.",
                    "Attack on Six Rounds of Crypton.",
                    "On Security of the 128-Bit Block Cipher DEAL.",
                    "Cryptanalysis of a Reduced Version of the Block Cipher E2.",
                    "On the Decorrelated Fast Cipher (DFC) and Its Theory.",
                    "Scramble All, Encrypt Small.",
                    "Accelerated Remotely Keyed Encruption.",
                    "Miss in the Middle Attacks on IDEA and Khufu.",
                    "Mod n Cryptanalysis, with Applications Against RC5P and M6.",
                    "The Boomerang Attack.",
                    "Towards Making Luby-Rackoff Ciphers Optimal and Practical.",
                    "A New Characterization of Almost Bent Functions.",
                    "Imprimitive Permutation Groups and Trapdoors in Iterated Block Ciphers.",
                    "On the Security of Double and 2-Key Triple Modes of Operation.",
                    "On the Construction of Variable-Input-Length Ciphers.",
                    "Slide Attacks.",
                    "On the Security of CS-Cipher.",
                    "Interpolation Attacks of the Block Cipher: SNAKE.",
                    "High-Speed Pseudorandom Number Generation with Small Memory.",
                    "SOBER Crytanalysis."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5. FSE 1998",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1998",
                "sub_name": "Fast Software Encryption, 5th International Workshop, FSE '98, Paris, France, March 23-25, 1998, Proceedings.",
                "count": 20,
                "papers": [
                    "New Results in Linear Cryptanalysis of RC5.",
                    "Higher Order Differential Attak of CAST Cipher.",
                    "Cryptanalysis of TWOPRIME.",
                    "JEROBOAM.",
                    "Fast Hashing and Stream Encryption with PANAMA.",
                    "Joint Hardware / Software Design of a Fast Stream Cipher.",
                    "On the Security of the Hashing Scheme Based on SL2.",
                    "About Feistel Schemes with Six (or More) Rounds.",
                    "Monkey: Black-Box Symmetric Ciphers Designed for MONopolizing KEYs.",
                    "MRD Hashing.",
                    "New Constructions for Secure Hash Functions.",
                    "Cryptanalytic Attacks on Pseudorandom Number Generators.",
                    "CS-Cipher.",
                    "On the Design and Security of RC2.",
                    "Serpent: A New Block Cipher Proposal.",
                    "Attacking Triple Encryption.",
                    "Cryptanalysis of Some Recently-Proposed Multiple Modes of Operation.",
                    "Differential Cryptanalysis of the ICE Encryption Algorithm.",
                    "The First Two Rounds of MD4 are Not One-Way.",
                    "Differential Cryptanalysis of KHF."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4. FSE 1997",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1997",
                "sub_name": "Fast Software Encryption, 4th International Workshop, FSE '97, Haifa, Israel, January 20-22, 1997, Proceedings.",
                "count": 24,
                "papers": [
                    "x2 Cryptanalysis of the SEAL Encryption Algorithm.",
                    "Partitioning Cryptanalysis.",
                    "The Interpolation Attack on Block Ciphers.",
                    "Best Differential Characteristic Search of FEAL.",
                    "New Block Encryption Algorithm MISTY.",
                    "The Design of the ICE Encryption Algorithm.",
                    "Advanced Encryption Standard.",
                    "TWOPRIME: A Fast Stream Ciphering Algorithm.",
                    "On Nonlinear Filter Generators.",
                    "Chameleon - A New Kind of Stream Cipher.",
                    "Improving Linear Cryptanalysis of LOKI91 by Probabilistic Counting Method.",
                    "Cryptanalysis of Ladder-DES.",
                    "A Family of Trapdoor Ciphers.",
                    "The Block Cipher Square.",
                    "XMX: A Firmware-Oriented Block Cipher Based on Modular Multiplications.",
                    "MMH: Software Message Authentication in the Gbit/Second Rates.",
                    "Fast Message Authentication Using Efficient Polynomial Evaluation.",
                    "Reinventing the Travois: Encryption/MAC in 30 ROM Bytes.",
                    "All-or-Nothing Encryption and the Package Transform.",
                    "On the Security of Remotely Keyed Encryption.",
                    "Sliding Encryption: A Cryptographic Tool for Mobile Agents.",
                    "Fast Software Encryption: Designing Encryption Algorithms for Optimal Software Speed on the Intel Pentium Processor.",
                    "A Fast New DES Implementation in Software.",
                    "Optimizing a Fast Stream Cipher for VLIW, SIMD, and Superscalar Processors."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3. FSE 1996",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1996",
                "sub_name": "Fast Software Encryption, Third International Workshop, Cambridge, UK, February 21-23, 1996, Proceedings.",
                "count": 18,
                "papers": [
                    "Attacks on the HKM/HFX Cryptosystem.",
                    "Truncated Differentials of SAFER.",
                    "On the Weak Keys of Blowfish.",
                    "High-Bandwidth Encryption with Low-Bandwidth Smartcards.",
                    "ISAAC.",
                    "A Note on the Hash Function of Tillich and Zémor.",
                    "Cryptanalysis of MD4.",
                    "RIPEMD-160: A Strengthened Version of RIPEMD.",
                    "Fast Accumulated Hashing.",
                    "TIGER: A Fast New Hash Function.",
                    "The Cipher SHARK.",
                    "Two Practical and Provably Secure Block Ciphers: BEARS and LION.",
                    "Unbalanced Feistel Networks and Block Cipher Design.",
                    "A Comparison of Fast Correlation Attacks.",
                    "Correlation Attacks on Stream Ciphers: Computing Low-Weight Parity Checks Based on Error-Correcting Codes.",
                    "On the Security of Nonlinear Filter Generators.",
                    "Faster Luby-Rackoff Ciphers.",
                    "New Structure of Block Ciphers with Provable Security against Differential and Linear Cryptanalysis."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2. FSE 1994",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1994",
                "sub_name": "Fast Software Encryption: Second International Workshop. Leuven, Belgium, 14-16 December 1994, Proceedings.",
                "count": 29,
                "papers": [
                    "FSE'94 - Introduction.",
                    "Clock-Controlled Pseudorandom Generators on Finite Groups.",
                    "On Random Mappings and Random Permutations.",
                    "Binary Cyclotomic Generators.",
                    "Construction of Bent Functions and Balanced Boolean Functions with High Nonlinearity.",
                    "Additive and Linear Structures of Cryptographic Functions.",
                    "The RC5 Encryption Algorithm.",
                    "The MacGuffin Block Cipher Algorithm.",
                    "S-boxes and Round Functions with Controllable Linearity and Differential Uniformity.",
                    "Properties of Linear Approximation Tables.",
                    "Searching for the Optimum Correlation Attack.",
                    "A Known Plaintext Attack on the PKZIP Stream Cipher.",
                    "Linear Cryptanalysis of Stream Ciphers.",
                    "Feedback with Carry Shift Registers over Finite Fields (extended abstract).",
                    "A Free Energy Minimization Framework for Inference Problems in modulo 2 Arithmetic.",
                    "Truncated and Higher Order Differentials.",
                    "SAFER K-64: One Year Later.",
                    "Improved Characteristics for Differential Cryptanalysis of Hash Functions Based on Block Ciphers.",
                    "Linear Cryptanalysis Using Multiple Approximations and FEAL.",
                    "Problems with the Linear Cryptanalysis of DES Using More Than One Active S-box per Round.",
                    "Correlation Matrices.",
                    "On the Need for Multipermutations: Cryptanalysis of MD4 and SAFER.",
                    "How to Exploit the Intractability of Exact TSP for Cryptography.",
                    "How to Reverse Engineer an EES Device.",
                    "A Fast Homomorphic Coding Algorithm Based on Arithmetic Coding.",
                    "On Fibonacci Keystream Generators.",
                    "Cryptanalysis of McGuffin.",
                    "Performance of Block Ciphers and Hash Functions - One Year Later.",
                    "TEA, a Tiny Encryption Algorithm."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1. FSE 1993",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/fse/1993",
                "sub_name": "Fast Software Encryption, Cambridge Security Workshop, Cambridge, UK, December 9-11, 1993, Proceedings.",
                "count": 26,
                "papers": [
                    "SAFER K-64: A Byte-Oriented Block-Ciphering Algorithm.",
                    "A New Approach to Block Cipher Design.",
                    "Fast Block Cipher Proposal.",
                    "Fish: A Fast Software Stream Cipher.",
                    "The Shrinking Generator: Some Practical Considerations.",
                    "A Modern Rotor Machine.",
                    "Two Stream Ciphers.",
                    "A Software-Optimised Encryption Algorithm.",
                    "Encrypting Network Traffic.",
                    "Design Principles for Dedicated Hash Functions.",
                    "Performance of Symmetric Ciphers and One-Way Hash Functions.",
                    "On the Security of Shift Register Based Keystream Generators.",
                    "The Differential Cryptanalysis and Design of Natural Stream Ciphers.",
                    "On Modes of Operation.",
                    "Cryptanalysis of Clock Controlled Shift Registers.",
                    "A Bulk Data Encription Algorithm.",
                    "On Finite Automaton One-Key Cryptosystems.",
                    "Parallel FFT-Hashing.",
                    "Attacks on Double Block Length Hash Functions.",
                    "On Quadratic M-Sequences.",
                    "2-Adic Shift Registers.",
                    "New Bent Mappings Suitable for Fast Implementation.",
                    "Cryptographic Pseudorandom Numbers in Simulation.",
                    "Description of a New Variable-Length Key, 64-bit Block Cipher (Blowfish).",
                    "VINO: A Block Cipher Including Variable Permutations.",
                    "Practically Secure Feistel Cyphers."
                ]
            }
        ]
    }
]