[
    {
        "year": "2021",
        "name": "23rd ICICS 2021",
        "info": "Chongqing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2021-1",
                "sub_name": "Information and Communications Security - 23rd International Conference, ICICS 2021, Chongqing, China, November 19-21, 2021, Proceedings, Part I.",
                "count": 26,
                "papers": [
                    "The Golden Snitch: A Byzantine Fault Tolerant Protocol with Activity.",
                    "Rectifying Administrated ERC20 Tokens.",
                    "Moat: Model Agnostic Defense against Targeted Poisoning Attacks in Federated Learning.",
                    "Certified Malware in South Korea: A Localized Study of Breaches of Trust in Code-Signing PKI Ecosystem.",
                    "GAN-Based Adversarial Patch for Malware C2 Traffic to Bypass DL Detector.",
                    "Analyzing the Security of OTP 2FA in the Face of Malicious Terminals.",
                    "Disappeared Face: A Physical Adversarial Attack Method on Black-Box Face Detection Models.",
                    "HIAWare: Speculate Handwriting on Mobile Devices with Built-In Sensors.",
                    "Studies of Keyboard Patterns in Passwords: Recognition, Characteristics and Strength Evolution.",
                    "CNN-Based Continuous Authentication on Smartphones with Auto Augmentation Search.",
                    "Generating Adversarial Point Clouds on Multi-modal Fusion Based 3D Object Detection Model.",
                    "Source Identification from In-Vehicle CAN-FD Signaling: What Can We Expect?",
                    "EmuIoTNet: An Emulated IoT Network for Dynamic Analysis.",
                    "ACGVD: Vulnerability Detection Based on Comprehensive Graph via Graph Neural Network with Attention.",
                    "TranFuzz: An Ensemble Black-Box Attack Framework Based on Domain Adaptation and Fuzzing.",
                    "Software Obfuscation with Non-Linear Mixed Boolean-Arithmetic Expressions.",
                    "VIRSA: Vectorized In-Register RSA Computation with Memory Disclosure Resistance.",
                    "Informer: Protecting Intel SGX from Cross-Core Side Channel Threats.",
                    "Towards Open World Traffic Classification.",
                    "Comprehensive Degree Based Key Node Recognition Method in Complex Networks.",
                    "Improving Convolutional Neural Network-Based Webshell Detection Through Reinforcement Learning.",
                    "Exploring the Security Issues of Trusted CA Certificate Management.",
                    "Effective Anomaly Detection Model Training with only Unlabeled Data by Weakly Supervised Learning Techniques.",
                    "CySecAlert: An Alert Generation System for Cyber Security Events Using Open Source Intelligence Data.",
                    "CyberRel: Joint Entity and Relation Extraction for Cybersecurity Concepts.",
                    "Microblog User Location Inference Based on POI and Query Likelihood Model."
                ]
            },
            {
                "sub_name_abbr": "conf/icics/2021-2",
                "sub_name": "Information and Communications Security - 23rd International Conference, ICICS 2021, Chongqing, China, November 19-21, 2021, Proceedings, Part II.",
                "count": 23,
                "papers": [
                    "Exposing DeepFakes via Localizing the Manipulated Artifacts.",
                    "Improved Differential-ML Distinguisher: Machine Learning Based Generic Extension for Differential Analysis.",
                    "Black-Box Buster: A Robust Zero-Shot Transfer-Based Adversarial Attack Method.",
                    "A Lightweight Metric Defence Strategy for Graph Neural Networks Against Poisoning Attacks.",
                    "Rethinking Adversarial Examples Exploiting Frequency-Based Analysis.",
                    "Compressive Sensing Image Steganography via Directional Lifting Wavelet Transform.",
                    "Remote Recovery of Sound from Speckle Pattern Video Based on Convolutional LSTM.",
                    "Secure Image Coding Based on Compressive Sensing with Optimized Rate-Distortion.",
                    "Black-Box Audio Adversarial Example Generation Using Variational Autoencoder.",
                    "Security Analysis of Even-Mansour Structure Hash Functions.",
                    "Rare Variants Analysis in Genetic Association Studies with Privacy Protection via Hybrid System.",
                    "Rotational-Linear Attack: A New Framework of Cryptanalysis on ARX Ciphers with Applications to Chaskey.",
                    "A Novel Approach for Supervisor Synthesis to Enforce Opacity of Discrete Event Systems.",
                    "Lattice-Based Secret Handshakes with Reusable Credentials.",
                    "When NTT Meets Karatsuba: Preprocess-then-NTT Technique Revisited.",
                    "Predicting the Concrete Security of LWE Against the Dual Attack Using Binary Search.",
                    "Small Leaks Sink a Great Ship: An Evaluation of Key Reuse Resilience of PQC Third Round Finalist NTRU-HRSS.",
                    "Efficient and Fully Secure Lattice-Based IBE with Equality Test.",
                    "Forward-Secure Revocable Identity-Based Encryption.",
                    "An Optimized Inner Product Argument with More Application Scenarios.",
                    "Updatable All-But-One Dual Projective Hashing and Its Applications.",
                    "On Tightly-Secure (Linkable) Ring Signatures.",
                    "More Efficient Construction of Anonymous Signatures."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "22nd ICICS 2020",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2020",
                "sub_name": "Information and Communications Security - 22nd International Conference, ICICS 2020, Copenhagen, Denmark, August 24-26, 2020, Proceedings.",
                "count": 33,
                "papers": [
                    "Machine Learning Based Hardware Trojan Detection Using Electromagnetic Emanation.",
                    "A Machine Learning-Assisted Compartmentalization Scheme for Bare-Metal Systems.",
                    "Detection of Metamorphic Malware Packers Using Multilayered LSTM Networks.",
                    "Profile Matching Across Online Social Networks.",
                    "A Compact Digital Signature Scheme Based on the Module-LWR Problem.",
                    "Tree-Based Ring-LWE Group Key Exchanges with Logarithmic Complexity.",
                    "CoinBot: A Covert Botnet in the Cryptocurrency Network.",
                    "A Symbolic Model for Systematically Analyzing TEE-Based Protocols.",
                    "New Practical Public-Key Deniable Encryption.",
                    "A Blockchain Traceable Scheme with Oversight Function.",
                    "Blind Functional Encryption.",
                    "Lattice HIBE with Faster Trapdoor Delegation and Applications.",
                    "Attributes Affecting User Decision to Adopt a Virtual Private Network (VPN) App.",
                    "rTLS: Lightweight TLS Session Resumption for Constrained IoT Devices.",
                    "PiDicators: An Efficient Artifact to Detect Various VMs.",
                    "HCC: 100 Gbps AES-GCM Encrypted Inline DMA Transfers Between SGX Enclave and FPGA Accelerator.",
                    "Information-Theoretic Security of Cryptographic Channels.",
                    "Client-Oblivious OPRAM.",
                    "The Influence of LWE/RLWE Parameters on the Stochastic Dependence of Decryption Failures.",
                    "One-Time, Oblivious, and Unlinkable Query Processing Over Encrypted Data on Cloud.",
                    "A New General Method of Searching for Cubes in Cube Attacks.",
                    "A Love Affair Between Bias Amplifiers and Broken Noise Sources.",
                    "Towards Real-Time Hidden Speaker Recognition by Means of Fully Homomorphic Encryption.",
                    "A Complete Cryptanalysis of the Post-Quantum Multivariate Signature Scheme Himq-3.",
                    "Statically Dissecting Internet of Things Malware: Analysis, Characterization, and Detection.",
                    "Analysis of Industrial Device Architectures for Real-Time Operations Under Denial of Service Attacks.",
                    "A Variational Generative Network Based Network Threat Situation Assessment.",
                    "A Hardware in the Loop Benchmark Suite to Evaluate NIST LWC Ciphers on Microcontrollers.",
                    "Experimental Comparisons of Verifiable Delay Functions.",
                    "Attacks on Integer-RLWE.",
                    "A Family of Subfield Hyperelliptic Curves for Use in Cryptography.",
                    "Leakage-Resilient Inner-Product Functional Encryption in the Bounded-Retrieval Model.",
                    "Anonymous End to End Encryption Group Messaging Protocol Based on Asynchronous Ratchet Tree."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "21st ICICS 2019",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2019",
                "sub_name": "Information and Communications Security - 21st International Conference, ICICS 2019, Beijing, China, December 15-17, 2019, Revised Selected Papers.",
                "count": 47,
                "papers": [
                    "Prototype-Based Malware Traffic Classification with Novelty Detection.",
                    "Evading API Call Sequence Based Malware Classifiers.",
                    "UBER: Combating Sandbox Evasion via User Behavior Emulators.",
                    "AADS: A Noise-Robust Anomaly Detection Framework for Industrial Control Systems.",
                    "Characterizing Internet-Scale ICS Automated Attacks Through Long-Term Honeypot Data.",
                    "Cloning Vulnerability Detection in Driver Layer of IoT Devices.",
                    "Impact of Multiple Reflections on Secrecy Capacity of Indoor VLC System.",
                    "Road Context-Aware Intrusion Detection System for Autonomous Cars.",
                    "Automated Cyber Threat Intelligence Reports Classification for Early Warning of Cyber Attacks in Next Generation SOC.",
                    "HeteroUI: A Framework Based on Heterogeneous Information Network Embedding for User Identification in Enterprise Networks.",
                    "CTLMD: Continuous-Temporal Lateral Movement Detection Using Graph Embedding.",
                    "VulHunter: An Automated Vulnerability Detection System Based on Deep Learning and Bytecode.",
                    "Deep Learning-Based Vulnerable Function Detection: A Benchmark.",
                    "Automatic Demirci-Selçuk Meet-in-the-Middle Attack on SKINNY with Key-Bridging.",
                    "SecFlush: A Hardware/Software Collaborative Design for Real-Time Detection and Defense Against Flush-Based Cache Attacks.",
                    "CDAE: Towards Empowering Denoising in Side-Channel Analysis.",
                    "Practical Evaluation Methodology of Higher-Order Maskings at Different Operating Frequencies.",
                    "Privacy-Preserving eID Derivation for Self-Sovereign Identity Systems.",
                    "Provably Secure Group Authentication in the Asynchronous Communication Model.",
                    "AGE: Authentication Graph Embedding for Detecting Anomalous Login Activities.",
                    "A Multi-Group Signature Scheme from Lattices.",
                    "Ciphertext Policy Attribute-Based Encryption for Circuits from LWE Assumption.",
                    "Using Equivalent Class to Solve Interval Discrete Logarithm Problem.",
                    "Parallel Steepest Ascent Hill-Climbing for High Nonlinear Boolean and Vectorial Boolean Functions (S-Boxes).",
                    "Accelerating SM2 Digital Signature Algorithm Using Modern Processor Features.",
                    "Improved Differential Attacks on GIFT-64.",
                    "Adaptively Secure Puncturable Pseudorandom Functions via Puncturable Identity-Based KEMs.",
                    "Towards Blockchain-Enabled Searchable Encryption.",
                    "DTGuard: A Lightweight Defence Mechanism Against a New DoS Attack on SDN.",
                    "Towards Comprehensive Security Analysis of Hidden Services Using Binding Guard Relays.",
                    "Context-Aware IPv6 Address Hopping.",
                    "Towards Homograph-Confusable Domain Name Detection Using Dual-Channel CNN.",
                    "FraudJudger: Fraud Detection on Digital Payment Platforms with Fewer Labels.",
                    "CloudCoT: A Blockchain-Based Cloud Service Dependency Attestation Framework.",
                    "An Adversarial Attack Based on Multi-objective Optimization in the Black-Box Scenario: MOEA-APGA II.",
                    "Neuron Selecting: Defending Against Adversarial Examples in Deep Neural Networks.",
                    "Capturing the Persistence of Facial Expression Features for Deepfake Video Detection.",
                    "Differentially Private Frequent Itemset Mining Against Incremental Updates.",
                    "Differentially Private Reinforcement Learning.",
                    "Privacy-Preserving Distributed Machine Learning Based on Secret Sharing.",
                    "Privacy-Preserving Decentralised Singular Value Decomposition.",
                    "WSLD: Detecting Unknown Webshell Using Fuzzy Matching and Deep Learning.",
                    "A Character-Level BiGRU-Attention for Phishing Classification.",
                    "Tear Off Your Disguise: Phishing Website Detection Using Visual and Network Identities.",
                    "Hierarchical Representation Network for Steganalysis of QIM Steganography in Low-Bit-Rate Speech Signals.",
                    "Convolutional Neural Network Based Side-Channel Attacks with Customized Filters.",
                    "DLchain: A Covert Channel over Blockchain Based on Dynamic Labels."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "20th ICICS 2018",
        "info": "Lille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2018",
                "sub_name": "Information and Communications Security - 20th International Conference, ICICS 2018, Lille, France, October 29-31, 2018, Proceedings.",
                "count": 50,
                "papers": [
                    "Blockchain-Based Secure Data Provenance for Cloud Storage.",
                    "uMine: A Blockchain Based on Human Miners.",
                    "LagProber: Detecting DGA-Based Malware by Using Query Time Lag of Non-existent Domains.",
                    "Study on Advanced Botnet Based on Publicly Available Resources.",
                    "Deep Packet Inspection with Delayed Signature Matching in Network Auditing.",
                    "Low-Rate DoS Attack Detection Based on Two-Step Cluster Analysis.",
                    "On the Weakness of Constant Blinding PRNG in Flash Player.",
                    "Random Number Generators Can Be Fooled to Behave Badly.",
                    "Utilizing GPU Virtualization to Protect the Private Keys of GPU Cryptographic Computation.",
                    "Accelerating Integer Based Fully Homomorphic Encryption Using Frequency Domain Multiplication.",
                    "Comparison-Based Attacks Against Noise-Free Fully Homomorphic Encryption Schemes.",
                    "On Security in Encrypted Computing.",
                    "PPOIM: Privacy-Preserving Shape Context Based Image Denoising and Matching with Efficient Outsourcing.",
                    "Linking Differential Identifiability with Differential Privacy.",
                    "PP-MCSA: Privacy Preserving Multi-channel Double Spectrum Auction.",
                    "Hierarchical Group Signatures with Verifier-Local Revocation.",
                    "Achieving Full Security for Lattice-Based Group Signatures with Verifier-Local Revocation.",
                    "Towards Practical Lattice-Based One-Time Linkable Ring Signatures.",
                    "Slop: Towards an Efficient and Universal Streaming Log Parser.",
                    "Community Discovery of Attribution Trace Based on Deep Learning Approach.",
                    "Examine Manipulated Datasets with Topology Data Analysis: A Case Study.",
                    "Efficient Multi-keyword Searchable Encryption Based on Multi-input Inner-Product Functional Encryption.",
                    "Fast Two-Server Multi-User Searchable Encryption with Strict Access Pattern Leakage.",
                    "Identity-Based Functional Encryption for Quadratic Functions from Lattices.",
                    "Key Dependent Message Security for Revocable Identity-Based Encryption and Identity-Based Encryption.",
                    "Publicly Verifiable Data Transfer and Deletion Scheme for Cloud Storage.",
                    "Publicly Verifiable Static Proofs of Storage: A Novel Scheme and Efficiency Comparisons.",
                    "Verifiable Single-Server Private Information Retrieval.",
                    "Cryptographic Password Obfuscation.",
                    "CCA Secure Multi-recipient KEM from LPN.",
                    "Witness-Indistinguishable Arguments with ∑-Protocols for Bundled Witness Spaces and Its Application to Global Identities.",
                    "Automatic Identification of Industrial Control Network Protocol Field Boundary Using Memory Propagation Tree.",
                    "PCA: Page Correlation Aggregation for Memory Deduplication in Virtualized Environments.",
                    "Role Recognition of Illegal Online Gambling Participants Using Monetary Transaction Data.",
                    "Certifying Variant of RSA with Generalized Moduli.",
                    "Attack Trees in Isabelle.",
                    "Automated Verification of Noninterference Property.",
                    "Automatical Method for Searching Integrals of ARX Block Cipher with Division Property Using Three Subsets.",
                    "Improved Automatic Search Algorithm for Differential and Linear Cryptanalysis on SIMECK and the Applications.",
                    "MalHunter: Performing a Timely Detection on Malicious Domains via a Single DNS Query.",
                    "Detecting Intrusion in the Traffic Signals of an Intelligent Traffic System.",
                    "A Linguistic Approach Towards Intrusion Detection in Actual Proxy Logs.",
                    "Simau: A Dynamic Privilege Management Mechanism for Host in Cloud Datacenters.",
                    "USB Packets Filtering Policies and an Associated Low-Cost Simulation Framework.",
                    "FPGA-Based Assessment of Midori and Gift Lightweight Block Ciphers.",
                    "Simpler CCA Secure PKE from LPN Problem Without Double-Trapdoor.",
                    "PoS: Constructing Practical and Efficient Public Key Cryptosystems Based on Symmetric Cryptography with SGX.",
                    "Application of Public Ledgers to Revocation in Distributed Access Control.",
                    "Micropaying to a Distributed Payee with Instant Confirmation.",
                    "Revisiting Anonymous Two-Factor Authentication Schemes for Multi-server Environment."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th ICICS 2017",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2017",
                "sub_name": "Information and Communications Security - 19th International Conference, ICICS 2017, Beijing, China, December 6-8, 2017, Proceedings.",
                "count": 57,
                "papers": [
                    "Formal Analysis of a TTP-Free Blacklistable Anonymous Credentials System.",
                    "An Efficiency Optimization Scheme for the On-the-Fly Statistical Randomness Test.",
                    "FABSS: Attribute-Based Sanitizable Signature for Flexible Access Structure.",
                    "SSUKey: A CPU-Based Solution Protecting Private Keys on Untrusted OS.",
                    "The Reductions for the Approximating Covering Radius Problem.",
                    "Solving Discrete Logarithm Problem in an Interval Using Periodic Iterates.",
                    "Distributed Pseudorandom Functions for General Access Structures in NP.",
                    "Reducing Randomness Complexity of Mask Refreshing Algorithm.",
                    "A Plausibly Deniable Encryption Scheme Utilizing PUF's Thermo-Sensitivity.",
                    "Two Efficient Tag-Based Encryption Schemes on Lattices.",
                    "Compact (Targeted Homomorphic) Inner Product Encryption from LWE.",
                    "Compact Inner Product Encryption from LWE.",
                    "Towards Tightly Secure Deterministic Public Key Encryption.",
                    "Efficient Inner Product Encryption with Simulation-Based Security.",
                    "Server-Aided Directly Revocable Ciphertext-Policy Attribute-Based Encryption with Verifiable Delegation.",
                    "Practical Large Universe Attribute-Set Based Encryption in the Standard Model.",
                    "Fully Secure Hidden Ciphertext-Policy Attribute-Based Proxy Re-encryption.",
                    "Identity-Based Group Encryption Revisited.",
                    "Compact Hierarchical IBE from Lattices in the Standard Model.",
                    "Methods for Increasing the Resistance of Cryptographic Designs Against Horizontal DPA Attacks.",
                    "New Certificateless Public Key Encryption Secure Against Malicious KGC Attacks in the Standard Model.",
                    "A Lattice Attack on Homomorphic NTRU with Non-invertible Public Keys.",
                    "Practical Range Proof for Cryptocurrency Monero with Provable Security.",
                    "Modeling Key Infection in Large-Scale Sensor Networks.",
                    "SDN-Based Secure Localization in Heterogeneous WSN.",
                    "A PUF and Software Collaborative Key Protection Scheme.",
                    "Towards a Trusted and Privacy Preserving Membership Service in Distributed Ledger Using Intel Software Guard Extensions.",
                    "Deobfuscation of Virtualization-Obfuscated Code Through Symbolic Execution and Compilation Optimization.",
                    "A Self-healing Key Distribution Scheme for Mobile Ad Hoc Networks.",
                    "SecHome: A Secure Large-Scale Smart Home System Using Hierarchical Identity Based Encryption.",
                    "Multi-attribute Counterfeiting Tag Identification Protocol in Large-Scale RFID System.",
                    "Hijacking Your Routers via Control-Hijacking URLs in Embedded Devices with Web Interfaces.",
                    "A Method to Effectively Detect Vulnerabilities on Path Planning of VIN.",
                    "Towards Decentralized Accountability and Self-sovereignty in Healthcare Systems.",
                    "P3ASC: Privacy-Preserving Pseudonym and Attribute-Based Signcryption Scheme for Cloud-Based Mobile Healthcare System.",
                    "S7commTrace: A High Interactive Honeypot for Industrial Control System Based on S7 Protocol.",
                    "Research on Clustering-Differential Privacy for Express Data Release.",
                    "Frequent Itemset Mining with Differential Privacy Based on Transaction Truncation.",
                    "Perturbation Paradigms of Maintaining Privacy-Preserving Monotonicity for Differential Privacy.",
                    "The De-anonymization Method Based on User Spatio-Temporal Mobility Trace.",
                    "Privacy-Preserving Disease Risk Test Based on Bloom Filters.",
                    "Verifiable and Forward Secure Dynamic Searchable Symmetric Encryption with Storage Efficiency.",
                    "Improved Automatic Search Tool for Bit-Oriented Block Ciphers and Its Applications.",
                    "Hypercubes and Private Information Retrieval.",
                    "A Multi-client Dynamic Searchable Symmetric Encryption System with Physical Deletion.",
                    "High-Performance Symmetric Cryptography Server with GPU Acceleration.",
                    "An Experimental Study of Kannan's Embedding Technique for the Search LWE Problem.",
                    "A Security-Enhanced vTPM 2.0 for Cloud Computing.",
                    "SDAC: A New Software-Defined Access Control Paradigm for Cloud-Based Systems.",
                    "A Cross-Modal CCA-Based Astroturfing Detection Approach.",
                    "Secure and Efficient Two-Factor Authentication Protocol Using RSA Signature for Multi-server Environments.",
                    "Authenticated Group Key Agreement Protocol Without Pairing.",
                    "Machine Learning for Black-Box Fuzzing of Network Protocols.",
                    "A Novel Semantic-Aware Approach for Detecting Malicious Web Traffic.",
                    "An Active and Dynamic Botnet Detection Approach to Track Hidden Concept Drift.",
                    "Statically Defend Network Consumption Against Acker Failure Vulnerability in Storm.",
                    "Pollution Attacks Identification in Structured P2P Overlay Networks."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18. ICICS 2016",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2016",
                "sub_name": "Information and Communications Security - 18th International Conference, ICICS 2016, Singapore, November 29 - December 2, 2016, Proceedings.",
                "count": 36,
                "papers": [
                    "ECDSA on Things: IoT Integrity Protection in Practise.",
                    "Identity in the Internet-of-Things (IoT): New Challenges and Opportunities.",
                    "A Lightweight Method for Accelerating Discovery of Taint-Style Vulnerabilities in Embedded Systems.",
                    "A Self-adaptive Hopping Approach of Moving Target Defense to thwart Scanning Attacks.",
                    "Research on Security Algorithm of Virtual Machine Live Migration for KVM Virtualization System.",
                    "Towards Efficient Re-encryption for Secure Client-Side Deduplication in Public Clouds.",
                    "The Security of Individual Bit for XTR.",
                    "On the Robustness of Learning Parity with Noise.",
                    "The Linear Complexity and 2-Error Linear Complexity Distribution of 2^n 2 n -Periodic Binary Sequences with Fixed Hamming Weight.",
                    "The Variant of Remote Set Problem on Lattices.",
                    "Compression-Based Integral Prior Classification for Improving Steganalysis.",
                    "Group Verification Based Multiple-Differential Collision Attack.",
                    "A Transparent Learning Approach for Attack Prediction Based on User Behavior Analysis.",
                    "Application of Stylometry to DarkWeb Forum User Identification.",
                    "SECapacity: A Secure Capacity Scheduler in YARN.",
                    "Integrity and Authenticity Protection with Selective Disclosure Control in the Cloud & IoT.",
                    "MultiPol: Towards a Multi-policy Authorization Framework for RESTful Interfaces in the Cloud.",
                    "Provably Secure Identity-Based Identification and Signature Schemes with Parallel-PVR.",
                    "Assessment of Efficient Fingerprint Image Protection Principles Using Different Types of AFIS.",
                    "Medical Record System Using Blockchain, Big Data and Tokenization.",
                    "Is it Good or Bad? Disclosure of Medical Ailments on Twitter.",
                    "Weaknesses in Security Considerations Related to Chaos-Based Image Encryption.",
                    "Low-Cost Hardware Implementation of Elliptic Curve Cryptography for General Prime Fields.",
                    "Differential Fault Analysis on Midori.",
                    "Private Boolean Query Processing on Encrypted Data.",
                    "Privacy Leakage via Attribute Inference in Directed Social Networks.",
                    "DynaEgo: Privacy-Preserving Collaborative Filtering Recommender System Based on Social-Aware Differential Privacy.",
                    "A Comprehensive Study of Co-residence Threat in Multi-tenant Public PaaS Clouds.",
                    "The Threat of Virtualization: Hypervisor-Based Rootkits on the ARM Architecture.",
                    "Towards Trustworthy Smart Cyber-Physical Systems.",
                    "Vulnerability and Enhancement on Bluetooth Pairing and Link Key Generation Scheme for Security Modes 2 and 3.",
                    "Optimizing Secure Computation Programs with Private Conditionals.",
                    "Automated Security Proof of Cryptographic Support Commands in TPM 2.0.",
                    "How to Meet Big Data When Private Set Intersection Realizes Constant Communication Complexity.",
                    "Novel MITM Attacks on Security Protocols in SDN: A Feasibility Study.",
                    "A Practical Scheme for Data Secure Transport in VoIP Conferencing."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17. ICICS 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2015",
                "sub_name": "Information and Communications Security - 17th International Conference, ICICS 2015, Beijing, China, December 9-11, 2015, Revised Selected Papers.",
                "count": 41,
                "papers": [
                    "Minimizing Databases Attack Surface Against SQL Injection Attacks.",
                    "Ensuring Kernel Integrity Using KIPBMFH.",
                    "Bitsliced Implementations of the PRINCE, LED and RECTANGLE Block Ciphers on AVR 8-Bit Microcontrollers.",
                    "On Promise Problem of the Generalized Shortest Vector Problem.",
                    "Secret Key Extraction with Quantization Randomness Using Hadamard Matrix on QuaDRiGa Channel.",
                    "Practical Lattice-Based Fault Attack and Countermeasure on SM2 Signature Algorithm.",
                    "The Security of Polynomial Information of Diffie-Hellman Key.",
                    "How to Vote Privately Using Bitcoin.",
                    "Multidimensional Zero-Correlation Linear Cryptanalysis on 23-Round LBlock-s.",
                    "Traceable CP-ABE on Prime Order Groups: Fully Secure and Fully Collusion-Resistant Blackbox Traceable.",
                    "Generic Construction of Audit Logging Schemes with Forward Privacy and Authenticity.",
                    "A Novel Post-processing Method to Improve the Ability of Reconstruction for Video Leaking Signal.",
                    "TMSUI: A Trust Management Scheme of USB Storage Devices for Industrial Control Systems.",
                    "Characterization of the Third Descent Points for the k-error Linear Complexity of 2^n 2 n -periodic Binary Sequences.",
                    "QRL: A High Performance Quadruple-Rail Logic for Resisting DPA on FPGA Implementations.",
                    "Strategy of Relations Collection in Factoring RSA Modulus.",
                    "Ultra High-Performance ASIC Implementation of SM2 with SPA Resistance.",
                    "Multi-input Functional Encryption and Its Application in Outsourcing Computation.",
                    "A Multivariate Encryption Scheme with Rainbow.",
                    "Efficient and Secure Many-to-One Signature Delegation.",
                    "Fully Secure IBE with Tighter Reduction in Prime Order Bilinear Groups.",
                    "A Secure Route Optimization Mechanism for Expressive Internet Architecture (XIA) Mobility.",
                    "An Entropy Based Encrypted Traffic Classifier.",
                    "Modelling and Analysis of Network Security - a Probabilistic Value-passing CCS Approach.",
                    "An Improved NPCUSUM Method with Adaptive Sliding Window to Detect DDoS Attacks.",
                    "Dynamic Hybrid Honeypot System Based Transparent Traffic Redirection Mechanism.",
                    "Leveraging Static Probe Instrumentation for VM-based Anomaly Detection System.",
                    "MB-DDIVR: A Map-Based Dynamic Data Integrity Verification and Recovery Scheme in Cloud Storage.",
                    "Chameleon: A Lightweight Method for Thwarting Relay Attacks in Near Field Communication.",
                    "A Solution of Code Authentication on Android.",
                    "Verifiable Proxy Re-encryption from Indistinguishability Obfuscation.",
                    "Higher-Order Masking Schemes for Simon.",
                    "An ORAM Scheme with Improved Worst-Case Computational Overhead.",
                    "A Self-Matching Sliding Block Algorithm Applied to Deduplication in Distributed Storage System.",
                    "Suffix Type String Matching Algorithms Based on Multi-windows and Integer Comparison.",
                    "Security-Enhanced Reprogramming with XORs Coding in Wireless Sensor Networks.",
                    "Preserving Context Privacy in Distributed Hash Table Wireless Sensor Networks.",
                    "Prior Classification of Stego Containers as a New Approach for Enhancing Steganalyzers Accuracy.",
                    "Eavesdropper: A Framework for Detecting the Location of the Processed Result in Hadoop.",
                    "Secret Picture: An Efficient Tool for Mitigating Deletion Delay on OSN.",
                    "A De-anonymization Attack on Geo-Located Data Considering Spatio-temporal Influences."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16. ICICS 2014",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2014",
                "sub_name": "Information and Communications Security - 16th International Conference, ICICS 2014, Hong Kong, China, December 16-17, 2014, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Error-Tolerant Algebraic Side-Channel Attacks Using BEE.",
                    "SEDB: Building Secure Database Services for Sensitive Data.",
                    "Mdaak: A Flexible and Efficient Framework for Direct Anonymous Attestation on Mobile Devices.",
                    "Protecting Elliptic Curve Cryptography Against Memory Disclosure Attacks.",
                    "4P_VES: A Collusion-Resistant Accountable Virtual Economy System.",
                    "Privacy-Preserving Distance-Bounding Proof-of-Knowledge.",
                    "Distance Lower Bounding.",
                    "Efficient Adaptive Oblivious Transfer Without q-type Assumptions in UC Framework.",
                    "TagDroid: Hybrid SSL Certificate Verification in Android.",
                    "A Guess-Then-Algebraic Attack on LFSR-Based Stream Ciphers with Nonlinear Filter.",
                    "A Private Lookup Protocol with Low Online Complexity for Secure Multiparty Computation.",
                    "Reverse Product-Scanning Multiplication and Squaring on 8-Bit AVR Processors.",
                    "New Security Proof for the Boneh-Boyen IBE: Tight Reduction in Unbounded Multi-challenge Security.",
                    "Method for Determining Whether or not Text Information Is Leaked from Computer Display Through Electromagnetic Radiation.",
                    "How to Compare Selections of Points of Interest for Side-Channel Distinguishers in Practice?",
                    "Attribute Based Key-Insulated Signatures with Message Recovery.",
                    "XOR Based Non-monotone t- (k, n)^* -Visual Cryptographic Schemes Using Linear Algebra.",
                    "A Visual One-Time Password Authentication Scheme Using Mobile Devices.",
                    "Secure and Efficient Scheme for Delegation of Signing Rights.",
                    "Fully Secure Ciphertext-Policy Attribute Based Encryption with Security Mediator.",
                    "MOVTCHA: A CAPTCHA Based on Human Cognitive and Behavioral Features Analysis.",
                    "Security Analysis of EMV Channel Establishment Protocol in An Enhanced Security Model."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15. ICICS 2013",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2013",
                "sub_name": "Information and Communications Security - 15th International Conference, ICICS 2013, Beijing, China, November 20-22, 2013. Proceedings.",
                "count": 29,
                "papers": [
                    "Defending against Heap Overflow by Using Randomization in Nested Virtual Clusters.",
                    "VTOS: Research on Methodology of \"Light-Weight\" Formal Design and Verification for Microkernel OS.",
                    "Defeat Information Leakage from Browser Extensions via Data Obfuscation.",
                    "Rating Web Pages Using Page-Transition Evidence.",
                    "OSNGuard: Detecting Worms with User Interaction Traces in Online Social Networks.",
                    "A Secure and Efficient Scheme for Cloud Storage against Eavesdropper.",
                    "Secure and Private Outsourcing of Shape-Based Feature Extraction.",
                    "Time-Stealer: A Stealthy Threat for Virtualization Scheduler and Its Countermeasures.",
                    "Detecting Malicious Co-resident Virtual Machines Indulging in Load-Based Attacks.",
                    "A Covert Channel Using Event Channel State on Xen Hypervisor.",
                    "Type-Based Analysis of Protected Storage in the TPM.",
                    "Remote Attestation Mechanism for User Centric Smart Cards Using Pseudorandom Number Generators.",
                    "Direct Construction of Signcryption Tag-KEM from Standard Assumptions in the Standard Model.",
                    "Efficient eCK-Secure Authenticated Key Exchange Protocols in the Standard Model.",
                    "XLRF: A Cross-Layer Intrusion Recovery Framework for Damage Assessment and Recovery Plan Generation.",
                    "PRIDE: Practical Intrusion Detection in Resource Constrained Wireless Mesh Networks.",
                    "Fingerprint Embedding: A Proactive Strategy of Detecting Timing Channels.",
                    "Comprehensive Evaluation of AES Dual Ciphers as a Side-Channel Countermeasure.",
                    "EMD-Based Denoising for Side-Channel Attacks and Relationships between the Noises Extracted with Different Denoising Methods.",
                    "Accelerating AES in JavaScript with WebGL.",
                    "Analysis of Multiple Checkpoints in Non-perfect and Perfect Rainbow Tradeoff Revisited.",
                    "Efficient Implementation of NIST-Compliant Elliptic Curve Cryptography for Sensor Nodes.",
                    "Attacking and Fixing the CS Mode.",
                    "Integral Attacks on Reduced-Round PRESENT.",
                    "Computationally Efficient Expressive Key-Policy Attribute Based Encryption Schemes with Constant-Size Ciphertext.",
                    "Privacy-Preserving Decentralized Ciphertext-Policy Attribute-Based Encryption with Fully Hidden Access Structure.",
                    "Toward Generic Method for Server-Aided Cryptography.",
                    "Generation and Tate Pairing Computation of Ordinary Elliptic Curves with Embedding Degree One.",
                    "Threshold Secret Image Sharing."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14. ICICS 2012",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2012",
                "sub_name": "Information and Communications Security - 14th International Conference, ICICS 2012, Hong Kong, China, October 29-31, 2012. Proceedings.",
                "count": 49,
                "papers": [
                    "Audio Steganalysis Based on Lossless Data-Compression Techniques.",
                    "Enhancing the Perceived Visual Quality of a Size Invariant Visual Cryptography Scheme.",
                    "Impact of the Revocation Service in PKI Prices.",
                    "Cryptanalysis of Multi-Prime RSA with Small Prime Difference.",
                    "Implicit Polynomial Recovery and Cryptanalysis of a Combinatorial Key Cryptosystem.",
                    "Improved Related-Key Differential Attacks on Reduced-Round LBlock.",
                    "Countermeasures on Application Level Low-Rate Denial-of-Service Attack.",
                    "Firewall Packet Filtering Optimization Using Statistical Traffic Awareness Test.",
                    "Group Behavior Metrics for P2P Botnet Detection.",
                    "Hardware Performance Optimization and Evaluation of SM3 Hash Algorithm on FPGA.",
                    "Continual Leakage-Resilient Dynamic Secret Sharing in the Split-State Model.",
                    "Conversion of Real-Numbered Privacy-Preserving Problems into the Integer Domain.",
                    "Perfect Ambiguous Optimistic Fair Exchange.",
                    "Privacy-Preserving Noisy Keyword Search in Cloud Computing.",
                    "Forward Secure Attribute-Based Signatures.",
                    "On Constant-Round Precise Zero-Knowledge.",
                    "Outsourcing Encryption of Attribute-Based Encryption with MapReduce.",
                    "Security Enhancement of Identity-Based Identification with Reversibility.",
                    "Coopetitive Architecture to Support a Dynamic and Scalable NFC Based Mobile Services Architecture.",
                    "Permission-Based Abnormal Application Detection for Android.",
                    "Symbian Smartphone Forensics and Security: Recovery of Privacy-Protected Deleted Data.",
                    "Detecting Encryption Functions via Process Emulation and IL-Based Program Analysis.",
                    "Taint Analysis of Security Code in the KLEE Symbolic Execution Engine.",
                    "A Generic Approach for Providing Revocation Support in Secret Handshake.",
                    "An Efficient Single-Slow-Phase Mutually Authenticated RFID Distance Bounding Protocol with Tag Privacy.",
                    "Exploring Mobile Proxies for Better Password Authentication.",
                    "On Security of Universal Hash Function Based Multiple Authentication.",
                    "A New Variant of Time Memory Trade-Off on the Improvement of Thing and Ying's Attack.",
                    "Applying Time-Memory-Data Trade-Off to Plaintext Recovery Attack.",
                    "Comparison between Side-Channel Analysis Distinguishers.",
                    "Acceleration of Composite Order Bilinear Pairing on Graphics Hardware.",
                    "Evaluating the Effect of Tolerance on Click-Draw Based Graphical Password Scheme.",
                    "Robust Evidence Detection of Copy-Rotate-Move Forgery in Image Based on Singular Value Decomposition.",
                    "Cookie-Proxy: A Scheme to Prevent SSLStrip Attack.",
                    "Detecting and Preventing ActiveX API-Misuse Vulnerabilities in Internet Explorer.",
                    "Endpoint Mitigation of DDoS Attacks Based on Dynamic Thresholding.",
                    "Parameter Pollution Vulnerabilities Detection Study Based on Tree Edit Distance.",
                    "A Privacy-Preserving Path-Checking Solution for RFID-Based Supply Chains.",
                    "Efficient Attribute Proofs in Anonymous Credential Using Attribute-based Cryptography.",
                    "F5P5: Keyword Search over Encrypted Data with Five Functions and Five Privacy Assurances.",
                    "Location Privacy Policy Management System.",
                    "Privacy Protection in Social Networks Using l-Diversity.",
                    "Selling Power Back to the Grid in a Secure and Privacy-Preserving Manner.",
                    "A Key Sharing Fuzzy Vault Scheme.",
                    "A New Version of McEliece PKC Based on Convolutional Codes.",
                    "Flexible Attribute-Based Encryption.",
                    "Non-interactive Dynamic Identity-Based Broadcast Encryption without Random Oracles.",
                    "A Comparative Study of Malware Family Classification.",
                    "A Fine-Grained Classification Approach for the Packed Malicious Code."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13. ICICS 2011",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2011",
                "sub_name": "Information and Communications Security - 13th International Conference, ICICS 2011, Beijing, China, November 23-26, 2011. Proceedings.",
                "count": 33,
                "papers": [
                    "Forward Secure Ring Signature without Random Oracles.",
                    "Ring Signature Schemes from Lattice Basis Delegation.",
                    "Computational Soundness about Formal Encryption in the Presence of Secret Shares and Key Cycles.",
                    "A Variant of Boyen-Waters Anonymous IBE Scheme.",
                    "Non-interactive Opening for Ciphertexts Encrypted by Shared Keys.",
                    "Lightweight RFID Mutual Authentication Protocol against Feasible Problems.",
                    "A Note on a Privacy-Preserving Distance-Bounding Protocol.",
                    "Delegable Provable Data Possession for Remote Data in the Clouds.",
                    "Unconditionally Secure Oblivious Transfer Based on Channel Delays.",
                    "Preserving Security and Privacy in Large-Scale VANETs.",
                    "A Probabilistic Secret Sharing Scheme for a Compartmented Access Structure.",
                    "Ideal Secret Sharing Schemes with Share Selectability.",
                    "A Novel Pyramidal Dual-Tree Directional Filter Bank Domain Color Image Watermarking Algorithm.",
                    "Detection for Multiplicative Watermarking in DCT Domain by Cauchy Model.",
                    "Extension of Barreto-Voloch Root Extraction Method.",
                    "Two Applications of an Incomplete Additive Character Sum to Estimating Nonlinearity of Boolean Functions.",
                    "Evaluating Optimized Implementations of Stream Cipher ZUC Algorithm on FPGA.",
                    "First Differential Attack on Full 32-Round GOST.",
                    "Collision Attack for the Hash Function Extended MD4.",
                    "Linear Cryptanalysis of ARIA Block Cipher.",
                    "Latin Dances Revisited: New Analytic Results of Salsa20 and ChaCha.",
                    "Behavior Analysis-Based Dynamic Trust Measurement Model.",
                    "Improvement and Analysis of VDP Method in Time/Memory Tradeoff Applications.",
                    "Analyzing the Performance of Dither Modulation in Presence of Composite Attacks.",
                    "Applying Time-Bound Hierarchical Key Assignment in Wireless Sensor Networks.",
                    "A Unified Security Framework for Multi-domain Wireless Mesh Networks.",
                    "Ontology Model-Based Static Analysis of Security Vulnerabilities.",
                    "A Multi-compositional Enforcement on Information Flow Security.",
                    "HyperCrop: A Hypervisor-Based Countermeasure for Return Oriented Programming.",
                    "An Efficient Finger-Knuckle-Print Based Recognition System Fusing SIFT and SURF Matching Scores.",
                    "Multivariate Correlation Analysis Technique Based on Euclidean Distance Map for Network Traffic Characterization.",
                    "Situational Assessment of Intrusion Alerts: A Multi Attack Scenario Evaluation.",
                    "Minimising Anonymity Loss in Anonymity Networks under DoS Attacks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12. ICICS 2010",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2010",
                "sub_name": "Information and Communications Security - 12th International Conference, ICICS 2010, Barcelona, Spain, December 15-17, 2010. Proceedings.",
                "count": 32,
                "papers": [
                    "Cryptographic Hash Functions: Theory and Practice.",
                    "Rewriting of SPARQL/Update Queries for Securing Data Access.",
                    "Fine-Grained Disclosure of Access Policies.",
                    "Manger's Attack Revisited.",
                    "Horizontal Correlation Analysis on Exponentiation.",
                    "Threshold Public-Key Encryption with Adaptive Security and Short Ciphertexts.",
                    "A Trust-Based Robust and Efficient Searching Scheme for Peer-to-Peer Networks.",
                    "CUDACS: Securing the Cloud with CUDA-Enabled Secure Virtualization.",
                    "SEIP: Simple and Efficient Integrity Protection for Open Mobile Platforms.",
                    "Securing Mobile Access in Ubiquitous Networking via Non-roaming Agreement Protocol.",
                    "Compromise-Resilient Anti-jamming for Wireless Sensor Networks.",
                    "On Practical Second-Order Power Analysis Attacks for Block Ciphers.",
                    "Consecutive S-box Lookups: A Timing Attack on SNOW 3G.",
                    "Efficient Authentication for Mobile and Pervasive Computing.",
                    "Security Enhancement and Modular Treatment towards Authenticated Key Exchange.",
                    "Federated Secret Handshakes with Support for Revocation.",
                    "An Agent-Mediated Fair Exchange Protocol.",
                    "A New Method for Formalizing Optimistic Fair Exchange Protocols.",
                    "Unconditionally Secure First-Price Auction Protocols Using a Multicomponent Commitment Scheme.",
                    "Proving Coercion-Resistance of Scantegrity II.",
                    "Anonymity and Verifiability in Voting: Understanding (Un)Linkability.",
                    "A Secure and Practical Approach for Providing Anonymity Protection for Trusted Platforms.",
                    "Time Warp: How Time Affects Privacy in LBSs.",
                    "Return-Oriented Rootkit without Returns (on the x86).",
                    "Experimental Threat Model Reuse with Misuse Case Diagrams.",
                    "Automatically Generating Patch in Binary Programs Using Attribute-Based Taint Analysis.",
                    "Identity-Based Proxy Cryptosystems with Revocability and Hierarchical Confidentialities.",
                    "Ciphertext Policy Attribute-Based Proxy Re-encryption.",
                    "Hybrid Detection of Application Layer Attacks Using Markov Models for Normality and Attacks.",
                    "A Trust-Based IDS for the AODV Protocol.",
                    "IDS Alert Visualization and Monitoring through Heuristic Host Selection.",
                    "A Two-Tier System for Web Attack Detection Using Linear Discriminant Method."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11. ICICS 2009",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2009",
                "sub_name": "Information and Communications Security, 11th International Conference, ICICS 2009, Beijing, China, December 14-17, 2009. Proceedings.",
                "count": 39,
                "papers": [
                    "How to Steal a Botnet and What Can Happen When You Do.",
                    "A User-Mode-Kernel-Mode Co-operative Architecture for Trustable Computing.",
                    "Security Evaluation of a DPA-Resistant S-Box Based on the Fourier Transform.",
                    "Security Analysis of the GF-NLFSR Structure and Four-Cell Block Cipher.",
                    "The rakaposhi Stream Cipher.",
                    "Design of Reliable and Secure Multipliers by Multilinear Arithmetic Codes.",
                    "Hardware/Software Co-design of Public-Key Cryptography for SSL Protocol Execution in Embedded Systems.",
                    "Online/Offline Ring Signature Scheme.",
                    "Policy-Controlled Signatures.",
                    "Public Key Encryption without Random Oracle Made Truly Practical.",
                    "A Public-Key Traitor Tracing Scheme with an Optimal Transmission Rate.",
                    "Computationally Secure Hierarchical Self-healing Key Distribution for Heterogeneous Wireless Sensor Networks.",
                    "Enabling Secure Secret Updating for Unidirectional Key Distribution in RFID-Enabled Supply Chains.",
                    "Biometric-Based Non-transferable Anonymous Credentials.",
                    "Secure Remote Execution of Sequential Computations.",
                    "Architecture- and OS-Independent Binary-Level Dynamic Test Generation.",
                    "Measuring Information Flow in Reactive Processes.",
                    "Trusted Isolation Environment: An Attestation Architecture with Usage Control Model.",
                    "Denial-of-Service Attacks on Host-Based Generic Unpackers.",
                    "Predictive Pattern Matching for Scalable Network Intrusion Detection.",
                    "Deterministic Finite Automata Characterization for Memory-Based Pattern Matching.",
                    "A LoSS Based On-line Detection of Abnormal Traffic Using Dynamic Detection Threshold.",
                    "User-Assisted Host-Based Detection of Outbound Malware Traffic.",
                    "Assessing Security Risk to a Network Using a Statistical Model of Attacker Community Competence.",
                    "Using the (Open) Solaris Service Management Facility as a Building Block for System Security.",
                    "IntFinder: Automatically Detecting Integer Bugs in x86 Binary Program.",
                    "A Comparative Study of Privacy Mechanisms and a Novel Privacy Mechanism [Short Paper].",
                    "Collusion-Resistant Protocol for Privacy-Preserving Distributed Association Rules Mining.",
                    "GUC-Secure Join Operator in Distributed Relational Database.",
                    "TSM-Trust: A Time-Cognition Based Computational Model for Trust Dynamics.",
                    "Bring Efficient Connotation Expressible Policies to Trust Management.",
                    "A User Trust-Based Collaborative Filtering Recommendation Algorithm.",
                    "Fingerprinting Attack on the Tor Anonymity System.",
                    "Proactive Verifiable Linear Integer Secret Sharing Scheme.",
                    "A Multi-stage Secret Sharing Scheme Using All-or-Nothing Transform Approach.",
                    "Digital Audio Watermarking Technique Using Pseudo-Zernike Moments.",
                    "An Image Sanitizing Scheme Using Digital Watermarking.",
                    "Adaptive and Composable Oblivious Transfer Protocols (Short Paper).",
                    "Discrete-Log-Based Additively Homomorphic Encryption and Secure WSN Data Aggregation."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10. ICICS 2008",
        "info": "Birmingham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2008",
                "sub_name": "Information and Communications Security, 10th International Conference, ICICS 2008, Birmingham, UK, October 20-22, 2008, Proceedings.",
                "count": 28,
                "papers": [
                    "Attestation: Evidence and Trust.",
                    "A Novel Solution for End-to-End Integrity Protection in Signed PGP Mail.",
                    "Unclonable Lightweight Authentication Scheme.",
                    "Threat Modelling in User Performed Authentication.",
                    "Access with Fast Batch Verifiable Anonymous Credentials.",
                    "Quantifying Timing Leaks and Cost Optimisation.",
                    "Method for Detecting Vulnerability to Doubling Attacks.",
                    "Side Channel Analysis of Some Hash Based MACs: A Response to SHA-3 Requirements.",
                    "Key Recovery Attack on Stream Cipher Mir-1 Using a Key-Dependent S-Box.",
                    "Analysis of Two Attacks on Reduced-Round Versions of the SMS4.",
                    "Applying Time-Memory-Data Trade-Off to Meet-in-the-Middle Attack.",
                    "Beyond User-to-User Access Control for Online Social Networks.",
                    "Revocation Schemes for Delegation Licences.",
                    "Reusability of Functionality-Based Application Confinement Policy Abstractions.",
                    "Towards Role Based Trust Management without Distributed Searching of Credentials.",
                    "BinHunt: Automatically Finding Semantic Differences in Binary Programs.",
                    "Enhancing Java ME Security Support with Resource Usage Monitoring.",
                    "Pseudo-randomness Inside Web Browsers.",
                    "Verifiable and Revocable Expression of Consent to Processing of Aggregated Personal Data.",
                    "Embedding Renewable Cryptographic Keys into Continuous Noisy Data.",
                    "Automated Device Pairing for Asymmetric Pairing Scenarios.",
                    "Algebraic Description and Simultaneous Linear Approximations of Addition in Snow 2.0..",
                    "Towards an Information Theoretic Analysis of Searchable Encryption.",
                    "A Bootstrap Attack on Digital Watermarks in the Frequency Domain.",
                    "Improved Data Hiding Technique for Shares in Extended Visual Secret Sharing Schemes.",
                    "Efficient Multi-authorizer Accredited Symmetrically Private Information Retrieval.",
                    "Specification of Electronic Voting Protocol Properties Using ADM Logic: FOO Case Study.",
                    "Publicly Verifiable Remote Data Integrity."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9. ICICS 2007",
        "info": "Zhengzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2007",
                "sub_name": "Information and Communications Security, 9th International Conference, ICICS 2007, Zhengzhou, China, December 12-15, 2007, Proceedings.",
                "count": 38,
                "papers": [
                    "Time and Space Efficient Algorithms for Two-Party Authenticated Data Structures.",
                    "New Construction of Group Secret Handshakes Based on Pairings.",
                    "n PAKE + : A Hierarchical Group Password-Authenticated Key Exchange Protocol Using Different Passwords.",
                    "An Efficient Password-Only Two-Server Authenticated Key Exchange System.",
                    "Formal Definition and Construction of Nominative Signature.",
                    "Short Group Signature Without Random Oracles.",
                    "(Convertible) Undeniable Signatures Without Random Oracles.",
                    "A New Dynamic Accumulator for Batch Updates.",
                    "Preventing Unofficial Information Propagation.",
                    "A Novel Method for Micro-Aggregation in Secure Statistical Databases Using Association and Interaction.",
                    "Privacy Protection on Multiple Sensitive Attributes.",
                    "Audio Watermarking Algorithm Based on Centroid and Statistical Features.",
                    "A Semi-blind Watermarking Based on Discrete Wavelet Transform.",
                    "On the Design of Fast Prefix-Preserving IP Address Anonymization Scheme.",
                    "High Speed Modular Divider Based on GCD Algorithm.",
                    "MDH: A High Speed Multi-phase Dynamic Hash String Matching Algorithm for Large-Scale Pattern Set.",
                    "Compact and Secure Design of Masked AES S-Box.",
                    "Boudot's Range-Bounded Commitment Scheme Revisited.",
                    "Toward Practical Anonymous Rerandomizable RCCA Secure Encryptions.",
                    "Secure Multiparty Computation of DNF.",
                    "Square Like Attack on Camellia.",
                    "Differential Fault Analysis on CLEFIA.",
                    "Extending FORK-256 Attack to the Full Hash Function.",
                    "Attacking Reduced-Round Versions of the SMS4 Block Cipher in the Chinese WAPI Standard.",
                    "A Framework for Game-Based Security Proofs.",
                    "What Semantic Equivalences Are Suitable for Non-interference Properties in Computer Security.",
                    "Modeling Agreement Problems in the Universal Composability Framework.",
                    "A System Architecture for History-Based Access Control for XML Documents.",
                    "Power Efficient Hardware Architecture of SHA-1 Algorithm for Trusted Mobile Computing.",
                    "Auth-SL - A System for the Specification and Enforcement of Quality-Based Authentication Policies.",
                    "A Novel Approach for Untrusted Code Execution.",
                    "Detection and Diagnosis of Control Interception.",
                    "BIOS Security Analysis and a Kind of Trusted BIOS.",
                    "Collecting Autonomous Spreading Malware Using High-Interaction Honeypots.",
                    "DDoS Attack Detection Algorithms Based on Entropy Computing.",
                    "Firewall for Dynamic IP Address in Mobile IPv6.",
                    "Application of the PageRank Algorithm to Alarm Graphs.",
                    "Drive-By Pharming."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8. ICICS 2006",
        "info": "Raleigh, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2006",
                "sub_name": "Information and Communications Security, 8th International Conference, ICICS 2006, Raleigh, NC, USA, December 4-7, 2006, Proceedings.",
                "count": 39,
                "papers": [
                    "Strong and Robust RFID Authentication Enabling Perfect Ownership Transfer.",
                    "A Robust and Secure RFID-Based Pedigree System (Short Paper).",
                    "A Topological Condition for Solving Fair Exchange in Byzantine Environments.",
                    "A Security Analysis of the Precise Time Protocol (Short Paper).",
                    "An Identity-Based Proxy Signature Scheme from Pairings.",
                    "Finding Compact Reliable Broadcast in Unknown Fixed-Identity Networks (Short Paper).",
                    "Formal Analysis and Systematic Construction of Two-Factor Authentication Scheme (Short Paper).",
                    "Hierarchical Key Assignment for Black-Box Tracing with Efficient Ciphertext Size.",
                    "Trace-Driven Cache Attacks on AES (Short Paper).",
                    "A Construction for General and Efficient Oblivious Commitment Based Envelope Protocols.",
                    "Defining and Measuring Policy Coverage in Testing Access Control Policies.",
                    "Distributed Credential Chain Discovery in Trust Management with Parameterized Roles and Constraints (Short Paper).",
                    "An Operating System Design for the Security Architecture for Microprocessors.",
                    "Point-Based Trust: Define How Much Privacy Is Worth.",
                    "Efficient Protocols for Privacy Preserving Matching Against Distributed Datasets.",
                    "Quantifying Information Leakage in Tree-Based Hash Protocols (Short Paper).",
                    "An Anonymous Authentication Scheme for Identification Card.",
                    "A Wireless Covert Channel on Smart Cards (Short Paper).",
                    "From Proxy Encryption Primitives to a Deployable Secure-Mailing-List Solution.",
                    "Mathematical Foundations for the Design of a Low-Rate DoS Attack to Iterative Servers (Short Paper).",
                    "An Independent Function-Parallel Firewall Architecture for High-Speed Networks (Short Paper).",
                    "Estimating Accuracy of Mobile-Masquerader Detection Using Worst-Case and Best-Case Scenario.",
                    "An Enhanced N-Way Exchange-Based Incentive Scheme for P2P File Sharing (Short Paper).",
                    "Provably Correct Runtime Enforcement of Non-interference Properties.",
                    "An Attack on SMC-Based Software Protection.",
                    "Modular Behavior Profiles in Systems with Shared Libraries (Short Paper).",
                    "Efficient Protection Against Heap-Based Buffer Overflows Without Resorting to Magic.",
                    "Cryptanalysis of Timestamp-Based Password Authentication Schemes Using Smart Cards.",
                    "Cryptanalysis of ID-Based Authenticated Key Agreement Protocols from Bilinear Pairings (Short Paper).",
                    "Seifert's RSA Fault Attack: Simplified Analysis and Generalizations.",
                    "The Fairness of Perfect Concurrent Signatures.",
                    "Secure Set Membership Using 3Sat.",
                    "Left-to-Right Signed-Bit tau-Adic Representations of n Integers (Short Paper).",
                    "Universal Designated Verifier Signature Without Delegatability.",
                    "Tracing HTTP Activity Through Non-cooperating HTTP Proxies (Short Paper).",
                    "A Fast RSA Implementation on Itanium 2 Processor.",
                    "Efficient Implementation of Public Key Cryptosystems on Mote Sensors (Short Paper).",
                    "Threshold Implementations Against Side-Channel Attacks and Glitches.",
                    "Hardware-and-Software-Based Security Architecture for Broadband Router (Short Paper)."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7. ICICS 2005",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2005",
                "sub_name": "Information and Communications Security, 7th International Conference, ICICS 2005, Beijing, China, December 10-13, 2005, Proceedings.",
                "count": 40,
                "papers": [
                    "An Evenhanded Certified Email System for Contract Signing.",
                    "Efficient ID-Based Optimistic Fair Exchange with Provable Security.",
                    "On the Quest for Impartiality: Design and Analysis of a Fair Non-repudiation Protocol.",
                    "Generic, Optimistic, and Efficient Schemes for Fair Certified Email Delivery.",
                    "Cryptanalysis of a Forward Secure Blind Signature Scheme with Provable Security.",
                    "On Delegatability of Four Designated Verifier Signatures.",
                    "PIATS: A Partially Sanitizable Signature Scheme.",
                    "Ciphertext Comparison, a New Solution to the Millionaire Problem.",
                    "Private Itemset Support Counting.",
                    "Visual Cryptographic Protocols Using the Trusted Initializer.",
                    "Admissible Interference by Typing for Cryptographic Protocols.",
                    "On the Security Bounds of CMC, EME, EME+ and EME* Modes of Operation.",
                    "On the Security of Encryption Modes of MD4, MD5 and HAVAL.",
                    "Cryptanalysis of PASS II and MiniPass.",
                    "Simple Power Analysis on Fast Modular Reduction with NIST Recommended Elliptic Curves.",
                    "Asymmetric Concurrent Signatures.",
                    "Generic Construction of (Identity-Based) Perfect Concurrent Signatures.",
                    "Sequential Aggregate Signatures Working over Independent Homomorphic Trapdoor One-Way Permutation Domains.",
                    "Session Table Architecture for Defending SYN Flood Attack.",
                    "A Behavior-Based Ingress Rate-Limiting Mechanism Against DoS/DDoS Attacks.",
                    "Port Scan Behavior Diagnosis by Clustering.",
                    "Network Vulnerability Analysis Through Vulnerability Take-Grant Model (VTG).",
                    "Multiplex Encryption: A Practical Approach to Encrypting Multi-recipient Emails.",
                    "Secure Multicast Using Proxy Encryption.",
                    "Efficient and Non-interactive Timed-Release Encryption.",
                    "Security Properties of Two Authenticated Conference Key Agreement Protocols.",
                    "Cryptanalysis of Two User Identification Schemes with Key Distribution Preserving Anonymity.",
                    "Enhanced ID-Based Authenticated Key Agreement Protocols for a Multiple Independent PKG Environment.",
                    "Enforce Mandatory Access Control Policy on XML Documents.",
                    "Network Access Control for Mobile Ad-Hoc Networks.",
                    "Remotely Keyed Cryptographics Secure Remote Display Access Using (Mostly) Untrusted Hardware.",
                    "Authenticating Query Results in Data Publishing.",
                    "Multi-Source Stream Authentication Framework in Case of Composite MPEG-4 Stream.",
                    "Batching SSL/TLS Handshake Improved.",
                    "Achieving Efficient Conjunctive Keyword Searches over Encrypted Data.",
                    "Total Disclosure of the Embedding and Detection Algorithms for a Secure Digital Watermarking Scheme for Audio.",
                    "Reversible Watermark with Large Capacity Using the Predictive Coding.",
                    "PCAV: Internet Attack Visualization on Parallel Coordinates.",
                    "Implementation of Packet Filter Configurations Anomaly Detection System with SIERRA.",
                    "D_DIPS: An Intrusion Prevention System for Database Security."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6. ICICS 2004",
        "info": "Malaga, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2004",
                "sub_name": "Information and Communications Security, 6th International Conference, ICICS 2004, Malaga, Spain, October 27-29, 2004, Proceedings.",
                "count": 42,
                "papers": [
                    "On the Minimal Assumptions of Group Signature Schemes.",
                    "Perfect Concurrent Signature Schemes.",
                    "New Identity-Based Ring Signature Schemes.",
                    "On the Security of a Multi-party Certified Email Protocol.",
                    "Robust Metering Schemes for General Access Structures.",
                    "PAYFLUX - Secure Electronic Payment in Mobile Ad Hoc Networks.",
                    "Flexible Verification of MPEG-4 Stream in Peer-to-Peer CDN.",
                    "Provably Secure Authenticated Tree Based Group Key Agreement.",
                    "Taxonomic Consideration to OAEP Variants and Their Security.",
                    "Factorization-Based Fail-Stop Signatures Revisited.",
                    "A Qualitative Evaluation of Security Patterns.",
                    "Type Inferability and Decidability of the Security Problem Against Inference Attacks on Object-Oriented Databases.",
                    "Volatile Memory Computer Forensics to Detect Kernel Level Compromise.",
                    "A SecureWorkflow Model Based on Distributed Constrained Role and Task Assignment for the Internet.",
                    "Hydan: Hiding Information in Program Binaries.",
                    "A Semi-fragile Steganographic Digital Signature for Images.",
                    "Identification of Traitors Using a Trellis.",
                    "Decentralized Publish-Subscribe System to Prevent Coordinated Attacks via Alert Correlation.",
                    "Reflector Attack Traceback System with Pushback Based iTrace Mechanism.",
                    "Automatic Covert Channel Analysis of a Multilevel Secure Component.",
                    "Sound Approximations to Diffie-Hellman Using Rewrite Rules.",
                    "On Randomized Addition-Subtraction Chains to Counteract Differential Power Attacks.",
                    "New Power Analysis on the Ha-Moon Algorithm and the MIST Algorithm.",
                    "Modified Power-Analysis Attacks on XTR and an Efficient Countermeasure.",
                    "Modelling Dependencies Between Classifiers in Mobile Masquerader Detection.",
                    "Threat Analysis on NEtwork MObility (NEMO).",
                    "Macro-level Attention to Mobile Agent Security: Introducing the Mobile Agent Secure Hub Infrastructure Concept.",
                    "Securing the Destination-Sequenced Distance Vector Routing Protocol (S-DSDV).",
                    "Secret-Public Storage Trade-Off for Broadcast Encryption Key Management.",
                    "Security Analysis of the Generalized Self-shrinking Generator.",
                    "On Asymptotic Security Estimates in XL and Gröbner Bases-Related Algebraic Cryptanalysis.",
                    "On Some Weak Extensions of AES and BES.",
                    "Clock Control Sequence Reconstruction in the Ciphertext Only Attack Scenario.",
                    "Transient Fault Induction Attacks on XTR.",
                    "Adaptive-CCA on OpenPGP Revisited.",
                    "A New Key-Insulated Signature Scheme.",
                    "Secure Hierarchical Identity Based Signature and Its Application.",
                    "Multi-designated Verifiers Signatures.",
                    "Dynamic Access Control for Multi-privileged Group Communications.",
                    "An Efficient Authentication Scheme Using Recovery Information in Signature.",
                    "Time-Scoped Searching of Encrypted Audit Logs.",
                    "Rights-Carrying and Self-enforcing Information Objects for Information Distribution Systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5. ICICS 2003",
        "info": "Huhehaote, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2003",
                "sub_name": "Information and Communications Security, 5th International Conference, ICICS 2003, Huhehaote, China, October 10-13, 2003, Proceedings.",
                "count": 37,
                "papers": [
                    "A Fast Square Root Computation Using the Frobenius Mapping.",
                    "A Forward-Secure Blind Signature Scheme Based on the Strong RSA Assumption.",
                    "Secure Route Structures for the Fast Dispatch of Large-Scale Mobile Agents.",
                    "On the RS-Code Construction of Ring Signature Schemes and a Threshold Setting of RST.",
                    "A Policy Based Framework for Access Control.",
                    "Trading-Off Type-Inference Memory Complexity against Communication.",
                    "Security Remarks on a Group Signature Scheme with Member Deletion.",
                    "An Efficient Known Plaintext Attack on FEA-M.",
                    "An Efficient Public-Key Framework.",
                    "ROCEM: Robust Certified E-mail System Based on Server-Supported Signature.",
                    "Practical Service Charge for P2P Content Distribution.",
                    "ICMP Traceback with Cumulative Path, an Efficient Solution for IP Traceback.",
                    "A Lattice Based General Blind Watermark Scheme.",
                    "Role-Based Access Control and the Access Control Matrix.",
                    "Broadcast Encryption Schemes Based on the Sectioned Key Tree.",
                    "Research on the Collusion Estimation.",
                    "Multiple Description Coding for Image Data Hiding Jointly in the Spatial and DCT Domains.",
                    "Protocols for Malicious Host Revocation.",
                    "A DWT-Based Digital Video Watermarking Scheme with Error Correcting Code.",
                    "A Novel Two-Level Trust Model for Grid.",
                    "Practical t-out-n Oblivious Transfer and Its Applications.",
                    "Adaptive Collusion Attack to a Block Oriented Watermarking Scheme.",
                    "ID-Based Distributed \"Magic Ink\" Signature from Pairings.",
                    "A Simple Anonymous Fingerprinting Scheme Based on Blind Signature.",
                    "Compact Conversion Schemes for the Probabilistic OW-PCA Primitives.",
                    "A Security Verification Method for Information Flow Security Policies Implemented in Operating Systems.",
                    "A Novel Efficient Group Signature Scheme with Forward Security.",
                    "Variations of Diffie-Hellman Problem.",
                    "A Study on the Covert Channel Detection of TCP/IP Header Using Support Vector Machine.",
                    "A Research on Intrusion Detection Based on Unsupervised Clustering and Support Vector Machine.",
                    "UC-RBAC: A Usage Constrained Role-Based Access Control Model.",
                    "(Virtually) Free Randomization Techniques for Elliptic Curve Cryptography.",
                    "An Optimized Multi-bits Blind Watermarking Scheme.",
                    "A Compound Intrusion Detection Model.",
                    "An Efficient Convertible Authenticated Encryption Scheme and Its Variant.",
                    "Space-Economical Reassembly for Intrusion Detection System.",
                    "A Functional Decomposition of Virus and Worm Programs."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4. ICICS 2002",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2002",
                "sub_name": "Information and Communications Security, 4th International Conference, ICICS 2002, Singapore, December 9-12, 2002, Proceedings.",
                "count": 41,
                "papers": [
                    "Defenses against the Truncation of Computation Results of Free-Roaming Agents.",
                    "A Distributed Dynamic µFirewall Architecture with Mobile Agents and KeyNote Trust Management System.",
                    "Encoding Function Pointers and Memory Arrangement Checking against Buffer Overflow Attack.",
                    "An Evaluation of Different IP Traceback Approaches.",
                    "Security against Inference Attacks on Negative Information in Object-Oriented Databases.",
                    "Robust Key-Evolving Public Key Encryption Schemes.",
                    "A Group Signature Scheme Committing the Group.",
                    "Unconditionally Secure Key Insulated Cryptosystems: Models, Bounds and Constructions.",
                    "Anonymous Fingerprinting as Secure as the Bilinear Diffie-Hellman Assumption.",
                    "Reducing the Memory Complexity of Type-Inference Algorithms.",
                    "The Risks of Compromising Secret Information.",
                    "Password-Authenticated Key Exchange between Clients with Different Passwords.",
                    "Robust, Privacy Protecting and Publicly Verifiable Sealed-Bid Auction.",
                    "Attacking Predictable IPsec ESP Initialization Vectors.",
                    "An ID Coding Scheme for Fingerprinting, Randomized c-Secure CRT Code.",
                    "A Robust Block Oriented Watermarking Scheme in Spatial Domain.",
                    "A Flexibly Revocable Key-Distribution Scheme for Efficient Black-Box Tracing.",
                    "Low Complexity Bit Serial Systolic Multipliers over GF(2m) for Three Classes of Finite Fields.",
                    "Fast Elliptic Curve Multiplications with SIMD Operations.",
                    "Further Results on Multiples of Primitive Polynomials and Their Products over GF(2).",
                    "A Secure Object Sharing Scheme for Java Card.",
                    "IDS Interoperability and Correlation Using IDMEF and Commodity Systems.",
                    "A Synthetic Fraud Data Generation Methodology.",
                    "User Interaction Design for Secure Systems.",
                    "Using Independent Auditors as Intrusion Detection Systems.",
                    "Cellular Automata Based Cryptosystem (CAC).",
                    "New Weak-Key Classes of IDEA.",
                    "Risks with Raw-Key Masking - The Security Evaluation of 2-Key XCBC.",
                    "A New Statistical Testing for Symmetric Ciphers and Hash Functions.",
                    "Message Authentication Codes with Error Correcting Capabilities.",
                    "The Consistency of an Access Control List.",
                    "Knowledge-Based Modeling and Simulation of Network Access Control Mechanisms Representing Security Policies.",
                    "A Specification Language for Distributed Policy Control.",
                    "Access Control Infrastructure for Digital Objects.",
                    "Distributed Key Generation as a Component of an Integrated Protocol.",
                    "A Secure Agent-Mediated Payment Protocol.",
                    "Tensor Transform of Boolean Functions and Related Algebraic and Probabilistic Properties.",
                    "Related-Cipher Attacks.",
                    "A Chosen Plaintext Linear Attack on Block Cipher CIKS-1.",
                    "Ideal Threshold Schemes from Orthogonal Arrays.",
                    "Cryptanalysis of the Reduced-Round RC6."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3. ICICS 2001",
        "info": "Xian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/2001",
                "sub_name": "Information and Communications Security, Third International Conference, ICICS 2001, Xian, China, November 13-16, 2001.",
                "count": 56,
                "papers": [
                    "Security of Blind Discrete Log Signatures against Interactive Attacks.",
                    "An Intelligent Intruder Model for Security Protocol Analysis.",
                    "Primitive Polynomials over GF(2) - A Cryptologic Approach.",
                    "Unconditionally-Secure Oblivious Transfer.",
                    "Cryptanalysis of the Improved User Efficient Blind Signatures.",
                    "Towards the Forgery of a Group Signature without Knowing the Group Center's Secret.",
                    "Evaluation of the Image Degradation for a Typical Watermarking Algorithm in the Block-DCT Domain.",
                    "A Cyclic Window Algorithm for ECC Defined over Extension Fields.",
                    "Fast Scalar Multiplication on the Jacobian of a Family of Hyperelliptic Curves.",
                    "Attacks on Two Digital Signature Schemes Based on Error Correcting Codes.",
                    "A Derivative of Digital Objects and Estimation of Default Risks in Electronic Commerce.",
                    "A New Approach for Secure Multicast Routing in a Large Scale Network.",
                    "A Transaction Length-Sensitive Protocol Based on Altruistic Locking for Multilevel Secure Database Systems.",
                    "Dealing with Uncertainties in Risk Analysis Using Belief Functions.",
                    "RBAC for XML Document Stores.",
                    "Cheating Immune Secret Sharing.",
                    "Encryption Sticks (Randomats).",
                    "Applying NCP Logic to the Analysis of SSL 3.0.",
                    "Performance of WTLS and Its Impact on an M-commerce Transaction.",
                    "Enforcing Obligation with Security Monitors.",
                    "Efficient Software Implementation for Finite Field Multiplication in Normal Basis.",
                    "Playing Lottery on the Internet.",
                    "Privacy Protection for Transactions of Digital Goods.",
                    "Equivalent Characterizations and Applications of Multi-output Correlation-Immune Boolean Functions.",
                    "Threshold Undeniable RSA Signature Scheme.",
                    "Two Simple Batch Verifying Multiple Digital Signatures.",
                    "Square Attack on Reduced Camellia Cipher.",
                    "Generalization of Elliptic Curve Digital Signature Schemes.",
                    "Reasoning about Accountability within Delegation.",
                    "A Novel Data Hiding Method for Two-Color Images.",
                    "An Identification Scheme Provably Secure against Reset Attack.",
                    "Estimating the Scalability of the Internet Key Exchange.",
                    "An Efficient Information Flow Analysis of Recursive Programs Based on a Lattice Model of Security Classes.",
                    "Defeating Denial-of-Service Attacks on the Internet.",
                    "A Role-Based Access Control Model and Implementation for Data-Centric Enterprise Applications.",
                    "A Unified Methodology for Verification and Synthesis of Firewall Configurations.",
                    "Quantifying Network Denial of Service: A Location Service Case Study.",
                    "A Public Key Cryptosystem Based on the Subgroup Membership Problem.",
                    "On a Network Security Model for the Secure Information Flow on Multilevel Secure Network.",
                    "NIDS Research Based on Artificial Immunology.",
                    "AMBAR Protocol: Access Management Based on Authorization Reduction.",
                    "Chinese Remainder Theorem Based Hierarchical Access Control for Secure Group Communication.",
                    "Dispatching Mobile Agents with Secure Routes in Parallel.",
                    "TH-SMS: Security Management System in Advanced Computational Infrastructure.",
                    "Cryptography and Middleware Security.",
                    "Cryptanalysis of the Hwang-Rao Secret Error-Correcting Code Schemes.",
                    "A Role-Based Model for Access Control in Database Federations.",
                    "A Useful Intrusion Detection System Prototype to Monitor Multi-processes Based on System Calls.",
                    "A Digital Nominative Proxy Signature Scheme for Mobile Communication.",
                    "Hierarchical Simulation Model with Animation for Large Network Security.",
                    "Fair Electronic Cash Based on a Group Signature Scheme.",
                    "Fair Exchange of Digital Signatures with Offline Trusted Third Party.",
                    "SECUSIM: A Tool for the Cyber-Attack Simulation.",
                    "A New Semantics of Authentication Logic.",
                    "Robust and Fragile Watermarking Techniques for Documents Using Bi-directional Diagonal Profiles.",
                    "Redundancy, Obscurity, Self-Containment & Independence."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2. ICICS 1999",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/1999",
                "sub_name": "Information and Communication Security, Second International Conference, ICICS'99, Sydney, Australia, November 9-11, 1999, Proceedings.",
                "count": 26,
                "papers": [
                    "International Cryptography (Abstract).",
                    "Reaction Attacks against several Public-Key Cryptosystems.",
                    "Cryptanalysis of some AES Candidate Algorithms.",
                    "Issues in the Design of a Language for Role Based Access Control.",
                    "Extending ERLANG for Safe Mobile Code Execution.",
                    "Detachable Electronic Coins.",
                    "Linear Secret Sharing with Divisible Shares.",
                    "Efficient Publicly Verifiable Secret Sharing Schemes with Fast or Delayed Recovery.",
                    "Zero-Knowledge Proofs of Possession of Digital Signatures and Its Applications.",
                    "Signature Scheme for Controlled Environments.",
                    "On the Cryptographic Value of The qth Root Problem.",
                    "Protecting Critical Information Systems (Abstract).",
                    "Delegation Chains Secure up to Constant Length.",
                    "Optimal Construction of Unconditionally Secure ID-Based Key Sharing Scheme for Large-Scale Networks.",
                    "Enhancing the Resistence of a Provably Secure Key Agreement Protocol to a Denial-of-Service Attack.",
                    "An Extended Logic for Analyzing Timed-Release Public-Key Protocols.",
                    "Bringing Together X.509 and EDIFACT Public Key Infrastructures: The DEDICA Project.",
                    "User Identification System Based on Biometrics for Keystroke.",
                    "Boundary Conditions that Influence Decisions about Log File Formats in Multi-Application Smart Cards.",
                    "Send Message into a Definite Future.",
                    "Efficient Accumulators without Trapdoor Extended Abstracts.",
                    "Evolutionary Heuristics for Finding Cryptographically Strong S-Boxes.",
                    "Incremental Authentication of Tree-Structured Documents.",
                    "Plateaued Functions.",
                    "On the Linear Complexity of the Naor-Reingold Pseudo-Random Function.",
                    "On the Channel Capacity of Narrow-Band Subliminal Channels."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1. ICICS 1997",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icics/1997",
                "sub_name": "Information and Communication Security, First International Conference, ICICS'97, Beijing, China, November 11-14, 1997, Proceedings.",
                "count": 48,
                "papers": [
                    "Minimizing the use of random oracles in authenticated encryption schemes.",
                    "Zero-knowledge proofs of decision power: new protocols and optimal round-complexity.",
                    "Computational learning theoretic cryptanalysis of language theoretic cryptosystems.",
                    "A language for specifying sequences of authorization transformations and its applications.",
                    "On the decomposition constructions for perfect secret sharing schemes.",
                    "Traceable visual cryptography.",
                    "Remarks on the multiple assignment secret sharing scheme.",
                    "Secret sharing in hierarchical groups.",
                    "Stateless connections.",
                    "Design of a security platform for CORBA based application.",
                    "Secure document management and distribution in an open network environment.",
                    "A2-code = Affine resolvable = BIBD.",
                    "Multisender authentication systems with unconditional security.",
                    "Proposal of user identification scheme using mouse.",
                    "An effective genetic algorithm for finding highly nonlinear Boolean Functions.",
                    "Duality of Boolean functions and its cryptographic significance.",
                    "Construction of correlation immune Boolean functions.",
                    "An improved key stream generator based on the programmable cellular automata.",
                    "A Trust policy framework.",
                    "Critical analysis of security in voice hiding techniques.",
                    "Two efficient RSA multisignature schemes.",
                    "Proxy signatures, Revisited.",
                    "Related-key cryptanalysis of 3-WAY, Biham-DES, CAST, DES-X, NewDES, RC2, and TEA.",
                    "A multiplication-addition structure against differential attack.",
                    "On strict estimation method of provable security against differential and linear cryptanalysis.",
                    "Improved fast software implementation of block ciphers.",
                    "Security comments on the Hwang-Chen algebraic-code cryptosystem.",
                    "Efficient elliptic curve exponentiation.",
                    "Efficient construction of secure hyperelliptic discrete logarithm problems.",
                    "A new and optimal chosen-message attack on RSA-type cryptosystems.",
                    "On weak RSA-keys produced from Pretty Good Privacy.",
                    "Self-synchronized message randomization methods for subliminal channels.",
                    "Hiding the Hidden: A software system for concealing ciphertext as innocuous text.",
                    "Digital signature and public key cryptosystems in a prime order subgroup of Zn*.",
                    "Trapdoor one-way permutations and multivariate polynominals.",
                    "Asymmetric cryptography with S-Boxes.",
                    "On the powerline system.",
                    "Making unfair a \"fair\" blind signature scheme.",
                    "Enforcing traceability in software.",
                    "Publicly verifiable partial key escrow.",
                    "A secure code for recipient watermarking against conspiracy attacks by all users.",
                    "Protocols for issuing public-key certificates over the Internet.",
                    "Distributed cryptographic function application protocols.",
                    "Fault tolerant anonymous channel.",
                    "An implementable scheme for secure delegation of computing and data.",
                    "Electronic commerce with secure intelligent trade agent.",
                    "Efficient scalable fair cash with off-line extortion prevention.",
                    "An anonymous and undeniable payment scheme."
                ]
            }
        ]
    }
]