[
    {
        "name": "IET Information Security",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 12,
        "papers": [
            "Security notions for stateful signature schemes.",
            "Cryptanalysis of a white-box SM4 implementation based on collision attack.",
            "New attacks against reduced Rijndael-160.",
            "Lattice-based hash-and-sign signatures using approximate trapdoor, revisited.",
            "Fault attacks on authenticated encryption modes for GIFT.",
            "Inhibiting crypto-ransomware on windows platforms through a honeyfile-based approach with R-Locker.",
            "Integral and impossible-differential attacks on the reduced-round Lesamnta-LW-BC.",
            "LDoS attack detection method based on traffic classification prediction.",
            "A deep learning-based attack on text CAPTCHAs by using object detection techniques.",
            "Quantum-resistant anonymous identity-based encryption with trable identities.",
            "On robust strong-non-interferent low-latency multiplications.",
            "Authorisation inconsistency in IoT third-party integration."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 38,
        "papers": [
            "Lattice-based unidirectional Proxy Re-Encryption and Proxy Re-Encryption+ schemes.",
            "A novel scheme for lossless authenticated multiple secret images sharing using polynomials and extended visual cryptography.",
            "A reference measurement framework of software security product quality (SPQNFSR).",
            "A behavioural in-depth analysis of ransomware infection.",
            "Continuous improvement on maturity and capability of Security Operation Centres.",
            "Private feasible solution determination.",
            "Further constructions of bent functions and their duals.",
            "An efficient lattice-based threshold signature scheme using multi-stage secret sharing.",
            "Efficient lattice-based authenticated key exchange based on key encapsulation mechanism and signature.",
            "Time-specific encrypted range query with minimum leakage disclosure.",
            "Lightweight certificateless linearly homomorphic network coding signature scheme for electronic health system.",
            "Analysis on Aigis-Enc: Asymmetrical and symmetrical.",
            "Smart home: Keeping privacy based on Air-Padding.",
            "A hybrid model for fake news detection: Leveraging news content and user comments in fake news.",
            "T-SNERF: A novel high accuracy machine learning approach for Intrusion Detection Systems.",
            "Detecting human attacks on text-based CAPTCHAs using the keystroke dynamic approach.",
            "Watermarking public-key cryptographic functionalities and implementations: The case of encryption and signatures.",
            "How not to secure wireless sensor networks: a plethora of insecure polynomial-based key pre-distribution schemes.",
            "Towards practical intrusion detection system over encrypted traffic.",
            "Improved meet-in-the-middle attacks on reduced-round Joltik-BC.",
            "Securing fingerprint templates by enhanced minutiae-based encoding scheme in Fuzzy Commitment.",
            "Memory-constrained implementation of lattice-based encryption scheme on standard Java Card platform.",
            "Asymptotically ideal Chinese remainder theorem -based secret sharing schemes for multilevel and compartmented access structures.",
            "Joint security and performance improvement in multilevel shared caches.",
            "Indifferentiable hash functions in the standard model.",
            "Lattice-based nominative signature using pseudorandom function.",
            "Homomorphic signcryption with public plaintext-result checkability.",
            "Is low-rate distributed denial of service a great threat to the Internet?",
            "Extended supersingular isogeny Diffie-Hellman key exchange protocol: Revenge of the SIDH.",
            "Adaptive and survivable trust management for Internet of Things systems.",
            "Comment on 'Targeted Ciphers for Format-Preserving Encryption' from Selected Areas in Cryptography 2018.",
            "Feature selection-based android malware adversarial sample generation and detection method.",
            "Extension of simultaneous Diophantine approximation algorithm for partial approximate common divisor variants.",
            "Lattice-based revocable attribute-based encryption with decryption key exposure resistance.",
            "DPLQ: Location-based service privacy protection scheme based on differential privacy.",
            "Yoyo trick on type-II generalised Feistel networks.",
            "Efficient multi-key fully homomorphic encryption over prime cyclotomic rings with fewer relinearisations.",
            "A new quantum cryptanalysis method on block cipher Camellia."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 80,
        "papers": [
            "Mining of intrusion attack in SCADA network using clustering and genetically seeded flora-based optimal classification algorithm.",
            "MILP-aided bit-based division property for primitives with non-bit-permutation linear layers.",
            "An efficient authentication and key agreement protocol for a group of vehicles devices in 5G cellular networks.",
            "Implementing confidential transactions with lattice techniques.",
            "Correlation-based sequence alignment models for detecting masquerades in cloud computing.",
            "Secure signal processing using fully homomorphic encryption.",
            "How to build a vulnerability benchmark to overcome cyber security attacks.",
            "Cube distinguisher extraction using division property in block ciphers.",
            "Dynamic resource virtualisation method for survivability enhancement based on SDN.",
            "Contextual-based approach to reduce false positives.",
            "Secure hierarchical authentication protocol in VANET.",
            "Specifications and improvements of LPN solving algorithms.",
            "Integral distinguishers for Grøstl-512 and Kupyna-512 permutation functions.",
            "New method for assets sensitivity calculation and technical risks assessment in the information systems.",
            "Ways to merge two secret sharing schemes.",
            "New single-trace side-channel attacks on a specific class of Elgamal cryptosystem.",
            "Protecting scientific workflows in clouds with an intrusion tolerant system.",
            "Network intrusion detection model based on multivariate correlation analysis - long short-time memory network.",
            "Novel non-linear dynamics P2P network worm propagation and immune model.",
            "Fingerprint image quality assessment based on BP neural network with hierarchical clustering.",
            "Choosing subfields for LUOV and lifting fields for rainbow.",
            "Framework for faster key search using related-key higher-order differential properties: applications to Agrasta.",
            "Parallel-CNN network for malware detection.",
            "Threshold trapdoor functions and their applications.",
            "Mutual authentication-based RA scheme for embedded systems.",
            "Call graph obfuscation and diversification: an approach.",
            "Guest Editorial: Selected Papers from 17th International Conference on Cryptology and Network Security (CANS).",
            "Faster privacy-preserving location proximity schemes for circles and polygons.",
            "Fully invisible protean signatures schemes.",
            "Impact of the modulus switching technique on some attacks against learning problems.",
            "Complexity of statistical attacks on QC-LDPC code-based cryptosystems.",
            "Breaking the hardness assumption and IND-CPA security of HQC submitted to NIST PQC project.",
            "Privacy-preserving constrained spectral clustering algorithm for large-scale data sets.",
            "Data availability improvement in peer-to-peer online social networks.",
            "Improved collusion-resistant unidirectional proxy re-encryption scheme from lattice.",
            "ANOVUL: Detection of logic vulnerabilities in annotated programs via data and control flow analysis.",
            "Corrigendum: Public-key encryption indistinguishable under plaintext-checkable attacks.",
            "Guest Editorial: Security on Mobile and IoT Devices.",
            "IoT security vulnerabilities and predictive signal jamming attack analysis in LoRaWAN.",
            "Lightweight and privacy-preserving authentication scheme with the resilience of desynchronisation attacks for WBANs.",
            "Privacy preservation with RTT-based detection for wireless mesh networks.",
            "Detection of compromised accounts for online social networks based on a supervised analytical hierarchy process.",
            "Security analysis of KAP based on enhanced MPF.",
            "Malware classification using compact image features and multiclass support vector machines.",
            "Algebraic method to recover superpolies in cube attacks.",
            "Distributed signing protocol for IEEE P1363-compliant identity-based signature scheme.",
            "Novel LDoS attack detection by Spark-assisted correlation analysis approach in wireless sensor network.",
            "Scan-based attack tolerance with minimum testability loss: a gate-level approach.",
            "Cloud-assisted secure and conjunctive publish/subscribe service in smart grids.",
            "x-only coordinate: with application to secp256k1 \" >Chosen base-point side-channel attack on Montgomery ladder with x-only coordinate: with application to secp256k1.",
            "Lattice signatures using NTRU on the hardness of worst-case ideal lattice problems.",
            "Improved integral attacks on 24-round LBlock and LBlock-s.",
            "Secure and load-balanced routing protocol in wireless sensor network or disaster management.",
            "Improved SIMD implementation of Poly1305.",
            "Improved real-time permission based malware detection and clustering approach using model independent pruning.",
            "Threat model and construction strategy on ADS-B attack data.",
            "Computation integrity assurance for emerging distributed computation outsourcing environments, the case of block withholding attack on Bitcoin pools.",
            "Robust security framework with bit-flipping attack and timing attack for key derivation functions.",
            "Integral cryptanalysis on two block ciphers Pyjamask and uBlock.",
            "Research on a high-order AES mask anti-power attack.",
            "Differential attacks on reduced-round SNOW 3G and SNOW 3G⊕.",
            "MILP-based automatic differential search for LEA and HIGHT block ciphers.",
            "SMT-based cube attack on round-reduced Simeck32/64.",
            "Efficient blacklistable anonymous credential system with reputation using a pairing-based accumulator.",
            "Pairing free identity based aggregate signcryption scheme.",
            "Efficient elliptic curve Diffie-Hellman computation at the 256-bit security level.",
            "More realistic analysis of mass surveillance - security in multi-surveillant settings.",
            "Further study on constructing bent functions outside the completed Maiorana-McFarland class.",
            "Post-quantum protocol for computing set intersection cardinality with linear complexity.",
            "SPCOR: a secure and privacy-preserving protocol for mobile-healthcare emergency to reap computing opportunities at remote and nearby.",
            "C-NSA: a hybrid approach based on artificial immune algorithms for anomaly detection in web traffic.",
            "Economic feasibility study for stealthy socialbot network establishment.",
            "P2 KASE A2 - privacy-preserving key aggregate searchable encryption supporting authentication and access control on multi-delegation.",
            "Multi-party key generation protocol for the identity-based signature scheme in the IEEE P1363 standard for public key cryptography.",
            "Achieving secure and convenient WLAN sharing in personal.",
            "Statistical watermarking approach for 3D mesh using local curvature estimation.",
            "Non-stochastic hypothesis testing for privacy.",
            "Tightly-secure two-pass authenticated key exchange protocol using twin Diffie-Hellman problem.",
            "GUIM-SMD: guilty user identification model using summation matrix-based distribution.",
            "New dynamic and verifiable multi-secret sharing schemes based on LFSR public key cryptosystem."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 76,
        "papers": [
            "Detection of double compression in HEVC videos based on TU size and quantised DCT coefficients.",
            "Towards incorporating honeywords in n-session recording attack resilient unaided authentication services.",
            "HPCgnature: a hardware-based application-level intrusion detection system.",
            "Costly freeware: a systematic analysis of abuse in download portals.",
            "Security evaluation and design elements for a class of randomised encryptions.",
            "Network intrusion detection algorithm based on deep neural network.",
            "Secure degrees of freedom of two-user X-channel with synergistic alternating channel state information at transmitters.",
            "Privacy preserving weighted similarity search scheme for encrypted data.",
            "Meet-in-the-middle attacks on round-reduced tweakable block cipher Deoxys-BC.",
            "Dynamic reencryption of return addresses.",
            "Division cryptanalysis of block ciphers with a binary diffusion layer.",
            "Security analysis of ABAC under an administrative model.",
            "Quantum secret sharing by using Fourier transform on orbital angular momentum.",
            "Detecting anomalous traffic in the controlled network based on cross entropy and support vector machine.",
            "New second-order threshold implementation of AES.",
            "On the extension and security of key schedule of GOST.",
            "Detecting lateral spear phishing attacks in organisations.",
            "Advanced conditional differential attack on Grain-like stream cipher and application on Grain v1.",
            "Framework for risk assessment in cyber situational awareness.",
            "Build a trusted storage system on a mobile phone.",
            "Provably secure certificateless aggregate signature scheme with designated verifier in an improved security model.",
            "Unsupervised approach for detecting shilling attacks in collaborative recommender systems based on user rating behaviours.",
            "HAP: detection of HTTP flooding attacks in cloud using diffusion map and affinity propagation clustering.",
            "Event reconstruction using temporal pattern of file system modification.",
            "Security and fault tolerance evaluation of TMR-QDI circuits.",
            "Multi-hop interpersonal trust assessment in vehicular ad-hoc networks using three-valued subjective logic.",
            "Fast Montgomery modular multiplier for Rivest-Shamir-Adleman cryptosystem.",
            "Impact assessment of policy expressiveness of an optimised access control model for smart sensors.",
            "Base for algebraic cryptanalysis based on combined representation of S-box.",
            "Re-definable access control over outsourced data in cloud storage systems.",
            "Analysis of dynamic code updating in Android with security perspective.",
            "Threshold verifiable multi-secret sharing based on elliptic curves and Chinese remainder theorem.",
            "Detecting LDoS attack bursts based on queue distribution.",
            "Detecting new generations of threats using attribute-based attack graphs.",
            "Chosen message strategy to improve the correlation power analysis.",
            "PriVeto: a fully private two-round veto protocol.",
            "Secure data storage and intrusion detection in the cloud using MANN and dual encryption through various attacks.",
            "Certifying multi-power RSA.",
            "Public key authenticated encryption with keyword search: revisited.",
            "How to construct a verifiable multi-secret sharing scheme based on graded encoding schemes.",
            "Leveraging deep neural networks for anomaly-based web application firewall.",
            "Non-quantum cryptanalysis of the noisy version of Aaronson-Christiano's quantum money scheme.",
            "Dynamic API call sequence visualisation for malware classification.",
            "Dinamite: internal differential match-in-the-end attack on eight-round PAEQ.",
            "Encrypted secure polar coding scheme for general two-way wiretap channel.",
            "Security of generalised Reed-Solomon code-based cryptosystems.",
            "Improved guess-and-determine attack on TRIVIUM.",
            "ESR analysis over ST-MRC multi-input multi-output Nakagami fading channels.",
            "Identity-based encryption resilient to continuous key leakage.",
            "Causal analysis of attacks against honeypots based on properties of countries.",
            "S-boxes representation and efficiency of algebraic attack.",
            "Multi-designated verifiers signature schemes with threshold verifiability: generic pattern and a concrete scheme in the standard model.",
            "New zero-sum distinguishers on full 24-round Keccak-f using the division property.",
            "New method to describe the differential distribution table for large S-boxes in MILP and its application.",
            "Inline high-bandwidth network analysis using a robust stream clustering algorithm.",
            "Escrowed decryption protocols for lawful interception of encrypted data.",
            "Sigma protocol for faster proof of simultaneous homomorphism relations.",
            "Research on highly non-linear plateaued functions.",
            "Image-based CAPTCHAs based on neural style transfer.",
            "Fair and private rewarding in a coalitional game of cybersecurity information sharing.",
            "Dynamical model for individual defence against cyber epidemic attacks.",
            "Advanced encryption standard based on key dependent S-Box cube.",
            "Guess and determine cryptanalysis with variable sampling and its applications.",
            "Transforming malicious code to ROP gadgets for antivirus evasion.",
            "Witness indistinguishability and witness hiding against quantum attacks.",
            "Cryptanalysis for reduced round Salsa and ChaCha: revisited.",
            "Distinguisher and non-randomness of Grain-v1 for 112, 114 and 116 initialisation rounds with multiple-bit difference in IVs.",
            "Division polynomial-based elliptic curve scalar multiplication revisited.",
            "Multi-key homomorphic authenticators.",
            "Fully homomorphic encryption based on the ring learning with rounding problem.",
            "Enhanced secure data backup scheme using multi-factor authentication.",
            "Hybrid intelligent phishing website prediction using deep neural networks with genetic algorithm-based feature selection and weighting.",
            "Leakage-resilient lattice-based partially blind signatures.",
            "Revisiting BGG+14 ABE with weakness analysis.",
            "Charge balancing symmetric pre-resolve adiabatic logic against power analysis attacks.",
            "Dynamic asymmetric group key agreement protocol with traitor traceability."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 67,
        "papers": [
            "Implementation of single-packet hybrid IP traceback for IPv4 and IPv6 networks.",
            "Virtualisation security risk assessment for enterprise cloud services based on stochastic game nets model.",
            "Privacy preserving big data mining: association rule hiding using fuzzy logic approach.",
            "Securing RSA against power analysis attacks through non-uniform exponent partitioning with randomisation.",
            "A provably secure code-based concurrent signature scheme.",
            "Database authentication watermarking scheme in encrypted domain.",
            "Attribute-based broadcast encryption scheme for lightweight devices.",
            "Mining malicious behavioural patterns.",
            "Cryptanalysis of a generic one-round key exchange protocol with strong security.",
            "Group key exchange protocols withstanding ephemeral-key reveals.",
            "Security evaluation on Simeck against zero-correlation linear cryptanalysis.",
            "Outsourcing secret sharing scheme based on homomorphism encryption.",
            "Efficient approximate message authentication scheme.",
            "Malware classification based on API calls and behaviour analysis.",
            "Analysis of the adoption of security headers in HTTP.",
            "Cryptanalysis of Morillo-Obrador polynomial delegation schemes.",
            "Formal analysis of HMAC authorisation in the TPM2.0 specification.",
            "Efficient revocable and grantable attribute-based encryption from lattices with fine-grained access control.",
            "Efficient identity-based blind message recovery signature scheme from pairings.",
            "CCN framework with privacy support.",
            "Guest Editorial: Selected Papers from the Public Key Cryptography (PKC 2016) Conference.",
            "Efficient unlinkable sanitizable signatures from signatures with re-randomizable keys.",
            "Practical attribute-based signature schemes for circuits from bilinear map.",
            "Delegatable functional signatures.",
            "Receiver- and sender-deniable functional encryption.",
            "Degenerate curve attacks: extending invalid curve attacks to Edwards curves and other models.",
            "Mimic defense: a designed-in cybersecurity defense framework.",
            "Information security collaboration formation in organisations.",
            "Guest Editorial: Selected Papers from the 15th International Conference on Cryptology and Network Security (CANS 2016).",
            "Power of public-key function-private functional encryption.",
            "FHE over the integers and modular arithmetic circuits.",
            "Sandwich construction for keyed sponges: independence between capacity and construction queries.",
            "Analysing HSTS and HPKP implementation in both browsers and servers.",
            "Trade-off between self-healing and energy consumption in mobile unattended WSNs.",
            "Multi-objective auto-regressive whale optimisation for traffic-aware routing in urban VANET.",
            "Protect white-box AES to resist table composition attacks.",
            "Improved zero-correlation and impossible differential cryptanalysis of reduced-round SIMECK block cipher.",
            "Framework for practical and receipt-free remote voting.",
            "Least lion optimisation algorithm (LLOA) based secret key generation for privacy preserving association rule hiding.",
            "Personalised anonymity for microdata release.",
            "Generalisation of Hadamard matrix to generate involutory MDS matrices for lightweight cryptography.",
            "Thermal maps based HT detection using spatial projection transformation.",
            "Detecting shilling profiles in collaborative recommender systems via multidimensional profile temporal features.",
            "Deterministic lattice reduction on knapsacks with collision-free properties.",
            "Parallel multiple pattern matching schemes based on cuckoo filter for deep packet inspection on graphics processing units.",
            "Weak keys of the full MISTY1 block cipher for related-key amplified boomerang cryptanalysis.",
            "User-friendly XOR-based visual secret sharing by random grid.",
            "Anomaly-based exploratory analysis and detection of exploits in android mediaserver.",
            "Linear complexity of Legendre-polynomial quotients.",
            "Observations on the truncated differential of SP block ciphers and their applications to mCrypton and CRYPTON V1.0.",
            "Method for measuring the privacy level of pre-published dataset.",
            "Smartphone passcode prediction.",
            "RTTV: a dynamic CFI measurement tool based on TPM.",
            "Sequential opening multi-jammers localisation in multi-hop wireless network.",
            "Server notaries: a complementary approach to the web PKI trust model.",
            "CryptoSAT: a tool for SAT-based cryptanalysis.",
            "Efficient batch identity-based fully homomorphic encryption scheme in the standard model.",
            "Guess-and-determine attacks on PANAMA-like stream ciphers.",
            "Equivalent key attack against a public-key cryptosystem based on subset sum problem.",
            "Detection and differentiation of application layer DDoS attack from flash events using fuzzy-GA computation.",
            "Improved integral attacks without full codebook.",
            "Physical feasibility of QKD based on probabilistic quantum circuits.",
            "New algorithms for the unbalanced generalised birthday problem.",
            "Supervised learning framework for covert channel detection in LTE-A.",
            "Vulnerability modelling of crypto-chips against scan-based attacks.",
            "Preprocessing optimisation: revisiting recursive-BKZ lattice reduction algorithm.",
            "OPEXA: analyser assistant for detecting over-privileged extensions."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 53,
        "papers": [
            "Secret key establishment technique using channel state information driven phase randomisation in multiple-input multiple-output orthogonal frequency division multiplexing.",
            "Back-propagation neural network on Markov chains from system call sequences: a new approach for detecting Android malware with system call sequences.",
            "Public-key infrastructure validation and revocation mechanism suitable for delay/disruption tolerant networks.",
            "Signature-policy attribute-based key-insulated signature.",
            "Sparse subset sum problem from Gentry-Halevi's fully homomorphic encryption.",
            "Versatile virtual honeynet management framework.",
            "Improved conditional differential attacks on Grain v1.",
            "Design of new scan orders for perceptual encryption of H.264/AVC videos.",
            "High-performance and high-speed implementation of polynomial basis Itoh-Tsujii inversion algorithm over GF(2 m ).",
            "Highly nonlinear plateaued functions.",
            "Lightweight and integrity-protecting oriented data aggregation scheme for wireless sensor networks.",
            "Searching all truncated impossible differentials in SPN.",
            "Improved meet-in-the-middle attacks on Crypton and mCrypton.",
            "Hybrid mechanism towards network packet early acceptance and rejection for unified threat management.",
            "Analysing recursive preprocessing of BKZ lattice reduction algorithm.",
            "Analysis of permutation choices for enhanced generalised Feistel structure with SP-type round function.",
            "Balanced anonymity and traceability for outsourcing small-scale data linear aggregation in the smart grid.",
            "Conditional differential attacks on Grain-128a stream cipher.",
            "Practical attacks on the round-reduced PRINCE.",
            "Detecting multiple H.264/AVC compressions with the same quantisation parameters.",
            "BDD-based cryptanalysis of stream cipher: a practical approach.",
            "Directed proxy signature with fast revocation proven secure in the standard model.",
            "Efficient methods to generate cryptographically significant binary diffusion layers.",
            "Robust profiled attacks: should the adversary trust the dataset?",
            "Note on scalar multiplication using division polynomials.",
            "Construction of resilient S-boxes with higher-dimensional vectorial outputs and strictly almost optimal non-linearity.",
            "Private reputation retrieval in public - a privacy-aware announcement scheme for VANETs.",
            "Cheating prevention visual cryptography scheme using Latin square.",
            "Comment on 'Efficient and secure dynamic ID-based remote user authentication scheme for distributed systems using smart cards'.",
            "Multi-receiver authentication scheme with hierarchical structure.",
            "All-subkeys-recovery attacks on a variation of Feistel-2 block ciphers.",
            "Dynamic authenticated data structures with access control for outsourcing data stream.",
            "SignORKE: improving pairing-based one-round key exchange without random oracles.",
            "A secure data backup scheme using multi-factor authentication.",
            "Certificate-based signature scheme in the standard model.",
            "Constructions of involutions with optimal minimum degree.",
            "Results on significant anomalies of state values after key scheduling algorithm in RC4.",
            "Revisiting impossible differentials of MARS-like structures.",
            "New integral attacks on SIMON.",
            "Computational SS and conversion protocols in both active and passive settings.",
            "Migrating from RBAC to temporal RBAC.",
            "Low-latency digit-serial dual basis multiplier for lightweight cryptosystems.",
            "Fast and automatic security test on cryptographic ICs against fault injection attacks based on design for security test.",
            "Defending shilling attacks in recommender systems using soft co-clustering.",
            "Provably secure verifiable multi-stage secret sharing scheme based on monotone span program.",
            "Attribute-based encryption implies identity-based encryption.",
            "Memory attestation of wireless sensor nodes through trusted remote agents.",
            "MNOS: a mimic network operating system for software defined networks.",
            "Implementation flaws in the masking scheme of DPA Contest v4.",
            "Internal state recovery of Grain v1 employing guess-and-determine attack.",
            "Enhanced secure time synchronisation protocol for IEEE802.15.4e-based industrial Internet of Things.",
            "Impossible differential attacks on the SKINNY family of block ciphers.",
            "Security assessment of the Spanish contactless identity card."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 50,
        "papers": [
            "Logarithmic size ring signatures without random oracles.",
            "Unified security model of authenticated key exchange with specific adversarial capabilities.",
            "Random table and hash coding-based binary code obfuscation against stack trace analysis.",
            "Deterministic cloned tag detection protocol for anonymous radio-frequency identification systems.",
            "Efficient ways of prime number generation for ring signatures.",
            "Information fusion-based method for distributed domain name system cache poisoning attack detection and identification.",
            "Robustness of text-based completely automated public turing test to tell computers and humans apart.",
            "Building a new secure variant of Rainbow signature scheme.",
            "Implementing a privacy-enhanced attribute-based credential system for online social networks with co-ownership management.",
            "Short and provably secure designated verifier proxy signature scheme.",
            "Improved certificate-based signature scheme without random oracles.",
            "Pseudorandom bit generator based on non-stationary logistic maps.",
            "Improved zero-correlation linear cryptanalysis of reduced-round Camellia under weak keys.",
            "Linear complexity of generalised cyclotomic quaternary sequences of length 2p  m+1 q  n+1.",
            "Empirical analysis of Tor Hidden Services.",
            "Authenticating multi-dimensional query results in outsourced database.",
            "Border gateway protocol graph: detecting and visualising internet routing anomalies.",
            "Supervised approach for detecting average over popular items attack in collaborative recommender systems.",
            "Predicting the number of different dimensional cubes: theoretically evaluate the secure bound of cryptographic primitives against the balance testers.",
            "Key recovery on several matrix public-key encryption schemes.",
            "Covert communications through mobile voice channels.",
            "Dynamic cube attack on Grain-v1.",
            "Leakage-resilient message authentication code scheme based on hidden identity weak hash proof system.",
            "Effective certificate revocation scheme based on weighted voting game approach.",
            "Privacy failure in the public-key distance-bounding protocols.",
            "Cryptanalysis of McEliece cryptosystem variants based on quasi-cyclic low-density parity check codes.",
            "Design and formal verification of a cloud compliant secure logging mechanism.",
            "Multidimensional zero-correlation linear cryptanalysis of the block cipher KASUMI.",
            "Guest Editorial.",
            "Hash-One: a lightweight cryptographic hash function.",
            "Compact and low-power ASIP design for lightweight PUF-based authentication protocols.",
            "Template attack on SPA and FA resistant implementation of Montgomery ladder.",
            "Cost-effective polynomial-based multicast-unicast key distribution framework for secure group communication in IPv6 multicast networks.",
            "Efficient serverless radio-frequency identification mutual authentication and secure tag search protocols with untrusted readers.",
            "Lightweight authentication with key-agreement protocol for mobile network environment using smart cards.",
            "Guest Editorial.",
            "Public-key encryption indistinguishable under plaintext-checkable attacks.",
            "Selective opening security of practical public-key encryption schemes.",
            "Adaptive proofs of knowledge in the random oracle model.",
            "Divisible e-cash made practical.",
            "Bootstrapping BGV ciphertexts with a wider choice of p and q.",
            "Strongly-optimal structure preserving signatures from Type II pairings: synthesis and lower bounds.",
            "Low Noise LPN: Key dependent message secure public key encryption an sample amplification.",
            "Securing solar energy-harvesting road-side unit using an embedded cooperative-hybrid intrusion detection system.",
            "Public key cryptosystems secure against memory leakage attacks.",
            "Method for detecting text information leakage in electromagnetic radiation from a computer display.",
            "Exception-oriented programming: retrofitting code-reuse attacks to construct kernel malware.",
            "Improved impossible differential attack on reduced version of Camellia with FL/FL -1 functions.",
            "Hyperchaotic system-based pseudorandom number generator.",
            "Security of weak secrets based cryptographic primitives via the Rényi entropy."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 44,
        "papers": [
            "Sophisticated security verification on routing repaired balanced cell-based dual-rail logic against side channel analysis.",
            "Parallel key management scheme for mobile ad hoc network based on traffic mining.",
            "Ensemble detection model for profile injection attacks in collaborative recommender systems based on BP neural network.",
            "Efficient chosen-ciphertext secure public-key encryption scheme with high leakage-resilience.",
            "Proof of retrievability with public verifiability resilient against related-key attacks.",
            "Efficient abuse-free fair contract-signing protocol based on an ordinary crisp commitment scheme.",
            "Transferable conditional e-cash with optimal anonymity in the standard model.",
            "PESCA: a peer-to-peer social network architecture with privacy-enabled social communication and data availability.",
            "Approaching secure industrial control systems.",
            "'A public key infrastructure model for privacy-enhancing general purpose eIDs'.",
            "Novel and practical scheme based on secret sharing for laptop data protection.",
            "Anonymous multi-receiver remote data retrieval for pay-TV in public clouds.",
            "Biometric security system over finite field for mobile applications.",
            "Construction of perfect diffusion layers from linear feedback shift registers.",
            "RIKE+ : using revocable identities to support key escrow in public key infrastructures with flexibility.",
            "Adaptively secure broadcast encryption under standard assumptions with better efficiency.",
            "Efficient revocable certificateless encryption against decryption key exposure.",
            "Improved boomerang attacks on round-reduced SM3 and keyed permutation of BLAKE-256.",
            "Self-similarity cryptanalysis of the block cipher ITUbee.",
            "Practical verifiably encrypted signature based on Waters signatures.",
            "Anonymous multi-receiver ID-based signcryption scheme.",
            "Hijacking the Vuze BitTorrent network: all your hop are belong to us.",
            "Differential fault analysis on LED using Super-Sbox.",
            "Impossible differential cryptanalysis of MARS-like structures.",
            "Cooperative hybrid self-healing scheme for secure and data reliability in unattended wireless sensor networks.",
            "Dynamic and verifiable multi-secret sharing scheme based on Hermite interpolation and bilinear maps.",
            "Aspectising honeytokens to contain the insider threat.",
            "Distributed key generation protocol with hierarchical threshold access structure.",
            "Robust collaborative recommendation algorithm based on kernel function and Welsch reweighted M-estimator.",
            "Related-key rectangle cryptanalysis of Rijndael-160 and Rijndael-192.",
            "Known-key distinguishers on 15-round 4-branch type-2 generalised Feistel networks with single substitution-permutation functions and near-collision attacks on its hashing modes.",
            "Some new results on equivalency of collusion-secure properties for Reed-Solomon codes.",
            "Privacy of a randomised skip lists-based protocol.",
            "Biclique cryptanalysis of the full-round KLEIN block cipher.",
            "Modelling and analysis of rule-based network security middleboxes.",
            "High accuracy android malware detection using ensemble learning.",
            "Practical-time related-key attack on Hummingbird-2.",
            "Watch your constants: malicious Streebog.",
            "Enhanced inter-access service network handover authentication scheme for IEEE 802.16m network.",
            "Exploring risk flow attack graph for security risk assessment.",
            "Improved cryptanalysis on RIPEMD-128.",
            "Crypto-based algorithms for secured medical image transmission.",
            "Constructing important features from massive network traffic for lightweight intrusion detection.",
            "Cryptanalysis and improvement of a certificateless partially blind signature."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 37,
        "papers": [
            "Genetically derived secure cluster-based data aggregation in wireless sensor networks.",
            "Cryptanalysis of Wang et al.'s improved anonymous multi-receiver identity-based encryption scheme.",
            "A bottom-up approach to verifiable embedded system information flow security.",
            "Malware detection method based on the control-flow construct feature of software.",
            "Analysis of Bayesian classification-based approaches for Android malware detection.",
            "Efficient t-cheater identifiable (k, n) secret-sharing scheme for t ⩽ [((k - 2)/2)].",
            "Manual and Automatic assigned thresholds in multi-layer data fusion intrusion detection system for 802.11 attacks.",
            "Identity management and trusted interaction in internet and mobile computing.",
            "Impact of blackhole and Sybil attacks on dynamic windows secured implicit geographic forwarding routing protocol.",
            "Research of trust model based on fuzzy theory in mobile ad hoc networks.",
            "Efficient and secure dynamic ID-based remote user authentication scheme for distributed systems using smart cards.",
            "Identity-based remote data possession checking in public clouds.",
            "Operating system security by integrity checking and recovery using write-protected storage.",
            "Establishing user trust in automated teller machine integrity.",
            "Approach for malware identification using dynamic behaviour and outcome triggering.",
            "Intelligent rule-based phishing websites classification.",
            "Scalable and resynchronisable radio frequency identification ownership transfer protocol based on a sliding window mechanism.",
            "Generalised cheater detection and identification.",
            "Chinese remainder theorem based centralised group key management for secure multicast communication.",
            "Simple power analysis applied to nonlinear feedback shift registers.",
            "An efficient motion reference structure based selective encryption algorithm for H.264 videos.",
            "Biclique-based cryptanalysis of the block cipher SQUARE.",
            "New chaotic encryption algorithm based on chaotic sequence and plain text.",
            "Threshold attribute-based encryption with attribute hierarchy for lattices in the standard model.",
            "Efficient multistage secret sharing scheme using bilinear map.",
            "Security analysis of two certificateless short signature schemes.",
            "Inter cluster communication and rekeying technique for multicast security in mobile ad hoc networks.",
            "Anonymous encryption with partial-order subset delegation and its application in privacy email systems.",
            "Dynamic rule and rule-field optimisation for improving firewall performance and security.",
            "Biclique key recovery for ARIA-256.",
            "Constructions of resilient rotation symmetric boolean functions on given number of variables.",
            "Unforgeability of an improved certificateless signature scheme in the standard model.",
            "Error estimation, error correction and verification in quantum key distribution.",
            "Cryptanalysis of the dragonfly key exchange protocol.",
            "Group-based key array authentication protocol in radio frequency identification systems.",
            "Families of rotation symmetric functions with useful cryptographic properties.",
            "Comments on 'fair (t, n) threshold secret sharing scheme'."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 41,
        "papers": [
            "A new password authentication and user anonymity scheme based on elliptic curve cryptography and smart card.",
            "Efficient proof of bid validity with untrusted verifier in homomorphic e-auction.",
            "Practical secure and fast handoff framework for pervasive Wi-Fi access.",
            "Human interactive secure key and identity exchange protocols in body sensor networks.",
            "Adaptive and attribute-based trust model for service level agreement guarantee in cloud computing.",
            "CloudAC: a cloud-oriented multilayer access control system for logic virtual domain.",
            "Secure group communication with both confidentiality and non-repudiation for mobile ad-hoc networks.",
            "Use of elliptic curve cryptography for multimedia encryption.",
            "Low space-complexity digit-serial dual basis systolic multiplier over Galois field GF(2m) using Hankel matrix and Karatsuba algorithm.",
            "Biometric key distribution solution with energy distribution information of physiological signals for body sensor network security.",
            "IDSEP: a novel intrusion detection scheme based on energy prediction in cluster-based wireless sensor networks.",
            "Fair (t, n) threshold secret sharing scheme.",
            "New certificateless short signature scheme.",
            "Secure remote access to home automation networks.",
            "Antivirus performance characterisation: system-wide view.",
            "On the approximation of S-boxes via Maiorana-McFarland functions.",
            "uCloud: a user-centric key management scheme for cloud data protection.",
            "Oblivious decision program evaluation.",
            "On the generalisation of special moduli for faster interleaved montgomery modular multiplication.",
            "Aryabhata remainder theorem-based non-iterative electronic lottery mechanism with robustness.",
            "Newmultivariate hash function quadratic polynomials multiplying linear polynomials.",
            "Enhanced digital rights management authentication scheme based on smart card.",
            "BLAST: B-LAyered bad-character SHIFT tables for high-speed pattern matching.",
            "TEAP: trust-enhanced anonymous on-demand routing protocol for mobile ad hoc networks.",
            "Security and complexity of the McEliece cryptosystem based on quasi-cyclic low-density parity-check codes.",
            "Channel level crossing-based security for communications over fading channels.",
            "Superpoly algebraic normal form monomial test on Trivium.",
            "Publicly verifiable multi-secret sharing scheme from bilinear pairings.",
            "Robust elliptic curve cryptography-based three factor user authentication providing privacy of biometric data.",
            "Strong non-repudiation based on certificateless short signatures.",
            "Colour image encryption based on advanced encryption standard algorithm with two-dimensional chaotic map.",
            "New certificateless public key encryption scheme without pairing.",
            "Link quality-based cache replacement technique in mobile ad hoc network.",
            "JITSafe: a framework against Just-in-time spraying attacks.",
            "Chosen-plaintext linear attacks on Serpent.",
            "Scalable fragile watermarking for image authentication.",
            "Polynomial differential-based strong (n, t, n)-verifiable secret sharing.",
            "An adaptive distributed certificate management scheme for space information network.",
            "Hardware acceleration of regular expression repetitions in deep packet inspection.",
            "Traceable, group-oriented, signature scheme with multiple signing policies in group-based trust management.",
            "Systemic threats to hypervisor non-control data."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 39,
        "papers": [
            "Attack against a batch zero-knowledge proof system.",
            "Design and logical analysis on the access authentication scheme for satellite mobile communication networks.",
            "Obtaining more Karatsuba-like formulae over the binary field.",
            "Cryptanalysis and improvements of an anonymous multi-receiver identity-based encryption scheme.",
            "Non-linear error detection for elliptic curve cryptosystems.",
            "Some results on fast algebraic attacks and higher-order non-linearities.",
            "Attribute-based signature scheme with constant size signature in the standard model.",
            "Internal state recovery of grain-v1 employing normality order of the filter function.",
            "Provably secure convertible multi-authenticated encryption scheme.",
            "Keypad against brute force attacks on smartphones.",
            "Light-weight trust-based routing protocol for mobile ad hoc networks.",
            "Enhanced multiparty quantum secret sharing of classical messages by using entanglement swapping.",
            "Ladon1: end-to-end authorisation support for resource-deprived environments.",
            "Improved certificateless signature scheme provably secure in the standard model.",
            "Embedded system for sensor communication and security.",
            "Fair offline digital content transaction system.",
            "Regression-based trust model for mobile ad hoc networks.",
            "Effects of iterative block ciphers on quality of experience for Internet Protocol Security enabled voice over IP calls.",
            "SACK2: effective SYN flood detection against skillful spoofs.",
            "Fault-tolerant Gaussian normal basis multiplier over GF(2m).",
            "Design and implementation of an embedded intrusion detection system for wireless applications.",
            "Primitive polynomials for robust linear feedback shift registers-based scramblers and stream ciphers.",
            "Simultaneously generating multiple keys in a four-terminal network.",
            "Agent-based honeynet framework for protecting servers in campus networks.",
            "HBC entity authentication for low-cost pervasive devices.",
            "Long-term preservation of digital signatures for multiple groups of related documents.",
            "Cryptanalysis of reduced versions of the Camellia block cipher.",
            "Security analysis of Kulseng et al.'s mutual authentication protocol for RFID systems.",
            "Critical survey of existing publicly verifiable secret sharing schemes.",
            "Deniable message transmission authenticator based on weak signature schemes.",
            "Analytical framework for measuring network security using exploit dependency graph.",
            "Dynamic and secure key management model for hierarchical heterogeneous sensor networks.",
            "Improved one-to-many authentication scheme for access control in pay-TV systems.",
            "Mobile encryption for laptop data protection (MELP).",
            "Visual secret sharing for general access structures by random grids.",
            "Low-complexity Gaussian normal basis multiplier over GF(2m).",
            "Palindromic-like representation for Gaussian normal basis multiplier over GF(2m) with odd type t.",
            "Low-complexity design of bit-parallel dual-basis multiplier over GF(2m).",
            "On hardware-oriented message authentication."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 26,
        "papers": [
            "Application of fuzzy logic and genetic algorithm in biometric text-independent writer identification.",
            "Steganalysis of JPEG steganography with complementary embedding strategy.",
            "Audio hash function based on non-negative matrix factorisation of mel-frequency cepstral coefficients.",
            "Steganalysis of compressed speech to detect covert voice over Internet protocol channels.",
            "Self-checking alternating logic bit-parallel gaussian normal basis multiplier with type-t.",
            "New watermark-removal method based on Eigen-image energy.",
            "Cheating immune visual cryptography scheme.",
            "Hardware-software co-design of an iris recognition algorithm.",
            "Quantum entanglement and non-locality based secure computation for future communication.",
            "Cheating resistance and reversibility-oriented secret sharing mechanism.",
            "Balanced rotation symmetric boolean functions with maximum algebraic immunity.",
            "One for all - all for one: unifying standard differential power analysis attacks.",
            "Impossible differential cryptanalysis of SPN ciphers.",
            "Robust visual cryptography-based watermarking scheme for multiple cover images and multiple owners.",
            "Impossible differential cryptanalysis of reduced-round Camellia-256.",
            "Approach to security assessment of critical infrastructures' information systems.",
            "Analysis and improvement on an efficient biometric-based remote user authentication scheme using smart cards.",
            "Non-XOR approach for low-cost bit-parallel polynomial basis multiplier over GF(2m).",
            "Secure extension to the optimised link state routing protocol.",
            "Step-projection-based spread transform dither modulation.",
            "Security evaluation of application-specific integrated circuits and field programmable gate arrays against setup time violation attacks.",
            "Eigenviruses for metamorphic virus recognition.",
            "On the sliding property of SNOW 3 G and SNOW 2.0.",
            "Provable-security analysis of authenticated encryption in Kerberos.",
            "Using opcode sequences in single-class learning to detect unknown malware.",
            "Perfect involutory diffusion layers based on invertibility of some linear functions."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 35,
        "papers": [
            "Real-time and MPEG-1 layer III compression resistant steganography in speech.",
            "Overlap-free Karatsuba-Ofman polynomial multiplication algorithms.",
            "Design and verification of a non-repudiation protocol based on receiver-side smart card.",
            "Efficient and side-channel-aware implementations of elliptic curve cryptosystems over prime fields.",
            "On the security of an identity-based proxy multi-signature scheme.",
            "Algebraic cryptanalysis of a small-scale version of stream cipher Lex.",
            "Anonymous voting by two-round public discussion.",
            "Cooperative communications based on trust model for mobile ad hoc networks.",
            "Mining frequent itemsets in the presence of malicious participants.",
            "Anonymous roaming in universal mobile telecommunication system mobile networks.",
            "Attribute-based ring signature scheme with constant-size signature.",
            "Concurrent error detection and correction in a polynomial basis multiplier over GF(2m).",
            "How to strongly link data and its medium: the paper case.",
            "Secure private fragile watermarking scheme with improved tampering localisation accuracy.",
            "Refinements of the ALRED construction and MAC security claims.",
            "Hidden data transmission in mixed excitation linear prediction coded speech using quantisation index modulation.",
            "Bypassing the decomposition attacks on two-round multivariate schemes by a practical cubic round.",
            "Distributed security for multi-agent systems - review and applications.",
            "Unconditionally secure social secret sharing scheme.",
            "Trust-based on-demand multipath routing in mobile ad hoc networks.",
            "Covert channel resistant information leakage protection using a multi-agent architecture.",
            "Digital product transaction mechanism for electronic auction environment.",
            "Survey of security services on group communications.",
            "Supporting multi-agent reputation calculation in the Wikipedia Recommender System.",
            "Integrated security analysis framework for an enterprise network - a formal approach.",
            "Multi-level authorisation model and framework for distributed semantic-aware environments.",
            "Efficient proxy signatures based on trapdoor hash functions.",
            "Multi-Agent pattern recognition mechanism for detecting distributed denial of service attacks.",
            "Recovery of data integrity under multi-tier architectures.",
            "Cluster-based secure communication mechanism in wireless ad hoc networks.",
            "Outlier detection and countermeasure for hierarchical wireless sensor networks.",
            "Adaptive link-state routing and intrusion detection in wireless mesh networks.",
            "Physical layer assisted authentication for distributed ad hoc wireless sensor networks.",
            "Anonymity and security for autonomous mobile agents.",
            "Towards an authorisation model for distributed systems based on the Semantic Web."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 14,
        "papers": [
            "Design of a robust and secure digital signature scheme for image authentication over wireless channels.",
            "Information flow security, abstraction and composition.",
            "Effect of glitches against masked AES S-box implementation and countermeasure.",
            "Unified dual-field multiplier in GF(P) and GF(2k).",
            "Signature scheme based on the root extraction problem over braid groups.",
            "Alternative to the karatsuba algorithm for software implementations of GF(2n) multiplications.",
            "Heuristic guess-and-determine attacks on stream ciphers.",
            "Using alloy to analyse a spatio-temporal access control model supporting delegation.",
            "Efficient method for simplifying and approximating the s-boxes based on power functions.",
            "Hidden identity-based signatures.",
            "Cryptanalysis of an iterated halving-based hash function: CRUSH.",
            "Non-iterative privacy preservation for online lotteries.",
            "Partial decryption attacks in security-mediated certificateless encryption.",
            "Generic constructions for universal designated-verifier signatures and identitybased signatures from standard signatures."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 15,
        "papers": [
            "Security analysis of higher-order Boolean masking schemes for block ciphers (with conditions of perfect masking).",
            "Diffie-Hellman technique: extended to multiple two-party keys and one multi-party key.",
            "Randomised representations.",
            "Impossible differential attack on seven-round AES-128.",
            "Reversible data-embedding scheme using differences between original and predicted pixel values.",
            "Two-tier signatures from the Fiat-Shamir transform, with applications to strongly unforgeable and one-time signatures.",
            "Generalised key delegation for hierarchical identity-based encryption.",
            "General anonymous key broadcasting via Lagrangian interpolation.",
            "Contributory group key exchange in the presence of malicious participants.",
            "When AES blinks: introducing optical side channel.",
            "Analysis of bilinear pairing-based accumulator for identity escrowing.",
            "Efficient identity-based signatures in the standard model.",
            "Optimum retrieval of watermark from wavelet significant coefficients.",
            "Robust audio watermarking using frequency-selective spread spectrum.",
            "Colour visual cryptography schemes."
        ]
    },
    {
        "name": "IET Information Security",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 22,
        "papers": [
            "Pipelined AES on FPGA with support for feedback modes (in a multi-channel environment).",
            "Plateau characteristics.",
            "Improved base-φ expansion method for Koblitz curves over optimal extension fields.",
            "Trusted P2P computing environments with role-based access control.",
            "Web dual watermarking technology using an XML document.",
            "EPR quantum key distribution protocols with potential 100% qubit efficiency.",
            "Cryptanalysis of Achterbahn-128/80.",
            "Exact maximum expected differential and linear probability for two-round Advanced Encryption Standard.",
            "Secure and practical identity-based encryption.",
            "Efficient explicit formulae for genus 3 hyperelliptic curve cryptosystems over binary fields.",
            "Tracing illegal redistribution using errors-anderasures and side information decoding algorithms.",
            "Reversible watermarking resistant to cropping attack.",
            "Local affine transform invariant image watermarking by Krawtchouk moment invariants.",
            "Strengthening hardware AES implementations against fault attacks.",
            "Non-interactive two-channel message authentication based on hybrid-collision resistant hash functions.",
            "Improving the Common Vulnerability Scoring System.",
            "Testing power-analysis attack susceptibility in register-transfer level designs.",
            "Revocation-free public-key encryption based on security-mediated public-key infrastructure.",
            "Comparing and debugging firewall rule tables.",
            "Self-adaptive approach for resource-aware security provisioning in wireless ad hoc networks.",
            "Explicit expression for decryption in a generalisation of the paillier scheme.",
            "Mobile ip registration in certificateless public key infrastructure."
        ]
    }
]