[
    {
        "name": "IJICS",
        "year": "2021",
        "info": "Volume 16: 2021",
        "count": 24,
        "papers": [
            "Digital video watermarking tools: an overview.",
            "CICIDS2017 dataset: performance improvements and validation as a robust intrusion detection system testbed.",
            "Empirical risk assessment of attack graphs using time to compromise framework.",
            "Fault-based testing for discovering SQL injection vulnerabilities in web applications.",
            "Leveraging Intel SGX to enable trusted and privacy preserving membership service in distributed ledgers.",
            "Multi-channel time-frequency fusion attacks.",
            "Time-based key management in attribute-based encryption using piecewise key generation.",
            "Heuristic trust-based neighbour centric routing for CPS-enabled wireless sensor and ad hoc network.",
            "Supporting features for flow-level packet analysis towards cyber threat detection: a pilot study.",
            "A layer-crossing multi-factor and dynamic security model over a moving target defence.",
            "Modelling and visualising SSH brute force attack behaviours through a hybrid learning framework.",
            "Vulnerability discovery modelling: a general framework.",
            "An efficient and provably secure authentication scheme based on elliptic curve signature using a smart card.",
            "Adaptive classifier-based intrusion detection system using logistic regression and Euclidean distance on network probe vectors in resource constrained networks.",
            "Time-shared AES-128 implementation with extremely low-cost for smart card applications.",
            "Privacy preserving techniques for decision trees.",
            "A robust multi-factor remote user authentication scheme for cloud-IoT services.",
            "Enhanced bitcoin with two-factor authentication.",
            "Secure key exchange scheme: a DNA computing-based approach to resist MITM in DHKE.",
            "Blockchain-based decentralised access control scheme for dynamic hierarchies.",
            "A truncated mean ℓp-LDA approach for intrusion detection system.",
            "One privacy-preserving multi-keyword ranked search scheme revisited.",
            "Synthetic Arabic handwritten CAPTCHA.",
            "A highly secure three-party authentication key exchange protocol and its application in e-business communication with ECK model."
        ]
    },
    {
        "name": "IJICS",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 20,
        "papers": [
            "On the adoption of scramble keypad for unlocking PIN-protected smartphones.",
            "FairAccess2.0: a smart contract-based authorisation framework for enabling granular access control in IoT.",
            "A complexity reduced and reliable integrity protection for large relational data over clouds.",
            "Secure session between an IoT device and a cloud server based on elliptic curve cryptosystem.",
            "Pixel-based hybrid copy move image forgery detection using Zernike moments and auto colour correlogram.",
            "Vulnerability severity prediction model for software based on Markov chain.",
            "Multi-writer multi-reader conjunctive keyword searchable encryption.",
            "On QoS-aware location privacy in mobile networks.",
            "A provably secure lightweight certificateless aggregate signature scheme for healthcare wireless sensor network.",
            "High utility differential privacy based on smooth sensitivity and individual ranking.",
            "A lightweight security and privacy-aware routing scheme for energy-constraint multi-hop wireless sensor networks.",
            "Local anatomy for personalised privacy protection.",
            "New approach in the applications and forensics of the networks of the internet of things based on the fog infrastructure using SDN.",
            "DroidMD: an efficient and scalable Android malware detection approach at source code level.",
            "Research on privacy protection system of RFID personal consumption data based on internet of things and cloud computing.",
            "Research on network security defence based on big data clustering algorithms.",
            "Information protection of end users on the web: privacy issues and measures.",
            "E-commerce process reengineering for customer privacy protection.",
            "The prediction of network security situation based on deep learning method.",
            "A hybrid approach for preserving privacy for real estate data."
        ]
    },
    {
        "name": "IJICS",
        "year": "2021",
        "info": "Volume 14: 2021",
        "count": 24,
        "papers": [
            "A low area VLSI implementation of extended tiny encryption algorithm using Lorenz chaotic system.",
            "A novel energy efficient routing algorithm for MPLS-MANET using fuzzy logic controller.",
            "Video watermarking using neural networks.",
            "Secure energy efficient network priority routing protocol for effective data collection and key management in dynamic WSNs.",
            "A facial expression recognition model using hybrid feature selection and support vector machines.",
            "An improved cryptanalysis of large RSA decryption exponent with constrained secret key.",
            "Accurate and reliable detection of DDoS attacks based on ARIMA-SWGARCH model.",
            "Secure and unifold mining model for pattern discovery from streaming data.",
            "Sustainable wireless clouds with security assurance.",
            "A novel binary encryption algorithm for navigation control of robotic vehicles through visible light communication.",
            "Analysing and comparing the digital seal according to eIDAS regulation with and without blockchain technology.",
            "Mobile agent security using Amrani et al.'s protocol and binary serialisation.",
            "Prediction-based robust blind reversible watermarking for relational databases.",
            "Improved RSA lossy trapdoor function and applications.",
            "A hierarchical method for assessing cyber security situation based on ontology and fuzzy cognitive maps.",
            "Cryptographic strength evaluation of AES s-box variants.",
            "Optimised K-anonymisation technique to deal with mutual friends and degree attacks.",
            "A robust passive blind copy-move image forgery detection.",
            "Performance evaluation of optimised protocol in MANET.",
            "A handwriting document encryption scheme based on segmentation and chaotic logarithmic map.",
            "Secured spray and focus protocol design in intermittently connected mobile networks.",
            "Effort-based fault detection and correction modelling for multi release of software.",
            "A dynamic key management paradigm for secure wireless ad hoc network communications.",
            "Anti-forensic reversible multi frame block to block pixel mapping information concealing approach to increase the robustness and perceptibility."
        ]
    },
    {
        "name": "IJICS",
        "year": "2020",
        "info": "Volume 13: 2020",
        "count": 23,
        "papers": [
            "A novel GAAC optimisation algorithm for multimodal fusion score decision making in secured biometric systems.",
            "Study of LDPC decoders with quadratic residue sequence for communication system.",
            "Static analysis method for detecting cross site scripting vulnerabilities.",
            "An energy efficient authentication scheme based on hierarchical IBDS and EIBDS in grid-based wireless sensor networks.",
            "Developing malevolent node-based protection system against jamming attack in agent assisted CRN.",
            "An efficient interior and exterior boundary detection-based two level iris segmentation.",
            "An improved co-designed AES-ECC cryptosystem for secure data transmission.",
            "Secure and privacy-preserving multi-keyword ranked information retrieval from encrypted big data.",
            "Image encryption scheme based on a novel fractional order compound chaotic attractor.",
            "Comparative evaluation of different classification techniques for masquerade attack detection.",
            "Mobile cloud computing applications penetration testing model design.",
            "An authentication scheme for distributed computing environment.",
            "CFM: collusion-free model of privacy preserving frequent itemset mining.",
            "Towards automated SCADA forensic investigation: challenges, opportunities and promising paradigms.",
            "Fast causal division for supporting robust causal discovery.",
            "System for DDoS attack mitigation by discovering the attack vectors through statistical traffic analysis.",
            "HHDSSC: harnessing healthcare data security in cloud using ciphertext policy attribute-based encryption.",
            "A categorical survey of state-of-the-art intrusion detection system-Snort.",
            "A lightweight fully homomorphic encryption scheme for cloud security.",
            "Fuzzy ARM and cluster analysis for database intrusion detection and prevention.",
            "Data encoding and cost optimised distribution for efficient and secure storage in cloud federation.",
            "Comparative study of classification approaches for e-mail analysis.",
            "Intruder model for generating attack scenarios in computer systems."
        ]
    },
    {
        "name": "IJICS",
        "year": "2020",
        "info": "Volume 12: 2020",
        "count": 23,
        "papers": [
            "Introducing virtue ethics concepts into the decision processes of information systems trusted workers: a Delphi study.",
            "SAPMS: a secure and anonymous parking management system for autonomous vehicles.",
            "An improved key pre-distribution scheme based on the security level classification of keys for wireless sensor networks.",
            "Protecting composite IoT server by secure secret key exchange for XEN intra virtual machines.",
            "Reversible data hiding methods in integer wavelet transform.",
            "VIKAS: a new virtual keyboard-based simple and efficient text CAPTCHA verification scheme.",
            "A secured modular exponentiation for RSA and CRT-RSA with dual blinding to resist power analysis attacks.",
            "Eight neighbour bits swap encryption-based image steganography using arithmetic progression technique.",
            "Nested context-aware sanitisation and feature injection in clustered templates of JavaScript worms on the cloud-based OSN.",
            "Fault prediction for distributed computing Hadoop clusters using real-time higher order differential inputs to SVM: Zedacross.",
            "A coupled map lattice-based image encryption approach using DNA and bi-objective genetic algorithm.",
            "Securing wireless sensor networks from node clone attack: a lightweight message authentication algorithm.",
            "Blind noise estimation-based CT image denoising in tetrolet domain.",
            "A hybrid generative-discriminative model for abnormal event detection in surveillance video scenes.",
            "Scrutinising internet banking security solutions.",
            "Fake profile detection in multimedia big data on online social networks.",
            "Unconstrained face recognition using deep convolution neural network.",
            "CSL: FPGA implementation of lightweight block cipher for power-constrained devices.",
            "An improved spatial-temporal correlation algorithm combined with compressed sensing and LEACH protocol in WSNs.",
            "An activity theory model for dynamic evolution of attack graph based on improved least square genetic algorithm.",
            "Data protection and provenance in cloud of things environment: research challenges.",
            "Advanced security of two-factor authentication system using stego QR code.",
            "New chaotic cryptosystem for the image encryption."
        ]
    },
    {
        "name": "IJICS",
        "year": "2019",
        "info": "Volume 11: 2019",
        "count": 32,
        "papers": [
            "MONcrypt: a technique to ensure the confidentiality of outsourced data in cloud storage.",
            "Detection algorithm for internet worms scanning that used user datagram protocol.",
            "SPHERES: an efficient server-side web application protection system.",
            "A novel verifiable and unconditionally secure (m, t, n)-threshold multi-secret sharing scheme using overdetermined systems of linear equations over finite Galois fields.",
            "A generic construction of identity-based proxy signature scheme in the standard model.",
            "A study of the internet financial interest rate risk evaluation index system in cloud computing.",
            "Novel implementation of defence strategy of relay attack based on cloud in RFID systems.",
            "Reconfigurable design and implementation of nonlinear Boolean function for cloud computing security platform.",
            "Network optimisation for improving security and safety level of dangerous goods transportation based on cloud computing.",
            "Proofs of retrievability from linearly homomorphic structure-preserving signatures.",
            "An ensemble algorithm for discovery of malicious web pages.",
            "On mapping of address and port using translation.",
            "Lightweight R-LWE-based privacy preservation scheme for smart grid network.",
            "CSPS: catchy short passwords making offline and online attacks impossible.",
            "Mitigate black hole attack using bee optimised weighted trust with AODV in MANET.",
            "What's in your honeypot: a privacy compliance perspective.",
            "Behavioural analysis approach for IDS based on attack pattern and risk assessment in cloud computing.",
            "A critical insight into the effectiveness of research methods evolved to secure IoT ecosystem.",
            "An efficient authentication and key agreement scheme for e-health applications in the context of internet of things.",
            "An ontology-based approach to improve access policy administration of attribute-based access control.",
            "A multi-agent system approach based on cryptographic algorithm for securing communications and protecting stored data in the cloud-computing environment.",
            "An efficient user authentication model for IOT-based healthcare environment.",
            "Cloud-based DDoS attack detection and defence system using statistical approach.",
            "Sequential pattern analysis for event-based intrusion detection.",
            "SQL injection attacks - a systematic review.",
            "Password security by encryption using an extended ADFGVX cipher.",
            "Outsourcing computation for private function evaluation.",
            "PrivacyContext: identifying malicious mobile privacy leak using program context.",
            "Video watermarking scheme based on IDR frames using MPEG-2 structure.",
            "Study on data fuzzy breakpoint detection in massive dynamic data flow.",
            "A novel approach for query over encrypted data in database.",
            "CB-ALCA: a cluster-based adaptive lightweight cryptographic algorithm for secure routing in wireless sensor networks."
        ]
    },
    {
        "name": "IJICS",
        "year": "2018",
        "info": "Volume 10: 2018",
        "count": 23,
        "papers": [
            "Performance analysis of image steganalysis techniques and future research directives.",
            "Modelling a secure support vector machine classifier for private data.",
            "Reliable and secure communication using fundamental cut-sets and fundamental circuits.",
            "An end-to-end user two-way authenticated double encrypted messaging scheme based on hybrid RSA for the future internet architectures.",
            "Development of an efficient classifier using proposed sensitivity-based feature selection technique for intrusion detection system.",
            "WeChat traffic classification using machine learning algorithms and comparative analysis of datasets.",
            "Node authentication algorithm for securing static wireless sensor networks from node clone attack.",
            "The research of reputation incentive mechanism of P2P network file sharing system.",
            "Robust injection point-based framework for modern applications against XSS vulnerabilities in online social networks.",
            "A nonlinear two dimensional logistic-tent map for secure image communication.",
            "A robust reversible image watermarking scheme in DCT domain using Arnold scrambling and histogram modification.",
            "Improved pixel relevance based on Mahalanobis distance for image segmentation.",
            "3D reconstruction of human face from an input image under random lighting condition.",
            "Reversible data hiding in absolute moment block truncation coding compressed images using adaptive multilevel histogram shifting technique.",
            "A new statistical attack resilient steganography scheme for hiding messages in audio files.",
            "Physiological trait-based biometrical authentication of human-face using LGXP and ANN techniques.",
            "A robust and blind image watermarking scheme in DCT domain.",
            "Assessing cyber-incidents using machine learning.",
            "High frequency implementation of cryptographic hash function Keccak-512 on FPGA devices.",
            "Innovative data security model using forensic audio video steganography for improving hidden data security and robustness.",
            "Detection of phishing attacks in financial and e-banking websites using link and visual similarity relation.",
            "Hybrid RSA-based highly efficient, reliable and strong personal full mesh networked messaging scheme.",
            "Information hiding: a novel algorithm for enhancement of cover text capacity by using unicode characters."
        ]
    },
    {
        "name": "IJICS",
        "year": "2017",
        "info": "Volume 9: 2017",
        "count": 19,
        "papers": [
            "Dynamic weighted VM load balancing for cloud-analyst.",
            "Robust watermarking technique using back propagation neural network: a security protection mechanism for social applications.",
            "Trust delegation-based secure mobile cloud computing framework.",
            "Virtual machine security.",
            "Hierarchical detection of insider attacks in cloud computing systems.",
            "A secure mobile commerce framework based on community cloud.",
            "Evaluation of puzzle-enabled proxy-assisted denial-of-service protection for web services.",
            "Mitigating selfish, blackhole and wormhole attacks in DTN in a secure, cooperative way.",
            "Accountable administration in operating systems.",
            "Security engineering methods - in-depth analysis.",
            "Opportunistic key management in delay tolerant networks.",
            "A standardised data acquisition process model for digital forensic investigations.",
            "Keyed hash function using Bernoulli shift map.",
            "Data hiding using lifting scheme and genetic algorithm.",
            "Update enabled multi-keyword searchable encryption scheme for secure data outsourcing.",
            "A novel quantum distributed key management protocol for ring-organised group.",
            "A trust-based approach for securing data communication in delay tolerant networks.",
            "A survey on forensic event reconstruction systems.",
            "MAM-ISSIDS: multi-agent model-based intelligent and self-sharing intrusion detection system for distributed network."
        ]
    },
    {
        "name": "IJICS",
        "year": "2016",
        "info": "Volume 8: 2016",
        "count": 20,
        "papers": [
            "A novel approach for hiding secret data in program files.",
            "Advanced dynamic identity-based authentication protocol using smart card.",
            "Reversible watermarking using channel coding and lifting for cultural heritage and medical image.",
            "Enhancing the security of modern ICT systems with multimodal biometric cryptosystem and continuous user authentication.",
            "Applicability of keystroke dynamics as a biometric security feature for mobile touchscreen devices with virtualised keyboards.",
            "A novel approach to enhance the network lifetime for hybrid routing protocol.",
            "An MDA approach to secure access to data on cloud using implicit security.",
            "Lightweight identity-based authentication protocol for wireless sensor networks.",
            "Key pre-distribution schemes to support various architectural deployment models in WSN.",
            "Performance comparison of TCP, UDP and TFRC in static wireless environment.",
            "Formally verified TSM centric privacy preserving NFC mobile payment framework and protocol.",
            "Design of a tweakable image encryption algorithm using chaos-based schema.",
            "Mobility information estimation algorithm using Kalman-filter for vehicular ad hoc networks.",
            "Anomaly-based network intrusion detection through assessing feature association impact scale.",
            "Investigation on defected ground-plane structures to improve isolation and correlation in multi-band MIMO antenna.",
            "A qualitative framework for evaluating buffer overflow protection mechanisms.",
            "Application of quantitative security measurement model for prioritisation of vulnerability mitigation: a real case study.",
            "A robust zero watermarking algorithm for stereo audio signals.",
            "A survey on security and efficiency issues in chaotic image encryption.",
            "Towards service continuity for transactional applications via diverse device drivers."
        ]
    },
    {
        "name": "IJICS",
        "year": "2015",
        "info": "Volume 7: 2015",
        "count": 13,
        "papers": [
            "Mobile device security.",
            "Complementary witness soundness for witness indistinguishable proof system and CCA2 public-key encryption schemes.",
            "Advanced security analysis of a signature scheme with message recovery.",
            "Performance analysis of buffered crossbar switch scheduling algorithms.",
            "Implementing generic security requirements in e-voting using modified stegano-cryptographic approach.",
            "A novel framework for secure file transmission using modified AES and MD5 algorithms.",
            "Equivalence-preserving corrective enforcement of security properties.",
            "Hierarchical policy delegation in multiple-authority ABE.",
            "Modifications to GCC for increased software privacy.",
            "Secure file storage and retrieval in cloud.",
            "A map-based image steganography scheme for RGB images.",
            "Application-layer denial of service attacks: taxonomy and survey.",
            "Data leakage triage: quantitative measure of effectiveness of containment plan."
        ]
    },
    {
        "name": "IJICS",
        "year": "2014",
        "info": "Volume 6: 2014",
        "count": 20,
        "papers": [
            "Low power high throughput reconfigurable stream cipher hardware VLSI architectures.",
            "Extracting the system call identifier from within VFS: a kernel stack parsing-based approach.",
            "Genetic algorithms based data hiding scheme for digital images with LSBMR.",
            "Context and semantics for detection of cyber attacks.",
            "Exposing WPA2 security protocol vulnerabilities.",
            "Attribute-based group signature without random oracles with attribute anonymity.",
            "Secure transmission of morphed stego keys over internet using IP steganography.",
            "Towards ontological approach to eliciting risk-based security requirements.",
            "Malware detection using augmented naive Bayes with domain knowledge and under presence of class noise.",
            "Detecting malicious files using non-signature-based methods.",
            "SDPP: an intelligent secure detection scheme with strong privacy-preserving for mobile peer-to-peer social network.",
            "Vulnerability distribution scoring for software product security assessment.",
            "Identity-based broadcast encryption for multi-privileged groups using Chinese remainder theorem.",
            "Study of mobile virtualisation-based security technology for smartwork environment.",
            "Development AI traffic-safety system using RFID technique and USN theory.",
            "Image encryption method for depth + texture video contents.",
            "An iterative layered interference canceller scheme for OFDM in wireless mesh security networks.",
            "Cryptanalysis and improvement on a certificateless encryption scheme in the standard model.",
            "Hybrid encryption/decryption technique using new public key and symmetric key algorithm.",
            "Issues in user authentication using security questions."
        ]
    },
    {
        "name": "IJICS",
        "year": "2012",
        "info": "Volume 5: 2012/2013",
        "count": 19,
        "papers": [
            "Bandwidth efficient buyer-seller watermarking protocol.",
            "Multiple password interference in graphical passwords.",
            "Tampering resistant self recoverable watermarking method using error correction codes.",
            "PCIEF: a policy conflict identification and evaluation framework.",
            "Securing pairing-based cryptography on smartcards.",
            "Security risk assessment: toward a comprehensive practical risk management.",
            "Efficient and secure credit card payment protocol for mobile devices.",
            "An agent-based model to simulate coordinated response to malware outbreak within an organisation.",
            "On the algebraic attack against summation type keystream generators.",
            "Incremental processing and indexing for (k, e)-anonymisation.",
            "On the conventional public key in identification-based encryption: the case of RSA.",
            "Adaptive visible watermarking in Hadamard domain for digital images.",
            "Steganography in coloured images using wavelet domain-based saliency map.",
            "Cost-effective design for binary Edwards elliptic curves crypto-processor over GF (2N) using parallel multipliers and architectures.",
            "Extensible policy framework for heterogeneous network environments.",
            "Evaluation of severity index of vulnerability categories.",
            "A value transformation and random permutation-based coloured image encryption technique.",
            "A social dimensional cyber threat model with formal concept analysis and fact-proposition inference.",
            "First passage time and first passage percolation models for analysing network resilience and effective strategies in strategic information warfare research: a brief survey and perspective."
        ]
    },
    {
        "name": "IJICS",
        "year": "2010",
        "info": "Volume 4: 2010/2011",
        "count": 20,
        "papers": [
            "Speeding up Euclid's GCD algorithm with no magnitude comparisons.",
            "A secure partition-based document image watermarking scheme.",
            "Remarks on the security of the strong proxy signature scheme with proxy signer privacy protection.",
            "Honeypot detection in advanced botnet attacks.",
            "Semantics-aware security policy specification for the semantic web data.",
            "An integrated approach to network intrusion detection with block clustering analysis, generalised logistic regression and linear discriminant analysis.",
            "A systematic literature review of inference strategies.",
            "A unified index structure for efficient enforcement of spatiotemporal authorisations.",
            "Bandwidth efficient asymmetric fingerprinting based on one-out-of-two oblivious transfer.",
            "Comprehensive linguistic steganography survey.",
            "Low power implementation of audio watermarking using chirp spread spectrum technique.",
            "Assured resource sharing in Grid environments.",
            "Sumstega: summarisation-based steganography methodology.",
            "RC42's innovative way for data security in wireless data communication.",
            "Frailty modelling for risk analysis in network security and survivability.",
            "Anomaly detection via statistical learning in industrial communication networks.",
            "Digital fingerprinting: problems and solutions.",
            "Image encryption method based on using least square error techniques at the decryption stage.",
            "A countermeasure algorithm for password guessing attacks.",
            "A logical framework for reasoning about delegation policies in workflow management systems."
        ]
    },
    {
        "name": "IJICS",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 16,
        "papers": [
            "Wavelet-based multiresolution analysis of ridges for fingerprint liveness detection.",
            "The evolutionary design of trace form bent functions in cryptography.",
            "Guidelines for designing graphical authentication mechanism interfaces.",
            "Application security code analysis: a step towards software assurance.",
            "A testbed for power system security evaluation.",
            "Weighted trust evaluation-based malicious node detection for wireless sensor networks.",
            "Mitigating routing vulnerabilities in ad hoc networks using reputations.",
            "Design and simulation on data-forwarding security in sensor networks.",
            "Modelling and simulations for Identity-Based Privacy-Protected Access Control Filter (IPACF) capability to resist massive denial of service attacks.",
            "REputation based Clustering Algorithm for security management in ad hoc networks with liars.",
            "A new protocol for security and QoS in IP networks.",
            "Policy-based intrusion detection in web applications by monitoring Java information flows.",
            "An ontology-based approach to react to network attacks.",
            "Distributed event-based access control.",
            "Dynamic security framework for mobile agent systems: specification, verification and enforcement.",
            "A holistic approach for access control policies: from formal specification to aspect-based enforcement."
        ]
    },
    {
        "name": "IJICS",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 18,
        "papers": [
            "Privacy preserving data obfuscation for inherently clustered data.",
            "A fuzzy programming approach for data reduction and privacy in distance-based mining.",
            "A novel data distortion approach via selective SSVD for privacy protection.",
            "Data mining performance on perturbed databases: important influences on classification accuracy.",
            "Random orthogonal matrix masking methodology for microdata release.",
            "Unsupervised anomaly detection using an evolutionary extension of k-means algorithm.",
            "On security issues in embedded systems: challenges and solutions.",
            "CVC-STAR: Protecting data confidentiality while increasing flexibility and quality of responses.",
            "Attack recovery from malicious transactions in distributed database systems.",
            "Genetic-clustering algorithm for intrusion detection system.",
            "An intelligent proactive security system for cyber centres using Cognitive Agents.",
            "Overlapped parallel computations of scalar multiplication with resistance against Side Channel Attacks.",
            "One-Way Signature Chaining: a new paradigm for group cryptosystems.",
            "A Layered Decision Model for cost-effective system security.",
            "Supporting dynamic administration of RBAC in web-based collaborative applications during run-time.",
            "Privacy-preserving data mining in the malicious model.",
            "Privacy analysis and enhancements for data sharing in *nix systems.",
            "Prompt damage identification for system survivability."
        ]
    },
    {
        "name": "IJICS",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 23,
        "papers": [
            "Data security in location-aware applications: an approach based on RBAC.",
            "Deflation-secure web metering.",
            "On the design, implementation and application of an authorisation architecture for web services.",
            "Software fault tree and coloured Petri net-based specification, design and implementation of agent-based intrusion detection systems.",
            "A geotemporal role-based authorisation system.",
            "A taxonomy of intrusion response systems.",
            "A framework of security and safety checking for internet-based control systems.",
            "An RSA-based (t, n) threshold proxy signature scheme with freewill identities.",
            "Selection of an EAP authentication method for a WLAN.",
            "Accountability in organisations.",
            "PeerCredential: a reputation-based trust framework for Peer-to-Peer applications.",
            "Collaborative Dynamic Source Routing using transitional trust filters.",
            "A synchronous checkpointing protocol for mobile distributed systems: probabilistic approach.",
            "Evaluating the survivability of Intrusion Tolerant Database systems and the impact of intrusion detection deficiencies.",
            "A new assessment and improvement model of risk propagation in information security.",
            "An information-centric and proactive approach to Information Security teaching.",
            "E-business security benchmarking: a model and framework.",
            "Radio Frequency Identification: a review of low cost tag security proposals.",
            "Smart Cards for mobile devices.",
            "Medical data security: Are you informed or afraid?",
            "Honeypot technologies and their applicability as a strategic internal countermeasure.",
            "Document access control in organisational workflows.",
            "A conceptual framework for curbing the epidemic of information malice: e-hygiene model with a human-factor approach."
        ]
    }
]