[
    {
        "name": "IJISP",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 22,
        "papers": [
            "Privacy Disclosure in the Real World: An Experimental Study.",
            "An Imperceptible Watermarking Scheme for Medical Image Tamper Detection.",
            "Predicting Security-Vulnerable Developers Based on Their Techno-Behavioral Characteristics.",
            "A Proposal to Distinguish DDoS Traffic in Flash Crowd Environments.",
            "Network Anomalies Detection Approach Based on Weighted Voting.",
            "Provably Secure Authentication Approach for Data Security in Cloud Using Hashing, Encryption, and Chebyshev-Based Authentication.",
            "Verifiable Authentication and Issuance of Academic Certificates Using Permissioned Blockchain Network.",
            "Personal Data and the Assemblage Security in Consumer Internet of Things.",
            "Impact of Protection Level on Vertically-Differentiated Two-Sided Software Platforms.",
            "Achieving Reconciliation Between Privacy Preservation and Auditability in Zero-Trust Cloud Storage Using Intel SGX.",
            "An Effective Intrusion Detection System Using Homogeneous Ensemble Techniques.",
            "An Ensemble Approach for Feature Selection and Classification in Intrusion Detection Using Extra-Tree Algorithm.",
            "Efficient DNA Cryptographic Framework for Secured Data Encryption Based on Chaotic Sequences.",
            "Proxy-3S: A New Security Policies-Based Proxy for Efficient Distributed Virtual Machines Management in Mobile.",
            "Secure and Flexible Key Protected Identity Framework for Mobile Devices.",
            "Watermarking Images via Counting-Based Secret Sharing for Lightweight Semi-Complete Authentication.",
            "What Drives Information Disclosure in Social Networking Sites: An Empirical Research Within the European Context.",
            "Intrusion Detection Model Using Temporal Convolutional Network Blend Into Attention Mechanism.",
            "A Meta-Analysis of Privacy: Ethical and Security Aspects of Facial Recognition Systems.",
            "Analyzing Newspaper Articles for Text-Related Data for Finding Vulnerable Posts Over the Internet That Are Linked to Terrorist Activities.",
            "A Quantitative Method for Measuring Health of Authoritative Name Servers.",
            "Anomaly Detection Using System Logs: A Deep Learning Approach."
        ]
    },
    {
        "name": "IJISP",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 34,
        "papers": [
            "Data Privacy Protection Algorithm Based on Redundant Slice Technology in Wireless Sensor Networks.",
            "A Smart System of Malware Detection Based on Artificial Immune Network and Deep Belief Network.",
            "Binary Classification of Network-Generated Flow Data Using a Machine Learning Algorithm.",
            "CSMCSM: Client-Server Model for Comprehensive Security in MANETs.",
            "IMMAESA: A Novel Evaluation Method of IDPSs' Reactions to Cyber-Attacks on ICSs Using Multi-Objectives Heuristic Algorithms.",
            "Improved Access Control Mechanisms Using Action Weighted Grid Authorization Graph for Faster Decision Making.",
            "Pairing-Free Identity-Based Proxy Signature Scheme With Message Recovery.",
            "Privacy Protection in Enterprise Social Networks Using a Hybrid De-Identification System.",
            "Socio-Technical Attack Approximation Based on Structural Virality of Information in Social Networks.",
            "Utilizing Sentence Embedding for Dangerous Permissions Detection in Android Apps' Privacy Policies.",
            "An Improved Separable and Reversible Steganography in Encrypted Grayscale Images.",
            "Fine Grained Decentralized Access Control With Provable Data Transmission and User Revocation in Cloud.",
            "Steganography Technique Inspired by Rook.",
            "(p+, α, t)-Anonymity Technique Against Privacy Attacks.",
            "Data Provenance and Access Control Rules for Ownership Transfer Using Blockchain.",
            "Anomaly Intrusion Detection Using SVM and C4.5 Classification With an Improved Particle Swarm Optimization (I-PSO).",
            "DS-kNN: An Intrusion Detection System Based on a Distance Sum-Based K-Nearest Neighbors.",
            "Detecting DDoS Attacks in IoT Environment.",
            "Assessing HIPAA Compliance of Open Source Electronic Health Record Applications.",
            "Improved Extended Progressive Visual Cryptography Scheme Using Pixel Harmonization.",
            "DDoS Attack Simulation and Machine Learning-Based Detection Approach in Internet of Things Experimental Environment.",
            "Entropy-Based Quantification of Privacy Attained Through User Profile Similarity.",
            "A Key Establishment Attempt Based on Genetic Algorithms Applied to RFID Technologies.",
            "A New Combinational Technique in Image Steganography.",
            "VerSA: Verifiable and Secure Approach With Provable Security for Fine-Grained Data Distribution in Scalable Internet of Things Networks.",
            "ADT: Anonymization of Diverse Transactional Data.",
            "SCAFFY: A Slow Denial-of-Service Attack Classification Model Using Flow Data.",
            "A Trust-Integrated RPL Protocol to Detect Blackhole Attack in Internet of Things.",
            "An Opcode-Based Malware Detection Model Using Supervised Learning Algorithms.",
            "A Model to Improve Security Questions Through Individualized Assistance.",
            "Finite Time Synchronization of Chaotic Systems Without Linear Term and Its Application in Secure Communication: A Novel Method of Information Hiding and Recovery With Chaotic Signals.",
            "M-Commerce Security: Assessing the Value of Mobile Applications Used in Controlling Internet Security Cameras at Home and Office - An Empirical Study.",
            "Keystroke Dynamics-Based Authentication System Using Empirical Thresholding Algorithm.",
            "Image Encryption Algorithm Based on a Novel 4D Chaotic System."
        ]
    },
    {
        "name": "IJISP",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 26,
        "papers": [
            "Improving DV-Hop-Based Localization Algorithms in Wireless Sensor Networks by Considering Only Closest Anchors.",
            "Manifold Surveillance Issues in Wireless Network and the Secured Protocol.",
            "Comparison of Various DoS Algorithm.",
            "Secured Sharing of Data in Cloud via Dual Authentication, Dynamic Unidirectional PRE, and CPABE.",
            "An Improved Intrusion Detection System to Preserve Security in Cloud Environment.",
            "A Novel Approach to Develop and Deploy Preventive Measures for Different Types of DDoS Attacks.",
            "Intrusion Detection Systems for Mitigating SQL Injection Attacks: Review and State-of-Practice.",
            "A Valid and Correct-by-Construction Formal Specification of RBAC.",
            "Aggregate Searchable Encryption With Result Privacy.",
            "Dual Image-Based Dictionary Encoded Data Hiding in Spatial Domain.",
            "Securing Communication 2FA Using Post-Quantic Cryptosystem: Case of QC-MDPC- Mceliece Cryptosystem.",
            "IoTP an Efficient Privacy Preserving Scheme for Internet of Things Environment.",
            "Structure-Based Analysis of Different Categories of Cyberbullying in Dynamic Social Network.",
            "Two-Stage Automobile Insurance Fraud Detection by Using Optimized Fuzzy C-Means Clustering and Supervised Learning.",
            "Simulation Experiment of Key Exchange Protocol in Mobile Devices With E-Commerce Application.",
            "Neural Network-Based Approach for Detection and Mitigation of DDoS Attacks in SDN Environments.",
            "An Effective and Computationally Efficient Approach for Anonymizing Large-Scale Physical Activity Data: Multi-Level Clustering-Based Anonymization.",
            "Feature Reduction and Optimization of Malware Detection System Using Ant Colony Optimization and Rough Sets.",
            "An Efficient Mixed Attribute Outlier Detection Method for Identifying Network Intrusions.",
            "A SAT-Based Planning Approach for Finding Logical Attacks on Cryptographic Protocols.",
            "An Efficient Automatic Intrusion Detection in Cloud Using Optimized Fuzzy Inference System.",
            "A Confidence Interval Based Filtering Against DDoS Attack in Cloud Environment: A Confidence Interval Against DDoS Attack in the Cloud.",
            "DecaDroid Classification and Characterization of Malicious Behaviour in Android Applications.",
            "Investigating User Perceptions of Mobile App Privacy: An Analysis of User-Submitted App Reviews.",
            "Factors Impacting Behavioral Intention of Users to Adopt IoT In India: From Security and Privacy Perspective.",
            "A Tweakable Key Alternating Lightweight Cipher for Internet of Things."
        ]
    },
    {
        "name": "IJISP",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 28,
        "papers": [
            "Energy and SLA Efficient Virtual Machine Placement in Cloud Environment Using Non-Dominated Sorting Genetic Algorithm.",
            "Behavioral Modeling of Malicious Objects in a Highly Infected Network Under Quarantine Defence.",
            "A Mutation Operator-Based Scenario for Evaluating Software Clone Detection Tools and Techniques.",
            "Security Protocol with IDS Framework Using Mobile Agent in Robotic MANET.",
            "Enhanced Security for Electronic Health Care Information Using Obfuscation and RSA Algorithm in Cloud Computing.",
            "Efficient Routing Protocol for Location Privacy Preserving in Internet of Things.",
            "A Survey: Intrusion Detection Techniques for Internet of Things.",
            "Reversible Data Hiding Scheme for Video.",
            "An Efficient, Secure, and Queryable Encryption for NoSQL-Based Databases Hosted on Untrusted Cloud Environments.",
            "Cyber Defense Maturity Levels and Threat Models for Smart Cities.",
            "Analysis and Text Classification of Privacy Policies From Rogue and Top-100 Fortune Global Companies.",
            "Design of Public-Key Algorithms Based on Partial Homomorphic Encryptions.",
            "A Mathematical Model of HMST Model on Malware Static Analysis.",
            "Privacy Preservation Based on Separation Sensitive Attributes for Cloud Computing.",
            "An Intelligent Surveillance System Based on IoT for Internal Security of a Nation.",
            "Building an Effective Approach toward Intrusion Detection Using Ensemble Feature Selection.",
            "Extracting and Summarizing the Commonly Faced Security Issues from Community Question Answering Site.",
            "A Priority Based Efficient Secure Framework for WBANs.",
            "A Secure Cluster Head Selection Mechanism Based on Node's Features and Behavior in Wireless Sensor Networks.",
            "A Matrix-Based Pair-Wise Key Establishment for Secure and Energy Efficient WSN-Assisted IoT.",
            "Parallel Hybrid BBO Search Method for Twitter Sentiment Analysis of Large Scale Datasets Using MapReduce.",
            "A Quantum Secure Entity Authentication Protocol Design for Network Security.",
            "Data Security for Cloud Datasets With Bloom Filters on Ciphertext Policy Attribute Based Encryption.",
            "A Framework for Various Attack Identification in MANET Using Multi-Granular Rough Set.",
            "Image Encryption Method Using Dependable Multiple Chaotic Logistic Functions.",
            "Two-Party Key Agreement Protocol Without Central Authority for Mobile Ad Hoc Networks.",
            "An Efficient and Secure Certificateless Aggregate Signature From Bilinear Maps.",
            "A Privacy-Aware Data Aggregation Scheme for Smart Grid Based on Elliptic Curve Cryptography With Provable Security Against Internal Attacks."
        ]
    },
    {
        "name": "IJISP",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 26,
        "papers": [
            "A Hybrid Concept of Cryptography and Dual Watermarking (LSB_DCT) for Data Security.",
            "Secure and Robust Telemedicine using ECC on Radix-8 with Formal Verification.",
            "CIAS: A Comprehensive Identity Authentication Scheme for Providing Security in VANET.",
            "Authentication Through Elliptic Curve Cryptography (ECC) Technique in WMN.",
            "Optimized Packet Filtering Honeypot with Snooping Agents in Intrusion Detection System for WLAN.",
            "Performance Evaluation of SHA-3 Final Round Candidate Algorithms on ARM Cortex-M4 Processor.",
            "A Proposed SOAP Model in WS-Security to Avoid Rewriting Attacks and Ensuring Secure Conversation.",
            "Breaching Security of Full Round Tiny Encryption Algorithm.",
            "Privacy Preserving and Efficient Outsourcing Algorithm to Public Cloud: A Case of Statistical Analysis.",
            "Efficient Authentication Scheme with Reduced Response Time and Communication Overhead in WMN.",
            "A Systematic Study and Analysis of Security Issues in Mobile Ad-hoc Networks.",
            "An Improvised Framework for Privacy Preservation in IoT.",
            "A Comparative Study of Privacy Protection Practices in the US, Europe, and Asia.",
            "SEC-CMAC A New Message Authentication Code Based on the Symmetrical Evolutionist Ciphering Algorithm.",
            "Improving Power Analysis Peak Distribution Using Canberra Distance to Address Ghost Peak Problem.",
            "A Literature Review on Image Encryption Techniques.",
            "Blind Image Source Device Identification: Practicality and Challenges.",
            "Misuse of 'Break-the-Glass' Policies in Hospitals: Detecting Unauthorized Access to Sensitive Patient Health Data.",
            "A Survey of Security Models Using Effective Moving Target Defenses.",
            "Association Rule Hiding in Privacy Preserving Data Mining.",
            "Secure Anonymous Query-Based Encryption for Data Privacy Preserving in Cloud: Moye(Ω).",
            "VuWaDB: A Vulnerability Workaround Database.",
            "Securing Multiple Biometric Data Using SVD and Curvelet-Based Watermarking.",
            "A New Block Cipher System Using Cellular Automata and Ant Colony Optimization (BC-CaACO).",
            "A Reliable Data Provenance and Privacy Preservation Architecture for Business-Driven Cyber-Physical Systems Using Blockchain.",
            "An Australian Longitudinal Study Into Remnant Data Recovered From Second-Hand Memory Cards."
        ]
    },
    {
        "name": "IJISP",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 19,
        "papers": [
            "Privacy and Territoriality Issues in an Online Social Learning Portal.",
            "A New Meta-Heuristics for Intrusion Detection System Inspired from the Protection System of Social Bees.",
            "Detecting Wormhole Attack on Data Aggregation in Hierarchical WSN.",
            "A TPM-based Secure Multi-Cloud Storage Architecture grounded on Erasure Codes.",
            "An Authentication Technique for Accessing De-Duplicated Data from Private Cloud using One Time Password.",
            "Bit Forwarding 3-Bits Technique for Efficient Modular Exponentiation.",
            "Digital Forensic Analysis of Cybercrimes: Best Practices and Methodologies.",
            "PKI Deployment Challenges and Recommendations for ICS Networks.",
            "Framework to Secure Browser Using Configuration Analysis.",
            "A Proposed Scheme for Remedy of Man-In-The-Middle Attack on Certificate Authority.",
            "Identification of Cryptographic Vulnerability and Malware Detection in Android.",
            "Malware Detection by Static Checking and Dynamic Analysis of Executables.",
            "Localization in Wireless Sensor Networks Using Soft Computing Approach.",
            "A Secure Cloud Storage using ECC-Based Homomorphic Encryption.",
            "Honeypot Baselining for Zero Day Attack Detection.",
            "A Survey on Denial of Service Attacks and Preclusions.",
            "Detection of Drive-by Download Attacks Using Machine Learning Approach.",
            "Performance Evaluation of Web Server's Request Queue against AL-DDoS Attacks in NS-2.",
            "Malware Methodologies and Its Future: A Survey."
        ]
    },
    {
        "name": "IJISP",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 16,
        "papers": [
            "Combination of Access Control and De-Identification for Privacy Preserving in Big Data.",
            "The Compliance of IT Control and Governance: A Case of Macao Gaming Industry.",
            "A Clustering Approach Using Fractional Calculus-Bacterial Foraging Optimization Algorithm for k-Anonymization in Privacy Preserving Data Mining.",
            "A Smart Grid Security Architecture for Wireless Advanced Metering Infrastructure (AMI).",
            "Are the Payments System and e-Banking in India Safer than in other SAARC Members?",
            "Analysis of Existing Trust Based Routing Schemes Used in Wireless Network.",
            "Using Crowd Sourcing to Analyze Consumers' Response to Privacy Policies of Online Social Network and Financial Institutions at Micro Level.",
            "Threshold Secret Sharing Scheme for Compartmented Access Structures.",
            "iPhone Forensics: Recovering Investigative Evidence using Chip-off Method.",
            "Preventing Identity Disclosure in Social Networks Using Intersected Node.",
            "IPHDBCM: Inspired Pseudo Hybrid DNA Based Cryptographic Mechanism to Prevent Against Collabrative Black Hole Attack in Wireless Ad hoc Networks.",
            "Metamorphic malware detection using opcode frequency rate and decision tree.",
            "Hybrid Intrusion Detection Framework for Ad hoc networks.",
            "A Framework for Protecting Users' Privacy in Cloud.",
            "Creating Time-Limited Attributes for Time-Limited Services in Cloud Computing.",
            "Accurate Classification Models for Distributed Mining of Privately Preserved Data."
        ]
    },
    {
        "name": "IJISP",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 16,
        "papers": [
            "Client-Side Detection of Clickjacking Attacks.",
            "A Meta-Analysis of Studies on Protection Motivation Theory and Information Security Behaviour.",
            "Short Online/Off-line Signature Scheme for Wireless Sensor Networks.",
            "Disassociations in Security Policy Lifecycles.",
            "Several Oblivious Transfer Variants in Cut-and-Choose Scenario.",
            "Trust of the Same: Rethinking Trust and Reputation Management from a Structural Homophily Perspective.",
            "Cooperative Transmission against Impersonation Attack and Authentication Error in Two-Hop Wireless Networks.",
            "Observations on Genderwise Differences among University Students in Information Security Awareness.",
            "An Efficient, Anonymous and Unlinkable Incentives Scheme.",
            "A Novel OpenFlow-Based DDoS Flooding Attack Detection and Response Mechanism in Software-Defined Networking.",
            "Signature Restoration for Enhancing Robustness of FPGA IP Designs.",
            "Authentication in Ubiquitous Networking.",
            "Software Defined Intelligent Building.",
            "Secure Speaker Recognition using BGN Cryptosystem with Prime Order Bilinear Group.",
            "A New Meta-Heuristic based on Human Renal Function for Detection and Filtering of SPAM.",
            "Secure Group Message Transfer Stegosystem."
        ]
    },
    {
        "name": "IJISP",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 16,
        "papers": [
            "Identifying Vulnerabilities of Advanced Persistent Threats: An Organizational Perspective.",
            "A Covert Communication Model-Based on Image Steganography.",
            "An Integrated Dynamic Model Optimizing the Risk on Real Time Operating System.",
            "An Efficient Intrusion Alerts Miner for Forensics Readiness in High Speed Networks.",
            "A Firegroup Mechanism to Provide Intrusion Detection and Prevention System Against DDos Attack in Collaborative Clustered Networks.",
            "Classification of DOS Attacks Using Visualization Technique.",
            "Empirical Analysis of Software Piracy in Asia (Japan VS. Vietnam): An Exploratory Study.",
            "Data Hiding Method Based on Inter-Block Difference in Eight Queens Solutions and LSB Substitution.",
            "Users' Perception of Security for Mobile Communication Technology.",
            "A New Fuzzy-Based Approach for Anonymity Quantification in E-Services.",
            "Balanced Approach for Hiding Sensitive Association Rules in Data Sharing Environment.",
            "TCP/IP Reassembly in Network Intrusion Detection and Prevention Systems.",
            "A New Negative Selection Algorithm for Adaptive Network Intrusion Detection System.",
            "Toward Proactive Mobile Tracking Management.",
            "An Adaptive Trustworthiness Modelling Approach for Ubiquitous Software Systems.",
            "A Lightweight Authentication Protocol for Secure Communications between Resource-Limited Devices and Wireless Sensor Networks."
        ]
    },
    {
        "name": "IJISP",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 18,
        "papers": [
            "Spearing High Net Wealth Individuals: The Case of Online Fraud and Mature Age Internet Users.",
            "Child Security in Cyberspace Through Moral Cognition.",
            "Contributing Factors of Information Security Investments in South East Asia SMBs: A Technology- Organisational -Environment Approach.",
            "Business Driven User Role Assignment: Nimble Adaptation of RBAC to Organizational Changes.",
            "Computational Complexity Analysis for a Class of Symmetric Cryptosystems Using Simple Arithmetic Operations and Memory Access Time.",
            "Development of A Formal Security Model for Electronic Voting Systems.",
            "Malware Detection and Prevention System Based on Multi-Stage Rules.",
            "Robust Image Data Hiding Technique for Copyright Protection.",
            "Formal Verification of Secrecy, Coercion Resistance and Verifiability Properties for a Remote Electronic Voting Protocol.",
            "A More Secure Image Hiding Scheme Using Pixel Adjustment and Genetic Algorithm.",
            "Holistic and Law Compatible IT Security Evaluation: Integration of Common Criteria, ISO 27001/IT-Grundschutz and KORA.",
            "A Comparative Analysis of Chain-Based Access Control and Role-Based Access Control in the Healthcare Domain.",
            "dDelega: Trust Management for Web Services.",
            "Secure Communication: A Proposed Public Key Watermark System.",
            "Implementation of Improved Hash and Mapping Modified Low Power Parallel Bloom Filter Design.",
            "A Survey of Security Standards Applicable to Health Information Systems.",
            "An Intelligent Network Intrusion Detection System Based on Multi-Modal Support Vector Machines.",
            "False Alarm Reduction Using Adaptive Agent-Based Profiling."
        ]
    },
    {
        "name": "IJISP",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 19,
        "papers": [
            "Global Analysis of Security and Trust Perceptions in Web Design for E-Commerce.",
            "Designing a Secure Cloud Architecture: The SeCA Model.",
            "Performance and Scalability Assessment for Non-Certificate-Based Public Key Management in VANETs.",
            "Towards Usable Application-Oriented Access Controls: Qualitative Results from a Usability Study of SELinux, AppArmor and FBAC-LSM.",
            "Safety Measures for Social Computing in Wiki Learning Environment.",
            "Optimizing Privacy-Accuracy Tradeoff for Privacy Preserving Distance-Based Classification.",
            "Securing Fingerprint Images Through PSO Based Robust Facial Watermarking.",
            "ECFS: An Enterprise-Class Cryptographic File System for Linux.",
            "Secure and Optimized Mobile Based Merchant Payment Protocol using Signcryption.",
            "A Comparative Survey on Cryptology-Based Methodologies.",
            "Information Security Awareness at Saudi Arabians' Organizations: An Information Technology Employee's Perspective.",
            "Critical Evaluation of RFID Security Protocols.",
            "Investing in IT Security: How to Determine the Maximum Threshold.",
            "A Practical Approach of Fairness in E-Procurement.",
            "A Full Review of Attacks and Countermeasures in Wireless Sensor Networks.",
            "A Survey of U.S. Laws for Health Information Security & Privacy.",
            "Secure Data Hiding Using Eight Queens Solutions.",
            "Secure Information Delivery through High Bitrate Data Embedding within Digital Video and its Application to Audio/Video Synchronization.",
            "CITS: The Cost of IT Security Framework."
        ]
    },
    {
        "name": "IJISP",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 16,
        "papers": [
            "A Secure Hybrid Network Solution to Enhance the Resilience of the UK Government National Critical Infrastructure TETRA Deployment.",
            "A Self-Supervised Approach to Comment Spam Detection Based on Content Analysis.",
            "A Mutual Authentication Protocol with Resynchronisation Capability for Mobile Satellite Communications.",
            "Information Privacy: Implementation and Perception of Laws and Corporate Policies by CEOs and Managers.",
            "User Perceptions of Security Technologies.",
            "Secure Two-Party Association Rule Mining Based on One-Pass FP-Tree.",
            "A Mark-Up Language for the Specification of Information Security Governance Requirements.",
            "On the Security of Self-Certified Public Keys.",
            "Design and Implementation of a Zero-Knowledge Authentication Framework for Java Card.",
            "E-Voting Risk Assessment: A Threat Tree for Direct Recording Electronic Systems.",
            "Intrusion Detection Algorithm for MANET.",
            "An Integrated Security Governance Framework for Effective PCI DSS Implementation.",
            "A Privacy Agreement Negotiation Model in B2C E-Commerce Transactions.",
            "A Unified Use-Misuse Case Model for Capturing and Analysing Safety and Security Requirements.",
            "Evaluating the Quality and Usefulness of Data Breach Information Systems.",
            "Wild-Inspired Intrusion Detection System Framework for High Speed Networks (f|p) IDS Framework."
        ]
    },
    {
        "name": "IJISP",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 16,
        "papers": [
            "Provable Security for Outsourcing Database Operations.",
            "A Host-Based Intrusion Detection System Using Architectural Features to Improve Sophisticated Denial-of-Service Attack Detections.",
            "A Keystroke Biometric Systemfor Long-Text Input.",
            "A Six-View Perspective Framework for System Security: Issues, Risks, and Requirements.",
            "Are Online Privacy Policies Readable?",
            "Protecting User Privacy Better with Query l-Diversity.",
            "Globalization and Data Privacy: An Exploratory Study.",
            "Security Issues for Cloud Computing.",
            "Global Information Security Factors.",
            "The Integrated Privacy Model: Building a Privacy Model in the Business Processes of the Enterprise.",
            "Policy Enforcement System for Inter-Organizational Data Sharing.",
            "Goals and Practices in Maintaining Information Systems Security.",
            "Factors Influencing College Students' Use of Computer Security.",
            "A Game Theoretic Approach to Optimize Identity Exposure in Pervasive Computing Environments.",
            "Hiding Message in Map Along Pre-Hamiltonian Path.",
            "Probabilistic Inference Channel Detection and Restriction Applied to Patients' Privacy Assurance."
        ]
    },
    {
        "name": "IJISP",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 23,
        "papers": [
            "Re-Evaluation of On-Line Hot Topic Discovery Model.",
            "Understanding User Behavior towards Passwords through Acceptance and Use Modelling.",
            "Without Permission: Privacy on the Line.",
            "Do Privacy Statements Really Work? The Effect of Privacy Statements and Fair Information Practices on Trust and Perceived Risk in E-Commerce.",
            "Large Key Sizes and the Security of Password-Based Cryptography.",
            "Information Systems Security Assurance Management at Municipal Software Solutions, Inc.",
            "A Chronicle of a Journey: An E-Mail Bounce Back System.",
            "Data Privacy and Security: HIPAA and Small Business Compliance.",
            "PCI Compliance: Overcoming the Challenges.",
            "Information Technology Security Concerns in Global Financial Services Institutions: Do Socio-Economic Factors Differentiate Perceptions?",
            "Information Security by Words Alone: The Case for Strong Security Policies.",
            "The Social Organization of a Criminal Hacker Network: A Case Study.",
            "Security and Privacy Issues in Secure E-Mail Standards and Services.",
            "Applied Cryptography for Security and Privacy in Wireless Sensor Networks.",
            "Cryptographic and Steganographic Approaches to Ensure Multimedia Information Security and Privacy.",
            "Cloak and Dagger: Man-In-The-Middle and Other Insidious Attacks.",
            "Fair Electronic Exchange Based on Fingerprint Biometrics.",
            "Secure and Private Service Discovery in Pervasive Computing Environments.",
            "Preserving Privacy in Mining Quantitative Associations Rules.",
            "A New Soa Security Model to Protect Against Web Competitive Intelligence Attacks by Software Agents.",
            "PAKE on the Web.",
            "Three Models to Measure Information Security Compliance.",
            "Do You Know Where Your Data Is? A Study of the Effect of Enforcement Strategies on Privacy Policies."
        ]
    },
    {
        "name": "IJISP",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 22,
        "papers": [
            "SEACON: An Integrated Approach to the Analysis and Design of Secure Enterprise Architecture-Based Computer Networks.",
            "Life Cycle Pattern Study of Malicious Codes.",
            "An Empirical Investigation of an Individual's Perceived Need for Privacy and Security.",
            "VIPSEC: Virtualized and Pluggable Security Services Architecture for Grids.",
            "Computer Security Practices and Perceptions of the Next Generation of Corporate Computer Use.",
            "Memory-Based Antiforensic Tools and Techniques.",
            "A Secure and Trustful E-Ordering Architecture (TOES) for Small and Medium Size Enterprises (SEMs).",
            "Trust-Based Usage Control in Collaborative Environment.",
            "Spam Classification Based on E-Mail Path Analysis.",
            "Laws and Regulations Dealing with Information Security and Privacy: An Investigative Study.",
            "The Impact of Privacy Legislation on Patient Care.",
            "Using Statistical Texture Analysis for Medical Image Tamper Proofing.",
            "A Privacy Protection Model for Patient Data with Multiple Sensitive Attributes.",
            "Electronic Medical Records, HIPAA, and Patient Privacy.",
            "Protecting Patient Information in Outsourced Telehealth Services: Bolting on Security when it cannot be Baked in.",
            "Analyzing the Vulnerability of U.S. Hospitals to Social Engineering Attacks: How Many of Your Employees Would Share Their Password?",
            "The Influence of Media Trust and Internet Trust on Privacy-Risking Uses of E-Health.",
            "On Access-Unrestricted Data Anonymity and Privacy Inference Disclosure Control.",
            "A Decentralized Security Framework for Web-Based Social Networks.",
            "SecCMP: Enhancing Critical Secrets Protection in Chip-Multiprocessors.",
            "Design and Implementation of a Framework for Assured Information Sharing Across Organizational Boundaries.",
            "Will it be Disclosure or Fabrication of Personal Information? An Examination of Persuasion Strategies on Prospective Employees."
        ]
    },
    {
        "name": "IJISP",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 20,
        "papers": [
            "Trustworthy Web Services: An Experience-Based Model for Trustworthiness Evaluation.",
            "Administering the Semantic Web: Confidentiality, Privacy, and Trust Management.",
            "Privacy-Preserving Transactions Protocol Using Mobile Agents with Mutual Authentication.",
            "Privacy-Preserving Data Mining and the Need for Confluence of Research and Practice.",
            "Privacy and Security in the Age of Electronic Customer Relationship Management.",
            "On the Design of an Authentication System Based on Keystroke Dynamics Using a Predefined Input Text.",
            "Privacy-Preserving Clustering to Uphold Business Collaboration: A Dimensionality Reduction Based Transformation Approach.",
            "Information Security Effectiveness: Conceptualization and Validation of a Theory.",
            "The Role of Privacy Risk in IT Acceptance: An Empirical Study.",
            "Ignorance is Bliss: The Effect of Increased Knowledge on Privacy Concerns and Internet Shopping Site Personalization Preferences.",
            "A Projection of the Future Effects of Quantum Computation on Information Privacy.",
            "Information Systems Security: Cases of Network Administrator Threats.",
            "A Rule-Based and Game-Theoretic Approach to Online Credit Card Fraud Detection.",
            "Defeating Active Phishing Attacks for Web-Based Transactions.",
            "A Semi-fragile Image Watermarking using Wavelet Inter Coefficient Relations.",
            "An Ontology of Information Security.",
            "Towards Autonomous User Privacy Control.",
            "E-Mail Worm Detection Using Data Mining.",
            "A Simulation Model of Information Systems Security.",
            "Rootkits and What we Know: Assessing US and Korean Knowledge and Perceptions."
        ]
    }
]