[
    {
        "name": "IMCS",
        "year": "2022",
        "info": "Volume 30: 2022",
        "count": 8,
        "papers": [
            "Evaluating user susceptibility to phishing attacks.",
            "An improved feature extraction algorithm for insider threat using hidden Markov model on user behavior detection.",
            "To click or not to click the link: the factors influencing internet banking users' intention in responding to phishing emails.",
            "Response to a phishing attack: persuasion and protection motivation in an organizational context.",
            "The impact of general data protection regulation on software engineering practices.",
            "How different rewards tend to influence employee non-compliance with information security policies.",
            "To sell, or not to sell: social media data-breach in second-hand Android devices.",
            "Cyberattacks against the health-care sectors during the COVID-19 pandemic."
        ]
    },
    {
        "name": "IMCS",
        "year": "2021",
        "info": "Volume 29: 2021",
        "count": 40,
        "papers": [
            "Adoption of AI-integrated CRM system by Indian industry: from security and privacy perspective.",
            "A novel approach for improving information security management and awareness for home environments.",
            "Incorporating the human facet of security in developing systems and services.",
            "Firm investment decisions for information security under a fuzzy environment: a game-theoretic approach.",
            "Adapting CTF challenges into virtual cybersecurity learning environments.",
            "A systematic review of scales for measuring information security culture.",
            "Users' attitude on perceived security of enterprise systems mobility: an empirical study.",
            "Reaction of users as potential victims of information security breach.",
            "Developing an information classification method.",
            "Forming digital identities in social networks: the role of privacy concerns and self-esteem.",
            "\"SME executives' perceptions and the information security preparedness model\".",
            "A look into user privacy andthird-party applications in Facebook.",
            "How social engineers use persuasion principles during vishing attacks.",
            "Improving data quality for human-as-a-security-sensor. A process driven quality improvement approach for user-provided incident information.",
            "The human factor: assessing individuals' perceptions related to cybersecurity.",
            "The impact of information security initiatives on supply chain robustness and performance: an empirical study.",
            "Gender differences in predictors of technology threat avoidance.",
            "Understanding the disclosure of personal data online.",
            "Cyberbullying and cyber-mobbing in developing countries.",
            "A collaborative approach for national cybersecurity incident management.",
            "Cybersecurity advocates: discovering the characteristics and skills of an emergent role.",
            "After the disclosure: measuring the short-term and long-term impacts of data breach disclosures on the financial performance of organizations.",
            "The \"three M's\" counter-measures to children's risky online behaviors: mentor, mitigate and monitor.",
            "Do privacy concerns determine online information disclosure? The case of internet addiction.",
            "A look into user's privacy perceptions and data practices of IoT devices.",
            "Collective information security behaviour: a technology-driven framework.",
            "Accessible authentication: dyslexia and password strategies.",
            "Assessing information security behaviour: a self-determination theory perspective.",
            "Exploring the meaning of usable security - a literature review.",
            "Towards a cross-cultural education framework for online safety awareness.",
            "Bayesian evaluation of privacy-preserving risk communication for user android app preferences.",
            "Key competencies for critical infrastructure cyber-security: a systematic literature review.",
            "Introducing the concept of cybersecurity footprint.",
            "Examining the relationship between e-government development, nation's cyber-security commitment, business usage and economic prosperity: a cross-country analysis.",
            "Validating an information privacy governance questionnaire to measure the perception of employees.",
            "Visualising personas as goal models to find security tensions.",
            "Users' perception of cybersecurity, trust and cloud computing providers' performance.",
            "Factors affecting organizational adoption and acceptance of computer-based security awareness training tools.",
            "Exploring potential gender differences in information security and privacy.",
            "Predicting information security culture among employees of telecommunication companies in an emerging market."
        ]
    },
    {
        "name": "IMCS",
        "year": "2020",
        "info": "Volume 28: 2020",
        "count": 38,
        "papers": [
            "Matching training to individual learning styles improves information security awareness.",
            "Mobile agent-based SIEM for event collection and normalization externalization.",
            "Evaluating privacy impact assessment methods: guidelines and best practice.",
            "The cyber-insurance market in Norway.",
            "Requirements for private communications over public spheres.",
            "Patient use of online medical records: an application of technology acceptance framework.",
            "AppAware: a policy visualization model for mobile applications.",
            "Enhancing cyber security behavior: an internal social marketing approach.",
            "The willingness to disclose personal information.",
            "Automated data-driven profiling: threats for group privacy.",
            "Cloud computing in SMEs: towards delegation of the CIO role.",
            "The hunt for computerized support in information security policy management.",
            "What do we know about information security governance?",
            "Cybersecurity behaviour of smartphone users in India: an empirical analysis.",
            "Towards a maturity model for health-care cloud security (M2HCS).",
            "Analyzing the usage of character groups and keyboard patterns in password creation.",
            "Mobile users' information privacy concerns instrument and IoT.",
            "A Clark-Wilson and ANSI role-based access control model.",
            "Editorial.",
            "Comparing the protection and use of online personal information in South Africa and the United Kingdom in line with data protection requirements.",
            "Assessing the current state of information security policies in academic organizations.",
            "Response biases in policy compliance research.",
            "It is not my job: exploring the disconnect between corporate security policies and actual security practices in SMEs.",
            "An activity theory approach to information security non-compliance.",
            "Utilizing a privacy impact assessment method using metrics in the healthcare sector.",
            "Privacy, security, legal and technology acceptance elicited and consolidated requirements for a GDPR compliance platform.",
            "A systematic literature review of the factors affecting smartphone user threat avoidance behaviour.",
            "Discovering \"Insider IT Sabotage\" based on human behaviour.",
            "PRISM: a strategic decision framework for cybersecurity risk assessment.",
            "Information and cyber security maturity models: a systematic literature review.",
            "From ISO/IEC27001: 2013 and ISO/IEC27002: 2013 to GDPR compliance controls.",
            "GDPR compliance: proposed technical and organizational measures for cloud provider.",
            "The impact of information security management practices on organisational agility.",
            "Constructing secure and memorable passwords.",
            "Security behaviour of mobile financial service users.",
            "The role of norms in information security policy compliance.",
            "A novel trust model for fog computing using fuzzy neural networks and weighted weakest link.",
            "How effective are social engineering interventions? A meta-analysis."
        ]
    },
    {
        "name": "IMCS",
        "year": "2019",
        "info": "Volume 27: 2019",
        "count": 35,
        "papers": [
            "A framework for reporting and dealing with end-user security policy compliance.",
            "Mitigating e-services avoidance: the role of government cybersecurity preparedness.",
            "A review of security assessment methodologies in industrial control systems.",
            "Forensic analysis of Google Allo messenger on Android platform.",
            "Customer data security and theft: a Malaysian organization's experience.",
            "Mitigating cyber attacks through the measurement of non-IT professionals' cybersecurity skills.",
            "Effect of long-term orientation on voluntary security actions.",
            "Key elements of an information security culture in organisations.",
            "Security monitoring and information security assurance behaviour among employees.",
            "Cloud privacy objectives a value based approach.",
            "The impact of using different keyboards on free-text keystroke dynamics authentication for Arabic language.",
            "Socio-technical systems cybersecurity framework.",
            "Actionable threat intelligence for digital forensics readiness.",
            "A survey on the Internet of Things security.",
            "From theory to practice: guidelines for enhancing information security management.",
            "Published incidents and their proportions of human error.",
            "Revisiting information security risk management challenges: a practice perspective.",
            "Contrasting cybersecurity implementation frameworks (CIF) from three countries.",
            "Developing cybersecurity education and awareness programmes for small- and medium-sized enterprises (SMEs).",
            "A conceptual model and empirical assessment of HR security risk management.",
            "Security gaps assessment of smart grid based SCADA systems.",
            "Understanding passwords - a taxonomy of password creation strategies.",
            "Information protection behaviors: morality and organizational criticality.",
            "Response awareness and instructional self-efficacy: influences on intent.",
            "Collaborative security risk estimation in agile software development.",
            "An experimental evaluation of bow-tie analysis for security.",
            "Identity deception detection: requirements and a model.",
            "Refining the PoinTER \"human firewall\" pentesting framework.",
            "Sealed computation: a mechanism to support privacy-aware trustworthy cloud service.",
            "Keep on rating - on the systematic rating and comparison of authentication schemes.",
            "A normative decision-making model for cyber security.",
            "Making secret sharing based cloud storage usable.",
            "Developing and validating a common body of knowledge for information privacy.",
            "A scheme for the sticky policy representation supporting secure cyber-threat intelligence analysis and sharing.",
            "Practical evaluation of a reference architecture for the management of privacy level agreements."
        ]
    },
    {
        "name": "IMCS",
        "year": "2018",
        "info": "Volume 26: 2018",
        "count": 36,
        "papers": [
            "Cybersecurity and information security - what goes where?",
            "A process model for implementing information systems security governance.",
            "A utilitarian re-examination of enterprise-scale information security management.",
            "Transforming information security governance in India (A SAP-LAP based case study of security, IT policy and e-governance).",
            "Information security policy compliance: a higher education case study.",
            "Data security and consumer trust in FinTech innovation in Germany.",
            "Employee fraud and misconduct: empirical evidence from a telecommunication company.",
            "Guest editorial.",
            "Strategic value alignment for information security management: a critical success factor analysis.",
            "Escalation of commitment as an antecedent to noncompliance with information security policy.",
            "Reconciling value-based objectives for security and identity management.",
            "Perceptions of organizational culture and value conflicts in information security management.",
            "Information security policies and value conflict in multinational companies.",
            "Value conflicts and non-compliance: Attitudes to whistleblowing in Swedish organisations.",
            "Guest editorial.",
            "Persuading end users to act cautiously online: a fear appeals study on phishing.",
            "The effect of resilience and job stress on information security awareness.",
            "I shall, we shall, and all others will: paradoxical information security behaviour.",
            "Identifying and predicting the factors affecting end-users' risk-taking behavior.",
            "In their own words: employee attitudes towards information security.",
            "An information privacy culture instrument to measure consumer privacy expectations and confidence.",
            "Security questions education: exploring gamified features and functionalities.",
            "Applying the physics of notation to the evaluation of a security and privacy requirements engineering methodology.",
            "Using stage theorizing to make anti-phishing recommendations more effective.",
            "Establishing information security policy compliance culture in organizations.",
            "A model-based approach to support privacy compliance.",
            "A grounded theory approach to security policy elicitation.",
            "Risk-aware decision support with constrained goal models.",
            "Designing blockchain-based SIEM 3.0 system.",
            "Assessing the information quality of phishing-related content on financial institutions' websites.",
            "Work-related groups and information security policy compliance.",
            "Ontology-based information security compliance determination and control selection on the example of ISO 27002.",
            "Information security practice in Saudi Arabia: case study on Saudi organizations.",
            "An approach to information security culture change combining ADKAR and the ISCA questionnaire to aid transition to the desired culture.",
            "MMSPhiD: a phoneme based phishing verification model for persons with visual impairments.",
            "Impact of cyberattacks on stock performance: a comparative study."
        ]
    },
    {
        "name": "IMCS",
        "year": "2017",
        "info": "Volume 25: 2017",
        "count": 34,
        "papers": [
            "Design and validation of a trust-based opportunity-enabled risk management system.",
            "Cloud computing assurance - a review of literature guidance.",
            "So long, and thanks for only using readily available scripts.",
            "Privacy-preserving recommendations in context-aware mobile environments.",
            "Must I, can I? I don't understand your ambiguous password rules.",
            "Auditing for privacy in threshold PKE e-voting.",
            "Organisational culture, procedural countermeasures, and employee security behaviour: A qualitative study.",
            "Productivity vs security: mitigating conflicting goals in organizations.",
            "The application of behavioural thresholds to analyse collective behaviour in information security.",
            "Comparing three models to explain precautionary online behavioural intentions.",
            "Managing information security awareness at an Australian bank: a comparative study.",
            "Factors in an end user security expertise instrument.",
            "Social engineering defence mechanisms and counteracting training strategies.",
            "Tightroping between APT and BCI in small enterprises.",
            "Analysing information security in a bank using soft systems methodology.",
            "A general morphological analysis: delineating a cyber-security culture.",
            "Measuring employees' compliance - the importance of value pluralism.",
            "The role of the chief information security officer in the management of IT security.",
            "Mobile device users' privacy security assurance behavior: A technology threat avoidance perspective.",
            "Running the risk IT - more perception and less probabilities in uncertain systems.",
            "A cyber-threat analytic model for autonomous detection of virtual property theft.",
            "State transgression on electronic expression: is it for real?",
            "Workarounds and trade-offs in information security - an exploratory study.",
            "Deterrence and punishment experience impacts on ISP compliance attitudes.",
            "Human-centered authentication guidelines.",
            "On data leakage from non-production systems.",
            "A systematic approach to investigating how information security and privacy can be achieved in BYOD environments.",
            "Information security management and the human aspect in organizations.",
            "Understanding of e-service security dimensions and its effect on quality and intention to use.",
            "Measuring attitude towards personal data for adaptive cybersecurity.",
            "Escalation of commitment and information security: theories and implications.",
            "Spear phishing in organisations explained.",
            "Incorporating privacy in the design of cloud-based systems: a conceptual meta-model.",
            "To cloud or not to cloud: how risks and threats are affecting cloud adoption decisions."
        ]
    },
    {
        "name": "IMCS",
        "year": "2016",
        "info": "Volume 24: 2016",
        "count": 32,
        "papers": [
            "Privacy-preserving, user-centric VoIP CAPTCHA challenges: An integrated solution in the SIP environment.",
            "Examining the suitability of industrial safety management approaches for information security incident management.",
            "Cyberoperations and international humanitarian law: A review of obstacles in applying international law rules in cyber warfare.",
            "A study on usability and security features of the Android pattern lock screen.",
            "The impact of repeated data breach events on organisations' market value.",
            "User password repetitive patterns analysis and visualization.",
            "Security behaviors of smartphone users.",
            "Guest editorial.",
            "Comparing the information security culture of employees who had read the information security policy and those who had not: Illustrated through an empirical study.",
            "Factors to affect improvement in cyber officer performance.",
            "Attention and past behavior, not security knowledge, modulate users' decisions to login to insecure websites.",
            "Decoding audience interpretations of awareness campaign messages.",
            "An empirical test of the perceived relationship between risk and the constituents severity and probability.",
            "An information security risk-driven investment model for analysing human factors.",
            "Assessing information security attitudes: a comparison of two studies.",
            "Gesture-based animated CAPTCHA.",
            "The pathway to security - mitigating user negligence.",
            "Enhancing collaborative intrusion detection networks using intrusion sensitivity in detecting pollution attacks.",
            "Evaluating the effect of multi-touch behaviours on Android unlock patterns.",
            "Fight fire with fire: the ultimate active defence.",
            "An efficient intrusion detection and prevention framework for ad hoc networks.",
            "Stress-based security compliance model - an exploratory study.",
            "Online privacy and security concerns of consumers.",
            "Spot the phish by checking the pruned URL.",
            "Leveraging autobiographical memory for two-factor online authentication.",
            "Why don't UK citizens protest against privacy-invading dragnet surveillance?",
            "Inter-organisational information security: a systematic literature review.",
            "Mapping information security standard ISO 27002 to an ontological structure.",
            "Consumer trust in Google's top developers' apps: an exploratory study.",
            "Theorising on risk homeostasis in the context of information security behaviour.",
            "Assessing IT disaster recovery plans: The case of publicly listed firms on Abu Dhabi/UAE security exchange.",
            "Explaining small business InfoSec posture using social theories."
        ]
    },
    {
        "name": "IMCS",
        "year": "2015",
        "info": "Volume 23: 2015",
        "count": 31,
        "papers": [
            "Editorial.",
            "Influential factors of online fraud occurrence in retailing banking sectors from a global prospective: An empirical study of individual customers in the UK and China.",
            "Checking the manipulation checks in information security research.",
            "A new hierarchical intrusion detection system based on a binary tree of classifiers.",
            "User-visible cryptography in email and web scenarios.",
            "Security evaluation of the OAuth 2.0 framework.",
            "An examination of factors that influence the number of information security policy violations in Qatari organizations.",
            "Organizational objectives for information security governance: a value focused assessment.",
            "Managing perceived risk for customer retention in e-commerce: The role of switching costs.",
            "Identifying core control items of information security management and improvement strategies by applying fuzzy DEMATEL.",
            "Investigating personal determinants of phishing and the effect of national culture.",
            "The sufficiency of the theory of planned behavior for explaining information security policy compliance.",
            "A comprehensive security control selection model for inter-dependent organizational assets structure.",
            "Information security culture - state-of-the-art review between 2000 and 2013.",
            "Language-independent gender identification through keystroke analysis.",
            "Management commitment and awareness creation - ICT safety and security in electric power supply network companies.",
            "Strategic cyber intelligence.",
            "Examining the effectiveness of phishing filters against DNS based phishing attacks.",
            "Investigating the work practices of network security professionals.",
            "A framework to assist email users in the identification of phishing attacks.",
            "Privacy as a secondary goal problem: an experiment examining control.",
            "Reengineering the user: privacy concerns about personal data on smartphones.",
            "Exploring the relationship between student mobile information security awareness and behavioural intent.",
            "Investigating the possibility to use differentiated authentication based on risk profiling to secure online banking.",
            "Engaging stakeholders during late stage security design with assumption personas.",
            "Logical acquisition and analysis of data from android mobile devices.",
            "Information security in supply chains: a management control perspective.",
            "User-centred authentication feature framework.",
            "An empirical test of the accuracy of an attack graph analysis tool.",
            "Towards a framework for the potential cyber-terrorist threat to critical national infrastructure: A quantitative study.",
            "Taxonomy of technological risks of open source software in the enterprise adoption context."
        ]
    },
    {
        "name": "IMCS",
        "year": "2014",
        "info": "Volume 22: 2014",
        "count": 30,
        "papers": [
            "Perceived significance of information security governance to predict the information security service quality in software service industry: An empirical analysis.",
            "Information security in the South Australian real estate industry: A study of 40 real estate organisations.",
            "Variables influencing information security policy compliance: A systematic review of quantitative studies.",
            "E-commerce assurance models and trustworthiness issues: an empirical study.",
            "Mobile device security considerations for small- and medium-sized enterprise business mobility.",
            "Recommendations for information security awareness training for college students.",
            "A security education Q&A.",
            "Quick detection of NFC vulnerability: Implementation weakness exploitation.",
            "Grammar-based transformations: attack and defence.",
            "The effect of adaptive mechanism on behavioural biometric based mobile phone authentication.",
            "Improving passwords: influence of emotions on security behaviour.",
            "Snakes and ladders for digital natives: information security education for the youth.",
            "An empirical investigation of the factors that influence Internet user's ability to correctly identify a phishing website.",
            "Information security governance implementation within Ghanaian industry sectors: An empirical study.",
            "A holistic cyber security implementation framework.",
            "A cyclical evaluation model of information security maturity.",
            "Information security: Critical review and future directions for research.",
            "A secure portable execution environment to support teleworking.",
            "A study of information security awareness in Australian government organisations.",
            "Extended results of Norwegian password security survey.",
            "Forensic triage of email network narratives through visualisation.",
            "Brain-compatible, web-based information security education: a statistical study.",
            "Developing and testing SCoP - a visual hash scheme.",
            "Using phishing experiments and scenario-based surveys to understand security behaviours in practice.",
            "Current challenges in information security risk management.",
            "Using response action with intelligent intrusion detection and prevention system against web application malware.",
            "Impact of information security initiatives on supply chain performance: An empirical investigation.",
            "Security culture and the employment relationship as drivers of employees' security compliance.",
            "Repairing trust in an e-commerce and security context: an agent-based modeling approach.",
            "Teaching information security management: reflections and experiences."
        ]
    },
    {
        "name": "IMCS",
        "year": "2013",
        "info": "Volume 21: 2013",
        "count": 25,
        "papers": [
            "Human aspects of information security: An empirical study of intentional versus actual behavior.",
            "A method to calculate social networking hazard probability in definite time.",
            "Intrusion detection and the role of the system administrator.",
            "Usable secure email communications: criteria and evaluation of existing approaches.",
            "Psychosocial risks: Can their effects on the security of information systems really be ignored?",
            "Fingerprinting Tor.",
            "Social against social engineering: Concept and development of a Facebook application to raise security and risk awareness.",
            "SOUL System: secure online USB login system.",
            "VoxGrid: a mobile voice verification system.",
            "Revisiting the myth of Cisco IOS diversity: recent advances in reliable shellcode design.",
            "A research framework for social commerce adoption.",
            "Push and pull effects of homeland information security incentives.",
            "Evaluating and enriching information and communication technologies compliance frameworks with regard to privacy.",
            "Democracy, culture and information security: a case study in Zanzibar.",
            "Resolving vulnerability identification errors using security requirements on business process models.",
            "Applying IT governance balanced scorecard and importance-performance analysis for providing IT governance strategy in university.",
            "Estimates on the effectiveness of web application firewalls against targeted attacks.",
            "Social action theory for understanding information security non-compliance in hospitals: The importance of user rationale.",
            "Anomaly detection based on hybrid artificial immune principles.",
            "A framework for teaching network security in academic environments.",
            "A comparison of password feedback mechanisms and their impact on password entropy.",
            "Unified trust establishment by leveraging remote attestation - modeling and analysis.",
            "A survey of security risks of mobile social media through blog mining and an extensive literature search.",
            "Deriving an information security assurance indicator at the organizational level.",
            "Multi-agency partnerships in cybercrime reduction: Mapping the UK information assurance network cooperation space."
        ]
    },
    {
        "name": "IMCS",
        "year": "2012",
        "info": "Volume 20: 2012",
        "count": 22,
        "papers": [
            "Towards Usable Privacy Policy Display & Management for PrimeLife.",
            "Why Do Some People Manage Phishing Emails Better Than Others?",
            "Death by a Thousand Facts: Criticising the Technocratic Approach to Information Security Awareness.",
            "Combating Information Security Apathy by Encouraging Prosocial Organisational Behaviour.",
            "Validation of a Biases Model in Strategic Security Decision-Making.",
            "Resilience at Interfaces - Improvement of Safety and Security in Distributed Control Systems by Web of Influence.",
            "A Conceptual Framework for Information Technology Governance Effectiveness in Private Organizations.",
            "Estimates of success rates of remote arbitrary code execution attacks.",
            "An Evaluation of a Secure and Trustworthy Mobile Agent-based E-marketplace System.",
            "Incorporating business strategy formulation with identity management strategy formulation.",
            "A framework for preventing money laundering in banks.",
            "An integrated model for online transactions: illuminating the black box.",
            "Reliable and secure encryption key generation from fingerprints.",
            "E-commerce policies and customer privacy: a longitudinal study (2000-2010).",
            "SIEM-based framework for security controls automation.",
            "Identifying linkages between statements in information security policy, procedures and controls.",
            "Social Network Analysis for Cluster-Based IP Spam Reputation.",
            "Can spending on information security be justified? Evaluating the security spending decision from the perspective of a rational actor.",
            "Information security and business continuity management in interorganizational IT relationships.",
            "The effect of acquisition decision making on security posture.",
            "An investigation of students' perception of Bluetooth security.",
            "Phishing counter measures and their effectiveness - literature review."
        ]
    },
    {
        "name": "IMCS",
        "year": "2011",
        "info": "Volume 19: 2011",
        "count": 20,
        "papers": [
            "Addressing Dynamic Issues in Information Security Management.",
            "Personalized Cognitive Passwords: An Exploratory Assessment.",
            "Risk Analysis Methodology Used by Several Small and Medium Enterprises in the Czech Republic.",
            "A Personalized Approach to Web Privacy - Awareness, Attitudes and Actions.",
            "Security mistakes in information system deployment projects.",
            "Optimizing Investment Decisions in Selecting Information Security Remedies.",
            "The Landscape of Cybercrime in Greece.",
            "The 14 Layered Framework for Including Social and Organisational Aspects in Security Management.",
            "The long term effects of information security e-learning on organizational learning.",
            "Impacts of Organizational Capabilities In Information Security.",
            "Countering Code Injection Attacks: A Unified Approach.",
            "Understanding Consumer Intention with Respect to Purchase and Use of Pirated Software.",
            "A Longitudinal Analysis of Data Breaches.",
            "A quantitative evaluation of vulnerability scanning.",
            "Enhancing SSADM with Disaster Recovery Plan activities.",
            "Shaping Security Behavior through Discipline and Agility: Implications for Information Security Management.",
            "An Advanced Web Attack Detection and Prevention Tool.",
            "Leadership Styles and Information Security in Small Businesses.",
            "Quantifying Information Dynamics Through New Valuation System.",
            "Design of Secure and Trustworthy Mobile Agent-based E-marketplace System."
        ]
    },
    {
        "name": "IMCS",
        "year": "2010",
        "info": "Volume 18: 2010",
        "count": 22,
        "papers": [
            "Understanding and transforming organizational security culture.",
            "Watching the watchers: \"voluntary monitoring\" of infosec employees.",
            "Preparation, detection, and analysis: the diagnostic work of IT security incident response.",
            "Assessing image-based authentication techniques in a web-based environment.",
            "SafeLine: reporting illegal internet content.",
            "Security Guideline Tool for Home Users Based on International Standards.",
            "A Personalized Rhythm Click-Based Authentication System.",
            "Vulnerability Analysis and the Practical Implications of a Server-challenge-based One-time Password System.",
            "Assessing and Improving Authentication Confidence Management.",
            "A review and future research directions of secure and trustworthy mobile agent-based e-marketplace systems.",
            "Brand, knowledge, and false sense of security.",
            "Justifying the need for a data security management plan for the UAE.",
            "Finding middle ground management strategy for software development.",
            "Exploring the supply of pirate software for mobile devices: An analysis of software types and piracy groups.",
            "Information security governance in Saudi organizations: an empirical study.",
            "A survey of intrusion detection and prevention systems.",
            "Expanding topological vulnerability analysis to intrusion detection through the incident response intelligence system.",
            "A Vocabulary Test to Assess Information Security Awareness.",
            "Human-Related Problems of Information Security in East African Cross-Cultural Environments.",
            "Designing and Aligning e-Science Security Culture with Design.",
            "A Security Standards' Framework to Facilitate Best Practices' Awareness and Conformity.",
            "Information Security Education in South Africa."
        ]
    },
    {
        "name": "IMCS",
        "year": "2009",
        "info": "Volume 17: 2009",
        "count": 24,
        "papers": [
            "An integrated view of human, organizational, and technological challenges of IT security management.",
            "A cognitive walkthrough of Autopsy Forensic Browser.",
            "Formalizing the ranking of authentication products.",
            "Using penetration testing feedback to cultivate an atmosphere of proactive security amongst end-users.",
            "Social engineering: assessing vulnerabilities in practice.",
            "Exploring the importance and implementation of COBIT processes in Saudi organizations: An empirical study.",
            "The importance of perceived trust, security and privacy in online trading systems.",
            "IT disaster recovery: Oman and Cyclone Gonu lessons learned.",
            "Internet retail banking: A competitive analysis in an increasingly financially troubled environment.",
            "A holistic framework for mCRM - data mining perspective.",
            "E-commerce usage and business performance in the Malaysian tourism sector: empirical analysis.",
            "Requirement engineering elicitation methods: A Kuwaiti empirical study about familiarity, usage and perceived value.",
            "A process model for customer relational assets creation: A case study of online securities trading platform.",
            "On consolidation model in e-bill presentment and payment.",
            "Determinants of the critical success factor of disaster recovery planning for information systems.",
            "Consumer motivations in taking action against spyware: an empirical investigation.",
            "A canonical analysis of intentional information security breaches by insiders.",
            "Towards privacy in personal data management.",
            "Impact of perceived technical protection on security behaviors.",
            "How perceptions of justice affect security attitudes: suggestions for practitioners and researchers.",
            "Proposing semantic-oriented agent and knowledge base product data management.",
            "Information technology security management concerns in global financial services institutions: Is national culture a differentiator?",
            "Effects on employees' information security abilities by e-learning.",
            "A new English auction scheme using the bulletin board system."
        ]
    },
    {
        "name": "IMCS",
        "year": "2008",
        "info": "Volume 16: 2008",
        "count": 28,
        "papers": [
            "Information privacy compliance in the healthcare industry.",
            "Managing electronic information: an ethics perspective.",
            "Real time business intelligence in supply chain analytics.",
            "Reaching escape velocity: A practiced approach to information security management system implementation.",
            "A practical application of CMM to medical security capability.",
            "A partial equilibrium view on security and privacy.",
            "The effect of organizational and individual characteristics on corporate intranet utilizations.",
            "Interpretive structural modeling (ISM) of IT-enablers for Indian manufacturing SMEs.",
            "An exploratory study on systems development methodologies for web-based applications.",
            "Ontologies for information security management and governance.",
            "Supporting decision making in risk management through an evidence-based information systems project risk checklist.",
            "Management versus security specialists: an empirical study on security related perceptions.",
            "Fuzzy multi-criteria risk-benefit analysis of business process outsourcing (BPO).",
            "Comparison of sub-Saharan Africa's e-government status with developed and transitional nations.",
            "Information security management objectives and practices: a parsimonious framework.",
            "Process-variance models in information security awareness research.",
            "Efficient anonymous secure auction schema (ASAS) without fully trustworthy auctioneer.",
            "An agent-based privacy-enhancing model.",
            "Escalation and premature termination in MIS projects: the role of real options.",
            "Managed IT services: the role of IT standards.",
            "A cross-cultural investigation of situational information security awareness programs.",
            "Implementation and effectiveness of organizational information security measures.",
            "Securing SCADA systems.",
            "Biometrics in banking security: a case study.",
            "A multidimensional approach to multilevel security.",
            "Evaluating the performance of open source software projects using data envelopment analysis.",
            "A test of interventions for security threats from social engineering.",
            "Knowing is doing: An empirical validation of the relationship between managerial information security awareness and action."
        ]
    },
    {
        "name": "IMCS",
        "year": "2007",
        "info": "Volume 15: 2007",
        "count": 29,
        "papers": [
            "The selection of instant messaging or e-mail: College students' perspective for computer communication.",
            "Image edge detection: A knowledge management technique for visual scene analysis.",
            "Solvable problems in enterprise digital rights management.",
            "Evaluating the security controls of CAIS in developing countries: An examination of current research.",
            "A strategic modeling technique for information security risk assessment.",
            "Analyzing bloggers data on software design patterns and applications integration; methodology and implementation.",
            "Strategies for successful CRM implementation.",
            "Analysis of security-relevant semantics of BPEL in cross-domain defined business processes.",
            "Evaluating the security controls of CAIS in developing countries: an empirical investigation.",
            "A risk-control framework for e-marketplace participation: the findings of seven cases.",
            "Investigating corporate intranet effectiveness: a conceptual framework.",
            "Precisiated information retrieval for RSS feeds.",
            "Information systems planning practices in Indian public enterprises.",
            "The application of signature recognition to transparent handwriting verification for mobile devices.",
            "Incident response requirements for distributed security information management systems.",
            "Design of a multimedia traffic classifier for Snort.",
            "An analysis of mobile credit card usage intentions.",
            "An empirical study of ERP success evaluations by business and IT managers.",
            "A STOPE model for the investigation of compliance with ISO 17799-2005.",
            "A PRoactive malware identification system based on the computer hygiene principles.",
            "Personalized biometric key using fingerprint biometrics.",
            "Comply! Resistance is futile.",
            "Vendor availability: a key factor for outsourcing in Chilean ICT sector.",
            "How well are information risks being communicated to your computer end-users?",
            "User-centred security applied to the development of a management information system.",
            "Improving protection mechanisms by understanding online risk.",
            "Usable set-up of runtime security policies.",
            "Toward viable information security reporting systems.",
            "On the imbalance of the security problem space and its expected consequences."
        ]
    },
    {
        "name": "IMCS",
        "year": "2006",
        "info": "Volume 14: 2006",
        "count": 29,
        "papers": [
            "The selection of instant messaging or e-mail: College students' perspective for computer communication.",
            "Image edge detection: A knowledge management technique for visual scene analysis.",
            "Solvable problems in enterprise digital rights management.",
            "Evaluating the security controls of CAIS in developing countries: An examination of current research.",
            "A strategic modeling technique for information security risk assessment.",
            "Analyzing bloggers data on software design patterns and applications integration; methodology and implementation.",
            "Strategies for successful CRM implementation.",
            "Analysis of security-relevant semantics of BPEL in cross-domain defined business processes.",
            "Evaluating the security controls of CAIS in developing countries: an empirical investigation.",
            "A risk-control framework for e-marketplace participation: the findings of seven cases.",
            "Investigating corporate intranet effectiveness: a conceptual framework.",
            "Precisiated information retrieval for RSS feeds.",
            "Information systems planning practices in Indian public enterprises.",
            "The application of signature recognition to transparent handwriting verification for mobile devices.",
            "Incident response requirements for distributed security information management systems.",
            "Design of a multimedia traffic classifier for Snort.",
            "An analysis of mobile credit card usage intentions.",
            "An empirical study of ERP success evaluations by business and IT managers.",
            "A STOPE model for the investigation of compliance with ISO 17799-2005.",
            "A PRoactive malware identification system based on the computer hygiene principles.",
            "Personalized biometric key using fingerprint biometrics.",
            "Comply! Resistance is futile.",
            "Vendor availability: a key factor for outsourcing in Chilean ICT sector.",
            "How well are information risks being communicated to your computer end-users?",
            "User-centred security applied to the development of a management information system.",
            "Improving protection mechanisms by understanding online risk.",
            "Usable set-up of runtime security policies.",
            "Toward viable information security reporting systems.",
            "On the imbalance of the security problem space and its expected consequences."
        ]
    },
    {
        "name": "IMCS",
        "year": "2005",
        "info": "Volume 13: 2005",
        "count": 31,
        "papers": [
            "Intelligent authentication, authorization, and administration (I3A).",
            "Information security: management's effect on culture and policy.",
            "Earned value management in a data warehouse project.",
            "Competency based management: a review of systems and approaches.",
            "Scheduled RSS feeds for streaming multimedia to the desktop using RSS enclosures.",
            "A novel watermarking algorithm for resistant geometric attacks using feature points matching.",
            "An empirical study of information security policy on information security elevation in Taiwan.",
            "Distributed database damage assessment paradigm.",
            "Vasa.\">IT governance, architectural competency, and the Vasa.",
            "Laws and regulations affecting information management and frameworks for assessing compliance.",
            "E-supply chain management: an evaluation of current web initiatives.",
            "Practices and problems in managing electronic services using SLAs.",
            "Formulating information systems risk management strategies through cultural theory.",
            "Issue report on business adoption of Microsoft Passport.",
            "Achieving automated intrusion response: a prototype implementation.",
            "Home page usability and credibility: A comparison of the fastest growing companies to the Fortune 30 and the implications to IT governance.",
            "Trust, privacy, and security in electronic business: the case of the GCC countries.",
            "Duty of care involving outsourced payroll.",
            "Defining information systems success in Canada.",
            "Information systems managers' view about outsourcing in Spain.",
            "Inter-organisational intrusion detection using knowledge grid technology.",
            "On security preparations against possible IS threats across industries.",
            "Towards an insider threat prediction specification language.",
            "An information privacy taxonomy for collaborative environments.",
            "A framework for outsourcing IS/IT security services.",
            "Security information management as an outsourced service.",
            "Outsourcing digital signatures: a solution to key management burden.",
            "Information technologies for business continuity: an implementation framework.",
            "IT applications in Kuwaiti financial companies: an analysis.",
            "A modular approach to ERP system selection: A case study.",
            "An exploratory study of the critical factors affecting the acceptability of e-learning in Nigerian universities."
        ]
    },
    {
        "name": "IMCS",
        "year": "2004",
        "info": "Volume 12: 2004",
        "count": 29,
        "papers": [
            "Embedding privacy in IT applications development.",
            "A new two-tiered strategy to intrusion detection.",
            "D-TIFIS: a decision support system for options trading.",
            "Role of trust in e-business success.",
            "Adopting e-commerce Web site operation modes: The current state of large US firms.",
            "From risk analysis to effective security management: towards an automated approach.",
            "Exploring the impacts of P2P networks on the entertainment industry.",
            "A data mining approach to neural network training.",
            "On biometrics-based authentication and identification from a privacy-protection perspective: Deriving privacy-enhancing requirements.",
            "How well are corporate ethics codes and policies applied in the trenches? Key factors and conditions.",
            "Cyberterrorism, computer crime, and reality.",
            "Nature of e-business ethical dilemmas.",
            "A long-term trial of alternative user authentication technologies.",
            "Human resources for information management operations in Kuwaiti corporate companies.",
            "Incorporating WS-Security into a Web services-based portal.",
            "RECOT: an expert system for the reduction of environmental cost in the textile industry.",
            "Exploring the failure and success of DotComs.",
            "An exploration of wireless computing risks: Development of a risk taxonomy.",
            "Enhancing Web privacy and anonymity in the digital era.",
            "Genetic algorithms: A business perspective.",
            "The impact of IT on SMEs in the United States.",
            "A cyclic approach to business continuity planning.",
            "Web technology and supply chain management.",
            "Towards secure sealing of privacy policies.",
            "Reconciling the system requirements process in changing business environments.",
            "Formal definition and implementation of business-oriented SoD access control policy.",
            "Auditing in the e-commerce era.",
            "A global information technology model: business applications in developing economies (case studies).",
            "Frequency- and ordering-based similarity measure for host-based intrusion detection."
        ]
    },
    {
        "name": "IMCS",
        "year": "2003",
        "info": "Volume 11: 2003",
        "count": 30,
        "papers": [
            "Deployment of anti-virus software: a case study.",
            "Application service providers: an application of the transaction cost model.",
            "E-commerce policies and customer privacy.",
            "Information systems professionals and conflict of interest.",
            "Networks security measures using neuro-fuzzy agents.",
            "Customer relationship management (CRM) in business-to-business (B2B) e-commerce.",
            "Integrating fuzzy logic into decision suppport systems: current research and future prospects.",
            "Privacy management - a new era in the Australian business environment.",
            "How to choose an ASP: selection guidelines.",
            "Quantifying the financial impact of IT security breaches.",
            "Security architectures for network clients.",
            "Exploring potential strategic impacts of XML-related technologies.",
            "The application of information security policies in large UK-based organizations: an exploratory investigation.",
            "Enterprise integration with advanced information technologies: ERP and data warehousing.",
            "Stealth tracing: Subliminal Traceroute.",
            "Global e-commerce: a framework for understanding and overcoming the trust barrier.",
            "Using continuous user authentication to detect masqueraders.",
            "A first approach to e-forecasting: a survey of forecasting Web services.",
            "Keystroke dynamics on a mobile handset: a feasibility study.",
            "Implications of ICT for knowledge management in globalization.",
            "Intrusion detection: the art and the practice. Part I.",
            "A novel approach to solve DSL network data rate problems.",
            "Identifying security vulnerabilities through input flow tracing and analysis.",
            "Internet anonymity practices in computer crime.",
            "Decision support through knowledge management: the role of the artificial intelligence.",
            "Intrusion detection: methods and systems. Part II.",
            "Toward strategic use of IT in SMEs: a developing country perspective.",
            "A security risk management approach for e-commerce.",
            "An integrated system theory of information security management.",
            "An XML-based administration method on role-based access control in the enterprise environment."
        ]
    },
    {
        "name": "IMCS",
        "year": "2002",
        "info": "Volume 10: 2002",
        "count": 29,
        "papers": [
            "The utilization of trend analysis in the effective monitoring of information security. Part 2: the model.",
            "Biometric authentication: assuring access to information.",
            "Using business models and revenue streams for digital marketplace success.",
            "Evaluation and selection of an antivirus and content filtering software.",
            "The impact of next generation XML.",
            "IT in manufacturing for performance: the challenge for Thai manufacturers.",
            "A holistic model of computer abuse within organizations.",
            "Application service providers (ASP): moving downstream to enhance competitive advantage.",
            "Auditing disclosure risks of on-line broker-dealers.",
            "Protecting personal privacy on the Internet.",
            "Quality of service - technology and implementation.",
            "An experimental comparison of secret-based user authentication technologies.",
            "Information management of automatic data capture: an overview of technical developments.",
            "The information security management toolbox - taking the pain out of security management.",
            "Identifying risks during information system development: managing the process.",
            "System insecurity - firewalls.",
            "A framework for analyzing e-commerce security.",
            "Private key generation from on-line handwritten signatures.",
            "Knowledge and information management in e-learning environments; the user agent architecture.",
            "Service level agreements in IP networks.",
            "Issues in cybersecurity; understanding the potential risks associated with hackers/crackers.",
            "Developing e-business; a strategic approach.",
            "Steven Furnell: Cybercrime - vandalizing the information society (Review).",
            "An intelligent approach to prevent distributed systems attacks.",
            "Towards maturity of information security maturity criteria: six lessons learned from software maturity criteria.",
            "Information flow analysis on role-based access control model.",
            "Security of personal data across national borders.",
            "Integrating search engines with data mining for customer-oriented information search.",
            "The importance of technology trust in Web services security."
        ]
    },
    {
        "name": "IMCS",
        "year": "2001",
        "info": "Volume 9: 2001",
        "count": 27,
        "papers": [
            "E-commerce Web site design: strategies and models.",
            "Model calculations to estimate the probability of secret reconstruction in computer environments.",
            "Information systems security in the Greek public sector.",
            "Formalizing information security requirements.",
            "Robust intrusion tolerance in information systems.",
            "Building ontologies for production scheduling systems: towards a unified methodology.",
            "Information priority-setting for better resource allocation using analytic hierarchy process (AHP).",
            "A digital seal solution for deploying trust on commercial transactions.",
            "Intranets for organizational innovation.",
            "Controlling corporate e-mail, PC use and computer security.",
            "Security analysers: administrator assistants or hacker helpers?",
            "Attitudes of Australian information system managers against online attackers.",
            "Integrating security design into the software development process for e-commerce systems.",
            "Say goodbye to the CIO, welcome to the business prophet.",
            "A framework for access control in workflow systems.",
            "Mobile computer systems - security considerations.",
            "Revisiting public information management for effective e-government services.",
            "NUMASS: a Web-based nuclear monitoring system.",
            "Privacy and security concerns as major barriers for e-commerce: a survey study.",
            "A new model for monitoring intrusion based on Petri Nets.",
            "Embedding security practices in contemporary information systems development approaches.",
            "Novel biometric digital signatures for Internet-based applications.",
            "Information technology outsourcing in Australia: a literature review.",
            "Domain names management: a strategy for electronic commerce security.",
            "Security and trust management in supply chains.",
            "The utilization of trend analysis in the effective monitoring of information security. Part 1: the concept.",
            "IT outsourcing - managing the key asset."
        ]
    },
    {
        "name": "IMCS",
        "year": "2000",
        "info": "Volume 8: 2000",
        "count": 26,
        "papers": [
            "Distributed component software security issues on deploying a secure electronic marketplace.",
            "Software piracy among academics: an empirical study in Brunei Darussalam.",
            "EDI via the Internet.",
            "A conceptual foundation for organizational information security awareness.",
            "Voice recognition software programs: are they right for you?",
            "The implementation of an electronic survey tool to help determine the information needs of a knowledge-based organization.",
            "A conceptual architecture for real-time intrusion monitoring.",
            "Expert systems in medicine: academic illusion or real power?",
            "Success factors for IS disaster recovery planning in Hong Kong.",
            "New regional community creation through video-based information networks - a case study of regional vitalization through the promotion of information technology in Japan.",
            "Managing legal liability of the Net: a ten step guide for IT managers.",
            "The use of business process modelling in information systems security analysis and design.",
            "Shielding your company against information compromise.",
            "Awareness and challenges of Internet security.",
            "An exploratory inquiry into the perceived effectiveness of a global information system.",
            "Electronic commerce: the information-security challenge.",
            "Issues in the illegal transference of US information technologies.",
            "Smart card technology for deploying a secure information management framework.",
            "Interpreting the adoption and use of EDI in the Portuguese clothing and textile industry.",
            "Critical analysis of different approaches to minimizing user-related faults in information systems security: implications for research and practice.",
            "\"Need-to-know\" principle and fuzzy security clearances modelling.",
            "Security-related concerns with geographic information systems and geographic mapping.",
            "Disaster recovery planning: a strategy for data security.",
            "Towards a \"business-led\" approach to information systems development.",
            "Ethics and information technology use: a survey of US based SMEs.",
            "Issues with information dissemination on global networks."
        ]
    },
    {
        "name": "IMCS",
        "year": "1999",
        "info": "Volume 7: 1999",
        "count": 27,
        "papers": [
            "Strategic use of information technology for increased innovation and performance.",
            "What went wrong? Unsuccessful information technology projects.",
            "Information security management and modelling.",
            "Security considerations in the delivery of Web-based applications: a case study.",
            "Information security management: why standards are important.",
            "Dissecting the \"Hacker Manifesto\".",
            "An introduction to automated intrusion detection approaches.",
            "Digital signatures and the future of documentation.",
            "Step-by-step guideline for designing and documenting the navigation structure of multimedia hypertext systems.",
            "The evolution of certificate model architecture.",
            "The Second Annual Global Information Security Survey.",
            "Security requirements, risks and recommendations for small enterprise and home-office environments.",
            "IT skill retention.",
            "Year 2000 legal and regulatory environment.",
            "Community management support through community-based information networks.",
            "New models for the management of public key infrastructure and root certification authorities.",
            "Managing and controlling computer misuse.",
            "Internet-based business opportunities: buyers beware of scams.",
            "Avoiding securities class actions arising from Y2K issues.",
            "Strategic business applications and new virtual knowledge-based businesses through community-based information networks.",
            "Corporate system security: towards an integrated management approach.",
            "Identifying the proceeds of electronic money fraud.",
            "IT contingency planning: management roles.",
            "Copyright protection in the digital age.",
            "Privacy and security on the Internet: how to secure your personal information and company data.",
            "Towards the integrated monitoring and evaluation system IMES: a real power.",
            "A distributed component framework for integrated network and systems management."
        ]
    },
    {
        "name": "IMCS",
        "year": "1998",
        "info": "Volume 6: 1998",
        "count": 27,
        "papers": [
            "METANET: a five-year Internet strategy.",
            "From client/server to intranet.",
            "Seamless secured transactions.",
            "Business continuity: awareness and training programmes.",
            "Internet-based EDI trust and security.",
            "Rejuvenating the IT supply organization.",
            "Internet computer virus protection policy.",
            "The evaluation and certification of information security against BS 7799.",
            "1997 computer crime and security survey.",
            "The evolution of information technology.",
            "Strategic ignorance: the new competitive high ground.",
            "The role of service level agreements in IT service delivery.",
            "Security pitfalls in cryptographic design.",
            "Database gateway processor risk analysis using fuzzy logic.",
            "Watching systems in action: security at the periphery.",
            "Features and functions overload.",
            "Trust in Web-based electronic commerce security.",
            "Information security awareness: educating your users effectively.",
            "Information security management (1): why information security is so important.",
            "Internet security: a case study of firewall selection.",
            "Accelerating executive development: hey coach ...",
            "Achieving IT success.",
            "Industrial information-weight security models.",
            "Real-time risk analysis using Java concepts.",
            "Some limitations of web of trust models.",
            "Information security management (2): guidelines to the management of information technology security (GMITS).",
            "Information security management (3): the Code of Practice for Information Security Management (BS 7799)."
        ]
    },
    {
        "name": "IMCS",
        "year": "1997",
        "info": "Volume 5: 1997",
        "count": 29,
        "papers": [
            "Is your infrastructure ticking?",
            "There's an entranet in your future.",
            "Managing World Wide Web publications.",
            "Part of the foundation for secure systems: separation of duties policy.",
            "Driving safely on the information superhighway.",
            "Control of the Internet.",
            "Legal implications of doing business on the Internet.",
            "Compassion in World Farming: an imaging and text retrieval case.",
            "Managing the desktop: research findings.",
            "Health informatics blueprint: business needs.",
            "EDI security: a model of EDI risks and associated controls.",
            "A project planning process for business continuity.",
            "A secure password storage policy.",
            "Commercialization of cryptography.",
            "The death of ROI: re-thinking IT value measurement.",
            "Managing information resources and environmental turbulence.",
            "Securely handling staff terminations.",
            "Improving security in computational electronic mail systems.",
            "Government initiatives in information technology security.",
            "Top-down driven architecture design.",
            "KPMG survey: the IT outsourcing decision.",
            "Managing for demonstrably effective IT projects.",
            "Hypertext information security model for organizations.",
            "Business critical messaging.",
            "The golden rules for implementing the balanced business scorecard.",
            "A model for the future of electronic commerce.",
            "Facilitating corporate knowledge: building the data warehouse.",
            "Certificates and trust in electronic commerce.",
            "Internet acceptable usage policy for organizations."
        ]
    },
    {
        "name": "IMCS",
        "year": "1996",
        "info": "Volume 4: 1996",
        "count": 37,
        "papers": [
            "A profile of the information technology executive.",
            "A consensus ranking for information system requirements.",
            "A business approach to effective information technology risk analysis and management.",
            "Information security in business environments.",
            "Extinguishing halons.",
            "Constructing difficult-to-guess passwords.",
            "Knowledge technologies and business alignment.",
            "Commercial security on the Internet.",
            "A computer emergency response team policy.",
            "Corporate policy at Cable & Wireless enhances business efficiency and improves quality of working life.",
            "Mobile secure telephones.",
            "Developing a suitable business continuity planning methodology.",
            "Data security report.",
            "Providing security for Unix networks.",
            "Telework: threats, risks and solutions.",
            "Collaborative computing, groupware and knowledge.",
            "KPMG's UK Computer Security Review 1994.",
            "Getting beyond the dark side of distributed computing.",
            "National (UK) Computer Security Survey 1996.",
            "A policy for sending secret information over communications networks.",
            "An introduction to seismology.",
            "\"Testing the plan is more important than the plan itself\".",
            "Relating information and value disciplines.",
            "The Thornton May Files.",
            "Telecommunications deregulation: an Australian perspective.",
            "Doing business on the Internet: marketing and security aspects.",
            "An integrated approach for system evaluation: study results.",
            "Factors in the selection of a risk assessment method.",
            "The Ernst & Young International Information Security Survey 1995.",
            "Information owners, custodians and users.",
            "The Thornton May Files.",
            "Internet and Intranet: the faces of the wired economy.",
            "Internet marketing practices.",
            "The value brokers: how to measure client/server payback.",
            "Executive information systems in financial institutions: an introduction.",
            "Removal of all unauthorized access paths in production software.",
            "Practical management of programme risk: the case of the National Strategy for Police Information Systems for England and Wales."
        ]
    },
    {
        "name": "IMCS",
        "year": "1995",
        "info": "Volume 3: 1995",
        "count": 31,
        "papers": [
            "Bridging the gaps.",
            "Software Intelligence introduces a new cross-platform, dient/server security solution.",
            "Business interruption insurance: a vital ingredient in your disaster recovery plan.",
            "Simplifying the state and federal computer crime law maze in the USA.",
            "Testing the disaster recovery plan.",
            "Real security for local area networks.",
            "Safeguarding databases: basic concepts revisited.",
            "What if you had a flood in your computer room.",
            "Information privacy.",
            "Data integrity and the Internet: implications for management.",
            "Information security baselines.",
            "Legal control of computer crime in Hong Kong.",
            "Promoting security awareness and commitment.",
            "Security issues in the EDI environment.",
            "The utility of information systems views of CEOs and information system executives.",
            "Managing end-user computing.",
            "Policies, procedures and standards: an approach for implementation.",
            "Business continuity planning and service level agreements.",
            "Establishing an effective continuity strategy.",
            "The interpersonal computer interregnum.",
            "Security environment reviews.",
            "Information security and the Internet.",
            "Protecting availability in complex computer environments.",
            "The Charles Cresson Wood file.",
            "Security and data integrity for LANs and WANs.",
            "Improving IT quality: the basics to boost service and cut costs.",
            "Establishing business strategy with information technology.",
            "Background checks for employees in computer-related positions of trust.",
            "Chief information officer ABCs.",
            "Crisis communication: managing the mass media.",
            "Managing benefits from information technology."
        ]
    },
    {
        "name": "IMCS",
        "year": "1994",
        "info": "Volume 2: 1994",
        "count": 29,
        "papers": [
            "Optimum Information Technology for Socioeconomic Development.",
            "Strategic Information Systems Planning: Its Adoption and Use.",
            "Security in Open and Distributed Systems.",
            "Authentication: A Prominent Issue for Data Communications.",
            "Protection of Electronic Mail and Electronic Messages: Challenges and Solutions.",
            "The Importance of a Network Disaster Recovery Plan.",
            "Information Technology and Innovation: Identifying Critical Innovation Factors.",
            "Computer Usage and Job Satisfaction: An Empirical Exploration.",
            "Information Compilation and Disbursement: Moral, Legal and Ethical Considerations.",
            "Executive Liability for Computer Crime and How to Prevent It.",
            "Quality Information Management: The Way to a Better Company Culture.",
            "The Role of Competitor Information Systems.",
            "To Serve and Protect: Reconciling Information Protection with LAN Environments.",
            "Minimizing Risk in Your Wide Area Network Design.",
            "The Data Network Disaster Recovery Plan: Considerations and Concerns.",
            "Developing a Successful Network Disaster Recovery Plan.",
            "New Initiatives which May Erode Your Privacy: Or George Orwell Was Off by Only a Decade.",
            "EDI Security Issues Can Be Overcome.",
            "A Security Framework for Information Systems Outsourcing.",
            "Establishing Security in a Multi-platform, Multi-vendor Enterprise-wide IT Environment.",
            "Organisational Transformation and Alignment: Misalignment as an Impediment to Progress in Organisational Development.",
            "Censorship on the Information Highway.",
            "Software Auditing Means Better Business.",
            "Security and Network Management: Changes in the Way We Work.",
            "The Information Highway: The Interstate Highway System for Computer Networks.",
            "The Clipper Chip and the Price of Security in America.",
            "Whither Cryptography.",
            "A Study of Information Technology Structure: Firm Ownership and Managerial Characteristics.",
            "Information Search Behaviour during Business Gestation."
        ]
    },
    {
        "name": "IMCS",
        "year": "1993",
        "info": "Volume 1: 1993",
        "count": 27,
        "papers": [
            "A Tool for Information Security Management.",
            "Computing Environment in an Arabian Gulf Country: An Organizational Perspective.",
            "Security Officers' Attitudes to the Use of Shared Logons.",
            "Neural Networks and Expert Systems: New Horizons in Business Finance Applications.",
            "STAR and Economic Regeneration: Some Feedback from Northern Ireland.",
            "A Taxonomy of Executive Information Systems: Let the 4 Cs Penetrate the Fog.",
            "Software Auditing: Effectively Combating the Five Deadly Sins.",
            "Current IS Practices within UK-based Organizations.",
            "The 1992 Profile of Computer Abuse in Australia: Part 2.",
            "Information: The Seventh Management Function?",
            "Business Continuity Planning in a Distributed Downsized Environment.",
            "Does IT Matter When Companies Merge?",
            "The Open Security Architecture.",
            "A Model for Information Security Management.",
            "DataComms 2000: A Strategic Exploration of a Transforming Industry.",
            "Data Integrity and Security: Who's in Charge Here Anyway?",
            "Corporate Security: An Australian Ostrich.",
            "BMS CAT in Action: Electronic/Communications Recovery at the World Trade Centre, New York.",
            "Computer Security as a Liability Control Tool.",
            "Information Loss Rarely Recovered.",
            "Studying Potential Customers: The Applications of Marketing Information Systems in University Recruitment.",
            "Information, Communication and Innovation: Identifying Critical Innovation Factors (CIF).",
            "The Human Genome Project: Promise or Problems?",
            "Legal Aspects of the Human Genome Project: Reflections on the Bilbao Conference.",
            "Risk Analysis: Ten Years On.",
            "Computer Ethics of University Students: An International Exploratory Study.",
            "Dreams Come True with Password Genie."
        ]
    }
]