[
    {
        "year": "2021",
        "name": "24th ISC 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2021",
                "sub_name": "Information Security - 24th International Conference, ISC 2021, Virtual Event, November 10-12, 2021, Proceedings.",
                "count": 21,
                "papers": [
                    "Integer LWE with Non-subgaussian Error and Related Attacks.",
                    "Layering Quantum-Resistance into Classical Digital Signature Algorithms.",
                    "Cryptanalysis of RSA Variants with Primes Sharing Most Significant Bits.",
                    "Cryptanalysis of Two White-Box Implementations of the SM4 Block Cipher.",
                    "A Non-interactive Multi-user Protocol for Private Authorised Query Processing on Genomic Data.",
                    "Bigdata-Facilitated Two-Party Authenticated Key Exchange for IoT.",
                    "Randomized Component Based Secure Secret Reconstruction in Insecure Networks.",
                    "Transparency Order of (n, m)-Functions - Its Further Characterization and Applications.",
                    "Browserprint: an Analysis of the Impact of Browser Features on Fingerprintability and Web Privacy.",
                    "TridentShell: a Covert and Scalable Backdoor Injection Attack on Web Applications.",
                    "Andromeda: Enabling Secure Enclaves for the Android Ecosystem.",
                    "FEX - A Feature Extractor for Real-Time IDS.",
                    "Identifying Malicious DNS Tunnel Tools from DoH Traffic Using Hierarchical Machine Learning Classification.",
                    "Hybroid: Toward Android Malware Detection and Categorization with Program Code and Network Traffic.",
                    "A Novel Behavioural Screenlogger Detection System.",
                    "sf DEVA: Decentralized, Verifiable Secure Aggregation for Privacy-Preserving Learning.",
                    "DVul-WLG: Graph Embedding Network Based on Code Similarity for Cross-Architecture Firmware Vulnerability Detection.",
                    "Detect and Remove Watermark in Deep Neural Networks via Generative Adversarial Networks.",
                    "Targeted Universal Adversarial Perturbations for Automatic Speech Recognition.",
                    "Voxstructor: Voice Reconstruction from Voiceprint.",
                    "Word-Map: Using Community Detection Algorithm to Detect AGDs."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd ISC 2020",
        "info": "Bali, Indonesia",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2020",
                "sub_name": "Information Security - 23rd International Conference, ISC 2020, Bali, Indonesia, December 16-18, 2020, Proceedings.",
                "count": 23,
                "papers": [
                    "Anonymous IBE from Quadratic Residuosity with Fast Encryption.",
                    "Time-Specific Signatures.",
                    "Compatible Certificateless and Identity-Based Cryptosystems for Heterogeneous IoT.",
                    "Public-PEZ Cryptography.",
                    "Two-Server Verifiable Homomorphic Secret Sharing for High-Degree Polynomials.",
                    "Searching for Balanced S-Boxes with High Nonlinearity, Low Differential Uniformity, and Improved DPA-Resistance.",
                    "Integerwise Functional Bootstrapping on TFHE.",
                    "Rotational Cryptanalysis of Salsa Core Function.",
                    "Analyzing the Chain of Trust Model Based on Entity Dependence.",
                    "Evaluation on the Security of Commercial Cloud Container Services.",
                    "Walls Have Ears: Eavesdropping User Behaviors via Graphics-Interrupt-Based Side Channel.",
                    "Why Current Statistical Approaches to Ransomware Detection Fail.",
                    "A Framework for Estimating Privacy Risk Scores of Mobile Apps.",
                    "On the Struggle Bus: A Detailed Security Analysis of the m-tickets App.",
                    "ELD: Adaptive Detection of Malicious Nodes under Mix-Energy-Depleting-Attacks Using Edge Learning in IoT Networks.",
                    "Minimal Rare-Pattern-Based Outlier Detection Method for Data Streams by Considering Anti-monotonic Constraints.",
                    "Towards Transparent Control-Flow Integrity in Safety-Critical Systems.",
                    "BlockVoke - Fast, Blockchain-Based Certificate Revocation for PKIs and the Web of Trust.",
                    "Formalizing Bitcoin Crashes with Universally Composable Security.",
                    "Characterizing Erasable Accounts in Ethereum.",
                    "An Accountable Decryption System Based on Privacy-Preserving Smart Contracts.",
                    "PvP: Profiling Versus Player! Exploiting Gaming Data for Player Recognition.",
                    "Privacy-Preserving Computation of the Earth Mover's Distance."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd ISC 2019",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2019",
                "sub_name": "Information Security - 22nd International Conference, ISC 2019, New York City, NY, USA, September 16-18, 2019, Proceedings.",
                "count": 23,
                "papers": [
                    "IBWH: An Intermittent Block Withholding Attack with Optimal Mining Reward Rate.",
                    "Full Database Reconstruction with Access and Search Pattern Leakage.",
                    "Cube Cryptanalysis of Round-Reduced ACORN.",
                    "Auditable Compressed Storage.",
                    "Decentralized Evaluation of Quadratic Polynomials on Encrypted Data.",
                    "Robust Distributed Pseudorandom Functions for mNP Access Structures.",
                    "Can Today's Machine Learning Pass Image-Based Turing Tests?",
                    "PD-ML-Lite: Private Distributed Machine Learning from Lightweight Cryptography.",
                    "Code-Based Zero Knowledge PRF Arguments.",
                    "On New Zero-Knowledge Proofs for Lattice-Based Group Signatures with Verifier-Local Revocation.",
                    "When the Attacker Knows a Lot: The GAGA Graph Anonymizer.",
                    "Mitigation Techniques for Attacks on 1-Dimensional Databases that Support Range Queries.",
                    "Getting Under Alexa's Umbrella: Infiltration Attacks Against Internet Top Domain Lists.",
                    "Truth in Web Mining: Measuring the Profitability and the Imposed Overheads of Cryptojacking.",
                    "LightSense: A Novel Side Channel for Zero-permission Mobile User Tracking.",
                    "Robust Covert Channels Based on DRAM Power Consumption.",
                    "Barnum: Detecting Document Malware via Control Flow Anomalies in Hardware Traces.",
                    "An Analysis of Malware Trends in Enterprise Networks.",
                    "L(a)ying in (Test)Bed - How Biased Datasets Produce Impractical Results for Actual Malware Families' Classification.",
                    "Automated Reconstruction of Control Logic for Programmable Logic Controller Forensics.",
                    "Secure Stern Signatures in Quantum Random Oracle Model.",
                    "Adding Linkability to Ring Signatures with One-Time Signatures.",
                    "Cryptographic Authentication from the Iris."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st ISC 2018",
        "info": "Guildford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2018",
                "sub_name": "Information Security - 21st International Conference, ISC 2018, Guildford, UK, September 9-12, 2018, Proceedings.",
                "count": 27,
                "papers": [
                    "Relaxed Lattice-Based Signatures with Short Zero-Knowledge Proofs.",
                    "Secure Code Execution: A Generic PUF-Driven System Architecture.",
                    "Lumus: Dynamically Uncovering Evasive Android Applications.",
                    "ICUFuzzer: Fuzzing ICU Library for Exploitable Bugs in Multiple Software.",
                    "How Safe Is Safety Number? A User Study on SIGNAL's Fingerprint and Safety Number Methods for Public Key Verification.",
                    "Speeding up MILP Aided Differential Characteristic Search with Matsui's Strategy.",
                    "Automatic Search for Related-Key Differential Trails in SIMON-like Block Ciphers Based on MILP.",
                    "Linear Cryptanalysis of Reduced-Round Speck with a Heuristic Approach: Automatic Search for Linear Trails.",
                    "Conditional Cube Searching and Applications on Trivium-Variant Ciphers.",
                    "Practical Attacks on Relational Databases Protected via Searchable Encryption.",
                    "A Simple Algorithm for Estimating Distribution Parameters from n n -Dimensional Randomized Binary Responses.",
                    "Enforcing Access Controls for the Cryptographic Cloud Service Invocation Based on Virtual Machine Introspection.",
                    "Multi-authority Fast Data Cloud-Outsourcing for Mobile Devices.",
                    "Hide the Modulus: A Secure Non-Interactive Fully Verifiable Delegation Scheme for Modular Exponentiations via CRT.",
                    "Offline Assisted Group Key Exchange.",
                    "Function-Dependent Commitments for Verifiable Multi-party Computation.",
                    "On Constructing Pairing-Free Identity-Based Encryptions.",
                    "Multi-key Homomorphic Proxy Re-Encryption.",
                    "Verifiable Decryption for Fully Homomorphic Encryption.",
                    "Platform-Independent Secure Blockchain-Based Voting System.",
                    "Privacy in Crowdsourcing: A Systematic Review.",
                    "Anonymous yet Traceable Strong Designated Verifier Signature.",
                    "Strongly Unforgeable Signature Resilient to Polynomially Hard-to-Invert Leakage Under Standard Assumptions.",
                    "A Revocable Group Signature Scheme with Scalability from Simple Assumptions and Its Implementation.",
                    "Fast Flux Service Network Detection via Data Mining on Passive DNS Traffic.",
                    "Beyond Cookie Monster Amnesia: Real World Persistent Online Tracking.",
                    "Cyber-Risks in the Industrial Internet of Things (IIoT): Towards a Method for Continuous Assessment."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th ISC 2017",
        "info": "Ho Chi Minh City, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2017",
                "sub_name": "Information Security - 20th International Conference, ISC 2017, Ho Chi Minh City, Vietnam, November 22-24, 2017, Proceedings.",
                "count": 25,
                "papers": [
                    "Rate-One AE with Security Under RUP.",
                    "An Improved SAT-Based Guess-and-Determine Attack on the Alternating Step Generator.",
                    "Efficient Masking of ARX-Based Block Ciphers Using Carry-Save Addition on Boolean Shares.",
                    "Improved Automatic Search Tool for Related-Key Differential Characteristics on Byte-Oriented Block Ciphers.",
                    "Choosing Parameters for the Subfield Lattice Attack Against Overstretched NTRU.",
                    "Zero-Knowledge Password Policy Check from Lattices.",
                    "Generic Forward-Secure Key Agreement Without Signatures.",
                    "A Constant-Size Signature Scheme with Tighter Reduction from CDH Assumption.",
                    "Homomorphic-Policy Attribute-Based Key Encapsulation Mechanisms.",
                    "Watermarking Public-Key Cryptographic Functionalities and Implementations.",
                    "Contactless Access Control Based on Distance Bounding.",
                    "Improving Gait Cryptosystem Security Using Gray Code Quantization and Linear Discriminant Analysis.",
                    "Low-Level Attacks in Bitcoin Wallets.",
                    "Improving Password Guessing Using Byte Pair Encoding.",
                    "How to Make Information-Flow Analysis Based Defense Ineffective: An ART Behavior-Mask Attack.",
                    "Harvesting Smartphone Privacy Through Enhanced Juice Filming Charging Attacks.",
                    "A Differentially Private Encryption Scheme.",
                    "Droid Mood Swing (DMS): Automatic Security Modes Based on Contexts.",
                    "T-MAC: Protecting Mandatory Access Control System Integrity from Malicious Execution Environment on ARM-Based Mobile Devices.",
                    "Enforcing ACL Access Control on Android Platform.",
                    "Nightingale: Translating Embedded VM Code in x86 Binary Executables.",
                    "Run-Time Verification for Observational Determinism Using Dynamic Program Slicing.",
                    "Automated Analysis of Accountability.",
                    "Visualization of Intrusion Detection Alarms Collected from Multiple Networks.",
                    "Curtain: Keep Your Hosts Away from USB Attacks."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th ISC 2016",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2016",
                "sub_name": "Information Security - 19th International Conference, ISC 2016, Honolulu, HI, USA, September 3-6, 2016, Proceedings.",
                "count": 26,
                "papers": [
                    "Truncated and Multiple Differential Cryptanalysis of Reduced Round Midori128.",
                    "Improved Linear Cryptanalysis of Round-Reduced ARIA.",
                    "Partial Key Exposure Attacks on CRT-RSA: General Improvement for the Exposed Least Significant Bits.",
                    "Cryptanalysis and Improved Construction of a Group Key Agreement for Secure Group Communication.",
                    "Enhanced Correlation Power Analysis by Biasing Power Traces.",
                    "Damaging, Simplifying, and Salvaging p-OMD.",
                    "Blind Password Registration for Two-Server Password Authenticated Key Exchange and Secret Sharing Protocols.",
                    "Chip Authentication for E-Passports: PACE with Chip Authentication Mapping v2.",
                    "AEP-M: Practical Anonymous E-Payment for Mobile Devices Using ARM TrustZone and Divisible E-Cash.",
                    "Universally Composable Two-Server PAKE.",
                    "Yet Another Note on Block Withholding Attack on Bitcoin Mining Pools.",
                    "Cyber Security Risk Assessment of a DDoS Attack.",
                    "Moving Target Defense Against Network Reconnaissance with Software Defined Networking.",
                    "Uni-ARBAC: A Unified Administrative Model for Role-Based Access Control.",
                    "SKALD: A Scalable Architecture for Feature Extraction, Multi-user Analysis, and Real-Time Information Sharing.",
                    "Leveraging Internet Services to Evade Censorship.",
                    "Analyzing Randomized Response Mechanisms Under Differential Privacy.",
                    "Models and Algorithms for Graph Watermarking.",
                    "Policy-Based Implicit Attestation for Microkernel-Based Virtualized Systems.",
                    "Generalized Dynamic Opaque Predicates: A New Control Flow Obfuscation Method.",
                    "A Bayesian Cogntive Approach to Quantifying Software Exploitability Based on Reachability Testing.",
                    "Control Flow Integrity Enforcement with Dynamic Code Optimization.",
                    "Impossibility on the Provable Security of the Fiat-Shamir-Type Signatures in the Non-programmable Random Oracle Model.",
                    "Efficient Functional Encryption for Inner-Product Values with Full-Hiding Security.",
                    "MQSAS - A Multivariate Sequential Aggregate Signature Scheme.",
                    "Cryptanalysis of Multi-Prime \\varPhi -Hiding Assumption."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th ISC 2015",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2015",
                "sub_name": "Information Security - 18th International Conference, ISC 2015, Trondheim, Norway, September 9-11, 2015, Proceedings.",
                "count": 30,
                "papers": [
                    "Black-Box Separations on Fiat-Shamir-Type Signatures in the Non-Programmable Random Oracle Model.",
                    "The Generic Transformation from Standard Signatures to Identity-Based Aggregate Signatures.",
                    "Leveled Strongly-Unforgeable Identity-Based Fully Homomorphic Signatures.",
                    "Graded Signatures.",
                    "Dynamically Provisioning Isolation in Hierarchical Architectures.",
                    "Factors Impacting the Effort Required to Fix Security Vulnerabilities - An Industrial Case Study.",
                    "Software Security Maturity in Public Organisations.",
                    "Extending the Applicability of the Mixed-Integer Programming Technique in Automatic Differential Cryptanalysis.",
                    "Automatic Search for Linear Trails of the SPECK Family.",
                    "From Distinguishers to Key Recovery: Improved Related-Key Attacks on Even-Mansour.",
                    "Oblivious PAKE: Efficient Handling of Password Trials.",
                    "Secure and Efficient Private Set Intersection Cardinality Using Bloom Filter.",
                    "On the Efficiency of Multi-party Contract Signing Protocols.",
                    "On the Provable Security of the Dragonfly Protocol.",
                    "Multipath TCP IDS Evasion and Mitigation.",
                    "Provenance Based Classification Access Policy System Based on Encrypted Search for Cloud Data Storage.",
                    "Multi-user Searchable Encryption in the Cloud.",
                    "CCA Secure PKE with Auxiliary Input Security and Leakage Resiliency.",
                    "General Circuit Realizing Compact Revocable Attribute-Based Encryption from Multilinear Maps.",
                    "Hashing into Jacobi Quartic Curves.",
                    "Two Generic Methods of Analyzing Stream Ciphers.",
                    "Key Recovery Attacks Against NTRU-Based Somewhat Homomorphic Encryption Schemes.",
                    "Bit Error Probability Evaluation of RO PUFs.",
                    "Extracting Robust Keys from NAND Flash Physical Unclonable Functions.",
                    "On Security of a White-Box Implementation of SHARK.",
                    "GPU-Disasm: A GPU-Based X86 Disassembler.",
                    "Reasoning about Privacy Properties of Biometric Systems Architectures in the Presence of Information Leakage.",
                    "Improvement of Multi-bit Information Embedding Algorithm for Palette-Based Images.",
                    "Efficient Ephemeral Elliptic Curve Cryptographic Keys.",
                    "Distributed Parameter Generation for Bilinear Diffie Hellman Exponentiation and Applications."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th ISC 2014",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2014",
                "sub_name": "Information Security - 17th International Conference, ISC 2014, Hong Kong, China, October 12-14, 2014. Proceedings.",
                "count": 36,
                "papers": [
                    "Fully Secure Self-Updatable Encryption in Prime Order Bilinear Groups.",
                    "Related-Key Security for Hybrid Encryption.",
                    "ARBRA: Anonymous Reputation-Based Revocation with Efficient Authentication.",
                    "Attribute-Based Signatures for Circuits from Multilinear Maps.",
                    "PAEQ: Parallelizable Permutation-Based Authenticated Encryption.",
                    "(Pseudo-) Preimage Attacks on Step-Reduced HAS-160 and RIPEMD-160.",
                    "Revised Algorithms for Computing Algebraic Immunity against Algebraic and Fast Algebraic Attacks.",
                    "Obfuscation-Based Non-Black-Box Extraction and Constant-Round Zero-Knowledge Arguments of Knowledge.",
                    "Lightweight Zero-Knowledge Proofs for Crypto-Computing Protocols.",
                    "Efficient Secure and Verifiable Outsourcing of Matrix Multiplications.",
                    "Hybrid Model of Fixed and Floating Point Numbers in Secure Multiparty Computations.",
                    "Exploiting the Floating-Point Computing Power of GPUs for RSA.",
                    "On Formally Bounding Information Leakage by Statistical Estimation.",
                    "Structure Based Data De-Anonymization of Social Networks and Mobility Traces.",
                    "Investigating the Hooking Behavior: A Page-Level Memory Monitoring Method for Live Forensics.",
                    "SystemWall: An Isolated Firewall Using Hardware-Based Memory Introspection.",
                    "Soundsquatting: Uncovering the Use of Homophones in Domain Squatting.",
                    "Reducing User Tracking through Automatic Web Site State Isolations.",
                    "Comprehensive Behavior Profiling for Proactive Android Malware Detection.",
                    "Analyzing Android Browser Apps for file: // Vulnerabilities.",
                    "Expressive and Secure Searchable Encryption in the Public Key Setting.",
                    "Graded Encryption, or How to Play \"Who Wants To Be A Millionaire?\" Distributively.",
                    "Adding Controllable Linkability to Pairing-Based Group Signatures for Free.",
                    "\"To Share or not to Share\" in Client-Side Encrypted Clouds.",
                    "eavesROP: Listening for ROP Payloads in Data Streams.",
                    "Defining Injection Attacks.",
                    "Efficient Attack Forest Construction for Automotive On-board Networks.",
                    "Winnowing Double Structure for Wildcard Query in Payload Attribution.",
                    "An Evaluation of Single Character Frequency-Based Exclusive Signature Matching in Distinct IDS Environments.",
                    "transAD: An Anomaly Detection Network Intrusion Sensor for the Web.",
                    "Using Machine Language Model for Mimimorphic Malware Detection.",
                    "CodeXt: Automatic Extraction of Obfuscated Attack Code from Memory Dump.",
                    "SIACHEN: A Fine-Grained Policy Language for the Mitigation of Cross-Site Scripting Attacks.",
                    "Security Issues in OAuth 2.0 SSO Implementations.",
                    "A Practical Hardware-Assisted Approach to Customize Trusted Boot for Mobile Devices.",
                    "MobiHydra: Pragmatic and Multi-level Plausibly Deniable Encryption Storage for Mobile Devices."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th ISC 2013",
        "info": "Dallas, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2013",
                "sub_name": "Information Security, 16th International Conference, ISC 2013, Dallas, Texas, USA, November 13-15, 2013, Proceedings.",
                "count": 29,
                "papers": [
                    "Integrity Checking of Function Pointers in Kernel Pools via Virtual Machine Introspection.",
                    "Lightweight Attestation and Secure Code Update for Multiple Separated Microkernel Tasks.",
                    "The Security Defect of a Multi-pixel Encoding Method.",
                    "Encrypted Secret Sharing and Analysis by Plaintext Randomization.",
                    "Round-Efficient Private Stable Matching from Additive Homomorphic Encryption.",
                    "Efficient and Fully Secure Forward Secure Ciphertext-Policy Attribute-Based Encryption.",
                    "Reducing Public Key Sizes in Bounded CCA-Secure KEMs with Optimal Ciphertext Length.",
                    "4GMOP: Mopping Malware Initiated SMS Traffic in Mobile Networks.",
                    "Design and Analysis of a Sophisticated Malware Attack Against Smart Grid.",
                    "Multi-round Attacks on Structural Controllability Properties for Non-complete Random Graphs.",
                    "Improved Meet-in-the-Middle Attacks on Round-Reduced ARIA.",
                    "Establishing Equations: The Complexity of Algebraic and Fast Algebraic Attacks Revisited.",
                    "Factoring a Multiprime Modulus N with Random Bits.",
                    "Faster 128-EEA3 and 128-EIA3 Software.",
                    "Merging the Camellia, SMS4 and AES S-Boxes in a Single S-Box with Composite Bases.",
                    "Offline Dictionary Attack on Password Authentication Schemes Using Smart Cards.",
                    "Self-blindable Credential: Towards Anonymous Entity Authentication Upon Resource Constrained Devices.",
                    "Practical and Provably Secure Distance-Bounding.",
                    "On the Viability of CAPTCHAs for use in Telephony Systems: A Usability Field Study.",
                    "Cars, Condoms, and Facebook.",
                    "Achieving Revocable Fine-Grained Cryptographic Access Control over Cloud Data.",
                    "Fine-Grained Access Control for HTML5-Based Mobile Applications in Android.",
                    "CrowdFlow: Efficient Information Flow Security.",
                    "DroidTest: Testing Android Applications for Leakage of Private Information.",
                    "A Dangerous Mix: Large-Scale Analysis of Mixed-Content Websites.",
                    "An Ordered Multisignature Scheme Under the CDH Assumption Without Random Oracles.",
                    "Human Assisted Randomness Generation Using Video Games.",
                    "Security Ranking Among Assumptions Within the Uber Assumption Framework.",
                    "A Secure and Efficient Method for Scalar Multiplication on Supersingular Elliptic Curves over Binary Fields."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th ISC 2012",
        "info": "Passau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2012",
                "sub_name": "Information Security - 15th International Conference, ISC 2012, Passau, Germany, September 19-21, 2012. Proceedings.",
                "count": 24,
                "papers": [
                    "Privacy-Preserving Speaker Authentication.",
                    "Differential Attacks on Reduced RIPEMD-160.",
                    "Revisiting Difficulty Notions for Client Puzzles and DoS Resilience.",
                    "On Optimal Bounds of Small Inverse Problems and Approximate GCD Problems with Higher Degree.",
                    "Strong Authentication with Mobile Phone.",
                    "Measuring SSL Indicators on Mobile Browsers: Extended Life, or End of the Road?",
                    "Domain-Specific Pseudonymous Signatures for the German Identity Card.",
                    "Solutions for the Storage Problem of McEliece Public and Private Keys on Memory-Constrained Platforms.",
                    "100% Connectivity for Location Aware Code Based KPD in Clustered WSN: Merging Blocks.",
                    "Learning Fine-Grained Structured Input for Memory Corruption Detection.",
                    "Dynamic Anomaly Detection for More Trustworthy Outsourced Computation.",
                    "An Empirical Study of Dangerous Behaviors in Firefox Extensions.",
                    "Collaboration-Preserving Authenticated Encryption for Operational Transformation Systems.",
                    "Selective Document Retrieval from Encrypted Database.",
                    "Additively Homomorphic Encryption with a Double Decryption Mechanism, Revisited.",
                    "Secure Hierarchical Identity-Based Identification without Random Oracles.",
                    "Efficient Two-Move Blind Signatures in the Common Reference String Model.",
                    "Compliance Checking for Usage-Constrained Credentials in Trust Negotiation Systems.",
                    "A Quantitative Approach for Inexact Enforcement of Security Policies.",
                    "OSDM: An Organizational Supervised Delegation Model for RBAC.",
                    "GPU-Acceleration of Block Ciphers in the OpenSSL Cryptographic Library.",
                    "A Highly-Efficient Memory-Compression Approach for GPU-Accelerated Virus Signature Matching.",
                    "Intended Actions: Risk Is Conflicting Incentives.",
                    "On the Self-similarity Nature of the Revocation Data."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th ISC 2011",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2011",
                "sub_name": "Information Security, 14th International Conference, ISC 2011, Xi'an, China, October 26-29, 2011. Proceedings.",
                "count": 25,
                "papers": [
                    "Replacement Attacks on Behavior Based Software Birthmark.",
                    "Attacking Traitor Tracing Schemes Using History Recording and Abrupt Decoders.",
                    "How to Find Short RC4 Colliding Key Pairs.",
                    "A Formal Approach to Distance-Bounding RFID Protocols.",
                    "MASHA - Low Cost Authentication with a New Stream Cipher.",
                    "Toward Pairing-Free Certificateless Authenticated Key Exchanges.",
                    "Security Analysis of an RSA Key Generation Algorithm with a Large Private Key.",
                    "Adaptive Secure-Channel Free Public-Key Encryption with Keyword Search Implies Timed Release Encryption.",
                    "The n-Diffie-Hellman Problem and Its Applications.",
                    "RatBot: Anti-enumeration Peer-to-Peer Botnets.",
                    "Detecting Near-Duplicate SPITs in Voice Mailboxes Using Hashes.",
                    "Multi-stage Binary Code Obfuscation Using Improved Virtual Machine.",
                    "Detection and Analysis of Cryptographic Data Inside Software.",
                    "SudoWeb: Minimizing Information Disclosure to Third Parties in Single Sign-on Platforms.",
                    "Hello rootKitty: A Lightweight Invariance-Enforcing Framework.",
                    "Opacity Analysis in Trust Management Systems.",
                    "On the Inference-Proofness of Database Fragmentation Satisfying Confidentiality Constraints.",
                    "Round-Efficient Oblivious Database Manipulation.",
                    "A Privacy-Preserving Join on Outsourced Database.",
                    "APPA: Aggregate Privacy-Preserving Authentication in Vehicular Ad Hoc Networks.",
                    "Assessing Location Privacy in Mobile Communication Networks.",
                    "How Much Is Enough? Choosing ε for Differential Privacy.",
                    "Non-interactive CDH-Based Multisignature Scheme in the Plain Public Key Model with Tighter Security.",
                    "An Efficient Construction of Time-Selective Convertible Undeniable Signatures.",
                    "Efficient Fail-Stop Signatures from the Factoring Assumption."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th ISC 2010",
        "info": "Boca Raton, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2010",
                "sub_name": "Information Security - 13th International Conference, ISC 2010, Boca Raton, FL, USA, October 25-28, 2010, Revised Selected Papers.",
                "count": 36,
                "papers": [
                    "Improved Collision Attacks on the Reduced-Round Grøstl Hash Function.",
                    "Improved Distinguishing Attack on Rabbit.",
                    "Cryptanalysis of the Convex Hull Click Human Identification Protocol.",
                    "An Analysis of DepenDNS.",
                    "Security Reductions of the Second Round SHA-3 Candidates.",
                    "Security Analysis of the Extended Access Control Protocol for Machine Readable Travel Documents.",
                    "Revisiting the Security of the Alred Design.",
                    "Lightweight Anonymous Authentication with TLS and DAA for Embedded Mobile Devices.",
                    "Implicit Authentication through Learning User Behavior.",
                    "Efficient Computationally Private Information Retrieval from Anonymity or Trapdoor Groups.",
                    "Video Streaming Forensic - Content Identification with Traffic Snooping.",
                    "Fair and Privacy-Preserving Multi-party Protocols for Reconciling Ordered Input Sets.",
                    "Enhancing Security and Privacy in Certified Mail Systems Using Trust Domain Separation.",
                    "Privacy-Preserving ECC-Based Grouping Proofs for RFID.",
                    "Artificial Malware Immunization Based on Dynamically Assigned Sense of Self.",
                    "Misleading Malware Similarities Analysis by Automatic Data Structure Obfuscation.",
                    "Crimeware Swindling without Virtual Machines.",
                    "An Architecture for Enforcing JavaScript Randomization in Web2.0 Applications.",
                    "Summary-Invisible Networking: Techniques and Defenses.",
                    "Selective Regular Expression Matching.",
                    "Traceability of Executable Codes Using Neural Networks.",
                    "On Side-Channel Resistant Block Cipher Usage.",
                    "Security Implications of Crosstalk in Switching CMOS Gates.",
                    "On Privacy Leakage through Silence Suppression.",
                    "One-Time Trapdoor One-Way Functions.",
                    "Public Key Encryption Schemes with Bounded CCA Security and Optimal Ciphertext Length Based on the CDH Assumption.",
                    "A Short Signature Scheme from the RSA Family.",
                    "Efficient Message Space Extension for Automorphic Signatures.",
                    "CRePE: Context-Related Policy Enforcement for Android.",
                    "Privilege Escalation Attacks on Android.",
                    "Walk the Walk: Attacking Gait Biometrics by Imitation.",
                    "Efficient Multiplicative Homomorphic E-Voting.",
                    "Double Spending Protection for E-Cash Based on Risk Management.",
                    "Integrating Offline Analysis and Online Protection to Defeat Buffer Overflow Attacks.",
                    "Deciding Recognizability under Dolev-Yao Intruder Model.",
                    "Indifferentiable Security Reconsidered: Role of Scheduling."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th ISC 2009",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2009",
                "sub_name": "Information Security, 12th International Conference, ISC 2009, Pisa, Italy, September 7-9, 2009. Proceedings.",
                "count": 38,
                "papers": [
                    "A New Approach to chi2 Cryptanalysis of Block Ciphers.",
                    "Analysis and Optimization of Cryptographically Generated Addresses.",
                    "Security Analysis of the PACE Key-Agreement Protocol.",
                    "Towards Security Notions for White-Box Cryptography.",
                    "A Calculus to Detect Guessing Attacks.",
                    "Structural Attacks on Two SHA-3 Candidates: Blender-n and DCH-n.",
                    "Meet-in-the-Middle Attacks Using Output Truncation in 3-Pass HAVAL.",
                    "On Free-Start Collisions and Collisions for TIB3.",
                    "Detection of Database Intrusion Using a Two-Stage Fuzzy System.",
                    "Combining Consistency and Confidentiality Requirements in First-Order Databases.",
                    "Cancelable Iris Biometrics Using Block Re-mapping and Image Warping.",
                    "Iris Recognition in Nonideal Situations.",
                    "Efficient Conditional Proxy Re-encryption with Chosen-Ciphertext Security.",
                    "Practical Algebraic Attacks on the Hitag2 Stream Cipher.",
                    "A New Construction of Boolean Functions with Maximum Algebraic Immunity.",
                    "A2M: Access-Assured Mobile Desktop Computing.",
                    "Automated Spyware Collection and Analysis.",
                    "Towards Unifying Vulnerability Information for Attack Graph Construction.",
                    "Traitor Tracing without A Priori Bound on the Coalition Size.",
                    "SISR - A New Model for Epidemic Spreading of Electronic Threats.",
                    "An Efficient Distance Bounding RFID Authentication Protocol: Balancing False-Acceptance Rate and Memory Requirement.",
                    "Robust Authentication Using Physically Unclonable Functions.",
                    "Risks of the CardSpace Protocol.",
                    "Fair E-Cash: Be Compact, Spend Faster.",
                    "On the Security of Identity Based Ring Signcryption Schemes.",
                    "A Storage Efficient Redactable Signature in the Standard Model.",
                    "Generic Construction of Stateful Identity Based Encryption.",
                    "Privacy-Aware Attribute-Based Encryption with User Accountability.",
                    "Hardware-Assisted Application-Level Access Control.",
                    "Towards Trustworthy Delegation in Role-Based Access Control Model.",
                    "Secure Interoperation in Multidomain Environments Employing UCON Policies.",
                    "Specification and Enforcement of Static Separation-of-Duty Policies in Usage Control.",
                    "Nonce Generators and the Nonce Reset Problem.",
                    "MAC Precomputation with Applications to Secure Memory.",
                    "HMAC without the \"Second\" Key.",
                    "Adding Trust to P2P Distribution of Paid Content.",
                    "Peer-to-Peer Architecture for Collaborative Intrusion and Malware Detection on a Large Scale.",
                    "F3ildCrypt: End-to-End Protection of Sensitive Information in Web Services."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th ISC 2008",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2008",
                "sub_name": "Information Security, 11th International Conference, ISC 2008, Taipei, Taiwan, September 15-18, 2008. Proceedings.",
                "count": 33,
                "papers": [
                    "Property-Based TPM Virtualization.",
                    "A Demonstrative Ad Hoc Attestation System.",
                    "Property-Based Attestation without a Trusted Third Party.",
                    "The Reduced Address Space (RAS) for Application Memory Authentication.",
                    "An Efficient PIR Construction Using Trusted Hardware.",
                    "Athos: Efficient Authentication of Outsourced File Systems.",
                    "BotTracer: Execution-Based Bot-Like Malware Detection.",
                    "Towards Automatically Generating Double-Free Vulnerability Signatures Using Petri Nets.",
                    "Distinguishing between FE and DDoS Using Randomness Check.",
                    "Antisocial Networks: Turning a Social Network into a Botnet.",
                    "Compromising Anonymity Using Packet Spinning.",
                    "Behavior-Based Network Access Control: A Proof-of-Concept.",
                    "Path-Based Access Control for Enterprise Networks.",
                    "Cryptanalysis of Rabbit.",
                    "Algebraic Attack on HFE Revisited.",
                    "Revisiting Wiener's Attack - New Weak Keys in RSA.",
                    "Deterministic Constructions of 21-Step Collisions for the SHA-2 Hash Family.",
                    "Proxy Re-signatures in the Standard Model.",
                    "An RSA-Based (t, n) Threshold Proxy Signature Scheme without Any Trusted Combiner.",
                    "Certificate-Based Signature Schemes without Pairings or Random Oracles.",
                    "Improved Impossible Differential Attacks on Large-Block Rijndael.",
                    "A Five-Round Algebraic Property of the Advanced Encryption Standard.",
                    "Vortex: A New Family of One-Way Hash Functions Based on AES Rounds and Carry-Less Multiplication.",
                    "Comparative Evaluation of Rank Correlation Based DPA on an AES Prototype Chip.",
                    "Collisions for RC4-Hash.",
                    "New Applications of Differential Bounds of the SDS Structure.",
                    "HAPADEP: Human-Assisted Pure Audio Device Pairing.",
                    "One-Time Password Access to Any Server without Changing the Server.",
                    "Can \"Something You Know\" Be Saved?.",
                    "New Communication-Efficient Oblivious Transfer Protocols Based on Pairings.",
                    "A New (k, n)-Threshold Secret Sharing Scheme and Its Extension.",
                    "Strong Accumulators from Collision-Resistant Hashing.",
                    "A Novel Audio Steganalysis Based on High-Order Statistics of a Distortion Measure with Hausdorff Distance."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th ISC 2007",
        "info": "Valparaíso, Chile",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2007",
                "sub_name": "Information Security, 10th International Conference, ISC 2007, Valparaíso, Chile, October 9-12, 2007, Proceedings.",
                "count": 28,
                "papers": [
                    "Detecting System Emulators.",
                    "Features vs. Attacks: A Comprehensive Feature Selection Model for Network Based Intrusion Detection Systems.",
                    "E-NIPS: An Event-Based Network Intrusion Prediction System.",
                    "Enabling Fairer Digital Rights Management with Trusted Computing.",
                    "Traitor Tracing with Optimal Transmission Rate.",
                    "The Security of Elastic Block Ciphers Against Key-Recovery Attacks.",
                    "Impossible-Differential Attacks on Large-Block Rijndael.",
                    "High-Speed Pipelined Hardware Architecture for Galois Counter Mode.",
                    "Efficient Committed Oblivious Transfer of Bit Strings.",
                    "An Efficient Certified Email Protocol.",
                    "Revisiting the Security Model for Timed-Release Encryption with Pre-open Capability.",
                    "On the Soundness of Restricted Universal Designated Verifier Signatures and Dedicated Signatures.",
                    "Identity-Based Proxy Re-encryption Without Random Oracles.",
                    "Strongly-Secure Identity-Based Key Agreement and Anonymous Extension.",
                    "Small Private-Exponent Attack on RSA with Primes Sharing Bits.",
                    "Multiple Modular Additions and Crossword Puzzle Attack on NLSv2.",
                    "New Weaknesses in the Keystream Generation Algorithms of the Stream Ciphers TPy and Py.",
                    "Queue Management as a DoS Counter-Measure?",
                    "On the Concept of Software Obfuscation in Computer Security.",
                    "Specifying Imperative Data Obfuscations.",
                    "Token-Controlled Public Key Encryption in the Standard Model.",
                    "Trapdoor Permutation Polynomials of Z/ n Z and Public Key Cryptosystems.",
                    "A Generalization and a Variant of Two Threshold Cryptosystems Based on Factoring.",
                    "Towards a DL-Based Additively Homomorphic Encryption Scheme.",
                    "Differential Properties of Elliptic Curves and Blind Signatures.",
                    "Efficient Quintuple Formulas for Elliptic Curves and Efficient Scalar Multiplication Using Multibase Number Representation.",
                    "Enforcing Confidentiality in Relational Databases by Reducing Inference Control to Access Control.",
                    "Efficient Negative Databases from Cryptographic Hash Functions."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th ISC 2006",
        "info": "Samos Island, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2006",
                "sub_name": "Information Security, 9th International Conference, ISC 2006, Samos Island, Greece, August 30 - September 2, 2006, Proceedings.",
                "count": 38,
                "papers": [
                    "Extending .NET Security to Unmanaged Code.",
                    "Transparent Run-Time Prevention of Format-String Attacks Via Dynamic Taint and Flexible Validation.",
                    "Low Latency Anonymity with Mix Rings.",
                    "Breaking Four Mix-Related Schemes Based on Universal Re-encryption.",
                    "Weak k-Anonymity: A Low-Distortion Model for Protecting Privacy.",
                    "Protecting Data Privacy Through Hard-to-Reverse Negative Databases.",
                    "Related-Key Rectangle Attack on 42-Round SHACAL-2.",
                    "On the Collision Resistance of RIPEMD-160.",
                    "Blind Ring Signatures Secure Under the Chosen-Target-CDH Assumption.",
                    "Multi-party Concurrent Signatures.",
                    "Formal Security Model of Multisignatures.",
                    "Cryptanalysis of Variants of UOV.",
                    "Trivium: A Stream Cipher Construction Inspired by Block Cipher Design Principles.",
                    "Cryptanalysis of the Bluetooth E0 Cipher Using OBDD's.",
                    "A Partial Key Exposure Attack on RSA Using a 2-Dimensional Lattice.",
                    "On the Integration of Public Key Data Encryption and Public Key Encryption with Keyword Search.",
                    "Collusion-Free Policy-Based Encryption.",
                    "Using Multiple Smart Cards for Signing Messages at Malicious Terminals.",
                    "Diverging Keys in Wireless Sensor Networks.",
                    "A Generic Transformation from Symmetric to Asymmetric Broadcast Encryption.",
                    "Transparent Image Encryption Using Progressive JPEG.",
                    "Preserving TCP Connections Across Host Address Changes.",
                    "A Security Architecture for Protecting LAN Interactions.",
                    "Simulation of Internet DDoS Attacks and Defense.",
                    "SNOOZE: Toward a Stateful NetwOrk prOtocol fuzZEr.",
                    "Rights Protection for Data Cubes.",
                    "An Efficient Probabilistic Packet Marking Scheme (NOD-PPM).",
                    "Resistance Analysis to Intruders' Evasion of Detecting Intrusion.",
                    "A Wireless Intrusion Detection System for Secure Clustering and Routing in Ad Hoc Networks.",
                    "Anomaly Intrusion Detection Based on Clustering a Data Stream.",
                    "Robust Reactions to Potential Day-Zero Worms Through Cooperation and Validation.",
                    "An Authentication and Key Exchange Protocol for Secure Credential Services.",
                    "A Non-malleable Group Key Exchange Protocol Robust Against Active Insiders.",
                    "Formalising Receipt-Freeness.",
                    "Enhancing the Security and Efficiency of 3-D Secure.",
                    "Designing and Verifying Core Protocols for Location Privacy.",
                    "Delegation in a Distributed Healthcare Context: A Survey of Current Approaches.",
                    "Managing Information Systems Security: Critical Success Factors and Indicators to Measure Effectiveness."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8th ISC 2005",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2005",
                "sub_name": "Information Security, 8th International Conference, ISC 2005, Singapore, September 20-23, 2005, Proceedings.",
                "count": 38,
                "papers": [
                    "A Dynamic Mechanism for Recovering from Buffer Overflow Attacks.",
                    "SVision: A Network Host-Centered Anomaly Visualization Technique.",
                    "Time-Based Release of Confidential Information in Hierarchical Settings.",
                    "\"Trust Engineering: \" From Requirements to System Design and Maintenance - A Working National Lottery System Experience.",
                    "A Privacy Preserving Rental System.",
                    "Constant Round Dynamic Group Key Agreement.",
                    "A Key Pre-distribution Scheme for Wireless Sensor Networks: Merging Blocks in Combinatorial Design.",
                    "ID-based Multi-party Authenticated Key Agreement Protocols from Multilinear Forms.",
                    "On the Notion of Statistical Security in Simulatability Definitions.",
                    "Certificateless Public Key Encryption Without Pairing.",
                    "Tracing-by-Linking Group Signatures.",
                    "Chaum's Designated Confirmer Signature Revisited.",
                    "gore: Routing-Assisted Defense Against DDoS Attacks.",
                    "IPSec Support in NAT-PT Scenario for IPv6 Transition.",
                    "Hybrid Signcryption Schemes with Outsider Security.",
                    "Analysis and Improvement of a Signcryption Scheme with Key Privacy.",
                    "Efficient and Proactive Threshold Signcryption.",
                    "Error Oracle Attacks on CBC Mode: Is There a Future for CBC Mode Encryption?",
                    "Hardware Architecture and Cost Estimates for Breaking SHA-1.",
                    "On the Security of Tweakable Modes of Operation: TBC and TAE.",
                    "A Non-redundant and Efficient Architecture for Karatsuba-Ofman Algorithm.",
                    "Compatible Ideal Contrast Visual Cryptography Schemes with Reversing.",
                    "An Oblivious Transfer Protocol with Log-Squared Communication.",
                    "Electronic Voting: Starting Over?",
                    "Timed-Release Encryption with Pre-open Capability and Its Application to Certified E-mail System.",
                    "Universally Composable Time-Stamping Schemes with Audit.",
                    "A Multiplicative Homomorphic Sealed-Bid Auction Based on Goldwasser-Micali Encryption.",
                    "Building a Cryptovirus Using Microsoft's Cryptographic API.",
                    "On the Security of the WinRAR Encryption Method.",
                    "Towards Better Software Tamper Resistance.",
                    "Device-Enabled Authorization in the Grey-System.",
                    "Evaluating Access Control Policies Through Model Checking.",
                    "A Cryptographic Solution for General Access Control.",
                    "Integrity Improvements to an RFID Privacy Protection Protocol for Anti-counterfeiting.",
                    "A Formal Definition for Trust in Distributed Systems.",
                    "A Practical Voting Scheme with Receipts.",
                    "New Constructive Approach to Covert Channel Modeling and Channel Capacity Estimation.",
                    "Efficient Modeling of Discrete Events for Anomaly Detection Using Hidden Markov Models."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "7th ISC 2004",
        "info": "Palo Alto, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2004",
                "sub_name": "Information Security, 7th International Conference, ISC 2004, Palo Alto, CA, USA, September 27-29, 2004, Proceedings.",
                "count": 36,
                "papers": [
                    "Practical Authenticated Key Agreement Using Passwords.",
                    "Further Analysis of Password Authenticated Key Exchange Protocol Based on RSA for Imbalanced Wireless Networks.",
                    "Storage-Efficient Stateless Group Key Revocation.",
                    "Low-Level Ideal Signatures and General Integrity Idealization.",
                    "Cryptanalysis of a Verifiably Committed Signature Scheme Based on GPS and RSA.",
                    "How to Break and Repair a Universally Composable Signature Functionality.",
                    "RSA Accumulator Based Broadcast Encryption.",
                    "Chameleon Hashing Without Key Exposure.",
                    "Radix-r Non-Adjacent Form.",
                    "On Related-Key and Collision Attacks: The Case for the IBM 4758 Cryptoprocessor.",
                    "Security Analysis of Two Signcryption Schemes.",
                    "On The Security of Key Derivation Functions.",
                    "Evaluating the Impact of Intrusion Detection Deficiencies on the Cost-Effectiveness of Attack Recovery.",
                    "A Model for the Semantics of Attack Signatures in Misuse Detection Systems.",
                    "Detection of Sniffers in an Ethernet Network.",
                    "Using Greedy Hamiltonian Call Paths to Detect Stack Smashing Attacks.",
                    "Securing DBMS: Characterizing and Detecting Query Floods.",
                    "An XML-Based Approach to Document Flow Verification.",
                    "Model-Checking Access Control Policies.",
                    "A Distributed High Assurance Reference Monitor.",
                    "Using Mediated Identity-Based Cryptography to Support Role-Based Access Control.",
                    "Towards Human Interactive Proofs in the Text-Domain (Using the Problem of Sense-Ambiguity for Security).",
                    "Image Recognition CAPTCHAs.",
                    "A Hierarchical Key-Insulated Signature Scheme in the CA Trust Model.",
                    "Certificate Recommendations to Improve the Robustness of Web of Trust.",
                    "Universally Composable Secure Mobile Agent Computation.",
                    "Re-thinking Security in IP Based Micro-Mobility.",
                    "Shared-Key Signature and Its Application to Anonymous Authentication in Ad Hoc Group.",
                    "Prevent Online Identity Theft - Using Network Smart Cards for Secure Online Transactions.",
                    "Provable Unlinkability Against Traffic Analysis Already After O(log(n)) Steps!",
                    "An Efficient Online Electronic Cash with Unlinkable Exact Payments.",
                    "Modifiable Digital Content Protection in P2P.",
                    "Survey on the Technological Aspects of Digital Rights Management.",
                    "Detecting Software Theft via Whole Program Path Birthmarks.",
                    "Effective Security Requirements Analysis: HAZOP and Use Cases.",
                    "The Obfuscation Executive."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "6th ISC 2003",
        "info": "Bristol, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2003",
                "sub_name": "Information Security, 6th International Conference, ISC 2003, Bristol, UK, October 1-3, 2003, Proceedings.",
                "count": 33,
                "papers": [
                    "Revisiting Software Protection.",
                    "Enabling Shared Audit Data.",
                    "Cryptographically Generated Addresses (CGA).",
                    "Validating and Securing Spontaneous Associations between Wireless Devices.",
                    "Single Sign-On Using Trusted Platforms.",
                    "Easy Verifiable Primitives and Practical Public Key Cryptosystems.",
                    "Reactively Secure Signature Schemes.",
                    "Validating Digital Signatures without TTP's Time-Stamping and Certificate Revocation.",
                    "A Fast Signature Scheme Based on New On-line Computation.",
                    "Distributed RSA Signature Schemes for General Access Structures.",
                    "Divisible Voting Scheme.",
                    "Unconditionally Secure Homomorphic Pre-distributed Bit Commitment and Secure Two-Party Computations.",
                    "The Design and Implementation of Protocol-Based Hidden Key Recovery.",
                    "Intrinsic Limitations of Digital Signatures and How to Cope with Them.",
                    "On the Security of Fair Non-repudiation Protocols.",
                    "Security Analysis of a Password Authenticated Key Exchange Protocol.",
                    "Zero-Value Point Attacks on Elliptic Curve Cryptosystem.",
                    "Cryptanalysis of an Algebraic Privacy Homomorphism.",
                    "Analysis of the Insecurity of ECMQV with Partially Known Nonces.",
                    "Hardware-Focused Performance Comparison for the Standard Block Ciphers AES, Camellia, and Triple-DES.",
                    "A Note on Weak Keys of PES, IDEA, and Some Extended Variants.",
                    "Foundations of Differential Cryptanalysis in Abelian Groups.",
                    "Trust and Authorization in Pervasive B2E Scenarios.",
                    "A Logic Model for Temporal Authorization Delegation with Negation.",
                    "Zero-Distortion Authentication Watermarking.",
                    "Designated Verification of Non-invertible Watermark.",
                    "Proactive Software Tampering Detection.",
                    "Run-Time Support for Detection of Memory Access Violations to Prevent Buffer Overflow Exploits.",
                    "Towards a Business Process-Driven Framework for Security Engineering with the UML.",
                    "Error Correcting and Complexity Aspects of Linear Secret Sharing Schemes.",
                    "Systematic Treatment of Collusion Secure Codes: Security Definitions and Their Relations.",
                    "Short c-Secure Fingerprinting Codes.",
                    "The Role of Arbiters in Asymmetric Authentication Schemes."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th ISC 2002",
        "info": "Sao Paulo, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2002",
                "sub_name": "Information Security, 5th International Conference, ISC 2002 Sao Paulo, Brazil, September 30 - October 2, 2002, Proceedings.",
                "count": 38,
                "papers": [
                    "Real-Time Intruder Tracing through Self-Replication.",
                    "On the Difficulty of Protecting Private Keys in Software.",
                    "Intrusion Detection with Support Vector Machines and Generative Models.",
                    "Small and High-Speed Hardware Architectures for the 3GPP Standard Cipher KASUMI.",
                    "Fast Software Implementations of SC2000.",
                    "Comparative Analysis of the Hardware Implementations of Hash Functions SHA-1 and SHA-512.",
                    "Implementation of Chosen-Ciphertext Attacks against PGP and GnuPG.",
                    "Role-Based Access Control for E-commerce Sea-of-Data Applications.",
                    "An Access Control Model for Tree Data Structures.",
                    "A New Design of Privilege Management Infrastructure for Organizations Using Outsourced PKI.",
                    "Password Authenticated Key Exchange Based on RSA for Imbalanced Wireless Networks.",
                    "Quantifying Privacy Leakage through Answering Database Queries.",
                    "A New Offline Privacy Protecting E-cash System with Revokable Anonymity.",
                    "Receipt-Free Sealed-Bid Auction.",
                    "Exclusion-Freeness in Multi-party Exchange Protocols.",
                    "A Realistic Protocol for Multi-party Certified Electronic Mail.",
                    "A Nyberg-Rueppel Signature for Multiple Messages and Its Batch Verification.",
                    "Comments to the UNCITRAL Model Law on Electronic Signatures.",
                    "An Anonymous Loan System Based on Group Signature Scheme.",
                    "Traceability Schemes for Signed Documents.",
                    "Proofs of Knowledge for Non-monotone Discrete-Log Formulae and Applications.",
                    "Inversion/Division Systolic Architecture for Public-Key Cryptosystems in GF(2m).",
                    "Efficient Bit Serial Multiplication Using Optimal Normal Bases of Type II in GF (2m).",
                    "Conditional Cryptographic Delegation for P2P Data Sharing.",
                    "Certification of Public Keys within an Identity Based System.",
                    "A New Public Key Cryptosystem for Constrained Hardware.",
                    "A Distributed and Computationally Secure Key Distribution Scheme.",
                    "On Optimal Hash Tree Traversal for Interval Time-Stamping.",
                    "An Efficient Dynamic and Distributed Cryptographic Accumulator.",
                    "A Second-Order DPA Attack Breaks a Window-Method Based Countermeasure against Side Channel Attacks.",
                    "Parallelizable Elliptic Curve Point Multiplication Method with Resistance against Side-Channel Attacks.",
                    "Automated Analysis of Some Security Mechanisms of SCEP.",
                    "An Attack on a Protocol for Certified Delivery.",
                    "Oblivious Counter and Majority Protocol.",
                    "Efficient Mental Card Shuffling via Optimised Arbitrary-Sized Benes Permutation Network.",
                    "Fingerprinting Concatenated Codes with Efficient Identification.",
                    "A Provably Secure Additive and Multiplicative Privacy Homomorphism.",
                    "Algorithms for Efficient Simultaneous Elliptic Scalar Multiplication with Reduced Joint Hamming Weight Representation of Scalars."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4th ISC 2001",
        "info": "Malaga, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2001",
                "sub_name": "Information Security, 4th International Conference, ISC 2001, Malaga, Spain, October 1-3, 2001, Proceedings.",
                "count": 37,
                "papers": [
                    "Bounds and Constructions for Unconditionally Secure Distributed Key Distribution Schemes for General Access Structures.",
                    "Privacy Amplification Theorem for Noisy Main Channel.",
                    "Efficient Kerberized Multicast in a Practical Distributed Setting.",
                    "Suitability of a Classical Analysis Method for E-commerce Protocols.",
                    "Hyppocrates.",
                    "Lenient/Strict Batch Verification in Several Groups.",
                    "Absolute Privacy in Voting.",
                    "A Logical Model for Privacy Protection.",
                    "DISSECT: DIStribution for SECurity Tool.",
                    "An Approach to the Obfuscation of Control-Flow of Sequential Computer Programs.",
                    "A Practical and Effective Approach to Large-Scale Automated Linguistic Steganography.",
                    "Robust New Method in Frequency Domain Watermarking.",
                    "On the Complexity of Public-Key Certificate Validation.",
                    "Liability of Certification Authorities: A Juridical Point of View.",
                    "Experimental Testing of the Gigabit IPSec-Compliant Implementations of Rijndael and Triple DES Using SLAAC-1V FPGA Accelerator Board.",
                    "Elliptic Curve Arithmetic Using SIMD.",
                    "On the Hardware Implementation of the 3GPP Confidentiality and Integrity Algorithms.",
                    "Efficient Implementation of Elliptic Curve Cryptosystems on an ARM7 with Hardware Accelerator.",
                    "A Theoretical DPA-Based Cryptanalysis of the NESSIE Candidates FLASH and SFLASH.",
                    "Quadratic Relations for S-Boxes: Their Minimum Representations and Bounds.",
                    "Approximate Power Roots in Zm.",
                    "Securing Elliptic Curve Point Multiplication against Side-Channel Attacks.",
                    "A Flexible Role-Based Access Control Model for Multimedia Medical Image Database Systems.",
                    "A Secure Publishing Service for Digital Libraries of XML Documents.",
                    "An Optimistic Non-repudiation Protocol with Transparent Trusted Third Party.",
                    "Persistent Authenticated Dictionaries and Their Applications.",
                    "Efficient Optimistic N-Party Contract Signing Protocol.",
                    "Efficient Sealed-Bid Auctions for Massive Numbers of Bidders with Lump Comparison.",
                    "Oblivious Image Watermarking Robust against Scaling and Geometric Distortions.",
                    "Fingerprinting Text in Logical Markup Languages.",
                    "SPEED Protocol: Smartcard-Based Payment with Encrypted Electronic Delivery.",
                    "Efficient Transferable Cash with Group Signatures.",
                    "An Auditable Metering Scheme for Web Advertisement Applications.",
                    "Broker-Based Secure Negotiation of Intellectual Property Rights.",
                    "Design of the Decision Support System for Network Security Management to Secure Enterprise Network.",
                    "Measuring False-Positive by Automated Real-Time Correlated Hacking Behavior Analysis.",
                    "Design of UNIX System for the Prevention of Damage Propagation by Intrusion and Its Implementation Based on 4.4BSD."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd ISW 2000",
        "info": "Wollongong, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/2000",
                "sub_name": "Information Security, Third International Workshop, ISW 2000, Wollongong, NSW, Australia, December 20-21, 2000, Proceedings.",
                "count": 23,
                "papers": [
                    "A Watermarking Scheme Based on the Characteristic of Addition among DCT Coefficients.",
                    "Affine Invariant Watermarks for 3D Polygonal and NURBS Based Models.",
                    "A Steganographic Framework for Reference Colour Based Encoding and Cover Image Selection.",
                    "Spatial-Domain Image Watermarking Robust against Compression, Filtering, Cropping, and Scaling.",
                    "Region-Based Watermarking by Distribution Adjustment.",
                    "Hiding Information in Color Images Using Small Color Palettes.",
                    "An Approach to the Objective and Quantitative Evaluation of Tamper-Resistant Software.",
                    "Characteristics of Some Binary Codes for Fingerprinting.",
                    "An Anonymous Aution Protocol with a Single Non-trusted Center Using Binary Trees.",
                    "Unlinkable Divisible Electronic Cash.",
                    "Weighted One-Way Hash Chain and Its Applications.",
                    "Linkability in Practical Electronic Cash Design.",
                    "Towards a Practical Secure Framework for Mobile Code Commerce.",
                    "Probabilistic Methods in Multicast Key Management.",
                    "Classification of Authentication Protocols: A Practical Approach.",
                    "Exploring Fair Exchange Protocols Using Specification Animation.",
                    "A Practical Implementation of Hierarchically Structured Key Predistribution System and Its Evaluation.",
                    "An Efficient Protocol for Certified Electronic Mail.",
                    "Performance Analysis of Secure Web Server Based on SSL.",
                    "Sherlock: Commercial High Assurance Network Computing.",
                    "The Role of the Development Process in Operating System Security.",
                    "Threshold Fail-Stop Signature Schemes Based on Discrete Logarithm and Factorization.",
                    "A Signcryption Scheme Based on Integer Factorization."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2nd ISW 1999",
        "info": "Kuala Lumpur, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/1999",
                "sub_name": "Information Security, Second International Workshop, ISW'99, Kuala Lumpur, Malaysia, November 1999, Proceedings.",
                "count": 23,
                "papers": [
                    "Spending Programs: A Tool for Flexible Micropayments.",
                    "Money Conservation via Atomicity in Fair Off-Line E-Cash.",
                    "Engineering an eCash System.",
                    "Unlinkable Electronic Coupon Protocol with Anonymity Control.",
                    "On the Security of the Lee-Chang Group Signature Scheme and Its Derivatives.",
                    "Security Properties of Software Components.",
                    "Methods for Protecting a Mobile Agent's Route.",
                    "Non-interactive Cryptosystem for Entity Authentication.",
                    "Implementation of Virtual Private Networks at the Transport Layer.",
                    "Performance Evaluation of Certificate Revocation Using k-Valued Hash Tree.",
                    "Active Rebooting Method for Proactivized System: How to Enhance the Security against Latent Virus Attacks.",
                    "Highly Robust Image Watermarking Using Complementary Modulations.",
                    "Region-Based Watermarking for Images.",
                    "Digital Watermarking Robust Against JPEG Compression.",
                    "Fingerprints for Copyright Software Protection.",
                    "A Secrecy Scheme for MPEG Video Data Using the Joint of Compression and Encryption.",
                    "On Anonymous Electronic Cash and Crime.",
                    "On the Difficulty of Key Recovery Systems.",
                    "An Improvement on a Practical Secret Voting Scheme.",
                    "Undeniable Confirmer Signature.",
                    "Extended Proxy Signatures for Smart Cards.",
                    "A New Digital Signature Scheme on ID-Based Key-Sharing Infrastructures.",
                    "Cryptanalysis of Two Group Signature Schemes."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st ISW 1997",
        "info": "Tatsunokuchi, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isw/1997",
                "sub_name": "Information Security, First International Workshop, ISW '97, Tatsunokuchi, Japan, September 17-19, 1997, Proceedings.",
                "count": 31,
                "papers": [
                    "A General Theory of Codes, II: Paradigms and Homomorphisms.",
                    "Improving the Higher Order Differential Attack and Cryptanalysis of the KN Cipher.",
                    "An Optimised Linear Attack on Pseudorandom Generators Using a Non linear Combiner.",
                    "Cryptanalysis of Message Authentication Codes.",
                    "The Least Witness of a Composite Number.",
                    "Fast Algorithm for Finding a Small Root of a Quadratic Modular Equation.",
                    "Modified Finite Automata Public Key Cryptosystem.",
                    "Modified ElGamal Cryptosystem.",
                    "Remarks on Blind Decryption.",
                    "High-Speed Cryptography.",
                    "Secure Applications of Low-Entropy Keys.",
                    "A Key Escrow System of the RSA Cryptosystem.",
                    "A Key Escrow System with Protecting User's Privacy by Blind Decoding.",
                    "Some Recent Research Aspects of Threshold Cryptography.",
                    "A High-Speed Small RSA Encryption LSI with Low Power Dissipation.",
                    "The Case for a Secure Multi-Application Smart Card Operating System.",
                    "An Augmented Family of Cryptographic Parity Circuits.",
                    "A New Byte-Oriented Block Cipher.",
                    "Practice-Oriented Provable-Security.",
                    "A Framework for the Management of Information Security.",
                    "Specifying Security in a Composite System.",
                    "On Rough Sets and Inference Analysis.",
                    "Arbitrated Unconditionally Secure Authentication Scheme with Multi-senders.",
                    "Group Signatures for Hierarchical Multigroups.",
                    "Threshold Proxy Signature Schemes.",
                    "Signcryption and Its Applications in Efficient Public Key Solutions.",
                    "A New Digital Cash Scheme Based on Blind Nyberg-Rueppel Digital Signature.",
                    "An Incremental Payment Method for Internet Based Streaming Real-Time Media.",
                    "A New Identity-Based Key Exchange Protocol Minimizing Computation and Communication.",
                    "The Application of ID-Based Key Distribution Systems to an Elliptic Curve.",
                    "On Reconciliation of Discrepant Sequences Shared through Quantum Mechanical Channels."
                ]
            }
        ]
    }
]