[
    {
        "name": "JCS",
        "year": "2022",
        "info": "Volume 30, 2022",
        "count": 7,
        "papers": [
            "Special issue: Security and Cryptography for Networks - SCN 2020.",
            "Double-authentication-preventing signatures in the standard model.",
            "Efficient protocols for oblivious linear function evaluation from ring-LWE.",
            "Private identity agreement for private set functionalities.",
            "Anonymity and rewards in peer rating systems.",
            "Fast threshold ECDSA with honest majority.",
            "Gradual GRAM and secure computation for RAM programs."
        ]
    },
    {
        "name": "JCS",
        "year": "2021",
        "info": "Volume 29, 2021",
        "count": 20,
        "papers": [
            "Directed adversarial sampling attacks on phishing detection.",
            "A large-scale analysis of HTTPS deployments: Challenges, solutions, and recommendations.",
            "USBCaptchaIn: Preventing (un)conventional attacks from promiscuously used USB devices in industrial control systems.",
            "FWS: Analyzing, maintaining and transcompiling firewalls.",
            "Research perspectives on fully homomorphic encryption models for cloud sector.",
            "A permission-dependent type system for secure information flow analysis.",
            "Publicly auditable conditional blind signatures.",
            "Lattice-based remote user authentication from reusable fuzzy signature.",
            "Resource and timing aspects of security protocols.",
            "A new approach for detecting violation of data plane integrity in Software Defined Networks.",
            "Research perspectives on fully homomorphic encryption models for cloud sector.",
            "Permissive runtime information flow control in the presence of exceptions.",
            "FakeFilter: A cross-distribution Deepfake detection system with domain adaptation.",
            "A comprehensive survey on data provenance: State-of-the-art approaches and their deployments for IoT security enforcement.",
            "Deep learning algorithms for cyber security applications: A survey.",
            "Advances in spam detection for email spam, web spam, social network spam, and review spam: ML-based and nature-inspired-based techniques.",
            "Video interframe forgery detection: Classification, technique & new dataset.",
            "Ballot secrecy: Security definition, sufficient conditions, and analysis of Helios.",
            "Privacy-preserving policy evaluation in multi-party access control.",
            "A graph-based framework for malicious software detection and classification utilizing temporal-graphs."
        ]
    },
    {
        "name": "JCS",
        "year": "2020",
        "info": "Volume 28, 2020",
        "count": 20,
        "papers": [
            "Verification of stateful cryptographic protocols with exclusive OR.",
            "Overfitting, robustness, and malicious algorithms: A study of potential causes of privacy risk in machine learning.",
            "On the semantics of communications when verifying equivalence properties.",
            "On the expressiveness and semantics of information flow types.",
            "Identifying parasitic malware as outliers by code clustering.",
            "RIF: Reactive information flow labels.",
            "Efficient backward private searchable encryption.",
            "Do not jail my app: Detecting the Android plugin environments by time lag contradiction.",
            "Maybe tainted data: Theory and a case study.",
            "Multilayer ransomware detection using grouped registry key operations, file entropy and file signature monitoring.",
            "A multi-party, fine-grained permission and policy enforcement framework for hybrid mobile applications.",
            "Towards adding verifiability to web-based Git repositories.",
            "Synthesizing DNA molecules with identity-based digital signatures to prevent malicious tampering and enabling source attribution.",
            "A new framework for privacy-preserving biometric-based remote user authentication.",
            "DeepReturn: A deep neural network can learn how to detect previously-unseen ROP payloads without using any heuristics.",
            "A formal and automated approach to exploiting multi-stage attacks of web applications.",
            "EQRC: A secure QR code-based E-coupon framework supporting online and offline transactions.",
            "Bucketing and information flow analysis for provable timing attack mitigation.",
            "A systematic review of security threats and countermeasures in SaaS.",
            "Side channel analysis of SPECK."
        ]
    },
    {
        "name": "JCS",
        "year": "2019",
        "info": "Volume 27, 2019",
        "count": 22,
        "papers": [
            "Group ORAM for privacy and access control in outsourced personal records.",
            "A catalogue associating security patterns and attack steps to design secure applications.",
            "Per-session security: Password-based cryptography revisited.",
            "Privacy implications of room climate data.",
            "Verifying constant-time implementations by abstract interpretation.",
            "Learning probabilistic dependencies among events for proactive security auditing in clouds.",
            "Secure authentication in the grid: A formal analysis of DNP3 SAv5.",
            "Sub-session hijacking on the web: Root causes and prevention.",
            "DABKE: Secure deniable attribute-based key exchange framework.",
            "A method for unbounded verification of privacy-type properties.",
            "Last man standing: Static, decremental and dynamic resiliency via controller synthesis.",
            "Collusion attacks and fair time-locked deposits for fast-payment transactions in Bitcoin.",
            "PILOT: Password and PIN information leakage from obfuscated typing videos.",
            "Mitigating the insider threat of remote administrators in clouds through maintenance task assignments.",
            "Analyzing leakage of personal information by malware.",
            "Deploying ABAC policies using RBAC systems.",
            "Using side channel TCP features for real-time detection of malware connections.",
            "Tracking APTs in industrial ecosystems: A proof of concept.",
            "Towards the optimal performance of integrating Warm and Delay against remote cache timing side channels on block ciphers.",
            "How persuasive is a phishing email? A phishing game for phishing awareness.",
            "Decoupling coding habits from functionality for effective binary authorship attribution.",
            "A multi-server oblivious dynamic searchable encryption framework."
        ]
    },
    {
        "name": "JCS",
        "year": "2018",
        "info": "Volume 26, 2018",
        "count": 26,
        "papers": [
            "Substring search over encrypted data.",
            "Characterizing a property-driven obfuscation strategy.",
            "Refining security protocols.",
            "Mining hierarchical temporal roles with multiple metrics.",
            "Enforcing authorizations while protecting access confidentiality.",
            "Sharing-habits based privacy control in social networks.",
            "Reasoning about firewall policies through refinement and composition.",
            "A side-channel attack on smartphones: Deciphering key taps using built-in microphones.",
            "Accessing mobile user's privacy based on IME personalization: Understanding and practical attacks.",
            "Short voice imitation man-in-the-middle attacks on Crypto Phones: Defeating humans and machines.",
            "Low-deterministic security for low-nondeterministic programs.",
            "Automated reasoning for equivalences in the applied pi calculus with barriers.",
            "Automated and efficient analysis of administrative temporal RBAC policies with role hierarchies.",
            "Abstractions for security protocol verification.",
            "Invalid certificates in modern browsers: A socio-technical analysis.",
            "The impact of application context on privacy and performance of keystroke authentication systems.",
            "Assuring BetterTimes.",
            "Identifying stealth malware using CPU power consumption and learning algorithms.",
            "Hybrid adversarial defense: Merging honeypots and traditional security methods.",
            "k-Skyband query answering with differential privacy.",
            "HardIDX: Practical and secure index with SGX in a malicious environment.",
            "Risk-aware multi-objective optimized virtual machine placement in the cloud.",
            "Towards designing robust CAPTCHAs.",
            "Surviving unpatchable vulnerabilities through heterogeneous network hardening options.",
            "Privacy-preserving verifiable elastic net among multiple institutions in the cloud.",
            "Systematic parsing of X.509: Eradicating security issues with a parse tree."
        ]
    },
    {
        "name": "JCS",
        "year": "2017",
        "info": "Volume 25, 2017",
        "count": 20,
        "papers": [
            "From qualitative to quantitative proofs of security properties using first-order conditional logic.",
            "A formal analysis of the Norwegian E-voting protocol.",
            "Designing privacy-preserving interval operations based on homomorphic encryption and secret sharing techniques.",
            "The bi-objective workflow satisfiability problem and workflow resiliency.",
            "Prometheus: Analyzing WebInject-based information stealers.",
            "A secret key establishment protocol for wireless networks using noisy channels.",
            "Strategy analysis for cloud storage reliability management based on game theory.",
            "Diet-ESP: IP layer security for IoT.",
            "On the security and usability of dynamic cognitive game CAPTCHAs.",
            "A study on a feasible no-root approach on Android.",
            "Automatically finding execution scenarios to deploy security-sensitive workflows.",
            "Detecting opinion spammer groups and spam targets through community discovery and sentiment analysis.",
            "Special issue on verified information flow security.",
            "Paragon - Practical programming with information flow control.",
            "Fabric: Building open distributed systems securely by construction.",
            "Hails: Protecting data privacy in untrusted web applications.",
            "An interpolation-based method for the verification of security protocols.",
            "Cryptographic enforcement of information flow policies without public information via tree partitions.",
            "Remote data integrity checking with server-side repair.",
            "Time, computational complexity, and probability in the analysis of distance-bounding protocols."
        ]
    },
    {
        "name": "JCS",
        "year": "2016",
        "info": "Volume 24, 2016",
        "count": 22,
        "papers": [
            "Symbolic universal composability.",
            "Secure multi-execution: Fine-grained, declassification-aware, and transparent.",
            "Mashic compiler: Mashup sandboxing based on inter-frame communication.",
            "Secure outsourced garbled circuit evaluation for mobile devices.",
            "Information-flow security for JavaScript and its APIs.",
            "The user attribution problem and the challenge of persistent surveillance of user activity in complex networks.",
            "Publicly evaluable pseudorandom functions and their applications.",
            "A severity-based quantification of data leakages in database systems.",
            "Efficient integrity checks for join queries in the cloud.",
            "Minimum cost rule enforcement for cooperative database access.",
            "TripleMon: A multi-layer security framework for mediating inter-process communication on Android.",
            "Context-aware security: Linguistic mechanisms and static analysis.",
            "Practical and privacy-preserving information retrieval from a database table.",
            "SQLiDDS: SQL injection detection using document similarity measure.",
            "Information flow analysis for a dynamically typed language with staged metaprogramming.",
            "Automated analysis of security protocols with global state.",
            "Model-checking trace-based information flow properties for infinite-state systems.",
            "Exploring large scale security system reproducibility with the LESS simulator.",
            "Content sharing schemes in DRM systems with enhanced performance and privacy preservation.",
            "A verified information-flow architecture.",
            "Using temporal probabilistic logic for optimal monitoring of security events with limited resources.",
            "Provably secure memory isolation for Linux on ARM."
        ]
    },
    {
        "name": "JCS",
        "year": "2015",
        "info": "Volume 23, 2015",
        "count": 26,
        "papers": [
            "Policy analysis for administrative role based access control without separate administration.",
            "The generalized temporal role mining problem.",
            "Loose associations to increase utility in data publishing.",
            "Anonymizing transactional datasets.",
            "Towards user-oriented RBAC model.",
            "k-jump: A strategy to design publicly-known algorithms for privacy preserving micro-data disclosure.",
            "Accountable wiretapping - or - I know they can hear you now.",
            "What, indeed, is intransitive noninterference?",
            "Practical and provably secure distance-bounding.",
            "Verifying layered security protocols.",
            "Expected loss analysis for authentication in constrained channels.",
            "Proved generation of implementations from computationally secure protocol specifications.",
            "PCPOR: Public and constant-cost proofs of retrievability in cloud.",
            "On the information leakage of differentially-private mechanisms.",
            "Delegated integrity check for hierarchical cloud data.",
            "CookiExt: Patching the browser against session hijacking attacks.",
            "Special issue on security and high performance computing systems.",
            "Design and performance analysis of efficient Keccak tree hashing on GPU architectures.",
            "Service security and privacy as a socio-technical problem.",
            "Brandt's fully private auction protocol revisited.",
            "Measuring and estimating power consumption in Android to support energy-based intrusion detection.",
            "An analysis of graphs that represent a role-based security policy hierarchy.",
            "New access control systems based on outsourced attribute-based encryption.",
            "A formal framework for security analysis of NFC mobile coupon protocols.",
            "Event-driven RBAC.",
            "Probabilistic cost enforcement of security policies."
        ]
    },
    {
        "name": "JCS",
        "year": "2014",
        "info": "Volume 22, 2014",
        "count": 25,
        "papers": [
            "An optimization framework for role mining.",
            "Towards a cryptographic treatment of publish/subscribe systems.",
            "Formal verification of security properties in trust management policy.",
            "Web search query privacy: Evaluating query obfuscation and anonymizing networks.",
            "Foundational aspects of security.",
            "Establishing and preserving protocol security goals.",
            "Effective verification of confidentiality for multi-threaded programs.",
            "Union, intersection and refinement types and reasoning about type disjointness for secure protocol implementations.",
            "EsPRESSO: Efficient privacy-preserving evaluation of sample set similarity.",
            "A game-theoretic analysis of preventing spam over Internet Telephony via audio CAPTCHA-based authentication.",
            "Automated detection of parameter tampering opportunities and vulnerabilities in web applications.",
            "Preface.",
            "Secure multi-execution of web scripts: Theory and practice.",
            "Typed-based verification of Web sandboxes.",
            "Scriptless attacks: Stealing more pie without touching the sill.",
            "Discovering concrete attacks on website authorization by formal analysis.",
            "Obstruction-free authorization enforcement: Aligning security and business objectives.",
            "Modular protections against non-control data attacks.",
            "StatVerif: Verification of stateful processes.",
            "Guiding a general-purpose C verifier to prove cryptographic protocols.",
            "Machine-generated algorithms, proofs and software for the batch verification of digital signature schemes.",
            "CA trust management for the Web PKI.",
            "Security analysis for temporal role based access control.",
            "Preserving user query privacy in cloud-based security services.",
            "Towards a more secure and scalable verifying PKI of eMRTD."
        ]
    },
    {
        "name": "JCS",
        "year": "2013",
        "info": "Volume 21, 2013",
        "count": 28,
        "papers": [
            "Efficient construction of machine-checked symbolic protocol security proofs.",
            "Attacking and fixing Helios: An analysis of ballot secrecy.",
            "Formal specification and management of security policies with collective group obligations.",
            "Neural network Trojan.",
            "Spread Identity: A new dynamic address remapping mechanism for anonymity and DDoS defense.",
            "A systematic approach to practically efficient general two-party secure function evaluation protocols and their modular design.",
            "Optimizing mix-zone coverage in pervasive wireless networks.",
            "Can Jannie verify? Usability of display-equipped RFID tags for security purposes.",
            "Flow stealing: A well-timed redirection attack.",
            "Forcing Johnny to login safely.",
            "Supporting concurrency and multiple indexes in private access to outsourced data.",
            "Dynamic enforcement of knowledge-based security policies using probabilistic abstract interpretation.",
            "Scheduler vulnerabilities and coordinated attacks in cloud computing.",
            "Aggregating vulnerability metrics in enterprise networks using attack graphs.",
            "Special Issue: Advances in Security for Communication Networks.",
            "5PM: Secure pattern matching.",
            "Short blind signatures.",
            "Field switching in BGV-style homomorphic encryption.",
            "A more efficient computationally sound non-interactive zero-knowledge shuffle argument.",
            "Black-box construction of a more than non-malleable CCA1 encryption scheme from plaintext awareness.",
            "Publicly verifiable ciphertexts.",
            "Preface.",
            "Verification of security protocols with lists: From length one to unbounded length.",
            "Provably repairing the ISO/IEC 9798 standard for entity authentication.",
            "Privacy-supporting cloud computing by in-browser key translation.",
            "Verified indifferentiable hashing into elliptic curves.",
            "A core calculus for provenance.",
            "Type-based analysis of key management in PKCS#11 cryptographic devices."
        ]
    },
    {
        "name": "JCS",
        "year": "2012",
        "info": "Volume 20, 2012",
        "count": 23,
        "papers": [
            "Preface.",
            "Quantitative information flow in interactive systems.",
            "Iterative enforcement by suppression: Towards practical enforcement theories.",
            "Modular plans for secure service composition.",
            "Fast automatic security protocol generation.",
            "Towards cost-sensitive assessment of intrusion response selection.",
            "A system for generating and injecting indistinguishable network decoys.",
            "Policy-driven role-based access management for ad-hoc collaboration.",
            "Secure outsourced computation of iris matching.",
            "Preface.",
            "Scalable automated symbolic analysis of administrative role-based access control policies by SMT solving.",
            "Stateful authorization logic - Proof theory and a case study.",
            "Modeling and preventing inferences from sensitive value distributions in data release.",
            "A trust-augmented voting scheme for collaborative privacy management.",
            "Guest Editor's Preface.",
            "An OBDD approach to enforce confidentiality and visibility constraints in data publishing.",
            "Dynamic policy adaptation for inference control of queries to a propositional information system.",
            "Multilevel secure data stream processing: Architecture and implementation.",
            "Secure and efficient distributed linear programming.",
            "Preface.",
            "Required information release.",
            "Information flow in trust management systems.",
            "A game-based definition of coercion resistance and its applications."
        ]
    },
    {
        "name": "JCS",
        "year": "2011",
        "info": "Volume 19, 2011",
        "count": 36,
        "papers": [
            "Automatically deriving information-theoretic bounds for adaptive side-channel attacks.",
            "The impact of information security breaches: Has there been a downward shift in costs?",
            "Security applications of trust in multi-agent systems.",
            "Model-checking trace-based information flow properties.",
            "Authentication protocols based on low-bandwidth unspoofable channels: A comparative survey.",
            "A survey of system security in contactless electronic passports.",
            "Guest editors' preface.",
            "Securing low-cost RFID systems: An unconditionally secure approach.",
            "Practical eavesdropping and skimming attacks on high-frequency RFID tokens.",
            "A framework for analyzing RFID distance bounding protocols.",
            "Practical RFID ownership transfer scheme.",
            "Tree-based HB protocols for privacy-preserving authentication of RFID tags.",
            "Preface.",
            "Shared and searchable encrypted data for untrusted servers.",
            "On the formalization and analysis of a spatio-temporal role-based access control model.",
            "Secure construction and publication of contingency tables from distributed data.",
            "Introduction.",
            "Inference-proof view update transactions with forwarded refreshments.",
            "Selective data outsourcing for enforcing privacy.",
            "Management of security policy configuration using a Semantic Threat Graph approach.",
            "Efficiently enforcing spatiotemporal access control under uncertain location information.",
            "Automatic analysis of malware behavior using machine learning.",
            "Exploiting predictability in click-based graphical passwords.",
            "Leveraging personal devices for stronger password authentication from untrusted computers.",
            "Authorization enforcement in distributed query evaluation.",
            "A profile anonymization model for location-based services.",
            "SPIDER: A platform for managing SIP-based Spam over Internet Telephony (SPIT).",
            "WebCallerID: Leveraging cellular networks for Web authentication.",
            "Searchable symmetric encryption: Improved definitions and efficient constructions.",
            "Exploring privacy versus data quality trade-offs in anonymization techniques using multi-objective optimization.",
            "Analysing TLS in the strand spaces model.",
            "Guest Editor's Preface.",
            "On bounding problems of quantitative information flow.",
            "Using type analysis in compiler to mitigate integer-overflow-to-buffer-overflow threat.",
            "A zero-knowledge based framework for RFID privacy.",
            "User-aided reader revocation in PKI-based RFID systems."
        ]
    },
    {
        "name": "JCS",
        "year": "2010",
        "info": "Volume 18, 2010",
        "count": 40,
        "papers": [
            "Foreword.",
            "JCS special issue on EU-funded ICT research on Trust and Security.",
            "New filtering approaches for phishing email.",
            "Provably correct inline monitoring for multithreaded Java-like programs.",
            "Security of trusted repeater quantum key distribution networks.",
            "Towards automated security policy enforcement in multi-tenant virtual data centers.",
            "Exploiting cryptography for privacy-enhanced access control: A result of the PRIME Project.",
            "Biometric template protection in multimodal authentication systems based on error correcting codes.",
            "Editorial.",
            "Preface.",
            "Risk assessment of security threats for looping constructs.",
            "Detecting and preventing type flaws at static time.",
            "Calibrating the power of schedulers for probabilistic polynomial-time calculus.",
            "Symbolic bisimulation for the applied pi calculus.",
            "e-Passports as a means towards a Globally Interoperable Public Key Infrastructure.",
            "Finding the PKI needles in the Internet haystack.",
            "Constructions of certificate-based signature secure against key replacement attacks.",
            "An efficient signcryption scheme with key privacy and its extension to ring signcryption.",
            "Instant certificate revocation and publication using WebDAV.",
            "Preface.",
            "Identity Federation for VoIP systems.",
            "Assurance for federated identity management.",
            "Constraint differentiation: Search-space reduction for the constraint-based analysis of security protocols.",
            "SecPAL: Design and semantics of a decentralized authorization language.",
            "Analyzing uncertainty in TG protection graphs with TG/MC.",
            "Independence from obfuscation: A semantic framework for diversity.",
            "Adjoining classified and unclassified information by abstract interpretation.",
            "Secure attribute-based systems.",
            "Hierarchies of keys in secure multicast communications.",
            "Static analysis for detecting taint-style vulnerabilities in web applications.",
            "Guessing attacks and the computational soundness of static equivalence.",
            "Editorial.",
            "Verifying resource access control on mobile interactive devices.",
            "Computationally sound analysis of protocols using bilinear pairings.",
            "Inductive trace properties for computational security.",
            "Preface.",
            "Computational soundness of symbolic zero-knowledge proofs.",
            "Hyperproperties.",
            "Formal security analysis of PKCS#11 and proprietary extensions.",
            "Finite models for formal security proofs."
        ]
    },
    {
        "name": "JCS",
        "year": "2009",
        "info": "Volume 17, 2009",
        "count": 29,
        "papers": [
            "Preface.",
            "Evaluating privacy threats in released database views by symmetric indistinguishability.",
            "Privacy-preserving incremental data dissemination.",
            "Information disclosure by answers to XPath queries.",
            "Query assurance verification for outsourced multi-dimensional databases.",
            "Certificate revocation release policies.",
            "Folklore, practice and theory of robust combiners.",
            "Configuring storage-area networks using mandatory security.",
            "Edge-RMP: Minimizing administrative assignments for role-based access control.",
            "Journal of Computer SecuritySpecial Number devoted to the best papers of the Security Track at the 2006 ACM Symposium on Applied Computing.",
            "Applying effective feature selection techniques with hierarchical mixtures of experts for spam classification.",
            "Translation-based steganography.",
            "Reducing errors in the anomaly-based detection of web-based attacks through the combined analysis of web requests and SQL queries.",
            "Address-space layout randomization using code islands.",
            "Automatic verification of correspondences for security protocols.",
            "Verifying privacy-type properties of electronic voting protocols.",
            "Leak-free mediated group signatures.",
            "Introduction.",
            "Declassification: Dimensions and principles.",
            "On declassification and the non-disclosure policy.",
            "Achieving information flow security through monadic control of effects.",
            "Quantifying information flow with beliefs.",
            "Polynomial runtime in simulatability definitions.",
            "Soundness and completeness of formal encryption: The cases of key cycles and partial information leakage.",
            "Planning and verifying service composition.",
            "Automating trusted key rollover in DNSSEC.",
            "Semantics-based code obfuscation by abstract interpretation.",
            "Semantics and logic for security protocols.",
            "A cascade architecture for DoS attacks detection based on the wavelet transform."
        ]
    },
    {
        "name": "JCS",
        "year": "2008",
        "info": "Volume 16, 2008",
        "count": 28,
        "papers": [
            "Synthesising verified access control systems through model checking.",
            "A logical framework for history-based access control and reputation systems.",
            "Guest Editors' Introduction.",
            "Security policy refinement and enforcement for the design of multi-level secure systems.",
            "Privacy policy enforcement in enterprises with identity management solutions.",
            "Approximate autoregressive modeling for network attack detection.",
            "Privacy in video surveilled spaces.",
            "Constraint based role based access control in the SECTET-frameworkA model-driven approach.",
            "Guest Editors' Introduction.",
            "Accelerated AES implementations via generalized instruction set extensions.",
            "On replacing cryptographic keys in hierarchical key management systems.",
            "Coprocessor-based hierarchical trust management for software integrity and digital identity protection.",
            "Protection against unauthorized access and computer crime in Norwegian enterprises.",
            "Guest Editorial.",
            "A privacy-aware access control system.",
            "Notarized federated ID management and authentication.",
            "Implementing interactive analysis of attack graphs using relational databases.",
            "Efficient security policy enforcement for the mobile environment.",
            "Preprocessing for controlled query evaluation with availability policy.",
            "Preface.",
            "Key-dependent message security under active attacks - BRSIM/UC-soundness of Dolev-Yao-style encryption with key cycles.",
            "On the Bayes risk in information-hiding protocols.",
            "A secure compiler for session abstractions.",
            "Securing information flow via dynamic capture of dependencies.",
            "Secrecy for bounded security protocols with freshness check is NEXPTIME-complete.",
            "Exploiting open functionality in SMS-capable cellular networks.",
            "Non-delegatable authorities in capability systems.",
            "Applying effective feature selection techniques with hierarchical mixtures of experts for spam classification."
        ]
    },
    {
        "name": "JCS",
        "year": "2007",
        "info": "Volume 15, 2007",
        "count": 23,
        "papers": [
            "Message from the Guest Editors.",
            "Hermes: A quantitative trust establishment framework for reliable data packet delivery in MANETs.",
            "Securing vehicular ad hoc networks.",
            "SIA: Secure information aggregation in sensor networks.",
            "Detecting IEEE 802.11 MAC layer misbehavior in ad hoc networks: Robust strategies against individual and colluding attackers.",
            "On the security of group communication schemes.",
            "Robust RSA distributed signatures for large-scale long-lived ad hoc networks.",
            "A policy-based methodology for security evaluation: A Security Metric for Public Key Infrastructures.",
            "A theory for comparing the expressive power of access control models.",
            "Prevention of information attacks by run-time detection of self-replication in computer codes.",
            "Analyzing worms and network traffic using compression.",
            "A static analysis for quantifying information flow in a simple imperative language.",
            "Compositional information flow security for concurrent programs.",
            "Parity-based inference control for multi-dimensional range sum queries.",
            "Risk management for distributed authorization.",
            "Preface.",
            "User centricity: A taxonomy and open issues.",
            "Privacy preserving multi-factor authentication with biometrics.",
            "Preface.",
            "Dynamic types for authentication.",
            "Timed analysis of security protocols.",
            "Secure information flow for a concurrent language with scheduling.",
            "Automatic analysis of firewall and network intrusion detection system configurations."
        ]
    },
    {
        "name": "JCS",
        "year": "2006",
        "info": "Volume 14, 2006",
        "count": 23,
        "papers": [
            "A survey of algebraic properties used in cryptographic protocols.",
            "A unified model for unconditionally secure key distribution.",
            "Information flow security in dynamic contexts.",
            "Preface.",
            "Role-based access control for a distributed calculus.",
            "Enforcing Robust Declassification and Qualified Robustness.",
            "On the impossibility of building secure Cliques-type authenticated group key agreement protocols.",
            "Preface.",
            "Secure pseudonym management using mediated identity-based encryption.",
            "Establishing and protecting digital identity in federation systems.",
            "GKMPAN: An Efficient Group Rekeying Scheme for Secure Multicast in Ad-Hoc Networks.",
            "Language based policy analysis in a SPKI Trust Management System.",
            "Effective worm detection for various scan techniques.",
            "Preface.",
            "Public Key Infrastructures: A research agenda.",
            "Life-cycle management of X.509 certificates based on LDAP directories.",
            "Generic non-repudiation protocols supporting transparent off-line TTP.",
            "Unleashing public-key cryptography in wireless sensor networks.",
            "Enforcing provisioning and authorization policy in the Antigone system.",
            "Performing real-time threat assessment of security incidents using data fusion of IDS logs.",
            "Blind Electronic Commerce.",
            "Analysis of probabilistic contract signing.",
            "Improved typings for probabilistic noninterference in a multi-threaded language."
        ]
    },
    {
        "name": "JCS",
        "year": "2005",
        "info": "Volume 13, 2005",
        "count": 29,
        "papers": [
            "Relating multiset rewriting and process algebras for security protocol analysis.",
            "Checking security policies through an enhanced Control Flow Analysis.",
            "Non-interference proof techniques for the analysis of cryptographic protocols.",
            "Verifying information flow goals in Security-Enhanced Linux.",
            "Decidability of context-explicit security protocols.",
            "Reputation-based trust management.",
            "An approach to cooperative updates of XML documents in distributed systems.",
            "An efficient high quality random number generator for multi-programmed systems.",
            "A comparison between strand spaces and multiset rewriting for security protocol analysis.",
            "A decision procedure for the existence of a rank function.",
            "Guest editor's preface.",
            "Static validation of security protocols.",
            "Information flow in secure contexts.",
            "A derivation system and compositional logic for security protocols.",
            "Anonymity and information hiding in multiagent systems.",
            "Symbolic protocol analysis with an Abelian group operator or Diffie-Hellman exponentiation.",
            "A computational analysis of the Needham-Schroeder-(Lowe) protocol.",
            "Secure set intersection cardinality with application to association rule mining.",
            "Specifying and using intrusion masking models to process distributed operations.",
            "A comparative evaluation of two algorithms for Windows Registry Anomaly Detection.",
            "Symbolic protocol analysis with an Abelian group operator or Diffie-Hellman exponentiation.",
            "Guest Editors' preface.",
            "A soft constraint-based approach to the cascade vulnerability problem.",
            "Software watermarking in the frequency domain: Implementation, analysis, and attacks.",
            "RSA-based Verifiable and Recoverable Encryption of Signatures and its application in certified e-mail delivery.",
            "One step ahead to multisensor data fusion for DDoS detection.",
            "Mitigating denial of service attacks: A tutorial.",
            "P5: A protocol for scalable anonymous communication.",
            "Experimental analysis of attacks against intradomain routing protocols."
        ]
    },
    {
        "name": "JCS",
        "year": "2004",
        "info": "Volume 12, 2004",
        "count": 27,
        "papers": [
            "Information Hiding, Anonymity and Privacy: a Modular Approach.",
            "Approximate Non-interference.",
            "Analysing Protocol Subject to Guessing Attacks.",
            "Completeness Theorems for the Abadi-Rogaway Language of Encrypted Expressions.",
            "Reconstructing Trust Management.",
            "Coordinated Internet attacks: responding to attack complexity.",
            "A process-algebraic approach for the analysis of probabilistic noninterference.",
            "Multiset rewriting and the complexity of bounded security protocols.",
            "Model checking SPKI/SDSI.",
            "Probabilistic analysis of an anonymity system.",
            "Embedding agents within the intruder to detect parallel attacks.",
            "Authentication tests and disjoint encryption: A design method for security protocols.",
            "Types and effects for asymmetric cryptographic protocols.",
            "Type-based cryptographic operations.",
            "A formal model of rational exchange and its application to the analysis of Syverson's protocol.",
            "Polynomial liveness.",
            "Defining information flow quantity.",
            "Cardinality-based inference control in data cubes.",
            "Key management for high bandwidth secure multicast.",
            "A group key recovery mechanism based on logical key hierarchy.",
            "Research on automated rollbackability of intrusion response.",
            "Providing process origin information to aid in computer forensic investigations.",
            "Cost effective management frameworks for intrusion detection systems.",
            "Chinese wall security for decentralized workflow management systems.",
            "Flexible authentication of XML documents.",
            "The faithfulness of abstract protocol analysis: Message authentication.",
            "Formal specification and analysis of the Group Domain Of Interpretation Protocol using NPATRL and the NRL Protocol Analyzer."
        ]
    },
    {
        "name": "JCS",
        "year": "2003",
        "info": "Volume 11, 2003",
        "count": 20,
        "papers": [
            "A Comparative Experimental Evaluation Study of Intrusion Detection System Performance in a Gigabit Environment.",
            "Distributed Credential Chain Discovery in Trust Management.",
            "Inductive Verification of Smart Card Protocols.",
            "Secure Composition of Untrusted Code: Box pi, Wrappers, and Causality.",
            "First-order Verification of Cryptographic Protocols.",
            "How to Prevent Type Flaw Attacks on Security Protocols.",
            "Reasoning About Secrecy for Active Networks.",
            "A Game-based Verification of Non-repudiation and Fair Exchange Protocols.",
            "The Economic Cost of Publicly Announced Information Security Breaches: Empirical Evidence from the Stock Market.",
            "Authentic Data Publication Over the Internet.",
            "A Checksum-based Corruption Detection Technique.",
            "Programmable Access Control.",
            "WorkFlow Analyzed for Security and Privacy in Using Databases.",
            "Secure Mediation: Requirements, Design, and Architecture.",
            "Authenticity by Typing for Security Protocols.",
            "Logical Relations for Encryption.",
            "Some Attacks Upon Authenticated Group Key Agreement Protocols.",
            "A Logical Reconstruction of SPKI.",
            "A Unifying Approach to the Security of Distributed and Multi-Threaded Programs.",
            "A Compositional Logic for Proving Security Properties of Protocols."
        ]
    },
    {
        "name": "JCS",
        "year": "2002",
        "info": "Volume 10, 2002",
        "count": 15,
        "papers": [
            "Toward Cost-Sensitive Modeling for Intrusion Detection and Response.",
            "Using Internal Sensors and Embedded Detectors for Intrusion Detection.",
            "STATL: An Attack Language for State-Based Intrusion Detection.",
            "Practical Automated Detection of Stealthy Portscans.",
            "Enhancing Profiles for Anomaly Detection Using Time Granularities.",
            "Panoptis: Intrusion Detection Using a Domain-Specific Language.",
            "An Environment for Security Protocol Intrusion Detection.",
            "Model-Based Analysis of Configuration Vulnerabilities.",
            "Hordes: a Multicast-Based Protocol for Anonymity.",
            "A Uniform Framework for Regulating Service Access and Information Release on the Web.",
            "Eliminating Counterevidence with Applications to Accountable Certificate Management.",
            "Manageable Access Control for CORBA.",
            "Verified Formal Security Models for Multiapplicative Smart Cards.",
            "Checking Secure Interactions of Smart Card Applets: Extended Version.",
            "Using Reflection as a Mechanism for Enforcing Security Policies on Compiled Code."
        ]
    },
    {
        "name": "JCS",
        "year": "2001",
        "info": "Volume 9, 2001",
        "count": 11,
        "papers": [
            "Fault-Preserving Simplifying Transformations for Security Protocols.",
            "Athena: A Novel Approach to Efficient Automatic Security Protocol Analysis.",
            "Process Algebra and Non-Interference.",
            "A Logic for SDSI's Linked Local Name Spaces.",
            "A Cost-Based Framework for Analysis of Denial of Service Networks.",
            "Multilevel Security Transaction Processing.",
            "Relations Between Secrets: Two Formal Analyses of the Yahalom Protocol.",
            "Model Checking Security Properties of Control Flow Graphs.",
            "Global Infrastructure Protection System.",
            "Certificate Chain Discovery in SPKI/SDSI.",
            "Depender Graphs: A Method of Fault-Tolerant Certificate Distribution."
        ]
    },
    {
        "name": "JCS",
        "year": "2000",
        "info": "Volume 8, 2000",
        "count": 12,
        "papers": [
            "A Semantic-Based Execution Model for Multilevel Secure Workflows.",
            "A Ticket-Based Access Control Architecture for Object Systems.",
            "Structured Name-Spaces in Secure Databases.",
            "A Petri Net Based Safety Analysis of Workflow Authorization Models.",
            "Authorization in CORBA Security.",
            "A Logic-Based Approach for Enforcing Access Control.",
            "Side Channel Cryptanalysis of Product Ciphers.",
            "Fixed- vs. Variable-Length Patterns for Detecting Suspicious Process Behavior.",
            "Authentication and Payment in Future Mobile Systems.",
            "Intrusion Confinement by Isolation in Information Systems.",
            "Using Sample Size to Limit Exposure to Data Mining.",
            "Temporal Authorization Bases: From Specification to Integration."
        ]
    },
    {
        "name": "JCS",
        "year": "1999",
        "info": "Volume 7, 1999",
        "count": 10,
        "papers": [
            "Identification of Host Audit Data to Detect Attacks on Low-level IP Vulnerabilities.",
            "NetSTAT: A Network-based Intrusion Detection System.",
            "A Note on the Randomness in Dynamic Threshold Schemes.",
            "Towards a Completeness Result for Model Checking of Security Protocols.",
            "Proving Security Protocols with Model Checkers by Data Independence Techniques.",
            "Strand Spaces: Proving Security Protocols Correct.",
            "Probabilistic Noninterference in a Concurrent Language.",
            "Secure Object Deletion and Garbage Collection in Multilevel Object Bases.",
            "Modeling, Specifying and Implementing Workflow Security in Cyberspace.",
            "Role-based Administration of User-Role Assignment: The URA97 Model and its Oracle Implementation."
        ]
    },
    {
        "name": "JCS",
        "year": "1998",
        "info": "Volume 6, 1998",
        "count": 10,
        "papers": [
            "On SDSI's Linked Local Name Spaces.",
            "Provable Security for Cryptographic Protocols - Exact Analysis and Engineering Applications.",
            "Casper: A Compiler for the Analysis of Security Protocols.",
            "The Inductive Approach to Verifying Cryptographic Protocols.",
            "Human-Computer Cryptography: An Attempt.",
            "Intrusion Detection Using Sequences of System Calls.",
            "A Semantic-Based Transaction Processing Model for Multilevel Transactions.",
            "In Search of Multiple Domain Key Recovery.",
            "Auditable Metering with Lightweight Security.",
            "Enforcing Workflow Authorization Constraints Using Triggers."
        ]
    },
    {
        "name": "JCS",
        "year": "1997",
        "info": "Volume 5, 1997",
        "count": 16,
        "papers": [
            "Merging Heterogeneous Security Orderings.",
            "Threat Scenarios as a Means to Formally Develop Secure Systems.",
            "Digital Payment Systems With Passive Anonymity-Revoking Trustees.",
            "Server-Supported Signatures.",
            "A High-Throughput Secure Reliable Multicast Protocol.",
            "Action Systems for Security Specification.",
            "Authorization Specification and Enforcement in Federated Database Systems.",
            "Strong Authentication and Privacy with Standard Browsers.",
            "Authentication of Sequences with the SL2 Hash Function: Application to Video Sequences.",
            "CWASAR: a European Infrastructure for Secure Electronic Commerce.",
            "Private Web Browsing.",
            "A Network-Centric Design for Relationship-Based Security and Access Control.",
            "Using Digital Credentials on the World Wide Web.",
            "Automated Derivation of Global Authorizations for Database Federations.",
            "Enforcing Mandatory and Discretionary Security in Workflow Management Systems.",
            "Towards a Definitive Paradigm for Security in Object-Oriented Systems and Applications."
        ]
    },
    {
        "name": "JCS",
        "year": "1996",
        "info": "Volume 4, 1996",
        "count": 13,
        "papers": [
            "Implementing Secure Dependencies over a Network by Designing a Distributed Security SubSystem.",
            "Non-interference through Determinism.",
            "A Calculus for Security Bootstrapping in Distributed Systems.",
            "Beacons for Authentication in Distributed Systems.",
            "Robust and Secure Password and Key Change Method.",
            "Detecting Illicit Leakage of Information in Operating Systems.",
            "The Expressive Power of Multi-parent Creation in Monotonic Access Control Models.",
            "A Sound Type System for Secure Flow Analysis.",
            "A Performance Comparison of Five Transaction Processing Algorithms for the SINTRA Replicated-Architecture Database system.",
            "Secure Computer Systems: A Mathematical Model, Volume II.",
            "The Omega Key Management Service.",
            "Securing ATM Networks.",
            "Conspiracy and Information Flow in the Take-Grant Protection Model."
        ]
    },
    {
        "name": "JCS",
        "year": "1995",
        "info": "Volume 3, 1995",
        "count": 14,
        "papers": [
            "A Taxonomy of Security Properties for Process Algebras.",
            "Unwinding Forward Correctability.",
            "A State-Machine Approach to Non-Interference.",
            "The Role of Trust in Information Integrity Protocols.",
            "Concurrency Control in a Secure Database via a Two-Snapshot Algorithm.",
            "Transaction Management for Multilevel Secure Replicated Databases.",
            "A Fast Algorithm for Detecting Second Paths in Database Inference Analysis.",
            "An Extended Authorization Model for Object Databases.",
            "Merging Models: Integrity, Dynamic Separation of Duty, and Trusted Data Management.",
            "Specifying Security for Computer Supported Collaborative Working.",
            "Distributing Trust Amongst Multiple Authentication Servers.",
            "The Composability of Non-Interference.",
            "Theft of Information in the Take-Grant Protection Model.",
            "Multiple Key Distribution Maintaining User Anonymity via Broadcast Channels."
        ]
    },
    {
        "name": "JCS",
        "year": "1993",
        "info": "Volume 2, 1993",
        "count": 17,
        "papers": [
            "Obituary: Fighting for Computer Security - Chris Jahl - in Memoriam.",
            "The BirliX Security Architecture.",
            "Standardising Authentication Protocols Based on Public-Key Techniques.",
            "Laws of Non-Interference in CSP.",
            "Information-Theoretic Bounds for Authentication Frauds.",
            "A Simple and Key-Economical Unconditional Authentication Scheme.",
            "Building an Authentication Service for Distributed Systems.",
            "A Resource Allocation Model for Denial of Service Protection.",
            "Authorizations in Distributed Systems: A New Approach.",
            "On Inter-Realm Authentication in Large Distributed Systems.",
            "A High Assurance Window System Prototype.",
            "Optimality of Asynchronous Two-Party Secure Data-Exchange Protocols.",
            "Towards Operational Measures of Computer Security.",
            "A Kernelized Architecture for Multilevel Secure Object-Oriented Databases Supporting Write-Up.",
            "The Cascade Vulnerability Problem.",
            "Modelling a Fuzzy Time System.",
            "Achieving Stricter Correctness Requirements in Multilevel Secure Database Management Systems."
        ]
    },
    {
        "name": "JCS",
        "year": "1992",
        "info": "Volume 1, 1992",
        "count": 14,
        "papers": [
            "Applying Formal Methods to the Analysis of a Key Management Protocol.",
            "Proving Noninterference and Functional Correctness Using Traces.",
            "Expressive Power of the Schematic Protection Model.",
            "A Logical View of Secure Dependencies.",
            "Towards a Theory of Penetration-Resistant Systems and its Applications.",
            "Aggregation and Separation as Noninterference Properties.",
            "A Unified Model for Security and Integrity in Relational Databases.",
            "An Analysis of Covert Timing Channels.",
            "Reducing Timing Channels with Fuzzy Time.",
            "Toward a Mathematical Foundation for Information.",
            "SPX: Global Authentication Using Public Key Certificates.",
            "Knowledge, Belief, and Semantics in the Analysis of Cryptographic Protocols.",
            "The Extended Schematic Protection Model.",
            "Basic Theorems About Security."
        ]
    }
]