[
    {
        "name": "JISA",
        "year": "2022",
        "info": "2022: Volumes\n64,",
        "count": 16,
        "papers": [
            "A domain-specific language for the specification of UCON policies.",
            "An efficient multimedia compression-encryption scheme using latin squares for securing Internet-of-things networks.",
            "AICrit: A unified framework for real-time anomaly detection in water treatment plants.",
            "Securing emergent behaviour in swarm robotics.",
            "Assessing cyber threats for storyless systems.",
            "A new lattice-based authentication scheme for IoT.",
            "Deep multi-task learning for malware image classification.",
            "How is your Wi-Fi connection today? DoS attacks on WPA3-SAE.",
            "Social network behavior and public opinion manipulation.",
            "Controllable software licensing system for sub-licensing.",
            "DTMIC: Deep transfer learning for malware image classification.",
            "A novel method to generate key-dependent s-boxes with identical algebraic properties.",
            "Multi-level reversible data hiding for crypto-imagery via a block-wise substitution-transposition cipher.",
            "B-DAC: A decentralized access control framework on Northbound interface for securing SDN using blockchain.",
            "ESAR: Enhanced Secure Authentication and Revocation Scheme for Vehicular Ad Hoc Networks.",
            "Secure Blockchain-Internet of Vehicles (B-IoV) Mechanism using DPSO and M-ITA Algorithms."
        ]
    },
    {
        "name": "JISA",
        "year": "2021",
        "info": "2021: Volumes\n56,\n57,\n58,\n59,\n60,\n61,\n62,\n63",
        "count": 226,
        "papers": [
            "Efficient and secure substitution box and random number generators over Mordell elliptic curves.",
            "Detection and mitigation of fraudulent resource consumption attacks in cloud using deep learning approach.",
            "Blockchain and quantum blind signature-based hybrid scheme for healthcare 5.0 applications.",
            "Intelligent operator: Machine learning based decision support and explainer for human operators and service providers in the fog, cloud and edge networks.",
            "Blockchain-empowered cloud architecture based on secret sharing for smart city.",
            "Open code biometric tap pad for smartphones.",
            "NaturalAE: Natural and robust physical adversarial examples for object detectors.",
            "Understanding cybersecurity behavioral habits: Insights from situational support.",
            "Yet another insecure group key distribution scheme using secret sharing.",
            "Weaponized AI for cyber attacks.",
            "Secure memory erasure in the presence of man-in-the-middle attackers.",
            "An efficient biometric-based continuous authentication scheme with HMM prehensile movements modeling.",
            "A lightweight and provable secure identity-based generalized proxy signcryption (IBGPS) scheme for Industrial Internet of Things (IIoT).",
            "Privacy protection for Wi-Fi location positioning systems.",
            "Effective charging identity authentication scheme based on fog computing in V2G networks.",
            "A mutual authentication scheme for establishing secure device-to-device communication sessions in the edge-enabled smart cities.",
            "Robust Lightweight Privacy-Preserving and Session Scheme Interrogation for Fog Computing Systems.",
            "SEA-BREW: A scalable Attribute-Based Encryption revocable scheme for low-bitrate IoT wireless networks.",
            "Lossless fuzzy extractor enabled secure authentication using low entropy noisy sources.",
            "NATICUSdroid: A malware detection framework for Android using native and custom permissions.",
            "Privacy-preserving batch verification signature scheme based on blockchain for Vehicular Ad-Hoc Networks.",
            "An image encryption scheme based on double chaotic cyclic shift and Josephus problem.",
            "Simple and scalable blockchain with privacy.",
            "An Efficient Dual-image Reversible Data Hiding Scheme Based on Exploiting Modification Direction.",
            "CCA secure and efficient proxy re-encryption scheme without bilinear pairing.",
            "A cancelable biometric authentication system based on feature-adaptive random projection.",
            "An enhanced scalable and secure RFID authentication protocol for WBAN within an IoT environment.",
            "Deep belief network-based hybrid model for multimodal biometric system for futuristic security applications.",
            "Designated-ciphertext searchable encryption.",
            "Chaos and compressive sensing based novel image encryption scheme.",
            "ETIP: An Enriched Threat Intelligence Platform for improving OSINT correlation, analysis, visualization and sharing capabilities.",
            "Adversarial attacks on machine learning cybersecurity defences in Industrial Control Systems.",
            "Multi-view deep learning for zero-day Android malware detection.",
            "Enhanced (n, n)-threshold QR code secret sharing scheme based on error correction mechanism.",
            "A novel sophisticated hybrid method for intrusion detection using the artificial immune system.",
            "Design of ideal secret sharing based on new results on representable quadripartite matroids.",
            "Exploiting statistical and structural features for the detection of Domain Generation Algorithms.",
            "Evaluating the cyber security readiness of organizations and its influence on performance.",
            "Software-Defined Network enabled Vehicle to Vehicle secured data transmission protocol in VANETs.",
            "Post-quantum secure multi-party private set-intersection in star network topology.",
            "A lossless self-recovery watermarking scheme with JPEG-LS compression.",
            "An optimized robust watermarking technique using CKGSA in frequency domain.",
            "Android botnet detection using machine learning models based on a comprehensive static analysis approach.",
            "Constructing provable secure broadcast encryption scheme with dealership.",
            "On the transparency order relationships between one Boolean function and its decomposition functions.",
            "Agent architecture of an intelligent medical system based on federated learning and blockchain technology.",
            "Privacy-preserving in smart contracts using blockchain and artificial intelligence for cyber risk measurements.",
            "Detection of malicious Android applications using Ontology-based intelligent model in mobile cloud environment.",
            "NodeXP: NOde.js server-side JavaScript injection vulnerability DEtection and eXPloitation.",
            "Elliptic Curve Cryptography based authentication scheme for Internet of Medical Things.",
            "A party-adaptive variant of LowGear.",
            "Blockchain-based scheme for the mobile number portability.",
            "Energy-efficient dynamic homomorphic security scheme for fog computing in IoT networks.",
            "Provably secure biometric-based client-server secure communication over unreliable networks.",
            "Two hardware implementations for modular multiplication in the AMNS: Sequential and semi-parallel.",
            "Blockchain-Enabled healthcare system for detection of diabetes.",
            "End-to-end secure group communication for the Internet of Things.",
            "Security model for protecting intellectual property of state-of-the-art microfluidic biochips.",
            "Describing correct UAVs cooperation architectures applied on an anti-terrorism scenario.",
            "A secure and efficient group signature scheme based on multivariate public key cryptography.",
            "Multi-level models for data security in networks and in the Internet of things.",
            "Clustering method and symmetric/asymmetric cryptography scheme adapted to securing urban VANET networks.",
            "On the construction of a post-quantum blockchain for smart city.",
            "Efficient data confidentiality scheme for 5G wireless NOMA communications.",
            "A comprehensive review on collision-resistant hash functions on lattices.",
            "NEDetector: Automatically extracting cybersecurity neologisms from hacker forums.",
            "Preserving authentication and availability security services through Multivariate Statistical Network Monitoring.",
            "Cryptanalysis and improvement of a two-factor user authentication scheme for smart home.",
            "Bi-GISIS KE: Modified key exchange protocol with reusable keys for IoT security.",
            "A blockchain based secure communication framework for community interaction.",
            "Blockchain-based searchable encryption with efficient result verification and fair payment.",
            "Multi-party transaction framework for drone services based on alliance blockchain in smart cities.",
            "Distributed secret sharing scheme based on the high-dimensional rotation paraboloid.",
            "Security Scheme Enhancement for Voice over Wireless Networks.",
            "Secure and efficient revocable key-aggregate cryptosystem for multiple non-predefined non-disjoint aggregate sets.",
            "Attack classification of an intrusion detection system using deep learning and hyperparameter optimization.",
            "Deniable search of encrypted cloud-storage data.",
            "Retraction notice to \"A Hybrid Security Strategy (HS2) for Reliable Video Streaming in Fog Computing\" Journal of Information Security and Applications 51 (2020) 102412.",
            "Multi-directional block based PVD and modulus function image steganography to avoid FOBP and IEP.",
            "Dynamic 3D scrambled image based RGB image encryption scheme using hyperchaotic system and DNA encoding.",
            "XGBXSS: An Extreme Gradient Boosting Detection Framework for Cross-Site Scripting Attacks Based on Hybrid Feature Selection Approach and Parameters Optimization.",
            "A fuzzy Dempster-Shafer classifier for detecting Web spams.",
            "On machine learning effectiveness for malware detection in Android OS using static analysis data.",
            "Introduction to the special issue on privacy and security for location-based services and devices.",
            "EASBF: An efficient authentication scheme over blockchain for fog computing-enabled internet of vehicles.",
            "Secure facial recognition in the encrypted domain using a local ternary pattern approach.",
            "Secrecy-ensured NOMA-based cooperative D2D-aided fog computing under imperfect CSI.",
            "ECB2: A novel encryption scheme using face biometrics for signing blockchain transactions.",
            "A secure end-to-end verifiable e-voting system using blockchain and cloud server.",
            "Lightweight fog computing-based authentication protocols using physically unclonable functions for internet of medical things.",
            "Serving while attacked: DDoS attack effect minimization using page separation and container allocation strategy.",
            "Mapping based Residual Convolution Neural Network for Non-embedding and Blind Image Watermarking.",
            "A novel Byzantine fault tolerance consensus for Green IoT with intelligence based on reinforcement.",
            "ME-Box: A reliable method to detect malicious encrypted traffic.",
            "Searchable encryption using secret sharing scheme that realizes direct search of encrypted documents and disjunctive search of multiple keywords.",
            "Secure cloud-of-clouds storage with space-efficient secret sharing.",
            "Malware classification and composition analysis: A survey of recent developments.",
            "A novel hybrid permutation substitution base colored image encryption scheme for multimedia data.",
            "FSDS: A practical and fully secure document similarity search over encrypted data with lightweight client.",
            "A novel multiple color image encryption scheme based on algebra M(2, F2[u]/〈u8〉) and chaotic map.",
            "A secure medical image transmission scheme aided by quantum representation.",
            "A distributed security tomography framework to assess the exposure of ICT infrastructures to network threats.",
            "Development of payload capacity enhanced robust video watermarking scheme based on symmetry of circle using lifting wavelet transform and SURF.",
            "Verifiable and auditable authorizations for smart industries and industrial Internet-of-Things.",
            "Reliable file transfer protocol with producer anonymity for Named Data Networking.",
            "An ensemble classification-based approach to detect attack level of SQL injections.",
            "Optimization and implementation of the number theoretic transform butterfly unit for large integer multiplication.",
            "Bit-wise cryptanalysis on AND-RX permutation Friet-PC.",
            "Secure AAC steganography scheme based on multi-view statistical distortion (SofMvD).",
            "Trust and priority-based drone assisted routing and mobility and service-oriented solution for the internet of vehicles networks.",
            "Denial of wallet - Defining a looming threat to serverless computing.",
            "Scaling & fuzzing:  Personal image privacy from automated attacks in mobile cloud computing.",
            "FUPE: A security driven task scheduling approach for SDN-based IoT-Fog networks.",
            "2D Logistic-Adjusted-Chebyshev map for visual color image encryption.",
            "A generic framework for decomposing block cipher structure with secret components.",
            "Survey of security supervision on blockchain from the perspective of technology.",
            "Attacks on cryptosystems implemented via VLSI: A review.",
            "Event-oriented linkable and traceable anonymous authentication and its application to voting.",
            "Exact greedy algorithm based split finding approach for intrusion detection in fog-enabled IoT environment.",
            "Collusion resistant secret sharing scheme for secure data storage and processing over cloud.",
            "Identity-based outsider anonymous cloud data outsourcing with simultaneous individual transmission for IoT environment.",
            "Fast hybrid-MixNet for security and privacy using NTRU algorithm.",
            "Adversarial attacks by attaching noise markers on the face against deep face recognition.",
            "A PE header-based method for malware detection using clustering and deep embedding techniques.",
            "Cyberprotection in IoT environments: A dynamic rule-based solution to defend smart devices.",
            "Low-rate DoS attack detection method based on hybrid deep neural networks.",
            "Dynamic threshold ECDSA signature and application to asset custody in blockchain.",
            "Bottom-boosting differential evolution based digital image security analysis.",
            "A novel image encryption scheme based on non-adjacent parallelable permutation and dynamic DNA-level two-way diffusion.",
            "A privacy protection scheme for telemedicine diagnosis based on double blockchain.",
            "Preventing malicious communication using virtualization.",
            "StealthPDF: Data hiding method for PDF file with no visual degradation.",
            "Crook-sourced intrusion detection as a service.",
            "Flaw and amendment of a two-party authenticated key agreement protocol for post-quantum environments.",
            "Guidelines for GDPR compliance in Big Data systems.",
            "Towards an ultra lightweight block ciphers for Internet of Things.",
            "A two-phase gradient based feature embedding approach.",
            "A novel wide & deep transfer learning stacked GRU framework for network intrusion detection.",
            "PUF enable lightweight key-exchange and mutual authentication protocol for multi-server based D2D communication.",
            "Dynamic secure multi-keyword ranked search over encrypted cloud data.",
            "Simulating SQL injection vulnerability exploitation using Q-learning reinforcement learning agents.",
            "CL-ASS: An efficient and low-cost certificateless aggregate signature scheme for wireless sensor networks.",
            "High throughput novel architectures of TEA family for high speed IoT and RFID applications.",
            "Secure mobile internet voting system using biometric authentication and wavelet based AES.",
            "Intragroup and intergroup secret image sharing based on homomorphic Lagrange interpolation.",
            "I-CIFA: An improved collusive interest flooding attack in named data networking.",
            "TRAK-CPABE: A novel Traceable, Revocable and Accountable Ciphertext-Policy Attribute-Based Encryption scheme in cloud computing.",
            "Analysis and enhancement of secure three-factor user authentication using Chebyshev Chaotic Map.",
            "Stakeholder perspectives and requirements on cybersecurity in Europe.",
            "Corrigendum to Fast hybrid-MixNet for security and privacy using NTRU algorithm: [Journal of Information Security and Applications, Volume 60, August 2021, Start page-End page/102872].",
            "IESCA: An efficient image encryption scheme using 2-D cellular automata.",
            "[email protected] Intelligent technical support scam detection system.",
            "Attention based multi-agent intrusion detection systems using reinforcement learning.",
            "Lic-Sec: An enhanced AppArmor Docker security profile generator.",
            "Special issue on risk and security of smart systems.",
            "Bounded opacity for timed systems.",
            "PSCPAC: Post-quantum secure certificateless public auditing scheme in cloud storage.",
            "A provably secure content distribution framework for portable DRM systems.",
            "Android mobile malware detection using fuzzy AHP.",
            "4D mixed chaotic system and its application to RGB image encryption using substitution-diffusion.",
            "SEPS: Efficient public-key based secure search over outsourced data.",
            "Fast3DS: A real-time full-convolutional malicious domain name detection system.",
            "Investigating the impact of ransomware splash screens.",
            "RON-enhanced blockchain propagation mechanism for edge-enabled smart cities.",
            "Blockchain for edge-enabled smart cities applications.",
            "Multicast DIS attack mitigation in RPL-based IoT-LLNs.",
            "Machine Learning and Software Defined Network to secure communications in a swarm of drones.",
            "Image data security using Quasigroup combined with Fibonacci Q-transformation.",
            "Toward securing the control plane of 5G mobile networks against DoS threats: Attack scenarios and promising solutions.",
            "A memristive RLC oscillator dynamics applied to image encryption.",
            "Data cryptography in the Internet of Things using the artificial bee colony algorithm in a smart irrigation system.",
            "Efficient defense strategy against spam and phishing email: An evolutionary game model.",
            "Neural networks based domain name generation.",
            "Privacy preservation in Distributed Deep Learning: A survey on Distributed Deep Learning, privacy preservation techniques used and interesting research directions.",
            "An improved convolution Merkle tree-based blockchain electronic medical record secure storage scheme.",
            "Function-level obfuscation detection method based on Graph Convolutional Networks.",
            "A study on priming methods for graphical passwords.",
            "An efficient perturbation approach for multivariate data in sensitive and reliable data mining.",
            "Pencil shell matrix based image steganography with elevated embedding capacity.",
            "SeizeMaliciousURL: A novel learning approach to detect malicious URLs.",
            "Distilling blockchain requirements for digital investigation platforms.",
            "Blockchain-based decentralized architecture for cloud storage system.",
            "Implementation and evaluation of a privacy-preserving distributed ABC scheme based on multi-signatures.",
            "A (k, n) secret document sharing with meaningful shares.",
            "Graph based secure cancelable palm vein biometrics.",
            "A new NFC mobile payment protocol using improved GSM based authentication.",
            "Does the layout of the Android unlock pattern affect the security and usability of the password?",
            "Double layered Fridrich structure to conserve medical data privacy using quantum cryptosystem.",
            "Secure encryption key management as a SecaaS based on Chinese wall security policy.",
            "An efficient mutual authentication and privacy prevention scheme for e-healthcare monitoring.",
            "SocialGuard: An adversarial example based privacy-preserving technique for social images.",
            "A lightweight certificateless authentication scheme and group key agreement with dynamic updating mechanism for LTE-V-based internet of vehicles in smart cities.",
            "Permission-based Android malware analysis by using dimension reduction with PCA and LDA.",
            "A consortium blockchain based energy trading scheme for Electric Vehicles in smart cities.",
            "Anomaly detection in a forensic timeline with deep autoencoders.",
            "Practical dynamic group signature with efficient concurrent joins and batch verifications.",
            "Spread-Transform Dither Modulation Watermarking of Deep Neural Network.",
            "Security of multiple RGB images in the time domain and frequency domain.",
            "Anonymous and lightweight secure authentication protocol for mobile Agent system.",
            "KAPRE: Key-aggregate proxy re-encryption for secure and flexible data sharing in cloud storage.",
            "Image compression-encryption scheme using SPIHT and chaotic systems.",
            "ElearnChain: A privacy-preserving consortium blockchain system for e-learning educational records.",
            "Privacy preservation and secure data sharing scheme in fog based vehicular ad-hoc network.",
            "A real-time related key attack on the WG-16 stream cipher for securing 4G-LTE networks.",
            "Provably secure and biometric-based secure access of e-Governance services using mobile devices.",
            "ADVICE: Towards adaptive scheduling for data collection and DDoS detection in SDN.",
            "BASECASS: A methodology for CAPTCHAs security assurance.",
            "A novel key and image concealing with static-dynamic pattern using modified periodic table.",
            "My data, my control: A secure data sharing and access scheme over blockchain.",
            "Log pseudonymization: Privacy maintenance in practice.",
            "A secure cross-domain authentication scheme with perfect forward security and complete anonymity in fog computing.",
            "DistriTrust: Distributed and low-latency access validation in zero-trust architecture.",
            "Lightweight capability-token for consent-based authentication protocol for smart sensor nodes.",
            "NyaYa: Blockchain-based electronic law record management scheme for judicial investigations.",
            "PB-3PAKA: Password-based three-party authenticated key agreement protocol for mobile devices in post-quantum environments.",
            "ECQV-IBI: Identity-based identification with implicit certification.",
            "A multiclass hybrid approach to estimating software vulnerability vectors and severity score.",
            "UNI-CAPTCHA: A Novel Robust and Dynamic User-Non-Interaction CAPTCHA Model Based on Hybrid biLSTM+Softmax.",
            "Efficient data hiding method for videos based on adaptive inverted LSB332 and secure frame selection with enhanced Vigenere cipher.",
            "Two-dimensional diagonal layer hash chain based key pre-distribution scheme.",
            "Secure high payload steganography: A model-based approach.",
            "An intrusion tolerant identity provider with user attributes confidentiality.",
            "Fusing hypergraph spectral features for shilling attack detection.",
            "Prevention and detection of FDIA on power-network protection scheme using multiple support set.",
            "Efficient privacy-preserving face verification scheme.",
            "A new parallel processing architecture for accelerating image encryption based on chaos."
        ]
    },
    {
        "name": "JISA",
        "year": "2020",
        "info": "2020: Volumes\n50,\n51,\n52,\n53,\n54,\n55",
        "count": 184,
        "papers": [
            "A signaling game approach to mitigate co-resident attacks in an IaaS cloud environment.",
            "Corrigendum to \"A New User Behavior Evaluation Method in Online Social Network\" Journal of Information Security and Applications Volume 48 (2019) 102371.",
            "Chameleon accumulator and its applications.",
            "Optimized in-network authentication against pollution attacks in software-defined-named data networking.",
            "Blockchain-based electronic healthcare record system for healthcare 4.0 applications.",
            "Non-transitive and collusion resistant quorum controlled proxy re-encryption scheme for resource constrained networks.",
            "A novel approach for the development of the Twofish algorithm based on multi-level key space.",
            "Hiding data in dual color images reversibly via weighted matrix.",
            "Implementation and practical problems of chaos-based cryptography revisited.",
            "Deep learning for cyber security intrusion detection: Approaches, datasets, and comparative study.",
            "Adjusting lexical features of actual proxy logs for intrusion detection.",
            "Red-cyan anaglyph image watermarking using DWT, Hadamard transform and singular value decomposition for copyright protection.",
            "Visualizing the outcome of dynamic analysis of Android malware with VizMal.",
            "Privacy preserving integrity checking of shared dynamic cloud data with user revocation.",
            "Colour image encryption algorithm combining, Arnold map, DNA sequence operation, and a Mandelbrot set.",
            "Certificateless searchable public key encryption scheme secure against keyword guessing attacks for smart healthcare.",
            "Secure and reliable data forwarding using homomorphic encryption against blackhole attacks in mobile ad hoc networks.",
            "Analysing performance issues of open-source intrusion detection systems in high-speed networks.",
            "A verifiable secret sharing scheme with combiner verification and cheater identification.",
            "Sentient-based Access Control model: A mitigation technique for Advanced Persistent Threats in Smartphones.",
            "Randomized deduplication with ownership management and data sharing in cloud storage.",
            "Public key encryption with conjunctive keyword search on lattice.",
            "Steganography over Redundant Residue Number System Codes.",
            "Practical traceable multi-authority CP-ABE with outsourcing decryption and access policy updation.",
            "Secure and efficient public key multi-channel broadcast encryption schemes.",
            "ESEAP: ECC based secure and efficient mutual authentication protocol using smart card.",
            "A research of security in website account binding.",
            "Block image encryption based on modified playfair and chaotic system.",
            "Mitigating cyberattack related domino effects in process plants via ICS segmentation.",
            "An efficient USM sharpening detection method for small-size JPEG image.",
            "A hybrid scheme for enhancing recovered image quality in polynomial based secret image sharing by modify-and-recalculate strategy.",
            "A novel proxy-oriented public auditing scheme for cloud-based medical cyber physical systems.",
            "A lightweight identity-based provable data possession supporting users' identity privacy and traceability.",
            "Bayesian attack graphs for platform virtualized infrastructures in clouds.",
            "T-CAD: A threshold based collaborative DDoS attack detection in multiple autonomous systems.",
            "Speaker-to-speaker covert ultrasonic communication.",
            "Identification of various image retargeting techniques using hybrid features.",
            "KVMInspector: KVM Based introspection approach to detect malware in cloud environment.",
            "Formal verification of misbinding attacks on secure device pairing and bootstrapping.",
            "A cryptographic cloud-based approach for the mitigation of the airline cargo cancellation problem.",
            "A game-theoretic analysis to defend against remote operating system fingerprinting.",
            "A large-scale study on the adoption of anti-debugging and anti-tampering protections in android apps.",
            "DeepProfile: Finding fake profile in online social network using dynamic CNN.",
            "UIPA: User authentication method based on user interface preferences for account recovery process.",
            "Trust-aware and cooperative routing protocol for IoT security.",
            "Provably secure two-party authenticated key agreement protocol for post-quantum environments.",
            "IFDTC4.5: Intuitionistic fuzzy logic based decision tree for E-transactional fraud detection.",
            "Multiple grayscale image encryption using cross-coupled chaotic maps.",
            "Measuring cyber-physical security in industrial control systems via minimum-effort attack strategies.",
            "Deterministic chaos game: A new fractal based pseudo-random number generator and its cryptographic application.",
            "A zero watermarking approach for content authentication and tampering detection of Arabic text based on fourth level order and word mechanism of Markov model.",
            "On the educated selection of unsupervised algorithms via attacks and anomaly classes.",
            "A copy-move image forgery detection technique based on tetrolet transform.",
            "Extended Local Ternary Co-relation Pattern: A novel feature descriptor for face Anti-spoofing.",
            "A novel conditional Butterfly Network Topology based chaotic image encryption.",
            "Digital persona portrayal: Identifying pluridentity vulnerabilities in digital life.",
            "Recommendation attack detection based on deep learning.",
            "A three-factor anonymous user authentication scheme for Internet of Things environments.",
            "Intelligent vehicle knowledge representation and anomaly detection using neural knowledge DNA.",
            "Efficient and privacy-preserving authentication scheme for wireless body area networks.",
            "Cyber security for fog-based smart grid SCADA systems: Solutions and challenges.",
            "A robust authentication and access control protocol for securing wireless healthcare sensor networks.",
            "Carp: A cost-aware relaxed protocol for encrypted data stores.",
            "Multi-Authority CP-ABE-Based user access control scheme with constant-size key and ciphertext for IoT deployment.",
            "A novel image security technique based on nucleic acid concepts.",
            "Robust detection of median filtering based on data-pair histogram feature and local configuration pattern.",
            "A secure and efficient certificateless batch verification scheme with invalid signature identification for the internet of things.",
            "A new Pseudo random number generator based on generalized Newton complex map with dynamic key.",
            "Secure, fair and instant data trading scheme based on bitcoin.",
            "Post-quantum digital signature scheme based on multivariate cubic problem.",
            "Privacy preserving cloud based secure digital locker using Paillier based difference function and chaos based cryptosystem.",
            "A low-complexity security technique in physical layer for fixed LiFi communication systems.",
            "A Low-complexity trajectory privacy preservation approach for indoor fingerprinting positioning systems.",
            "Outsourced privacy-preserving decision tree classification service over encrypted data.",
            "Reduced contact lifting of latent fingerprints from curved surfaces.",
            "Fully secure wicked identity-based encryption resilient to continual auxiliary- inputs leakage.",
            "Certificateless authenticated encryption with keyword search: Enhanced security model and a concrete construction for industrial IoT.",
            "Accurate and robust neural networks for face morphing attack detection.",
            "Securing electronic healthcare records: A mobile-based biometric authentication approach.",
            "Formal analysis of RFC 8120 authentication protocol for HTTP under different assumptions.",
            "An architecture for resilient intrusion detection in ad-hoc networks.",
            "A generalised bound for the Wiener attack on RSA.",
            "Voting extreme learning machine based distributed denial of service attack detection in cloud computing.",
            "High throughput and low area architectures of secure IoT algorithm for medical image encryption.",
            "Pseudo-random scalar multiplication based on group isomorphism.",
            "A survey of subscription privacy on the 5G radio interface - The past, present and future.",
            "An enhanced mutual authentication and key establishment protocol for TMIS using chaotic map.",
            "A TAN based hybrid model for android malware detection.",
            "Sabotaging the system boundary: A study of the inter-boundary vulnerability.",
            "AFLPro: Direction sensitive fuzzing.",
            "CsiIBS: A post-quantum identity-based signature scheme based on isogenies.",
            "A robust copy-move forgery detection technique based on discrete cosine transform and cellular automata.",
            "Survey of false data injection in smart power grid: Attacks, countermeasures and challenges.",
            "Key pre-distribution scheme based on transversal design in large mobile fog networks with multi-clouds.",
            "Attack scenario reconstruction approach using attack graph and alert data mining.",
            "Image splicing detection based on convolutional neural network with weight combination strategy.",
            "Security of multiple RGB images by RSA cryptosystem combined with FrDCT and Arnold transform.",
            "Anomaly detection in substation networks.",
            "Flow based monitoring of ICS communication in the smart grid.",
            "Robust and accurate detection of image copy-move forgery using PCET-SVD and histogram of block similarity measures.",
            "Provably secure identity-based two-party authenticated key agreement protocol based on CBi-ISIS and Bi-ISIS problems on lattices.",
            "Stateful RORI-based countermeasure selection using hypergraphs.",
            "Introduction to the special issue of the journal of information security and applications on\" cyber security in ICS & SCADA systems\".",
            "Proxy re-encryption for fine-grained access control: Its applicability, security under stronger notions and performance.",
            "synERGY: Cross-correlation of operational and contextual data to timely detect and mitigate attacks to cyber-physical systems.",
            "SecACS: Enabling lightweight secure auditable cloud storage with data dynamics.",
            "Image encryption algorithm based on the finite fields in chaotic maps.",
            "Blockchain based secured information sharing protocol in supply chain management system with key distribution mechanism.",
            "Digital forensics cloud log unification: Implementing CADF in Apache CloudStack.",
            "On the conference key distribution system with user anonymity.",
            "Detecting malicious logins as graph anomalies.",
            "Resolving the imbalance issue in short messaging service spam dataset using cost-sensitive techniques.",
            "A ciphertext-policy Attribute based encryption scheme for wireless body area networks based on ECC.",
            "A novel image encryption algorithm using chaotic compressive sensing and nonlinear exponential function.",
            "Side-channel leakage assessment metrics and methodologies at design cycle: A case study for a cryptosystem.",
            "Stateful RORI-based countermeasure selection using hypergraphs.",
            "A location privacy analysis of Bluetooth mesh.",
            "Inter-dataset generalization strength of supervised machine learning methods for intrusion detection.",
            "Cryptanalysis of an image block encryption algorithm based on chaotic maps.",
            "Classification and recognition of encrypted EEG data based on neural network.",
            "Enabling identity-based authorized encrypted diagnostic data sharing for cloud-assisted E-health information systems.",
            "Provably secure lattice based identity based unidirectional PRE and PRE+ schemes.",
            "Nearest neighbour search over encrypted data using intel SGX.",
            "Provably secure certificateless deniable authenticated encryption scheme.",
            "An efficient general data hiding scheme based on image interpolation.",
            "A DDoS attack detection and defense scheme using time-series analysis for SDN.",
            "A provably secure ECC-based roaming authentication scheme for global mobility networks.",
            "Algebra-chaos amalgam and DNA transform based multiple digital image encryption.",
            "An efficient security data-driven approach for implementing risk assessment.",
            "A unified framework for cloud security transparency and audit.",
            "Using fake text vectors to improve the sensitivity of minority class for macro malware detection.",
            "A blind quantum audio watermarking based on quantum discrete cosine transform.",
            "BTCAS: A Blockchain-Based Thoroughly Cross-Domain Authentication Scheme.",
            "Analysis of differential distribution of lightweight block cipher based on parallel processing on GPU.",
            "Computational intelligence intrusion detection techniques in mobile cloud computing environments: Review, taxonomy, and open research issues.",
            "A Deep Learning-based Cryptocurrency Price Prediction Scheme for Financial Institutions.",
            "Fuzzy extraction and PUF based three party authentication protocol using USB as mass storage device.",
            "A secure blockchain-based e-health records storage and sharing scheme.",
            "Toward supervised shape-based behavioral authentication on smartphones.",
            "Enhanced credit card fraud detection based on SVM-recursive feature elimination and hyper-parameters optimization.",
            "Rank-metric code-based mutual authentication protocol for RFID.",
            "Tree and elliptic curve based efficient and secure group key agreement protocol.",
            "A comparison of two hybrid ensemble techniques for network anomaly detection in spark distributed environment.",
            "Efficient protocols for private wildcards pattern matching.",
            "An examination of susceptibility to spear phishing cyber attacks in non-English speaking communities.",
            "Dynamic pricing in industrial internet of things: Blockchain application for energy management in smart cities.",
            "Application design phase risk assessment framework using cloud security domains.",
            "Pseudonym change-based privacy-preserving schemes in vehicular ad-hoc networks: A survey.",
            "Extending STPA with STRIDE to identify cybersecurity loss scenarios.",
            "Detection of distributed denial of service attacks based on information theoretic approach in time series models.",
            "A data encryption model based on intertwining logistic map.",
            "PCHET: An efficient programmable cellular automata based hybrid encryption technique for multi-chat client-server applications.",
            "An exotic multi-dimensional conceptualization for medical image encryption exerting Rossler system and Sine map.",
            "Automated exploration of homomorphic encryption scheme input parameters.",
            "Lightweight privacy-preserving data aggregation protocol against internal attacks in smart grid.",
            "Reversible and recoverable authentication method for demosaiced images using adaptive coding technique.",
            "Privacy preservation in outsourced mobility traces through compact data structures.",
            "Robustness verification of soft security systems.",
            "Real-time and private spatio-temporal data aggregation with local differential privacy.",
            "DART: De-Anonymization of personal gazetteers through social trajectories.",
            "Towards a secure ITS: Overview, challenges and solutions.",
            "A survey of authenticated key agreement protocols for multi-server architecture.",
            "Applied graph theory to security: A qualitative placement of security solutions within IoT networks.",
            "eBook surveillance and the threat to freedom of association.",
            "A Guiding Framework for Vetting the Internet of Things.",
            "A two-phase sequential pattern mining framework to detect stealthy P2P botnets.",
            "Evaluation metric for crypto-ransomware detection using machine learning.",
            "Adaptable feature-selecting and threshold-moving complete autoencoder for DDoS flood attack mitigation.",
            "A provably secure dynamic ID-based authenticated key agreement framework for mobile edge computing without a trusted party.",
            "Spatiotemporal chaos in multiple dynamically coupled map lattices and its application in a novel image encryption algorithm.",
            "Multi-user certificateless public key encryption with conjunctive keyword search for cloud-based telemedicine.",
            "Database intrusion detection using role and user behavior based risk assessment.",
            "A certificateless signature for multi-source network coding.",
            "A bandwidth efficient HMAC-based authentication scheme for network coding.",
            "Design and application of a personal credit information sharing platform based on consortium blockchain.",
            "Cheating immune k-out-of-n block-based progressive visual cryptography.",
            "Malware classification for the cloud via semi-supervised transfer learning.",
            "A Lightweight Signcryption Method for Perception Layer in Internet-of-Things.",
            "Universal stego post-processing for enhancing image steganography.",
            "Privacy-preserving fully anonymous ciphertext policy attribute-based broadcast encryption with constant-size secret keys and fast decryption.",
            "Watch out! Doxware on the way...",
            "A certificateless ring signature scheme with batch verification for applications in VANET.",
            "Security and privacy of UAV data using blockchain technology.",
            "Globalized firefly algorithm and chaos for designing substitution box."
        ]
    },
    {
        "name": "JISA",
        "year": "2019",
        "info": "2019: Volumes\n44,\n45,\n46,\n47,\n48,\n49",
        "count": 140,
        "papers": [
            "A new method estimating linear gaussian filter kernel by image PRNU noise.",
            "An analysis on the dimensions of information security culture concept: A review.",
            "Application of local invariant symmetry features to detect and localize image copy move forgeries.",
            "Offering security diagnosis as a service for cloud SaaS applications.",
            "Modeling adaptive access control policies using answer set programming.",
            "Attribute quality management for dynamic identity and access management.",
            "Cyber intrusion detection by combined feature selection algorithm.",
            "AnswerAuth: A bimodal behavioral biometric-based user authentication scheme for smartphones.",
            "Making the value of data determine the security: A case study of rural business process outsourcing.",
            "Image encryption using sequence generated by cyclic group.",
            "Modeling location obfuscation for continuous query.",
            "Hybrid secure and robust image watermarking scheme based on SVD and sharp frequency localized contourlet transform.",
            "Privacy preservation of data using crow search with adaptive awareness probability.",
            "Bluetooth Secure Simple Pairing with enhanced security level.",
            "An improved certificateless aggregate signature scheme without bilinear pairings for vehicular ad hoc networks.",
            "Minimum entropy and histogram-pair based JPEG image reversible data hiding.",
            "RSA public keys with inside structure: Proofs of key generation and identities for web-of-trust.",
            "Encryption techniques for H.264/AVC videos: A literature review.",
            "Quick response code and interference-based optical asymmetric cryptosystem.",
            "Geometric transformation invariant block based copy-move forgery detection using fast and efficient hybrid local features.",
            "An efficient code-based threshold ring signature scheme.",
            "A new method for pdf steganography in justified texts.",
            "A highly robust and secure image watermarking based on classification and visual cryptography.",
            "On password behaviours and attitudes in different populations.",
            "Improved Cohort Intelligence - A high capacity, swift and secure approach on JPEG image steganography.",
            "Security predictions - A way to reduce uncertainty.",
            "A secure image encryption scheme based on cellular automata and chaotic skew tent map.",
            "Emergency role-based access control (E-RBAC) and analysis of model specifications with alloy.",
            "The benefit of using chaos in key schedule algorithm.",
            "Secure mutual authentication and automated access control for IoT smart home using cumulative Keyed-hash chain.",
            "ECC based inter-device authentication and authorization scheme using MQTT for IoT networks.",
            "Fraud detection for E-commerce transactions by employing a prudential Multiple Consensus model.",
            "An efficient colour image encryption scheme based on 1-D chaotic maps.",
            "Detection of power grid disturbances and cyber-attacks based on machine learning.",
            "A comparison of machine learning techniques for file system forensics analysis.",
            "High-uncertainty audio signal encryption based on the Collatz conjecture.",
            "Cryptographic construction using coupled map lattice as a diffusion model to enhanced security.",
            "Securing the regions comprising information in a document image with novel key selection technique - a parallel approach.",
            "Information security burnout: Identification of sources and mitigating factors from security demands and resources.",
            "Progressive and hierarchical share-in-share scheme over cloud.",
            "Repositioning privacy concerns: Web servers controlling URL metadata.",
            "Hands-Free one-Time and continuous authentication using glass wearable devices.",
            "Assessing the quantum-resistant cryptographic agility of routing and switching IT network infrastructure in a large-size financial organization.",
            "A framework for zero-day vulnerabilities detection and prioritization.",
            "ELM-Kernel and reduced kernel ELM based watermarking scheme.",
            "Misbehavior detection and efficient revocation within VANET.",
            "A multi-shape hybrid symmetric encryption algorithm to thwart attacks based on the knowledge of the used cryptographic suite.",
            "Optical air-gap exfiltration attack via invisible images.",
            "Hybrid and blind watermarking scheme in DCuT - RDWT domain.",
            "CSED: Client-Side encrypted deduplication scheme based on proofs of ownership for cloud storage.",
            "Dynamic privacy leakage analysis of Android third-party libraries.",
            "An efficient and privacy-Preserving pre-clinical guide scheme for mobile eHealthcare.",
            "Secure telemedicine using RONI halftoned visual cryptography without pixel expansion.",
            "Examining PBKDF2 security margin - Case study of LUKS.",
            "Spatio-temporal generative adversarial network for gait anonymization.",
            "On the use of the Stirling Transform in image steganography.",
            "Challenge-based collaborative intrusion detection networks under passive message fingerprint attack: A further analysis.",
            "A secure authentication protocol for wearable devices environment using ECC.",
            "Improvement of (n, n)-multi-secret image sharing schemes based on Boolean operations.",
            "A new DCT-based robust image watermarking method using teaching-learning-Based optimization.",
            "Detailed analysis and improvement of an efficient and secure identity-based public auditing for dynamic outsourced data with proxy.",
            "Secure distributed data geolocation scheme against location forgery attack.",
            "Privacy-preserving outsourced image feature extraction.",
            "Design of compressed sensing fault-tolerant encryption scheme for key sharing in IoT Multi-cloudy environment(s).",
            "Reversible data hiding in encrypted images with somewhat homomorphic encryption based on sorting block-level prediction-error expansion.",
            "Efficient fuzzy identity-based signature from lattices for identities in a small (or large) universe.",
            "Enhanced AMBTC based data hiding method using hamming distance and pixel value differencing.",
            "Heterogeneous deniable authentication and its application to e-voting systems.",
            "The language of biometrics: Analysing public perceptions.",
            "Privacy-preserving quantum multi-party computation based on circular structure.",
            "A CCA-secure multi-conditional proxy broadcast re-encryption scheme for cloud storage system.",
            "A dual privacy-preservation scheme for cloud-based eHealth systems.",
            "A proactive malicious software identification approach for digital forensic examiners.",
            "An efficient eCK secure certificateless authenticated key agreement scheme with security against public key replacement attacks.",
            "Image encryption scheme based on a new secure variant of Hill cipher and 1D chaotic maps.",
            "Designing digital image encryption using 2D and 3D reversible modular chaotic maps.",
            "A high capacity reversible data hiding scheme for encrypted covers based on histogram shifting.",
            "Security analysis and classification of image secret sharing.",
            "A new user behavior evaluation method in online social network.",
            "Inside out - A study of users' perceptions of password memorability and recall.",
            "Efficient implementation of lightweight block ciphers on volta and pascal architecture.",
            "A multiparty watermarking protocol for cloud environments.",
            "Privacy-preserving decentralized ABE for secure sharing of personal health records in cloud storage.",
            "Secure and efficient arithmetic-based multi-secret image sharing scheme using universal share.",
            "A novel information hiding scheme based on social networking site viewers' public comments.",
            "An efficient multiple-user location-based query authentication approach for social networking.",
            "Conditional privacy-preserving authentication and key agreement scheme for roaming services in VANETs.",
            "A STAMP-based ontology approach to support safety and security analyses.",
            "Design of a chaos-based encryption scheme for sensor data using a novel logarithmic chaotic map.",
            "Efficient identity-based multi-bit proxy re-encryption over lattice in the standard model.",
            "Secure string pattern query for open data initiative.",
            "Color image-spliced localization based on quaternion principal component analysis and quaternion skewness.",
            "A taxonomy of features for preventing identity deception in online communities and their estimated efficacy.",
            "A progressively essential secret image sharing scheme using hierarchy shadow.",
            "A hybrid deep learning image-based analysis for effective malware detection.",
            "An improved simple flexible cryptosystem for 3D objects with texture maps and 2D images.",
            "A reformed grasshopper optimization with genetic principle for securing medical data.",
            "Discovering and utilising expert knowledge from security event logs.",
            "Succinct Predicate and Online-Offline Multi-Input Inner Product Encryptions under Standard Static Assumptions.",
            "Checking certificate revocation efficiently using certificate revocation guard.",
            "A robust domain partitioning intrusion detection method.",
            "When an attacker meets a cipher-image in 2018: A year in review.",
            "Security analysis of third-party in-app payment in mobile applications.",
            "A technique for DNA cryptography based on dynamic mechanisms.",
            "Kernel homomorphic encryption protocol.",
            "Profile-guided code identification and hardening using return oriented programming.",
            "A highly efficient and secure hardware implementation of the advanced encryption standard.",
            "Deriving ChaCha20 key streams from targeted memory analysis.",
            "Usable security for QR code.",
            "A prediction error based histogram association and mapping technique for data embedment.",
            "Human identification after plastic surgery using region based score level fusion of local facial features.",
            "Getting to the root of the problem: A detailed comparison of kernel and user level data for dynamic malware analysis.",
            "Toward a secure video watermarking in compressed domain.",
            "Cognitive security: A comprehensive study of cognitive science in cybersecurity.",
            "Sharing information online rationally: An observation of user privacy concerns and awareness using serious game.",
            "Intrusion response prioritization based on fuzzy ELECTRE multiple criteria decision making technique.",
            "A systematic review on the status and progress of homomorphic encryption technologies.",
            "Attributes revocation through ciphertext puncturation.",
            "A Cluster Correlation power analysis against double blinding exponentiation.",
            "An effective comparison protocol over encrypted data in cloud computing.",
            "Reversible data hiding in homomorphically encrypted image using interpolation technique.",
            "Efficient privacy-preserving authentication framework for edge-assisted Internet of Drones.",
            "Active learning approach to label network traffic datasets.",
            "Cyber security requirements engineering for low-voltage distribution smart grid architectures using threat modeling.",
            "Designing a fast image encryption scheme using fractal function and 3D Henon Map.",
            "Designated tester certificateless encryption with keyword search.",
            "Order-preserving encryption using approximate common divisors.",
            "Modelling and analysis of corporate efficiency and productivity loss associated with enterprise information security technologies.",
            "A lightweight and efficient digital image encryption using hybrid chaotic systems for wireless network applications.",
            "Freestyle, a randomized version of ChaCha for resisting offline brute-force and dictionary attacks.",
            "ITADP: An inter-tenant attack detection and prevention framework for multi-tenant SaaS.",
            "Optimization based interesting region identification for video watermarking.",
            "Secure data stream outsourcing with publicly verifiable integrity in cloud storage.",
            "An encryption scheme for securing multiple medical images.",
            "Traceable attribute-based signature.",
            "A novel algorithm for detecting superpoints based on reversible virtual bitmaps.",
            "Privacy-preserving content-based image retrieval for mobile computing.",
            "A privacy-preserving model to control social interaction behaviors in social network sites.",
            "New authentication/ownership transfer protocol for RFID objects.",
            "Efficient private database queries using ring-LWE somewhat homomorphic encryption."
        ]
    },
    {
        "name": "JISA",
        "year": "2018",
        "info": "2018: Volumes\n38,\n39,\n40,\n41,\n42,\n43",
        "count": 79,
        "papers": [
            "Modeling optimized decoy state protocol for enhanced quantum key distribution.",
            "Internet of Things: A survey on the security of IoT frameworks.",
            "Towards privacy preserving threat intelligence.",
            "Network layer attacks and countermeasures in cognitive radio networks: A survey.",
            "Secure migration to compliant cloud services: A case study.",
            "Searching for perfect diffusion matrices with lightweight coefficients.",
            "Bi-directional extreme learning machine for semi-blind watermarking of compressed images.",
            "Improving SIEM capabilities through an enhanced probe for encrypted Skype traffic detection.",
            "A secure and lightweight authentication scheme for roaming service in global mobile networks.",
            "Bump in the wire (BITW) security solution for a marine ROV remote control application.",
            "Introduction to special issue on e-voting.",
            "Bits or paper: Which should get to carry your vote?",
            "Third-party verifiable voting systems: Addressing motivation and incentives in e-voting.",
            "An ORAM-based privacy preserving data sharing scheme for cloud storage.",
            "A dynamic integrity verification scheme of cloud storage data based on lattice and Bloom filter.",
            "An improved E-DRM scheme for mobile environments.",
            "Multirate DelPHI to secure multirate ad hoc networks against wormhole attacks.",
            "Improved keylogging and shoulder-surfing resistant visual two-factor authentication protocol.",
            "Histogram-pair based reversible data hiding via searching for optimal four thresholds.",
            "Incognito: Shoulder-surfing resistant selection method.",
            "Design of an enhanced message authentication scheme for smart grid and its performance analysis on an ARM Cortex-M3 microcontroller.",
            "Instance based security risk value estimation for Android applications.",
            "Studying users' adaptation to Android's run-time fine-grained access control system.",
            "Ransomware behavioural analysis on windows platforms.",
            "Identifying irregularities in security event logs through an object-based Chi-squared test of independence.",
            "A continuous combination of security & forensics for mobile devices.",
            "PAL: A pseudo assembly language for optimizing secure function evaluation in mobile devices.",
            "A color image steganography in hybrid FRT-DWT domain.",
            "A comparative study of card-not-present e-commerce architectures with card schemes: What about privacy?",
            "Secure multi-level permutation operation based multiple colour image encryption.",
            "Securing images with a diffusion mechanism based on Fractional Brownian Motion.",
            "A dynamic and non-interactive boolean searchable symmetric encryption in multi-client setting.",
            "Multidimensional data tight aggregation and fine-grained access control in smart grid.",
            "An improved threshold multi-level image recovery scheme.",
            "Novel interval type-2 fuzzy logic controller for improving risk assessment model of cyber security.",
            "Secure transmission of multimedia contents over low-power mobile devices.",
            "Cryptanalysis of RSA-type cryptosystems based on Lucas sequences, Gaussian integers and elliptic curves.",
            "SQL Injection Attack classification through the feature extraction of SQL query strings using a Gap-Weighted String Subsequence Kernel.",
            "A review of image steganalysis techniques for digital forensics.",
            "Image authentication scheme based on reversible fragile watermarking with two images.",
            "Motivation and opportunity based model to reduce information security insider threats in organisations.",
            "Managing distributed trust relationships for multi-modal authentication.",
            "Identification of malicious activities in industrial internet of things based on deep learning models.",
            "A robust HDR images watermarking method using artificial bee colony algorithm.",
            "\"It's all about the start\" classifying eyes-free mobile authentication techniques.",
            "Image steganography based on Canny edge detection, dilation operator and hybrid coding.",
            "Fingerprinting for multimedia content broadcasting system.",
            "A biometric security scheme for wireless body area networks.",
            "Token based Detection and Neural Network based Reconstruction framework against code injection vulnerabilities.",
            "Lightweight scheme of secure outsourcing SVD of a large matrix on cloud.",
            "A novel honeypot based security approach for real-time intrusion detection and prevention systems.",
            "Single key MITM attack and biclique cryptanalysis of full round Khudra.",
            "Fine-grained search and access control in multi-user searchable encryption without shared keys.",
            "Efficient many-core architecture design for cryptanalytic collision search on FPGAs.",
            "iABC: Towards a hybrid framework for analyzing and classifying behaviour of iOS applications using static and dynamic analysis.",
            "Video authentication using spatio temporal relationship for tampering detection.",
            "Secure authentication scheme to thwart RT MITM, CR MITM and malicious browser extension based phishing attacks.",
            "Towards a practical cloud forensics logging framework.",
            "Trust-based multi-hop cooperative spectrum sensing in cognitive radio networks.",
            "An exploratory study of cyber hygiene behaviors and knowledge.",
            "SWORD: Semantic aWare andrOid malwaRe Detector.",
            "Novel method for image security system based on improved SCAN method and pixel rotation technique.",
            "Formal analysis of a security protocol for e-passports based on rewrite theory specifications.",
            "Performing and mitigating force and terrorist fraud attacks against two RFID distance-bounding protocols.",
            "A lightweight multi-factor secure smart card based remote user authentication scheme for cloud-IoT applications.",
            "A forensic examination of the technical and legal challenges surrounding the investigation of child abuse on live streaming platforms: A case study on Periscope.",
            "Functional Signcryption.",
            "A multimodal fusion based framework to reinforce IDS for securing Big Data environment using Spark.",
            "Lightweight reputation-based approach against simple and cooperative black-hole attacks for MANET.",
            "Hybrid Trust Model for Worm Mitigation in P2P Networks.",
            "Copy-move detection of digital audio based on multi-feature decision.",
            "Steganography with pixel-value differencing and modulus function based on PSO.",
            "Formal definition and analysis of access control model based on role and attribute.",
            "Security risk assessment within hybrid data centers: A case study of delay sensitive applications.",
            "OTP-IoT: An ownership transfer protocol for the Internet of Things.",
            "Outsourcing private equality tests to the cloud.",
            "A rigorous security analysis of a decentralized electronic voting protocol in the universal composability framework.",
            "Passive inference of attacks on CPS communication protocols.",
            "A cryptographic model for better information security."
        ]
    },
    {
        "name": "JISA",
        "year": "2017",
        "info": "2017: Volumes\n32,\n33,\n34,\n35,\n36,\n37",
        "count": 79,
        "papers": [
            "A minesweeper game-based steganography scheme.",
            "A privacy preserving biometric-based three-factor remote user authenticated key agreement scheme.",
            "A white-box anomaly-based framework for database leakage detection.",
            "A cryptographic model based on logistic map and a 3-D matrix.",
            "Enhancing embedding capacity and stego image quality by employing multi predictors.",
            "Localized & self adaptive audio watermarking algorithm in the wavelet domain.",
            "Affine Boolean classification in secret image sharing for progressive quality access control.",
            "A greater understanding of social networks privacy requirements: The user perspective.",
            "A new Boolean-based multiple secret image sharing scheme to share different sized secret images.",
            "Towards quantification and evaluation of security of Cloud Service Providers.",
            "Erratum to \"On the Privacy of Private Browsing - A Forensic Approach\" [JISA 19/1(2014), 88-100].",
            "Human-centred cyber security.",
            "Risk media and the end of anonymity.",
            "The simpler, the better? Presenting the COPING Android permission-granting interface for better privacy-related decisions.",
            "Signalling over-privileged mobile applications using passive security indicators.",
            "Psychological needs as motivators for security and privacy actions on smartphones.",
            "Exploring behavioral information security networks in an organizational context: An empirical case study.",
            "Access control for secure information sharing in smart content spaces.",
            "Contemplating human-centred security & privacy research: Suggesting future directions.",
            "Establishing secure and anonymous communication channel: KEM/DEM-based construction and its implementation.",
            "A comprehensive view on quantity based aggregation for cadastral databases.",
            "Communication security and privacy support in 6LoWPAN.",
            "A structured methodology for deploying log management in WANs.",
            "An IoT notion-based authentication and key agreement scheme ensuring user anonymity for heterogeneous ad hoc wireless sensor networks.",
            "A new transform domain steganography based on modified logistic chaotic map for color images.",
            "Introduction to the special issue of the journal of information security and applications on \"ICS & SCADA cyber security\".",
            "Detection of attacks based on known vulnerabilities in industrial networked systems.",
            "A collaborative cyber incident management system for European interconnected critical infrastructures.",
            "STPA-SafeSec: Safety and security analysis for cyber-physical systems.",
            "A security evaluation of IEC 62351.",
            "Special issue on Secure Computation on Encrypted Data.",
            "Secure numerical and logical multi party operations.",
            "Lightweight adaptive Random-Forest for IoT rule generation and execution.",
            "Generalised regenerating codes for securing distributed storage systems against eavesdropping.",
            "Fully Enhanced Homomorphic Encryption algorithm of MORE approach for real world applications.",
            "Securing digital voice communication using non-autonomous modulated chaotic signal.",
            "Realizing correlated equilibrium by secure computation.",
            "A lightweight biometrics based remote user authentication scheme for IoT services.",
            "Secure pseudonymisation for privacy-preserving probabilistic record linkage.",
            "Toward single-server private information retrieval protocol via learning with errors.",
            "Robust optimal position detection scheme for relational database watermarking through HOLPSOFA algorithm.",
            "An effective method to detect seam carving.",
            "Slowcomm: Design, development and performance evaluation of a new slow DoS attack.",
            "An event based technique for detecting spoofed IP packets.",
            "Design and analysis of pairing protocol for bluetooth enabled devices using R-LWE Lattice-based cryptography.",
            "RF fingerprint extraction for GNSS anti-spoofing using axial integrated Wigner bispectrum.",
            "A software assignment algorithm for minimizing worm damage in networked systems.",
            "Detection of malicious web pages based on hybrid analysis.",
            "Identification of phishing webpages and its target domains by analyzing the feign relationship.",
            "Author gender identification from Arabic text.",
            "TACTICS: Validation of the security framework developed for tactical SOA.",
            "Sequence aware functional encryption and its application in searchable encryption.",
            "A novel pseudo random sequence generator for image-cryptographic applications.",
            "Information security risks management framework - A step towards mitigating security risks in university network.",
            "Applications of artificial immune systems to computer security: A survey.",
            "Enhanced secure mutual authentication and key agreement scheme with user anonymity in ubiquitous global mobility networks.",
            "The risk to breach vote privacy by unanimous voting.",
            "Integrating information quality dimensions into information security risk management (ISRM).",
            "Policy Management Engine (PME): A policy-based schema to classify and manage sensitive data in cloud storages.",
            "Analysis of hierarchical identity based encryption schemes and its applicability to computing environments.",
            "Deriving and measuring DNS-based fingerprints.",
            "Design of a proficient hybrid protocol for efficient route discovery and secure data transmission in CEAACK MANETs.",
            "Security bound enhancement of remote user authentication using smart card.",
            "A practical, secure, and auditable e-voting system.",
            "Cyber security attacks to modern vehicular systems.",
            "Model checking the iKP electronic payment protocols.",
            "Privacy in elections: How small is \"small\"?",
            "Randomized authentication primitive problem in key exchange with strong security.",
            "Detection of image seam carving by using weber local descriptor and local binary patterns.",
            "MLP-GA based algorithm to detect application layer DDoS attack.",
            "Preventing malware pandemics in mobile devices by establishing response-time bounds.",
            "Batch verification of Digital Signatures: Approaches and challenges.",
            "A survey on behavioral biometric authentication on smartphones.",
            "Database watermarking, a technological protective measure: Perspective, security analysis and future directions.",
            "Attribute based access control scheme with controlled access delegation for collaborative E-health environments.",
            "Multi-layer security of color image based on chaotic system combined with RP2DFRFT and Arnold Transform.",
            "Classification of malware families based on runtime behaviors.",
            "On inter-Rater reliability of information security experts.",
            "An efficient provably-secure identity-based authentication scheme using bilinear pairings for Ad hoc network."
        ]
    },
    {
        "name": "JISA",
        "year": "2016",
        "info": "2016: Volumes\n26,\n27-28,\n29,\n30,\n31",
        "count": 36,
        "papers": [
            "A magic cube based information hiding scheme of large payload.",
            "A comprehensive approach to discriminate DDoS attacks from flash events.",
            "TouchSignatures: Identification of user touch actions and PINs based on mobile sensor data via JavaScript.",
            "Detecting video frame-rate up-conversion based on periodic properties of edge-intensity.",
            "Editorial of special issue on security and privacy in cloud computing.",
            "An evaluation of recent secure deduplication proposals.",
            "An investigation of the challenges and issues influencing the adoption of cloud computing in Australian regional municipal governments.",
            "The Austrian eID ecosystem in the public cloud: How to obtain privacy while preserving practicality.",
            "Secure image deduplication through image compression.",
            "Multi-tenant attribute-based access control for cloud infrastructure services.",
            "IGOD: identification of geolocation of cloud datacenters.",
            "Formal verification of secure information flow in cloud computing.",
            "PDF steganography based on Chinese Remainder Theorem.",
            "ROPocop - Dynamic mitigation of code-reuse attacks.",
            "A taxonomy for attack graph generation and usage in network security.",
            "Full key recovery of ACORN with a single fault.",
            "Design and implementation of hardware-efficient modified Rao-Nam scheme with high security for wireless sensor networks.",
            "Enabling information recovery with ownership using robust multiple watermarks.",
            "Comment on \"An Enhanced and Secured RSA Key Generation Scheme (ESRKGS)\".",
            "Steganalysis based on steganography pattern discovery.",
            "Combining ensemble methods and social network metrics for improving accuracy of OCSVM on intrusion detection in SCADA systems.",
            "Identification of irregularities and allocation suggestion of relative file system permissions.",
            "Security pitfalls of \"ePASS: An expressive attribute-based signature scheme\".",
            "Security protocol specification and verification with AnBx.",
            "Design of a secure smart card-based multi-server authentication scheme.",
            "Testing access control policy through Change Rule and Swap Rule Algorithm (CRSR).",
            "Image steganography based on interval-valued intuitionistic fuzzy edge detection and modified LSB.",
            "A novel and efficient method based on knight moves for securing the information contents of images - A parallel approach.",
            "Editorial: Special issue on security and dependability of internet of things.",
            "Research of a resource-efficient, real-time and fault-tolerant wireless sensor network system.",
            "Personalized route planning system based on Wardrop Equilibrium model for pedestrian-vehicle mixed evacuation in campus.",
            "Formal modeling and analysis of time- and resource-sensitive simple business processes.",
            "A spiral process of formalization and verification: A case study on verification of the scheduling mechanism of OSEK/VDX.",
            "Research on campus traffic congestion detection using BP neural network and Markov model.",
            "Garakabu2: an SMT-based bounded model checker for HSTM designs in ZIPC.",
            "Wave atom transform based image hashing using distributed source coding."
        ]
    },
    {
        "name": "JISA",
        "year": "2015",
        "info": "2015: Volumes\n20,\n21,\n22,\n23,\n24-25",
        "count": 35,
        "papers": [
            "Guest Editorial: Security, privacy and trust in future networks and mobile computing.",
            "An Enhanced and Secured RSA Key Generation Scheme (ESRKGS).",
            "Trust-based privacy-aware participant selection in social participatory sensing.",
            "Efficient suspicious URL filtering based on reputation.",
            "Advanced password based authentication scheme for wireless sensor networks.",
            "ASH-512: Design and implementation of cryptographic hash algorithm using co-ordinate geometry concepts.",
            "Mining a high level access control policy in a network with multiple firewalls.",
            "Blind SVD-based audio watermarking using entropy and log-polar transformation.",
            "Safe use of mobile devices arises from knowing the threats.",
            "A cloud-based secure authentication (CSA) protocol suite for defense against Denial of Service (DoS) attacks.",
            "An efficient ECC-based privacy-preserving client authentication protocol with key agreement using smart card.",
            "An RGB image encryption using diffusion process associated with chaotic map.",
            "A flow-based detection method for stealthy dictionary attacks against Secure Shell.",
            "Detecting botnet by anomalous traffic.",
            "ASH-160: A novel algorithm for secure hashing using geometric concepts.",
            "Editorial: Special issue on security of information and networks.",
            "Effectiveness of qualitative and quantitative security obligations.",
            "Model based security verification of protocol implementation.",
            "ASArP: Automated Security Assessment & Audit of Remote Platforms using TCG-SCAP synergies.",
            "Blinded additively homomorphic encryption schemes for self-tallying voting.",
            "SAT based analysis of LTE stream cipher ZUC.",
            "AndroSimilar: Robust signature for detecting variants of Android malware.",
            "Secure garbage collection: Preventing malicious data harvesting from deallocated Java objects inside the Dalvik VM.",
            "Anonymous group-based routing in MANETs.",
            "JellyFish attack: Analysis, detection and countermeasure in TCP-based MANET.",
            "Advanced social engineering attacks.",
            "Fair secret reconstruction in (t, n) secret sharing.",
            "Scalable secret sharing of compressed multimedia.",
            "A secure password-based authentication and key agreement scheme using smart cards.",
            "Design of a lightweight two-factor authentication scheme with smart card revocation.",
            "A multi-threshold based audio steganography scheme.",
            "Cryptanalysis of an integrity checking scheme for cloud data sharing.",
            "Fully secure anonymous spatial encryption under affine space delegation functionality revisited.",
            "An efficient and secure robust watermarking scheme for document images using Integer wavelets and block coding of binary watermarks.",
            "Cross-domain collaboration for improved IDS rule set selection."
        ]
    },
    {
        "name": "JISA",
        "year": "2014",
        "info": "Volume 19: 2014",
        "count": 29,
        "papers": [
            "Editorial: Special issue on Identity Protection and Management.",
            "Anonymity and closely related terms in the cyberspace: An analysis by example.",
            "An efficient and secure anonymous mobility network authentication scheme.",
            "Concepts and languages for privacy-preserving attribute-based authentication.",
            "An access control model for cloud computing.",
            "Logout in single sign-on systems: Problems and solutions.",
            "FPGA acceleration of a pseudorandom number generator based on chaotic iterations.",
            "On the privacy of private browsing - A forensic approach.",
            "Special Section on Vote-ID 2013.",
            "Implementing and evaluating a software-independent voting system for polling station elections.",
            "Verifying voting schemes.",
            "How to prove the validity of a complex ballot encryption to the voter and the public.",
            "A novel RF fingerprinting approach for hardware integrated security.",
            "Generating pseudo-random numbers by combining two systems with complex behaviors.",
            "Special issue on threat detection, analysis and defense.",
            "Unifying traditional risk assessment approaches with attack trees.",
            "Automating the assessment of ICT risk.",
            "PeerRush: Mining for unwanted P2P traffic.",
            "Script-templates for the Content Security Policy.",
            "Towards a trusted HDFS storage platform: Mitigating threats to Hadoop infrastructures using hardware-accelerated encryption with TPM-rooted key protection.",
            "Visual multi secret sharing by cylindrical random grid.",
            "The relation between information security events and firm market value, empirical evidence on recent disclosures: An extension of the GLZ study.",
            "Binomial transform based fragile watermarking for image authentication.",
            "A secure remote user mutual authentication scheme using smart cards.",
            "One-sided leakage-resilient privacy only two-message oblivious transfer.",
            "On the physical robustness of RF on-chip nanostructured security.",
            "Dissecting pattern unlock: The effect of pattern strength meter on pattern selection.",
            "A methodology for estimating the tangible cost of data breaches.",
            "A novel fast and provably secure (t, n)-threshold secret sharing construction for digital images."
        ]
    },
    {
        "name": "JISA",
        "year": "2013",
        "info": "Volume 18: 2013",
        "count": 20,
        "papers": [
            "Editorial.",
            "Behavioral classification and detection of malware through HTTP user agent anomalies.",
            "MASON: Mobile autonomic security for network access controls.",
            "Smatch: Formal dynamic session management model for RBAC.",
            "A conceptual framework of info structure for information security risk assessment (ISRA).",
            "Semantic aware attack scenarios reconstruction.",
            "QaASs: QoS aware adaptive security scheme for video streaming in MANETs.",
            "Message transmission and key establishment: General equality for weak and strong capacities.",
            "Editorial: Smart Card and RFID Security.",
            "Advanced remote user authentication protocol for multi-server architecture based on ECC.",
            "Load time code validation for mobile phone Java Cards.",
            "Virus in a smart card: Myth or reality?",
            "Hardware accelerated smart-card software evaluation supported by information leakage and activity sensors.",
            "Risks induced by Web applications on smart cards.",
            "DCT based reversible data embedding for MPEG-4 video using HVS characteristics.",
            "Hadamard transform based adaptive visible/invisible watermarking scheme for digital images.",
            "Secret image sharing using grayscale payload decomposition and irreversible image steganography.",
            "On the security of certain e-communication types: Risks, user awareness and recommendations.",
            "An improved ridge features extraction algorithm for distorted fingerprints matching.",
            "Cryptanalysis of a simple key assignment for access control based on polynomial."
        ]
    },
    {
        "name": "JISA",
        "year": "2012",
        "info": "Volume 17: 2012/2013",
        "count": 22,
        "papers": [
            "Practical application of information security models.",
            "Economics and the cyber challenge.",
            "Technology is not enough: Taking a holistic view for information assurance.",
            "Feature extraction from vein images using spatial information and chain codes.",
            "Continuous keystroke dynamics: A different perspective towards biometric evaluation.",
            "Corrigendum to \"Social networking as a nexus for engagement and exploitation of young people\" [Inform Secur Tech Rep 16 (2) (2011) 44-50].",
            "Security and privacy for digital ecosystems.",
            "Server-aided signatures verification secure against collusion attack.",
            "A lightweight framework for secure life-logging in smart environments.",
            "Kynoid: Real-time enforcement of fine-grained, user-defined, and data-centric security policies for Android.",
            "HiPoLDS: A Hierarchical Security Policy Language for Distributed Systems.",
            "SmartK: Smart cards in operating systems at kernel level.",
            "Share with strangers: Privacy bubbles as user-centered privacy control for mobile content sharing applications.",
            "Secure computations on non-integer values with applications to privacy-preserving sequence analysis.",
            "Semantic analysis of role mining results and shadowed roles detection.",
            "Bridging the gap between role mining and role engineering via migration guides.",
            "Analyses of two end-user software vulnerability exposure metrics (extended version).",
            "Analyzing settings for social identity management on Social Networking Sites: Classification, current state, and proposed developments.",
            "Toward web-based information security knowledge sharing.",
            "Oblivious and fair server-aided two-party computation.",
            "InnoDB database forensics: Enhanced reconstruction of data manipulation queries from redo logs.",
            "On measuring the parasitic backscatter of sensor-enabled UHF RFID tags."
        ]
    },
    {
        "name": "JISA",
        "year": "2011",
        "info": "Volume 16: 2011",
        "count": 21,
        "papers": [
            "Next generation networks.",
            "Challenges for the security analysis of Next Generation Networks.",
            "A survey on fraud and service misuse in voice over IP (VoIP) networks.",
            "Clustering NGN user behavior for anomaly detection.",
            "Side effects of identity management in SIP VoIP environment.",
            "Social networking threats.",
            "The threats of social networking: Old wine in new bottles?",
            "Social networking as a nexus for engagement and exploitation of young people.",
            "Real-time detection of children's skin on social networking sites using Markov random field modelling.",
            "Bucket attack on numeric set watermarking model and safeguards.",
            "Socio-technological phishing prevention.",
            "Social networking searching and privacy issues.",
            "How much material on BitTorrent is infringing content? A case study.",
            "Commentary: Cloud computing - A security problem or solution?",
            "Positive perspectives on cloud security.",
            "Internet cloud security: The illusion of inclusion.",
            "Trust in the Cloud.",
            "Looking at clouds from both sides: The advantages and disadvantages of placing personal narratives in the cloud.",
            "Considerations for mobile authentication in the Cloud.",
            "Analysis of recommended cloud security controls to validate OpenPMF \"policy as a service\".",
            "Integrated assessment and mitigation of physical and digital security threats: Case studies on virtualization."
        ]
    },
    {
        "name": "JISA",
        "year": "2010",
        "info": "Volume 15: 2010",
        "count": 25,
        "papers": [
            "Protocols and cryptography.",
            "Cryptography in the real world.",
            "The MIFARE Classic story.",
            "The status of National PKIs - A European overview.",
            "Choosing key sizes for cryptography.",
            "Caveat venditor.",
            "Identity based encryption: Progress and challenges.",
            "Identity Theft and Reconstruction.",
            "Online identity: Giving it all away?",
            "The art of alchemy.",
            "Social networking and the risk to companies and institutions.",
            "Privacy threats in a mobile enterprise social network.",
            "Digital forensics and the issues of identity.",
            "Fool's gold.",
            "Computer crime - A 2011 update.",
            "Botnets: To what extent are they a threat to information security?",
            "High tech criminal threats to the national information infrastructure.",
            "Assessing insider threats to information security using technical, behavioural and organisational measures.",
            "Mobile telephony security compromises.",
            "Matchmaking between PCI-DSS and Security.",
            "PCI DSS audit and compliance.",
            "Incident response and compliance: A case study of the recent attacks.",
            "From auditor-centric to architecture-centric: SDLC for PCI DSS.",
            "Compliance complacency: How 'check-box' compliancy remains a pitfall for many organizations worldwide.",
            "How tokenization and encryption can enable PCI DSS compliance."
        ]
    },
    {
        "name": "JISA",
        "year": "2009",
        "info": "Volume 14: 2009",
        "count": 33,
        "papers": [
            "Cloud security technologies.",
            "Making sense of anti-malware comparative testing.",
            "Detection of malicious code by applying machine learning classifiers on static features: A state-of-the-art survey.",
            "A look at Portable Document Format vulnerabilities.",
            "Introduction to this issue.",
            "Smart card applications and security.",
            "Attacking smart card systems: Theory and practice.",
            "Smart card security evaluation: Community solutions to intractable problems.",
            "Multiapplication smart card: Towards an open smart card?",
            "How to defend against smartcard attacks - Or the amazing number of different ways to check a PIN securely.",
            "Transport ticketing security and fraud controls.",
            "Electronic passports - from secure specifications to secure implementations.",
            "Smart cards and remote computing: Interaction or convergence?",
            "The changing shape of privacy and consent.",
            "Privacy and consent in the digital era.",
            "Reflections on privacy, identity and consent in on-line services.",
            "Improving the secure management of personal data: Privacy on-line IS important, but it's not easy.",
            "'Privacy and public policy delivery - Dichotomy or design'.",
            "Privacy and consent in pervasive networks.",
            "Victorian values: Politicians and the public incorrectly see security and privacy as opposites.",
            "What's happened to PETs?",
            "Informational privacy, consent and the \"control\" of personal data.",
            "Young people, disclosure of personal information and online privacy: Control, choice and consequences.",
            "The need for enhanced privacy and consent dialogues.",
            "Changing staff behaviour.",
            "The irreversible march of technology.",
            "Information security management: An entangled research challenge.",
            "Human factors in information security: The insider threat - Who can you trust these days?",
            "A safety approach to information security communications.",
            "Protecting clients from insider attacks on trust accounts.",
            "How do you make information security user friendly?",
            "Contribution of corporate social responsibility to information security management.",
            "The positive outcomes of information security awareness training in companies - A case study."
        ]
    },
    {
        "name": "JISA",
        "year": "2008",
        "info": "Volume 13: 2008",
        "count": 33,
        "papers": [
            "Securing Web applications.",
            "White and grey-box verification and validation approaches for safety- and security-critical software systems.",
            "Re-engineering Xen internals for higher-assurance security.",
            "Security-by-contract on the .NET platform.",
            "Dynamic taint propagation: Finding vulnerabilities without attacking.",
            "Secure software development: Why the development world awoke to the challenge.",
            "Introduction to this issue.",
            "National e-ID card schemes: A European overview.",
            "Insights on identity documents based on the Belgian case study.",
            "Some thoughts on the underlying logic and process underpinning Electronic Identity (e-ID).",
            "Identity management of e-ID, privacy and security in Europe. A human rights view.",
            "Legal and organizational challenges and solutions for achieving a pan-European electronic ID solution: or I am 621216-1318, but I am also 161262-43774. Do you know who I am?",
            "Identity management throughout one's whole life.",
            "The benefits and drawbacks of using electronic identities.",
            "Building secure business applications at Microsoft.",
            "Developments in mobile communications security.",
            "Future consumer mobile phone security: A case study using the data-centric security model.",
            "A mobile device management framework for secure service delivery.",
            "Authentication & key agreement for off-portal mobile applications.",
            "Spontaneous mobile device authentication based on sensor data.",
            "New mutual agreement protocol to secure mobile RFID-enabled devices.",
            "Secure authenticated group key agreement protocol in the MANET environment.",
            "On handling insider attacks in wireless sensor networks.",
            "Mobile communication security controllers an evaluation paper.",
            "Introduction.",
            "Information Security management: A human challenge?",
            "Assessing the 'insider-outsider threat' duality in the context of the development of public-private partnerships delivering 'choice' in healthcare services: A sociomaterial critique.",
            "In a 'trusting' environment, everyone is responsible for information security.",
            "ISMS insider intrusion prevention and detection.",
            "Catching the malicious insider.",
            "Practical management of malicious insider threat - An enterprise CSIRT perspective.",
            "An extensible analysable system model.",
            "Information security management standards: Compliance, governance and risk management."
        ]
    },
    {
        "name": "JISA",
        "year": "2007",
        "info": "Volume 12: 2007",
        "count": 31,
        "papers": [
            "ISTR special issue on critical infrastructure protection.",
            "Simulation and test: Instruments for Critical Infrastructure Protection (CIP).",
            "Internet as a multiple graph structure: The role of the transport layer.",
            "The role of Wireless Sensor Networks in the area of Critical Information Infrastructure Protection.",
            "Security in Mobile IPv6: A survey.",
            "Connectivity models of interdependency in mixed-type critical infrastructure networks.",
            "Adaptive real-time anomaly detection with incremental clustering.",
            "Convergence.",
            "Can CLI be trusted?",
            "Risks due to convergence of physical security systems and information technology environments.",
            "Secure Mobile Architecture (SMA) - A way to fix the broken Internet.",
            "In the new converged world are we secure enough?",
            "When networks collide.",
            "Editorial.",
            "Grid security: Next steps.",
            "Daonity - Grid security from two levels of virtualization.",
            "On the deployment of a real scalable delegation service.",
            "Coordinated decision making in distributed applications.",
            "Embedded security in a pervasive world.",
            "The security challenges for mobile ubiquitous services.",
            "Ubiquitous security for ubiquitous computing.",
            "An effective multi-layered defense framework against spam.",
            "Introduction to this issue (12/4).",
            "Computational immunology and anomaly detection.",
            "Biology, immunology and information security.",
            "Survival in cyberspace.",
            "Biologically-inspired Complex Adaptive Systems approaches to Network Intrusion Detection.",
            "Sensing danger: Innate immunology for intrusion detection.",
            "Immunology, diversity, and homeostasis: The past and future of biologically inspired computer defenses.",
            "Immuno-inspired autonomic system for cyber defense.",
            "Dealing with software viruses: A biological paradigm."
        ]
    },
    {
        "name": "JISA",
        "year": "2006",
        "info": "Volume 11: 2006",
        "count": 30,
        "papers": [
            "Editorial.",
            "Information security and the law.",
            "Communication service providers: Forensic source and investigatory tool.",
            "Digital signature legislation: The first 10 years.",
            "ISMS, security standards and security regulations.",
            "Preparing Information Security for legal and regulatory compliance (Sarbanes-Oxley and Basel II).",
            "The Computer Misuse Act.",
            "The future of UK data protection regulation.",
            "Using IT governance and COBIT to deliver value with IT and respond to legal, regulatory and compliance challenges.",
            "A new institute for a new millennium.",
            "Introduction - Cryptography.",
            "Cryptography and trust.",
            "A cryptographic tour of the IPsec standards.",
            "An overview of RFID tags and new cryptographic developments.",
            "EMV card payments - An update.",
            "Integrity of intention (a theory of types for security APIs).",
            "Recent developments in cryptographic hash functions: Security implications and future directions.",
            "Security: An end user perspective.",
            "Biometrics: security: An end user perspective.",
            "What user-controlled identity management should learn from communities.",
            "Security standards: An end-user perspective.",
            "Security considerations for broadcast systems.",
            "On the potential of high density smart cards.",
            "The complexity of DPA type side channel attacks and their dependency on the algorithm design.",
            "Editorial for v.11 n.4 of the Information Security Technical Report: \"Windows Security Revisited\".",
            "Windows device interface security.",
            "NetHost-sensor: Monitoring a target host's application via system calls.",
            "Windows Vista security: First impressions.",
            "New Vistas in elliptic curve cryptography.",
            "Virtual machines for enterprise desktop security."
        ]
    },
    {
        "name": "JISA",
        "year": "2005",
        "info": "Volume 10: 2005",
        "count": 28,
        "papers": [
            "Introduction to February 2005 issue of ISTR.",
            "Introduction to Web services and their security.",
            "Web services and web service security standards.",
            "Notes from the field: Implementing a security solution for Web Services.",
            "Authorisation in Grid computing.",
            "Message level security for web services.",
            "Security in the Semantic Web using OWL.",
            "Trusted computing group history.",
            "AEGIS: A single-chip secure processor.",
            "Trusted computing and open source.",
            "Towards multilaterally secure computing platforms - with open source and trusted computing.",
            "An Advanced Trusted Platform for mobile phone devices.",
            "Compatibility, competition, and control in trusted computing environments.",
            "Trusted computing using AMD \"Pacifica\" and \"Presidio\" secure virtual machine technology.",
            "Introduction - Intrusion detection and prevention.",
            "Intrusion Detection Systems and Intrusion Prevention Systems.",
            "An overview of network evasion methods.",
            "Informing the decision process in an automated intrusion response system.",
            "Next-generation intrusion prevention: Accounting for the attack timeline.",
            "Data mining and machine learning - Towards reducing false positives in intrusion detection.",
            "Editorial: \"The security perimeter\".",
            "Inventing the future - The vision of the Jericho Forum.",
            "De-Perimeterisation: Benefits and limitations.",
            "Firewalls - Are they enough protection for current networks?",
            "The Laws of Vulnerabilities: Which security vulnerabilities really matter?",
            "The extended security perimeter.",
            "Web services: Developers dream or hackers heaven?",
            "Why 'Phish' when you can Trawl?"
        ]
    },
    {
        "name": "JISA",
        "year": "2004",
        "info": "Volume 9: 2004",
        "count": 31,
        "papers": [
            "Introduction.",
            "Business and technical motivation for identity management.",
            "The use of hardware tokens for identity management.",
            "Microsoft .NET Passport and identity management.",
            "Privacy-enhancing identity management.",
            "Privacy in enterprise identity federation - policies for Liberty 2 single sign on.",
            "Virtual organisations in computer grids and identity management.",
            "Identity management in mobile cellular networks and related applications.",
            "User provisioning with SPML.",
            "Introduction.",
            "Malicious software - past, present and future.",
            "The future of virus detection.",
            "Deconstructing malware: what it is and how to stop it.",
            "This business of malware.",
            "Sound of silence.",
            "Understanding today's malware.",
            "Business issues relating to malware.",
            "Introduction.",
            "Introduction to XML Encryption and XML Signature.",
            "Access control for XML documents and data.",
            "XML-based access control languages.",
            "The Open Digital Rights Language: XML for Digital Rights Management.",
            "Federated identity and web services.",
            "Dissecting application security XML schemas: AVDL, WAS, OVAL - state of the XML security standards report.",
            "Introduction.",
            "Secure mobile business applications - framework, architecture and implementation.",
            "Digital Rights Management: The Open Mobile Alliance DRM specifications.",
            "Trends in mobile security standards.",
            "RFID security.",
            "User requirements for security in wireless mobile systems.",
            "Mobile terminal security and tracking."
        ]
    },
    {
        "name": "JISA",
        "year": "2003",
        "info": "Volume 8: 2003",
        "count": 28,
        "papers": [
            "Introduction.",
            "Are we smart about security?",
            "An overview of the GlobalPlatform smart card specification.",
            "Defending against cache-based side-channel attacks.",
            "Secure SIM lifecycle management.",
            "Software attacks on smart cards.",
            "Overview about attacks on smart cards.",
            "Introduction.",
            "Forensic analysis on a Lotus Notes server.",
            "Addressing the data problem.",
            "Computer forensics: past, present and future.",
            "Some stepping stones in computer forensics.",
            "A comprehensive approach to digital incident investigation.",
            "Management strategies for implementing forensic security measures.",
            "Introduction.",
            "tScheme - voluntary approval for certificate authority services.",
            "Could there ever be a unitary digital certificate?",
            "A comparison between traditional public key infrastructures and identity-based cryptography.",
            "The NHS as a proving ground for cryptosystems.",
            "Introduction.",
            "The art of intrusion testing.",
            "An XML-based architecture to perform data integration and data unification in vulnerability assessments.",
            "Eliminating noise from intrusion detection systems.",
            "An historical perspective of software vulnerability management.",
            "Measuring vulnerabilities and their exploitation cycle.",
            "Penetration testing and social engineering: Hacking the weakest link.",
            "How to ensure an effective penetration test.",
            "Useful vulnerability assessment."
        ]
    },
    {
        "name": "JISA",
        "year": "2002",
        "info": "Volume 7: 2002",
        "count": 19,
        "papers": [
            "Introduction.",
            "Unix Filesystem Security.",
            "Vulnerability Management in Unix Environments.",
            "Design of Secure Unix.",
            "Securing the Shell - Implementing a Host Level Default Deny Policy.",
            "A Framework for Choosing Your Next Generation Authentication/Authorization System.",
            "Introduction.",
            "Is there a Need for Survivable Computation in Critical Infrastructures?",
            "Protecting the Critical National Infrastructure - Developing a Method for the Measurement of Threat Agents in an Information Environment.",
            "Benchmarking for Critical Infrastructure Protection.",
            "Information Sharing in the Cyber Age: a Key to Critical Infrastructure Protection.",
            "Securing the Critical IP Infrastructure.",
            "The UK Financial Sector's Place in the Critical National Infrastructure.",
            "Introduction.",
            "Who holds the key to IT security?",
            "New Advances in Automatic Gait Recognition.",
            "Biometric Standards - An Overview.",
            "Implementation of Biometric Systems - Security and Privacy Considerations.",
            "Spoofing and Anti-Spoofing Measures."
        ]
    },
    {
        "name": "JISA",
        "year": "2001",
        "info": "Volume 6: 2001",
        "count": 31,
        "papers": [
            "Introduction.",
            "What is a VPN?",
            "Implementing Virtual Private Networks in Today's Organization.",
            "VPN Security Policy.",
            "IPsec Networking Standards - An Overview.",
            "VPNs and Lightweight Clients.",
            "Enabling the User: The VPN in Context.",
            "Placement of Intelligence Within Networks to Provide Corporate VPN Services.",
            "Introduction.",
            "Database Security in a Web Environment.",
            "Role Based Access Control Models.",
            "Database Security: Retrospective and Way Forward.",
            "XML security.",
            "Security for Workflow Systems.",
            "Security in Federated Database Systems.",
            "Security for eBusiness.",
            "Security for Distributed Databases.",
            "Introduction.",
            "Information Security Risk Management - When Should It be Managed?",
            "Risk Assessment.",
            "Information Security Risks and Managed Security Service.",
            "Handling Distributed Denial-of-Service Attacks.",
            "Information Incident Management.",
            "Organizational Leader's Use Of Risk Management for Information Technology.",
            "Information Security Governance.",
            "Introduction.",
            "Red Alert.",
            "Pick'n'mix comparative tests.",
            "Travelling with Linux malware: Is Linux security for real?",
            "Worm's Fashion Salon.",
            "The Virus Writer and The Reporter."
        ]
    },
    {
        "name": "JISA",
        "year": "2000",
        "info": "Volume 5: 2000",
        "count": 30,
        "papers": [
            "Platform Security and Common Criteria.",
            "Platform Security: What is Lacking?",
            "High Security Modules - Still Needed Despite Advances in Platforms.",
            "How Strong do Platforms Need to be From a Legal Perspective?",
            "Computing Platform Security in Cyberspace.",
            "Windows 2000 Security: A Balanced View.",
            "Introduction.",
            "Computer Evidence - Recent Issues.",
            "Who's Bugging You? How Are You Protecting Your Information?",
            "PABX Security.",
            "The Role of Technology in Computer Forensic Investigations.",
            "The Computer Misuse Act 1990: Understanding and Applying the Law.",
            "IT as an Enabler of Computer Fraud.",
            "Introduction.",
            "Introduction to WAP's Wireless Transport Layer Security.",
            "The WAP Forum's Wireless Public Key Infrastructure.",
            "Bluetooth Security - An Overview.",
            "TETRA Security.",
            "Security for the Third Generation (3G) Mobile System.",
            "Design of Security Algorithms for Third Generation Mobile Telephony.",
            "Security Concerns in IP-Based Telephony: Covering TIPHON as a Case Study.",
            "Introduction.",
            "PKI standards.",
            "Implementing a PKI.",
            "The Intersection of Public Key Infrastructures and the Law.",
            "PKI - Panacea or Silver Bullet?",
            "Authorization Models - PKI Versus the Real World.",
            "Certificate Classes.",
            "Achieving Certainty in an Age of Uncertainty.",
            "Identrus - the 'Technical Platform'."
        ]
    },
    {
        "name": "JISA",
        "year": "1999",
        "info": "Volume 4: 1999",
        "count": 31,
        "papers": [
            "Introduction.",
            "Detection of fraud in mobile telecommunications.",
            "Detection of fraud in mobile telecommunications.",
            "Cryptographic algorithms in telecommunications systems.",
            "How secure are telecoms internetwork communications?",
            "Security issues in a satellite global GSM network.",
            "The direction of telecommunications security.",
            "Introduction.",
            "The chip in your wallet - The technology of security in smartcard chip manufacture.",
            "New security issues raised by open cards.",
            "Physical security of smartcards.",
            "Smartcard certfication.",
            "EMV - The ICC specifications for payment systems.",
            "Mitigating smart card risks.",
            "Mondex security strategy.",
            "Interfacing with smartcard applications - (ThOpen Card Framework and PC/SC).",
            "Introduction.",
            "Information warfare - what is it?",
            "Beyond boundary protection devices - The concept of recovery.",
            "International CIP policy: Problems and prospects.",
            "Footprinting for intrusion detection and threat assessment.",
            "Achieving information resiliency.",
            "Defensive information warfare.",
            "Introduction.",
            "The Advanced Encryption Standard (AES).",
            "Designing a practical Public Key Infrastructure (PKI).",
            "Padding attacks on RSA.",
            "Challenging the conventional view of PKI - will it really work?",
            "The NSAKEY in microsoft's crypto API: facts, fiction and speculation.",
            "The state of public-key cryptography - not only after the invention of quantum computers.",
            "Secure hashing in practice."
        ]
    },
    {
        "name": "JISA",
        "year": "1998",
        "info": "Volume 3: 1998",
        "count": 39,
        "papers": [
            "Introduction.",
            "Speaker recognition.",
            "An overview of fingerprint verification technologies.",
            "Recognizing people by their iris patterns.",
            "Facial recognition - An overview.",
            "Veincheck - A technical perspective.",
            "New perspectives in automatic signature verification.",
            "Implementation implications of biometrics.",
            "Measuring and comparing the performance of biometric systems.",
            "Security considerations in the use of biometric devices.",
            "Cardholder verification - Realities at point-of-sale.",
            "Will commercial applications for biometric-based solutions really take off in 1998?",
            "Biometrics - A civil liberties and privacy perspective.",
            "Biometrics and Turing's legacy.",
            "Introduction.",
            "Deploying public key infrastructures.",
            "Tools and protocols for E-commerce.",
            "Smartcards in secure Electronic Commerce.",
            "WYSIWYS? - What you see is what you sign?",
            "Security in CORBA-based electronic commerce systems.",
            "Data protection and Electronic Commerce.",
            "Java card technology and security.",
            "Public key network infrastructure: An evolutionary step in the ascent of WAN.",
            "EDI security.",
            "Introduction.",
            "Windows NT security architecture.",
            "Windows NT - Remote access.",
            "Developing a Windows NT security policy.",
            "Adding security labelling to Windows NT.",
            "Distributed security services in microsoft Windows NT 5.0 - Kerberos and the active directory.",
            "Kerberos authentication in Windows NT 5.0 domains.",
            "Introduction.",
            "Security monitoring in heterogeneous globally distributed environments.",
            "Network-versus host-based intrusion detection.",
            "Distributed security services in Microsoft Windows 2000 (Windows NT 5.0: Protecting data in the enterprise.",
            "Implementing a generalized tool for network monitoring.",
            "Networks - Where does the real threat lie?",
            "Fundamentals of computer forensics.",
            "The Vulnerability Instantiation Methodology prototype."
        ]
    },
    {
        "name": "JISA",
        "year": "1997",
        "info": "Volume 2: 1997",
        "count": 43,
        "papers": [
            "Introduction.",
            "Can the laws really cut down hacking?",
            "The regulation of virus research: Prosecution for 'unlawful research'?",
            "The common criteria - Good, bad or indifferent?",
            "Security evaluation and certification: The future of a national scheme.",
            "The European union data protection directive - Where are we? How did we get here? What next?",
            "Information privacy and security - A regulator's priorities.",
            "Customer privacy versus customer service.",
            "Impact of the EU data protection directive on transborder data flows.",
            "A commercial view of the OECD recommendations on cryptography policy.",
            "Stop that e-mail! you are probably breaking the law!",
            "Encryption controls are US government priority.",
            "Introduction.",
            "Introduction to cryptology.",
            "A brief history of cryptography.",
            "The difficulty of attacking cryptosystems.",
            "The data encryption standard.",
            "Authentication using cryptography.",
            "MACs and hash functions: State of the art.",
            "The management of symmetric keys.",
            "Cryptographic security in the internet protocol suite: Practice and proposals.",
            "Microsoft CryptoAPI.",
            "Elliptic curve cryptosystem - The answer to strong, fast public-key cryptography for securing constrained environments.",
            "Quantum cryptography: Protecting our future networks with quantum mechanics.",
            "Introduction.",
            "Security issues in today's corporate network.",
            "Commercial use of cryptography in the shell companies.",
            "Should TTPs be licensed?",
            "Network security: Anything but bulletproof.",
            "Thinking about firewalls V2.0: Beyond perimeter security.",
            "Strategic security for IP networks.",
            "Windows NT security.",
            "Unix network security.",
            "The relevance of penetration testing to corporate network security.",
            "Introduction.",
            "Digital signatures.",
            "Digital certificates and payment systems.",
            "A commercial future of public key cryptography: Shrink wrapping trust for profit.",
            "Applying cryptography within the ASPeCT Project.",
            "GSS-API.",
            "Network encryption.",
            "Cryptography systems: Putting theory into practice.",
            "User security enhancement: A worldwide security project."
        ]
    },
    {
        "name": "JISA",
        "year": "1996",
        "info": "Volume 1: 1996",
        "count": 29,
        "papers": [
            "Introduction.",
            "TTP concepts.",
            "Business requirements for secure electronic communications.",
            "Requirements for a trusted global public key initiative.",
            "Ethical trusted third party services - A new security approach.",
            "DTI views on the provision of encryption services on public networks.",
            "Bolero - A TTP project for the shipping industry.",
            "EBridge - A TTP project for business registers.",
            "Responsibilities of TTPs in trusted networks.",
            "Practical experiences with TTP schemes.",
            "The royal holloway TTP-based key escrow scheme.",
            "Introduction.",
            "The security of distributed systems - An overview.",
            "Securing a distributed environment - A practical case study.",
            "Managing access rights in the distributed world.",
            "Information protection and data back-up in a distributed environment.",
            "The truth behind single sign-on.",
            "Security in CORBA distributed object systems.",
            "Opening up business securely.",
            "Introduction.",
            "Trends in outsourcing.",
            "Security considerations in outsourcing IT services.",
            "The risk of allowing outside staff access to your information systems.",
            "A vendor's view.",
            "You can outsource many activities but not fraud!",
            "Obtaining assurance about your security.",
            "Security service level agreements for outsourced security functions.",
            "Outsourcing - A legal perspective on contract critical success factors.",
            "Information security standards for outsourcing."
        ]
    }
]