[
    {
        "name": "Journal of Cryptology",
        "year": "2022",
        "info": "Volume 35",
        "count": 9,
        "papers": [
            "Limits on the Efficiency of (Ring) LWE-Based Non-interactive Key Exchange.",
            "Correction to: Unconditionally Secure Computation Against Low-Complexity Leakage.",
            "A Bad Day to Die Hard: Correcting the Dieharder Battery.",
            "From Fairness to Full Security in Multiparty Computation.",
            "Actively Secure Setup for SPDZ.",
            "Locality-Preserving Oblivious RAM.",
            "Correction to: Unconditionally Secure Computation Against Low-Complexity Leakage.",
            "Semi-quantum Money.",
            "CCA Security and Trapdoor Functions via Key-Dependent-Message Security."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2021",
        "info": "Volume 34",
        "count": 44,
        "papers": [
            "Learning Strikes Again: The Case of the DRS Signature Scheme.",
            "Reusable Fuzzy Extractors for Low-Entropy Distributions.",
            "Toward Non-interactive Zero-Knowledge Proofs for NP from LWE.",
            "The Number of Almost Perfect Nonlinear Functions Grows Exponentially.",
            "Tighter Security Proofs for GPV-IBE in the Quantum Random Oracle Model.",
            "Quantum Lightning Never Strikes the Same State Twice. Or: Quantum Money from Cryptographic Assumptions.",
            "Bootstrapping for HElib.",
            "Can PPAD Hardness be Based on Standard Cryptographic Assumptions?",
            "Tight Tradeoffs in Searchable Symmetric Encryption.",
            "On the Local Leakage Resilience of Linear Secret Sharing Schemes.",
            "Placing Conditional Disclosure of Secrets in the Communication Complexity Universe.",
            "Round-Preserving Parallel Composition of Probabilistic-Termination Cryptographic Protocols.",
            "Bloom Filter Encryption and Applications to Efficient Forward-Secret 0-RTT Key Exchange.",
            "Obfuscating Circuits Via Composite-Order Graded Encoding.",
            "Editorial.",
            "Match Me if You Can: Matchmaking Encryption and Its Applications.",
            "On Subversion-Resistant SNARKs.",
            "Is There an Oblivious RAM Lower Bound for Online Reads?",
            "Round-Optimal Secure Multi-party Computation.",
            "Session Resumption Protocols and Efficient Forward Security for TLS 1.3 0-RTT.",
            "A Formal Analysis of Prefetching in Profiled Cache-Timing Attacks on Block Ciphers.",
            "Modeling for Three-Subset Division Property without Unknown Subset.",
            "Fine-Grained Cryptography Revisited.",
            "Introduction to the Special Issue on TLS 1.3.",
            "Simple and Generic Constructions of Succinct Functional Encryption.",
            "Secure Communication Channel Establishment: TLS 1.3 (over TCP Fast Open) versus QUIC.",
            "Selfie: reflections on TLS 1.3 with PSK.",
            "Watermarking Cryptographic Functionalities from Standard Lattice Assumptions.",
            "Adaptively Secure Distributed PRFs from sf LWE.",
            "On the Tight Security of TLS 1.3: Theoretically Sound Cryptographic Parameters for Real-World Deployments.",
            "The Deoxys AEAD Family.",
            "Ascon v1.2: Lightweight Authenticated Encryption and Hashing.",
            "Translating the Discrete Logarithm Problem on Jacobians of Genus 3 Hyperelliptic Curves with (ℓ , ℓ , ℓ )-Isogenies.",
            "High-Performance Multi-party Computation for Binary Circuits Based on Oblivious Transfer.",
            "Decomposable Obfuscation: A Framework for Building Applications of Obfuscation from Polynomial Hardness.",
            "The Design and Evolution of OCB.",
            "A Cryptographic Analysis of the TLS 1.3 Handshake Protocol.",
            "Unconditionally Secure Computation Against Low-Complexity Leakage.",
            "Injective Trapdoor Functions via Derandomization: How Strong is Rudich's Black-Box Barrier?",
            "On the Exact Round Complexity of Secure Three-Party Computation.",
            "Compact Designated Verifier NIZKs from the CDH Assumption Without Pairings.",
            "On Abelian and Homomorphic Secret Sharing Schemes.",
            "Fast Secure Two-Party ECDSA Signing.",
            "Internal Symmetries and Linear Properties: Full-permutation Distinguishers and Improved Collisions on Gimli."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2020",
        "info": "Volume 33",
        "count": 46,
        "papers": [
            "Solving LPN Using Covering Codes.",
            "TFHE: Fast Fully Homomorphic Encryption Over the Torus.",
            "Kummer for Genus One Over Prime-Order Fields.",
            "Identification Protocols and Signature Schemes Based on Supersingular Isogeny Problems.",
            "Topology-Hiding Computation on All Graphs.",
            "Practical Collision Attacks against Round-Reduced SHA-3.",
            "On the Power of Secure Two-Party Computation.",
            "Locally Decodable and Updatable Non-malleable Codes and Their Applications.",
            "From Cryptomania to Obfustopia Through Secret-Key Functional Encryption.",
            "From Minicrypt to Obfustopia via Private-Key Functional Encryption.",
            "Verifiable Random Functions from Non-interactive Witness-Indistinguishable Proofs.",
            "CryptHOL: Game-Based Proofs in Higher-Order Logic.",
            "Revisiting the Wrong-Key-Randomization Hypothesis.",
            "Feasibility and Infeasibility of Secure Computation with Malicious PUFs.",
            "Multi-theorem Preprocessing NIZKs from Lattices.",
            "Blockcipher-Based Authenticated Encryption: How Small Can We Go?",
            "Generic Attacks on Hash Combiners.",
            "An Optimal Distributed Discrete Log Protocol with Applications to Homomorphic Secret Sharing.",
            "Cryptanalytic Time-Memory-Data Trade-offs for FX-Constructions and the Affine Equivalence Problem.",
            "A Practical Forgery Attack on Lilliput-AE.",
            "The Communication Complexity of Private Simultaneous Messages, Revisited.",
            "Compact Adaptively Secure ABE for sf NC1 from k-Lin.",
            "Improved Key Recovery Attacks on Reduced-Round AES with Practical Data and Memory Complexities.",
            "Four-State Non-malleable Codes with Explicit Constant Rate.",
            "Multilinear Maps from Obfuscation.",
            "Spin Me Right Round Rotational Symmetry for FPGA-Specific AES: Extended Version.",
            "Block Cipher Invariants as Eigenvectors of Correlation Matrices.",
            "Meet-in-the-Middle Attacks and Structural Analysis of Round-Reduced PRINCE.",
            "Efficient and Scalable Universal Circuits.",
            "Tight Security of Cascaded LRW2.",
            "Statistical Concurrent Non-Malleable Zero-Knowledge from One-Way Functions.",
            "Oblivious Sampling with Applications to Two-Party k-Means Clustering.",
            "Adaptively Secure Non-interactive CCA-Secure Threshold Cryptosystems: Generic Framework and Constructions.",
            "Fast Multi-precision Multiplication for Public-Key Cryptography on Embedded Microprocessors.",
            "The IITM Model: A Simple and Expressive Model for Universal Composability.",
            "Joint State Composition Theorems for Public-Key Encryption and Digital Signature Functionalities with Local Computation.",
            "1/p-Secure Multiparty Computation without an Honest Majority and the Best of Both Worlds.",
            "Low Cost Constant Round MPC Combining BMR and Oblivious Transfer.",
            "Tightly Secure Hierarchical Identity-Based Encryption.",
            "Foundations of Fully Dynamic Group Signatures.",
            "Cryptanalysis of OCB2: Attacks on Authenticity and Confidentiality.",
            "A Formal Security Analysis of the Signal Messaging Protocol.",
            "Non-malleable Encryption: Simpler, Shorter, Stronger.",
            "Continuously Non-malleable Codes in the Split-State Model.",
            "PCPs and the Hardness of Generating Synthetic Data.",
            "Efficient Verifiable Delay Functions."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2019",
        "info": "Volume 32",
        "count": 36,
        "papers": [
            "Multidimensional Linear Cryptanalysis.",
            "Improved Combinatorial Algorithms for the Inhomogeneous Short Integer Solution Problem.",
            "On the Tightness of Forward-Secure Signature Reductions.",
            "Unifying Leakage Models: From Probing Attacks to Noisy Leakage.",
            "Round-Efficient Black-Box Construction of Composable Multi-Party Computation.",
            "On the Impossibility of Structure-Preserving Deterministic Primitives.",
            "Efficient RSA Key Generation and Threshold Paillier in the Two-Party Setting.",
            "Automated Analysis of Cryptographic Assumptions in Generic Group Models.",
            "Hardness-Preserving Reductions via Cuckoo Hashing.",
            "Non-black-box Simulation in the Fully Concurrent Setting, Revisited.",
            "From Physical to Stochastic Modeling of a TERO-Based TRNG.",
            "(Efficient) Universally Composable Oblivious Transfer Using a Minimal Number of Stateless Tokens.",
            "Structure-Preserving Signatures on Equivalence Classes and Constant-Size Anonymous Credentials.",
            "Cryptanalysis of the CLT13 Multilinear Map.",
            "On Tight Security Proofs for Schnorr Signatures.",
            "Key Establishment à la Merkle in a Quantum World.",
            "On Black-Box Complexity of Universally Composable Security in the CRS Model.",
            "Probabilistic Termination and Composability of Cryptographic Protocols.",
            "Leakage Resilience from Program Obfuscation.",
            "The Magic of ELFs.",
            "Koblitz Curves over Quadratic Fields.",
            "Beyond Conventional Security in Sponge-Based Authenticated Encryption Modes.",
            "Oblivious Network RAM and Leveraging Parallelism to Achieve Obliviousness.",
            "Efficient Fully Structure-Preserving Signatures and Shrinking Commitments.",
            "Efficient Constant-Round Multi-party Computation Combining BMR and SPDZ.",
            "Classical Leakage Resilience from Fault-Tolerant Quantum Computation.",
            "White-Box Cryptography: Don't Forget About Grey-Box Attacks.",
            "Constant-Round Maliciously Secure Two-Party Computation in the RAM Model.",
            "What Security Can We Achieve Within 4 Rounds?",
            "Making Masking Security Proofs Concrete (Or How to Evaluate the Security of Any Leaking Device), Extended Version.",
            "Updating Key Size Estimations for Pairings.",
            "Small CRT-Exponent RSA Revisited.",
            "Nonlinear Invariant Attack: Practical Attack on Full SCREAM, iSCREAM, and Midori64.",
            "Cryptanalysis of NORX v2.0.",
            "Efficient Dissection of Bicomposite Problems with Cryptanalytic Applications.",
            "Fully Secure Functional Encryption with a Large Class of Relations from the Decisional Linear Assumption."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2018",
        "info": "Volume 31",
        "count": 32,
        "papers": [
            "Minimizing Locality of One-Way Functions via Semi-private Randomized Encodings.",
            "Practical Homomorphic Message Authenticators for Arithmetic Circuits.",
            "Functional Encryption for Randomized Functionalities in the Private-Key Setting from Minimal Assumptions.",
            "Making the Impossible Possible.",
            "Incremental Deterministic Public-Key Encryption.",
            "How Many Queries are Needed to Distinguish a Truncated Random Permutation from a Random Function?",
            "A Black-Box Construction of Non-malleable Encryption from Semantically Secure Encryption.",
            "Function-Private Functional Encryption in the Private-Key Setting.",
            "All-But-Many Encryption.",
            "Optimal Security Proofs for Full Domain Hash, Revisited.",
            "Robust Encryption.",
            "Multivariate High-Order Attacks of Shuffled Tables Recomputation.",
            "Practical Cryptanalysis of Bluetooth Encryption with Condition Masking.",
            "Multi-input Functional Encryption in the Private-Key Setting: Stronger Security from Weaker Assumptions.",
            "Deterministic Encryption with the Thorp Shuffle.",
            "Oblivious Polynomial Evaluation and Secure Set-Intersection from Algebraic PRFs.",
            "Characterization of Secure Multiparty Computation Without Broadcast.",
            "Improved Security Proofs in Lattice-Based Cryptography: Using the Rényi Divergence Rather than the Statistical Distance.",
            "Efficient Slide Attacks.",
            "Completeness for Symmetric Two-Party Functionalities: Revisited.",
            "On Constructing One-Way Permutations from Indistinguishability Obfuscation.",
            "On the Feasibility of Extending Oblivious Transfer.",
            "Asymptotically Efficient Lattice-Based Digital Signatures.",
            "Fast Garbling of Circuits Under Standard Assumptions.",
            "Key-Recovery Attacks on ASASA.",
            "Stream Ciphers: A Practical Solution for Efficient Homomorphic-Ciphertext Compression.",
            "Related-Key Security for Pseudorandom Functions Beyond the Linear Barrier.",
            "Everlasting Multi-party Computation.",
            "Deterministic Public-Key Encryption for Adaptively-Chosen Plaintext Distributions.",
            "Minimizing the Two-Round Even-Mansour Cipher.",
            "On the (Im-)Possibility of Extending Coin Toss.",
            "Fast Multi-precision Multiplication for Public-Key Cryptography on Embedded Microprocessors."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2017",
        "info": "Volume 30",
        "count": 33,
        "papers": [
            "Weak Locking Capacity of Quantum Channels Can be Much Larger Than Private Capacity.",
            "Dynamic Proofs of Retrievability Via Oblivious RAM.",
            "A Full Proof of the BGW Protocol for Perfectly Secure Multiparty Computation.",
            "Bounded Tamper Resilience: How to Go Beyond the Algebraic Barrier.",
            "Non-malleable Coding Against Bit-Wise and Split-State Tampering.",
            "An Algebraic Framework for Diffie-Hellman Assumptions.",
            "Obfuscating Conjunctions.",
            "Efficient One-Sided Adaptively Secure Computation.",
            "Design Methodology and Validity Verification for a Reactive Countermeasure Against EM Attacks.",
            "Acoustic Cryptanalysis.",
            "Secret-Sharing for NP.",
            "Security of Blind Signatures Revisited.",
            "The Security of Tandem-DM in the Ideal Cipher Model.",
            "Efficient Cryptosystems From 2k-th Power Residue Symbols.",
            "Photonic Side-Channel Analysis of Arbiter PUFs.",
            "Jacobian Coordinates on Genus 2 Curves.",
            "Reconciling Non-malleability with Homomorphic Encryption.",
            "Locally Computable UOWHF with Linear Shrinkage.",
            "Merkle's Key Agreement Protocol is Optimal: An O(n2) Attack on Any Key Agreement from Random Oracles.",
            "Short Signatures from Diffie-Hellman: Realizing Almost Compact Public Key.",
            "Lattices with Symmetry.",
            "More Efficient Oblivious Transfer Extensions.",
            "Differential-Linear Cryptanalysis Revisited.",
            "Instantiability of RSA-OAEP Under Chosen-Plaintext Attack.",
            "Integral Cryptanalysis on Full MISTY1.",
            "From Private Simultaneous Messages to Zero-Information Arthur-Merlin Protocols and Back.",
            "The Hunting of the SNARK.",
            "Information Theoretical Cryptogenography.",
            "Shorter Quasi-Adaptive NIZK Proofs for Linear Subspaces.",
            "Fairness Versus Guaranteed Output Delivery in Secure Multiparty Computation.",
            "Reproducible Circularly Secure Bit Encryption: Applications and Realizations.",
            "Efficient Authentication from Hard Learning Problems.",
            "Authenticated Confidential Channel Establishment and the Security of TLS-DHE."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2016",
        "info": "Volume 29",
        "count": 26,
        "papers": [
            "Enhanced Public Key Security for the McEliece Cryptosystem.",
            "Fast Cryptography in Genus 2.",
            "How to Build an Ideal Cipher: The Indifferentiability of the Feistel Construction.",
            "Efficient Set Intersection with Simulation-Based Security.",
            "Concurrent Knowledge Extraction in Public-Key Models.",
            "Breaking RSA May Be As Difficult As Factoring.",
            "Automata Evaluation and Text Search Protocols with Simulation-Based Security.",
            "Limits on the Usefulness of Random Oracles.",
            "Secret-Sharing Schemes for Very Dense Graphs.",
            "Structure-Preserving Signatures and Commitments to Group Elements.",
            "Signature Schemes Secure Against Hard-to-Invert Leakage.",
            "Fast Cut-and-Choose-Based Protocols for Malicious and Covert Adversaries.",
            "An Optimally Fair Coin Toss.",
            "Leakage-Resilient Cryptography from Minimal Assumptions.",
            "Garbling XOR Gates \"For Free\" in the Standard Model.",
            "A Dichotomy for Local Small-Bias Generators.",
            "Tightly Secure Signatures From Lossy Identification Schemes.",
            "Practical Cryptanalysis of ISO 9796-2 and EMV Signatures.",
            "New Second-Preimage Attacks on Hash Functions.",
            "Key Recovery Attacks on Iterated Even-Mansour Encryption Schemes.",
            "Unconditionally Anonymous Ring and Mesh Signatures.",
            "Bug Attacks.",
            "The ℚ-curve Construction for Endomorphism-Accelerated Elliptic Curves.",
            "Constant-Size Structure-Preserving Signatures: Generic Constructions and Simple Assumptions.",
            "Toward a Game Theoretic View of Secure Computation.",
            "Cryptanalysis of Full RIPEMD-128."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2015",
        "info": "Volume 28",
        "count": 28,
        "papers": [
            "Slidex Attacks on the Even-Mansour Encryption Scheme.",
            "Subtleties in the Definition of IND-CCA: When and How Should Challenge Decryption Be Disallowed?",
            "Efficient Asynchronous Verifiable Secret Sharing and Multiparty Computation.",
            "Cryptanalysis of SHA-0 and Reduced SHA-1.",
            "Quantum Private Information Retrieval has Linear Communication Complexity.",
            "Confined Guessing: New Signatures From Standard Assumptions.",
            "New Attacks on IDEA with at Least 6 Rounds.",
            "Efficient Recursive Diffusion Layers for Block Ciphers and Hash Functions.",
            "The Rebound Attack and Subspace Distinguishers: Application to Whirlpool.",
            "From Non-adaptive to Adaptive Pseudorandom Functions.",
            "An Efficient Protocol for Secure Two-Party Computation in the Presence of Malicious Adversaries.",
            "Computing on Authenticated Data.",
            "Improved Single-Key Attacks on 8-Round AES-192 and AES-256.",
            "GNUC: A New Universal Composability Framework.",
            "On the Complexity of Constructing Pseudorandom Functions (Especially when They Don't Exist).",
            "How to Achieve Perfect Simulation and a Complete Problem for Non-interactive Perfect Zero-Knowledge.",
            "Protocols for Multiparty Coin Toss with a Dishonest Majority.",
            "Polynomial-Time Solutions of Computational Problems in Noncommutative-Algebraic Cryptography.",
            "Provable Unlinkability Against Traffic Analysis with Low Message Overhead.",
            "Tight Security for Signature Schemes Without Random Oracles.",
            "A Unified Approach to Deterministic Encryption: New Constructions and a Connection to Computational Entropy.",
            "Reflection Cryptanalysis of PRINCE-Like Ciphers.",
            "Almost-Everywhere Secure Computation with Edge Corruptions.",
            "On Weak Keys and Forgery Attacks Against Polynomial-Based MAC Schemes.",
            "Spreading Alerts Quietly and the Subgroup Escape Problem.",
            "Using Fully Homomorphic Hybrid Encryption to Minimize Non-interative Zero-Knowledge Proofs.",
            "New Proofs for NMAC and HMAC: Security without Collision Resistance.",
            "Collision Attack on Grindahl."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2014",
        "info": "Volume 27",
        "count": 24,
        "papers": [
            "An Efficient State Recovery Attack on the X-FCSR Family of Stream Ciphers.",
            "A One-Time Stegosystem and Applications to Efficient Covert Communication.",
            "Concurrent Zero Knowledge, Revisited.",
            "(Non-)Random Sequences from (Non-)Random Permutations - Analysis of RC4 Stream Cipher.",
            "A New Interactive Hashing Theorem.",
            "Security Models and Proof Strategies for Plaintext-Aware Encryption.",
            "Erratum to: A Comparison of Cryptanalytic Tradeoff Algorithms.",
            "Improved Practical Attacks on Round-Reduced Keccak.",
            "Better Security for Deterministic Public-Key Encryption: The Auxiliary-Input Setting.",
            "Four-Dimensional Gallant-Lambert-Vanstone Scalar Multiplication.",
            "On the Amortized Complexity of Zero-Knowledge Protocols.",
            "On Strong Simulation and Composable Point Obfuscation.",
            "Computationally Secure Pattern Matching in the Presence of Malicious Adversaries.",
            "Robust Multi-Property Combiners for Hash Functions.",
            "Key-Dependent Message Security: Generic Amplification and Completeness.",
            "Rotational Rebound Attacks on Reduced Skein.",
            "On Best-Possible Obfuscation.",
            "Cryptography in the Multi-string Model.",
            "Verifiable Random Functions: Relations to Identity-Based Key Encapsulation and New Constructions.",
            "Using Symmetries in the Index Calculus for Elliptic Curves Discrete Logarithm.",
            "Authenticated Adversarial Routing.",
            "Improved Cryptanalysis of AES-like Permutations.",
            "A Characterization of Chameleon Hash Functions and New, Efficient Designs.",
            "A Practical-Time Related-Key Attack on the KASUMI Cryptosystem Used in GSM and 3G Telephony."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2013",
        "info": "Volume 26",
        "count": 24,
        "papers": [
            "Public-Coin Parallel Zero-Knowledge for NP.",
            "Slender-Set Differential Cryptanalysis.",
            "More Constructions of Lossy and Correlation-Secure Trapdoor Functions.",
            "Analysis of an Unconditionally Secure Distributed Oblivious Transfer.",
            "Secure Integration of Asymmetric and Symmetric Encryption Schemes.",
            "Practical Chosen Ciphertext Secure Encryption from Factoring.",
            "Elliptic Curve Discrete Logarithm Problem over Small Degree Extension Fields - Application to the Static Diffie-Hellman Problem on $E(\\mathbb{F}_{q^{5}})$.",
            "Input Locality and Hardness Amplification.",
            "A Single-Key Attack on the Full GOST Block Cipher.",
            "Predicate Encryption Supporting Disjunctions, Polynomial Equations, and Inner Products.",
            "On the Analysis of Cryptographic Assumptions in the Generic Ring Model.",
            "A Note on the Bivariate Coppersmith Theorem.",
            "Mercurial Commitments with Applications to Zero-Knowledge Sets.",
            "Logic Minimization Techniques with Applications to Cryptology.",
            "Quark: A Lightweight Hash.",
            "Sequential Aggregate Signatures, Multisignatures, and Verifiably Encrypted Signatures Without Random Oracles.",
            "Polynomial Runtime and Composability.",
            "Compact Proofs of Retrievability.",
            "Enhancements of Trapdoor Permutations.",
            "Fully Leakage-Resilient Signatures.",
            "A Comparison of Cryptanalytic Tradeoff Algorithms.",
            "A Note on Constant-Round Zero-Knowledge Proofs of Knowledge.",
            "FlipIt: The Game of \"Stealthy Takeover\".",
            "Round-Optimal Password-Based Authenticated Key Exchange."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2012",
        "info": "Volume 25",
        "count": 23,
        "papers": [
            "Resource Requirements of Private Quantum Channels and Consequences for Oblivious Remote State Preparation.",
            "Partial Fairness in Secure Two-Party Computation.",
            "Which Languages Have 4-Round Zero-Knowledge Proofs?",
            "Secure Proxy Signature Schemes for Delegation of Signing Rights.",
            "Parallel Repetition of Computationally Sound Protocols Revisited.",
            "A Practical Attack on KeeLoq.",
            "Smooth Projective Hashing and Two-Message Oblivious Transfer.",
            "Accelerating Pollard's Rho Algorithm on Finite Fields.",
            "Provably-Secure Time-Bound Hierarchical Key Assignment Schemes.",
            "A Simple Variant of the Merkle-Damgård Scheme with a Permutation.",
            "Multi-Verifier Signatures.",
            "The Extended k-tree Algorithm.",
            "Efficient Set Operations in the Presence of Malicious Adversaries.",
            "Ideal Multipartite Secret Sharing Schemes.",
            "Perfectly Balanced Boolean Functions and Golić Conjecture.",
            "Programmable Hash Functions and Their Applications.",
            "Computational Indistinguishability Between Quantum States and Its Cryptographic Application.",
            "Graph Coloring Applied to Secure Computation in Non-Abelian Groups.",
            "Bonsai Trees, or How to Delegate a Lattice Basis.",
            "On-line Ciphers and the Hash-CBC Constructions.",
            "Secure Two-Party Computation via Cut-and-Choose Oblivious Transfer.",
            "Batch Verification of Short Signatures.",
            "Security Analysis of Randomize-Hash-then-Sign Digital Signatures."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2011",
        "info": "Volume 24",
        "count": 26,
        "papers": [
            "Practical Collisions for EnRUPT.",
            "An L(1/3) Discrete Logarithm Algorithm for Low Degree Curves.",
            "Wildcarded Identity-Based Encryption.",
            "Universally Composable Symbolic Security Analysis.",
            "Cryptanalysis of the Tillich-Zémor Hash Function.",
            "Utility Dependence in Correct and Fair Rational Secret Sharing.",
            "Efficient Non-Malleable Commitment Schemes.",
            "Guest Editorial.",
            "Glitch and Laser Fault Attacks onto a Secure AES Implementation on a SRAM-Based FPGA.",
            "Mutual Information Analysis: a Comprehensive Study.",
            "Secure Hardware Implementation of Nonlinear Functions in the Presence of Glitches.",
            "Side-Channel Resistant Crypto for Less than 2, 300 GE.",
            "Fault-Based Attack on Montgomery's Ladder Algorithm.",
            "Improved Ring Oscillator PUF: An FPGA-friendly Secure Primitive.",
            "On the Security of Oscillator-Based Random Number Generators.",
            "Breaking the Stream Ciphers F-FCSR-H and F-FCSR-16 in Real Time.",
            "Endomorphisms for Faster Elliptic Curve Cryptography on a Large Class of Curves.",
            "Possibility and Impossibility Results for Selective Decommitments.",
            "Impossibility Results for Universal Composability in Public-Key Models and with Fixed Inputs.",
            "Short Undeniable Signatures Based on Group Homomorphisms.",
            "Tweakable Block Ciphers.",
            "Resource Fairness and Composability of Cryptographic Protocols.",
            "Efficient Selective Identity-Based Encryption Without Random Oracles.",
            "Securely Obfuscating Re-Encryption.",
            "Secure Computation Without Authentication.",
            "Adaptive Zero-Knowledge Proofs and Adaptively Secure Oblivious Transfer."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2010",
        "info": "Volume 23",
        "count": 20,
        "papers": [
            "On Expected Probabilistic Polynomial-Time Adversaries: A Suggestion for Restricted Definitions and Their Benefits.",
            "Efficient Cache Attacks on AES, and Countermeasures.",
            "Cryptanalysis of MD2.",
            "A New and Improved Paradigm for Hybrid Encryption Secure Against Chosen-Ciphertext Attack.",
            "Obfuscation for Cryptographic Purposes.",
            "The RSA Group is Pseudo-Free.",
            "The TLS Handshake Protocol: A Modular Analysis.",
            "A Taxonomy of Pairing-Friendly Elliptic Curves.",
            "Security Against Covert Adversaries: Efficient Protocols for Realistic Adversaries.",
            "How Should We Solve Search Problems Privately?",
            "Secure Computation of the Median (and Other Elements of Specified Ranks).",
            "Parallel and Concurrent Security of the HB and HB+ Protocols.",
            "Efficient Protocols for Set Intersection and Pattern Matching with Security Against Malicious and Covert Adversaries.",
            "Discrete Logarithm Problems with Auxiliary Inputs.",
            "On the Efficient Generation of Prime-Order Elliptic Curves.",
            "Structural Cryptanalysis of SASAS.",
            "An Analysis of the Blockcipher-Based Hash Functions from PGV.",
            "A Verifiable Secret Shuffle of Homomorphic Encryptions.",
            "On d-Multiplicative Secret Sharing.",
            "Long-Term Security and Universal Composability."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2009",
        "info": "Volume 22",
        "count": 20,
        "papers": [
            "Security Proofs for Identity-Based Identification and Signature Schemes.",
            "A Public Key Cryptosystem Based on Non-abelian Finite Groups.",
            "Chernoff-Type Direct Product Theorems.",
            "Cryptographic Hash Functions from Expander Graphs.",
            "Ring Signatures: Stronger Definitions, and Constructions without Random Oracles.",
            "Learning a Parallelepiped: Cryptanalysis of GGH and NTRU Signatures.",
            "A Proof of Security of Yao's Protocol for Two-Party Computation.",
            "Non-interactive Timestamping in the Bounded-Storage Model.",
            "Multipartite Secret Sharing by Bivariate Interpolation.",
            "Constructive and Destructive Use of Compilers in Elliptic Curve Cryptography.",
            "Reducing Complexity Assumptions for Statistically-Hiding Commitment.",
            "On the Impossibility of Highly-Efficient Blockcipher-Based Hash Functions.",
            "Using Abelian Varieties to Improve Pairing-Based Cryptography.",
            "Upper and Lower Bounds on Black-Box Steganography.",
            "General Composition and Universal Composability in Secure Multiparty Computation.",
            "Cryptography with Constant Input Locality.",
            "The Twin Diffie-Hellman Problem and Applications.",
            "Isogenies and the Discrete Logarithm Problem in Jacobians of Genus 3 Hyperelliptic Curves, .",
            "Efficient Non-malleable Commitment Schemes.",
            "New Approaches for Deniable Authentication."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2008",
        "info": "Volume 21",
        "count": 20,
        "papers": [
            "Practical Construction and Analysis of Pseudo-Randomness Primitives.",
            "Cryptanalysis of ISO/IEC 9796-1.",
            "Simpler Session-Key Generation from Short Random Passwords.",
            "Tag-KEM/DEM: A New Framework for Hybrid Encryption.",
            "On Probability of Success in Linear and Differential Cryptanalysis.",
            "Short Signatures Without Random Oracles and the SDH Assumption in Bilinear Groups.",
            "Generic Constructions of Identity-Based and Certificateless KEMs.",
            "Lower Bounds and Impossibility Results for Concurrent Self Composition.",
            "Probabilistic Reliability and Privacy of Communication Using Multicast in General Neighbor Networks.",
            "Structural Attacks for Public Key Cryptosystems based on Gabidulin Codes.",
            "Handling Expected Polynomial-Time Strategies in Simulation-Based Security Proofs.",
            "Searchable Encryption Revisited: Consistency Properties, Relation to Anonymous IBE, and Extensions.",
            "Instant Ciphertext-Only Cryptanalysis of GSM Encrypted Communication.",
            "Cryptanalysis of an E0-like Combiner with Memory.",
            "Cryptanalysis of the Shpilrain-Ushakov Protocol for Thompson's Group.",
            "Authenticated Encryption: Relations among Notions and Analysis of the Generic Composition Paradigm.",
            "On the Relationships between Notions of Simulation-Based Security.",
            "Encryption Modes with Almost Free Message Integrity.",
            "New Binding-Concealing Trade-Offs for Quantum String Commitment.",
            "Index Calculus in Class Groups of Non-hyperelliptic Curves of Genus Three."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2007",
        "info": "Volume 20",
        "count": 20,
        "papers": [
            "Another Look at \"Provable Security\".",
            "Deterministic Polynomial-Time Equivalence of Computing the RSA Secret Key and Factoring.",
            "Secure Distributed Key Generation for Discrete-Log Based Cryptosystems.",
            "Scalable Protocols for Authenticated Group Key Exchange.",
            "Trapdoor Hard-to-Invert Group Isomorphisms and Their Application to Password-Based Authentication.",
            "The Security of the IAPM and IACBC Modes.",
            "Constant-Round Oblivious Transfer in the Bounded Storage Model.",
            "Formal Proofs for the Security of Signcryption.",
            "Hierarchical Threshold Secret Sharing.",
            "A Forward-Secure Public-Key Encryption Scheme.",
            "Robust Information-Theoretic Private Information Retrieval.",
            "On Unconditionally Secure Distributed Oblivious Transfer.",
            "Primality Proving via One Round in ECPP and One Iteration in AKS.",
            "Theoretical Cryptanalysis of the Klimov-Shamir Number Generator TF-1.",
            "Robust and Efficient Sharing of RSA Functions.",
            "RSA-Based Undeniable Signatures.",
            "Reconciling Two Views of Cryptography (The Computational Soundness of Formal Encryption).",
            "Private Searching on Streaming Data.",
            "Concurrent Composition of Secure Protocols in the Timing Model.",
            "Efficient Signature Schemes with Tight Reductions to the Diffie-Hellman Problems."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2006",
        "info": "Volume 19",
        "count": 17,
        "papers": [
            "An Extension of Kedlaya's Algorithm to Hyperelliptic Curves in Characteristic 2.",
            "Threshold Password-Authenticated Key Exchange.",
            "Characterization of Security Notions for Probabilistic Private-Key Encryption.",
            "The Impossibility of Basing One-Way Permutations on Central Cryptographic Primitives.",
            "An Elliptic Curve Trapdoor System.",
            "On the Limitations of Universally Composable Two-Party Computation Without Set-Up Assumptions.",
            "Strengthening Zero-Knowledge Protocols Using Signatures.",
            "An Improved Real-Quadratic-Field-Based Key Exchange Procedure.",
            "Session-Key Generation Using Human Passwords Only.",
            "Private Computation: k-Connected versus 1-Connected Networks.",
            "A Simpler Construction of CCA2-Secure Public-KeyEncryption under General Assumptions.",
            "A Proof of the Security of Quantum Key Distribution.",
            "Known-IV, Known-in-Advance-IV, and Replayed-and-Known-IV Attacks on Multiple Modes of Operation of Block Ciphers.",
            "On the Fly Authentication and Signature Schemes Based on Groups of Unknown Order.",
            "An Extended Quadratic Frobenius Primality Test with Average- and Worst-Case Error Estimate.",
            "Completeness in Two-Party Secure Computation: A Computational View.",
            "Elliptic Curves with Low Embedding Degree."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2005",
        "info": "Volume 18",
        "count": 18,
        "papers": [
            "Computationally Secure Oblivious Transfer.",
            "Minimal Complete Primitives for Secure Multi-Party Computation.",
            "Analysis of the Sliding Window Powering Algorithm.",
            "Building Curves with Arbitrary Small MOV Degree over Finite Prime Fields.",
            "An Improved Pseudo-Random Generator Based on the Discrete Logarithm Problem.",
            "CBC MACs for Arbitrary-Length Messages: The Three-Key Constructions.",
            "Efficient Quantum Key Distribution Scheme and a Proof of Its Unconditional Security.",
            "Low Bandwidth Dynamic Traitor Tracing Schemes.",
            "Preface.",
            "Byzantine Agreement Given Partial Broadcast.",
            "Random Oracles in Constantinople: Practical Asynchronous Byzantine Agreement Using Cryptography.",
            "Secure Multi-Party Computation without Agreement.",
            "Cryptanalysis of Skipjack Reduced to 31 Rounds Using Impossible Differentials.",
            "Secure Classical Bit Commitment Using Fixed Capacity Communication Channels.",
            "Polynomial and Normal Bases for Finite Fields.",
            "The Complexity of Certain Multi-Exponentiation Techniques in Cryptography.",
            "Partial Key Recovery Attack Against RMAC.",
            "Analysis and Design of Distributed Key Distribution Centers."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2004",
        "info": "Volume 17",
        "count": 15,
        "papers": [
            "Preface.",
            "Optimal Randomizer Efficiency in the Bounded-Storage Model.",
            "Encryption against Storage-Bounded Adversaries from On-Line Strong Extractors.",
            "Constructing Locally Computable Extractors and Cryptosystems in the Bounded-Storage Model.",
            "RSA-OAEP Is Secure under the RSA Assumption.",
            "The Full Cost of Cryptanalytic Attacks.",
            "Reducing the Servers' Computation in Private Information Retrieval: PIR with Preprocessing.",
            "Adaptive versus Non-Adaptive Security of Multi-Party Protocols.",
            "Nearly One-Sided Tests and the Goldreich?Levin Predicate.",
            "Preface.",
            "The Weil Pairing, and Its Efficient Calculation.",
            "A One Round Protocol for Tripartite Diffie-Hellman.",
            "Evidence that XTR Is More Secure than Supersingular Elliptic Curve Cryptosystems.",
            "Short Signatures from the Weil Pairing.",
            "Efficient Implementation of Pairing-Based Cryptosystems."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2003",
        "info": "Volume 16",
        "count": 12,
        "papers": [
            "Efficient Amplification of the Security of Weak Pseudo-Random Function Generators.",
            "Buses for Anonymous Message Delivery.",
            "Edit Probability Correlation Attacks on Stop/ Go Clocked Keystream Generators.",
            "On the Security of Modular Exponentiation with Application to the Construction of Pseudorandom Generators.",
            "Trading Help for Interaction in Statistical Zero-Knowledge Proofs.",
            "A Probable Prime Test with Very High Confidence for n L 3 mod 4.",
            "Parallel Coin-Tossing and Constant-Round Secure Two-Party Computation.",
            "The One-More-RSA-Inversion Problems and the Security of Chaum's Blind Signature Scheme.",
            "Oblivious Transfers and Privacy Amplification.",
            "Separating Decision Diffie-Hellman from Computational Diffie-Hellman in Cryptographic Groups.",
            "Decorrelation: A Theory for Block Cipher Security.",
            "Generating Random Factored Numbers, Easily."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2002",
        "info": "Volume 15",
        "count": 16,
        "papers": [
            "Improving the Exact Security of Digital Signature Schemes.",
            "Constructive and Destructive Facets of Weil Descent on Elliptic Curves.",
            "Cryptanalysis of the ANSI X9.52 CBCM Mode.",
            "A Cipher Based on Data-Dependent Permutations.",
            "Securing Threshold Cryptosystems against Chosen Ciphertext Attack.",
            "Constructing Pseudo-Random Permutations with a Prescribed Structure.",
            "Reconciling Two Views of Cryptography (The Computational Soundness of Formal Encryption).",
            "Elliptic Curve Paillier Schemes.",
            "Authenticated Key Exchange Provably Secure Against the Man-in-the-Middle Attack.",
            "The Insecurity of the Digital Signature Algorithm with Partially Known Nonces.",
            "Privacy Preserving Data Mining.",
            "The Security of Feistel Ciphers with Six Rounds or Less.",
            "OAEP Reconsidered.",
            "Paillier's Trapdoor Function Hides up to O(n) Bits.",
            "A Note on Negligible Functions.",
            "New Approaches to Designing Public Key Cryptosystems Using One-Way Functions and Trapdoors in Finite Groups."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2001",
        "info": "Volume 14",
        "count": 15,
        "papers": [
            "On the Existence of Secure Keystream Generators.",
            "How to Protect DES Against Exhaustive Key Search (an Analysis of DESX).",
            "Universal Service-Providers for Private Information Retrieval.",
            "Weakness in Quaternion Signatures.",
            "Cryptanalysis of the Chor - Rivest Cryptosystem.",
            "On the Importance of Eliminating Errors in Cryptographic Computations.",
            "Secure Communication in Multicast Channels: The Answer to Franklin and Wright's Question.",
            "Decomposing Attacks on Asymmetric Cryptography Based on Mapping Compositions.",
            "Efficient Arithmetic in Finite Field Extensions with Application in Elliptic Curve Cryptography.",
            "Complexity Bounds on General Hard-Core Predicates.",
            "Attacks on Block Ciphers of Low Algebraic Degree.",
            "Dynamic Traitor Tracing.",
            "Public Key Cryptosystems Based on Drinfeld Modules Are Insecure.",
            "Almost k-Wise Independent Sample Spaces and Their Cryptologic Applications.",
            "Selecting Cryptographic Key Sizes."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "2000",
        "info": "Volume 13",
        "count": 20,
        "papers": [
            "Preface.",
            "Secure Communication in Minimal Connectivity Models.",
            "Player Simulation and General Adversary Structures in Perfect Multiparty Computation.",
            "Maintaining Authenticated Communication in the Presence of Break-Ins.",
            "Randomness versus Fault-Tolerance.",
            "Security and Composition of Multiparty Cryptographic Protocols.",
            "Practical Aspects of Quantum Cryptographic Key Distribution.",
            "Stronger Security Proofs for RSA and Rabin Bits.",
            "Fast Correlation Attacks on the Summation Generator.",
            "A New Public-Key Cryptosystem over a Quadratic Order with Quadratic Decryption Time.",
            "Robust and Efficient Sharing of RSA Functions.",
            "Maximum Correlation Analysis of Nonlinear Combining Functions in Stream Ciphers.",
            "CBC MAC for Real-Time Data Sources.",
            "On Polynomial Approximation of the Discrete Logarithm and the Diffie - Hellman Mapping.",
            "Security Arguments for Digital Signatures and Blind Signatures.",
            "RSA-Based Undeniable Signatures.",
            "A Detailed Analysis of SAFER K.",
            "Kangaroos, Monopoly and Discrete Logarithms.",
            "Short Non-Interactive Cryptographic Proofs.",
            "Computing Discrete Logarithms in Quadratic Orders."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1999",
        "info": "Volume 12",
        "count": 16,
        "papers": [
            "Parallel Collision Search with Cryptanalytic Applications.",
            "On the Construction of Pseudorandom Permutations: Luby-Rackoff Revisited.",
            "A Fast Diffie-Hellman Protocol in Genus 2.",
            "Efficient Commitment Schemes with Bounded Sender and Unbounded Receiver.",
            "Bucket Hashing and Its Application to Fast Message Authentication.",
            "Translucent Cryptography - An Alternative to Key Escrow, and Its Implementation via Fractional Oblivious Transfer.",
            "Elliptic Curve Cryptosystems over Small Fields of Odd Characteristic.",
            "On a Fallacious Bound for Authentication Codes.",
            "Cryptanalysis of Triple Modes of Operation.",
            "How to Stretch Random Functions: The Security of Protected Counter Sums.",
            "The Discrete Logarithm Problem on Elliptic Curves of Trace One.",
            "Divertible and Subliminal-Free Zero-Knowledge Proofs for Languages.",
            "Bounds for Key Distribution Patterns.",
            "Chinese Remaindering Based Cryptosystems in the Presence of Faults.",
            "On the Security of a Practical Identification Scheme.",
            "On the Contrast in Visual Cryptography Schemes."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1998",
        "info": "Volume 11",
        "count": 17,
        "papers": [
            "An Efficient Noninteractive Zero-Knowledge Proof System for NP with General Assumptions.",
            "A Structural Comparison of the Computational Difficulty of Breaking Discrete Log Cryptosystems.",
            "Cryptanalysis of Multiple Modes of Operation.",
            "Attacks on Fast Double Block Length Hash Functions.",
            "On Matroid Characterization of Ideal Secret Sharing Schemes.",
            "Perfect Zero-Knowledge Arguments for NP Using Any One-Way Permutation.",
            "A Public-Key Cryptosystem Using Purely Cubic Fields.",
            "The Black-Box Model for Cryptographic Primitives.",
            "The Improbability That an Elliptic Curve Has Subexponential Discrete Log Problem under the Menezes - Okamoto - Vanstone Algorithm.",
            "Zero-Knowledge Authentication Scheme with Secret Key Exchange.",
            "Lattice Reduction: A Toolbox for the Cryptanalyst.",
            "An Efficient Existentially Unforgeable Signature Scheme and Its Applications.",
            "Two-Key Triple Encryption.",
            "Fast Multiplication on Elliptic Curves over Small Fields of Characteristic Two.",
            "An Analysis of SAFER.",
            "Cryptanalysis of MD4.",
            "A Software-Optimized Encryption Algorithm."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1997",
        "info": "Volume 10",
        "count": 16,
        "papers": [
            "On Schnorr's Preprocessing for Digital Signature Schemes.",
            "Locally Random Reductions: Improvements and Applications.",
            "A Language-Dependent Cryptographic Primitive.",
            "RIPEMD with Two-Round Compress Function is Not Collision-Free.",
            "A Chosen Message Attack on Demytko's Elliptic Curve Cryptosystem.",
            "Batch RSA.",
            "Batch Diffie-Hellman Key Agreement Systems.",
            "Linking Information Reconciliation and Privacy Amplification.",
            "Feedback Shift Registers, 2-Adic Span, and Combiners with Memory.",
            "A Construction of a Cipher from a Single Pseudorandom Permutation.",
            "On the Existence of Statistically Hiding Bit Commitment Schemes and Fail-Stop Signatures.",
            "An Improvement of Davies' Attack on DES.",
            "The Security of the Birational Permutation Signature Schemes.",
            "The Size of a Share Must Be Large.",
            "Small Solutions to Polynomial Equations, and Low Exponent RSA Vulnerabilities.",
            "Mutually Trusted Authority-Free Secret Sharing Schemes."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1996",
        "info": "Volume 9",
        "count": 15,
        "papers": [
            "Substitution-Permutation Networks Resistant to Differential and Linear Cryptanalysis.",
            "Differential Cryptanalysis of Lucifer.",
            "On-Line/Off-Line Digital Signatures.",
            "Bounds on Secret Key Exchange Using a Random Deal of Cards.",
            "A Low Communication Competitive Interactive Proof System for Promised Quadratic Residuosity.",
            "Correlation Properties of a General Binary Combiner with Memory.",
            "Guest Editor's Introduction.",
            "The Power of Preprocessing in Zero-Knowledge Proofs of Knowledge.",
            "Certifying Permutations: Noninteractive Zero-Knowledge Based on Any Trapdoor Permutation.",
            "How to Construct Constant-Round Zero-Knowledge Proof Systems for NP.",
            "A Secure Protocol for the Oblivious Transfer (Extended Abstract).",
            "Efficient Cryptographic Schemes Provably as Secure as Subset Sum.",
            "Joint Encryption and Message-Efficient Secure Computation.",
            "Ideal Secret Sharing Schemes with Multiple Secrets.",
            "Pseudorandom Generators and the Frequency of Simplicity."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1995",
        "info": "Volume 8",
        "count": 13,
        "papers": [
            "Pairs and Triplets of DES S-Boxes.",
            "Provable Security Against a Differential Attack.",
            "Graph Decompositions and Secret Sharing Schemes.",
            "On the Distribution of Characteristics in Bijective Mappings.",
            "Necessary and Sufficient Condtions for Collision-Free Hashing.",
            "Short RSA Keys and Their Generation.",
            "Further Enumerating Boolean Functions of Cryptographic Significance.",
            "Fast Generation of Prime Numbers and Secure Public-Key Cryptographic Parameters.",
            "The Cryptanalysis of a Public-Key Implementation of Finite Group Mappings.",
            "An Infinite Class of Counterexamples to a Conjecture Concerning Nonlinear Resilient Functions.",
            "Information-Theoretic Bounds for Authentication Codes and Block Designs.",
            "On Key Storage in Secure Networks.",
            "Practical and Provably Secure Release of a Secret and Exchange of Signatures."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1994",
        "info": "Volume 7",
        "count": 12,
        "papers": [
            "Definitions and Properties of Zero-Knowledge Proof Systems.",
            "The Vulnerability of Geometric Sequences Based on Fields of Odd Characteristic.",
            "On the Structure of the Privacy Hierarchy.",
            "A Weak Cipher that Generates the Symmetric Group.",
            "Proof of Soundness (Integrity) of Cryptographic Protocols.",
            "Three System for Cryptographic Protocol Analysis.",
            "An Analysis of a Class of Algorithms for S-Box Construction.",
            "Functional Inversion and Communication Complexity.",
            "A Key-Exchange Protocol Using Real Quadratic Fields.",
            "Factorizations in the Elementary Abelian p-Group and Their Cryptographic Significance.",
            "Algebraic Nonlinearity and Its Applications to Cryptography.",
            "New Types of Cryptanalytic Attacks Using Related Keys."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1993",
        "info": "Volume 6",
        "count": 14,
        "papers": [
            "Arithmetic Operations in GF(2m).",
            "Multiple Assignment Scheme for Sharing Secret.",
            "A Uniform-Complexity Treatment of Encryption and Zero-Knowledge.",
            "Cascade Ciphers: The Importance of Being First.",
            "On the Communication Complexity of Zero-Knowledge Proofs.",
            "Secret Sharing Over Infinite Domains.",
            "A Perfect Zero-Knowledge Proof System for a Problem Equivalent to the Discrete Logarithm.",
            "Universal Tests for Nonuniform Distributions.",
            "A Lower Bound on Authentication After Having Observed a Sequence of Messages.",
            "On the Size of Shares for Secret Sharing Schemes.",
            "Modifications to the Number Field Sieve.",
            "A Design of a Fast Pipelined Modular Multiplier Based on a Diminished-Radix Algorithm.",
            "Elliptic Curve Cryptosystems and Their Implementations.",
            "User Impersonation in Key Certification Schemes."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1992",
        "info": "Volume 5",
        "count": 13,
        "papers": [
            "Experimental Quantum Cryptography.",
            "An Interactive Identification Scheme Based on Discrete Logarithms and Factoring.",
            "Which New RSA-Signatures Can be Computed from Certain Given RSA-Signatures?",
            "Conditionally-Perfect Secrecy and a Provably-Secure Randomized Cipher.",
            "Correlation Properties of Combiners with Memory in Stream Ciphers.",
            "A Universal Statistical Test for Random Bit Generators.",
            "Counting Binary Functions with Certain Cryptographic Properties.",
            "Some Remarks on the Security of the Identification Scheme Based on Permuted Kernels.",
            "A Cubic RSA Code Equivalent to Factorization.",
            "Some Improved Bounds on the Information Rate of Perfect Secret Sharing Schemes.",
            "Algebraic Properties of Cryptosystem PGM.",
            "Strongly Ideal Secret Sharing Schemes.",
            "Binary Sequences Derived from ML-Sequences over Rings, I: Periods of Minimal Polynomials."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1991",
        "info": "Volume 4",
        "count": 9,
        "papers": [
            "Differential Cryptanalysis of DES-like Cryptosystems.",
            "Secure Multiparty Protocols and Zero-Knowledge Proof Systems Tolerating a Faulty Minority.",
            "On the Classification of Ideal Secret Sharing Schemes.",
            "Local Randomness in Pseudorandom Sequences.",
            "Bit Commitment Using Pseudorandomness.",
            "Efficient Signature Generation by Smart Cards.",
            "Secure Implementations of Identification Systems.",
            "Practical Zero-Knowledge Proofs: Giving Hints and Using Deficiencies.",
            "Elliptic Curve Implementations of Zero-Knowledge Blobs."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1990/1991",
        "info": "Volume 3",
        "count": 13,
        "papers": [
            "Key-Minimal Crytosystems for Unconditional Secrecy.",
            "The Structured Design of Cryptographically Good S-Boxes.",
            "A Fast Software One-Way Hash Function.",
            "An Implementation for a Fast Public-Key Cryptosystem.",
            "Applying a Formal Analysis Technique to the CCITT X.509 Strong Two-Way Authentication Protocol.",
            "How to Time-Stamp a Digital Document.",
            "Key Processing with Control Vectors.",
            "CRYPTOPOST - A Cryptographic Application to Mail Processing.",
            "On the Chor-Rivest Knapsack Cryptosystem.",
            "Efficient, Perfect Polynomial Random Number Generators.",
            "New Bounds and Constructions for Authentication/Secrecy Codes with Splitting.",
            "One-Way Permutations on Elliptic Curves.",
            "A Generalized Correlation Attack on a Class of Stream Ciphers Based on the Levenshtein Distance."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1990",
        "info": "Volume 2",
        "count": 11,
        "papers": [
            "Secure Circuit Evaluation.",
            "Probability To Meet in the Middle.",
            "The Combinatorics of Authentication and Secrecy Codes.",
            "A Matrix Key-Distribution Scheme.",
            "A Discrete Logarithm Implementation of Perfect Zero-Knowledge Blobs.",
            "A Cartesian Product Construction for Unconditionally Secure Authentication Codes that Permit Arbitration.",
            "A Combinatorial Approach to Probabilistic Results on the Linear Complexity Profile of Random Sequences.",
            "Methods and Instruments for Designing S-Boxes.",
            "Information-Theoretic Bounds for Authentication Schemes.",
            "The Cryptanalysis of FEAL-4 with 20 Chosen Plaintexts.",
            "Enumerating Boolean Functions of Cryptographic Significance."
        ]
    },
    {
        "name": "Journal of Cryptology",
        "year": "1988/1989",
        "info": "Volume 1",
        "count": 15,
        "papers": [
            "Is the Data Encryption Standard a Group? (Results of Cycling Experiments on DES).",
            "Some Constructions and Bounds for Authentication Codes.",
            "The Generation of Random Numbers that Are Probably Prime.",
            "The Dining Cryptographers Problem: Unconditional Sender and Recipient Untraceability.",
            "Zero-Knowledge Proofs of Identity.",
            "A Key Distribution System Equivalent to Factoring.",
            "A Key-Exchange System Based on Imaginary Quadratic Fields.",
            "A Construction for Authentication/Secrecy Codes from Certain Combinatorial Designs.",
            "A Generalization of Hellman's Extension to Shannon's Approach to Cryptography.",
            "How to Share a Secret with Cheaters.",
            "Hyperelliptic Cryptosystems.",
            "A Study of Password Security.",
            "Fast Correlation Attacks on Certain Stream Ciphers.",
            "Inferring Sequences Produced by a Linear Congruential Generator Missing Low-Order Bits.",
            "Linear Ciphers and Spreads."
        ]
    }
]