[
    {
        "year": "2021",
        "name": "28th NDSS 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2021",
                "sub_name": "28th Annual Network and Distributed System Security Symposium, NDSS 2021, virtually, February 21-25, 2021.",
                "count": 87,
                "papers": [
                    "Flexsealing BGP Against Route Leaks: Peerlock Active Measurement and Analysis.",
                    "A Devil of a Time: How Vulnerable is NTP to Malicious Timeservers?",
                    "OblivSketch: Oblivious Network Measurement as a Cloud Service.",
                    "ROV++: Improved Deployable Defense against BGP Hijacking.",
                    "Trust the Crowd: Wireless Witnessing to Detect Attacks on ADS-B-Based Air-Traffic Surveillance.",
                    "Towards Measuring Supply Chain Attacks on Package Managers for Interpreted Languages.",
                    "Processing Dangerous Paths - On Security and Privacy of the Portable Document Format.",
                    "XDA: Accurate, Robust Disassembly with Transfer Learning.",
                    "Shadow Attacks: Hiding and Replacing Content in Signed PDFs.",
                    "KUBO: Precise and Scalable Detection of User-triggerable Undefined Behavior Bugs in OS Kernel.",
                    "Awakening the Web's Sleeper Agents: Misusing Service Workers for Privacy Leakage.",
                    "All the Numbers are US: Large-scale Abuse of Contact Discovery in Mobile Messengers.",
                    "Improving Signal's Sealed Sender.",
                    "Tales of Favicons and Caches: Persistent Tracking in Modern Browsers.",
                    "Reining in the Web's Inconsistencies with Site Policy.",
                    "From WHOIS to WHOWAS: A Large-Scale Measurement Study of Domain Registration Privacy under the GDPR.",
                    "Understanding the Growth and Security Considerations of ECS.",
                    "Mondrian: Comprehensive Inter-domain Network Zoning Architecture.",
                    "Bringing Balance to the Force: Dynamic Analysis of the Android Application Framework.",
                    "SymQEMU: Compilation-based symbolic execution for binaries.",
                    "TASE: Reducing Latency of Symbolic Execution with Transactional Memory.",
                    "Refining Indirect Call Targets at the Binary Level.",
                    "Obfuscated Access and Search Patterns in Searchable Encryption.",
                    "More than a Fair Share: Network Data Remanence Attacks against Secret Sharing-based Schemes.",
                    "Forward and Backward Private Conjunctive Searchable Symmetric Encryption.",
                    "Practical Non-Interactive Searchable Encryption with Forward and Backward Privacy.",
                    "Zoom on the Keystrokes: Exploiting Video Calls for Keystroke Inference Attacks.",
                    "Deceptive Deletions for Protecting Withdrawn Posts on Social Media Platforms.",
                    "Who's Hosting the Block Party? Studying Third-Party Blockage of CSP and SRI.",
                    "To Err.Is Human: Characterizing the Threat of Unintended URLs in Social Media.",
                    "SerialDetector: Principled and Practical Exploration of Object Injection Vulnerabilities for the Web.",
                    "The Abuser Inside Apps: Finding the Culprit Committing Mobile Ad Fraud.",
                    "Your Phone is My Proxy: Detecting and Understanding Mobile Proxy Networks.",
                    "Understanding Worldwide Private Information Collection on Android.",
                    "On the Insecurity of SMS One-Time Password Messages against Local Attackers in Modern Mobile Devices.",
                    "Preventing and Detecting State Inference Attacks on Android.",
                    "As Strong As Its Weakest Link: How to Break Blockchain DApps at RPC Service.",
                    "RandRunner: Distributed Randomness from Trapdoor VDFs with Strong Uniqueness.",
                    "LaKSA: A Probabilistic Proof-of-Stake Protocol.",
                    "SquirRL: Automating Attack Analysis on Blockchain Incentive Mechanisms with Deep Reinforcement Learning.",
                    "Bitcontracts: Supporting Smart Contracts in Legacy Blockchains.",
                    "QPEP: An Actionable Approach to Secure and Performant Broadband From Geostationary Orbit.",
                    "A Formal Analysis of the FIDO UAF Protocol.",
                    "PHOENIX: Device-Centric Cellular Network Protocol Monitoring using Runtime Verification.",
                    "The Bluetooth CYBORG: Analysis of the Full Human-Machine Passkey Entry AKE Protocol.",
                    "NetPlier: Probabilistic Network Protocol Reverse Engineering from Message Traces.",
                    "Screen Gleaning: A Screen Reading TEMPEST Attack on Mobile Devices Exploiting an Electromagnetic Side Channel.",
                    "Rosita: Towards Automatic Elimination of Power-Analysis Leakage in Ciphers.",
                    "Hunting the Haunter - Efficient Relational Symbolic Execution for Spectre with Haunted RelSE.",
                    "SpecTaint: Speculative Taint Analysis for Discovering Spectre Gadgets.",
                    "Understanding and Detecting International Revenue Share Fraud.",
                    "Differential Training: A Generic Framework to Reduce Label Noises for Android Malware Detection.",
                    "MINOS: A Lightweight Real-Time Cryptojacking Detection System.",
                    "Does Every Second Count? Time-based Evolution of Malware Behavior in Sandboxes.",
                    "Hey Alexa, is this Skill Safe?: Taking a Closer Look at the Alexa Skill Ecosystem.",
                    "IoTSafe: Enforcing Safety and Security Policy with Real IoT Physical Interaction Discovery.",
                    "PFirewall: Semantics-Aware Customizable Data Flow Control for Smart Home Privacy Protection.",
                    "EarArray: Defending against DolphinAttack via Acoustic Attenuation.",
                    "POP and PUSH: Demystifying and Defending against (Mach) Port-oriented Programming.",
                    "Доверя'й, но проверя'й: SFI safety for native-compiled Wasm.",
                    "Detecting Kernel Memory Leaks in Specialized Modules with Ownership Reasoning.",
                    "Let's Stride Blindfolded in a Forest: Sublinear Multi-Client Decision Trees Evaluation.",
                    "Practical Blind Membership Inference Attack via Differential Comparisons.",
                    "GALA: Greedy ComputAtion for Linear Algebra in Privacy-Preserved Neural Networks.",
                    "FARE: Enabling Fine-grained Attack Categorization under Low-quality Labeled Data.",
                    "PGFUZZ: Policy-Guided Fuzzing for Robotic Vehicles.",
                    "Favocado: Fuzzing the Binding Code of JavaScript Engines Using Semantically Correct Test Cases.",
                    "WINNIE : Fuzzing Windows Applications with Harness Synthesis and Fast Cloning.",
                    "Reinforcement Learning-based Hierarchical Seed Scheduling for Greybox Fuzzing.",
                    "Evading Voltage-Based Intrusion Detection on Automotive CAN.",
                    "HERA: Hotpatching of Embedded Real-time Applications.",
                    "From Library Portability to Para-rehosting: Natively Executing Microcontroller Software on Commodity Hardware.",
                    "BaseSpec: Comparative Analysis of Baseband Software and Cellular Specifications for L3 Protocols.",
                    "POSEIDON: Privacy-Preserving Federated Neural Network Learning.",
                    "FLTrust: Byzantine-robust Federated Learning via Trust Bootstrapping.",
                    "Manipulating the Byzantine: Optimizing Model Poisoning Attacks and Defenses for Federated Learning.",
                    "Data Poisoning Attacks to Deep Learning Based Recommender Systems.",
                    "C^2SR: Cybercrime Scene Reconstruction for Post-mortem Forensic Analysis.",
                    "ALchemist: Fusing Application and Audit Logs for Precise Attack Provenance without Instrumentation.",
                    "WATSON: Abstracting Behaviors from Audit Logs via Aggregation of Contextual Semantics.",
                    "DOVE: A Data-Oblivious Virtual Environment.",
                    "CHANCEL: Efficient Multi-client Isolation Under Adversarial Programs.",
                    "Emilia: Catching Iago in Legacy Code.",
                    "CV-Inspector: Towards Automating Detection of Adblock Circumvention.",
                    "FlowLens: Enabling Efficient Flow Classification for ML-based Network Security Applications.",
                    "PrivacyFlash Pro: Automating Privacy Policy Generation for Mobile Apps.",
                    "Towards Understanding and Detecting Cyberbullying in Real-world Images."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "27th NDSS 2020",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2020",
                "sub_name": "27th Annual Network and Distributed System Security Symposium, NDSS 2020, San Diego, California, USA, February 23-26, 2020.",
                "count": 89,
                "papers": [
                    "Overcoming the \"Evil Twins\" Attack: Lessons Learned from the Industrial Battlefield.",
                    "FUSE: Finding File Upload Bugs via Penetration Testing.",
                    "Melting Pot of Origins: Compromising the Intermediary Web Services that Rehost Websites.",
                    "Deceptive Previews: A Study of the Link Preview Trustworthiness in Social Platforms.",
                    "Cross-Origin State Inference (COSI) Attacks: Leaking Web Site States through XS-Leaks.",
                    "Carnus: Exploring the Privacy Threats of Browser Extension Fingerprinting.",
                    "HYPER-CUBE: High-Dimensional Hypervisor Fuzzing.",
                    "HFL: Hybrid Fuzzing on the Linux Kernel.",
                    "HotFuzz: Discovering Algorithmic Denial-of-Service Vulnerabilities Through Guided Micro-Fuzzing.",
                    "Not All Coverage Measurements Are Equal: Fuzzing by Coverage Accounting for Input Prioritization.",
                    "Detecting Probe-resistant Proxies.",
                    "Decentralized Control: A Case Study of Russia.",
                    "Measuring the Deployment of Network Censorship Filters at Global Scale.",
                    "SymTCP: Eluding Stateful Deep Packet Inspection with Automated Discrepancy Discovery.",
                    "MassBrowser: Unblocking the Censored Web for the Masses, by the Masses.",
                    "Et Tu Alexa? When Commodity WiFi Devices Turn into Adversarial Motion Sensors.",
                    "Metamorph: Injecting Inaudible Commands into Over-the-air Voice Controlled Systems.",
                    "SurfingAttack: Interactive Hidden Attack on Voice Assistants Using Ultrasonic Guided Waves.",
                    "Packet-Level Signatures for Smart Home Devices.",
                    "Learning-based Practical Smartphone Eavesdropping with Built-in Accelerometer.",
                    "Automated Cross-Platform Reverse Engineering of CAN Bus Commands From Mobile Apps.",
                    "Are You Going to Answer That? Measuring User Responses to Anti-Robocall Application Indicators.",
                    "TKPERM: Cross-platform Permission Knowledge Transfer to Detect Overprivileged Third-party Applications.",
                    "FlowPrint: Semi-Supervised Mobile-App Fingerprinting on Encrypted Network Traffic.",
                    "Bobtail: Improved Blockchain Security with Low-Variance Mining.",
                    "Snappy: Fast On-chain Payments with Practical Collaterals.",
                    "The Attack of the Clones Against Proof-of-Authority.",
                    "Broken Metre: Attacking Resource Metering in EVM.",
                    "Finding Safety in Numbers with Secure Allegation Escrows.",
                    "When Match Fields Do Not Need to Match: Buffered Packets Hijacking in SDN.",
                    "Automated Discovery of Cross-Plane Event-Based Vulnerabilities in Software-Defined Networking.",
                    "SVLAN: Secure & Scalable Network Virtualization.",
                    "µRAI: Securing Embedded Systems with Return Address Integrity.",
                    "NoJITsu: Locking Down JavaScript Engines.",
                    "SODA: A Generic Online Detection Framework for Smart Contracts.",
                    "A Practical Approach for Taking Down Avalanche Botnets Under Real-World Constraints.",
                    "Designing a Better Browser for Tor with BLAST.",
                    "Encrypted DNS -> Privacy? A Traffic Analysis Perspective.",
                    "On Using Application-Layer Middlebox Protocols for Peeking Behind NAT Gateways.",
                    "ABSynthe: Automatic Blackbox Side-channel Synthesis on Commodity Microarchitectures.",
                    "PhantomCache: Obfuscating Cache Conflicts with Localized Randomization.",
                    "Data-Driven Debugging for Functional Side Channels.",
                    "Mind the Portability: A Warriors Guide through Realistic Profiled Side-channel Analysis.",
                    "Hold the Door! Fingerprinting Your Car Key to Prevent Keyless Entry Car Theft.",
                    "Poseidon: Mitigating Volumetric DDoS Attacks with Programmable Switches.",
                    "EASI: Edge-Based Sender Identification on Resource-Constrained Platforms for Automotive Networks.",
                    "BLAG: Improving the Accuracy of Blacklists.",
                    "DefRec: Establishing Physical Function Virtualization to Disrupt Reconnaissance of Power Grids' Cyber-Physical Infrastructures.",
                    "Revisiting Leakage Abuse Attacks.",
                    "Metal: A Metadata-Hiding File-Sharing System.",
                    "MACAO: A Maliciously-Secure and Client-Efficient Active ORAM Framework.",
                    "Heterogeneous Private Information Retrieval.",
                    "Dynamic Searchable Encryption with Small Client Storage.",
                    "Withdrawing the BGP Re-Routing Curtain: Understanding the Security Impact of BGP Poisoning through Real-World Measurements.",
                    "IMP4GT: IMPersonation Attacks in 4G NeTworks.",
                    "Practical Traffic Analysis Attacks on Secure Messaging Applications.",
                    "CDN Judo: Breaking the CDN DoS Protection with Itself.",
                    "DeepBinDiff: Learning Program-Wide Code Representations for Binary Diffing.",
                    "Precisely Characterizing Security Impact in a Flood of Patches via Symbolic Rule Comparison.",
                    "Unicorn: Runtime Provenance-Based Detector for Advanced Persistent Threats.",
                    "Custos: Practical Tamper-Evident Auditing of Operating Systems Using Trusted Execution.",
                    "You Are What You Do: Hunting Stealthy Malware via Data Provenance Analysis.",
                    "OmegaLog: High-Fidelity Attack Investigation via Transparent Multi-layer Log Analysis.",
                    "Trident: Efficient 4PC Framework for Privacy Preserving Machine Learning.",
                    "Secure Sublinear Time Differentially Private Median Computation.",
                    "CloudLeak: Large-Scale Deep Learning Models Stealing Through Adversarial Examples.",
                    "BLAZE: Blazing Fast Privacy-Preserving Machine Learning.",
                    "Prevalence and Impact of Low-Entropy Packing Schemes in the Malware Ecosystem.",
                    "When Malware is Packin' Heat; Limits of Machine Learning Classifiers Based on Static Analysis Features.",
                    "UIScope: Accurate, Instrumentation-free, and Visible Attack Investigation for GUI Applications.",
                    "OcuLock: Exploring Human Visual System for Authentication in Virtual Reality Head-mounted Display.",
                    "On the Resilience of Biometric Authentication Systems against Random Inputs.",
                    "Strong Authentication without Temper-Resistant Hardware and Application to Federated Identities.",
                    "A View from the Cockpit: Exploring Pilot Reactions to Attacks on Avionic Systems.",
                    "Genotype Extraction and False Relative Attacks: Security Risks to Third-Party Genetic Genealogy Services Beyond Identity Inference.",
                    "Complex Security Policy? A Longitudinal Analysis of Deployed Content Security Policies.",
                    "Into the Deep Web: Understanding E-commerce Fraud from Autonomous Chat with Cybercriminals.",
                    "Compliance Cautions: Investigating Security Issues Associated with U.S. Digital-Security Standards.",
                    "Let's Revoke: Scalable Global Certificate Revocation.",
                    "Post-Quantum Authentication in TLS 1.3: A Performance Study.",
                    "DISCO: Sidestepping RPKI's Deployment Barriers.",
                    "Proof of Storage-Time: Efficiently Checking Continuous Data Availability.",
                    "SPEECHMINER: A Framework for Investigating and Measuring Speculative Execution Vulnerabilities.",
                    "ProtectIOn: Root-of-Trust for IO in Compromised Platforms.",
                    "ConTExT: A Generic Approach for Mitigating Spectre.",
                    "Towards Plausible Graph Anonymization.",
                    "Adversarial Classification Under Differential Privacy.",
                    "Locally Differentially Private Frequency Estimation with Consistency.",
                    "DESENSITIZATION: Privacy-Aware and Attack-Preserving Crash Report."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "26th NDSS 2019",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2019",
                "sub_name": "26th Annual Network and Distributed System Security Symposium, NDSS 2019, San Diego, California, USA, February 24-27, 2019.",
                "count": 90,
                "papers": [
                    "Keynote: Modern Challenges for Cyber Defense.",
                    "SANCTUARY: ARMing TrustZone with User-space Enclaves.",
                    "Ginseng: Keeping Secrets in Registers When You Distrust the Operating System.",
                    "DroidCap: OS Support for Capability-based Permissions in Android.",
                    "Time Does Not Heal All Wounds: A Longitudinal Analysis of Security-Mechanism Support in Mobile Browsers.",
                    "Geo-locating Drivers: A Study of Sensitive Data Leakage in Ride-Hailing Services.",
                    "Please Forget Where I Was Last Summer: The Privacy Risks of Public Location (Meta)Data.",
                    "Don't Trust The Locals: Investigating the Prevalence of Persistent Client-Side Cross-Site Scripting in the Wild.",
                    "Master of Web Puppets: Abusing Web Browsers for Persistent and Stealthy Computation.",
                    "Tranco: A Research-Oriented Top Sites Ranking Hardened Against Manipulation.",
                    "JavaScript Template Attacks: Automatically Inferring Host Information for Targeted Exploits.",
                    "Latex Gloves: Protecting Browser Extensions from Probing and Revelation Attacks.",
                    "maTLS: How to Make TLS middlebox-aware?",
                    "SABRE: Protecting Bitcoin against Routing Attacks.",
                    "A Treasury System for Cryptocurrencies: Enabling Better Collaborative Intelligence.",
                    "Fine-Grained and Controlled Rewriting in Blockchains: Chameleon-Hashing Gone Attribute-Based.",
                    "YODA: Enabling computationally intensive contracts on blockchains with Byzantine and Selfish nodes.",
                    "Giving State to the Stateless: Augmenting Trustworthy Computation with Ledgers.",
                    "Cracking the Wall of Confinement: Understanding and Analyzing Malicious Domain Take-downs.",
                    "Cleaning Up the Internet of Evil Things: Real-World Evidence on ISP and Consumer Efforts to Remove Mirai.",
                    "Measurement and Analysis of Hajime, a Peer-to-peer IoT Botnet.",
                    "Countering Malicious Processes with Process-DNS Association.",
                    "ExSpectre: Hiding Malware in Speculative Execution.",
                    "ML-Leaks: Model and Data Independent Membership Inference Attacks and Defenses on Machine Learning Models.",
                    "MBeacon: Privacy-Preserving Beacons for DNA Methylation Data.",
                    "Stealthy Adversarial Perturbations Against Real-Time Video Classification Systems.",
                    "NIC: Detecting Adversarial Samples with Neural Network Invariant Checking.",
                    "TextBugger: Generating Adversarial Text Against Real-world Applications.",
                    "Digital Healthcare-Associated Infection: A Case Study on the Security of a Major Multi-Campus Hospital System.",
                    "Mind Your Own Business: A Longitudinal Study of Threats and Vulnerabilities in Enterprises.",
                    "NoDoze: Combatting Threat Alert Fatigue with Automated Provenance Triage.",
                    "The use of TLS in Censorship Circumvention.",
                    "On the Challenges of Geographical Avoidance for Tor.",
                    "PeriScope: An Effective Probing and Fuzzing Framework for the Hardware-OS Boundary.",
                    "REDQUEEN: Fuzzing with Input-to-State Correspondence.",
                    "NAUTILUS: Fishing for Deep Bugs with Grammars.",
                    "Analyzing Semantic Correctness with Symbolic Execution: A Case Study on PKCS#1 v1.5 Signature Verification.",
                    "Send Hardest Problems My Way: Probabilistic Path Prioritization for Hybrid Fuzzing.",
                    "Measuring the Facebook Advertising Ecosystem.",
                    "We Value Your Privacy ... Now Take Some Cookies: Measuring the GDPR's Impact on Web Privacy.",
                    "How Bad Can It Git? Characterizing Secret Leakage in Public GitHub Repositories.",
                    "DNS Cache-Based User Tracking.",
                    "Quantity vs. Quality: Evaluating User Interest Profiles Using Ad Preference Managers.",
                    "Thunderclap: Exploring Vulnerabilities in Operating System IOMMU Protection via DMA from Untrustworthy Peripherals.",
                    "One Engine To Serve 'em All: Inferring Taint Rules Without Architectural Semantics.",
                    "Automating Patching of Vulnerable Open-Source Software Versions in Application Binaries.",
                    "CRCount: Pointer Invalidation with Reference Counting to Mitigate Use-after-free in Legacy C/C++.",
                    "CodeAlchemist: Semantics-Aware Code Generation to Find Vulnerabilities in JavaScript Engines.",
                    "Oligo-Snoop: A Non-Invasive Side Channel Attack Against DNA Synthesis Machines.",
                    "Profit: Detecting and Quantifying Side Channels in Networked Applications.",
                    "Unveiling your keystrokes: A Cache-based Side-channel Attack on Graphics Libraries.",
                    "Data Oblivious ISA Extensions for Side Channel-Resistant and High Performance Computing.",
                    "Privacy Attacks to the 4G and 5G Cellular Paging Protocols Using Side Channel Information.",
                    "Coconut: Threshold Issuance Selective Disclosure Credentials with Applications to Distributed Ledgers.",
                    "Distinguishing Attacks from Legitimate Authentication Traffic at Scale.",
                    "Robust Performance Metrics for Authentication Systems.",
                    "Total Recall: Persistence of Passwords in Android.",
                    "How to End Password Reuse on the Web.",
                    "Component-Based Formal Analysis of 5G-AKA: Channel Assumptions and Session Confusion.",
                    "UWB with Pulse Reordering: Securing Ranging against Relay and Physical-Layer Attacks.",
                    "Nearby Threats: Reversing, Analyzing, and Attacking Google's 'Nearby Connections' on Android.",
                    "BadBluetooth: Breaking Android Security Mechanisms via Malicious Bluetooth Peripherals.",
                    "Understanding Open Ports in Android Applications: Discovery, Diagnosis, and Security Assessment.",
                    "IoTGuard: Dynamic Enforcement of Security and Safety Policy in Commodity IoT.",
                    "RFDIDS: Radio Frequency-based Distributed Intrusion Detection System for the Power Grid.",
                    "A Systematic Framework to Generate Invariants for Anomaly Detection in Industrial Control Systems.",
                    "DIAT: Data Integrity Attestation for Resilient Collaboration of Autonomous Systems.",
                    "ICSREF: A Framework for Automated Reverse Engineering of Industrial Control Systems Binaries.",
                    "Balancing Image Privacy and Usability with Thumbnail-Preserving Encryption.",
                    "ConcurORAM: High-Throughput Stateless Parallel Multi-Client ORAM.",
                    "Statistical Privacy for Streaming Traffic.",
                    "rORAM: Efficient Range ORAM with O(log2 N) Locality.",
                    "Private Continual Release of Real-Valued Data Streams.",
                    "Practical Hidden Voice Attacks against Speech and Speaker Recognition Systems.",
                    "Adversarial Attacks Against Automatic Speech Recognition Systems via Psychoacoustic Hiding.",
                    "The Crux of Voice (In)Security: A Brain Study of Speaker Legitimacy Detection.",
                    "Life after Speech Recognition: Fuzzing Semantic Misinterpretation for Voice Assistant Applications.",
                    "Cybercriminal Minds: An investigative study of cryptocurrency abuses in the Dark Web.",
                    "Vault: Fast Bootstrapping for the Algorand Cryptocurrency.",
                    "Sereum: Protecting Existing Smart Contracts Against Re-Entrancy Attacks.",
                    "Anonymous Multi-Hop Locks for Blockchain Scalability and Interoperability.",
                    "Constructing an Adversary Solver for Equihash.",
                    "OBFUSCURO: A Commodity Obfuscation Engine on Intel SGX.",
                    "TEE-aided Write Protection Against Privileged Data Tampering.",
                    "TIMBER-V: Tag-Isolated Memory Bringing Fine-grained Enclaves to RISC-V.",
                    "Establishing Software Root of Trust Unconditionally.",
                    "Graph-based Security and Privacy Analytics via Collective Classification with Joint Weight Learning and Propagation.",
                    "Enemy At the Gateways: Censorship-Resilient Proxy Distribution Using Game Theory.",
                    "Neuro-Symbolic Execution: Augmenting Symbolic Execution with Neural Constraints.",
                    "Neural Machine Translation Inspired Binary Code Similarity Comparison beyond Function Pairs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "25th NDSS 2018",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2018",
                "sub_name": "25th Annual Network and Distributed System Security Symposium, NDSS 2018, San Diego, California, USA, February 18-21, 2018.",
                "count": 71,
                "papers": [
                    "IoTFuzzer: Discovering Memory Corruptions in IoT Through App-based Fuzzing.",
                    "Fear and Logging in the Internet of Things.",
                    "Decentralized Action Integrity for Trigger-Action IoT Platforms.",
                    "What You Corrupt Is Not What You Crash: Challenges in Fuzzing Embedded Devices.",
                    "Didn't You Hear Me? - Towards More Successful Web Vulnerability Notifications.",
                    "Exposing Congestion Attack on Emerging Connected Vehicle based Traffic Signal Control.",
                    "Removing Secrets from Android's TLS.",
                    "rtCaptcha: A Real-Time CAPTCHA Based Liveness Detection System.",
                    "Automated Attack Discovery in TCP Congestion Control Using a Model-guided Approach.",
                    "Preventing (Network) Time Travel with Chronos.",
                    "LTEInspector: A Systematic Approach for Adversarial Testing of 4G LTE.",
                    "GUTI Reallocation Demystified: Cellular Location Tracking with Changing Temporary Identifier.",
                    "Mind Your Keys? A Security Evaluation of Java Keystores.",
                    "A Security Analysis of Honeywords.",
                    "Revisiting Private Stream Aggregation: Lattice-Based PSA.",
                    "ZeroTrace : Oblivious Memory Primitives from Intel SGX.",
                    "Automated Website Fingerprinting through Deep Learning.",
                    "VulDeePecker: A Deep Learning-Based System for Vulnerability Detection.",
                    "Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection.",
                    "Feature Squeezing: Detecting Adversarial Examples in Deep Neural Networks.",
                    "Trojaning Attack on Neural Networks.",
                    "Broken Fingers: On the Usage of the Fingerprint API in Android.",
                    "K-means++ vs. Behavioral Biometrics: One Loop to Rule Them All.",
                    "ABC: Enabling Smartphone Authentication with Built-in Camera.",
                    "Device Pairing at the Touch of an Electrode.",
                    "Face Flashing: a Secure Liveness Detection Protocol based on Light Reflections.",
                    "A Large-scale Analysis of Content Modification by Open HTTP Proxies.",
                    "Measuring and Disrupting Anti-Adblockers Using Differential Execution Analysis.",
                    "Towards Measuring the Effectiveness of Telephony Blacklists.",
                    "Things You May Not Know About Android (Un)Packers: A Systematic Study based on Whole-System Emulation.",
                    "KeyDrown: Eliminating Software-Based Keystroke Timing Side-Channel Attacks.",
                    "Securing Real-Time Microcontroller Systems through Customized Memory View Switching.",
                    "Automated Generation of Event-Oriented Exploits in Android Hybrid Apps.",
                    "Tipped Off by Your Memory Allocator: Device-Wide User Activity Sequencing from Android Memory Images.",
                    "K-Miner: Uncovering Memory Corruption in Linux.",
                    "CFIXX: Object Type Integrity for C++.",
                    "Back To The Epilogue: Evading Control Flow Guard via Unaligned Targets.",
                    "Superset Disassembly: Statically Rewriting x86 Binaries Without Heuristics.",
                    "Enhancing Memory Error Detection for Large-Scale Applications and Fuzz Testing.",
                    "Finding Clues for Your Secrets: Semantics-Driven, Learning-Based Privacy Discovery in Mobile Apps.",
                    "Bug Fixes, Improvements, ... and Privacy Leaks - A Longitudinal Study of PII Leaks Across Android App Versions.",
                    "Apps, Trackers, Privacy, and Regulators: A Global Study of the Mobile Tracking Ecosystem.",
                    "OS-level Side Channels without Procfs: Exploring Cross-App Information Leakage on iOS.",
                    "Knock Knock, Who's There? Membership Inference on Aggregate Location Data.",
                    "Reduced Cooling Redundancy: A New Security Vulnerability in a Hot Data Center.",
                    "OBLIVIATE: A Data Oblivious Filesystem for Intel SGX.",
                    "Microarchitectural Minefields: 4K-Aliasing Covert Channel and Multi-Tenant Detection in Iaas Clouds.",
                    "Cloud Strife: Mitigating the Security Risks of Domain-Validated Certificates.",
                    "Consensual and Privacy-Preserving Sharing of Multi-Subject and Interdependent Data.",
                    "When Coding Style Survives Compilation: De-anonymizing Programmers from Executable Binaries.",
                    "De-anonymization of Mobility Trajectories: Dissecting the Gaps between Theory and Practice.",
                    "Veil: Private Browsing Semantics Without Browser-side Assistance.",
                    "Game of Missuggestions: Semantic Analysis of Search-Autocomplete Manipulations.",
                    "SYNODE: Understanding and Automatically Preventing Injection Attacks on NODE.JS.",
                    "JavaScript Zero: Real JavaScript and Zero Side-Channel Attacks.",
                    "Riding out DOMsday: Towards Detecting and Preventing DOM Cross-Site Scripting.",
                    "Towards Scalable Cluster Auditing through Grammatical Inference over Provenance Graphs.",
                    "MCI : Modeling-based Causality Inference in Audit Logging for Attack Investigation.",
                    "Towards a Timely Causality Analysis for Enterprise Security.",
                    "JSgraph: Enabling Reconstruction of Web Attacks via Efficient Tracking of Live In-Browser JavaScript Executions.",
                    "AceDroid: Normalizing Diverse Android Access Control Checks for Inconsistency Detection.",
                    "InstaGuard: Instantly Deployable Hot-patches for Vulnerable System Programs on Android.",
                    "BreakApp: Automated, Flexible Application Compartmentalization.",
                    "Resolving the Predicament of Android Custom Permissions.",
                    "ZEUS: Analyzing Safety of Smart Contracts.",
                    "Chainspace: A Sharded Smart Contracts Platform.",
                    "Settling Payments Fast and Private: Efficient Decentralized Routing for Path-Based Transactions.",
                    "TLS-N: Non-repudiation over TLS Enablign Ubiquitous Content Signing.",
                    "Investigating Ad Transparency Mechanisms in Social Media: A Case Study of Facebooks Explanations.",
                    "Inside Job: Applying Traffic Analysis to Measure Tor from Within.",
                    "Smoke Screener or Straight Shooter: Detecting Elite Sybil Attacks in User-Review Social Networks."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "24th NDSS 2017",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2017",
                "sub_name": "24th Annual Network and Distributed System Security Symposium, NDSS 2017, San Diego, California, USA, February 26 - March 1, 2017.",
                "count": 68,
                "papers": [
                    "IO-DSSE: Scaling Dynamic Searchable Encryption to Millions of Indexes By Improving Locality.",
                    "ObliviSync: Practical Oblivious File Backup and Synchronization.",
                    "TumbleBit: An Untrusted Bitcoin-Compatible Anonymous Payment Hub.",
                    "P2P Mixing and Unlinkable Bitcoin Transactions.",
                    "SilentWhispers: Enforcing Security and Privacy in Decentralized Credit Networks.",
                    "DELTA: A Security Assessment Framework for Software-Defined Networks.",
                    "PSI: Precise Security Instrumentation for Enterprise Networks.",
                    "On the Safety and Efficiency of Virtual Firewall Elasticity Control.",
                    "Deconstructing Xen.",
                    "Thou Shalt Not Depend on Me: Analysing the Use of Outdated JavaScript Libraries on the Web.",
                    "Enabling Reconstruction of Attacks on Users via Efficient Browsing Snapshots.",
                    "(Cross-)Browser Fingerprinting via OS and Hardware Level Features.",
                    "Fake Co-visitation Injection Attacks to Recommender Systems.",
                    "Broken Hearted: How To Attack ECG Biometrics.",
                    "Towards Implicit Visual Memory-Based Authentication.",
                    "KEH-Gait: Towards a Mobile Healthcare User Authentication System by Kinetic Energy Harvesting.",
                    "A Large-scale Analysis of the Mnemonic Password Advice.",
                    "Cracking Android Pattern Lock in Five Attempts.",
                    "Dial One for Scam: A Large-Scale Analysis of Technical Support Scams.",
                    "Automated Synthesis of Semantic Malware Signatures using Maximum Satisfiability.",
                    "MaMaDroid: Detecting Android Malware by Building Markov Chains of Behavioral Models.",
                    "A Broad View of the Ecosystem of Socially Engineered Exploit Documents.",
                    "Catching Worms, Trojan Horses and PUPs: Unsupervised Detection of Silent Delivery Campaigns.",
                    "Measuring small subgroup attacks against Diffie-Hellman.",
                    "Indiscreet Logs: Diffie-Hellman Backdoors in TLS.",
                    "WireGuard: Next Generation Kernel Network Tunnel.",
                    "The Security Impact of HTTPS Interception.",
                    "Fast Actively Secure OT Extension for Short Secrets.",
                    "Constant Round Maliciously Secure 2PC with Function-independent Preprocessing using LEGO.",
                    "Pushing the Communication Barrier in Secure Computation using Lookup Tables.",
                    "Using Fully Homomorphic Encryption for Statistical Analysis of Categorical, Ordinal and Numerical Data.",
                    "Dark Hazard: Learning-based, Large-Scale Discovery of Hidden Sensitive Operations in Android Apps.",
                    "Show Me the Money! Finding Flawed Implementations of Third-party In-app Payment in Android Apps.",
                    "WindowGuard: Systematic Protection of GUI Security in Android.",
                    "Obfuscation-Resilient Privacy Leak Detection for Mobile Apps Through Differential Analysis.",
                    "Automated Analysis of Privacy Requirements for Mobile Apps.",
                    "Dachshund: Digging for and Securing (Non-)Blinded Constants in JIT Code.",
                    "Safelnit: Comprehensive and Practical Mitigation of Uninitialized Read Vulnerabilities.",
                    "MARX: Uncovering Class Hierarchies in C++ Programs.",
                    "PT-Rand: Practical Mitigation of Data-only Attacks against Page Tables.",
                    "Dynamic Virtual Address Range Adjustment for Intra-Level Privilege Separation on ARM.",
                    "Hello from the Other Side: SSH over Robust Cache Covert Channels in the Cloud.",
                    "Dynamic Differential Location Privacy with Personalized Error Bounds.",
                    "Are We There Yet? On RPKI's Deployment and Security.",
                    "TenantGuard: Scalable Runtime Verification of Cloud-Wide VM-Level Network Isolation.",
                    "Dissecting Tor Bridges: A Security Evaluation of their Private and Public Infrastructures.",
                    "The Effect of DNS on Tor's Anonymity.",
                    "Avoiding The Man on the Wire: Improving Tor's Security with Trust-Aware Path Selection.",
                    "HisTorε: Differentially Private and Robust Statistics Collection for Tor.",
                    "SGX-Shield: Enabling Address Space Layout Randomization for SGX Programs.",
                    "T-SGX: Eradicating Controlled-Channel Attacks Against Enclave Programs.",
                    "BOOMERANG: Exploiting the Semantic Gap in Trusted Execution Environments.",
                    "HOP: Hardware makes Obfuscation Practical.",
                    "Panoply: Low-TCB Linux Applications With SGX Enclaves.",
                    "Hey, My Malware Knows Physics! Attacking PLCs with Physical Model Aware Rootkit.",
                    "ContexloT: Towards Providing Contextual Integrity to Appified IoT Platforms.",
                    "FBS-Radar: Uncovering Fake Base Stations at Scale in the Wild.",
                    "Internet-scale Probing of CPS: Inference, Characterization and Orchestration Analysis.",
                    "Wi-Fly?: Detecting Privacy Invasion Attacks by Consumer Drones.",
                    "ASLR on the Line: Practical Cache Attacks on the MMU.",
                    "Unleashing Use-Before-Initialization Vulnerabilities in the Linux Kernel Using Targeted Stack Spraying.",
                    "Address Oblivious Code Reuse: On the Effectiveness of Leakage Resilient Diversity.",
                    "An Evil Copy: How the Loader Betrays You.",
                    "Stack Bounds Protection with Low Fat Pointers.",
                    "VUzzer: Application-aware Evolutionary Fuzzing.",
                    "Self Destructing Exploit Executions via Input Perturbation.",
                    "A Call to ARMs: Understanding the Costs and Benefits of JIT Spraying Mitigations.",
                    "Ramblr: Making Reassembly Great Again."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "23rd NDSS 2016",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2016",
                "sub_name": "23rd Annual Network and Distributed System Security Symposium, NDSS 2016, San Diego, California, USA, February 21-24, 2016.",
                "count": 61,
                "papers": [
                    "Keynote: On Subverting Trust.",
                    "Transcript Collision Attacks: Breaking Authentication in TLS, IKE and SSH.",
                    "TLS in the Wild: An Internet-wide Analysis of TLS-based Protocols for Electronic Communication.",
                    "Killed by Proxy: Analyzing Client-end TLS Interce.",
                    "SIBRA: Scalable Internet Bandwidth Reservation Architecture.",
                    "Don't Forget to Lock the Back Door! A Characterization of IPv6 Network Security Policy.",
                    "Attacking the Network Time Protocol.",
                    "SPIFFY: Inducing Cost-Detectability Tradeoffs for Persistent Link-Flooding Attacks.",
                    "CrossFire: An Analysis of Firefox Extension-Reuse Vulnerabilities.",
                    "It's Free for a Reason: Exploring the Ecosystem of Free Live Streaming Services.",
                    "Attack Patterns for Black-Box Security Testing of Multi-Party Web Applications.",
                    "Are these Ads Safe: Detecting Hidden Attacks through the Mobile App-Web Interfaces.",
                    "Enabling Practical Software-defined Networking Security Applications with OFX.",
                    "Forwarding-Loop Attacks in Content Delivery Networks.",
                    "CDN-on-Demand: An affordable DDoS Defense via Untrusted Clouds.",
                    "Towards SDN-Defined Programmable BYOD (Bring Your Own Device) Security.",
                    "Centrally Banked Cryptocurrencies.",
                    "Equihash: Asymmetric Proof-of-Work Based on the Generalized Birthday Problem.",
                    "A Simple Generic Attack on Text Captchas.",
                    "You are a Game Bot!: Uncovering Game Bots in MMORPGs via Self-similarity in the Wild.",
                    "Tracking Mobile Web Users Through Motion Sensors: Attacks and Defenses.",
                    "The Price of Free: Privacy Leakage in Personalized Mobile In-Apps Ads.",
                    "What Mobile Ads Know About Mobile Users.",
                    "Free for All! Assessing User Data Exposure to Advertising Libraries on Android.",
                    "Practical Attacks Against Privacy and Availability in 4G/LTE Mobile Communication Systems.",
                    "Towards Automated Dynamic Analysis for Linux-based Embedded Firmware.",
                    "discovRE: Efficient Cross-Architecture Identification of Bugs in Binary Code.",
                    "Driller: Augmenting Fuzzing Through Selective Symbolic Execution.",
                    "VTrust: Regaining Trust on Virtual Calls.",
                    "Protecting C++ Dynamic Dispatch Through VTable Interleaving.",
                    "ProTracer: Towards Practical Provenance Tracing by Alternating Between Logging and Tainting.",
                    "Who's in Control of Your Control System? Device Fingerprinting for Cyber-Physical Systems.",
                    "SKEE: A lightweight Secure Kernel-level Execution Environment for ARM.",
                    "OpenSGX: An Open Platform for SGX Research.",
                    "Efficient Private Statistics with Succinct Sketches.",
                    "Dependence Makes You Vulnberable: Differential Privacy Under Dependent Tuples.",
                    "Privacy-Preserving Shortest Path Computation.",
                    "LinkMirage: Enabling Privacy-preserving Analytics on Social Relationships.",
                    "Do You See What I See? Differential Treatment of Anonymous Users.",
                    "Measuring and Mitigating AS-level Adversaries Against Tor.",
                    "Website Fingerprinting at Internet Scale.",
                    "Extract Me If You Can: Abusing PDF Parsers in Malware Detectors.",
                    "Automatically Evading Classifiers: A Case Study on PDF Malware Classifiers.",
                    "Cache, Trigger, Impersonate: Enabling Context-Sensitive Honeyclient Analysis On-the-Wire.",
                    "LO-PHI: Low-Observable Physical Host Instrumentation for Malware Analysis.",
                    "When a Tree Falls: Using Diversity in Ensemble Classifiers to Identify Evasion in Malware Detectors.",
                    "Kratos: Discovering Inconsistent Security Policy Enforcement in the Android Framework.",
                    "How to Make ASLR Win the Clone Wars: Runtime Re-Randomization.",
                    "Leakage-Resilient Layout Randomization for Mobile Devices.",
                    "Enabling Client-Side Crash-Resistance to Overcome Diversification and Information Hiding.",
                    "Enforcing Kernel Security Invariants with Data Flow Integrity.",
                    "Going Native: Using a Large-Scale Analysis of Android Apps to Create a Practical Native-Code Sandboxing Policy.",
                    "Life after App Uninstallation: Are the Data Still Alive? Data Residue Attacks on Android.",
                    "FLEXDROID: Enforcing In-App Privilege Separation in Android.",
                    "IntelliDroid: A Targeted Input Generator for the Dynamic Analysis of Android Malware.",
                    "Harvesting Runtime Values in Android Applications That Feature Anti-Analysis Techniques.",
                    "Automatic Forgery of Cryptographically Consistent Messages to Identify Security Vulnerabilities in Mobile Services.",
                    "Differentially Private Password Frequency Lists.",
                    "Who Are You? A Statistical Approach to Measuring User Authenticity.",
                    "Pitfalls in Designing Zero-Effort Deauthentication: Opportunistic Human Observation Attacks.",
                    "VISIBLE: Video-Assisted Keystroke Inference from Tablet Backside Motion."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "22nd NDSS 2015",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2015",
                "sub_name": "22nd Annual Network and Distributed System Security Symposium, NDSS 2015, San Diego, California, USA, February 8-11, 2015.",
                "count": 50,
                "papers": [
                    "Identifying Cross-origin Resource Status Using Application Cache.",
                    "Parking Sensors: Analyzing and Detecting Parked Domains.",
                    "Seven Months' Worth of Mistakes: A Longitudinal Study of Typosquatting Abuse.",
                    "Upgrading HTTPS in mid-air: An empirical study of strict transport security and key pinning.",
                    "I Do Not Know What You Visited Last Summer: Protecting users from stateful third-party web tracking with TrackingFree browser.",
                    "Information Flow Analysis of Android Applications in DroidSafe.",
                    "What's in Your Dongle and Bank Account? Mandatory and Discretionary Protection of Android External Resources.",
                    "EdgeMiner: Automatically Detecting Implicit Control Flow Transitions through the Android Framework.",
                    "CopperDroid: Automatic Reconstruction of Android Malware Behaviors.",
                    "DeepDroid: Dynamically Enforcing Enterprise Policy on Android Devices.",
                    "VTint: Protecting Virtual Function Tables' Integrity.",
                    "Phoneypot: Data-driven Understanding of Telephony Threats.",
                    "SeCReT: Secure Channel between Rich Execution Environment and Trusted Execution Environment.",
                    "FreeSentry: protecting against use-after-free vulnerabilities due to dangling pointers.",
                    "EKHunter: A Counter-Offensive Toolkit for Exploit Kit Infiltration.",
                    "Machine Learning Classification over Encrypted Data.",
                    "Gracewipe: Secure and Verifiable Deletion under Coercion.",
                    "Privacy Preserving Payments in Credit Networks: Enabling trust with privacy in online marketplaces.",
                    "Checking More and Alerting Less: Detecting Privacy Leakages via Enhanced Data-flow Analysis and Peer Voting.",
                    "DEFY: A Deniable, Encrypted File System for Log-Structured Storage.",
                    "Preventing Use-after-free with Dangling Pointers Nullification.",
                    "StackArmor: Comprehensive Protection From Stack-based Memory Error Vulnerabilities for Binaries.",
                    "Isomeron: Code Randomization Resilient to (Just-In-Time) Return-Oriented Programming.",
                    "Thwarting Cache Side-Channel Attacks Through Dynamic Software Diversity.",
                    "Principled Sampling for Anomaly Detection.",
                    "Integrated Circuit (IC) Decamouflaging: Reverse Engineering Camouflaged ICs within Minutes.",
                    "Opaque Control-Flow Integrity.",
                    "Bloom Cookies: Web Search Personalization without User Tracking.",
                    "NSEC5: Provably Preventing DNSSEC Zone Enumeration.",
                    "Predicting Users' Motivations behind Location Check-Ins and Utility Implications of Privacy Protection Mechanisms.",
                    "On Your Social Network De-anonymizablity: Quantification and Large Scale Evaluation with Seed Knowledge.",
                    "Efficient RAM and control flow in verifiable outsourced computation.",
                    "Integro: Leveraging Victim Prediction for Robust Fake Account Detection in OSNs.",
                    "Spaced Repetition and Mnemonics Enable Recall of Multiple Strong Passwords.",
                    "ABY - A Framework for Efficient Mixed-Protocol Secure Two-Party Computation.",
                    "Preventing Lunchtime Attacks: Fighting Insider Threats With Eye Movement Biometrics.",
                    "Knock Yourself Out: Secure Authentication with Short Re-Usable Passwords.",
                    "Verified Contributive Channel Bindings for Compound Authentication.",
                    "The Devil is in the Constants: Bypassing Defenses in Browser JIT Engines.",
                    "Exploiting and Protecting Dynamic Code Generation.",
                    "Too LeJIT to Quit: Extending JIT Spraying to ARM.",
                    "Run-time Monitoring and Formal Analysis of Information Flows in Chromium.",
                    "Mind Your Blocks: On the Stealthiness of Malicious BGP Hijacks.",
                    "SPHINX: Detecting Security Attacks in Software-Defined Networks.",
                    "Securing the Software Defined Network Control Layer.",
                    "Poisoning Network Visibility in Software-Defined Networks: New Attacks and Countermeasures.",
                    "Firmalice - Automatic Detection of Authentication Bypass Vulnerabilities in Binary Firmware.",
                    "vfGuard: Strict Protection for Virtual Function Calls in COTS C++ Binaries.",
                    "P2C: Understanding Output Data Files via On-the-Fly Transformation from Producer to Consumer Executions.",
                    "No More Gotos: Decompilation Using Pattern-Independent Control-Flow Structuring and Semantic-Preserving Transformations."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "21st NDSS 2014",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2014",
                "sub_name": "21st Annual Network and Distributed System Security Symposium, NDSS 2014, San Diego, California, USA, February 23-26, 2014.",
                "count": 55,
                "papers": [
                    "On the Mismanagement and Maliciousness of Networks.",
                    "No Direction Home: The True Cost of Routing Around Decoys.",
                    "Gaining Control of Cellular Traffic Accounting by Spurious TCP Retransmission.",
                    "CyberProbe: Towards Internet-Scale Active Detection of Malicious Servers.",
                    "Amplification Hell: Revisiting Network Protocols for DDoS Abuse.",
                    "ROPecker: A Generic and Practical Approach For Defending Against ROP Attacks.",
                    "A Trusted Safety Verifier for Process Controller Code.",
                    "AVATAR: A Framework to Support Dynamic Security Analysis of Embedded Systems' Firmwares.",
                    "SafeDispatch: Securing C++ Virtual Calls from Memory Corruption Attacks.",
                    "Hybrid-Bridge: Efficiently Bridging the Semantic-Gap in VMI via Decoupled Execution and Training Memoization.",
                    "Screenmilker: How to Milk Your Android Screen for Secrets.",
                    "AccelPrint: Imperfections of Accelerometers Make Smartphones Trackable.",
                    "Smartphones as Practical and Secure Location Verification Tokens for Payments.",
                    "Breaking and Fixing Origin-Based Access Control in Hybrid Web/Mobile Application Frameworks.",
                    "Inside Job: Understanding and Mitigating the Threat of External Device Mis-Binding on Android.",
                    "DSpin: Detecting Automatically Spun Content on the Web.",
                    "Toward Black-Box Detection of Logic Flaws in Web Applications.",
                    "Macaroons: Cookies with Contextual Caveats for Decentralized Authorization in the Cloud.",
                    "Detecting Logic Vulnerabilities in E-commerce Applications.",
                    "Simulation of Built-in PHP Features for Precise Static Code Analysis.",
                    "Enhanced Certificate Transparency and End-to-End Encrypted Mail.",
                    "Privacy through Pseudonymity in Mobile Telephony Systems.",
                    "Privacy-Preserving Distributed Stream Monitoring.",
                    "The Sniper Attack: Anonymously Deanonymizing and Disabling the Tor Network.",
                    "Selling off User Privacy at Auction.",
                    "The Tangled Web of Password Reuse.",
                    "On Semantic Patterns of Passwords and their Security Impact.",
                    "From Very Weak to Very Strong: Analyzing Password-Strength Meters.",
                    "Copker: Computing with Private Keys without RAM.",
                    "Practical Dynamic Searchable Encryption with Small Leakage.",
                    "Decentralized Anonymous Credentials.",
                    "Dynamic Searchable Encryption in Very-Large Databases: Data Structures and Implementation.",
                    "Authentication Using Pulse-Response Biometrics.",
                    "Hardening Persona - Improving Federated Web Login.",
                    "Two-Factor Authentication Resilient to Server Compromise Using Mix-Bandwidth Devices.",
                    "Leveraging USB to Establish Host Identity Using Commodity Devices.",
                    "PlaceAvoider: Steering First-Person Cameras away from Sensitive Spaces.",
                    "Auditable Version Control Systems.",
                    "Power Attack: An Increasing Threat to Data Centers.",
                    "Scambaiter: Understanding Targeted Nigerian Scams on Craigslist.",
                    "Botcoin: Monetizing Stolen Cycles.",
                    "A Machine-learning Approach for Classifying and Categorizing Android Sources and Sinks.",
                    "AirBag: Boosting Smartphone Resistance to Malware Infection.",
                    "SMV-Hunter: Large Scale, Automated Detection of SSL/TLS Man-in-the-Middle Vulnerabilities in Android Apps.",
                    "AppSealer: Automatic Generation of Vulnerability-Specific Patches for Preventing Component Hijacking Attacks in Android Applications.",
                    "Execute This! Analyzing Unsafe and Malicious Dynamic Code Loading in Android Applications.",
                    "Nazca: Detecting Malware Distribution in Large-Scale Networks.",
                    "Persistent Data-only Malware: Function Hooks without Code.",
                    "DREBIN: Effective and Explainable Detection of Android Malware in Your Pocket.",
                    "Gyrus: A Framework for User-Intent Monitoring of Text-based Networked Applications.",
                    "Neural Signatures of User-Centered Security: An fMRI Study of Phishing, and Malware Warnings.",
                    "Web PKI: Closing the Gap between Guidelines and Practices.",
                    "Efficient Private File Retrieval by Combining ORAM and PIR.",
                    "Practical Known-Plaintext Attacks against Physical Layer Security in Wireless MIMO Systems.",
                    "Practical Issues with TLS Client Certificate Authentication."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "20th NDSS 2013",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2013",
                "sub_name": "20th Annual Network and Distributed System Security Symposium, NDSS 2013, San Diego, California, USA, February 24-27, 2013.",
                "count": 64,
                "papers": [
                    "General Chair's Message.",
                    "Program Chair's Message.",
                    "20 Years of Network and Distributed Systems Security: The Good, the Bad, and the Ugly.",
                    "I can be You: Questioning the use of Keystroke Dynamics as Biometrics.",
                    "A Practical, Targeted, and Stealthy Attack Against WPA Enterprise Authentication.",
                    "Unobservable Re-authentication for Smartphones.",
                    "PlaceRaider: Virtual Theft in Physical Spaces with Smartphones.",
                    "Detecting Passive Content Leaks and Pollution in Android Applications.",
                    "Security Enhanced (SE) Android: Bringing Flexible MAC to Android.",
                    "The Core of the Matter: Analyzing Malicious Traffic in Cellular Carriers.",
                    "High Accuracy Attack Provenance via Binary-based Execution Partition.",
                    "Attack Surface Metrics and Automated Compile-Time OS Kernel Tailoring.",
                    "Taming Hosted Hypervisors with (Mostly) Deprivileged Execution.",
                    "When Firmware Modifications Attack: A Case Study of Embedded Exploitation.",
                    "CAMP: Content-Agnostic Malware Protection.",
                    "InteGuard: Toward Automatic Protection of Third-Party Web Service Integrations.",
                    "Preventing Side-Channel Leaks in Web Traffic: A Formal Approach.",
                    "NEIGHBORWATCHER: A Content-Agnostic Comment Spam Inference System.",
                    "AUTHSCAN: Automatic Extraction of Web Authentication Protocols from Implementations.",
                    "The Postman Always Rings Twice: Attacking and Defending postMessage in HTML5 Websites.",
                    "Laying a Secure Foundation for Mobile Devices.",
                    "Pisces: Anonymous Communication Using Social Networks.",
                    "Preserving Link Privacy in Social Network Based Systems.",
                    "COMPA: Detecting Compromised Accounts on Social Networks.",
                    "Social Turing Tests: Crowdsourcing Sybil Detection.",
                    "Comparing Mobile Privacy Protection through Cross-Platform Applications.",
                    "On Implementing Deniable Storage Encryption for Mobile Devices.",
                    "Contextual Policy Enforcement in Android Applications with Permission Event Graphs.",
                    "Low-cost Standard Signatures in Wireless Sensor Networks: A Case for Reviving Pre-computation Techniques?",
                    "Clickonomics: Determining the Effect of Anti-Piracy Measures for One-Click Hosting.",
                    "FRESCO: Modular Composable Security Services for Software-Defined Networks.",
                    "Intention and Origination: An Inside Look at Large-Scale Bot Queries.",
                    "Juice: A Longitudinal Study of an SEO Botnet.",
                    "I want my voice to be heard: IP over Voice-over-IP for unobservable censorship circumvention.",
                    "OIRS: Outsourced Image Recovery Service From Comprehensive Sensing With Privacy Assurance.",
                    "How Privacy Leaks From Bluetooth Mouse?",
                    "Practical Timing Side Channel Attacks Against Kernel Space ASLR.",
                    "Updates from the Internet Backbone: An RPKI/RTR Router Implementation, Measurements, and Analysis.",
                    "Metrics for Automated Network Security Design.",
                    "Automatic Protocol Selection in Secure Two-Party Computations.",
                    "Assessing software integrity of virtual appliances through software whitelists.",
                    "Privacy-Enhancing Technologies for Medical Tests Using Genomic Data.",
                    "ObliviStore: High Performance Oblivious Distributed Cloud Data Store.",
                    "A Non-interactive Dual-channel Authentication Protocol for Assuring Pseudo-confidentiality.",
                    "Macroeconomic Analysis of Malware.",
                    "TransBlocker: Transforming and Taming Privacy-Breaching Android Applications.",
                    "You Can't Do Today's Security With Yesterday's Methods.",
                    "One (Block) Size Fits All: PIR and SPIR with Variable-Length Records via Multi-Block Queries.",
                    "rBridge: User Reputation based Tor Bridge Distribution with Privacy Preservation.",
                    "An Empirical Evaluation of Relay Selection in Tor.",
                    "LIRA: Lightweight Incentivized Routing for Anonymity.",
                    "KinWrite: Handwriting-Based Authentication Using Kinect.",
                    "Tailing RFID Tags for Clone Detection.",
                    "One Bad Apple: Backwards Compatibility Attacks on State-of-the-Art Cryptography.",
                    "Does Counting Still Count? Revisiting the Security of Counting based User Authentication Protocols against Statistical Attacks.",
                    "Toward Online Verification of Client Behavior in Distributed Applications.",
                    "Clear and Present Data: Opaque Traffic and its Security Implications for the Future.",
                    "Verito: A Practical System for Transparency and Accountability in Virtual Economies.",
                    "Secure Computation on Floating Point Numbers.",
                    "Analyzing Unique-Bid Auction Sites for Fun and Profit.",
                    "Fix Me Up: Repairing Access-Control Bugs in Web Applications.",
                    "Automatically Inferring the Evolution of Malicious Activity on the Internet.",
                    "Detection of Malicious PDF Files Based on Hierarchical Document Structure.",
                    "Behind the Scenes of Online Attacks: an Analysis of Exploitation Behaviors on the Web."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "19th NDSS 2012",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2012",
                "sub_name": "19th Annual Network and Distributed System Security Symposium, NDSS 2012, San Diego, California, USA, February 5-8, 2012.",
                "count": 54,
                "papers": [
                    "Plaintext-Recovery Attacks Against Datagram TLS.",
                    "ANDaNA: Anonymous Named Data Networking Application.",
                    "Persistent OSPF Attacks.",
                    "You are what you like! Information leakage through users' Interests.",
                    "X-Vine: Secure and Pseudonymous Routing in DHTs Using Social Networks.",
                    "Towards Online Spam Filtering in Social Networks.",
                    "Location leaks over the GSM air interface.",
                    "Track Me If You Can: On the Effectiveness of Context-based Identifier Changes in Deployed Mobile Networks.",
                    "You Can Run, but You Can't Hide: Exposing Network Location for Targeted DoS Attacks in Cellular Networks.",
                    "Weaponizing Femtocells: The Effect of Rogue Devices on Mobile Telecommunications.",
                    "Privacy-preserving Logarithmic-time Search on Encrypted Data in Cloud.",
                    "Large-Scale Privacy-Preserving Mapping of Human Genomic Sequences on Hybrid Clouds.",
                    "Making argument systems for outsourced computation practical (sometimes).",
                    "Towards Practical Oblivious RAM.",
                    "Hubble: Transparent and Extensible Malware Analysis by Combining Hardware Virtualization and Software Emulation.",
                    "FreeMarket: Shopping for free in Android applications.",
                    "Distance Hijacking Attacks on Distance Bounding Protocols.",
                    "Throttling Tor Bandwidth Parasites.",
                    "Taking Routers Off Their Meds: Why Assumptions Of Router Stability Are Dangerous.",
                    "Newton Meets Vivaldi: Using Physical Laws to Secure Virtual Coordinate Systems.",
                    "Charm: A Framework for Rapidly Prototyping Cryptosystems.",
                    "Abuse Detection and Prevention Systems at a Large Scale Video Sharing Website.",
                    "Access Pattern disclosure on Searchable Encryption: Ramification, Attack and Mitigation.",
                    "On Limitations of Designing Leakage-Resilient Password Systems: Attacks, Principals and Usability.",
                    "Adaptive Password-Strength Meters from Markov Models.",
                    "Private Set Intersection: Are Garbled Circuits Better than Custom Protocols?",
                    "Guess Who's Texting You? Evaluating the Security of Smartphone Messaging Applications.",
                    "MoCFI: A Framework to Mitigate Control-Flow Attacks on Smartphones.",
                    "Towards Taming Privilege-Escalation Attacks on Android.",
                    "Systematic Detection of Capability Leaks in Stock Android Smartphones.",
                    "Hey, You, Get Off of My Market: Detecting Malicious Apps in Official and Alternative Android Markets.",
                    "Insights into User Behavior in Dealing with Internet Attacks.",
                    "PathCutter: Severing the Self-Propagation Path of XSS JavaScript Worms in Social Web Networks.",
                    "The Latent Community Model for Detecting Sybils in Social Networks.",
                    "BLACR: TTP-Free Blacklistable Anonymous Credentials with Reputation.",
                    "Accountable Wiretapping -or- I know they can hear you now.",
                    "Shadow: Running Tor in a Box for Accurate and Efficient Experimentation.",
                    "Discovering Semantic Data of Interest from Un-mappable Memory with Confidence.",
                    "SecureSwitch: BIOS-Assisted Isolation and Switch between Trusted and Untrusted Commodity OSes.",
                    "SMART: Secure and Minimal Architecture for (Establishing Dynamic) Root of Trust.",
                    "Kruiser: Semi-synchronized Non-blocking Concurrent Kernel Heap Buffer Overflow Monitoring.",
                    "WarningBird: Detecting Suspicious URLs in Twitter Stream.",
                    "Using replicated execution for a more secure and reliable web browser.",
                    "Host Fingerprinting and Tracking on the Web: Privacy and Security Implications.",
                    "Chrome Extensions: Threat Analysis and Countermeasures.",
                    "Ghost Domain Names: Revoked Yet Still Resolvable.",
                    "ShortMAC: Efficient Data-Plane Fault Localization.",
                    "Bypassing Space Explosion in Regular Expression Matching for Network Intrusion Detection and Prevention Systems.",
                    "The Case for Prefetching and Prevalidating TLS Server Certificates.",
                    "Gatling: Automatic Attack Discovery in Large-Scale Distributed Systems.",
                    "Automated Synthesis of Secure Distributed Applications.",
                    "A General Approach for Efficiently Accelerating Software-based Dynamic Data Flow Tracking on Commodity Hardware.",
                    "Static detection of C++ vtable escape vulnerabilities in binary code.",
                    "Identifying and Analyzing Pointer Misuses for Sophisticated Memory-corruption Exploit Diagnosis."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "18th NDSS 2011",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2011",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2011, San Diego, California, USA, 6th February - 9th February 2011.",
                "count": 28,
                "papers": [
                    "Soundcomber: A Stealthy and Context-Aware Sound Trojan for Smartphones.",
                    "A Security API for Distributed Social Networks.",
                    "Location Privacy via Private Proximity Testing.",
                    "Relay Attacks on Passive Keyless Entry and Start Systems in Modern Cars.",
                    "Using Classification to Protect the Integrity of Spectrum Measurements in White Space Networks.",
                    "Good Neighbor: Ad hoc Pairing of Nearby Wireless Devices by Multiple Antennas.",
                    "Practical Protection of Kernel Integrity for Commodity OS from Untrusted Extensions.",
                    "Efficient Monitoring of Untrusted Kernel-Mode Execution.",
                    "SigGraph: Brute Force Scanning of Kernel Data Structure Instances Using Graph-based Signatures.",
                    "Losing Control of the Internet: Using the Data Plane to Attack the Control Plane.",
                    "EXPOSURE: Finding Malicious Domains Using Passive DNS Analysis.",
                    "Howard: A Dynamic Excavator for Reverse Engineering Data Structures.",
                    "No Loitering: Exploiting Lingering Vulnerabilities in Default COM Objects.",
                    "TIE: Principled Reverse Engineering of Types in Binary Programs.",
                    "DTA++: Dynamic Taint Analysis with Targeted Control-Flow Propagation.",
                    "AEG: Automatic Exploit Generation.",
                    "Automated Discovery of Parameter Pollution Vulnerabilities in Web Applications.",
                    "WebShield: Enabling Various Web Defense Techniques without Client Side Modifications.",
                    "HTTPOS: Sealing Information Leaks with Browser-side Obfuscation of Encrypted Flows.",
                    "Accurate and Provably Secure Latency Estimation with Treeple.",
                    "On Measuring the Similarity of Network Hosts: Pitfalls, New Metrics, and Empirical Analyses.",
                    "SWIRL: A Scalable Watermark to Detect Correlated Network Flows.",
                    "SPARE: Replicas on Hold.",
                    "Efficient Privacy-Preserving Biometric Identification.",
                    "Usability Testing a Malware-Resistant Input Mechanism.",
                    "Tracker: Security and Privacy for RFID-based Supply Chains.",
                    "PiOS: Detecting Privacy Leaks in iOS Applications.",
                    "Privacy-Preserving Aggregation of Time-Series Data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "17th NDSS 2010",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2010",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2010, San Diego, California, USA, 28th February - 3rd March 2010.",
                "count": 24,
                "papers": [
                    "Server-side Verification of Client Behavior in Online Games.",
                    "Defeating Vanish with Low-Cost Sybil Attacks Against Large DHTs.",
                    "Stealth DoS Attacks on Secure Channels.",
                    "Protecting Browsers from Extension Vulnerabilities.",
                    "Adnostic: Privacy Preserving Targeted Advertising.",
                    "FLAX: Systematic Discovery of Client-side Validation Vulnerabilities in Rich Web Applications.",
                    "Effective Anomaly Detection with Scarce Training Data.",
                    "Large-Scale Automatic Classification of Phishing Pages.",
                    "A Systematic Characterization of IM Threats using Honeypots.",
                    "On Network-level Clusters for Spam Detection.",
                    "Improving Spam Blacklisting Through Dynamic Thresholding and Speculative Aggregation.",
                    "Botnet Judo: Fighting Spam with Itself.",
                    "Contractual Anonymity.",
                    "A3: An Extensible Platform for Application-Aware Anonymity.",
                    "When Good Randomness Goes Bad: Virtual Machine Reset Vulnerabilities and Hedging Deployed Cryptography.",
                    "InvisiType: Object-Oriented Security Policies.",
                    "A Security Evaluation of DNSSEC with NSEC3.",
                    "On the Safety of Enterprise Policy Deployment.",
                    "Where Do You Want to Go Today? Escalating Privileges by Pathname Manipulation.",
                    "Joe-E: A Security-Oriented Subset of Java.",
                    "Preventing Capability Leaks in Secure JavaScript Subsets.",
                    "Binary Code Extraction and Interface Identification for Security Applications.",
                    "Automatic Reverse Engineering of Data Structures from Binary Execution.",
                    "Efficient Detection of Split Personalities in Malware."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16th NDSS 2009",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2009",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2009, San Diego, California, USA, 8th February - 11th February 2009.",
                "count": 20,
                "papers": [
                    "Document Structure Integrity: A Robust Basis for Cross-site Scripting Defense.",
                    "An Efficient Black-box Technique for Defeating Web Application Attacks.",
                    "Noncespaces: Using Randomization to Enforce Information Flow Tracking and Thwart Cross-Site Scripting Attacks.",
                    "The Blind Stone Tablet: Outsourcing Durability to Untrusted Parties.",
                    "Two-Party Computation Model for Privacy-Preserving Queries over Distributed Databases.",
                    "SybilInfer: Detecting Sybil Nodes using Social Networks.",
                    "Spectrogram: A Mixture-of-Markov-Chains Model for Anomaly Detection in Web Traffic.",
                    "Detecting Forged TCP Reset Packets.",
                    "Coordinated Scan Detection.",
                    "RB-Seeker: Auto-detection of Redirection Botnets.",
                    "Scalable, Behavior-Based Malware Clustering.",
                    "K-Tracer: A System for Extracting Kernel Malware Behavior.",
                    "RAINBOW: A Robust And Invisible Non-Blind Watermark for Network Flows.",
                    "Traffic Morphing: An Efficient Defense Against Statistical Traffic Analysis.",
                    "Recursive DNS Architectures and Vulnerability Implications.",
                    "Analyzing and Comparing the Protection Quality of Security Enhanced Operating Systems.",
                    "IntScope: Automatically Detecting Integer Overflow Vulnerability in X86 Binary Using Symbolic Execution.",
                    "Safe Passage for Passwords and Other Sensitive Data.",
                    "Conditioned-safe Ceremonies and a User Study of an Application to Web Authentication.",
                    "CSAR: A Practical and Provable Technique to Make Randomized Systems Accountable."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15th NDSS 2008",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2008",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2008, San Diego, California, USA, 10th February - 13th February 2008.",
                "count": 21,
                "papers": [
                    "A New Privacy-Enhanced Matchmaking Protocol.",
                    "Corrupted DNS Resolution Paths: The Rise of a Malicious Resolution Authority.",
                    "A Tune-up for Tor: Improving Security and Performance in the Tor Network.",
                    "Halo: High-Assurance Locate for Distributed Hash Tables.",
                    "Robust Receipt-Free Election System with Ballot Secrecy and Verifiability.",
                    "Realizing Massive-Scale Conditional Access Systems Through Attribute-Based Cryptosystems.",
                    "Analyzing Privacy in Enterprise Packet Trace Anonymization.",
                    "Taming the Devil: Techniques for Evaluating Anonymized Network Data.",
                    "Usable PIR.",
                    "Automated Whitebox Fuzz Testing.",
                    "Would Diversity Really Increase the Robustness of the Routing Infrastructure against Software Defects?",
                    "PRECIP: Towards Practical and Retrofittable Confidential Information Protection.",
                    "Automatic Network Protocol Analysis.",
                    "Automatic Protocol Format Reverse Engineering through Context-Aware Monitored Execution.",
                    "HookFinder: Identifying and Understanding Malware Hooking Behaviors.",
                    "Measuring and Detecting Fast-Flux Service Networks.",
                    "BotSniffer: Detecting Botnet Command and Control Channels in Network Traffic.",
                    "Limits of Learning-based Signature Generation with Adversaries.",
                    "Impeding Malware Analysis Using Conditional Code Obfuscation.",
                    "Analysis-Resistant Malware.",
                    "Exploiting Opportunistic Scheduling in Cellular Data Networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14th NDSS 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2007",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2007, San Diego, California, USA, 28th February - 2nd March 2007.",
                "count": 17,
                "papers": [
                    "Low-Rate TCP-Targeted DoS Attack Disrupts Internet Routing.",
                    "Playing Devil's Advocate: Inferring Sensitive Information from Anonymized Network Traces.",
                    "Fig: Automatic Fingerprint Generation.",
                    "Cross Site Scripting Prevention with Dynamic Data Tainting and Static Analysis.",
                    "A Quantitative Study of Forum Spamming Using Context-based Analysis.",
                    "Phinding Phish: An Evaluation of Anti-Phishing Toolbars.",
                    "Army of Botnets.",
                    "Shedding Light on the Configuration of Dark Addresses.",
                    "Consumable Credentials in Linear-Logic-Based Access-Control Systems.",
                    "Secret Handshakes with Dynamic and Fuzzy Matching.",
                    "Attribute-Based Publishing with Hidden Credentials and Hidden Policies.",
                    "File System Design with Assured Delete.",
                    "Cryptographic Methods for Storing Ballots on a Voting Machine.",
                    "On the Practicality of Private Information Retrieval.",
                    "RICH: Automatically Protecting Against Integer-Based Vulnerabilities.",
                    "Generic Application-Level Protocol Analyzer and its Language.",
                    "OPTWALL: A Hierarchical Traffic-Aware Firewall."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13th NDSS 2006",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2006",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2006, San Diego, California, USA.",
                "count": 17,
                "papers": [
                    "A Crawler-based Study of Spyware in the Web.",
                    "Automated Web Patrol with Strider HoneyMonkeys: Finding Web Sites That Exploit Browser Vulnerabilities.",
                    "Using Generalization and Characterization Techniques in the Anomaly-based Detection of Web Attacks.",
                    "Isolating Intrusions by Automatic Experiments.",
                    "Vulnerability-Specific Execution Filtering for Exploit Prevention on Commodity Software.",
                    "Software Self-Healing Using Collaborative Application Communities.",
                    "Inoculating SSH Against Address Harvesting.",
                    "Enterprise Security: A Community of Interest Based Approach.",
                    "Protocol-Independent Adaptive Replay of Application Dialog.",
                    "Trust Negotiation with Hidden Credentials, Hidden Policies, and Policy Cycles.",
                    "Deploying a New Hash Algorithm.",
                    "Key Regression: Enabling Efficient Key Distribution for Secure Distributed Storage.",
                    "Induced Churn as Shelter from Routing-Table Poisoning.",
                    "Device Identification via Analog Signal Fingerprinting: A Matched Filter Approach.",
                    "Modeling Botnet Propagation Using Time Zones.",
                    "Toward a Practical Data Privacy Scheme for a Distributed Implementation of the Smith-Waterman Genome Sequence Comparison Algorithm.",
                    "Toward Automated Information-Flow Integrity Verification for Security-Critical Applications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12th NDSS 2005",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2005",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2005, San Diego, California, USA.",
                "count": 16,
                "papers": [
                    "Space-Efficient Block Storage Integrity.",
                    "Improved Proxy Re-Encryption Schemes with Applications to Secure Distributed Storage.",
                    "Rekeying and Storage Cost for Multiple User Revocation.",
                    "On a New Class of Pulsing Denial-of-Service Attacks and the Defense.",
                    "MOVE: An End-to-End Solution to Network Denial of Service.",
                    "Security Analysis and Improvements for IEEE 802.11i.",
                    "Privacy-Preserving Friends Troubleshooting Network.",
                    "Pretty Secure BGP, psBGP.",
                    "New Streaming Algorithms for Fast Detection of Superspreaders.",
                    "The Internet Motion Sensor - A Distributed Blackhole Monitoring System.",
                    "DNS-based Detection of Scanning Worms in an Enterprise Network.",
                    "DIRA: Automatic Detection, Identification and Repair of Control-Hijacking Attacks.",
                    "Dynamic Taint Analysis for Automatic Detection, Analysis, and SignatureGeneration of Exploits on Commodity Software.",
                    "Enriching Intrusion Alerts Through Multi-Host Causality.",
                    "A Black-Box Tracing Technique to Identify Causes of Least-Privilege Incompatibilities.",
                    "One-Way Isolation: An Effective Approach for Realizing Safe Execution Environments."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11th NDSS 2004",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2004",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2004, San Diego, California, USA.",
                "count": 16,
                "papers": [
                    "DoS Protection for Reliably Authenticated Broadcast.",
                    "Distillation Codes and Applications to DoS Resistant Multicast Authentication.",
                    "Efficient Context-Sensitive Intrusion Detection.",
                    "Global Intrusion Detection in the DOMINO Overlay System.",
                    "Building Attack Scenarios through Integration of Complementary Alert Correlation Method.",
                    "Client-Side Defense Against Web-Based Identity Theft.",
                    "Using Directional Antennas to Prevent Wormhole Attacks.",
                    "An Effective Architecture and Algorithm for Detecting Worms with Various Scan.",
                    "A Practical Dynamic Buffer Overflow Detector.",
                    "Model Checking One Million Lines of C Code.",
                    "Ostia: A Delegating Architecture for Secure System Call Interposition.",
                    "Authentication and Integrity in Outsourced Databases.",
                    "Building an Encrypted and Searchable Audit Log.",
                    "Speeding up Secure Web Transactions Using Elliptic Curve Cryptography.",
                    "The Design and Implementation of Datagram TLS.",
                    "The Perils of Unauthenticated Encryption: Kerberos Version 4."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10th NDSS 2003",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2003",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2003, San Diego, California, USA.",
                "count": 17,
                "papers": [
                    "Fighting Spam by Encapsulating Policy in Email Addresses.",
                    "Moderately Hard, Memory-Bound Functions.",
                    "Secure IP Telephony using Multi-layered Protection.",
                    "Efficient Security Mechanisms for Routing Protocolsa.",
                    "Working around BGP: An Incremental Approach to Improving Security and Accuracy in Interdomain Routing.",
                    "Integrating Security, Mobility and Multi-Homing in a HIP Way.",
                    "Access Control Based on Execution History.",
                    "Testing C Programs for Buffer Overflow Vulnerabilities.",
                    "SiRiUS: Securing Remote Untrusted Storage.",
                    "A Comparison of Publicly Available Tools for Dynamic Buffer Overflow Prevention.",
                    "Traps and Pitfalls: Practical Problems in System Call Interposition Based Security Tools.",
                    "Detecting Service Violations and DoS Attacks.",
                    "A Virtual Machine Introspection Based Architecture for Intrusion Detection.",
                    "Proxy Cryptography Revisited.",
                    "Proactive Two-Party Signatures for User Authentication.",
                    "Efficient Multicast Packet Authentication.",
                    "Efficient Distribution of Key Chain Commitments for Broadcast Authentication in Distributed Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th NDSS 2002",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2002",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2002, San Diego, California, USA.",
                "count": 15,
                "papers": [
                    "Using the Fluhrer, Mantin, and Shamir Attack to Break WEP.",
                    "Talking to Strangers: Authentication in Ad-Hoc Wireless Networks.",
                    "An Analysis of the Degradation of Anonymous Protocols.",
                    "Distributed Pattern Detection for Intrusion Detection.",
                    "BlueBox: A Policy-Driven, Host-Based Intrusion Detection System.",
                    "Implementing Pushback: Router-Based Defense Against DDoS Attacks.",
                    "Statistically Unique and Cryptographically Verifiable (SUCV) Identifiers and Addresses.",
                    "Detecting Steganographic Content on the Internet.",
                    "Experimenting with Server-Aided Signatures.",
                    "Managing Interoperability in Non-Hierarchical Public Key Infrastructures.",
                    "Active Certificates: A Framework for Delegation.",
                    "PAMINA: A Certificate Based Privilege Management System.",
                    "Performance Analysis of TLS Web Servers.",
                    "Fast-Track Session Establishment for TLS.",
                    "Advanced Client/Server Authentication in TLS."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th NDSS 2001",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2001",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2001, San Diego, California, USA.",
                "count": 18,
                "papers": [
                    "An Algebraic Approach to IP Traceback.",
                    "Authenticating Streamed Data in the Presence of Random Packet Loss.",
                    "Practical Experiences with ATM Encryption.",
                    "Efficient and Secure Source Authentication for Multicast.",
                    "TRICERT: A Distributed Certified E-Mail Scheme.",
                    "Wireless Security - Is It Real?",
                    "An Architecture for Flexible, High Assurance, Multi-Security Domain Networks.",
                    "Authentication and Key Agreement Via Memorable Passwords.",
                    "SPL: An Access Control Language for Security Policies and Complex Constraints.",
                    "Limiting the Disclosure of Access Control Policies during Automated Trust Negotiation.",
                    "Principles of Policy in Secure Groups.",
                    "Trust Management for IPsec.",
                    "Building Certifications Paths: Forward vs. Reverse.",
                    "Decentralized Jini Security.",
                    "Termination in Language-based Systems.",
                    "Cryptology As a Network Service.",
                    "Implementation of Crossrealm Referral Handling in the MIT Kerberos Client.",
                    "Security Risks Of Peer-To-Peer Networking."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th NDSS 2000",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/2000",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 2000, San Diego, California, USA.",
                "count": 15,
                "papers": [
                    "A First Step Towards Automated Detection of Buffer Overrun Vulnerabilities.",
                    "User-Level Infrastructure for System Call Interposition: A Platform for Intrusion Detection and Confinement.",
                    "Optimized Rekey for Group Communication Systems.",
                    "An IPSec-based Host Architecture for Secure Internet Multicast.",
                    "A First Step Towards the Automatic Generation of Security Protocols.",
                    "A Revocation, Validation and Authentication Protocol for SPKI Based Delegation Systems.",
                    "Secure Border Gateway Protocol (S-BGP) - Real World Performance and Deployment Issues.",
                    "Analysis of a Fair Exchange Protocol.",
                    "Secure Password-Based Cipher Suite for TLS.",
                    "Chameleon Signatures.",
                    "A Lightweight Tool for Detecting Web Server Attacks.",
                    "Building Adaptive and Agile Applications Using Intrusion Detection and Response.",
                    "Secure Virtual Enclaves: Supporting Coalition Use of Distributed Application Technologies.",
                    "Security of Encrypted rlogin Connections Created With Kerberos IV.",
                    "Accountability and Control of Process Creation in Metasystems."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6th NDSS 1999",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/1999",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 1999, San Diego, California, USA.",
                "count": 23,
                "papers": [
                    "Secure Password-Based Protocol for Downloading a Private Key.",
                    "A Real-World Analysis of Kerberos Password Security.",
                    "Secure Remote Access to an Internal Web Server.",
                    "User-Centered Security.",
                    "Usability and Security.",
                    "Experimenting with Shared Generation of RSA Keys.",
                    "Addressing the Problem of Undetected Signature Key Compromise.",
                    "Practical Approach to Anonymity in Large Scale Electronic Voting Schemes.",
                    "BGP Vulnerabilities and Security Options.",
                    "Secure Border Gateway Protocol (S-BGP).",
                    "BGP Origin Authentication.",
                    "Improving Internet Routing Robustness.",
                    "Distributed Policy Management for JDK 1.2.",
                    "Distributed Execution with Remote Audit.",
                    "An Algebra for Assessing Trust in Certification Chains.",
                    "Why Do We Need More Research?",
                    "R&D Challenges: Notes from the \"Trust in Cyberspace\" Report.",
                    "Perspectives on Progress and Directions for Network Security Research.",
                    "PGRIP: PNNI Global Routing Infrastructure Protection.",
                    "Client Puzzles: A Cryptographic Countermeasure Against Connection Depletion Attacks.",
                    "Benefits of IPsec.",
                    "Arguments Against IPSEC.",
                    "Transport-Friendly ESP."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th NDSS 1998",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/1998",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 1998, San Diego, California, USA.",
                "count": 21,
                "papers": [
                    "Enabling the Internet White Pages Service - the Directory Guardian.",
                    "The Multilayer Firewall.",
                    "Efficient Protocols for Signing Routing Messages.",
                    "Some Tips.",
                    "Weak links in e-commerce security: examples from the field.",
                    "Implementation Issues for E-Commerce.",
                    "Attack Detection Methods for All-Optical Networks.",
                    "Distributed Algorithms for Attack Localization in All-Optical Networks.",
                    "Credential Management and Secure Single Login for SPKM.",
                    "Some Timestamping Protocol Failures.",
                    "The Secure Remote Password Protocol.",
                    "Lucent's Entry Into Network Security.",
                    "On the Problem of Trust in Mobile Agent Systems.",
                    "Implementing Protection Domains in the JavaTM Development Kit 1.2.",
                    "Le Nozze di Nomen.",
                    "Trust Management and Internet Client Security.",
                    "Live Traffic Analysis of TCP/IP Gateways.",
                    "Automated Recovery in a Secure Bootstrap Process.",
                    "VPN and IPsec.",
                    "An Intermediate System's View of IPSEC.",
                    "What Will Probably Happen."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th NDSS 1997",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/1997",
                "sub_name": "Proceedings of the Network and Distributed System Security Symposium, NDSS 1997, San Diego, California, USA.",
                "count": 14,
                "papers": [
                    "Experimental Results of Covert Channel Limitation in One-Way Communication Systems.",
                    "Blocking Java Applets at the Firewall.",
                    "Continuous Assessment of a Unix Configuration: Integrating Intrusion Detection and Configuration Analysis.",
                    "An Interface Specification Language for Automatically Analyzing Cryptographic Protocols.",
                    "Probable Plaintext Cryptanalysis of the IP Security Protocols.",
                    "Misplaced Trust: Kerberos 4 Session Keys.",
                    "Securing the Nimrod Routing Architecture.",
                    "Securing Distance-Vector Routing Protocols.",
                    "Reducing the Cost of Security in Link-State Routing.",
                    "Securing Web Access with DCE.",
                    "Panel - Security and the World Wide Web.",
                    "Hierarchical Organization of Certification Authorities for Secure Environments.",
                    "Trust Models in ICE-TEL.",
                    "Distributed Authentication in Kerberos Using Public Key Cryptography."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3rd NDSS 1996",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/1996",
                "sub_name": "1996 Symposium on Network and Distributed System Security, (S)NDSS '96, San Diego, CA, USA, February 22-23, 1996.",
                "count": 17,
                "papers": [
                    "Mixing Email with Babel.",
                    "An integration of PGP and MIME.",
                    "A Security Framework Supporting Domain Based Access Control in Distributed Systems.",
                    "Scalability of Security in Distributed Object Systems.",
                    "A flexible distributed authorization protocol.",
                    "Preserving Integrity in Remote File Location and Retrieval.",
                    "C-HTTP - The Development of a Secure, Closed HTTP-based Network on the Internet.",
                    "Panel: Intellectual Property Protection.",
                    "Designing an Academic Firewall: Policy, Practice, and Experience with SURF.",
                    "Digital signature protection of the OSPF routing protocol.",
                    "A Case Study of Secure ATM Switch Booting.",
                    "SKEME: a versatile secure key exchange mechanism for Internet.",
                    "IDUP and SPKM: Developing Public-Key-Based APIs and Mechanisms for Communication Security Services.",
                    "An Empirical Study of Secure MPEG Video Transmissions.",
                    "Parallelized Network Security Protocols.",
                    "A \"bump in the stack\" encryptor for MS-DOS systems.",
                    "Panel: Public-Key Infrastructure."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "2nd NDSS 1995",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ndss/1995",
                "sub_name": "1995 Symposium on Network and Distributed System Security, (S)NDSS '95, San Diego, California, USA, February 16-17, 1995.",
                "count": 17,
                "papers": [
                    "Multicast-specific security threats and counter-measures.",
                    "Design of a key agile cryptographic system for OC-12c rate ATM.",
                    "IpAccess-an Internet service access system for firewall installations.",
                    "Trusted distribution of software over the Internet.",
                    "Location-independent information object security.",
                    "Electronic cash on the Internet.",
                    "Panel - Internet Payment Mechanisms: Requirements and Architectures.",
                    "NERD: Network Event Recording Device: an automated system for network anomaly detection and notification.",
                    "An overview of SNIF: a tool for Surveying Network Information Flow.",
                    "Distributed audit trail analysis.",
                    "SESAME V2 public key and authorisation extensions to Kerberos.",
                    "Yaksha: augmenting Kerberos with public key cryptography.",
                    "GSS-API security for ONC RPC.",
                    "A Certificate Management System: structure, functions and protocols.",
                    "PEMToolKit: building a top-down certification hierarchy for PEM from the bottom up.",
                    "A new approach to the X.509 framework: allowing a global authentication infrastructure without a global trust model.",
                    "Panel: Security Issues for Mosaic and the World Wide Web."
                ]
            }
        ]
    }
]