[
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2022",
        "info": "Volume 2022",
        "count": 58,
        "papers": [
            "Editors' Introduction.",
            "Personal information inference from voice recordings: User awareness and privacy concerns.",
            "Forward and Backward-Secure Range-Searchable Symmetric Encryption.",
            "(∈, δ)-Indistinguishable Mixing for Cryptocurrencies.",
            "MLEFlow: Learning from History to Improve Load Balancing in Tor.",
            "How Can and Would People Protect From Online Tracking?",
            "Towards Improving Code Stylometry Analysis in Underground Forums.",
            "Ulixes: Facial Recognition Privacy with Adversarial Machine Learning.",
            "If This Context Then That Concern: Exploring users' concerns with IFTTT applets.",
            "User Perceptions of Gmail's Confidential Mode.",
            "Toward Uncensorable, Anonymous and Private Access Over Satoshi Blockchains.",
            "OmniCrawl: Comprehensive Measurement of Web Tracking With Real Desktop and Mobile Browsers.",
            "Making the Most of Parallel Composition in Differential Privacy.",
            "Zen and the art of model adaptation: Low-utility-cost attack mitigations in collaborative machine learning.",
            "AriaNN: Low-Interaction Privacy-Preserving Deep Learning via Function Secret Sharing.",
            "Proof-of-Vax: Studying User Preferences and Perception of Covid Vaccination Certificates.",
            "Differentially private partition selection.",
            "Circuit-PSI With Linear Complexity via Relaxed Batch OPPRF.",
            "Multiparty Reach and Frequency Histogram: Private, Secure, and Practical.",
            "Polymath: Low-Latency MPC via Secure Polynomial Evaluations and Its Applications.",
            "Privacy-preserving FairSwap: Fairness and privacy interplay.",
            "If You Like Me, Please Don't \"Like\" Me: Inferring Vendor Bitcoin Addresses From Positive Reviews.",
            "Disparate Vulnerability to Membership Inference Attacks.",
            "Privacy-Preserving High-dimensional Data Collection with Federated Generative Autoencoder.",
            "Masking Feedforward Neural Networks Against Power Analysis Attacks.",
            "From \"Onion Not Found\" to Guard Discovery.",
            "Polaris: Transparent Succinct Zero-Knowledge Arguments for R1CS with Efficient Verifier.",
            "DataProVe: Fully Automated Conformance Verification Between Data Protection Policies and System Architectures.",
            "SoK: Cryptographic Confidentiality of Data on Mobile Devices.",
            "Setting the Bar Low: Are Websites Complying With the Minimum Requirements of the CCPA?",
            "The Effectiveness of Adaptation Methods in Improving User Engagement and Privacy Protection on Social Network Sites.",
            "Editors' Introduction.",
            "Are iPhones Really Better for Privacy? A Comparative Study of iOS and Android Apps.",
            "Building a Privacy-Preserving Smart Camera System.",
            "CoverDrop: Blowing the Whistle Through A News App.",
            "Employees' privacy perceptions: exploring the dimensionality and antecedents of personal data sensitivity and willingness to disclose.",
            "Revisiting Identification Issues in GDPR 'Right Of Access' Policies: A Technical and Longitudinal Analysis.",
            "Understanding Privacy-Related Advice on Stack Overflow.",
            "SoK: Plausibly Deniable Storage.",
            "Increasing Adoption of Tor Browser Using Informational and Planning Nudges.",
            "Differentially Private Simple Linear Regression.",
            "Privacy-preserving training of tree ensembles over continuous data.",
            "User-Level Label Leakage from Gradients in Federated Learning.",
            "Understanding Utility and Privacy of Demographic Data in Education Technology by Causal Analysis and Adversarial-Censoring.",
            "Comprehensive Analysis of Privacy Leakage in Vertical Federated Learning During Prediction.",
            "Checking Websites' GDPR Consent Compliance for Marketing Emails.",
            "Efficient Set Membership Proofs using MPC-in-the-Head.",
            "Privacy-Preserving Positioning in Wi-Fi Fine Timing Measurement.",
            "RegulaTor: A Straightforward Website Fingerprinting Defense.",
            "Knowledge Cross-Distillation for Membership Privacy.",
            "Updatable Private Set Intersection.",
            "d3p - A Python Package for Differentially-Private Probabilistic Programming.",
            "Who Knows I Like Jelly Beans? An Investigation Into Search Privacy.",
            "PUBA: Privacy-Preserving User-Data Bookkeeping and Analytics.",
            "How to prove any NP statement jointly? Efficient Distributed-prover Zero-Knowledge Protocols.",
            "FP-Radar: Longitudinal Measurement and Early Detection of Browser Fingerprinting.",
            "Analyzing the Feasibility and Generalizability of Fingerprinting Internet of Things Devices.",
            "Visualizing Privacy-Utility Trade-Offs in Differentially Private Data Releases."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2021",
        "info": "Volume 2021",
        "count": 85,
        "papers": [
            "Editors' Introduction.",
            "SGX-MR: Regulating Dataflows for Protecting Access Patterns of Data-Intensive SGX Applications.",
            "Controlled Functional Encryption Revisited: Multi-Authority Extensions and Efficient Schemes for Quadratic Functions.",
            "Unveiling Web Fingerprinting in the Wild Via Code Mining and Machine Learning.",
            "Differential Privacy at Risk: Bridging Randomness and Privacy Budget.",
            "On the (Im)Practicality of Adversarial Perturbation for Image Privacy.",
            "SoK: Privacy-Preserving Reputation Systems.",
            "Scaling up Differentially Private Deep Learning with Fast Per-Example Gradient Clipping.",
            "Real-time Analysis of Privacy-(un)aware IoT Applications.",
            "Secure training of decision trees with continuous attributes.",
            "Falcon: Honest-Majority Maliciously Secure Framework for Private Deep Learning.",
            "The Audio Auditor: User-Level Membership Inference in Internet of Things Voice Services.",
            "SoK: Managing Longitudinal Privacy of Publicly Shared Personal Online Data.",
            "Editors' Introduction.",
            "Privacy-Preserving Multiple Tensor Factorization for Synthesizing Large-Scale Location Traces with Cluster-Specific Features.",
            "\"Warn Them\" or \"Just Block Them\"?: Investigating Privacy Concerns Among Older and Working Age Adults.",
            "Website Fingerprinting in the Age of QUIC.",
            "EL PASSO: Efficient and Lightweight Privacy-preserving Single Sign On.",
            "Automated Extraction and Presentation of Data Practices in Privacy Policies.",
            "Efficient homomorphic evaluation of k-NN classifiers.",
            "Defending Against Microphone-Based Attacks with Personalized Noise.",
            "Holes in the Geofence: Privacy Vulnerabilities in \"Smart\" DNS Services.",
            "Too Close for Comfort: Morasses of (Anti-) Censorship in the Era of CDNs.",
            "Privacy-Preserving & Incrementally-Deployable Support for Certificate Transparency in Tor.",
            "DyPS: Dynamic, Private and Secure GWAS.",
            "Validity and Reliability of the Scale Internet Users' Information Privacy Concerns (IUIPC).",
            "A Calculus of Tracking: Theory and Practice.",
            "\"Did you know this camera tracks your mood?\": Understanding Privacy Expectations and Preferences in the Age of Video Analytics.",
            "GANDaLF: GAN for Data-Limited Fingerprinting.",
            "Scalable Privacy-Preserving Distributed Learning.",
            "Revisiting Membership Inference Under Realistic Assumptions.",
            "Face-Off: Adversarial Face Obfuscation.",
            "Déjà vu: Abusing Browser Cache Headers to Identify and Track Online Users.",
            "Editors' Introduction.",
            "Exploring mental models of the right to informational self-determination of office workers in Germany.",
            "Genome Reconstruction Attacks Against Genomic Data-Sharing Beacons.",
            "The Motivated Can Encrypt (Even with PGP).",
            "Defining Privacy: How Users Interpret Technical Terms in Privacy Policies.",
            "Unlinkable Updatable Hiding Databases and Privacy-Preserving Loyalty Programs.",
            "Growing synthetic data through differentially-private vine copulas.",
            "privGAN: Protecting GANs from membership inference attacks at low cost to utility.",
            "Three Years Later: A Study of MAC Address Randomization In Mobile Devices And When It Succeeds.",
            "SoK: Privacy-Preserving Collaborative Tree-based Model Learning.",
            "FoggySight: A Scheme for Facial Lookup Privacy.",
            "Who Can Find My Devices? Security and Privacy of Apple's Crowd-Sourced Bluetooth Location Tracking System.",
            "Faster homomorphic comparison operations for BGV and BFV.",
            "Foundations of Ring Sampling.",
            "Fast Privacy-Preserving Punch Cards.",
            "Awareness, Adoption, and Misconceptions of Web Privacy Tools.",
            "The Role of Privacy in Digitalization - Analyzing Perspectives of German Farmers.",
            "Data Portability between Online Services: An Empirical Analysis on the Effectiveness of GDPR Art. 20.",
            "Digital Inequality Through the Lens of Self-Disclosure.",
            "The CNAME of the Game: Large-scale Analysis of DNS-based Tracking Evasion.",
            "DNA Sequencing Flow Cells and the Security of the Molecular-Digital Interface.",
            "A First Look at Private Communications in Video Games using Visual Features.",
            "ML-CB: Machine Learning Canvas Block.",
            "Editors' Introduction.",
            "ZKSENSE: A Friction-less Privacy-Preserving Human Attestation Mechanism for Mobile Devices.",
            "You May Also Like... Privacy: Recommendation Systems Meet PIR.",
            "\"I would have to evaluate their objections\": Privacy tensions between smart home device owners and incidental users.",
            "HashWires: Hyperefficient Credential-Based Range Proofs.",
            "Less is More: A privacy-respecting Android malware classifier using federated learning.",
            "Private Stream Aggregation with Labels in the Standard Model.",
            "SoK: Privacy-Preserving Computation Techniques for Deep Learning.",
            "DPlis: Boosting Utility of Differentially Private Deep Learning via Randomized Smoothing.",
            "LogPicker: Strengthening Certificate Transparency Against Covert Adversaries.",
            "\"We, three brothers have always known everything of each other\": A Cross-cultural Study of Sharing Digital Devices and Online Accounts.",
            "SoK: Efficient Privacy-preserving Clustering.",
            "Privacy Preference Signals: Past, Present and Future.",
            "SwapCT: Swap Confidential Transactions for Privacy-Preserving Multi-Token Exchanges.",
            "Multiparty Homomorphic Encryption from Ring-Learning-with-Errors.",
            "Fortified Multi-Party Computation: Taking Advantage of Simple Secure Hardware Modules.",
            "Secure integer division with a private divisor.",
            "CrowdNotifier: Decentralized Privacy-Preserving Presence Tracing.",
            "Blocking Without Breaking: Identification and Mitigation of Non-Essential IoT Traffic.",
            "Residue-Free Computing.",
            "Differentially Private Naïve Bayes Classifier Using Smooth Sensitivity.",
            "Domain name encryption is not enough: privacy leakage via IP-based website fingerprinting.",
            "Mercurial Signatures for Variable-Length Messages.",
            "Supervised Authorship Segmentation of Open Source Code Projects.",
            "Unifying Privacy Policy Detection.",
            "Managing Potentially Intrusive Practices in the Browser: A User-Centered Perspective.",
            "Gage MPC: Bypassing Residual Function Leakage for Non-Interactive MPC.",
            "Privacy-Preserving Approximate k-Nearest-Neighbors Search that Hides Access, Query and Volume Patterns.",
            "Oblivious DNS over HTTPS (ODoH): A Practical Privacy Enhancement to DNS."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2020",
        "info": "Volume 2020",
        "count": 83,
        "papers": [
            "Editors' Introduction.",
            "Computation on Encrypted Data using Dataflow Authentication.",
            "Discontinued Privacy: Personal Data Leaks in Apple Bluetooth-Low-Energy Continuity Protocols.",
            "The Privacy Policy Landscape After the GDPR.",
            "Inferring Tracker-Advertiser Relationships in the Online Advertising Ecosystem using Header Bidding.",
            "Emotional and Practical Considerations Towards the Adoption and Abandonment of VPNs as a Privacy-Enhancing Technology.",
            "Not All Attributes are Created Equal: dX -Private Mechanisms for Linear Queries.",
            "Protecting the 4G and 5G Cellular Paging Protocols against Security and Privacy Attacks.",
            "Pets without PETs: on pet owners' under-estimation of privacy concerns in pet wearables.",
            "Black-Box Wallets: Fast Anonymous Two-Way Payments for Constrained Devices.",
            "The Best of Both Worlds: Mitigating Trade-offs Between Accuracy and User Burden in Capturing Mobile App Privacy Preferences.",
            "SqORAM: Read-Optimized Sequential Write-Only Oblivious RAM.",
            "Website Fingerprinting with Website Oracles.",
            "Editors' Introduction.",
            "Illuminating the Dark or how to recover what should not be seen in FE-based classifiers.",
            "A Comparative Measurement Study of Web Tracking on Mobile and Desktop Environments.",
            "NoMoATS: Towards Automatic Detection of Mobile Tracking.",
            "Privacy-Preserving Payment Splitting.",
            "Protecting against Website Fingerprinting with Multihoming.",
            "Explaining the Technology Use Behavior of Privacy-Enhancing Technologies: The Case of Tor and JonDonym.",
            "The TV is Smart and Full of Trackers: Measuring Smart TV Advertising and Tracking.",
            "SPy: Car Steering Reveals Your Trip Route!",
            "A Framework of Metrics for Differential Privacy from Local Sensitivity.",
            "Secure and Scalable Document Similarity on Distributed Databases: Differential Privacy to the Rescue.",
            "Differentially Private SQL with Bounded User Contribution.",
            "Listen Only When Spoken To: Interpersonal Communication Cues as Smart Speaker Privacy Controls.",
            "Enhanced Performance and Privacy for TLS over TCP Fast Open.",
            "SoK: Differential privacies.",
            "Angel or Devil? A Privacy Study of Mobile Parental Control Apps.",
            "T0RTT: Non-Interactive Immediate Forward-Secret Single-Pass Circuit Construction.",
            "Averaging Attacks on Bounded Noise-based Disclosure Control Algorithms.",
            "Impact of Frequency of Location Reports on the Privacy Level of Geo-indistinguishability.",
            "Mind the Gap: Ceremonies for Applied Secret Sharing.",
            "Privacy at a Glance: The User-Centric Design of Glanceable Data Exposure Visualizations.",
            "Smart Devices in Airbnbs: Considering Privacy and Security for both Guests and Hosts.",
            "FLASH: Fast and Robust Framework for Privacy-preserving Machine Learning.",
            "Multiple Purposes, Multiple Problems: A User Study of Consent Dialogs after GDPR.",
            "Missed by Filter Lists: Detecting Unknown Third-Party Trackers with Invisible Pixels.",
            "A Tale of Two Trees: One Writes, and Other Reads.",
            "Identifying Influential Spreaders in a Social Network (While Preserving Privacy).",
            "Long-Term Observation on Browser Fingerprinting: Users' Trackability and Perspective.",
            "Editors' Introduction.",
            "Tik-Tok: The Utility of Packet Timing in Website Fingerprinting Attacks.",
            "Multi-χ: Identifying Multiple Authors from Source Code Files.",
            "Secure k-ish Nearest Neighbors Classifier.",
            "P4TC - Provably-Secure yet Practical Privacy-Preserving Toll Collection.",
            "Differentially-Private Multi-Party Sketching for Large-Scale Statistics.",
            "Scaling Up Anonymous Communication with Efficient Nanopayment Channels.",
            "Mitigator: Privacy policy compliance using trusted hardware.",
            "The Price is (Not) Right: Comparing Privacy in Free and Paid Apps.",
            "SiegeBreaker: An SDN Based Practical Decoy Routing System.",
            "Exposing Private User Behaviors of Collaborative Filtering via Model Inversion Techniques.",
            "Protecting Private Inputs: Bounded Distortion Guarantees With Randomised Approximations.",
            "dPHI: An improved high-speed network-layer anonymity protocol.",
            "Tandem: Securing Keys by Using a Central Server While Preserving Privacy.",
            "Comprehensive Anonymity Trilemma: User Coordination is not enough.",
            "A Privacy-Focused Systematic Analysis of Online Status Indicators.",
            "MoneyMorph: Censorship Resistant Rendezvous using Permissionless Cryptocurrencies.",
            "Editors' Introduction.",
            "Automatic Discovery of Privacy-Utility Pareto Fronts.",
            "PriFi: Low-Latency Anonymity for Organizational Networks.",
            "The Power of the Hybrid Model for Mean Estimation.",
            "The Road Not Taken: Re-thinking the Feasibility of Voice Calling Over Tor.",
            "An Analysis of the Current State of the Consumer Credit Reporting System in China.",
            "Privacy Preserving Detection of Path Bias Attacks in Tor.",
            "Publishing Community-Preserving Attributed Social Graphs with a Differential Privacy Guarantee.",
            "SoK: Anatomy of Data Breaches.",
            "Effective writing style transfer via combinatorial paraphrasing.",
            "Anonymous, Attribute Based, Decentralized, Secure, and Fair e-Donation.",
            "No boundaries: data exfiltration by third parties embedded on web pages.",
            "INFUSE: Invisible plausibly-deniable file system for NAND flash.",
            "When Speakers Are All Ears: Characterizing Misactivations of IoT Smart Speakers.",
            "VideoDP: A Flexible Platform for Video Analytics with Differential Privacy.",
            "Reputable List Curation from Decentralized Voting.",
            "Running Refraction Networking for Real.",
            "CanaryTrap: Detecting Data Misuse by Third-Party Apps on Online Social Networks.",
            "Secure Evaluation of Quantized Neural Networks.",
            "Energy-Efficient Dummy Traffic Generation for Home Automation Systems.",
            "In-Depth Evaluation of Redirect Tracking and Link Usage.",
            "Practical Privacy-Preserving K-means Clustering.",
            "Self-Processing Private Sensor Data via Garbled Encryption.",
            "Reimagining Secret Sharing: Creating a Safer and More Versatile Primitive by Adding Authenticity, Correcting Errors, and Reducing Randomness Requirements.",
            "How private is your period?: A systematic analysis of menstrual app privacy policies."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2019",
        "info": "Volume 2019",
        "count": 70,
        "papers": [
            "Editors' Introduction.",
            "Olympus: Sensor Privacy through Utility Aware Obfuscation.",
            "RON-Gauss: Enhancing Utility in Non-Interactive Private Data Release.",
            "Privacy-Preserving Similar Patient Queries for Combined Biomedical Data.",
            "Tithonus: A Bitcoin Based Censorship Resilient System.",
            "Systematizing Genome Privacy Research: A Privacy-Enhancing Technologies Perspective.",
            "My Genome Belongs to Me: Controlling Third Party Computation on Genomic Data.",
            "LOGAN: Membership Inference Attacks Against Generative Models.",
            "PD-DM: An efficient locality-preserving block device mapper with plausible deniability.",
            "Hardware-Supported ORAM in Effect: Practical Oblivious Search and Update on Very Large Dataset.",
            "Choosing Epsilon for Privacy as a Service.",
            "Lethe: Conceal Content Deletion from Persistent Observers.",
            "Investigating sources of PII used in Facebook's targeted advertising.",
            "Breach-Resistant Structured Encryption.",
            "Private Evaluation of Decision Trees using Sublinear Cost.",
            "Editors' Introduction.",
            "The (Co-)Location Sharing Game.",
            "Cardinality Estimators do not Preserve Privacy.",
            "Together or Alone: The Price of Privacy in Collaborative Learning.",
            "Mitigating Location Privacy Attacks on Mobile Devices using Dynamic App Sandboxing.",
            "MorphIT: Morphing Packet Reports for Internet Transparency.",
            "On Privacy Notions in Anonymous Communication.",
            "4 Years of EU Cookie Law: Results and Lessons Learned.",
            "Privacy Protection for Audio Sensing Against Multi-Microphone Adversaries.",
            "DPSelect: A Differential Privacy Based Guard Relay Selection Algorithm for Tor.",
            "SoK: Modular and Efficient Private Decision Tree Evaluation.",
            "Skip, Skip, Skip, Accept!!!: A Study on the Usability of Smartphone Manufacturer Provided Default Features and User Privacy.",
            "Oblivious DNS: Practical Privacy for DNS Queries.",
            "Privacy Loss Classes: The Central Limit Theorem in Differential Privacy.",
            "Finding a Needle in a Haystack: The Traffic Analysis Version.",
            "AccessiLeaks: Investigating Privacy Leaks Exposed by the Android Accessibility Service.",
            "Editors' Introduction.",
            "Cheaper Private Set Intersection via Differentially Private Leakage.",
            "SecureNN: 3-Party Secure Computation for Neural Network Training.",
            "Tracking Anonymized Bluetooth Devices.",
            "MAPS: Scaling Privacy Compliance Analysis to a Million Apps.",
            "Setup-Free Secure Search on Encrypted Data: Faster and Post-Processing Free.",
            "New Privacy Threat on 3G, 4G, and Upcoming 5G AKA Protocols.",
            "Keeping the Smart Home Private with Smart(er) IoT Traffic Shaping.",
            "Mesh: A Supply Chain Solution with Locally Private Blockchain Transactions.",
            "Encrypted Databases for Differential Privacy.",
            "p1-FP: Extraction, Classification, and Prediction of Website Fingerprints with Deep Learning.",
            "Snapdoc: Authenticated snapshots with history privacy in peer-to-peer collaborative editing.",
            "Investigating Statistical Privacy Frameworks from the Perspective of Hypothesis Testing.",
            "A QUIC Look at Web Tracking.",
            "Investigating People's Privacy Risk Perception.",
            "ScrambleDB: Oblivious (Chameleon) Pseudonymization-as-a-Service.",
            "Improved Differentially Private Analysis of Variance.",
            "ConsenSGX: Scaling Anonymous Communications Networks with Trusted Execution Environments.",
            "Circumventing Cryptographic Deniability with Remote Attestation.",
            "StealthDB: a Scalable Encrypted Database with Full SQL Query Support.",
            "Git Blame Who?: Stylistic Authorship Attribution of Small, Incomplete Source Code Fragments.",
            "Cryptography for #MeToo.",
            "Editors' Introduction.",
            "Reducing Metadata Leakage from Encrypted Files and Communication with PURBs.",
            "Handoff All Your Privacy - A Review of Apple's Bluetooth Low Energy Continuity Protocol.",
            "A Girl Has No Name: Automated Authorship Obfuscation using Mutant-X.",
            "#DontTweetThis: Scoring Private Information in Social Networks.",
            "TOPPool: Time-aware Optimized Privacy-Preserving Ridesharing.",
            "A Bit More Than a Bit Is More Than a Bit Better: Faster (essentially) optimal-rate many-server PIR.",
            "Security-Efficiency Tradeoffs in Searchable Encryption.",
            "\"Because... I was told... so much\": Linguistic Indicators of Mental Health Status on Twitter.",
            "No Place to Hide: Inadvertent Location Privacy Leaks on Twitter.",
            "The privacy of the TLS 1.3 protocol.",
            "\"What if?\" Predicting Individual Users' Smart Home Privacy Preferences and Their Changes.",
            "Monte Carlo and Reconstruction Membership Inference Attacks against Generative Models.",
            "Privacy Attitudes of Smart Speaker Users.",
            "Guard Placement Attacks on Path Selection Algorithms for Tor.",
            "Var-CNN: A Data-Efficient Website Fingerprinting Attack Based on Deep Learning.",
            "Detecting TCP/IP Connections via IPID Hash Collisions."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2018",
        "info": "Volume 2018",
        "count": 39,
        "papers": [
            "Editors' Introduction.",
            "Efficient Dynamic Searchable Encryption with Forward Privacy.",
            "Improved Strongly Deniable Authenticated Key Exchanges for Secure Messaging.",
            "SafePub: A Truthful Data Anonymization Algorithm With Strong Privacy Guarantees.",
            "Every Move You Make: Exploring Practical Issues in Smartphone Motion Sensor Fingerprinting and Countermeasures.",
            "I never signed up for this! Privacy implications of email tracking.",
            "Recognizing and Imitating Programmer Style: Adversaries in Program Authorship Attribution.",
            "Guard Sets in Tor using AS Relationships.",
            "Editors' Introduction.",
            "Privacy-preserving Wi-Fi Analytics.",
            "Dropping on the Edge: Flexibility and Traffic Confirmation in Onion Routing Protocols.",
            "Cracking ShadowCrypt: Exploring the Limitations of Secure I/O Systems in Internet Browsers.",
            "Functional Credentials.",
            "Onion-AE: Foundations of Nested Encryption.",
            "Möbius: Trustless Tumbling for Transaction Privacy.",
            "Touch and You're Trapp(ck)ed: Quantifying the Uniqueness of Touch Gestures for Tracking.",
            "Editors' Introduction.",
            "Quantifying Privacy Loss of Human Mobility Graph Topology.",
            "Tempest: Temporal Dynamics in Anonymity Systems.",
            "Secure asymmetry and deployability for decoy routing systems.",
            "\"Won't Somebody Think of the Children?\" Examining COPPA Compliance at Scale.",
            "Toward Distribution Estimation under Local Differential Privacy with Small Samples.",
            "Undermining Privacy in the Aircraft Communications Addressing and Reporting System (ACARS).",
            "Privacy-preserving Machine Learning as a Service.",
            "An Empirical Analysis of Traceability in the Monero Blockchain.",
            "Privacy Pass: Bypassing Internet Challenges Anonymously.",
            "Consistent Synchronous Group Off-The-Record Messaging with SYM-GOTR.",
            "Editors' Introduction.",
            "Turtles, Locks, and Bathrooms: Understanding Mental Models of Privacy Through Illustration.",
            "Panoptispy: Characterizing Audio and Video Exfiltration from Android Applications.",
            "Exploiting TLS Client Authentication for Widespread User Tracking.",
            "Differentially Private Oblivious RAM.",
            "Diffusion of User Tracking Data in the Online Advertising Ecosystem.",
            "Privacy-Preserving Search of Similar Patients in Genomic Data.",
            "NoMoAds: Effective and Efficient Cross-App Mobile Ad-Blocking.",
            "Power to peep-all: Inference Attacks by Malicious Batteries on Mobile Devices.",
            "PIR-PSI: Scaling Private Contact Discovery.",
            "When the cookie meets the blockchain: Privacy risks of web payments via cryptocurrencies.",
            "Feature Selection for Website Fingerprinting."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2017",
        "info": "Volume 2017",
        "count": 56,
        "papers": [
            "Editors' Introduction.",
            "Generic Adaptively Secure Searchable Phrase Encryption.",
            "The Onion Name System.",
            "Topics of Controversy: An Empirical Analysis of Web Censorship Lists.",
            "Toward Practical Secure Stable Matching.",
            "Towards Seamless Tracking-Free Web: Improved Detection of Trackers via One-class Learning.",
            "PHI: Path-Hidden Lightweight Anonymity Protocol at Network Layer.",
            "Analyzing Remote Server Locations for Personal Data Transfers in Mobile Apps.",
            "ErasuCrypto: A Light-weight Secure Data Deletion Scheme for Solid State Drives.",
            "Are you The One to Share? Secret Transfer with Access Structure.",
            "Phonion: Practical Protection of Metadata in Telephony Networks.",
            "Editors' Introduction.",
            "Waterfilling: Balancing the Tor network with maximum diversity.",
            "Look before you Authorize: Using Eye-Tracking to Enforce User Attention towards Application Permissions.",
            "PrivateRide: A Privacy-Enhanced Ride-Hailing Service.",
            "Vulnerable GPU Memory Management: Towards Recovering Raw Data from GPU.",
            "PeerFlow: Secure Load Balancing in Tor.",
            "On the Privacy and Security of the Ultrasound Ecosystem.",
            "Cross-Cultural Privacy Prediction.",
            "Cross-Device Tracking: Measurement and Disclosures.",
            "Externally Verifiable Oblivious RAM.",
            "Social Engineering Attacks on Government Opponents: Target Perspectives.",
            "Website Fingerprinting Defenses at the Application Layer.",
            "Editors' Introduction.",
            "Wiretapping End-to-End Encrypted VoIP Calls: Real-World Attacks on ZRTP.",
            "Privacy-Preserving Computation with Trusted Computing via Scramble-then-Compute.",
            "SeaGlass: Enabling City-Wide IMSI-Catcher Detection.",
            "Hardening Stratum, the Bitcoin Pool Mining Protocol.",
            "Why can't users choose their identity providers on the web?",
            "A Usability Evaluation of Tor Launcher.",
            "PathShuffle: Credit Mixing and Anonymous Payments for Ripple.",
            "Detecting Anti Ad-blockers in the Wild.",
            "Privacy-Preserving Interdomain Routing at Internet Scale.",
            "A Leakage-Abuse Attack Against Multi-User Searchable Encryption.",
            "DataLair: Efficient Block Storage with Plausible Deniability against Multi-Snapshot Adversaries.",
            "Editors' Introduction.",
            "DeltaShaper: Enabling Unobservable Censorship-resistant TCP Tunneling over Videoconferencing Streams.",
            "Preprocessing Based Verification of Multiparty Protocols with Honest Majority.",
            "Location Privacy for Rank-based Geo-Query Systems.",
            "Why Privacy Is All But Forgotten.",
            "To Permit or Not to Permit, That is the Usability Question: Crowdsourcing Mobile Apps' Privacy Permission Settings.",
            "Expectation-Maximization Tensor Factorization for Practical Location Privacy Attacks.",
            "What Does The Crowd Say About You? Evaluating Aggregation-based Location Privacy.",
            "Private Set Intersection for Unequal Set Sizes with Mobile Applications.",
            "Two Is Not Enough: Privacy Assessment of Aggregation Schemes in Smart Metering.",
            "Bayes, not Naïve: Security Bounds on Website Fingerprinting Defenses.",
            "UnLynx: A Decentralized System for Privacy-Conscious Data Sharing.",
            "Fingerprinting Keywords in Search Queries over Tor.",
            "Personalized Pseudonyms for Servers in the Cloud.",
            "TagIt: Tagging Network Flows using Blind Fingerprints.",
            "Efficient Utility Improvement for Location Privacy.",
            "Certificate Transparency with Privacy.",
            "Privacy-Preserving Distributed Linear Regression on High-Dimensional Data.",
            "A Study of MAC Address Randomization in Mobile Devices and When it Fails.",
            "Provably Secure Anonymous-yet-Accountable Crowdsensing with Scalable Sublinear Revocation.",
            "Systematizing Decentralization and Privacy: Lessons from 15 Years of Research and Deployments."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2016",
        "info": "Volume 2016",
        "count": 55,
        "papers": [
            "Editor's Introduction.",
            "Fingerprinting Mobile Devices Using Personalized Configurations.",
            "Are You Sure You Want to Contact Us? Quantifying the Leakage of PII via Website Contact Forms.",
            "Automobile Driver Fingerprinting.",
            "Editors' Introduction.",
            "Isolating Graphical Failure-Inducing Input for Privacy Protection in Error Reporting Systems.",
            "Scalable and Anonymous Group Communication with MTor.",
            "Your Choice MATor(s): Large-scale Quantitative Anonymity Assessment of Tor Path Selection Algorithms Against Structural Attacks.",
            "Towards a Model on the Factors Influencing Social App Users' Valuation of Interdependent Privacy.",
            "Efficient Server-Aided 2PC for Mobile Phones.",
            "Towards Mining Latent Client Identifiers from Network Traffic.",
            "Riffle: An Efficient Communication System With Strong Anonymity.",
            "(Do Not) Track Me Sometimes: Users' Contextual Preferences for Web Tracking.",
            "XPIR : Private Information Retrieval for Everyone.",
            "Mailet: Instant Social Networking under Censorship.",
            "Editors' Introduction.",
            "Linking Health Records for Federated Query Processing.",
            "Beeswax: a platform for private web apps.",
            "Building a RAPPOR with the Unknown: Privacy-Preserving Learning of Associations and Data Dictionaries.",
            "Black-Box Accumulation: Collecting Incentives in a Privacy-Preserving Way.",
            "Crowdsourcing for Context: Regarding Privacy in Beacon Encounters via Contextual Integrity.",
            "SoK: Privacy on Mobile Devices - It's Complicated.",
            "Students and Taxes: a Privacy-Preserving Study Using Secure Computation.",
            "Don't Interrupt Me While I Type: Inferring Text Entered Through Gesture Typing on Android Keyboards.",
            "Blogs, Twitter Feeds, and Reddit Comments: Cross-domain Authorship Attribution.",
            "Flying Eyes and Hidden Controllers: A Qualitative Study of People's Privacy Perceptions of Civilian Drones in The US.",
            "Access Denied! Contrasting Data Access in the United States and Ireland.",
            "CovertCast: Using Live Streaming to Evade Internet Censorship.",
            "Editors' Introduction.",
            "Salmon: Robust Proxy Distribution for Censorship Circumvention.",
            "On Realistically Attacking Tor with Website Fingerprinting.",
            "SoK: Making Sense of Censorship Resistance Systems.",
            "Location Privacy with Randomness Consistency.",
            "A Framework for the Game-theoretic Analysis of Censorship Resistance.",
            "Privacy vs. Reward in Indoor Location-Based Services.",
            "The Curious Case of the PDF Converter that Likes Mozart: Dissecting and Mitigating the Privacy Risk of Personal Cloud Apps.",
            "Efficient Server-Aided Secure Two-Party Function Evaluation with Applications to Genomic Computation.",
            "On the Privacy Implications of Location Semantics.",
            "Lower-Cost ∈-Private Information Retrieval.",
            "Polynomial Batch Codes for Efficient IT-PIR.",
            "Circuit-extension handshakes for Tor achieving forward secrecy in a quantum world.",
            "Tales from the Dark Side: Privacy Dark Strategies and Privacy Dark Patterns.",
            "Achieving Better Privacy for the 3GPP AKA Protocol.",
            "Data-plane Defenses against Routing Attacks on Tor.",
            "Anonymity in Peer-assisted CDNs: Inference Attacks and Mitigation.",
            "Privacy Challenges in the Quantified Self Movement - An EU Perspective.",
            "Privately Evaluating Decision Trees and Random Forests.",
            "DeNASA: Destination-Naive AS-Awareness in Anonymous Communications.",
            "Efficient Verifiable Range and Closest Point Queries in Zero-Knowledge.",
            "The Right to be Forgotten in the Media: A Data-Driven Study.",
            "On the (In)effectiveness of Mosaicing and Blurring as Tools for Document Redaction.",
            "Individual versus Organizational Computer Security and Privacy Concerns in Journalism.",
            "Listening to Whispers of Ripple: Linking Wallets and Deanonymizing Transactions in the Ripple Network.",
            "Selfrando: Securing the Tor Browser against De-anonymization Exploits.",
            "Near-Optimal Fingerprinting with Constraints."
        ]
    },
    {
        "name": "PETS / since 2015: PoPETs",
        "year": "2015",
        "info": "Volume 2015",
        "count": 25,
        "papers": [
            "Editors' Introduction.",
            "20, 000 In League Under the Sea: Anonymous Communication, Trust, MLATs, and Undersea Cables.",
            "Know Thy Neighbor: Crypto Library Detection in Cloud.",
            "Portrait of a Privacy Invasion.",
            "Analyzing the Great Firewall of China Over Space and Time.",
            "A Glance through the VPN Looking Glass: IPv6 Leakage and DNS Hijacking in Commercial VPN clients.",
            "Automated Experiments on Ad Privacy Settings.",
            "Editors' Introduction.",
            "DP5: A Private Presence Service.",
            "A Practical Set-Membership Proof for Privacy-Preserving NFC Mobile Ticketing.",
            "Blocking-resistant communication through domain fronting.",
            "Guard Sets for Onion Routing.",
            "Practical Forward-Secure Range and Sort Queries with Update-Oblivious Linked Lists.",
            "De-anonymizing Genomic Databases Using Phenotypic Traits.",
            "Recursive Trees for Practical ORAM.",
            "Toward Mending Two Nation-Scale Brokered Identification Systems.",
            "Constructing elastic distinguishability metrics for location privacy.",
            "Defending Tor from Network Adversaries: A Case Study of Network Path Prediction.",
            "Parallel Oblivious Array Access for Secure Multiparty Computation and Privacy-Preserving Minimum Spanning Trees.",
            "Accountable Metadata-Hiding Escrow: A Group Signature Case Study.",
            "Optimal Rate Private Information Retrieval from Homomorphic Encryption.",
            "Secure and scalable match: overcoming the universal circuit bottleneck using group programs.",
            "Substring-Searchable Symmetric Encryption.",
            "An Automated Approach for Complementing Ad Blockers' Blacklists.",
            "Privacy Games: Optimal User-Centric Data Obfuscation."
        ]
    },
    {
        "year": "2014",
        "name": "14th PETS 2014",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2014",
                "sub_name": "Privacy Enhancing Technologies - 14th International Symposium, PETS 2014, Amsterdam, The Netherlands, July 16-18, 2014. Proceedings.",
                "count": 16,
                "papers": [
                    "CloudTransport: Using Cloud Storage for Censorship-Resistant Networking.",
                    "A Predictive Differentially-Private Mechanism for Mobility Traces.",
                    "On the Effectiveness of Obfuscation Techniques in Online Social Networks.",
                    "The Best of Both Worlds: Combining Information-Theoretic and Computational PIR for Communication Efficiency.",
                    "Social Status and the Demand for Security and Privacy.",
                    "C3P: Context-Aware Crowdsourced Cloud Privacy.",
                    "Forward-Secure Distributed Encryption.",
                    "I Know Why You Went to the Clinic: Risks and Realization of HTTPS Traffic Analysis.",
                    "I Know What You're Buying: Privacy Breaches on eBay.",
                    "Quantifying the Effect of Co-location Information on Location Privacy.",
                    "Do Dummies Pay Off? Limits of Dummy Traffic Protection in Anonymous Communications.",
                    "Exploiting Delay Patterns for User IPs Identification in Cellular Networks.",
                    "Why Doesn't Jane Protect Her Privacy?",
                    "Measuring Freenet in the Wild: Censorship-Resilience under Observation.",
                    "Dovetail: Stronger Anonymity in Next-Generation Internet Routing.",
                    "Spoiled Onions: Exposing Malicious Tor Exit Relays."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th PETS 2013",
        "info": "Bloomington, IN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2013",
                "sub_name": "Privacy Enhancing Technologies - 13th International Symposium, PETS 2013, Bloomington, IN, USA, July 10-12, 2013. Proceedings.",
                "count": 13,
                "papers": [
                    "Optimizing ORAM and Using It Efficiently for Secure Computation.",
                    "Anonymity-Preserving Public-Key Encryption: A Constructive Approach.",
                    "Efficient E-Cash in Practice: NFC-Based Payments for Public Transportation Systems.",
                    "Efficient Privacy-Preserving Stream Aggregation in Mobile Sensing with Low Aggregation Error.",
                    "Broadening the Scope of Differential Privacy Using Metrics.",
                    "Turning Off GPS Is Not Enough: Cellular Location Leaks over the Internet.",
                    "How Others Compromise Your Location Privacy: The Case of Shared Public IPs at Hotspots.",
                    "The Path Less Travelled: Overcoming Tor's Bottlenecks with Traffic Splitting.",
                    "How Low Can You Go: Balancing Performance with Anonymity in Tor.",
                    "OSS: Using Online Scanning Services for Censorship Circumvention.",
                    "The Need for Flow Fingerprints to Link Correlated Network Flows.",
                    "How Much Is Too Much? Leveraging Ads Audience Estimation to Evaluate Public Profile Uniqueness.",
                    "On the Acceptance of Privacy-Preserving Authentication Technology: The Curious Case of National Identity Cards."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th PETS 2012",
        "info": "Vigo, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2012",
                "sub_name": "Privacy Enhancing Technologies - 12th International Symposium, PETS 2012, Vigo, Spain, July 11-13, 2012. Proceedings.",
                "count": 16,
                "papers": [
                    "Betrayed by Your Ads! - Reconstructing User Profiles from Targeted Ads.",
                    "Private Client-Side Profiling with Random Forests and Hidden Markov Models.",
                    "Understanding Statistical Disclosure: A Least Squares Approach.",
                    "Website Detection Using Remote Traffic Analysis.",
                    "k-Indistinguishable Traffic Padding in Web Applications.",
                    "Spying in the Dark: TCP and Tor Traffic Analysis.",
                    "Secure Distributed Framework for Achieving ε-Differential Privacy.",
                    "Differentially Private Continual Monitoring of Heavy Hitters from Distributed Streams.",
                    "Adaptive Differentially Private Histogram of Low-Dimensional Data.",
                    "PRISM - Privacy-Preserving Search in MapReduce.",
                    "Practical Privacy Preserving Cloud Resource-Payment for Constrained Clients.",
                    "Fault-Tolerant Privacy-Preserving Statistics.",
                    "Evading Censorship with Browser-Based Proxies.",
                    "Exploring the Ecosystem of Referrer-Anonymizing Services.",
                    "Risk Communication Design: Video vs. Text.",
                    "Use Fewer Instances of the Letter \"i\": Toward Writing Style Anonymization."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11th PETS 2011",
        "info": "Waterloo, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2011",
                "sub_name": "Privacy Enhancing Technologies - 11th International Symposium, PETS 2011, Waterloo, ON, Canada, July 27-29, 2011. Proceedings.",
                "count": 15,
                "papers": [
                    "How Unique and Traceable Are Usernames?",
                    "Text Classification for Data Loss Prevention.",
                    "P3CA: Private Anomaly Detection Across ISP Networks.",
                    "Quantifying Location Privacy: The Case of Sporadic Location Exposure.",
                    "Privacy in Mobile Computing for Location-Sharing-Based Services.",
                    "On the Practicality of UHF RFID Fingerprinting: How Real is the RFID Tracking Problem?",
                    "An Accurate System-Wide Anonymity Metric for Probabilistic Attacks.",
                    "DefenestraTor: Throwing Out Windows in Tor.",
                    "Privacy-Implications of Performance-Based Peer Selection by Onion-Routers: A Real-World Case Study Using I2P.",
                    "Privacy-Friendly Aggregation for the Smart-Grid.",
                    "Plug-In Privacy for Smart Metering Billing.",
                    "Scramble! Your Social Network Data.",
                    "A Constraint Satisfaction Cryptanalysis of Bloom Filters in Private Record Linkage.",
                    "Efficient Proofs of Attributes in Pairing-Based Anonymous Credential System.",
                    "Broker-Based Private Matching."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10th PETS 2010",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2010",
                "sub_name": "Privacy Enhancing Technologies, 10th International Symposium, PETS 2010, Berlin, Germany, July 21-23, 2010. Proceedings.",
                "count": 16,
                "papers": [
                    "How Unique Is Your Web Browser?",
                    "On the Privacy of Web Search Based on Query Obfuscation: A Case Study of TrackMeNot.",
                    "Private Information Disclosure from Web Searches.",
                    "Collaborative, Privacy-Preserving Data Aggregation at Scale.",
                    "Privacy-Preserving Queries over Relational Databases.",
                    "Achieving Efficient Query Privacy for Location Based Services.",
                    "Making a Nymbler Nymble Using VERBS.",
                    "Anonymous Webs of Trust.",
                    "Taming Big Brother Ambitions: More Privacy for Secret Handshakes.",
                    "Preventing Active Timing Attacks in Low-Latency Anonymous Communication.",
                    "Impact of Network Topology on Anonymity and Overhead in Low-Latency Anonymity Networks.",
                    "Drac: An Architecture for Anonymous Low-Volume Communications.",
                    "Private Web Search with Malicious Adversaries.",
                    "unFriendly: Multi-party Privacy Risks in Social Networks.",
                    "The Impact of Unlinkability on Adversarial Community Detection: Effects and Countermeasures.",
                    "How to Share Your Favourite Search Results while Preserving Privacy and Quality."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th PETS 2009",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2009",
                "sub_name": "Privacy Enhancing Technologies, 9th International Symposium, PETS 2009, Seattle, WA, USA, August 5-7, 2009. Proceedings.",
                "count": 14,
                "papers": [
                    "Capturing Social Networking Privacy Preferences: Can Default Policies Help Alleviate Tradeoffs between Expressiveness and User Burden?",
                    "Regulating Privacy in Wireless Advertising Messaging: FIPP Compliance by Policy vs. by Design.",
                    "A Comparative Study of Online Privacy Policies and Formats.",
                    "Vida: How to Use Bayesian Inference to De-anonymize Persistent Communications.",
                    "Scalable Link-Based Relay Selection for Anonymous Routing.",
                    "Using Linkability Information to Attack Mix-Based Anonymity Services.",
                    "Physical Layer Attacks on Unlinkability in Wireless LANs.",
                    "RequestPolicy: Increasing Web Browsing Privacy through Control of Cross-Site Requests.",
                    "Enlisting ISPs to Improve Online Privacy: IP Address Mixing by Default.",
                    "Privacy-Preserving Policy-Based Information Transfer.",
                    "Privacy-Preserving Computation and Verification of Aggregate Queries on Outsourced Databases.",
                    "APOD: Anonymous Physical Object Delivery.",
                    "On the Optimal Placement of Mix Zones.",
                    "Privacy-Preserving Face Recognition."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th PETS 2008",
        "info": "Leuven, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2008",
                "sub_name": "Privacy Enhancing Technologies, 8th International Symposium, PETS 2008, Leuven, Belgium, July 23-25, 2008, Proceedings.",
                "count": 14,
                "papers": [
                    "Analyzing PETs for Enterprise Operations.",
                    "Perfect Matching Disclosure Attacks.",
                    "An Indistinguishability-Based Characterization of Anonymous Channels.",
                    "On the Impact of Social Network Profiling on Anonymity.",
                    "Shining Light in Dark Places: Understanding the Tor Network.",
                    "Formalized Information-Theoretic Proofs of Privacy Using the HOL4 Theorem-Prover.",
                    "Breaking and Provably Fixing Minx.",
                    "Metrics for Security and Performance in Low-Latency Anonymity Systems.",
                    "Studying Timing Analysis on the Internet with SubRosa.",
                    "Bridging and Fingerprinting: Epistemic Attacks on Route Selection.",
                    "Chattering Laptops.",
                    "How to Bypass Two Anonymity Revocation Schemes.",
                    "Reputation Systems for Anonymous Networks.",
                    "PAR: Payment for Anonymous Routing."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7th PET 2007",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2007",
                "sub_name": "Privacy Enhancing Technologies, 7th International Symposium, PET 2007 Ottawa, Canada, June 20-22, 2007, Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "Attacking Unlinkability: The Importance of Context.",
                    "A Fresh Look at the Generalised Mix Framework.",
                    "Two-Sided Statistical Disclosure Attack.",
                    "A Family of Dunces: Trivial RFID Identification and Authentication Protocols.",
                    "Louis, Lester and Pierre: Three Protocols for Location Privacy.",
                    "Efficient Oblivious Augmented Maps: Location-Based Services with a Payment Broker.",
                    "Pairing-Based Onion Routing.",
                    "Nymble: Anonymous IP-Address Blocking.",
                    "Improving Efficiency and Simplicity of Tor Circuit Establishment and Hidden Services.",
                    "Identity Trail: Covert Surveillance Using DNS.",
                    "Sampled Traffic Analysis by Internet-Exchange-Level Adversaries.",
                    "Browser-Based Attacks on Tor.",
                    "Enforcing P3P Policies Using a Digital Rights Management System.",
                    "Simplified Privacy Controls for Aggregated Services - Suspend and Resume of Personal Data.",
                    "Performance Comparison of Low-Latency Anonymisation Services from a User Perspective.",
                    "Anonymity in the Wild: Mixes on Unstructured Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6th PET 2006",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2006",
                "sub_name": "Privacy Enhancing Technologies, 6th International Workshop, PET 2006, Cambridge, UK, June 28-30, 2006, Revised Selected Papers.",
                "count": 24,
                "papers": [
                    "Privacy for Public Transportation.",
                    "Ignoring the Great Firewall of China.",
                    "Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook.",
                    "Enhancing Consumer Privacy in the Liberty Alliance Identity Federation and Web Services Frameworks.",
                    "Traceable and Automatic Compliance of Privacy Policies in Federated Digital Identity Management.",
                    "Privacy Injector - Automated Privacy Enforcement Through Aspects.",
                    "A Systemic Approach to Automate Privacy Policy Enforcement in Enterprises.",
                    "One Big File Is Not Enough: A Critical Evaluation of the Dominant Free-Space Sanitization Technique.",
                    "Protecting Privacy with the MPEG-21 IPMP Framework.",
                    "Personal Rights Management - Taming Camera-Phones for Individual Privacy Enforcement.",
                    "Improving Sender Anonymity in a Structured Overlay with Imprecise Routing.",
                    "Selectively Traceable Anonymity.",
                    "Valet Services: Improving Hidden Servers with a Personal Touch.",
                    "Blending Different Latency Traffic with Alpha-mixing.",
                    "Private Resource Pairing.",
                    "Honest-Verifier Private Disjointness Testing Without Random Oracles.",
                    "A Flexible Framework for Secret Handshakes.",
                    "On the Security of the Tor Authentication Protocol.",
                    "Optimal Key-Trees for Tree-Based Private Authentication.",
                    "Simple and Flexible Revocation Checking with Privacy.",
                    "Breaking the Collusion Detection Mechanism of MorphMix.",
                    "Linking Anonymous Transactions: The Consistent View Attack.",
                    "Preserving User Location Privacy in Mobile Data Management Infrastructures.",
                    "The Effects of Location Access Behavior on Re-identification Risk in a Distributed Environment."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5th PET 2005",
        "info": "Cavtat, Croatia",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2005",
                "sub_name": "Privacy Enhancing Technologies, 5th International Workshop, PET 2005, Cavtat, Croatia, May 30-June 1, 2005, Revised Selected Papers.",
                "count": 17,
                "papers": [
                    "Privacy Vulnerabilities in Encrypted HTTP Streams.",
                    "An Analysis of Parallel Mixing with Attacker-Controlled Inputs.",
                    "Message Splitting Against the Partial Adversary.",
                    "Location Privacy for Cellular Systems; Analysis and Solution.",
                    "Towards Modeling Wireless Location Privacy.",
                    "Failures in a Hybrid Content Blocking System.",
                    "Anonymity Preserving Techniques in Trust Negotiations.",
                    "Unmixing Mix Traffic.",
                    "Mix-Network with Stronger Security.",
                    "Covert Channels in IPv6.",
                    "Towards Privacy-Aware eLearning.",
                    "Anonymization of IP Traffic Monitoring Data: Attacks on Two Prefix-Preserving Anonymization Schemes and Some Proposed Remedies.",
                    "Privacy Issues in Vehicular Ad Hoc Networks.",
                    "High-Power Proxies for Enhancing RFID Privacy and Utility.",
                    "Integrating Utility into Face De-identification.",
                    "Privacy in India: Attitudes and Awareness.",
                    "Economics of Identity Management: A Supply-Side Perspective."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "4th PET 2004",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2004",
                "sub_name": "Privacy Enhancing Technologies, 4th International Workshop, PET 2004, Toronto, Canada, May 26-28, 2004, Revised Selected Papers.",
                "count": 22,
                "papers": [
                    "Anonymity and Covert Channels in Simple Timed Mix-Firewalls.",
                    "Practical Traffic Analysis: Extending and Resisting Statistical Disclosure.",
                    "The Traffic Analysis of Continuous-Time Mixes.",
                    "Reputable Mix Networks.",
                    "Secure Outsourcing of Sequence Comparisons.",
                    "An Improved Construction for Universal Re-encryption.",
                    "Electromagnetic Eavesdropping Risks of Flat-Panel Displays.",
                    "On the Anonymity of Banknotes.",
                    "FLASCHE - A Mechanism Providing Anonymity for Mobile Users.",
                    "Cryptographically Protected Prefixes for Location Privacy in IPv6.",
                    "Protecting User Data in Ubiquitous Computing: Towards Trustworthy Environments.",
                    "Synchronous Batching: From Cascades to Free Routes.",
                    "On Flow Correlation Attacks and Countermeasures in Mix Networks.",
                    "Measuring Anonymity in a Non-adaptive, Real-Time System.",
                    "Panel Discussion - Mix Cascades Versus Peer-to-Peer: Is One Concept Superior?",
                    "On the PET Workshop Panel \"Mix Cascades Versus Peer-to-Peer: Is One Concept Superior?\".",
                    "A Formal Privacy System and Its Application to Location Based Services.",
                    "Privacy-Preserving Trust Negotiations.",
                    "Language-Based Enforcement of Privacy Policies.",
                    "Searching for Privacy: Design and Implementation of a P3P-Enabled Search Engine.",
                    "Contextualized Communication of Privacy Practices and Personalization Benefits: Impacts on Users' Data Sharing and Purchase Behavior.",
                    "Panel Discussion - Conforming Technology to Policy: The Problems of Electronic Health Records."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "3rd PET 2003",
        "info": "Dresden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2003",
                "sub_name": "Privacy Enhancing Technologies, Third International Workshop, PET 2003, Dresden, Germany, March 26-28, 2003, Revised Papers.",
                "count": 14,
                "papers": [
                    "Mix-Networks with Restricted Routes.",
                    "Generalising Mixes.",
                    "Modelling Unlinkability.",
                    "Metrics for Trafic Analysis Prevention.",
                    "Breaking and Mending Resilient Mix-Nets.",
                    "Improving Onion Notation.",
                    "Engineering Privacy in Public: Confounding Face Recognition.",
                    "From Privacy Legislation to Interface Design: Implementing Information Privacy in Human-Computer Interactions.",
                    "Thwarting Web Censorship with Untrusted Messenger Discovery.",
                    "gap - Practical Anonymous Networking.",
                    "An Analysis of GNUnet and the Implications for Anonymous, Censorship-Resistant Networks.",
                    "A Component Architecture for Dynamically Managing Privacy Constraints in Personalized Web-Based Systems.",
                    "Privacy in Enterprise Identity Federation - Policies for Liberty Single Signon.",
                    "From P3P to Data Licenses."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "2nd PET 2002",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pet/2002",
                "sub_name": "Privacy Enhancing Technologies, Second International Workshop, PET 2002, San Francisco, CA, USA, April 14-15, 2002, Revised Papers.",
                "count": 17,
                "papers": [
                    "Privacy-Enhancing Technologies for the Internet, II: Five Years Later.",
                    "Detecting Web Bugs with Bugnosis: Privacy Advocacy through Education.",
                    "Private Authentication.",
                    "Towards an Information Theoretic Metric for Anonymity.",
                    "Towards Measuring Anonymity.",
                    "Platform for Enterprise Privacy Practices: Privacy-Enabled Management of Customer Data.",
                    "Privacy Enhancing Profile Disclosure.",
                    "Privacy Enhancing Service Architectures.",
                    "Dummy Traffic against Long Term Intersection Attacks.",
                    "Protecting Privacy during On-Line Trust Negotiation.",
                    "Prototyping an Armored Data Vault: Rights Management on Big Brother's Computer.",
                    "Preventing Interval-Based Inference by Random Data Perturbation.",
                    "Fingerprinting Websites Using Traffic Analysis.",
                    "A Passive Attack on the Privacy of Web Users Using Standard Log Information.",
                    "Covert Messaging through TCP Timestamps.",
                    "Almost Optimal Private Information Retrieval.",
                    "Unobservable Surfing on the World Wide Web: Is Private Information Retrieval an Alternative to the MIX Based Approach?"
                ]
            }
        ]
    }
]