[
    {
        "year": "2022",
        "name": "25th PKC 2022",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2022-1",
                "sub_name": "Public-Key Cryptography - PKC 2022 - 25th IACR International Conference on Practice and Theory of Public-Key Cryptography, Virtual Event, March 8-11, 2022, Proceedings, Part I.",
                "count": 22,
                "papers": [
                    "Multitarget Decryption Failure Attacks and Their Application to Saber and Kyber.",
                    "Post-quantum Security of Plain OAEP Transform.",
                    "On the Security of OSIDH.",
                    "Time-Memory Tradeoffs for Large-Weight Syndrome Decoding in Ternary Codes.",
                    "Syndrome Decoding Estimator.",
                    "On the Isogeny Problem with Torsion Point Information.",
                    "Reusable Two-Round MPC from LPN.",
                    "On the Bottleneck Complexity of MPC with Correlated Randomness.",
                    "Low-Communication Multiparty Triple Generation for SPDZ from Ring-LPN.",
                    "Storing and Retrieving Secrets on a Blockchain.",
                    "CNF-FSS and Its Applications.",
                    "Efficient Verifiable Partially-Decryptable Commitments from Lattices and Applications.",
                    "Making Private Function Evaluation Safer, Faster, and Simpler.",
                    "Two-Round Oblivious Linear Evaluation from Learning with Errors.",
                    "Improved Constructions of Anonymous Credentials from Structure-Preserving Signatures on Equivalence Classes.",
                    "Traceable PRFs: Full Collusion Resistance and Active Security.",
                    "Radical Isogenies on Montgomery Curves.",
                    "Towards a Simpler Lattice Gadget Toolkit.",
                    "Polynomial IOPs for Linear Algebra Relations.",
                    "A Unified Framework for Non-universal SNARKs.",
                    "ECLIPSE: Enhanced Compiling Method for Pedersen-Committed zkSNARK Engines.",
                    "Rational Modular Encoding in the DCR Setting: Non-interactive Range Proofs and Paillier-Based Naor-Yung in the Standard Model."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2022-2",
                "sub_name": "Public-Key Cryptography - PKC 2022 - 25th IACR International Conference on Practice and Theory of Public-Key Cryptography, Virtual Event, March 8-11, 2022, Proceedings, Part II.",
                "count": 17,
                "papers": [
                    "Post-quantum Asynchronous Deniable Key Exchange and the Signal Handshake.",
                    "Post-quantum Anonymous One-Sided Authenticated Key Exchange Without Random Oracles.",
                    "Lockable Obfuscation from Circularly Insecure Fully Homomorphic Encryption.",
                    "Financially Backed Covert Security.",
                    "Lifting Standard Model Reductions to Common Setup Assumptions.",
                    "Efficient Lattice-Based Inner-Product Functional Encryption.",
                    "The Direction of Updatable Encryption Does Matter.",
                    "Leakage-Resilient IBE/ ABE with Optimal Leakage Rates from Lattices.",
                    "Encapsulated Search Index: Public-Key, Sub-linear, Distributed, and Delegatable.",
                    "KDM Security for the Fujisaki-Okamoto Transformations in the QROM.",
                    "A New Security Notion for PKC in the Standard Model: Weaker, Simpler, and Still Realizing Secure Channels.",
                    "Lattice-Based Signatures with Tight Adaptive Corruptions and More.",
                    "Count Me In! Extendability for Threshold Ring Signatures.",
                    "A Note on the Post-quantum Security of (Ring) Signatures.",
                    "Logarithmic-Size (Linkable) Threshold Ring Signatures in the Plain Model.",
                    "On Pairing-Free Blind Signature Schemes in the Algebraic Group Model.",
                    "Efficient Lattice-Based Blind Signatures via Gaussian One-Time Signatures."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "24th PKC 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2021-1",
                "sub_name": "Public-Key Cryptography - PKC 2021 - 24th IACR International Conference on Practice and Theory of Public Key Cryptography, Virtual Event, May 10-13, 2021, Proceedings, Part I.",
                "count": 26,
                "papers": [
                    "QCCA-Secure Generic Key Encapsulation Mechanism with Tighter Security in the Quantum Random Oracle Model.",
                    "An Alternative Approach for SIDH Arithmetic.",
                    "The Convergence of Slide-Type Reductions.",
                    "On the Success Probability of Solving Unique SVP via BKZ.",
                    "Two-Round n-out-of-n and Multi-signatures and Trapdoor Commitment from Lattices.",
                    "Isogeny-Based Key Compression Without Pairings.",
                    "Analysis of Multivariate Encryption Schemes: Application to Dob.",
                    "On the Integer Polynomial Learning with Errors Problem.",
                    "Shorter Lattice-Based Zero-Knowledge Proofs via One-Time Commitments.",
                    "Multivariate Public Key Cryptosystem from Sidon Spaces.",
                    "Banquet: Short and Fast Signatures from AES.",
                    "Improving Revocation for Group Signature with Redactable Signature.",
                    "Bootstrapping Fully Homomorphic Encryption over the Integers in Less than One Second.",
                    "Group Signatures with User-Controlled and Sequential Linkability.",
                    "Impossibility on Tamper-Resilient Cryptography with Uniqueness Properties.",
                    "Rate-1 Key-Dependent Message Security via Reusable Homomorphic Extractor Against Correlated-Source Attacks.",
                    "Two-Party Adaptor Signatures from Identification Schemes.",
                    "Compact Zero-Knowledge Proofs for Threshold ECDSA with Trustless Setup.",
                    "Universal Proxy Re-Encryption.",
                    "Master-Key KDM-Secure ABE via Predicate Encoding.",
                    "Exact Lattice Sampling from Non-Gaussian Distributions.",
                    "Efficient Adaptively-Secure IB-KEMs and VRFs via Near-Collision Resistance.",
                    "Subversion-Resilient Public Key Encryption with Practical Watchdogs.",
                    "Non-interactive CCA2-Secure Threshold Cryptosystems: Achieving Adaptive Security in the Standard Model Without Pairings.",
                    "Updatable Signatures and Message Authentication Codes.",
                    "Multi-Client Functional Encryption for Separable Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2021-2",
                "sub_name": "Public-Key Cryptography - PKC 2021 - 24th IACR International Conference on Practice and Theory of Public Key Cryptography, Virtual Event, May 10-13, 2021, Proceedings, Part II.",
                "count": 26,
                "papers": [
                    "More Efficient Digital Signatures with Tight Multi-user Security.",
                    "Multiparty Cardinality Testing for Threshold Private Intersection.",
                    "Verifiable Random Functions with Optimal Tightness.",
                    "A Geometric Approach to Homomorphic Secret Sharing.",
                    "Generic Negation of Pair Encodings.",
                    "On Selective-Opening Security of Deterministic Primitives.",
                    "Revisiting (R)CCA Security and Replay Protection.",
                    "Single-to-Multi-theorem Transformations for Non-interactive Statistical Zero-Knowledge.",
                    "On the CCA Compatibility of Public-Key Infrastructure.",
                    "Round-Optimal Verifiable Oblivious Pseudorandom Functions from Ideal Lattices.",
                    "BETA: Biometric-Enabled Threshold Authentication.",
                    "Masked Triples - Amortizing Multiplication Triples Across Conditionals.",
                    "Multi-party Threshold Private Set Intersection with Sublinear Communication.",
                    "On the (In)Security of the Diffie-Hellman Oblivious PRF with Multiplicative Blinding.",
                    "An Efficient and Generic Construction for Signal's Handshake (X3DH): Post-Quantum, State Leakage Secure, and Deniable.",
                    "Cryptographic Pseudorandom Generators Can Make Cryptosystems Problematic.",
                    "Publicly Verifiable Zero Knowledge from (Collapsing) Blockchains.",
                    "Two-Server Distributed ORAM with Sublinear Computation and Constant Rounds.",
                    "Flexible and Efficient Verifiable Computation on Encrypted Data.",
                    "Transferable E-Cash: A Cleaner Model and the First Practical Instantiation.",
                    "Private Set Operations from Oblivious Switching.",
                    "On Publicly-Accountable Zero-Knowledge and Small Shuffle Arguments.",
                    "Beyond Security and Efficiency: On-Demand Ratcheting with Security Awareness.",
                    "Group Encryption: Full Dynamicity, Message Filtering and Code-Based Instantiation.",
                    "Steel: Composable Hardware-Based Stateful and Randomised Functional Encryption.",
                    "Adventures in Crypto Dark Matter: Attacks and Fixes for Weak Pseudorandom Functions."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd PKC 2020",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2020-1",
                "sub_name": "Public-Key Cryptography - PKC 2020 - 23rd IACR International Conference on Practice and Theory of Public-Key Cryptography, Edinburgh, UK, May 4-7, 2020, Proceedings, Part I.",
                "count": 22,
                "papers": [
                    "Fast, Compact, and Expressive Attribute-Based Encryption.",
                    "Adaptive Simulation Security for Inner Product Functional Encryption.",
                    "Verifiable Inner Product Encryption Scheme.",
                    "A New Paradigm for Public-Key Functional Encryption for Degree-2 Polynomials.",
                    "Master-Key KDM-Secure IBE from Pairings.",
                    "Hierarchical Identity-Based Encryption with Tight Multi-challenge Security.",
                    "The Usefulness of Sparsifiable Inputs: How to Avoid Subexponential iO.",
                    "Witness Maps and Applications.",
                    "Memory-Tight Reductions for Practical Key Encapsulation Mechanisms.",
                    "Toward RSA-OAEP Without Random Oracles.",
                    "Public-Key Puncturable Encryption: Modular and Compact Constructions.",
                    "Flexible Authenticated and Confidential Channel Establishment (fACCE): Analyzing the Noise Protocol Framework.",
                    "Limits on the Efficiency of (Ring) LWE Based Non-interactive Key Exchange.",
                    "PAKEs: New Framework, New Techniques and More Efficient Lattice-Based Constructions in the Standard Model.",
                    "Constraining and Watermarking PRFs from Milder Assumptions.",
                    "Bringing Order to Chaos: The Case of Collision-Resistant Chameleon-Hashes.",
                    "Concretely-Efficient Zero-Knowledge Arguments for Arithmetic Circuits and Their Application to Lattice-Based Cryptography.",
                    "Updateable Inner Product Argument with Logarithmic Verifier and Applications.",
                    "On Black-Box Extensions of Non-interactive Zero-Knowledge Arguments, and Signatures Directly from Simulation Soundness.",
                    "On QA-NIZK in the BPK Model.",
                    "Improved Discrete Gaussian and Subgaussian Analysis for Lattice Cryptography.",
                    "Almost Tight Security in Lattices with Polynomial Moduli - PRF, IBE, All-but-many LTF, and More."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2020-2",
                "sub_name": "Public-Key Cryptography - PKC 2020 - 23rd IACR International Conference on Practice and Theory of Public-Key Cryptography, Edinburgh, UK, May 4-7, 2020, Proceedings, Part II.",
                "count": 22,
                "papers": [
                    "The Randomized Slicer for CVPP: Sharper, Faster, Smaller, Batchier.",
                    "Tweaking the Asymmetry of Asymmetric-Key Cryptography on Lattices: KEMs and Signatures of Smaller Sizes.",
                    "MPSign: A Signature from Small-Secret Middle-Product Learning with Errors.",
                    "Witness Indistinguishability for Any Single-Round Argument with Applications to Access Control.",
                    "Boosting Verifiable Computation on Encrypted Data.",
                    "Lossy CSI-FiSh: Efficient Signature Scheme with Tight Reduction to Decisional CSIDH-512.",
                    "Threshold Schemes from Isogeny Assumptions.",
                    "Topology-Hiding Computation for Networks with Unknown Delays.",
                    "Sublinear-Round Byzantine Agreement Under Corrupt Majority.",
                    "Bandwidth-Efficient Threshold EC-DSA.",
                    "Blazing Fast OT for Three-Round UC OT Extension.",
                    "Going Beyond Dual Execution: MPC for Functions with Efficient Verification.",
                    "Mon$\\mathbb {Z}_{2^{k}}$a: Fast Maliciously Secure Two Party Computation on $\\mathbb {Z}_{2^{k}}$.",
                    "Generic Authenticated Key Exchange in the Quantum Random Oracle Model.",
                    "Threshold Ring Signatures: New Definitions and Post-quantum Security.",
                    "Tight and Optimal Reductions for Signatures Based on Average Trapdoor Preimage Sampleable Functions and Applications to Code-Based Signatures.",
                    "Faster Cofactorization with ECM Using Mixed Representations.",
                    "Improved Classical Cryptanalysis of SIKE in Practice.",
                    "A Short-List of Pairing-Friendly Curves Resistant to Special TNFS at the 128-Bit Security Level.",
                    "Privacy-Preserving Authenticated Key Exchange and the Case of IKEv2.",
                    "Linearly-Homomorphic Signatures and Scalable Mix-Nets.",
                    "Efficient Redactable Signature and Application to Anonymous Credentials."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd PKC 2019",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2019-1",
                "sub_name": "Public-Key Cryptography - PKC 2019 - 22nd IACR International Conference on Practice and Theory of Public-Key Cryptography, Beijing, China, April 14-17, 2019, Proceedings, Part I.",
                "count": 20,
                "papers": [
                    "Sub-logarithmic Distributed Oblivious RAM with Small Block Size.",
                    "Lossy Algebraic Filters with Short Tags.",
                    "Non-interactive Keyed-Verification Anonymous Credentials.",
                    "Shorter Ring Signatures from Standard Assumptions.",
                    "Efficient Attribute-Based Signatures for Unbounded Arithmetic Branching Programs.",
                    "Efficient Invisible and Unlinkable Sanitizable Signatures.",
                    "Group Signatures with Selective Linkability.",
                    "Let a Non-barking Watchdog Bite: Cliptographic Signatures with an Offline Watchdog.",
                    "Zero-Knowledge Elementary Databases with More Expressive Queries.",
                    "Efficient Non-Interactive Zero-Knowledge Proofs in Cross-Domains Without Trusted Setup.",
                    "Shorter Quadratic QA-NIZK Proofs.",
                    "Short Discrete Log Proofs for FHE and Ring-LWE Ciphertexts.",
                    "Publicly Verifiable Proofs from Blockchains.",
                    "Identity-Based Broadcast Encryption with Efficient Revocation.",
                    "Tightly Secure Hierarchical Identity-Based Encryption.",
                    "Leakage-Resilient Identity-Based Encryption in Bounded Retrieval Model with Nearly Optimal Leakage-Ratio.",
                    "Additively Homomorphic IBE from Higher Residuosity.",
                    "Upper and Lower Bounds for Continuous Non-Malleable Codes.",
                    "Improved Security Evaluation Techniques for Imperfect Randomness from Arbitrary Distributions.",
                    "On Tightly Secure Primitives in the Multi-instance Setting."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2019-2",
                "sub_name": "Public-Key Cryptography - PKC 2019 - 22nd IACR International Conference on Practice and Theory of Public-Key Cryptography, Beijing, China, April 14-17, 2019, Proceedings, Part II.",
                "count": 22,
                "papers": [
                    "Collusion Resistant Broadcast and Trace from Positional Witness Encryption.",
                    "Break-glass Encryption.",
                    "Registration-Based Encryption from Standard Assumptions.",
                    "FE for Inner Products and Its Application to Decentralized ABE.",
                    "Decentralizing Inner-Product Functional Encryption.",
                    "Non-zero Inner Product Encryption Schemes from Various Assumptions: LWE, DDH and DCR.",
                    "Function Private Predicate Encryption for Low Min-Entropy Predicates.",
                    "Adaptively Single-Key Secure Constrained PRFs for \\mathrm NC^1.",
                    "Obfuscating Simple Functionalities from Knowledge Assumptions.",
                    "What About Bob? The Inadequacy of CPA Security for Proxy Reencryption.",
                    "Adaptively Secure Proxy Re-encryption.",
                    "Generic Constructions of Robustly Reusable Fuzzy Extractor.",
                    "Safety in Numbers: On the Need for Robust Diffie-Hellman Parameter Validation.",
                    "Hunting and Gathering - Verifiable Random Functions from Standard Assumptions with Short Proofs.",
                    "Lattice-Based Revocable (Hierarchical) IBE with Decryption Key Exposure Resistance.",
                    "Towards Non-Interactive Zero-Knowledge for NP from LWE.",
                    "More Efficient Algorithms for the NTRU Key Generation Using the Field Norm.",
                    "Efficiently Masking Binomial Sampling at Arbitrary Orders for Lattice-Based Crypto.",
                    "Decryption Failure Attacks on IND-CCA Secure Lattice-Based Schemes.",
                    "Reducing the Key Size of McEliece Cryptosystem from Automorphism-induced Goppa Codes via Permutations.",
                    "Key Encapsulation Mechanism with Explicit Rejection in the Quantum Random Oracle Model.",
                    "Factoring Products of Braids via Garside Normal Form."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st PKC 2018",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2018-1",
                "sub_name": "Public-Key Cryptography - PKC 2018 - 21st IACR International Conference on Practice and Theory of Public-Key Cryptography, Rio de Janeiro, Brazil, March 25-29, 2018, Proceedings, Part I.",
                "count": 24,
                "papers": [
                    "New Constructions of Identity-Based and Key-Dependent Message Secure Encryption Schemes.",
                    "Key Dependent Message Security and Receiver Selective Opening Security for Identity-Based Encryption.",
                    "Tightly SIM-SO-CCA Secure Public Key Encryption from Standard Assumptions.",
                    "Multi-Key Searchable Encryption, Revisited.",
                    "Fully Homomorphic Encryption from the Finite Field Isomorphism Problem.",
                    "Hybrid Encryption in a Multi-user Setting, Revisited.",
                    "KEM Combiners.",
                    "Revisiting Proxy Re-encryption: Forward Secrecy, Improved Security, and Applications.",
                    "Hedged Nonce-Based Public-Key Encryption: Adaptive Security Under Randomness Failures.",
                    "Related Randomness Security for Public Key Encryption, Revisited.",
                    "Subversion-Zero-Knowledge SNARKs.",
                    "Public-Key Encryption Resistant to Parameter Subversion and Its Realization from Efficiently-Embeddable Groups.",
                    "A Practical Cryptanalysis of WalnutDSA TM.",
                    "Speed-Ups and Time-Memory Trade-Offs for Tuple Lattice Sieving.",
                    "Fast Lattice Basis Reduction Suitable for Massive Parallelization and Its Application to the Shortest Vector Problem.",
                    "Reusing Tamper-Proof Hardware in UC-Secure Protocols.",
                    "On Composable Security for Digital Signatures.",
                    "Equational Security Proofs of Oblivious Transfer Protocols.",
                    "Extending Oblivious Transfer with Low Communication via Key-Homomorphic PRFs.",
                    "Committed MPC - Maliciously Secure Multiparty Computation from Homomorphic Commitments.",
                    "Fast Garbling of Circuits over 3-Valued Logic.",
                    "Efficient Covert Two-Party Computation.",
                    "Towards Characterizing Securely Computable Two-Party Randomized Functions.",
                    "On the Message Complexity of Secure Multiparty Computation."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2018-2",
                "sub_name": "Public-Key Cryptography - PKC 2018 - 21st IACR International Conference on Practice and Theory of Public-Key Cryptography, Rio de Janeiro, Brazil, March 25-29, 2018, Proceedings, Part II.",
                "count": 25,
                "papers": [
                    "SOFIA: MQ MQ -Based Signatures in the QROM.",
                    "A Unified Framework for Trapdoor-Permutation-Based Sequential Aggregate Signatures.",
                    "Constant-Size Group Signatures from Lattices.",
                    "Attribute-Based Signatures for Unbounded Circuits in the ROM and Efficient Instantiations from Lattices.",
                    "Improved (Almost) Tightly-Secure Structure-Preserving Signatures.",
                    "Weakly Secure Equivalence-Class Signatures from Standard Assumptions.",
                    "Simple and Generic Constructions of Succinct Functional Encryption.",
                    "Making Public Key Functional Encryption Function Private, Distributively.",
                    "Full-Hiding (Unbounded) Multi-input Inner Product Functional Encryption from the k-Linear Assumption.",
                    "Local Non-malleable Codes in the Bounded Retrieval Model.",
                    "Non-malleability vs. CCA-Security: The Case of Commitments.",
                    "Interactively Secure Groups from Obfuscation.",
                    "Graded Encoding Schemes from Obfuscation.",
                    "Hashing Solutions Instead of Generating Problems: On the Interactive Certification of RSA Moduli.",
                    "Two-Factor Authentication with End-to-End Password Security.",
                    "Bootstrapping the Blockchain, with Applications to Consensus and Fast PKI Setup.",
                    "Efficient Adaptively Secure Zero-Knowledge from Garbled Circuits.",
                    "Compact Zero-Knowledge Proofs of Small Hamming Weight.",
                    "Efficient Batch Zero-Knowledge Arguments for Low Degree Polynomials.",
                    "On the Security of Classic Protocols for Unique Witness Relations.",
                    "New (and Old) Proof Systems for Lattice Problems.",
                    "Hash Proof Systems over Lattices Revisited.",
                    "Privately Constraining and Programming PRFs, the LWE Way.",
                    "Learning with Errors and Extrapolated Dihedral Cosets.",
                    "Rounded Gaussians - Fast and Secure Constant-Time Sampling for Lattice-Based Crypto."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th PKC 2017",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2017-1",
                "sub_name": "Public-Key Cryptography - PKC 2017 - 20th IACR International Conference on Practice and Theory in Public-Key Cryptography, Amsterdam, The Netherlands, March 28-31, 2017, Proceedings, Part I.",
                "count": 18,
                "papers": [
                    "LP Solutions of Vectorial Integer Subset Sums - Cryptanalysis of Galbraith's Binary Matrix LWE.",
                    "Improved Algorithms for the Approximate k-List Problem in Euclidean Norm.",
                    "Zeroizing Attacks on Indistinguishability Obfuscation over CLT13.",
                    "Cut Down the Tree to Achieve Constant Complexity in Divisible E-cash.",
                    "Asymptotically Tight Bounds for Composing ORAM with PIR.",
                    "Predictable Arguments of Knowledge.",
                    "Removing Erasures with Explainable Hash Proof Systems.",
                    "Scalable Multi-party Private Set-Intersection.",
                    "Tightly Secure IBE Under Constant-Size Master Public Key.",
                    "Separating IND-CPA and Circular Security for Unbounded Length Key Cycles.",
                    "Structure-Preserving Chosen-Ciphertext Security with Shorter Verifiable Ciphertexts.",
                    "Non-malleable Codes with Split-State Refresh.",
                    "Tight Upper and Lower Bounds for Leakage-Resilient, Locally Decodable and Updatable Non-malleable Codes.",
                    "Fully Leakage-Resilient Codes.",
                    "On the Bit Security of Elliptic Curve Diffie-Hellman.",
                    "Extended Tower Number Field Sieve with Application to Finite Fields of Arbitrary Composite Extension Degree.",
                    "Provably Secure NTRU Instances over Prime Cyclotomic Rings.",
                    "Equivalences and Black-Box Separations of Matrix Diffie-Hellman Problems."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2017-2",
                "sub_name": "Public-Key Cryptography - PKC 2017 - 20th IACR International Conference on Practice and Theory in Public-Key Cryptography, Amsterdam, The Netherlands, March 28-31, 2017, Proceedings, Part II.",
                "count": 18,
                "papers": [
                    "Dual System Framework in Multilinear Settings and Applications to Fully Secure (Compact) ABE for Unbounded-Size Circuits.",
                    "CCA-Secure Inner-Product Functional Encryption from Projective Hash Functions.",
                    "Bounded-Collusion Attribute-Based Encryption from Minimal Assumptions.",
                    "Access Control Encryption for Equality, Comparison, and More.",
                    "Deterring Certificate Subversion: Efficient Double-Authentication-Preventing Signatures.",
                    "Chameleon-Hashes with Ephemeral Trapdoors - And Applications to Invisible Sanitizable Signatures.",
                    "Improved Structure Preserving Signatures Under Standard Bilinear Assumptions.",
                    "Chosen-Ciphertext Secure Fully Homomorphic Encryption.",
                    "Circuit-Private Multi-key FHE.",
                    "FHE over the Integers: Decomposed and Batched in the Post-Quantum Regime.",
                    "Ceremonies for End-to-End Verifiable Elections.",
                    "A Modular Security Analysis of EAP and IEEE 802.11.",
                    "On the Computational Overhead of MPC with Dishonest Majority.",
                    "Better Two-Round Adaptive Multi-party Computation.",
                    "Constant Round Adaptively Secure Protocols in the Tamper-Proof Hardware Model.",
                    "Constrained Pseudorandom Functions for Unconstrained Inputs Revisited: Achieving Verifiability and Key Delegation.",
                    "Constraining Pseudorandom Functions Privately.",
                    "Universal Samplers with Fast Verification."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th PKC 2016",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2016-1",
                "sub_name": "Public-Key Cryptography - PKC 2016 - 19th IACR International Conference on Practice and Theory in Public-Key Cryptography, Taipei, Taiwan, March 6-9, 2016, Proceedings, Part I.",
                "count": 17,
                "papers": [
                    "Trading Plaintext-Awareness for Simulatability to Achieve Chosen Ciphertext Security.",
                    "Chosen-Ciphertext Security from Subset Sum.",
                    "On the Hardness of Proving CCA-Security of Signed ElGamal.",
                    "CCA-Secure Keyed-Fully Homomorphic Encryption.",
                    "On the Key Dependent Message Security of the Fujisaki-Okamoto Constructions.",
                    "Extended Nested Dual System Groups, Revisited.",
                    "Functional Encryption for Inner Product with Full Function Privacy.",
                    "Deniable Functional Encryption.",
                    "Identity-Based Cryptosystems and Quadratic Residuosity.",
                    "Identity-Based Hierarchical Key-Insulated Encryption Without Random Oracles.",
                    "Attribute-Based Signatures for Circuits from Bilinear Map.",
                    "Efficient Unlinkable Sanitizable Signatures from Signatures with Re-randomizable Keys.",
                    "Fault-Tolerant Aggregate Signatures.",
                    "Delegatable Functional Signatures.",
                    "Mitigating Multi-target Attacks in Hash-Based Signatures.",
                    "Nearly Optimal Verifiable Data Streaming.",
                    "ARMed SPHINCS - Computing a 41 KB Signature in 16 KB of RAM."
                ]
            },
            {
                "sub_name_abbr": "conf/pkc/2016-2",
                "sub_name": "Public-Key Cryptography - PKC 2016 - 19th IACR International Conference on Practice and Theory in Public-Key Cryptography, Taipei, Taiwan, March 6-9, 2016, Proceedings, Part II.",
                "count": 17,
                "papers": [
                    "Algebraic Approaches for the Elliptic Curve Discrete Logarithm Problem over Prime Fields.",
                    "Degenerate Curve Attacks - Extending Invalid Curve Attacks to Edwards Curves and Other Models.",
                    "Easing Coppersmith Methods Using Analytic Combinatorics: Applications to Public-Key Cryptography with Weak Pseudorandomness.",
                    "How to Generalize RSA Cryptanalyses.",
                    "Leakage-Resilient Public-Key Encryption from Obfuscation.",
                    "On Generic Constructions of Circularly-Secure, Leakage-Resilient Public-Key Encryption Schemes.",
                    "KDM-Security via Homomorphic Smooth Projective Hashing.",
                    "Asynchronous Secure Multiparty Computation in Constant Time.",
                    "Adaptively Secure Multi-Party Computation from LWE (via Equivocal FHE).",
                    "Universally Composable Direct Anonymous Attestation.",
                    "Universally Composable Authentication and Key-Exchange with Global PKI.",
                    "Very-Efficient Simulatable Flipping of Many Coins into a Well - (and a New Universally-Composable Commitment Scheme).",
                    "Robust Secret Sharing Schemes Against Local Adversaries.",
                    "Reducing Depth in Constrained PRFs: From Bit-Fixing to \\mathbf NC^1.",
                    "Non-Malleable Functions and Their Applications.",
                    "On Public Key Encryption from Noisy Codewords.",
                    "Indistinguishability Obfuscation with Non-trivial Efficiency."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th PKC 2015",
        "info": "Gaithersburg, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2015",
                "sub_name": "Public-Key Cryptography - PKC 2015 - 18th IACR International Conference on Practice and Theory in Public-Key Cryptography, Gaithersburg, MD, USA, March 30 - April 1, 2015, Proceedings.",
                "count": 36,
                "papers": [
                    "Simulation-Based Selective Opening CCA Security for PKE from Key Encapsulation Mechanisms.",
                    "On the Selective Opening Security of Practical Public-Key Encryption Schemes.",
                    "How Secure is Deterministic Encryption?",
                    "Divisible E-Cash Made Practical.",
                    "Anonymous Transferable E-Cash.",
                    "Collision of Random Walks and a Refined Analysis of Attacks on the Discrete Logarithm Problem.",
                    "A Polynomial-Time Key-Recovery Attack on MQQ Cryptosystems.",
                    "A Polynomial-Time Attack on the BBCRS Scheme.",
                    "Algebraic Cryptanalysis of a Quantum Money Scheme The Noise-Free Case.",
                    "Digital Signatures from Strong RSA without Prime Generation.",
                    "Short Signatures with Short Public Keys from Homomorphic Trapdoor Functions.",
                    "Tightly-Secure Signatures from Chameleon Hash Functions.",
                    "Two-Server Password-Authenticated Secret Sharing UC-Secure Against Transient Corruptions.",
                    "Adaptive Witness Encryption and Asymmetric Password-Based Cryptography.",
                    "Public-Key Encryption Indistinguishable Under Plaintext-Checkable Attacks.",
                    "Strongly-Optimal Structure Preserving Signatures from Type II Pairings: Synthesis and Lower Bounds.",
                    "A Profitable Sub-prime Loan: Obtaining the Advantages of Composite Order in Prime-Order Bilinear Groups.",
                    "Simpler Efficient Group Signatures from Lattices.",
                    "Group Signatures from Lattices: Simpler, Tighter, Shorter, Ring-Based.",
                    "Secure Efficient History-Hiding Append-Only Signatures in the Standard Model.",
                    "One-Round Key Exchange with Strong Security: An Efficient and Generic Construction in the Standard Model.",
                    "Additively Homomorphic UC Commitments with Optimal Amortized Overhead.",
                    "Interactive Message-Locked Encryption and Secure Deduplication.",
                    "Faster ECC over \\mathbb F_2^521-1.",
                    "Continuous Non-malleable Key Derivation and Its Application to Related-Key Security.",
                    "A Tamper and Leakage Resilient von Neumann Architecture.",
                    "Low Noise LPN: KDM Secure Public Key Encryption and Sample Amplification.",
                    "Adaptive Proofs of Knowledge in the Random Oracle Model.",
                    "Making Sigma-Protocols Non-interactive Without Random Oracles.",
                    "Bootstrapping BGV Ciphertexts with a Wider Choice of p and q.",
                    "Packing Messages and Optimizing Bootstrapping in GSW-FHE.",
                    "Simple Lattice Trapdoor Sampling from a Broad Class of Distributions.",
                    "Simple Functional Encryption Schemes for Inner Products.",
                    "Predicate Encryption for Multi-dimensional Range Queries from Lattices.",
                    "On the Practical Security of Inner Product Functional Encryption.",
                    "Identity-Based Encryption with (Almost) Tight Security in the Multi-instance, Multi-ciphertext Setting."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th PKC 2014",
        "info": "Buenos Aires, Argentina",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2014",
                "sub_name": "Public-Key Cryptography - PKC 2014 - 17th International Conference on Practice and Theory in Public-Key Cryptography, Buenos Aires, Argentina, March 26-28, 2014. Proceedings.",
                "count": 38,
                "papers": [
                    "Simple Chosen-Ciphertext Security from Low-Noise LPN.",
                    "Leakage-Flexible CCA-secure Public-Key Encryption: Simple Construction and Free of Pairing.",
                    "A Black-Box Construction of a CCA2 Encryption Scheme from a Plaintext Aware (sPA1) Encryption Scheme.",
                    "Chosen Ciphertext Security via UCE.",
                    "Proxy Re-encryption from Lattices.",
                    "Re-encryption, Functional Re-encryption, and Multi-hop Re-encryption: A Framework for Achieving Obfuscation-Based Security and Instantiations from Lattices.",
                    "Verifiable Set Operations over Outsourced Databases.",
                    "Verifiable Oblivious Storage.",
                    "Achieving Privacy in Verifiable Computation with Multiple Servers - Without FHE and without Pre-processing.",
                    "Efficient Delegation of Zero-Knowledge Proofs of Knowledge in a Pairing-Friendly Setting.",
                    "Rounding and Chaining LLL: Finding Faster Small Roots of Univariate Polynomial Congruences.",
                    "Elliptic and Hyperelliptic Curves: A Practical Security Analysis.",
                    "Discrete Logarithm in GF(2809) with FFS.",
                    "Identity-Based Lossy Trapdoor Functions: New Definitions, Hierarchical Extensions, and Implications.",
                    "Bounded-Collusion Identity-Based Encryption from Semantically-Secure Public-Key Encryption: Generic Constructions with Short Ciphertexts.",
                    "A Framework and Compact Constructions for Non-monotonic Attribute-Based Encryption.",
                    "Online/Offline Attribute-Based Encryption.",
                    "Scale-Invariant Fully Homomorphic Encryption over the Integers.",
                    "Enhanced Chosen-Ciphertext Security and Applications.",
                    "Lattice-Based Group Signature Scheme with Verifier-Local Revocation.",
                    "Leakage-Resilient Signatures with Graceful Degradation.",
                    "On the Lossiness of the Rabin Trapdoor Function.",
                    "Solving Random Subset Sum Problem by l p -norm SVP Oracle.",
                    "Parallel Gauss Sieve Algorithm: Solving the SVP Challenge over a 128-Dimensional Ideal Lattice.",
                    "Lazy Modulus Switching for the BKW Algorithm on LWE.",
                    "Practical Cryptanalysis of a Public-Key Encryption Scheme Based on New Multivariate Quadratic Assumptions.",
                    "Related Randomness Attacks for Public Key Encryption.",
                    "Encryption Schemes Secure under Related-Key and Key-Dependent Message Attacks.",
                    "Functional Signatures and Pseudorandom Functions.",
                    "Policy-Based Signatures.",
                    "Generalizing Homomorphic MACs for Arithmetic Circuits.",
                    "General Impossibility of Group Homomorphic Encryption in the Quantum World.",
                    "On Minimal Assumptions for Sender-Deniable Public Key Encryption.",
                    "Traceable Group Encryption.",
                    "Practical Covert Authentication.",
                    "Fine-Tuning Groth-Sahai Proofs.",
                    "Cross-Domain Secure Computation.",
                    "On the Security of the Pre-shared Key Ciphersuites of TLS."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th PKC 2013",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2013",
                "sub_name": "Public-Key Cryptography - PKC 2013 - 16th International Conference on Practice and Theory in Public-Key Cryptography, Nara, Japan, February 26 - March 1, 2013. Proceedings.",
                "count": 30,
                "papers": [
                    "Packed Ciphertexts in LWE-Based Homomorphic Encryption.",
                    "Feasibility and Infeasibility of Adaptively Secure Fully Homomorphic Encryption.",
                    "Chosen Ciphertext Secure Keyed-Homomorphic Public-Key Encryption.",
                    "Functional Encryption: Origins and Recent Developments.",
                    "Vector Commitments and Their Applications.",
                    "Efficient, Adaptively Secure, and Composable Oblivious Transfer with a Single, Global CRS.",
                    "Cryptography Using Captcha Puzzles.",
                    "Improved Zero-Knowledge Proofs of Knowledge for the ISIS Problem, and Applications.",
                    "Decentralized Attribute-Based Signatures.",
                    "On the Semantic Security of Functional Encryption Schemes.",
                    "Attribute-Based Encryption with Fast Decryption.",
                    "Recovering RSA Secret Keys from Noisy Key Bits with Erasures and Errors.",
                    "Combined Attack on CRT-RSA - Why Public Verification Must Not Be Public?",
                    "Revocable Identity-Based Encryption Revisited: Security Model and Construction.",
                    "Improved (Hierarchical) Inner-Product Encryption from Lattices.",
                    "Techniques for Efficient Secure Computation Based on Yao's Protocol.",
                    "Non-Interactive Key Exchange.",
                    "Efficient UC-Secure Authenticated Key-Exchange for Algebraic Languages.",
                    "Tighter Reductions for Forward-Secure Signature Schemes.",
                    "Tagged One-Time Signatures: Tight Security and Optimal Tag Size.",
                    "Key Encapsulation Mechanisms from Extractable Hash Proof Systems, Revisited.",
                    "Robust Encryption, Revisited.",
                    "Sender-Equivocable Encryption Schemes Secure against Chosen-Ciphertext Attacks Revisited.",
                    "Efficient Completely Context-Hiding Quotable and Linearly Homomorphic Signatures.",
                    "Verifiably Encrypted Signatures with Short Keys Based on the Decisional Linear Problem and Obfuscation for Encrypted VES.",
                    "Sequential Aggregate Signatures with Short Public Keys: Design, Analysis and Implementation Studies.",
                    "New Constructions and Applications of Trapdoor DDH Groups.",
                    "Rate-Limited Secure Function Evaluation: Definitions and Constructions.",
                    "Verifiable Elections That Scale for Free.",
                    "On the Connection between Leakage Tolerance and Adaptive Security."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th PKC 2012",
        "info": "Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2012",
                "sub_name": "Public Key Cryptography - PKC 2012 - 15th International Conference on Practice and Theory in Public Key Cryptography, Darmstadt, Germany, May 21-23, 2012. Proceedings.",
                "count": 42,
                "papers": [
                    "Better Bootstrapping in Fully Homomorphic Encryption.",
                    "Polly Cracker, Revisited, Revisited.",
                    "Ring-LWE in Polynomial Rings.",
                    "On Homomorphic Encryption and Chosen-Ciphertext Security.",
                    "Waters Signatures with Optimal Security Reduction.",
                    "Strong Security from Probabilistic Signature Schemes.",
                    "Space Efficient Signature Schemes from the RSA Assumption.",
                    "The Construction of Ambiguous Optimistic Fair Exchange from Designated Confirmer Signature without Random Oracles.",
                    "Efficient Implementation of a CCA2-Secure Variant of McEliece Using Generalized Srivastava Codes.",
                    "Solving Underdetermined Systems of Multivariate Quadratic Equations Revisited.",
                    "Public-Key Identification Schemes Based on Multivariate Cubic Polynomials.",
                    "Public-Key Cryptography from New Multivariate Quadratic Assumptions.",
                    "Anonymous Broadcast Encryption: Adaptive Security and Efficient Constructions in the Standard Model.",
                    "Outsider-Anonymous Broadcast Encryption with Sublinear Ciphertexts.",
                    "Verifiable Predicate Encryption and Applications to CCA Security and Anonymous Predicate Authentication.",
                    "Public Key Encryption against Related Key Attacks.",
                    "Functional Encryption for Threshold Functions (or Fuzzy IBE) from Lattices.",
                    "Variants of Waters' Dual System Primitives Using Asymmetric Pairings - (Extended Abstract).",
                    "From Selective to Full Security: Semi-generic Transformations in the Standard Model.",
                    "Circular and KDM Security for Identity-Based Encryption.",
                    "NTRUCCA: How to Strengthen NTRUEncrypt to Chosen-Ciphertext Security in the Standard Model.",
                    "Generating Provable Primes Efficiently on Embedded Devices.",
                    "Password-Based Authenticated Key Exchange.",
                    "Constant-Round Multi-party Private Set Union Using Reversed Laurent Series.",
                    "Policy-Enhanced Private Set Intersection: Sharing Information While Enforcing Privacy Policies.",
                    "Efficiently Shuffling in Public.",
                    "Efficient Password Authenticated Key Exchange via Oblivious Transfer.",
                    "Strongly Secure Authenticated Key Exchange from Factoring, Codes, and Lattices.",
                    "Relatively-Sound NIZKs and Password-Based Key-Exchange.",
                    "Multi-location Leakage Resilient Cryptography.",
                    "On Definitions of Selective Opening Security.",
                    "New Definitions and Separations for Circular Security.",
                    "Correlated Product Security from Any One-Way Function.",
                    "Relations between Constrained and Bounded Chosen Ciphertext Security for Key Encapsulation Mechanisms.",
                    "Solving a Discrete Logarithm Problem with Auxiliary Input on a 160-Bit Elliptic Curve.",
                    "Inferring Sequences Produced by Nonlinear Pseudorandom Number Generators Using Coppersmith's Methods.",
                    "Extended-DDH and Lossy Trapdoor Functions.",
                    "DDH-Like Assumptions Based on Extension Rings.",
                    "Security of Blind Signatures Revisited.",
                    "Efficient Network Coding Signatures in the Standard Model.",
                    "Improved Security for Linearly Homomorphic Signatures: A Generic Framework.",
                    "On the Security of Dynamic Group Signatures: Preventing Signature Hijacking."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th PKC 2011",
        "info": "Taormina, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2011",
                "sub_name": "Public Key Cryptography - PKC 2011 - 14th International Conference on Practice and Theory in Public Key Cryptography, Taormina, Italy, March 6-9, 2011. Proceedings.",
                "count": 29,
                "papers": [
                    "Linearly Homomorphic Signatures over Binary Fields and New Tools for Lattice-Based Signatures.",
                    "Homomorphic Network Coding Signatures in the Standard Model.",
                    "Efficient Attribute-Based Signatures for Non-monotone Predicates in the Standard Model.",
                    "Ciphertext-Policy Attribute-Based Encryption: An Expressive, Efficient, and Provably Secure Realization.",
                    "Generic Constructions for Chosen-Ciphertext Secure Attribute Based Encryption.",
                    "Expressive Key-Policy Attribute-Based Encryption with Constant-Size Ciphertexts.",
                    "Faster and Lower Memory Scalar Multiplication on Supersingular Curves in Characteristic Three.",
                    "On the Correct Use of the Negation Map in the Pollard rho Method.",
                    "Cryptanalysis of the RSA Subgroup Assumption from TCC 2005.",
                    "(If) Size Matters: Size-Hiding Private Set Intersection.",
                    "Sub-linear, Secure Comparison with Two Non-colluding Parties.",
                    "Oblivious Transfer with Hidden Access Control Policies.",
                    "Chosen Ciphertext Secure Encryption under Factoring Assumption Revisited.",
                    "Chameleon All-But-One TDFs and Their Application to Chosen-Ciphertext Security.",
                    "Parallel Decryption Queries in Bounded Chosen Ciphertext Attacks.",
                    "Secure Blind Decryption.",
                    "New Developments in Leakage-Resilient Cryptography.",
                    "On the Security of a Bidirectional Proxy Re-encryption Scheme from PKC 2010.",
                    "Fully Secure Accountable-Authority Identity-Based Encryption.",
                    "One-Pass HMQV and Asymmetric Key-Wrapping.",
                    "Linear Recurring Sequences for the UOV Key Generation.",
                    "On the Impossibility of Instantiating PSS in the Standard Model.",
                    "On-line Non-transferable Signatures Revisited.",
                    "Round-Efficient Sub-linear Zero-Knowledge Arguments for Linear Algebra.",
                    "Signatures on Randomizable Ciphertexts.",
                    "Revocation for Delegatable Anonymous Credentials.",
                    "Cryptanalysis of Multivariate and Odd-Characteristic HFE Variants.",
                    "Cryptanalysis of Cryptosystems Based on Non-commutative Skew Polynomials.",
                    "Practical Cryptanalysis of the Identification Scheme Based on the Isomorphism of Polynomial with One Secret Problem."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th PKC 2010",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2010",
                "sub_name": "Public Key Cryptography - PKC 2010, 13th International Conference on Practice and Theory in Public Key Cryptography, Paris, France, May 26-28, 2010. Proceedings.",
                "count": 29,
                "papers": [
                    "Simple and Efficient Public-Key Encryption from Computational Diffie-Hellman in the Standard Model.",
                    "Constant Size Ciphertexts in Threshold Attribute-Based Encryption.",
                    "Algebraic Cryptanalysis of the PKC'2009 Algebraic Surface Cryptosystem.",
                    "Maximizing Small Root Bounds by Linearization and Applications to Small Secret Exponent RSA.",
                    "Implicit Factoring with Shared Most Significant and Middle Bits.",
                    "On the Feasibility of Consistent Computations.",
                    "Multi-query Computationally-Private Information Retrieval with Constant Communication Rate.",
                    "Further Observations on Optimistic Fair Exchange Protocols in the Multi-user Setting.",
                    "Secure Network Coding over the Integers.",
                    "Preventing Pollution Attacks in Multi-source Network Coding.",
                    "Groth-Sahai Proofs Revisited.",
                    "Constant-Round Concurrent Non-Malleable Statistically Binding Commitments and Decommitments.",
                    "Faster Squaring in the Cyclotomic Subgroup of Sixth Degree Extensions.",
                    "Faster Pairing Computations on Curves with High-Degree Twists.",
                    "Efficient Arithmetic on Hessian Curves.",
                    "CCA Proxy Re-Encryption without Bilinear Maps in the Standard Model.",
                    "More Constructions of Lossy and Correlation-Secure Trapdoor Functions.",
                    "Chosen-Ciphertext Security from Slightly Lossy Trapdoor Functions.",
                    "Efficient Set Operations in the Presence of Malicious Adversaries.",
                    "Text Search Protocols with Simulation Based Security.",
                    "Solving a 676-Bit Discrete Logarithm Problem in GF(36n).",
                    "Using Equivalence Classes to Accelerate Solving the Discrete Logarithm Problem in a Short Interval.",
                    "Functional Encryption for Inner Product: Achieving Constant-Size Ciphertexts with Adaptive Security or Support for Negation.",
                    "Security of Encryption Schemes in Weakened Random Oracle Models.",
                    "Fully Homomorphic Encryption with Relatively Small Key and Ciphertext Sizes.",
                    "Unlinkability of Sanitizable Signatures.",
                    "Confidential Signatures and Deterministic Signcryption.",
                    "Identity-Based Aggregate and Multi-Signature Schemes Based on RSA.",
                    "Lattice Mixing and Vanishing Trapdoors: A Framework for Fully Secure Short Signatures and More."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th PKC 2009",
        "info": "Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2009",
                "sub_name": "Public Key Cryptography - PKC 2009, 12th International Conference on Practice and Theory in Public Key Cryptography, Irvine, CA, USA, March 18-20, 2009. Proceedings.",
                "count": 28,
                "papers": [
                    "Implicit Factoring: On Polynomial Time Factoring Given Only an Implicit Hint.",
                    "The Security of All Bits Using List Decoding.",
                    "A New Lattice Construction for Partial Key Exposure Attack for RSA.",
                    "Subset-Restricted Random Walks for Pollard rho Method on Fpm.",
                    "Signing a Linear Subspace: Signature Schemes for Network Coding.",
                    "Improving the Boneh-Franklin Traitor Tracing Scheme.",
                    "Modeling Key Compromise Impersonation Attacks on Group Key Exchange Protocols.",
                    "Zero-Knowledge Proofs with Witness Elimination.",
                    "Distributed Public-Key Cryptography from Weak Secrets.",
                    "Asynchronous Multiparty Computation: Theory and Implementation.",
                    "Multi-Party Computation with Omnipresent Adversary.",
                    "Blind and Anonymous Identity-Based Encryption and Authorised Private Searches on Public Key Encrypted Data.",
                    "Anonymous Hierarchical Identity-Based Encryption with Constant Size Ciphertexts.",
                    "Towards Black-Box Accountable Authority IBE with Short Ciphertexts and Private Keys.",
                    "Removing Escrow from Identity-Based Encryption.",
                    "On the Theory and Practice of Personal Digital Signatures.",
                    "Security of Blind Signatures under Aborts.",
                    "Security of Sanitizable Signatures Revisited.",
                    "Identification of Multiple Invalid Signatures in Pairing-Based Batched Signatures.",
                    "CCA-Secure Proxy Re-encryption without Pairings.",
                    "Compact CCA-Secure Encryption for Messages of Arbitrary Length.",
                    "Verifiable Rotation of Homomorphic Encryptions.",
                    "A Practical Key Recovery Attack on Basic TCHo.",
                    "An Algebraic Surface Cryptosystem.",
                    "Fast Multibase Methods and Other Several Optimizations for Elliptic Curve Scalar Multiplication.",
                    "Revocable Group Signature Schemes with Constant Costs for Signing and Verifying.",
                    "An Accumulator Based on Bilinear Maps and Efficient Revocation for Anonymous Credentials.",
                    "Controlling Access to an Oblivious Database Using Stateful Anonymous Credentials."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th PKC 2008",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2008",
                "sub_name": "Public Key Cryptography - PKC 2008, 11th International Workshop on Practice and Theory in Public-Key Cryptography, Barcelona, Spain, March 9-12, 2008. Proceedings.",
                "count": 22,
                "papers": [
                    "Total Break of the l-IC Signature Scheme.",
                    "Recovering NTRU Secret Key from Inversion Oracles.",
                    "Solving Systems of Modular Equations in One Variable: How Many RSA-Encrypted Messages Does Eve Need to Know?",
                    "Relations Among Notions of Plaintext Awareness.",
                    "Completely Non-malleable Encryption Revisited.",
                    "Cryptographic Test Correction.",
                    "Off-Line/On-Line Signatures: Theoretical Aspects and Experimental Results.",
                    "Construction of Universal Designated-Verifier Signatures and Identity-Based Signatures from Standard Signatures.",
                    "Proxy Signatures Secure Against Proxy Key Exposure.",
                    "Lattice-Based Identification Schemes Secure Under Active Attacks.",
                    "Efficient Simultaneous Broadcast.",
                    "SAS-Based Group Authentication and Key Agreement Protocols.",
                    "An Optimized Hardware Architecture for the Montgomery Multiplication Algorithm.",
                    "New Composite Operations and Precomputation Scheme for Elliptic Curve Cryptosystems over Prime Fields.",
                    "Online-Untransferable Signatures.",
                    "Security of Digital Signature Schemes in Weakened Random Oracle Models.",
                    "A Digital Signature Scheme Based on CVPinfinity.",
                    "An Analysis of the Vector Decomposition Problem.",
                    "A Parameterized Splitting System and Its Application to the Discrete Logarithm Problem with Low Hamming Weight Product Exponents.",
                    "Certificateless Encryption Schemes Strongly Secure in the Standard Model.",
                    "Unidirectional Chosen-Ciphertext Secure Proxy Re-encryption.",
                    "Public Key Broadcast Encryption with Low Number of Keys and Constant Decryption Time."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th PKC 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2007",
                "sub_name": "Public Key Cryptography - PKC 2007, 10th International Conference on Practice and Theory in Public-Key Cryptography, Beijing, China, April 16-20, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "Full-Domain Subgroup Hiding and Constant-Size Group Signatures.",
                    "A Direct Anonymous Attestation Scheme for Embedded Devices.",
                    "Anonymous Signatures Made Easy.",
                    "On the Generic and Efficient Constructions of Secure Designated Confirmer Signatures.",
                    "Cryptanalysis of Group-Based Key Agreement Protocols Using Subgroup Distance Functions.",
                    "Length Based Attack and Braid Groups: Cryptanalysis of Anshel-Anshel-Goldfeld Key Exchange Protocol.",
                    "New Chosen-Ciphertext Attacks on NTRU.",
                    "Cryptanalysis of the Paeng-Jung-Ha Cryptosystem from PKC 2003.",
                    "Optimistic Fair Exchange in a Multi-user Setting.",
                    "Multi-party Stand-Alone and Setup-Free Verifiably Committed Signatures.",
                    "Knowledge-Binding Commitments with Applications in Time-Stamping.",
                    "Efficient Ring Signatures Without Random Oracles.",
                    "Traceable Ring Signature.",
                    "Two-Tier Signatures, Strongly Unforgeable Signatures, and Fiat-Shamir Without Random Oracles.",
                    "Improved On-Line/Off-Line Threshold Signatures.",
                    "High Order Linearization Equation (HOLE) Attack on Multivariate Public Key Cryptosystems.",
                    "Cryptanalysis of HFE with Internal Perturbation.",
                    "l-Invertible Cycles for Multivariate Quadratic (MQ) Public Key Cryptography.",
                    "Chosen-Ciphertext Secure Key-Encapsulation Based on Gap Hashed Diffie-Hellman.",
                    "Parallel Key-Insulated Public Key Encryption Without Random Oracles.",
                    "Multi-bit Cryptosystems Based on Lattice Problems.",
                    "Practical and Secure Solutions for Integer Comparison.",
                    "Multiparty Computation for Interval, Equality, and Comparison Without Bit-Decomposition Protocol.",
                    "Identity-Based Traitor Tracing.",
                    "Verifiable Shuffle of Large Size Ciphertexts.",
                    "A Survey of Single-Database Private Information Retrieval: Techniques and Applications.",
                    "Deterministic Polynomial Time Equivalence Between Factoring and Key-Recovery Attack on Takagi's RSA.",
                    "Efficient Pseudorandom Generators Based on the DDH Assumption.",
                    "Fast Batch Verification of Multiple Signatures.",
                    "A Closer Look at PKI: Security and Efficiency.",
                    "Self-Generated-Certificate Public Key Encryption Without Pairing."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th PKC 2006",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2006",
                "sub_name": "Public Key Cryptography - PKC 2006, 9th International Conference on Theory and Practice of Public-Key Cryptography, New York, NY, USA, April 24-26, 2006, Proceedings.",
                "count": 34,
                "papers": [
                    "New Attacks on RSA with Small Secret CRT-Exponents.",
                    "An Attack on a Modified Niederreiter Encryption Scheme.",
                    "Cryptanalysis of an Efficient Proof of Knowledge of Discrete Logarithm.",
                    "Efficient Polynomial Operations in the Shared-Coefficients Setting.",
                    "Generic On-Line/Off-Line Threshold Signatures.",
                    "Linear Integer Secret Sharing and Distributed Exponentiation.",
                    "Encoding-Free ElGamal Encryption Without Random Oracles.",
                    "Parallel Key-Insulated Public Key Encryption.",
                    "Provably Secure Steganography with Imperfect Sampling.",
                    "Collision-Resistant No More: Hash-and-Sign Paradigm Revisited.",
                    "Higher Order Universal One-Way Hash Functions from the Subset Sum Assumption.",
                    "An Algorithm to Solve the Discrete Logarithm Problem with the Number Field Sieve.",
                    "Efficient Scalar Multiplication by Isogeny Decompositions.",
                    "Curve25519: New Diffie-Hellman Speed Records.",
                    "Strongly Unforgeable Signatures Based on Computational Diffie-Hellman.",
                    "Generalization of the Selective-ID Security Model for HIBE Protocols.",
                    "Identity-Based Aggregate Signatures.",
                    "On the Limitations of the Spread of an IBE-to-PKE Transformation.",
                    "Inoculating Multivariate Schemes Against Differential Attacks.",
                    "Random Subgroups of Braid Groups: An Approach to Cryptanalysis of a Braid Group Based Cryptographic Protocol.",
                    "High-Order Attacks Against the Exponent Splitting Protection.",
                    "New Online/Offline Signature Schemes Without Random Oracles.",
                    "Anonymous Signature Schemes.",
                    "The Power of Identification Schemes.",
                    "Security Analysis of KEA Authenticated Key Exchange Protocol.",
                    "SAS-Based Authenticated Key Agreement.",
                    "The Twist-AUgmented Technique for Key Exchange.",
                    "Password-Based Group Key Exchange in a Constant Number of Rounds.",
                    "Conditional Oblivious Cast.",
                    "Efficiency Tradeoffs for Malicious Two-Party Computation.",
                    "On Constructing Certificateless Cryptosystems from Identity Based Encryption.",
                    "Building Better Signcryption Schemes with Tag-KEMs.",
                    "Security-Mediated Certificateless Cryptography.",
                    "k-Times Anonymous Authentication with a Constant Proving Cost."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8th PKC 2005",
        "info": "Les Diablerets, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2005",
                "sub_name": "Public Key Cryptography - PKC 2005, 8th International Workshop on Theory and Practice in Public Key Cryptography, Les Diablerets, Switzerland, January 23-26, 2005, Proceedings.",
                "count": 28,
                "papers": [
                    "A New Related Message Attack on RSA.",
                    "Breaking a Cryptographic Protocol with Pseudoprimes.",
                    "Experimenting with Faults, Lattices and the DSA.",
                    "Securing RSA-KEM via the AES.",
                    "One-Time Verifier-Based Encrypted Key Exchange.",
                    "Password-Based Authenticated Key Exchange in the Three-Party Setting.",
                    "On the Optimization of Side-Channel Attacks by Advanced Stochastic Methods.",
                    "Symmetric Subgroup Membership Problems.",
                    "Optimizing Robustness While Generating Shared Secret Safe Primes.",
                    "Fast Multi-computations with Integer Similarity Strategy.",
                    "Efficient Proofs of Knowledge of Discrete Logarithms and Representations in Groups with Hidden Order.",
                    "Efficient k-Out-of-n Oblivious Transfer Schemes with Adaptive and Non-adaptive Queries.",
                    "Converse Results to the Wiener Attack on RSA.",
                    "RSA with Balanced Short Exponents and Its Application to Entity Authentication.",
                    "The Sampling Twice Technique for the RSA-Based Cryptosystems with Anonymity.",
                    "From Fixed-Length to Arbitrary-Length RSA Encoding Schemes Revisited.",
                    "Tractable Rational Map Signature.",
                    "Cryptanalysis of the Tractable Rational Map Cryptosystem.",
                    "Large Superfluous Keys in Multivariate Quadratic Asymmetric Systems.",
                    "Cryptanalysis of HFEv and Internal Perturbation of HFE.",
                    "A Generic Scheme Based on Trapdoor One-Way Permutations with Signatures as Short as Possible.",
                    "Cramer-Damgård Signatures Revisited: Efficient Flat-Tree Signatures Based on Factoring.",
                    "The Security of the FDH Variant of Chaum's Undeniable Signature Scheme.",
                    "Efficient Threshold RSA Signatures with General Moduli and No Extra Assumptions.",
                    "Improved Identity-Based Signcryption.",
                    "Efficient Multi-receiver Identity-Based Encryption and Its Application to Broadcast Encryption.",
                    "CBE from CL-PKE: A Generic Construction and Efficient Schemes.",
                    "A Verifiable Random Function with Short Proofs and Keys."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "7th PKC 2004",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2004",
                "sub_name": "Public Key Cryptography - PKC 2004, 7th International Workshop on Theory and Practice in Public Key Cryptography, Singapore, March 1-4, 2004.",
                "count": 32,
                "papers": [
                    "A Generalized Wiener Attack on RSA.",
                    "Cryptanalysis of a Public-Key Encryption Scheme Based on the Polynomial Reconstruction Problem.",
                    "Faster Scalar Multiplication on Koblitz Curves Combining Point Halving with the Frobenius Endomorphism.",
                    "Application of Montgomery's Trick to Scalar Multiplication for Elliptic and Hyperelliptic Curves Using a Fixed Base Point.",
                    "Fast Arithmetic on Jacobians of Picard Curves.",
                    "Undeniable Signatures Based on Characters: How to Sign with One Bit.",
                    "Efficient Extension of Standard Schnorr/RSA Signatures into Universal Designated-Verifier Signatures.",
                    "Constructing Committed Signatures from Strong-RSA Assumption in the Standard Complexity Model.",
                    "Constant Round Authenticated Group Key Agreement via Distributed Computation.",
                    "Efficient ID-based Group Key Agreement with Bilinear Maps.",
                    "New Security Results on Encrypted Key Exchange.",
                    "New Results on the Hardness of Diffie-Hellman Bits.",
                    "Short Exponent Diffie-Hellman Problems.",
                    "Efficient Signcryption with Key Privacy from Gap Diffie-Hellman Groups.",
                    "Algebraic Attacks over GF(2k), Application to HFE Challenge 2 and Sflash-v2.",
                    "Secret Exponent Attacks on RSA-type Schemes with Moduli N= prq.",
                    "General Group Authentication Codes and Their Relation to \"Unconditionally-Secure Signatures\".",
                    "From Digital Signature to ID-based Identification/Signature.",
                    "Identity-Based Threshold Decryption.",
                    "An Efficient Signature Scheme from Bilinear Pairings and Its Applications.",
                    "An RSA Family of Trap-Door Permutations with a Common Domain and Its Applications.",
                    "A New Variant of the Matsumoto-Imai Cryptosystem through Perturbation.",
                    "Efficient, Verifiable Shuffle Decryption and Its Requirement of Unlinkability.",
                    "A Point Compression Method for Elliptic Curves Defined over GF(2 n).",
                    "On the Optimal Parameter Choice for Elliptic Curve Cryptosystems Using Isogeny.",
                    "On the Security of Multiple Encryption or CCA-security+CCA-security=CCA-security?",
                    "QuasiModo: Efficient Certificate Validation and Revocation.",
                    "A Distributed Online Certificate Status Protocol with a Single Public Key.",
                    "A First Approach to Provide Anonymity in Attribute Certificates.",
                    "A Nonuniform Algorithm for the Hidden Number Problem in Subgroups.",
                    "Cryptographic Randomized Response Techniques.",
                    "A Correct, Private, and Efficient Mix Network."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "6th PKC 2003",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2003",
                "sub_name": "Public Key Cryptography - PKC 2003, 6th International Workshop on Theory and Practice in Public Key Cryptography, Miami, FL, USA, January 6-8, 2003, Proceedings.",
                "count": 26,
                "papers": [
                    "Efficient Construction of (Distributed) Verifiable Random Functions.",
                    "An Identity-Based Signature from Gap Diffie-Hellman Groups.",
                    "Threshold Signatures, Multisignatures and Blind Signatures Based on the Gap-Diffie-Hellman-Group Signature Scheme.",
                    "An Efficient Two-Party Public Key Cryptosystem Secure against Adaptive Chosen Ciphertext Attack.",
                    "On the Bit Security of NTRUEncrypt.",
                    "Equivalence between Semantic Security and Indistinguishability against Chosen Ciphertext Attacks.",
                    "Randomness Re-use in Multi-recipient Encryption Schemeas.",
                    "Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack.",
                    "The Cramer-Shoup Strong-RSASignature Scheme Revisited.",
                    "Strong Key-Insulated Signature Schemes.",
                    "A Verifiable Secret Shuffle of Homomorphic Encryptions.",
                    "Round-Optimal Contributory Conference Key Agreement.",
                    "Security Analysis of the MOR Cryptosystem.",
                    "A Practical Attack on Some Braid Group Based Cryptographic Primitives.",
                    "A Refined Power-Analysis Attack on Elliptic Curve Cryptosystems.",
                    "Validation of Elliptic Curve Public Keys.",
                    "Exceptional Procedure Attack on Elliptic Curve Cryptosystems.",
                    "On Montgomery-Like Representationsfor Elliptic Curves over GF(2k).",
                    "A Dedicated Sieving Hardware.",
                    "A Fast and Secure Implementation of Sflash.",
                    "A Practical Public Key Cryptosystem from Paillier and Rabin Schemes.",
                    "A Lattice Based Public Key Cryptosystem Using Polynomial Representations.",
                    "The Security of DSA and ECDSA.",
                    "Side-Channel Attacks on Textbook RSA and ElGamal Encryption.",
                    "On the Security of HFE, HFEv- and Quartz.",
                    "Generic Attacks and the Security of Quartz."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th PKC 2002",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2002",
                "sub_name": "Public Key Cryptography, 5th International Workshop on Practice and Theory in Public Key Cryptosystems, PKC 2002, Paris, France, February 12-14, 2002, Proceedings.",
                "count": 27,
                "papers": [
                    "New Semantically Secure Public-Key Cryptosystems from the RSA-Primitive.",
                    "Optimal Chosen-Ciphertext Secure Encryption of Arbitrary-Length Messages.",
                    "On Sufficient Randomness for Secure Public-Key Cryptosystems.",
                    "Multi-recipient Public-Key Encryption with Shortened Ciphertext.",
                    "Efficient and Unconditionally Secure Digital Signatures and a Security Analysis of a Multireceiver Authentication Code.",
                    "Formal Proofs for the Security of Signcryption.",
                    "A Provably Secure Restrictive Partially Blind Signature Scheme.",
                    "M+1-st Price Auction Using Homomorphic Encryption.",
                    "Client/Server Tradeoffs for Online Elections.",
                    "Self-tallying Elections and Perfect Ballot Secrecy.",
                    "Efficient 1-Out-n Oblivious Transfer Schemes.",
                    "Linear Code Implies Public-Key Traitor Tracing.",
                    "Design and Security Analysis of Anonymous Group Identification Protocols.",
                    "On the Security of the Threshold Scheme Based on the Chinese Remainder Theorem.",
                    "Solving Underdefined Systems of Multivariate Quadratic Equations.",
                    "Selective Forgery of RSA Signatures with Fixed-Pattern Padding.",
                    "New Chosen-Plaintext Attacks on the One-Wayness of the Modified McEliece PKC Proposed at Asiacrypt 2000.",
                    "SPA-Based Adaptive Chosen-Ciphertext Attack on RSA Implementation.",
                    "A Combined Timing and Power Attack.",
                    "A Fast Parallel Elliptic Curve Multiplication Resistant against Side Channel Attacks.",
                    "New European Schemes for Signature, Integrity and Encryption (NESSIE): A Status Report.",
                    "An Improved Method of Multiplication on Certain Elliptic Curves.",
                    "An Alternate Decomposition of an Integer for Faster Point Multiplication on Certain Elliptic Curves.",
                    "Weierstraß Elliptic Curves and Side-Channel Attacks.",
                    "One-Way Cross-Trees and Their Applications.",
                    "RSA Key Generation with Verifiable Randomness.",
                    "New Minimal Modified Radix-r Representation with Applications to Smart Cards."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4th PKC 2001",
        "info": "Cheju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2001",
                "sub_name": "Public Key Cryptography, 4th International Workshop on Practice and Theory in Public Key Cryptography, PKC 2001, Cheju Island, Korea, February 13-15, 2001, Proceedings.",
                "count": 30,
                "papers": [
                    "On the Security of Williams Based Public Key Encryption Scheme.",
                    "Semantically Secure McEliece Public-Key Cryptosystems-Conversions for McEliece PKC.",
                    "IND-CCA Public Key Schemes Equivalent to Factoring n=pq.",
                    "Identification, Signature and Signcryption Using High Order Residues Modulo an RSA Composite.",
                    "On the Security of Lenstra's Variant of DSA without Long Inversions.",
                    "Fast Irreducibility and Subgroup Membership Testing in XTR.",
                    "A New Aspect for Security Notions: Secure Randomness in Public-Key Encryption Schemes.",
                    "The Gap-Problems: A New Class of Problems for the Security of Cryptographic Schemes.",
                    "A Generalisation, a Simplification and Some Applications of Paillier's Probabilistic Public-Key System.",
                    "Marking: A Privacy Protecting Approach Against Blackmailing.",
                    "Cryptanalysis of Two Sparse Polynomial Based Public Key Cryptosystems.",
                    "Cryptanalysis of PKP: A New Approach.",
                    "Cryptanalysis of a Digital Signature Scheme on ID-Based Key-Sharing Infrastructures.",
                    "Loopholes in Two Public Key Cryptosystems Using the Modular Group.",
                    "Efficient Revocation in Group Signatures.",
                    "A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares.",
                    "Efficient Asymmetric Self-Enforcement Scheme with Public Traceability.",
                    "Adaptive Security for the Additive-Sharing Based Proactive RSA.",
                    "Robust Forward-Secure Signature Schemes with Proactive Security.",
                    "Equitability in Retroactive Data Confiscation versus Proactive Key Escrow.",
                    "A PVSS as Hard as Discrete Log and Shareholder Separability.",
                    "One Round Threshold Discrete-Log Key Generation without Private Channels.",
                    "Remarks on Mix-Network Based on Permutation Networks.",
                    "New Key Recovery in WAKE Protocol.",
                    "Redundant Representation of Finite Fields.",
                    "Compact Encoding of Non-adjacent Forms with Applications to Elliptic Curve Cryptography.",
                    "Efficient Implementation of Elliptic Curve Cryptosystems on the TI MSP 430x33x Family of Microcontrollers.",
                    "Secure Server-Aided Signature Generation.",
                    "Efficient Long-Term Validation of Digital Signatures.",
                    "A Novel Systolic Architecture for Efficient RSA Implementation."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd PKC 2000",
        "info": "Melbourne, Victoria, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/2000",
                "sub_name": "Public Key Cryptography, Third International Workshop on Practice and Theory in Public Key Cryptography, PKC 2000, Melbourne, Victoria, Australia, January 18-20, 2000, Proceedings.",
                "count": 31,
                "papers": [
                    "A Practical and Secure-Fault-Tolerant Conferenc-Key Agreement Protocol.",
                    "An Efficient NICE-Schnorr-Type Signature Scheme.",
                    "Identification of Bad Signatures in Batches.",
                    "Some Remarks on a Fair Exchange Protocol.",
                    "Gaudry's Variant against Cab Curves.",
                    "An Identification Scheme Based on Sparse Polynomials.",
                    "A State-Based Model for Certificate Management Systems.",
                    "Confidence Valuation in a Public-Key Infrastructure Based on Uncertain Evidence.",
                    "The Composite Discrete Logarithm and Secure Authentication.",
                    "Chosen-Ciphertext Security for Any One-Way Cryptosystem.",
                    "Short Proofs of Knowledge for Factoring.",
                    "Secure and Practical Tree-Structure Signature Schemes Based on Discrete Logarithms.",
                    "All-or-Nothing Transform and Remotely Keyed Encription Protocols.",
                    "Security of Public Key Certificate Based Authentication Protocols.",
                    "Efficient Implementation of Schoof's Algorithm in Case of Characteristic 2.",
                    "Key Recovery in Third Generation Wireless Communication Systems.",
                    "Elliptic Curves with the Montgomery-Form and Their Cryptographic Applications.",
                    "Certificates of Recoverability with Scale Recovery Agent Security.",
                    "Design Validations for Discrete Logarithm Based Signature Schemes.",
                    "Optimally Efficient Accountable Time-Stamping.",
                    "\"Psyeudorandom Intermixing\": A Tool for Shared Cryptography.",
                    "RSA-Based Auto-recoverable Cryptosystems.",
                    "Efficient and Fresh Cerification.",
                    "Efficient Zero-Knowledge Proofs of Knowledge Without Intractability Assumptions.",
                    "Cryptographic Approaches to Provacy in Forensic DNA Databases.",
                    "Making Hash Functions From Block Ciphers Secure and Efficient by Using Convolutional Codes.",
                    "Fast Implementation of Elliptic Curve Arithmetic in GF(pn).",
                    "An Auction Protocol Which Hides Bids of Losers.",
                    "Forward Secrecy and Its Application to Future Mobile Communications Security.",
                    "Selecting Cryptographic Key Sizes.",
                    "A Structured ElGamal-Type Multisignature Scheme."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2nd PKC 1999",
        "info": "Kamakura, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/1999",
                "sub_name": "Public Key Cryptography, Second International Workshop on Practice and Theory in Public Key Cryptography, PKC '99, Kamakura, Japan, March 1-3, 1999, Proceedings.",
                "count": 25,
                "papers": [
                    "A New type of \"Magic Ink\" Signatures - Towards Transcript-Irrelevant Anonymity Revocation.",
                    "A New Aspect of Dual Basis for Efficient Field Arithmetic.",
                    "On the Security of Random Sources.",
                    "Anonymous Fingerprinting Based on Committed Oblivious Transfer.",
                    "How to Enhance the Security of Public-Key Encryption at Minimum Cost.",
                    "Encrypted Message Authentication by Firewalls.",
                    "A Relationship between One-Wayness and Correlation Intractability.",
                    "Message Recovery Fair Blind Signature.",
                    "On Quorum Controlled Asymmetric Proxy Re-encryption.",
                    "Mini-Cash: A Minimalistic Approach to E-Commerce.",
                    "Preserving Privacy in Distributed Delegation with Fast Certificates.",
                    "Unknown Key-Share Attacks on the Station-to-Station (STS) Protocol.",
                    "Toward Fair International Key Escrow.",
                    "How to Copyright a Function?",
                    "On the Security of RSA Screening.",
                    "The Effectiveness of Lattice Attacks Against Low-Exponent RSA.",
                    "A Trapdoor Permutation Equivalent to Factoring.",
                    "Low-Cost Double-Size Modular Exponentiation or How to Stretch Your Cryptoprocessor.",
                    "Evaluating Differential Fault Analysis of Unknown Cryptosystems.",
                    "Removing Interoperability Barriers Between the X.509 and EDIFACT Public Key Infrastructures: The DEDICA Project.",
                    "Hash Functions and the MAC Using All-or-Nothing Property.",
                    "Decision Oracles are Equivalent to Matching Oracles.",
                    "Shared Generation of Random Number with Timestamp: How to Cope with the Leakage of the CA's Secret.",
                    "Auto-Recoverable Cryptosystems with Faster Initialization and the Escrow Hierarchy.",
                    "A Secure Pay-per View Scheme for Web-Based Video Service."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "1st PKC 1998",
        "info": "Pacifico Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pkc/1998",
                "sub_name": "Public Key Cryptography, First International Workshop on Practice and Theory in Public Key Cryptography, PKC '98, Pacifico Yokohama, Japan, February 5-6, 1998, Proceedings.",
                "count": 22,
                "papers": [
                    "Distributed Public Key Cryptosystems.",
                    "How (not) to Design RSA Signature Schemes.",
                    "Overview of Elliptic Curve Cryptography.",
                    "Lattices and Cryptography: An Overview.",
                    "A Signcryption Scheme with Signature Directly Verifiable by Public Key.",
                    "Guaranteed Correct Sharing of Integer Factorization with Off-Line Shareholders.",
                    "Lower Bounds on Term-Based Divisible Cash Systems.",
                    "Certifying Trust.",
                    "On the Security of Server-Aided RSA Protocols.",
                    "On the Security of ElGamal Based Encryption.",
                    "An Authenticated Diffie-Hellman Key Agreement Protocol Secure Against Active Attacks.",
                    "On the Security of Girault's Identification Scheme.",
                    "A Scheme for Obtaining a Message from the Digital Multisignature.",
                    "Secure Hyperelliptic Cryptosystems and Their Performances.",
                    "A Practical Implementation of Elliptic Curve Cryptosystems over GF(p) on a 16-bit Microcomputer.",
                    "Two Efficient Algorithms for Arithmetic of Elliptic Curves Using Frobenius Map.",
                    "Public-Key Cryptosystems Using the Modular Group.",
                    "A Cellular Automaton Based Fast One-Way Hash Function Suitable for Hardware Implementation.",
                    "A New Hash Function Based on MDx-Family and Its Application to MAC.",
                    "Security Issues for Contactless Smart Cards.",
                    "Parameters for Secure Elliptic Curve Cryptosystem - Improvements on Schoof's Algorithm.",
                    "A Note on the Complexity of Breaking Okamoto-Tanaka ID-Based Key Exchange Scheme."
                ]
            }
        ]
    }
]