[
	{
		"year": "2021",
		"name": "42nd S&P 2021",
		"info": "San Francisco, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2021",
				"sub_name": "42nd IEEE Symposium on Security and Privacy, SP 2021, San Francisco, CA, USA, 24-27 May 2021.",
				"count": 114,
				"papers": [
					"Using Selective Memoization to Defeat Regular Expression Denial of Service (ReDoS).",
					"Co-Inflow: Coarse-grained Information Flow Control for Java-like Languages.",
					"When Function Signature Recovery Meets Compiler Optimization.",
					"How Did That Get In My Phone? Unwanted App Distribution on Android Devices.",
					"Android Custom Permissions Demystified: From Privilege Escalation to Design Shortcomings.",
					"Trust, But Verify: A Longitudinal Analysis Of Android OEM Compliance and Customization.",
					"Detecting AI Trojans Using Meta Neural Analysis.",
					"Adversarial Watermarking Transformer: Towards Tracing Text Provenance with Data Hiding.",
					"Machine Unlearning.",
					"Poltergeist: Acoustic Adversarial Machine Learning against Cameras and Computer Vision.",
					"Invisible for both Camera and LiDAR: Security of Multi-Sensor Fusion based Perception in Autonomous Driving Under Physical-World Attacks.",
					"CANNON: Reliable and Stealthy Remote Shutdown Attacks via Unaltered Automotive Microcontrollers.",
					"SoK: Quantifying Cyber Risk.",
					"Self-Supervised Euphemism Detection and Identification for Content Moderation.",
					"SoK: Hate, Harassment, and the Changing Landscape of Online Abuse.",
					"Keep the Dirt: Tainted TreeKEM, Adaptively and Actively Secure Continuous Group Key Agreement.",
					"Merkle2: A Low-Latency Transparency Log System.",
					"Post-quantum WireGuard.",
					"Invisible Probe: Timing Attacks with PCIe Congestion Side-channel.",
					"CacheOut: Leaking Data on Intel CPUs via Cache Evictions.",
					"PLATYPUS: Software-based Power Side-Channel Attacks on x86.",
					"Defensive Technology Use by Political Activists During the Sudanese Revolution.",
					"DP-Sniper: Black-Box Discovery of Differential Privacy Violations using Classifiers.",
					"Is Private Learning Possible with Instance Encoding?",
					"High-Frequency Trading on Decentralized On-Chain Exchanges.",
					"Ebb-and-Flow Protocols: A Resolution of the Availability-Finality Dilemma.",
					"Red Belly: A Secure, Fair and Scalable Open Blockchain.",
					"Diane: Identifying Fuzzing Triggers in Apps to Generate Under-constrained Inputs for IoT Devices.",
					"Data Privacy in Trigger-Action Systems.",
					"Which Privacy and Security Attributes Most Impact Consumers' Risk Perception and Willingness to Purchase IoT Devices?",
					"An Interactive Prover for Protocol Verification in the Computational Model.",
					"SmartPulse: Automated Checking of Temporal Properties in Smart Contracts.",
					"An I/O Separation Model for Formal Verification of Kernel Implementations.",
					"Diogenes: Lightweight Scalable RSA Modulus Generation with a Dishonest Majority.",
					"Refresh When You Wake Up: Proactive Threshold Wallets with Offline Devices.",
					"Compact Certificates of Collective Knowledge.",
					"One Engine to Fuzz 'em All: Generic Language Processor Testing with Semantic Validation.",
					"StochFuzz: Sound and Cost-effective Fuzzing of Stripped Binaries by Incremental and Stochastic Rewriting.",
					"NtFuzz: Enabling Type-Aware Kernel Fuzzing on Windows with Static Binary Analysis.",
					"Who is Real Bob? Adversarial Attacks on Speaker Recognition Systems.",
					"Hear \"No Evil\", See \"Kenansville\"*: Efficient and Transferable Black-Box Attacks on Speech Recognition and Voice Identification Systems.",
					"SoK: The Faults in our ASRs: An Overview of Attacks against Automatic Speech Recognition and Speaker Identification Systems.",
					"Cross-Domain Access Control Encryption: Arbitrary-policy, Constant-size, Efficient.",
					"Lightweight Techniques for Private Heavy Hitters.",
					"SoK: Computer-Aided Cryptography.",
					"ConDySTA: Context-Aware Dynamic Supplement to Static Taint Analysis.",
					"OSPREY: Recovery of Variable and Data Structure via Probabilistic Analysis for Stripped Binary.",
					"SoK: All You Ever Wanted to Know About x86/x64 Binary Disassembly But Were Afraid to Ask.",
					"Learning Differentially Private Mechanisms.",
					"Adversary Instantiation: Lower Bounds for Differentially Private Machine Learning.",
					"Manipulation Attacks in Local Differential Privacy.",
					"Bitcoin-Compatible Virtual Channels.",
					"On the Just-In-Time Discovery of Profit-Generating Transactions in DeFi Protocols.",
					"Lockable Signatures for Blockchains: Scriptless Scripts for All Signatures.",
					"Randomized Last-Level Caches Are Still Vulnerable to Cache Side-Channel Attacks! But We Can Fix It.",
					"Bomberman: Defining and Defeating Hardware Ticking Timebombs at Design-time.",
					"Systematic Analysis of Randomization-based Protected Cache Architectures.",
					"SiRnn: A Math Library for Secure RNN Inference.",
					"CryptGPU: Fast Privacy-Preserving Machine Learning on the GPU.",
					"Proof-of-Learning: Definitions and Practice.",
					"PEGASUS: Bridging Polynomial and Non-polynomial Evaluations in Homomorphic Encryption.",
					"Wolverine: Fast, Scalable, and Communication-Efficient Zero-Knowledge Proofs for Boolean and Arithmetic Circuits.",
					"SoK: Fully Homomorphic Encryption Compilers.",
					"CrawlPhish: Large-scale Analysis of Client-side Cloaking Techniques in Phishing.",
					"Black Widow: Blackbox Data-driven Web Scanning.",
					"Fingerprinting the Fingerprinters: Learning to Detect Browser Fingerprinting Behaviors.",
					"A Security Model and Fully Verified Implementation for the IETF QUIC Record Layer.",
					"Cross Layer Attacks and How to Use Them (for DNS Cache Poisoning, Device Tracking and More).",
					"Bookworm Game: Automatic Discovery of LTE Vulnerabilities Through Documentation Analysis.",
					"SGUARD: Towards Fixing Vulnerable Smart Contracts Automatically.",
					"MAD-HTLC: Because HTLC is Crazy-Cheap to Attack.",
					"Compositional Security for Reentrant Applications.",
					"HackEd: A Pedagogical Analysis of Online Vulnerability Discovery Exercises.",
					"DifuzzRTL: Differential Fuzz Testing to Find CPU Bugs.",
					"When LoRa Meets EMR: Electromagnetic Covert Channels Can Be Super Resilient.",
					"Linking Bluetooth LE & Classic and Implications for Privacy-Preserving Bluetooth-Based Protocols.",
					"Method Confusion Attack on Bluetooth Pairing.",
					"CanDID: Can-Do Decentralized Identity with Legacy Compatibility, Sybil-Resistance, and Accountability.",
					"They Would do Better if They Worked Together: The Case of Interaction Problems Between Password Managers and Websites.",
					"Improving Password Guessing via Representation Learning.",
					"ARBITRAR: User-Guided API Misuse Detection.",
					"Compositional Non-Interference for Fine-Grained Concurrent Programs.",
					"SoK: Security and Privacy in the Age of Commercial Drones.",
					"A First Look at Zoombombing.",
					"Revealer: Detecting and Exploiting Regular Expression Denial-of-Service Vulnerabilities.",
					"Breaking the Specification: PDF Certification.",
					"Response-Hiding Encrypted Ranges: Revisiting Security via Parametrized Leakage-Abuse Attacks.",
					"A Decentralized and Encrypted National Gun Registry.",
					"Zero Knowledge for Everything and Everyone: Fast ZK Processor with Cached ORAM for ANSI C Programs.",
					"Survivalism: Systematic Analysis of Windows Malware Living-Off-The-Land.",
					"Runtime Recovery of Web Applications under Zero-Day ReDoS Attacks.",
					"Good Bot, Bad Bot: Characterizing Automated Browsing Activity.",
					"Trouble Over-The-Air: An Analysis of FOTA Apps in the Android Ecosystem.",
					"Doing good by fighting fraud: Ethical anti-fraud systems for mobile payments.",
					"Happer: Unpacking Android Apps via a Hardware-Assisted Approach.",
					"The Provable Security of Ed25519: Theory and Practice.",
					"Epochal Signatures for Deniable Group Chats.",
					"BUFFing signature schemes beyond unforgeability and the case of post-quantum signatures.",
					"Detecting Filter List Evasion with Event-Loop-Turn Granularity JavaScript Signatures.",
					"Reading Between the Lines: An Extensive Evaluation of the Security and Privacy Implications of EPUB Reading Systems.",
					"Did you mix me? Formally Verifying Verifiable Mix Nets in Electronic Voting.",
					"The EMV Standard: Break, Fix, Verify.",
					"A Secure and Formally Verified Linux KVM Hypervisor.",
					"Many-out-of-Many Proofs and Applications to Anonymous Zether.",
					"On the Anonymity Guarantees of Anonymous Proof-of-Stake Protocols.",
					"A2L: Anonymous Atomic Locks for Scalability in Payment Channel Hubs.",
					"CrossTalk: Speculative Data Leaks Across Cores Are Real.",
					"Hardware-Software Contracts for Secure Speculation.",
					"High-Assurance Cryptography in the Spectre Era.",
					"A Novel Dynamic Analysis Infrastructure to Instrument Untrusted Execution Flow Across User-Kernel Spaces.",
					"DynPTA: Combining Static and Dynamic Analysis for Practical Selective Data Protection.",
					"DICE: Automatic Emulation of DMA Input Channels for Dynamic Firmware Analysis.",
					"Real-World Snapshots vs. Theory: Questioning the t-Probing Security Model.",
					"CRYLOGGER: Detecting Crypto Misuses Dynamically."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2021w",
				"sub_name": "IEEE Security and Privacy Workshops, SP Workshops 2021, San Francisco, CA, USA, May 27, 2021.",
				"count": 58,
				"papers": [
					"Message from the General Chair.",
					"Discovering and Measuring Malicious URL Redirection Campaigns from Fake News Domains.",
					"Troubleshooting an Intrusion Detection Dataset: the CICIDS2017 Case Study.",
					"Training regime influences to semi-supervised learning for insider threat detection.",
					"Examining traffic microstructures to improve model development.",
					"On the feasibility of short-lived dynamic onion services.",
					"AMon: A Monitoring Multidimensional Feature Application to Secure Android Environments.",
					"DPI Solutions in Practice: Benchmark and Comparison.",
					"Revisiting the Pervasiveness of Weak Keys in Network Devices.",
					"Innocent Until Proven Guilty (IUPG): Building Deep Learning Models with Embedded Robustness to Out-Of-Distribution Content.",
					"SAFELearn: Secure Aggregation for private FEderated Learning.",
					"Applying Deep Learning to Combat Mass Robocalls.",
					"MMGuard: Automatically Protecting On-Device Deep Learning Models in Android Apps.",
					"BODMAS: An Open Dataset for Learning based Temporal Analysis of PE Malware.",
					"Binary Black-Box Attacks Against Static Malware Detectors with Reinforcement Learning in Discrete Action Spaces.",
					"Verbatim: A Verified Lexer Generator.",
					"Formal Language Theory for Practical Security - Extended Abstract -.",
					"Formal Synthesis of Filter Components for Use in Security-Enhancing Architectural Transformations.",
					"Research Report: Building a File Observatory for Secure Parser Development.",
					"Research Report: Parsing PEGs with Length Fields in Software and Hardware.",
					"Formal Languages, Deep Learning, Topology and AlgebraicWord Problems.",
					"Accessible Formal Methods for Verified Parser Development.",
					"Differential analysis of x86-64 instruction decoders.",
					"Bohemia - A Validator for Parser Frameworks.",
					"RL-GRIT: Reinforcement Learning for Grammar Inference.",
					"Looking for non-compliant documents using error messages from multiple parsers.",
					"Mechanized Type Safety for Gradual Information Flow.",
					"Alexa in Phishingland: Empirical Assessment of Susceptibility to Phishing Pretexting in Voice Assistant Environments.",
					"BLEKeeper: Response Time Behavior Based Man-In-The-Middle Attack Detection.",
					"LIRA-V: Lightweight Remote Attestation for Constrained RISC-V Devices.",
					"HybriDiagnostics: Evaluating Security Issues in Hybrid SmartHome Companion Apps.",
					"On the Safety Implications of Misordered Events and Commands in IoT Systems.",
					"Demo: Attacking Multi-Sensor Fusion based Localization in High-Level Autonomous Driving.",
					"Demo: Security of Camera-based Perception for Autonomous Driving under Adversarial Attack.",
					"Demo: Security of Deep Learning based Automated Lane Centering under Physical-World Attack.",
					"Demo: ROI Attacks on Traffic Light Detection in High-Level Autonomous Driving.",
					"A Containerization-Based Backfit Approach for Industrial Control System Resiliency.",
					"HIOA-CPS: Combining Hybrid Input-Output Automaton and Game Theory for Security Modeling of Cyber-Physical Systems.",
					"Protecting IoT Devices through Localized Detection of BGP Hijacks for Individual Things.",
					"Egocentric abstractions for modeling and safety verification of distributed cyber-physical systems.",
					"DeepFake-o-meter: An Open Platform for DeepFake Detection.",
					"User Identification in Dynamic Web Traffic via Deep Temporal Features.",
					"Nomen est Omen - The Role of Signatures in Ascribing Email Author Identity with Transformer Neural Networks.",
					"Protected Process Light is not Protected: MemoryRanger Fills The Gap Again.",
					"Machine Learning Based Approach for the Automated Mapping of Discovered Vulnerabilities to Adversial Tactics.",
					"Forensic Analysis of Fitbit Versa: Android vs iOS.",
					"BADUSB-C: Revisiting BadUSB with Type-C.",
					"BlueMirror: Reflections on Bluetooth Pairing and Provisioning Protocols.",
					"An In-memory Embedding of CPython for Offensive Use.",
					"Evaluation of the Executional Power in Windows using Return Oriented Programming.",
					"Identifying Valuable Pointers in Heap Data.",
					"Empirical Study of PLC Authentication Protocols in Industrial Control Systems.",
					"Your Censor is My Censor: Weaponizing Censorship Infrastructure for Availability Attacks.",
					"Zero Conf Protocols and their numerous Man in the Middle (MITM) Attacks.",
					"A Low-Cost Attack against the hCaptcha System.",
					"The Remote on the Local: Exacerbating Web Attacks Via Service Workers Caches.",
					"SEVerity: Code Injection Attacks against Encrypted Virtual Machines.",
					"undeSErVed trust: Exploiting Permutation-Agnostic Remote Attestation."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "41st S&P 2020",
		"info": "San Francisco, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2020",
				"sub_name": "2020 IEEE Symposium on Security and Privacy, SP 2020, San Francisco, CA, USA, May 18-21, 2020.",
				"count": 104,
				"papers": [
					"Spectector: Principled Detection of Speculative Information Flows.",
					": Practical Cache Attacks from the Network.",
					"SpecCFI: Mitigating Spectre Attacks using CFI Informed Speculation.",
					"LVI: Hijacking Transient Execution through Microarchitectural Load Value Injection.",
					"HydRand: Efficient Continuous Distributed Randomness.",
					"OHIE: Blockchain Scaling Made Simple.",
					"Sync HotStuff: Simple and Practical Synchronous State Machine Replication.",
					"Replicated state machines without replicated execution.",
					"ICLab: A Global, Longitudinal Internet Censorship Measurement Platform.",
					"High Precision Open-World Website Fingerprinting.",
					"Breaking and (Partially) Fixing Provably Secure Onion Routing.",
					"Are anonymity-seekers just like everybody else? An analysis of contributions to Wikipedia from Tor.",
					"Detection of Electromagnetic Interference Attacks on Sensor Systems.",
					"WaveSpy: Remote and Through-wall Screen Attack via mmWave Sensing.",
					"SoK: A Minimalist Approach to Formalizing Analog Sensor Security.",
					"Gesture Authentication for Smartphones: Evaluation of Gesture Password Selection Policies.",
					"Is FIDO2 the Kingslayer of User Authentication? A Comparative Usability Study of FIDO2 Passwordless Authentication.",
					"This PIN Can Be Easily Guessed: Analyzing the Security of Smartphone Unlock PINs.",
					"The Value of Collaboration in Convex Machine Learning with Differential Privacy.",
					"Automatically Detecting Bystanders in Photos to Reduce Privacy Risks.",
					"CrypTFlow: Secure TensorFlow Inference.",
					"SoK: Differential Privacy as a Causal Property.",
					"Private resource allocators and their applications.",
					"Towards Effective Differential Privacy Communication for Users' Data Sharing Decision and Comprehension.",
					"A Programming Framework for Differential Privacy with Accuracy Concentration Bounds.",
					"Security Update Labels: Establishing Economic Incentives for Security Patching of IoT Consumer Products.",
					"Ask the Experts: What Should Be on an IoT Privacy and Security Label?",
					"Burglars' IoT Paradise: Understanding and Mitigating Security Risks of General Messaging Protocols on IoT Clouds.",
					"Towards a Natural Perspective of Smart Homes for Practical Security and Safety Analyses.",
					"Message Time of Arrival Codes: A Fundamental Primitive for Secure Distance Measurement.",
					"Dragonblood: Analyzing the Dragonfly Handshake of WPA3 and EAP-pwd.",
					"Even Black Cats Cannot Stay Hidden in the Dark: Full-band De-anonymization of Bluetooth Classic Devices.",
					"BIAS: Bluetooth Impersonation AttackS.",
					"xMP: Selective Memory Protection for Kernel and User Space.",
					"MarkUs: Drop-in use-after-free prevention for low-level languages.",
					"SEIMI: Efficient and Secure SMAP-Enabled Intra-process Memory Isolation.",
					"Cornucopia: Temporal Safety for CHERI Heaps.",
					"The Many Kinds of Creepware Used for Interpersonal Attacks.",
					"How not to prove your election outcome.",
					"A Security Analysis of the Facebook Ad Library.",
					"Can Voters Detect Malicious Manipulation of Ballot Marking Devices?",
					"RAMBleed: Reading Bits in Memory Without Accessing Them.",
					"Are We Susceptible to Rowhammer? An End-to-End Methodology for Cloud Providers.",
					"Leveraging EM Side-Channel Information to Detect Rowhammer Attacks.",
					"TRRespass: Exploiting the Many Sides of Target Row Refresh.",
					"AdGraph: A Graph-Based Approach to Ad and Tracker Blocking.",
					"Browsing Unicity: On the Limits of Anonymizing Web Tracking Data.",
					"Do Cookie Banners Respect my Choice? : Measuring Legal Compliance of Banners from IAB Europe's Transparency and Consent Framework.",
					"Meddling Middlemen: Empirical Analysis of the Risks of Data-Saving Mobile Browsers.",
					"Efficient and Secure Multiparty Computation from Fixed-Key Block Ciphers.",
					"Path Oblivious Heap: Optimal and Practical Oblivious Priority Queue.",
					"Transparent Polynomial Delegation and Its Applications to Zero Knowledge Proof.",
					"Towards Scalable Threshold Cryptosystems.",
					"A Stealthier Partitioning Attack against Bitcoin Peer-to-Peer Network.",
					"Flash Boys 2.0: Frontrunning in Decentralized Exchanges, Miner Extractable Value, and Consensus Instability.",
					"FlyClient: Super-Light Clients for Cryptocurrencies.",
					"ZEXE: Enabling Decentralized Private Computation.",
					"The Last Mile: High-Assurance and High-Speed Cryptographic Implementations.",
					"EverCrypt: A Fast, Verified, Cross-Platform Cryptographic Provider.",
					"Rigorous engineering for hardware security: Formal modelling and proof in the CHERI design and implementation process.",
					"Binsec/Rel: Efficient Relational Symbolic Execution for Constant-Time at Binary-Level.",
					"An Analysis of Pre-installed Android Software.",
					"Kobold: Evaluating Decentralized Access Control for Remote NSXPC Methods on iOS.",
					"TextExerciser: Feedback-driven Text Input Exercising for Android Applications.",
					"Ex-vivo dynamic analysis framework for Android device drivers.",
					"Automatic Uncovering of Hidden Behaviors From Input Validation in Mobile Apps.",
					"PMP: Cost-effective Forced Execution with Probabilistic Memory Pre-planning.",
					"Combating Dependence Explosion in Forensic Analysis Using Alternative Tag Propagation Semantics.",
					"TARDIS: Rolling Back The Clock On CMS-Targeting Cyber Attacks.",
					"Tactical Provenance Analysis for Endpoint Detection and Response Systems.",
					"Throwing Darts in the Dark? Detecting Bots with Limited Data using Neural Data Augmentation.",
					"JIT Leaks: Inducing Timing Side Channels through Just-In-Time Compilation.",
					"The State of the Uniform: Attacks on Encrypted Databases Beyond the Uniform Query Distribution.",
					"Pseudorandom Black Swans: Cache Attacks on CTR_DRBG.",
					"Flaw Label: Exploiting IPv6 Flow Label.",
					"HopSkipJumpAttack: A Query-Efficient Decision-Based Attack.",
					"Humpty Dumpty: Controlling Word Meanings via Corpus Poisoning.",
					"Privacy Risks of General-Purpose Language Models.",
					"Intriguing Properties of Adversarial ML Attacks in the Problem Space.",
					"Influencing Photo Sharing Decisions on Social Media: A Case of Paradoxical Findings.",
					"SoK: Cyber Insurance - Technical Challenges and a System Security Roadmap.",
					"A Tale of Sea and Sky On the Security of Maritime VSAT Communications.",
					"I Know Where You Parked Last Summer : Automated Reverse Engineering and Privacy Analysis of Modern Cars.",
					"SoK: Understanding the Prevailing Security Vulnerabilities in TrustZone-assisted TEE Systems.",
					"OAT: Attesting Operation Integrity of Embedded Devices.",
					"Enabling Rack-scale Confidential Computing using Heterogeneous Trusted Execution Environment.",
					"Plundervolt: Software-based Fault Injection Attacks against Intel SGX.",
					"SEVurity: No Security Without Integrity : Breaking Integrity-Free Memory Encryption with Minimal Assumptions.",
					"RetroWrite: Statically Instrumenting COTS Binaries for Fuzzing and Sanitization.",
					"Unexpected Data Dependency Creation and Chaining: A New Attack to SDN.",
					"Neutaint: Efficient Dynamic Taint Analysis with Neural Networks.",
					"Karonte: Detecting Insecure Multi-binary Interactions in Embedded Firmware.",
					"SPIDER: Enabling Fast Patch Propagation In Related Software Repositories.",
					"SAVIOR: Towards Bug-Driven Hybrid Testing.",
					"Ijon: Exploring Deep State Spaces via Fuzzing.",
					"Pangolin: Incremental Hybrid Fuzzing with Polyhedral Path Abstraction.",
					"Fuzzing JavaScript Engines with Aspect-preserving Mutation.",
					"Krace: Data Race Fuzzing for Kernel File Systems.",
					"VerX: Safety Verification of Smart Contracts.",
					"VERISMART: A Highly Precise Safety Verifier for Ethereum Smart Contracts.",
					"Semantic Understanding of Smart Contracts: Executable Operational Semantics of Solidity.",
					"Transys: Leveraging Common Security Properties Across Hardware Designs.",
					"C3APSULe: Cross-FPGA Covert-Channel Attacks through Power Supply Unit Leakage.",
					"ICAS: an Extensible Framework for Estimating the Susceptibility of IC Layouts to Additive Trojans."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2020w",
				"sub_name": "2020 IEEE Security and Privacy Workshops, SP Workshops, San Francisco, CA, USA, May 21, 2020.",
				"count": 50,
				"papers": [
					"Learning from Context: A Multi-View Deep Learning Architecture for Malware Detection.",
					"Attributing and Detecting Fake Images Generated by Known GANs.",
					"Adversarial Attacks Against LipNet: End-to-End Sentence Level Lipreading.",
					"Detecting Cyber Threats in Non-English Hacker Forums: An Adversarial Cross-Lingual Knowledge Transfer Approach.",
					"RTA3: A Real Time Adversarial Attack on Recurrent Neural Networks.",
					"Minimum-Norm Adversarial Examples on KNN and KNN based Models.",
					"Backdooring and Poisoning Neural Networks with Image-Scaling Attacks.",
					"SentiNet: Detecting Localized Universal Attacks Against Deep Learning Systems.",
					"Clipped BagNet: Defending Against Sticker Attacks with Clipped Bag-of-features.",
					"On the Robustness of Cooperative Multi-Agent Reinforcement Learning.",
					"Adversarial Machine Learning-Industry Perspectives.",
					"A Case Study of the Security Vetting Process of Smart-home Assistant Applications.",
					"Privacy-preserving Continuous Tumour Relapse Monitoring Using In-body Radio Signals.",
					"On the Feasibility of Acoustic Attacks Using Commodity Smart Devices.",
					"Electromagnetic Sensor and Actuator Attacks on Power Converters for Electric Vehicles.",
					"Never Ending Story: Authentication and Access Control Design Flaws in Shared IoT Devices.",
					"On Using Camera-based Visible Light Communication for Security Protocols.",
					"Security Analysis of Networked 3D Printers.",
					"ELF Analyzer Demo: Online Identification for IoT Malwares with Multiple Hardware Architectures.",
					"Poster: Radiometric Signatures for Wireless Device Identification over Dynamic Channels.",
					"Assessment of Cyber Security Implications of New Technology Integrations into Military Supply Chains.",
					"Toward a Trustable, Self-Hosting Computer System.",
					"EM Fingerprints: Towards Identifying Unauthorized Hardware Substitutions in the Supply Chain Jungle.",
					"Binary Analysis with Architecture and Code Section Detection using Supervised Machine Learning.",
					"Identifying Ubiquitious Third-Party Libraries in Compiled Executables Using Annotated and Translated Disassembled Code with Supervised Machine Learning.",
					"Modeling and Assessment of IoT Supply Chain Security Risks: The Role of Structural and Parametric Uncertainties.",
					"On-Chip Randomization for Memory Protection Against Hardware Supply Chain Attacks to DRAM.",
					"Using Taint Analysis and Reinforcement Learning (TARL) to Repair Autonomous Robot Software.",
					"Partially Observable Games for Secure Autonomy.",
					"Case Study: Safety Verification of an Unmanned Underwater Vehicle.",
					"Automated Decision Systems for Cybersecurity and Infrastructure Security.",
					"A Non-Cooperative Game based Model for the Cybersecurity of Autonomous Systems.",
					"Detecting Adversarial Examples in Learning-Enabled Cyber-Physical Systems using Variational Autoencoder for Regression.",
					"A Smart City Internet for Autonomous Systems.",
					"Fooling A Deep-Learning Based Gait Behavioral Biometric System.",
					"Trusted Confidence Bounds for Learning Enabled Cyber-Physical Systems.",
					"A Framework for the Analysis of Deep Neural Networks in Autonomous Aerospace Applications using Bayesian Statistics.",
					"Towards an AI-Based After-Collision Forensic Analysis Protocol for Autonomous Vehicles.",
					"Mission Assurance for Autonomous Undersea Vehicles.",
					"Out-of-Distribution Detection in Multi-Label Datasets using Latent Space of β-VAE.",
					"A Capability for Autonomous IoT System Security: Pushing IoT Assurance to the Edge.",
					"A Privacy Filter Framework for Internet of Robotic Things Applications.",
					"Language-agnostic Injection Detection.",
					"Toward Automated Grammar Extraction via Semantic Labeling of Parser Implementations.",
					"The Geometry of Syntax and Semantics for Directed File Transformations.",
					"Armor Within: Defending Against Vulnerabilities in Third-Party Libraries.",
					"Research Report: The Parsley Data Format Definition Language.",
					"Research Report: Formally-Verified ASN.1 Protocol C-language Stack.",
					"Research Report: Building a Wide Reach Corpus for Secure Parser Development.",
					"Research Report: ICARUS: Understanding De Facto Formats by Way of Feathers and Wax."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "40th S&P 2019",
		"info": "San Francisco, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2019",
				"sub_name": "2019 IEEE Symposium on Security and Privacy, SP 2019, San Francisco, CA, USA, May 19-23, 2019.",
				"count": 84,
				"papers": [
					"Spectre Attacks: Exploiting Speculative Execution.",
					"SoK: The Challenges, Pitfalls, and Perils of Using Hardware Performance Counters for Security.",
					"Theory and Practice of Finding Eviction Sets.",
					"Exploiting Correcting Codes: On the Effectiveness of ECC Memory Against Rowhammer Attacks.",
					"Self-Encrypting Deception: Weaknesses in the Encryption of Solid State Drives.",
					"RIDL: Rogue In-Flight Data Load.",
					"Perun: Virtual Payment Hubs over Cryptocurrencies.",
					"Redactable Blockchain in the Permissionless Setting.",
					"Proof-of-Stake Sidechains.",
					"Ouroboros Crypsinous: Privacy-Preserving Proof-of-Stake.",
					"Lay Down the Common Metrics: Evaluating Proof-of-Work Consensus Protocols' Security.",
					"XCLAIM: Trustless, Interoperable, Cryptocurrency-Backed Assets.",
					"Does Certificate Transparency Break the Web? Measuring Adoption and Error Rate.",
					"EmPoWeb: Empowering Web Applications with Browser Extensions.",
					"\"If HTTPS Were Secure, I Wouldn't Need 2FA\" - End User and Administrator Mental Models of HTTPS.",
					"Fidelius: Protecting User Secrets from Compromised Browsers.",
					"Postcards from the Post-HTTP World: Amplification of HTTPS Vulnerabilities in the Web Ecosystem.",
					"Towards Practical Differentially Private Convex Optimization.",
					"PrivKV: Key-Value Data Collection with Local Differential Privacy.",
					"Differentially Private Model Publishing for Deep Learning.",
					"KHyperLogLog: Estimating Reidentifiability and Joinability of Large Data at Scale.",
					"Characterizing Pixel Tracking through the Lens of Disposable Email Services.",
					"Reasoning Analytically about Password-Cracking Software.",
					"True2F: Backdoor-Resistant Authentication Tokens.",
					"Beyond Credential Stuffing: Password Similarity Models Using Neural Networks.",
					"The 9 Lives of Bleichenbacher's CAT: New Cache ATtacks on TLS Implementations.",
					"An Extensive Formal Security Analysis of the OpenID Financial-Grade API.",
					"Asm2Vec: Boosting Static Representation Robustness for Binary Clone Search against Code Obfuscation and Compiler Optimization.",
					"Iodine: Fast Dynamic Taint Tracking Using Rollback-free Optimistic Hybrid Analysis.",
					"CaSym: Cache Aware Symbolic Execution for Side Channel Detection and Mitigation.",
					"Towards Automated Safety Vetting of PLC Code in Real-World Plants.",
					"Using Safety Properties to Generate Vulnerability Patches.",
					"Short Text, Large Effect: Measuring the Impact of User Reviews on Android App Security & Privacy.",
					"Demystifying Hidden Privacy Settings in Mobile Apps.",
					"Security of GPS/INS Based On-road Location Tracking Systems.",
					"Understanding the Security of ARM Debugging Features.",
					"Tap 'n Ghost: A Compilation of Novel Attack Techniques against Smartphone Touchscreens.",
					"SensorID: Sensor Calibration Fingerprinting for Smartphones.",
					"Certified Robustness to Adversarial Examples with Differential Privacy.",
					"DEEPSEC: A Uniform Platform for Security Analysis of Deep Learning Model.",
					"Exploiting Unintended Feature Leakage in Collaborative Learning.",
					"Neural Cleanse: Identifying and Mitigating Backdoor Attacks in Neural Networks.",
					"Helen: Maliciously Secure Coopetitive Learning for Linear Models.",
					"Comprehensive Privacy Analysis of Deep Learning: Passive and Active White-box Inference Attacks against Centralized and Federated Learning.",
					"Razzer: Finding Kernel Race Bugs through Fuzzing.",
					"ProFuzzer: On-the-fly Input Type Probing for Better Zero-Day Vulnerability Discovery.",
					"Full-Speed Fuzzing: Reducing Fuzzing Overhead through Coverage-Guided Tracing.",
					"NEUZZ: Efficient Fuzzing with Neural Program Smoothing.",
					"Fuzzing File Systems via Two-Dimensional Input Space Exploration.",
					"F-BLEAU: Fast Black-Box Leakage Estimation.",
					"Synesthesia: Detecting Screen Content via Remote Acoustic Side Channels.",
					"Port Contention for Fun and Profit.",
					"Attack Directories, Not Caches: Side Channel Attacks in a Non-Inclusive World.",
					"Hard Drive of Hearing: Disks that Eavesdrop with a Synthesized Microphone.",
					"\"Should I Worry?\" A Cross-Cultural Examination of Account Security Incident Response.",
					"Bitcoin vs. Bitcoin Cash: Coexistence or Downfall of Bitcoin Cash?",
					"Stealthy Porn: Understanding Real-World Adversarial Images for Illicit Online Promotion.",
					"LBM: A Security Framework for Peripherals within the Linux Kernel.",
					"SoK: Shining Light on Shadow Stacks.",
					"Kiss from a Rogue: Evaluating Detectability of Pay-at-the-Pump Card Skimmers.",
					"Blind Certificate Authorities.",
					"Data Recovery on Encrypted Databases with k-Nearest Neighbor Query Leakage.",
					"Threshold ECDSA from ECDSA Assumptions: The Multiparty Case.",
					"Learning to Reconstruct: Statistical Learning Theory and Encrypted Database Attacks.",
					"On the Security of Two-Round Multi-Signatures.",
					"New Primitives for Actively-Secure MPC over Rings with Applications to Private Machine Learning.",
					"Breaking LTE on Layer Two.",
					"HOLMES: Real-Time APT Detection through Correlation of Suspicious Information Flows.",
					"Touching the Untouchables: Dynamic Security Analysis of the LTE Control Plane.",
					"On the Feasibility of Rerouting-Based DDoS Defenses.",
					"Resident Evil: Understanding Residential IP Proxy as a Dark Service.",
					"Simple High-Level Code for Cryptographic Arithmetic - With Proofs, Without Compromises.",
					"SoK: General Purpose Compilers for Secure Multi-Party Computation.",
					"The Code That Never Ran: Modeling Attacks on Speculative Evaluation.",
					"Formally Verified Cryptographic Web Applications in WebAssembly.",
					"SoK: Sanitizing for Security.",
					"Why Does Your Data Leak? Uncovering the Data Leakage in Cloud from Mobile Apps.",
					"Measuring and Analyzing Search Engine Poisoning of Linguistic Collisions.",
					"How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples.",
					"PhishFarm: A Scalable Framework for Measuring the Effectiveness of Evasion Techniques against Browser Phishing Blacklists.",
					"SoK: Security Evaluation of Home-Based IoT Deployments.",
					"Dangerous Skills: Understanding and Mitigating Security Risks of Voice-Controlled Third-Party Functions on Virtual Personal Assistant Systems.",
					"Drones' Cryptanalysis - Smashing Cryptography with a Flicker.",
					"Dominance as a New Trusted Computing Primitive for the Internet of Things."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2019w",
				"sub_name": "2019 IEEE Security and Privacy Workshops, SP Workshops 2019, San Francisco, CA, USA, May 19-23, 2019.",
				"count": 39,
				"papers": [
					"On the Robustness of Deep K-Nearest Neighbors.",
					"Exploring Adversarial Examples in Malware Detection.",
					"Targeted Adversarial Examples for Black Box Audio Systems.",
					"Activation Analysis of a Byte-Based Deep Neural Network for Malware Classification.",
					"MaxNet: Neural Network Architecture for Continuous Detection of Malicious Activity.",
					"Deep in the Dark - Deep Learning-Based Malware Traffic Detection Without Expert Knowledge.",
					"Defending Against Neural Network Model Stealing Attacks Using Deceptive Perturbations.",
					"Membership Inference Attacks Against Adversarially Robust Deep Learning Models.",
					"Efficient Evaluation of Activation Functions over Encrypted Data.",
					"Privacy Risk Assessment for Data Subject-Aware Threat Modeling.",
					"Differential Inference Testing: A Practical Approach to Evaluate Sanitizations of Datasets.",
					"Knowledge is Power: Systematic Reuse of Privacy Knowledge for Threat Elicitation.",
					"You Talk Too Much: Limiting Privacy Exposure Via Voice Input.",
					"After GDPR, Still Tracking or Not? Understanding Opt-Out States for Online Behavioral Advertising.",
					"A Privacy-Aware V-Model for Software Development.",
					"SwitchMan: An Easy-to-Use Approach to Secure User Input and Output.",
					"ROS-Defender: SDN-Based Security Policy Enforcement for Robotic Applications.",
					"Resilience of Multi-robot Systems to Physical Masquerade Attacks.",
					"Ensuring the Safe and Secure Operation of Electronic Control Units in Road Vehicles.",
					"Are Self-Driving Cars Secure? Evasion Attacks Against Deep Neural Networks for Steering Angle Prediction.",
					"Analysis of the Susceptibility of Smart Home Programming Interfaces to End User Error.",
					"Smart Speaker Privacy Control - Acoustic Tagging for Personal Voice Assistants.",
					"When Smart Devices Are Stupid: Negative Experiences Using Home Smart Devices.",
					"Side Channel Attacks in Computation Offloading Systems with GPU Virtualization.",
					"Demo: An Emulator-Based Active Protection System Against IoT Malware.",
					"SpyCon: Adaptation Based Spyware in Human-in-the-Loop IoT.",
					"Devil in the Detail: Attack Scenarios in Industrial Applications.",
					"IOTFLA : A Secured and Privacy-Preserving Smart Home Architecture Implementing Federated Learning.",
					"A Study of Vulnerability Analysis of Popular Smart Devices Through Their Companion Apps.",
					"A Smörgåsbord of Typos: Exploring International Keyboard Layout Typosquatting.",
					"Characterizing Vulnerability of DNS AXFR Transfers with Global-Scale Scanning.",
					"Assessing the Effectiveness of Domain Blacklisting Against Malicious DNS Registrations.",
					"Analysing Censorship Circumvention with VPNs Via DNS Cache Snooping.",
					"Feasibility of a Keystroke Timing Attack on Search Engines with Autocomplete.",
					"Detecting Malicious Campaigns in Obfuscated JavaScript with Scalable Behavioral Analysis.",
					"Counting Outdated Honeypots: Legal and Useful.",
					"MLSEC - Benchmarking Shallow and Deep Machine Learning Models for Network Security.",
					"IEC 60870-5-104 Network Characterization of a Large-Scale Operational Power Grid.",
					"Victim Routine Influences the Number of DDoS Attacks: Evidence from Dutch Educational Network."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "39th S&P 2018",
		"info": "San Francisco, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2018",
				"sub_name": "2018 IEEE Symposium on Security and Privacy, SP 2018, Proceedings, 21-23 May 2018, San Francisco, California, USA.",
				"count": 63,
				"papers": [
					"AI2: Safety and Robustness Certification of Neural Networks with Abstract Interpretation.",
					"Manipulating Machine Learning: Poisoning Attacks and Countermeasures for Regression Learning.",
					"Stealing Hyperparameters in Machine Learning.",
					"A Machine Learning Approach to Prevent Malicious Calls over Telephony Networks.",
					"Surveylance: Automatically Detecting Online Survey Scams.",
					"Privacy Risks with Facebook's PII-Based Targeting: Auditing a Data Broker's Advertising Interface.",
					"Anonymity Trilemma: Strong Anonymity, Low Bandwidth Overhead, Low Latency - Choose Two.",
					"Locally Differentially Private Frequent Itemset Mining.",
					"EyeTell: Video-Assisted Touchscreen Keystroke Inference from Eye Movements.",
					"Understanding Linux Malware.",
					"Racing in Hyperspace: Closing Hyper-Threading Side Channels on SGX with Contrived Data Races.",
					"Grand Pwning Unit: Accelerating Microarchitectural Attacks with the GPU.",
					"SoK: Keylogging Side Channels.",
					"FPGA-Based Remote Power Side-Channel Attacks.",
					"Another Flip in the Wall of Rowhammer Defenses.",
					"EnclaveDB: A Secure Database Using SGX.",
					"Oblix: An Efficient Oblivious Search Index.",
					"Improved Reconstruction Attacks on Encrypted Data Using Range Query Leakage.",
					"Bulletproofs: Short Proofs for Confidential Transactions and More.",
					"FuturesMEX: Secure, Distributed Futures Market Exchange.",
					"Implementing Conjunction Obfuscation Under Entropic Ring LWE.",
					"Hackers vs. Testers: A Comparison of Software Vulnerability Discovery Processes.",
					"Towards Security and Privacy for Multi-user Augmented Reality: Foundations with End Users.",
					"Computer Security and Privacy for Refugees in the United States.",
					"On Enforcing the Digital Immunity of a Large Humanitarian Organization.",
					"The Spyware Used in Intimate Partner Violence.",
					"Compiler-Assisted Code Randomization.",
					"Protecting the Stack with Metadata Policies and Tagged Hardware.",
					"Impossibility of Precise and Sound Termination-Sensitive Security Enforcements.",
					"Static Evaluation of Noninterference Using Approximate Model Counting.",
					"DEEPSEC: Deciding Equivalence Properties in Security Protocols Theory and Practice.",
					"Distance-Bounding Protocols: Verification without Time and Location.",
					"Sonar: Detecting SS7 Redirection Attacks with Audio-Based Distance Bounding.",
					"OmniLedger: A Secure, Scale-Out, Decentralized Ledger via Sharding.",
					"Routing Around Congestion: Defeating DDoS Attacks and Adverse Network Conditions via Reactive BGP Routing.",
					"Tracking Ransomware End-to-end.",
					"The Rise of the Citizen Developer: Assessing the Security Impact of Online App Generators.",
					"Learning from Mutants: Using Code Mutation to Learn and Monitor Invariants of a Cyber-Physical System.",
					"Precise and Scalable Detection of Double-Fetch Bugs in OS Kernels.",
					"CollAFL: Path Sensitive Fuzzing.",
					"T-Fuzz: Fuzzing by Program Transformation.",
					"Angora: Efficient Fuzzing by Principled Search.",
					"FP-STALKER: Tracking Browser Fingerprint Evolutions.",
					"Study and Mitigation of Origin Stripping Vulnerabilities in Hybrid-postMessage Enabled Mobile Applications.",
					"Mobile Application Web API Reconnaissance: Web-to-Mobile Inconsistencies & Vulnerabilities.",
					"Enumerating Active IPv6 Hosts for Large-Scale Security Scans via DNSSEC-Signed Reverse Zones.",
					"Tracking Certificate Misissuance in the Wild.",
					"A Formal Treatment of Accountable Proxying Over TLS.",
					"Secure Device Bootstrapping Without Secrets Resistant to Signal Manipulation Attacks.",
					"Do You Feel What I Hear? Enabling Autonomous IoT Device Pairing Using Different Sensor Types.",
					"On the Economics of Offline Password Cracking.",
					"A Tale of Two Studies: The Best and Worst of YubiKey Usability.",
					"When Your Fitness Tracker Betrays You: Quantifying the Predictability of Biometric Features Across Contexts.",
					"vRAM: Faster Verifiable RAM with Program-Independent Preprocessing.",
					"Doubly-Efficient zkSNARKs Without Trusted Setup.",
					"xJsnark: A Framework for Efficient Verifiable Computation.",
					"PIR with Compressed Queries and Amortized Query Processing.",
					"Secure Two-party Threshold ECDSA from ECDSA Assumptions.",
					"Speechless: Analyzing the Threat to Speech Privacy from Smartphone Motion Sensors.",
					"Crowd-GPS-Sec: Leveraging Crowdsourcing to Detect and Localize GPS Spoofing Attacks.",
					"SoK: \"Plug & Pray\" Today - Understanding USB Insecurity in Versions 1 Through C.",
					"Blue Note: How Intentional Acoustic Interference Damages Availability and Integrity in Hard Disk Drives and Operating Systems.",
					"The Cards Aren't Alright: Detecting Counterfeit Gift Cards Using Encoding Jitter."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2018w",
				"sub_name": "2018 IEEE Security and Privacy Workshops, SP Workshops 2018, San Francisco, CA, USA, May 24, 2018.",
				"count": 43,
				"papers": [
					"Audio Adversarial Examples: Targeted Attacks on Speech-to-Text.",
					"A Deep Learning Approach to Fast, Format-Agnostic Detection of Malicious Web Content.",
					"Mouse Authentication Without the Temporal Aspect - What Does a 2D-CNN Learn?",
					"Detecting Homoglyph Attacks with a Siamese Neural Network.",
					"Machine Learning DDoS Detection for Consumer Internet of Things Devices.",
					"Adversarial Examples for Generative Models.",
					"Learning Universal Adversarial Perturbations with Generative Models.",
					"Black-Box Generation of Adversarial Text Sequences to Evade Deep Learning Classifiers.",
					"Exploring the Use of Autoencoders for Botnets Traffic Representation.",
					"The Good, the Bad and the Bait: Detecting and Characterizing Clickbait on YouTube.",
					"Bringing a GAN to a Knife-Fight: Adapting Malware Communication to Avoid Detection.",
					"Adversarial Deep Learning for Robust Detection of Binary Encoded Malware.",
					"Extending Detection with Privileged Information via Generalized Distillation.",
					"Detecting Deceptive Reviews Using Generative Adversarial Networks.",
					"Background Class Defense Against Adversarial Examples.",
					"Time Series Deinterleaving of DNS Traffic.",
					"HeNet: A Deep Learning Approach on Intel® Processor Trace for Effective Exploit Detection.",
					"Deep Reinforcement Fuzzing.",
					"Security Risks in Deep Learning Implementations.",
					"Evaluating Automated Facial Age Estimation Techniques for Digital Forensics.",
					"File Fragment Classification Using Grayscale Image Conversion and Deep Learning in Digital Forensics.",
					"Forensic-Aware Anti-DDoS Device.",
					"A Dynamic Taint Analysis Tool for Android App Forensics.",
					"Fingerprinting Cryptographic Protocols with Key Exchange Using an Entropy Measure.",
					"Forensic Analysis of Ransomware Families Using Static and Dynamic Analysis.",
					"Forensic Analysis of Immersive Virtual Reality Social Applications: A Primary Account.",
					"SOFIT: Sociotechnical and Organizational Factors for Insider Threat.",
					"Insider Threat Cybersecurity Framework Webtool & Methodology: Defending Against Complex Cyber-Physical Threats.",
					"Detection of Masqueraders Based on Graph Partitioning of File System Access Events.",
					"Simulated User Bots: Real Time Testing of Insider Threat Detection Systems.",
					"Balancing Organizational Incentives to Counter Insider Threat.",
					"Navigating the Insider Threat Tool Landscape: Low Cost Technical Solutions to Jump Start an Insider Threat Program.",
					"S.P.O.O.F Net: Syntactic Patterns for identification of Ominous Online Factors.",
					"WACA: Wearable-Assisted Continuous Authentication.",
					"Evaluating Insider Threat Detection Workflow Using Supervised and Unsupervised Learning.",
					"Towards Human Bio-Inspired Defence Mechanism for Cyber Security.",
					"A Case Study in Tailoring a Bio-Inspired Cyber-Security Algorithm: Designing Anomaly Detection for Multilayer Networks.",
					"Diversity-Based Moving-Target Defense for Secure Wireless Vehicular Communications.",
					"Biologically Inspired Safety and Security for Smart Built Environments: Position Paper.",
					"Redesigning Secure Protocols to Compel Grammatical Compliance Checking.",
					"A Binary Analysis Approach to Retrofit Security in Input Parsing Routines.",
					"A Mathematical Modeling of Exploitations and Mitigation Techniques Using Set Theory.",
					"LangSec Revisited: Input Security Flaws of the Second Kind."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "38th S&P 2017",
		"info": "San Jose, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2017",
				"sub_name": "2017 IEEE Symposium on Security and Privacy, SP 2017, San Jose, CA, USA, May 22-26, 2017.",
				"count": 60,
				"papers": [
					"Membership Inference Attacks Against Machine Learning Models.",
					"SecureML: A System for Scalable Privacy-Preserving Machine Learning.",
					"Towards Evaluating the Robustness of Neural Networks.",
					"Is Interaction Necessary for Distributed Private Learning?",
					"Pyramid: Enhancing Selectivity in Big Data Protection with Count Featurization.",
					"SoK: Science, Security and the Elusive Goal of Security as a Scientific Pursuit.",
					"Stack Overflow Considered Harmful? The Impact of Copy&Paste on Android Application Security.",
					"Obstacles to the Adoption of Secure Communication Tools.",
					"Comparing the Usability of Cryptographic APIs.",
					"SoK: Cryptographically Protected Database Search.",
					"IoT Goes Nuclear: Creating a ZigBee Chain Reaction.",
					"SoK: Exploiting Network Printers.",
					"How They Did It: An Analysis of Emission Defeat Devices in Modern Automobiles.",
					"The Password Reset MitM Attack.",
					"An Experimental Security Analysis of an Industrial Robot Controller.",
					"Protecting Bare-Metal Embedded Systems with Privilege Overlays.",
					"NORAX: Enabling Execute-Only Memory for COTS Binaries on AArch64.",
					"Securing Augmented Reality Output.",
					"SysPal: System-Guided Pattern Locks for Android.",
					"Multi-touch Authentication Using Hand Geometry and Behavioral Information.",
					"Hijacking Bitcoin: Routing Attacks on Cryptocurrencies.",
					"Catena: Efficient Non-equivocation via Bitcoin.",
					"IKP: Turning a PKI Around with Decentralized Automated Incentives.",
					"Augur: Internet-Wide Detection of Connectivity Disruptions.",
					"Scalable Bias-Resistant Distributed Randomness.",
					"Implementing and Proving the TLS 1.3 Record Layer.",
					"Verified Models and Reference Implementations for the TLS 1.3 Standard Candidate.",
					"SymCerts: Practical Symbolic Execution for Exposing Noncompliance in X.509 Certificate Validation Implementations.",
					"HVLearn: Automated Black-Box Analysis of Hostname Verification in SSL/TLS Implementations.",
					"CRLite: A Scalable System for Pushing All TLS Revocations to All Browsers.",
					"Finding and Preventing Bugs in JavaScript Bindings.",
					"Skyfire: Data-Driven Seed Generation for Fuzzing.",
					"VUDDY: A Scalable Approach for Vulnerable Code Clone Discovery.",
					"NEZHA: Efficient Domain-Independent Differential Testing.",
					"Backward-Bounded DSE: Targeting Infeasibility Questions on Obfuscated Codes.",
					"Leakage-Abuse Attacks against Order-Revealing Encryption.",
					"Side-Channel Attacks on Shared Search Indexes.",
					"From Trash to Treasure: Timing-Sensitive Garbage Collection.",
					"Verifying and Synthesizing Constant-Resource Implementations with Types.",
					"CoSMeDis: A Distributed Social Media Platform with Formally Verified Confidentiality Guarantees.",
					"How to Learn Klingon without a Dictionary: Detection and Measurement of Black Keywords Used by the Underground Economy.",
					"To Catch a Ratter: Monitoring the Behavior of Amateur DarkComet RAT Operators in the Wild.",
					"A Lustrum of Malware Network Communication: Evolution and Insights.",
					"Under the Shadow of Sunshine: Understanding and Detecting Bulletproof Hosting on Legitimate Service Provider Networks.",
					"Your Exploit is Mine: Automatic Shellcode Transplant for Remote Exploits.",
					"Optimized Honest-Majority MPC for Malicious Adversaries - Breaking the 1 Billion-Gate Per Second Barrier.",
					"vSQL: Verifying Arbitrary SQL Queries over Dynamic Outsourced Databases.",
					"A Framework for Universally Composable Diffie-Hellman Key Exchange.",
					"One TPM to Bind Them All: Fixing TPM 2.0 for Provably Secure Anonymous Attestation.",
					"Cryptographic Function Detection in Obfuscated Binaries via Bit-Precise Symbolic Loop Mapping.",
					"XHOUND: Quantifying the Fingerprintability of Browser Extensions.",
					"Identifying Personal DNA Methylation Profiles by Genotype Inference.",
					"Counter-RAPTOR: Safeguarding Tor Against Active Routing Attacks.",
					"Machine-Checked Proofs of Privacy for Electronic Voting Protocols.",
					"Spotless Sandboxes: Evading Malware Analysis Systems Using Wear-and-Tear Artifacts.",
					"Hardening Java's Access Control by Abolishing Implicit Privilege Elevation.",
					"Cloak and Dagger: From Two Permissions to Complete Control of the UI Feedback Loop.",
					"SmarPer: Context-Aware and Automatic Runtime-Permissions for Mobile Devices.",
					"The Feasibility of Dynamically Granted Permissions: Aligning Mobile Privacy with User Preferences.",
					"IVD: Automatic Learning and Enforcement of Authorization Rules in Online Social Networks."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2017w",
				"sub_name": "2017 IEEE Security and Privacy Workshops, SP Workshops 2017, San Jose, CA, USA, May 25, 2017.",
				"count": 33,
				"papers": [
					"On the Personalization of Trust Management.",
					"Guiding a Colony of Black-Box Fuzzers with Chemotaxis.",
					"Ant Colony-Inspired Parallel Algorithm to Improve Cryptographic Pseudo Random Number Generators.",
					"Evolutionary Approaches for Resilient Surveillance Management.",
					"Don't You Touch My Nuts: Information Hiding in Cyber Physical Systems.",
					"Using Evolutionary Diversity to Identify Problematic Software Parameters.",
					"Attack-Resistant aiCAPTCHA Using a Negative Selection Artificial Immune System.",
					"Biometric Authentication Using Mouse and Eye Movement Data.",
					"Towards a Biometric Authentication-Based Hybrid Trust-Computing Approach for Verification of Provider Profiles in Online Healthcare Information.",
					"Taming the Length Field in Binary Data: Calc-Regular Languages.",
					"Writing Parsers Like it is 2017.",
					"Eliminating Input-Based Attacks by Deriving Automated Encoders and Decoders from Context-Free Grammars.",
					"Inference of Security-Sensitive Entities in Libraries.",
					"A Framework for Validating Session Protocols.",
					"Building Hardened Internet-of-Things Clients with Language-Theoretic Security.",
					"Research Report: Hardware-Enforcement of Walther-Recursive Program Functions.",
					"Lua Code: Security Overview and Practical Approaches to Static Analysis.",
					"IDE Plugins for Detecting Input-Validation Vulnerabilities.",
					"HybridGuard: A Principal-Based Permission and Fine-Grained Policy Enforcement Framework for Web-Based Mobile Applications.",
					"Spartan Jester: End-to-End Information Flow Control for Hybrid Android Applications.",
					"Seamless In-App Ad Blocking on Stock Android.",
					"Mobile Subscriber WiFi Privacy.",
					"The Applicability of Ambient Sensors as Proximity Evidence for NFC Transactions.",
					"MR-Droid: A Scalable and Prioritized Analysis of Inter-App Communication Risks.",
					"Security Implications of Publicly Reachable Building Automation Systems.",
					"Malware Detection by Analysing Network Traffic with Neural Networks.",
					"Scalable Secure Multi-party Network Vulnerability Analysis via Symbolic Optimization.",
					"An Investigation of Power Law Probability Distributions for Network Anomaly Detection.",
					"Real Time Network File Similarity Detection Based on Approximate Matching.",
					"Using Gaussian Mixture Models to Detect Outliers in Seasonal Univariate Network Traffic.",
					"Effects of Shared Bandwidth on Anonymity of the I2P Network Users.",
					"Traffic Monitoring and Diagnosis with Multivariate Statistical Network Monitoring: A Case Study.",
					"Ethics and Internet Measurements."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2017iwpe",
				"sub_name": "Proceedings of the 3rd International Workshop on Privacy Engineering co-located with 38th IEEE Symposium on Security and Privacy, IWPE@SP 2017, San Jose, CA, USA, May 25, 2017.",
				"count": 8,
				"papers": [
					"Privacy Impact Assessments in Practice: Outcome of a Descriptive Field Research in the Netherlands.",
					"Assessing Privacy in Social Media Aggregators.",
					"Battery Status Not Included: Assessing Privacy in Web Standards.",
					"Statistical Detection of Downloaders in Freenet.",
					"Addressing Early Life Cycle Privacy Risk: Applying System-Theoretic Early Concept Analysis and Model-Based Systems Engineering to Privacy.",
					"A Metamodel for Privacy Engineering Methods.",
					"Privacy Broker: Message Oriented Middleware to Implement Privacy Controls in Schibsted's Ecosystem of Services.",
					"Engineering Privacy and Protest: A Case Study of AdNauseam."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "37th S&P 2016",
		"info": "San Jose, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2016",
				"sub_name": "IEEE Symposium on Security and Privacy, SP 2016, San Jose, CA, USA, May 22-26, 2016.",
				"count": 55,
				"papers": [
					"HDFI: Hardware-Assisted Data-Flow Isolation.",
					"A2: Analog Malicious Hardware.",
					"Cache Storage Channels: Alias-Driven Attacks and Verified Countermeasures.",
					"Shreds: Fine-Grained Execution Units with Private Memory.",
					"CaSE: Cache-Assisted Secure Execution on ARM Processors.",
					"Back in Black: Towards Formal, Black Box Analysis of Sanitizers and Filters.",
					"LAVA: Large-Scale Automated Vulnerability Addition.",
					"Prepose: Privacy, Security, and Reliability for Gesture-Based Programming.",
					"SOK: (State of) The Art of War: Offensive Techniques in Binary Analysis.",
					"Helping Johnny to Analyze Malware: A Usability-Optimized Decompiler and Malware Analysis User Study.",
					"A Practical Oblivious Map Data Structure with Secure Deletion and History Independence.",
					"TaoStore: Overcoming Asynchronicity in Oblivious Data Storage.",
					"Revisiting Square-Root ORAM: Efficient Random Access in Multi-party Computation.",
					"Cinderella: Turning Shabby X.509 Certificates into Elegant Anonymous Credentials with the Magic of Verifiable Computation.",
					"PhotoProof: Cryptographic Image Authentication for Any Set of Permissible Transformations.",
					"I Think They're Trying to Tell Me Something: Advice Sources and Selection for Digital Security.",
					"You Get Where You're Looking for: The Impact of Information Sources on Code Security.",
					"Users Really Do Plug in USB Drives They Find.",
					"SoK: Everyone Hates Robocalls: A Survey of Techniques Against Telephone Spam.",
					"Sending Out an SMS: Characterizing the Security of the SMS Ecosystem with Public Gateways.",
					"Following Devil's Footprints: Cross-Platform Analysis of Potentially Harmful Libraries on Android and iOS.",
					"TriggerScope: Towards Detecting Logic Bombs in Android Applications.",
					"Inferring User Routes and Locations Using Zero-Permission Mobile Sensors.",
					"No Pardon for the Interruption: New Inference Attacks on Android Through Interrupt Timing Analysis.",
					"SoK: Lessons Learned from Android Security Research for Appified Software Platforms.",
					"Key Confirmation in Key Exchange: A Formal Treatment and Implications for TLS 1.3.",
					"Automated Analysis and Verification of TLS 1.3: 0-RTT, Resumption and Delayed Authentication.",
					"Multiple Handshakes Security of TLS 1.3 Candidates.",
					"Downgrade Resilience in Key-Exchange Protocols.",
					"Keeping Authorities \"Honest or Bust\" with Decentralized Witness Cosigning.",
					"Synthesizing Plausible Privacy-Preserving Location Traces.",
					"A Method for Verifying Privacy-Type Properties: The Unbounded Case.",
					"Distillation as a Defense to Adversarial Perturbations Against Deep Neural Networks.",
					"Algorithmic Transparency via Quantitative Input Influence: Theory and Experiments with Learning Systems.",
					"Talos: Neutralizing Vulnerabilities with Security Workarounds for Rapid Response.",
					"Security Analysis of Emerging Smart Home Applications.",
					"Staying Secure and Unprepared: Understanding and Mitigating the Security Risks of Apple ZeroConf.",
					"MitM Attack by Name Collision: Cause Analysis and Vulnerability Assessment in the New gTLD Era.",
					"Domain-Z: 28 Registrations Later Measuring the Exploitation of Residual Trust in Domains.",
					"Seeking Nonsense, Looking for Trouble: Efficient Promotional-Infection Detection through Semantic Inconsistency Search.",
					"The Cracked Cookie Jar: HTTP Cookie Hijacking and the Exposure of Private Information.",
					"Cloak of Visibility: Detecting When Machines Browse a Different Web.",
					"Verifiable ASICs.",
					"SoK: Verifiability Notions for E-Voting Protocols.",
					"pASSWORD tYPOS and How to Correct Them Securely.",
					"On the Practicality of Cryptographically Enforcing Dynamic Access Control Policies in the Cloud.",
					"Hawk: The Blockchain Model of Cryptography and Privacy-Preserving Smart Contracts.",
					"High-Speed Inter-Domain Fault Localization.",
					"Beauty and the Beast: Diverting Modern Web Browsers to Build Unique Browser Fingerprints.",
					"Verena: End-to-End Integrity Protection for Web Applications.",
					"SoK: Towards Grounding Censorship Circumvention in Empiricism.",
					"A Tough Call: Mitigating Advanced Code-Reuse Attacks at the Binary Level.",
					"Return to the Zombie Gadgets: Undermining Destructive Code Reads via Code Inference Attacks.",
					"Data-Oriented Programming: On the Expressiveness of Non-control Data Attacks.",
					"Dedup Est Machina: Memory Deduplication as an Advanced Exploitation Vector."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2016w",
				"sub_name": "2016 IEEE Security and Privacy Workshops, SP Workshops 2016, San Jose, CA, USA, May 22-26, 2016.",
				"count": 41,
				"papers": [
					"DataTags, Data Handling Policy Spaces and the Tags Language.",
					"Compliance Monitoring of Third-Party Applications in Online Social Networks.",
					"Privacy Risk Analysis Based on System Control Structures: Adapting System-Theoretic Process Analysis for Privacy Engineering.",
					"A Semi-Automated Methodology for Extracting Access Control Rules from the European Data Protection Directive.",
					"A Critical Analysis of Privacy Design Strategies.",
					"Oblivious Mechanisms in Differential Privacy: Experiments, Conjectures, and Open Questions.",
					"Obstacles to Transparency in Privacy Engineering.",
					"From Privacy Impact Assessment to Social Impact Assessment.",
					"Privacy Harm Analysis: A Case Study on Smart Grids.",
					"Improving Performance and Usability in Mobile Keystroke Dynamic Biometric Authentication.",
					"Detection of Mobile Malware: An Artificial Immunity Approach.",
					"Polymorphic Malware Detection Using Sequence Classification Methods.",
					"LINEBACKER: LINE-Speed Bio-Inspired Analysis and Characterization for Event Recognition.",
					"MIGRATE: Towards a Lightweight Moving-Target Defense Against Cloud Side-Channels.",
					"Ecology-Based DoS Attack in Cognitive Radio Networks.",
					"Hunting Bugs with Lévy Flight Foraging.",
					"A Biosequence-Based Approach to Software Characterization.",
					"Caradoc: A Pragmatic Approach to PDF Parsing and Validation.",
					"In Search of Shotgun Parsers in Android Applications.",
					"An Incremental Learner for Language-Based Anomaly Detection in XML.",
					"Grammatical Inference and Machine Learning Approaches to Post-Hoc LangSec.",
					"A Posteriori Taint-Tracking for Demonstrating Non-interference in Expressive Low-Level Languages.",
					"Research Report: Analysis of Software for Restricted Computational Environment Applicability.",
					"Research Report: Mitigating LangSec Problems with Capabilities.",
					"Declarative Verifiable SDI Specifications.",
					"Target Fragmentation in Android Apps.",
					"Perceptions of Risk in Mobile Transaction.",
					"A Study of Grayware on Google Play.",
					"Browser History Stealing with Captive Wi-Fi Portals.",
					"Sensor-Based Mobile Web Fingerprinting and Cross-Site Input Inference Attacks.",
					"Is Anybody Home? Inferring Activity From Smart Home Network Traffic.",
					"DroidScribe: Classifying Android Malware Based on Runtime Behavior.",
					"Analysis of Code Heterogeneity for High-Precision Classification of Repackaged Malware.",
					"At Your Fingertips: Considering Finger Distinctness in Continuous Touch-Based Authentication for Mobile Devices.",
					"Hold and Sign: A Novel Behavioral Biometrics for Smartphone User Authentication.",
					"Validating an Insider Threat Detection System: A Real Scenario Perspective.",
					"PRI: Privacy Preserving Inspection of Encrypted Network Traffic.",
					"Investigating Airplane Safety and Security Against Insider Threats Using Logical Modeling.",
					"A Model-Based Approach to Predicting the Performance of Insider Threat Detection Systems.",
					"A Hybrid Framework for Data Loss Prevention and Detection.",
					"Activity Pattern Discovery from Network Captures."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "36th S&P 2015",
		"info": "San Jose, CA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2015",
				"sub_name": "2015 IEEE Symposium on Security and Privacy, SP 2015, San Jose, CA, USA, May 17-21, 2015.",
				"count": 55,
				"papers": [
					"Protecting Private Keys against Memory Disclosure Attacks Using Hardware Transactional Memory.",
					"CHERI: A Hybrid Capability-System Architecture for Scalable Software Compartmentalization.",
					"VC3: Trustworthy Data Analytics in the Cloud Using SGX.",
					"Using Hardware Features for Increased Debugging Transparency.",
					"Virtual Proofs of Reality and their Physical Implementation.",
					"The Miner's Dilemma.",
					"SoK: Research Perspectives and Challenges for Bitcoin and Cryptocurrencies.",
					"Bitcoin over Tor isn't a Good Idea.",
					"Every Second Counts: Quantifying the Negative Externalities of Cybercrime via Typosquatting.",
					"Ad Injection at Scale: Assessing Deceptive Advertisement Modifications.",
					"Connection-Oriented DNS to Improve Privacy and Security.",
					"Temporal Lensing and Its Application in Pulsing Denial-of-Service Attacks.",
					"Secure Track Verification.",
					"How Secure and Quick is QUIC? Provable Security and Performance Analyses.",
					"SoK: Secure Messaging.",
					"Geppetto: Versatile Verifiable Computation.",
					"ADSNARK: Nearly Practical and Privacy-Preserving Proofs on Authenticated Data.",
					"Secure Sampling of Public Parameters for Succinct Zero Knowledge Proofs.",
					"Forward Secure Asynchronous Messaging from Puncturable Encryption.",
					"Riposte: An Anonymous Messaging System Handling Millions of Users.",
					"Privacy and Access Control for Outsourced Personal Records.",
					"ObliVM: A Programming Framework for Secure Computation.",
					"GraphSC: Parallel Secure Computation Made Easy.",
					"Malicious-Client Security in Blind Seer: A Scalable Private DBMS.",
					"TinyGarble: Highly Compressed and Scalable Sequential Garbled Circuits.",
					"SurroundWeb: Mitigating Privacy Concerns in a 3D Web Browser.",
					"GenoGuard: Protecting Genomic Data against Brute-Force Attacks.",
					"Towards Making Systems Forget with Machine Unlearning.",
					"Cracking-Resistant Password Vaults Using Natural Language Encoders.",
					"SoK: A Comprehensive Analysis of Game-Based Ballot Privacy Definitions.",
					"Vetting SSL Usage in Applications with SSLINT.",
					"A Messy State of the Union: Taming the Composite State Machines of TLS.",
					"Post-Quantum Key Exchange for the TLS Protocol from the Ring Learning with Errors Problem.",
					"Security of the J-PAKE Password-Authenticated Key Exchange Protocol.",
					"S$A: A Shared Cache Attack That Works across Cores and Defies VM Sandboxing - and Its Application to AES.",
					"Last-Level Cache Side-Channel Attacks are Practical.",
					"On Subnormal Floating Point and Abnormal Timing.",
					"Controlled-Channel Attacks: Deterministic Side Channels for Untrusted Operating Systems.",
					"SoK: Deep Packer Inspection: A Longitudinal Study of the Complexity of Run-Time Packers.",
					"A Generic Approach to Automatic Deobfuscation of Executable Code.",
					"The Attack of the Clones: A Study of the Impact of Shared Code on Vulnerability Patching.",
					"Cross-Architecture Bug Search in Binary Executables.",
					"Program-Adaptive Mutational Fuzzing.",
					"Counterfeit Object-oriented Programming: On the Difficulty of Preventing Code Reuse Attacks in C++ Applications.",
					"Readactor: Practical Code Randomization Resilient to Memory Disclosure.",
					"Missing the Point(er): On the Effectiveness of Code Pointer Integrity.",
					"Automatic Inference of Search Patterns for Taint-Style Vulnerabilities.",
					"Micro-Policies: Formally Verified, Tag-Based Security Monitors.",
					"Securing Multiparty Online Services Via Certification of Symbolic Transactions.",
					"Understanding and Monitoring Embedded Web Scripts.",
					"High System-Code Security with Low Overhead.",
					"Caelus: Verifying the Consistency of Cloud Services with Battery-Powered Devices.",
					"Effective Real-Time Android Application Auditing.",
					"Leave Me Alone: App-Level Protection against Runtime Information Gathering on Android.",
					"What the App is That? Deception and Countermeasures in the Android User Interface."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2015w",
				"sub_name": "2015 IEEE Symposium on Security and Privacy Workshops, SPW 2015, San Jose, CA, USA, May 21-22, 2015.",
				"count": 26,
				"papers": [
					"Efficient Secure Outsourcing of Genome-Wide Association Studies.",
					"Privacy-Preserving Statistical Analysis by Exact Logistic Regression.",
					"Passing Go with DNA Sequencing: Delivering Messages in a Covert Transgenic Channel.",
					"Privacy Threats and Practical Solutions for Genetic Risk Tests.",
					"Quantifying Genomic Privacy via Inference Attack with High-Order SNV Correlations.",
					"One Size Doesn't Fit All: Measuring Individual Privacy in Aggregate Genomic Data.",
					"Genomic Privacy Metrics: A Systematic Comparison.",
					"Genomic Privacy and Direct-to-Consumer Genetics: Big Consumer Genetic Data - What's in that Contract?",
					"Seeking a \"Race to the Top\" in Genomic Cloud Privacy?",
					"The Correctness-Security Gap in Compiler Optimization.",
					"Grammatical Inference and Language Frameworks for LANGSEC.",
					"Error-Correcting Codes as Source for Decoding Ambiguity.",
					"Verification State-Space Reduction through Restricted Parsing Environments.",
					"On the Generality and Convenience of Etypes.",
					"Protocol State Machines and Session Languages: Specification, implementation, and Security Flaws.",
					"Towards More Security in Data Exchange: Defining Unparsers with Context-Sensitive Encoders for Context-Free Grammars.",
					"Nom, A Byte oriented, streaming, Zero copy, Parser Combinators Library in Rust.",
					"PRIPARE: Integrating Privacy Best Practices into a Privacy Engineering Methodology.",
					"Protection Goals for Privacy Engineering.",
					"Privacy by Design in Federated Identity Management.",
					"Extending the Power of Consent with User-Managed Access: A Standard Architecture for Asynchronous, Centralizable, Internet-Scalable Consent.",
					"Decentralizing Privacy: Using Blockchain to Protect Personal Data.",
					"Reviewing for Privacy in Internet and Web Standard-Setting.",
					"Privacy Principles for Sharing Cyber Security Data.",
					"Choose Wisely: A Comparison of Secure Two-Party Computation Frameworks.",
					"Tor Experimentation Tools."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "35th S&P 2014",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2014",
				"sub_name": "2014 IEEE Symposium on Security and Privacy, SP 2014, Berkeley, CA, USA, May 18-21, 2014.",
				"count": 44,
				"papers": [
					"Hunting the Red Fox Online: Understanding and Detection of Mass Redirect-Script Injections.",
					"Stealing Webpages Rendered on Your Browser by Exploiting GPU Vulnerabilities.",
					"All Your Screens Are Belong to Us: Attacks Exploiting the HTML5 Screen Sharing API.",
					"Chip and Skim: Cloning EMV Cards with the Pre-play Attack.",
					"When HTTPS Meets CDN: A Case of Authentication in Delegated Service.",
					"Analyzing Forged SSL Certificates in the Wild.",
					"Triple Handshakes and Cookie Cutters: Breaking and Fixing Authentication over TLS.",
					"Using Frankencerts for Automated Adversarial Testing of Certificate Validation in SSL/TLS Implementations.",
					"Automating Isolation and Least Privilege in Web Services.",
					"Hidden GEMs: Automated Discovery of Access Control Vulnerabilities in Graphical User Interfaces.",
					"Automated Analysis of Security Protocols with Global State.",
					"Automated Verification of Group Key Agreement Protocols.",
					"Practical Evasion of a Learning-Based Classifier: A Case Study.",
					"Doppelgänger Finder: Taking Stylometry to the Underground.",
					"Hacking Blind.",
					"Framing Signals - A Return to Portable Shellcode.",
					"Pivot: Fast, Synchronous Mashup Isolation Using Generator Chains.",
					"SoK: Automated Software Diversity.",
					"KCoFI: Complete Control-Flow Integrity for Commodity Operating System Kernels.",
					"Dancing with Giants: Wimpy Kernels for On-Demand Isolated I/O.",
					"Bootstrapping Privacy Compliance in Big Data Systems.",
					"Formal Analysis of Chaumian Mix Nets with Randomized Partial Checking.",
					"Blind Seer: A Scalable Private DBMS.",
					"ANONIZE: A Large-Scale Anonymous Survey System.",
					"Upgrading Your Android, Elevating My Malware: Privilege Escalation through Mobile OS Updating.",
					"The Peril of Fragmentation: Security Hazards in Android Device Driver Customizations.",
					"From Zygote to Morula: Fortifying Weakened ASLR on Android.",
					"Secure Multiparty Computations on Bitcoin.",
					"Zerocash: Decentralized Anonymous Payments from Bitcoin.",
					"Permacoin: Repurposing Bitcoin Work for Data Preservation.",
					"Cloak and Swagger: Understanding Data Sensitivity through the Lens of User Anonymity.",
					"Stopping a Rapid Tornado with a Puff.",
					"SoK: Security and Privacy in Implantable Medical Devices and Body Area Networks.",
					"Quantifying Information Flow for Dynamic Secrets.",
					"Not-So-Random Numbers in Virtualized Linux and the Whirlwind RNG.",
					"Out of Control: Overcoming Control-Flow Integrity.",
					"Modeling and Discovering Vulnerabilities with Code Property Graphs.",
					"SoK: Introspections on Trust and the Semantic Gap.",
					"Automating Efficient RAM-Model Secure Computation.",
					"Dynamic Searchable Encryption via Blind Storage.",
					"Wysteria: A Programming Language for Generic, Mixed-Mode Multiparty Computations.",
					"An Expressive Model for the Web Infrastructure: Definition and Application to the Browser ID SSO System.",
					"A Study of Probabilistic Password Models.",
					"ZEBRA: Zero-Effort Bilateral Recurring Authentication."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2014w",
				"sub_name": "35. IEEE Security and Privacy Workshops, SPW 2014, San Jose, CA, USA, May 17-18, 2014.",
				"count": 37,
				"papers": [
					"A Case Study in Malware Research Ethics Education: When Teaching Bad is Good.",
					"Ethics in Data Sharing: Developing a Model for Best Practice.",
					"Gringotts: Securing Data for Digital Evidence.",
					"P2U: A Privacy Policy Specification Language for Secondary Data Sharing and Usage.",
					"Architecture, Workflows, and Prototype for Stateful Data Usage Control in Cloud.",
					"Resilience as a New Enforcement Model for IT Security Based on Usage Control.",
					"Structure Matters - A New Approach for Data Flow Tracking.",
					"Hurdles for Genomic Data Usage Management.",
					"RAPPD: A Language and Prototype for Recipient-Accountable Private Personal Data.",
					"DF-C2M2: A Capability Maturity Model for Digital Forensics Organisations.",
					"Asset Risk Scoring in Enterprise Network with Mutually Reinforced Reputation Propagation.",
					"Collusion and Fraud Detection on Electronic Energy Meters - A Use Case of Forensics Investigation Procedures.",
					"Towards Forensic Analysis of Attacks with DNSSEC.",
					"The Tricks of the Trade: What Makes Spam Campaigns Successful?",
					"Constructing and Analyzing Criminal Networks.",
					"Steganography in Long Term Evolution Systems.",
					"Improving Hard Disk Contention-Based Covert Channel in Cloud Computing.",
					"PeerShark: Detecting Peer-to-Peer Botnets by Tracking Conversations.",
					"Automatic Identification of Replicated Criminal Websites Using Combined Clustering.",
					"iCOP: Automatically Identifying New Child Abuse Media in P2P Networks.",
					"Can We Identify NAT Behavior by Analyzing Traffic Flows?",
					"Mind Your Language(s): A Discussion about Languages and Security.",
					"LEGO(TM) Bricks for Reactive Programming.",
					"Nail: A Practical Interface Generator for Data Formats.",
					"Ethos' Deeply Integrated Distributed Types.",
					"Phantom Boundaries and Cross-Layer Illusions in 802.15.4 Digital Radio.",
					"Finite State Machine Parsing for Internet Protocols: Faster Than You Think.",
					"Parsifal: A Pragmatic Solution to the Binary Parsing Problems.",
					"The Pitfalls of Protocol Design: Attempting to Write a Formally Verified PDF Parser.",
					"Using Existing Hardware Services for Malware Detection.",
					"The Weird Machines in Proof-Carrying Code.",
					"Understanding Insider Threat: A Framework for Characterising Attacks.",
					"Combining Generated Data Models with Formal Invalidation for Insider Threat Analysis.",
					"Analysis of Unintentional Insider Threats Deriving from Social Engineering Exploits.",
					"Insider Threat Identification by Process Analysis.",
					"Insider Attack Identification and Prevention Using a Declarative Approach.",
					"Detecting Unknown Insider Threat Scenarios."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "34th S&P 2013",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2013",
				"sub_name": "2013 IEEE Symposium on Security and Privacy, SP 2013, Berkeley, CA, USA, May 19-22, 2013.",
				"count": 38,
				"papers": [
					"All Your IFCException Are Belong to Us.",
					"Declarative, Temporal, and Practical Programming with Capabilities.",
					"Towards Practical Reactive Security Audit Using Extended Static Checkers.",
					"SoK: Eternal War in Memory.",
					"The Parrot Is Dead: Observing Unobservable Network Communications.",
					"Trawling for Tor Hidden Services: Detection, Measurement, Deanonymization.",
					"SoK: P2PWNED - Modeling and Evaluating the Resilience of Peer-to-Peer Botnets.",
					"Finding the Linchpins of the Dark Web: a Study on Topologically Dedicated Hosts on Malicious Web Infrastructures.",
					"The Crossfire Attack.",
					"Ghost Talk: Mitigating EMI Signal Injection Attacks against Analog Sensors.",
					"On Limitations of Friendly Jamming for Confidentiality.",
					"Ally Friendly Jamming: How to Jam Your Enemy and Maintain Your Own Wireless Connectivity at the Same Time.",
					"Practical Timing Side Channel Attacks against Kernel Space ASLR.",
					"PrivExec: Private Execution as an Operating System Service.",
					"A Hybrid Architecture for Interactive Verifiable Computation.",
					"Pinocchio: Nearly Practical Verifiable Computation.",
					"ObliviStore: High Performance Oblivious Cloud Storage.",
					"Hiding Information in Flash Memory.",
					"PUFs in Security Protocols: Attack Models and Security Evaluations.",
					"SoK: Secure Data Deletion.",
					"Anon-Pass: Practical Anonymous Subscriptions.",
					"Privacy-Preserving Ridge Regression on Hundreds of Millions of Records.",
					"A Scanner Darkly: Protecting User Privacy from Perceptual Applications.",
					"Caveat Coercitor: Coercion-Evidence in Electronic Voting.",
					"SoK: The Evolution of Sybil Defense via Social Networks.",
					"Zerocoin: Anonymous Distributed E-Cash from Bitcoin.",
					"seL4: From General Purpose to a Proof of Information Flow Enforcement.",
					"Design, Implementation and Verification of an eXtensible and Modular Hypervisor Framework.",
					"Implementing TLS with Verified Cryptographic Security.",
					"An Ideal-Security Protocol for Order-Preserving Encoding.",
					"Efficient Garbling from a Fixed-Key Blockcipher.",
					"Circuit Structures for Improving Efficiency of Security and Privacy Tools.",
					"SoK: SSL and HTTPS: Revisiting Past Challenges and Evaluating Certificate Trust Model Enhancements.",
					"Lucky Thirteen: Breaking the TLS and DTLS Record Protocols.",
					"Cookieless Monster: Exploring the Ecosystem of Web-Based Device Fingerprinting.",
					"Practical Control Flow Integrity and Randomization for Binary Executables.",
					"Just-In-Time Code Reuse: On the Effectiveness of Fine-Grained Address Space Layout Randomization.",
					"Welcome to the Entropics: Boot-Time Entropy in Embedded Devices."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2013w",
				"sub_name": "2013 IEEE Symposium on Security and Privacy Workshops, San Francisco, CA, USA, May 23-24, 2013.",
				"count": 28,
				"papers": [
					"Log Design for Accountability.",
					"An Integrated Formal Approach to Usage Control.",
					"How Usage Control and Provenance Tracking Get Together - A Data Protection Perspective.",
					"The Cloud Needs Cross-Layer Data Handling Annotations.",
					"Privacy Preserving Data Analytics for Smart Homes.",
					"Preventive Inference Control in Data-centric Business Models.",
					"The Probabilistic Provenance Graph.",
					"\"I hereby leave my email to...\": Data Usage Control and the Digital Estate.",
					"Multi-Domain Information Fusion for Insider Threat Detection.",
					"System Level User Behavior Biometrics using Fisher Features and Gaussian Mixture Models.",
					"Use of Domain Knowledge to Detect Insider Threats in Computer Activities.",
					"Reporting Insider Threats via Covert Channels.",
					"Differentiating User Authentication Graphs.",
					"Invalidating Policies using Structural Information.",
					"A Bayesian Network Model for Predicting Insider Threats.",
					"Methods and Metrics for Evaluating Analytic Insider Threat Tools.",
					"Bridging the Gap: A Pragmatic Approach to Generating Insider Threat Data.",
					"On Bad Randomness and Cloning of Contactless Payment and Building Smart Cards.",
					"Understanding Network Forensics Analysis in an Operational Environment.",
					"Digital Forensic Reconstruction of a Program Action.",
					"Craigslist Scams and Community Composition: Investigating Online Fraud Victimization.",
					"On Evaluating IP Traceback Schemes: A Practical Perspective.",
					"Do Private and Portable Web Browsers Leave Incriminating Evidence? A Forensic Analysis of Residual Artifacts from Private and Portable Web Browsing Sessions.",
					"Inside the SCAM Jungle: A Closer Look at 419 Scam Email Operations.",
					"StegTorrent: A Steganographic Method for the P2P File Sharing Service.",
					"Steganography in OFDM Symbols of Fast IEEE 802.11n Networks.",
					"Quantitative Assessment of Risk Reduction with Cybercrime Black Market Monitoring.",
					"Preventing Cell Phone Intrusion and Theft using Biometrics."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "33rd S&P 2012",
		"info": "San Francisco, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2012",
				"sub_name": "IEEE Symposium on Security and Privacy, SP 2012, 21-23 May 2012, San Francisco, California, USA.",
				"count": 40,
				"papers": [
					"A Framework to Eliminate Backdoors from Response-Computable Authentication.",
					"Safe Loading - A Foundation for Secure Execution of Untrusted Programs.",
					"Flash Memory for Ubiquitous Hardware Security Functions: True Random Number Generation and Device Fingerprints.",
					"ReDeBug: Finding Unpatched Code Clones in Entire OS Distributions.",
					"Prudent Practices for Designing Malware Experiments: Status Quo and Outlook.",
					"Abusing File Processing in Malware Detectors for Fun and Profit.",
					"Dissecting Android Malware: Characterization and Evolution.",
					"Distance Hijacking Attacks on Distance Bounding Protocols.",
					"Don't Trust Satellite Phones: A Security Analysis of Two Satphone Standards.",
					"Memento: Learning Secrets from Process Footprints.",
					"Foundations of Logic-Based Trust Management.",
					"Formalizing and Enforcing Purpose Restrictions in Privacy Policies.",
					"Sharing Mobile Code Securely with Information Flow Control.",
					"The Psychology of Security for the Home Computer User.",
					"User-Driven Access Control: Rethinking Permission Granting in Modern Operating Systems.",
					"New Results for Timing-Based Attestation.",
					"ObliviAd: Provably Secure and Practical Online Behavioral Advertising.",
					"Quid-Pro-Quo-tocols: Strengthening Semi-honest Protocols with Dual Execution.",
					"Hummingbird: Privacy at the Time of Twitter.",
					"On the Feasibility of Internet-Scale Author Identification.",
					"Secure and Scalable Fault Localization under Dynamic Traffic Patterns.",
					"Peek-a-Boo, I Still See You: Why Efficient Traffic Analysis Countermeasures Fail.",
					"Off-path TCP Sequence Number Inference Attack - How Firewall Middleboxes Reduce Security.",
					"Signing Me onto Your Accounts through Facebook and Google: A Traffic-Guided Security Study of Commercially Deployed Single-Sign-On Web Services.",
					"Unleashing Mayhem on Binary Code.",
					"Clash Attacks on the Verifiability of E-Voting Systems.",
					"Third-Party Web Tracking: Policy and Technology.",
					"EvilSeed: A Guided Approach to Finding Malicious Web Pages.",
					"Rozzle: De-cloaking Internet Malware.",
					"Detecting Hoaxes, Frauds, and Deception in Writing Style Online.",
					"LASTor: A Low-Latency AS-Aware Tor Client.",
					"OB-PWS: Obfuscation-Based Private Web Search.",
					"LAP: Lightweight Anonymity and Privacy.",
					"Guess Again (and Again and Again): Measuring Password Strength by Simulating Password-Cracking Algorithms.",
					"The Science of Guessing: Analyzing an Anonymized Corpus of 70 Million Passwords.",
					"The Quest to Replace Passwords: A Framework for Comparative Evaluation of Web Authentication Schemes.",
					"ILR: Where'd My Gadgets Go?",
					"Space Traveling across VM: Automatically Bridging the Semantic Gap in Virtual Machine Introspection via Online Kernel Data Redirection.",
					"Smashing the Gadgets: Hindering Return-Oriented Programming Using In-place Code Randomization.",
					"Building Verifiable Trusted Path on Commodity x86 Computers."
				]
			},
			{
				"sub_name_abbr": "conf/sp/2012w",
				"sub_name": "2012 IEEE Symposium on Security and Privacy Workshops, San Francisco, CA, USA, May 24-25, 2012.",
				"count": 23,
				"papers": [
					"A Theoretical Analysis: Physical Unclonable Functions and the Software Protection Problem.",
					"A Method for Preventing \"Skipping\" Attacks.",
					"Side-Channel Analysis of Grøstl and Skein.",
					"The BlueJay Ultra-Lightweight Hybrid Cryptosystem.",
					"Slender PUF Protocol: A Lightweight, Robust, and Secure Authentication by Substring Matching.",
					"Privacy in Online Review Sites.",
					"Policy Aware Social Miner.",
					"Semantic Comparison of Security Policies: From Access Control Policies to Flow Properties.",
					"A Framework for Modeling Decision Making and Deception with Semantic Information.",
					"A Knowledge-Based Approach to Intrusion Detection Modeling.",
					"Privacy Control in Smart Phones Using Semantically Rich Reasoning and Context Modeling.",
					"Implementing Mental Models.",
					"Towards a Semantics of Phish.",
					"Bridging the Semantic Gap to Mitigate Kernel-Level Keyloggers.",
					"User Intention-Based Traffic Dependence Analysis for Anomaly Detection.",
					"Toward a Game Theoretic Model of Information Release in Social Media with Experimental Results.",
					"Using Consensus Clustering for Multi-view Anomaly Detection.",
					"Fog Computing: Mitigating Insider Data Theft Attacks in the Cloud.",
					"Lost in Translation: Improving Decoy Documents via Automated Translation.",
					"Insider Threats against Trust Mechanism with Watchdog and Defending Approaches in Wireless Sensor Networks.",
					"Proactive Insider Threat Detection through Graph Learning and Psychological Context.",
					"Forensic Methods for Detecting Insider Turning Behaviors.",
					"Decision Support Procedure in the Insider Threat Domain."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "32nd S&P 2011",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2011",
				"sub_name": "32nd IEEE Symposium on Security and Privacy, S&P 2011, 22-25 May 2011, Berkeley, California, USA.",
				"count": 34,
				"papers": [
					"Phonotactic Reconstruction of Encrypted VoIP Conversations: Hookt on Fon-iks.",
					"The Failure of Noise-Based Non-continuous Audio Captchas.",
					"Using Fingerprint Authentication to Reduce System Security: An Empirical Study.",
					"Silencing Hardware Backdoors.",
					"Defeating UCI: Building Stealthy and Malicious Hardware.",
					"Formalizing Anonymous Blacklisting Systems.",
					"Mobile Security Catching Up? Revealing the Nuts and Bolts of the Security of Mobile Devices.",
					"Verified Security for Browser Extensions.",
					"RePriv: Re-imagining Content Personalization and In-browser Privacy.",
					"I Still Know What You Visited Last Summer: Leaking Browsing History via User Interaction and Side Channel Attacks.",
					"Verification of Information Flow and Access Control Policies with Dependent Types.",
					"Inference of Expressive Declassification Policies.",
					"The Complexity of Intransitive Noninterference.",
					"SCION: Scalability, Control, and Isolation on Next-Generation Networks.",
					"\"You Might Also Like: \" Privacy Risks of Collaborative Filtering.",
					"Quantifying Location Privacy.",
					"Preventing Sybil Attacks by Privilege Attenuation: A Design Principle for Social Network Systems.",
					"PRISM: Program Replication and Integration for Seamless MILS.",
					"Virtuoso: Narrowing the Semantic Gap in Virtual Machine Introspection.",
					"HomeAlone: Co-residency Detection in the Cloud via Side-Channel Analysis.",
					"TxBox: Building Secure, Efficient Sandboxes with System Transactions.",
					"Differential Slicing: Identifying Causal Execution Differences for Security Applications.",
					"Automated Analysis of Security-Critical JavaScript APIs.",
					"Memoir: Practical State Continuity for Protected Modules.",
					"A Formalization of the Security Features of Physical Functions.",
					"Timing- and Termination-Sensitive Secure Information Flow: Exploring a New Approach.",
					"Click Trajectories: End-to-End Analysis of the Spam Value Chain.",
					"Design and Evaluation of a Real-Time URL Spam Filtering Service.",
					"How to Shop for Free Online - Security Analysis of Cashier-as-a-Service Based Web Stores.",
					"Cryptography in the Web: The Case of Cryptographic Design Flaws in ASP.NET.",
					"Cache Games - Bringing Access-Based Cache Attacks on AES to Practice.",
					"OpenConflict: Preventing Real Time Map Hacks in Online Games.",
					"Extending Nymble-like Systems.",
					"Verifiability, Privacy, and Coercion-Resistance: New Insights from a Case Study."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "31st S&P 2010",
		"info": "Berkeley/Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2010",
				"sub_name": "31st IEEE Symposium on Security and Privacy, S&P 2010, 16-19 May 2010, Berleley/Oakland, California, USA.",
				"count": 34,
				"papers": [
					"Reflections on the 30th Anniversary of the IEEE Symposium on Security and Privacy.",
					"History of US Government Investments in Cybersecurity Research: A Personal Perspective.",
					"Crossing the \"Valley of Death\": Transitioning Research into Commercial Products - A Personal Perspective.",
					"Inspector Gadget: Automated Extraction of Proprietary Gadgets from Malware Binaries.",
					"Synthesizing Near-Optimal Malware Specifications from Suspicious Behaviors.",
					"Identifying Dormant Functionality in Malware Programs.",
					"Reconciling Belief and Vulnerability in Information Flow.",
					"Towards Static Flow-Based Declassification for Legacy and Untrusted Programs.",
					"Noninterference through Secure Multi-execution.",
					"Object Capabilities and Isolation of Untrusted Web Applications.",
					"TrustVisor: Efficient TCB Reduction and Attestation.",
					"Overcoming an Untrusted Computing Base: Detecting and Removing Malicious Hardware Automatically.",
					"Tamper Evident Microprocessors.",
					"Side-Channel Leaks in Web Applications: A Reality Today, a Challenge Tomorrow.",
					"Investigation of Triangular Spamming: A Stealthy and Efficient Spamming Technique.",
					"A Practical Attack to De-anonymize Social Network Users.",
					"SCiFI - A System for Secure Face Identification.",
					"Round-Efficient Broadcast Authentication Protocols for Fixed Topology Classes.",
					"Revocation Systems with Very Small Private Keys.",
					"Authenticating Primary Users' Signals in Cognitive Radio Networks via Integrated Cryptographic and Wireless Link Signatures.",
					"Outside the Closed World: On Using Machine Learning for Network Intrusion Detection.",
					"All You Ever Wanted to Know about Dynamic Taint Analysis and Forward Symbolic Execution (but Might Have Been Afraid to Ask).",
					"State of the Art: Automated Black-Box Web Application Vulnerability Testing.",
					"A Proof-Carrying File System.",
					"Scalable Parametric Verification of Secure Systems: How to Verify Reference Monitors without Worrying about Data Structure Size.",
					"HyperSafe: A Lightweight Approach to Provide Lifetime Hypervisor Control-Flow Integrity.",
					"How Good Are Humans at Solving CAPTCHAs? A Large Scale Evaluation.",
					"Bootstrapping Trust in Commodity Computers.",
					"Chip and PIN is Broken.",
					"Experimental Security Analysis of a Modern Automobile.",
					"On the Incoherencies in Web Browser Access Control Policies.",
					"ConScript: Specifying and Enforcing Fine-Grained Security Policies for JavaScript in the Browser.",
					"TaintScope: A Checksum-Aware Directed Fuzzing Tool for Automatic Software Vulnerability Detection.",
					"A Symbolic Execution Framework for JavaScript."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "30th S&P 2009",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2009",
				"sub_name": "30th IEEE Symposium on Security and Privacy (S&P 2009), 17-20 May 2009, Oakland, California, USA.",
				"count": 26,
				"papers": [
					"Wirelessly Pickpocketing a Mifare Classic Card.",
					"Plaintext Recovery Attacks against SSH.",
					"Exploiting Unix File-System Races via Algorithmic Complexity Attacks.",
					"Practical Mitigations for Timing-Based Side-Channel Attacks on Modern x86 Processors.",
					"Noninterference for a Practical DIFC-Based Operating System.",
					"Native Client: A Sandbox for Portable, Untrusted x86 Native Code.",
					"Automatic Reverse Engineering of Malware Emulators.",
					"Prospex: Protocol Specification Extraction.",
					"Quantifying Information Leaks in Outbound Web Traffic.",
					"Automatic Discovery and Quantification of Information Leaks.",
					"CLAMP: Practical Prevention of Large-Scale Data Leaks.",
					"De-anonymizing Social Networks.",
					"Privacy Weaknesses in Biometric Sketches.",
					"The Mastermind Attack on Genomic Data.",
					"A Logic of Secure Systems and its Application to Trusted Computing.",
					"Formally Certifying the Security of Digital Signature Schemes.",
					"An Epistemic Approach to Coercion-Resistance for Electronic Voting Protocols.",
					"Sphinx: A Compact and Provably Secure Mix Format.",
					"DSybil: Optimal Sybil-Resistance for Recommendation Systems.",
					"Fingerprinting Blank Paper Using Commodity Scanners.",
					"Tempest in a Teapot: Compromising Reflections Revisited.",
					"Blueprint: Robust Prevention of Cross-site Scripting Attacks for Existing Browsers.",
					"Pretty-Bad-Proxy: An Overlooked Adversary in Browsers' HTTPS Deployments.",
					"Secure Content Sniffing for Web Browsers, or How to Stop Papers from Reviewing Themselves.",
					"It's No Secret. Measuring the Security and Reliability of Authentication via \"Secret\" Questions.",
					"Password Cracking Using Probabilistic Context-Free Grammars."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "29th S&P 2008",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2008",
				"sub_name": "2008 IEEE Symposium on Security and Privacy (S&P 2008), 18-21 May 2008, Oakland, California, USA.",
				"count": 28,
				"papers": [
					"SybilLimit: A Near-Optimal Social Network Defense against Sybil Attacks.",
					"Anonymous Networking with Minimum Latency in Multihop Networks.",
					"Spot Me if You Can: Uncovering Spoken Phrases in Encrypted VoIP Conversations.",
					"Preserving Caller Anonymity in Voice-over-IP Networks.",
					"Jamming-resistant Key Establishment using Uncoordinated Frequency Hopping.",
					"Casting out Demons: Sanitizing Training Data for Anomaly Sensors.",
					"Efficient and Robust TCP Stream Normalization.",
					"Robust De-anonymization of Large Sparse Datasets.",
					"Pacemakers and Implantable Cardiac Defibrillators: Software Radio Attacks and Zero-Power Defenses.",
					"Automatic Patch-Based Exploit Generation is Possible: Techniques and Implications.",
					"Compromising Reflections-or-How to Read LCD Monitors around the Corner.",
					"ClearShot: Eavesdropping on Keyboard Input from Video.",
					"XFA: Faster Signature Matching with Extended Automata.",
					"Zero-Knowledge in the Applied Pi-calculus and Automated Verification of the Direct Anonymous Attestation Protocol.",
					"Towards Practical Privacy for Genomic Computation.",
					"Lares: An Architecture for Secure Active Monitoring Using Virtualization.",
					"Practical Proactive Integrity Preservation: A Basis for Malware Defense.",
					"Preventing Memory Error Exploits with WIT.",
					"Thinking Inside the Box: System-Level Failures of Tamper Proofing.",
					"Cloaker: Hardware Supported Rootkit Concealment.",
					"Predictable Design of Network-Based Covert Communication Systems.",
					"Verifying the Safety of User Pointer Dereferences.",
					"Expressive Declassification Policies and Modular Static Enforcement.",
					"Civitas: Toward a Secure Voting System.",
					"Fable: A Language for Enforcing User-defined Security Policies.",
					"Saner: Composing Static and Dynamic Analysis to Validate Sanitization in Web Applications.",
					"Secure Web Browsing with the OP Web Browser.",
					"Automated Formal Analysis of a Protocol for Secure File Sharing on Untrusted Storage."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "28th S&P 2007",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2007",
				"sub_name": "2007 IEEE Symposium on Security and Privacy (S&P 2007), 20-23 May 2007, Oakland, California, USA.",
				"count": 29,
				"papers": [
					"Accurate Real-time Identification of IP Prefix Hijacking.",
					"DSSS-Based Flow Marking Technique for Invisible Traceback.",
					"On the Safety and Efficiency of Firewall Policy Deployment.",
					"The Emperor's New Security Indicators.",
					"Cryptanalysis of a Cognitive Authentication Scheme (Extended Abstract).",
					"A Systematic Approach to Uncover Security Flaws in GUI Logic.",
					"Extended Abstract: Forward-Secure Sequential Aggregate Authentication.",
					"Extended Abstract: Provable-Security Analysis of Authenticated Encryption in Kerberos.",
					"Endorsed E-Cash.",
					"Network Flow Watermarking Attack on Low-Latency Anonymous Communication Systems.",
					"Improving the Robustness of Private Information Retrieval.",
					"Beyond Stack Inspection: A Unified Access-Control and Information-Flow Security Model.",
					"Usable Mandatory Integrity Protection for Operating Systems.",
					"Enforcing Semantic Integrity on Untrusted Clients in Networked Virtual Environments.",
					"Information Flow in the Peer-Reviewing Process.",
					"A Cryptographic Decentralized Label Model.",
					"Gradual Release: Unifying Declassification, Encryption and Key Release Policies.",
					"Fuzzy Multi-Level Security: An Experiment on Quantified Risk-Adaptive Access Control.",
					"Exploring Multiple Execution Paths for Malware Analysis.",
					"Lurking in the Shadows: Identifying Systemic Threats to Kernel Data.",
					"ShieldGen: Automatic Data Patch Generation for Unknown Vulnerabilities with Informed Probing.",
					"Minimal TCB Code Execution.",
					"Using Rescue Points to Navigate Software Recovery.",
					"Moats and Drawbridges: An Isolation Primitive for Reconfigurable Hardware Based Systems.",
					"Trojan Detection using IC Fingerprinting.",
					"On the Optimal Communication Complexity of Multiphase Protocols for Perfect Communication.",
					"Ciphertext-Policy Attribute-Based Encryption.",
					"Attacking the IPsec Standards in Encryption-only Configurations.",
					"Multi-Dimensional Range Query over Encrypted Data."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "27th S&P 2006",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2006",
				"sub_name": "2006 IEEE Symposium on Security and Privacy (S&P 2006), 21-24 May 2006, Berkeley, California, USA.",
				"count": 35,
				"papers": [
					"Message from the Program Chairs.",
					"Program Committee.",
					"External Reviewers.",
					"Towards Automatic Generation of Vulnerability-Based Signatures.",
					"MisleadingWorm Signature Generators Using Deliberate Noise Injection.",
					"Hamsa: Fast Signature Generation for Zero-day PolymorphicWorms with Provable Attack Resilience.",
					"Dataflow Anomaly Detection.",
					"A Framework for the Evaluation of Intrusion Detection Systems.",
					"Siren: Catching Evasive Malware (Short Paper).",
					"Fundamental Limits on the Anonymity Provided by the MIX Technique.",
					"Locating Hidden Servers.",
					"Practical Inference Control for Data Cubes (Extended Abstract).",
					"Deterring Voluntary Trace Disclosure in Re-encryption Mix Networks.",
					"New Constructions and Practical Applications for Private Stream Searching (Extended Abstract).",
					"A Computationally Sound Mechanized Prover for Security Protocols.",
					"A Logic for Constraint-based Security Protocol Analysis.",
					"Simulatable Security and Polynomially Bounded Concurrent Composability.",
					"Privacy and Contextual Integrity: Framework and Applications.",
					"FIREMAN: A Toolkit for FIREwall Modeling and ANalysis.",
					"Retrofitting Legacy Code for Authorization Policy Enforcement.",
					"Deriving an Information Flow Checker and Certifying Compiler for Java.",
					"Automatically Generating Malicious Disks using Symbolic Execution.",
					"Pixy: A Static Analysis Tool for Detecting Web Application Vulnerabilities (Short Paper).",
					"Cobra: Fine-grained Malware Analysis using Stealth Localized-executions.",
					"Integrity (I) Codes: Message Integrity Protection and Authentication Over Insecure Channels.",
					"Cognitive Authentication Schemes Safe Against Spyware (Short Paper).",
					"Cache Cookies for Browser Authentication (Extended Abstract).",
					"Secure Device Pairing based on a Visual Channel (Short Paper).",
					"SubVirt: Implementing malware with virtual machines.",
					"Practical Attacks on Proximity Identification Systems (Short Paper).",
					"On the Secrecy of Timing-Based Active Watermarking Trace-Back Techniques.",
					"A Safety-Oriented Platform for Web Applications.",
					"Tamper-Evident, History-Independent, Subliminal-Free Data Structures on PROM Storage-or-How to Store Ballots on a Voting Machine (Extended Abstract).",
					"Analysis of the Linux Random Number Generator.",
					"The Final Nail in WEP's Coffin."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "26th S&P 2005",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2005",
				"sub_name": "2005 IEEE Symposium on Security and Privacy (S&P 2005), 8-11 May 2005, Oakland, CA, USA.",
				"count": 20,
				"papers": [
					"Message from the Program Chairs.",
					"Conference Organizers.",
					"Program Committee.",
					"Language-Based Generation and Evaluation of NIDS Signatures.",
					"Efficient Intrusion Detection using Automaton Inlining.",
					"Semantics-Aware Malware Detection.",
					"Distributed Detection of Node Replication Attacks in Sensor Networks.",
					"Detection of Denial-of-Message Attacks on Sensor Network Broadcasts.",
					"Distributed Proving in Access-Control Systems.",
					"On Safety in Discretionary Access Control.",
					"Seeing-Is-Believing: Using Camera Phones for Human-Verifiable Authentication.",
					"A Generic Attack on Checksumming-Based Software Tamper Resistance.",
					"Towards Constant Bandwidth Overhead Integrity Checking of Untrusted Data.",
					"BIND: A Fine-Grained Attestation Service for Secure Distributed Systems.",
					"Relating Symbolic and Cryptographic Secrecy.",
					"Low-Cost Traffic Analysis of Tor.",
					"Leap-Frog Packet Linking and Diverse Key Distributions for Improved Integrity in Network Broadcasts.",
					"Remote Physical Device Fingerprinting.",
					"Polygraph: Automatically Generating Signatures for Polymorphic Worms.",
					"Worm Origin Identification Using Random Moonwalks."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "25th S&P 2004",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2004",
				"sub_name": "2004 IEEE Symposium on Security and Privacy (S&P 2004), 9-12 May 2004, Berkeley, CA, USA.",
				"count": 19,
				"papers": [
					"Keyboard Acoustic Emanations.",
					"Effects of Mobility and Multihoming on Transport-Protocol Security.",
					"Analysis of an Electronic Voting System.",
					"Access Control By Tracking Shallow Execution History.",
					"A Layered Design of Discretionary Access Controls with Decidable Safety Properties.",
					"Symmetric Encryption in Automatic Analyses for Confidentiality against Active Adversaries.",
					"Automatic Proof of Strong Secrecy for Security Protocols.",
					"An Empirical Analysis of Target-Resident DoS Filters.",
					"Large-Scale IP Traceback in High-Speed Internet: Practical Techniques and Theoretical Foundation.",
					"SIFF: A Stateless Internet Flow Filter to Mitigate DDoS Flooding Attacks.",
					"Safety in Automated Trust Negotiation.",
					"Securing OLAP Data Cubes Against Privacy Breaches.",
					"Run-time Principals in Information-flow Type Systems.",
					"Formalizing Sensitivity in Static Analysis for Intrusion Detection.",
					"Fast Portscan Detection Using Sequential Hypothesis Testing.",
					"On-the-Fly Verification of Rateless Erasure Codes for Efficient Content Distribution.",
					"Multicast Authentication in Fully Adversarial Networks.",
					"An Interleaved Hop-by-Hop Authentication Scheme for Filtering of Injected False Data in Sensor Networks.",
					"SWATT: SoftWare-based ATTestation for Embedded Devices."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "24th S&P 2003",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2003",
				"sub_name": "2003 IEEE Symposium on Security and Privacy (S&P 2003), 11-14 May 2003, Berkeley, CA, USA.",
				"count": 19,
				"papers": [
					"Mixminion: Design of a Type III Anonymous Remailer Protocol.",
					"Probabilistic Treatment of MIXes to Hamper Traffic Analysis.",
					"Defending Anonymous Communications Against Passive Logging Attack.",
					"Active Mapping: Resisting NIDS Evasion without Altering Traffic.",
					"Anomaly Detection Using Call Stack Information.",
					"Defending Against Denial-of-Service Attacks with Puzzle Auction.",
					"Pi: A Path Identification Mechanism to Defend against DDoS Attack.",
					"A Unified Scheme for Resource Protection in Automated Trust Negotiation.",
					"Beyond Proof-of-Compliance: Safety and Availability Analysis in Trust Management.",
					"Intransitive Non-Interference for Cryptographic Purpose.",
					"Using Memory Errors to Attack a Virtual Machine.",
					"Specifying and Verifying Hardware for Tamper-Resistant Software.",
					"Secret Handshakes from Pairing-Based Key Agreements.",
					"Random Key Predistribution Schemes for Sensor Networks.",
					"Hardening Functions for Large Scale Distributed Computations.",
					"A Practical Revocation Scheme for Broadcast Encryption Using Smart Cards.",
					"Using Replication and Partitioning to Build Secure Distributed Systems.",
					"Vulnerabilities in Synchronous IPC Designs.",
					"Garbage Collector Memory Accounting in Language-Based Systems."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "23rd S&P 2002",
		"info": "Berkeley, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2002",
				"sub_name": "2002 IEEE Symposium on Security and Privacy, Berkeley, California, USA, May 12-15, 2002.",
				"count": 21,
				"papers": [
					"Optical Time-Domain Eavesdropping Risks of CRT Displays.",
					"Statistical Identification of Encrypted Web Browsing Traffic.",
					"Partitioning Attacks: Or How to Rapidly Clone Some GSM Cards.",
					"Collaborative Filtering with Privacy.",
					"P5: A Protocol for Scalable Anonymous Communication.",
					"Methods and Limitations of Security Policy Reconciliation.",
					"On the Composition of Secure Systems.",
					"Binder, a Logic-Based Security Language.",
					"Design of a Role-Based Trust-Management Framework.",
					"Constrained Delegation.",
					"Using Programmer-Written Compiler Extensions to Catch Security Holes.",
					"Improving Computer Security Using Extended Static Checking.",
					"Noninterference and Intrusion Detection.",
					"\"Why 6?\" Defining the Operational Limits of Stide, an Anomaly-Based Intrusion Detector.",
					"Alert Correlation in a Cooperative Intrusion Detection Framework.",
					"Intrusion-Tolerant Enclaves.",
					"Efficient Multicast Packet Authentication Using Signature Amortization.",
					"Self-Healing Key Distribution with Revocation.",
					"Expander Graphs for Digital Stream Authentication and Robust Overlay Networks.",
					"Automated Generation and Analysis of Attack Graphs.",
					"Stateful Intrusion Detection for High-Speed Networks."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "22nd S&P 2001",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2001",
				"sub_name": "2001 IEEE Symposium on Security and Privacy, Oakland, California, USA May 14-16, 2001.",
				"count": 19,
				"papers": [
					"Cryptographic Security for Mobile Code.",
					"Networked Cryptographic Devices Resilient to Capture.",
					"Protection of Keys against Modification Attack.",
					"Data Mining Methods for Detection of New Malicious Executables.",
					"Evaluation of Intrusion Detectors: A Decision Theory Approach.",
					"On Confidentiality and Algorithms.",
					"Preserving Information Flow Properties under Refinement.",
					"Understanding Trust Management Systems.",
					"SD3: A Trust Management System with Certified Evaluation.",
					"Formal Treatment of Certificate Revocation under Communal Access Control.",
					"Information-Theoretic Measures for Anomaly Detection.",
					"A Fast Automaton-Based Method for Detecting Anomalous Program Behaviors.",
					"Intrusion Detection via Static Analysis.",
					"Performance of Public-Key-Enabled Kerberos Authentication in Large Networks.",
					"A Model for Asynchronous Reactive Systems and its Application to Secure Message Transmission.",
					"Cryptographic Key Generation from Voice.",
					"A Trend Analysis of Exploitations.",
					"Graph-Based Authentication of Digital Streams.",
					"ELK, A New Protocol for Efficient Large-Group Key Distribution."
				]
			}
		]
	},
	{
		"year": "2000",
		"name": "21st S&P 2000",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/2000",
				"sub_name": "2000 IEEE Symposium on Security and Privacy, Berkeley, California, USA, May 14-17, 2000.",
				"count": 24,
				"papers": [
					"Access Control Meets Public Key Infrastructure, Or: Assigning Roles to Strangers.",
					"A Security Infrastructure for Distributed Java Applications.",
					"A Practically Implementable and Tractable Delegation Logic.",
					"Practical Techniques for Searches on Encrypted Data.",
					"Efficient Authentication and Signing of Multicast Streams over Lossy Channels.",
					"Is Electronic Privacy Achievable?",
					"Privacy Technology Lessons from Healthcare.",
					"Searching for a Solution: Engineering Tradeoffs and the Evolution of Provably Secure Protocols.",
					"Authentication Tests.",
					"Protocol-Independent Secrecy.",
					"Robust Nonproprietary Software.",
					"Security and Source Code Access: Issues and Realities.",
					"Open Source in Security: Visiting the Bizarre.",
					"Will Openish Source Really Improve Security.",
					"Using Conservation of Flow as a Security Mechanism in Network Protocols.",
					"Logic Induction of Valid Behavior Specifications for Intrusion Detection.",
					"Using Model Checking to Analyze Network Vulnerabilities.",
					"Verifying the EROS Confinement Mechanism.",
					"Fang: A Firewall Analysis Engine.",
					"A More Efficient Use of Delta-CRLs.",
					"An Efficient, Dynamic and Trust Preserving Public Key Infrastructure.",
					"Kronos: A Scalable Group Re-Keying Approach for Secure Multicast.",
					"LOMAC: Low Water-Mark Integrity Protection for COTS Environments.",
					"IRM Enforcement of Java Stack Inspection."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "20th S&P 1999",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1999",
				"sub_name": "1999 IEEE Symposium on Security and Privacy, Oakland, California, USA, May 9-12, 1999.",
				"count": 26,
				"papers": [
					"Hardening COTS Software with Generic Software Wrappers.",
					"Firmato: A Novel Firewall Management Toolkit.",
					"Flexible Policy-Directed Code Safety.",
					"Local Reconfiguration Policies.",
					"A User-Centered, Modular Authorization Service Built on an RBAC Foundation.",
					"Secure Communications Processing for Distributed Languages.",
					"Verification of Control Flow based Security Properties.",
					"Twenty Years of Cryptography in the Open Literature.",
					"20 Years of Operating Systems Security.",
					"Twenty Years of Evaluation Criteria and Commercial Technology.",
					"20 Years of Covert Channel Modeling and Analysis.",
					"Twenty Years of Formal Methods.",
					"Network Security: Then and Now, or, 20 Years in 10 Minutes.",
					"A Data Mining Framework for Building Intrusion Detection Models.",
					"Detecting Intrusions using System Calls: Alternative Data Models.",
					"Detecting Computer and Network Misuse through the Production-based Expert System Toolset (P-BEST).",
					"A Multi-Threading Architecture for Multilevel Secure Transaction Processing.",
					"Specification and Enforcement of Classification and Inference Constraints.",
					"A Test for Non-Disclosure in Security Level Translations.",
					"Software Smart Cards via Cryptographic Camouflage.",
					"Analysis of the Internet Key Exchange Protocol using the NRL Protocol Analyzer.",
					"How Computers Will Be Used Differently in the Next Twenty Years.",
					"The Hardware Environment.",
					"Software Technology of the Future.",
					"Twenty Year Time Capsule Panel: The Future of Networking.",
					"The Future Is Not Assured - But It Should Be."
				]
			}
		]
	},
	{
		"year": "1998",
		"name": "19th S&P 1998",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1998",
				"sub_name": "Security and Privacy - 1998 IEEE Symposium on Security and Privacy, Oakland, CA, USA, May 3-6, 1998, Proceedings.",
				"count": 19,
				"papers": [
					"Access Control in an Open Distributed Environment.",
					"Ensuring Continuity During Dynamic Security Policy Reconfiguration in DTE.",
					"Composing Partially-Specified Systems.",
					"Secure Execution of Java Applets using a Remote Playground.",
					"Understanding Java Stack Inspection.",
					"Efficient Key Distribution for Slow Computing Devices: Achieving Fast Over the Air Activation for Wireless Systems.",
					"Efficient and Practical Fair Exchange Protocols with Off-Line TTP.",
					"Asynchronous Protocols for Optimistic Fair Exchange.",
					"An Automated Approach for Identifying Potential Vulnerabilities in Software.",
					"Detecting Disruptive Routers: A Distributed Network Monitoring Approach.",
					"Timing Attacks Against Trusted Path.",
					"Partial Security Policies to Support Timeliness in Secure Real-Time Databases.",
					"On Enabling Secure Applications Through Off-Line Biometric Identification.",
					"Strand Spaces: Why is a Security Protocol Correct?",
					"On the Formal Definition of Separation-of-Duty Policies and their Composition.",
					"Complete, Safe Information Flow with Decentralized Labels.",
					"Stack and Queue Integrity on Hostile Platforms.",
					"Necessity and Realization of Universally Verifiable Secret Sharing.",
					"Towards Mobile Cryptography."
				]
			}
		]
	},
	{
		"year": "1997",
		"name": "18th S&P 1997",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1997",
				"sub_name": "1997 IEEE Symposium on Security and Privacy, May 4-7, 1997, Oakland, CA, USA.",
				"count": 30,
				"papers": [
					"Message from the Program Chairs.",
					"Conference Committee.",
					"Is the Trusted Computing Base Concept Fundamentally Flawed?",
					"Some weaknesses of the TCB model.",
					"Is the Reference Monitor Concept Fatally Flawed? The Case for the Negative.",
					"Toward Acceptable Metrics of Authentication.",
					"An Authorization Scheme For Distributed Object Systems.",
					"A Logical Language for Expressing Authorizations.",
					"Anonymous Connections and Onion Routing.",
					"The Design and Implementation of a Multilevel Secure Log Manager.",
					"A Secure and Reliable Bootstrap Architecture.",
					"An MBone Proxy for an Application Gateway Firewall.",
					"Secure Software Architectures.",
					"A General Theory of Security Properties.",
					"Analyzing Consistency of Security Policies.",
					"Ensuring Assurance in Mobile Computing.",
					"Filtering Postures: Local Enforcement for Global Policies.",
					"Providing flexibility in information flow control for object oriented systems.",
					"Automated analysis of cryptographic protocols using Mur-phi.",
					"How to Systematically Classify Computer Security Intrusions.",
					"Surviving information warfare attacks on databases.",
					"Execution Monitoring of Security-Critical Programs in Distributed Systems: A Specification-Based Approach.",
					"Catalytic Inference Analysis: Detecting Inference Threats due to Knowledge Discovery.",
					"Security in Innovative New Operating Systems.",
					"Research on Proof-Carrying Code for Untrusted-Code Security.",
					"Access Control for the SPIN Extensible Operating System.",
					"Escort: Securing Scout Paths.",
					"Analysis of a Denial of Service Attack on TCP.",
					"Deniable Password Snatching: On the Possibility of Evasive Electronic Espionage.",
					"Number Theoretic Attacks on Secure Password Schemes."
				]
			}
		]
	},
	{
		"year": "1996",
		"name": "17th S&P 1996",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1996",
				"sub_name": "1996 IEEE Symposium on Security and Privacy, May 6-8, 1996, Oakland, CA, USA.",
				"count": 24,
				"papers": [
					"Message from the Program Chairs.",
					"Conference Committee.",
					"An Analysis of the Timed Z-channel.",
					"Defining Noninterference in the Temporal Logic of Actions.",
					"Goals for Computer Security Education.",
					"Computer Security Training and Education: A Needs Analysis.",
					"A Security Policy Model for Clinical Information Systems.",
					"What do We Mean by Entity Authentication?",
					"A Fair Non-repudiation Protocol.",
					"Limitations on Design Principles for Public Key Protocols.",
					"Ensuring Atomicity of Multilevel Transactions.",
					"View-Based Access Control with High Assurance.",
					"Supporting Multiple Access Control Policies in Database Systems.",
					"An Immunological Approach to Change Detection: Algorithms, Analysis and Implications.",
					"A Sense of Self for Unix Processes.",
					"Cryptovirology: Extortion-Based Security Threats and Countermeasures.",
					"A Security Model of Dynamic Labeling Providing a Tiered Approach to Verification.",
					"A Communication Agreement Framework for Access/Action Control.",
					"Decentralized Trust Management.",
					"Security Properties and CSP.",
					"Java Security: From HotJava to Netscape and Beyond.",
					"On two Proposals for On-line Bankcard Payments using Open Networks: Problems and Solutions.",
					"Secure Network Objects.",
					"Run-Time Security Evaluation (RTSE) for Distributed Applications."
				]
			}
		]
	},
	{
		"year": "1995",
		"name": "16th S&P 1995",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1995",
				"sub_name": "Proceedings of the 1995 IEEE Symposium on Security and Privacy, Oakland, California, USA, May 8-10, 1995.",
				"count": 20,
				"papers": [
					"The design and implementation of a secure auction service.",
					"Cryptographic credit control in pre-payment metering systems.",
					"Preserving privacy in a network of mobile computers.",
					"Holding intruders accountable on the Internet.",
					"Integrating security in CORBA based object architectures.",
					"Practical Domain and Type Enforcement for UNIX.",
					"A multilevel file system for high assurance.",
					"Formal methods in the THETA kernel.",
					"Absorbing covers and intransitive non-interference.",
					"CSP and determinism in security modelling.",
					"The semantics and expressive power of the MLR data model.",
					"A network version of the Pump.",
					"An architecture for covert channel control in realtime networks and multiprocessors.",
					"Version pool management in a multilevel secure multiversion transaction manager.",
					"Capacity estimation and auditability of network covert channels.",
					"Supporting security requirements in multilevel real-time databases.",
					"The Intel 80×86 processor architecture: pitfalls for secure systems.",
					"Recent-secure authentication: enforcing revocation in distributed systems.",
					"Reasoning about accountability in protocols for electronic commerce.",
					"The Interrogator model."
				]
			}
		]
	},
	{
		"year": "1994",
		"name": "15th S&P 1994",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1994",
				"sub_name": "1994 IEEE Computer Society Symposium on Research in Security and Privacy, Oakland, CA, USA, May 16-18, 1994.",
				"count": 19,
				"papers": [
					"A model for secure protocols and their compositions.",
					"On unifying some cryptographic protocol logics.",
					"Eliminating formal flows in automated information flow analysis.",
					"Mode security: an infrastructure for covert channel suppression.",
					"Simple timing channels.",
					"Asynchronous composition and required security conditions.",
					"A general theory of composition for trace sets closed under selective interleaving functions.",
					"Ensuring data security in interrelated tabular data.",
					"Collecting garbage in multilevel secure object stores.",
					"Prudent engineering practice for cryptographic protocols.",
					"Generating formal cryptographic protocol specifications.",
					"A low cost, high speed encryption system and method.",
					"Inference channel-free integrity constraints in multilevel relational databases.",
					"Elimination of inference channels by optimal upgrading.",
					"A secure group membership protocol.",
					"The complexity and composability of secure interoperation.",
					"Self-nonself discrimination in a computer.",
					"Extending the schematic protection model. I. Conditional tickets and authentication.",
					"On the minimality of testing for rights in transformation models."
				]
			}
		]
	},
	{
		"year": "1993",
		"name": "14th S&P 1993",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1993",
				"sub_name": "1993 IEEE Computer Society Symposium on Research in Security and Privacy, Oakland, CA, USA, May 24-26, 1993.",
				"count": 17,
				"papers": [
					"Measuring and modeling computer virus prevalence.",
					"USTAT: a real-time intrusion detection system for UNIX.",
					"Preventing denial and forgery of causal relationships in distributed systems.",
					"Protocol design for integrity protection.",
					"Authentication method with impersonal token cards.",
					"Interconnecting domains with heterogeneous key distribution and authentication protocols.",
					"Modelling a fuzzy time system.",
					"On introducing noise into the bus-contention channel.",
					"A logical analysis of authorized and prohibited information flows.",
					"The cascade vulnerability problem.",
					"A model of atomicity for multilevel transactions.",
					"Achieving stricter correctness requirements in multilevel secure databases.",
					"Trust relationships in secure systems-a distributed authentication perspective.",
					"A logical language for specifying cryptographic protocol requirements.",
					"A semantic model for authentication protocols.",
					"Detection and elimination of inference channels in multilevel relational database systems.",
					"Assuring Distributed Trusted Mach."
				]
			}
		]
	},
	{
		"year": "1992",
		"name": "13th S&P 1992",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1992",
				"sub_name": "1992 IEEE Computer Society Symposium on Research in Security and Privacy, Oakland, CA, USA, May 4-6, 1992.",
				"count": 22,
				"papers": [
					"On inter-realm authentication in large distributed systems.",
					"Integrating security in a group oriented distributed system.",
					"Authorization in distributed systems: a formal approach.",
					"Lattice scheduling and covert channels.",
					"The influence of delay upon an idealized channel's bandwidth.",
					"Encrypted key exchange: password-based protocols secure against dictionary attacks.",
					"On message integrity in cryptographic protocols.",
					"Roles in cryptographic protocols.",
					"The typed access matrix model.",
					"A resource allocation model for denial of service.",
					"Non-monotonic transformation of access rights.",
					"A logical approach to multilevel security of probabilistic systems.",
					"Using traces based on procedure calls to reason about composability.",
					"A multilevel transaction problem for multilevel secure database systems and its solution for the replicated architecture.",
					"A two snapshot algorithm for concurrency control in multi-level secure databases.",
					"Alternative correctness criteria for concurrent execution of transactions in multilevel secure databases.",
					"Evolution of a trusted B3 window system prototype.",
					"A neural network component for an intrusion detection system.",
					"An optimal solution to the secure reader-writer problem.",
					"Security for object-oriented database systems.",
					"A 'natural' decomposition of multi-level relations.",
					"BLACKER: security for the DDN examples of A1 security engineering trades."
				]
			}
		]
	},
	{
		"year": "1991",
		"name": "12th S&P 1991",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1991",
				"sub_name": "Proceedings of the 1991 IEEE Symposium on Security and Privacy, Oakland, California, USA, May 20-22, 1991.",
				"count": 28,
				"papers": [
					"An Analysis of Covert Timing Channels.",
					"Reducing Timing Channels with Fuzzy Time.",
					"Toward a Mathematical Foundation for Information Flow Security.",
					"Covert Flow Trees: A Technique for Identifying and Analyzing Covert Storage Channels.",
					"Storage Channels in Disk Arm Optimization.",
					"Modeling Nondisclosure in Terms of the Subject-Instruction Stream.",
					"A Separation Model for Virtual Machine Monitors.",
					"Safety Analysis for the Extended Schematic Protection Model.",
					"A Taxonomy for Information Flow Policies and Models.",
					"Intrusion Tolerance in Distributed Computing Systems.",
					"Verification of Secure Distributed Systems in Higher Order Logic: A Modular Approach Using Generic Components.",
					"Applying a Theory of Modules and Interfaces to Security Verification.",
					"The Use of Logic in the Analysis of Cryptographic Protocols.",
					"Exploring the BAN Approach to Protocol Analysis.",
					"A System for the Specification and Verification of Key Management Protocols.",
					"Toward an Approach to Measuring Software Trust.",
					"On the Buzzword \"Security Policy\".",
					"SPX: Global Authentication Using Public Key Certificates.",
					"Protecting Security Information in Distributed Systems.",
					"An Analysis of the Proxy Problem in Distributed Systems.",
					"Microdata Disclosure Limitation in Statistical Databases: Query Size and Random Sample Query Control.",
					"Discretionary Access Controls in a High-Performance Object Management System.",
					"A Novel Decomposition of Multilevel Relations into Single-Level Relations.",
					"The SRI IDES Statistical Anomaly Detector.",
					"A Pattern-Oriented Intrusion-Detection Model and Its Applications.",
					"Directed-Graph Epidemiological Models of Computer Viruses.",
					"Variable Noise Effects Upon a Simple Timing Channel.",
					"The Turing Test and Non-Information Flow."
				]
			}
		]
	},
	{
		"year": "1990",
		"name": "11th S&P 1990",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1990",
				"sub_name": "Proceedings of the 1990 IEEE Symposium on Security and Privacy, Oakland, California, USA, May 7-9, 1990.",
				"count": 34,
				"papers": [
					"A VMM Security Kernel for the VAX Architecture.",
					"An Architecture for Practical Delegation in a Distributed System.",
					"Practical Authentication for Distributed Computing.",
					"SP3 Peer Identification.",
					"The Army Secure Operating System.",
					"Specification and Verification of the ASOS Kernel.",
					"Integrating an Object-Oriented Data Model with Multilevel Security.",
					"A Little Knowledge Goes a Long Way: Faster Detection of Compromised Data in 2-D Tables.",
					"Extending the Brewer-Nash Model to a Multilevel Context.",
					"Polyinstantiation Integrity in Multilevel Relations.",
					"Naming and Grouping Privileges to Simplify Security Management in Large Databases.",
					"Referential Secrecy.",
					"Information Flow in Nondeterministic Systems.",
					"Constructively Using Noninterference to Analyze Systems.",
					"Probabilistic Interference.",
					"Security Models and Information Flow.",
					"Beyond the Pale of MAC and DAC-Defining New Forms of Access Control.",
					"Some Conundrums Concerning Separation of Duty.",
					"The Role of Trust in Protected Mail.",
					"On the Formal Specification and Verification of a Multiparty Session Protocol.",
					"Reasoning about Belief in Cryptographic Protocols.",
					"A Security Architecture and Mechanism for Data Confidentiality in TCP/IP Protocols.",
					"The Auditing Facility for a VMM Security Kernel.",
					"Adaptive Real-Time Anomaly Detection Using Inductively Generated Sequential Patterns.",
					"Auditing the Use of Covert Storage Channels in Secure Systems.",
					"A Network Security Monitor.",
					"The Deductive Theory Manager: A Knowledge Based System for Formal Verification.",
					"Formal Construction of Provably Secure Systems with Cartesiana.",
					"Verifying a Hardware Security Architecture.",
					"A Hierarchical Methodology for Verifying Microprogrammed Microprocessors.",
					"Transaction Processing in Multilevel-Secure Databases Using Replicated Architecture.",
					"Multiversion Concurrency Control for Multilevel Secure Database Systems.",
					"Modeling Security-Relevant Data Semantics.",
					"Information Privacy Issues for the 1990s."
				]
			}
		]
	},
	{
		"year": "1989",
		"name": "10th S&P 1989",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1989",
				"sub_name": "Proceedings of the 1989 IEEE Symposium on Security and Privacy, Oakland, California, USA, May 1-3, 1989.",
				"count": 33,
				"papers": [
					"Network Security: The Parts of the Sum.",
					"Statistical Models of Trust: TCBs vs. People.",
					"Symbol Security Condition Considered Harmful.",
					"New Methods for Immediate Revocation.",
					"A Secure Identity-Based Capability System.",
					"Access Mediation in a Message Passing Kernel.",
					"A Formal Model for UNIX Setuid.",
					"Policy vs. Mechanism in the Secure TUNIS Operating System.",
					"The Incorporation of Multi-Level IPC into UNIX.",
					"Aggregation and Inference: Facts and Fallacies.",
					"A Security Model for Object-Oriented Databases.",
					"A Security Policy for an A1DBMS (a Trusted Subject).",
					"On the Cell Suppression by Merging Technique in the Lattice Model of Summary Tables.",
					"Using Narrowing in the Analysis of Key Management Protocols.",
					"A Software Engineering Approach to Designing Trustworthy Software.",
					"Formal Model of a Trusted File Server.",
					"LOCK Trak: Navigating Uncharted Space.",
					"Tea and I: An Allergy.",
					"Security Issues in Policy Routing.",
					"The Hierarchical Model of Distributed System Security.",
					"The Chinese Wall Security Policy.",
					"A \"New\" Security Policy Model.",
					"A Framework for Expressing Models of Security Policy.",
					"On the Derivation of Secure Components.",
					"A Model for Secure Information Flow.",
					"Transformation of Access Rights.",
					"A Model for Specifying Multi-Granularity Integrity Policies.",
					"Detection of Anomalous Computer Session Activity.",
					"Layering Central Authentication on Existing Distributed System Terminal Services.",
					"Authenticated Group Key Distribution Scheme for a Large Distributed Network.",
					"Defending Systems against Viruses through Cryptographic Authentication.",
					"A Proposal for a Verification-Based Virus Filter.",
					"With Microscope and Tweezers: An Analysis of the Internet Virus of November 1988."
				]
			}
		]
	},
	{
		"year": "1988",
		"name": "9th S&P 1988",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1988",
				"sub_name": "Proceedings of the 1988 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 18-21, 1988.",
				"count": 24,
				"papers": [
					"The algebra of security.",
					"Concerning 'modeling' of computer security.",
					"Security specifications.",
					"A secure distributed operating system.",
					"Extended discretionary access controls.",
					"A fault tolerance approach to computer viruses.",
					"A prototype real-time intrusion-detection expert system.",
					"Views as the security objects in a multilevel secure relational database management system.",
					"ASDViews [relational databases].",
					"Inference aggregation detection in database management systems.",
					"A bandwidth computation model for covert storage channels and its applications.",
					"Reasoning about knowledge in multilevel secure distributed systems.",
					"Implementing commercial data integrity with secure capabilities.",
					"Using mandatory integrity to enforce 'commercial' security.",
					"The trusted path between SMITE and the user.",
					"Cascaded authentication.",
					"Reverification of a microprocessor.",
					"Noninterference and the composability of security properties.",
					"A formal specification and verification method for the prevention of denial of service.",
					"An axiomatic basis of trust in distributed systems.",
					"Security policy modeling for the next-generation packet switch.",
					"The SeaView security model.",
					"A near-term design for the SeaView multilevel database system.",
					"Controlling logical inference in multilevel database systems."
				]
			}
		]
	},
	{
		"year": "1987",
		"name": "8th S&P 1987",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1987",
				"sub_name": "Proceedings of the 1987 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 27-29, 1987.",
				"count": 26,
				"papers": [
					"Compartimented Mode Workstation: Results Through Prototyping.",
					"The Design of an Effective Auditing Subsystem.",
					"Exploiting the Dual Nature of Sensitivity Labels.",
					"Limiting the Damage Potential of Discretionary Trojan Horses.",
					"ABYSS: A Trusted Architecture for Software Protection.",
					"Physical Security for the µABYSS System.",
					"Covert Channel Capacity.",
					"Information Flow and Invariance.",
					"A Formal Method for the Identification of Covert Storage Channels in Source Code.",
					"Graph Homomorphisms and the Design of Secure Computer Systems.",
					"A Graph-Theoretic Formulation of Multilevel Secure Distributed Systems: An Overview.",
					"Toward Verified Execution Environments.",
					"A Universal Theory of Information Flow.",
					"Reasoning About Security Models.",
					"Using Formal Verification Techniques to Analyze Encryption Protocols.",
					"Coding for a Believable Specification to Implementation Mapping.",
					"A Model for Multilevel Security Based on Operator Nets.",
					"Specifications for Multi-Level Security and a Hook-Up Property.",
					"A Basis for Secure Communication in Large Distributed Systems.",
					"Visa Scheme for Inter-Organization Network Security.",
					"A Comparison of Commercial and Military Computer Security Policies.",
					"Checking Classification Constraints for Consistency and Completeness.",
					"Data Dependencies and Inference Control in Multilevel Relational Database Systems.",
					"The Integrity Lock Architecture and Its Application to Message Systems: Reducing Covert Channels.",
					"A Multilevel Relational Data Model.",
					"Multilevel Security for Knowledge-Based Systems."
				]
			}
		]
	},
	{
		"year": "1986",
		"name": "7th S&P 1986",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1986",
				"sub_name": "Proceedings of the 1986 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 7-9, 1986.",
				"count": 23,
				"papers": [
					"Extending Ina Jo with Temporal Logic.",
					"An Experience Using Two Covert Channel Analysis Techniques on a Real System Design.",
					"Muse : A Computer Assisted Verification System.",
					"A Security Policy and Formal Top Level Specification for a Multi-Level Secure Local Area Network.",
					"A New Security Testing Method and Its Application to the Secure Xenix Kernel.",
					"Extending the Non-Interference Version of MLS for SAT.",
					"Some Owner Based Schemes with Dynamic Groups in the Schematic Protection Model.",
					"An Analysis of the Differences Between the Computer Security Practices in the Military and Private Sectors.",
					"Security in KeyKOS™.",
					"A Secure Capability Computer System.",
					"On Access Checking in Capability-Based Systems.",
					"On the Design and the Implementation of Secure Xenix Workstations.",
					"An Intrusion-Detection Model.",
					"A More Efficient Cryptographic Matchmaking Protocol for Use in the Absence of a Continuously Available Third Party.",
					"A Hierarchical Key Management Scheme for End-to-End Encryption in Internet Environments.",
					"Encrypted Database Design: Specialized Approaches.",
					"Views for Multilevel Database Security.",
					"Another Look at the Use of Noise Addition for Database Security.",
					"The Trusted Domain Machine: A Secure Communication Device for Security Guard Applications.",
					"Building Reliable Secure Computing Systems out of Unreliable Insecure Components.",
					"Intrusion-Tolerance Using Fine-Grain Fragmentation-Scattering.",
					"Factors Affecting Distributed System Security.",
					"A Global Authentication Service without Global Trust."
				]
			}
		]
	},
	{
		"year": "1985",
		"name": "6th S&P 1985",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1985",
				"sub_name": "1985 IEEE Symposium on Security and Privacy, Oakland, CA, USA, April 22-24, 1985.",
				"count": 25,
				"papers": [
					"Structuring Systems for Formal Verification.",
					"Trusted Software Verification: A Case Study.",
					"Analysis of the Hardware Verification of the Honeywell SCOMP.",
					"An Information Flow Tool for Gypsy.",
					"The Restricted Access Processor An Example of Formal Verification.",
					"Non-Discretionary Controls for Inter-Organization Networks.",
					"Network Security Overview.",
					"A Unification of Computer and Network Security Concepts.",
					"Cryptographic Protocol for Trustable Match Making.",
					"Polonium: An Identity Authentication System.",
					"How to (Selectively) Broadcast A Secret.",
					"A Database Encryption Scheme Which Allows the Computation of Statistics Using Encrypted Data.",
					"A Fast Signature Scheme Based on Quadratic Inequalities.",
					"Commutative Filters for Reducing Inference Threats in Multilevel Database Systems.",
					"Design Overview for Retrofitting Integrity-Lock Architecture onto a Commercial DBMS.",
					"Rounding and Inference Controlin Conceptual Models for Statistical Databases.",
					"Secure Ada Target: Issues, System Design, and Verification.",
					"Ada's Suitability for Trusted Computer Systems.",
					"Negotiated Access Control.",
					"Analysis of Acyclic Attenuating Systems for the SSR Protection Model.",
					"Issues in Discretionary Access Control.",
					"Computer Privacy in America: Conflicting Practices and Policy Choices.",
					"Security Considerations for Autonomous Robots.",
					"The Implementation of Secure Entity-Relationship Databases.",
					"Labeling Screen Output."
				]
			}
		]
	},
	{
		"year": "1984",
		"name": "5th S&P 1984",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1984",
				"sub_name": "Proceedings of the 1984 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 29 - May 2, 1984.",
				"count": 26,
				"papers": [
					"An Augmented Capability Architecture to Support Lattice Security and Traceability of Access.",
					"KVM/37O in Retrospect.",
					"Linus IV : An Experiment in Computer Security.",
					"Hardware Requirements for Secure Computer Systems: A Framework.",
					"Toward an Understanding of Extensible Architectures for Evaluated Trusted Computer System Products.",
					"Cryptographic Checksums for Multilevel Database Security.",
					"The Integrity-Lock Approach to Secure Database Management.",
					"Unwinding and Inference Control.",
					"A Secure One-Way Hash Function Built from DES.",
					"Searching for Public-Key Cryptosystems.",
					"A New Paradigm for Individuals in the Information Age.",
					"The Use of Ada as an Implementation Language in Formally Specified Systems.",
					"Practical Experience with an Ada-Based Formal Specification/Language on a Large Project.",
					"Ottawa Euclid and EVES: A Status Report.",
					"Analysis of a Kernel Verification.",
					"The Interrogator: A Tool for Cryptographic Protocol Security.",
					"Executable Logic Specifications: A New Approach to Computer Security.",
					"Formal Verification of a Secure Network with End-to-End Encryption.",
					"Multi-Level Security Based on Physical Distribution.",
					"Attacks on Computers: Congressional Hearings and Pending Legislation.",
					"A Formal Statement of the MMS Security Model.",
					"Comparison Paper between the Bell and LaPadula Model and the SRI Model.",
					"Design Experiences from the Multilevel Secure MCF Operating System.",
					"Formal Specification of a Multi-Level Secure Operating System.",
					"A Gypsy-Based Kernel.",
					"Multinet Gateway-Towards A1 Certification."
				]
			}
		]
	},
	{
		"year": "1983",
		"name": "4th S&P 1983",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1983",
				"sub_name": "Proceedings of the 1983 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 25-27, 1983.",
				"count": 21,
				"papers": [
					"Using Views in a Multilevel Secure Database Management System.",
					"Fingerprinting.",
					"The Many-Time Pad: Theme and Variations.",
					"Message Authentication with Manipulation Detection Code.",
					"Joint Encryption and Error-Correction Coding.",
					"Verification of Treaty Compliance Revisited.",
					"Recent Advances in the Design and Implementation of Large Integer Factorization Algorithms.",
					"New Key Generation Algorithms for Multilevel Security.",
					"Modified Architecture for the Sub-Keys Model.",
					"Evaluating Security Properties of Computer Systems.",
					"Security Enhancement through Product Evaluation.",
					"An Approach to Indentification of Minimum TCB Requirements for Various Threat/Risk Environments.",
					"The Channel Assignment Problem.",
					"SDC Secure Release Terminal Project.",
					"Processor-per-Domain Guard Architecture.",
					"The Provision of Security for User Data on Packet Switched Networks.",
					"A Distributed Secure System.",
					"Securing Networks: End-to-End Encrpytion vs. Link Encryption and Trusted Systems.",
					"A Note on the Denial-of-Service Problem.",
					"The VERUS Design Verification System.",
					"Secure Computer Systems: A Retrospective."
				]
			}
		]
	},
	{
		"year": "1982",
		"name": "3rd S&P 1982",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1982",
				"sub_name": "1982 IEEE Symposium on Security and Privacy, Oakland, CA, USA, April 26-28, 1982.",
				"count": 20,
				"papers": [
					"Non-Discretionery Controls for Commercial Applications.",
					"Security Policies and Security Models.",
					"A Preliminary Neval Surveillance OBMS Sacurity.",
					"Memoryless Inference Controls for Statistical Databases.",
					"Protection in the OSKAR Operating System: Goals, Concepts, Conseqeuences.",
					"Kernel Isolation for the PDP-11/70.",
					"A Practical Approach to Identifying Storage and Timing Channels.",
					"Precise Information Flow Analysis by Program Verification.",
					"Specification-to-Code Correlation.",
					"Privacy Protection in the 1980s.",
					"Specification of Key Distribution Protocols for Networks.",
					"Accelerating Computer Security Innovation.",
					"A Software Protection Scheme.",
					"Shared Database Access using Composed Encryption Functions.",
					"Cryptographic Relational Algebra.",
					"Forward Search as a Cryptanalytic Tool Against a Public Key.",
					"Digital Signitures with Blindfolded Arbitrators Who Cannot Form Alliances.",
					"A Multilevel Secure Local Area Network.",
					"A Practical Executive for Secure Communications.",
					"Pooling, Splitting, and Restituting Information to Overcome Total Failure of Some Channels of Communication."
				]
			}
		]
	},
	{
		"year": "1981",
		"name": "2nd S&P 1981",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1981",
				"sub_name": "1981 IEEE Symposium on Security and Privacy, Oakland, CA, USA, April 27-29, 1981.",
				"count": 18,
				"papers": [
					"Information Flow Analysis of Formal Specifications.",
					"Access Flow: A Protection Model which Integrates Access Control and Information Flow.",
					"The Role of a Well Defined Auditing Process in the Enforcement of Privacy Policy and Data Security.",
					"Mechanism Sufficiency Validation by Assignment.",
					"Restriciting Queries that Might Lead to Compromise.",
					"On the Transport of Privileges.",
					"A Complete Protection Model.",
					"Processing Multilevel Secure Objects.",
					"Half a Loaf is Better than None: Some Novel Message Integrity Problems.",
					"Future Applications of Cryptography.",
					"Security Proofs for Information Protection Systems.",
					"Required Cryptographic Authentication Criteria for Electronic Funds Transfer Systems.",
					"Trusted Computer Systems.",
					"Military Message Systems: Applying a Security Model.",
					"Hierarchical Protection Systems.",
					"The Structure of a Security Kernel for the Z8000 Multiprocessor.",
					"The Design of Secure CPU-Multiplexed Computer Systems: The Master/Slave Architecture.",
					"Security Kernels: A Solution or a Problem?"
				]
			}
		]
	},
	{
		"year": "1980",
		"name": "1st S&P 1980",
		"info": "Oakland, California, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sp/1980",
				"sub_name": "Proceedings of the 1980 IEEE Symposium on Security and Privacy, Oakland, California, USA, April 14-16, 1980.",
				"count": 19,
				"papers": [
					"An Overview of Transborder Data Flow Issues.",
					"A Model to Describe Protection Problems.",
					"Towards a Fail-Safe Approach to Secure Databases.",
					"On Security Flow Analysis in Computer Systems (Preliminary Report).",
					"The Secure Relational Database Management System Kernel: Three Years After.",
					"Practical Data-Swapping: The First Steps.",
					"Aspects of Data Security in General-Purpose Data Base Management Systems.",
					"A Module Definition Facility for Access Control in Distributed Data Base Systems.",
					"The Trusted Function in Secure Decentralized Processing.",
					"On the Difficulty of Computing Logarithms Over GF(qm).",
					"Secure Communications in the Presence of Pervasive Deceit.",
					"The Cryptographic Security of Compact Knapsacks (Preliminary Report).",
					"Protecting Shared Cryptographic Keys.",
					"The Master Key Problem.",
					"One Time Pads Are Key Safeguarding Schemes, Not Cryptosystems Fast Key Safeguarding Schemes (Threshold Schemes) Exist.",
					"Multi-Tiered Approach to System Security.",
					"Protocols for Public Key Cryptosystems.",
					"A System Architecture to Support a Verifiably Secure Multilevel Security System.",
					"Demonstrating Security for Trusted Applications on a Security Kernel Base."
				]
			}
		]
	}
]