[
    {
        "year": "2021",
        "name": "36th SEC 2021",
        "info": "Oslo, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2021",
                "sub_name": "ICT Systems Security and Privacy Protection - 36th IFIP TC 11 International Conference, SEC 2021, Oslo, Norway, June 22-24, 2021, Proceedings.",
                "count": 28,
                "papers": [
                    "XML Signature Wrapping Still Considered Harmful: A Case Study on the Personal Health Record in Germany.",
                    "Trust Me If You Can: Trusted Transformation Between (JSON) Schemas to Support Global Authentication of Education Credentials.",
                    "SIUV: A Smart Car Identity Management and Usage Control System Based on Verifiable Credentials.",
                    "A Performance Assessment of Free-to-Use Vulnerability Scanners - Revisited.",
                    "QuickBCC: Quick and Scalable Binary Vulnerable Code Clone Detection.",
                    "Automatic Inference of Taint Sources to Discover Vulnerabilities in SOHO Router Firmware.",
                    "ESQABE: Predicting Encrypted Search Queries.",
                    "Reconnection-Based Covert Channels in Wireless Networks.",
                    "Minecraft Altered Skin Channel (MASC).",
                    "Lattice-Based Weak Curve Fault Attack on ECDSA.",
                    "HyperSec: Visual Analytics for Blockchain Security Monitoring.",
                    "100 Popular Open-Source Infosec Tools.",
                    "RootAsRole: Towards a Secure Alternative to sudo/su Commands for Home Users and SME Administrators.",
                    "Accept All: The Landscape of Cookie Banners in Greece and the UK.",
                    "The AppChk Crowd-Sourcing Platform: Which Third Parties are iOS Apps Talking To?",
                    "Compiling Personal Data and Subject Categories from App Data Models.",
                    "Privacy Concerns Go Hand in Hand with Lack of Knowledge: The Case of the German Corona-Warn-App.",
                    "Perceived Privacy Problems Within Digital Contact Tracing: A Study Among Swedish Citizens.",
                    "Secure and Scalable IoT: An IoT Network Platform Based on Network Overlay and MAC Security.",
                    "Enriching DNS Flows with Host-Based Events to Bypass Future Protocol Encryption.",
                    "Advanced Cowrie Configuration to Increase Honeypot Deceptiveness.",
                    "Less is Often More: Header Whitelisting as Semantic Gap Mitigation in HTTP-Based Software Systems.",
                    "TAR: Generalized Forensic Framework to Detect Deepfakes Using Weakly Supervised Learning.",
                    "Anomaly Detection for Insider Threats: An Objective Comparison of Machine Learning Models and Ensembles.",
                    "Revitalizing Self-Organizing Map: Anomaly Detection Using Forecasting Error Patterns.",
                    "What Is Lurking in Your Backups?",
                    "How Do Users Chain Email Accounts Together?",
                    "Tensions that Hinder the Implementation of Digital Security Governance."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "35th SEC 2020",
        "info": "Maribor, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2020",
                "sub_name": "ICT Systems Security and Privacy Protection - 35th IFIP TC 11 International Conference, SEC 2020, Maribor, Slovenia, September 21-23, 2020, Proceedings.",
                "count": 29,
                "papers": [
                    "Leaky Controller: Cross-VM Memory Controller Covert Channel on Multi-core Systems.",
                    "Evaluation of Statistical Tests for Detecting Storage-Based Covert Channels.",
                    "IE-Cache: Counteracting Eviction-Based Cache Side-Channel Attacks Through Indirect Eviction.",
                    "Refined Detection of SSH Brute-Force Attackers Using Machine Learning.",
                    "MultiTLS: Secure Communication Channels with Cipher Suite Diversity.",
                    "Improving Big Data Clustering for Jamming Detection in Smart Mobility.",
                    "Assisting Users to Create Stronger Passwords Using ContextBased MicroTraining.",
                    "Facilitating Privacy Attitudes and Behaviors with Affective Visual Design.",
                    "Privacy CURE: Consent Comprehension Made Easy.",
                    "JavaScript Malware Detection Using Locality Sensitive Hashing.",
                    "RouAlign: Cross-Version Function Alignment and Routine Recovery with Graphlet Edge Embedding.",
                    "Code Between the Lines: Semantic Analysis of Android Applications.",
                    "IMShell-Dec: Pay More Attention to External Links in PowerShell.",
                    "Secure Attestation of Virtualized Environments.",
                    "Security and Performance Implications of BGP Rerouting-Resistant Guard Selection Algorithms for Tor.",
                    "Actively Probing Routes for Tor AS-Level Adversaries with RIPE Atlas.",
                    "Zeek-Osquery: Host-Network Correlation for Advanced Monitoring and Intrusion Detection.",
                    "Revisiting Security Vulnerabilities in Commercial Password Managers.",
                    "Evaluation of Risk-Based Re-Authentication Methods.",
                    "Fuzzy Vault for Behavioral Authentication System.",
                    "Improvements of the Balance Discovery Attack on Lightning Network Payment Channels.",
                    "CCBRSN: A System with High Embedding Capacity for Covert Communication in Bitcoin.",
                    "Privacy-Friendly Monero Transaction Signing on a Hardware Wallet.",
                    "A Matter of Life and Death: Analyzing the Security of Healthcare Networks.",
                    "Establishing a Strong Baseline for Privacy Policy Classification.",
                    "Cross-Platform File System Activity Monitoring and Forensics - A Semantic Approach.",
                    "A Correlation-Preserving Fingerprinting Technique for Categorical Data in Relational Databases.",
                    "FDFtNet: Facing Off Fake Images Using Fake Detection Fine-Tuning Network.",
                    "Escaping Backdoor Attack Detection of Deep Learning."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "34th SEC 2019",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2019",
                "sub_name": "ICT Systems Security and Privacy Protection - 34th IFIP TC 11 International Conference, SEC 2019, Lisbon, Portugal, June 25-27, 2019, Proceedings.",
                "count": 26,
                "papers": [
                    "Hunting Brand Domain Forgery: A Scalable Classification for Homograph Attack.",
                    "GanDef: A GAN Based Adversarial Training Defense for Neural Network Classifier.",
                    "Control Logic Injection Attacks on Industrial Control Systems.",
                    "An Efficient and Scalable Intrusion Detection System on Logs of Distributed Applications.",
                    "Performance of Password Guessing Enumerators Under Cracking Conditions.",
                    "An Offline Dictionary Attack Against zkPAKE Protocol.",
                    "Fine-Grained Access Control in Industrial Internet of Things - Evaluating Outsourced Attribute-Based Encryption.",
                    "Towards an Automated Extraction of ABAC Constraints from Natural Language Policies.",
                    "Removing Problems in Rule-Based Policies.",
                    "Is This Really You? An Empirical Study on Risk-Based Authentication Applied in the Wild.",
                    "Differentially Private Generative Adversarial Networks for Time Series, Continuous, and Discrete Open Data.",
                    "ESARA: A Framework for Enterprise Smartphone Apps Risk Assessment.",
                    "SocialAuth: Designing Touch Behavioral Smartphone User Authentication Based on Social Networking Applications.",
                    "The Influence of Organizational, Social and Personal Factors on Cybersecurity Awareness and Behavior of Home Computer Users.",
                    "To Be, or Not to Be Notified - Eliciting Privacy Notification Preferences for Online mHealth Services.",
                    "A Structured Comparison of the Corporate Information Security Maturity Level.",
                    "Predicting Students' Security Behavior Using Information-Motivation-Behavioral Skills Model.",
                    "Why Do People Pay for Privacy-Enhancing Technologies? The Case of Tor and JonDonym.",
                    "Arcana: Enabling Private Posts on Public Microblog Platforms.",
                    "Fast Keyed-Verification Anonymous Credentials on Standard Smart Cards.",
                    "BlockTag: Design and Applications of a Tagging System for Blockchain Analysis.",
                    "Forward Secure Identity-Based Signature Scheme with RSA.",
                    "On the Effectiveness of Control-Flow Integrity Against Modern Attack Techniques.",
                    "Automatically Proving Purpose Limitation in Software Architectures.",
                    "Commit Signatures for Centralized Version Control Systems.",
                    "Towards Contractual Agreements for Revocation of Online Data."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "33rd SEC 2018",
        "info": "Poznan, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2018",
                "sub_name": "ICT Systems Security and Privacy Protection - 33rd IFIP TC 11 International Conference, SEC 2018, Held at the 24th IFIP World Computer Congress, WCC 2018, Poznan, Poland, September 18-20, 2018, Proceedings.",
                "count": 27,
                "papers": [
                    "Design Weaknesses in Recent Ultralightweight RFID Authentication Protocols.",
                    "CPMap: Design of Click-Points Map-Based Graphical Password Authentication.",
                    "The Influence of Native Language on Password Composition and Security: A Socioculture Theoretical View.",
                    "A Hypergame Analysis for ErsatzPasswords.",
                    "Walking Through the Deep: Gait Analysis for User Authentication Through Deep Learning.",
                    "Practical Cryptographic Data Integrity Protection with Full Disk Encryption.",
                    "When Your Browser Becomes the Paper Boy - An Anonymous Browser Network.",
                    "EMPower: Detecting Malicious Power Line Networks from EM Emissions.",
                    "Attacking RO-PUFs with Enhanced Challenge-Response Pairs.",
                    "A Security Analysis of FirstCoin.",
                    "PRETT: Protocol Reverse Engineering Using Binary Tokens and Network Traces.",
                    "Assessing Privacy Policies of Internet of Things Services.",
                    "JonDonym Users' Information Privacy Concerns.",
                    "Optimal Security Configuration for Cyber Insurance.",
                    "The Tweet Advantage: An Empirical Analysis of 0-Day Vulnerability Information Shared on Twitter.",
                    "Anti-forensic = Suspicious: Detection of Stealthy Malware that Hides Its Network Traffic.",
                    "Usability Characteristics of Security and Privacy Tools: The User's Perspective.",
                    "Efficient Identification of Applications in Co-resident VMs via a Memory Side-Channel.",
                    "Follow the WhiteRabbit: Towards Consolidation of On-the-Fly Virtualization and Virtual Machine Introspection.",
                    "Hunting Password Leaks in Android Applications.",
                    "Smashing the Stack Protector for Fun and Profit.",
                    "Formal Analysis of Sneak-Peek: A Data Centre Attack and Its Mitigations.",
                    "An Evaluation of Bucketing in Systems with Non-deterministic Timing Behavior.",
                    "Detection and Response to Data Exfiltration from Internet of Things Android Devices.",
                    "When George Clooney Is Not George Clooney: Using GenAttack to Deceive Amazon's and Naver's Celebrity Recognition APIs.",
                    "Performance Improvements in Behavior Based Malware Detection Solutions.",
                    "On the Integrity of Cross-Origin JavaScripts."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "32nd SEC 2017",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2017",
                "sub_name": "ICT Systems Security and Privacy Protection - 32nd IFIP TC 11 International Conference, SEC 2017, Rome, Italy, May 29-31, 2017, Proceedings.",
                "count": 38,
                "papers": [
                    "Turning Active TLS Scanning to Eleven.",
                    "Slow TCAM Exhaustion DDoS Attack.",
                    "Evasive Malware Detection Using Groups of Processes.",
                    "A Malware-Tolerant, Self-Healing Industrial Control System Framework.",
                    "Process Discovery for Industrial Control System Cyber Attack Detection.",
                    "Secure Photo Sharing in Social Networks.",
                    "Context-Dependent Privacy-Aware Photo Sharing Based on Machine Learning.",
                    "3LP: Three Layers of Protection for Individual Privacy in Facebook.",
                    "A Framework for Moving Target Defense Quantification.",
                    "Query Privacy in Sensing-as-a-Service Platforms.",
                    "Secure and Efficient k-NN Queries.",
                    "Secure and Trustable Distributed Aggregation Based on Kademlia.",
                    "HyBIS: Advanced Introspection for Effective Windows Guest Protection.",
                    "Detection of Side Channel Attacks Based on Data Tainting in Android Systems.",
                    "The Fuzzing Awakens: File Format-Aware Mutational Fuzzing on Smartphone Media Server Daemons.",
                    "Towards Automated Classification of Firmware Images and Identification of Embedded Devices.",
                    "Runtime Firmware Product Lines Using TPM2.0.",
                    "On the Use of Emojis in Mobile Authentication.",
                    "EmojiTCHA: Using Emotion Recognition to Tell Computers and Humans Apart.",
                    "Assisted Authoring, Analysis and Enforcement of Access Control Policies in the Cloud.",
                    "Capturing Policies for BYOD.",
                    "Improving Blind Steganalysis in Spatial Domain Using a Criterion to Choose the Appropriate Steganalyzer Between CNN and SRM+EC.",
                    "BinSign: Fingerprinting Binary Functions to Support Automated Analysis of Code Executables.",
                    "Decoy Password Vaults: At Least as Hard as Steganography?",
                    "Election-Dependent Security Evaluation of Internet Voting Schemes.",
                    "Combating Control Flow Linearization.",
                    "Ghost Patches: Fake Patches for Fake Vulnerabilities.",
                    "SIMBER: Eliminating Redundant Memory Bound Checks via Statistical Inference.",
                    "Towards Systematic Privacy and Operability (PRIOP) Studies.",
                    "Data Minimisation: A Language-Based Approach.",
                    "Differentially Private Neighborhood-Based Recommender Systems.",
                    "Privacy-Enhanced Profile-Based Authentication Using Sparse Random Projection.",
                    "Supporting Privacy by Design Using Privacy Process Patterns.",
                    "Evaluating the Privacy Implications of Frequent Itemset Disclosure.",
                    "Forward-Secure Digital Signature Schemes with Optimal Computation and Storage of Signers.",
                    "RiskInDroid: Machine Learning-Based Risk Analysis on Android.",
                    "Using Fraud Patterns for Fraud Risk Assessment of E-services.",
                    "Gadget Weighted Tagging: A Flexible Framework to Protect Against Code Reuse Attacks."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "31st SEC 2016",
        "info": "Ghent, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2016",
                "sub_name": "ICT Systems Security and Privacy Protection - 31st IFIP TC 11 International Conference, SEC 2016, Ghent, Belgium, May 30 - June 1, 2016, Proceedings.",
                "count": 27,
                "papers": [
                    "Coercion-Resistant Proxy Voting.",
                    "A Posteriori Openable Public Key Encryption.",
                    "Multicast Delayed Authentication for Streaming Synchrophasor Data in the Smart Grid.",
                    "Developing a Human Activity Model for Insider IS Security Breaches Using Action Design Research.",
                    "Evaluating CVSS Base Score Using Vulnerability Rewards Programs.",
                    "Defining Objectives for Preventing Cyberstalking.",
                    "Using Process Invariants to Detect Cyber Attacks on a Water Treatment System.",
                    "Expression and Enforcement of Security Policy for Virtual Resource Allocation in IaaS Cloud.",
                    "Software Defined Networking Reactive Stateful Firewall.",
                    "Teaching Phishing-Security: Which Way is Best?",
                    "On Gender Specific Perception of Data Sharing in Japan.",
                    "TORPEDO: TOoltip-poweRed Phishing Email DetectiOn.",
                    "SybilRadar: A Graph-Structure Based Framework for Sybil Detection in On-line Social Networks.",
                    "Collateral Damage of Facebook Apps: Friends, Providers, and Privacy Interdependence.",
                    "Automated Source Code Instrumentation for Verifying Potential Vulnerabilities.",
                    "An Information Flow-Based Taxonomy to Understand the Nature of Software Vulnerabilities.",
                    "XSS PEEKER: Dissecting the XSS Exploitation Techniques and Fuzzing Mechanisms of Blackbox Web Application Scanners.",
                    "A Utility-Based Reputation Model for the Internet of Things.",
                    "Advanced Remote Firmware Upgrades Using TPM 2.0.",
                    "RegRSA: Using Registers as Buffers to Resist Memory Disclosure Attacks.",
                    "Uncertain? No, It's Very Certain! - Recovering the Key from Guessing Entropy Enhanced CPA.",
                    "Advanced or Not? A Comparative Study of the Use of Anti-debugging and Anti-VM Techniques in Generic and Targeted Malware.",
                    "NativeProtector: Protecting Android Applications by Isolating and Intercepting Third-Party Native Libraries.",
                    "A Progress-Sensitive Flow-Sensitive Inlined Information-Flow Control Monitor.",
                    "Deducing User Presence from Inter-Message Intervals in Home Automation Systems.",
                    "Privacy by Design Principles in Design of New Generation Cognitive Assistive Technologies.",
                    "A Trustless Privacy-Preserving Reputation System."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "30th SEC 2015",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2015",
                "sub_name": "ICT Systems Security and Privacy Protection - 30th IFIP TC 11 International Conference, SEC 2015, Hamburg, Germany, May 26-28, 2015, Proceedings.",
                "count": 42,
                "papers": [
                    "O-PSI: Delegated Private Set Intersection on Outsourced Datasets.",
                    "Flexible and Robust Privacy-Preserving Implicit Authentication.",
                    "Towards Relations Between the Hitting-Set Attack and the Statistical Disclosure Attack.",
                    "POSN: A Personal Online Social Network.",
                    "Strategic Noninterference.",
                    "Verifying Observational Determinism.",
                    "Cache Timing Attacks Revisited: Efficient and Repeatable Browser History, OS and Network Sniffing.",
                    "Enforcing Usage Constraints on Credentials for Web Applications.",
                    "A Survey of Alerting Websites: Risks and Solutions.",
                    "A Generalization of ISO/IEC 24761 to Enhance Remote Authentication with Trusted Product at Claimant.",
                    "Enhancing Passwords Security Using Deceptive Covert Communication.",
                    "Information Sharing and User Privacy in the Third-Party Identity Management Landscape.",
                    "An Iterative Algorithm for Reputation Aggregation in Multi-dimensional and Multinomial Rating Systems.",
                    "A Comparison of PHY-Based Fingerprinting Methods Used to Enhance Network Access Control.",
                    "Model-Driven Integration and Analysis of Access-control Policies in Multi-layer Information Systems.",
                    "Authenticated File Broadcast Protocol.",
                    "Automated Classification of C&C Connections Through Malware URL Clustering.",
                    "B.Hive: A Zero Configuration Forms Honeypot for Productive Web Applications.",
                    "Investigation of Employee Security Behaviour: A Grounded Theory Approach.",
                    "Practice-Based Discourse Analysis of InfoSec Policies.",
                    "Understanding Collaborative Challenges in IT Security Preparedness Exercises.",
                    "Social Groupings and Information Security Obedience Within Organizations.",
                    "Attack Trees with Sequential Conjunction.",
                    "Enhancing the Security of Image CAPTCHAs Through Noise Addition.",
                    "SHRIFT System-Wide HybRid Information Flow Tracking.",
                    "ISboxing: An Instruction Substitution Based Data Sandboxing for x86 Untrusted Libraries.",
                    "Exploit Generation for Information Flow Leaks in Object-Oriented Programs.",
                    "Memoized Semantics-Based Binary Diffing with Application to Malware Lineage Inference.",
                    "Mitigating Code-Reuse Attacks on CISC Architectures in a Hardware Approach.",
                    "Integrity for Approximate Joins on Untrusted Computational Servers.",
                    "Fast Revocation of Attribute-Based Credentials for Both Users and Verifiers.",
                    "Chaotic Chebyshev Polynomials Based Remote User Authentication Scheme in Client-Server Environment.",
                    "A Secure Exam Protocol Without Trusted Parties.",
                    "ApkCombiner: Combining Multiple Android Apps to Support Inter-App Analysis.",
                    "Assessment of the Susceptibility to Data Manipulation of Android Games with In-app Purchases.",
                    "An Empirical Study on Android for Saving Non-shared Data on Public Storage.",
                    "The Dual-Execution-Environment Approach: Analysis and Comparative Evaluation.",
                    "On the Privacy, Security and Safety of Blood Pressure and Diabetes Apps.",
                    "A Cloud-Based eHealth Architecture for Privacy Preserving Data Integration.",
                    "Application of a Game Theoretic Approach in Smart Sensor Data Trustworthiness Problems.",
                    "Securing BACnet's Pitfalls.",
                    "On the Secure Distribution of Vendor-Specific Keys in Deployment Scenarios."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "29th SEC 2014",
        "info": "Marrakech, Morocco",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2014",
                "sub_name": "ICT Systems Security and Privacy Protection - 29th IFIP TC 11 International Conference, SEC 2014, Marrakech, Morocco, June 2-4, 2014. Proceedings.",
                "count": 41,
                "papers": [
                    "Mentor: Positive DNS Reputation to Skim-Off Benign Domains in Botnet C&C Blacklists.",
                    "Game Theory Meets Information Security Management.",
                    "Model-Based Detection of CSRF.",
                    "Lightweight Resource Management for DDoS Traffic Isolation in a Cloud Environment.",
                    "Multi-keyword Similarity Search over Encrypted Cloud Data.",
                    "Security of the Multiple-Key Blom's Key Agreement Scheme for Sensor Networks.",
                    "New Algorithmic Approaches to Point Constellation Recognition.",
                    "Protection Profile for PUF-Based Devices.",
                    "Text-Based Active Authentication for Mobile Devices.",
                    "Styx: Design and Evaluation of a New Privacy Risk Communication Method for Smartphones.",
                    "A Trusted UI for the Mobile Web.",
                    "Detecting Code Reuse in Android Applications Using Component-Based Control Flow Graph.",
                    "Privacy Risks from Public Data Sources.",
                    "Security and Privacy in Video Surveillance: Requirements and Challenges.",
                    "Playing Hide and Seek with Mobile Dating Applications.",
                    "Towards a Framework for Benchmarking Privacy-ABC Technologies.",
                    "Evaluating the Security of a DNS Query Obfuscation Scheme for Private Web Surfing.",
                    "A Novel Metric for the Evaluation of IDSs Effectiveness.",
                    "How to Assess Confidentiality Requirements of Corporate Assets?",
                    "Towards Developing SCADA Systems Security Measures for Critical Infrastructures against Cyber-Terrorist Attacks.",
                    "Compatibility of Safety Properties and Possibilistic Information Flow Security in MAKS.",
                    "Ghostrail: Ad Hoc Control-Flow Integrity for Web Applications.",
                    "An Information Flow Monitor-Inlining Compiler for Securing a Core of JavaScript.",
                    "Authenticated Dictionary Based on Frequency.",
                    "Géant-TrustBroker: Dynamic, Scalable Management of SAML-Based Inter-federation Authentication and Authorization Infrastructures.",
                    "Efficient Identity-Based Signature from Lattices.",
                    "Context-Aware Multifactor Authentication Based on Dynamic Pin.",
                    "Authorship Attribution for Forensic Investigation with Thousands of Authors.",
                    "Detection and Labeling of Personal Identifiable Information in E-mails.",
                    "A Preliminary Study on User's Decision Making towards Retweet Messages.",
                    "Behavior Analysis of Web Service Attacks.",
                    "BankSealer: An Online Banking Fraud Analysis and Decision Support System.",
                    "Security Assessment of Payment Systems under PCI DSS Incompatibilities.",
                    "PriMan: Facilitating the Development of Secure and Privacy-Preserving Applications.",
                    "Managing Employee Security Behaviour in Organisations: The Role of Cultural Factors and Individual Values.",
                    "Organizational Transformation and Information Security Culture: A Telecom Case Study.",
                    "A Holistic Approach for Cyber Assurance of Critical Infrastructure with the Viable System Model.",
                    "Privacy Design Strategies - (Extended Abstract).",
                    "Distance Computation between Two Private Preference Functions.",
                    "Privacy-Preserving Implicit Authentication.",
                    "Trusted Computing to Increase Security and Privacy in eID Authentication."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "28th SEC 2013",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2013",
                "sub_name": "Security and Privacy Protection in Information Processing Systems - 28th IFIP TC 11 International Conference, SEC 2013, Auckland, New Zealand, July 8-10, 2013. Proceedings.",
                "count": 31,
                "papers": [
                    "Exploring Timeline-Based Malware Classification.",
                    "Screening Smartphone Applications Using Behavioral Signatures.",
                    "Game Theoretic Approach for Cost-Benefit Analysis of Malware Proliferation Prevention.",
                    "Evolving a Secure Internet.",
                    "Enhancing Click-Draw Based Graphical Passwords Using Multi-Touch on Mobile Phones.",
                    "Applying DAC Principles to the RDF Graph Data Model.",
                    "A Lightweight Gait Authentication on Mobile Phone Regardless of Installation Error.",
                    "A Vulnerability in the Song Authentication Protocol for Low-Cost RFID Tags.",
                    "Extraction of ABNF Rules from RFCs to Enable Automated Test Data Generation.",
                    "Key Derivation Function: The SCKDF Scheme.",
                    "Sustainable Pseudo-random Number Generator.",
                    "Improving Mobile Device Security with Operating System-Level Virtualization.",
                    "Generating Realistic Application Workloads for Mix-Based Systems for Controllable, Repeatable and Usable Experimentation.",
                    "An Empirical Evaluation of the Android Security Framework.",
                    "A Security Engineering Process Approach for the Future Development of Complex Aircraft Cabin Systems.",
                    "Mobile Device Encryption Systems.",
                    "Smartphone Volatile Memory Acquisition for Security Analysis and Forensics Investigation.",
                    "Program Transformation for Non-interference Verification on Programs with Pointers.",
                    "A Viable System Model for Information Security Governance: Establishing a Baseline of the Current Information Security Operations System.",
                    "A Review of the Theory of Planned Behaviour in the Context of Information Security Policy Compliance.",
                    "Enforcement of Privacy Requirements.",
                    "Towards Security-Enhanced and Privacy-Preserving Mashup Compositions.",
                    "On Privacy-Preserving Ways to Porting the Austrian eID System to the Public Cloud.",
                    "Using the Conflicting Incentives Risk Analysis Method.",
                    "Performance Analysis of Scalable Attack Representation Models.",
                    "ADAPT: A Game Inspired Attack-Defense and Performance Metric Taxonomy.",
                    "Phishing for the Truth: A Scenario-Based Experiment of Users' Behavioural Response to Emails.",
                    "Phishing and Organisational Learning.",
                    "A Case for Societal Digital Security Culture.",
                    "Secure Outsourcing: An Investigation of the Fit between Clients and Providers.",
                    "Performance Analysis of File Carving Tools."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "27th SEC 2012",
        "info": "Heraklion, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2012",
                "sub_name": "Information Security and Privacy Research - 27th IFIP TC 11 Information Security and Privacy Conference, SEC 2012, Heraklion, Crete, Greece, June 4-6, 2012. Proceedings.",
                "count": 53,
                "papers": [
                    "Relay Attacks on Secure Element-Enabled Mobile Devices - Virtual Pickpocketing Revisited.",
                    "Would You Mind Forking This Process? A Denial of Service Attack on Android (and Some Countermeasures).",
                    "An Approach to Detecting Inter-Session Data Flow Induced by Object Pooling.",
                    "Embedded Eavesdropping on Java Card.",
                    "Authenticated Key Exchange (AKE) in Delay Tolerant Networks.",
                    "OFELIA - A Secure Mobile Attribute Aggregation Infrastructure for User-Centric Identity Management.",
                    "Smart OpenID: A Smart Card Based OpenID Protocol.",
                    "Peer to Peer Botnet Detection Based on Flow Intervals.",
                    "Towards a Universal Data Provenance Framework Using Dynamic Instrumentation.",
                    "Improving Flask Implementation Using Hardware Assisted In-VM Isolation.",
                    "HyperForce: Hypervisor-enForced Execution of Security-Critical Code.",
                    "RandHyp: Preventing Attacks via Xen Hypercall Interface.",
                    "Role Mining under Role-Usage Cardinality Constraint.",
                    "HIDE_DHCP: Covert Communications through Network Configuration Messages.",
                    "Handling Stateful Firewall Anomalies.",
                    "A Framework for Threat Assessment in Access Control Systems.",
                    "Support for Write Privileges on Outsourced Data.",
                    "Malicious Users' Transactions: Tackling Insider Threat.",
                    "Privacy-Preserving Television Audience Measurement Using Smart TVs.",
                    "Tracking Users on the Internet with Behavioral Patterns: Evaluation of Its Practical Feasibility.",
                    "Smartphone Forensics: A Proactive Investigation Scheme for Evidence Acquisition.",
                    "Modeling Social Engineering Botnet Dynamics across Multiple Social Networks.",
                    "Layered Analysis of Security Ceremonies.",
                    "A Small Depth-16 Circuit for the AES S-Box.",
                    "Formal Verification of the mERA-Based eServices with Trusted Third Party Protocol.",
                    "My Authentication Album: Adaptive Images-Based Login Mechanism.",
                    "Balancing Security and Usability of Local Security Mechanisms for Mobile Devices.",
                    "Analyzing Value Conflicts for a Work-Friendly ISS Policy Implementation.",
                    "When Convenience Trumps Security: Defining Objectives for Security and Usability of Systems.",
                    "Security-by-Contract for the OSGi Platform.",
                    "Cyber Weather Forecasting: Forecasting Unknown Internet Worms Using Randomness Analysis.",
                    "Incentive Compatible Moving Target Defense against VM-Colocation Attacks in Clouds.",
                    "Give Rookies A Chance: A Trust-Based Institutional Online Supplier Recommendation Framework.",
                    "A Game-Theoretic Formulation of Security Investment Decisions under Ex-ante Regulation.",
                    "Optimizing Network Patching Policy Decisions.",
                    "A Risk Assessment Method for Smartphones.",
                    "Empirical Benefits of Training to Phishing Susceptibility.",
                    "Multi-modal Behavioural Biometric Authentication for Mobile Devices.",
                    "Analysis and Modeling of False Synchronizations in 3G-WLAN Integrated Networks.",
                    "Password Protected Smart Card and Memory Stick Authentication against Off-Line Dictionary Attacks.",
                    "Distributed Path Authentication for Dynamic RFID-Enabled Supply Chains.",
                    "Enhanced Dictionary Based Rainbow Table.",
                    "Authorization Policies for Materialized Views.",
                    "Enhancing the Security of On-line Transactions with CAPTCHA Keyboard.",
                    "Fighting Pollution Attack in Peer-to-Peer Streaming Networks: A Trust Management Approach.",
                    "A Framework for Anonymizing GSM Calls over a Smartphone VoIP Network.",
                    "A Browser-Based Distributed System for the Detection of HTTPS Stripping Attacks against Web Pages.",
                    "Privacy-Preserving Mechanisms for Organizing Tasks in a Pervasive eHealth System.",
                    "Web Services Security Assessment: An Authentication-Focused Approach.",
                    "Open Issues and Proposals in the IT Security Management of Commercial Ports: The S-PORT National Case.",
                    "A Response Strategy Model for Intrusion Response Systems.",
                    "Intrusion Tolerance of Stealth DoS Attacks to Web Services.",
                    "Towards Use-Based Usage Control."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "26th SEC 2011",
        "info": "Lucerne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2011",
                "sub_name": "Future Challenges in Security and Privacy for Academia and Industry - 26th IFIP TC 11 International Information Security Conference, SEC 2011, Lucerne, Switzerland, June 7-9, 2011. Proceedings.",
                "count": 26,
                "papers": [
                    "Patience, Persistence, and Faith: Evolving the Gold Standard in Privacy and Data Protection.",
                    "iSAM: An iPhone Stealth Airborne Malware.",
                    "TCP Ack Storm DoS Attacks.",
                    "Detecting Hidden Storage Side Channel Vulnerabilities in Networked Applications.",
                    "Breaking reCAPTCHA: A Holistic Approach via Shape Recognition.",
                    "From Multiple Credentials to Browser-Based Single Sign-On: Are We More Secure?",
                    "Quantifying the Effect of Graphical Password Guidelines for Better Security.",
                    "A Case Study in Practical Security of Cable Networks.",
                    "Ceremony Analysis: Strengths and Weaknesses.",
                    "Preventing Board Flooding Attacks in Coercion-Resistant Electronic Voting Schemes.",
                    "Piracy Protection for Streaming Content in Home Networks.",
                    "JITDefender: A Defense against JIT Spraying Attacks.",
                    "Retrofitting Security in COTS Software with Binary Rewriting.",
                    "Generating Optimised and Formally Checked Packet Parsing Code.",
                    "Organizational Power and Information Security Rule Compliance.",
                    "Delegation of Obligations and Responsibility.",
                    "Distributed Security Policy Conformance.",
                    "Scalable Privacy-Preserving Data Mining with Asynchronously Partitioned Datasets.",
                    "Privacy-Enhanced Web-Based Event Scheduling with Majority Agreement.",
                    "Analyzing Key-Click Patterns of PIN Input for Recognizing VoIP Users.",
                    "Problem Analysis of Traditional IT-Security Risk Assessment Methods - An Experience Report from the Insurance and Auditing Domain.",
                    "On Computing Enterprise IT Risk Metrics.",
                    "A Kolmogorov Complexity Approach for Measuring Attack Path Complexity.",
                    "Extending LSCs for Behavioral Signature Modeling.",
                    "Detecting Illegal System Calls Using a Data-Oriented Detection Model.",
                    "IFIP Technical Committee 11 Security and Privacy Protection in Information Processing Systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "25th SEC 2010",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2010",
                "sub_name": "Security and Privacy - Silver Linings in the Cloud - 25th IFIP TC-11 International Information Security Conference, SEC 2010, Held as Part of WCC 2010, Brisbane, Australia, September 20-23, 2010. Proceedings.",
                "count": 27,
                "papers": [
                    "The 5 Waves of Information Security - From Kristian Beckman to the Present.",
                    "A Business Continuity Management Simulator.",
                    "Mining Business-Relevant RBAC States through Decomposition.",
                    "Group Dynamics in a Security Risk Management Team Context: A Teaching Case Study.",
                    "Using Actor Network Theory to Understand Information Security Management.",
                    "Information Security Governance: When Compliance Becomes More Important than Security.",
                    "Understanding Domain Registration Abuses.",
                    "Who on Earth Is \"Mr. Cypher\": Automated Friend Injection Attacks on Social Networking Sites.",
                    "Authentic Refinement of Semantically Enhanced Policies in Pervasive Systems.",
                    "Qualified Mobile Server Signature.",
                    "Fraud Detection in ERP Systems Using Scenario Matching.",
                    "Use of IP Addresses for High Rate Flooding Attack Detection.",
                    "Augmenting Reputation-Based Trust Metrics with Rumor-Like Dissemination of Reputation Information.",
                    "Ex-SDF: An Extended Service Dependency Framework for Intrusion Impact Assessment.",
                    "A Dynamic and Ubiquitous Smart Card Security Assurance and Validation Mechanism.",
                    "On-the-fly Inlining of Dynamic Security Monitors.",
                    "A Metric-Based Scheme for Evaluating Tamper Resistant Software Systems.",
                    "Evaluation of the Offensive Approach in Information Security Education.",
                    "Research Methodologies in Information Security Research: The Road Ahead.",
                    "Purpose-Based Access Control Policies and Conflicting Analysis.",
                    "Delegation in Predicate Encryption Supporting Disjunctive Queries.",
                    "Tagging Disclosures of Personal Data to Third Parties to Preserve Privacy.",
                    "k-Shares: A Privacy Preserving Reputation Protocol for Decentralized Environments.",
                    "Towards Fair Indictment for Data Collection with Self-Enforcing Privacy.",
                    "How to Enhance Privacy and Identity Management for Mobile Communities: Approach and User Driven Concepts of the PICOS Project.",
                    "Performance Analysis of Accumulator-Based Revocation Mechanisms.",
                    "IFIP Technical Committee 11 Security and Privacy Protection in Information Processing Systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "24th SEC 2009",
        "info": "Pafos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2009",
                "sub_name": "Emerging Challenges for Security, Privacy and Trust, 24th IFIP TC 11 International Information Security Conference, SEC 2009, Pafos, Cyprus, May 18-20, 2009. Proceedings.",
                "count": 38,
                "papers": [
                    "Flexible and Transparent User Authentication for Mobile Devices.",
                    "Combining Authentication, Reputation and Classification to Make Phishing Unprofitable.",
                    "Audio CAPTCHA for SIP-Based VoIP.",
                    "Roving Bugnet: Distributed Surveillance Threat and Mitigation.",
                    "On Robust Covert Channels Inside DNS.",
                    "Discovering Application-Level Insider Attacks Using Symbolic Execution.",
                    "Custom JPEG Quantization for Improved Iris Recognition Accuracy.",
                    "On the IPP Properties of Reed-Solomon Codes.",
                    "A Generic Authentication LoA Derivation Model.",
                    "Media-Break Resistant eSignatures in eGovernment: An Austrian Experience.",
                    "How to Bootstrap Security for Ad-Hoc Network: Revisited.",
                    "Steganalysis of Hydan.",
                    "On the Impossibility of Detecting Virtual Machine Monitors.",
                    "Implementation of a Trusted Ticket System.",
                    "A Policy Based Approach for the Management of Web Browser Resources to Prevent Anonymity Attacks in Tor.",
                    "A Policy Language for Modelling Recommendations.",
                    "On the Security Validation of Integrated Security Solutions.",
                    "Verification of Security Policy Enforcement in Enterprise Systems.",
                    "Optimization of the Controlled Evaluation of Closed Relational Queries.",
                    "Collaborative Privacy - A Community-Based Privacy Infrastructure.",
                    "Security and Privacy Improvements for the Belgian eID Technology.",
                    "A Structured Security Assessment Methodology for Manufacturers of Critical Infrastructure Components.",
                    "Mining Stable Roles in RBAC.",
                    "Privacy-Preserving Content-Based Publish/Subscribe Networks.",
                    "Broadcast Encryption for Differently Privileged.",
                    "Ontology-Based Secure XML Content Distribution.",
                    "NGBPA Next Generation BotNet Protocol Analysis.",
                    "Non-repudiation Analysis with LySa.",
                    "A Provably Secure Secret Handshake with Dynamic Controlled Matching.",
                    "Towards a Theory of White-Box Security.",
                    "On a Taxonomy of Delegation.",
                    "Efficient Key Management for Enforcing Access Control in Outsourced Scenarios.",
                    "A Probabilistic Bound on the Basic Role Mining Problem and Its Applications.",
                    "Automating Access Control Logics in Simple Type Theory with LEO-II.",
                    "In Law We Trust? Trusted Computing and Legal Responsibility for Internet Security.",
                    "Persona: Network Layer Anonymity and Accountability for Next Generation Internet.",
                    "Jason: A Scalable Reputation System for the Semantic Web.",
                    "Which Web Browsers Process SSL Certificates in a Standardized Way?"
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "23rd SEC 2008",
        "info": "Milano, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2008",
                "sub_name": "Proceedings of The IFIP TC-11 23rd International Information Security Conference, IFIP 20th World Computer Congress, IFIP SEC 2008, September 7-10, 2008, Milano, Italy.",
                "count": 53,
                "papers": [
                    "Hiding in Groups: On the Expressiveness of Privacy Distributions.",
                    "Practical Privacy-Preserving Benchmarking.",
                    "Enhancing Privacy in Remote Data Classification.",
                    "Minimizing SSO Effort in Verifying SSL Anti-phishing Indicators.",
                    "Robbing Banks with Their Own Software-an Exploit Against Norwegian Online Banks.",
                    "Collaborative architecture for malware detection and analysis.",
                    "Realizing Stateful Public Key Encryption in Wireless Sensor Network.",
                    "Establishing secure links in low-rate wireless personal area networks.",
                    "An Asynchronous Node Replication Attack in Wireless Sensor Networks.",
                    "A B Formal Framework for Security Developments in the Domain of Smart Card Applications.",
                    "An Implementation of a Privacy Enforcement Scheme based on the Java Security Framework using XACML Policies.",
                    "Negotiation of Prohibition: An Approach Based on Policy Rewriting.",
                    "An Integrity Lock Architecture for Supporting Distributed Authorizations in Database Federations.",
                    "Role Signatures for Access Control in Open Distributed Systems.",
                    "Policies and Security Aspects For Distributed Scientific Laboratories.",
                    "A Fuzzy Model for the Composition of Intrusion Detectors.",
                    "Investigating the problem of IDS false alarms: An experimental study using Snort.",
                    "User Session Modeling for Effective Application Intrusion Detection.",
                    "A Product Machine Model for Anomaly Detection of Interposition Attacks on Cyber-Physical Systems.",
                    "Anomaly Detection with Diagnosis in Diversified Systems using Information Flow Graphs.",
                    "Behavioral Intrusion Detection Indicators.",
                    "Leveraging Lattices to Improve Role Mining.",
                    "A Parallelization Framework for Exact Knowledge Hiding in Transactional Databases.",
                    "Efficient Coalition Detection in Traitor Tracing.",
                    "SPIT Identification Criteria Implementation: Effectiveness and Lessons Learned.",
                    "Detecting More SIP Attacks on VoIP Services by Combining Rule Matching and State Transition Models.",
                    "A Decentralized Bayesian Attack Detection Algorithm for Network Security.",
                    "An Operation-Based Metric for CPA Resistance.",
                    "YASIR: A Low-Latency, High-Integrity Security Retrofit for Legacy SCADA Systems.",
                    "Adversary Modeling and Simulation in Cyber Warfare.",
                    "Interactive Selection of ISO 27001 Controls under Multiple Objectives.",
                    "Feasibility of Automated Information Security Compliance Auditing.",
                    "Software Licence Protection and Management for Organisations.",
                    "A Vulnerability Prioritization System Using A Fuzzy Risk Analysis Approach.",
                    "ASTRA : A Security Analysis Method Based on Asset Tracking.",
                    "A Knowledge-Based Bayesian Model for Analyzing a System after an Insider Attack.",
                    "Portable User-Centric Identity Management.",
                    "Ubiquitous Privacy-Preserving Identity Managment.",
                    "Facilitating Privacy Related Decisions in Different Privacy Contexts on the Internet by Evaluating Trust in Recipients of Private Data.",
                    "Using Virtualization to Create and Deploy Computer Security Lab Exercises.",
                    "DigForNet: Digital Forensic in Networking.",
                    "A Live Digital Forensic system for Windows networks.",
                    "HoneyID : Unveiling Hidden Spywares by Generating Bogus Events.",
                    "A Security Protocol for Self-Organizing Data Storage.",
                    "Protecting Financial Institutions from Brute-Force Attacks.",
                    "Agency Theory: Can it be Used to Strengthen IT Governance?.",
                    "A new Accounting Mechanism for Modern and Future AAA Services.",
                    "A user survey on the sense of security, Anshin.",
                    "Multi-Layer Encryption for Multi-Level Access Control in Wireless Sensor Networks.",
                    "A Comparative Study of Anomaly Detection Techniques in Web Site Defacement Detection.",
                    "Managing the lifecycle of XACML delegation policies in federated environments.",
                    "Assessing the Likelihood of Privacy Policy Compliance.",
                    "Classification features for detecting Server-side and Client-side Web attacks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "22nd SEC 2007",
        "info": "Sandton, South Africa",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2007",
                "sub_name": "New Approaches for Security, Privacy and Trust in Complex Environments, Proceedings of the IFIP TC-11 22nd International Information Security Conference (SEC 2007), 14-16 May 2007, Sandton, South Africa.",
                "count": 46,
                "papers": [
                    "FORSIGS: Forensic Signature Analysis of the Hard Drive for Multimedia File Fingerprints.",
                    "Digital Forensic Readiness as a Component of Information Security Best Practice.",
                    "Value creation and Return On Security Investments (ROSI).",
                    "Usability and Security of Personal Firewalls.",
                    "Trusted Ticket Systems and Applications.",
                    "Trust Evaluation for Web Applications based on Behavioral Analysis.",
                    "Improving the Information Security Model by using TFI.",
                    "Ontological Mapping of Common Criteria's Security Assurance Requirements.",
                    "Management of Exceptions on Access Control Policies.",
                    "Security Analysis of Two Ultra-Lightweight RFID Authentication Protocols.",
                    "Exploratory survey on an Evaluation Model for a Sense of Security.",
                    "Employees' Adherence to Information Security Policies: An Empirical Study.",
                    "Phishing in the Wireless: Implementation and Analysis.",
                    "Secure Path-Key Revocation for Symmetric Key Pre-distribution Schemes in Sensor Networks.",
                    "A Credential-Based System for the Anonymous Delegation of Rights.",
                    "Development and Application of a Proxy Server for Transparently, Digitally Signing E-Learning Content.",
                    "Identity Theft - Empirical evidence from a Phishing Exercise.",
                    "A Practical Usability Evaluation of Security Features in End-User Applications.",
                    "Personal Anomaly-based Intrusion Detection Smart Card Using Behavioural Analysis.",
                    "A Survey of Bots Used for Distributed Denial of Service Attacks.",
                    "A Hybrid PKI-IBC Based Ephemerizer System.",
                    "Keystroke Analysis for Thumb-based Keyboards on Mobile Devices.",
                    "Security Remarks on a Convertible Nominative Signature Scheme.",
                    "Using Payment Gateways to Maintain Privacy in Secure Electronic Transactions.",
                    "A Role-Based Architecture for Seamless Identity Management and Effective Task Separation.",
                    "Extending Role Based Access Control Model for Distributed Multidomain Applications.",
                    "A Middleware Architecture for Integrating Privacy Preferences and Location Accuracy.",
                    "Enabling Privacy of Real-Life LBS.",
                    "Crafting Web Counters into Covert Channels.",
                    "OPA: Onion Policy Administration Model - Another approach to manage rights in DRM.",
                    "Non-Repudiation in Internet Telephony.",
                    "FirePatch: Secure and Time-Critical Dissemination of Software Patches.",
                    "An Experimental Evaluation of Multi-Key Strategies for Data Outsourcing.",
                    "Building a Distributed Semantic-aware Security Architecture.",
                    "Using Trust to Resist Censorship in the Presence of Collusion.",
                    "Evaluating the Effects of Model Generalization on Intrusion Detection Performance.",
                    "Modernising MAC: New Forms for Mandatory Access Control in an Era of DRM.",
                    "Covert Identity Information in Direct Anonymous Attestation (DAA).",
                    "Safeguarding Personal Data using Rights Management in Distributed Applications.",
                    "Identification Now and in the Future: Social Grant Distribution Process in South Africa.",
                    "Hard-drive Disposal and Identity Fraud.",
                    "An analysis of security and privacy issues relating to RFID enabled ePassports.",
                    "Toward User Evaluation of IT Security Certification Schemes: A Preliminary Framework.",
                    "Teaching of Information Security in the \"Health Care and Nursing\" Postgraduate program.",
                    "Remote Virtual Information Assurance Network.",
                    "Certifying the Computer Security Professional Using the Project Management Institute's PMP Model."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "21st SEC 2006",
        "info": "Karlstad, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2006",
                "sub_name": "Security and Privacy in Dynamic Environments, Proceedings of the IFIP TC-11 21st International Information Security Conference (SEC 2006), 22-24 May 2006, Karlstad, Sweden.",
                "count": 45,
                "papers": [
                    "Improving Availability of Emergency Health Information without Sacrificing Patient Privacy.",
                    "Ensuring Privacy for Buyer-Seller E-Commerce.",
                    "A General Certification Framework with Applications to Privacy-Enhancing Certificate Infrastructures.",
                    "Authenticated Query Flooding in Sensor Networks.",
                    "Identity Based Message Authentication for Dynamic Networks.",
                    "Providing Authentication and Access Control in Vehicular Network Environment.",
                    "A Framework for Web Services Trust.",
                    "Trust: An Element of Information Security.",
                    "Security-by-Ontology: A Knowledge-Centric Approach.",
                    "A Methodology for Designing Controlled Anonymous Applications.",
                    "Design Options for Privacy-Respecting Reputation Systems within Centralised Internet Communities.",
                    "Protecting (Anonymous) Credentials with the Trusted Computing Group's TPM V1.2.",
                    "Analysis and Improvement of Anti-Phishing Schemes.",
                    "CAT - A Practical Graph & SDL Based Toolkit for Vulnerability Assessment of 3G Networks.",
                    "Protecting Web Services from DoS Attacks by SOAP Message Validation.",
                    "A Flexible and Distributed Architecture to Enforce Dynamic Access Control.",
                    "A Paradigm for Dynamic and Decentralized Administration of Access Control in Workflow Applications.",
                    "CAS++: An Open Source Single Sign-On Solution for Secure e-Services.",
                    "A Synchronous Multi-Party Contract Signing Protocol Improving Lower Bound of Steps.",
                    "On the Cryptographic Key Secrecy of the Strengthened Yahalom Protocol.",
                    "Sealed-Bid Micro Auctions.",
                    "Detecting Known and Novel Network Intrusions.",
                    "Evaluating Classifiers for Mobile-Masquerader Detection.",
                    "VisFlowCluster-IP: Connectivity-Based Visual Clustering of Network Hosts.",
                    "A Usability Study of Security Policy Management.",
                    "Considering the Usability of End-User Security Software.",
                    "Utilizing the Common Criteria for Advanced Student Research Projects.",
                    "On the Relationship of Privacy and Secure Remote Logging in Dynamic Systems.",
                    "Privacy-Preserving Shared-Additive-Inverse Protocols and Their Applications.",
                    "Click Passwords.",
                    "Cryptographically Enforced Personalized Role-Based Access Control.",
                    "Using VO Concept for Managing Dynamic Security Associations.",
                    "Secure Fast Handover in an Open Broadband Access Network using Kerberos-style Tickets.",
                    "Network Forensics on Packet Fingerprints.",
                    "Oscar - File Type Identification of Binary Data in Disk Clusters and RAM Pages.",
                    "Organizational Security Culture: More Than Just an End-User Phenomenon.",
                    "Cyber Security Training and Awareness Through Game Play.",
                    "Internalisation of Information Security Culture amongst Employees through Basic Security Knowledge.",
                    "Bridging the Gap between General Management and Technicians - A Case Study in ICT Security.",
                    "Value-Focused Assessment of Information Communication and Technology Security Awareness in an Academic Environment.",
                    "Using Phishing for User Email Security Awareness.",
                    "Anonymous Credentials: Opportunities and Challenges.",
                    "Practical Private Regular Expression Matching.",
                    "A System for Privacy-Aware Resource Allocation and Data Processing in Dynamic Environments.",
                    "The APROB Channel: Adaptive Semi-Real-Time Anonymous Communication."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th SEC 2005",
        "info": "Makuhari-Messe, Chiba, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2005",
                "sub_name": "Security and Privacy in the Age of Ubiquitous Computing, IFIP TC11 20th International Conference on Information Security (SEC 2005), May 30 - June 1, 2005, Chiba, Japan.",
                "count": 40,
                "papers": [
                    "Accountable Anonymous E-Mail.",
                    "Protecting Consumer Data in Composite Web Services.",
                    "A Decision Matrix Approach.",
                    "Assignment of Security Clearances in an Organization.",
                    "Tool Supported Management of Information Security Culture.",
                    "ERPSEC - A Reference Framework to Enhance Security in ERP Systems.",
                    "A New Architecture for User Authentication and Key Exchange Using Password for Federated Enterprises.",
                    "A Secure Quantum Communication Protocol Using Insecure Public Channels.",
                    "Trusted Component Sharing by Runtime Test and Immunization for Survivable Distributed Systems.",
                    "Design and Implementation a TPM Chip SUP320 by SOC.",
                    "Mathematical Models of IP Traceback Methods and Their Verification.",
                    "Transferable E-Cash Revisit.",
                    "A License Transfer System for Supporting Content Portability in Digital Rights Management.",
                    "Secure Person-To-Person Communications Based on Biometrics Signals.",
                    "Distance-Bounding Proof of Knowledge to Avoid Real-Time Attacks.",
                    "An Adaptive Multicast Polling Scheme for IEEE 802.11 Wireless LAN.",
                    "The Pairing Problem with User Interaction.",
                    "Network Smart Card: A New Paradigm of Secure Online Transactions.",
                    "Protection Against Spam Using Pre-Challenges.",
                    "Automatically Hardening Web Applications Using Precise Tainting.",
                    "Traffic Redirection Attack Protection System (TRAPS) - A Full-Fledged Adaptive DoS/DDoS Attack Mitigation Scheme.",
                    "Statistical Signatures for Early Detection of Flooding Denial-Of-Service Attacks.",
                    "Design, Implementation, and Evaluation of \"FRiTrace\".",
                    "Design and Implementation of a High-Performance Network Intrusion Prevention System.",
                    "STRIDE: Polymorphic Sled Detection through Instruction Sequence Analysis.",
                    "Piranha: Fast and Memory-Efficient Pattern Matching for Intrusion Detection.",
                    "Designated-Verifier Proxy Signature Schemes.",
                    "Tripartite Concurrent Signatures.",
                    "Signcryption in Hierarchical Identity Based Cryptosystem.",
                    "Protecting Group Dynamic Information in Large Scale Multicast Groups.",
                    "Secure Group Communication with Distributed Generation of Private Keys in Ad-hoc Networks.",
                    "Ensuring Media Integrity on Third-Party Infrastructures.",
                    "A New Fragile Mesh Watermarking Algorithm for Authentication.",
                    "New Paradigm in Graph-Based Visual Secret Sharing Scheme by Accepting Reversal in Black-White Images.",
                    "Overcoming Channel Bandwidth Constraints in Secure SIM Applications.",
                    "On the Performance of Certificate Revocation Protocols Based on a Java Card Certificate Client Implementation.",
                    "On-the-Fly Formal Testing of a Smart Card Applet.",
                    "Side Channel Analysis, Fault Injection and Applications - A Computationally Feasible SPA Attack on AES via Optimized Search.",
                    "The Proof by 2M-1: a Low-Cost Method to Check Arithmetic Computations.",
                    "StreamTo: Streaming Content using a Tamper-Resistant Token."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "SEC 2004",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2004",
                "sub_name": "Security and Protection in Information Processing Systems, IFIP 18th WorldComputer Congress, TC11 19th International Information Security Conference, 22-27 August 2004, Toulouse, France.",
                "count": 35,
                "papers": [
                    "An Abstract Reduction Model for Computer Security Risk.",
                    "Remediation Graphs for Security Patch Management.",
                    "Security Modelling for Risk Analysis.",
                    "Contrasting Malicious Java Applets by Modifying the Java Virtual Machine.",
                    "Analyzing Network Management Effects with SPIN and cTLA.",
                    "Formal Reasoning of Various Categories of Widely Exploited Security Vulnerabilities by Pointer Taintedness Semantics.",
                    "Meeting the Global Challenges of Security Incident Response.",
                    "Security in Globally Distributed Industrial Information Systems.",
                    "A Case For Information Ownership in ERP Systems.",
                    "Interactive Access Control for Web Services.",
                    "Identity-based Key Infrastructures (IKI).",
                    "ModInt: Compact Modular Arithmatic Class Library Available on Cellular Phone and its Application to Secure Electronic Voting System.",
                    "Dependable Security by Twisted Secret Sharing.",
                    "A Language Driven IDS for Event and Alert Correlation.",
                    "Install-time Vaccination of Windows Executables to Defend Against Stack Smashing Attacks.",
                    "Eigenconnections to Intrusion Detection.",
                    "Visualising Intrusions: Watching the Webserver.",
                    "A Long-term Trial of Keystroke Profiling using Digraph, Trigraph and Keyword Latencies.",
                    "Trusted Computing, Trusted Third Parties, and Verified Communications.",
                    "Maille Authentication - A Novel Protocol for Distributed Authentication.",
                    "Supporting End-to-end Security across Proxies with Multiple-Channel SSL.",
                    "A Content-Protection Scheme for Multi-Layered Reselling Structure.",
                    "An Asymmetric Cryptography Secure Channel Protocol for Smart Cards.",
                    "IPsec Clustering.",
                    "Improving Secure Device Insertion in Home Ad-hoc Networks Keyword Latencies.",
                    "Spam Filter Analysis.",
                    "Collective Signature for Efficient Authentication of XML Documents.",
                    "Updating Encrypted XML Documents on Untrusted Machines.",
                    "Efficient Simultaneous Contract Signing.",
                    "DHCP Authentication Using Certificates.",
                    "Recursive Sandboxes: Extending Systrace To Empower Applications.",
                    "Fast Digital Certificate Revocation.",
                    "MASKS: Managing Anonymity while Sharing Knowledge to Servers.",
                    "Security and Differentiated Hotspot Services Through Policy-based Management Architecture.",
                    "Key Management for Secure Multicast in Hybrid Satellite Networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "SEC 2003",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2003",
                "sub_name": "Security and Privacy in the Age of Uncertainty, IFIP TC11 18th International Conference on Information Security (SEC2003), May 26-28, 2003, Athens, Greece.",
                "count": 51,
                "papers": [
                    "Trust Mediation for Distributed Information Systems.",
                    "Concerning Enterprise Network Vulnerability to HTTP Tunneling.",
                    "Providing Voice Privacy Over Public Switched Telephone Networks.",
                    "A Multi-Party Non-Repudiation Protocol for Exchange of Different Messages.",
                    "Establishing Chain of Evidence as a Base for Non-Repudiation Services.",
                    "Securing XML-based Multimedia Content.",
                    "Secure Audit Logging with Tamper-Resistant Hardware.",
                    "PCMHoDC. A Scheme to Protect Copyright & Modification History of Digital Contents.",
                    "Using Keystroke Analysis as a Mechanism for Subscriber Authentication on Mobile Handsets.",
                    "Introducing PKI to Enhance Security in Future Mobile Networks.",
                    "A Time Driven Methodology for Key Dimensioning in Multicast Communications.",
                    "A Flexible Category-Based Collusion-Restistant Key Management Scheme for Multicast.",
                    "Content, Context, Process Analysis of IS Security Policy Formation.",
                    "Integrating Security into Systems Development.",
                    "Integrating Information Security into Corporate Governance.",
                    "Building an Enterprise IT Security Management System.",
                    "Information Security Management System: Processes and Products.",
                    "Detecting Malicious Use with Unlabelled Data Using Clustering and Outlier Analysis.",
                    "E2xB: A Domain-Specific String Matching Algorithm for Intrusion Detection.",
                    "Intrusion Masking for Distributed Atomic Operations.",
                    "Using Fuzzy System to Manage False Alarms in Intrusion Detection.",
                    "An Experiment in Software Decoy Design.",
                    "A User Friendly Guard with Mobile Post-Release Access Control Policy.",
                    "Security Model for Health Care Computing and Communication Systems.",
                    "Constrained Role-based Delegation.",
                    "CSAP - An Adaptable Security Module for the E-Government System Webocrat.",
                    "Perceptions of Security Contributing to the Implementation of Secure IS.",
                    "New Directions on IS Security Methods.",
                    "Secure Vickrey Auctions without a Trusted Third Party.",
                    "Integrating Logics and Process Calculi for Cryptographic Protocol Analysis.",
                    "Flexible Delegation Security for Improved Distribution in Ubiquitous Environments.",
                    "Cooperative Defense Firewall Protocol.",
                    "How to turn a PIN into an Iron Beam.",
                    "World Framework for Security Benchmark Changes.",
                    "Information Security: Auditing the Behaviour of the Employee.",
                    "Priorities in the Development of Network Intrusion Detection Systems.",
                    "Bridging the Gap between Risk Analysis and Security Policies.",
                    "Framework and Architecture for Secure Mobile Business Applications.",
                    "ISO 17799 and Australian Healthcare Organisations.",
                    "Statistical Disclosure Attacks.",
                    "On the Anonymity of Timed Pool Mixes.",
                    "Privacy in Content Distribution Networks.",
                    "Security, Fault-Tolerance and their Verification for Ambient Systems.",
                    "Hidden Layer Authentication using Smart Card for WEP-based WLANS.",
                    "PINPAS: A Tool for Power Analysis of Smartcards.",
                    "Assessing Security in Energy-Efficient Sensor Networks.",
                    "From Finite State Machines to Provably Correct Java Card Applets.",
                    "Security Characteristics of E-Collaboration Environments.",
                    "Roadmap for Securing Handheld Devices.",
                    "Lawful Cyber Decoy Policy.",
                    "Electronic Signature as a part of Information Society Infrastructure."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "SEC 2002",
        "info": "Cairo, Egypt",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2002",
                "sub_name": "Security in the Information Society: Visions and Perspectives, IFIP TC11 17th International Conference on Information Security (SEC2002), May 7-9, 2002, Cairo, Egypt.",
                "count": 45,
                "papers": [
                    "The Effective Implementation of Information Security in Organizations.",
                    "A Practical Approach to Information Security Awareness in the Organization.",
                    "RBAC Policies in XML for X.509 Based Privilege Management.",
                    "A Top-Down Approach Towards Translating Organizational Security Policy Directives to System Audit Configuration.",
                    "Elaborating Quantitative Approaches for IT Security Evaluation.",
                    "A Security Evaluation Criteria for Baseline Security Standards.",
                    "Maturity Criteria for Developing Secure IS and SW: Limits, and Prospects.",
                    "For a Secure Mobile IP and Mobile IPv6 Deployment.",
                    "Addressing Internet Security Vulnerabilities: A Benchmarking Study.",
                    "The Threat From Within -An Analysis of Attacks on anInternal Network.",
                    "Security Vulnerabilities in Event-Driven Systems.",
                    "Denial of Service: Another Example.",
                    "A Detection Scheme for the SK Virus.",
                    "An Information Security Curriculum in Finland.",
                    "Information Security Culture: The Socio-Cultural Dimension in Information Security Management.",
                    "Information Security Culture.",
                    "Keystroke Analysis as a Method of Advanced User Authentication and Response.",
                    "Zero Knowledge Broadcasting Identification Scheme.",
                    "A New End-to-End Authentication Protocol for Mobile Users to Access Internet Services.",
                    "Mandatory Security Policies for CORBA Security Model.",
                    "Policap-Proposal, Development and Evaluation of a Policy. Service and Capabilities for CORBA Security.",
                    "Secure Database Connectivity on the WWW.",
                    "Towards Semantic Integrity in Rational Databases.",
                    "Formal Design of Packet Filtering Systems.",
                    "Elliptic Curve Cryptosystems on Smart Cards.",
                    "Establishing Bilateral Anonymous Communication in Open Networks.",
                    "BRITS-A Holistic Framework for Hedging Shareholder Value in IT Dependent Business.",
                    "Information Systems Security and the Information Systems Development Project: Towards a Framework for Their Integration.",
                    "An Efficient Hybrid Sealed Bid Auction Protocol.",
                    "Self-Determination in Mobile Internet: PiMI Prototype Results.",
                    "Secure Component Distribution Using WebCom.",
                    "E-Ticket Issuing System with 3-D Pattern Recognition for Mobile Terminals.",
                    "An Insight Into User Privacy and Accountable Anonymity for Mobile E-Commerce Transactions.",
                    "Secure Selective Exclusion in Ad Hoc Wireless Network.",
                    "Optical Network Models for Quantum Cryptography.",
                    "A Unified Regulatory Framework on a European Information Society: Suggested Building Levels.",
                    "Revisiting Legal and Regulatory Requirements for Secure E-Voting.",
                    "A Security Incident Data Model.",
                    "Security Levels for Contracting Agents.",
                    "Functional Requirements for a Secure Electronic Voting System.",
                    "Intelligent IP Packet Filtering.",
                    "Human Computer Interaction: An Information Security Perspectives.",
                    "A Very Smart Card for Fighting Against Terrorism.",
                    "SHEDEL-A Simple Hierarchical Event Description Language for Specifying Attack Signatures.",
                    "Propagating Modifications to Mobile Policies."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "SEC 2001",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2001",
                "sub_name": "Trusted Information: The New Decade Challenge, IFIP TC11 Sixteenth Annual Working Conference on Information Security (IFIP/Sec'01), June 11-13, 2001, Paris, France.",
                "count": 32,
                "papers": [
                    "Pythia: Towards Anonymity in Authentication.",
                    "Certificate Based PKI and B2B E-Commerce: Suitable Match or Not?",
                    "Internet Anonymity: Problems and Solutions.",
                    "Reducing Certificate Revocating Cost using NPKI.",
                    "The Need and Practice of User Authentication and TTP Services in Distributed Health Information Systems.",
                    "Is the Performance of Smart Card Cryptographic Functions the Real Bottleneck?",
                    "Modelling Audit Security for Smart-Cart Payment Schemes with UML-SEC.",
                    "Strong Forward Security.",
                    "Secret Sharing and Visual Cryptography Schemes.",
                    "A Two-level Time-Stamping System.",
                    "Security Analysis of the Cliques Protocols Suites: First Results.",
                    "A Secure Workflow System for Dynamic Collaboration.",
                    "On Securely Scheduling a Meeting.",
                    "Modeling and Analyzing Separation of Duties in Workflow Environments.",
                    "Group Security Association (GSA) Management in IP Multicast.",
                    "Communication-Efficient Group Key Agreement.",
                    "Going Beyond MAC and DAC Using Mobile Policies.",
                    "An Access Control Model for Data Archives.",
                    "Checklist-Based Risk Analysis with Evidential Reasoning.",
                    "Improving the Protection of Assets in Open Distributed Systems by Use of X-ifying Risk Analysis.",
                    "The Security Model to Combine the Corporate and Information Security.",
                    "Design Criteria to Classified Information Systems Numerically.",
                    "Deception: A Tool and Curse for Security Management.",
                    "A Methodology to Detect Temporal Regularities in User Behavior for Anomaly Detection.",
                    "ADeLe: An Attack Description Language for Knowledge-Based Intrusion Detection.",
                    "Sleepy Watermark Tracing: An Active Network-Based Intrusion Response Framework.",
                    "An Efficient Software Protection Scheme.",
                    "Protecting the Creation of Digital Signatures with Trusted Computing Platform Technology Against Attacks by Trojan Horse Programs.",
                    "Security Concerns for Contemporary Development Practices: A Case Study.",
                    "A Paradigmatic Analysis of Conventional Approaches for Developing and Managing Secure IS.",
                    "Redefining Information Systems Security: Viable Information Systems.",
                    "Extended Description Techniques for Security Engineering."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "SEC 2000",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/2000",
                "sub_name": "Information Security for Global Information Infrastructures, IFIP TC11 Fifteenth Annual Working Conference on Information Security, August 22-24, 2000, Beijing, China.",
                "count": 52,
                "papers": [
                    "IT Security Certification and Criteria. Progress, Problems and Perspectives.",
                    "Information Security: Process Evaluation and Product Evaluation.",
                    "Managing Information Security in Healthcare - an Action Research Experience.",
                    "From Trusted Information Security Controls to a Trusted Information Security Environment.",
                    "A Qualitative Approach to Information Availability.",
                    "A Postgraduate Programme on Information and Communication Systems Security.",
                    "Information Security Management Through Measurement.",
                    "The Defense Framework for Large-scale Computer Network System.",
                    "Identity Mapping: An Approach to Unravel Enterprise Security Management Policies.",
                    "Independent Policy Oriented Layering of Security Services.",
                    "Reducing Computer Fraud Through Situational Crime Prevention.",
                    "Policies for Construction of Information Systems' Security Guidelines: Five Approaches.",
                    "\"DNA-proofing\" for Computer Systems - A New Approach to Computer Security?",
                    "Using Smart Cards in an Educational Environment: Services and Security Features.",
                    "MASS: Model for an Auditing Security System.",
                    "Classifying Information for External Release.",
                    "Using Mobile Agent Results to Create Hard-to-Detect Computer Viruses.",
                    "CARDS: A Distributed System for Detecting Coordinated Attacks.",
                    "Robust Audio Watermarking Based on Secure Spread Spectrum and Auditory Perception Model.",
                    "A Simple and Efficient Approach to Verfying Cryptographic Protocols.",
                    "Power Analysis of RC6 and Serpent.",
                    "A Simple Algorithm for Computing Several Sequences Synthesis.",
                    "GSFS - A New Group-Aware Cryptographic File System.",
                    "Robustness-Agile Encryptor for ATM Networks.",
                    "Fast Construction of Secure Discrete Logarithm Problems over Jacobian Varieties.",
                    "A New Serial/Parallel Architecture for a Low Power Modular Multiplier.",
                    "Defending Against Null Calls Stream Attacks by Using a Double-Threshold Dynamic Filter.",
                    "A Multi-Party Non-Repudiation Protocol.",
                    "Analysis and Design of E-voting Protocol.",
                    "Integrated Multi-Agent Approach to Network Security Assurance: Models of Agents' Community.",
                    "Towards Network Denial of Service Resistant Protocols.",
                    "A Generic Graphical Specification Environment for Security Protocol Modelling.",
                    "Anonymous Electronic Voting System with Non-Transferable Voting Passes.",
                    "Improving Packet Filters Management through Automatic and Dynamic Schemes.",
                    "A Context-Sensitive Access Control Model and Prototype Implementation.",
                    "Regulating Access To Semistructured Information on the Web.",
                    "On the Practical Feasibiltiy of Secure Distributed Computing: A Case Study.",
                    "Elements of a Language for Role-Based Access Control.",
                    "Disallowing Unauthorized State Changes of Distributed Shared Objects.",
                    "Framework for Security Analysis and Access Control in a Distributed Service Medical Imaging Network.",
                    "On the Role of Human Morality in Information System Security: The Problems of Descriptivism and Non-descriptive Foundations.",
                    "Information Warfare: Fact or Fiction?",
                    "Enforcing Privacy by Withholding Private Information.",
                    "The Changing Roles of Patent and Copyright Protection for Software and Communication Technology in the Internet Age.",
                    "A Framework for Electronic Commerce Security.",
                    "Electronic Payment Systems with Fair On-line Verification.",
                    "Fair Electronic Cash Systems with Multiple Banks.",
                    "Securing Mobile Agents for Electronic Commerce: An Experiment.",
                    "A Flexible Management Framework for Certificate Status Validation.",
                    "A Security Architecture for Electronic Commerce Applications.",
                    "On the Development of the Advanced Encryption Standard.",
                    "Public Key Infrastructure: Managing the e-Business Security."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "SEC 1998",
        "info": "Vienna, Austria and Budapest, Hungary",
        "venues": []
    },
    {
        "year": "1997",
        "name": "SEC 1997",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/1997",
                "sub_name": "Information Security in Research and Business, Proceedings of the IFIP TC11 13th International Conference on Information Security (SEC '97), 14-16 May 1997, Copenhagen, Denmark.",
                "count": 37,
                "papers": [
                    "Information security - challenges for the next millennium.",
                    "Selection of secure single sign-on solutions for heterogeneous computing environments.",
                    "A formal model to aid documenting and harmonizing of information security requirements.",
                    "A compile-time model for safe information flow in object-oriented databases.",
                    "Deriving Authorizations from Process Analysis in Legacy Information Systems.",
                    "The role of government in creating the IT security infrastructure: builder or bystander?",
                    "Code of Practice: A Standard for Information Security Management.",
                    "Can security baselines replace risk analysis?",
                    "gGSS-API: a group enhanced generic security service.",
                    "Electronic document exchange in Sweden - the legal aspects.",
                    "An attack detection system for secure computer systems - outline of the solution.",
                    "A taxonomy and overview of information security experiments.",
                    "Pseudonymous audit for privacy enhanced intrusion detection.",
                    "Individual management of personal reachability in mobile communication.",
                    "New vistas on info-system security.",
                    "A common criteria framework for the evaluation of information technology systems security.",
                    "A methodology for accrediting a commercial distributed database.",
                    "A comparison of schemes for certification authorities/trusted third parties.",
                    "How to trust systems.",
                    "Integrating information security in the development of telematics systems.",
                    "Developing secure applications: a systematic approach.",
                    "Controlling Internet access at an educational institution.",
                    "Analysis of Java security and hostile applets.",
                    "New organizational forms for information security management.",
                    "Security when outsourcing: concepts, constructs, compliance.",
                    "The IFIP TC11 position on cryptopolicies.",
                    "Towards a holistic view of security and safety of enterprise information and communication technologies: adapting to a changing paradigm.",
                    "A taxonomy of electronic cash schemes.",
                    "Large scale elections by coordinating electoral colleges.",
                    "MVS-SAT: a security administration tool to support SMF protocol data evaluation.",
                    "Security requirements and solutions in distributed electronic health records.",
                    "ODESSA - a new approach to healthcare risk analysis.",
                    "A comprehensive need-to-know access control system and its application for medical information systems.",
                    "The future of networks and network security.",
                    "Securing communications over ATM networks.",
                    "Non-intrusive authentication.",
                    "Roaming security agents enabling intelligent access control and network protection."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "SEC 1996",
        "info": "Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/1996",
                "sub_name": "Information Systems Security, Facing the information society of the 21st Century.",
                "count": 48,
                "papers": [
                    "A practical solution to the complex human issues of information security design.",
                    "The use of business process models for security design in organisations.",
                    "An analyst's view of IS security.",
                    "Location management strategies increasing privacy in mobile communication.",
                    "ID-based authentication for mobile conference call.",
                    "New security paradigms: orthodoxy and heresy.",
                    "Security assurance in information systems.",
                    "A framework for dealing with and specifying security requirements in information systems.",
                    "The effects of time on integrity in information systems.",
                    "EPHOS security: procurement of secure open systems.",
                    "Canada's computer crime laws: ten years of experience.",
                    "Delivery and installation of software: disputes and the burden of proof.",
                    "Information security on the electronic superhighway.",
                    "A taxonomy for analyzing hazards to information systems.",
                    "Models and tools for quantitative assessment of operational security.",
                    "Activating dynamic counter measures to reduce risk.",
                    "Distributed registration and key distribution (DiRK).",
                    "On the reconstruction of shared secrets.",
                    "A hierarchical threshold scheme with unique partial keys.",
                    "Efficient and provably secure key agreement.",
                    "Internetwork access control using public key certificates.",
                    "The security architecture of IRO-DB.",
                    "Securely executing multilevel transactions.",
                    "A decentralized temporal autoritzation model.",
                    "Applications of keystroke analysis for improved login security and continuous user authentication.",
                    "MoFAC: a model for fine-grained access control.",
                    "A discretionary security model for object oriented environments.",
                    "Intention modelling: approximating computer user intentions for detection and prediction of intrusions.",
                    "An attack detection system for secure computer systems - design of the ADS.",
                    "IT security and privacy education.",
                    "A human approach to security management in health care.",
                    "Security enforcement in a European medical device vigilance system network.",
                    "Design of secure medical database systems.",
                    "Evaluation of the security of distributed IT systems through ITSEC/ITSEM: experiences and findings.",
                    "SNMP-based network security management using a temporal database approach.",
                    "Security profile for interconnected open distributed systems with varying vulnerability.",
                    "A model for the detection of the message stream delay attack.",
                    "Security model for distributed object framework and its applicability to CORBA.",
                    "Software quality assurance: the underlying framework for achieving secure and reliable software systems.",
                    "Configuration management - a basis of the high assurance software engineering process.",
                    "Multi-purpose security module based on smart cards.",
                    "An authentication service supporting domain-based access control policies.",
                    "On security models.",
                    "Risks on the way to the global information society.",
                    "Crypto Manager: an object oriented software library for cryptographic mechanisms.",
                    "Cryptographic key distribution and authentication protocols for secure group communication.",
                    "A new hybrid encryption scheme for computer networks.",
                    "From zero-knowledge to a practical authentication protocol."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "SEC 1995",
        "info": "Cape Town, South Africa",
        "venues": []
    },
    {
        "year": "1994",
        "name": "SEC 1994",
        "info": "Curacao",
        "venues": []
    },
    {
        "year": "1993",
        "name": "SEC 1993",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/1993",
                "sub_name": "Computer Security, Proceedings of the IFIP TC11, Ninth International Conference on Information Security, IFIP/Sec '93, Toronto, Canada, 12-14 May 1993.",
                "count": 32,
                "papers": [
                    "A View of Information Security Tomorrow.",
                    "The Evolution of IT Security Convergence.",
                    "Teaching security basics: The Importance of When and How.",
                    "The MSc in Information Security at Royal Holloway.",
                    "Information Security in the Small Systems Context: A Framework for Understanding.",
                    "Developing Awareness, Training and Education: A Cost Effective Tool for Maintaining System Integrity.",
                    "Teaching Computer Security.",
                    "The Filter Model of Information Security: A Conceptual Model for Education and Training.",
                    "Shamir's Scheme Says It all.",
                    "LUC: A New Public Key System.",
                    "The Encapsulated Security Services Interface (ESSI).",
                    "Context-Dependent Access Control in Distributed Systems.",
                    "Internal Control by Objectives: The Functional Control Matrix.",
                    "International Standards and Organizational Security Needs: Bridging the Gap.",
                    "The Risk Data Repository: A Novel Approach to Security Risk Modelling.",
                    "Turning Multiple Evaluated Products into Trusted Systems with Assurance.",
                    "Historical Labels in Open Distributed Systems: An ITSEC/ECMA Specification.",
                    "A Model for Organising Information Security Documentation.",
                    "Planning for the EDI of Tomorrow Using Electronic Document Authorization.",
                    "The EDP Auditor: Disappearing Or Adapting.",
                    "Electronic Data Interface (EDI) Security and Audit: A Practical Approach.",
                    "A Generic Security Platform for Workstations.",
                    "Evaluation of an Academic Programme in IT Security 1985-1990.",
                    "Fighting the Viruses: Practical Anti-Virus Training.",
                    "A Quantitative Accreditation Model - Assessing the Value of Assurance.",
                    "Superseding Manual Generation of Access Control Specification - From Policies to Profiles.",
                    "Extending the ISO Access Framework for Multiple Policies.",
                    "Evolution of IT Security in India - Implementation Issues.",
                    "Legal Response to a Computer Crime - Retrospect of a \"Mere Chance\" Case.",
                    "Information Systems Security and Fraud Prevention in Office Automation Systems.",
                    "A Process Approach to Information Security Management.",
                    "MRA: A Computational Technique for Security in High-Performance Systems."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "SEC 1992",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/sec/1992",
                "sub_name": "IT Security: The Need for International Cooperation, Proceedings of the IFIP TC11, Eigth International Conference on Information Security, IFIP/Sec '92, Singapore, 27-29 May 1992.",
                "count": 37,
                "papers": [
                    "International Information Technology (IT) Security Cooperation into the 21st Century.",
                    "Computer Disasters: The Impact on Business in the 1990's.",
                    "ASEAN - Computer Crime and Corrective Action: A Status Report.",
                    "Information Security: The Impact of End User Computing.",
                    "PRAJORIS: A Pragmatic 'Joint' Method for Raising the Information Security Level in a Company.",
                    "The Status of IT Security in Leading European Organisations.",
                    "Findings of the Swedish CITI Project on Information Technology Security Evaluation and Certification.",
                    "Secure Open Systems: An Investigation of Current Standardisation Efforts.",
                    "Network Security: Design of a Global Secure Link.",
                    "MAPS - Model for Automated Profile Specification.",
                    "Cryptography and the Art of Securing Transactions.",
                    "Restating the Foundation of Information Security.",
                    "Data Security Model for Branch Offices of Big Organisations.",
                    "Practical Security for the Small Computer User.",
                    "Information Security Awareness - Selling the Cause.",
                    "A Company's Battle Against the Virus Plague.",
                    "How Expert are Auditors in the Computer Security Field? South African Findings and Interpretations.",
                    "IS Audit Research: A Paradigm and A Framework.",
                    "Measuring the Strength of Ciphers.",
                    "Cryptographic Protocols and Network Security.",
                    "A Solution to Generalized Group Oriented Cryptography.",
                    "A Methodology for Describing Information and Physical Security Architectures.",
                    "A Methodology for the Investigation of Computer Crime.",
                    "Detering Highly Motivated Computer Abusers: A Field Experiment in Computer Security.",
                    "IT Crime - An Intelligence Report.",
                    "UNIX Operating System Security.",
                    "DISCO - A Discretionary Security Model for Object-oriented Databases.",
                    "Referential Integrity in Multilevel Secure Database Management Systems.",
                    "A Complex Approach to the Security of Statistical Databases Subject to Off-line Sum Queries.",
                    "The New Security Paradigm in the Enterprise Computing Environment.",
                    "Integrating B2 Security into a UNIX System.",
                    "Rule-based Trusted Access Control.",
                    "Covernmentware: A New Vehicle to Boost Computer Security on a National Level.",
                    "A Rule-based Intrusion Detection System.",
                    "Access Control - A Further Approach.",
                    "Computer Crimes: A Study of Different Types of Offences and Offenders.",
                    "Dealing with Computer Misuse - The Need for an International Approach."
                ]
            }
        ]
    }
]