[
    {
        "year": "2021",
        "name": "17th SecureComm 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2021-1",
                "sub_name": "Security and Privacy in Communication Networks - 17th EAI International Conference, SecureComm 2021, Virtual Event, September 6-9, 2021, Proceedings, Part I.",
                "count": 26,
                "papers": [
                    "DeepHunter: A Graph Neural Network Based Approach for Robust Cyber Threat Hunting.",
                    "SIEMA: Bringing Advanced Analytics to Legacy Security Information and Event Management.",
                    "Automatic Generation of Malware Threat Intelligence from Unstructured Malware Traces.",
                    "Towards Automated Assessment of Vulnerability Exposures in Security Operations.",
                    "Repeatable Experimentation for Cybersecurity Moving Target Defense.",
                    "MPD: Moving Target Defense Through Communication Protocol Dialects.",
                    "GuardedGossip: Secure and Anonymous Node Discovery in Untrustworthy Networks.",
                    "An Extensive Security Analysis on Ethereum Smart Contracts.",
                    "A Distributed Ledger for Non-attributable Cyber Threat Intelligence Exchange.",
                    "Understanding ε for Differential Privacy in Differencing Attack Scenarios.",
                    "Explanation-Guided Diagnosis of Machine Learning Evasion Attacks.",
                    "ToFi: An Algorithm to Defend Against Byzantine Attacks in Federated Learning.",
                    "TESLAC: Accelerating Lattice-Based Cryptography with AI Accelerator.",
                    "Research of CPA Attack Methods Based on Ant Colony Algorithm.",
                    "Local Model Privacy-Preserving Study for Federated Learning.",
                    "Cryptonite: A Framework for Flexible Time-Series Secure Aggregation with Non-interactive Fault Recovery.",
                    "Cryptonomial: A Framework for Private Time-Series Polynomial Calculations.",
                    "Provably Secure Contact Tracing with Conditional Private Set Intersection.",
                    "Origin Attribution of RSA Public Keys.",
                    "Fine-Grained Intra-domain Bandwidth Allocation Against DDoS Attack.",
                    "TMT-RF: Tunnel Mixed Traffic Classification Based on Random Forest.",
                    "CROCUS: An Objective Approach for SDN Controllers Security Assessment.",
                    "Controlling Network Traffic Microstructures for Machine-Learning Model Probing.",
                    "Using NetFlow to Measure the Impact of Deploying DNS-based Blacklists.",
                    "A Forensic Tool to Acquire Radio Signals Using Software Defined Radio.",
                    "SemFlow: Accurate Semantic Identification from Low-Level System Data."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2021-2",
                "sub_name": "Security and Privacy in Communication Networks - 17th EAI International Conference, SecureComm 2021, Virtual Event, September 6-9, 2021, Proceedings, Part II.",
                "count": 28,
                "papers": [
                    "Analyzing Security Risks of Ad-Based URL Shortening Services Caused by Users' Behaviors.",
                    "XHunter: Understanding XXE Vulnerability via Automatic Analysis.",
                    "Anonymous Short Communications over Social Networks.",
                    "A Sybil Detection Method in OSN Based on DistilBERT and Double-SN-LSTM for Text Analysis.",
                    "An Empirical Study on Mobile Payment Credential Leaks and Their Exploits.",
                    "System-Wide Security for Offline Payment Terminals.",
                    "Horus: A Security Assessment Framework for Android Crypto Wallets.",
                    "Leakuidator: Leaky Resource Attacks and Countermeasures.",
                    "JABBIC Lookups: A Backend Telemetry-Based System for Malware Triage.",
                    "Facilitating Parallel Fuzzing with Mutually-Exclusive Task Distribution.",
                    "Flowrider: Fast On-Demand Key Provisioning for Cloud Networks.",
                    "Mobile Handset Privacy: Measuring the Data iOS and Android Send to Apple and Google.",
                    "Who's Accessing My Data? Application-Level Access Control for Bluetooth Low Energy.",
                    "HTPD: Secure and Flexible Message-Based Communication for Mobile Apps.",
                    "Smartphone Location Spoofing Attack in Wireless Networks.",
                    "Compromised Through Compression - Privacy Implications of Smart Meter Traffic Analysis.",
                    "iDDAF: An Intelligent Deceptive Data Acquisition Framework for Secure Cyber-Physical Systems.",
                    "Encouraging the Adoption of Post-Quantum Hybrid Key Exchange in Network Security.",
                    "Quantitative and Qualitative Investigations into Trusted Execution Environments.",
                    "Phishing Web Page Detection with Semi-Supervised Deep Anomaly Detection.",
                    "Poisoning Attack for Inter-agent Transfer Learning.",
                    "An Efficient Post-Quantum PKE from RLWR with Simple Security Proof.",
                    "Kyber on ARM64: Compact Implementations of Kyber on 64-Bit ARM Cortex-A Processors.",
                    "Compressed SIKE Round 3 on ARM Cortex-M4.",
                    "A Quantum Circuit to Speed-Up the Cryptanalysis of Code-Based Cryptosystems.",
                    "Hardware Deployment of Hybrid PQC: SIKE+ECDH.",
                    "Towards Stealing Deep Neural Networks on Mobile Devices.",
                    "Phishing Website Detection from URLs Using Classical Machine Learning ANN Model."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "16th SecureComm 2020",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2020-1",
                "sub_name": "Security and Privacy in Communication Networks - 16th EAI International Conference, SecureComm 2020, Washington, DC, USA, October 21-23, 2020, Proceedings, Part I.",
                "count": 30,
                "papers": [
                    "Email Address Mutation for Proactive Deterrence Against Lateral Spear-Phishing Attacks.",
                    "ThreatZoom: Hierarchical Neural Network for CVEs to CWEs Classification.",
                    "Detecting Dictionary Based AGDs Based on Community Detection.",
                    "On the Accuracy of Measured Proximity of Bluetooth-Based Contact Tracing Apps.",
                    "A Formal Verification of Configuration-Based Mutation Techniques for Moving Target Defense.",
                    "Coronavirus Contact Tracing App Privacy: What Data Is Shared by the Singapore OpenTrace App?",
                    "The Maestro Attack: Orchestrating Malicious Flows with BGP.",
                    "pyDNetTopic: A Framework for Uncovering What Darknet Market Users Talking About.",
                    "MisMesh: Security Issues and Challenges in Service Meshes.",
                    "The Bitcoin Hunter: Detecting Bitcoin Traffic over Encrypted Channels.",
                    "MAAN: A Multiple Attribute Association Network for Mobile Encrypted Traffic Classification.",
                    "Assessing Adaptive Attacks Against Trained JavaScript Classifiers.",
                    "An Encryption System for Securing Physical Signals.",
                    "A Cooperative Jamming Game in Wireless Networks Under Uncertainty.",
                    "SmartSwitch: Efficient Traffic Obfuscation Against Stream Fingerprinting.",
                    "Misreporting Attacks in Software-Defined Networking.",
                    "A Study of the Privacy of COVID-19 Contact Tracing Apps.",
                    "Best-Effort Adversarial Approximation of Black-Box Malware Classifiers.",
                    "Review Trade: Everything Is Free in Incentivized Review Groups.",
                    "Integrity: Finding Integer Errors by Targeted Fuzzing.",
                    "Improving Robustness of a Popular Probabilistic Clustering Algorithm Against Insider Attacks.",
                    "Automated Bystander Detection and Anonymization in Mobile Photography.",
                    "SmartWiFi: Universal and Secure Smart Contract-Enabled WiFi Hotspot.",
                    "ByPass: Reconsidering the Usability of Password Managers.",
                    "Anomaly Detection on Web-User Behaviors Through Deep Learning.",
                    "Identity Armour: User Controlled Browser Security.",
                    "Connecting Web Event Forecasting with Anomaly Detection: A Case Study on Enterprise Web Applications Using Self-supervised Neural Networks.",
                    "Performance Analysis of Elliptic Curves for VoIP Audio Encryption Using a Softphone.",
                    "TCNN: Two-Way Convolutional Neural Network for Image Steganalysis.",
                    "PrivyTRAC - Privacy and Security Preserving Contact Tracing System."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2020-2",
                "sub_name": "Security and Privacy in Communication Networks - 16th EAI International Conference, SecureComm 2020, Washington, DC, USA, October 21-23, 2020, Proceedings, Part II.",
                "count": 30,
                "papers": [
                    "A Practical Machine Learning-Based Framework to Detect DNS Covert Communication in Enterprises.",
                    "CacheLoc: Leveraging CDN Edge Servers for User Geolocation.",
                    "Modeling Mission Impact of Cyber Attacks on Energy Delivery Systems.",
                    "Identifying DApps and User Behaviors on Ethereum via Encrypted Traffic.",
                    "TransNet: Unseen Malware Variants Detection Using Deep Transfer Learning.",
                    "A Brokerage Approach for Secure Multi-Cloud Storage Resource Management.",
                    "On the Effectiveness of Behavior-Based Ransomware Detection.",
                    "PoQ: A Consensus Protocol for Private Blockchains Using Intel SGX.",
                    "Share Withholding in Blockchain Mining.",
                    "PEDR: A Novel Evil Twin Attack Detection Scheme Based on Phase Error Drift Range.",
                    "Differentially Private Social Graph Publishing for Community Detection.",
                    "LaaCan: A Lightweight Authentication Architecture for Vehicle Controller Area Network.",
                    "A Machine Learning Based Smartphone App for GPS Spoofing Detection.",
                    "AOMDroid: Detecting Obfuscation Variants of Android Malware Using Transfer Learning.",
                    "ML-Based Early Detection of IoT Botnets.",
                    "Post-Quantum Cryptography in WireGuard VPN.",
                    "Evaluating the Cost of Personnel Activities in Cybersecurity Management: A Case Study.",
                    "SGX-Cube: An SGX-Enhanced Single Sign-On System Against Server-Side Credential Leakage.",
                    "EW256357: A New Secure NIST P-256 Compatible Elliptic Curve for VoIP Applications' Security.",
                    "Ucam: A User-Centric, Blockchain-Based and End-to-End Secure Home IP Camera System.",
                    "Private Global Generator Aggregation from Different Types of Local Models.",
                    "Perturbing Smart Contract Execution Through the Underlying Runtime.",
                    "Blockchain Based Multi-keyword Similarity Search Scheme over Encrypted Data.",
                    "Using the Physical Layer to Detect Attacks on Building Automation Networks.",
                    "Formalizing Dynamic Behaviors of Smart Contract Workflow in Smart Healthcare Supply Chain.",
                    "Malware Classification Using Attention-Based Transductive Learning Network.",
                    "COOB: Hybrid Secure Device Pairing Scheme in a Hostile Environment.",
                    "A Robust Watermarking Scheme with High Security and Low Computational Complexity.",
                    "Selecting Privacy Enhancing Technologies for IoT-Based Services.",
                    "Khopesh - Contact Tracing Without Sacrificing Privacy."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "15th SecureComm 2019",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2019-1",
                "sub_name": "Security and Privacy in Communication Networks - 15th EAI International Conference, SecureComm 2019, Orlando, FL, USA, October 23-25, 2019, Proceedings, Part I.",
                "count": 28,
                "papers": [
                    "Trustless Framework for Iterative Double Auction Based on Blockchain.",
                    "Towards a Multi-chain Future of Proof-of-Space.",
                    "Secure Consistency Verification for Untrusted Cloud Storage by Public Blockchains.",
                    "An Enhanced Verifiable Inter-domain Routing Protocol Based on Blockchain.",
                    "Edge-Assisted CNN Inference over Encrypted Data for Internet of Things.",
                    "POKs Based Secure and Energy-Efficient Access Control for Implantable Medical Devices.",
                    "USB-Watch: A Dynamic Hardware-Assisted USB Threat Detection Framework.",
                    "Automated IoT Device Fingerprinting Through Encrypted Stream Classification.",
                    "DeepCG: Classifying Metamorphic Malware Through Deep Learning of Call Graphs.",
                    "ChaffyScript: Vulnerability-Agnostic Defense of JavaScript Exploits via Memory Perturbation.",
                    "Obfusifier: Obfuscation-Resistant Android Malware Detection System.",
                    "Closing the Gap with APTs Through Semantic Clusters and Automated Cybergames.",
                    "Stochastic ADMM Based Distributed Machine Learning with Differential Privacy.",
                    "Topology-Aware Hashing for Effective Control Flow Graph Similarity Analysis.",
                    "Trojan Attack on Deep Generative Models in Autonomous Driving.",
                    "FuncNet: A Euclidean Embedding Approach for Lightweight Cross-platform Binary Recognition.",
                    "Towards Forward Secure Internet Traffic.",
                    "Traffic-Based Automatic Detection of Browser Fingerprinting.",
                    "Measuring Tor Relay Popularity.",
                    "SoK: ATT&CK Techniques and Trends in Windows Malware.",
                    "Covert Channels in SDN: Leaking Out Information from Controllers to End Hosts.",
                    "Victim-Aware Adaptive Covert Channels.",
                    "Random Allocation Seed-DSSS Broadcast Communication Against Jamming Attacks.",
                    "A Loss-Tolerant Mechanism of Message Segmentation and Reconstruction in Multi-path Communication of Anti-tracking Network.",
                    "Ticket Transparency: Accountable Single Sign-On with Privacy-Preserving Public Logs.",
                    "Decentralized Privacy-Preserving Reputation Management for Mobile Crowdsensing.",
                    "Location Privacy Issues in the OpenSky Network Crowdsourcing Platform.",
                    "Privacy-Preserving Genomic Data Publishing via Differentially-Private Suffix Tree."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2019-2",
                "sub_name": "Security and Privacy in Communication Networks - 15th EAI International Conference, SecureComm 2019, Orlando, FL, USA, October 23-25, 2019, Proceedings, Part II.",
                "count": 29,
                "papers": [
                    "TL;DR Hazard: A Comprehensive Study of Levelsquatting Scams.",
                    "Account Lockouts: Characterizing and Preventing Account Denial-of-Service Attacks.",
                    "Application Transiency: Towards a Fair Trade of Personal Information for Application Services.",
                    "CustomPro: Network Protocol Customization Through Cross-Host Feature Analysis.",
                    "On the Security of TRNGs Based on Multiple Ring Oscillators.",
                    "Secrecy on a Gaussian Relay-Eavesdropper Channel with a Trusted Relay.",
                    "Target Information Trading - An Economic Perspective of Security.",
                    "Cyber Threat Analysis Based on Characterizing Adversarial Behavior for Energy Delivery System.",
                    "The Disbanding Attack: Exploiting Human-in-the-Loop Control in Vehicular Platooning.",
                    "Generic Construction of ElGamal-Type Attribute-Based Encryption Schemes with Revocability and Dual-Policy.",
                    "Online Cyber Deception System Using Partially Observable Monte-Carlo Planning Framework.",
                    "SEVGuard: Protecting User Mode Applications Using Secure Encrypted Virtualization.",
                    "A Behavior-Aware Profiling of Smart Contracts.",
                    "A Performance-Optimization Method for Reusable Fuzzy Extractor Based on Block Error Distribution of Iris Trait.",
                    "Detecting Root-Level Endpoint Sensor Compromises with Correlated Activity.",
                    "Footprints: Ensuring Trusted Service Function Chaining in the World of SDN and NFV.",
                    "Hecate: Automated Customization of Program and Communication Features to Reduce Attack Surfaces.",
                    "Phish-Hook: Detecting Phishing Certificates Using Certificate Transparency Logs.",
                    "IIFA: Modular Inter-app Intent Information Flow Analysis of Android Applications.",
                    "Power Analysis and Protection on SPECK and Its Application in IoT.",
                    "Adversarial False Data Injection Attack Against Nonlinear AC State Estimation with ANN in Smart Grid.",
                    "On Effectiveness of Adversarial Examples and Defenses for Malware Classification.",
                    "PrivC - A Framework for Efficient Secure Two-Party Computation.",
                    "CoRide: A Privacy-Preserving Collaborative-Ride Hailing Service Using Blockchain-Assisted Vehicular Fog Computing.",
                    "Non-Interactive MPC with Trusted Hardware Secure Against Residual Function Attacks.",
                    "A Study of the Multiple Sign-in Feature in Web Applications.",
                    "Authenticated LSM Trees with Minimal Trust.",
                    "Modern Family: A Revocable Hybrid Encryption Scheme Based on Attribute-Based Encryption, Symmetric Searchable Encryption and SGX.",
                    "A Nature-Inspired Framework for Optimal Mining of Attribute-Based Access Control Policies."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "14th SecureComm 2018",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2018-1",
                "sub_name": "Security and Privacy in Communication Networks - 14th International Conference, SecureComm 2018, Singapore, August 8-10, 2018, Proceedings, Part I.",
                "count": 32,
                "papers": [
                    "A Secure Remote Monitoring Framework Supporting Efficient Fine-Grained Access Control and Data Processing in IoT.",
                    "Securing the Smart Home via a Two-Mode Security Framework.",
                    "Out of Kilter: Holistic Exploitation of Denial of Service in Internet of Things.",
                    "Augmented Chain of Ownership: Configuring IoT Devices with the Help of the Blockchain.",
                    "Secure and Efficient Multi-Party Directory Publication for Privacy-Preserving Data Sharing.",
                    "A Formal Logic Framework for the Automation of the Right to Be Forgotten.",
                    "Privacy-Preserving Biometric-Based Remote User Authentication with Leakage Resilience.",
                    "Differentially Private High-Dimensional Data Publication via Markov Network.",
                    "Automated Identification of Sensitive Data via Flexible User Requirements.",
                    "Understanding Android Obfuscation Techniques: A Large-Scale Investigation in the Wild.",
                    "Transparent Low-Latency Network Anonymisation for Mobile Devices.",
                    "Inferring UI States of Mobile Applications Through Power Side Channel Exploitation.",
                    "PoliteCamera: Respecting Strangers' Privacy in Mobile Photographing.",
                    "Lexical Mining of Malicious URLs for Classifying Android Malware.",
                    "GranDroid: Graph-Based Detection of Malicious Network Behaviors in Android Applications.",
                    "FGFDect: A Fine-Grained Features Classification Model for Android Malware Detection.",
                    "An Adaptive Primary User Emulation Attack Detection Mechanism for Cognitive Radio Networks.",
                    "VeReMi: A Dataset for Comparable Evaluation of Misbehavior Detection in VANETs.",
                    "Birds of a Feather Flock Together: Fuzzy Extractor and Gait-Based Robust Group Secret Key Generation for Smart Wearables.",
                    "Unchained Identities: Putting a Price on Sybil Nodes in Mobile Ad Hoc Networks.",
                    "Understanding the Hidden Cost of Software Vulnerabilities: Measurements and Predictions.",
                    "Privacy-Enhanced Fraud Detection with Bloom Filters.",
                    "FriSM: Malicious Exploit Kit Detection via Feature-Based String-Similarity Matching.",
                    "A Machine Learning Framework for Studying Domain Generation Algorithm (DGA)-Based Malware.",
                    "Se-Lambda: Securing Privacy-Sensitive Serverless Applications Using SGX Enclave.",
                    "CAVAS: Neutralizing Application and Container Security Vulnerabilities in the Cloud Native Era.",
                    "Shuffler: Mitigate Cross-VM Side-Channel Attacks via Hypervisor Scheduling.",
                    "Building Your Private Cloud Storage on Public Cloud Service Using Embedded GPUs.",
                    "Secure and Efficient Outsourcing of Large-Scale Overdetermined Systems of Linear Equations.",
                    "Privacy-Preserving Multiparty Learning for Logistic Regression.",
                    "Privacy-Preserving Outsourcing of Large-Scale Nonlinear Programming to the Cloud.",
                    "A Verifiable and Dynamic Multi-keyword Ranked Search Scheme over Encrypted Cloud Data with Accuracy Improvement."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2018-2",
                "sub_name": "Security and Privacy in Communication Networks - 14th International Conference, SecureComm 2018, Singapore, August 8-10, 2018, Proceedings, Part II.",
                "count": 29,
                "papers": [
                    "A Mobile Botnet That Meets Up at Twitter.",
                    "Detecting Suspicious Members in an Online Emotional Support Service.",
                    "Towards a Reliable and Accountable Cyber Supply Chain in Energy Delivery System Using Blockchain.",
                    "Social Bot Detection Using Tweets Similarity.",
                    "A Multi-protocol Authentication Shibboleth Framework and Implementation for Identity Federation.",
                    "SDN-Assisted Network-Based Mitigation of Slow DDoS Attacks.",
                    "A Holistic Approach Towards Peer-to-Peer Security and Why Proof of Work Won't Do.",
                    "A Robust Intrusion Detection Network Using Thresholdless Trust Management System with Incentive Design.",
                    "A Metapolicy Framework for Enhancing Domain Expressiveness on the Internet.",
                    "Adaptive Deterrence of DNS Cache Poisoning.",
                    "Mission-Oriented Security Model, Incorporating Security Risk, Cost and Payout.",
                    "On the Feasibility of Fine-Grained TLS Security Configurations in Web Browsers Based on the Requested Domain Name.",
                    "Neural Network Based Min-entropy Estimation for Random Number Generators.",
                    "Improved Quantum Key Distribution Networks Based on Blom-Scheme.",
                    "Implementation of High Throughput XTS-SM4 Module for Data Storage Devices.",
                    "Detecting and Defending Against Certificate Attacks with Origin-Bound CAPTCHAs.",
                    "FrameHanger: Evaluating and Classifying Iframe Injection at Large Scale.",
                    "Xilara: An XSS Filter Based on HTML Template Restoration.",
                    "Local Storage on Steroids: Abusing Web Browsers for Hidden Content Storage and Distribution.",
                    "A Review and Costing of Lightweight Authentication Schemes for Internet of Things (IoT): Towards Design of an Authentication Architecture for Smart Home Applications.",
                    "A Survey of Big Data Security Solutions in Healthcare.",
                    "Malware Detection for Healthcare Data Security.",
                    "Secure Communication on NoC Based MPSoC.",
                    "Online Radicalisation Along a Continuum: From When Individuals Express Grievances to When They Transition into Extremism.",
                    "A Multiple Linear Regression Based High-Performance Error Prediction Method for Reversible Data Hiding.",
                    "A Secure AODV Protocol Improvement Scheme Based on Fuzzy Neural Network.",
                    "What's in a Downgrade? A Taxonomy of Downgrade Attacks in the TLS Protocol and Application Protocols Using TLS.",
                    "An Approach to Enhance Understanding of Digital Forensics Technical Terms in the Presentation Phase of a Digital Investigation Using Multimedia Presentations.",
                    "Event Reconstruction of Indonesian E-Banking Services on Windows Phone Devices."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "13th SecureComm 2017",
        "info": "Niagara Falls, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2017",
                "sub_name": "Security and Privacy in Communication Networks - 13th International Conference, SecureComm 2017, Niagara Falls, ON, Canada, October 22-25, 2017, Proceedings.",
                "count": 46,
                "papers": [
                    "Gray-Box Software Integrity Checking via Side-Channels.",
                    "Enhancing Android Security Through App Splitting.",
                    "Very Short Intermittent DDoS Attacks in an Unsaturated System.",
                    "Outsourced k-Means Clustering over Encrypted Data Under Multiple Keys in Spark Framework.",
                    "Guilt-by-Association: Detecting Malicious Entities via Graph Mining.",
                    "Twisting Lattice and Graph Techniques to Compress Transactional Ledgers.",
                    "Privacy-Preserving Relevance Ranking Scheme and Its Application in Multi-keyword Searchable Encryption.",
                    "Exploring the Network of Real-World Passwords: Visualization and Estimation.",
                    "ThiefTrap - An Anti-theft Framework for Android.",
                    "BluePass: A Secure Hand-Free Password Manager.",
                    "Lambda Obfuscation.",
                    "Turing Obfuscation.",
                    "All Your Accounts Are Belong to Us.",
                    "SDN-Based Kernel Modular Countermeasure for Intrusion Detection.",
                    "LinkFlow: Efficient Large-Scale Inter-app Privacy Leakage Detection.",
                    "Exposing LTE Security Weaknesses at Protocol Inter-layer, and Inter-radio Interactions.",
                    "Achieve Efficient and Privacy-Preserving Proximity Detection Scheme for Social Applications.",
                    "Disrupting SDN via the Data Plane: A Low-Rate Flow Table Overflow Attack.",
                    "VCIDS: Collaborative Intrusion Detection of Sensor and Actuator Attacks on Connected Vehicles.",
                    "Understanding Adversarial Strategies from Bot Recruitment to Scheduling.",
                    "Mending Wall: On the Implementation of Censorship in India.",
                    "A Deep Learning Based Online Malicious URL and DNS Detection Scheme.",
                    "Visual Analysis of Android Malware Behavior Profile Based on PMCG_droid : A Pruned Lightweight APP Call Graph.",
                    "Inferring Implicit Assumptions and Correct Usage of Mobile Payment Protocols.",
                    "HSTS Measurement and an Enhanced Stripping Attack Against HTTPS.",
                    "Defining and Detecting Environment Discrimination in Android Apps.",
                    "Query Recovery Attacks on Searchable Encryption Based on Partial Knowledge.",
                    "H _2 DoS: An Application-Layer DoS Attack Towards HTTP/2 Protocol.",
                    "Optimizing TLB for Access Pattern Privacy Protection in Data Outsourcing.",
                    "An Efficient Trustzone-Based In-application Isolation Schema for Mobile Authenticators.",
                    "A Program Manipulation Middleware and Its Applications on System Security.",
                    "Cross-site Input Inference Attacks on Mobile Web Users.",
                    "BKI: Towards Accountable and Decentralized Public-Key Infrastructure with Blockchain.",
                    "FRProtector: Defeating Control Flow Hijacking Through Function-Level Randomization and Transfer Protection.",
                    "VaultIME: Regaining User Control for Password Managers Through Auto-Correction.",
                    "TopHat : Topology-Based Host-Level Attribution for Multi-stage Attacks in Enterprise Systems Using Software Defined Networks.",
                    "JSForce: A Forced Execution Engine for Malicious JavaScript Detection.",
                    "ROPOB: Obfuscating Binary Code via Return Oriented Programming.",
                    "DiffGuard: Obscuring Sensitive Information in Canary Based Protections.",
                    "A Sudoku Matrix-Based Method of Pitch Period Steganography in Low-Rate Speech Coding.",
                    "A Framework for Formal Analysis of Privacy on SSO Protocols.",
                    "A Hypervisor Level Provenance System to Reconstruct Attack Story Caused by Kernel Malware.",
                    "An On-Demand Defense Scheme Against DNS Cache Poisoning Attacks.",
                    "MPOPE: Multi-provider Order-Preserving Encryption for Cloud Data Privacy.",
                    "SLIM: Secure and Lightweight Identity Management in VANETs with Minimum Infrastructure Reliance.",
                    "A-Tor: Accountable Anonymity in Tor."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2017w",
                "sub_name": "Security and Privacy in Communication Networks - SecureComm 2017 International Workshops, ATCS and SePrIoT, Niagara Falls, ON, Canada, October 22-25, 2017, Proceedings.",
                "count": 22,
                "papers": [
                    "Privacy in Social Media.",
                    "SecControl: Bridging the Gap Between Security Tools and SDN Controllers.",
                    "An Effective Approach for Dealing with the Pressure to Compromise Security During Systems Development.",
                    "Securing Websites Against Homograph Attacks.",
                    "Privacy Threat Analysis of Mobile Social Network Data Publishing.",
                    "Exploring Secure Communication in VANET Broadcasting.",
                    "Identification of Forensic Artifacts in VMWare Virtualized Computing.",
                    "Possible Keyloggers Without Implementing a Keyboard in Android.",
                    "A New Cyber Security Framework Towards Secure Data Communication for Unmanned Aerial Vehicle (UAV).",
                    "Securing Healthcare Data Using Biometric Authentication.",
                    "Fast and Robust Biometric Authentication Scheme Using Human Ear.",
                    "WebAD ^2 2 : A Cascading Model Based on Machine Learning for Web Attacks Detection.",
                    "Human Factors, Self-awareness and Intervention Approaches in Cyber Security When Using Mobile Devices and Social Networks.",
                    "Hiding Fast Flux Botnet in Plain Email Sight.",
                    "Cyber Security Decision Support for Remediation in Automated Computer Network Defence.",
                    "Situational Crime Prevention and the Mitigation of Cloud Computing Threats.",
                    "SoNeUCONABCPro: An Access Control Model for Social Networks with Translucent User Provenance.",
                    "SAFEDroid: Using Structural Features for Detecting Android Malwares.",
                    "Manipulating the Five V's in the Next Generation Air Transportation System.",
                    "A Framework for Acquiring and Analyzing Traces from Cryptographic Devices.",
                    "Sensitive Data in Smartphone Applications: Where Does It Go? Can It Be Intercepted?",
                    "Fault-Tolerant and Scalable Key Management Protocol for IoT-Based Collaborative Groups."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "12th SecureComm 2016",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2016",
                "sub_name": "Security and Privacy in Communication Networks - 12th International Conference, SecureComm 2016, Guangzhou, China, October 10-12, 2016, Proceedings.",
                "count": 49,
                "papers": [
                    "AppShield: Enabling Multi-entity Access Control Cross Platforms for Mobile App Management.",
                    "H-Binder: A Hardened Binder Framework on Android Systems.",
                    "Exploiting Android System Services Through Bypassing Service Helpers.",
                    "Secure Keyboards Against Motion Based Keystroke Inference Attack.",
                    "Cloud-Based Privacy-Preserving Parking Navigation Through Vehicular Communications.",
                    "TruSDN: Bootstrapping Trust in Cloud Network Infrastructure.",
                    "Key Update at Train Stations: Two-Layer Dynamic Key Update Scheme for Secure Train Communications.",
                    "Faulty Node Repair and Dynamically Spawned Black Hole Search.",
                    "Attribute-Based Encryption with Granular Revocation.",
                    "Tokenisation Blacklisting Using Linkable Group Signatures.",
                    "Privacy-Preserving Multi-pattern Matching.",
                    "Parallel and Dynamic Structured Encryption.",
                    "Secure IoT Using Weighted Signed Graphs.",
                    "A Multi-protocol Security Framework to Support Internet of Things.",
                    "Tinder Me Softly - How Safe Are You Really on Tinder?",
                    "Biometric Authentication Using Facial Recognition.",
                    "Platform as a Service (PaaS) in Public Cloud: Challenges and Mitigating Strategy.",
                    "Architecture Support for Controllable VMI on Untrusted Cloud.",
                    "IacCE: Extended Taint Path Guided Dynamic Analysis of Android Inter-App Data Leakage.",
                    "A Multi-layer Model to Detect Spam Email at Client Side.",
                    "Access Control Management for Secure Cloud Storage.",
                    "Attribution of Economic Denial of Sustainability Attacks in Public Clouds.",
                    "A Secure and Fast Dispersal Storage Scheme Based on the Learning with Errors Problem.",
                    "ase-PoW: A Proof of Ownership Mechanism for Cloud Deduplication in Hierarchical Environments.",
                    "Website Forensic Investigation to Identify Evidence and Impact of Compromise.",
                    "SecWeb: Privacy-Preserving Web Browsing Monitoring with w-Event Differential Privacy.",
                    "A Behavioral Biometrics Based Approach to Online Gender Classification.",
                    "Unique on the Road: Re-identification of Vehicular Location-Based Metadata.",
                    "BinDNN: Resilient Function Matching Using Deep Learning.",
                    "TZ-SSAP: Security-Sensitive Application Protection on Hardware-Assisted Isolated Environment.",
                    "SQLite Forensic Analysis Based on WAL.",
                    "Impact of Environment on Branch Transfer of Software.",
                    "DroidClassifier: Efficient Adaptive Mining of Application-Layer Header for Classifying Android Malware.",
                    "GreatEatlon: Fast, Static Detection of Mobile Ransomware.",
                    "Data Flow Analysis on Android Platform with Fragment Lifecycle Modeling.",
                    "Alde: Privacy Risk Analysis of Analytics Libraries in the Android Ecosystem.",
                    "FROPUF: How to Extract More Entropy from Two Ring Oscillators in FPGA-Based PUFs.",
                    "Extracting More Entropy for TRNGs Based on Coherent Sampling.",
                    "A Very Compact Masked S-Box for High-Performance Implementation of SM4 Based on Composite Field.",
                    "Security Analysis of Vendor Customized Code in Firmware of Embedded Device.",
                    "POSTER: Security Analysis of Personal Unmanned Aerial Vehicles.",
                    "Modeling User Browsing Activity for Application Layer DDoS Attack Detection.",
                    "POSTER: A Framework for IoT Reprogramming.",
                    "Privacy Preserving Data Classification Using Inner Product Encryption.",
                    "POSTER: Location Privacy Using Homomorphic Encryption.",
                    "SDNGuardian: Secure Your REST NBIs with API-Grained Permission Checking System.",
                    "POSTER: A Novel Wavelet Denoising Method Based on Robust Principal Component Analysis in Side Channel Attacks.",
                    "Exploitation of NetEm Utility for Non-payload-based Obfuscation Techniques Improving Network Anomaly Detection.",
                    "POSTER: Non-intrusive Face Spoofing Detection Based on Guided Filtering and Image Quality Analysis."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "11th SecureComm 2015",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2015",
                "sub_name": "Security and Privacy in Communication Networks - 11th International Conference, SecureComm 2015, Dallas, TX, USA, October 26-29, 2015, Revised Selected Papers.",
                "count": 48,
                "papers": [
                    "FineDroid: Enforcing Permissions with System-Wide Application Execution Context.",
                    "Detection, Classification and Characterization of Android Malware Using API Data Dependency.",
                    "KeyPocket - Improving Security and Usability for Provider Independent Login Architectures with Mobile Devices.",
                    "Using Provenance Patterns to Vet Sensitive Behaviors in Android Apps.",
                    "SplitDroid: Isolated Execution of Sensitive Components for Mobile Applications.",
                    "Intrinsic Code Attestation by Instruction Chaining for Embedded Devices.",
                    "Defeating Kernel Driver Purifier.",
                    "Kernel Data Attack Is a Realistic Security Threat.",
                    "RScam: Cloud-Based Anti-Malware via Reversible Sketch.",
                    "TADOOP: Mining Network Traffic Anomalies with Hadoop.",
                    "SuperCall: A Secure Interface for Isolated Execution Environment to Dynamically Use External Services.",
                    "Authenticating Top-k Results of Secure Multi-keyword Search in Cloud Computing.",
                    "Resource Efficient Privacy Preservation of Online Social Media Conversations.",
                    "Uranine: Real-time Privacy Leakage Monitoring without System Modification for Android.",
                    "Practicality of Using Side-Channel Analysis for Software Integrity Checking of Embedded Systems.",
                    "Remote Activation of Hardware Trojans via a Covert Temperature Channel.",
                    "Route Leaks Identification by Detecting Routing Loops.",
                    "Pulsar: Stateful Black-Box Fuzzing of Proprietary Network Protocols.",
                    "You Are How You Query: Deriving Behavioral Fingerprints from DNS Traffic.",
                    "Enhancing Traffic Analysis Resistance for Tor Hidden Services with Multipath Routing.",
                    "An Improved Method for Anomaly-Based Network Scan Detection.",
                    "Why Web Servers Should Fear Their Clients - Abusing Websockets in Browsers for DoS.",
                    "An Attribute-Based Signcryption Scheme to Secure Attribute-Defined Multicast Communications.",
                    "Generation of Transmission Control Rules Compliant with Existing Access Control Policies.",
                    "A Markov Random Field Approach to Automated Protocol Signature Inference.",
                    "How to Prevent to Delegate Authentication.",
                    "Ciphertext-Policy Attribute-Based Encryption with User and Authority Accountability.",
                    "A Decentralized Access Control Model for Dynamic Collaboration of Autonomous Peers.",
                    "Using a 3D Geometrical Model to Improve Accuracy in the Evaluation and Selection of Countermeasures Against Complex Cyber Attacks.",
                    "POSTER: API-Level Multi-policy Access Control Enforcement for Android Middleware.",
                    "POSTER: Reliable and Efficient Protection of Consumer Privacy in Advanced Metering Infrastructure.",
                    "POSTER: A Security Adaptive Steganography System Applied on Digital Audio.",
                    "POSTER: Semantics-Aware Rule Recommendation and Enforcement for Event Paths.",
                    "POSTER: An Approach to Assess Security, Capacity and Reachability for Heterogeneous Industrial Networks.",
                    "POSTER: An Online Prefix-Preserving IP Address Anonymization Algorithm for Passive Measurement Systems.",
                    "POSTER: Ciphertext-Policy Attribute-Based Encryption Method with Secure Decryption Key Generation and Outsourcing Decryption of ABE Ciphertexts.",
                    "POSTER: Context-Adaptive User-Centric Privacy Scheme for VANET.",
                    "POSTER: A Collaborative Approach on Behavior-Based Android Malware Detection.",
                    "POSTER: Using Improved Singular Value Decomposition to Enhance Correlation Power Analysis.",
                    "Securing Application with Software Partitioning: A Case Study Using SGX.",
                    "Image Spam Classification Using Neural Network.",
                    "An Effective t-way Test Data Generation Strategy.",
                    "A Secure Cross-Domain SIP Solution for Mobile Ad Hoc Network Using Dynamic Clustering.",
                    "Community-Based Collaborative Intrusion Detection.",
                    "A Novel Clustering Algorithm for Database Anomaly Detection.",
                    "Secrecy Rate Based User Selection Algorithms for Massive MIMO Wireless Networks.",
                    "Human Surveillance System for Security Application.",
                    "Security Considerations for Wireless Carrier Agonistic Bio-Monitoring Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "10th SecureComm 2014",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2014-1",
                "sub_name": "International Conference on Security and Privacy in Communication Networks - 10th International ICST Conference, SecureComm 2014, Beijing, China, September 24-26, 2014, Revised Selected Papers, Part I.",
                "count": 47,
                "papers": [
                    "Inferring the Stealthy Bridges Between Enterprise Network Islands in Cloud Using Cross-Layer Bayesian Networks.",
                    "A Secure Architecture for Inter-cloud Virtual Machine Migration.",
                    "STRE: Privacy-Preserving Storage and Retrieval over Multiple Clouds.",
                    "An Effective Search Scheme Based on Semantic Tree Over Encrypted Cloud Data Supporting Verifiability.",
                    "Policy Driven Node Selection in MapReduce.",
                    "GridMap: Enhanced Security in Cued-Recall Graphical Passwords.",
                    "UAuth: A Strong Authentication Method from Personal Devices to Multi-accounts.",
                    "TPM-Based Authentication Mechanism for Apache Hadoop.",
                    "An Authentication and Key Management Scheme for Heterogeneous Sensor Networks.",
                    "Social Authentication Identity: An Alternate to Internet Real Name System.",
                    "On the Usability of Two-Factor Authentication.",
                    "Securing Resource Discovery in Content Hosting Networks.",
                    "Detection of Botnet Command and Control Traffic by the Identification of Untrusted Destinations.",
                    "Keep the Fakes Out: Defending Against Sybil Attack in P2P Systems.",
                    "Anonymous Publish-Subscribe Systems.",
                    "Friendly Jamming for Secure Localization in Vehicular Transportation.",
                    "Visual-Assisted Wormhole Attack Detection for Wireless Sensor Networks.",
                    "Implementing an Affordable and Effective GSM IMSI Catcher with 3G Authentication.",
                    "A Simple and Novel Technique for Counteracting Exploit Kits.",
                    "Policy Enforcement Point Model.",
                    "Control Flow Obfuscation Using Neural Network to Fight Concolic Testing.",
                    "EFS: Efficient and Fault-Scalable Byzantine Fault Tolerant Systems Against Faulty Clients.",
                    "SCADS - Separated Control- and Data-Stacks.",
                    "Improving the Security of the HMQV Protocol Using Tamper-Proof Hardware.",
                    "TST: A New Randomness Test Method Based on Coupon Collector's Problem.",
                    "Tree-Based Multi-dimensional Range Search on Encrypted Data with Enhanced Privacy.",
                    "Hardware Implementation of Cryptographic Hash Function Based on Spatiotemporal Chaos.",
                    "An Information-Theoretic Approach for Secure Protocol Composition.",
                    "Towards a Systematic Study of the Covert Channel Attacks in Smartphones.",
                    "DroidKin: Lightweight Detection of Android Apps Similarity.",
                    "Detecting Malicious Behaviors in Repackaged Android Apps with Loosely-Coupled Payloads Filtering Scheme.",
                    "Defending Blind DDoS Attack on SDN Based on Moving Target Defense.",
                    "Function Escalation Attack.",
                    "RAMSES: Revealing Android Malware Through String Extraction and Selection.",
                    "Detecting Mobile Malware with TMSVM.",
                    "Research on Credible Regulation Mechanism for the Trading of Digital Works.",
                    "Coordination and Concurrency Aware Likelihood Assessment of Simultaneous Attacks.",
                    "Domain Algorithmically Generated Botnet Detection and Analysis.",
                    "Towards Improving Service Accessibility by Adaptive Resource Distribution Strategy.",
                    "Hybrid Detection Using Permission Analysis for Android Malware.",
                    "Content Security Scheme for Content Centric Networks.",
                    "Detection of Food Safety Topics Based on SPLDAs.",
                    "Platform Neutral Sandbox for Analyzing Malware and Resource Hogger Apps.",
                    "JumpBox - A Seamless Browser Proxy for Tor Pluggable Transports.",
                    "Abusing Browser Address Bar for Fun and Profit - An Empirical Investigation of Add-On Cross Site Scripting Attacks.",
                    "Characterizing Google Hacking: A First Large-Scale Quantitative Study.",
                    "Detecting Malicious Sessions Through Traffic Fingerprinting Using Hidden Markov Models."
                ]
            },
            {
                "sub_name_abbr": "conf/securecomm/2014-2",
                "sub_name": "International Conference on Security and Privacy in Communication Networks - 10th International ICST Conference, SecureComm 2014, Beijing, China, September 24-26, 2014, Revised Selected Papers, Part II.",
                "count": 32,
                "papers": [
                    "A Performance Comparison Study of a Coverage-Preserving Node Scheduling Scheme and Its Enhancement in Sensor Networks.",
                    "An Improved Authorization Model in Trust Network.",
                    "KEMF: Key Management for Federated Sensor Networks.",
                    "\\mathrmCPS^2 : A Contextual Privacy Framework for Social Software.",
                    "Are You Really My Friend? Exactly Spatiotemporal Matching Scheme in Privacy-Aware Mobile Social Networks.",
                    "RFID Authentication Protocol Resistant to the Man-in-the-Middle Attack.",
                    "METIS: A Two-Tier Intrusion Detection System for Advanced Metering Infrastructures.",
                    "Online Detection of Concurrent Prefix Hijacks.",
                    "Countermeasures for Mitigating ICN Routing Related DDoS Attacks.",
                    "A New Anomaly Detection Method Based on IGTE and IGFE.",
                    "Forensic Potentials of Solid State Drives.",
                    "Cloud Security from Users Point of View: A Pragmatic Study with Thematic Analysis.",
                    "A Secure Real Time Data Processing Framework for Personally Controlled Electronic Health Record (PCEHR) System.",
                    "Novel Iterative Min-Max Clustering to Minimize Information Loss in Statistical Disclosure Control.",
                    "Securing Sensor Networks by Moderating Frequencies.",
                    "Intelligent Financial Fraud Detection Practices: An Investigation.",
                    "Network Traffic Pattern Analysis Using Improved Information Theoretic Co-clustering Based Collective Anomaly Detection.",
                    "A Survey on Mining Program-Graph Features for Malware Analysis.",
                    "Defence Against Code Injection Attacks.",
                    "False Data Injection Attack Targeting the LTC Transformers to Disrupt Smart Grid Operation.",
                    "A Domain-Based Multi-cluster SIP Solution for Mobile Ad Hoc Network.",
                    "virtio-ct: A Secure Cryptographic Token Service in Hypervisors.",
                    "Blind Format String Attacks.",
                    "An Empirical Evaluation of Software Obfuscation Techniques Applied to Android APKs.",
                    "Towards Privacy-Preserving Web Metering via User-Centric Hardware.",
                    "Towards Efficient Update of Access Control Policy for Cryptographic Cloud Storage.",
                    "Uncovering the Dilemmas on Antivirus Software Design in Modern Mobile Platforms.",
                    "Transplantation Attack: Analysis and Prediction.",
                    "Timing-Based Clone Detection on Android Markets.",
                    "A New Trust Chain Security Evaluation Model and Tool.",
                    "A System for Privacy Information Analysis and Safety Assessment of iOS Applications.",
                    "How We Found These Vulnerabilities in Android Applications."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "9th SecureComm 2013",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2013",
                "sub_name": "Security and Privacy in Communication Networks - 9th International ICST Conference, SecureComm 2013, Sydney, NSW, Australia, September 25-28, 2013, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "Anomaly Detection in Beacon-Enabled IEEE 802.15.4 Wireless Sensor Networks.",
                    "Secure and Verifiable Top-k Query in Two-Tiered Sensor Networks.",
                    "CamTalk: A Bidirectional Light Communications Framework for Secure Communications on Smartphones.",
                    "Botnet Triple-Channel Model: Towards Resilient and Efficient Bidirectional Communication Botnets.",
                    "Contrasting Permission Patterns between Clean and Malicious Android Applications.",
                    "DroidAPIMiner: Mining API-Level Features for Robust Malware Detection in Android.",
                    "Disabling a Computer by Exploiting Softphone Vulnerabilities: Threat and Mitigation.",
                    "VCCBox: Practical Confinement of Untrusted Software in Virtual Cloud Computing.",
                    "Integrated Security Architecture for Virtual Machines.",
                    "Generic Mediated Encryption.",
                    "An Efficient Reconfigurable II-ONB Modular Multiplier.",
                    "Public-Key Encryption Resilient to Linear Related-Key Attacks.",
                    "Clonewise - Detecting Package-Level Clones Using Machine Learning.",
                    "Automatic Polymorphic Exploit Generation for Software Vulnerabilities.",
                    "A Novel Web Tunnel Detection Method Based on Protocol Behaviors.",
                    "Salus: Non-hierarchical Memory Access Rights to Enforce the Principle of Least Privilege.",
                    "Scalable Security Model Generation and Analysis Using k-importance Measures.",
                    "The B-Side of Side Channel Leakage: Control Flow Security in Embedded Systems.",
                    "An e-payment Architecture Ensuring a High Level of Privacy Protection.",
                    "Unveiling Privacy Setting Breaches in Online Social Networks.",
                    "Securing a Web-Based Anti-counterfeit RFID System.",
                    "Security Concerns and Remedy in a Cloud Based E-learning System.",
                    "Ensuring Data Integrity by Anomaly Node Detection during Data Gathering in WSNs.",
                    "(k - n) Oblivious Transfer Using Fully Homomorphic Encryption System.",
                    "Detection of Android API Call Using Logging Mechanism within Android Framework.",
                    "Reversible Data Hiding Scheme Based on 3-Least Significant Bits and Mix Column Transform."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "8th SecureComm 2012",
        "info": "Padua, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2012",
                "sub_name": "Security and Privacy in Communication Networks - 8th International ICST Conference, SecureComm 2012, Padua, Italy, September 3-5, 2012. Revised Selected Papers.",
                "count": 21,
                "papers": [
                    "DAFA - A Lightweight DES Augmented Finite Automaton Cryptosystem.",
                    "Improvement on Ahn et al.'s RSA P-Homomorphic Signature Scheme.",
                    "Building General-Purpose Security Services on EMV Payment Cards.",
                    "Anonymous Transferable Conditional E-cash.",
                    "Two Improvements of Random Key Predistribution for Wireless Sensor Networks.",
                    "A Detection Mechanism for SMS Flooding Attacks in Cellular Networks.",
                    "Set Difference Attacks in Wireless Sensor Networks.",
                    "JSGuard: Shellcode Detection in JavaScript.",
                    "Detection of Configuration Vulnerabilities in Distributed (Web) Environments.",
                    "BINSPECT: Holistic Analysis and Detection of Malicious Web Pages.",
                    "Improving the Resilience of an IDS against Performance Throttling Attacks.",
                    "The Unbearable Lightness of Monitoring: Direct Monitoring in BitTorrent.",
                    "Towards Designing Packet Filter with a Trust-Based Approach Using Bayesian Inference in Network Intrusion Detection.",
                    "Data Leak Detection as a Service.",
                    "Revealing Cooperating Hosts by Connection Graph Analysis.",
                    "New Multi-dimensional Sorting Based K-Anonymity Microaggregation for Statistical Disclosure Control.",
                    "More Anonymity through Trust Degree in Trust-Based Onion Routing.",
                    "Privacy Preserving Back-Propagation Learning Made Practical with Cloud Computing.",
                    "Random Host Mutation for Moving Target Defense.",
                    "Towards a Framework for Evaluating the Security of Physical-Layer Identification Systems.",
                    "A Voice Spam Filter to Clean Subscribers' Mailbox."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "7th SecureComm 2011",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2011",
                "sub_name": "Security and Privacy in Communication Networks - 7th International ICST Conference, SecureComm 2011, London, UK, September 7-9, 2011, Revised Selected Papers.",
                "count": 35,
                "papers": [
                    "Designing Scalable and Effective Decision Support for Mitigating Attacks in Large Enterprise Networks.",
                    "An On-Line Learning Statistical Model to Detect Malicious Web Requests.",
                    "Secure Configuration of Intrusion Detection Sensors for Changing Enterprise Systems.",
                    "K2C: Cryptographic Cloud Storage with Lazy Revocation and Anonymous Access.",
                    "Analyzing the Gold Star Scheme in a Split Tor Network.",
                    "Location Privacy and Attacker Knowledge: Who Are We Fighting against?",
                    "Insecurity in Public-Safety Communications: APCO Project 25.",
                    "Behavioral Mimicry Covert Communication.",
                    "Defense against Spectrum Sensing Data Falsification Attacks in Cognitive Radio Networks.",
                    "On Detection of Erratic Arguments.",
                    "SA3: Automatic Semantic Aware Attribution Analysis of Remote Exploits.",
                    "Time-Traveling Forensic Analysis of VM-Based High-Interaction Honeypots.",
                    "Optimistic Fair Exchange of Ring Signatures.",
                    "Efficient U-Prove Implementation for Anonymous Credentials on Smart Cards.",
                    "Multi-party Private Web Search with Untrusted Partners.",
                    "v-CAPS: A Confidentiality and Anonymity Preserving Routing Protocol for Content-Based Publish-Subscribe Networks.",
                    "Delay Fast Packets (DFP): Prevention of DNS Cache Poisoning.",
                    "Unilateral Antidotes to DNS Poisoning.",
                    "Security Analysis of Leap-of-Faith Protocols.",
                    "Secure and Practical Key Distribution for RFID-Enabled Supply Chains.",
                    "Towards a Deterministic Hierarchical Key Predistribution for WSN Using Complementary Fano Plane.",
                    "Context-Related Access Control for Mobile Caching.",
                    "Anonymity for Key-Trees with Adaptive Adversaries.",
                    "Analyzing the Hardware Costs of Different Security-Layer Variants for a Low-Cost RFID Tag.",
                    "Preventing Secret Data Leakage from Foreign Mappings in Virtual Machines.",
                    "Winning with DNS Failures: Strategies for Faster Botnet Detection.",
                    "Trading Elephants for Ants: Efficient Post-attack Reconstitution.",
                    "Privacy-Preserving Online Mixing of High Integrity Mobile Multi-user Data.",
                    "Symbolic Analysis for Security of Roaming Protocols in Mobile Networks - [Extended Abstract].",
                    "CloudSeal: End-to-End Content Protection in Cloud-Based Storage and Delivery Services.",
                    "Call Behavioral Analysis to Thwart SPIT Attacks on VoIP Networks.",
                    "T-CUP: A TPM-Based Code Update Protocol Enabling Attestations for Sensor Networks.",
                    "Build and Test Your Own Network Configuration.",
                    "PP2db: A Privacy-Preserving, P2P-Based Scalable Storage System for Mobile Networks.",
                    "NetFlow Based Network Protection."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "6th SecureComm 2010",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2010",
                "sub_name": "Security and Privacy in Communication Networks - 6th Iternational ICST Conference, SecureComm 2010, Singapore, September 7-9, 2010. Proceedings.",
                "count": 28,
                "papers": [
                    "SAS: Semantics Aware Signature Generation for Polymorphic Worm Detection.",
                    "Analyzing and Exploiting Network Behaviors of Malware.",
                    "Inexpensive Email Addresses An Email Spam-Combating System.",
                    "Privacy Administration in Distributed Service Infrastructure.",
                    "On the Formation of Historically k-Anonymous Anonymity Sets in a Continuous LBS.",
                    "Securing Personal Health Records in Cloud Computing: Patient-Centric and Fine-Grained Data Access Control in Multi-owner Settings.",
                    "A Study on False Channel Condition Reporting Attacks in Wireless Networks.",
                    "Characterizing the Security Implications of Third-Party Emergency Alert Systems over Cellular Text Messaging Services.",
                    "Saving Energy on WiFi with Required IPsec.",
                    "Transparent Protection of Commodity OS Kernels Using Hardware Virtualization.",
                    "A Generic Construction of Dynamic Single Sign-on with Strong Security.",
                    "DeCore: Detecting Content Repurposing Attacks on Clients' Systems.",
                    "Realizing a Source Authentic Internet.",
                    "Partial Deafness: A Novel Denial-of-Service Attack in 802.11 Networks.",
                    "Attacking Beacon-Enabled 802.15.4 Networks.",
                    "Supporting Publication and Subscription Confidentiality in Pub/Sub Networks.",
                    "CED2: Communication Efficient Disjointness Decision.",
                    "Impossibility of Finding Any Third Family of Server Protocols Integrating Byzantine Quorum Systems with Threshold Signature Schemes.",
                    "Context-Aware Usage Control for Android.",
                    "Efficient Isolation of Trusted Subsystems in Embedded Systems.",
                    "Enhancing Host Security Using External Environment Sensors.",
                    "FADE: Secure Overlay Cloud Storage with File Assured Deletion.",
                    "A New Information Leakage Measure for Anonymity Protocols.",
                    "Hidden Markov Models for Automated Protocol Learning.",
                    "Epistemic Model Checking for Knowledge-Based Program Implementation: An Application to Anonymous Broadcast.",
                    "Surveying DNS Wildcard Usage among the Good, the Bad, and the Ugly.",
                    "The Hitchhiker's Guide to DNS Cache Poisoning.",
                    "A Formal Definition of Online Abuse-Freeness."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "5th SecureComm 2009",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2009",
                "sub_name": "Security and Privacy in Communication Networks - 5th International ICST Conference, SecureComm 2009, Athens, Greece, September 14-18, 2009, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "Mitigating DoS Attacks on the Paging Channel by Efficient Encoding in Page Messages.",
                    "FIJI: Fighting Implicit Jamming in 802.11 WLANs.",
                    "Deny-by-Default Distributed Security Policy Enforcement in Mobile Ad Hoc Networks.",
                    "Baiting Inside Attackers Using Decoy Documents.",
                    "MULAN: Multi-Level Adaptive Network Filter.",
                    "Automated Classification of Network Traffic Anomalies.",
                    "Formal Analysis of FPH Contract Signing Protocol Using Colored Petri Nets.",
                    "On the Security of Bottleneck Bandwidth Estimation Techniques.",
                    "An Eavesdropping Game with SINR as an Objective Function.",
                    "Ensemble: Community-Based Anomaly Detection for Popular Applications.",
                    "Using Failure Information Analysis to Detect Enterprise Zombies.",
                    "Dealing with Liars: Misbehavior Identification via Rényi-Ulam Games.",
                    "Multichannel Protocols for User-Friendly and Scalable Initialization of Sensor Networks.",
                    "Aggregated Authentication (AMAC) Using Universal Hash Functions.",
                    "Sec-TMP: A Secure Topology Maintenance Protocol for Event Delivery Enforcement in WSN.",
                    "Hierarchical Self-healing Key Distribution for Heterogeneous Wireless Sensor Networks.",
                    "User-Centric Identity Using ePassports.",
                    "Defending against Key Abuse Attacks in KP-ABE Enabled Broadcast Systems.",
                    "Breaking and Building of Group Inside Signature.",
                    "Use of ID-Based Cryptography for the Efficient Verification of the Integrity and Authenticity of Web Resources.",
                    "Self-organized Anonymous Authentication in Mobile Ad Hoc Networks.",
                    "An Active Global Attack Model for Sensor Source Location Privacy: Analysis and Countermeasures.",
                    "Rogue Access Point Detection Using Innate Characteristics of the 802.11 MAC.",
                    "A Novel Architecture for Secure and Scalable Multicast over IP Network.",
                    "Reliable Resource Searching in P2P Networks.",
                    "The Frog-Boiling Attack: Limitations of Anomaly Detection for Secure Network Coordinate Systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "4th SecureComm 2008",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2008",
                "sub_name": "4th International ICST Conference on Security and Privacy in Communication Networks, SECURECOMM 2008, Istanbul, Turkey, September 22-25, 2008.",
                "count": 43,
                "papers": [
                    "Efficient signature matching with multiple alphabet compression tables.",
                    "Correlation-based load balancing for network intrusion detection and prevention systems.",
                    "Distributed flow detection over multi path sessions.",
                    "Relaxed authenticity for data aggregation in wireless sensor networks.",
                    "Source location privacy against laptop-class attacks in sensor networks.",
                    "Securely computing an approximate median in wireless sensor networks.",
                    "Sybil proof anonymous reputation management.",
                    "RepTrap: a novel attack on feedback-based reputation systems.",
                    "Scalable and efficient provable data possession.",
                    "An identity-based key infrastructure suitable for messaging and its application to e-mail.",
                    "SMM rootkits: a new breed of OS independent malware.",
                    "On capturing malware dynamics in mobile power-law networks.",
                    "Overbot: a botnet protocol based on Kademlia.",
                    "Containment of network worms via per-process rate-limiting.",
                    "Detection of word shift steganography in PDF document.",
                    "Location privacy based on trusted computing and secure logging.",
                    "Evaluating the utility of anonymized network traces for intrusion detection.",
                    "Attribute-based on-demand multicast group setup with membership anonymity.",
                    "On the performance of a hybrid intrusion detection architecture for voice over IP systems.",
                    "LIDeA: a distributed lightweight intrusion detection architecture for sensor networks.",
                    "Hiding \"real\" machine from attackers and malware with a minimal virtual machine monitor.",
                    "Visual-similarity-based phishing detection.",
                    "Attacking the Kad network.",
                    "Voice pharming attack and the trust of VoIP.",
                    "A cross-layer dropping attack in video streaming over ad hoc networks.",
                    "Unassailable sensor networks.",
                    "Jamming Mitigation in Multi-Radio Wireless Networks: Reactive or Proactive?",
                    "MISPAR: mitigating stealthy packet dropping in locally-monitored multi-hop wireless ad hoc networks.",
                    "PEAC: a probabilistic, efficient, and resilient authentication protocol for broadcast communications.",
                    "Subjective logic based trust model for mobile ad hoc networks.",
                    "ARCMA: attack-resilient collaborative message authentication in wireless sensor networks.",
                    "A heterogeneity-aware framework for group key management in wireless mesh networks.",
                    "A lightweight biometric signature scheme for user authentication over networks.",
                    "rfidDOT: RFID delegation and ownership transfer made simple.",
                    "Parameterized access control: from design to prototype.",
                    "Towards more secure systems: how to combine expert evaluations.",
                    "Anonymous return route information for onion based mix-nets.",
                    "BitBlender: Light-Weight Anonymity for BitTorrent.",
                    "Scalable Privacy Protecting Scheme through Distributed RFID Tag Identification.",
                    "Enforcing Behaviour with Anonymity.",
                    "On the need for user-defined fine-grained access control policies for social networking applications.",
                    "A Key Management Solution for Overlay-Live-Streaming.",
                    "Reputation and Audits for Self-Organizing Storage."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "3rd SecureComm 2007",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2007",
                "sub_name": "Third International Conference on Security and Privacy in Communication Networks and the Workshops, SecureComm 2007, Nice, France, 17-21 September, 2007.",
                "count": 61,
                "papers": [
                    "NetTRUST: mixed NETworks Trust infrastRUcture baSed on Threshold cryptography.",
                    "Temporal factors to evaluate trustworthiness of virtual identities.",
                    "Trustworthiness of collaborative Open Source Software quality assessment.",
                    "An entropy based method for measuring anonymity.",
                    "Flexible and high-performance anonymization of NetFlow records using anontool.",
                    "Practical anonymous communication on the mobile internet using Tor.",
                    "SCRUB-tcpdump: A multi-level packet anonymizer demonstrating privacy/analysis tradeoffs.",
                    "Secure computation for data privacy.",
                    "An efficient and scalable Security ProtocoL for protecting fixed-Content Objects in ContEnt aDdressable StoraGe architEctures.",
                    "Scalable discovery of private resources.",
                    "A context service for multimodal pervasive environments.",
                    "Beyond web 2.0: enabling multimodal web interactions using VoIP and Ajax.",
                    "iToken: aWireless smart card reader which provides handhelds with desk top equivalent security.",
                    "Web Services workflow reliability estimation through reliability patterns.",
                    "The CONNECT platform: An architecture for Context-Aware Privacy in pervasive environments.",
                    "Privacy-preserving authentication with low computational overhead for RFID systems.",
                    "A study on secure RFID authentication protocol in insecure communication.",
                    "Optimizing secure Web Services with MAWeS: A case study.",
                    "Verification method of network simulation for pervasive environments.",
                    "A secure and efficient key management scheme for wireless sensor networks.",
                    "A model for usage control in GRID systems.",
                    "Intrusion Detection and tolerance in Grid-based applications.",
                    "Secure token passing at application level.",
                    "Gaining users' trust by publishing failure probabilities.",
                    "Platform to enforce multiple access control policy in grid hosting environment.",
                    "Design patterns for secure virtual organization management architecture.",
                    "An analysis of the chinese wall pattern for guaranteeing confidentiality in grid-based virtual organisations.",
                    "OpenFire: Using deception to reduce network attacks.",
                    "Modeling and detection of complex attacks.",
                    "Intrusion detection technology based on CEGA-SVM.",
                    "Misleading and defeating importance-scanning malware propagation.",
                    "Parameterizing access control for heterogeneous peer-to-peer applications.",
                    "Securing pseudo identities in an anonymous peer-to-peer file-sharing network.",
                    "Using recurring costs for reputation management in peer-to-peer streaming systems.",
                    "A feedback reputation mechanism to secure the optimized link state routing protocol.",
                    "Enhancing frequency-based wormhole attack detection with novel jitter waveforms.",
                    "Mitigating denial-of-service attacks in MANET by incentive-based packet filtering: A game-theoretic approach.",
                    "Securing Personal Network clusters.",
                    "Implications of radio fingerprinting on the security of sensor networks.",
                    "SET: Detecting node clones in sensor networks.",
                    "RoK: A robust key pre-distribution protocol for multi-phase wireless sensor networks.",
                    "Deception framework for sensor networks.",
                    "An assessment of VoIP covert channel threats.",
                    "Detecting bogus BGP route information: Going beyond prefix hijacking.",
                    "Securing network location awareness with authenticated DHCP.",
                    "Global interoperability of national security and emergency preparedness (NS/EP) telecommunications services.",
                    "Detecting worms via mining dynamic program execution.",
                    "Efficient mechanisms to provide convoy member and vehicle sequence authentication in VANETs.",
                    "PWC: A proactive worm containment solution for enterprise networks.",
                    "Secure crash reporting in vehicular Ad hoc networks.",
                    "A layout-similarity-based approach for detecting phishing pages.",
                    "Simple cross-site attack prevention.",
                    "Simple Authentication for the Web.",
                    "Secure lightweight tunnel for monitoring transport containers.",
                    "Sybil attack detection in a hierarchical sensor network.",
                    "Anonymity and security in delay tolerant networks.",
                    "Breaking EMAP.",
                    "Evolution of networking: Current problems and future directions.",
                    "The Host Identity Protocol (HIP): Bringing mobility, multi- homing, and baseline security together.",
                    "A model for usage control in GRID systems.",
                    "Aggregation of attributes from different authorities."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "2nd SecureComm 2006",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2006",
                "sub_name": "Second International Conference on Security and Privacy in Communication Networks and the Workshops, SecureComm 2006, Baltimore, MD, USA, August 2, 2006 - September 1, 2006.",
                "count": 55,
                "papers": [
                    "Leveraging IPsec for Mandatory Per-Packet Access Control.",
                    "Preventing Cross Site Request Forgery Attacks.",
                    "Towards More Efficient Distance Bounding Protocols for Use in Sensor Networks.",
                    "Discount Anonymous On Demand Routing for Mobile Ad hoc Networks.",
                    "Message Dropping Attacks in Overlay Networks: Attack Detection and Attacker Identification.",
                    "Implementation and Performance Evaluation of EAP-TLS-KS.",
                    "A Distributed Stealthy Coordination Mechanism for Worm Synchronization.",
                    "On Filtering of DDoS Attacks Based on Source Address Prefixes.",
                    "Reputation-Based Algorithm for Managing Trust in File Sharing Networks.",
                    "Non-Invasive Methods for Host Certification.",
                    "Secure Real-time User Preference Collection for Broadcast Scheduling.",
                    "Towards Communal Governed Transactions Among Decentralized Trading Agents.",
                    "Towards Cooperative Self-Protecting Mobile Devices using Trustful Relationships.",
                    "An Infrastructure for Gaining Trust in Context Information.",
                    "A Flexible Approach to Intrusion Alert Anonymization and Correlation.",
                    "Denial of Service Attacks and Defenses in Decentralized Trust Management.",
                    "A Framework for Identifying Compromised Nodes in Sensor Networks.",
                    "Protecting Against Distributed Denial of Service (DDoS) Attacks Using Distributed Filtering.",
                    "Effective Detection of Active Worms with Varying Scan Rate.",
                    "Exploiting MMS Vulnerabilities to Stealthily Exhaust Mobile Phone's Battery.",
                    "In-Band Wormholes and Countermeasures in OLSR Networks.",
                    "Enabling Confidentiality in Content-Based Publish/Subscribe Infrastructures.",
                    "Enhancing Privacy Preservation of Anonymous Location Sampling Techniques in Traffic Monitoring Systems.",
                    "An Identity-based Ring Signature Scheme with Enhanced Privacy.",
                    "Reputation-based Trust-Aware Recommender System.",
                    "TOPO: A Topology-aware Single Packet Attack Traceback Scheme.",
                    "Enhancing Benign User Cooperation in the Presence of Malicious Adversaries in Ad Hoc Networks.",
                    "Detecting the Sybil Attack in Mobile Ad hoc Networks.",
                    "An Architecture for an Email Worm Prevention System.",
                    "Mithril: Adaptable Security for Survivability in Collaborative Computing Sites.",
                    "Distributed Authentication of Program Integrity Verification in Wireless Sensor Networks.",
                    "On Mobile Viruses Exploiting Messaging and Bluetooth Services.",
                    "Provably Secure Ubiquitous Systems: Universally Composable RFID Authentication Protocols.",
                    "MOBIWORP: Mitigation of the Wormhole Attack in Mobile Multihop Wireless Networks.",
                    "Work in Progress: Streamlined IT Risk Management through a Micro Risk Management System (μRMS).",
                    "An Intelligent Infrastructure Strategy to Improving the Performance and Detection Capability of Intrusion Detection Systems.",
                    "DaTA - Data-Transparent Authentication Without Communication Overhead.",
                    "Work in Progress: Bro-LAN Pervasive Network Inspection and Control for LAN Traffic.",
                    "Sensor Networks that Are Provably Resilient.",
                    "Work in Progress - Tracking Correlated Attacks in Enterprise Intranets through Lattices.",
                    "Packet Coding for Strong Anonymity in Ad Hoc Networks.",
                    "System Anomaly Detection: Mining Firewall Logs.",
                    "Work in Progress: Who is Watching You? Video Conferencing Security.",
                    "A Unified Framework for Trust Management.",
                    "A Customizable Reputation-based Privacy Assurance System using Active Feedback.",
                    "Flow Anomaly Detection in Firewalled Networks.",
                    "Outsourcing Security Analysis with Anonymized Logs.",
                    "S-DV: A new approach to Secure Distance Vector routing protocols.",
                    "Computing with Trust: Definition, Properties, and Algorithms.",
                    "A History-Based Framework to Build Trust Management Systems.",
                    "Passive Wireless Host Detection Using Local RTT Timing Characteristics on an Enterprise Network.",
                    "Efficient visualization of change events in enterprise networks.",
                    "Providing Tunable Security Services: An IEEE 802.11i Example.",
                    "Wavelet-based Real Time Detection of Network Traffic Anomalies.",
                    "A Double Horizon Defense Design for Robust Regulation of Malicious Traffic."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "1st SecureComm 2005",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/securecomm/2005",
                "sub_name": "First International Conference on Security and Privacy for Emerging Areas in Communications Networks, SecureComm 2005, Athens, Greece, 5-9 September, 2005.",
                "count": 50,
                "papers": [
                    "Implications of Unlicensed Mobile Access (UMA) for GSM security.",
                    "Computation, Memory and Bandwidth Efficient Distillation Codes to Mitigate DoS in Multicast.",
                    "Spread-Identity mechanisms for DOS resilience and Security.",
                    "On the Security of Distributed Position Services.",
                    "Picking Virtual Pockets using Relay Attacks on Contactless Smartcard.",
                    "A Lightweight RFID Protocol to protect against Traceability and Cloning attacks.",
                    "An RFID Distance Bounding Protocol.",
                    "Security and Privacy Issues in E-passports.",
                    "DICAS: Detection, Diagnosis and Isolation of Control Attacks in Sensor Networks.",
                    "Securing Topology Maintenance Protocols for Sensor Networks.",
                    "Countermeasures Against Traffic Analysis Attacks in Wireless Sensor Networks.",
                    "Improving Cross-domain Authentication overWireless Local Area Networks.",
                    "Reducing Reauthentication Delay in Wireless Networks.",
                    "Providing Distributed Certificate Authority Service in Mobile Ad Hoc Networks.",
                    "On Improving the Performance of Role-Based Cascaded Delegation in Ubiquitous Computing.",
                    "A Privacy Preserving Reputation System for Mobile Information Dissemination Networks.",
                    "A Privacy Service for Context-aware Mobile Computing.",
                    "Protecting Location Privacy Through Path Confusion.",
                    "A Solution for Wireless Privacy and Payments based on E-cash.",
                    "Short Paper: A Signal Fingerprinting Paradigm for General Physical Layer and Sensor Network Security and Assurance.",
                    "Short Paper: Location Privacy with IP Mobility.",
                    "Short Paper: Fellowship in Mobile Ad hoc Networks.",
                    "Short Paper: A Secure Interworking Scheme for UMTS-WLAN.",
                    "Short Paper: bufSTAT - a tool for early detection and classification of buffer overflow attacks.",
                    "Short Paper: Towards a Location-Aware Role-Based Access Control Model.",
                    "Short paper: Tri-party TLS Adaptation for Trust Delegation in Home Networks.",
                    "Short Paper: PATRIOT- a Policy-Based, Multi-level Security Protocol for Safekeeping Audit Logs on Wireless Devices.",
                    "Short Paper: Harnessing Emergent Ubiquitous Computing Properties to Prevent Malicious Code Propagation.",
                    "A Level Key Infrastructure for Secure and Efficient Group Communication in Wireless Sensor Network.",
                    "A Modified Secure Remote Password (SRP) Protocol for Key Initialization and Exchange in Bluetooth Systems.",
                    "An Efficient Key Management Algorithm for Hierarchical Group Communication.",
                    "A Deterministic Pairwise Key Pre-distribution Scheme for Mobile Sensor Networks.",
                    "A Practical Study of Transitory Master Key Establishment ForWireless Sensor Networks.",
                    "Applying Emergence to the Design of Routing Protocols for the Security of Wireless Ad Hoc Networks.",
                    "SPINAT: Integrating IPsec into Overlay Routing.",
                    "On the Survivability of Routing Protocols in Ad Hoc Wireless Networks.",
                    "An Extensible Environment for Evaluating Secure MANET.",
                    "Soft-Timeout Distributed Key Generation for Digital Signature based on Elliptic Curve D-log for Low-Power Devices.",
                    "Uniform Framework for Cryptanalysis of the Bluetooth E₀ Cipher.",
                    "MOTET: Mobile Transactions using Electronic Tickets.",
                    "Exploiting Hierarchical Identity-Based Encryption for Access Control to Pervasive Computing Information.",
                    "Short Paper: GKE: Efficient Group-based Key Establishment for Large Sensor Networks.",
                    "Short Paper: Practically Unbounded One-Way Chains for Authentication with Backward Secrecy.",
                    "Short Paper: Limitations of Key Escrow in Identity-Based Schemes in Ad Hoc Networks.",
                    "Short Paper: Enhanced 1-D Chaotic Key-Based Algorithm for Image Encryption.",
                    "Short Paper: Schemes for Enhancing the Denial-of-Service Tolerance of SRTP.",
                    "Short Paper: Thor - The Hybrid Online Repository.",
                    "Short paper: Random IDs for preserving location privacy.",
                    "Short Paper: A Distributed Cross-Layer Intrusion Detection System for Ad Hoc Networks.",
                    "Short Paper: Dynamic Risk Mitigation for 'Self-defending' Network Security."
                ]
            }
        ]
    }
]