[
    {
        "year": "2021",
        "name": "40th SRDS 2021",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2021",
                "sub_name": "40th International Symposium on Reliable Distributed Systems, SRDS 2021, Chicago, IL, USA, September 20-23, 2021.",
                "count": 35,
                "papers": [
                    "Making Reads in BFT State Machine Replication Fast, Linearizable, and Live.",
                    "Node-level indicators of soft faults in wireless sensor networks.",
                    "The design, architecture and performance of the Tendermint Blockchain Network.",
                    "Adding Fairness to Order: Preventing Front-Running Attacks in BFT Protocols using TEEs.",
                    "Chaos Duck: A Tool for Automatic IoT Software Fault-Tolerance Analysis.",
                    "Active replication for latency-sensitive stream processing in Apache Flink.",
                    "Parameterized Distributed Synthesis of Fault-Tolerance Using Counter Abstraction.",
                    "Threat Adaptive Byzantine Fault Tolerant State-Machine Replication.",
                    "Failure Recovery from Persistent Memory in Paxos-Based State Machine Replication.",
                    "Enabling Low-Redundancy Proactive Fault Tolerance for Stream Machine Learning via Erasure Coding.",
                    "Characterizing the Impact of Network Delay on Bitcoin Mining.",
                    "How to Trust Strangers: Composition of Byzantine Quorum Systems.",
                    "Vassago: Efficient and Authenticated Provenance Query on Multiple Blockchains.",
                    "Argus: A Fully Transparent Incentive System for Anti-Piracy Campaigns.",
                    "BROFY: Towards Essential Integrity Protection for Microservices.",
                    "A Secure Access and Accountability Framework for Provisioning Services in Named Data Networks.",
                    "CODBS: A cascading oblivious search protocol optimized for real-world relational database indexes.",
                    "Scrooge Attack: Undervolting ARM Processors for Profit: Practical experience report.",
                    "2PPS - Publish/Subscribe with Provable Privacy.",
                    "A Comprehensive Measurement-based Investigation of DNS Hijacking.",
                    "What Distributed Systems Say: A Study of Seven Spark Application Logs.",
                    "GeoPaxos+: Practical Geographical State Machine Replication.",
                    "Automated Intelligent Healing in Cloud-Scale Data Centers.",
                    "MinervaFS: A User-Space File System for Generalised Deduplication: (Practical experience report).",
                    "Low-Rate Overuse Flow Tracer (LOFT): An Efficient and Scalable Algorithm for Detecting Overuse Flows.",
                    "FIFO and Atomic broadcast algorithms with bounded message size for dynamic systems.",
                    "Sliding Window CRDT Sketches.",
                    "Protecting Reward Function of Reinforcement Learning via Minimal and Non-catastrophic Adversarial Trajectory.",
                    "WAFFLE: Watermarking in Federated Learning.",
                    "Detecting Malicious Gradients from Asynchronous SGD on Variational Autoencoder.",
                    "DragonFly: Drone-Assisted High-Rise Monitoring for Fire Safety.",
                    "Sharding Techniques in the Era of Blockchain.",
                    "Adaptive Erasure Coded Data Maintenance for Consensus in Distributed Networks.",
                    "Runtime Verification for Blockchains.",
                    "Runtime Verification for Distributed Cyber-Physical Systems."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "39th SRDS 2020",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2020",
                "sub_name": "International Symposium on Reliable Distributed Systems, SRDS 2020, Shanghai, China, September 21-24, 2020.",
                "count": 35,
                "papers": [
                    "Self-Stabilizing Construction of a Minimal Weakly ST-Reachable Directed Acyclic Graph.",
                    "Benefits of Stabilization versus Rollback in Self-Stabilizing Graph-Based Applications on Eventually Consistent Key-Value Stores.",
                    "Consensus Beyond Thresholds: Generalized Byzantine Quorums Made Live.",
                    "TZ4Fabric: Executing Smart Contracts with ARM TrustZone : (Practical Experience Report).",
                    "NF-Crowd: Nearly-free Blockchain-based Crowdsourcing.",
                    "An Efficient Query Scheme for Hybrid Storage Blockchains Based on Merkle Semantic Trie.",
                    "Protect Your Smart Contract Against Unfair Payment.",
                    "Fast and Robust Distributed Learning in High Dimension.",
                    "Double Insurance: Incentivized Federated Learning with Differential Privacy in Mobile Crowdsensing.",
                    "End-to-End Evaluation of Federated Learning and Split Learning for Internet of Things.",
                    "A Formally Verified Protocol for Log Replication with Byzantine Fault Tolerance.",
                    "Using Model Checking to Formally Verify Rendezvous Algorithms for Robots with Lights in Euclidean Space.",
                    "Efficient Two-Layered Monitor for Partially Synchronous Distributed Systems.",
                    "Parallel State Machine Replication from Generalized Consensus.",
                    "A Generic Specification Framework for Weakly Consistent Replicated Data Types.",
                    "PnyxDB: a Lightweight Leaderless Democratic Byzantine Fault Tolerant Replicated Datastore.",
                    "Self-optimising Application-agnostic Multithreading for Replicated State Machines.",
                    "Secure Embedding of Rooted Spanning Trees for Scalable Routing in Topology-Restricted Networks.",
                    "On the Detection of Shilling Attacks in Federated Collaborative Filtering.",
                    "Anomaly Detection via Mining Numerical Workflow Relations from Logs.",
                    "TLP-IDS: A Two-layer Intrusion Detection System for Integrated Electronic Systems.",
                    "Audinet: A Decentralized Auditing System for Cloud Storage.",
                    "Device and Placement Aware Framework to optimize Single Failure Recoveries and Reads for Erasure Coded Storage System with Heterogeneous Storage Devices.",
                    "AZ-Recovery: An Efficient Crossing-AZ Recovery Scheme for Erasure Coded Cloud Storage Systems.",
                    "Enabling I/O-Efficient Redundancy Transitioning in Erasure-Coded KV Stores via Elastic Reed-Solomon Codes.",
                    "MQT-TZ: Hardening IoT Brokers Using ARM TrustZone : (Practical Experience Report).",
                    "Solving Linear Systems on High Performance Hardware with Resilience to Multiple Hard Faults.",
                    "Robust Cache-Aware Quantum Processor Layout.",
                    "Performance Evaluation of the Impact of NUMA on One-sided RDMA Interactions.",
                    "Robust P2P Personalized Learning.",
                    "Towards Efficient, Credible and Privacy-Preserving Service QoS Prediction in Unreliable Mobile Edge Environments.",
                    "Intrusion-Tolerant and Confidentiality-Preserving Publish/Subscribe Messaging.",
                    "Poster: No More Slow Messages: Programmable Packet Handling in Hard IRQ.",
                    "Demo: A Proof-of-Concept Implementation of Guard Secure Routing Protocol.",
                    "Demo: Skip Graph Middleware Implementation."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "38th SRDS 2019",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2019",
                "sub_name": "38th Symposium on Reliable Distributed Systems, SRDS 2019, Lyon, France, October 1-4, 2019.",
                "count": 48,
                "papers": [
                    "P3LS: Plausible Deniability for Practical Privacy-Preserving Live Streaming.",
                    "Fuzzing IPC with Knowledge Inference.",
                    "Anonymous and Confidential File Sharing over Untrusted Clouds.",
                    "Preacher: Network Policy Checker for Adversarial Environments.",
                    "Architecture and Prototype Implementation for Process-Aware Intrusion Detection in Electrical Grids.",
                    "Supply Chain Malware Targets SGX: Take Care of what you Sign.",
                    "d'Artagnan: A Trusted NoSQL Database on Untrusted Clouds.",
                    "Gyro: A Modular Scale-Out Layer for Single-Server DBMSs.",
                    "Fulva: Efficient Live Migration for In-Memory Key-Value Stores with Zero Downtime.",
                    "ESCAPe: Elastic Caching For Big Data Systems.",
                    "BISEN: Efficient Boolean Searchable Symmetric Encryption with Verifiability and Minimal Leakage.",
                    "Fault Tolerant High Performance Solver for Linear Equation Systems.",
                    "DBFT: A Byzantine Fault Tolerant Protocol with Graceful Performance Degradation.",
                    "Making Speculative BFT Resilient with Trusted Monotonic Counters.",
                    "Multilevel Checkpoint/Restart for Large Computational Jobs on Distributed Computing Resources.",
                    "Deterministic Fuzzy Checkpoints.",
                    "A More Consistent Understanding of Consistency.",
                    "Improved Fast Rerouting Using Postprocessing.",
                    "Resilient Wide-Area Byzantine Consensus Using Adaptive Weighted Replication.",
                    "Emergent Overlays for Adaptive MANET Broadcast.",
                    "A Dual Digraph Approach for Leaderless Atomic Broadcast.",
                    "Merkle Search Trees: Efficient State-Based CRDTs in Open Networks.",
                    "Revisiting Broadcast Algorithms for Wireless Edge Networks.",
                    "THUNDERSTORM: A Tool to Evaluate Dynamic Network Topologies on Distributed Systems.",
                    "Attack-Resistant Spanning Tree Construction in Route-Restricted Overlay Networks.",
                    "Challenges and Opportunities for Efficient Serverless Computing at the Edge.",
                    "Scalability and Resilience in Practice: Current Trends and Opportunities.",
                    "Toward an in-Kernel High Performance Key-Value Store Implementation.",
                    "Combining Learning and Model-Based Reasoning to Reduce Uncertainties in Cloud Security and Compliance Auditing.",
                    "A Generic Construction for All Parameters in Minimum Storage Regenerating Codes.",
                    "Exploring Declustered Software RAID for Enhanced Reliability and Recovery Performance in HPC Storage Systems.",
                    "Lightweight Dynamic Redundancy Control for Server-Based Storage.",
                    "Bloxy: Providing Transparent and Generic BFT-Based Ordering Services for Blockchains.",
                    "Blockchain-Based Metadata Protection for Archival Systems.",
                    "Trusted Computing Meets Blockchain: Rollback Attacks and a Solution for Hyperledger Fabric.",
                    "The Notion of Universality in Crash-Prone Asynchronous Message-Passing Systems: A Tutorial.",
                    "Edge Applications: Just Right Consistency.",
                    "Self-Stabilizing Manoeuvre Negotiation: The Case of Virtual Traffic Lights.",
                    "SmartMonit: Real-Time Big Data Monitoring System.",
                    "Building Ad-Hoc Clouds with CloudAgora.",
                    "A Framework for Managing an Elastic Redis Cache.",
                    "HyperPubSub: Blockchain Based Publish/Subscribe.",
                    "ARTEMIS: An Intrusion Detection System for MQTT Attacks in Internet of Things.",
                    "Atomic Swapping Bitcoins and Ethers.",
                    "A Testbed for Data Routing in Low-Power WSNs using DV-Hop Based Trajectory Encoding Algorithm.",
                    "ABEONA: An Architecture for Energy-Aware Task Migrations from the Edge to the Cloud.",
                    "Low-Cost Serverless SIEM in the Cloud.",
                    "Making Federated Networks More Distributed."
                ]
            },
            {
                "sub_name_abbr": "conf/srds/2019w",
                "sub_name": "38th International Symposium on Reliable Distributed Systems Workshops, SRDS Workshops 2019, Lyon, France, October 1-4, 2019.",
                "count": 10,
                "papers": [
                    "On the Impact of log Compaction on Incrementally Checkpointing Stateful Stream-Processing Operators.",
                    "A Case for Dynamically Programmable Storage Background Tasks.",
                    "A Comprehensive Rearranging Priority Based Method To Accelerate the Reconstruction of RAID Arrays.",
                    "Enabling the Efficient, Dependable Cloud-Based Storage of Human Genomes.",
                    "TrustFS: An SGX-Enabled Stackable File System Framework.",
                    "A Cost-Effective Cloud Event Archival for SIEMs.",
                    "Evaluation and Ranking of Replica Deployments in Geographic State Machine Replication.",
                    "Pooled Mining is Driving Blockchains Toward Centralized Systems.",
                    "Forkmon: Monitoring the Networks Supporting Bitcoin Hard Forks.",
                    "Towards A Unified Programming Model for Blockchain Smart Contract dApp Systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "37th SRDS 2018",
        "info": "Salvador, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2018",
                "sub_name": "37th IEEE Symposium on Reliable Distributed Systems, SRDS 2018, Salvador, Brazil, October 2-5, 2018.",
                "count": 32,
                "papers": [
                    "Abusing CDNs for Fun and Profit: Security Issues in CDNs' Origin Validation.",
                    "Impact of Man-In-The-Middle Attacks on Ethereum.",
                    "US-AID: Unattended Scalable Attestation of IoT Devices.",
                    "A Scalable and Efficient Correlation Engine to Detect Multi-Step Attacks in Distributed Systems.",
                    "Practical Continuous Aggregation in Wireless Edge Environments.",
                    "Breaking the Scalability Barrier of Causal Broadcast for Large and Dynamic Systems.",
                    "Policy-Based Adaptation of a Byzantine Fault Tolerant Distributed Graph Database.",
                    "Mobile Cloud-of-Clouds Storage Made Efficient: A Network Coding Based Approach.",
                    "Adversarially-Resistant On-Demand Topic Channels for Wireless Sensor Networks.",
                    "Secure Information Forwarding through Fragmentation in Delay-Tolerant Networks.",
                    "RATCHETA: Memory-Bounded Hybrid Byzantine Consensus for Cooperative Embedded Systems.",
                    "MaskAl: Privacy Preserving Masked Reads Alignment using Intel SGX.",
                    "PubSub-SGX: Exploiting Trusted Execution Environments for Privacy-Preserving Publish/Subscribe Systems.",
                    "Security, Performance and Energy Trade-Offs of Hardware-Assisted Memory Protection Mechanisms.",
                    "Mind the Gap: Autonomous Detection of Partitioned MANET Systems using Opportunistic Aggregation.",
                    "DMap: A Fault-Tolerant and Scalable Distributed Data Structure.",
                    "Enabling State Estimation for Fault Identification in Water Distribution Systems Under Large Disasters.",
                    "Improving Reliability of Deduplication-Based Storage Systems with Per-File Parity.",
                    "MuSE: Multimodal Searchable Encryption for Cloud Applications.",
                    "Héron: Taming Tail Latencies in Key-Value Stores Under Heterogeneous Workloads.",
                    "A Requirements-Driven Methodology for the Proper Selection and Configuration of Blockchains.",
                    "Crash-Resilient Decentralized Synchronous Runtime Verification.",
                    "Decentralized Release of Self-Emerging Data using Smart Contracts.",
                    "Geographic State Machine Replication.",
                    "Kernel Paxos.",
                    "MDC-Cast: A Total-Order Broadcast Protocol for Multi-Datacenter Environments.",
                    "Byzantine Agreement with Interval Validity.",
                    "Dynamic Checkpoint Architecture for Reliability Improvement on Distributed Frameworks.",
                    "Security, Performance and Energy Implications of Hardware-Assisted Memory Protection Mechanisms on Event-Based Streaming Systems.",
                    "Collective Attestation: for a Stronger Security in Embedded Networks.",
                    "Towards Real-Time-Aware Intrusion Tolerance.",
                    "Definition of an Architecture for Dynamic and Automatic Checkpoints on Apache Spark."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "36th SRDS 2017",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2017",
                "sub_name": "36th IEEE Symposium on Reliable Distributed Systems, SRDS 2017, Hong Kong, Hong Kong, September 26-29, 2017.",
                "count": 33,
                "papers": [
                    "Fine-Grained Consistency Upgrades for Online Services.",
                    "A Practical Framework for Privacy-Preserving NoSQL Databases.",
                    "Parameterized and Runtime-Tunable Snapshot Isolation in Distributed Transactional Key-Value Stores.",
                    "Robust Multi-Resource Allocation with Demand Uncertainties in Cloud Scheduler.",
                    "Stateless Reliable Geocasting.",
                    "Controlling Cascading Failures in Interdependent Networks under Incomplete Knowledge.",
                    "On Availability for Blockchain-Based Systems.",
                    "A Horizontally Scalable and Reliable Architecture for Location-Based Publish-Subscribe.",
                    "On the Robustness of a Neural Network.",
                    "Automated Fine Tuning of Probabilistic Self-Stabilizing Algorithms.",
                    "Reconfiguring Parallel State Machine Replication.",
                    "A Statistical Framework on Software Aging Modeling with Continuous-Time Hidden Markov Model.",
                    "Hybrid-RC: Flexible Erasure Codes with Optimized Recovery Performance and Low Storage Overhead.",
                    "Correlation-Aware Stripe Organization for Efficient Writes in Erasure-Coded Storage Systems.",
                    "A Simulation Analysis of Reliability in Erasure-Coded Data Centers.",
                    "Optimal Storage under Unsynchronized Mobile Byzantine Faults.",
                    "PULP: Achieving Privacy and Utility Trade-Off in User Mobility Data.",
                    "Incremental Elasticity for NoSQL Data Stores.",
                    "CausalSpartan: Causal Consistency for Distributed Data Stores Using Hybrid Logical Clocks.",
                    "DottedDB: Anti-Entropy without Merkle Trees, Deletes without Tombstones.",
                    "Optimal Cyber-Defense Strategies for Advanced Persistent Threats: A Game Theoretical Analysis.",
                    "AutoFlowLeaker: Circumventing Web Censorship through Automation Services.",
                    "An Unsupervised Multi-Detector Approach for Identifying Malicious Lateral Movement.",
                    "Optimal Network Reconfiguration for Software Defined Networks Using Shuffle-Based Online MTD.",
                    "A Greedy-Based Method for Modified Condition/Decision Coverage Testing Criterion.",
                    "A Resilient Auction Framework for Deadline-Aware Jobs in Cloud Spot Market.",
                    "Automated Resource Sharing for Virtualized GPU with Self-Configuration.",
                    "Performance Modeling of PBFT Consensus Process for Permissioned Blockchain Network (Hyperledger Fabric).",
                    "Detecting TCP-Based DDoS Attacks in Baidu Cloud Computing Data Centers.",
                    "PITR: An Efficient Single-Failure Recovery Scheme for PIT-Coded Cloud Storage Systems.",
                    "Runtime Measurement Architecture for Bytecode Integrity in JVM-Based Cloud.",
                    "An End-To-End Log Management Framework for Distributed Systems.",
                    "Fault-Tolerant Pattern Formation by Multiple Robots: A Learning Approach."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "35th SRDS 2016",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2016",
                "sub_name": "35th IEEE Symposium on Reliable Distributed Systems, SRDS 2016, Budapest, Hungary, September 26-29, 2016.",
                "count": 40,
                "papers": [
                    "The Rowhammer Attack Injection Methodology.",
                    "ShareIff: A Sticky Policy Middleware for Self-Destructing Messages in Android Applications.",
                    "Lateral Movement Detection Using Distributed Data Fusion.",
                    "Multi-round Master-Worker Computing: A Repeated Game Approach.",
                    "Sirius: Neural Network Based Probabilistic Assertions for Detecting Silent Data Corruption in Parallel Programs.",
                    "CRUDE: Combining Resource Usage Data and Error Logs for Accurate Error Detection in Large-Scale Distributed Systems.",
                    "Achieving High Reliability via Expediting the Repair of Critical Blocks in Replicated Storage Systems.",
                    "Being Accurate Is Not Enough: New Metrics for Disk Failure Prediction.",
                    "Norton Zone: Symantec's Secure Cloud Storage System.",
                    "Tale of Tails: Anomaly Avoidance in Data Centers.",
                    "vMocity: Traveling VMs Across Heterogeneous Clouds.",
                    "Storekeeper: A Security-Enhanced Cloud Storage Aggregation Service.",
                    "VMBeam: Zero-Copy Migration of Virtual Machines for Virtual IaaS Clouds.",
                    "Inside-Out: Reliable Performance Prediction for Distributed Storage Systems in the Cloud.",
                    "DTC: A Dynamic Transaction Chopping Technique for Geo-replicated Storage Systems.",
                    "GlobalFS: A Strongly Consistent Multi-site File System.",
                    "On the Cost of Safe Storage for Public Clouds: An Experimental Evaluation.",
                    "Who's On Board?: Probabilistic Membership for Real-Time Distributed Control Systems.",
                    "UDS: A Novel and Flexible Scheduling Algorithm for Deterministic Multithreading.",
                    "Practical State Machine Replication with Confidentiality.",
                    "Speed for the Elite, Consistency for the Masses: Differentiating Eventual Consistency in Large-Scale Distributed Systems.",
                    "Continuous Authentication and Non-repudiation for the Security of Critical Systems.",
                    "Including Security Monitoring in Cloud Service Level Agreements.",
                    "Visualizing and Controlling VMI-Based Malware Analysis in IaaS Cloud.",
                    "Challenging Anomaly Detection in Complex Dynamic Systems.",
                    "PlayCloud: A Platform to Experiment with Coding Techniques for Storage in the Cloud.",
                    "Reliable Event Dissemination in Dynamic Distributed Systems.",
                    "ProCode: A Proactive Erasure Coding Scheme for Cloud Storage Systems.",
                    "SwiftER: Elastic Erasure Coded Storage System.",
                    "Encoding-Aware Data Placement for Efficient Degraded Reads in XOR-Coded Storage Systems.",
                    "Network Aware Reliability Analysis for Distributed Storage Systems.",
                    "Collaborative Stabilization.",
                    "Adaptive Location Privacy with ALP.",
                    "On Privacy-Preserving Cloud Auction.",
                    "Experiments with Self-Stabilizing Distributed Data Fusion.",
                    "TANGO: Toward a More Reliable Mobile Streaming through Cooperation between Cellular Network and Mobile Devices.",
                    "Model-Checking Assisted Protocol Design for Ultra-reliable Low-Latency Wireless Networks.",
                    "Self-Stabilization - A Mechanism to Make Networked Embedded Systems More Reliable?",
                    "RDE: Replay DEbugging for Diagnosing Production Site Failures.",
                    "A Component-Based Middleware for a Reliable Distributed and Reconfigurable Spacecraft Onboard Computer."
                ]
            },
            {
                "sub_name_abbr": "conf/srds/2016w",
                "sub_name": "35th IEEE Symposium on Reliable Distributed Systems Workshops, SRDS 2016 Workshop, Budapest, Hungary, September 26, 2016.",
                "count": 12,
                "papers": [
                    "sKnock: Port-Knocking for Masses.",
                    "Toward Access Control Model for Context-Aware Services Offloaded to Cloud Computing.",
                    "Comfort and Security Perception of Biometrics in Mobile Phones with Widespread Sensors.",
                    "A Configurable Multibiometric System for Authentication at Different Security Levels Using Mobile Devices.",
                    "BioALeg - Enabling Biometric Authentication in Legacy Web Sites.",
                    "SafeRegions: Performance Evaluation of Multi-party Protocols on HBase.",
                    "ARM TrustZone for Secure Image Processing on the Cloud.",
                    "Thwarting Data Exfiltration by Repackaged Applications.",
                    "Emusphere: Evaluating Planetary-Scale Distributed Systems in Automated Emulation Environments.",
                    "Have a Seat on the ErasureBench: Easy Evaluation of Erasure Coding Libraries for Distributed Storage Systems.",
                    "Adaptive IP Mutation: A Proactive Approach for Defending against Worm Propagation.",
                    "The Convoy Effect in Atomic Multicast."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "34th SRDS 2015",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2015",
                "sub_name": "34th IEEE Symposium on Reliable Distributed Systems, SRDS 2015, Montreal, QC, Canada, September 28 - October 1, 2015.",
                "count": 33,
                "papers": [
                    "Probabilistic Byzantine Tolerance for Cloud Computing.",
                    "Privacy-Preserving Content-Based Image Retrieval in the Cloud.",
                    "SafeSky: A Secure Cloud Storage Middleware for End-User Applications.",
                    "Extending Eventually Consistent Cloud Databases for Enforcing Numeric Invariants.",
                    "Auditable Restoration of Distributed Programs.",
                    "PSG-Codes: An Erasure Codes Family with High Fault Tolerance and Fast Recovery.",
                    "Recurrence in Self-Stabilization.",
                    "Multi-objective Optimisation of Rolling Upgrade Allowing for Failures in Clouds.",
                    "PASS: An Address Space Slicing Framework for P2P Eclipse Attack Mitigation.",
                    "ControlFreak: Signature Chaining to Counter Control Flow Attacks.",
                    "Denial of Service Elusion (DoSE): Keeping Clients Connected for Less.",
                    "Temporality a NVRAM-based Virtualization Platform.",
                    "A Secure Collusion-Aware and Probability-Aware Range Query Processing in Tiered Sensor Networks.",
                    "PmDroid: Permission Supervision for Android Advertising.",
                    "Signature-Based Top-k Query Processing against Data Replacement Attacks in MANETs.",
                    "FTDE: Distributed Fault Tolerance for WSN Data Collection and Compression Schemes.",
                    "Separating the WHEAT from the Chaff: An Empirical Design for Geo-Replicated State Machines.",
                    "Replacement: Decentralized Failure Handling for Replicated State Machines.",
                    "Approximate Hash-Based Set Reconciliation for Distributed Replica Repair.",
                    "Securing Passive Replication through Verification.",
                    "PCM: A Parity-Check Matrix Based Approach to Improve Decoding Performance of XOR-based Erasure Codes.",
                    "MICS: Mingling Chained Storage Combining Replication and Erasure Coding.",
                    "Online Behavior Identification in Distributed Systems.",
                    "Z Codes: General Systematic Erasure Codes with Optimal Repair Bandwidth and Storage for Distributed Storage Systems.",
                    "Distributed Attribute Based Access Control of Aggregated Data in Sensor Clouds.",
                    "Seek-Efficient I/O Optimization in Single Failure Recovery for XOR-coded Storage Systems.",
                    "Communicating Reliably in Multihop Dynamic Networks Despite Byzantine Failures.",
                    "To Transmit Now or Not to Transmit Now.",
                    "Ridge: High-Throughput, Low-Latency Atomic Multicast.",
                    "Identifying Global Icebergs in Distributed Streams.",
                    "A Framework for the Design Configuration of Accountable Selfish-Resilient Peer-to-Peer Systems.",
                    "Chasing the Tail of Atomic Broadcast Protocols.",
                    "A Practical Experience on Evaluating Intrusion Prevention System Event Data as Indicators of Security Issues."
                ]
            },
            {
                "sub_name_abbr": "conf/srds/2015w",
                "sub_name": "34th IEEE Symposium on Reliable Distributed Systems Workshop, SRDS 2015 Workshop, Montreal, QC, Canada, September 28 - October 1, 2015.",
                "count": 14,
                "papers": [
                    "A Client-Based Replication Protocol for Multiversion Cloud File Storage.",
                    "Modeling the Autoscaling Operations in Cloud with Time Series Data.",
                    "Hard Drive Failure Prediction Using Big Data.",
                    "Building Secure Applications Using Pattern-Based Design Fragments.",
                    "Architectural Support for DevOps in a Neo-Metropolis BDaaS Platform.",
                    "A Distributed Monitoring and Reconfiguration Approach for Adaptive Network Computing.",
                    "SMS Botnet Detection for Android Devices through Intent Capture and Modeling.",
                    "On the Use of Mobile GPU for Accelerating Malware Detection Using Trace Analysis.",
                    "Secure Dissemination of Video Data in Vehicle-to-Vehicle Systems.",
                    "Conflict Graph Based Channel Allocation in Cognitive Radio Networks.",
                    "Impact of Initial Target Position on Performance of UAV Surveillance Using Opportunistic Resource Utilization Networks.",
                    "Selective Hearing: An Approach to Distributed, Eventually Consistent Edge Computation.",
                    "Exactly-Once Quantity Transfer.",
                    "Scaling Geo-replicated Databases to the MEC Environment."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "33rd SRDS 2014",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2014",
                "sub_name": "33rd IEEE International Symposium on Reliable Distributed Systems, SRDS 2014, Nara, Japan, October 6-9, 2014.",
                "count": 45,
                "papers": [
                    "PROPS: A PRivacy-Preserving Location Proof System.",
                    "Gemini: An Emergency Line of Defense against Phishing Attacks.",
                    "A Practical Experience on the Impact of Plugins in Web Security.",
                    "Improving Cloud Service Resilience Using Brownout-Aware Load-Balancing.",
                    "The Performance of Paxos in the Cloud.",
                    "Transfer as a Service: Towards a Cost-Effective Model for Multi-site Cloud Data Management.",
                    "Optimistic Parallel State-Machine Replication.",
                    "ZooFence: Principled Service Partitioning and Application to the ZooKeeper Coordination Service.",
                    "DATAFLASKS: Epidemic Store for Massive Scale Systems.",
                    "Make the Leader Work: Executive Deferred Update Replication.",
                    "On the Support of Versioning in Distributed Key-Value Stores.",
                    "Transaction Management Using Causal Snapshot Isolation in Partially Replicated Databases.",
                    "pH1: A Transactional Middleware for NoSQL.",
                    "Exploiting Decoding Computational Locality to Improve the I/O Performance of an XOR-Coded Storage Cluster under Concurrent Failures.",
                    "A Stack-Based Single Disk Failure Recovery Scheme for Erasure Coded Storage Systems.",
                    "Fast Repair for Single Failure in Erasure Coding-Based Distributed Storage Systems.",
                    "Self-Stabilizing Byzantine Broadcast.",
                    "Fair Synchronization in the Presence of Process Crashes and its Weakest Failure Detector.",
                    "Convergence Verification of Asynchronous Iterations.",
                    "Dependable Admission Control for Mission-Critical Mobile Applications in Wireless Mesh Networks.",
                    "PCTopk: Privacy-and Correctness-Preserving Functional Top-k Query on Un-trusted Data Storage in Two-Tiered Sensor Networks.",
                    "Device Collaboration for Stability Assurance in Distributed Cyber-Physical Systems.",
                    "ACaZoo: A Distributed Key-Value Store Based on Replicated LSM-Trees.",
                    "End-to-End Congestion Control for Content-Based Networks.",
                    "HardPaxos: Replication Hardened against Hardware Errors.",
                    "Towards a Practical Survivable Intrusion Tolerant Replication System.",
                    "ByzID: Byzantine Fault Tolerance from Intrusion Detection.",
                    "LO-FA-MO: Fault Detection and Systemic Awareness for the QUonG Computing System.",
                    "FullReview: Practical Accountability in Presence of Selfish Nodes.",
                    "Overnesia: A Resilient Overlay Network for Virtual Super-Peers.",
                    "AcTinG: Accurate Freerider Tracking in Gossip.",
                    "Accurate and Efficient Counting in Dynamic Networks.",
                    "A Systematic Differential Analysis for Fast and Robust Detection of Software Aging.",
                    "Modeling Reliability Requirements in Coordinated Node and Link Mapping.",
                    "A Convex Hull Query Processing Method in MANETs.",
                    "A Distributed NameNode Cluster for a Highly-Available Hadoop Distributed File System.",
                    "Practical Encoded Processing.",
                    "Keyword Search with Path-Based Filtering over XML Streams.",
                    "A Prototype of Power Saving Storage Method RAPoSDA.",
                    "A Study on Efficient Event Monitoring in Dense Mobile Wireless Sensor Networks.",
                    "Chained Signatures for Secure Program Execution.",
                    "An Efficient Static Taint-Analysis Detecting Exploitable-Points on ARM Binaries.",
                    "Building a Strongly Consistent Multi-site File System.",
                    "Adaptive Redundant Data Allocation Using Unused Blocks for Improving Access Efficiency in Dependable Storage Systems.",
                    "Improving the Throughput of Wireless LAN by Tuning Carrier Sense Threshold of Access Points Based on Node Positions Detected by a Visible Light Tag System."
                ]
            },
            {
                "sub_name_abbr": "conf/srds/2014w",
                "sub_name": "33rd IEEE International Symposium on Reliable Distributed Systems Workshops, SRDS Workshops 2014, Nara, Japan, October 6-9, 2014.",
                "count": 25,
                "papers": [
                    "The 2nd Workshop on Planetary-Scale Distributed Systems (W-PSDS 2014).",
                    "Declared Causality in Wide-Area Replicated Storage.",
                    "The Case for Fast and Invariant-Preserving Geo-Replication.",
                    "Mitigating the Spread of a Virus in the Internet.",
                    "Latency Amplification: Characterizing the Impact of Web Page Content on Load Times.",
                    "Geo-Replicated Storage with Scalable Deferred Update Replication.",
                    "SwiftCloud: Fault-Tolerant Geo-Replication Integrated all the Way to the Client Machine.",
                    "Coverage Control Inspired by Bacterial Chemotaxis.",
                    "Locomotion of Metamorphic Robotic System Based on Local Information (Extended Abstract).",
                    "Asynchronous Ring Gathering by Oblivious Robots with Limited Vision.",
                    "Discovering and Assessing Fine-Grained Metrics in Robot Networks Protocols.",
                    "On the Worst-Case Initial Configuration for Conservative Connectivity Preservation.",
                    "A Preference Extraction Method Using Installed Applications and Their Descriptions.",
                    "Location-Based Microblog Viewing System Synchronized with Web Pages.",
                    "A k-Anonymization Algorithm on Social Network Data that Reduces Distances between Nodes.",
                    "Improvement of Pk-Anonymization.",
                    "SeRAVi: A Spatio-Temporal Data Distribution Visualization System for Mobile Sensor Data Retrieval.",
                    "Service-Controlled Networking: Dynamic In-Network Data Fusion for Heterogeneous Sensor Networks.",
                    "An Efficient Indexing Method for Mobile Sensor Data Collection on Integrated Sensor Networks.",
                    "Real-Time-Aware Embedded DSMS Applicable to Advanced Driver Assistance Systems.",
                    "Adaptive Erasure Correction Coding for Energy Efficient Dependable Storage Systems.",
                    "Energy Efficient Storage Management Cooperated with Data Intensive Applications in Virtual Machines.",
                    "Optimizing Concurrent Query Execution on Modern Multisocket Multicore Platform.",
                    "kNN Search Utilizing Index of the Minimum Road Travel Time in Time-Dependent Road Networks.",
                    "An Approach to Dynamically Adapting Distributed System Architecture."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "32nd SRDS 2013",
        "info": "Braga, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2013",
                "sub_name": "IEEE 32nd Symposium on Reliable Distributed Systems, SRDS 2013, Braga, Portugal, 1-3 October 2013.",
                "count": 21,
                "papers": [
                    "A Fault-Tolerant Routing Algorithm Design for On-Chip Optical Networks.",
                    "PIP: Privacy and Integrity Preserving Data Aggregation in Wireless Sensor Networks.",
                    "Virtual Synchrony Guarantees for Cyber-physical Systems.",
                    "Fighting Uncertainty in Highly Dynamic Wireless Sensor Networks with Probabilistic Models.",
                    "A Distributed Polling with Probabilistic Privacy.",
                    "Consensus with Unknown Participants in Shared Memory.",
                    "Bounded Delay in Byzantine-Tolerant State Machine Replication.",
                    "Stochastic Analysis on RAID Reliability for Solid-State Drives.",
                    "Automated Multi-graceful Degradation: A Case Study.",
                    "A Distributed Abstraction Algorithm for Online Predicate Detection.",
                    "Linking Resource Usage Anomalies with System Failures from Cluster Log Data.",
                    "Automatic Problem Localization via Multi-dimensional Metric Profiling.",
                    "Efficient Verification of Distributed Protocols Using Stateful Model Checking.",
                    "Validity-Based Failure Algebra for Distributed Sensor Systems.",
                    "Rigorous Performance Evaluation of Self-Stabilization Using Probabilistic Model Checking.",
                    "Non-monotonic Snapshot Isolation: Scalable and Strong Consistency for Geo-replicated Transactional Systems.",
                    "Clock-SI: Snapshot Isolation for Partitioned Data Stores Using Loosely Synchronized Clocks.",
                    "Bumper: Sheltering Transactions from Conflicts.",
                    "Analysis of Malware Propagation in Twitter.",
                    "Adaptive Anomaly Identification by Exploring Metric Subspace in Cloud Computing Infrastructures.",
                    "A Unified Framework for Measuring a Network's Mean Time-to-Compromise."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "31st SRDS 2012",
        "info": "Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2012",
                "sub_name": "IEEE 31st Symposium on Reliable Distributed Systems, SRDS 2012, Irvine, CA, USA, October 8-11, 2012.",
                "count": 71,
                "papers": [
                    "Detecting Anomalous User Behaviors in Workflow-Driven Web Applications.",
                    "Susceptibility Analysis of Structured P2P Systems to Localized Eclipse Attacks.",
                    "Benchmarking Dependability of MapReduce Systems.",
                    "Aggregating CVSS Base Scores for Semantics-Rich Network Security Metrics.",
                    "First Step toward Cloud-Based Firewalling.",
                    "Enabling Data Integrity Protection in Regenerating-Coding-Based Cloud Storage.",
                    "TailCon: Power-Minimizing Tail Percentile Control of Response Time in Server Clusters.",
                    "LogMaster: Mining Event Correlations in Logs of Large-Scale Cluster Systems.",
                    "RAM-DUR: In-Memory Deferred Update Replication.",
                    "SPECULA: Speculative Replication of Software Transactional Memory.",
                    "Model-Driven Comparison of State-Machine-Based and Deferred-Update Replication Schemes.",
                    "S-Paxos: Offloading the Leader for High Throughput State Machine Replication.",
                    "FORTRESS: Adding Intrusion-Resilience to Primary-Backup Server Systems.",
                    "From Backup to Hot Standby: High Availability for HDFS.",
                    "Availability Modeling and Analysis for Data Backup and Restore Operations.",
                    "Availability-Based Methods for Distributed Storage Systems.",
                    "Robust and Speculative Byzantine Randomized Consensus with Constant Time Complexity in Normal Conditions.",
                    "GRADE: Graceful Degradation in Byzantine Quorum Systems.",
                    "Scalable and Secure Polling in Dynamic Distributed Networks.",
                    "Distributed and Private Group Management.",
                    "Improving Security of Internet Services through Continuous and Transparent User Identity Verification.",
                    "Off the Wall: Lightweight Distributed Filtering to Mitigate Distributed Denial of Service Attacks.",
                    "Broadcast Authentication for Resource Constrained Devices: A Major Pitfall and Some Solutions.",
                    "Impact of Operational Reliability Re-assessment during Aircraft Missions.",
                    "Automatic Generation of Graceful Programs.",
                    "RD2: Resilient Dynamic Desynchronization for TDMA over Lossy Networks.",
                    "Providing Uniform Reliable Broadcast Delivery for Mobile Ad Hoc Networks with MANET Liveness Property.",
                    "Fault Localization in MANET-Hosted Service-Based Systems.",
                    "Fast Optimization Algorithms for Designing Cellular Networks with Guard Channel.",
                    "A Quick and Reliable Routing for Infrastructure Surveillance with Wireless Sensor Networks.",
                    "Causally Coordinated Snapshot Isolation for Geographically Replicated Data.",
                    "GSFord: Towards a Reliable Geo-social Notification System.",
                    "Performance Issue Diagnosis for Online Service Systems.",
                    "An End-to-End Security Auditing Approach for Service Oriented Architectures.",
                    "RADAR: Adaptive Rate Allocation in Distributed Stream Processing Systems under Bursty Workloads.",
                    "Efficient Asynchronous Low Power Listening for Wireless Sensor Networks.",
                    "Energy-Efficient and Fault-Tolerant Structural Health Monitoring in Wireless Sensor Networks.",
                    "Time-Sensitive Utility-Based Routing in Duty-Cycle Wireless Sensor Networks with Unreliable Links.",
                    "Efficient and Reliable Multicast in Multi-radio Networks.",
                    "Fair Comparison of Gossip Algorithms over Large-Scale Random Topologies.",
                    "A Theory of Packet Flows Based on Law-of-Mass-Action Scheduling.",
                    "HybCAST: Rich Content Dissemination in Hybrid Cellular and 802.11 Ad Hoc Networks.",
                    "Reliable Distributed Real-Time and Embedded Systems through Safe Middleware Adaptation.",
                    "Approximation Techniques for Maintaining Real-Time Deployments Informed by User-Provided Dataflows within a Cloud.",
                    "Response Time Reliability in Cloud Environments: An Empirical Study of n-Tier Applications at High Resource Utilization.",
                    "A Quantitative Comparison of Reactive and Proactive Replicated Storage Systems.",
                    "PGV: A Storage Enforcing Remote Verification Scheme.",
                    "AAD: Adaptive Anomaly Detection System for Cloud Computing Infrastructures.",
                    "Distributed Monitoring of Temporal System Properties Using Petri Nets.",
                    "Improving the Reliability and Availability of Vehicular Communications Using Voronoi Diagram-Based Placement of Road Side Units.",
                    "Secure Cloud Browser: Model and Architecture to Support Secure WEB Navigation.",
                    "Towards Identifying Root Causes of Faults in Service-Based Applications.",
                    "Anonymous On-Demand Routing and Secure Checking of Traffic Forwarding for Mobile Ad Hoc Networks.",
                    "Pairwise Key Generation Scheme for Cellular Mobile Communication.",
                    "Data De-duplication and Event Processing for Security Applications on an Embedded Processor.",
                    "Query Plan Execution in a Heterogeneous Stream Management System for Situational Awareness.",
                    "Private Anonymous Messaging.",
                    "Regenerating Codes: A System Perspective.",
                    "Banking on Decoupling: Budget-Driven Sustainability for HPC Applications on EC2 Spot Instances.",
                    "On the Feasibility of Byzantine Fault-Tolerant MapReduce in Clouds-of-Clouds.",
                    "Byzantine Fault-Tolerant Publish/Subscribe: A Cloud Computing Infrastructure.",
                    "Energy Efficient Hadoop Using Mirrored Data Block Replication Policy.",
                    "Security Problems of Platform-as-a-Service (PaaS) Clouds and Practical Solutions to the Problems.",
                    "Versatile Key Management for Secure Cloud Storage.",
                    "Securing a Wireless Networked Control System Using Information Fusion.",
                    "Exploring Compile Time Caching of Explicit Queries in Programming Codes.",
                    "Three Point Encryption (3PE): Secure Communications in Delay Tolerant Networks.",
                    "TAIRO: Trust-Aware Automatic Incremental Routing for Opportunistic Resource Utilization Networks.",
                    "Strategies for Reliable, Cloud-Based Distributed Real-Time and Embedded Systems.",
                    "Towards Reliable Communication in Intelligent Transportation Systems.",
                    "Reliable On-Chip Memory Design for CMPs."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "30th SRDS 2011",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2011",
                "sub_name": "30th IEEE Symposium on Reliable Distributed Systems (SRDS 2011), Madrid, Spain, October 4-7, 2011.",
                "count": 30,
                "papers": [
                    "Exploring Latent Features for Memory-Based QoS Prediction in Cloud Computing.",
                    "ELT: Efficient Log-based Troubleshooting System for Cloud Computing Infrastructures.",
                    "Active Replication at (Almost) No Cost.",
                    "Transaction Models for Massively Multiplayer Online Games.",
                    "Balancing the Communication Load of State Transfer in Replicated Systems.",
                    "Automated Discovery of Credit Card Data Flow for PCI DSS Compliance.",
                    "OSARE: Opportunistic Speculation in Actively REplicated Transactional Systems.",
                    "Modeling Medium Utilization for Admission Control in Industrial Wireless Mesh Networks.",
                    "Modeling the Fault Tolerance Consequences of Deduplication.",
                    "Resilience-Driven Parameterisation of Ad Hoc Routing Protocols: olsrd as a Case Study.",
                    "DONUT: Building Shortcuts in Large-Scale Decentralized Systems with Heterogeneous Peer Distributions.",
                    "Partition-Tolerant Distributed Publish/Subscribe Systems.",
                    "Exploiting Node Connection Regularity for DHT Replication.",
                    "An Approach Based on Swarm Intelligence for Event Dissemination in Dynamic Networks.",
                    "Identifying Compromised Users in Shared Computing Infrastructures: A Data-Driven Bayesian Network Approach.",
                    "DiveInto: Supporting Diversity in Intrusion-Tolerant Systems.",
                    "Process Implanting: A New Active Introspection Framework for Virtualization.",
                    "Dangers and Joys of Stock Trading on the Web: Failure Characterization of a Three-Tier Web Service.",
                    "netCSI: A Generic Fault Diagnosis Algorithm for Large-Scale Failures in Computer Networks.",
                    "Finding Almost-Invariants in Distributed Systems.",
                    "An Architecture for Reliable Encapsulation Endpoints Using Commodity Hardware.",
                    "Analyzing Performance of Lease-Based Schemes under Failures.",
                    "A Characterization of Node Uptime Distributions in the PlanetLab Test Bed.",
                    "Candy: Component-based Availability Modeling Framework for Cloud Service Management Using SysML.",
                    "CloudInsight: Shedding Light on the Cloud.",
                    "A Scalable Cloud-based Queuing Service with Improved Consistency Levels.",
                    "On the Reduction of Atomic Broadcast to Consensus with Byzantine Faults.",
                    "Scheduling of Dynamic Participants in Real-Time Distributed Systems.",
                    "Fast Genuine Generalized Consensus.",
                    "A Theory of Fault Recovery for Component-Based Models."
                ]
            },
            {
                "sub_name_abbr": "conf/srds/2011w",
                "sub_name": "30th IEEE Symposium on Reliable Distributed Systems Workshops, SRDS Workshops 2011, Madrid, Spain, October 4-7, 2011.",
                "count": 16,
                "papers": [
                    "Accelerated Processing of Secure Email by Exploiting Built-in Security Features on the Intel EP80579 Integrated Processor with Intel QuickAssist Technology.",
                    "Later Validation/Earlier Write: Concurrency Control for Resource-Constrained Systems with Real-Time Properties.",
                    "MTFR: Mobility Tolerant Firework Routing.",
                    "Towards Tag-based Cooperation for Mobile Ad Hoc Networks.",
                    "Lightweight Dependable Adaptation for Wireless Sensor Networks.",
                    "Symbiosis of a Lightweight ECC Security and Distributed Shared Memory Middleware in Wireless Sensor Networks.",
                    "MhRep: Multi-hop Replication Scheme for Data Survival in Unattended Wireless Sensor Networks.",
                    "Analysis and Comparison of Security Protocols in Wireless Sensor Networks.",
                    "NetODESSA: Dynamic Policy Enforcement in Cloud Networks.",
                    "Autonomic Service-Oriented Architecture for Resilient Complex Systems.",
                    "Towards a Federated Simulation Approach for Reliability Evaluation of Unmanned Aircraft Vehicles within Aeronautical Communcations Networking.",
                    "Wide-Area Virtual Machine Migration as Resilience Mechanism.",
                    "Route Lookup Optimization Including Energy Efficient Conditions in an Optical Transmission Network.",
                    "On the Benefit of Network Coding for Timely and Reliable Event Dissemination in WAN.",
                    "Attack Resistant Network Embeddings for Darknets.",
                    "Distributed Fault Diagnosis Using Bayesian Reasoning in MAGNETO."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "29th SRDS 2010",
        "info": "New Delhi, Punjab, India",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2010",
                "sub_name": "29th IEEE Symposium on Reliable Distributed Systems (SRDS 2010), New Delhi, Punjab, India, October 31 - November 3, 2010.",
                "count": 46,
                "papers": [
                    "PrEServD - Privacy Ensured Service Discovery in Mobile Peer-to-Peer Networks.",
                    "Securing Mobile Unattended WSNs against a Mobile Adversary.",
                    "Attack Injection to Support the Evaluation of Ad Hoc Networks.",
                    "Optimization Based Topology Control for Wireless Ad Hoc Networks to Meet QoS Requirements.",
                    "Fault-Tolerant Aggregation for Dynamic Networks.",
                    "Crash-Tolerant Collision-Free Data Aggregation Scheduling for Wireless Sensor Networks.",
                    "Fixed Cost Maintenance for Information Dissemination in Wireless Sensor Networks.",
                    "A Resource-Efficient Adaptive Caching Scheme for Mobile Ad Hoc Networks.",
                    "VMDriver: A Driver-Based Monitoring Mechanism for Virtualization.",
                    "DKSM: Subverting Virtual Machine Introspection for Fun and Profit.",
                    "Real Distribution of Response Time Instability in Service-Oriented Architecture.",
                    "Lightweight Task Graph Inference for Distributed Applications.",
                    "A Cooperative Sampling Approach to Discovering Optimal Configurations in Large Scale Computing Systems.",
                    "Uncertainty Propagation in Analytic Availability Models.",
                    "Monitoring Local Progress with Watchdog Timers Deduced from Global Properties.",
                    "Adaptare-FD: A Dependability-Oriented Adaptive Failure Detector.",
                    "GAUL: Gestalt Analysis of Unstructured Logs for Diagnosing Recurring Problems in Large Enterprise Storage Systems.",
                    "Invariants Based Failure Diagnosis in Distributed Computing Systems.",
                    "Shedding Light on Enterprise Network Failures Using Spotlight.",
                    "An Entity-Centric Approach for Privacy and Identity Management in Cloud Computing.",
                    "CloudRank: A QoS-Driven Component Ranking Framework for Cloud Computing.",
                    "Secure, Dependable, and High Performance Cloud Storage.",
                    "On-Demand Recovery in Middleware Storage Systems.",
                    "P-Store: Genuine Partial Replication in Wide Area Networks.",
                    "FireSpam: Spam Resilient Gossiping in the BAR Model.",
                    "Semias: Self-Healing Active Replication on Top of a Structured Peer-to-Peer Overlay.",
                    "Experimental Validation of a Synchronization Uncertainty-Aware Software Clock.",
                    "Applying Text Classification Algorithms in Web Services Robustness Testing.",
                    "Availability Assessment of HA Standby Redundant Clusters.",
                    "Diskless Checkpointing with Rollback-Dependency Trackability.",
                    "Swift Algorithms for Repeated Consensus.",
                    "Thicket: A Protocol for Building and Maintaining Multiple Trees in a P2P Overlay.",
                    "A Tactical Information Management Middleware for Resource-Constrained Mobile P2P Networks.",
                    "On Optimizing Traffic Signal Phase Ordering in Road Networks.",
                    "Lightweight Fault-Tolerance for Peer-to-Peer Middleware.",
                    "Adaptive Routing Scheme for Emerging Wireless Ad Hoc Networks.",
                    "Towards Mobile Data Streaming in Service Oriented Architecture.",
                    "Practical Aspects in Analyzing and Sharing the Results of Experimental Evaluation.",
                    "A Study on Latent Vulnerabilities.",
                    "CReW: Cloud Resilience for Windows Guests through Monitored Virtualization.",
                    "Quantifying Resiliency of IaaS Cloud.",
                    "Benchmarking the Resilience of Self-Adaptive Systems: A New Research Challenge.",
                    "Data-Mining-Based Link Failure Detection for Wireless Mesh Networks.",
                    "Data Validity and Dependable Perception in Networked Sensor-Based Systems.",
                    "A Multi-step Simulation Approach toward Secure Fault Tolerant System Evaluation.",
                    "Protection of Identity Information in Cloud Computing without Trusted Third Party."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "28th SRDS 2009",
        "info": "Niagara Falls, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2009",
                "sub_name": "28th IEEE Symposium on Reliable Distributed Systems (SRDS 2009), Niagara Falls, New York, USA, September 27-30, 2009.",
                "count": 30,
                "papers": [
                    "Relaxed Atomic Broadcast: State-Machine Replication Using Bounded Memory.",
                    "When and How to Change Quorums on Wide Area Networks.",
                    "Multithreading-Enabled Active Replication for Event Stream Processing Operators.",
                    "Performance Evaluation of a Metaprotocol for Database Replication Adaptability.",
                    "Reliable and Highly Available Distributed Publish/Subscribe Service.",
                    "Resource-Aware Migratory Services in Wide-Area Shared Computing Environments.",
                    "Model-Based Validation for Internet Services.",
                    "The Effects of Threading, Infection Time, and Multiple-Attacker Collaboration on Malware Propagation.",
                    "Designing System-Level Defenses against Cellphone Malware.",
                    "PolyVaccine: Protecting Web Servers against Zero-Day, Polymorphic and Metamorphic Exploits.",
                    "Fault Localization for Firewall Policies.",
                    "DToken: A Lightweight and Traceable Delegation Architecture for Distributed Systems.",
                    "Constraint Based Automated Synthesis of Nonmasking and Stabilizing Fault-Tolerance.",
                    "Communication-Based Prevention of Non-P-Pattern.",
                    "Spin One's Wheels? Byzantine Fault Tolerance with a Spinning Primary.",
                    "A Self-Stabilizing O(n)-Round k-Clustering Algorithm.",
                    "A Partition-Tolerant Manycast Algorithm for Disaster Area Networks.",
                    "Genuine versus Non-Genuine Atomic Multicast Protocols for Wide Area Networks: An Empirical Study.",
                    "A Holistic Solution to Pursuer-Evader Tracking in Sensor Networks.",
                    "PEQ: A Privacy-Preserving Scheme for Exact Query Evaluation in Distributed Sensor Data Networks.",
                    "On Consistent Neighborhood Views in Wireless Sensor Networks.",
                    "TASK: Template-Based Key Assignment for Confidential Communication in Wireless Networks.",
                    "ZoneTrust: Fast Zone-Based Node Compromise Detection and Revocation in Sensor Networks Using Sequential Analysis.",
                    "The Blocking Option in Routing Protocols.",
                    "X-BOT: A Protocol for Resilient Optimization of Unstructured Overlays.",
                    "A Framework for Distributed Monitoring and Root Cause Analysis for Large IP Networks.",
                    "On the Cost of Database Clusters Reconfiguration.",
                    "Location-Aware Cache-Coherence Protocols for Distributed Transactional Contention Management in Metric-Space Networks.",
                    "Co-scheduling of Disk Head Time in Cluster-Based Storage.",
                    "Assessment and Improvement of Hang Detection in the Linux Operating System."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "27th SRDS 2008",
        "info": "Napoli, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2008",
                "sub_name": "27th IEEE Symposium on Reliable Distributed Systems (SRDS 2008), Napoli, Italy, October 6-8, 2008.",
                "count": 27,
                "papers": [
                    "Assuring Resilient Time Synchronization.",
                    "Application-Level Recovery Mechanisms for Context-Aware Pervasive Computing.",
                    "SeNDORComm: An Energy-Efficient Priority-Driven Communication Layer for Reliable Wireless Sensor Networks.",
                    "Analytical Assessment of the Precision Degradation Caused by Faults in a Fault-Tolerant Master/Slave Clock Synchronization Service for CAN.",
                    "ALPS: Authenticating Live Peer-to-Peer Live Streams.",
                    "Mitigating Distributed Denial of Service Attacks in Multiparty Applications in the Presence of Clock Drifts.",
                    "Protecting BitTorrent: Design and Evaluation of Effective Countermeasures against DoS Attacks.",
                    "Dynamically Quantifying and Improving the Reliability of Distributed Storage Systems.",
                    "An Absolute-Relative Risk Assessment Methodology Approach to Current Safety Critical Systems and its Application to the ADS-B based Air Traffic Control System.",
                    "Systematic Structural Testing of Firewall Policies.",
                    "An Empirical Study of Denial of Service Mitigation Techniques.",
                    "An Autonomic Approach for Replication of Internet-based Services.",
                    "Gumshoe: Diagnosing Performance Problems in Replicated File-Systems.",
                    "Probabilistic Failure Detection for Efficient Distributed Storage Maintenance.",
                    "An Incremental File System Consistency Checker for Block-Level CDP Systems.",
                    "Scalable Topology Discovery and Link State Detection Using Routing Events.",
                    "Fault-Tolerant Coverage Planning in Wireless Networks.",
                    "POSH: Proactive co-Operative Self-Healing in Unattended Wireless Sensor Networks.",
                    "Towards Reliable Reputations for Dynamic Networked Systems.",
                    "Self-Stabilization in Tree-Structured Peer-to-Peer Service Discovery Systems.",
                    "Adaptive Internal Clock Synchronization.",
                    "Extending Paxos/LastVoting with an Adequate Communication Layer for Wireless Ad Hoc Networks.",
                    "Investigating the Existence and the Regularity of Logarithmic Harary Graphs.",
                    "A Probabilistic Analysis of Snapshot Isolation with Partial Replication.",
                    "Using Tractable and Realistic Churn Models to Analyze Quiescence Behavior of Distributed Protocols.",
                    "Formalizing System Behavior for Evaluating a System Hang Detector.",
                    "Availability of Globally Distributed Nodes: An Empirical Evaluation."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "26th SRDS 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2007",
                "sub_name": "26th IEEE Symposium on Reliable Distributed Systems (SRDS 2007), Beijing, China, October 10-12, 2007.",
                "count": 29,
                "papers": [
                    "ASFALT: A Simple Fault-Tolerant Signature-based Localization Technique for Emergency Sensor Networks.",
                    "RAPID: Reliable Probabilistic Dissemination in Wireless Ad-Hoc Networks.",
                    "The Eventual Clusterer Oracle and Its Application to Consensus in MANETs.",
                    "Modeling and Assessing the Dependability ofWireless Sensor Networks.",
                    "Enhancing Edge Computing with Database Replication.",
                    "Building Trust in Storage Outsourcing: Secure Accounting of Utility Storage.",
                    "Customizable Fault Tolerance for Wide-Area Replication.",
                    "Hypervisor-Based Efficient Proactive Recovery.",
                    "Test & Set, Adaptive Renaming and Set Agreement: a Guided Visit to Asynchronous Computability.",
                    "The Fail-Heterogeneous Architectural Model.",
                    "The Paxos Register.",
                    "Characterizing Aging Phenomena of the Java Virtual Machine.",
                    "Model Checking of Consensus Algorit.",
                    "A Language-Based Approach for Improving the Robustness of Network Application Protocol Implementations.",
                    "Using Hidden Semi-Markov Models for Effective Online Failure Prediction.",
                    "Quantifying Temporal and Spatial Correlation of Failure Events for Proactive Management.",
                    "Distributed Diagnosis of Failures in a Three Tier E-Commerce System.",
                    "PEACE-VO: A Secure Policy-Enabled Collaboration Framework for Virtual Organizations.",
                    "RandSys: Thwarting Code Injection Attacks with System Service Interface Randomization.",
                    "Distributed Software-based Attestation for Node Compromise Detection in Sensor Networks.",
                    "Framework for Intrusion Tolerant Certification Authority System Evaluation.",
                    "An Analytical Framework and Its Applications for Studying Brick Storage Reliability.",
                    "Evaluating Byzantine Quorum Systems.",
                    "Hybrid Overloading and Stochastic Analysis for Redundant Real-time Multiprocessor Systems.",
                    "Stateful Detection in High Throughput Distributed Systems.",
                    "A Gambling Approach to Scalable Resource-Aware Streaming.",
                    "Epidemic Broadcast Trees.",
                    "On the Latency Efficiency of Message-Parsimonious Asynchronous Atomic Broadcast.",
                    "Activity Monitoring to Guarantee File Availability in Structured P2P File-sharing Systems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "25th SRDS 2006",
        "info": "Leeds, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2006",
                "sub_name": "25th IEEE Symposium on Reliable Distributed Systems (SRDS 2006),2-4 October 2006, Leeds, UK.",
                "count": 39,
                "papers": [
                    "Reducing the Availability Management Overheads of Federated Content Sharing Systems.",
                    "Topology Sensitive Replica Selection.",
                    "Deleting Files in the Celeste Peer-to-Peer Storage System.",
                    "Reliably Executing Tasks in the Presence of Untrusted Entities.",
                    "WRAPS: Denial-of-Service Defense through Web Referrals.",
                    "A Client-Transparent Approach to Defend Against Denial of Service Attacks.",
                    "Proactive Resilience Revisited: The Delicate Balance Between Resisting Intrusions and Remaining Available.",
                    "Call Availability Prediction in a Telecommunication System: A Data Driven Empirical Approach.",
                    "FT-PPTC: An Efficient and Fault-Tolerant Commit Protocol for Mobile Environments.",
                    "Modeling Distributed Computing System Reliability with DRBD.",
                    "DRIFT: Efficient Message Ordering in Ad Hoc Networks Using Virtual Flooding.",
                    "Generalised Repair for Overlay Networks.",
                    "Decentralized Local Failure Detection in Dynamic Distributed Systems.",
                    "Improvements and Reconsideration of Distributed Snapshot Protocols.",
                    "Weakly-Persistent Causal Objects in Dynamic Distributed Systems.",
                    "PLATO: Predictive Latency-Aware Total Ordering.",
                    "Cryptree: A Folder Tree Structure for Cryptographic File Systems.",
                    "How To Safeguard Your Sensitive Data.",
                    "Solving Consensus Using Structural Failure Models.",
                    "Performance evaluation of a fair fault-tolerant mutual exclusion algorithm.",
                    "Experimental Comparison of Local and Shared Coin Randomized Consensus Protocols.",
                    "Hidden Markov Models as a Support for Diagnosis: Formalization of the Problem and Synthesis of the Solution.",
                    "Consistent Replication of Multithreaded Distributed Objects.",
                    "Recovering from Distributable Thread Failures with Assured Timeliness in Real-Time Distributed Systems.",
                    "SegmentShield: Exploiting Segmentation Hardware for Protecting against Buffer Overflow Attacks.",
                    "A Scalable Services Architecture.",
                    "Fault-tolerant and scalable TCP splice and web server architecture.",
                    "Adaptive Batching for Replicated Servers.",
                    "Satem: Trusted Service Code Execution across Transactions.",
                    "Satem: Trusted Service Code Execution across Transactions.",
                    "Systematic Composition and Analyzability of Dependable Networked Embedded Computing Systems.",
                    "\"Open and challenging research issues in dependable distributed computing\" A personal view from the Defence Industry.",
                    "AVCast : New Approaches For Implementing Availability-Dependent Reliability for Multicast Receivers.",
                    "MOve: Design of An Application-Malleable Overlay.",
                    "An SNMP based failure detection service.",
                    "Lightweight Reflection for Middleware-based Database Replication.",
                    "Improving DBMS Performance through Diverse Redundancy.",
                    "Managing Transaction Conflicts in Middleware-based Database Replication Architectures.",
                    "Non-Blocking Synchronous Checkpointing Based on Rollback-Dependency Trackability."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "24th SRDS 2005",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2005",
                "sub_name": "24th IEEE Symposium on Reliable Distributed Systems (SRDS 2005),26-28 October 2005, Orlando, FL, USA.",
                "count": 25,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Message from the Symposium Chairs.",
                    "Message from the Program Committee Co-Chairs.",
                    "Organizing Committee.",
                    "Consistency Management among Replicas in Peer-to-Peer Mobile Ad Hoc Networks.",
                    "Architecture-Based Autonomous Repair Management: An Application to J2EE Clusters.",
                    "Automatic Model-Driven Recovery in Distributed Systems.",
                    "Octopus: A Fault-Tolerant and Ef.cient Ad-hoc Routing Protocol.",
                    "Self Distributed Query Region Covering in Sensor Networks.",
                    "Reliable Estimation of Influence Fields for Classification and Tracking in Unreliable Sensor Networks.",
                    "Database Replication Using Generalized Snapshot Isolation.",
                    "Consistent Main-Memory Database Federations under Deferred Disk Writes.",
                    "Fault-tolerance for Stateful Application Servers in the Presence of Advanced Transactions Patterns.",
                    "From Static Distributed Systems to Dynamic Systems.",
                    "Enforcing Enterprise-wide Policies Over Standard Client-Server Interactions.",
                    "Thema: Byzantine-Fault-Tolerant Middleware forWeb-Service Applications.",
                    "Agile Store: Experience with Quorum-Based Data Replication Techniques for Adaptive Byzantine Fault Tolerance.",
                    "Distributed Construction of a Fault-Tolerant Network from a Tree.",
                    "Design and Performance-Study of Crash-Tolerant Protocols for Broadcasting and Reaching Consensus in MANETs.",
                    "Lazy Verification in Fault-Tolerant Distributed Storage Systems.",
                    "Asynchronous Veri.able Information Dispersal.",
                    "A new look at atomic broadcast in the asynchronous crash-recovery model.",
                    "LRRM: A Randomized Reliable Multicast Protocol for Optimizing Recovery Latency and Buffer Utilization.",
                    "A Distributed Algorithm for Path Restoration in Circuit Switched Communication Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "23rd SRDS 2004",
        "info": "Florianópolis, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2004",
                "sub_name": "23rd International Symposium on Reliable Distributed Systems (SRDS 2004), 18-20 October 2004, Florianpolis, Brazil.",
                "count": 34,
                "papers": [
                    "Dependable Pervasive Systems.",
                    "Performance Comparison of a Rotating Coordinator and a Leader Based Consensus Algorithm.",
                    "Self Checking Network Protocols: A Monitor Based Approach.",
                    "Design and Evaluation of a QoS-Adaptive System for Reliable Multicasting.",
                    "Run-Time Monitoring for Dependable Systems: An Approach and a Case Study.",
                    "Token-based Atomic Broadcast using Unreliable Failure Detectors.",
                    "The Φ Accrual Failure Detector.",
                    "Nested Objects in a Byzantine Quorum-Replicated System.",
                    "A Stability-Oriented Approach to Improving BGP Convergence.",
                    "Why Have Progresses in Real-Time Fault Tolerant Computing Been Slow?",
                    "On the Progress in Fault-Tolerant Real-Time Computing.",
                    "Slow Advances in Fault-Tolerant Real-Time Distributed Computing.",
                    "Progress in Real-Time Fault Tolerance.",
                    "Why Progress in (Composite) Fault Tolerant Real-Time Systems has been Slow (-er than Expected.. & What Can We Do About It?).",
                    "Skewed Checkpointing for Tolerating Multi-Node Failures.",
                    "An Efficient Checkpointing Protocol for the Minimal Characterization of Operational Rollback-Dependency Trackability.",
                    "A Signal Processing Approach to Global Predicate Monitoring.",
                    "State Maintenance and its Impact on the Performability of Multi-tiered Internet Services.",
                    "An Integrated Architecture for Dependable Embedded Systems.",
                    "The Design and Evaluation of a Defense System for Internet Worms.",
                    "How to Tolerate Half Less One Byzantine Nodes in Practical Distributed Systems.",
                    "Model-Based Validation of an Intrusion-Tolerant Information System.",
                    "Hardware Support for High Performance, Intrusion- and Fault-Tolerant Systems.",
                    "Dependability in Web Services.",
                    "Crash-Resilient Time-Free Eventual Leadership.",
                    "The Mutable Consensus Protocol.",
                    "Simple and Efficient Oracle-Based Consensus Protocols for Asynchronous Byzantine Systems.",
                    "Self-Managing Federated Services.",
                    "Using Program Analysis to Identify and Compensate for Nondeterminism in Fault-Tolerant, Replicated Systems.",
                    "XNET: A Reliable Content-Based Publish/Subscribe System.",
                    "An Hoarding Approach for Supporting Disconnected Write Operations in Mobile Environments.",
                    "Balancing the Tradeoffs between Data Accessibility and Query Delay in Ad Hoc Networks.",
                    "Low Latency Probabilistic Broadcast in Wide Area Networks.",
                    "Proactive Hot Spot Avoidance for Web Server Dependability."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "22nd SRDS 2003",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2003",
                "sub_name": "22nd Symposium on Reliable Distributed Systems (SRDS 2003), 6-8 October 2003, Florence, Italy.",
                "count": 38,
                "papers": [
                    "Reliably Networking a Multicast Repository.",
                    "NEEM: Network-Friendly Epidemic Multicast.",
                    "Epidemic Spreading in Real Networks: An Eigenvalue Viewpoint.",
                    "Group Communication Protocols under Errors.",
                    "Network Awareness and Failure Resilience in Self-Organising Overlay Networks.",
                    "Reliable Peer-to-Peer Information Monitoring through Replication.",
                    "Federation Web: A Scheme to Compound Authorization Chains on Large-Scale Distributed Systems.",
                    "Buffer Management in Probabilistic Peer-to-Peer Communication Protocols.",
                    "Component Replication in Distributed Systems: A Case Study Using Enterprise Java Beans.",
                    "Autonomous Replication for High Availability in Unstructured P2P Systems.",
                    "Performance Virtualization for Large-Scale Storage Systems.",
                    "Preventing Orphan Requests in the Context of Replicated Invocation.",
                    "Performance and Effectiveness Analysis of Checkpointing in Mobile Environments.",
                    "Raptor: Integrating Checkpoints and Thread Migration for Cluster Management.",
                    "AMSD: A Dependability Roadmap for the Information Society in Europe.",
                    "Easy: Engineering High Availability QoS in wServices.",
                    "Coordinated Forward Error Recovery for Composite Web Services.",
                    "Service Continuations: An Operating System Mechanism for Dynamic Migration of Internet Service Sessions.",
                    "Appia vs. Cactus: Comparing Protocol Composition Frameworks.",
                    "A Systematic Approach to the Development of Event Based Applications.",
                    "TCP-Friendly Many-to-Many End-to-End Congestion Control.",
                    "A Reconfigurable Byzantine Quorum Approach for the Agile Store.",
                    "A Reliable Key Authentication Schema for Secure Multicast Communications.",
                    "Pesto Flavoured Security.",
                    "SNARE: A Strong Security Scheme for Network-Attached Storage.",
                    "Transparent Runtime Randomization for Security.",
                    "An Experimental Evaluation of Correlated Network Partitions in the Coda Distributed File System.",
                    "Hazard Analysis of Complex Distributed Railway Systems.",
                    "Assessing the Dependability of OGSA Middleware by Fault Injection.",
                    "Improving the Multiple Errors Detection Coverage in Distributed Embedded Systems.",
                    "Trustworthiness of Open Information Systems: How Should It Be Achieved?",
                    "Transparent Fault-Tolerant Java Virtual Machine.",
                    "Fault Tolerance Technology for Autonomous Decentralized Database Systems.",
                    "The Design and Implementation of a JCA-Compliant Capture Protection Infrastructure.",
                    "Distributed Programming for Dummies: A Shifting Transformation Technique.",
                    "Randomized Asynchronous Consensus with Imperfect Communications.",
                    "Sharing Memory with Semi-Byzantine Clients and Faulty Storage Servers.",
                    "Modeling and Detecting Failures in Next-generation Distributed Multimedia Applications."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "21st SRDS 2002",
        "info": "Suita (near Osaka), Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2002",
                "sub_name": "21st Symposium on Reliable Distributed Systems (SRDS 2002), 13-16 October 2002, Osaka, Japan.",
                "count": 52,
                "papers": [
                    "Efficient Byzantine-Resilient Reliable Multicast on a Hybrid Failure Model.",
                    "A Fault-Tolerant Approach to Secure Information Retrieval.",
                    "Tolerance to Unbounded Byzantine Faults.",
                    "Implementing Quality of Service in Web Servers.",
                    "Fault-Tolerant Virtual Private Networks within An Autonomous System.",
                    "Collaborative Networking in an Uncooperative Internet.",
                    "Fault-Local Stabilization: The Shortest Path Tree.",
                    "Random Walk for Self-Stabilizing Group Communication in Ad-Hoc Networks.",
                    "Service Time Optimal Self-Stabilizing Token Circulation Protocol on Anonymous Unidrectional Rings.",
                    "An Indulgent Uniform Total Order Algorithm with Optimistic Delivery.",
                    "A Unified Proof of Minimum Time Complexity for Reaching Consensus and Uniform Consensus - An Oracle-Based Approach.",
                    "Active Software Replication through a Three-Tier Approach.",
                    "Efficient Distributed Precision Control in Symmetric Replication Environments.",
                    "Availability Models with Age-Dependent Checkpointing.",
                    "Heterogeneous Checkpointing for Multithreaded Applications.",
                    "Non-Intrusive, Parallel Recovery of Replicated Data.",
                    "On Node State Reconstruction for Fault Tolerant Distributed Algorithms.",
                    "Probabilistic Atomic Broadcast.",
                    "Efficient Epidemic-Style Protocols for Reliable and Scalable Multicast.",
                    "Optimistic Total Order in Wide Area Networks.",
                    "Self-Stabilizing Local Mutual Exclusion on Networks in which Process Identifiers are not Distinct.",
                    "A Lower Bound on Dynamic k-Stabilization in Asynchronous Systems.",
                    "Asynchronous Resource Discovery in Peer to Peer Networks.",
                    "An Analysis of Fault Detection Latency Bounds of the SNS Scheme Incorporated into an Ethernet Based Middleware System.",
                    "Broadcasting Messages in Fault-Tolerant Distributed Systems: The Benefit of Handling Input-Triggered and Output-Triggered Suspicions Differently.",
                    "Loose Synchronization of Multithreaded Replicas.",
                    "The Performance of Checkpointing and Replication Schemes for Fault Tolerant Mobile Agent Systems.",
                    "Optimistic Byzantine Agreement.",
                    "Modeling Communication Delays in Distributed Systems Using Time Series.",
                    "Dependability of CORBA Systems: Service Characterization by Fault Injection.",
                    "Analysis of Inspection-Based Preventive Maintenance in Operational Software Systems.",
                    "Implementation of Threshold-based Diagnostic Mechanisms for COTS-Based Applications.",
                    "The Guardian Model for Exception Handling in Distributed Systems.",
                    "Workshop on Reliable Peer-to-Peer Distributed Systems.",
                    "Using File-Grain Connectivity to Implement a Peer-to-Peer File System.",
                    "Building a Reliable Mutable File System on Peer-to-Peer Storage.",
                    "Reperasure: Replication Protocol Using Erasure-Code in Peer-to-Peer Storage Network.",
                    "Improving Object Search Using Hints, Gossip, and Supernodes.",
                    "A Search for Routing Strategies in a Peer-to-Peer Network Using Genetic Programming.",
                    "Implementing IPv6 as a Peer-to-Peer Overlay Network.",
                    "Asynchronous Byzantine Group Communication.",
                    "Power-Aware Epidemics.",
                    "Introspective Failure Analysis: Avoiding Correlated Failures in Peer-to-Peer Systems.",
                    "Message from the RCDS Co-Chairs.",
                    "From Byzantine Agreement to Practical Survivability.",
                    "OBIGrid: Towards a New Distributed Platform for Bioinformatics.",
                    "Self-Stabilizing Distributed File Systems.",
                    "A Self-Stabilizing Algorithm for Finding Cliques in Distributed Systems.",
                    "A Self-Stabilizing Algorithm for the Steiner Tree Problem.",
                    "Failure Detectors for Large-Scale Distributed Systems.",
                    "Management of Mobile Agent Systems using Social Insect Metaphors.",
                    "Self-Organizing Formation Algorithm for Active Elements."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "20th SRDS 2001",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2001",
                "sub_name": "20th Symposium on Reliable Distributed Systems (SRDS 2001), 28-31 October 2001, New Orleans, LA, USA.",
                "count": 35,
                "papers": [
                    "Optimizing File Availability in a Secure Serverless Distributed File System.",
                    "Primary-Backup Replication: From a Time-Free Protocol to a Time-Based Implementation.",
                    "How to Select a Replication Protocol According to Scalability, Availability, and Communication Overhead.",
                    "Quantifying Rollback Propagation in Distributed Checkpointing.",
                    "Continental Pronto.",
                    "Compiler-Assisted Heterogeneous Checkpointing.",
                    "Applying Fault-Tolerance Principles to Security Research.",
                    "The Challenge of Creating Productive Collaborating Information Assurance Communities via Internet Research and Standards.",
                    "Can Reliability and Security be Joined Reliably and Securely?.",
                    "Incorporation of Security and Fault Tolerance Mechanisms into Real-Time Component-Based Distributed Computing Systems.",
                    "Research in High-Confidence Distributed Information Systems.",
                    "Detecting Heap Smashing Attacks through Fault Containment Wrappers.",
                    "Efficient Update Diffusion in Byzantine Environments.",
                    "An Analytical Framework for Reasoning about Intrusions.",
                    "Optimistic Validation of Electronic Tickets.",
                    "A Consensus Protocol Based on a Weak FailureDetector and a Sliding Round Window.",
                    "Polynomial Time Synthesis of Byzantine Agreement.",
                    "Looking Ahead in Atomic Actions with Exception Handling.",
                    "Assessing Inter-Modular Error Propagation in Distributed Software.",
                    "Designing a Robust Namespace for Distributed File Services.",
                    "High-Quality Customizable Embedded Software from COTS Components.",
                    "Application of Commercial-Grade Digital Equipment in Nuclear Power Plant Safety Systems.",
                    "Why Is It So Hard to Predict Software System Trustworthiness from Software Component Trustworthiness?.",
                    "Message Logging Optimization for Wireless Networks.",
                    "Reducing Noise in Gossip-Based Reliable Broadcast.",
                    "Chasing the FLP Impossibility Result in a LAN or How Robust Can a Fault Tolerant Server Be?.",
                    "Consensus with Written Messages Under Link Faults.",
                    "Efficient TDMA Synchronization for Distributed Embedded Systems.",
                    "Efficient Recovery Information Management Schemes for the Fault Tolerant Mobile Computing Systems.",
                    "Using the Timely Computing Base for Dependable QoS Adaptation.",
                    "A Microkernel Middleware Architecture for Distributed Embedded Real-Time Systems.",
                    "Performance Analysis of the CORBA Notification Service .",
                    "Reliable Real-Time Cooperation of Mobile Autonomous Systems.",
                    "On the Effectiveness of a Counter-Based Cache Invalidation Scheme and Its Resiliency to Failures in Mobile Environments.",
                    "Comparison-Based System-Level Fault Diagnosis in Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "19th SRDS 2000",
        "info": "Nürnberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/2000",
                "sub_name": "19th IEEE Symposium on Reliable Distributed Systems, SRDS'00, Nürnberg, Germany, October 16-18, 2000, Proceedings.",
                "count": 25,
                "papers": [
                    "Proxy-based Recovery for Applications on Wireless Hand-held Devices.",
                    "Modeling Fault-Tolerant Mobile Agent Execution as a Sequence of Agreement Problems.",
                    "Improvement of the QoS via an Adaptive and Dynamic Distribution of Applications in a Mobile Environment.",
                    "Reliable Broadcast in the Crash-Recovery Model.",
                    "Optimistic Virtual Synchrony.",
                    "Optimal Implementation of the Weakest Failure Detector for Solving Consensus.",
                    "Semantically Reliable Multicast Protocols.",
                    "An Evolutionary Algorithm for Identifying Faults in t-Diagnosable Systems.",
                    "Detection of Livelocks in Communication Protocols by Means of a Polygon Time Structure.",
                    "Consistent Detection of Global Predicates under a Weak Fault Assumption.",
                    "Issues Insufficiently Resolved in Century 20 in the Fault-Tolerant Distributed Computing Field.",
                    "An Investigation of Membership and Clique Avoidance in TTP/C.",
                    "Continuous Clock Synchronization in Wireless Real-Time Applications.",
                    "High Availability of the Memory Hierarchy in a Cluster.",
                    "Abstractions for Devising Byzantine-Resilient State Machine Replication.",
                    "Implementing a Reflective Fault-Tolerant CORBA System.",
                    "Deterministic Scheduling for Transactional Multithreaded Replicas.",
                    "Pronto: A Fast Failover Protocol for Off-the-shelf Commercial Databases.",
                    "A Pragmatic Implementation of e-Transactions.",
                    "Using Multicast Communication to Reduce Deadlock in Replicated Databases.",
                    "Database Replication Techniques: A Three Parameter Classification.",
                    "Performance of Mobile, Single-Object, Replication Protocols.",
                    "On the Use of Model Checking Techniques for Dependability Evaluation.",
                    "Performance Analysis of the CORBA Event Service using Stochastic Reward Nets.",
                    "Dynamic Node Management and Measure Estimation in a State-Driven Fault Injector."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "18th SRDS 1999",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1999",
                "sub_name": "The Eighteenth Symposium on Reliable Distributed Systems, SRDS 1999, Lausanne, Switzerland, October 19-22, 1999, Proceedings.",
                "count": 54,
                "papers": [
                    "Reliability of Future Telephone Networks.",
                    "Information Dissemination in Partitionable Mobile Ad Hoc Networks.",
                    "Group Multicast in Distributed Mobile Systems with Unreliable Wireless Network.",
                    "Improving Level of Service for Mobile Users using Context-Awareness.",
                    "An Algorithm for Fault-Tolerant Clock State and Rate Synchronization.",
                    "Real-Time Fault-Tolerant Atomic Broadcast.",
                    "A General Framework to Solve Agreement Problems.",
                    "Formal Hazard Analysis of Hybrid Systems in cTLA.",
                    "Safecharts for Specifying and Designing Safety Critical Systems.",
                    "Implementing a Semi-Active Replication Strategy in CHORUS/ClassiX, A Distributed Real-Time Executive.",
                    "View Divergence Control of Replicated Data using Update Delay Estimation.",
                    "Highly Available Process Support Systems: Implementing Backup Mechanisms.",
                    "Scalable Stability Detection using Logical Hypercube.",
                    "On Diffusing Updates in a Byzantine Environment.",
                    "Fault-Tolerant Replication Management in Large-Scale Distributed Storage Systems.",
                    "A Component-based Approach to Reliability Analysis of Distributed Systems.",
                    "Fault Injection based on a Partial View of the Global State of a Distributed System.",
                    "Failure Data Analysis of a LAN of Windows NT based Computers.",
                    "HAMFS File System.",
                    "Logging and Recovery in Adaptive Software Distributed Shared Memory Systems.",
                    "Tolerating Transient Faults in Statically Scheduled Safety-Critical Embedded Systems.",
                    "Issues in the Design of a Reflective Library for Checkpointing C++ Objects.",
                    "Optimistic Recovery in Multi-threaded Distributed Systems.",
                    "An Adaptive Checkpointing Protocol to Bound Recovery Time with Message Logging.",
                    "CosNamingFT - A Fault-Tolerant CORBA Naming Service.",
                    "Enforcing Determinism for the Consistent Replication of Multithreaded CORBA Applications.",
                    "The 'QoS Query Service' for Improved Quality-of-Service Decision Making in CORBA.",
                    "Resolving Distributed Deadlocks in the OR Request Model.",
                    "An Efficient Checkpointing Algorithm for Distributed Systems Implementing Reliable Communication Channels.",
                    "An Approach for Fault-Tolerance in Hard Real-Time Distributed Systems.",
                    "An Agent Platform for Reliable Asynchronous Distributed Programming.",
                    "Exactly-Once End-to-End Semantics in CORBA Invocations across Heterogeneous Fault-Tolerant ORBs.",
                    "A Distributed Algorithm for Deadlock Detection under OR-request Model.",
                    "Design and Validation of a Distributed Industrial Control System's Nodes.",
                    "Performance Evaluation of the Circulating Multisequencer and the Consensus Algorithms in a Real-Time Distributed Transactional System.",
                    "Database Replication: If You Must be Lazy, be Consistent.",
                    "A Software Multilevel Fault Injection Mechanism: Case Study Evaluating the Virtual Interface Architecture.",
                    "Workshop on Reliable Middleware - Foreword.",
                    "The Mainframe as a High-Available, Highly Scalable CORBA Platform.",
                    "A Method for Combining Replication with Caching.",
                    "Fault Tolerance in Three-Tier Applications: Focusing on the Database Tier.",
                    "Workshop on Electronic Commerce - Foreword.",
                    "XML Documents Production for an Electronic Platform of Requests for Proposals.",
                    "Service Provision and Composition in Virtual Business Communities.",
                    "Quality of Service in Business-to-Business E-Commerce Applications.",
                    "A Practical Guideline to the Implementation of Online Shops.",
                    "Approaching a Formal Definition of Fairness in Electronic Commerce.",
                    "Trust and Electronic Commerce - More than a Technical Problem.",
                    "Authorization Methods for E-Commerce Applications.",
                    "Gateways to Overcome Incompatibilities of Security Mechanisms.",
                    "Security Mechanisms for using Mobile Agents in Electronic Commerce.",
                    "Accountable Anonymous Access to Services in Mobile Communication Systems.",
                    "On the Provision of Replicated Internet Auction Services.",
                    "The Usability Risk."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "17th SRDS 1998",
        "info": "West Lafayette, Indiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1998",
                "sub_name": "The Seventeenth Symposium on Reliable Distributed Systems, SRDS 1998, West Lafayette, Indiana, USA, October 20-22, 1998, Proceedings.",
                "count": 69,
                "papers": [
                    "A Non-Blocking Recovery Algorithm for Causal Message Logging.",
                    "The Cost of Recovery in Message Logging Protocols.",
                    "An Efficient Algorithm for Causal Message Logging.",
                    "ROI: An Invocation Mechanism for Replicated Objects.",
                    "View Consistency for Optimistic Replication.",
                    "Semi-Passive Replication.",
                    "Secure and Scalable Replication in Phalanx.",
                    "A VP-Accordant Checkpointing Protocol Preventing Useless Checkpoints.",
                    "System-Level Versus User-Defined Checkpointing.",
                    "Checkpoints-on-Demand with Active Replication.",
                    "Design and Analysis of a Hardware-Assisted Checkpointing and Recovery Scheme for Distributed Applications.",
                    "Checkpoint-Recovery Protocol for Reliable Mobile Systems.",
                    "A Fault-Tolerant Protocol for Providing the Exactly-Once Property of Mobile Agents.",
                    "Tolerating Visitor Location Register Failures in Mobile Environments.",
                    "An Active Transcoding Proxy to Support Mobile Web Access.",
                    "A Metaobject Protocol for Fault-Tolerant CORBA Applications.",
                    "Safe and Efficient Active Network Programming.",
                    "On Patterns for Practical Fault Tolerant Software in Java.",
                    "Evolving Distributed Software Engineering Environments.",
                    "Failure Handling in an Optimized Two-Safe Approach to Maintaining Primary-Backup Systems.",
                    "An Integration of the Primary-Shadow TMO Replication Scheme with a Supervisor-Based Network Surveillance Scheme and Its Recovery Time Bound Analysis.",
                    "Optimization of a Real-Time Primary-Backup Replication Service.",
                    "A Multiprocessor Scheduling Algorithm for Low Overhead Fault-Tolerance.",
                    "A Security Auction-Like Negotiation Protocol for Agent-Based Internet Trading.",
                    "Design and Verification of a Secure Electronic Auction Protocol.",
                    "Transformation-Based Reconstruction for Audio Transmissions over the Internet.",
                    "Tolerating Client and Communication Failures in Distributed Groupware Systems.",
                    "Fault-Tolerant Total Order Multicast to Asynchronous Groups.",
                    "Architecture for Group Communication in Mobile Systems.",
                    "AQuA: An Adaptive Architecture that Provides Dependable Distributed Objects.",
                    "Dependability Analysis of a Cache-Based RAID System via Fast Distributed Simulation.",
                    "The Chameleon Infrastructure for Adaptive, Software Implemented Fault Tolerance.",
                    "Survivable Consensus Objects.",
                    "Consensus in Asynchronous Systems Where Processes Can Crash and Recover.",
                    "A Randomized Algorithm for Distributed Consensus.",
                    "A Distributed Version of the SequenceL Language.",
                    "Optimizing Join Index Based Join Processing: A Graph Partitioning Approach.",
                    "Load Balancing of Dynamic and Adaptive Mesh-Based Computations.",
                    "High Throughput Networks for Petaflops Computing.",
                    "Look-Ahead Traffic Distribution in Wormhole-Routed Networks.",
                    "Distributed Center Location Algorithm for Fault-Tolerant Multicast in Wide-Area Networks.",
                    "A Taxonomy for Describing Matching and Scheduling Heuristics for Mixed-Machine Heterogeneous Computing Systems.",
                    "Extending the Coda File System to Handle Cache Misses on Isolated Clients.",
                    "Cache Injection on Bus Based Multiprocessors.",
                    "Programming the Grid: Component Systems for Distributed Applications.",
                    "The Relative Overhead of Piggybacking in Causal Message Logging Protocols.",
                    "Two Branch Predictor Schemes for Reduction of Misprediction Rate in Conditions of Frequent Context Switches.",
                    "Off-Line Diagnosis of Parallel Systems.",
                    "Practical Parallel Algorithms for Minimum Spanning Trees.",
                    "Resource-Usage Prediction for Demand-Based Network-Computing.",
                    "An Efficient MPEG Video Encryption Algorithm.",
                    "Security in the Large: Is Java's Sandbox Scalable?",
                    "Enforcing Security Policies in Large Scale Communication Networks.",
                    "Managing Network Security-A Pragmatic Approach.",
                    "Requirements for a True Enterprise-Wide Security Infrastructure: The Play's the Thing.",
                    "Security in Mobile Systems.",
                    "Local Area Detection of Incoming War Dial Activity.",
                    "Cyber-Intrusion Response.",
                    "Legal Reliability in Large-Scale Distributed Systems.",
                    "End to End Reliable Multicast Transport Protocol Requirements for Collaborative Multimedia Systems.",
                    "An Efficient Scheme to Reduce Handoff Dropping in LEO Satellite Systems.",
                    "A Fragmentation Scheme for Multimedia Traffic in Active Networks.",
                    "CORBA Evaluation of Video Streaming wrt QoS Provisioning.",
                    "Evaluation of Filtering Mechanisms for MPEG Video Communications.",
                    "Pixel Level Interleaving Schemes for Robust Image Communication.",
                    "Interactive Image Retrieval over the Internet.",
                    "Issues in Multimedia Synchronization over Broadband Networks.",
                    "A Data Allocation Algorithm for Distributed Hypermedia Documents.",
                    "An Object Relational Database for Brain Aging Research."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "16th SRDS 1997",
        "info": "Durham, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1997",
                "sub_name": "The Sixteenth Symposium on Reliable Distributed Systems, SRDS 1997, Durham, North Carolina, USA, October 22-24, 1997, Proceedings.",
                "count": 25,
                "papers": [
                    "Reliability Analysis of Disk Array Organizations by Considering Uncorrectable Bit Errors.",
                    "Availability Analysis of Transaction Processing Systems based on User-Perceived Performance.",
                    "Controlled Stochastic Petri Nets.",
                    "An Index-Based Checkpointing Algorithm for Autonomous Distributed Systems.",
                    "Applying Simulation to the Design and Performance Evaluation of Fault-tolerant Systems.",
                    "Reliable Software Systems using Reusable Software Components.",
                    "Incorporating Code Coverage in the Reliability Estimation for Fault-Tolerant Software.",
                    "Predicting Dependability Properties On-line.",
                    "Chameleon: Adaptive Fault Tolerance Using Reliable, Mobile Agents.",
                    "Fault Detection Using Hints from the Socket Layer.",
                    "Comparing Operating Systems Using Robustness Benchmarks.",
                    "Software Approach to Hazard Detection Using On-line Analysis of Safety Constraints.",
                    "A Flexible Security Model for Using Internet Content.",
                    "Data Distribution Algorithms for Load Banlanced Fault-Tolerant Web Access.",
                    "Load Balancing Schemes for High-Throughput Distributed Fault-Tolerant Servers.",
                    "Reliabilty of Distributed Applications with COTS Components (Position Statement).",
                    "The Art of Creating Reliable Software-based Systems using Off-the-Shelf Software Components.",
                    "Tradeoffs when Integrating Multiple Software Components into a Highly Available Application.",
                    "Fast Replicated State Machines Over Partitionable Networks.",
                    "Selecting a \"Primary Partition\" in Partitionable Asynchronous Distributed Systems.",
                    "A Supervisor-Based Semi-Centralized Network Surveillance Scheme and the Fault Detection Latency Bound.",
                    "A Fail-Awar Membership Service.",
                    "Probabilistic Verification of a Synchronous Round-Based Consensus Protocol.",
                    "Transaction Reordering in Replicated Databases.",
                    "Preventing Useless Checkpoints in Distributed Computations."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "15th SRDS 1996",
        "info": "Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1996",
                "sub_name": "The 15th Symposium on Reliable Distributed Systems, SRDS 1996, Niagara-on-the-Lake, Ontario, Canada, October 23-25, 1996, Proceedings.",
                "count": 23,
                "papers": [
                    "Exploiting Data-Flow for Fault-Tolerance in a Wide-Area Parallel System.",
                    "Specialized N-Modular Redundant Processors in Large-Scale Distributed Systems.",
                    "Dynamic Fault Tolerance in DCMA - A Dynamically Configurable Multicomputer Architecture.",
                    "Analysis of a Multistage Interconnection Network using Binary Decision Diagrams.",
                    "Analyzing Dynamic Voting Using Petri Nets.",
                    "On-line Testing for Application Software of Widely Distributed System.",
                    "Minimizing Timestamp Size for Completely Asynchronous Optimistic Recovery with Minimal Rollback.",
                    "Improving the Performance of Coordinated Checkpointers on Networks of Workstations using RAID Techniques.",
                    "Implementation and Performance of a Stable-Storage Service in Unix.",
                    "Hierarchical Adaptive Distributed System-Level Diagnosis Applied for SNMP-based Network Fault Management.",
                    "Ongoing Fault Diagnosis.",
                    "Diagnosing Crosstalk-Faulty Switches in Photonic Networks.",
                    "A Transparent Light-Weight Group Service.",
                    "Strong and Weak Virtual Synchrony in Horus.",
                    "The Design of a CORBA Group Communication Service.",
                    "Observations from 16 Years at a Fault-Tolerant Computer Company.",
                    "Developing reliable applications on cluster systems.",
                    "Locating More Corruptions in a Replicated File.",
                    "Primary Copy Method and its Modifications for Database Replication in Distributed Mobile Computing Environment.",
                    "A Fault-Tolerant CORBA Name Server.",
                    "Fail-Aware Failure Detectors.",
                    "A Causal Message Ordering Scheme for Distributed Embedded Real-Time Systems.",
                    "A proposal for Ensuring High Availability of Distributed Multimedia Applications."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "14th SRDS 1995",
        "info": "Bad Neuenahr, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1995",
                "sub_name": "14th Symposium on Reliable Distributed Systems, SRDS 1995, Bad Neuenahr, Germany, September 13-15, 1995, Proceedings.",
                "count": 24,
                "papers": [
                    "Omniscience, Consensus, Autonomy: Three Tempting Roads to Responsiveness.",
                    "A Longitudinal Survey of Internet Host Reliability.",
                    "Experimental Evaluation of the Impact of Processor Faults on Parallel Applications.",
                    "A Correctness Criterion for Advanced Transcation Models.",
                    "Supporting Semantics-Based Transaction Processing in Mobile Database Applications.",
                    "Non-Blocking Atomic Commitment with an Unreliable Failure Detector.",
                    "On the Design of Systems of Cooperating Functional Processes.",
                    "System Support for Robust Collaborative Applications.",
                    "A Method for the Construction and Interpretation of High-Level Models for Distributed Fault-Tolerant Systems.",
                    "Maximum and Minimum Consistent Global Checkpoints and their Applications.",
                    "The Performance of Consistent Checkpointing in Distributed Shared Memory Systems.",
                    "A Hierarchy of Totally Ordered Multicasts.",
                    "Configurable Highly Availbale Distributed Services.",
                    "An Integer Programming Approach for Assigning Votes in a Distributed System.",
                    "A Paradigm for User-Defined Security Policies.",
                    "A New Deadlock Detection Algorithm for Distributed Real-Time Database Systems.",
                    "A Synchronization Strategy for a Time-Triggered Multicluster Real-Time System.",
                    "MUSE: A Message Passing Concurrent Computer for On-Board Space Systems.",
                    "Designing Masking Fault Tolerance via Nonmasking Fault Tolerance.",
                    "TMR Processing without Explicit Clock Synchronization.",
                    "Performance Analysis of a Regeneration-Based Dynamic Voting Algorithm.",
                    "Membership and System Diagnosis.",
                    "Self Diagnosis of Processor Arrays Using a Comparison Model.",
                    "Failure Detection Algorithms for a Reliable Execution of Parallel Programs."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "13th SRDS 1994",
        "info": "Dana Point, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1994",
                "sub_name": "13th Symposium on Reliable Distributed Systems, SRDS 1994, Dana Point, California, USA, October 25-27, 1994, Proceedings.",
                "count": 21,
                "papers": [
                    "Fault Tolerance in a Multisensor Environment.",
                    "A Methodology for Constructing a Stabiliying Crash-Tolerant Application.",
                    "Probabilistic Internal Clock Synchronization.",
                    "Reducing Interprocessor Dependence in Recoverable Distributed Shared Memory.",
                    "Coordinated Checkpointing-Rollback Error Recovery for Distributed Shared Memory Multicomputers.",
                    "Analysis of Checkpointing Schemes for Multiprocessor Systems.",
                    "An Environment for Importance Sampling Based on Stochastic Activity Networks.",
                    "Reliability Analysis of a Hardware and Software Fault Tolerant Parallel Processor.",
                    "Probabilistic Validation using Worst Event Driven amd Importance Sampling Simulation.",
                    "PLinda 2.0: A Transactional/Checkpointing Approach to Fault Tolerant Linda.",
                    "Nested Dynamic Actions - How to Solve the Fault Containment Problem in a Cooperative Action Model.",
                    "An Efficient Recovery Scheme for Locking-Based Distributed Database Systems.",
                    "Interaction of Formal Design Systems in the Development of a Fault-Tolerant Clock Synchronization Circuit.",
                    "Simulating Fail-Stop in Asynchronous Distributed Systems.",
                    "A Protocol Description Language for Customizing Semantics.",
                    "A Replication-Transparent Remote Invocation Protocol.",
                    "Efficient Treatment of Failures in RPC Systems.",
                    "Exploiting Program Semantics for Efficient Instrumentation of Distributed Event Recognitions.",
                    "Processing of Read-Only Queries at a Remote Backup.",
                    "Transparent Load Sharing in Distributed Systems: Decentralized Design Alternatives Based on the Condor Package.",
                    "Distributed Reconfiguration of Multiprocessor Systems."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "12th SRDS 1993",
        "info": "Princeton, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1993",
                "sub_name": "12th Symposium on Reliable Distributed Systems, SRDS 1993, Princeton, New Jersey, USA, October 6-8, 1993, Proceedings.",
                "count": 15,
                "papers": [
                    "Processor Group Membership Protocols: Specification, Design, and Implementation.",
                    "APRICOTS - A Prototype Implementation of a ConTract System: Management of the Control Flow and the Communication System.",
                    "An Approach for Combinatorial Performance and Availability Analysis.",
                    "A Compositinal Proof Theory for Fault Tolerant Real-Time Distributed Systems.",
                    "Bayesian Analysis for Fault Location in Homogeneous Distributed Systems.",
                    "Using Logging and Asynchronous Checkpointing to Implement Recoverable Distributed Shared Memory.",
                    "Rollback Based on Vector Time.",
                    "Lazy Checkpointing Coordination for Bounding Rollback Propagation.",
                    "Efficient Transparent Optimistic Rollback Recovery for Distributed Application Programs.",
                    "An O(1) Quorum Consensus Protocol Tailored for the Client/Server Architecture.",
                    "An Approach to Constructing Modular Fault-Tolerant Protocols.",
                    "Using Atomic Broadcast to Implement a posteriori Agreement for Clock Synchronization.",
                    "A Secure Two Phase Locking Protocol.",
                    "Some Remarks on Protecting Weak Keys and Poorly-Chosen Secrets from Guessing Attacks.",
                    "Constructing Secure Distributed Systems Using Components."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "11th SRDS 1992",
        "info": "Houston, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1992",
                "sub_name": "11th Symposium on Reliable Distributed Systems, SRDS 1992, Houston, Texas, USA, October 5-7, 1992, Proceedings.",
                "count": 27,
                "papers": [
                    "A Replicated Object Server for a Distributed Object-Oriented System.",
                    "Managing Replicated Data in Heterogeneous Database Systems.",
                    "Dynamic Management of Highly Replicated Data.",
                    "The Two-Phase Commit Performance of the DECdtm Services.",
                    "The Performance of Consistent Checkpointing.",
                    "Error Attenuation in Distributed Systems.",
                    "Optimal Replica Control Protocols for Ring Networks.",
                    "The Triangular Lattice Protocol: A Highly Fault Tolerant and Highly Efficient Protocol for Replicated Data.",
                    "An Efficient Decentralized Approach to Processor-Group Membership Maintenance in Real-Time LAN Systems: The PRHB/ED Scheme.",
                    "Dependability Analysis of Distributed Computing Systems using Stochastic Petri Nets.",
                    "Sensitivity and Uncertainty Analysis in Performability Modeling.",
                    "Availability of Coding Based Replication Schemes.",
                    "xAMp: A Multi-primitive Group Communications Service.",
                    "Reliable Broadcasting in Faulty Hypercube Computers.",
                    "Communication Protocols for Fault-Tolerant Clock Synchronization in Not-Completely Connected Networks.",
                    "KITLOG: a Generic Logging Service.",
                    "Optimistic Message Logging for Independent Checkpointing in Message-Passing Systems.",
                    "Clobal Checkpointing for Distributed Programs.",
                    "Distributed Problem Solving In SPite Of Processor Failures.",
                    "Self-Stabilizing Real-Time Rule-Based Systems.",
                    "Simulation of the Adapt On-Line Diagnosis Algorithm for General Topology Networks.",
                    "Neural Networks for the Design of Distributed, Fault-Tolerant, Computing Environments.",
                    "On the Verification and Validation of Protocols with High Fault Coverage Using UIO Sequences.",
                    "A State Machine Approach to Reliable Distributed Systems.",
                    "Dataflow-Like Languages for Real-Time Systems: Issues of Computational Models and Notations.",
                    "A Mult-Paradigm Programming Language for Constructing Fault-Tolerant, Distributed Systems.",
                    "The Sentry System."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "10th SRDS 1991",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1991",
                "sub_name": "Tenth Symposium on Reliable Distributed Systems, SRDS 1991, Pisa, Italy, September 30 - October 2, 1991, Proceedings.",
                "count": 21,
                "papers": [
                    "Checkpointing Multicomputer Applications.",
                    "A Timestamp-Based Checkpointing Protocol for Long-Lived Distributed Computations.",
                    "File System Measurements and their Application to the Design of Efficient Operation Logging Algorithm.",
                    "Masking Failures of Multidimensional Sensors.",
                    "A Statistical Clock Synchronization Algorithm for Anisotropic Networks.",
                    "On the Testability of Distributed Real-Time Systems.",
                    "Optimistic Failure Recovery for Very Large Networks.",
                    "Efficient Communication of Commitment-Dependency Information in the Programmer-Transparent Coordination (PTC) Scheme for Cooperative Recovery.",
                    "Flexible Schemes for Application-Level Fault Tolerance.",
                    "A Model for Interface Groups.",
                    "Formalising Replicated Distributed Processing.",
                    "On Tolerating Faults in Naturally Redundant Algorithms.",
                    "Dependability Evaluation of Bus and Ring Communication Topologies for the Delta-4 Distributed Fault-Tolerant Architecture.",
                    "Flexible Handling of Diverse Dependability Requirements in MARS.",
                    "Efficient Transient Simulation of Failure/Repair Markovian Models.",
                    "Performability Evaluation of CASMA/CD and CASMA/DCR Protocols under Transient Fault Conditions.",
                    "A Study of the Reliablility of Internet Sites.",
                    "Ordered Broadcasts for Large Applications.",
                    "Keeping Processes Under Surveillance.",
                    "A Fault-Tolerant, Scalable, Low-Overhead Distributed Garbage Detection Protocol.",
                    "Copying Garbage Collection for Distributed Object Stores."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "9th SRDS 1990",
        "info": "Huntsville, Alabama",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1990",
                "sub_name": "Ninth Symposium on Reliable Distributed Systems, SRDS 1990, Huntsville, Alabama, USA, October 9-11, 1990, Proceedings.",
                "count": 18,
                "papers": [
                    "The Design and Implementation of a Reliable Distributed Operating System - ROSE.",
                    "Using Stashing to Increase Node Autonomy in Distributed File Systems.",
                    "Distributed Lock Management in a Transaction Processing Environment.",
                    "An Improved ALgorithm for the Symbolic Reliability Analysis of Networks.",
                    "A Lower Bound On The Reliability of an n-Dimensional Hypercube.",
                    "Reliable Broadcast for Fault-Tolerance on Local Computer Networks.",
                    "A Low-Cost Atomic Commit Protocol.",
                    "Adaptility Experiments in the RAID Distributed Data Base System.",
                    "Fault Tolerant Distributed Data Base System via Data Inference.",
                    "Representation and Execution Support for Reliable Robot Applications.",
                    "Preventing State Divergence in Replicated Distributed Programs.",
                    "Adjudicators for Diverse-Redundant Components.",
                    "Voting as the Optimal Static Pessimistic Scheme for Managing Replicated Data.",
                    "A Comparison of Voting Strategies for Fault-Tolerant Distributed Systems.",
                    "A Fault Tolerant Algorithm for Distributed Mutual Exclusion.",
                    "RelaX - An Extensible Architecture Supporting Reliable Distributed Applications.",
                    "Temporal Uncertainties in Interactions among Real-Time Objects.",
                    "A General Methodology for the System State Characterization of Event Recognitions."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "8th SRDS 1989",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1989",
                "sub_name": "Eigthth Symposium on Reliable Distributed Systems, SRDS 1989, Seattle, Washington, USA, October 10-12, 1989, Proceedings.",
                "count": 19,
                "papers": [
                    "Using Checkpoints to Localize the Effects of Faults in Distributed Systems.",
                    "A Low Overhead Checkpointing and Rollback Recovery Scheme for Distributed Systems.",
                    "Recovery-Management in the RelaX Distributed Transaction layer.",
                    "Consistent Replicated Transactions: A Highly Reliable Program Execution Environment.",
                    "Implementing Fault-Tolerant Replicated Ojects Using Psync.",
                    "Recovering from Process Failures in the Time Warp Mechanism.",
                    "Ring Network Reliability - The Probablility That All Operative Nodes Can Communicate.",
                    "Decentralized Loopback Reconfiguration of a Bidirectional Ring Lan.",
                    "Self-Stabilization of the Alternating-Bit Protocol.",
                    "A Token-Based Protocol for Reliable, Ordered Multicast Communications.",
                    "An Efficient Kernel-level Dependable Multicast Protocol for Distributed Systems.",
                    "Workload Analysis for Performance Study of Distributed Deadlock Detection Algorithms.",
                    "Performance Comparision of Concurrency Control Protocols for Transaction Processing Systems with Regional Locality.",
                    "Implementing Atomic Rendevous within a Transactional Framework.",
                    "Availability Analysis of the Primary Site Approach for Fault Tolerance.",
                    "Bounded Approximate Reliability Models for Distributed Systems.",
                    "Limits on Scalability in Gracefully Degradable Large-Scale Systems.",
                    "Testing Reliable Distributed Applications Through Simulated Events.",
                    "Distributed Processing Test Simulator (DPTS)."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "7th SRDS 1988",
        "info": "Columbus, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1988",
                "sub_name": "Seventh Symposium on Reliable Distributed Systems, SRDS 1988, Columbus, Ohio, USA, October 10-12, 1988, Proceedings.",
                "count": 21,
                "papers": [
                    "Independent Checkpointing and Concurrent Rollback for Recovery in Distributed Systems - An Optimistic Approach.",
                    "Checkpointing and Rollback Recovery in a Distributed System Using Common Time Base.",
                    "A Commit Protocol for Checkpointing Transactions.",
                    "Pessimistic Protocols for Quasi-Partitioned Distributed Database Systems.",
                    "Quorum Consensus Algorithms for Secure and Reliable Data.",
                    "A Robust, Distributed Election Protocol.",
                    "A Experimental Investigation of Software Diversity in a Fault-Tolerant Avionics Application.",
                    "An Analysis of the Performance Impacts of Lookahead Execution in the Conversation Scheme.",
                    "Task Allocation for Optimized System Reliability.",
                    "Interactive Consistency with Multiple Failure Modes.",
                    "An Implementation of Reliable Broadcast Using an Unreliable Multicast Facility.",
                    "A Fault-Tolerant Protocol for Atomic Broadcast.",
                    "A Realistic Evaluation of Optimistic Dynamic Voting.",
                    "Vote Assignments in Weighted Voting Mechanisms.",
                    "On the Diagnosis of Byzantine Faults.",
                    "Implementation of RAID.",
                    "Recovery in the Clouds Kernel.",
                    "Transaction Management in a Distributed Database System for Local Area Networks.",
                    "Recovering Imprecise Transactions with Real-Time Constraints.",
                    "Distributed Locking: A Mechanism for Constructing Highly Available Objects.",
                    "The Commit/Abort Problem in Type-Specific Locking."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "6th SRDS 1987",
        "info": "Kingsmill-Williamsburg, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1987",
                "sub_name": "Sixth Symposium on Reliability in Distributed Software and Database Systems, Kingsmill-Williamsburg, VA, USA, March 17-19, 1987, Proceedings.",
                "count": 20,
                "papers": [
                    "Reliability Issues in Distributed Operating Systems.",
                    "A Reliable and Secure UNIX Connection Service.",
                    "Preserving Context Information in an IPC Abstraction.",
                    "Adaptive, Reliable Software for Distributed and Parallel Real-Time Systems.",
                    "Reliability in Distributed Programming Environments.",
                    "Bugnet: A Real Time Distributed Programmng Environments.",
                    "DTM - A Method for Testing Distributed Systems.",
                    "On Improving the Availability of Replicated Files.",
                    "Access Control in a Heterogeneous Distributed Database Management System.",
                    "Independent Recovery.",
                    "Exploiting Type Inheritance Facilities to Implement Recoverability in Object Based Systems.",
                    "Fault Tolerant Computing in Object Based Distributed Operating Systems.",
                    "Design and Implementation of Nested Transactions in Eden.",
                    "Synchronization of Redundant Computation in a Distributed System.",
                    "Fault Masking and Sequence Agreement by a Voting Protocol with low Message Number.",
                    "Performance Characterization of Quorum-Consensus Allgorihms for Replicated Data.",
                    "Representing Faulty Distributed Systems as Nondeterministic Sequential Systems.",
                    "Maintaining Availability of Replicated Data in a Dynamic Failure Environment.",
                    "A Gracefully Degradable Algorithm for Byzantine Agreement.",
                    "Early Stopping Algorithms for Distributed Agreement under Fail-Stop, Omission, and Timing Fault-Types."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "5th SRDS 1986",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1986",
                "sub_name": "Fifth Symposium on Reliability in Distributed Software and Database Systems, SRDS 1986, Los Angeles, California, USA, January 13-15, 1986, Proceedings.",
                "count": 26,
                "papers": [
                    "Why Do Computers Stop and What Can Be Done About It?",
                    "The Future of Data Replication.",
                    "Problems in Maintaining Agreement.",
                    "Issues in Fault-Tolerant Real-Time Local Area Networks.",
                    "Accuracy of Time Measurement in Distributed Real Time Systems.",
                    "Time-Driven Orphan Elimination.",
                    "Fault Tolerant Locking (FTL) for Tightly Coupled Systems.",
                    "Failure Handling in Distributed Programming Languages.",
                    "Low-Cost Comparison and Diagnosis of Large Remotely Located Files.",
                    "A Saturation Network to Tolerate Faults and Intrusions.",
                    "Robust Application Design in Highly Available Distributed Databases.",
                    "Database Processing with Triple Modular Redundancy.",
                    "O(N * sqrt(N)) Decentralized Commit Protocols.",
                    "Reliability and Security Issues in Distributed Computing Systems.",
                    "How Big Can An Atomic Action Be?",
                    "A Structured Decision Mechanism for Diverse Software.",
                    "An Approach to Fault-Tolerance in Massive Parallelism Systems.",
                    "Simultaneity is Harder than Agreement.",
                    "Optimal Checkpointing of Real-Time Tasks.",
                    "An Analysis of the Execution Overhead Inherent in the Conversation Scheme.",
                    "Relocating Processes in Distributed Computer Systems.",
                    "Operating System Support for Software Migration in a Distributed System.",
                    "State Inconsistency Issues in Local Area Network-Based Distributed Kernels.",
                    "A Token-Based Resiliency Control Scheme in Replicated Database Systems.",
                    "Transaction Recovery in Distributed DB/DC Systems: A Progressive Approach.",
                    "A Characterisation of Faults in Systems."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "4th SRDS 1984",
        "info": "Silver Spring, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1984",
                "sub_name": "Fourth Symposium on Reliability in Distributed Software and Database Systems, SRDS 1984, Silver Spring, Maryland, USA, October 15-17, 1984, Proceedings.",
                "count": 24,
                "papers": [
                    "Communication Architechtures for Fast Reliable Broadcasts.",
                    "Circus: A Replicated Procedure Call Facility.",
                    "Stylized Interprocess Communication - A Kernel Primitive for Reliable Distributed Computing.",
                    "Coping with Network Partitions and Processor Failures in a Distributed System.",
                    "The Vulnerability of Voting Mechanisms.",
                    "Managing Replicate Data in JASMIN.",
                    "A Technique for Estimating Performance of Fault-Tolerant Programs.",
                    "Performance Modeling of Database Recovery Protocols.",
                    "Performance Evaluation of Distributed Concurrency Control Mechanisms.",
                    "Tolerating System Overloads: A Case Study.",
                    "A Simple and Efficient Randomized Byzantine Agreement Algorithm.",
                    "Randomized Byzantine Agreement.",
                    "The Reliability of (k, n)-Resilient Distributed Systems.",
                    "Implementing Fault-Tolerant Distributed Objects.",
                    "Ordering Actions for Visibility.",
                    "Cluster-Based Naming for Reliable Distributed Systems.",
                    "Multi-Level Concurrency Control of a Database System.",
                    "A Distributed Algorithm for Deadlock Detection and Resolution.",
                    "An Algebraic System for Deadlock Detection and its Applications.",
                    "Support for Distributed Transactions in the TABS Prototype.",
                    "A Distributed Domino-Effect free recovery Algorithm.",
                    "Structure Process for a Cooperative Approach to Fault-Tolerant Distributed Software.",
                    "A Computing System to Support Development of Reliable Software.",
                    "A Framework for Research in Performance-Availability of Automated Information Systems."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "3rd SRDS 1983",
        "info": "Clearwater Beach, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1983",
                "sub_name": "Third Symposium on Reliability in Distributed Software and Database Systems, SRDS 1983, Clearwater Beach, FL, USA, October 17-19, 1983, Proceedings.",
                "count": 21,
                "papers": [
                    "Recursively Structured Distributed Computing Systems.",
                    "Modeling Fault-Tolerant Software Reliability.",
                    "Asynchronous Software Voting in NMR Computer Structures.",
                    "Data-Pach: Integrating Inconsistent Copies of a Database After a Partition.",
                    "A Suite of Robust Algorithms For Maintaining Replicated Data Using Weak Consistency Conditions.",
                    "Performance Evaluation of Two-Phase Locking Algorithms in a System for Distributed Databases.",
                    "Reliable Storage Update (Extended Abstract).",
                    "An Experimental Distributed Processing Facility - A Vehicle for Survivability.",
                    "Checkpoint and Restart in Distributed Transaction Systems.",
                    "Initializing Replicated Name Servers in a Wide Area Network.",
                    "Construction of a Distributed System Supporting Atomic Transactions.",
                    "An Object-Oriented Design Model for Reliable Distributed Systems.",
                    "Primitives for Accessing Protected Objects.",
                    "Issues Process and Communication Structure for Distributed Programs.",
                    "Performance Analysis of Distributed Data Base Systems.",
                    "Reaching Approximate Agreement in the Presence of Faults.",
                    "On the Treatment of Orphans in a Distributed System.",
                    "Cells: An Approach to Design of a Fault-Tolerant Network Operating System.",
                    "The Roe File System.",
                    "On Concurrency and Reliability of a Real-time DBMS for 5ESS Switching System.",
                    "PERPOS Fault-Tolerant Transaction Processing."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "2nd SRDS 1982",
        "info": "Pittsburgh, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1982",
                "sub_name": "Symposium on Reliability in Distributed Software and Database Systems, SRDS 1982, Proceedings. July 1981; Pittsburgh, PA., USA.",
                "count": 1,
                "papers": [
                    "Autitor: A Framework for Highly Available DB/DC Systems."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "1st SRDS 1981",
        "info": "Pittsburgh, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/srds/1981",
                "sub_name": "Symposium on Reliability in Distributed Software and Database Systems, SRDS 1981, Proceedings. 21-22 July, 1981; Pittsburgh, PA., USA.",
                "count": 1,
                "papers": [
                    "Dynamic Crash Recovery of Balanced Trees."
                ]
            }
        ]
    }
]