[
    {
        "name": "TDSC",
        "year": "2022",
        "info": "Volume 19",
        "count": 49,
        "papers": [
            "Verifying and Monitoring IoTs Network Behavior Using MUD Profiles.",
            "LVBS: Lightweight Vehicular Blockchain for Secure Data Sharing in Disaster Rescue.",
            "Self-Stabilizing Secure Computation.",
            "Detecting Sybil Attacks Using Proofs of Work and Location in VANETs.",
            "Design and Analysis of Adaptive Graph-Based Cancelable Multi-Biometrics Approach.",
            "Efficient and Secure Outsourcing of Differentially Private Data Publishing With Multiple Evaluators.",
            "DeepMnemonic: Password Mnemonic Generation via Deep Attentive Encoder-Decoder Model.",
            "Adaptive Secure Nearest Neighbor Query Processing Over Encrypted Data.",
            "Eight Years of Rider Measurement in the Android Malware Ecosystem.",
            "A Blockchain-Based Self-Tallying Voting Protocol in Decentralized IoT.",
            "Towards Incentive for Electrical Vehicles Demand Response With Location Privacy Guaranteeing in Microgrids.",
            "Authenticated Data Redaction With Accountability and Transparency.",
            "LP-SBA-XACML: Lightweight Semantics Based Scheme Enabling Intelligent Behavior-Aware Privacy for IoT.",
            "AbsoluteTrust: Algorithm for Aggregation of Trust in Peer-to-Peer Networks.",
            "Analyzing Security Requirements in Timed Workflow Processes.",
            "Investigating Security Vulnerabilities in a Hot Data Center with Reduced Cooling Redundancy.",
            "On the Validation of Web X.509 Certificates by TLS Interception Products.",
            "Improving the Accuracy of IR-Level Fault Injection.",
            "Using Metrics Suites to Improve the Measurement of Privacy in Graphs.",
            "Secure Video Transmission Framework for Battery-Powered Video Devices.",
            "Characterizing and Exploiting Soft Error Vulnerability Phase Behavior in GPU Applications.",
            "Representing Fine-Grained Co-Occurrences for Behavior-Based Fraud Detection in Online Payment Services.",
            "A Traceable and Revocable Ciphertext-Policy Attribute-based Encryption Scheme Based on Privacy Protection.",
            "Forward and Backward Private DSSE for Range Queries.",
            "Optimal Filter Assignment Policy Against Distributed Denial-of-Service Attack.",
            "A Praise for Defensive Programming: Leveraging Uncertainty for Effective Malware Mitigation.",
            "EAP-DDBA: Efficient Anonymity Proximity Device Discovery and Batch Authentication Mechanism for Massive D2D Communication Devices in 3GPP 5G HetNet.",
            "LS-RQ: A Lightweight and Forward-Secure Range Query on Geographically Encrypted Data.",
            "Inferring and Investigating IoT-Generated Scanning Campaigns Targeting a Large Network Telescope.",
            "TREVERSE: TRial-and-Error Lightweight Secure ReVERSE Authentication With Simulatable PUFs.",
            "CD-VulD: Cross-Domain Vulnerability Discovery Based on Deep Domain Adaptation.",
            "Non-Interactive Multi-Client Searchable Encryption: Realization and Implementation.",
            "On the Performance of Detecting Injection of Fabricated Messages into the CAN Bus.",
            "Verifiable Policy-Defined Networking Using Metagraphs.",
            "On High-Speed Flow-Based Intrusion Detection Using Snort-Compatible Signatures.",
            "Understanding Node Capture Attacks in User Authentication Schemes for Wireless Sensor Networks.",
            "Towards a New Thermal Monitoring Based Framework for Embedded CPS Device Security.",
            "Improved Fast Rerouting Using Postprocessing.",
            "Conan: A Practical Real-Time APT Detection System With High Accuracy and Efficiency.",
            "On-the-Fly Privacy for Location Histograms.",
            "Efficient and Precise Secure Generalized Edit Distance and Beyond.",
            "Achieving Efficient Secure Deduplication With User-Defined Access Control in Cloud.",
            "JNI Global References Are Still Vulnerable: Attacks and Defenses.",
            "Understanding Account Recovery in the Wild and its Security Implications.",
            "Efficient and Secure Attribute-Based Access Control With Identical Sub-Policies Frequently Used in Cloud Storage.",
            "${\\sf PBT}$PBT: A New Privacy-Preserving Payment Protocol for Blockchain Transactions.",
            "Safe is the New Smart: PUF-Based Authentication for Load Modification-Resistant Smart Meters.",
            "Blockchain-Based Certificate Transparency and Revocation Transparency.",
            "Geometric Range Search on Encrypted Data With Forward/Backward Security."
        ]
    },
    {
        "name": "TDSC",
        "year": "2021",
        "info": "Volume 18",
        "count": 205,
        "papers": [
            "Efficient Analysis of Repairable Computing Systems Subject to Scheduled Checkpointing.",
            "Semantics-Aware Privacy Risk Assessment Using Self-Learning Weight Assignment for Mobile Apps.",
            "DNIC Architectural Developments for 0-Knowledge Detection of OPC Malware.",
            "Preventing Overshadowing Attacks in Self-Jamming Audio Channels.",
            "Secure Secret Sharing Enabled b-band Mini Vaults Bio-Cryptosystem for Vectorial Biometrics.",
            "Detecting Adversarial Image Examples in Deep Neural Networks with Adaptive Noise Reduction.",
            "Distributed Attack Detection in a Water Treatment Plant: Method and Case Study.",
            "oGBAC - A Group Based Access Control Framework for Information Sharing in Online Social Networks.",
            "Proxy-Free Privacy-Preserving Task Matching with Efficient Revocation in Crowdsourcing.",
            "Enabling Reliable Keyword Search in Encrypted Decentralized Storage with Fairness.",
            "Accountable Proxy Re-Encryption for Secure Data Sharing.",
            "Stopping Memory Disclosures via Diversification and Replicated Execution.",
            "A Study on the Security Implications of Information Leakages in Container Clouds.",
            "Enabling Privacy-Preserving Shortest Distance Queries on Encrypted Graph Data.",
            "Performance Modeling of Moving Target Defenses with Reconfiguration Limits.",
            "Compact E-Cash with Efficient Coin-Tracing.",
            "Design and Evaluation of a Reconfigurable ECU Architecture for Secure and Dependable Automotive CPS.",
            "Security Model of Authentication at the Physical Layer and Performance Analysis over Fading Channels.",
            "Automatic Privacy and Utility Preservation for Mobility Data: A Nonlinear Model-Based Approach.",
            "Deep Learning and Visualization for Identifying Malware Families.",
            "Detecting Suspicious File Migration or Replication in the Cloud.",
            "Network Attack Surface: Lifting the Concept of Attack Surface to the Network Level for Evaluating Networks' Resilience Against Zero-Day Attacks.",
            "SEQUOIA: A Middleware Supporting Policy-Based Access Control for Search and Aggregation in Data-Driven Applications.",
            "An Empirical Analysis of Hazardous Uses of Android Shared Storage.",
            "Detection and Forensics against Stealthy Data Falsification in Smart Metering Infrastructure.",
            "Leveraging Network Functions Virtualization Orchestrators to Achieve Software-Defined Access Control in the Clouds.",
            "A Privacy-Preserving Framework for Outsourcing Location-Based Services to the Cloud.",
            "An Electronic Voting Scheme Based on Revised-SVRM and Confirmation Numbers.",
            "Towards Smartphone Operating System Identification.",
            "e-PRNU: Encrypted Domain PRNU-Based Camera Attribution for Preserving Privacy.",
            "Data-Driven Spectrum Trading with Secondary Users' Differential Privacy Preservation.",
            "Authenticated Medical Documents Releasing with Privacy Protection and Release Control.",
            "Searchable Symmetric Encryption with Forward Search Privacy.",
            "Manipulative Attack Against Physical Layer Key Agreement and Countermeasure.",
            "Towards Achieving Keyword Search over Dynamic Encrypted Cloud Data with Symmetric-Key Based Verification.",
            "BiMorphing: A Bi-Directional Bursting Defense against Website Fingerprinting Attacks.",
            "A Fake Online Repository Generation Engine for Cyber Deception.",
            "Comparative Analysis and Framework Evaluating Mimicry-Resistant and Invisible Web Authentication Schemes.",
            "Immersive Virtual Reality Attacks and the Human Joystick.",
            "Privacy-Preserving Proof of Storage for the Pay-As-You-Go Business Model.",
            "Real-Time Error Detection in Nonlinear Control Systems Using Machine Learning Assisted State-Space Encoding.",
            "Secure Computing Enclaves Using FPGAs.",
            "Resource-Aware Detection and Defense System against Multi-Type Attacks in the Cloud: Repeated Bayesian Stackelberg Game.",
            "Recovery Algorithms for Paxos-Based State Machine Replication.",
            "An Efficient NIZK Scheme for Privacy-Preserving Transactions Over Account-Model Blockchain.",
            "Looking Back! Using Early Versions of Android Apps as Attack Vectors.",
            "Tool of Spies: Leaking your IP by Altering the 3D Printer Compiler.",
            "Traceable Monero: Anonymous Cryptocurrency with Enhanced Accountability.",
            "Lossless Data Hiding Based on Homomorphic Cryptosystem.",
            "An Integrated Privacy Preserving Attribute-Based Access Control Framework Supporting Secure Deduplication.",
            "PA-CRT: Chinese Remainder Theorem Based Conditional Privacy-Preserving Authentication Scheme in Vehicular Ad-Hoc Networks.",
            "CuRTAIL: ChaRacterizing and Thwarting AdversarIal Deep Learning.",
            "Secure Opportunistic Contextual Logging for Wearable Healthcare Sensing Devices.",
            "Crypt-DAC: Cryptographically Enforced Dynamic Access Control in the Cloud.",
            "Differentially Private Publication of Vertically Partitioned Data.",
            "MADneSs: A Multi-Layer Anomaly Detection Framework for Complex Dynamic Systems.",
            "PSpec-SQL: Enabling Fine-Grained Control for Distributed Data Analytics.",
            "Checking is Believing: Event-Aware Program Anomaly Detection in Cyber-Physical Systems.",
            "STYX: A Hierarchical Key Management System for Elastic Content Delivery Networks on Public Clouds.",
            "Robust and Universal Seamless Handover Authentication in 5G HetNets.",
            "Extracting Randomness from the Trend of IPI for Cryptographic Operations in Implantable Medical Devices.",
            "Privacy-Aware Personal Data Storage (P-PDS): Learning how to Protect User Privacy from External Applications.",
            "Sensitive Label Privacy Preservation with Anatomization for Data Publishing.",
            "Automatic Integer Error Repair by Proper-Type Inference.",
            "Protecting Multi-Level Memories From Jamming Using Q-ary Expurgated Robust Codes.",
            "How Much I Can Rely on You: Measuring Trustworthiness of a Twitter User.",
            "Mobile Crowdsourcing Task Allocation with Differential-and-Distortion Geo-Obfuscation.",
            "Locally Differentially Private Heavy Hitter Identification.",
            "Trust Assessment in Online Social Networks.",
            "Towards Thwarting Template Side-Channel Attacks in Secure Cloud Deduplications.",
            "FS-PEKS: Lattice-Based Forward Secure Public-Key Encryption with Keyword Search for Cloud-Assisted Industrial Internet of Things.",
            "Dating with Scambots: Understanding the Ecosystem of Fraudulent Dating Applications.",
            "Collusion Defender: Preserving Subscribers' Privacy in Publish and Subscribe Systems.",
            "On Evaluating Fault Resilient Encoding Schemes in Software.",
            "Privacy-Preserving Attribute-Based Keyword Search in Shared Multi-owner Setting.",
            "PrivHome: Privacy-Preserving Authenticated Communication in Smart Home Environment.",
            "The Feasibility of Injecting Inaudible Voice Commands to Voice Assistants.",
            "DSEOM: A Framework for Dynamic Security Evaluation and Optimization of MTD in Container-Based Cloud.",
            "Secure Halftone Image Steganography Based on Pixel Density Transition.",
            "IDEA: Intrusion Detection through Electromagnetic-Signal Analysis for Critical Embedded and Cyber-Physical Systems.",
            "A Machine Learning-Based Intrusion Detection System for Securing Remote Desktop Connections to Electronic Flight Bag Servers.",
            "CPPHA: Capability-Based Privacy-Protection Handover Authentication Mechanism for SDN-Based 5G HetNets.",
            "Mimosa: Protecting Private Keys Against Memory Disclosure Attacks Using Hardware Transactional Memory.",
            "Revocable Identity-Based Broadcast Proxy Re-Encryption for Data Sharing in Clouds.",
            "Sonification to Support the Monitoring Tasks of Security Operations Centres.",
            "Reliable and Privacy-Preserving Truth Discovery for Mobile Crowdsensing Systems.",
            "Denoising in the Dark: Privacy-Preserving Deep Neural Network-Based Image Denoising.",
            "Design of Secure Authenticated Key Management Protocol for Cloud Computing Environments.",
            "Efficient and Privacy-Preserving Ridesharing Organization for Transferable and Non-Transferable Services.",
            "Secure Fine-Grained Encrypted Keyword Search for E-Healthcare Cloud.",
            "Adaptive Video Data Hiding through Cost Assignment and STCs.",
            "A Key for John Doe: Modeling and Designing Anonymous Password-Authenticated Key Exchange Protocols.",
            "Towards Private and Scalable Cross-Media Retrieval.",
            "KALD: Detecting Direct Pointer Disclosure Vulnerabilities.",
            "$\\sf {DBank}$DBank: Predictive Behavioral Analysis of Recent Android Banking Trojans.",
            "Dynamic Group-Oriented Provable Data Possession in the Cloud.",
            "S2Net: Preserving Privacy in Smart Home Routers.",
            "PSRide: Privacy-Preserving Shared Ride Matching for Online Ride Hailing Systems.",
            "A Lightweight Privacy-Preserving CNN Feature Extraction Framework for Mobile Sensing.",
            "Person Re-Identification over Encrypted Outsourced Surveillance Videos.",
            "Invisible Adversarial Attack against Deep Neural Networks: An Adaptive Penalization Approach.",
            "Trace-Length Independent Runtime Monitoring of Quantitative Policies.",
            "Guest Editors' Introduction to the Joint Special Section on Secure and Emerging Collaborative Computing and Intelligent Systems.",
            "Robust Deep Learning Ensemble Against Deception.",
            "An Optimal Noise Mechanism for Cross-Correlated IoT Data Releasing.",
            "Differentially Private $k$k-Means Clustering With Convergence Guarantee.",
            "VMGuard: State-Based Proactive Verification of Virtual Network Isolation With Application to NFV.",
            "Quantify Co-Residency Risks in the Cloud Through Deep Learning.",
            "Fee-Free Pooled Mining for Countering Pool-Hopping Attack in Blockchain.",
            "Sustainable Ensemble Learning Driving Intrusion Detection Model.",
            "Stochastic Workflow Authorizations With Queueing Constraints.",
            "Updatable Block-Level Message-Locked Encryption.",
            "Efficient and Secure Decision Tree Classification for Cloud-Assisted Online Diagnosis Services.",
            "Privacy-Preserving Secret Shared Computations Using MapReduce.",
            "Multi-Authority Attribute-Based Keyword Search over Encrypted Cloud Data.",
            "SOS: Standard-Compliant and Packet Loss Tolerant Security Framework for ADS-B Communications.",
            "SecuCode: Intrinsic PUF Entangled Secure Wireless Code Dissemination for Computational RFID Devices.",
            "Fault-Tolerant Real-Time Fair Scheduling on Multiprocessor Systems with Cold-Standby.",
            "Vulnerable Service Invocation and Countermeasures.",
            "DPC: A Dynamic Permission Control Mechanism for Android Third-Party Libraries.",
            "PPSB: An Open and Flexible Platform for Privacy-Preserving Safe Browsing.",
            "Sais: Self-Adaptive Identification of Security Bug Reports.",
            "A Mixing Scheme Using a Decentralized Signature Protocol for Privacy Protection in Bitcoin Blockchain.",
            "Optimized Verifiable Fine-Grained Keyword Search in Dynamic Multi-Owner Settings.",
            "Blindfolded Evaluation of Random Forests with Multi-Key Homomorphic Encryption.",
            "Privacy-Preserving Electronic Ticket Scheme with Attribute-Based Credentials.",
            "Towards Low-Cost Mechanisms to Enable Restoration of Encrypted Non-Volatile Memories.",
            "Survivability Analysis of K-Variant Architecture for Different Memory Attacks and Defense Strategies.",
            "An Accurate Negative Survey Using Answer Confidence Level.",
            "Towards Private, Robust, and Verifiable Crowdsensing Systems via Public Blockchains.",
            "Cryptographic Design of PriCloud, a Privacy-Preserving Decentralized Storage with Remuneration.",
            "A Coprocessor-Based Introspection Framework Via Intel Management Engine.",
            "Adversarial Examples versus Cloud-Based Detectors: A Black-Box Empirical Study.",
            "Side Channel Attacks on GPUs.",
            "Security of Streaming Media Communications with Logistic Map and Self-Adaptive Detection-Based Steganography.",
            "ZeroKernel: Secure Context-Isolated Execution on Commodity GPUs.",
            "CATTmew: Defeating Software-Only Physical Kernel Isolation.",
            "Fully Accountable Data Sharing for Pay-as-You-Go Cloud Scenes.",
            "Scaling Camouflage: Content Disguising Attack Against Computer Vision Applications.",
            "Shielding Collaborative Learning: Mitigating Poisoning Attacks Through Client-Side Detection.",
            "Website Fingerprinting Through the Cache Occupancy Channel and its Real World Practicality.",
            "Robust Transparency Against Model Inversion Attacks.",
            "Invisible Backdoor Attacks on Deep Neural Networks Via Steganography and Regularization.",
            "Image Transformation-Based Defense Against Adversarial Perturbation on Deep Learning Models.",
            "LAW: Learning Automatic Windows for Online Payment Fraud Detection.",
            "Anomaly Detection in Operating System Logs with Deep Learning-Based Sentiment Analysis.",
            "Towards Learning-Based, Content-Agnostic Detection of Social Bot Traffic.",
            "Timely Detection and Mitigation of Stealthy DDoS Attacks Via IoT Networks.",
            "Enhancing Robustness of On-Line Learning Models on Highly Noisy Data.",
            "DatingSec: Detecting Malicious Accounts in Dating Apps Using a Content-Based Attention Network.",
            "\"Seeing is Not Always Believing\": Detecting Perception Error Attacks Against Autonomous Vehicles.",
            "$\\mu$μVulDeePecker: A Deep Learning-Based System for Multiclass Vulnerability Detection.",
            "On the Analysis of Byte-Granularity Heap Randomization.",
            "PVOPM: Verifiable Privacy-Preserving Pattern Matching with Efficient Outsourcing in the Malicious Setting.",
            "A Distributed Flow Correlation Attack to Anonymizing Overlay Networks Based on Wavelet Multi-Resolution Analysis.",
            "Low-High Burst: A Double Potency Varying-RTT Based Full-Buffer Shrew Attack Model.",
            "RS-HABE: Revocable-Storage and Hierarchical Attribute-Based Access Scheme for Secure Sharing of e-Health Records in Public Cloud.",
            "Architectures for Detecting Interleaved Multi-Stage Network Attacks Using Hidden Markov Models.",
            "ObliComm: Towards Building an Efficient Oblivious Communication System.",
            "Cree: A Performant Tool for Safety Analysis of Administrative Temporal Role-Based Access Control (ATRBAC) Policies.",
            "Secure and Utility-Aware Data Collection with Condensed Local Differential Privacy.",
            "Blockchain-Based Private Provable Data Possession.",
            "Understanding Illicit UI in iOS Apps Through Hidden UI Analysis.",
            "Far Proximity Identification in Wireless Systems.",
            "Multi-Client Cloud-Based Symmetric Searchable Encryption.",
            "DeepChain: Auditable and Privacy-Preserving Deep Learning with Blockchain-Based Incentive.",
            "Security-Aware Data Allocation in Multicloud Scenarios.",
            "Software Vulnerability Discovery via Learning Multi-Domain Knowledge Bases.",
            "SegGuard: Segmentation-Based Anonymization of Network Data in Clouds for Privacy-Preserving Security Auditing.",
            "General Confidentiality and Utility Metrics for Privacy-Preserving Data Publishing Based on the Permutation Model.",
            "On the Security of Privacy-Preserving Attribute-Based Keyword Search in Shared Multi-Owner Setting.",
            "Man-in-the-Middle Attacks Against Machine Learning Classifiers Via Malicious Generative Models.",
            "DiLSe: Lattice-Based Secure and Dependable Data Dissemination Scheme for Social Internet of Vehicles.",
            "A Fine-Grained Approach for Anomaly Detection in File System Accesses With Enhanced Temporal User Profiles.",
            "GUI-Squatting Attack: Automated Generation of Android Phishing Apps.",
            "Augmenting Encrypted Search: A Decentralized Service Realization with Enforced Execution.",
            "Resilient User-Side Android Application Repackaging and Tampering Detection Using Cryptographically Obfuscated Logic Bombs.",
            "Building a Secure Knowledge Marketplace Over Crowdsensed Data Streams.",
            "Measurement Integrity Attacks Against Network Tomography: Feasibility and Defense.",
            "Speech Sanitizer: Speech Content Desensitization and Voice Anonymization.",
            "VTDP: Privately Sanitizing Fine-Grained Vehicle Trajectory Data With Boosted Utility.",
            "P-Gaussian: Provenance-Based Gaussian Distribution for Detecting Intrusion Behavior Variants Using High Efficient and Real Time Memory Databases.",
            "DeepFuzzer: Accelerated Deep Greybox Fuzzing.",
            "Run-Time Monitoring and Validation Using Reverse Function (RMVRF) for Hardware Trojans Detection.",
            "A Smart Framework for Fine-Grained Microphone Acoustic Permission Management.",
            "OB-WSPES: A Uniform Evaluation System for Obfuscation-Based Web Search Privacy.",
            "Adaptive Steganalysis Based on Statistical Model of Quantized DCT Coefficients for JPEG Images.",
            "IoVCom: Reliable Comprehensive Communication System for Internet of Vehicles.",
            "DDoS Attacks on 9-1-1 Emergency Services.",
            "Secure Keyword Search and Data Sharing Mechanism for Cloud Computing.",
            "Lucene-P$^2$2: A Distributed Platform for Privacy-Preserving Text-Based Search.",
            "Efficient Server-Aided Secure Two-Party Computation in Heterogeneous Mobile Cloud Computing.",
            "Leakage-Resilient Authenticated Key Exchange for Edge Artificial Intelligence.",
            "Detection and Defense of Cache Pollution Based on Popularity Prediction in Named Data Networking.",
            "Efficient Private Comparison Queries Over Encrypted Databases Using Fully Homomorphic Encryption With Finite Fields.",
            "Multi-Client Sub-Linear Boolean Keyword Searching for Encrypted Cloud Storage with Owner-Enforced Authorization.",
            "Novel Protocols to Mitigate Network Slice Topology Learning Attacks and Protect Privacy of Users' Service Access Behavior in Softwarized 5G Networks.",
            "Taming the Contention in Consensus-Based Distributed Systems.",
            "A Formal Approach to Accountability in Heterogeneous Systems-on-Chip.",
            "ASBKS: Towards Attribute Set Based Keyword Search Over Encrypted Personal Health Records.",
            "A Security Analysis of Captchas With Large Character Sets.",
            "NPMML: A Framework for Non-Interactive Privacy-Preserving Multi-Party Machine Learning.",
            "Structured Sparsity Model Based Trajectory Tracking Using Private Location Data Release.",
            "Liveness Detection for Voice User Interface via Wireless Signals in IoT Environment.",
            "Man-in-the-Middle Attack on Contactless Payment over NFC Communications: Design, Implementation, Experiments and Detection."
        ]
    },
    {
        "name": "TDSC",
        "year": "2020",
        "info": "Volume 17",
        "count": 98,
        "papers": [
            "Editorial.",
            "A Logical Key Hierarchy Based Approach to Preserve Content Privacy in Decentralized Online Social Networks.",
            "A Security Analysis and Revised Security Extension for the Precision Time Protocol.",
            "Adaptive Compiler Strategies for Mitigating Timing Side Channel Attacks.",
            "Challenge-Response Authentication Using In-Air Handwriting Style Verification.",
            "Detection of Repackaged Android Malware with Code-Heterogeneity Features.",
            "Lightweight Sharable and Traceable Secure Mobile Health System.",
            "Markov Regenerative Models of WebServers for Their User-Perceived Availability and Bottlenecks.",
            "Message Integrity Protection Over Wireless Channel: Countering Signal Cancellation via Channel Randomization.",
            "Privacy-Aware and Efficient Mobile Crowdsensing with Truth Discovery.",
            "Real-Time Multistep Attack Prediction Based on Hidden Markov Models.",
            "Rollback Mechanisms for Cloud Management APIs Using AI Planning.",
            "Secure Inter-Domain Forwarding Loop Test in Software Defined Networks.",
            "Secure outsourcing SIFT: Efficient and Privacy-Preserving Image Feature Extraction in the Encrypted Domain.",
            "Sensitivity Analysis for Non-Interactive Differential Privacy: Bounds and Efficient Algorithms.",
            "TaintMan: An ART-Compatible Dynamic Taint Analysis Framework on Unmodified and Non-Rooted Android Devices.",
            "Authenticated Outlier Mining for Outsourced Databases.",
            "Bilateral Privacy-Preserving Utility Maximization Protocol in Database-Driven Cognitive Radio Networks.",
            "Cross-Rack-Aware Single Failure Recovery for Clustered File Systems.",
            "EC2: Ensemble Clustering and Classification for Predicting Android Malware Families.",
            "Exploiting Dissent: Towards Fuzzing-Based Differential Black-Box Testing of TLS Implementations.",
            "Group Signatures with Time-Bound Keys Revisited: A New Model, an Efficient Construction, and its Implementation.",
            "I Sense You by Breath: Speaker Recognition via Breath Biometrics.",
            "Multi-User Multi-Keyword Rank Search Over Encrypted Data in Arbitrary Language.",
            "Pattern-Growth Based Mining Mouse-Interaction Behavior for an Active User Authentication System.",
            "Privacy Leakage via De-Anonymization and Aggregation in Heterogeneous Social Networks.",
            "Privacy-Preserving Data Processing with Flexible Access Control.",
            "Secure Dependency Enforcement in Package Management Systems.",
            "Secure Remote User Authenticated Key Establishment Protocol for Smart Home Environment.",
            "senDroid: Auditing Sensor Access in Android System-Wide.",
            "The Overhead from Combating Side-Channels in Cloud Systems Using VM-Scheduling.",
            "Connecting the Dots: Privacy Leakage via Write-Access Patterns to the Main Memory.",
            "Known Sample Attacks on Relation Preserving Data Transformations.",
            "Impact of Stealthy Attacks on Optimal Power Flow: A Simulink-Driven Formal Analysis.",
            "Safety Decidability for Pre-Authorization Usage Control with Identifier Attribute Domains.",
            "AdCapsule: Practical Confinement of Advertisements in Android Applications.",
            "Impact of Failure Prediction on Availability: Modeling and Comparative Analysis of Predictive and Reactive Methods.",
            "Automatic Extraction of Access Control Policies from Natural Language Documents.",
            "High-Performance Memory Snapshotting for Real-Time, Consistent, Hypervisor-Based Monitors.",
            "Four$\\mathbb {Q}$Q on Embedded Devices with Strong Countermeasures Against Side-Channel Attacks.",
            "BVPSMS: A Batch Verification Protocol for End-to-End Secure SMS for Mobile Users.",
            "Distributed Group Key Management for Event Notification Confidentiality Among Sensors.",
            "Providing Task Allocation and Secure Deduplication for Mobile Crowdsensing via Fog Computing.",
            "Privacy Protection in Interactive Content Based Image Retrieval.",
            "Enabling Efficient User Revocation in Identity-Based Cloud Storage Auditing for Shared Big Data.",
            "EnsembleHMD: Accurate Hardware Malware Detectors with Specialized Ensemble Classifiers.",
            "Privacy-Preserving Cloud Establishment and Data Dissemination Scheme for Vehicular Cloud.",
            "A Data-Driven Study of DDoS Attacks and Their Dynamics.",
            "Anonymity Services Tor, I2P, JonDonym: Classifying in the Dark (Web).",
            "Securely Connecting Wearables to Ambient Displays with User Intent.",
            "Clock Auction Inspired Privacy Preserving Emergency Demand Response in Colocation Data Centers.",
            "ASAP: An Anonymous Smart-Parking and Payment Scheme in Vehicular Networks.",
            "Applying Chaos Theory for Runtime Hardware Trojan Monitoring and Detection.",
            "Large Scale Characterization of Software Vulnerability Life Cycles.",
            "Look-Aside at Your Own Risk: Privacy Implications of DNSSEC Look-Aside Validation.",
            "Misbehavior in Multi-Channel MAC Protocols.",
            "Exploiting an HMAC-SHA-1 Optimization to Speed up PBKDF2.",
            "Reliability Equations for Cloud Storage Systems with Proactive Fault Tolerance.",
            "Randomized Security Patrolling for Link Flooding Attack Detection.",
            "Design and Analysis of Secure and Dependable Automotive CPS: A Steer-by-Wire Case Study.",
            "Key Based Artificial Fingerprint Generation for Privacy Protection.",
            "$\\Delta$ΔBreakpad: Diversified Binary Crash Reporting.",
            "Privacy-Preserving Tensor Decomposition Over Encrypted Data in a Federated Cloud Environment.",
            "MARP: A Distributed MAC Layer Attack Resistant Pseudonym Scheme for VANET.",
            "CAFE: A Virtualization-Based Approach to Protecting Sensitive Cloud Application Logic Confidentiality.",
            "Privacy-Preserving Outsourced Calculation Toolkit in the Cloud.",
            "Forward Private Searchable Symmetric Encryption with Optimized I/O Efficiency.",
            "Adaptive Performance Anomaly Detection in Distributed Systems Using Online SVMs.",
            "Cloud Centric Authentication for Wearable Healthcare Monitoring System.",
            "Learning with Physical Noise or Errors.",
            "Privacy-Preserving Location-Based Services Query Scheme Against Quantum Attacks.",
            "Multi-CDN: Towards Privacy in Content Delivery Networks.",
            "Retrofitting the Partially Privileged Mode for TEE Communication Channel Protection.",
            "Energy-Efficient Superconductor Bloom Filters for Streaming Data Inspection.",
            "Efficient Fine-Grained Data Sharing Mechanism for Electronic Medical Record Systems with Mobile Devices.",
            "The Cost of Scaling a Reliable Interconnection Topology.",
            "Service Outsourcing in F2C Architecture with Attribute-based Anonymous Access Control and Bounded Service Number.",
            "Understanding JavaScript Vulnerabilities in Large Real-World Android Applications.",
            "Physical Layer based Message Authentication with Secure Channel Codes.",
            "CPU Elasticity to Mitigate Cross-VM Runtime Monitoring.",
            "Releasing Correlated Trajectories: Towards High Utility and Optimal Differential Privacy.",
            "Secure and Efficient Two-Party Signing Protocol for the Identity-Based Signature Scheme in the IEEE P1363 Standard for Public Key Cryptography.",
            "Anonymous Lightweight Chaotic Map-Based Authenticated Key Agreement Protocol for Industrial Internet of Things.",
            "Explicit Modelling and Treatment of Repair in Prediction of Dependability.",
            "A Risk Management Approach to Defending Against the Advanced Persistent Threat.",
            "Disclose More and Risk Less: Privacy Preserving Online Social Network Data Sharing.",
            "Sparse Matrix Masking-Based Non-Interactive Verifiable (Outsourced) Computation, Revisited.",
            "Attribute-Based Hybrid Boolean Keyword Search over Outsourced Encrypted Data.",
            "You Can Access but You Cannot Leak: Defending Against Illegal Content Redistribution in Encrypted Cloud Media Center.",
            "Design, Analysis and Application of Embedded Resistive RAM Based Strong Arbiter PUF.",
            "Benchmarking the Capability of Symbolic Execution Tools with Logic Bombs.",
            "A Bayesian Game Theoretic Approach for Inspecting Web-Based Malvertising.",
            "Lattice-Based Public Key Searchable Encryption from Experimental Perspectives.",
            "Pagoda: A Hybrid Approach to Enable Efficient Real-Time Provenance Based Intrusion Detection in Big Data Environments.",
            "Precision-Enhanced Differentially-Private Mining of High-Confidence Association Rules.",
            "Detection and Defense of Cache Pollution Attacks Using Clustering in Named Data Networks.",
            "Multi-User Verifiable Searchable Symmetric Encryption for Cloud Storage.",
            "The Authorization Policy Existence Problem."
        ]
    },
    {
        "name": "TDSC",
        "year": "2019",
        "info": "Volume 16",
        "count": 84,
        "papers": [
            "Editorial.",
            "AccConF: An Access Control Framework for Leveraging In-Network Cached Data in the ICN-Enabled Wireless Edge.",
            "Advancing the State-of-the-Art in Hardware Trojans Detection.",
            "Cryptographic Solutions for Credibility and Liability Issues of Genomic Data.",
            "Design and Implementation of SecPod, A Framework for Virtualization-Based Security Systems.",
            "Evolving Bipartite Authentication Graph Partitions.",
            "Fuzzy Identity-Based Data Integrity Auditing for Reliable Cloud Storage Systems.",
            "G-SIR: An Insider Attack Resilient Geo-Social Access Control Framework.",
            "Leveraging Compression-Based Graph Mining for Behavior-Based Malware Detection.",
            "PersonaIA: A Lightweight Implicit Authentication System Based on Customized User Behavior Selection.",
            "Refinement-Based Specification and Security Analysis of Separation Kernels.",
            "SADI: A Novel Model to Study the Propagation of Social Worms in Hierarchical Networks.",
            "Secure and Efficient Initialization and Authentication Protocols for SHIELD.",
            "Stochastic Model Checking for Predicting Component Failures and Service Availability.",
            "Defending Against Web Application Attacks: Approaches, Challenges and Implications.",
            "Design and Implementation of the Ascend Secure Processor.",
            "Efficient and Private Scoring of Decision Trees, Support Vector Machines and Logistic Regression Models Based on Pre-Computation.",
            "Exact Inference Techniques for the Analysis of Bayesian Attack Graphs.",
            "FastGeo: Efficient Geometric Range Queries on Encrypted Spatial Data.",
            "Fault-Tolerant Adaptive Routing in Dragonfly Networks.",
            "Investigating the Multi-Ciphersuite and Backwards-Compatibility Security of the Upcoming TLS 1.3.",
            "KI-Mon ARM: A Hardware-Assisted Event-triggered Monitoring Platform for Mutable Kernel Object.",
            "Optimal Spot-Checking for Collusion Tolerance in Computer Grids.",
            "Privacy-Aware Caching in Information-Centric Networking.",
            "Privacy-Preserving Aggregate Queries for Optimal Location Selection.",
            "Privacy-Preserving Multi-Keyword Top-$k$ k Similarity Search Over Encrypted Data.",
            "Security Pricing as Enabler of Cyber-Insurance A First Look at Differentiated Pricing Markets.",
            "Emerging Attacks and Solutions for Secure Hardware in the Internet of Things.",
            "A Highly Efficient Side Channel Attack with Profiling through Relevance-Learning on Physical Leakage Information.",
            "A Secure Exception Mode for Fault-Attack-Resistant Processing.",
            "A Silicon PUF Based Entropy Pump.",
            "Atlas: Application Confidentiality in Compromised Embedded Systems.",
            "Building PUF Based Authentication and Key Exchange Protocol for IoT Without Explicit CRPs in Verifier Database.",
            "Building a Trustworthy Execution Environment to Defeat Exploits from both Cyber Space and Physical Space for ARM.",
            "Ciphertext-Only Fault Analysis on the LED Lightweight Cryptosystem in the Internet of Things.",
            "Decay-Based DRAM PUFs in Commodity Devices.",
            "Detecting Fault Injection Attacks Based on Compressed Sensing and Integer Linear Programming.",
            "GaitLock: Protect Virtual and Augmented Reality Headsets Using Gait.",
            "HAL - The Missing Piece of the Puzzle for Hardware Reverse Engineering, Trojan Detection and Insertion.",
            "High Rate Robust Codes with Low Implementation Complexity.",
            "Memory-Efficient Implementation of Elliptic Curve Cryptography for the Internet-of-Things.",
            "Noisy Vibrational Pairing of IoT Devices.",
            "A Markov Random Field Framework for Modeling Malware Propagation in Complex Communications Networks.",
            "A Scalable Approach to Joint Cyber Insurance and Security-as-a-Service Provisioning in Cloud Computing.",
            "Anonymization of Sensitive Quasi-Identifiers for l-Diversity and t-Closeness.",
            "De-SAG: On the De-Anonymization of Structure-Attribute Graph Data.",
            "Efficient Delegated Private Set Intersection on Outsourced Private Datasets.",
            "Efficient Multi-Factor Authenticated Key Exchange Scheme for Mobile Communications.",
            "RACOON++: A Semi-Automatic Framework for the Selfishness-Aware Design of Cooperative Systems.",
            "RAW-Tag: Replicating in Altered Cache Ways for Correcting Multiple-Bit Errors in Tag Array.",
            "Reducing Timing Side-Channel Information Leakage Using 3D Integration.",
            "Social Network De-Anonymization and Privacy Inference with Knowledge Graph Model.",
            "Wormhole: The Hidden Virus Propagation Power of the Search Engine in Social Networks.",
            "Yes, Machine Learning Can Be More Secure! A Case Study on Android Malware Detection.",
            "On the Security of a Variant of ElGamal Encryption Scheme.",
            "Paradigm Shifts in Cryptographic Engineering.",
            "Another Look at Anonymous Communication.",
            "Private Compound Wildcard Queries Using Fully Homomorphic Encryption.",
            "Generation of Secure and Reliable Honeywords, Preventing False Detection.",
            "Building and Studying a Password Store that Perfectly Hides Passwords from Itself.",
            "Robust Fuzzy Extractors and Helper Data Manipulation Attacks Revisited: Theory versus Practice.",
            "It is All in the System's Parameters: Privacy and Security Issues in Transforming Biometric Raw Data into Binary Strings.",
            "Strong Stationary Times and its use in Cryptography.",
            "A Privacy Mechanism for Access Controlled Graph Data.",
            "AP-PRE: Autonomous Path Proxy Re-Encryption and Its Applications.",
            "Efficient Nonprofiling 2nd-Order Power Analysis on Masked Devices Utilizing Multiple Leakage Points.",
            "Empirical Analysis and Validation of Security Alerts Filtering Techniques.",
            "Privacy-Preserving Fine-Grained Data Retrieval Schemes for Mobile Social Networks.",
            "SμV - The Security MicroVisor: A Formally-Verified Software-Based Security Architecture for the Internet of Things.",
            "Supersingular Isogeny Diffie-Hellman Key Exchange on 64-Bit ARM.",
            "Guest Editors' Introduction: Special Section on Security in Emerging Networking Technologies.",
            "Dynamic Packet Forwarding Verification in SDN.",
            "SDN-Based Privacy Preserving Cross Domain Routing.",
            "Detecting and Mitigating Target Link-Flooding Attacks Using SDN.",
            "Dependability Integration in Cloud-hosted Telecommunication Services.",
            "A Novel Security Protocol Attack Detection Logic with Unique Fault Discovery Capability for Freshness Attacks and Interleaving Session Attacks.",
            "An Immunization Framework for Social Networks Through Big Data Based Influence Modeling.",
            "Block Design-Based Key Agreement for Group Data Sharing in Cloud Computing.",
            "Brew: A Security Policy Analysis Framework for Distributed SDN-Based Cloud Environments.",
            "Di-PriDA: Differentially Private Distributed Load Balancing Control for the Smart Grid.",
            "Emerging-Image Motion CAPTCHAs: Vulnerabilities of Existing Designs, and Countermeasures.",
            "F-PAD: Private Attribute Disclosure Risk Estimation in Online Social Networks.",
            "Multitenant Access Control for Cloud-Aware Distributed Filesystems.",
            "Relating Extra Connectivity and Extra Conditional Diagnosability in Regular Networks."
        ]
    },
    {
        "name": "TDSC",
        "year": "2018",
        "info": "Volume 15",
        "count": 84,
        "papers": [
            "Editorial.",
            "A Systems Theoretic Approach to the Security Threats in Cyber Physical Systems Applied to Stuxnet.",
            "Anonymity Leakage in Private VoIP Networks.",
            "Efficient and Privacy-Preserving Outsourced Calculation of Rational Numbers.",
            "Faultprog: Testing the Accuracy of Binary-Level Software Fault Injection.",
            "GeTrust: A Guarantee-Based Trust Model in Chord-Based P2P Networks.",
            "Immutable Authentication and Integrity Schemes for Outsourced Databases.",
            "MADAM: Effective and Efficient Behavior-based Android Malware Detection and Prevention.",
            "Magic Train: Design of Measurement Methods against Bandwidth Inflation Attacks.",
            "Negative Iris Recognition.",
            "Performability Analysis of k-to-l-Out-of-n Computing Systems Using Binary Decision Diagrams.",
            "Performability Modeling for RAID Storage Systems by Markov Regenerative Process.",
            "PROVEST: Provenance-Based Trust Model for Delay Tolerant Networks.",
            "Rumor Source Identification in Social Networks with Time-Varying Topology.",
            "A Shoulder Surfing Resistant Graphical Authentication System.",
            "Attribute-based Access Control for ICN Naming Scheme.",
            "Conditional Diagnosability of (n, k)-Star Graphs Under the PMC Model.",
            "Efficient Anonymous Message Submission.",
            "Empirical Study of Face Authentication Systems Under OSNFD Attacks.",
            "Knowledge Connectivity Requirements for Solving Byzantine Consensus with Unknown Participants.",
            "PDA: Semantically Secure Time-Series Data Analytics with Dynamic User Groups.",
            "Physical Attestation in the Smart Grid for Distributed State Verification.",
            "Randomness Tests in Hostile Environments.",
            "Risk Assessment in Social Networks Based on User Anomalous Behaviors.",
            "Shadow Attacks Based on Password Reuses: A Quantitative Empirical Analysis.",
            "Towards Transparent Debugging.",
            "Understanding Practical Tradeoffs in HPC Checkpoint-Scheduling Policies.",
            "Conditional (t, k)-Diagnosis in Regular and Irregular Graphs Under the Comparison Diagnosis Model.",
            "On the Efficiency of FHE-Based Private Queries.",
            "CSC-Detector: A System to Infer Large-Scale Probing Campaigns.",
            "D2FL: Design and Implementation of Distributed Dynamic Fault Localization.",
            "Design, Analysis, and Implementation of ARPKI: An Attack-Resilient Public-Key Infrastructure.",
            "Efficient and Expressive Keyword Search Over Encrypted Data in Cloud.",
            "End-to-End Detection of Caller ID Spoofing Attacks.",
            "Flexible Hardware-Managed Isolated Execution: Architecture, Software Support and Applications.",
            "Locating Faults in MANET-Hosted Software Systems.",
            "On the Interplay Between Cyber and Physical Spaces for Adaptive Security.",
            "Rmind: A Tool for Cryptographically Secure Statistical Analysis.",
            "Searchable Encryption over Feature-Rich Data.",
            "SieveQ: A Layered BFT Protection System for Critical Services.",
            "Symbolic Synthesis of Timed Models with Strict 2-Phase Fault Recovery.",
            "The g-Good-Neighbor Conditional Diagnosability of Arrangement Graphs.",
            "Guest Editor's Introduction to the Special Section on Social Network Security.",
            "Segregating Spammers and Unsolicited Bloggers from Genuine Experts on Twitter.",
            "Social Fingerprinting: Detection of Spambot Groups Through DNA-Inspired Behavioral Modeling.",
            "Collective Data-Sanitization for Preventing Sensitive Information Inference Attacks in Social Networks.",
            "Real-Time and Spatio-Temporal Crowd-Sourced Social Network Data Publishing with Differential Privacy.",
            "Exploiting Social Network to Enhance Human-to-Human Infection Analysis without Privacy Leakage.",
            "Using Screen Brightness to Improve Security in Mobile Social Network Access.",
            "A Provably-Secure Cross-Domain Handshake Scheme with Symptoms-Matching for Mobile Healthcare Social Network.",
            "Privacy Leakage of Location Sharing in Mobile Social Networks: Attacks and Defense.",
            "A Credibility Analysis System for Assessing Information on Twitter.",
            "ARF-Predictor: Effective Prediction of Aging-Related Failure Using Entropy.",
            "Enhanced Secure Thresholded Data Deduplication Scheme for Cloud Storage.",
            "Two Birds with One Stone: Two-Factor Authentication with Security Beyond Conventional Bound.",
            "Crashing Modulus Attack on Modular Squaring for Rabin Cryptosystem.",
            "Architecture Design of an Area Efficient High Speed Crypto Processor for 4G LTE.",
            "Copker: A Cryptographic Engine Against Cold-Boot Attacks.",
            "Dynamic Optimal Countermeasure Selection for Intrusion Response System.",
            "LARGen: Automatic Signature Generation for Malwares Using Latent Dirichlet Allocation.",
            "Privacy-Preserving Friendship-Based Recommender Systems.",
            "PrivateZone: Providing a Private Execution Environment Using ARM TrustZone.",
            "R2C: Robust Rolling-Upgrade in Clouds.",
            "Secure Biometric-Based Authentication Scheme Using Chebyshev Chaotic Map for Multi-Server Environment.",
            "Security and Privacy in Decentralized Energy Trading Through Multi-Signatures, Blockchain and Anonymous Messaging Streams.",
            "Signal Entanglement Based Pinpoint Waveforming for Location-Restricted Service Access Control.",
            "Towards Privacy-Preserving and Practical Image-Centric Social Discovery.",
            "White-Box Traceable CP-ABE for Cloud Storage Service: How to Catch People Leaking Their Access Credentials Effectively.",
            "Hardware Architecture Implemented on FPGA for Protecting Cryptographic Keys against Side-Channel Attacks.",
            "On the Soundness and Security of Privacy-Preserving SVM for Outsourcing Data Classification.",
            "Guest Editors' Introduction: Special Issue on Data-Driven Dependability and Security.",
            "Resiliency of HPC Interconnects: A Case Study of Interconnect Failures and Recovery in Blue Waters.",
            "Towards Automated Log Parsing for Large-Scale Log Data Analysis.",
            "How to Fillet a Penguin: Runtime Data Driven Partitioning of Linux Code.",
            "Scale Inside-Out: Rapid Mitigation of Cloud DDoS Attacks.",
            "A System Architecture for the Detection of Insider Attacks in Big Data Systems.",
            "Learning from the Ones that Got Away: Detecting New Forms of Phishing Attacks.",
            "Can the Common Vulnerability Scoring System be Trusted? A Bayesian Analysis.",
            "Malware Propagations in Wireless Ad Hoc Networks.",
            "Search Ranges Efficiently and Compatibly as Keywords over Encrypted Data.",
            "SEDA: Secure Over-the-Air Code Dissemination Protocol for the Internet of Things.",
            "Separable Reversible Data Hiding in Encrypted JPEG Bitstreams.",
            "The Rise of Social Botnets: Attacks and Countermeasures.",
            "VPSearch: Achieving Verifiability for Privacy-Preserving Multi-Keyword Search over Encrypted Cloud Data."
        ]
    },
    {
        "name": "TDSC",
        "year": "2017",
        "info": "Volume 14",
        "count": 55,
        "papers": [
            "The State of the Journal Editorial.",
            "An Efficient Lattice Based Multi-Stage Secret Sharing Scheme.",
            "Efficient and Privacy-Preserving Min and kth Min Computations in Mobile Sensing Systems.",
            "Generic Soft-Error Detection and Correction for Concurrent Data Structures.",
            "High Performance and High Scalable Packet Classification Algorithm for Network Security Systems.",
            "Robustness-Driven Resilience Evaluation of Self-Adaptive Software Systems.",
            "Trapdoor Computational Fuzzy Extractors and Stateless Cryptographically-Secure Physical Unclonable Functions.",
            "Universally Composable RFID Mutual Authentication.",
            "Using Virtual Machine Allocation Policies to Defend against Co-Resident Attacks in Cloud Computing.",
            "A Novel Class of Robust Covert Channels Using Out-of-Order Packets.",
            "CPV: Delay-Based Location Verification for the Internet.",
            "Detecting and Preventing Kernel Rootkit Attacks with Bus Snooping.",
            "Large-Scale Automated Software Diversity - Program Evolution Redux.",
            "Local Recovery for High Availability in Strongly Consistent Cloud Services.",
            "MMBcloud-Tree: Authenticated Index for Verifiable Cloud Service Selection.",
            "My Privacy My Decision: Control of Photo Sharing on Online Social Networks.",
            "Optimized Identity-Based Encryption from Bilinear Pairing for Lightweight Devices.",
            "Secure and Private Data Aggregation for Energy Consumption Scheduling in Smart Grids.",
            "Emerging Embedded and Cyber Physical System Security Challenges and Innovations.",
            "On Emerging Family of Elliptic Curves to Secure Internet of Things: ECC Comes of Age.",
            "Towards a Reliable Detection of Covert Timing Channels over Real-Time Network Traffic.",
            "SMA: A System-Level Mutual Authentication for Protecting Electronic Hardware and Firmware.",
            "Don't fool Me!: Detection, Characterisation and Diagnosis of Spoofed and Masked Events in Wireless Sensor Networks.",
            "A Traceback Attack on Freenet.",
            "Efficient and Confidentiality-Preserving Content-Based Publish/Subscribe with Prefiltering.",
            "Efficient Privacy-Preserving Facial Expression Classification.",
            "Hardness of Firewall Analysis.",
            "A Secure, Usable, and Transparent Middleware for Permission Managers on Android.",
            "Dependable Structural Health Monitoring Using Wireless Sensor Networks.",
            "Enabling Self-Healing Smart Grid Through Jamming Resilient Local Controller Switching.",
            "JAMMY: A Distributed and Dynamic Solution to Selective Jamming Attack in TDMA WSNs.",
            "Location Based Handshake and Private Proximity Test with Location Tags.",
            "Scalable Certificate Revocation Schemes for Smart Grid AMI Networks Using Bloom Filters.",
            "SPE: Security and Privacy Enhancement Framework for Mobile Devices.",
            "Towards Detecting Compromised Accounts on Social Networks.",
            "Comments on \"Verifiable and Exculpable Outsourced Attribute-Based Encryption for Access Control in Cloud Computing\".",
            "A Comprehensive Comparison of Multiparty Secure Additions with Differential Privacy.",
            "Composability Verification of Multi-Service Workflows in a Policy-Driven Cloud Computing Environment.",
            "Mandatory Content Access Control for Privacy Protection in Information Centric Networks.",
            "On Efficient and Robust Anonymization for Privacy Protection on Massive Streaming Categorical Information.",
            "On Network Footprint of Traffic Inspection and Filtering at Global Scrubbing Centers.",
            "Still Beheading Hydras: Botnet Takedowns Then and Now.",
            "Zero-Sum Password Cracking Game: A Large-Scale Empirical Study on the Crackability, Correlation, and Security of Passwords.",
            "Enabling Anonymous Authorization and Rewarding in the Smart Grid.",
            "Security Analysis of Password-Authenticated Key Retrieval.",
            "Editor's Note.",
            "Achieving Content-Oriented Anonymity with CRISP.",
            "Enhancing MongoDB with Purpose-Based Access Control.",
            "Fast Software Implementations of Bilinear Pairings.",
            "Forensic Identification of Anonymous Sources in OneSwarm.",
            "Incentivized Outsourced Computation Resistant to Malicious Contractors.",
            "Learning-Based Jamming Attack against Low-Duty-Cycle Networks.",
            "StreaMon: A Data-Plane Programming Abstraction for Software-Defined Stream Monitoring.",
            "Verifiable and Exculpable Outsourced Attribute-Based Encryption for Access Control in Cloud Computing.",
            "Cryptanalysis of a Privacy-Preserving Aggregation Protocol."
        ]
    },
    {
        "name": "TDSC",
        "year": "2016",
        "info": "Volume 13",
        "count": 57,
        "papers": [
            "The State of the Journal Editorial.",
            "Guest Editors' Introduction: Special Issue on Reliable and Secure VANETs.",
            "V2V QoS Guaranteed Channel Access in IEEE 802.11p VANETs.",
            "Random Transmit Power Control for DSRC and its Application to Cooperative Safety.",
            "Secure and Robust Multi-Constrained QoS Aware Routing Algorithm for VANETs.",
            "Securing Vehicular IPv6 Communications.",
            "Historical Spectrum Sensing Data Mining for Cognitive Radio Enabled Vehicular Ad-Hoc Networks.",
            "PBA: Prediction-Based Authentication for Vehicle-to-Vehicle Communications.",
            "Impossible Differential Fault Analysis on the LED Lightweight Cryptosystem in the Vehicular Ad-Hoc Networks.",
            "MixGroup: Accumulative Pseudonym Exchanging for Location Privacy Enhancement in Vehicular Social Networks.",
            "A Pseudonym Management System to Achieve Anonymity in Vehicular Ad Hoc Networks.",
            "Trustworthy Parking Communities: Helping Your Neighbor to Find a Space.",
            "Bayesian Coalition Negotiation Game as a Utility for Secure Energy Management in a Vehicles-to-Grid Environment.",
            "Guest Editors' Introduction: Special Issue on Cyber Crime.",
            "Towards Building Forensics Enabled Cloud Through Secure Logging-as-a-Service.",
            "Assessing the Effectiveness of Moving Target Defenses Using Security Models.",
            "Data Lineage in Malicious Environments.",
            "Malware Detection in Cloud Computing Infrastructures.",
            "Hacking Is Not Random: A Case-Control Study of Webserver-Compromise Risk.",
            "Leveraging Strategic Detection Techniques for Smart Home Pricing Cyberattacks.",
            "An Empirical Study of HTTP-based Financial Botnets.",
            "Industrial Control System Network Intrusion Detection by Telemetry Analysis.",
            "Measuring the Influence of Perceived Cybercrime Risk on Online Service Avoidance.",
            "A Support Vector Machine-Based Framework for Detection of Covert Timing Channels.",
            "Achieving Flatness: Selecting the Honeywords from Existing User Passwords.",
            "FRoDO: Fraud Resilient Device for Off-Line Micro-Payments.",
            "Enabling Fine-Grained Multi-Keyword Search Supporting Classified Sub-Dictionaries over Encrypted Cloud Data.",
            "Group Key Agreement with Local Connectivity.",
            "Inference Attack on Browsing History of Twitter Users Using Public Click Analytics and Twitter Metadata.",
            "netCSI: A Generic Fault Diagnosis Algorithm for Large-Scale Failures in Computer Networks.",
            "Privacy Protection for Wireless Medical Sensor Data.",
            "Sequence Diagram Aided Privacy Policy Specification.",
            "Wireless Communications under Broadband Reactive Jamming Attacks.",
            "Editor's Note.",
            "A Provenance-Aware Access Control Framework with Typed Provenance.",
            "An Access Control Model for Online Social Networks Using User-to-User Relationships.",
            "Cloning Your Gadgets: Complete ROP Attack Immunity with Multi-Variant Execution.",
            "Key Indistinguishability versus Strong Key Indistinguishability for Hierarchical Key Assignment Schemes.",
            "Password Extraction via Reconstructed Wireless Mouse Trajectory.",
            "Security Optimization of Dynamic Networks with Probabilistic Graph Modeling and Linear Programming.",
            "VoteTrust: Leveraging Friend Invitation Graph to Defend against Social Network Sybils.",
            "A Hardware-Software Approach for On-Line Soft Error Mitigation in Interrupt-Driven Applications.",
            "A Large-Scale Active Measurement Study on the Effectiveness of Piece-Attack on BitTorrent Networks.",
            "Distributed Attack Graph Generation.",
            "Generic and Efficient Constructions of Attribute-Based Encryption with Verifiable Outsourced Decryption.",
            "Identifying High-Cardinality Hosts from Network-Wide Traffic Measurements.",
            "Low-Rate DoS Attacks Detection Based on Network Multifractal.",
            "ProbeBuilder: Uncovering Opaque Kernel Data Structures for Automatic Probe Construction.",
            "Safety Decidability for Pre-Authorization Usage Control with Finite Attribute Domains.",
            "Secure Multiset Intersection Cardinality and its Application to Jaccard Coefficient.",
            "A Proximity Authentication System for Smartphones.",
            "Deleting Secret Data with Public Verifiability.",
            "Detection of Unspecified Emergencies for Controlled Information Sharing.",
            "Optimization of Full versus Incremental Periodic Backup Policy.",
            "Private and Secure Tag Access for Large-Scale RFID Systems.",
            "Reliability Evaluation of Network Systems with Dependent Propagated Failures Using Decision Diagrams.",
            "Trust-Based Service Management for Social Internet of Things Systems."
        ]
    },
    {
        "name": "TDSC",
        "year": "2015",
        "info": "Volume 12",
        "count": 54,
        "papers": [
            "A Computational Dynamic Trust Model for User Authorization.",
            "Behavior Rule Specification-Based Intrusion Detection for Safety Critical Medical Cyber Physical Systems.",
            "Camouflage Traffic: Minimizing Message Delay for Smart Grid Applications under Jamming.",
            "Collusion-Tolerable Privacy-Preserving Sum and Product Calculation without Secure Channel.",
            "hBFT: Speculative Byzantine Fault Tolerance with Minimum Cost.",
            "Meeting Cardinality Constraints in Role Mining.",
            "PRGA: Privacy-Preserving Recording & Gateway-Assisted Authentication of Power Usage Information for Smart Grid.",
            "Secure Data Aggregation Technique for Wireless Sensor Networks in the Presence of Collusion Attacks.",
            "Secure Spatial Top-k Query Processing via Untrusted Location-Based Service Providers.",
            "The State of the Journal Editorial.",
            "A Reliability Improvement Method for SOA-Based Applications.",
            "Context-Based Access Control Systems for Mobile Devices.",
            "DDSGA: A Data-Driven Semi-Global Alignment Approach for Detecting Masquerade Attacks.",
            "Improved Privacy-Preserving P2P Multimedia Distribution Based on Recombined Fingerprints.",
            "Modeling Dependability Features for Real-Time Embedded Systems.",
            "Performability Evaluation of Grid Environments Using Stochastic Reward Nets.",
            "Risk Aware Query Replacement Approach for Secure Databases Performance Management.",
            "Secure Tag Search in RFID Systems Using Mobile Readers.",
            "VM-μCheckpoint: Design, Modeling, and Assessment of Lightweight In-Memory VM Checkpointing.",
            "A Lightweight Secure Scheme for Detecting Provenance Forgery and Packet DropAttacks in Wireless Sensor Networks.",
            "Continuous and Transparent User Identity Verification for Secure Internet Services.",
            "Fault Injection in Virtualized Systems - Challenges and Applications.",
            "Invalidating Idealized BGP Security Proposals and Countermeasures.",
            "Key-Recovery Attacks on KIDS, a Keyed Anomaly Detection System.",
            "Marlin: Mitigating Code Reuse Attacks Using Code Randomization.",
            "On the Hardness of Adding Nonmasking Fault Tolerance.",
            "Time-Delayed Broadcasting for Defeating Inside Jammers.",
            "An OS-level Framework for Anomaly Detection in Complex Software Systems.",
            "On the Security of A Privacy-Preserving Product Calculation Scheme.",
            "A Hotness Filter of Files for Reliable Non-Volatile Memory Systems.",
            "A Memory-Access Validation Scheme against Payload Injection Attacks.",
            "A Probabilistic Discriminative Model for Android Malware Detection with Decompiled Source Code.",
            "A Trust-Based Privacy-Preserving Friend Recommendation Scheme for Online Social Networks.",
            "Anonymous Two-Factor Authentication in Distributed Systems: Certain Goals Are Beyond Attainment.",
            "Between Worlds: Securing Mixed JavaScript/ActionScript Multi-Party Web Content.",
            "REAL: A Reciprocal Protocol for Location Privacy in Wireless Sensor Networks.",
            "Vive La Différence: Paxos vs. Viewstamped Replication vs. Zab.",
            "On the Equivalence of Two Security Notions for Hierarchical Key Assignment Schemes in the Unconditional Setting.",
            "A Systematic Assessment of the Security of Full Disk Encryption.",
            "Collaborative Search Log Sanitization: Toward Differential Privacy and Boosted Utility.",
            "GTID: A Technique for Physical Device and Device Type Fingerprinting.",
            "Mining Attribute-Based Access Control Policies.",
            "New Publicly Verifiable Databases with Efficient Updates.",
            "On the Trustworthiness of Memory Analysis - An Empirical Study from the Perspective of Binary Execution.",
            "Towards Automated Risk Assessment and Mitigation of Mobile Applications.",
            "Wireless Intrusion Detection and Device Fingerprinting through Preamble Manipulation.",
            "Increasing Network Resiliency by Optimally Assigning Diverse Variants to Routing Nodes.",
            "Loss-Tolerant Bundle Fragment Authentication for Space-Based DTNs.",
            "P2CySeMoL: Predictive, Probabilistic Cyber Security Modeling Language.",
            "Privacy-Preserving Fraud Detection Across Multiple Phone Record Databases.",
            "Securing Network Processors with High-Performance Hardware Monitors.",
            "The Effectiveness of Reputation-Based Voting for Collusion Tolerance in Large-Scale Grids.",
            "Timing Attacks on Access Privacy in Information Centric Networks and Countermeasures.",
            "Web Application Vulnerability Prediction Using Hybrid Program Analysis and Machine Learning."
        ]
    },
    {
        "name": "TDSC",
        "year": "2014",
        "info": "Volume 11",
        "count": 45,
        "papers": [
            "Editorial.",
            "A Large-Scale Study of the Time Required to Compromise a Computer System.",
            "Fault-Tolerant Network Interfaces for Networks-on-Chip.",
            "k-Zero Day Safety: A Network Security Metric for Measuring the Risk of Unknown Vulnerabilities.",
            "Robustness Analysis of Embedded Control Systems with Respect to Signal Perturbations: Finding Minimal Counterexamples Using Fault Injection.",
            "Secure Two-Party Differentially Private Data Release for Vertically Partitioned Data.",
            "Security Games for Node Localization through Verifiable Multilateration.",
            "Analysis of Field Data on Web Security Vulnerabilities.",
            "CipherXRay: Exposing Cryptographic Operations and Transient Secrets from Monitored Binary Execution.",
            "Efficient and Privacy-Aware Data Aggregation in Mobile Sensing.",
            "Ensuring the Performance of Apache HTTP Server Affected by Aging.",
            "Human Effects of Enhanced Privacy Management Models.",
            "Private Searching on Streaming Data Based on Keyword Frequency.",
            "Process Authentication for High System Assurance.",
            "STARS: A Statistical Traffic Pattern Discovery System for MANETs.",
            "When Does \"Diversity\" in Development Reduce Common Failures? Insights from Probabilistic Modeling.",
            "MOSES: Supporting and Enforcing Security Profiles on Smartphones.",
            "Mobiflage: Deniable Storage Encryptionfor Mobile Devices.",
            "Generating Summary Risk Scores for Mobile Applications.",
            "Effective Risk Communication for Android Apps.",
            "Hiding in the Mobile Crowd: LocationPrivacy through Collaboration.",
            "A Denial of Service Attack to UMTS Networks Using SIM-Less Devices.",
            "Secure Ordered Bucketization.",
            "Control Flow-Based Malware VariantDetection.",
            "Enforcing Obligations within RelationalDatabase Management Systems.",
            "HyperCheck: A Hardware-AssistedIntegrity Monitor.",
            "MINT: A Reliability Modeling Frameworkfor Energy-Efficient Parallel Disk Systems.",
            "Modeling and Analysis on the Propagation Dynamics of Modern Email Malware.",
            "Performance and Availability Modeling of ITSystems with Data Backup and Restore.",
            "A Note on \"Orchestrating an Ensemble of MapReduce Jobs for Minimizing Their Makespan\".",
            "Software-Level Approaches for Tolerating Transient Faults in a Coarse-GrainedReconfigurable Architecture.",
            "A Random Decision Tree Framework for Privacy-Preserving Data Mining.",
            "Abductive Analysis of Administrative Policies in Rule-Based Access Control.",
            "Efficient Tagging of Remote Peers during Child Pornography Investigations.",
            "Evaluation of Web Security Mechanisms Using Vulnerability & Attack Injection.",
            "Low-Priced and Energy-Efficient Detection of Replicas for Wireless Sensor Networks.",
            "Privacy-Preserving Multi-Class Support Vector Machine for Outsourcing the Data Classification in Cloud.",
            "Security Analysis and Related Usability of Motion-Based CAPTCHAs: Decoding Codewords in Motion.",
            "Comment on \"Remote Physical Device Fingerprinting\".",
            "Extending the Agile Development Process to Develop Acceptably Secure Software.",
            "Fragmentation in Presence of Data Dependencies.",
            "MFTS: A Multi-Level Fault-Tolerant Archiving Storage with Optimized Maintenance Bandwidth.",
            "PPTP: Privacy-Preserving Traffic Padding in Web-Based Applications.",
            "Pushing Java Type Obfuscation to the Limit.",
            "SIP Flooding Attack Detection with a Multi-Dimensional Sketch Design."
        ]
    },
    {
        "name": "TDSC",
        "year": "2013",
        "info": "Volume 10",
        "count": 30,
        "papers": [
            "Securing Class Initialization in Java-like Languages.",
            "SORT: A Self-ORganizing Trust Model for Peer-to-Peer Systems.",
            "The Foundational Work of Harrison-Ruzzo-Ullman Revisited.",
            "Unprivileged Black-Box Detection of User-Space Keyloggers.",
            "Location-Aware and Safer Cards: Enhancing RFID Security and Privacy via Location Sensing.",
            "Malware Clearance for Secure Commitment of OS-Level Virtual Machines.",
            "Non-Cooperative Location Privacy.",
            "On Inference-Proof View Processing of XML Documents.",
            "Predicting Architectural Vulnerability on Multithreaded Processors under Resource Contention and Sharing.",
            "A System for Timely and Controlled Information Sharing in Emergency Situations.",
            "DNS for Massive-Scale Command and Control.",
            "On the Privacy Risks of Virtual Keyboards: Automatic Reconstruction of Typed Input from Compromising Reflections.",
            "To Lie or to Comply: Defending against Flood Attacks in Disruption Tolerant Networks.",
            "WarningBird: A Near Real-Time Detection System for Suspicious URLs in Twitter Stream.",
            "Guest Editors' Introduction: Special Section on Cloud Computing Assessment: Metrics, Algorithms, Policies, Models, and Evaluation Techniques.",
            "NICE: Network Intrusion Detection and Countermeasure Selection in Virtual Network Systems.",
            "Security and Privacy-Enhancing Multicloud Architectures.",
            "Entrusting Private Computation and Data to Untrusted Networks.",
            "Toward Secure Multikeyword Top-k Retrieval over Encrypted Cloud Data.",
            "Guest Editors' Introduction: Special Section on Cloud Computing Assessment: Metrics, Algorithms, Policies, Models, and Evaluation Techniques.",
            "A Hierarchical Approach for the Resource Management of Very Large Cloud Platforms.",
            "BtrPlace: A Flexible Consolidation Manager for Highly Available Applications.",
            "A Cloud-Oriented Content Delivery Network Paradigm: Modeling and Assessment.",
            "On the Performance of Byzantine Fault-Tolerant MapReduce.",
            "Orchestrating an Ensemble of MapReduce Jobs for Minimizing Their Makespan.",
            "Authorization Control for a Semantic Data Repository through an Inference Policy Engine.",
            "Discovery and Resolution of Anomalies in Web Access Control Policies.",
            "Formal Analysis of Secure Neighbor Discovery in Wireless Networks.",
            "SafeStack: Automatically Patching Stack-Based Buffer Overflow Vulnerabilities.",
            "Secure Encounter-Based Mobile Social Networks: Requirements, Designs, and Tradeoffs."
        ]
    },
    {
        "name": "TDSC",
        "year": "2012",
        "info": "Volume 9",
        "count": 73,
        "papers": [
            "Editorial.",
            "A Flexible Approach to Improving System Reliability with Virtual Lockstep.",
            "A Flexible Approach to Multisession Trust Negotiations.",
            "A Stochastic Model of Multivirus Dynamics.",
            "Conditional Diagnosability of Augmented Cubes under the PMC Model.",
            "Dynamic Security Risk Management Using Bayesian Attack Graphs.",
            "Extending Attack Graph-Based Security Metrics and Aggregating Their Application.",
            "Low Energy Online Self-Test of Embedded Processors in Dependable WSN Nodes.",
            "Packet-Hiding Methods for Preventing Selective Jamming Attacks.",
            "pCloud: A Distributed System for Practical PIR.",
            "Revisiting Defenses against Large-Scale Online Password Guessing Attacks.",
            "Automatic Reconfiguration for Large-Scale Reliable Storage Systems.",
            "Compiler-Directed Soft Error Mitigation for Embedded Systems.",
            "Data-Provenance Verification For Secure Hosts.",
            "Design and Implementation of TARF: A Trust-Aware Routing Framework for WSNs.",
            "Detecting Spam Zombies by Monitoring Outgoing Messages.",
            "On the Security and Efficiency of Content Distribution via Network Coding.",
            "Persuasive Cued Click-Points: Design, Implementation, and Evaluation of a Knowledge-Based Authentication Mechanism.",
            "Quantitative Analysis of Consensus Algorithms.",
            "Risk-Aware Mitigation for MANET Routing Attacks.",
            "SecuredTrust: A Dynamic Trust Computation Model for Secured Communication in Multiagent Systems.",
            "Stabilization Enabling Technology.",
            "Survivability Experiment and Attack Characterization for RFID.",
            "Security of Bertino-Shang-Wagstaff Time-Bound Hierarchical Key Management Scheme for Secure Broadcasting.",
            "A Taxonomy of Buffer Overflow Characteristics.",
            "Detecting and Resolving Firewall Policy Anomalies.",
            "Detecting Anomalous Insiders in Collaborative Information Systems.",
            "Enhanced Privacy ID: A Direct Anonymous Attestation Scheme with Enhanced Revocation Capabilities.",
            "ES-MPICH2: A Message Passing Interface with Enhanced Security.",
            "Iterative Trust and Reputation Management Using Belief Propagation.",
            "JS-Reduce: Defending Your Data from Sequential Background Knowledge Attacks.",
            "Mitigating Distributed Denial of Service Attacks in Multiparty Applications in the Presence of Clock Drifts.",
            "M-Score: A Misuseability Weight Measure.",
            "Remote Attestation with Domain-Based Integrity Model and Policy Analysis.",
            "On the Security of a Ticket-Based Anonymity System with Traceability Property in Wireless Mesh Networks.",
            "Guest Editors' Introduction: Special Section on Learning, Games, and Security.",
            "Incentive Compatible Privacy-Preserving Distributed Classification.",
            "Large Margin Gaussian Mixture Models with Differential Privacy.",
            "On Privacy of Encrypted Speech Communications.",
            "A Learning-Based Approach to Reactive Security.",
            "ZoneTrust: Fast Zone-Based Node Compromise Detection and Revocation in Wireless Sensor Networks Using Sequential Hypothesis Testing.",
            "DoubleGuard: Detecting Intrusions in Multitier Web Applications.",
            "Automated Security Test Generation with Formal Threat Models.",
            "Enforcing Mandatory Access Control in Commodity OS to Disable Malware.",
            "Ensuring Distributed Accountability for Data Sharing in the Cloud.",
            "Give2Get: Forwarding in Social Mobile Wireless Networks of Selfish Individuals.",
            "Recommendation Models for Open Authorization.",
            "Resilient Authenticated Execution of Critical Applications in Untrusted Environments.",
            "Secure Failure Detection and Consensus in TrustedPals.",
            "Guest Editors' Introduction: Special Section on Data and Applications Security and Privacy.",
            "Privacy-Preserving Enforcement of Spatially Aware RBAC.",
            "Query Profile Obfuscation by Means of Optimal Query Exchange between Users.",
            "Constraint-Aware Role Mining via Extended Boolean Matrix Decomposition.",
            "Access Control with Privacy Enhancements a Unified Approach.",
            "A Hybrid Approach to Private Record Matching.",
            "A Trapdoor Hash-Based Mechanism for Stream Authentication.",
            "Early Detection of Malicious Flux Networks via Large-Scale Passive DNS Traffic Analysis.",
            "More Hybrid and Secure Protection of Statistical Data Sets.",
            "Pollution Attacks and Defenses in Wireless Interflow Network Coding Systems.",
            "Workflow Signatures for Business Process Compliance.",
            "An Interconnect Reliability-Driven Routing Technique for Electromigration Failure Avoidance.",
            "A Trust-Based Framework for Fault-Tolerant Data Aggregation in Wireless Multimedia Sensor Networks.",
            "Attacks and Defenses in the Data Plane of Networks.",
            "Detecting Automation of Twitter Accounts: Are You a Human, Bot, or Cyborg?",
            "Empirical Analysis of System-Level Vulnerability Metrics through Actual Attacks.",
            "Enhancing Data Trustworthiness via Assured Digital Signing.",
            "Jamming-Resilient Multipath Routing.",
            "On Energy Security of Server Systems.",
            "Preserving Structural Properties in Edge-Perturbing Anonymization Techniques for Social Networks.",
            "Robust Network Covert Communications Based on TCP and Enumerative Combinatorics.",
            "Secure Overlay Cloud Storage with Access Control and Assured Deletion.",
            "Surviving Attacks in Challenged Networks.",
            "Virus Propagation in Heterogeneous Bluetooth Networks with Human Behaviors."
        ]
    },
    {
        "name": "TDSC",
        "year": "2011",
        "info": "Volume 8",
        "count": 70,
        "papers": [
            "A Distributed Algorithm for Finding All Best Swap Edges of a Minimum-Diameter Spanning Tree.",
            "An Obfuscation-Based Approach for Protecting Location Privacy.",
            "A Stochastic Model for Quantitative Security Analyses of Networked Systems.",
            "Automated Derivation of Application-Aware Error Detectors Using Static Analysis: The Trusted Illiac Approach.",
            "Balancing Revocation and Storage Trade-Offs in Secure Group Communication.",
            "Deadlock-Free Adaptive Routing in Meshes with Fault-Tolerance Ability Based on Channel Overlapping.",
            "Mechanism Design-Based Secure Leader Election Model for Intrusion Detection in MANET.",
            "Providing e-Transaction Guarantees in Asynchronous Systems with No Assumptions on the Accuracy of Failure Detection.",
            "RITAS: Services for Randomized Intrusion Tolerance.",
            "Soft Error Rate Analysis for Combinational Logic Using an Accurate Electrical Masking Model.",
            "The Geometric Efficient Matching Algorithm for Firewalls.",
            "Adaptive Fault-Tolerant QoS Control Algorithms for Maximizing System Lifetime of Query-Based Wireless Sensor Networks.",
            "Application-Level Diagnostic and Membership Protocols for Generic Time-Triggered Systems.",
            "A Tamper-Resistant Programming Language System.",
            "Chip Self-Organization and Fault Tolerance in Massively Defective Multicore Arrays.",
            "Comparative Evaluation of Spoofing Defenses.",
            "Cross-Layer Detection of Sinking Behavior in Wireless Ad Hoc Networks Using SVM and FDA.",
            "Diagnosability of Two-Matching Composition Networks under the MMast Model.",
            "Nymble: Blocking Misbehaving Users in Anonymizing Networks.",
            "On Complexity and Approximability of Optimal DoS Attacks on Multiple-Tree P2P Streaming Topologies.",
            "Online Intrusion Alert Aggregation with Generative Data Stream Modeling.",
            "SAT: A Security Architecture Achieving Anonymity and Traceability in Wireless Mesh Networks.",
            "Fault Injection in Modern Microprocessors Using On-Chip Debugging Infrastructures.",
            "On the Security of Chien's Ultralightweight RFID Authentication Protocol.",
            "A Policy Enforcing Mechanism for Trusted Ad Hoc Networks.",
            "CASTLE: Continuously Anonymizing Data Streams.",
            "Determining the Diagnosability of (1, 2)-Matching Composition Networks and Its Applications.",
            "Low-Energy Symmetric Key Distribution in Wireless Sensor Networks.",
            "Modeling and Detection of Camouflaging Worm.",
            "Recovery Device for Real-Time Dual-Redundant Computer Systems.",
            "Reliability for Networked Storage Nodes.",
            "Replica Placement for Route Diversity in Tree-Based Routing Distributed Hash Tables.",
            "Robust Correlation of Encrypted Attack Traffic through Stepping Stones by Flow Watermarking.",
            "Securing Topology Maintenance Protocols for Sensor Networks.",
            "The F_f-Family of Protocols for RFID-Privacy and Authentication.",
            "A New Diskless Checkpointing Approach for Multiple Processor Failures.",
            "Anomaly Detection in Network Traffic Based on Statistical Inference and alpha-Stable Modeling.",
            "Efficient Fault Detection and Diagnosis in Complex Software Systems with Information-Theoretic Monitoring.",
            "ELMO: Energy Aware Local Monitoring in Sensor Networks.",
            "Modeling and Mitigating Transient Errors in Logic Circuits.",
            "On Ultralightweight RFID Authentication Protocols.",
            "Prime: Byzantine Replication under Attack.",
            "Privacy-Preserving Updates to Anonymous and Confidential Databases.",
            "Runtime Defense against Code Injection Attacks Using Replicated Execution.",
            "Self-Healing Control Flow Protection in Sensor Applications.",
            "Dynamics of Malware Spread in Decentralized Peer-to-Peer Networks.",
            "A Fault-Tolerant Token-Based Atomic Broadcast Algorithm.",
            "Automated Derivation of Application-Specific Error Detectors Using Dynamic Analysis.",
            "Deploying Cryptography in Internet-Scale Systems: A Case Study on DNSSEC.",
            "Detecting Kernel-Level Rootkits Using Data Structure Invariants.",
            "Distributed Detection of Clone Attacks in Wireless Sensor Networks.",
            "Fast and Secure Reauthentications for 3GPP Subscribers during WiMAX-WLAN Handovers.",
            "Hardware/Software Codesign Architecture for Online Testing in Chip Multiprocessors.",
            "Improving Security and Performance in the Tor Network through Tunable Path Selection.",
            "PriPAYD: Privacy-Friendly Pay-As-You-Drive Insurance.",
            "Temperature-Aware NBTI Modeling and the Impact of Standby Leakage Reduction Techniques on Circuit Performance Degradation.",
            "Analyzing a Family of Key Protection Schemes against Modification Attacks.",
            "Secrecy Capacity for Satellite Networks under Rain Fading.",
            "An Entropy-Based Approach to Detecting Covert Timing Channels.",
            "A Numerical Method for the Evaluation of the Distribution of Cumulative Reward till Exit of a Subset of Transient States of a Markov Reward Model.",
            "Autonomic Trust Management for a Component-Based Software System.",
            "Detection and Recovery from Pollution Attacks in Coding-Based Distributed Storage Schemes.",
            "Fast Software Rejuvenation of Virtual Machine Monitors.",
            "Formal Specification and Verification of Modular Security Policy Based on Colored Petri Nets.",
            "On Reliable Dissemination in Wireless Ad Hoc Networks.",
            "On the Complexity of Authorization in RBAC under Qualification and Security Constraints.",
            "On the Performance of Secure Vehicular Communication Systems.",
            "Probabilistic Model-Driven Recovery in Distributed Systems.",
            "Three Improved Algorithms for Multipath Key Establishment in Sensor Networks Using Protocols for Secure Message Transmission.",
            "Fingerprinting RFID Tags."
        ]
    },
    {
        "name": "TDSC",
        "year": "2010",
        "info": "Volume 7",
        "count": 34,
        "papers": [
            "Editorial.",
            "Editorial.",
            "A Puzzle-Based Defense Strategy Against Flooding Attacks Using Game Theory.",
            "A Survey on the Encryption of Convergecast Traffic with In-Network Processing.",
            "Layered Approach Using Conditional Random Fields for Intrusion Detection.",
            "Secure Data Objects Replication in Data Grid.",
            "SigFree: A Signature-Free Buffer Overflow Attack Blocker.",
            "Steward: Scaling Byzantine Fault-Tolerant Replication to Wide Area Networks.",
            "Using Underutilized CPU Resources to Enhance Its Reliability.",
            "An Advanced Hybrid Peer-to-Peer Botnet.",
            "A Rigorous, Compositional, and Extensible Framework for Dynamic Fault Tree Analysis.",
            "Conformance Testing of Temporal Role-Based Access Control Systems.",
            "Dual-Quorum: A Highly Available and Consistent Replication System for Edge Services.",
            "In-Depth Packet Inspection Using a Hierarchical Pattern Matching Algorithm.",
            "Shifting Inference Control to User Side: Architecture and Protocol.",
            "Using Web-Referral Architectures to Mitigate Denial-of-Service Threats.",
            "On the Thermal Attack in Instruction Caches.",
            "Editorial.",
            "Differential Power Analysis Attacks to Precharged Buses: A General Analysis for Symmetric-Key Cryptographic Algorithms.",
            "On the Effects of Process Variation in Network-on-Chip Architectures.",
            "On the General Applicability of Instruction-Set Randomization.",
            "On the Quality of Service of Crash-Recovery Failure Detectors.",
            "On the Survivability of Wireless Ad Hoc Networks with Node Misbehaviors and Failures.",
            "Role Engineering via Prioritized Subset Enumeration.",
            "Wavelet Codes for Algorithm-Based Fault Tolerance Applications.",
            "Cluster-Based Key Predistribution Using Deployment Knowledge.",
            "A Large-Scale Study of Failures in High-Performance Computing Systems.",
            "An Architectural Approach to Preventing Code Injection Attacks.",
            "Designing Dependable Storage Solutions for Shared Application Environments.",
            "Detecting Intrusions through System Call Sequence and Argument Analysis.",
            "Fault Localization via Risk Modeling.",
            "Greedy Receivers in IEEE 802.11 Hotspots: Impacts and Detection.",
            "Proactive Detection of Computer Worms Using Model Checking.",
            "A Hybrid Approach for Detection and Correction of Transient Faults in SoCs."
        ]
    },
    {
        "name": "TDSC",
        "year": "2009",
        "info": "Volume 6",
        "count": 27,
        "papers": [
            "Dependability Evaluation with Dynamic Reliability Block Diagrams and Dynamic Fault Trees.",
            "Dynamic Verification of Memory Consistency in Cache-Coherent Multithreaded Computer Architectures.",
            "Flexible Rollback Recovery in Dynamic Heterogeneous Grid Computing.",
            "The Design of a Generic Intrusion-Tolerant Architecture for Web Servers.",
            "The Effectiveness of Checksums for Embedded Control Networks.",
            "Security Analysis of the SASI Protocol.",
            "Accurately Measuring Denial of Service in Simulation and Testbed Experiments.",
            "Beyond Output Voting: Detecting Compromised Replicas Using HMM-Based Behavioral Distance.",
            "Evaluating the Vulnerability of Network Traffic Using Joint Security and Routing Analysis.",
            "Instruction-Based Online Periodic Self-Testing of Microprocessors with Floating-Point Units.",
            "PLR: A Software Approach to Transient Fault Tolerance for Multicore Architectures.",
            "Cryptanalysis of a Generalized Ring Signature Scheme.",
            "Online Periodic Self-Test Scheduling for Real-Time Processor-Based Systems Dependability Enhancement.",
            "On the Security of an Efficient Time-Bound Hierarchical Key Management Scheme.",
            "A New Decision-Diagram-Based Method for Efficient Analysis on Multistate Systems.",
            "Error Detection and Fault Tolerance in ECSM Using Input Randomization.",
            "KTR: An Efficient Key Management Scheme for Secure Data Access Control in Wireless Broadcast Services.",
            "Modeling Soft Errors at the Device and Logic Levels for Combinational Circuits.",
            "Reducing Soft Errors through Operand Width Aware Policies.",
            "Semiconcurrent Online Testing of Transition Faults through Output Response Comparison of Identical Circuits.",
            "A Novel Bicriteria Scheduling Heuristics Providing a Guaranteed Global System Failure Rate.",
            "A Top-Down Design Methodology for Ultrahigh-Performance Hashing Cores.",
            "Chasing the Weakest System Model for Implementing Ω and Consensus.",
            "Is Asynchronous Logic More Robust Than Synchronous Logic?.",
            "JANUS: A Framework for Scalable and Secure Routing in Hybrid Wireless Networks.",
            "BLAST-SSAHA Hybridization for Credit Card Fraud Detection.",
            "Cryptanalysis of a New Ultralightweight RFID Authentication Protocol—SASI."
        ]
    },
    {
        "name": "TDSC",
        "year": "2008",
        "info": "Volume 5",
        "count": 18,
        "papers": [
            "A Precise Termination Condition of the Probabilistic Packet Marking Algorithm.",
            "Controlling IP Spoofing through Interdomain Packet Filters.",
            "Credit Card Fraud Detection Using Hidden Markov Model.",
            "Trustworthy Computing under Resource Constraints with the DOWN Policy.",
            "An Efficient Time-Bound Hierarchical Key Management Scheme for Secure Broadcasting.",
            "Modeling and Automated Containment of Worms.",
            "Practical Inference Control for Data Cubes.",
            "Temporal Partitioning of Communication Resources in an Integrated Architecture.",
            "Toward Increasing FPGA Lifetime.",
            "Architectural Risk Analysis of Software Systems Based on Security Patterns.",
            "Dynamic Path Management with Resilience Constraints under Multiple Link Failures in MPLS/GMPLS Networks.",
            "Generalized Ring Signatures.",
            "High-Level Side-Channel Attack Modeling and Simulation for Security-Critical Systems on Chips.",
            "Multipath Key Establishment for Wireless Sensor Networks Using Just-Enough Redundancy Transmission.",
            "A Computationally Sound Mechanized Prover for Security Protocols.",
            "Integrity Codes: Message Integrity Protection and Authentication over Insecure Channels.",
            "Theory and Techniques for Automatic Generation of Vulnerability-Based Signatures.",
            "Towards Formal Verification of Role-Based Access Control Policies."
        ]
    },
    {
        "name": "TDSC",
        "year": "2007",
        "info": "Volume 4",
        "count": 26,
        "papers": [
            "A Parsimonious Approach for Obtaining Resource-Efficient and Trustworthy Execution.",
            "An Adaptive Programming Model for Fault-Tolerant Distributed Computing.",
            "Architecture-Based Software Reliability Analysis: Overview and Limitations.",
            "Hybrid Intrusion Detection with Weighted Signature Generation over Anomalous Internet Episodes.",
            "Non-Gaussian and Long Memory Statistical Characterizations for Internet Traffic with Anomalies.",
            "Provably Secure Three-Party Authenticated Quantum Key Distribution Protocols.",
            "Editorial: Dependability and Security.",
            "WormShield: Fast Worm Signature Generation with Distributed Fingerprint Aggregation.",
            "Modeling and Simulation Study of the Propagation and Defense of Internet E-mail Worms.",
            "Fast Worm Containment Using Feedback Control.",
            "Analysis of Computer Intrusions Using Sequences of Function Calls.",
            "A Survey and Analysis of the P3P Protocol's Agents, Adoption, Maintenance, and Future.",
            "A New Biometric Technology Based on Mouse Dynamics.",
            "A Time-Optimal Self-Stabilizing Synchronizer Using A Phase Clock.",
            "Keeping Denial-of-Service Attackers in the Dark.",
            "Introducing a Relative Priority for the Shared-Protection Schemes.",
            "One Picture Is Worth a Dozen Connectives: A Fault-Tree Representation of NPATRL Security Requirements.",
            "Optimizing Rekeying Cost for Contributory Group Key Agreement Schemes.",
            "A Dynamic and Differential CMOS Lookup Table with Data-Independent Power Consumption for Cryptographic Applications on Chip Cards.",
            "An Analysis Study on Zone-Based Anonymous Communication in Mobile Ad Hoc Networks.",
            "Automated Rule-Based Diagnosis through a Distributed Monitor System.",
            "Fault Tolerance via Diversity for Off-the-Shelf Products: A Study with SQL Database Servers.",
            "Online Diagnosis and Recovery: On the Choice and Impact of Tuning Parameters.",
            "Opportunistic Encryption: A Trade-Off between Security and Throughput in Wireless Networks.",
            "Securing Designs against Scan-Based Side-Channel Attacks.",
            "SASI: A New Ultralightweight RFID Authentication Protocol Providing Strong Authentication and Strong Integrity."
        ]
    },
    {
        "name": "TDSC",
        "year": "2006",
        "info": "Volume 3",
        "count": 32,
        "papers": [
            "Editorial: Dependability and Security--Looking Foward to 2006.",
            "From Set Membership to Group Membership: A Separation of Concerns.",
            "Achieving Privacy in Trust Negotiations with an Ontology-Based Approach.",
            "An Active Splitter Architecture for Intrusion Detection and Prevention.",
            "Exposing and Eliminating Vulnerabilities to Denial of Service Attacks in Secure Gossip-Based Multicast.",
            "A Key Predistribution Scheme for Sensor Networks Using Deployment Knowledge.",
            "Install-Time Vaccination of Windows Executables to Defend against Stack Smashing Attacks.",
            "Merging: An Efficient Solution for a Time-Bound Hierarchical Key Assignment Scheme.",
            "A Practical Password-Based Two-Server Authentication and Key Exchange System.",
            "Automated Online Monitoring of Distributed Applications through External Monitors.",
            "Distribution-Free Checkpoint Placement Algorithms Based on Min-Max Principle.",
            "PacketScore: A Statistics-Based Packet Filtering Scheme against Distributed Denial-of-Service Attacks.",
            "Role-Based Access Control for Grid Database Services Using the Community Authorization Service.",
            "Guest Editorial for the Special Issue on the 2005 IEEE/IFIP Conference on Dependable Systems and Networks, including the Dependable Computing and Communications and Performance and Dependability Symposia.",
            "Dependability through Assured Reconfiguration in Embedded System Software.",
            "ReStore: Symptom-Based Soft Error Detection in Microprocessors.",
            "Fast Byzantine Consensus.",
            "System Call Monitoring Using Authenticated System Calls.",
            "Detecting and Isolating Malicious Routers.",
            "A Novel Approach for Phase-Type Fitting with the EM Algorithm.",
            "Combining Response Surface Methodology with Numerical Methods for Optimization of Markovian Models.",
            "An Experimental Study of Internet Path Diversity.",
            "Automatic Synthesis of Efficient Intrusion Detection Systems on FPGAs.",
            "Detecting Phishing Web Pages with Visual Similarity Assessment Based on Earth Mover's Distance (EMD).",
            "Modeling and Tracking of Transaction Flow Dynamics for Fault Detection in Complex Systems.",
            "Neural Network Techniques for Proactive Password Checking.",
            "OACerts: Oblivious Attribute Certificates.",
            "Reducing Data Cache Susceptibility to Soft Errors.",
            "Secure Bit: Transparent, Hardware Buffer-Overflow Protection.",
            "Secure Location Verification Using Radio Broadcast.",
            "Securing Mobile Ad Hoc Networks with Certificateless Public Keys.",
            "Correction to \"Fast Byzantine Consensus\"."
        ]
    },
    {
        "name": "TDSC",
        "year": "2005",
        "info": "Volume 2",
        "count": 29,
        "papers": [
            "Editorial: State of the Journal Address.",
            "Database Security-Concepts, Approaches, and Challenges.",
            "Unification of Transactions and Replication in Three-Tier Architectures Based on CORBA.",
            "Fingerprinting Relational Databases: Schemes and Specialties.",
            "Simple and Efficient Oracle-Based Consensus Protocols for Asynchronous Byzantine Systems.",
            "Fault Tolerance Design in JPEG 2000 Image Compression System.",
            "Guest Editor's Introduction: 2005 IEEE Symposium on Security and Privacy.",
            "Hardware-Assisted Circumvention of Self-Hashing Software Tamper Resistance.",
            "Remote Physical Device Fingerprintin.",
            "Relating Symbolic and Cryptographic Secrecy.",
            "A Comprehensive Model for Software Rejuvenation.",
            "SPEK: A Storage Performance Evaluation Kernel Module for Block-Level Storage Systems under Faulty Conditions.",
            "A Low-Cost Concurrent BIST Scheme for Increased Dependability.",
            "An Analysis of Expressiveness and Design Issues for the Generalized Temporal Role-Based Access Control Model.",
            "Fault-Tolerant Cluster-Wise Clock Synchronization for Wireless Sensor Networks.",
            "Concurrent Online Testing of Identical Circuits Using Nonidentical Input Vectors.",
            "Complexity Issues in Automated Synthesis of Failsafe Fault-Tolerance.",
            "D-WARD: A Source-End Defense against Flooding Denial-of-Service Attacks.",
            "On the Distribution and Revocation of Cryptographic Keys in Sensor Networks.",
            "Secure Spread: An Integrated Architecture for Secure Group Communication.",
            "Optimal Redundancy Allocation for Information Technology Disaster Recovery in the Network Economy.",
            "A Framework for the Revocation of Unintended Digital Signatures Initiated by Malicious Terminals.",
            "A Family of Trusted Third Party Based Fair-Exchange Protocols.",
            "An Efficient Index-Based Checkpointing Protocol with Constant-Size Control Information on Messages.",
            "Autonomic Microprocessor Execution via Self-Repairing Arrays.",
            "DICTATE: DIstributed CerTification Authority with probabilisTic frEshness for Ad Hoc Networks.",
            "Monitoring the Macroscopic Effect of DDoS Flooding Attacks.",
            "OBDD-Based Evaluation of Reliability and Importance Measures for Multistate Systems Subject to Imperfect Fault Coverage.",
            "The Effect of the Specification Model on the Complexity of Adding Masking Fault Tolerance."
        ]
    },
    {
        "name": "TDSC",
        "year": "2004",
        "info": "Volume 1",
        "count": 15,
        "papers": [
            "Basic Concepts and Taxonomy of Dependable and Secure Computing.",
            "CODEX: A Robust and Secure Secret Distribution System.",
            "Model-Based Evaluation: From Dependability to Security.",
            "A Systems-Theoretic Approach to Safety in Software-Intensive Systems.",
            "Commercial Fault Tolerance: A Tale of Two Systems.",
            "Checkpointing for Peta-Scale Systems: A Look into the Future of Practical Rollback-Recovery.",
            "Reflections on Industry Trends and Experimental Research in Dependability.",
            "Characterization of Soft Errors Caused by Single Event Upsets in CMOS Processes.",
            "A Comprehensive Approach to Intrusion Detection Alert Correlation.",
            "Identity-Based Fault-Tolerant Conference Key Agreement.",
            "An On-Chip Signal Suppression Countermeasure to Power Analysis Attacks.",
            "Change-Point Monitoring for the Detection of DoS Attacks.",
            "Defending a P2P Digital Preservation System.",
            "Effective Fault Treatment for Improving the Dependability of COTS and Legacy-Based Applications.",
            "An Authorization Model for Geospatial Data."
        ]
    }
]