[
    {
        "year": "2021",
        "name": "19th TCC 2021",
        "info": "Raleigh, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2021-1",
                "sub_name": "Theory of Cryptography - 19th International Conference, TCC 2021, Raleigh, NC, USA, November 8-11, 2021, Proceedings, Part I.",
                "count": 25,
                "papers": [
                    "Secure Quantum Computation with Classical Communication.",
                    "Secure Software Leasing from Standard Assumptions.",
                    "Post-quantum Resettably-Sound Zero Knowledge.",
                    "Secure Software Leasing Without Assumptions.",
                    "The Round Complexity of Quantum Zero-Knowledge.",
                    "Rate-1 Quantum Fully Homomorphic Encryption.",
                    "Unifying Presampling via Concentration Bounds.",
                    "Quantum Key-Length Extension.",
                    "Relationships Between Quantum IND-CPA Notions.",
                    "Classical Binding for Quantum Commitments.",
                    "Unclonable Encryption, Revisited.",
                    "Somewhere Statistical Soundness, Post-Quantum Security, and SNARGs.",
                    "Black-Box Impossibilities of Obtaining 2-Round Weak ZK and Strong WI from Polynomial Hardness.",
                    "Tight Security Bounds for Micali's SNARGs.",
                    "Acyclicity Programming for Sigma-Protocols.",
                    "Statistical ZAPs from Group-Based Assumptions.",
                    "Generalized Proofs of Knowledge with Fully Dynamic Setup.",
                    "Fully-Succinct Publicly Verifiable Delegation from Constant-Size Assumptions.",
                    "On Expected Polynomial Runtime in Cryptography.",
                    "Information-Theoretically Secure MPC Against Mixed Dynamic Adversaries.",
                    "Round-Efficient Byzantine Agreement and Multi-party Computation with Asynchronous Fallback.",
                    "Two-Round Maliciously Secure Computation with Super-Polynomial Simulation.",
                    "Adaptive Security of Multi-party Protocols, Revisited.",
                    "On Actively-Secure Elementary MPC Reductions.",
                    "Environmentally Friendly Composable Multi-party Computation in the Plain Model from Standard (Timed) Assumptions."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2021-2",
                "sub_name": "Theory of Cryptography - 19th International Conference, TCC 2021, Raleigh, NC, USA, November 8-11, 2021, Proceedings, Part II.",
                "count": 25,
                "papers": [
                    "Dory: Efficient, Transparent Arguments for Generalised Inner Products and Polynomial Commitments.",
                    "On Communication-Efficient Asynchronous MPC with Adaptive Security.",
                    "Efficient Perfectly Secure Computation with Optimal Resilience.",
                    "On Communication Models and Best-Achievable Security in Two-Round MPC.",
                    "Generalized Pseudorandom Secret Sharing and Efficient Straggler-Resilient Secure Computation.",
                    "Blockchains Enable Non-interactive MPC.",
                    "Multi-party PSM, Revisited: - Improved Communication and Unbalanced Communication.",
                    "Multi-Party Functional Encryption.",
                    "Succinct LWE Sampling, Random Polynomials, and Obfuscation.",
                    "ABE for DFA from LWE Against Bounded Collusions, Revisited.",
                    "Distributed Merkle's Puzzles.",
                    "Continuously Non-malleable Secret Sharing: Joint Tampering, Plain Model and Capacity.",
                    "Disappearing Cryptography in the Bounded Storage Model.",
                    "Trojan-Resilience Without Cryptography.",
                    "On Derandomizing Yao's Weak-to-Strong OWF Construction.",
                    "Simple Constructions from (Almost) Regular One-Way Functions.",
                    "On Treewidth, Separators and Yao's Garbling.",
                    "Oblivious Transfer from Trapdoor Permutations in Minimal Rounds.",
                    "The Cost of Adaptivity in Security Games on Graphs.",
                    "Concurrent Composition of Differential Privacy.",
                    "Direct Product Hardness Amplification.",
                    "On the (Ir)Replaceability of Global Setups, or How (Not) to Use a Global Ledger.",
                    "BKW Meets Fourier New Algorithms for LPN with Sparse Parities.",
                    "Computational Robust (Fuzzy) Extractors for CRS-Dependent Sources with Minimal Min-entropy.",
                    "Polynomial-Time Targeted Attacks on Coin Tossing for Any Number of Corruptions."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2021-3",
                "sub_name": "Theory of Cryptography - 19th International Conference, TCC 2021, Raleigh, NC, USA, November 8-11, 2021, Proceedings, Part III.",
                "count": 16,
                "papers": [
                    "Covert Learning: How to Learn with an Untrusted Intermediary.",
                    "Random-Index PIR and Applications.",
                    "Forward Secret Encrypted RAM: Lower Bounds and Applications.",
                    "Laconic Private Set Intersection and Applications.",
                    "Amortizing Rate-1 OT and Applications to PIR and PSI.",
                    "Ring-Based Identity Based Encryption - Asymptotically Shorter MPK and Tighter Security.",
                    "Cryptographic Shallots: A Formal Treatment of Repliable Onion Encryption.",
                    "Grafting Key Trees: Efficient Key Management for Overlapping Groups.",
                    "Updatable Public Key Encryption in the Standard Model.",
                    "Towards Tight Adaptive Security of Non-interactive Key Exchange.",
                    "On the Impossibility of Purely Algebraic Signatures.",
                    "Policy-Compliant Signatures.",
                    "Simple and Efficient Batch Verification Techniques for Verifiable Delay Functions.",
                    "Non-malleable Vector Commitments via Local Equivocability.",
                    "Non-malleable Time-Lock Puzzles and Applications.",
                    "Vector and Functional Commitments from Lattices."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "18th TCC 2020",
        "info": "Durham, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2020-1",
                "sub_name": "Theory of Cryptography - 18th International Conference, TCC 2020, Durham, NC, USA, November 16-19, 2020, Proceedings, Part I.",
                "count": 24,
                "papers": [
                    "Lossiness and Entropic Hardness for Ring-LWE.",
                    "Multi-key Fully-Homomorphic Encryption in the Plain Model.",
                    "Constant Ciphertext-Rate Non-committing Encryption from Standard Assumptions.",
                    "Efficient Range-Trapdoor Functions and Applications: Rate-1 OT and More.",
                    "CP-ABE for Circuits (and More) in the Symmetric Key Setting.",
                    "Optimal Broadcast Encryption from LWE and Pairings in the Standard Model.",
                    "Equipping Public-Key Cryptographic Primitives with Watermarking (or: A Hole Is to Watermark).",
                    "Functional Encryption for Quadratic Functions from k-Lin, Revisited.",
                    "On Perfect Correctness in (Lockable) Obfuscation.",
                    "Can a Public Blockchain Keep a Secret?",
                    "Blockchains from Non-idealized Hash Functions.",
                    "Ledger Combiners for Fast Settlement.",
                    "Asynchronous Byzantine Agreement with Subquadratic Communication.",
                    "Expected Constant Round Byzantine Broadcast Under Dishonest Majority.",
                    "Round-Efficient Byzantine Broadcast Under Strongly Adaptive and Majority Corruptions.",
                    "A Lower Bound for One-Round Oblivious RAM.",
                    "Lower Bounds for Multi-server Oblivious RAMs.",
                    "On Computational Shortcuts for Information-Theoretic PIR.",
                    "Characterizing Deterministic-Prover Zero Knowledge.",
                    "NIZK from SNARG.",
                    "Weakly Extractable One-Way Functions.",
                    "Towards Non-interactive Witness Hiding.",
                    "FHE-Based Bootstrapping of Designated-Prover NIZK.",
                    "Perfect Zero Knowledge: New Upperbounds and Relativized Separations."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2020-2",
                "sub_name": "Theory of Cryptography - 18th International Conference, TCC 2020, Durham, NC, USA, November 16-19, 2020, Proceedings, Part II.",
                "count": 24,
                "papers": [
                    "Recursive Proof Composition from Accumulation Schemes.",
                    "Linear-Time Arguments with Sublinear Verification from Tensor Codes.",
                    "Barriers for Succinct Arguments in the Random Oracle Model.",
                    "Accumulators in (and Beyond) Generic Groups: Non-trivial Batch Verification Requires Interaction.",
                    "Batch Verification and Proofs of Proximity with Polylog Overhead.",
                    "Batch Verification for Statistical Zero Knowledge Proofs.",
                    "Public-Coin Zero-Knowledge Arguments with (almost) Minimal Time and Space Overheads.",
                    "On the Price of Concurrency in Group Ratcheting Protocols.",
                    "Stronger Security and Constructions of Multi-designated Verifier Signatures.",
                    "Continuous Group Key Agreement with Active Security.",
                    "Round Optimal Secure Multiparty Computation from Minimal Assumptions.",
                    "Reusable Two-Round MPC from DDH.",
                    "Mr NISC: Multiparty Reusable Non-Interactive Secure Computation.",
                    "Secure Massively Parallel Computation for Dishonest Majority.",
                    "Towards Multiparty Computation Withstanding Coercion of All Parties.",
                    "Synchronous Constructive Cryptography.",
                    "Topology-Hiding Communication from Minimal Assumptions.",
                    "Information-Theoretic 2-Round MPC Without Round Collapsing: Adaptive Security, and More.",
                    "On Statistical Security in Two-Party Computation.",
                    "The Resiliency of MPC with Low Interaction: The Benefit of Making Errors (Extended Abstract).",
                    "Revisiting Fairness in MPC: Polynomial Number of Parties and General Adversarial Structures.",
                    "On the Power of an Honest Majority in Three-Party Computation Without Broadcast.",
                    "A Secret-Sharing Based MPC Protocol for Boolean Circuits with Good Amortized Complexity.",
                    "On the Round Complexity of the Shuffle Model."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2020-3",
                "sub_name": "Theory of Cryptography - 18th International Conference, TCC 2020, Durham, NC, USA, November 16-19, 2020, Proceedings, Part III.",
                "count": 23,
                "papers": [
                    "Universal Composition with Global Subroutines: Capturing Global Setup Within Plain UC.",
                    "Security Analysis of itSPAKE2+.",
                    "Schrödinger's Pirate: How to Trace a Quantum Decoder.",
                    "Quantum Encryption with Certified Deletion.",
                    "Secure Quantum Extraction Protocols.",
                    "Non-interactive Classical Verification of Quantum Computation.",
                    "Classical Verification of Quantum Computations with Efficient Verifier.",
                    "Coupling of Random Systems.",
                    "Towards Defeating Backdoored Random Oracles: Indifferentiability with Bounded Adaptivity.",
                    "Zero-Communication Reductions.",
                    "Lower Bounds on the Time/Memory Tradeoff of Function Inversion.",
                    "Super-Linear Time-Memory Trade-Offs for Symmetric Encryption.",
                    "Algebraic Distinguishers: From Discrete Logarithms to Decisional Uber Assumptions.",
                    "On the Security of Time-Lock Puzzles and Timed Commitments.",
                    "Expected-Time Cryptography: Generic Techniques and Applications to Concrete Soundness.",
                    "On the Complexity of Arithmetic Secret Sharing.",
                    "Robust Secret Sharing with Almost Optimal Share Size and Security Against Rushing Adversaries.",
                    "The Share Size of Secret-Sharing Schemes for Almost All Access Structures and Graphs.",
                    "Transparent Error Correcting in a Computationally Bounded World.",
                    "New Techniques in Replica Encodings with Client Setup.",
                    "Non-malleable Codes, Extractors and Secret Sharing for Interleaved Tampering and Composition of Tampering.",
                    "On Average-Case Hardness in TFNP from One-Way Functions.",
                    "On Pseudorandom Encodings."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th TCC 2019",
        "info": "Nuremberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2019-1",
                "sub_name": "Theory of Cryptography - 17th International Conference, TCC 2019, Nuremberg, Germany, December 1-5, 2019, Proceedings, Part I.",
                "count": 22,
                "papers": [
                    "Algebraically Structured LWE, Revisited.",
                    "Lattice Trapdoors and IBE from Middle-Product LWE.",
                    "Matrix PRFs: Constructions, Attacks, and Applications to Obfuscation.",
                    "Obfuscated Fuzzy Hamming Distance and Conjunctions from Subset Product Problems.",
                    "A Black-Box Construction of Fully-Simulatable, Round-Optimal Oblivious Transfer from Strongly Uniform Key Agreement.",
                    "Synchronous Consensus with Optimal Asynchronous Fallback Guarantees.",
                    "Predicate Encryption from Bilinear Maps and One-Sided Probabilistic Rank.",
                    "Optimal Bounded-Collusion Secure Functional Encryption.",
                    "From FE Combiners to Secure MPC and Back.",
                    "(Pseudo) Random Quantum States with Binary Phase.",
                    "General Linear Group Action on Tensors: A Candidate for Post-quantum Cryptography.",
                    "Composable and Finite Computational Security of Quantum Message Transmission.",
                    "On Fully Secure MPC with Solitary Output.",
                    "Secure Computation with Preprocessing via Function Secret Sharing.",
                    "Efficient Private PEZ Protocols for Symmetric Functions.",
                    "The Function-Inversion Problem: Barriers and Opportunities.",
                    "On the Complexity of Collision Resistant Hash Functions: New and Old Black-Box Separations.",
                    "Characterizing Collision and Second-Preimage Resistance in Linicrypt.",
                    "Efficient Information-Theoretic Secure Multiparty Computation over Z/pkZ via Galois Rings.",
                    "Is Information-Theoretic Topology-Hiding Computation Possible?",
                    "Channels of Small Log-Ratio Leakage and Characterization of Two-Party Differentially Private Computation.",
                    "On Perfectly Secure 2PC in the OT-Hybrid Model."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2019-2",
                "sub_name": "Theory of Cryptography - 17th International Conference, TCC 2019, Nuremberg, Germany, December 1-5, 2019, Proceedings, Part II.",
                "count": 21,
                "papers": [
                    "Succinct Arguments in the Quantum Random Oracle Model.",
                    "Delegating Quantum Computation in the Quantum Random Oracle Model.",
                    "Tighter Proofs of CCA Security in the Quantum Random Oracle Model.",
                    "Attribute Based Encryption for Deterministic Finite Automata from \\mathsfDLIN.",
                    "CPA-to-CCA Transformation for KDM Security.",
                    "New Approaches to Traitor Tracing with Embedded Identities.",
                    "A Unified and Composable Take on Ratcheting.",
                    "Continuously Non-malleable Secret Sharing for General Access Structures.",
                    "Interactive Non-malleable Codes.",
                    "Stronger Lower Bounds for Online ORAM.",
                    "Adaptively Secure Garbling Schemes for Parallel Computations.",
                    "Statistical Difference Beyond the Polarizing Regime.",
                    "Estimating Gaps in Martingales and Applications to Coin-Tossing: Constructions and Hardness.",
                    "Fully Homomorphic NIZK and NIWI Proofs.",
                    "Lower and Upper Bounds on the Randomness Complexity of Private Computations of AND.",
                    "Leveraging Linear Decryption: Rate-1 Fully-Homomorphic Encryption and Time-Lock Puzzles.",
                    "Compressible FHE with Applications to PIR.",
                    "Permuted Puzzles and Cryptographic Hardness.",
                    "Linear-Size Constant-Query IOPs for Delegating Computation.",
                    "On the (In)security of Kilian-Based SNARGs.",
                    "Incrementally Verifiable Computation via Incremental PCPs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th TCC 2018",
        "info": "Panaji, India",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2018-1",
                "sub_name": "Theory of Cryptography - 16th International Conference, TCC 2018, Panaji, India, November 11-14, 2018, Proceedings, Part I.",
                "count": 25,
                "papers": [
                    "Provable Time-Memory Trade-Offs: Symmetric Cryptography Against Memory-Bounded Adversaries.",
                    "Static-Memory-Hard Functions, and Modeling the Cost of Space vs. Time.",
                    "No-signaling Linear PCPs.",
                    "On Basing Search SIVP on NP-Hardness.",
                    "Two-Round MPC: Information-Theoretic and Black-Box.",
                    "Perfect Secure Computation in Two Rounds.",
                    "Two-Round Adaptively Secure Multiparty Computation from Standard Assumptions.",
                    "One-Message Zero Knowledge and Non-malleable Commitments.",
                    "Smooth NIZK Arguments.",
                    "Round-Optimal Fully Black-Box Zero-Knowledge Arguments from One-Way Permutations.",
                    "Round Optimal Black-Box \"Commit-and-Prove\".",
                    "On the Power of Amortization in Secret Sharing: d-Uniform Secret Sharing and CDS with Constant Information Rate.",
                    "Information-Theoretic Secret-Key Agreement: The Asymptotically Tight Relation Between the Secret-Key Rate and the Channel Quality Ratio.",
                    "Information-Theoretic Broadcast with Dishonest Majority for Long Messages.",
                    "Oblivious Transfer in Incomplete Networks.",
                    "Injective Trapdoor Functions via Derandomization: How Strong is Rudich's Black-Box Barrier?",
                    "Enhancements are Blackbox Non-trivial: Impossibility of Enhanced Trapdoor Permutations from Standard Trapdoor Permutations.",
                    "Certifying Trapdoor Permutations, Revisited.",
                    "On the Security Loss of Unique Signatures.",
                    "On the Complexity of Fair Coin Flipping.",
                    "Game Theoretic Notions of Fairness in Multi-party Coin Toss.",
                    "Achieving Fair Treatment in Algorithmic Classification.",
                    "Upgrading to Functional Encryption.",
                    "Impossibility of Simulation Secure Functional Encryption Even with Random Oracles.",
                    "Registration-Based Encryption: Removing Private-Key Generator from IBE."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2018-2",
                "sub_name": "Theory of Cryptography - 16th International Conference, TCC 2018, Panaji, India, November 11-14, 2018, Proceedings, Part II.",
                "count": 25,
                "papers": [
                    "Topology-Hiding Computation Beyond Semi-Honest Adversaries.",
                    "Secure Computation Using Leaky Correlations (Asymptotically Optimal Constructions).",
                    "Fine-Grained Secure Computation.",
                    "On the Structure of Unconditional UC Hybrid Protocols.",
                    "Impossibility of Order-Revealing Encryption in Idealized Models.",
                    "A Ciphertext-Size Lower Bound for Order-Preserving Encryption with Limited Leakage.",
                    "Ciphertext Expansion in Limited-Leakage Order-Preserving Encryption: A Tight Computational Lower Bound.",
                    "Towards Tight Security of Cascaded LRW2.",
                    "Continuous NMC Secure Against Permutations and Overwrites, with Applications to CCA Secure Commitments.",
                    "Best Possible Information-Theoretic MPC.",
                    "Secure Certification of Mixed Quantum States with Application to Two-Party Randomness Generation.",
                    "Classical Proofs for the Quantum Collapsing Property of Classical Hash Functions.",
                    "Traitor-Tracing from LWE Made Simple and Attribute-Based.",
                    "Two-Message Statistically Sender-Private OT from LWE.",
                    "Adaptively Secure Distributed PRFs from \\mathsf LWE.",
                    "A Simple Construction of iO for Turing Machines.",
                    "Succinct Garbling Schemes from Functional Encryption Through a Local Simulation Paradigm.",
                    "FE and iO for Turing Machines from Minimal Assumptions.",
                    "The MMap Strikes Back: Obfuscation and New Multilinear Maps Immune to CLT13 Zeroizing Attacks.",
                    "Return of GGH15: Provable Security Against Zeroizing Attacks.",
                    "The Security of Lazy Users in Out-of-Band Authentication.",
                    "Is There an Oblivious RAM Lower Bound for Online Reads?",
                    "Perfectly Secure Oblivious Parallel RAM.",
                    "Watermarking PRFs Under Standard Assumptions: Public Marking and Security with Extraction Queries.",
                    "Exploring Crypto Dark Matter: - New Simple PRF Candidates and Their Applications."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th TCC 2017",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2017-1",
                "sub_name": "Theory of Cryptography - 15th International Conference, TCC 2017, Baltimore, MD, USA, November 12-15, 2017, Proceedings, Part I.",
                "count": 26,
                "papers": [
                    "Barriers to Black-Box Constructions of Traitor Tracing Systems.",
                    "On the Impossibility of Entropy Reversal, and Its Application to Zero-Knowledge Proofs.",
                    "Position-Based Cryptography and Multiparty Communication Complexity.",
                    "When Does Functional Encryption Imply Obfuscation?",
                    "Limits on the Locality of Pseudorandom Generators and Applications to Indistinguishability Obfuscation.",
                    "Decomposable Obfuscation: A Framework for Building Applications of Obfuscation from Polynomial Hardness.",
                    "Functional Encryption for Bounded Collusions, Revisited.",
                    "Attribute-Hiding Predicate Encryption in Bilinear Groups, Revisited.",
                    "Constrained Keys for Invertible Pseudorandom Functions.",
                    "Private Constrained PRFs (and More) from LWE.",
                    "The Edited Truth.",
                    "A Modular Analysis of the Fujisaki-Okamoto Transformation.",
                    "From Selective IBE to Full IBE and Selective HIBE.",
                    "Multi-key Authenticated Encryption with Corruptions: Reductions Are Lossy.",
                    "On the Depth-Robustness and Cumulative Pebbling Cost of Argon2i.",
                    "Bandwidth Hard Functions for ASIC Resistance.",
                    "Moderately Hard Functions: Definition, Instantiations, and Applications.",
                    "Overcoming Cryptographic Impossibility Results Using Blockchains.",
                    "Secure Two-Party Computation with Fairness - A Necessary Design Principle.",
                    "Designing Fully Secure Protocols for Secure Two-Party Computation of Constant-Domain Functions.",
                    "On Secure Two-Party Computation in Three Rounds.",
                    "Four Round Secure Computation Without Setup.",
                    "Round-Optimal Secure Two-Party Computation from Trapdoor Permutations.",
                    "Delayed-Input Non-Malleable Zero Knowledge and Multi-Party Coin Tossing in Four Rounds.",
                    "Round Optimal Concurrent MPC via Strong Simulation.",
                    "A Unified Approach to Constructing Black-Box UC Protocols in Trusted Setup Models."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2017-2",
                "sub_name": "Theory of Cryptography - 15th International Conference, TCC 2017, Baltimore, MD, USA, November 12-15, 2017, Proceedings, Part II.",
                "count": 25,
                "papers": [
                    "Actively Secure Garbled Circuits with Constant Communication Overhead in the Plain Model.",
                    "Adaptively Indistinguishable Garbled Circuits.",
                    "Circuit OPRAM: Unifying Statistically and Computationally Secure ORAMs and OPRAMs.",
                    "Resettably-Sound Resettable Zero Knowledge in Constant Rounds.",
                    "Round Optimal Concurrent Non-malleability from Polynomial Hardness.",
                    "Zero Knowledge Protocols from Succinct Constraint Detection.",
                    "How to Construct a Leakage-Resilient (Stateless) Trusted Party.",
                    "Blockwise p-Tampering Attacks on Cryptographic Primitives, Extractors, and Learners.",
                    "On Zero-Testable Homomorphic Encryption and Publicly Verifiable Non-interactive Arguments.",
                    "Inception Makes Non-malleable Codes Stronger.",
                    "Four-State Non-malleable Codes with Explicit Constant Rate.",
                    "Evolving Secret Sharing: Dynamic Thresholds and Robustness.",
                    "Linear Secret-Sharing Schemes for Forbidden Graph Access Structures.",
                    "Near-Optimal Secret Sharing and Error Correcting Codes in \\mathsf AC^0 AC 0.",
                    "Resource-Efficient OT Combiners with Active Security.",
                    "An Equivalence Between Attribute-Based Signatures and Homomorphic Signatures, and New Constructions for Both.",
                    "On the One-Per-Message Unforgeability of (EC)DSA and Its Variants.",
                    "A Generic Approach to Constructing and Proving Verifiable Random Functions.",
                    "Verifiable Random Functions from Non-interactive Witness-Indistinguishable Proofs.",
                    "Batched Multi-hop Multi-key FHE from Ring-LWE with Compact Ciphertext Extension.",
                    "Strengthening the Security of Encrypted Databases: Non-transitive JOINs.",
                    "Can We Access a Database Both Locally and Privately?",
                    "Towards Doubly Efficient Private Information Retrieval.",
                    "On Iterative Collision Search for LPN and Subset Sum.",
                    "Can PPAD Hardness be Based on Standard Cryptographic Assumptions?"
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2016b1",
                "sub_name": "Theory of Cryptography - 14th International Conference, TCC 2016-B, Beijing, China, October 31 - November 3, 2016, Proceedings, Part I.",
                "count": 25,
                "papers": [
                    "From Indifferentiability to Constructive Cryptography (and Back).",
                    "Fast Pseudorandom Functions Based on Expander Graphs.",
                    "3-Message Zero Knowledge Against Human Ignorance.",
                    "The GGM Function Family Is a Weakly One-Way Family of Functions.",
                    "On the (In)Security of SNARKs in the Presence of Oracles.",
                    "Leakage Resilient One-Way Functions: The Auxiliary-Input Setting.",
                    "Simulating Auxiliary Inputs, Revisited.",
                    "Pseudoentropy: Lower-Bounds for Chain Rules and Transformations.",
                    "Oblivious Transfer from Any Non-trivial Elastic Noisy Channel via Secret Key Agreement.",
                    "Simultaneous Secrecy and Reliability Amplification for a General Channel Model.",
                    "Proof of Space from Stacked Expanders.",
                    "Perfectly Secure Message Transmission in Two Rounds.",
                    "Almost-Optimally Fair Multiparty Coin-Tossing with Nearly Three-Quarters Malicious.",
                    "Binary AMD Circuits from Secure Multiparty Computation.",
                    "Composable Security in the Tamper-Proof Hardware Model Under Minimal Complexity.",
                    "Composable Adaptive Secure Protocols Without Setup Under Polytime Assumptions.",
                    "Adaptive Security of Yao's Garbled Circuits.",
                    "Efficient Secure Multiparty Computation with Identifiable Abort.",
                    "Secure Multiparty RAM Computation in Constant Rounds.",
                    "Constant-Round Maliciously Secure Two-Party Computation in the RAM Model.",
                    "More Efficient Constant-Round Multi-party Computation from BMR and SHE.",
                    "Cross and Clean: Amortized Garbled Circuits with Constant Overhead.",
                    "Separating Computational and Statistical Differential Privacy in the Client-Server Model.",
                    "Concentrated Differential Privacy: Simplifications, Extensions, and Lower Bounds.",
                    "Strong Hardness of Privacy from Weak Traitor Tracing."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2016b2",
                "sub_name": "Theory of Cryptography - 14th International Conference, TCC 2016-B, Beijing, China, October 31 - November 3, 2016, Proceedings, Part II.",
                "count": 21,
                "papers": [
                    "Delegating RAM Computations with Adaptive Soundness and Privacy.",
                    "Interactive Oracle Proofs.",
                    "Adaptive Succinct Garbled RAM or: How to Delegate Your Database.",
                    "Delegating RAM Computations.",
                    "Standard Security Does Not Imply Indistinguishability Under Selective Opening.",
                    "Public-Key Encryption with Simulation-Based Selective-Opening Security and Compact Ciphertexts.",
                    "Towards Non-Black-Box Separations of Public Key Encryption and One Way Function.",
                    "Post-Quantum Security of the Fujisaki-Okamoto and OAEP Transforms.",
                    "Multi-key FHE from LWE, Revisited.",
                    "Secure Obfuscation in a Weak Multilinear Map Model.",
                    "Virtual Grey-Boxes Beyond Obfuscation: A Statistical Security Notion for Cryptographic Agents.",
                    "Deniable Attribute Based Encryption for Branching Programs from LWE.",
                    "Targeted Homomorphic Attribute-Based Encryption.",
                    "Semi-adaptive Security and Bundling Functionalities Made Generic and Easy.",
                    "From Cryptomania to Obfustopia Through Secret-Key Functional Encryption.",
                    "Single-Key to Multi-Key Functional Encryption with Polynomial Loss.",
                    "Compactness vs Collusion Resistance in Functional Encryption.",
                    "Threshold Secret Sharing Requires a Linear Size Alphabet.",
                    "How to Share a Secret, Infinitely.",
                    "Designing Proof of Human-Work Puzzles for Cryptocurrency and Beyond.",
                    "Access Control Encryption: Enforcing Information Flow with Cryptography."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2016a1",
                "sub_name": "Theory of Cryptography - 13th International Conference, TCC 2016-A, Tel Aviv, Israel, January 10-13, 2016, Proceedings, Part I.",
                "count": 25,
                "papers": [
                    "Impossibility of VBB Obfuscation with Ideal Constant-Degree Graded Encodings.",
                    "On the Impossibility of Virtual Black-Box Obfuscation in Idealized Models.",
                    "Lower Bounds on Assumptions Behind Indistinguishability Obfuscation.",
                    "Indistinguishability Obfuscation: From Approximate to Exact.",
                    "Output-Compressing Randomized Encodings and Applications.",
                    "Functional Encryption for Turing Machines.",
                    "The Complexity of Computing the Optimal Composition of Differential Privacy.",
                    "Order-Revealing Encryption and the Hardness of Private Learning.",
                    "On the Hardness of Learning with Rounding over Small Modulus.",
                    "Two-Round Man-in-the-Middle Security from LPN.",
                    "Algebraic Partitioning: Fully Compact and (almost) Tightly Secure Cryptography.",
                    "Standard Security Does Imply Security Against Selective Opening for Markov Distributions.",
                    "Non-Malleable Encryption: Simpler, Shorter, Stronger.",
                    "Verifiable Random Functions from Standard Assumptions.",
                    "Homomorphic Evaluation Requires Depth.",
                    "On Basing Private Information Retrieval on NP-Hardness.",
                    "On the Correlation Intractability of Obfuscated Pseudorandom Functions.",
                    "Reconfigurable Cryptography: A Flexible Approach to Long-Term Security.",
                    "Multilinear Maps from Obfuscation.",
                    "Perfect Structure on the Edge of Chaos - Trapdoor Permutations from Indistinguishability Obfuscation.",
                    "Cryptographic Assumptions: A Position Paper.",
                    "Adaptive Security with Quasi-Optimal Rate.",
                    "On the Complexity of Additively Homomorphic UC Commitments.",
                    "Simplified Universal Composability Framework.",
                    "Characterization of Secure Multiparty Computation Without Broadcast."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2016a2",
                "sub_name": "Theory of Cryptography - 13th International Conference, TCC 2016-A, Tel Aviv, Israel, January 10-13, 2016, Proceedings, Part II.",
                "count": 21,
                "papers": [
                    "Making the Best of a Leaky Situation: Zero-Knowledge PCPs from Leakage-Resilient Circuits.",
                    "Quasi-Linear Size Zero Knowledge from Linear-Algebraic PCPs.",
                    "From Private Simultaneous Messages to Zero-Information Arthur-Merlin Protocols and Back.",
                    "A Transform for NIZK Almost as Efficient and General as the Fiat-Shamir Transform Without Programmable Random Oracles.",
                    "Improved OR-Composition of Sigma-Protocols.",
                    "Onion ORAM: A Constant Bandwidth Blowup Oblivious RAM.",
                    "Oblivious Parallel RAM and Applications.",
                    "Oblivious Parallel RAM: Improved Efficiency and Generic Constructions.",
                    "Déjà Q: Encore! Un Petit IBE.",
                    "A Study of Pair Encodings: Predicate Encryption in Prime Order Groups.",
                    "Optimal Amplification of Noisy Leakages.",
                    "Rational Sumchecks.",
                    "Interactive Coding for Interactive Proofs.",
                    "Information-Theoretic Local Non-malleable Codes and Their Applications.",
                    "Optimal Computational Split-state Non-malleable Codes.",
                    "How to Avoid Obfuscation Using Witness PRFs.",
                    "Cutting-Edge Cryptography Through the Lens of Secret Sharing.",
                    "Functional Encryption Without Obfuscation.",
                    "On Constructing One-Way Permutations from Indistinguishability Obfuscation.",
                    "Contention in Cryptoland: Obfuscation, Leakage and UCE.",
                    "Point-Function Obfuscation: A Framework and Generic Constructions."
                ]
            }
        ]
    },
    {
        "year": "2016b",
        "name": "14th TCC 2016",
        "info": "Beijing, China",
        "venues": []
    },
    {
        "year": "2016a",
        "name": "13th TCC 2016",
        "info": "Tel Aviv, Israel",
        "venues": []
    },
    {
        "year": "2015",
        "name": "12th TCC 2015",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2015-1",
                "sub_name": "Theory of Cryptography - 12th Theory of Cryptography Conference, TCC 2015, Warsaw, Poland, March 23-25, 2015, Proceedings, Part I.",
                "count": 26,
                "papers": [
                    "On Basing Size-Verifiable One-Way Functions on NP-Hardness.",
                    "The Randomized Iterate, Revisited - Almost Linear Seed Length PRGs from a Broader Class of One-Way Functions.",
                    "The Power of Negations in Cryptography.",
                    "From Weak to Strong Zero-Knowledge and Applications.",
                    "An Efficient Transform from Sigma Protocols to NIZK with a CRS and Non-programmable Random Oracle.",
                    "On the Indifferentiability of Key-Alternating Feistel Ciphers with No Key Derivation.",
                    "A Little Honesty Goes a Long Way - The Two-Tier Model for Secure Multiparty Computation.",
                    "Topology-Hiding Computation.",
                    "Secure Physical Computation Using Disposable Circuits.",
                    "Complete Characterization of Fairness in Secure Two-Party Computation of Boolean Functions.",
                    "Richer Efficiency/Security Trade-offs in 2PC.",
                    "Round-Efficient Concurrently Composable Secure Computation via a Robust Extraction Lemma.",
                    "An Alternative Approach to Non-black-box Simulation in Fully Concurrent Setting.",
                    "General Statistically Secure Computation with Bounded-Resettable Hardware Tokens.",
                    "Resettably Sound Zero-Knowledge Arguments from OWFs - The (Semi) Black-Box Way.",
                    "A Rate-Optimizing Compiler for Non-malleable Codes Against Bit-Wise Tampering and Permutations.",
                    "Leakage-Resilient Non-malleable Codes.",
                    "Locally Decodable and Updatable Non-malleable Codes and Their Applications.",
                    "Tamper Detection and Continuous Non-malleable Codes.",
                    "Optimal Algebraic Manipulation Detection Codes in the Constant-Error Model.",
                    "Non-malleable Condensers for Arbitrary Min-entropy, and Almost Optimal Protocols for Privacy Amplification.",
                    "From Single-Bit to Multi-bit Public-Key Encryption via Non-malleable Codes.",
                    "Constructing and Understanding Chosen Ciphertext Security via Puncturable Key Encapsulation Mechanisms.",
                    "Non-committing Encryption from Φ-hiding.",
                    "On the Regularity of Lossy RSA - Improved Bounds and Applications to Padding-Based Encryption.",
                    "Tightly-Secure Authenticated Key Exchange."
                ]
            },
            {
                "sub_name_abbr": "conf/tcc/2015-2",
                "sub_name": "Theory of Cryptography - 12th Theory of Cryptography Conference, TCC 2015, Warsaw, Poland, March 23-25, 2015, Proceedings, Part II.",
                "count": 26,
                "papers": [
                    "Constrained Key-Homomorphic PRFs from Standard Lattice Assumptions - Or: How to Secretly Embed a Circuit in Your PRF.",
                    "Key-Homomorphic Constrained Pseudorandom Functions.",
                    "Aggregate Pseudorandom Functions and Connections to Learning.",
                    "Oblivious Polynomial Evaluation and Secure Set-Intersection from Algebraic PRFs.",
                    "Verifiable Random Functions from Weaker Assumptions.",
                    "Multi-Client Verifiable Computation with Stronger Security Guarantees.",
                    "Public Verification of Private Effort.",
                    "Primary-Secondary-Resolver Membership Proof Systems.",
                    "Tight Parallel Repetition Theorems for Public-Coin Arguments Using KL-Divergence.",
                    "Stretching Groth-Sahai: NIZK Proofs of Partial Satisfiability.",
                    "Outlier Privacy.",
                    "Function-Private Functional Encryption in the Private-Key Setting.",
                    "Functional Encryption for Randomized Functionalities.",
                    "Functional Encryption for Randomized Functionalities in the Private-Key Setting from Minimal Assumptions.",
                    "Separations in Circular Security for Arbitrary Length Key Cycles.",
                    "ZAPs and Non-Interactive Witness Indistinguishability from Indistinguishability Obfuscation.",
                    "Random-Oracle Uninstantiability from Indistinguishability Obfuscation.",
                    "On Obfuscation with Random Oracles.",
                    "Obfuscation of Probabilistic Circuits and Applications.",
                    "Graph-Induced Multilinear Maps from Lattices.",
                    "Obfuscating Circuits via Composite-Order Graded Encoding.",
                    "Adaptively Secure Two-Party Computation from Indistinguishability Obfuscation.",
                    "Adaptively Secure, Universally Composable, Multiparty Computation in Constant Rounds.",
                    "Two-Round Adaptively Secure MPC from Indistinguishability Obfuscation.",
                    "Obfuscation-Based Non-black-box Simulation and Four Message Concurrent Zero Knowledge for NP.",
                    "Public-Coin Differing-Inputs Obfuscation and Its Applications."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th TCC 2014",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2014",
                "sub_name": "Theory of Cryptography - 11th Theory of Cryptography Conference, TCC 2014, San Diego, CA, USA, February 24-26, 2014. Proceedings.",
                "count": 30,
                "papers": [
                    "Virtual Black-Box Obfuscation for All Circuits via Generic Graded Encoding.",
                    "Obfuscation for Evasive Functions.",
                    "On Extractability Obfuscation.",
                    "Two-Round Secure MPC from Indistinguishability Obfuscation.",
                    "Chosen Ciphertext Security via Point Obfuscation.",
                    "Probabilistically Checkable Proofs of Proximity with Zero-Knowledge.",
                    "Achieving Constant Round Leakage-Resilient Zero-Knowledge.",
                    "Statistical Concurrent Non-malleable Zero Knowledge.",
                    "4-Round Resettably-Sound Zero Knowledge.",
                    "Can Optimally-Fair Coin Tossing Be Based on One-Way Functions?",
                    "On the Power of Public-Key Encryption in Secure Computation.",
                    "On the Impossibility of Basing Public-Coin One-Way Permutations on Trapdoor Permutations.",
                    "Towards Characterizing Complete Fairness in Secure Two-Party Computation.",
                    "On the Cryptographic Complexity of the Worst Functions.",
                    "Constant-Round Black-Box Construction of Composable Multi-Party Computation Protocol.",
                    "One-Sided Adaptively Secure Two-Party Computation.",
                    "Multi-linear Secret-Sharing Schemes.",
                    "Broadcast Amplification.",
                    "Non-malleable Coding against Bit-Wise and Split-State Tampering.",
                    "Continuous Non-malleable Codes.",
                    "Locally Updatable and Locally Decodable Codes.",
                    "Leakage Resilient Fully Homomorphic Encryption.",
                    "Securing Circuits and Protocols against 1/poly(k) Tampering Rate.",
                    "How to Fake Auxiliary Input.",
                    "Standard versus Selective Opening Security: Separation and Equivalence Results.",
                    "Dual System Encryption via Predicate Encodings.",
                    "(Efficient) Universally Composable Oblivious Transfer Using a Minimal Number of Stateless Tokens.",
                    "Lower Bounds in the Hardware Token Model.",
                    "Unified, Minimal and Selectively Randomizable Structure-Preserving Signatures.",
                    "On the Impossibility of Structure-Preserving Deterministic Primitives."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th TCC 2013",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2013",
                "sub_name": "Theory of Cryptography - 10th Theory of Cryptography Conference, TCC 2013, Tokyo, Japan, March 3-6, 2013. Proceedings.",
                "count": 41,
                "papers": [
                    "Overcoming Weak Expectations.",
                    "A Counterexample to the Chain Rule for Conditional HILL Entropy - And What Deniable Encryption Has to Do with It.",
                    "Hardness Preserving Reductions via Cuckoo Hashing.",
                    "Concurrent Zero Knowledge in the Bounded Player Model.",
                    "Public-Coin Concurrent Zero-Knowledge in the Global Hash Model.",
                    "Succinct Malleable NIZKs and an Application to Compact Shuffles.",
                    "Encrypted Messages from the Heights of Cryptomania.",
                    "Attribute-Based Functional Encryption on Lattices.",
                    "When Homomorphism Becomes a Liability.",
                    "Garbling XOR Gates \"For Free\" in the Standard Model.",
                    "Why \"Fiat-Shamir for Proofs\" Lacks a Proof.",
                    "On the (In)security of Fischlin's Paradigm.",
                    "Signatures of Correct Computation.",
                    "A Full Characterization of Functions that Imply Fair Coin Tossing and Ramifications to Fairness.",
                    "Characterizing the Cryptographic Properties of Reactive 2-Party Functionalities.",
                    "Feasibility and Completeness of Cryptographic Tasks in the Quantum World.",
                    "Languages with Efficient Zero-Knowledge PCPs are in SZK.",
                    "Succinct Non-interactive Arguments via Linear Interactive Proofs.",
                    "Erratum: Succinct Non-interactive Arguments via Linear Interactive Proofs.",
                    "Unprovable Security of Perfect NIZK and Non-interactive Non-malleable Commitments.",
                    "Secure Computation for Big Data.",
                    "Communication Locality in Secure Multi-party Computation - How to Run Sublinear Algorithms in a Distributed Setting.",
                    "Distributed Oblivious RAM for Secure Two-Party Computation.",
                    "Black-Box Proof of Knowledge of Plaintext and Multiparty Computation with Low Communication Overhead.",
                    "Testing the Lipschitz Property over Product Distributions with Applications to Data Privacy.",
                    "Limits on the Usefulness of Random Oracles.",
                    "Analyzing Graphs with Node Differential Privacy.",
                    "Universally Composable Synchronous Computation.",
                    "Multi-Client Non-interactive Verifiable Computation.",
                    "On the Feasibility of Extending Oblivious Transfer.",
                    "Computational Soundness of Coinductive Symbolic Security under Active Attacks.",
                    "Revisiting Lower and Upper Bounds for Selective Decommitments.",
                    "On the Circular Security of Bit-Encryption.",
                    "Cryptographic Hardness of Random Local Functions-Survey.",
                    "On the Power of Correlated Randomness in Secure Computation.",
                    "Constant-Overhead Secure Computation of Boolean Circuits using Preprocessing.",
                    "Implementing Resettable UC-Functionalities with Untrusted Tamper-Proof Hardware-Tokens.",
                    "A Cookbook for Black-Box Separations and a Recipe for UOWHFs.",
                    "Algebraic (Trapdoor) One-Way Functions and Their Applications.",
                    "Randomness-Dependent Message Security.",
                    "Errata to (Nearly) Round-Optimal Black-Box Constructions of Commitments Secure against Selective Opening Attacks."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th TCC 2012",
        "info": "Taormina, Sicily, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2012",
                "sub_name": "Theory of Cryptography - 9th Theory of Cryptography Conference, TCC 2012, Taormina, Sicily, Italy, March 19-21, 2012. Proceedings.",
                "count": 36,
                "papers": [
                    "Computing on Authenticated Data.",
                    "Identifying Cheaters without an Honest Majority.",
                    "On the Security of the \"Free-XOR\" Technique.",
                    "Secure Two-Party Computation with Low Communication.",
                    "Non-interactive CCA-Secure Threshold Cryptosystems with Adaptive Security: New Framework and Constructions.",
                    "Round-Optimal Privacy-Preserving Protocols with Smooth Projective Hash Functions.",
                    "On the Instantiability of Hash-and-Sign RSA Signatures.",
                    "Beyond the Limitation of Prime-Order Bilinear Groups, and Round Optimal Blind Signatures.",
                    "On Efficient Zero-Knowledge PCPs.",
                    "Progression-Free Sets and Sublinear Pairing-Based Non-Interactive Zero-Knowledge Arguments.",
                    "Point Obfuscation and 3-Round Zero-Knowledge.",
                    "Confidentiality and Integrity: A Constructive Perspective.",
                    "Leakage-Resilient Circuits without Computational Assumptions.",
                    "A Parallel Repetition Theorem for Leakage Resilience.",
                    "Leakage-Tolerant Interactive Protocols.",
                    "On the Public Indifferentiability and Correlation Intractability of the 6-Round Feistel Construction.",
                    "Collisions Are Not Incidental: A Compression Function Exploiting Discrete Geometry.",
                    "Lower Bounds in Differential Privacy.",
                    "Iterative Constructions and Private Data Release.",
                    "From Non-adaptive to Adaptive Pseudorandom Functions.",
                    "Hardness Preserving Constructions of Pseudorandom Functions.",
                    "Computational Extractors and Pseudorandomness.",
                    "Functional Re-encryption and Collusion-Resistant Obfuscation.",
                    "How to Delegate and Verify in Public: Verifiable Computation from Attribute-Based Encryption.",
                    "On Black-Box Reductions between Predicate Encryption Schemes.",
                    "Lossy Functions Do Not Amplify Well.",
                    "Counterexamples to Hardness Amplification beyond Negligible.",
                    "Resettable Statistical Zero Knowledge.",
                    "The Knowledge Tightness of Parallel Zero-Knowledge.",
                    "Simultaneously Resettable Arguments of Knowledge.",
                    "Subspace LWE.",
                    "Bounded-Collusion IBE from Key Homomorphism.",
                    "A Unified Approach to Deterministic Encryption: New Constructions and a Connection to Computational Entropy.",
                    "A Dichotomy for Local Small-Bias Generators.",
                    "Randomness Condensers for Efficiently Samplable, Seed-Dependent Sources.",
                    "Uniqueness Is a Different Story: Impossibility of Verifiable Random Functions from Trapdoor Permutations."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th TCC 2011",
        "info": "Providence, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2011",
                "sub_name": "Theory of Cryptography - 8th Theory of Cryptography Conference, TCC 2011, Providence, RI, USA, March 28-30, 2011. Proceedings.",
                "count": 37,
                "papers": [
                    "Input Locality and Hardness Amplification.",
                    "General Hardness Amplification of Predicates and Puzzles - (Extended Abstract).",
                    "Security Amplification for the Cascade of Arbitrarily Weak PRPs: Tight Bounds via the Interactive Hardcore Lemma.",
                    "Dense Model Theorems and Their Applications.",
                    "Parallel Repetition for Leakage Resilience Amplification Revisited.",
                    "Achieving Leakage Resilience through Dual System Encryption.",
                    "Signatures Resilient to Continual Leakage on Memory and Computation.",
                    "After-the-Fact Leakage in Public-Key Encryption.",
                    "One-Time Computable Self-erasing Functions.",
                    "Perfectly Secure Oblivious RAM without Random Oracles.",
                    "Unconditional and Composable Security Using a Single Stateful Tamper-Proof Hardware Token.",
                    "Correlated-Input Secure Hash Functions.",
                    "Black-Box Circular-Secure Encryption beyond Affine Functions.",
                    "Homomorphic Encryption: From Private-Key to Public-Key.",
                    "Identity-Based Encryption Secure against Selective Opening Attack.",
                    "Functional Encryption: Definitions and Challenges.",
                    "Concurrent Non-Malleable Zero Knowledge with Adaptive Inputs.",
                    "Round-Optimal Password-Based Authenticated Key Exchange.",
                    "Bringing People of Different Beliefs Together to Do UC.",
                    "Secure Two-Party Computation via Cut-and-Choose Oblivious Transfer.",
                    "Practical Adaptive Oblivious Transfer from Simple Assumptions.",
                    "Completeness Theorems with Constructive Proofs for Finite Deterministic 2-Party Functions.",
                    "A Zero-One Law for Secure Multi-party Computation with Ternary Outputs.",
                    "PCPs and the Hardness of Generating Private Synthetic Data.",
                    "Limits of Computational Differential Privacy in the Client/Server Setting.",
                    "Towards Privacy for Social Networks: A Zero-Knowledge Based Definition of Privacy.",
                    "On the Black-Box Complexity of Optimally-Fair Coin Tossing.",
                    "Tight Bounds for Classical and Quantum Coin Flipping.",
                    "Exploring the Limits of Common Coins Using Frontier Analysis of Protocols.",
                    "Limits on the Stretch of Non-adaptive Constructions of Pseudo-Random Generators.",
                    "On the Complexity of Non-adaptively Increasing the Stretch of Pseudorandom Generators.",
                    "Concurrent Security and Non-malleability.",
                    "(Nearly) Round-Optimal Black-Box Constructions of Commitments Secure against Selective Opening Attacks.",
                    "Limits on the Power of Zero-Knowledge Proofs in Cryptographic Constructions.",
                    "Towards Non-Black-Box Lower Bounds in Cryptography.",
                    "On Black-Box Separations among Injective One-Way Functions.",
                    "Impossibility of Blind Signatures from One-Way Permutations."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th TCC 2010",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2010",
                "sub_name": "Theory of Cryptography, 7th Theory of Cryptography Conference, TCC 2010, Zurich, Switzerland, February 9-11, 2010. Proceedings.",
                "count": 35,
                "papers": [
                    "An Efficient Parallel Repetition Theorem.",
                    "Parallel Repetition Theorems for Interactive Arguments.",
                    "Almost Optimal Bounds for Direct Product Threshold Theorem.",
                    "On Symmetric Encryption and Point Obfuscation.",
                    "Obfuscation of Hyperplane Membership.",
                    "Secure Computation and Its Diverse Applications.",
                    "On Complete Primitives for Fairness.",
                    "On the Necessary and Sufficient Assumptions for UC Computation.",
                    "From Passive to Covert Security at Low Cost.",
                    "A Twist on the Naor-Yung Paradigm and Its Application to Efficient CCA-Secure Encryption from Hard Search Problems.",
                    "Two Is a Crowd? A Black-Box Separation of One-Wayness and Security under Correlated Inputs.",
                    "Efficient, Robust and Constant-Round Distributed RSA Key Generation.",
                    "Threshold Decryption and Zero-Knowledge Proofs for Lattice-Based Cryptosystems.",
                    "Ideal Hierarchical Secret Sharing Schemes.",
                    "A Hardcore Lemma for Computational Indistinguishability: Security Amplification for Arbitrarily Weak PRGs with Optimal Stretch.",
                    "On Related-Secret Pseudorandomness.",
                    "A Domain Extender for the Ideal Cipher.",
                    "Delayed-Key Message Authentication for Streams.",
                    "Founding Cryptography on Tamper-Proof Hardware Tokens.",
                    "Truly Efficient String Oblivious Transfer Using Resettable Tamper-Proof Tokens.",
                    "Leakage-Resilient Signatures.",
                    "Public-Key Encryption Schemes with Auxiliary Inputs.",
                    "Public-Key Cryptographic Primitives Provably as Secure as Subset Sum.",
                    "Rationality in the Full-Information Model.",
                    "Efficient Rational Secret Sharing in Standard Communication Networks.",
                    "Bounds on the Sample Complexity for Private Learning and Private Data Release.",
                    "New Techniques for Dual System Encryption and Fully Secure HIBE with Short Ciphertexts.",
                    "Robust Encryption.",
                    "Privacy-Enhancing Cryptography: From Theory into Practice.",
                    "Concise Mercurial Vector Commitments and Independent Zero-Knowledge Sets with Short Proofs.",
                    "Eye for an Eye: Efficient Concurrent Zero-Knowledge in the Timing Model.",
                    "Efficiency Preserving Transformations for Concurrent Non-malleable Zero Knowledge.",
                    "Efficiency Limitations for Σ-Protocols for Group Homomorphisms.",
                    "Composition of Zero-Knowledge Proofs with Efficient Provers.",
                    "Private Coins versus Public Coins in Zero-Knowledge Proof Systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th TCC 2009",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2009",
                "sub_name": "Theory of Cryptography, 6th Theory of Cryptography Conference, TCC 2009, San Francisco, CA, USA, March 15-17, 2009. Proceedings.",
                "count": 35,
                "papers": [
                    "An Optimally Fair Coin Toss.",
                    "Complete Fairness in Multi-party Computation without an Honest Majority.",
                    "Fairness with an Honest Minority and a Rational Majority.",
                    "Purely Rational Secret Sharing (Extended Abstract).",
                    "Some Recent Progress in Lattice-Based Cryptography.",
                    "Non-malleable Obfuscation.",
                    "Simulation-Based Concurrent Non-malleable Commitments and Decommitments.",
                    "Proofs of Retrievability via Hardness Amplification.",
                    "Security Amplification for InteractiveCryptographic Primitives.",
                    "Composability and On-Line Deniability of Authentication.",
                    "Authenticated Adversarial Routing.",
                    "Adaptive Zero-Knowledge Proofs and Adaptively Secure Oblivious Transfer.",
                    "On the (Im)Possibility of Key Dependent Encryption.",
                    "On the (Im)Possibility of Arthur-Merlin Witness Hiding Protocols.",
                    "Secure Computability of Functions in the IT Setting with Dishonest Majority and Applications to Long-Term Security.",
                    "Complexity of Multi-party Computation Problems: The Case of 2-Party Symmetric Secure Function Evaluation.",
                    "Realistic Failures in Secure Multi-party Computation.",
                    "Secure Arithmetic Computation with No Honest Majority.",
                    "Universally Composable Multiparty Computation with Partially Isolated Parties.",
                    "Oblivious Transfer from Weak Noisy Channels.",
                    "Composing Quantum Protocols in a Classical Environment.",
                    "LEGO for Two-Party Secure Computation.",
                    "Simple, Black-Box Constructions of Adaptively Secure Protocols.",
                    "Black-Box Constructions of Two-Party Protocols from One-Way Functions.",
                    "Chosen-Ciphertext Security via Correlated Products.",
                    "Hierarchical Identity Based Encryption with Polynomially Many Levels.",
                    "Predicate Privacy in Encryption Systems.",
                    "Simultaneous Hardcore Bits and Cryptography against Memory Attacks.",
                    "The Differential Privacy Frontier (Extended Abstract).",
                    "How Efficient Can Memory Checking Be?.",
                    "Goldreich's One-Way Function Candidate and Myopic Backtracking Algorithms.",
                    "Secret Sharing and Non-Shannon Information Inequalities.",
                    "Weak Verifiable Random Functions.",
                    "Efficient Oblivious Pseudorandom Function with Applications to Adaptive OT and Secure Computation of Set Intersection.",
                    "Towards a Theory of Extractable Functions."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th TCC 2008",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2008",
                "sub_name": "Theory of Cryptography, Fifth Theory of Cryptography Conference, TCC 2008, New York, USA, March 19-21, 2008.",
                "count": 34,
                "papers": [
                    "Incrementally Verifiable Computation or Proofs of Knowledge Imply Time/Space Efficiency.",
                    "On Seed-Incompressible Functions.",
                    "Asymptotically Efficient Lattice-Based Digital Signatures.",
                    "Basing Weak Public-Key Cryptography on Strong One-Way Functions.",
                    "Which Languages Have 4-Round Zero-Knowledge Proofs?",
                    "How to Achieve Perfect Simulation and A Complete Problem for Non-interactive Perfect Zero-Knowledge.",
                    "General Properties of Quantum Zero-Knowledge Proofs.",
                    "The Layered Games Framework for Specifications and Analysis of Security Protocols.",
                    "Universally Composable Multi-party Computation with an Unreliable Common Reference String.",
                    "Efficient Protocols for Set Intersection and Pattern Matching with Security Against Malicious and Covert Adversaries.",
                    "Fast Private Norm Estimation and Heavy Hitters.",
                    "Matroids Can Be Far from Ideal Secret Sharing.",
                    "Perfectly-Secure MPC with Linear Communication Complexity.",
                    "MPC vs. SFE: Perfect Security in a Unified Corruption Model.",
                    "Bridging Game Theory and Cryptography: Recent Results and Future Directions.",
                    "Verifiably Secure Devices.",
                    "Lower Bounds on Implementing Robust and Resilient Mediators.",
                    "Cryptography and Game Theory: Designing Protocols for Exchanging Information.",
                    "Equivocal Blind Signatures and Adaptive UC-Security.",
                    "P-signatures and Noninteractive Anonymous Credentials.",
                    "Multi-property Preserving Combiners for Hash Functions.",
                    "OT-Combiners via Secure Computation.",
                    "Semi-honest to Malicious Oblivious Transfer - The Black-Box Way.",
                    "Black-Box Construction of a Non-malleable Encryption Scheme from Any Semantically Secure One.",
                    "A Linear Lower Bound on the Communication Complexity of Single-Server Private Information Retrieval.",
                    "Randomness Extraction Via delta -Biased Masking in the Presence of a Quantum Attacker.",
                    "An Equivalence Between Zero Knowledge and Commitments.",
                    "Interactive and Noninteractive Zero Knowledge are Equivalent in the Help Model.",
                    "The Round-Complexity of Black-Box Zero-Knowledge: A Combinatorial Characterization.",
                    "On Constant-Round Concurrent Zero-Knowledge.",
                    "Concurrent Non-malleable Commitments from Any One-Way Function.",
                    "Faster and Shorter Password-Authenticated Key Exchange.",
                    "Saving Private Randomness in One-Way Functions and Pseudorandom Generators.",
                    "Degradation and Amplification of Computational Hardness."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th TCC 2007",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2007",
                "sub_name": "Theory of Cryptography, 4th Theory of Cryptography Conference, TCC 2007, Amsterdam, The Netherlands, February 21-24, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "Does Privacy Require True Randomness?",
                    "Tackling Adaptive Corruptions in Multicast Encryption Protocols.",
                    "Long-Term Security and Universal Composability.",
                    "Universally Composable Security with Global Setup.",
                    "Parallel Repetition of Computationally Sound Protocols Revisited.",
                    "Lower Bounds for Non-interactive Zero-Knowledge.",
                    "Perfect NIZK with Adaptive Soundness.",
                    "Security Against Covert Adversaries: Efficient Protocols for Realistic Adversaries.",
                    "On the Necessity of Rewinding in Secure Multiparty Computation.",
                    "On Expected Probabilistic Polynomial-Time Adversaries: A Suggestion for Restricted Definitions and Their Benefits.",
                    "On Best-Possible Obfuscation.",
                    "Obfuscation for Cryptographic Purposes.",
                    "Securely Obfuscating Re-encryption.",
                    "Weakly-Private Secret Sharing Schemes.",
                    "On Secret Sharing Schemes, Matroids and Polymatroids.",
                    "Secure Linear Algebra Using Linearly Recurrent Sequences.",
                    "Towards Optimal and Efficient Perfectly Secure Message Transmission.",
                    "Concurrently-Secure Blind Signatures Without Random Oracles or Setup Assumptions.",
                    "Designated Confirmer Signatures Revisited.",
                    "From Weak to Strong Watermarking.",
                    "Private Approximation of Clustering and Vertex Cover.",
                    "Robuster Combiners for Oblivious Transfer.",
                    "One-Way Permutations, Interactive Hashing and Statistically Hiding Commitments.",
                    "Towards a Separation of Semantic and CCA Security for Public Key Encryption.",
                    "Unifying Classical and Quantum Key Distillation.",
                    "Intrusion-Resilient Key Exchange in the Bounded Retrieval Model.",
                    "(Password) Authenticated Key Establishment: From 2-Party to Group.",
                    "Multi-authority Attribute Based Encryption.",
                    "Conjunctive, Subset, and Range Queries on Encrypted Data.",
                    "How to Shuffle in Public.",
                    "Evaluating Branching Programs on Encrypted Data."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd TCC 2006",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2006",
                "sub_name": "Theory of Cryptography, Third Theory of Cryptography Conference, TCC 2006, New York, NY, USA, March 4-7, 2006, Proceedings.",
                "count": 31,
                "papers": [
                    "Concurrent Zero Knowledge Without Complexity Assumptions.",
                    "Interactive Zero-Knowledge with Restricted Random Oracles.",
                    "Non-interactive Zero-Knowledge from Homomorphic Encryption.",
                    "Ring Signatures: Stronger Definitions, and Constructions Without Random Oracles.",
                    "Efficient Blind and Partially Blind Signatures Without Random Oracles.",
                    "Key Exchange Using Passwords and Long Keys.",
                    "Mercurial Commitments: Minimal Assumptions and Efficient Constructions.",
                    "Efficient Collision-Resistant Hashing from Worst-Case Assumptions on Cyclic Lattices.",
                    "On Error Correction in the Exponent.",
                    "On the Relation Between the Ideal Cipher and the Random Oracle Models.",
                    "Intrusion-Resilience Via the Bounded-Storage Model.",
                    "Perfectly Secure Password Protocols in the Bounded Retrieval Model.",
                    "Polylogarithmic Private Approximations and Efficient Matching.",
                    "Calibrating Noise to Sensitivity in Private Data Analysis.",
                    "Unconditionally Secure Constant-Rounds Multi-party Computation for Equality, Comparison, Bits and Exponentiation.",
                    "Efficient Multi-party Computation with Dispute Control.",
                    "Round-Optimal and Efficient Verifiable Secret Sharing.",
                    "Generalized Environmental Security from Number Theoretic Assumptions.",
                    "Games and the Impossibility of Realizable Ideal Functionality.",
                    "Universally Composable Symbolic Analysis of Mutual Authentication and Key-Exchange Protocols.",
                    "Resource Fairness and Composability of Cryptographic Protocols.",
                    "Finding Pessiland.",
                    "Pseudorandom Generators from One-Way Functions: A Simple Construction for Any Hardness.",
                    "On the Complexity of Parallel Hardness Amplification for One-Way Functions.",
                    "On Matroids and Non-ideal Secret Sharing.",
                    "Secure Computation with Partial Message Loss.",
                    "Communication Efficient Secure Linear Algebra.",
                    "Threshold and Proactive Pseudo-Random Permutations.",
                    "PRF Domain Extension Using DAGs.",
                    "Chosen-Ciphertext Security from Tag-Based Encryption.",
                    "Separating Sources for Encryption and Secret Sharing."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd TCC 2005",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2005",
                "sub_name": "Theory of Cryptography, Second Theory of Cryptography Conference, TCC 2005, Cambridge, MA, USA, February 10-12, 2005, Proceedings.",
                "count": 32,
                "papers": [
                    "Optimal Error Correction Against Computationally Bounded Noise.",
                    "Hardness Amplification of Weakly Verifiable Puzzles.",
                    "On Hardness Amplification of One-Way Functions.",
                    "Cryptography in Subgroups of Zn.",
                    "Efficiently Constructible Huge Graphs That Preserve First Order Properties of Random Graphs.",
                    "Comparing Two Notions of Simulatability.",
                    "Relaxing Environmental Security: Monitored Functionalities and Client-Server Computation.",
                    "Handling Expected Polynomial-Time Strategies in Simulation-Based Security Proofs.",
                    "Adaptively-Secure, Non-interactive Public-Key Encryption.",
                    "Adaptive Security of Symbolic Encryption.",
                    "Chosen-Ciphertext Security of Multiple Encryption.",
                    "Public-Key Steganography with Active Attacks.",
                    "Upper and Lower Bounds on Black-Box Steganography.",
                    "Fair-Zero Knowledge.",
                    "How to Securely Outsource Cryptographic Computations.",
                    "Secure Computation of the Mean and Related Statistics.",
                    "Keyword Search and Oblivious Pseudorandom Functions.",
                    "Evaluating 2-DNF Formulas on Ciphertexts.",
                    "Share Conversion, Pseudorandom Secret-Sharing and Applications to Secure Computation.",
                    "Toward Privacy in Public Databases.",
                    "The Universal Composable Security of Quantum Key Distribution.",
                    "Universally Composable Privacy Amplification Against Quantum Adversaries.",
                    "A Universally Composable Secure Channel Based on the KEM-DEM Framework.",
                    "Sufficient Conditions for Collision-Resistant Hashing.",
                    "The Relationship Between Password-Authenticated Key Exchange and Other Cryptographic Primitives.",
                    "On the Relationships Between Notions of Simulation-Based Security.",
                    "A New Cramer-Shoup Like Methodology for Group Based Provably Secure Encryption Schemes.",
                    "Further Simplifications in Proactive RSA Signatures.",
                    "Proof of Plaintext Knowledge for the Ajtai-Dwork Cryptosystem.",
                    "Entropic Security and the Encryption of High Entropy Messages.",
                    "Error Correction in the Bounded Storage Model.",
                    "Characterizing Ideal Weighted Threshold Secret Sharing."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st TCC 2004",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tcc/2004",
                "sub_name": "Theory of Cryptography, First Theory of Cryptography Conference, TCC 2004, Cambridge, MA, USA, February 19-21, 2004, Proceedings.",
                "count": 28,
                "papers": [
                    "Notions of Reducibility between Cryptographic Primitives.",
                    "Indifferentiability, Impossibility Results on Reductions, and Applications to the Random Oracle Methodology.",
                    "On the Random-Oracle Methodology as Applied to Length-Restricted Signature Schemes.",
                    "Universally Composable Commitments Using Random Oracles.",
                    "Transformation of Digital Signature Schemes into Designated Confirmer Signature Schemes.",
                    "List-Decoding of Linear Functions and Analysis of a Two-Round Zero-Knowledge Argument.",
                    "On the Possibility of One-Message Weak Zero-Knowledge.",
                    "Soundness of Formal Encryption in the Presence of Active Adversaries.",
                    "Rerandomizable and Replayable Adaptive Chosen Ciphertext Attack Secure Cryptosystems.",
                    "Alternatives to Non-malleability: Definitions, Constructions, and Applications (Extended Abstract).",
                    "A Note on Constant-Round Zero-Knowledge Proofs for NP.",
                    "Lower Bounds for Concurrent Self Composition.",
                    "Secret-Key Zero-Knowlegde and Non-interactive Verifiable Exponentiation.",
                    "A Quantitative Approach to Reductions in Secure Computation.",
                    "Algorithmic Tamper-Proof (ATP) Security: Theoretical Foundations for Security against Hardware Tampering.",
                    "Physically Observable Cryptography (Extended Abstract).",
                    "Efficient and Universally Composable Committed Oblivious Transfer and Applications.",
                    "A Universally Composable Mix-Net.",
                    "A General Composition Theorem for Secure Reactive Systems.",
                    "Unfair Noisy Channels and Oblivious Transfer.",
                    "Computational Collapse of Quantum State with Application to Oblivious Transfer.",
                    "Implementing Oblivious Transfer Using Collection of Dense Trapdoor Permutations.",
                    "Composition of Random Systems: When Two Weak Make One Strong.",
                    "Simpler Session-Key Generation from Short Random Passwords.",
                    "Constant-Round Oblivious Transfer in the Bounded Storage Model.",
                    "Hierarchical Threshold Secret Sharing.",
                    "On Compressing Encrypted Data without the Encryption Key.",
                    "On the Notion of Pseudo-Free Groups."
                ]
            }
        ]
    }
]