[
    {
        "year": "2021",
        "name": "20th TrustCom 2021",
        "info": "Shenyang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2021",
                "sub_name": "20th IEEE International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2021, Shenyang, China, October 20-22, 2021.",
                "count": 212,
                "papers": [
                    "A Time-aware Trust Management Heuristic for the Internet of Vehicles.",
                    "Verifiable Conjunctive Keyword Search with Certificateless Searchable.",
                    "Reliable Logging in Wireless IoT Networks in the Presence of Byzantine Faults.",
                    "The Performance of Selfish Mining in GHOST.",
                    "Bidder Scalable M+1st-Price Auction with Public Verifiability.",
                    "VEIN: High Scalability Routing Algorithm for Blockchain-based Payment Channel Networks.",
                    "TrustMod: A Trust Management Module For NS-3 Simulator.",
                    "Adaptive Clustering Ensemble Method Based on Uncertain Entropy Decision-Making.",
                    "Formal Verification of HPS-based Master-Slave Scheme in MEC with Timed Automata.",
                    "Protecting the Ownership of Deep Learning Models with An End-to-End Watermarking Framework.",
                    "Old Habits Die Hard: A Sober Look at TLS Client Certificates in the Real World.",
                    "RoBin: Facilitating the Reproduction of Configuration-Related Vulnerability.",
                    "Universal Website Fingerprinting Defense Based on Adversarial Examples.",
                    "Rando: A General-purpose True Random Number Generator for Conventional Computers.",
                    "You Are (not) Who Your Peers Are: Identification of Potentially Excessive Permission Requests in Android Apps.",
                    "Enhancing Trust-based Medical Smartphone Networks via Blockchain-based Traffic Sampling.",
                    "Anti-occlusion and Scale Adaptive Target Tracking Algorithm Based on Kernel Correlation Filter.",
                    "Secure Ranked Choice Online Voting System via Intel SGX and Blockchain.",
                    "MagikCube: Securing Cross-Domain Publish/Subscribe Systems with Enclave.",
                    "Security on SM2 and GOST Signatures against Related Key Attacks.",
                    "Improved Machine Learning Assisted (Related-key) Differential Distinguishers For Lightweight Ciphers.",
                    "Cryptanalysis of Deterministic and Probabilistic Multi-Copy PDP Schemes For Cloud Storage - Attacks and Countermeasures.",
                    "Remote Attestation of Large-scale Virtual Machines in the Cloud Data Center.",
                    "DeepTrace: A Secure Fingerprinting Framework for Intellectual Property Protection of Deep Neural Networks.",
                    "Signature-Based Secure Trajectory Similarity Search.",
                    "A secure deduplication scheme based on data popularity with fully random tags.",
                    "SecPT: Providing Efficient Page Table Protection based on SMAP Feature in an Untrusted Commodity Kernel.",
                    "The Design of Secure Coded Edge Computing for User-Edge Collaborative Computing.",
                    "A Revocable Zone Encryption Scheme with Anonymous Authentication for C-ITS.",
                    "LFETT2021: A Large-scale Fine-grained Encrypted Tunnel Traffic Dataset.",
                    "The Design and Implementation of Secure Distributed Image Classification Reasoning System for Heterogeneous Edge Computing.",
                    "Secure Data Transmission with Access Control for Smart Home Devices.",
                    "Secure Homomorphic Evaluation of Discrete Cosine Transform with High Precision.",
                    "Techniques for Securing 5G Network Services from attacks.",
                    "Techniques for Securing Control Systems from Attacks.",
                    "Overcoming security limitations of Secret Share techniques: the Nested Secret Share.",
                    "Enhancing Privacy Through DMMA: Decision-Making Method for Authentication.",
                    "Security Library for Safe Data Storage on Android Platform.",
                    "Robust AN-aided Secure Beamforming for Full-Duplex Relay System with Multiple Eavesdroppers.",
                    "Effective RFID Localization Based on Fuzzy Logic For Security.",
                    "White-Box Traceable Attribute-Based Encryption with Hidden Policies and Outsourced Decryption.",
                    "PCHEC: A Private Coded Computation Scheme For Heterogeneous Edge Computing.",
                    "A Differential Privacy Collaborative Deep Learning Algorithm in Pervasive Edge Computing Environment.",
                    "Sybil Attacks and Defense on Differential Privacy based Federated Learning.",
                    "Achieving Efficient and Privacy-preserving Biometric Identification in Cloud Computing.",
                    "Just Keep Your Concerns Private: Guaranteeing Heterogeneous Privacy and Achieving High Availability for ERM Algorithms.",
                    "Protecting Locations with Differential Privacy against Location-Dependent Attacks in Continuous LBS Queries.",
                    "A Privacy-Enhanced Mobile Crowdsensing Strategy for Blockchain Empowered Internet of Medical Things.",
                    "DP-gSpan: A Pattern Growth-based Differentially Private Frequent Subgraph Mining Algorithm.",
                    "Differential Privacy Preservation in Adaptive K-Nets Clustering.",
                    "A Fine-grained Privacy-Preserving Profile Matching Scheme in Mobile Social Networks.",
                    "Dynamic Searchable Symmetric Encryption with Forward and Backward Privacy.",
                    "Adaptive Clipping Bound of Deep Learning with Differential Privacy.",
                    "Improving the Effect of Frequent Itemset Mining with Hadamard Response under Local Differential Privacy.",
                    "A Privacy-preserving Location Recommendation Scheme without Trustworthy Entity.",
                    "An Aggregate Anonymous Credential Scheme in C-ITS for Multi-Service with Revocation.",
                    "A privacy-preserving framework for smart contracts based on stochastic model checking.",
                    "Towards Protecting Sensitive Text with Differential Privacy.",
                    "Answering Why-not Questions on Top k Queries with Privacy Protection.",
                    "Privacy-Preserving Hough Transform and Line Detection on Encrypted Cloud Images.",
                    "Privacy-Preserving Biometric Matching Using Homomorphic Encryption.",
                    "Privacy-Preserving eID Derivation to Self-Sovereign Identity Systems with Offline Revocation.",
                    "Effective Deep Learning-based Side-Channel Analyses Against ASCAD.",
                    "Too Expensive to Attack: Enlarge the Attack Expense through Joint Defense at the Edge.",
                    "ML-Stealer: Stealing Prediction Functionality of Machine Learning Models with Mere Black-Box Access.",
                    "Malware Classification by Learning Semantic and Structural Features of Control Flow Graphs.",
                    "Automated Detection of Malware Activities Using Nonnegative Matrix Factorization.",
                    "A Fast-Detection and Fault-Correction Algorithm against Persistent Fault Attack.",
                    "Multi-level Directed Fuzzing for Detecting Use-after-Free Vulnerabilities.",
                    "DePL: Detecting Privacy Leakage in DNS-over-HTTPS Traffic.",
                    "Analyzing Interoperability and Portability Concepts for Self-Sovereign Identity.",
                    "DeepVuler: A Vulnerability Intelligence Mining System for Open-Source Communities.",
                    "Malicious Packages Lurking in User-Friendly Python Package Index.",
                    "A Semi-supervised Deep Learning-Based Solver for Breaking Text-Based CAPTCHAs.",
                    "Robust Backdoor Attacks against Deep Neural Networks in Real Physical World.",
                    "MALUP: A Malware Classification Framework using Convolutional Neural Network with Deep Unsupervised Pre-training.",
                    "FLDDoS: DDoS Attack Detection Model based on Federated Learning.",
                    "Log-based Anomaly Detection from Multi-view by Associating Anomaly Scores with User Trust.",
                    "AndroCreme: Unseen Android Malware Detection Based on Inductive Conformal Learning.",
                    "A Novel Android Malware Detection Method Based on Visible User Interface.",
                    "EnvFaker: A Method to Reinforce Linux Sandbox Based on Tracer, Filter and Emulator against Environmental-Sensitive Malware.",
                    "TS-SVM: Detect LDoS Attack in SDN Based on Two-step Self-adjusting SVM.",
                    "Sensing Error Handling Bugs in SSL Library Usages.",
                    "DeepTaskAPT: Insider APT detection using Task-tree based Deep Learning.",
                    "Git Leaks: Boosting Detection Effectiveness Through Endpoint Visibility.",
                    "A Digital Forensics Investigation of a Smart Scale IoT Ecosystem.",
                    "Anomaly Detection for Scenario-based Insider Activities using CGAN Augmented Data.",
                    "MAAC: Novel Alert Correlation Method To Detect Multi-step Attack.",
                    "PGAN: A Generative Adversarial Network based Anomaly Detection Method for Network Intrusion Detection System.",
                    "LP-UIT: A Multimodal Framework for Link Prediction in Social Networks.",
                    "Cost-sensitive Heterogeneous Integration for Credit Card Fraud Detection.",
                    "Depression Detection Using Asynchronous Federated Optimization.",
                    "Attack versus Attack: Toward Adversarial Example Defend Website Fingerprinting Attack.",
                    "VulChecker: Achieving More Effective Taint Analysis by Identifying Sanitizers Automatically.",
                    "Peek Inside the Encrypted World: Autoencoder-Based Detection of DoH Resolvers.",
                    "Towards Strengthening Deep Learning-based Side Channel Attacks with Mixup.",
                    "DroidRadar: Android Malware Detection Based on Global Sensitive Graph Embedding.",
                    "MazeRunner: Evaluating the Attack Surface of Control-Flow Integrity Policies.",
                    "ReLF: Scalable Remote Live Forensics for Android.",
                    "Frequency Domain Fusion Algorithm of Infrared and Visible Image Based on Compressed Sensing for Video Surveillance Forensics.",
                    "Virtual Static Security Analyzer for Web Applications.",
                    "Social Spammer Detection Based on Semi-Supervised Learning.",
                    "FIDS: Detecting DDoS Through Federated Learning Based Method.",
                    "Gray Adversarial Attack Algorithm based on Multi-Scale Grid Search.",
                    "An Interactive System for Unfair Rating Detection Models in a Customized Perspective.",
                    "PDAAA: Progressive Defense Against Adversarial Attacks for Deep Learning-as-a-Service in Internet of Things.",
                    "A Deep Learning-based Penetration Testing Framework for Vulnerability Identification in Internet of Things Environments.",
                    "Robust Sensor Fusion Algorithms Against Voice Command Attacks in Autonomous Vehicles.",
                    "Quantum Ciphertext Dimension Reduction Scheme for Homomorphic Encrypted Data.",
                    "ESS: An Efficient Storage Scheme for Improving the Scalability of Bitcoin System.",
                    "Complementary Context-Enhanced Concept Lattice Aware Personalized Recommendation.",
                    "BERTDeep-Ware: A Cross-architecture Malware Detection Solution for IoT Systems.",
                    "A Blockchain Scheme Based on DAG Structure Security Solution for IIoT.",
                    "Automatically derived stateful network functions including non-field attributes.",
                    "Phishing Web Page Detection with HTML-Level Graph Neural Network.",
                    "A Feature-Flux Traffic Camouflage Method based on Twin Gaussian Process.",
                    "A HEVC Video Steganography Algorithm Based on DCT/DST Coefficients with Improved VRCNN.",
                    "MEChain: A Multi-layer Blockchain Structure with Hierarchical Consensus for Secure EHR System.",
                    "Multi-label Positive and Unlabeled Learning and its Application to Common Vulnerabilities and Exposure Categorization.",
                    "How to Increase Smart Home Security and Privacy Risk Perception.",
                    "An Adaptive Multi-pairwise Ranking with Implicit Feedback for Recommendation.",
                    "Multi-UAV Cooperative Obstacle Avoidance and Surveillance in Intelligent Transportation.",
                    "Another Look at the Connection between CAN Signal Ringing & In-Vehicle ECU Identification.",
                    "A Novel Security Framework for Edge Computing based UAV Delivery System.",
                    "LVRT: Low Variances of Solo Mining Reward & Inter-block Time in Collaborative PoW.",
                    "Reinforcement-Learning-based IDS for 6LoWPAN.",
                    "Accepted Influence Maximization under Linear Threshold Model on Large-Scale Social Networks.",
                    "Towards Multi-source Extension: A Multi-classification Method Based on Sampled NetFlow Records.",
                    "BSA: Enabling Biometric-Based Storage and Authorization on Blockchain.",
                    "QuickLogS: A Quick Log Parsing Algorithm based on Template Similarity.",
                    "Energy Efficient Merkle Trees for Blockchains.",
                    "BinDeep: Binary to Source Code Matching Using Deep Learning.",
                    "Efficient k Nearest Neighbor Query Processing on Public Transportation Network.",
                    "Hop-by-hop Accounting and Rewards for Packet dIspAtching.",
                    "Dynamic Edge Association in Hierarchical Federated Learning Networks.",
                    "Constant-Time Loading: Modifying CPU Pipeline to Defeat Cache Side-Channel Attacks.",
                    "TradeChain: Decoupling Traceability and Identity in Blockchain enabled Supply Chains.",
                    "Wait or Reset Gas Price?: A Machine Learning-based Prediction Model for Ethereum Transactions' Waiting Time.",
                    "Policy Network Assisted Monte Carlo Tree Search for Intelligent Service Function Chain Deployment.",
                    "Compressing the Bitcoin Blockchain using Incremental Snapshots.",
                    "Select-Storage: A New Oracle Design Pattern on Blockchain.",
                    "A Deep Learning Model for Threat Hunting in Ethereum Blockchain.",
                    "On Application of Blockchain to Enhance Single Sign-On (SSO) Systems.",
                    "EDKSAP : Efficient Double-Key Stealth Address Protocol in Blockchain.",
                    "Redactable Blockchain based on Unforgeable Signatures for Supporting Fast Verification.",
                    "A blind watermarking system based on deep learning model.",
                    "Application of Bayesian Network Reasoning Algorithm in Emotion Classification.",
                    "An Measurement Method of Oblique Wedge Rubbing Surface Abrasion Based on Point Cloud.",
                    "A Secured Real-Time IoMT Application for Monitoring Isolated COVID-19 Patients using Edge Computing.",
                    "Simple Online Unmanned Aerial Vehicle Tracking with Transformer.",
                    "Detection of Anomaly User Behaviors Based on Deep Neural Networks.",
                    "Release of Trajectory Data based on Space Segmentation using Differential Privacy.",
                    "An Implementation and Optimization Method of RTLS Based on UWB for Underground Mine.",
                    "Random Forest Algorithm Based on Differential Privacy Protection.",
                    "An axis extract method for rotational parts based on point cloud normal lines.",
                    "Human Trajectory Prediction Using Stacked Temporal Convolutional Network.",
                    "Revisiting Anonymity and Privacy of Bitcoin.",
                    "An inertia wheel pendulum control method based on actor-critic learning algorithm.",
                    "Decentralized Policy Information Points for Multi-Domain Environments.",
                    "Secure Development Strategy Model Framework for Security of Mobile Applications.",
                    "GEA-net: Global embedded attention neural network for image classification.",
                    "Design of Lightweight Intelligent Vehicle System Based on Hybrid Depth Model.",
                    "Improved NS Cellular Automaton Model for Simulating Traffic Flows of Two-Lane.",
                    "A Filter Rank Based Pruning Method for Convolutional Neural Networks.",
                    "A TDOA-Assisted Direct Position Determination for Efficient Geolocalization Using LEO Satellites.",
                    "Research and implementation of an analytical database testing platform in telecommunication industry.",
                    "C-V2X Large-scale Test Network Transmission Performance Data Analysis Method.",
                    "Design of Digital Maincenter Platform for Smart Home Based on Big Data.",
                    "Overview of Beam Hopping Algorithms in Large Scale LEO Satellite Constellation.",
                    "Joint Power and Bandwidth Allocation for Internet of Vehicles Based on Proximal Policy Optimization Algorithm.",
                    "NR Shared Spectrum efficiency and utilization analysis based on big data.",
                    "Research and Application of Intelligent Antenna Feeder Optimization System based on Big Data.",
                    "Research on Evaluation System of Relational Cloud Database.",
                    "Design and Implementation of Intelligent Operation and Maintenance System for Big Data Platform.",
                    "Research of Sharing and Compatibility for HIBS and Terrestrial Network in 900MHz.",
                    "A Non-Cooperative Data Center Energy Consumption Optimization Strategy Based on SDN Structure.",
                    "A Novel Architecture and Algorithm for Prediction of Students Psychological Health based on Big Data.",
                    "Analysis of the Application of Big Data in Banking Sector.",
                    "Automated Performance Benchmarking Platform of IaaS Cloud.",
                    "Base Station Prediction Analysis Scheme Based on Lasso Regression Machine Learning Algorithm.",
                    "BRLR: A Routing Strategy for MANET Based on Reinforcement Learning.",
                    "Databench-T: A Transactional Database Benchmark for Financial Scenarios.",
                    "Evaluation and Application of News Transmission Speed in New Media Environment.",
                    "Online Automatic Service Composition for Mobile and Pervasive Computing.",
                    "Privacy-Preserving Neural Architecture Search Across Federated IoT Devices.",
                    "Sharing and Compatibility Studies of EESS(active) and IMT System in 10-10.5 GHz.",
                    "FedIM: An Anti-attack Federated Learning Based on Agent Importance Aggregation.",
                    "Matching Sensor Ontologies with Neural Network.",
                    "Trusted Artificial Intelligence: Technique Requirements and Best Practices.",
                    "Multidimensional Observation of Blockchain Security.",
                    "Construction of Knowledge Graph Based on Discipline Inspection and Supervision.",
                    "Prediction of remaining useful life of turbofan engine based on optimized model.",
                    "Design and Implementation of Scanning Electron Microscope Image Acquisition Software System.",
                    "Research on Droplet Digital PCR Amplification System.",
                    "A multi-scale convolutional neural network for heartbeat classification.",
                    "An Automatic Algorithm for P/T-Wave Detection based on Auxiliary Waveform.",
                    "Automated Classification of Atrial Fibrillation and Atrial Flutter in ECG Signals based on Deep Learning.",
                    "Beat-to-beat Heart Rate Detection Based on Seismocardiogram Using BiLSTM Network.",
                    "A new algorithm for demographic expansion based on multi-scene differentiated communication data.",
                    "A Renewable Energy Certificate Trading System Based on Blockchain.",
                    "A Hybrid User Recommendation Scheme Based on Collaborative Filtering and Association Rules.",
                    "Preference Recommendation Scheme based on Social Networks of Mobile Users.",
                    "Cell Boundary Prediction and Base Station Location Verification based on Machine Learning.",
                    "Investigation on Multi-Antenna Technologies Evolution from FDD LTE to NR FDD.",
                    "Joint Offloading Decision and Resource Allocation of 5G Edge Intelligent Computing for Complex Industrial Application.",
                    "Study on TDD Unsynchronized Interference from Outdoor to Indoor Scenario in 3.3-3.6 GHz.",
                    "Fault Diagnosis of 5G Voice Service Based on Multi-sources data.",
                    "Key technologies for 5G co-construction and shared base station data automatic configuration.",
                    "Research on Productization and Development Trend of Data Desensitization Technology.",
                    "A Novel Method for Detecting Noise Segments in ECG Signals.",
                    "Authentication and Access Control in 5G Device-to-Device Communication.",
                    "IdiffGrad: A Gradient Descent Algorithm for Intrusion Detection Based on diffGrad."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "19th TrustCom 2020",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2020",
                "sub_name": "19th IEEE International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2020, Guangzhou, China, December 29, 2020 - January 1, 2021.",
                "count": 264,
                "papers": [
                    "Enhancing Randomization Entropy of x86-64 Code while Preserving Semantic Consistency.",
                    "Reversible data hiding based on improved rhombus predictor and prediction error expansion.",
                    "A Trust Routing Scheme based on Identification of Non-complete Cooperative Nodes in Mobile Peer-to-Peer Networks.",
                    "SeRoT: A Secure Runtime System on Trusted Execution Environments.",
                    "Robust Scheduling for Large-Scale Distributed Systems.",
                    "Adaptive Random Test Case Generation Based on Multi-Objective Evolutionary Search.",
                    "Improving Efficiency of Key Enumeration Based on Side-Channel Analysis.",
                    "Robust Spatial-spread Deep Neural Image Watermarking.",
                    "DeM-CoD: Novel Access-Control-Based Cash on Delivery Mechanism for Decentralized Marketplace.",
                    "Modeling and Analysis of RabbitMQ Using UPPAAL.",
                    "User-Controlled, Auditable, Cross-Jurisdiction Sharing of Healthcare Data Mediated by a Public Blockchain.",
                    "A Unified Host-based Intrusion Detection Framework using Spark in Cloud.",
                    "TA-HRT: A temperature-aware scheduler for heterogeneous real-time multicore systems.",
                    "Reducing the Price of Protection: Identifying and Migrating Non-Sensitive Code in TEE.",
                    "Fairness Testing of Machine Learning Models Using Deep Reinforcement Learning.",
                    "Cyclic Bayesian Attack Graphs: A Systematic Computational Approach.",
                    "Practical Secure Two-Party EdDSA Signature Generation with Key Protection and Applications in Cryptocurrency.",
                    "Password Policies vs. Usability: When Do Users Go \"Bananas\"?",
                    "Malware Classification on Imbalanced Data through Self-Attention.",
                    "Novel design of Hardware Trojan: A generic approach for defeating testability based detection.",
                    "TRUVIN: Lightweight Detection of Data-Oriented Attacks Through Trusted Value Integrity.",
                    "LURK: Server-Controlled TLS Delegation.",
                    "Malware Detection Based on Term Frequency Analysis of GPRs Features.",
                    "Secure Outsourcing of Multi-Armed Bandits.",
                    "NLabel: An Accurate Familial Clustering Framework for Large-scale Weakly-labeled Malware.",
                    "Active Link Obfuscation to Thwart Link-flooding Attacks for Internet of Things.",
                    "VALID: Voltage-Based Lightweight Intrusion Detection for the Controller Area Network.",
                    "Densely Connected Residual Network for Attack Recognition.",
                    "Optimized FPGA Implementation of Elliptic Curve Cryptosystem over Prime Fields.",
                    "FTPB: A Three-stage DNS Tunnel Detection Method Based on Character Feature Extraction.",
                    "De-randomizing the Code Segment with Timing Function Attack.",
                    "Unmasking Windows Advanced Persistent Threat Execution.",
                    "Ciphertext-Policy Attribute-Based Encryption with Multi-Keyword Search over Medical Cloud Data.",
                    "VCKSCF: Efficient Verifiable Conjunctive Keyword Search Based on Cuckoo Filter for Cloud Storage.",
                    "Program Slice based Vulnerable Code Clone Detection.",
                    "Doc2vec-based Insider Threat Detection through Behaviour Analysis of Multi-source Security Logs.",
                    "C2BID: Cluster Change-Based Intrusion Detection.",
                    "TEADS: A Defense-aware Framework for Synthesizing Transient Execution Attacks.",
                    "One Covert Channel to Rule Them All: A Practical Approach to Data Exfiltration in the Cloud.",
                    "ReDex: Unpacking Android Packed Apps by Executing Every Method.",
                    "Awareness of Secure Coding Guidelines in the Industry - A first data analysis.",
                    "IoT Attacks: Features Identification and Clustering.",
                    "Estimating Loss Due to Cyber-attack in the Presence of Uncertainty.",
                    "STIDM: A Spatial and Temporal Aware Intrusion Detection Model.",
                    "Partial-SMT: Core-scheduling Protection Against SMT Contention-based Attacks.",
                    "Family Identification of AGE-Generated Android Malware Using Tree-Based Feature.",
                    "Towards a Theory of Special-Purpose Program Obfuscation.",
                    "Protecting the Intellectual Property of Deep Neural Networks with Watermarking: The Frequency Domain Approach.",
                    "Uncovering the Hidden Dangers: Finding Unsafe Go Code in the Wild.",
                    "Traffic Classification of User Behaviors in Tor, I2P, ZeroNet, Freenet.",
                    "MAUSPAD: Mouse-based Authentication Using Segmentation-based, Progress-Adjusted DTW.",
                    "Improving the Effectiveness of Grey-box Fuzzing By Extracting Program Information.",
                    "Evaluating the Soundness of Security Metrics from Vulnerability Scoring Frameworks.",
                    "SpeedNeuzz: Speed Up Neural Program Approximation with Neighbor Edge Knowledge.",
                    "Mind the GAP: Security & Privacy Risks of Contact Tracing Apps.",
                    "Far from classification algorithm: dive into the preprocessing stage in DGA detection.",
                    "ELPPS: An Enhanced Location Privacy Preserving Scheme in Mobile Crowd-Sensing Network Based on Edge Computing.",
                    "Phishing Web Page Detection Using Optimised Machine Learning.",
                    "Asset-Oriented Threat Modeling.",
                    "A11 Your PLCs Belong to Me: ICS Ransomware Is Realistic.",
                    "Automated Enforcement of the Principle of Least Privilege over Data Source Access.",
                    "Extending Registration and Authentication Processes of FIDO2 External Authenticator with QR Codes.",
                    "BHDA - A Blockchain-Based Hierarchical Data Access Model for Financial Services.",
                    "FTCLNet: Convolutional LSTM with Fourier Transform for Vulnerability Detection.",
                    "Secure Coded Matrix Multiplication against Cooperative Attack in Edge Computing.",
                    "A Measurement Study of IoT-Based Attacks Using IoT Kill Chain.",
                    "Modeling and Verification of Spatio-Temporal Intelligent Transportation Systems.",
                    "Secure Outsourcing Algorithms of Modular Exponentiations in Edge Computing.",
                    "Joint Learning for Document-Level Threat Intelligence Relation Extraction and Coreference Resolution Based on GCN.",
                    "Anomaly Detection on MIL-STD-1553 Dataset using Machine Learning Algorithms.",
                    "Privacy-Preserving Ride-Hailing with Verifiable Order-Linking in Vehicular Networks.",
                    "Flowverine: Leveraging Dataflow Programming for Building Privacy-Sensitive Android Applications.",
                    "Prihook: Differentiated context-aware hook placement for different owners' smartphones.",
                    "Improving Laplace Mechanism of Differential Privacy by Personalized Sampling.",
                    "Differential Privacy Preservation in Interpretable Feedforward-Designed Convolutional Neural Networks.",
                    "Practical and Secure Circular Range Search on Private Spatial Data.",
                    "Dataset Construction and Analysis of Screenshot Malware.",
                    "zkrpChain: Privacy-preserving Data Auditing for Consortium Blockchains Based on Zero-knowledge Range Proofs.",
                    "On the Role of Data Anonymization in Machine Learning Privacy.",
                    "Heimdall: Illuminating the Hidden Depths of Third-party Tracking in Android Applications.",
                    "A Privacy-preserving Data Collection and Processing Framework for Third-party UAV Services.",
                    "On the Comparison of Classifiers' Construction over Private Inputs.",
                    "Napping Guard: Deanonymizing Tor Hidden Service in a Stealthy Way.",
                    "Multi-Party Private Set Intersection in Vertical Federated Learning.",
                    "MLTracer: Malicious Logins Detection System via Graph Neural Network.",
                    "Data Analytics-enabled Intrusion Detection: Evaluations of ToN IoT Linux Datasets.",
                    "CMIRGen: Automatic Signature Generation Algorithm for Malicious Network Traffic.",
                    "A Novel Violation Tracing Model for Cloud Service Accountability.",
                    "Detection of Hate Tweets using Machine Learning and Deep Learning.",
                    "Use of Bash History Novelty Detection for Identification of Similar Source Attack Generation.",
                    "Measurement Unit Placement Against Injection Attacks for the Secured Operation of an IIoT-based Smart Grid.",
                    "Cross Platform IoT- Malware Family Classification based on Printable Strings.",
                    "ALBFL: A Novel Neural Ranking Model for Software Fault Localization via Combining Static and Dynamic Features.",
                    "Towards a Robust Classifier: An MDL-Based Method for Generating Adversarial Examples.",
                    "Avoiding Geographic Regions in Tor.",
                    "Identifying Cross-Version Function Similarity Using Contextual Features.",
                    "Scalable and Accurate Binary Search Method based on Simhash and Partial Trace.",
                    "An Analytics Framework for Heuristic Inference Attacks against Industrial Control Systems.",
                    "Forensic Analysis of Dating Applications on Android and iOS Devices.",
                    "Federated TON_IoT Windows Datasets for Evaluating AI-based Security Applications.",
                    "Privacy-Encoding Models for Preserving Utility of Machine Learning Algorithms in Social Media.",
                    "Generation of malicious webpage samples based on GAN.",
                    "A Flexible Attentive Temporal Graph Networks for Anomaly Detection in Dynamic Networks.",
                    "FPGA based Blockchain System for Industrial IoT.",
                    "Address-based Signature.",
                    "Cryptanalysis of a Chaos-based Block Cryptosystem Using Multiple Samples Correlation Power Analysis.",
                    "Adversarial Attacks on Time-Series Intrusion Detection for Industrial Control Systems.",
                    "Netspot: a simple Intrusion Detection System with statistical learning.",
                    "Cache side-channel attacks detection based on machine learning.",
                    "Exploit Internal Structural Information for IoT Malware Detection Based on Hierarchical Transformer Model.",
                    "Inference Attacks on Physical Layer Channel State Information.",
                    "A non-discriminatory approach to ethical deep learning.",
                    "Security and Privacy Implementation in Smart Home: Attributes Based Access Control and Smart Contracts.",
                    "Blockchain-based Verifiable Credential Sharing with Selective Disclosure.",
                    "Blockchain-enabled Collaborative Intrusion Detection in Software Defined Networks.",
                    "Active DNN IP Protection: A Novel User Fingerprint Management and DNN Authorization Control Technique.",
                    "SCPORAM: a hardware support scheme for protecting memory access patterns.",
                    "QPBFT: Practical Byzantine Fault Tolerance Consensus Algorithm Based on Quantified-role.",
                    "Privacy-Preserving Public Verification of Ethical Cobalt Sourcing.",
                    "A Computation Offloading Model over Collaborative Cloud-Edge Networks with Optimal Transport Theory.",
                    "A Secure Shard Reconfiguration Protocol for Sharding Blockchains Without a Randomness.",
                    "Revocable and Offline-Verifiable Self-Sovereign Identities.",
                    "Blockchain based End-to-end Tracking System for Distributed IoT Intelligence Application Security Enhancement.",
                    "Time is Money: Countering Griefing Attack in Lightning Network.",
                    "Preventing a Fork in a Blockchain - David Fighting Goliath.",
                    "Golden-Chip-Free Hardware Trojan Detection Through Thermal Radiation Comparison in Vulnerable Areas.",
                    "A Feedback-Driven Lightweight Reputation Scheme for IoV.",
                    "Modelling Attacks in Blockchain Systems using Petri Nets.",
                    "BONIK: A Blockchain Empowered Chatbot for Financial Transactions.",
                    "Towards Network Traffic Monitoring Using Deep Transfer Learning.",
                    "A three-stage machine learning network security solution for public entities.",
                    "Multi-Input Functional Encryption: Efficient Applications from Symmetric Primitives.",
                    "Factors Affecting Users' Disclosure Decisions in Android Runtime Permissions Model.",
                    "Towards a Lightweight Continuous Authentication Protocol for Device-to-Device Communication.",
                    "Secure and Privacy Preserving Method for Biometric Template Protection using Fully Homomorphic Encryption.",
                    "Trusted Network Slicing among Multiple Mobile Network Operators.",
                    "A Scoring System to efficiently measure Security in Cyber-Physical Systems.",
                    "Towards a new deep learning based approach for the password prediction.",
                    "DANTE: Predicting Insider Threat using LSTM on system logs.",
                    "VGG-based side channel attack on RSA implementation.",
                    "Deep Learning for Password Guessing and Password Strength Evaluation, A Survey.",
                    "Metrics to Enhance the Resilience of Cyber-Physical Systems.",
                    "Independent Worker Selection In Crowdsourcing.",
                    "Towards Collaborative Intrusion Detection Enhancement against Insider Attacks with Multi-Level Trust.",
                    "A Function-Centric Risk Assessment Approach for Android Applications.",
                    "SCAFFISD: A Scalable Framework for Fine-grained Identification and Security Detection of Wireless Routers.",
                    "Library Implementation and Performance Analysis of GlobalPlatform TEE Internal API for Intel SGX and RISC-V Keystone.",
                    "A Privacy-Preserving Data Inference Framework for Internet of Health Things Networks.",
                    "RPAD: An Unsupervised HTTP Request Parameter Anomaly Detection Method.",
                    "Image Self-Recovery Based on Authentication Feature Extraction.",
                    "Do My Emotions Influence What I Share? Analysing the Effects of Emotions on Privacy Leakage in Twitter.",
                    "Robustness analysis and defence strategy of an interdependent networks model based on closeness centrality.",
                    "A Framework for Measuring IoT Data Quality Based on Freshness Metrics.",
                    "RevBloc: A Blockchain-based Secure Customer Review System.",
                    "Face2Face Manipulation Detection Based on Histogram of Oriented Gradients.",
                    "Analysis and modelling of multi-stage attacks.",
                    "Cyber Situation Awareness Monitoring and Proactive Response for Enterprises on the Cloud.",
                    "Explicitly Privacy-Aware Space Usage Analysis.",
                    "Towards A Transparent and Privacy-preserving Healthcare Platform with Blockchain for Smart Cities.",
                    "BML: A Data Mapping Language for Blockchain Platforms.",
                    "Semantic Location Privacy Protection Algorithm Based on Edge Cluster Graph.",
                    "Priority based Modeling and Comparative study of Google Cloud Resources between 2011 and 2019.",
                    "Security Challenges and Solutions for 5G HetNet.",
                    "Privacy Smells: Detecting Privacy Problems in Cloud Architectures.",
                    "BlockSLAP: Blockchain-based Secure and Lightweight Authentication Protocol for Smart Grid.",
                    "SecureESFS: Sharing Android External Storage Files in A Securer Way.",
                    "PPFQ: Privacy-Preserving Friends Query over Online Social Networks.",
                    "Dynamic flow redirecton scheme for enhancing control plane robustness in SDN.",
                    "Prov-IoT: A Security-Aware IoT Provenance Model.",
                    "Are Smart Home Devices Abandoning IPV Victims?",
                    "A Practical Privacy-Preserving Algorithm for Document Data.",
                    "TORP: Load Balanced Reliable Opportunistic Routing for Asynchronous Wireless Sensor Networks.",
                    "CPN Model Checking Method of Concurrent Software Based on State Space Pruning.",
                    "An Arithmetic Differential Privacy Budget Allocation Method for the Partitioning and Publishing of Location Information.",
                    "IoT-Sphere: A Framework To Secure IoT Devices From Becoming Attack Target And Attack Source.",
                    "Membership Inference Attacks: Analysis and Mitigation.",
                    "Bearicade: secure access gateway to High Performance Computing systems.",
                    "Enhancing Cyber Security Using Audio Techniques: A Public Key Infrastructure for Sound.",
                    "Group Communication Needs No Consistent Transcript Distribution.",
                    "Name-Signature Lookup System: A Security Enhancement to Named Data Networking.",
                    "Feature importance in Android malware detection.",
                    "iTES: Integrated Testing and Evaluation System for Software Vulnerability Detection Methods.",
                    "Plant Taxonomy In Hainan Based On Deep Convolutional Neural Network And Transfer Learning.",
                    "Research on Stitching and Alignment of Mouse Carcass EM Images.",
                    "A Simple Analysis of Multimodal Data Fusion.",
                    "Pyramid Pooling Channel Attention Network for esophageal tissue segmentation on OCT images.",
                    "Atrial Fibrillation Classification Using Convolutional Neural Networks and Time Domain Features of ECG Sequence.",
                    "Design and implementation of a multifunctional ECG analysis software system.",
                    "A Four-Feature Keyword Extraction Algorithm Based on Word Length Priority ratio.",
                    "Research and Improvement of Community Discovery Algorithm Based on Spark for Large Scale Complicated Networks.",
                    "An Investigation of Assistive Products for the Elderly.",
                    "An impedance control method of lower limb exoskeleton rehabilitation robot based on predicted forward dynamics.",
                    "An Automatic Vulnerability Scanner for Web Applications.",
                    "An Automatic Vulnerability Classification System for IoT Softwares.",
                    "Policy Evaluation and Dynamic Management Based on Matching Tree for XACML.",
                    "Fined-grained Aspect Extraction from Online Reviews for Decision Support.",
                    "A Password Strength Evaluation Algorithm based on Sensitive Personal Information.",
                    "Prediction of high precision ignition process in the condition of multi flow area coupling of micro solid rocket motor.",
                    "Exploiting User Selection Algorithm for Securing Wireless Communication Networks.",
                    "Easy-to-implement Campus Electronic Anonymous Voting System.",
                    "Hypergraph Attention Networks.",
                    "Search & Catch: Detecting Promotion Infection in the Underground through Search Engines.",
                    "Image Authentication using QR Code Watermarking Approach based on Image Segmentation.",
                    "A Semi-Supervised Learning Scheme to Detect Unknown DGA Domain Names based on Graph Analysis.",
                    "A PHP and JSP Web Shell Detection System With Text Processing Based On Machine Learning.",
                    "A Symmetric Uniform Formula and Sole Index Method for Sieving (Twin) Primes.",
                    "SCScan: A SVM-based Scanning System for Vulnerabilities in Blockchain Smart Contracts.",
                    "A Security Model and Implementation of Embedded Software Based on Code Obfuscation.",
                    "Sensitive Information Detection based on Convolution Neural Network and Bi-directional LSTM.",
                    "Enhancing the Security of Numeric Comparison Secure Simple Pairing in Bluetooth 5.0.",
                    "3P3: Strong Flexible Privacy for Broadcasts.",
                    "Efficient Revocable Attribute-Based Encryption with Hidden Policies.",
                    "On the Usefulness of User Nudging and Strength Indication Concerning Unlock Pattern Security.",
                    "Unbounded Key-Policy Attribute-based Encryption with Black-Box Traceability.",
                    "An Efficient Vulnerability Extrapolation Using Similarity of Graph Kernel of PDGs.",
                    "Opportunistic Tracking in Cyber-Physical Systems.",
                    "An Approach for Poisoning Attacks against RNN-Based Cyber Anomaly Detection.",
                    "Differential Privacy Images Protection Based on Generative Adversarial Network.",
                    "DP-Eclat: A Vertical Frequent Itemset Mining Algorithm Based on Differential Privacy.",
                    "More efficient SM9 algorithm based on bilinear pair optimization processing.",
                    "SeWG: Security-enhanced WireGuard for Android Based on TEE.",
                    "Differential privacy preserving data publishing based on Bayesian network.",
                    "Implementing Network Attack Detection with a Novel NSSA Model Based on Knowledge Graphs.",
                    "UIDroid: User-driven Based Hierarchical Access Control for Sensitive Information.",
                    "TrustyShare: A Sharing Scheme using ARM TrustZone.",
                    "SmartLED: Smartphone-based covert channels leveraging the notification LED.",
                    "Semantic redirection obfuscation: A control flow obfuscation based on Android Runtime.",
                    "Blockchain based PKI and Certificates Management in Mobile Networks.",
                    "Monitoring Social Media for Vulnerability-Threat Prediction and Topic Analysis.",
                    "Android Malware Classification Using Machine Learning and Bio-Inspired Optimisation Algorithms.",
                    "LTMS: A Lightweight Trust Management System for Wireless Medical Sensor Networks.",
                    "Trust and Believe - Should We? Evaluating the Trustworthiness of Twitter Users.",
                    "Trust Aware Continuous Authorization for Zero Trust in Consumer Internet of Things.",
                    "pcSVF: An Evaluation of Side-Channel Vulnerability of Port Contention.",
                    "A Multi-Layer Industrial-IoT Attack Taxonomy: Layers, Dimensions, Techniques and Application.",
                    "A Semantic Model-based Security Engineering Framework for Cyber-Physical Systems.",
                    "Attribute-Based Data Access Control for Multi-Authority System.",
                    "DNRTI: A Large-scale Dataset for Named Entity Recognition in Threat Intelligence.",
                    "AndroTIME: Identifying Timing Side Channels in the Android API.",
                    "FIDOnuous: A FIDO2/WebAuthn Extension to Support Continuous Web Authentication.",
                    "A Blockchain-based Key Management Protocol for Secure Device-to-Device Communication in the Internet of Things.",
                    "Finding Geometric Medians with Location Privacy.",
                    "Security and Privacy Analysis of mhealth Application: A Case Study.",
                    "Enabling Security Analysis of IoT Device-to-Cloud Traffic.",
                    "Towards A New Approach to Identify WhatsApp Messages.",
                    "Efficient Off-Chain Transaction to Avoid Inaccessible Coins in Cryptocurrencies.",
                    "Assessing the Similarity of Smart Contracts by Clustering their Interfaces.",
                    "Securing Manufacturing Using Blockchain.",
                    "SCUR: Smart Contracts with a Static Upper-bound on Resource Usage.",
                    "SSIBAC: Self-Sovereign Identity Based Access Control.",
                    "A Privacy-Preserving Crowdsensing System with Muti-Blockchain.",
                    "A Blockchain-based Vehicle-trust Management Framework Under a Crowdsourcing Environment.",
                    "Permission Token Segmentation Scheme based on Blockchain Access Control.",
                    "A blockchain-based pattern for confidential and pseudo-anonymous contract enforcement.",
                    "Detecting Online Game Malicious Chargeback by using k-NN.",
                    "A novel Q-Learning Algorithm Based on the Stochastic Environment Path Planning Problem.",
                    "Boosting Homograph Attack Classification Using Ensemble Learning and N-gram Model.",
                    "Survey on Blockchain and Deep Learning.",
                    "Special-purpose Model Extraction Attacks: Stealing Coarse Model with Fewer Queries.",
                    "A low-cost method for accurate localization of traffic participants.",
                    "Integration of 5G, VANETs and Blockchain Technology.",
                    "Aquatic Drone Control Using Inertial Sensors - Comparative Filtering Methods.",
                    "Factors affecting trust in the autonomous vehicle: A survey of primary school students and parent perceptions.",
                    "Prediction of Radio Frequency Spectrum Occupancy."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "18th TrustCom / 13th BigDataSE 2019",
        "info": "Rotorua, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2019",
                "sub_name": "18th IEEE International Conference On Trust, Security And Privacy In Computing And Communications / 13th IEEE International Conference On Big Data Science And Engineering, TrustCom/BigDataSE 2019, Rotorua, New Zealand, August 5-8, 2019.",
                "count": 109,
                "papers": [
                    "Building Trust in Container Environment.",
                    "Trustworthy Privacy-Preserving Service Compositions.",
                    "A Unified Measurable Software Trustworthy Model Based on Vulnerability Loss Speed Index.",
                    "MicroTEE: Designing TEE OS Based on the Microkernel Architecture.",
                    "Trust and Reputation in Vehicular Networks: A Smart Contract-Based Approach.",
                    "Optimal File Dissemination Scheduling Under a General Binary Tree of Trust Relationship.",
                    "Horcruxes for Everyone - A Framework for Key-Loss Recovery by Splitting Trust.",
                    "HyperMI: A Privilege-level VM Protection Approach against Compromised Hypervisor.",
                    "The Deviation Attack: A Novel Denial-of-Service Attack Against IKEv2.",
                    "A Survey of Research on CAPTCHA Designing and Breaking Techniques.",
                    "AVOCAD: Adaptive Terrorist Comms Surveillance and Interception using Machine Learning.",
                    "Malware Detection with Malware Images using Deep Learning Techniques.",
                    "IoT Device Identification via Network-Flow Based Fingerprinting and Learning.",
                    "Phishing URL Detection via CNN and Attention-Based Hierarchical RNN.",
                    "STDeepGraph: Spatial-Temporal Deep Learning on Communication Graphs for Long-Term Network Attack Detection.",
                    "Continuous Authentication of Embedded Software.",
                    "CCGA: Clustering and Capturing Group Activities for DGA-Based Botnets Detection.",
                    "Real-Time Detection of Malware Activities by Analyzing Darknet Traffic Using Graphical Lasso.",
                    "A Worst-Case Entropy Estimation of Oscillator-Based Entropy Sources: When the Adversaries Have Access to the History Outputs.",
                    "Power-Grid Controller Anomaly Detection with Enhanced Temporal Deep Learning.",
                    "When are Opaque Predicates Useful?",
                    "An Ant Colony Algorithm Based Content Poisoning Mitigation in Named Data Networking.",
                    "A Heuristic Method for Network Modification Against Cyber Epidemic Attacks.",
                    "Tracking Sensitive Information and Operations in Integrated Clinical Environment.",
                    "Distributed Quantitative Information Flow Evaluation for Service Composition in Clouds.",
                    "A Topic-Based Unsupervised Learning Approach for Online Underground Market Exploration.",
                    "The Weakest Link of Certificate Transparency: Exploring the TLS/HTTPS Configurations of Third-Party Monitors.",
                    "Hybrid Logical Clocks for Database Forensics: Filling the Gap between Chain of Custody and Database Auditing.",
                    "MURITE-Detector: Identifying User-Role in Information Theft Events of Mobile Network.",
                    "AIMED: Evolving Malware with Genetic Programming to Evade Detection.",
                    "FIoT: Detecting the Memory Corruption in Lightweight IoT Device Firmware.",
                    "A Signature-Based Assistant Random Oversampling Method for Malware Detection.",
                    "A Security Framework for IoT Authentication and Authorization Based on Blockchain Technology.",
                    "Selective Adversarial Learning for Mobile Malware.",
                    "Credit Card Fraud Detection in E-Commerce.",
                    "Security and Performance Assessment of IP Multiplexing Moving Target Defence in Software Defined Networks.",
                    "Deep Android Malware Classification with API-Based Feature Graph.",
                    "Context-Aware Authentication Using Co-Located Devices.",
                    "Understanding the Influence of Graph Kernels on Deep Learning Architecture: A Case Study of Flow-Based Network Attack Detection.",
                    "Thermal Covert Channels Leveraging Package-on-Package DRAM.",
                    "Continuous Authorization in Subject-Driven Data Sharing Using Wearable Devices.",
                    "A Secure User-Centric Framework for Dynamic Service Provisioning in IoT Environments.",
                    "Laughter in the Wild: A Study Into DoS Vulnerabilities in YAML Libraries.",
                    "HSDC-Net: Secure Anonymous Messaging in Online Social Networks.",
                    "Automatic Anonymization of Textual Documents: Detecting Sensitive Information via Word Embeddings.",
                    "A Generic Information and Consent Framework for the IoT.",
                    "Poisoning Attack in Federated Learning using Generative Adversarial Nets.",
                    "Trustworthy Distributed Computations on Personal Data Using Trusted Execution Environments.",
                    "Privacy-Preserving Outsourcing Computation of QR Decomposition in the Encrypted Domain.",
                    "A Robust Watermarking Scheme for Encrypted JPEG Bitstreams with Format-Compliant Encryption.",
                    "Evolved Similarity Techniques in Malware Analysis.",
                    "A Robust and Reversible Watermarking Technique for Relational Dataset Based on Clustering.",
                    "TRIM, Wear Levelling and Garbage Collection on Solid State Drives: A Prediction Model for Forensic Investigators.",
                    "TwinPorter - An Architecture For Enabling the Live Migration of VMI-Based Monitored Virtual Machines.",
                    "Defeating Fake Food Labels Using Watermarking and Biosequence Analysis.",
                    "Finding Rats in Cats: Detecting Stealthy Attacks using Group Anomaly Detection.",
                    "Learning Wear Patterns on Footwear Outsoles Using Convolutional Neural Networks.",
                    "Anomaly Detection in Network Traffic Using Dynamic Graph Mining with a Sparse Autoencoder.",
                    "Characterizing the Limitations of Forensic Event Reconstruction Based on Log Files.",
                    "Framework for the Retrieval of Social Media and Instant Messaging Evidence from Volatile Memory.",
                    "PURE: Generating Quality Threat Intelligence by Clustering and Correlating OSINT.",
                    "AgentChain: A Decentralized Cross-Chain Exchange System.",
                    "An Adaptive Physical Layer Key Extraction Scheme for Smart Homes.",
                    "Evaluating DAG-Based Blockchains for IoT.",
                    "Making Monero Hard-to-Trace and More Efficient.",
                    "PIT: A Probe Into Internet of Things by Comprehensive Security Analysis.",
                    "A Probability Prediction Based Mutable Control-Flow Attestation Scheme on Embedded Platforms.",
                    "A Secure and Practical Blockchain Scheme for IoT.",
                    "A Typo-Tolerant Password Authentication Scheme with Targeted Error Correction.",
                    "A Correctable Public Blockchain.",
                    "A Logic for Secure Stratified Systems and its Application to Containerized Systems.",
                    "A Secure Decentralized Trustless E-Voting System Based on Smart Contract.",
                    "(Linkable) Ring Signature from Hash-Then-One-Way Signature.",
                    "Constructing Strong Designated Verifier Signatures from Key Encapsulation Mechanisms.",
                    "MedBloc: A Blockchain-Based Secure EHR System for Sharing and Accessing Medical Data.",
                    "CloudSafe: A Tool for an Automated Security Analysis for Cloud Computing.",
                    "Security and Performance Modeling and Optimization for Software Defined Networking.",
                    "A Dynamic Access Control Policy Model for Sharing of Healthcare Data in Multiple Domains.",
                    "Tackling Data Inefficiency: Compressing the Bitcoin Blockchain.",
                    "Identifying High Value Users in Twitter Based on Text Mining Approaches.",
                    "A Secure Private Charging Pile Sharing Scheme with Electric Vehicles in Energy Blockchain.",
                    "An Object-Pair Driven Approach for Top-k mCK Query Problem by Using Hilbert R-Tree.",
                    "Feature Extraction Optimization for Bitstream Communication Protocol Format Reverse Analysis.",
                    "Diffusion Convolutional Recurrent Neural Network with Rank Influence Learning for Traffic Forecasting.",
                    "A Remaining Useful Life Prediction Method with Automatic Feature Extraction for Aircraft Engines.",
                    "A Differential Privacy-Based Protecting Data Preprocessing Method for Big Data Mining.",
                    "A Cooperative Edge Computing Scheme for Reducing the Cost of Transferring Big Data in 5G Networks.",
                    "Lightweight Deep Learning Model For Facial Expression Recognition.",
                    "Access Control Architecture for Smart City IoT Platform.",
                    "A LSTM-Based Method for Comprehension and Evaluation of Network Security Situation.",
                    "Uncertainty-Aware Resource Provisioning for Workflow Scheduling in Edge Computing Environment.",
                    "Accuracy-Aware Service Recommendation with Privacy.",
                    "Mutual Information on Tensors for Measuring the Nonlinear Correlations in Network Security.",
                    "One-Shot Malware Outbreak Detection using Spatio-Temporal Isomorphic Dynamic Features.",
                    "A Multi-channel Visualization Method for Malware Classification Based on Deep Learning.",
                    "Privacy and Security Analysis of PACE GM Protocol.",
                    "Automatic Device Selection and Access Policy Generation Based on User Preference for IoT Activity Workflow.",
                    "Measuring Trustworthiness of IoT Image Sensor Data Using Other Sensors' Complementary Multimodal Data.",
                    "Differentially Private Streaming to Untrusted Edge Servers in Intelligent Transportation System.",
                    "Trusted Autonomous Vehicle: Measuring Trust using On-Board Unit Data.",
                    "Secure Data Streaming to Untrusted Road Side Units in Intelligent Transportation System.",
                    "Protecting Code Injection Attacks in Intelligent Transportation System.",
                    "Big Data Security Frameworks Meet the Intelligent Transportation Systems Trust Challenges.",
                    "Common Security Criteria for Vehicular Clouds and Internet of Vehicles Evaluation and Selection.",
                    "Joint RSS and CSI Based Access Point Authentication Scheme in WiFi Networks via XGBoost.",
                    "Anonymous State Pinning for Private Blockchains.",
                    "Lock Picking in the Era of Internet of Things.",
                    "CHTDS: A CP-ABE Access Control Scheme Based on Hash Table and Data Segmentation in NDN.",
                    "On the Effectiveness of Electric Network Frequency (ENF) as a Source of Randomness."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "17th TrustCom / 12th BigDataSE 2018",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2018",
                "sub_name": "17th IEEE International Conference On Trust, Security And Privacy In Computing And Communications / 12th IEEE International Conference On Big Data Science And Engineering, TrustCom/BigDataSE 2018, New York, NY, USA, August 1-3, 2018.",
                "count": 287,
                "papers": [
                    "Engineering Trust: A Graph-Based Algorithm for Modeling, Validating, and Evaluating Trust.",
                    "A Novel Dynamic Cloud Service Trust Evaluation Model in Cloud Computing.",
                    "One Secure Access Scheme Based on Trusted Execution Environment.",
                    "Evaluation of Flexilink as Deterministic Unified Real-Time Protocol for Industrial Networks.",
                    "Understanding Trust, Privacy and Financial Fears in Online Payment.",
                    "DecentID: Decentralized and Privacy-Preserving Identity Storage System Using Smart Contracts.",
                    "Reputation Prediction Using Influence Conversion.",
                    "Secure, Resilient, and Self-Configuring Fog Architecture for Untrustworthy IoT Environments.",
                    "Repoxy: Replication Proxy for Trustworthy SDN Controller Operation.",
                    "A Dynamic Trust Weight Allocation Technique for Data Reconstruction in Mobile Wireless Sensor Networks.",
                    "Encrypted Domain Mel-Frequency Cepstral Coefficient and Fragile Audio Watermarking.",
                    "TARAS: Trust-Aware Role-Based Access Control System in Public Internet-of-Things.",
                    "A Privacy-Preserving Multipurpose Watermarking Scheme for Audio Authentication and Protection.",
                    "Dynamic Survivable Path Routing for Fast Changing IoT Network Topologies.",
                    "BARS: A Blockchain-Based Anonymous Reputation System for Trust Management in VANETs.",
                    "Turning Trust Around: Smart Contract-Assisted Public Key Infrastructure.",
                    "N-Combat: A Nuisance Call Combating Framework for Internet Telephony.",
                    "A Comprehensive Analysis of Packet Loss in MANETs.",
                    "Trust4App: Automating Trustworthiness Assessment of Mobile Applications.",
                    "Bionic Mechanism Based Dynamic Trust Evaluation Method in Cloud Environment.",
                    "A Universal Secret Sharing Scheme with General Access Structure Based on CRT.",
                    "ESRQ: An Efficient Secure Routing Method in Wireless Sensor Networks Based on Q-Learning.",
                    "Trust-Based Dynamic Linear Threshold Models for Non-competitive and Competitive Influence Propagation.",
                    "Securing the Internet of Things (IoT): A Security Taxonomy for IoT.",
                    "A Trust Energy-Efficient QoS Routing Scheme for Mobile Peer-to-Peer Networks.",
                    "Testing Sequence Generation Method Based on Unrelated Behaviors Serializing.",
                    "Manipulating Visibility of Political and Apolitical Threads on Reddit via Score Boosting.",
                    "Using Evolutionary Approaches to Manage Surveillance Cameras in Dynamic Environments.",
                    "An Elite Clone Parallel Genetic Algorithm for Trust Monitoring Assignment Problem in Adaptive Wireless Sensor Networks.",
                    "Quality of Information as an indicator of Trust in the Internet of Things.",
                    "A Reinforcement Learning Approach for Attack Graph Analysis.",
                    "Research on Industrial Control Anomaly Detection Based on FCM and SVM.",
                    "Authorized Equality Test of Encrypted Data for Secure Cloud Databases.",
                    "Exploring the Feasibility of Physical Layer Key Generation for LoRaWAN.",
                    "DDoS Flooding Attack Detection Based on Joint-Entropy with Multiple Traffic Features.",
                    "Practical Decentralized Attribute-Based Delegation Using Secure Name Systems.",
                    "Abnormal Item Detection Based on Time Window Merging for Recommender Systems.",
                    "Application of Visual Analysis to Detect and Analyze Patterns in VoIP Attack Traffic.",
                    "A Quality Evaluation Method of Cyber Threat Intelligence in User Perspective.",
                    "Towards Better Ocular Recognition for Secure Real-World Applications.",
                    "Identifying Peer-to-Peer Botnets Through Periodicity Behavior Analysis.",
                    "LUCON: Data Flow Control for Message-Based IoT Systems.",
                    "Cache-Collision Attacks on GPU-Based AES Implementation with Electro-Magnetic Leakages.",
                    "An Improved Monte Carlo Graph Search Algorithm for Optimal Attack Path Analysis.",
                    "Adversarial Gait Detection on Mobile Devices Using Recurrent Neural Networks.",
                    "AES Design Improvements Towards Information Security Considering Scan Attack.",
                    "Automated Breast Cancer Detection Using Machine Learning Techniques by Extracting Different Feature Extracting Strategies.",
                    "Electronic Evidence Service Research in Cloud Computing Environment.",
                    "STDC: A SDN-Oriented Two-Stage DDoS Detection and Defence System Based on Clustering.",
                    "Semantic-Based Policy Composition for Privacy-Demanding Data Linkage.",
                    "TempatMDS: A Masquerade Detection System Based on Temporal and Spatial Analysis of File Access Records.",
                    "Effective Botnet Detection Through Neural Networks on Convolutional Features.",
                    "Online Allocation of Cloud Resources Based on Security Satisfaction.",
                    "Enhancing Data Protection in a Distributed Storage Environment Using Structure-Wise Fragmentation and Dispersal of Encrypted Data.",
                    "eBot: Approach Towards Modeling an Advanced P2P Botnet.",
                    "A Practical Accountability Scheme for Oblivious RAM in Cloud Storage.",
                    "For Small Merchants: A Secure Smartphone-Based Architecture to Process and Accept NFC Payments.",
                    "Outsourced Private Function Evaluation with Privacy Policy Enforcement.",
                    "Universal Optimality of Apollonian Cell Encoders.",
                    "An Evidential Clustering Based Framework for Cyber Terrorist Cells Topology Identification.",
                    "On Designing a Questionnaire Based Honeyword Generation Approach for Achieving Flatness.",
                    "A Composite Malicious Peer Eviction Mechanism for Super-P2P Systems.",
                    "S-Audit: Efficient Data Integrity Verification for Cloud Storage.",
                    "Detecting Intruders and Preventing Hackers from Evasion by Tor Circuit Selection.",
                    "Good Vibrations: Artificial Ambience-Based Relay Attack Detection.",
                    "Selecting System Specific Cybersecurity Attack Patterns Using Topic Modeling.",
                    "Digital Blues: An Investigation Into the Use of Bluetooth Protocols.",
                    "Inscription: Thwarting ActionScript Web Attacks From Within.",
                    "A Malicious Attack on the Machine Learning Policy of a Robotic System.",
                    "Continuous Authentication System Using Online Activities.",
                    "Permission Analysis of Health and Fitness Apps in IoT Programming Frameworks.",
                    "Black Hole Attack Prevention Method Using Multiple RREPs in Mobile Ad Hoc Networks.",
                    "TMDFI: Tagged Memory Assisted for Fine-Grained Data-Flow Integrity Towards Embedded Systems Against Software Exploitation.",
                    "Accessing Data from Multiple Sources Through Context-Aware Access Control.",
                    "Efficient Binary-Encoding Access Control Policy Combination for Large-Scale Collaborative Scenarios.",
                    "FlowHacker: Detecting Unknown Network Attacks in Big Traffic Data Using Network Flows.",
                    "Evaluation for Combination of Shuffle and Diversity on Moving Target Defense Strategy for Cloud Computing.",
                    "FRVM: Flexible Random Virtual IP Multiplexing in Software-Defined Networks.",
                    "Time Independent Security Analysis for Dynamic Networks Using Graphical Security Models.",
                    "Practical Location Validation in Participatory Sensing Through Mobile WiFi Hotspots.",
                    "MASFOG: An Efficient Mutual Authentication Scheme for Fog Computing Architecture.",
                    "A Temporal and Spatial Constrained Attribute-Based Access Control Scheme for Cloud Storage.",
                    "DroidPro: An AOTC-Based Bytecode-Hiding Scheme for Packing the Android Applications.",
                    "Machine Learning for Reliable Network Attack Detection in SCADA Systems.",
                    "A Full-Scale Security Visualization Effectiveness Measurement and Presentation Approach.",
                    "Beware of SMOMBIES: Verification of Users Based on Activities While Walking.",
                    "Data Mining Based Strategy for Detecting Malicious PDF Files.",
                    "A National Mobile Identity Management Strategy for Electronic Government Services.",
                    "Blockchain Based Secured Identity Authentication and Expeditious Revocation Framework for Vehicular Networks.",
                    "Fully Decentralized Authentication and Revocation Scheme in Data Sharing Systems.",
                    "FloodShield: Securing the SDN Infrastructure Against Denial-of-Service Attacks.",
                    "A Lightweight FourQ Primitive on ARM Cortex-M0.",
                    "Pangr: A Behavior-Based Automatic Vulnerability Detection and Exploitation Framework.",
                    "Public Auditing for Network Coding Based Secure Cloud Storage.",
                    "Securing Wireless Networks from Sinkhole and Sybil Attacks Using Secure Data Aggregation Protocol.",
                    "A Novel Multi-source Fusion Model for Known and Unknown Attack Scenarios.",
                    "Adaptive Malicious URL Detection: Learning in the Presence of Concept Drifts.",
                    "Hierarchical Clustering Based Network Traffic Data Reduction for Improving Suspicious Flow Detection.",
                    "BotCensor: Detecting DGA-Based Botnet Using Two-Stage Anomaly Detection.",
                    "A General and Expandable Insider Threat Detection System Using Baseline Anomaly Detection and Scenario-Driven Alarm Filters.",
                    "Provably Secure Password Reset Protocol: Model, Definition, and Construction.",
                    "VegaStar: An Illegal Domain Detection System on Large-Scale Video Traffic.",
                    "An Experimental Flow Secure File System.",
                    "VMPBL: Identifying Vulnerable Functions Based on Machine Learning Combining Patched Information and Binary Comparison Technique by LCS.",
                    "NTPDroid: A Hybrid Android Malware Detector Using Network Traffic and System Permissions.",
                    "Energy Exhaustion Attack on Barrett's Reduction.",
                    "Authentication of IoT Device and IoT Server Using Secure Vaults.",
                    "Using Feature Selection to Identify Chains of Insecure Software Configuration Parameters.",
                    "Reinforcing IoT-Enforced Security Policies.",
                    "Enhancing Security and Scalability in Software Defined LTE Core Networks.",
                    "Uninterrupted Video Surveillance in the Face of an Attack.",
                    "Enhancing the Naive Bayes Spam Filter Through Intelligent Text Modification Detection.",
                    "A Case Study of Accelerating Apache Spark with FPGA.",
                    "A Multiple Layer Sercurity Architecture for Internet of Things into MVC Design.",
                    "Lightweight ECC with Fragile Zero-Watermarking for Internet of Things Security.",
                    "Signature Renewal for Low Entropy Data.",
                    "Profiling Network Traffic Behavior for the Purpose of Anomaly-Based Intrusion Detection.",
                    "Steganographic Transports: A Vector for Hidden Secret Internets?",
                    "Efficient Cross-User Deduplication of Encrypted Data Through Re-Encryption.",
                    "Detecting Data Leakage from Databases on Android Apps with Concept Drift.",
                    "Acies: A Privacy-Preserving System for Edge-Based Classification.",
                    "PAIRS: Privacy-Aware Identification and Recommendation of Spatio-Friends.",
                    "Lightweight Verification for Searchable Encryption.",
                    "Privacy Parameter Variation Using RAPPOR on a Malware Dataset.",
                    "reclaimID: Secure, Self-Sovereign Identities Using Name Systems and Attribute-Based Encryption.",
                    "PUSC: Privacy-Preserving User-Centric Skyline Computation Over Multiple Encrypted Domains.",
                    "Capstone: Mobility Modeling on Smartphones to Achieve Privacy by Design.",
                    "P-GENT: Privacy-Preserving Geocoding of Non-Geotagged Tweets.",
                    "A Flow-Level Architecture for Balancing Accountability and Privacy.",
                    "Asymmetric Commutative Encryption Scheme Based Efficient Solution to the Millionaires' Problem.",
                    "AuthStore: Password-Based Authentication and Encrypted Data Storage in Untrusted Environments.",
                    "SDLI: Static Detection of Leaks Across Intents.",
                    "Software System Representation Methods Based on Algebraic Component.",
                    "A Lightweight Multi-precision Squaring on Embedded Processors for ECC.",
                    "A Systematic Method on PDF Privacy Leakage Issues.",
                    "Website Fingerprinting by Power Estimation Based Side-Channel Attacks on Android 7.",
                    "Do You Like What I Like? Similarity Estimation in Proximity-Based Mobile Social Networks.",
                    "Countering Intrusiveness Using New Security-Centric Ranking Algorithm Built on Top of Elasticsearch.",
                    "A Concept and Evaluation of Usable and Fine-Grained Privacy-Friendly Cookie Settings Interface.",
                    "Highly Efficient Privacy-Preserving Key Agreement for Wireless Body Area Networks.",
                    "Privacy Preserving Distributed Deep Learning and Its Application in Credit Card Fraud Detection.",
                    "Privacy-Preserving Access Control in Electronic Health Record Linkage.",
                    "Track me if you can? Query Based Dual Location Privacy in VANETs for V2V and V2I.",
                    "QueryGuard: Privacy-Preserving Latency-Aware Query Optimization for Edge Computing.",
                    "PMDA: Privacy-Preserving Multi-functional Data Aggregation Without TTP in Smart Grid.",
                    "Understanding the Performance and Challenges of DNS Query Name Minimization.",
                    "Toward a Secure Access to 5G Network.",
                    "Fast Time Series Discords Detection with Privacy Preserving.",
                    "An Efficient Blacklistable Anonymous Credential System with Reputation Using Pairing-Based Accumulator.",
                    "Privacy-Preserving Data Synchronization Using Tensor-Based Fully Homomorphic Encryption.",
                    "Towards Domain-Specific and Privacy-Preserving Qualified eID in a User-Centric Identity Model.",
                    "RZKPB: A Privacy-Preserving Blockchain-Based Fair Transaction Method for Sharing Economy.",
                    "Towards a User-Friendly and Secure Hand Shaking Authentication for Smartphones.",
                    "A Flexible Mix-Zone Selection Scheme Towards Trajectory Privacy Protection.",
                    "PHeDHA: Protecting Healthcare Data in Health Information Exchanges with Active Data Bundles.",
                    "Monero Ring Attack: Recreating Zero Mixin Transaction Effect.",
                    "PANDORA: Preserving Privacy in PRNU-Based Source Camera Attribution.",
                    "Identifying Passive Message Fingerprint Attacks via Honey Challenge in Collaborative Intrusion Detection Networks.",
                    "Testing Cryptographically Secure Pseudo Random Number Generators with Artificial Neural Networks.",
                    "IRTED-TL: An Inter-Region Tax Evasion Detection Method Based on Transfer Learning.",
                    "One Intrusion Detection Method Based On Uniformed Conditional Dynamic Mutual Information.",
                    "Cyber Identity: Salient Trait Ontology and Computational Framework to Aid in Solving Cybercrime.",
                    "Enabling Trust in Deep Learning Models: A Digital Forensics Case Study.",
                    "Bluetooth Low Energy Used for Memory Acquisition from Smart Health Care Devices.",
                    "Resilient Bipartite Consensus for Multi-agent Networks with Antagonistic Interactions.",
                    "An Efficient Distributed Approach on High Dimensional Data Similarity Searchable Encryption.",
                    "Autoblog Forensics and Attribution.",
                    "Managed Blockchain Based Cryptocurrencies with Consensus Enforced Rules and Transparency.",
                    "A Lightweight Path Authentication Protocol for RFID-Based Supply Chains.",
                    "A Blockchain-Based Decentralized Data Storage and Access Framework for PingER.",
                    "Learning and Applying Ontology for Machine Learning in Cyber Attack Detection.",
                    "Practical K Nearest Neighbor Query Scheme with Two-Party Guarantees in Road Networks.",
                    "Privacy-Preserving Method for Temporarily Linking/Revoking Pseudonym Certificates in VANETs.",
                    "Blockchain as a Notarization Service for Data Sharing with Personal Data Store.",
                    "Superscalar Encrypted RISC: The Measure of a Secret Computer.",
                    "Fair and Transparent Blockchain Based Tendering Framework - A Step Towards Open Governance.",
                    "Blockchain Versus Database: A Critical Analysis.",
                    "A Privacy-Preserving Principal Component Analysis Outsourcing Framework.",
                    "Detecting Domain Generation Algorithms with Convolutional Neural Language Models.",
                    "FPPB: A Fast and Privacy-Preserving Method Based on the Permissioned Blockchain for Fair Transactions in Sharing Economy.",
                    "On the Design of a Blockchain-Based System to Facilitate Healthcare Data Sharing.",
                    "Consumer Centric Data Control, Tracking and Transparency - A Position Paper.",
                    "Achieving Secure and Effective Search Services in Cloud Computing.",
                    "Node Immunization in Networks with Uncertainty.",
                    "Effective Mobile Web User Fingerprinting via Motion Sensors.",
                    "Qualified eID Derivation Into a Distributed Ledger Based IdM System.",
                    "A Hybrid Recommendation Algorithm Based on Heuristic Similarity and Trust Measure.",
                    "SPARQL Multi-Query Optimization.",
                    "Identifying WeChat Red Packets and Fund Transfers Via Analyzing Encrypted Network Traffic.",
                    "Are Your Neighbors Swingers or Kinksters? Feeld App Forensic Analysis.",
                    "Browser Analysis of Residual Facebook Data.",
                    "A Forensic Investigation Framework for Smart Home Environment.",
                    "A Co-training Based Hardware Trojan Detection Technique by Exploiting Unlabeled ICs and Inaccurate Simulation Models.",
                    "Building Trusted Golden Models-Free Hardware Trojan Detection Framework Against Untrustworthy Testing Parties Using a Novel Clustering Ensemble Technique.",
                    "A Compact, Lightweight and Low-Cost 8-Bit Datapath AES Circuit for IoT Applications in 28nm CMOS.",
                    "Differential Power Analysis of 8-Bit Datapath AES for IoT Applications.",
                    "A Power Analysis Attack Countermeasure Based on Random Execution.",
                    "RNS-Based Embedding Scheme for Data Hiding in Digital Images.",
                    "Partial Scan Design Against Scan-Based Side Channel Attacks.",
                    "Behavioral Based Trust Metrics and the Smart Grid.",
                    "Differential Power Attack on SM4 Block Cipher.",
                    "Cryptanalysis of a Chaotic Ring Oscillator Based Random Number Generator.",
                    "Concepts for Trust Propagation in Knowledge Processing Systems - A Brief Introduction and Overview.",
                    "Towards Trustworthy Information Sharing by Creating Cyber Security Alliances.",
                    "An Approach of Security Protection for VSAT Network.",
                    "Monitoring of Temperature and Pressure Through Brillouin Optical Sensors for Disasters Systems.",
                    "An Implementation of Hierarchical Intrusion Detection Systems Using Snort and Federated Databases.",
                    "Low-Cost Energy-Efficient Side-Channel Attacks Resistant AES S-Box with Power-Aware Hiding Inverter in GF(2^4).",
                    "A Novel Identity Authentication for FPGA Based IP Designs.",
                    "Detection and Prevention of Routing Attacks in Internet of Things.",
                    "Low Delay and Low Cost Audio Surveillance System via a New Optimum FIR Digtal Filter.",
                    "UCAM: Usage, Communication and Access Monitoring Based Detection System for IoT Botnets.",
                    "Proposal of Multi-channel Operation Technique Using PingPong256.",
                    "A Reversible Data Hiding Scheme with High Security and Improved Embedding Capacity.",
                    "Behavioral-Based Classification and Identification of Ransomware Variants Using Machine Learning.",
                    "ALDD: A Hybrid Traffic-User Behavior Detection Method for Application Layer DDoS.",
                    "Migrating Data Between Physical Server and Cloud: Improving Accuracy and Data Integrity.",
                    "OAuth-SSO: A Framework to Secure the OAuth-Based SSO Service for Packaged Web Applications.",
                    "Energy Efficiency Analysis of Elliptic Curve Based Cryptosystems.",
                    "Research on Information Security Perception of Sina Weibo Users Based on KISCAP Model.",
                    "Evaluating the Risk Management Plan and Addressing Factors for Successes in Government Agencies.",
                    "Hierarchical Polynomial-Based Key Management Scheme in Fog Computing.",
                    "Who Would you Like to be Today?: Impersonation by Fake Azure Active Directory Identity Federation.",
                    "On the Incremental Digital Signatures.",
                    "Optimized Data de-Identification Using Multidimensional k-Anonymity.",
                    "Measuring Personal Privacy Breaches Using Third-Party Trackers.",
                    "Quantifying Information Exposure in Internet Routing.",
                    "Malicious Entities are in Vain: Preserving Privacy in Publish and Subscribe Systems.",
                    "Differentially Private Matrix Completion via Distributed Matrix Factorization.",
                    "The Challenges of Big Data Governance in Healthcare.",
                    "Double-Blind Reputation vs. Intelligent Fake VIP Attacks in Cloud-Assisted Interactions.",
                    "Analyzing HTTP-Based Information Exfiltration of Malicious Android Applications.",
                    "Privacy-Preserving Sensory Data Recovery.",
                    "Detecting Swimming Pools in 15-Minute Load Data.",
                    "C2R Net: The Coarse to Refined Network for Image Forgery Detection.",
                    "An Adaptive Sliding Window Algorithm for Mining Frequent Itemsets in Computer Forensics.",
                    "Towards Privacy-Preserving Forensic Analysis for Time-Series Medical Data.",
                    "The Process of Reverse Engineering GPU Malware and Provide Protection to GPUS.",
                    "Deduplicated Disk Image Evidence Acquisition and Forensically-Sound Reconstruction.",
                    "Towards Malware Detection via CPU Power Consumption: Data Collection Design and Analytics.",
                    "Customized Machine Learning-Based Hardware-Assisted Malware Detection in Embedded Devices.",
                    "The Blockchain for Domain Based Static Sharding.",
                    "A Practical Machine Learning Approach for Dynamic Stock Recommendation.",
                    "A Controllable Efficient Content Distribution Framework Based on Blockchain and ISODATA.",
                    "A Novel Method for Detecting Image Forgery Based on Convolutional Neural Network.",
                    "Forensic Analysis of Wear Leveling on Solid-State Media.",
                    "Providing Context-Aware Security for IoT Environments Through Context Sharing Feature.",
                    "Securing Insulin Pump System Using Deep Learning and Gesture Recognition.",
                    "Reducing Traffic Congestion for Machine to Machine Type Communication Over 4G-LTE Network by Decreasing Total Bytes Transmitted.",
                    "A Public Key Based EDNS Privacy Tunnel for DNS.",
                    "Anomaly-Based Network Intrusion Detection Model Using Deep Learning in Airports.",
                    "Towards Dynamic and Optimal Big Data Placement.",
                    "Effective Integration of Geotagged, Ancilliary Longitudinal Survey Datasets to Improve Adulthood Obesity Predictive Models.",
                    "On MapReduce Scheduling in Hadoop Yarn on Heterogeneous Clusters.",
                    "Towards a Multi-model Cloud Workflow Resource Monitoring, Adaptation, and Prediction.",
                    "Emotion Artificial Intelligence Derived from Ensemble Learning.",
                    "AMI Smart Meter Big Data Analytics for Time Series of Electricity Consumption.",
                    "An Effective Method to Generate Simulated Attack Data Based on Generative Adversarial Nets.",
                    "Prediction Algorithm Based on Weather Forecast for Energy-Harvesting Wireless Sensor Networks.",
                    "Large Scale and Parallel Sentiment Analysis Based on Label Propagation in Twitter Data.",
                    "Improved Weighted Label Propagation Algorithm in Social Network Computing.",
                    "Reducing Relational Database Performance Bottlenecks Using 3D XPoint Storage Technology.",
                    "A Critical Analysis of the V-Model of Big Data.",
                    "Let me Join Two Worlds! Analyzing the Integration of Web and Native Technologies in Hybrid Mobile Apps.",
                    "VeraGreg: A Framework for Verifiable Privacy-Preserving Data Aggregation.",
                    "Obstacles to Implementation of Information Security Governance.",
                    "A CSI Frequency Domain Fingerprint-Based Method for Passive Indoor Human Detection.",
                    "Model-Based Trust Assessment for Internet of Things Networks.",
                    "Privacy Preserving Distributed Attribute Computation for Usage Control in the Internet of Things.",
                    "Check-ins and Photos: Spatiotemporal Correlation-Based Location Inference Attack and Defense in Location-Based Social Networks.",
                    "Blockchain for Fraud Prevention: A Work-History Fraud Prevention System.",
                    "Improving Email Security with Fuzzy Rules.",
                    "Monitoring Blockchains with Self-Organizing Maps.",
                    "Unauthorized Access Point Detection Using Machine Learning Algorithms for Information Protection.",
                    "Using Artificial Neurons in Evidence Based Trust Computation.",
                    "Intrusion-Resilient Classifier Approximation: From Wildcard Matching to Range Membership.",
                    "Hardware Trojan Detection Utilizing Machine Learning Approaches.",
                    "Correlation-Based Electromagnetic Analysis Attack Using Haar Wavelet Reconstruction with Low-Pass Filtering on an FPGA Implementaion of AES.",
                    "A New Wavelet Thresholding Method Based on Cyclostationarity for Enhancing the Interception of Computer Video Leakage Signals.",
                    "Secure, Decentralized Energy Resource Management Using the Ethereum Blockchain.",
                    "Research on Malicious Code Homology Analysis Method Based on Texture Fingerprint Clustering.",
                    "Handling Capabilities in Security Policies.",
                    "On Mitigation Inefficiency of Selfish Investment in Network Recovery from High Loss SIS Infection.",
                    "SecureCloud: An Encrypted, Scalable Storage for Cloud Forensics.",
                    "Cloud Investigations of Illegal IPTV Networks.",
                    "Digital Watermarking for Relational Database Security Using mRMR Based Binary Bat Algorithm.",
                    "Cybersecurity: An Analysis of the Protection Mechanisms in a Cloud-centered Environment."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "16th TrustCom / 11th BigDataSE / 14th ICESS 2017",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2017",
                "sub_name": "2017 IEEE Trustcom/BigDataSE/ICESS, Sydney, Australia, August 1-4, 2017.",
                "count": 153,
                "papers": [
                    "Classification of Landing and Distribution Domains Using Whois' Text Mining.",
                    "Evolution of Publicly Disclosed Information in Facebook Profiles.",
                    "Practical Application-Level Dynamic Taint Analysis of Android Apps.",
                    "Authenticating Compromisable Storage Systems.",
                    "Immediate Attribute Revocation in Decentralized Attribute-Based Encryption Access Control.",
                    "On the Effectiveness of Ambient Sensing for Detecting NFC Relay Attacks.",
                    "WENC: HTTPS Encrypted Traffic Classification Using Weighted Ensemble Learning and Markov Chain.",
                    "Pseudo Anonymous and Hidden Attribute Comparison Based on Quick Friend Matching in Mobile Social Networks.",
                    "A Distinction Method of Flooding DDoS and Flash Crowds Based on User Traffic Behavior.",
                    "Based on Multi-features and Clustering Ensemble Method for Automatic Malware Categorization.",
                    "Detection of Single Event Transients Based on Compressed Sensing.",
                    "A Practical Anti-Collusion Hierarchical Identity-Based Non-interactive Key Agreement for Wireless Networks.",
                    "Securing the Neighbour Discovery Protocol in IPv6 State-ful Address Auto-Configuration.",
                    "A Public Key Encryption Scheme for String Identification.",
                    "Insider Threat Detection Through Attributed Graph Clustering.",
                    "Malware Discrimination Based on Reversed Association Task.",
                    "Fine-Grained Fingerprinting Threats to Software-Defined Networks.",
                    "SimiDroid: Identifying and Explaining Similarities in Android Apps.",
                    "A Self-healing Key Pre-distribution Scheme for Multi-phase Wireless Sensor Networks.",
                    "TransCrypt: Transparent Main Memory Encryption Using a Minimal ARM Hypervisor.",
                    "On Designing Collusion-Resistant Incentive Mechanisms for Mobile Crowdsensing Systems.",
                    "A Lightweight Anonymous Mutual Authentication with Key Agreement Protocol on ECC.",
                    "CloudController: A Writable and Heterogeneous-Adaptive Virtual Machine Introspection for Cloud Management.",
                    "Distributed Configuration, Authorization and Management in the Cloud-Based Internet of Things.",
                    "CSCdroid: Accurately Detect Android Malware via Contribution-Level-Based System Call Categorization.",
                    "Secure and Light Weight Fine-grained Access Mechanism for Outsourced Data.",
                    "Viability of Using Shadows Cast by Vehicles for Position Verification in Vehicle Platooning.",
                    "FEPDF: A Robust Feature Extractor for Malicious PDF Detection.",
                    "Discovering Malicious Domains through Alias-Canonical Graph.",
                    "A Passive Client-based Approach to Detect Evil Twin Attacks.",
                    "T2Droid: A TrustZone-Based Dynamic Analyser for Android Applications.",
                    "Hidden-Token Searchable Public-Key Encryption.",
                    "A High-Speed and SPA-Resistant Implementation of ECC Point Multiplication Over GF(p).",
                    "SEEAD: A Semantic-Based Approach for Automatic Binary Code De-obfuscation.",
                    "Secure-GLOR: An Adaptive Secure Routing Protocol for Dynamic Wireless Mesh Networks.",
                    "Evaluating the Effectiveness of Security Metrics for Dynamic Networks.",
                    "SneakLeak: Detecting Multipartite Leakage Paths in Android Apps.",
                    "An Automated Formal Process for Detecting Fault Injection Vulnerabilities in Binaries and Case Study on PRESENT.",
                    "Grouping-Proofs Based Access Control Using KP-ABE for IoT Applications.",
                    "Mediator-Based Immediate Attribute Revocation Mechanism for CP-ABE in Multicast Group Communications.",
                    "One-Round Provably Secure Yoking-Proof for RFID Applications.",
                    "Network Traffic Classification Using Tri-training Based on Statistical Flow Characteristics.",
                    "SniffDroid: Detection of Inter-App Privacy Leaks in Android.",
                    "Detecting DNS Tunnel through Binary-Classification Based on Behavior Features.",
                    "A Secure Virtual Machine Deployment Strategy to Reduce Co-residency in Cloud.",
                    "Improving Leakage Path Coverage in Android Apps.",
                    "A Traceable Outsourcing CP-ABE Scheme with Attribute Revocation.",
                    "Lightweight Authentication Protocol (LAUP) for 6LoWPAN Wireless Sensor Networks.",
                    "Sequential and Unsupervised Document Authorial Clustering Based on Hidden Markov Model.",
                    "Access Control Policy Combination from Similarity Analysis for Secure Privacy-Preserved EHR Systems.",
                    "A Relative Privacy Model for Effective Privacy Preservation in Transactional Data.",
                    "A Dual Privacy Preserving Scheme in Continuous Location-Based Services.",
                    "A Near-Optimal Source Location Privacy Scheme for Wireless Sensor Networks.",
                    "Privacy Preserving Collaborative Filtering via the Johnson-Lindenstrauss Transform.",
                    "An Efficient Disjunctive Query Enabled Ranked Searchable Encryption Scheme.",
                    "An Efficient and Secure Itinerary-Based Data Aggregation Algorithm for WSNs.",
                    "Dummy Location Selection Scheme for K-Anonymity in Location Based Services.",
                    "Secure FPGA as a Service - Towards Secure Data Processing by Physicalizing the Cloud.",
                    "Privacy-Preserving Mechanisms for Parametric Survival Analysis with Weibull Distribution.",
                    "How to Cooperate Locally to Improve Global Privacy in Social Networks? On Amplification of Privacy Preserving Data Aggregation.",
                    "Privacy-Preserving Aggregation of Smart Metering via Transformation and Encryption.",
                    "Privacy-Preserving and Collusion-aware k-NN Query Processing in Two-tiered Sensor Networks.",
                    "NodeLeaper: Lower Overhead Oblivious AVL Tree.",
                    "Assessing the Privacy Cost in Centralized Event-Based Demand Response for Microgrids.",
                    "Privacy-Preserving Detection of Statically Mutually Exclusive Roles Constraints Violation in Interoperable Role-Based Access Control.",
                    "A Trajectory Privacy-Preserving Algorithm Based on Road Networks in Continuous Location-Based Services.",
                    "Deformable Template Matching Using Proposal-Based Best-Buddies Similarity.",
                    "Anonymous CoinJoin Transactions with Arbitrary Values.",
                    "SOMR: Towards a Security-Oriented MapReduce Infrastructure.",
                    "Feedback Entropy: A New Metric to Detect Unfair Rating Attacks for Trust Computing in Cloud Environments.",
                    "Beyond the Hype: On Using Blockchains in Trust Management for Authentication.",
                    "Adaptive Threshold Scheme for Touchscreen Gesture Continuous Authentication Using Sensor Trust.",
                    "Advancing Trust Visualisations for Wider Applicability and User Acceptance.",
                    "Towards Cross-Domain eID by Using Agile Mobile Authentication.",
                    "Design and Analysis of a Modified Remote Attestation Protocol.",
                    "A New Fuzzy Clustering Approach for Reputation Management in OSNs.",
                    "Exploring Granular flow Integrity for Interconnected Trusted Platforms.",
                    "IoT Trust Estimation in an Unknown Place Using the Opinions of I-Sharing Friends.",
                    "Controversy-Aware Hybrid Trust Inference in Online Social Networks.",
                    "Ordol: Obfuscation-Resilient Detection of Libraries in Android Applications.",
                    "A Methodology for Privacy-Aware IoT-Forensics.",
                    "A Fault-based Attack on AEZ v4.2.",
                    "Digital Witness and Privacy in IoT: Anonymous Witnessing Approach.",
                    "Enhanced Operating System Protection to Support Digital Forensic Investigations.",
                    "ProtectCall: Call Protection Based on User Reputation.",
                    "Anonymous Anti-Sybil Attack Protocol for Mobile Healthcare Networks Analytics.",
                    "Implementing Chain of Custody Requirements in Database Audit Records for Forensic Purposes.",
                    "Toward Proxy Re-encryption From Learning with Errors in the Exponent.",
                    "NetworkTrace: Probabilistic Relevant Pattern Recognition Approach to Attribution Trace Analysis.",
                    "Volkswagen Car Entertainment System Forensics.",
                    "Detecting Permission Over-claim of Android Applications with Static and Semantic Analysis Approach.",
                    "Situation Semantics Aggregator for Realtime Simulation on Organizational Behaviors.",
                    "Evaluation and Improvement of Pseudo-Random Number Generator for EPC Gen2.",
                    "Adapting MapReduce for Efficient Watermarking of Large Relational Dataset.",
                    "Privileged Data Within Digital Evidence.",
                    "GPU Register Packing: Dynamically Exploiting Narrow-Width Operands to Improve Performance.",
                    "A Sample-Based Dynamic CPU and GPU LLC Bypassing Method for Heterogeneous CPU-GPU Architectures.",
                    "A Hybrid Heuristic-Genetic Algorithm with Adaptive Parameters for Static Task Scheduling in Heterogeneous Computing System.",
                    "Mixed-Criticality Control System with Performance and Robustness Guarantees.",
                    "HiNextApp: A Context-Aware and Adaptive Framework for App Prediction in Mobile Systems.",
                    "TINET+TECS: Component-Based TCP/IP Protocol Stack for Embedded Systems.",
                    "Design and Implementation of a Lightweight Smart Insole for Gait Analysis.",
                    "A Real-Time Operating System with CAN-Based Inter-Node Shared Resource Management and Distributed Shared Memory.",
                    "McFTP: A Framework to Explore and Prototype Multi-core Thermal Managements on Real Processors.",
                    "Integrating Cache-Related Preemption Delay into GEDF Analysis for Multiprocessor Scheduling with On-chip Cache.",
                    "Return-Oriented Programming on a Cortex-M Processor.",
                    "Analysis of Authentication Parameters in Uplink Scenario of Heterogeneous Networks.",
                    "Queuing Theory-Guided Performance Evaluation for a Reconfigurable High-Speed Device Interconnected Bus.",
                    "Pipeline Optimizations of Architecting STT-RAM as Registers in Rad-Hard Environment.",
                    "Industrial Big Data Visualization: A Case Study Using Flight Data Recordings to Discover the Factors Affecting the Airplane Fuel Efficiency.",
                    "Robust Vehicle Classification Based on the Combination of Deep Features and Handcrafted Features.",
                    "Precision-Enhanced Image Attribute Prediction Model.",
                    "Implementing A Framework for Big Data Anonymity and Analytics Access Control.",
                    "Mapping ECG Signal Sequences on Variant Maps.",
                    "Leveraging NoSQL for Scalable and Dynamic Data Encryption in Multi-tenant SaaS.",
                    "Large-Scale Multi-label Ensemble Learning on Spark.",
                    "Vehicle Incident Hot Spots Identification: An Approach for Big Data.",
                    "Sensor Data Modeling for Data Trustworthiness.",
                    "Efficient Privacy-Preserving Outsourcing of Large-Scale QR Factorization.",
                    "A Data Science and Engineering Solution for Fast K-Means Clustering of Big Data.",
                    "Automatically Design Distance Functions for Graph-Based Semi-Supervised Learning.",
                    "GEEK: Grammatical Evolution for Automatically Evolving Kernel Functions.",
                    "Trust Integration for Security Optimisation in P2P-Based M2M Applications.",
                    "Privacy-Preserving Queries over Secret-Shared Graph-Structured Data.",
                    "Investigating Cube Attacks on the Authenticated Encryption Stream Cipher MORUS.",
                    "Web Anomaly Detection Based on Frequent Closed Episode Rules.",
                    "Particle Size Measurement Based on Image Multivariate Multiscale Entropy.",
                    "An Intrusion Detection System Based on Polynomial Feature Correlation Analysis.",
                    "An Integration Testing Platform for Software Vulnerability Detection Method.",
                    "Privacy Protection-Oriented Mobile Crowdsensing Analysis Based on Game Theory.",
                    "(p, N)-identifiability: Anonymity under Practical Adversaries.",
                    "Base Extent Optimization for RNS Montgomery Algorithm.",
                    "Security and Resilience in 5G: Current Challenges and Future Directions.",
                    "A Survey on Authorization in Distributed Systems: Information Storage, Data Retrieval and Trust Evaluation.",
                    "Anonymous Data Sharing Between Organisations with Elliptic Curve Cryptography.",
                    "Fault Injection Attack on Salsa20 and ChaCha and a Lightweight Countermeasure.",
                    "Applications of Visualization Technology for Network Security.",
                    "Security Modeling and Analysis of Cross-Protocol IoT Devices.",
                    "Performance Evaluation of RPL Protocol under Mobile Sybil Attacks.",
                    "Implementing Usage Control in Internet of Things: A Smart Home Use Case.",
                    "A Reconfigurable High-Speed ECC Processor Over NIST Primes.",
                    "Outsourcing Privacy Preserving ID3 Decision Tree Algorithm over Encrypted Data-sets for Two-Parties.",
                    "Investigation and Automating Extraction of Thumbnails Produced by Image Viewers.",
                    "Corruption-Resistant Privacy Preserving Distributed EM Algorithm for Model-Based Clustering.",
                    "A Testbed for Security Analysis of Modern Vehicle Systems.",
                    "An Eclat Algorithm Based Energy Detection for Cognitive Radio Networks.",
                    "Deployment of Intrusion Detection System in Cloud: A Performance-Based Study.",
                    "FBRC: Optimization of task Scheduling in Fog-Based Region and Cloud.",
                    "On the Performance of a Trustworthy Remote Entity in Comparison to Secure Multi-party Computation.",
                    "Visualizing the New Zealand Cyber Security Challenge for Attack Behaviors.",
                    "Attribution Using Keyboard Row Based Behavioural Biometrics for Handedness Recognition.",
                    "Online Social Network Information Forensics: A Survey on Use of Various Tools and Determining How Cautious Facebook Users are?",
                    "An Efficient Approach for Advanced Malware Analysis Using Memory Forensic Technique."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "15th TrustCom / 10th BigDataSE / 14th ISPA 2016",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2016",
                "sub_name": "2016 IEEE Trustcom/BigDataSE/ISPA, Tianjin, China, August 23-26, 2016.",
                "count": 311,
                "papers": [
                    "An Efficient DDoS Detection with Bloom Filter in SDN.",
                    "PrefRank: Quantification and Aggregation of Subjective User Preferences.",
                    "A Robust Image Hashing with Enhanced Randomness by Using Random Walk on Zigzag Blocking.",
                    "Securing Fast Learning! Ridge Regression over Encrypted Big Data.",
                    "TPAHS: A Truthful and Profit Maximizing Double Auction for Heterogeneous Spectrums.",
                    "Computational Trust Model for Repeated Trust Games.",
                    "Formal Analysis of Selective Disclosure Attribute-Based Credential System in Applied Pi Calculus.",
                    "Node Trust Prediction Framework in Mobile Ad Hoc Networks.",
                    "Virtual TPM Dynamic Trust Extension Suitable for Frequent Migrations.",
                    "Trust Enhancement over Range Search for Encrypted Data.",
                    "Healthcare Fraud Detection Based on Trustworthiness of Doctors.",
                    "Integrated Security for Services Hosted in Virtual Environments.",
                    "A Permissioned Blockchain Framework for Supporting Instant Transaction and Dynamic Block Size.",
                    "Trust Validation of Cloud IaaS: A Customer-centric Approach.",
                    "Distributed Bitcoin Account Management.",
                    "Trusted Boolean Search on Cloud Using Searchable Symmetric Encryption.",
                    "Astroturfing Detection in Social Media: Using Binary n-Gram Analysis for Authorship Attribution.",
                    "Dynamic Attribute-Based Access Control in Cloud Storage Systems.",
                    "A Trust and Privacy Preserving Handover Authentication Protocol for Wireless Networks.",
                    "Fingerprinting for Web Applications: From Devices to Related Groups.",
                    "Partial Attestation: Towards Cost-Effective and Privacy-Preserving Remote Attestations.",
                    "Adaptive Reputation Weights Assignment Scheme for MANETs.",
                    "Secure and Trusted Execution: Past, Present, and Future - A Critical Review in the Context of the Internet of Things and Cyber-Physical Systems.",
                    "An Improvement of Tree-Rule Firewall for a Large Network: Supporting Large Rule Size and Low Delay.",
                    "Trust and Risk Semantics and Prediction through Big Data Analytics to Encompass Cloud Services, Cyber-Physical Systems, and Social Media: Issues and Challenges.",
                    "Group-Based Memory Deduplication against Covert Channel Attacks in Virtualized Environments.",
                    "Delay PUF Assessment Method Based on Side-Channel and Modeling Analyzes: The Final Piece of All-in-One Assessment Methodology.",
                    "DomXssMicro: A Micro Benchmark for Evaluating DOM-Based Cross-Site Scripting Detection.",
                    "Combinational Logic Binding for FPGA System Security.",
                    "Efficient Hardware Implementation of Roadrunner for Lightweight Application.",
                    "The Power of Prefix Hijackings in the Internet Hierarchy.",
                    "Efficient Integrity Verification of Secure Outsourced kNN Computation in Cloud Environments.",
                    "A Deep Learning Approach to Android Malware Feature Learning and Detection.",
                    "Matching Similar Functions in Different Versions of a Malware.",
                    "Robustness of the Packet Delay Channels.",
                    "URL Based Gateway Side Phishing Detection Method.",
                    "Automatic Model Selection for Anomaly Detection.",
                    "ProDigger: Towards Robust Automatic Network Protocol Fingerprint Learning via Byte Embedding.",
                    "Identification of Cloned HF RFID Proximity Cards Based on RF Fingerprinting.",
                    "Automatic Mobile Application Traffic Identification by Convolutional Neural Networks.",
                    "Modelling and Analysis of Network Security - An Algebraic Approach.",
                    "GSLAC: A General Scalable and Low-Overhead Alert Correlation Method.",
                    "Cache Control Method Mitigating Packet Concentration of Router Caused by Interest Flooding Attack.",
                    "A Cloud-Based RFID Authentication Protocol with Insecure Communication Channels.",
                    "Considering Internal Vulnerabilities and the Attacker's Knowledge to Model the Impact of Cyber Events as Geometrical Prisms.",
                    "New Efficient Certificateless Blind Signature Scheme.",
                    "Model Checking Probabilistic Network Propagation Protection Strategies.",
                    "An Efficient and Fine-Grained Access Control Scheme for Multidimensional Data Aggregation in Smart Grid.",
                    "Natural Laws as a Baseline for Network Anomaly Detection.",
                    "Classifying Android Malware with Dynamic Behavior Dependency Graphs.",
                    "ForceDROID: Extracting Hidden Information in Android Apps by Forced Execution Technique.",
                    "Code Reuse Attack Mitigation Based on Function Randomization without Symbol Table.",
                    "Energy-Efficient Hardware Implementation of LUKS PBKDF2 with AES on FPGA.",
                    "Security Analysis and Vulnerability Detection of Gesture-Based Lock in Android Applications.",
                    "Fast Cut-and-Choose Bilateral Oblivious Transfer for Malicious Adversaries.",
                    "Towards Cross-Border Authorization in European eID Federations.",
                    "A Game-Theoretic Model on Coalitional Attacks in Smart Grid.",
                    "Extending EMV Tokenised Payments to Offline-Environments.",
                    "A Cleanroom Monitoring System for Network Computing Service Based on Remote Attestation.",
                    "Risk Analysis of Exposed Methods to JavaScript in Hybrid Apps.",
                    "SENTRY: A Novel Approach for Mitigating Application Layer DDoS Threats.",
                    "A Dynamic Game with Adaptive Strategies for IEEE 802.15.4 and IoT.",
                    "What If Routers Are Malicious? Mitigating Content Poisoning Attack in NDN.",
                    "Exploiting Dynamic Scheduling for VM-Based Code Obfuscation.",
                    "Secure Shortest Path Search over Encrypted Graph Supporting Synonym Query in Cloud Computing.",
                    "Error Decomposition Algorithm for Approximating the k-Error Linear Complexity of Periodic Sequences.",
                    "SUIDroid: An Efficient Hardening-Resilient Approach to Android App Clone Detection.",
                    "Semantic-Based Privacy Protection of Electronic Health Records for Collaborative Research.",
                    "Taxonomy of Man-in-the-Middle Attacks on HTTPS.",
                    "From Reactionary to Proactive Security: Context-Aware Security Policy Management and Optimization under Uncertainty.",
                    "An ADS-B Intrusion Detection System.",
                    "An Accurate FDD-Based Approach for Discovering Distributed Firewalls Misconfigurations.",
                    "Android App Malicious Behavior Detection Based on User Intention.",
                    "Threshold Yoking/Grouping Proofs Based on CP-ABE for IoT Applications.",
                    "Optimal Flow Allocation and Linear Network Coding Design for Multiple Multicasts under the Requirements of Information Theoretical Security.",
                    "Dual Processing Engine Architecture to Speed Up Optimal Ate Pairing on FPGA Platform.",
                    "Data Sharing in Secure Multimedia Wireless Sensor Networks.",
                    "SecMANO: Towards Network Functions Virtualization (NFV) Based Security MANagement and Orchestration.",
                    "Secure Autonomous UAVs Fleets by Using New Specific Embedded Secure Elements.",
                    "AppBot: A Novel P2P Botnet Architecture Resistant to Graph-Based Tracking.",
                    "Securely Outsourcing of Bilinear Pairings with Untrusted Servers for Cloud Storage.",
                    "Whispers between the Containers: High-Capacity Covert Channel Attacks in Docker.",
                    "Mobility Management for Enterprises in BYOD Deployment.",
                    "New Exploit Methods against Ptmalloc of GLIBC.",
                    "S2Net: A Security Framework for Software Defined Intelligent Building Networks.",
                    "SeLance: Secure Load Balancing of Virtual Machines in Cloud.",
                    "A Provably-Secure and Efficient Verifier-Based Anonymous Password-Authenticated Key Exchange Protocol.",
                    "A Study on Detection and Recovery of Speech Signal Tampering.",
                    "PerfDoc: Automatic Performance Bug Diagnosis in Production Cloud Computing Infrastructures.",
                    "Anomadroid: Profiling Android Applications' Behaviors for Identifying Unknown Malapps.",
                    "Securing Power System State Estimation.",
                    "A Security-Oriented Workflow Framework for Collaborative Environments.",
                    "A Survey on Quantitative Evaluation of Web Service Security.",
                    "Privacy-Preserving Query Log Sharing Based on Prior N-Word Aggregation.",
                    "Enhancing Location Privacy through User-Defined Grid in Location-Based Services.",
                    "Security Enhanced Attribute Based Signcryption for Private Data Sharing in Cloud.",
                    "WiN: Non-invasive Abnormal Activity Detection Leveraging Fine-Grained WiFi Signals.",
                    "Semantic-Aware Dummy Selection for Location Privacy Preservation.",
                    "Multiple Mix-Zones Deployment for Continuous Location Privacy Protection.",
                    "Modeling Privacy Aware Information Sharing Systems: A Formal and General Approach.",
                    "Local Self-Organization with Strong Privacy Protection.",
                    "Privacy-Preserving Location-Aware Mobile Advertisement.",
                    "Efficient and Privacy-Preserving k-Means Clustering for Big Data Mining.",
                    "Privacy-Preserving Image Retrieval in IoT-Cloud.",
                    "DroidContext: Identifying Malicious Mobile Privacy Leak Using Context.",
                    "Privacy-Preserving Top-k Nearest Keyword Search on Outsourced Graphs.",
                    "Anonymity-Based Privacy Preserving Network Data Publication.",
                    "A Privacy Protection Mechanism for NoSql Database Based on Data Chunks.",
                    "Model for Hiding Data Relationships Based on Chunk-Confusion in Cloud Computing.",
                    "A Novel Verifiable and Dynamic Fuzzy Keyword Search Scheme over Encrypted Data in Cloud Computing.",
                    "Formal Modeling and Verification of Security Protocols on Cloud Computing Systems Based on UML 2.3.",
                    "Privacy Preserving Provable Data Possession for Cloud Based Electronic Health Record System.",
                    "IMPROVE - Identifying Minimal PROfile VEctors for Similarity Based Access Control.",
                    "Energy-Efficient and Privacy-Preserving Range Query in Participatory Sensing.",
                    "Privacy-Preserving Internet Traffic Publication.",
                    "Preserving Location and Content Privacy for Secure Ranked Queries in Location Based Services.",
                    "Privacy Preserving Computation by Fragmenting Individual Bits and Distributing Gates.",
                    "Association Rules Discovery via Approximate Method from Probabilistic Database.",
                    "Towards an Effective Secret Key Generation Scheme for Imperfect Channel State Information.",
                    "Inherit Differential Privacy in Distributed Setting: Multiparty Randomized Function Computation.",
                    "How to Automatically Identify the Homology of Different Malware.",
                    "Fast Reused Function Retrieval Method Based on Simhash and Inverted Index.",
                    "Forensic Analysis of Email on Android Volatile Memory.",
                    "Adaptive Polar Based Filtering Method for Image Copy-Move Forgery Detection.",
                    "CloudPhylactor: Harnessing Mandatory Access Control for Virtual Machine Introspection in Cloud Data Centers.",
                    "Using Multi-features and Ensemble Learning Method for Imbalanced Malware Classification.",
                    "Log Your Car: The Non-invasive Vehicle Forensics.",
                    "Enhancing Source Camera Identification Based on Multiplicative Denoising Filter.",
                    "Power Traces Clipping and Splicing Enhanced Correlation Collision Analysis.",
                    "LIPPS: Logistics Information Privacy Protection System Based on Encrypted QR Code.",
                    "JPEG Compression Forensics against Resizing.",
                    "Bring Your Own Disclosure: Analysing BYOD Threats to Corporate Information.",
                    "Double-Key Recovery Based Correlation Power Analysis.",
                    "An Efficient Approach of Integrating RFID and Vision Techniques in Object Surveillance System.",
                    "A Fingerprint Indexing Algorithm on Encrypted Domain.",
                    "A Hybrid Monitoring Mechanism in Virtualized Environments.",
                    "Detecting Malicious Behavior and Collusion for Online Rating System.",
                    "Handedness Recognition through Keystroke-Typing Behavior in Computer Forensics Analysis.",
                    "Design and Evaluation of Advanced Collusion Attacks on Collaborative Intrusion Detection Networks in Practice.",
                    "DedupeSwift: Object-Oriented Storage System Based on Data Deduplication.",
                    "BOLAS+: Scalable Lightweight Locality-Aware Scheduling for Hadoop.",
                    "Leveraging Page-Level Compression in MySQL - A Practice at Baidu.",
                    "Improvements to Online Distributed Monitoring Systems.",
                    "An Improved Multi-path Routing Algorithm for Hybrid LEO-MEO Satellite Networks.",
                    "Ephemeral Data Storage for Networks of Hand-Held Devices.",
                    "An Indoor and Outdoor Seamless Positioning System Based on Android Platform.",
                    "Rule Selector: A Novel Scalable Model for High-Performance Flow Recognition.",
                    "WiSal: Ubiquitous WiFi-Based Device-Free Passive Subarea Localization without Intensive Site-Survey.",
                    "Multi-objective Based Performance Evaluation of Deduplication Approaches.",
                    "A Tool to Detect Performance Problems of Multi-threaded Programs on NUMA Systems.",
                    "An Optimized Layered Routing Algorithm for GEO/LEO Hybrid Satellite Networks.",
                    "Pipelined Online Data Insertion for Erasure Codes in Distributed Storage Systems.",
                    "A Trust-Based Cooperative Spectrum Sensing Scheme against SSDF Attack in CRNs.",
                    "MTPGraph: A Data-Driven Approach to Predict Medical Risk Based on Temporal Profile Graph.",
                    "Evaluating and Optimizing Parallel LU-SGS for High-Order CFD Simulations on the Tianhe-2 Supercomputer.",
                    "SCADIS: A Scalable Accelerator for Data-Intensive String Set Matching on FPGAs.",
                    "Shortest Partial Path First Algorithm for Reconfigurable Processor Array with Faults.",
                    "An Enhanced Node Mapping Algorithm for VNE Problem Based on Path Relevance.",
                    "Phylogenetic Likelihood Estimation on GPUs Using Vertical Partitioning Scheme.",
                    "Adjusting Parameters of k-Ary n-Cube to Achieve Better Cost Performance.",
                    "Hamiltonian Cycle and Path Embeddings in 3-Ary n-Cubes Based on K1, 2-Structure Faults.",
                    "Interference-Aware Multi-source Transmission.",
                    "A Truthful Greedy Mechanism toward Resource Sharing for Cloudlets in Mobile Cloud Computing.",
                    "Penalty Cost Minimization for Multi-tenant Query Deadline Employing Cache Optimization and Log Based Dispatching.",
                    "Virtual Network Deployment in Hybrid Data Center Networks.",
                    "A Comprehensive Optimization for Performance, Energy Efficiency, and Maintenance in Cloud Datacenters.",
                    "Parallelizing Degraded Read for Erasure Coded Cloud Storage Systems Using Collective Communications.",
                    "I/O Congestion-Aware Computing Resource Assignment and Scheduling in Virtualized Cloud Environments.",
                    "Intelligent Forwarding Strategy Based on Online Machine Learning in Named Data Networking.",
                    "A Model with Hierarchical Classifiers for Activity Recognition on Mobile Devices.",
                    "Using Dynamic Granularity Strategy to Accelerate Unbalanced Tree Search.",
                    "Data-Oriented Runtime Scheduling Framework on Multi-GPUs.",
                    "Bicriteria Load Balancing for Online Placement in Heterogeneous Servers with Extreme Upper Bounds.",
                    "Differential Evolution Based Selective Ensemble of Extreme Learning Machine.",
                    "A Skew-Insensitive Hashing Sync and Construction Scheme for Many-Core Coprocessors.",
                    "Power-Bandwidth Aware Cooperative Routing in Multi-radio Multi-channel Wireless Network.",
                    "Accelerating Big Data Applications on Tiered Storage System with Various Eviction Policies.",
                    "MLC: An Efficient Multi-level Log Compression Method for Cloud Backup Systems.",
                    "Wi-Wri: Fine-Grained Writing Recognition Using Wi-Fi Signals.",
                    "Evaluating the POWER8 Architecture through Optimizing Stencil-Based Algorithms.",
                    "SDN-Based Efficient Bandwidth Allocation for Caching Enabled Cognitive Radio Networks.",
                    "A Topic Approach to Sentence Ordering for Multi-document Summarization.",
                    "Pattern Aware Cache Management for Efficient Subset Retrieving of Astronomical Image Data.",
                    "Robust Spatio-temporal Tensor Recovery for Internet Traffic Data.",
                    "Improving Energy Efficiency by Phase-Grained Migration for Asymmetric Multicore.",
                    "An Efficient Framework for Incremental Graph Computation.",
                    "NVM-Assisted Non-redundant Logging for Android Systems.",
                    "VSP: A Virtual Smartphone Platform to Enhance the Capability of Physical Smartphone.",
                    "iMap: A Crowdsensing Based System for Outdoor Radio Signal Strength Map.",
                    "A Memory Access Pattern-Based Program Profiling System for Dynamic Parallelism Prediction.",
                    "Workload-Aware Scheduling Across Geo-distributed Data Centers.",
                    "FairShare: Dynamic Max-Min Fairness Bandwidth Allocation in Datacenters.",
                    "Minimizing Schedule Length of Energy Consumption Constrained Parallel Applications on Heterogeneous Distributed Systems.",
                    "Sznajd2: A Community-Aware Opinion Dynamics Model.",
                    "A Novel Hash-Based File Clustering Scheme for Efficient Distributing, Storing, and Retrieving of Large Scale Health Records.",
                    "Codelet Scheduling by Genetic Algorithm.",
                    "MRDC: Multicast Data Restoration in Fat-Tree Data Center Networks.",
                    "Lowering Down the Cost for Green Cloud Data Centers by Using ESDs and Energy Trading.",
                    "Security Aware and Energy-Efficient Virtual Machine Consolidation in Cloud Computing Systems.",
                    "Locality Protected Dynamic Cache Allocation Scheme on GPUs.",
                    "Prediction of Consecutive Road Node Congestion Based on Queueing Model.",
                    "An Analytical Model of Data Plane Performance Subject to Prioritized Service.",
                    "A Distributed Game-Theoretic Approach for IaaS Service Trading in an Auction-Based Cloud Market.",
                    "The Design and Implementation of a Lightweight Management Framework for Non-volatile Memory.",
                    "Evaluating Performance of Rescheduling Strategies in Cloud System.",
                    "Joint Selection of Providers and the New Comer for Optimal Repair in Distributed Storage Network with Network Coding.",
                    "Privacy Preservation in Social Network against Public Neighborhood Attacks.",
                    "Capacity Analysis and Link Scheduling Design in Double-Channel Full-Duplex Wireless Networks.",
                    "Community Detection in Complicated Network Based on the Multi-view Weighted Signed Permanence.",
                    "Hierarchical Consistent Hashing for Heterogeneous Object-Based Storage.",
                    "Rethinking High Performance Computing System Architecture for Scientific Big Data Applications.",
                    "Experimental Study of Disruption-Tolerant Transport Protocol for Mobile Ad-Hoc Networks with Connection Diversity.",
                    "Stacked Product Quantization for Nearest Neighbor Search on Large Datasets.",
                    "Multiple Query-Independent Values Based Asymmetric Ranking for Approximate Nearest Neighbor Search.",
                    "Temperature-Aware Register Mapping in GPGPUs.",
                    "Online Credit Card Fraud Detection: A Hybrid Framework with Big Data Technologies.",
                    "Social Circles Discovery Based on Structural and Attribute Similarities.",
                    "Towards Scalable and Reliable In-Memory Storage System: A Case Study with Redis.",
                    "What Is My Next Job: Predicting the Company Size and Position in Career Changes.",
                    "Improving Robustness of a SVR Based Algorithm Trading Model with Carefully Crafted Features and a Diversified Portfolio.",
                    "Subgroup Discovery on Big Data: Exhaustive Methodologies Using Map-Reduce.",
                    "Improved Scheduling Algorithms for Single-Path Multiple Bandwidth Reservation Requests.",
                    "A Novel Text Feature Weight Calculation Method Applied to Power Field.",
                    "A Novel Image Retrieval Approach with Bag-of-Word Model and Gabor Feature.",
                    "Fall Detection Based on Tilt Angle and Acceleration Variations.",
                    "Taint Reverse Propagation for Analysis of Privacy Leak.",
                    "Progress in Command and Control Server Finding Schemes of Botnet.",
                    "URLSight: Profiling Mobile Users via Large-Scale Internet Metadata Analytics.",
                    "Improving JavaScript Malware Classifier's Security against Evasion by Particle Swarm Optimization.",
                    "A Privacy-Preserving Incentive Scheme for Advertisement Dissemination in Vehicular Social Networks.",
                    "SECUPerf: End-to-End Security and Performance Assessment of Cloud Services.",
                    "DroidCollector: A High Performance Framework for High Quality Android Traffic Collection.",
                    "Decentralized Ciphertext-Policy Attribute-Based Encryption from Learning with Errors over Rings.",
                    "Enhancing the SVDD Accuracy in Intrusion Detection Systems by Removing External Voids.",
                    "Security Challenges in Future NDN-Enabled VANETs.",
                    "A Progressive Approach to Design Authentication Protocols for Mobile Heterogeneous Networks.",
                    "Forensic Malware Analysis: The Value of Fuzzy Hashing Algorithms in Identifying Similarities.",
                    "Machine Learning Based Botnet Identification Traffic.",
                    "A Mobile Security-Related Behavior Prevention Model Based on Speech Personality Traits.",
                    "Topology Prediction Mechanism for Pocket Switched Network Based on Deep Belief Network.",
                    "Application of Modified BLP Model on Mobile Web Operating System.",
                    "ETSTM: A New Green Software Model.",
                    "The Method of Generating Web Link Security Testing Scenario Based on UML Diagram.",
                    "On Probabilistic Application Compliance.",
                    "Research on the Nonintrusive Resource Level Fault Injection Technology for Windows System.",
                    "Delta-Generalization: High Accuracy Data Release for Privacy Preserving.",
                    "ChainSpot: Mining Service Logs for Cyber Security Threat Detection.",
                    "On Designing Leakage-Resilient Vibration Based Authentication Techniques.",
                    "Botnet Detection Method Analysis on the Effect of Feature Extraction.",
                    "Security Enhancements in EMV Protocol for NFC Mobile Payment.",
                    "Universal Steganography Detector Based on an Artificial Immune System for JPEG Images.",
                    "An O2O Service Recommendation Algorithm Based on User Context and Trust Service.",
                    "Suppressing Selfish Transmissions with Extending NAV Period and Resetting CW of Access Point in Wireless LAN.",
                    "SecPage - A Lightweight Memory Protection Architecture.",
                    "UVisP: User-centric Visualization of Data Provenance with Gestalt Principles.",
                    "An Efficient Influence Maximization Algorithm Considering Both Positive and Negative Relationships.",
                    "A Multi-keyword Multi-user Searchable Encryption Scheme Based on Cloud Storage.",
                    "Secure Mobile Payment Employing Trusted Computing on TrustZone Enabled Platforms.",
                    "A Novel Trustworthy Framework for Cloud Based Rendering Application.",
                    "Resource-centric Dynamic Access Control in Cloud.",
                    "Security Secret Information Hiding Based on Hash Function and Invisible ASCII Characters Replacement.",
                    "Bad Data Injection Attacks Identification in Power System on Fast Decoupled Load Flow.",
                    "A Hadoop Based Analysis and Detection Model for IP Spoofing Typed DDoS Attack.",
                    "On the Leakage Resilient Cryptography in Game-Theoretic Settings.",
                    "Authentication by Witness Functions.",
                    "The Data Privacy Matrix Project: Towards a Global Alignment of Data Privacy Laws.",
                    "The Health Care Fraud Detection Using the Pharmacopoeia Spectrum Tree and Neural Network Analytic Contribution Hierarchy Process.",
                    "Aggregated Signatures for Chaining: A Secure Provenance Scheme.",
                    "Comparison of Five Packet-Sampling-Based Methods for Detecting Elephant Flows.",
                    "Ship Automatic Collision Avoidance by Altering Course Based on Ship Dynamic Domain.",
                    "The Design and Application of an Intelligentialized Monitoring System for Mooring Safety.",
                    "Study on the Control of Fractional-Order PID for Underwater Vehicle Attitude Angle.",
                    "Method for Detecting Information Leakage from Computer Display in Electromagnetic Radiation.",
                    "Chunk-Based Resource Allocation with Fairness Consideration for Layered Multicast Streaming in OFDMA Systems.",
                    "Design and Planning of Heterogeneous Marine Sensor Networks for Marine Intelligent Transportation.",
                    "Optimal Deployment and Dimensioning of Fog Computing Supported Vehicular Network.",
                    "Research on Key Technologies and Standard Framework of Secure and Smart Container.",
                    "The Application of Ad-Hoc Network in Smart Container Tracking System.",
                    "A Dynamic Power Management Algorithm for Sporadic Tasks in Real-Time Embedded Systems.",
                    "A Hierarchic Hybrid Scheduling Algorithm for Static Task with Precedence Constraints.",
                    "SW-HMM: A Method for Evaluating Confidence of Smartphone-Based Activity Recognition.",
                    "An Architecture of Parallel Tiled QRD Algorithm for MIMO-OFDM Systems.",
                    "Combinatorial Reverse Auction-Based Service Provision in Social Clouds.",
                    "pHSA: A Price Schedule for Heterogeneous Spectrum Auction.",
                    "Scheduling Dependent Coflows with Guaranteed Job Completion Time.",
                    "Parallel Monte Carlo Method with MapReduce for Option Pricing.",
                    "A New Model Based on GEP-SWPM for Predicting Heavy Metals Speciation.",
                    "A Flexible Chip Multiprocessor Simulator Dedicated for Thread Level Speculation.",
                    "An Algorithm for Analyzing the City Residents' Activity Information through Mobile Big Data Mining.",
                    "Performance Modeling and Analysis for Critical Section Contention in Parallel Codes.",
                    "StageFS: A Parallel File System Optimizing Metadata Performance for SSD Based Clusters.",
                    "A Subgraph Preconditioning Algorithm for Large Linear Systems.",
                    "Fast Task Submission in Software Thread Level Speculation Systems.",
                    "Evaluating Multi-core and Many-Core Architectures through Parallelizing a High-Order WENO Solver.",
                    "Minimum Control Latency of SDN Controller Placement.",
                    "Data Trustworthiness in Wireless Sensor Networks.",
                    "Fall Detection Based on KPCA and 3D KPCA.",
                    "The Survey of Low-Power Sleep Monitoring Algorithm Based on the Wrist Movement Signal.",
                    "P Wave Detection and Delineation Based on Distances Transform.",
                    "The Analysis of Crosstalk Noise Component in Wearable Device.",
                    "Towards Application-Aware In-Network Bandwidth Management in Data Centers.",
                    "On the Definition of Real-Time: Applications and Systems.",
                    "A Review on Complex Network Dynamics in Evolutionary Algorithm.",
                    "Meta-Model Evolution with Self-Adaptation: An Empirical Development Approach for Distributed Parallel Computing Framework.",
                    "A Statistical-Feature ML Approach to IP Traffic Classification Based on CUDA.",
                    "CSBD: A Nonlinear Clustering Method Based on Cluster Shrinking and Border Detection.",
                    "Surveillance Methods of Running Condition of Chemical Equipments Based on Skyline.",
                    "Big Data Analysis on the Relationship between the Organizational Career Management and Knowledge Workers' Work Involved - Take the High-Tech Enterprise as an Example.",
                    "A Limited-Iteration Bisecting K-Means for Fast Clustering Large Datasets.",
                    "Inverted Voronoi-Based kNN Query Processing with MapReduce.",
                    "A Novel Solution of Data Analysis in Modern Sports Education."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "14th TrustCom / 9th BigDataSE / 13th ISPA 2015",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2015-1",
                "sub_name": "2015 IEEE TrustCom/BigDataSE/ISPA, Helsinki, Finland, August 20-22, 2015, Volume 1.",
                "count": 190,
                "papers": [
                    "DynFluid: Predicting Time-Evolving Rating in Recommendation Systems via Fluid Dynamics.",
                    "CloudRec: A Mobile Cloud Service Recommender System Based on Adaptive QoS Management.",
                    "Improved Lightweight Pseudo-Random Number Generators for the Low-Cost RFID Tags.",
                    "Trust Evaluation in Mobile Devices: An Empirical Study.",
                    "Dynamic Trust Evaluation of Wireless Sensor Networks Based on Multi-factor.",
                    "TrustTokenF: A Generic Security Framework for Mobile Two-Factor Authentication Using TrustZone.",
                    "On Rehoming the Electronic ID to TEEs.",
                    "Trusted Execution Environment: What It is, and What It is Not.",
                    "JoKER: Trusted Detection of Kernel Rootkits in Android Devices via JTAG Interface.",
                    "Performance of Cooperative Firewalls in Real-World Deployments.",
                    "Memory Attestation of Wireless Sensor Nodes by Trusted Local Agents.",
                    "Mobility Increases the Risk of Malware Propagations in Wireless Networks.",
                    "Simmelian Ties and Structural Holes: Exploring Their Topological Roles in Forming Trust for Securing Wireless Sensor Networks.",
                    "Cooperative Transmission Against Impersonation Attack Using Inter-Session Interference in Two-Hop Wireless Networks.",
                    "Reputation Propagation and Updating in Mobile Ad Hoc Networks with Byzantine Failures.",
                    "Contextual Sub-network Extraction in Contextual Social Networks.",
                    "Trust-Based Formal Delegation Framework for Enterprise Social Networks.",
                    "Trust-Aware Elastic Social Compute Units.",
                    "Regenerating-Codes-Based Efficient Remote Data Checking and Repairing in Cloud Storage.",
                    "Research on Key Management for Multi-privileged Group Communications.",
                    "Attainable Unconditional Security for Shared-Key Cryptosystems.",
                    "Keyword Revocable Searchable Encryption with Trapdoor Exposure Resistance and Re-generateability.",
                    "RFID Secure Application Revocation for IoT in 5G.",
                    "Identifying Unknown Android Malware with Feature Extractions and Classification Techniques.",
                    "Loop-Oriented Programming: A New Code Reuse Attack to Bypass Modern Defenses.",
                    "Efficient Detection of Zero-day Android Malware Using Normalized Bernoulli Naive Bayes.",
                    "A First Look at Android Malware Traffic in First Few Minutes.",
                    "Fast Identification of Obfuscation and Mobile Advertising in Mobile Malware.",
                    "Secure Block Device - Secure, Flexible, and Efficient Data Storage for ARM TrustZone Systems.",
                    "A Fault-Tolerant Watermarking Algorithm for FPGA IP Protection.",
                    "Big Data Analytics for Detecting Host Misbehavior in Large Logs.",
                    "DPBSV - An Efficient and Secure Scheme for Big Sensing Data Stream.",
                    "Interplay of Security&Dependability and Resource Using Model-Driven and Pattern-Based Development.",
                    "RPAH: Random Port and Address Hopping for Thwarting Internal and External Adversaries.",
                    "MimicHunter: A General Passive Network Protocol Mimicry Detection Framework.",
                    "An Analysis of TLS Handshake Proxying.",
                    "How to Misuse SMTP over TLS: A Study of the (In) Security of Email Server Communication.",
                    "Unsupervised Feature Selection Method for Intrusion Detection System.",
                    "Identifying Diffusion Sources in Large Networks: A Community Structure Based Approach.",
                    "An Entropy-Based Distributed DDoS Detection Mechanism in Software-Defined Networking.",
                    "A Sybil Attack Detection Scheme for a Centralized Clustering-Based Hierarchical Network.",
                    "Surveys of Daily Information Security of Citizens in Finland.",
                    "Drive-by Disclosure: A Large-Scale Detector of Drive-by Downloads Based on Latent Behavior Prediction.",
                    "Diversifying SQL to Prevent Injection Attacks.",
                    "Information Security Awareness in Educational Institution: An Analysis of Students' Individual Factors.",
                    "A Hybrid Mobile Authentication Model for Ubiquitous Networking.",
                    "Integrity Protection of NDEF Message with Flexible and Enhanced NFC Signature Records.",
                    "An Instruction-Set Randomization Using Length-Preserving Permutation.",
                    "Cut-and-Choose Bilateral Oblivious Transfer and Its Application.",
                    "A Family of Scalable Polynomial Multiplier Architectures for Lattice-Based Cryptography.",
                    "Open-TEE - An Open Virtual Trusted Execution Environment.",
                    "Transparent Page-Based Kernel and User Space Execution Tracing from a Custom Minimal ARM Hypervisor.",
                    "NIST CyberSecurity Framework Compliance: A Generic Model for Dynamic Assessment and Predictive Requirements.",
                    "A Joint Optimization Approach to Security-as-a-Service Allocation and Cyber Insurance Management.",
                    "Efficient Integrity Auditing for Shared Data in the Cloud with Secure User Revocation.",
                    "Secure Out-of-Band Remote Management Using Encrypted Virtual Serial Consoles in IaaS Clouds.",
                    "Efficient Searchable Symmetric Encryption for Storing Multiple Source Data on Cloud.",
                    "Achieving Lightweight and Secure Access Control in Multi-authority Cloud.",
                    "Lightweight Certificateless and Provably-Secure Signcryptosystem for the Internet of Things.",
                    "Performance Evaluation in WSNs Based on Max-Plus and Time-Domain Stochastic Network Calculus.",
                    "Feature Interaction Problems in Smart Cards with Dynamic Application Lifecycle and Their Countermeasures.",
                    "On Using a Von Neumann Extractor in Heart-Beat-Based Security.",
                    "WiGen: Breaking the Privacy and Security Barriers for Group Management in RFID Systems.",
                    "Effects of Contextual Properties on Users' Privacy Preferences in Mobile Computing Environments.",
                    "Private Membership Test for Bloom Filters.",
                    "You are AIRing too Much: Assessing the Privacy of Users in Crowdsourcing Environmental Data.",
                    "A Dynamic Fake Source Algorithm for Source Location Privacy in Wireless Sensor Networks.",
                    "Time Distortion Anonymization for the Publication of Mobility Data with High Utility.",
                    "Aligning the Conflicting Needs of Privacy, Malware Detection and Network Protection.",
                    "Enable Privacy Preservation and Result Verification for Top-k Query in Two-Tiered Sensor Networks.",
                    "Bin Encoding: A User-Centric Secure Full-Text Searching Scheme for the Cloud.",
                    "PEAS: Private, Efficient and Accurate Web Search.",
                    "Privacy-Preserving Mining of Frequent Routes in Cellular Network Data.",
                    "uCentive: An Efficient, Anonymous and Unlinkable Incentives Scheme.",
                    "(l1, ..., lq)-diversity for Anonymizing Sensitive Quasi-Identifiers.",
                    "Lightweight Privacy-Preserving Authentication Scheme for V2G Networks in the Smart Grid.",
                    "A Set of Efficient Privacy Protection Enforcing Lightweight Authentication Protocols for Low-Cost RFID Tags.",
                    "Group Sparsity Tensor Factorization for De-anonymization of Mobility Traces.",
                    "Provenance-Based Attestation for Trustworthy Computing.",
                    "A Framework for Evaluating the End-to-End Trustworthiness.",
                    "Trusted Tamper-Evident Data Provenance.",
                    "Countermeasure Security Risks Management in the Internet of Things Based on Fuzzy Logic Inference.",
                    "Trust Metrics Based on a Trusted Network Element.",
                    "Trustworthiness Measurement of E-commerce Systems Using Fuzzy Hybrid Multi-criteria Analysis.",
                    "Formal Modeling and Verification of Opportunity-enabled Risk Management.",
                    "Single and Multi-metric Trust Management Frameworks for Use in Underwater Autonomous Networks.",
                    "RLTE: A Reinforcement Learning Based Trust Establishment Model.",
                    "In Certificates We Trust - Revisited.",
                    "Interest Flow Control Method Based on User Reputation and Content Name Prefixes in Named Data Networking.",
                    "Adaptive Trust Threshold Strategy for Misbehaving Node Detection and Isolation.",
                    "Trust-Aware Review Spam Detection.",
                    "KDet: Coordinated Detection of Forwarding Faults in Wireless Community Networks.",
                    "Inferring User Actions from Provenance Logs.",
                    "Data Mobility Management Model for Active Data Cubes.",
                    "BotProfiler: Profiling Variability of Substrings in HTTP Requests to Detect Malware-Infected Hosts.",
                    "Analysis of Mobility Algorithms for Forensic Virtual Machine Based Malware Detection.",
                    "A Novel Architecture for Predictive CyberSecurity Using Non-homogenous Markov Models.",
                    "eSKAMI: Efficient and Scalable Multi-group Key Management for Advanced Metering Infrastructure in Smart Grid.",
                    "Implementing Authentication Systems Based on Physical Unclonable Functions.",
                    "Save Our Passwords.",
                    "Partial Data Protection via Structure-Preserving Document Partitioning.",
                    "Enhancing EMV Online PIN Verification.",
                    "A Formalization of Fingerprinting Techniques.",
                    "Securing Network-Assisted Direct Communication: The Case of Unreliable Cellular Connectivity.",
                    "A Secure Northbound Interface for SDN Applications.",
                    "Secure Routing Protocol Considering Load Distribution in Mobile Ad Hoc Networks.",
                    "A Study of IEEE 802.15.6 Association Protocols.",
                    "Access Control for the Cloud Based on Multi-device Authentication.",
                    "Enhancing Access-Control with Risk-Metrics for Collaboration on Social Cloud-Platforms.",
                    "RESCUE: Resilient Secret Sharing Cloud-Based Architecture.",
                    "On the Resource Consumption of Secure Data Sharing.",
                    "Secure Location Validation with Wi-Fi Geo-fencing and NFC.",
                    "Proofs of Encrypted Data Retrievability with Probabilistic and Homomorphic Message Authenticators.",
                    "A Scalable Data Hiding Scheme Using Hilbert Space Curve and Chaos.",
                    "Detecting Data Semantic: A Data Leakage Prevention Approach.",
                    "A New Solution Based on Multi-rate LDPC for Flash Memory to Reduce ECC Redundancy.",
                    "CaptureMe: Attacking the User Credential in Mobile Banking Applications.",
                    "Watch Your Mobile Payment: An Empirical Study of Privacy Disclosure.",
                    "Disequilibrium: Tor's Exit Node Selection under the Stereoscope.",
                    "Extended Model of Side-Information in Garbling.",
                    "A Cloud-Based Model to Facilitate Mobility of Privacy-Preserving Attribute-Based Credential Users.",
                    "Can On-line Social Network Users Trust That What They Designated as Confidential Data Remains So?",
                    "Stylometric Anonymity: Is Imitation the Best Strategy?",
                    "k-anonymity: Risks and the Reality.",
                    "A Dynamic Credible Factory Reset Mechanism of Personal Data in Android Device.",
                    "The Pseudonym Broker Privacy Pattern in Medical Data Collection.",
                    "Game-Theoretic Model of Incentivizing Privacy-Aware Users to Consent to Location Tracking.",
                    "DroidCIA: A Novel Detection Method of Code Injection Attacks on HTML5-Based Mobile Apps.",
                    "Secure Two-Party Rank Correlation Computations for Recommender Systems.",
                    "The Role of Risk Perceptions in Privacy Concerns Evaluation.",
                    "A Language for the Composition of Privacy-Enforcement Techniques.",
                    "Potential Mass Surveillance and Privacy Violations in Proximity-Based Social Applications.",
                    "A Review of Free Cloud-Based Anti-Malware Apps for Android.",
                    "Forensic Collection and Analysis of Thumbnails in Android.",
                    "EyeCloud: A BotCloud Detection System.",
                    "A Taxonomy of Cloud Attack Consequences and Mitigation Strategies: The Role of Access Control and Privileged Access Management.",
                    "Cloud Security Audit for Migration and Continuous Monitoring.",
                    "Enhancing Cloud Security and Privacy: Broadening the Service Level Agreement.",
                    "Android Cache Taxonomy and Forensic Process.",
                    "Secure Sketch Search for Document Similarity.",
                    "Architectural Model and Security Mechanisms for Cloud Federations.",
                    "A Framework for Cryptography Based Accountability and Service Invocation Control for Service Composition in a Multicloud Architecture.",
                    "Stationarity Enforcement of Accelerator Based TRNG by Genetic Algorithm.",
                    "A Global, Empirical Analysis of the Shellshock Vulnerability in Web Applications.",
                    "Preventing Library Spoofing on Android.",
                    "Issues in Trustworthy Software Systems.",
                    "Mission-Aware Vulnerability Assessment for Cyber-Physical Systems.",
                    "Alias Detection Across Multi-online Applications Based on User's Behavior Characteristics.",
                    "A Rejuvenation Model for Software System under Normal Attack.",
                    "Towards 5G Security.",
                    "Unblocking Stolen Mobile Devices Using SS7-MAP Vulnerabilities: Exploiting the Relationship between IMEI and IMSI for EIR Access.",
                    "Mobile Guard Demo: Network Based Malware Detection.",
                    "Towards Secure Multi-tenant Virtualized Networks.",
                    "CRC-Based Message Authentication for 5G Mobile Technology.",
                    "An Air Interface Signaling Protection Function for Mobile Networks: GSM Experiments and Beyond.",
                    "Security in D2D Communications: A Review.",
                    "A USIM Compatible 5G AKA Protocol with Perfect Forward Secrecy.",
                    "Revocation Management in Vehicular Ad-hoc Networks.",
                    "Enhancing the Trajectory Privacy with Laplace Mechanism.",
                    "A Simple RFID-Based Architecture for Privacy Preservation.",
                    "Towards Efficient Implementation of Lattice-Based Public-Key Encryption on Modern CPUs.",
                    "Towards Tracing of k-Anonymized Datasets.",
                    "WAVE: Secure Wireless Pairing Exploiting Human Body Movements.",
                    "Achieving Forward Secrecy and Unlinkability in Cloud-Based Personal Health Record System.",
                    "Security Orchestrator: Introducing a Security Orchestrator in the Context of the ETSI NFV Reference Architecture.",
                    "A Trustworthiness Model for Crowdsourced and Crowdsensed Data.",
                    "Periodicity-and-Linear-Based Data Suppression Mechanism for WSN.",
                    "Quantitative Trustworthy Evaluation Scheme for Trust Routing Scheme in Wireless Sensor Networks.",
                    "An Energy Efficient Congestion Control Scheme for Multimedia Data in Wireless Sensor Networks.",
                    "A Security Topology Protocol of Wireless Sensor Networks Based on Community Detection and Energy Aware.",
                    "A Novel Sensor Deployment Approach Using Fruit Fly Optimization Algorithm in Wireless Sensor Networks.",
                    "A Self-Adaptive Wireless Sensor Network Coverage Method for Intrusion Tolerance Based on Particle Swarm Optimization and Cuckoo Search.",
                    "Protein-Protein Interaction Network Constructing Based on Text Mining and Reinforcement Learning with Application to Prostate Cancer.",
                    "Study on the Coverage of Adaptive Wireless Sensor Network Based on Trust.",
                    "An Efficient Clustering Mining Algorithm for Indoor Moving Target Trajectory Based on the Improved AGNES.",
                    "A Near Field Communication(NFC) Security Model Based on OSI Reference Model.",
                    "Secure Routing Protocols for Sensor Networks: Construction with Signature Schemes for Multiple Signers.",
                    "A Method for Deriving and Testing Malicious Behavior Detection Rules.",
                    "Towards a Generic Trust Management Framework Using a Machine-Learning-Based Trust Model.",
                    "A Distributed Reputation System for Certification Authority Trust Management.",
                    "Data Sharing on the Cloud: A Scalable Proxy-Based Protocol for Privacy-Preserving Queries.",
                    "DDOS Mitigation Cloud-Based Service.",
                    "Dynamic Game Access Control Based on Trust.",
                    "Dynamic Security Policies Enforcement and Adaptation Using Aspects.",
                    "Cybercrime Profiling: Decision-Tree Induction, Examining Perceptions of Internet Risk and Cybercrime Victimisation.",
                    "From ZeuS to Zitmo: Trends in Banking Malware.",
                    "ARP Cache Poisoning Mitigation and Forensics Investigation.",
                    "Virtualization and Cyber Security: Arming Future Security Practitioners.",
                    "A Security Analysis of the Emerging P2P-Based Personal Cloud Platform MaidSafe.",
                    "Automated Collection and Analysis of Malware Disseminated via Online Advertising."
                ]
            },
            {
                "sub_name_abbr": "conf/trustcom/2015-2",
                "sub_name": "2015 IEEE TrustCom/BigDataSE/ISPA, Helsinki, Finland, August 20-22, 2015, Volume 2.",
                "count": 37,
                "papers": [
                    "M-PCA Binary Embedding for Approximate Nearest Neighbor Search.",
                    "Large-Scale Classification by an Approximate Least Squares One-Class Support Vector Machine Ensemble.",
                    "Nearest Class Vector Classification for Large-Scale Learning Problems.",
                    "Class-Specific Nonlinear Projections Using Class-Specific Kernel Spaces.",
                    "Scalable Learning of k-dependence Bayesian Classifiers under MapReduce.",
                    "Distributed Entropy Minimization Discretizer for Big Data Analysis under Apache Spark.",
                    "Scalable Massively Parallel Learning of Multiple Linear Regression Algorithm with MapReduce.",
                    "An Algorithm for Identifying the Learning Patterns in Big Data.",
                    "Goal-Based Analytic Composition for On-and Off-line Execution at Scale.",
                    "Similarity Measure Based on Low-Rank Approximation for Highly Scalable Recommender Systems.",
                    "Spatial-Temporal Aware Truth Finding in Big Data Social Sensing Applications.",
                    "Similarity-Based Query-Focused Multi-document Summarization Using Crowdsourced and Manually-built Lexical-Semantic Resources.",
                    "Semi-Supervised Multiple Disambiguation.",
                    "Hadoop Characterization.",
                    "Telemetry for Elastic Data (TED): Middleware for MapReduce Job Metering and Rating.",
                    "Cost Models for Distributed Pattern Mining in the Cloud.",
                    "Performance Evaluation of Enterprise Big Data Platforms with HiBench.",
                    "Adaptive Data Communication Interface: A User-Centric Visual Data Interpretation Framework.",
                    "Probabilistic Modeling Towards Understanding the Power Law Distribution of Video Viewing Behavior in Large-Scale e-Learning.",
                    "Enhancing the Detection Rate of Inclined Faces.",
                    "PPT Image Segmentation Based on Color Entropy.",
                    "Mining E-commerce Data from E-shop Websites.",
                    "Provision of Disk I/O Guarantee for MapReduce Applications.",
                    "A MapReduce-Based k-Nearest Neighbor Approach for Big Data Classification.",
                    "Semantic HMC: A Predictive Model Using Multi-label Classification for Big Data.",
                    "Analysis of Data Preprocessing Increasing the Oversampling Ratio for Extremely Imbalanced Big Data Classification.",
                    "Feature Ranking Based on Information Gain for Large Classification Problems with MapReduce.",
                    "Compounds Activity Prediction in Large Imbalanced Datasets with Substructural Relations Fingerprint and EEM.",
                    "Incremental One-Class Bagging for Streaming and Evolving Big Data.",
                    "An Increment Decision Tree Algorithm for Streamed Data.",
                    "Multi-label Stream Classification Using Extended Binary Relevance Model.",
                    "Data Stream Classification Using Random Feature Functions and Novel Method Combinations.",
                    "Symbolic Time Series Representation for Stream Data Processing.",
                    "A Platform for Real-Time Opinion Mining from Social Media and News Streams.",
                    "Predicting Object Trajectories from High-Speed Streaming Data.",
                    "The Technology of Processing Intensive Structured Dataflow on a Supercomputer.",
                    "Issues in Complex Event Processing Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/trustcom/2015-3",
                "sub_name": "2015 IEEE TrustCom/BigDataSE/ISPA, Helsinki, Finland, August 20-22, 2015, Volume 3.",
                "count": 45,
                "papers": [
                    "Evaluating HTM for Pauseless Garbage Collectors in Java.",
                    "Selfish Self-Stabilizing Approach to Maximal Independent Sets.",
                    "Parallel SMT Solving and Concurrent Symbolic Execution.",
                    "Identifying Hierarchical Structures in Sequences on GPU.",
                    "A New Fill-in Strategy for IC Factorization Preconditioning Considering SIMD Instructions.",
                    "Enhanced GPU Resource Utilization through Fairness-aware Task Scheduling.",
                    "Exploiting Hyper-Loop Parallelism in Vectorization to Improve Memory Performance on CUDA GPGPU.",
                    "Towards Increasing the Error Handling Time Window in Large-Scale Distributed Systems Using Console and Resource Usage Logs.",
                    "Metaprogramming Dense Linear Algebra Solvers Applications to Multi and Many-Core Architectures.",
                    "Parallel Monte Carlo Tree Search from Multi-core to Many-core Processors.",
                    "Routing Algorithms for Recursively-Defined Data Centre Networks.",
                    "Petri Nets Formalization of Map/Reduce Paradigm to Optimise the Performance-Cost Tradeoff.",
                    "A Horizontally-Scalable Multiprocessing Platform Based on Node.js.",
                    "Performance Evaluations of Document-Oriented Databases Using GPU and Cache Structure.",
                    "Energy-Efficient Sorting with the Distributed Memory Architecture ePUMA.",
                    "Hardware Transactional Memory Optimization Guidelines, Applied to Ordered Maps.",
                    "Analysis of the Impact of CPU Virtualization on Parallel Applications in Xen.",
                    "Parallelizing High-Frequency Trading Applications by Using C++11 Attributes.",
                    "AKI: Automatic Kernel Identification and Annotation Tool Based on C++ Attributes.",
                    "MeterPU: A Generic Measurement Abstraction API Enabling Energy-Tuned Skeleton Backend Selection.",
                    "Exploiting Task-Parallelism on GPU Clusters via OmpSs and rCUDA Virtualization.",
                    "Parallel Pipeline on Heterogeneous Multi-processing Architectures.",
                    "The Loop-of-Stencil-Reduce Paradigm.",
                    "Prediction Models for Performance, Power, and Energy Efficiency of Software Executed on Heterogeneous Hardware.",
                    "Parallel Computation of Voxelized Macromolecular Surfaces by Spatial Slicing.",
                    "Scalable RNA Sequencing on Clusters of Multicore Processors.",
                    "A Parallel Algorithm for Compression of Big Next-Generation Sequencing Datasets.",
                    "Assessment of a Black-Box Approach for a Parallel Finite Elements Solver in Computational Hemodynamics.",
                    "Smith-Waterman Protein Search with OpenCL on an FPGA.",
                    "Accelerating Phylogenetic Inference on Heterogeneous OpenCL Platforms.",
                    "Accelerating DNA Sequence Analysis Using Intel(R) Xeon Phi(TM).",
                    "Fast Epistasis Detection in Large-Scale GWAS for Intel Xeon Phi Clusters.",
                    "On the Performance of BWA on NUMA Architectures.",
                    "Parallel H4MSA for Multiple Sequence Alignment.",
                    "Discovering Candidates for Gene Network Expansion by Distributed Volunteer Computing.",
                    "Cyber-physical Design of Data Centers Cooling Systems Automation.",
                    "Fuzzy Logic Based Prosumer Agent in a Modular Smart Grid Prosumer Architecture.",
                    "Adaptation of Material Flows in Mechanical Transportation Systems Based on Observation Experience.",
                    "An OPC UA Based Architecture for Testing Tracking Simulation Methods.",
                    "Model-Driven Runtime Embedded Monitoring for Industrial Controllers.",
                    "Synthesis of Safety Controllers for Distributed Automation Systems on the Basis of Reverse Safe Net Condition/Event Systems.",
                    "A Formal Perspective on IEC 61499 Execution Control Chart Semantics.",
                    "Formal Modeling of Testing Software for Cyber-Physical Automation Systems.",
                    "Inferring Automata Logic from Manual Control Scenarios: Implementation in Function Blocks.",
                    "Formal Verification of IEC61499 Function Blocks with Abstract State Machines and SMV - Modelling."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "13th TrustCom 2014",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2014",
                "sub_name": "13th IEEE International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2014, Beijing, China, September 24-26, 2014.",
                "count": 130,
                "papers": [
                    "A Clustering-Based Privacy-Preserving Method for Uncertain Trajectory Data.",
                    "A Lightweight Anonymous Mobile Shopping Scheme Based on DAA for Trusted Mobile Platform.",
                    "Automated User Profiling in Location-Based Mobile Messaging Applications.",
                    "PrivateDroid: Private Browsing Mode for Android.",
                    "TTPCookie: Flexible Third-Party Cookie Management for Increasing Online Privacy.",
                    "Adaptive Sharing for Online Social Networks: A Trade-off Between Privacy Risk and Social Benefit.",
                    "Garbling in Reverse Order.",
                    "Private Outsourcing of Polynomial Functions.",
                    "A Machine Learning Based Trust Evaluation Framework for Online Social Networks.",
                    "Multi-dimensions of Developer Trustworthiness Assessment in OSS Community.",
                    "A Novel Feature Selection Approach for Intrusion Detection Data Classification.",
                    "An On-Line Anomaly Detection Method Based on a New Stationary Metric - Entropy-Ratio.",
                    "Reaching Agreement in Security Policy Negotiation.",
                    "Remembrance of Local Information Status for Enforcing Robustness of Policy-Exchanged Strategies for Trust Negotiation.",
                    "Secure and Privacy-Friendly Public Key Generation and Certification.",
                    "A Stateful Mechanism for the Tree-Rule Firewall.",
                    "CAFS: A Framework for Context-Aware Federated Services.",
                    "Encrypted Keyword Search Mechanism Based on Bitmap Index for Personal Storage Services.",
                    "High Performance FPGA Implementation of Elliptic Curve Cryptography over Binary Fields.",
                    "A High-Performance Distributed Certificate Revocation Scheme for Mobile Ad Hoc Networks.",
                    "SIMS: A Comprehensive Approach for a Secure Instant Messaging Sifter.",
                    "Towards Designing an Email Classification System Using Multi-view Based Semi-supervised Learning.",
                    "Ultra High-Speed SM2 ASIC Implementation.",
                    "Visual Similarity Based Anti-phishing with the Combination of Local and Global Features.",
                    "A Practically Optimized Implementation of Attribute Based Cryptosystems.",
                    "A Robust Authentication Scheme for Observing Resources in the Internet of Things Environment.",
                    "Bargaining-Based Dynamic Decision for Cooperative Authentication in MANETs.",
                    "Multiplicative Attributes Graph Approach for Persistent Authentication in Single-Sign-On Mobile Systems.",
                    "ToAuth: Towards Automatic Near Field Authentication for Smartphones.",
                    "One Kind of Cross-Domain DAA Scheme from Bilinear Mapping.",
                    "Long Term Tracking and Characterization of P2P Botnet.",
                    "A Survey of Security Network Coding toward Various Attacks.",
                    "Defensor: Lightweight and Efficient Security-Enhanced Framework for Android.",
                    "Public-Key Encryption Resilient against Linear Related-Key Attacks Revisited.",
                    "The Micro-architectural Support Countermeasures against the Branch Prediction Analysis Attack.",
                    "AHP-Based Quantitative Approach for Assessing and Comparing Cloud Security.",
                    "Efficiently Attribute-Based Access Control for Mobile Cloud Storage System.",
                    "EqualVisor: Providing Memory Protection in an Untrusted Commodity Hypervisor.",
                    "FEACS: A Flexible and Efficient Access Control Scheme for Cloud Computing.",
                    "ONHelp: Components in Building Secure Cloud Based on OpenNebula.",
                    "Proofs of Ownership and Retrievability in Cloud Storage.",
                    "Temporal Access Control with User Revocation for Cloud Data.",
                    "Trust Enhanced Cloud Security for Healthcare Services.",
                    "Trusted Geolocation-Aware Data Placement in Infrastructure Clouds.",
                    "Cognitive Adaptive Access-Control System for a Secure Locator/Identifier Separation Context.",
                    "AppCaulk: Data Leak Prevention by Injecting Targeted Taint Tracking into Android Apps.",
                    "Attack Tree Based Android Malware Detection with Hybrid Analysis.",
                    "Automatically Exploiting Potential Component Leaks in Android Applications.",
                    "Data-centric Rogue Node Detection in VANETs.",
                    "Detect Android Malware Variants Using Component Based Topology Graph.",
                    "Evaluation of Android Anti-malware Techniques against Dalvik Bytecode Obfuscation.",
                    "Secure Mobile Payment on NFC-Enabled Mobile Phones Formally Analysed Using CasperFDR.",
                    "Systematic Analysis and Detection of Misconfiguration Vulnerabilities in Android Smartphones.",
                    "Synthesising End-to-End Security Protocols.",
                    "Collaborative and Ubiquitous Consumer Oriented Trusted Service Manager.",
                    "Design and Analysis of a New Feature-Distributed Malware.",
                    "On Energy Efficient Scheduling and Load Distribution Based on Renewable Energy for Wireless Mesh Network in Disaster Area.",
                    "Trust-Enhanced Multicast Routing Protocol Based on Node's Behavior Assessment for MANETs.",
                    "BIBRM: A Bayesian Inference Based Road Message Trust Model in Vehicular Ad Hoc Networks.",
                    "Convergence of True Cooperations in Bayesian Reputation Game.",
                    "Practical Assessment of Biba Integrity for TCG-Enabled Platforms.",
                    "SigmoRep: A Robust Reputation Model for Open Collaborative Environments.",
                    "Towards Robust and Effective Trust Management for Security: A Survey.",
                    "Trust Mechanism for Enforcing Compliance to Secondary Data Use Contracts.",
                    "An Effective Path Load Balancing Mechanism Based on SDN.",
                    "Integrity Levels: A New Paradigm for Protecting Computing Systems.",
                    "Integrity Verification and Secure Loading of Remote Binaries for Microkernel-Based Runtime Environments.",
                    "Overhead-Free In-Place Recovery Scheme for XOR-Based Storage Codes.",
                    "Untrusted User Detection in Microblogs.",
                    "A Privacy-Enhanced Access Log Management Mechanism in SSO Systems from Nominative Signatures.",
                    "Anonymous Proxy Signature with Restricted Traceability.",
                    "Efficient Traceable Attribute-Based Signature.",
                    "Computation Integrity Measurement Based on Branch Transfer.",
                    "Emergency Key Rollover in DNSSEC.",
                    "Crowd Sensing of Urban Emergency Events Based on Social Media Big Data.",
                    "SocAware: A Middleware for Social Applications in Online Social Networks.",
                    "Secure Multimedia Big Data Sharing in Social Networks Using Fingerprinting and Encryption in the JPEG2000 Compressed Domain.",
                    "A Proposal for a Reference Architecture for Long-Term Archiving, Preservation, and Retrieval of Big Data.",
                    "Big Data Analyses for Collective Opinion Elicitation in Social Networks.",
                    "An Improved Image File Storage Method Using Data Deduplication.",
                    "HBaseSpatial: A Scalable Spatial Data Storage Based on HBase.",
                    "On the Application and Performance of MongoDB for Climate Satellite Data.",
                    "Research of Provenance Storage in Cloud Computing Environment.",
                    "Data Interface All-iN-A-Place (DIANA) for Big Data.",
                    "Performance Evaluation of the SSD-Based Swap System for Big Data Processing.",
                    "A Study on Recursive Neural Network Based Sentiment Classification of Sina Weibo.",
                    "VALID: A Web Framework for Visual Analytics of Large Streaming Data.",
                    "A High Speed Lossless Compression Algorithm Based on CPU and GPU Hybrid Platform.",
                    "Improved 2DLDA Algorithm and Its Application in Face Recognition.",
                    "The Evaluation of Emulab as an Environment for Bio-Informatics Research.",
                    "A Evaluation Method for Web Service with Large Numbers of Historical Records.",
                    "BIG DATA: Preconditions to Productivity.",
                    "Data Mining Application of Decision Trees for Student Profiling at the Open University of China.",
                    "Aeromancer: A Workflow Manager for Large-Scale MapReduce-Based Scientific Workflows.",
                    "MapReduce for Large-Scale Monitor Data Analyses.",
                    "FedLoop: Looping on Federated MapReduce.",
                    "In-Map/In-Reduce: Concurrent Job Execution in MapReduce.",
                    "Towards Policy Retrieval for Provenance Based Access Control Model.",
                    "SARAH - Statistical Analysis for Resource Allocation in Hadoop.",
                    "Privacy Aware Non-linear Support Vector Machine for Multi-source Big Data.",
                    "Modeling of Data Provenance on Space and Time Based on OPM.",
                    "Threshold-Based Secure and Privacy-Preserving Message Verification in VANETs.",
                    "A Semantic Knowledge Base Construction Method for Information Security.",
                    "Adding Privacy to Multicast DNS Service Discovery.",
                    "Encrypted Program Execution.",
                    "Network Traffic Anomaly Detection Using Adaptive Density-Based Fuzzy Clustering.",
                    "Unified Model for Data Security - A Position Paper.",
                    "A Secure Authentication Protocol for IP-Based Wireless Sensor Communications Using the Location/ID Split Protocol (LISP).",
                    "A Compact Hardware Implementation of SM3 Hash Function.",
                    "A Load Balancing Strategy of SDN Controller Based on Distributed Decision.",
                    "Modeling Degrees of Fairness for Collaborations.",
                    "Performance Analysis on M2M Communication Network Based on Stochastic Network Calculus.",
                    "Mining Specification of Insecure Browser Extension Behavior.",
                    "Detection of Android Malicious Apps Based on the Sensitive Behaviors.",
                    "Digital Trust - Trusted Computing and Beyond: A Position Paper.",
                    "Identifying P2P Network Activities on Encrypted Traffic.",
                    "Lightweight Security Middleware to Detect Malicious Content in NFC Tags or Smart Posters.",
                    "Survey of Integrity Detection Methods in Internet of Things.",
                    "TEEI - A Mobile Security Infrastructure for TEE Integration.",
                    "Continuous Certification of Non-repudiation in Cloud Storage Services.",
                    "JVM-Based Dynamic Attestation in Cloud Computing.",
                    "Remote Programmatic vCloud Forensics: A Six-Step Collection Process and a Proof of Concept.",
                    "vPatcher: VMI-Based Transparent Data Patching to Secure Software in the Cloud.",
                    "Enforcing File System Permissions on Android External Storage: Android File System Permissions (AFP) Prototype and ownCloud.",
                    "A Novel Public Key Encryption Scheme for Large Image.",
                    "Analysis of the Count-Min Sketch Based Anomaly Detection Scheme in WSN.",
                    "Attacks on Physically-Embedded Data Encryption for Embedded Devices.",
                    "Challenge Set Designs and User Guidelines for Usable and Secured Recognition-Based Graphical Passwords.",
                    "Escrow: A Large-Scale Web Vulnerability Assessment Tool.",
                    "Personal Data Access Based on Trust Assessment in Mobile Social Networking."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "12th TrustCom / 11th ISPA / 12th IUCC 2013",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2013",
                "sub_name": "12th IEEE International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2013 / 11th IEEE International Symposium on Parallel and Distributed Processing with Applications, ISPA-13 / 12th IEEE International Conference on Ubiquitous Computing and Communications, IUCC-2013, Melbourne, Australia, July 16-18, 2013.",
                "count": 256,
                "papers": [
                    "A Privacy-Leakage-Tolerance Based Noise Enhancing Strategy for Privacy Protection in Cloud Computing.",
                    "An Iterative Hierarchical Key Exchange Scheme for Secure Scheduling of Big Data Applications in Cloud Computing.",
                    "A Fuzzy Modeling Approach for Risk-Based Access Control in eHealth Cloud.",
                    "Scalable and Privacy-Preserving Variants of the Austrian Electronic Mandate System in the Public Cloud.",
                    "KP-ABE Based Verifiable Cloud Access Control Scheme.",
                    "Light-Weight Trust-Based On-Demand Multipath Routing Protocol for Mobile Ad Hoc Networks.",
                    "Garbled Routing (GR): Towards Unification of Anonymous Networks.",
                    "Secure Routing Based on Network Coding in Wireless Sensor Networks.",
                    "TIGER: A Trust-based Intelligent Geographical Energy-aware Routing for Smart Grid Communication Networks.",
                    "AFC: An Effective Metric for Reliable Routing in Wireless Mesh Networks.",
                    "Performance Evaluation of Trust-Based Collaborative Sanctioning in MANETs.",
                    "Novel Physically-Embedded Data Encryption for Embedded Device.",
                    "Server Assisted Key Establishment for WSN: A MIKEY-Ticket Approach.",
                    "A Fully-Secure RFID Authentication Protocol from Exact LPN Assumption.",
                    "Determining Similar Recommenders Using Improved Collaborative Filtering in MANETs.",
                    "Privacy-Preserving Wireless Medical Sensor Network.",
                    "A Threat to Mobile Cyber-Physical Systems: Sensor-Based Privacy Theft Attacks on Android Smartphones.",
                    "Protocol Formats Reverse Engineering Based on Association Rules in Wireless Environment.",
                    "Power Based Malicious Code Detection Techniques for Smartphones.",
                    "A Privacy-Preserved Joint Group Time Scheduling Mechanism for Mobile Social Applications.",
                    "ChainDroid: Safe and Flexible Access to Protected Android Resources Based on Call Chain.",
                    "Droid Analytics: A Signature Based Analytic System to Collect, Extract, Analyze and Associate Android Malware.",
                    "Securing Domain Name System Combined with MIPv6 for Mobile Hosts.",
                    "Securing Mobile Mashups with SCCM.",
                    "Secure Data Aggregation with MAC Authentication in Wireless Sensor Networks.",
                    "Modeling Malware Propagation in Smartphone Social Networks.",
                    "Unwanted Content Control via Trust Management in Pervasive Social Networking.",
                    "Trust Inference Computation for Online Social Networks.",
                    "Fine-Grained Trust Assertions for Privacy Management in the Social Semantic Web.",
                    "Preserving Utility in Social Network Graph Anonymization.",
                    "DDoS Attack Detection at Local Area Networks Using Information Theoretical Metrics.",
                    "Towards an Information-Theoretic Approach for Measuring Intelligent False Alarm Reduction in Intrusion Detection.",
                    "Rational Secret Sharing Information - Theoretically Secure against Adaptive Adversaries.",
                    "What is the Pattern of a Botnet?",
                    "Analyzing Malware by Abstracting the Frequent Itemsets in API Call Sequences.",
                    "Kappa-Fuzzy ARTMAP: A Feature Selection Based Methodology to Intrusion Detection in Computer Networks.",
                    "Visual Analytics Model for Intrusion Detection in Flood Attack.",
                    "A Regional Statistics Detection Scheme against Sybil Attacks in WSNs.",
                    "A Framework for Improving the Accuracy of Unsupervised Intrusion Detection for SCADA Systems.",
                    "Security Aspects of Military Sensor-Based Defence Systems.",
                    "A Secure and Efficient Fault-Tolerant Group Key Agreement Protocol.",
                    "MDS-Based Trust Estimation of Event Reporting Node in VANET.",
                    "sEncrypt: An Encryption Algorithm Inspired from Biological Processes.",
                    "A Scalable Architecture for Highly Reliable Certification.",
                    "A Secure and Trusted Channel Protocol for the User Centric Smart Card Ownership Model.",
                    "A Model for Context-Aware Location Identity Preservation Using Differential Privacy.",
                    "P3MCF: Practical Privacy-Preserving Multi-domain Collaborative Filtering.",
                    "On the Use of LSH for Privacy Preserving Personalization.",
                    "Improving the Utility of Differentially Private Data Releases via k-Anonymity.",
                    "Scheme of User Privacy Protection Applied to Online Marketing.",
                    "An Effective Deferentially Private Data Releasing Algorithm for Decision Tree.",
                    "An Application Security Framework for Near Field Communication.",
                    "Scalable Attack Representation Model Using Logic Reduction Techniques.",
                    "Formalizing and Modeling Fairness for Benefit Distribution in Collaborations.",
                    "Attribute-Based Mining Process for the Organization-Based Access Control Model.",
                    "Private Multiparty Set Intersection Protocol in Rational Model.",
                    "A Mutual Nonrepudiation Protocol for Cloud Storage with Interchangeable Accesses of a Single Account from Multiple Devices.",
                    "Privacy-Enhanced Keyword Search in Clouds.",
                    "iPEKS: Fast and Secure Cloud Data Retrieval from the Public-Key Encryption with Keyword Search.",
                    "A Trust-Aware Framework for Evaluating Security Controls of Service Providers in Cloud Marketplaces.",
                    "Reputation Attacks Detection for Effective Trust Assessment among Cloud Services.",
                    "Hierarchical Attribute-Based Access Control with Authentication for Outsourced Data in Cloud Computing.",
                    "Access Control Management for Cloud.",
                    "Cloud Computing: Insider Attacks on Virtual Machines during Migration.",
                    "Combining Top-Down and Bottom-Up: Scalable Sub-tree Anonymization over Big Data Using MapReduce on Cloud.",
                    "A Framework for Authentication and Authorization Credentials in Cloud Computing.",
                    "On the Design of a Trust Enhanced Distributed Authorisation Architecture for Service Oriented Architectures.",
                    "On the Application of Supervised Machine Learning to Trustworthiness Assessment.",
                    "Building Confidence in Information-Trustworthiness Metrics for Decision Support.",
                    "Efficient Fair UC-Secure Two-Party Computation on Committed Inputs.",
                    "Trust Enhanced Security Architecture for Detecting Insider Threats.",
                    "Integrating Trust with Cryptographic Role-Based Access Control for Secure Cloud Data Storage.",
                    "An Online Query Authentication System for Outsourced Databases.",
                    "Word N-Gram Based Classification for Data Leakage Prevention.",
                    "Privacy Protected Data Forwarding in Human Associated Delay Tolerant Networks.",
                    "S2Logger: End-to-End Data Tracking Mechanism for Cloud Data Provenance.",
                    "A Direct Insight into Victims of Cybercrime.",
                    "Card-Present Transactions on the Internet Using the Smart Card Web Server.",
                    "Secure Single Sign-On Schemes Constructed from Nominative Signatures.",
                    "Profiling Phishing Email Based on Clustering Approach.",
                    "Developing an Empirical Algorithm for Protecting Text-Based CAPTCHAs against Segmentation Attacks.",
                    "Distributed Group Key Management Using Multilinear Forms for Multi-privileged Group Communications.",
                    "Research on the Anti-attack Design Principles of Low-Latency Anonymous Communication.",
                    "Securing RTP Packets Using Per-Packet Selective Encryption Scheme for Real-Time Multimedia Applications.",
                    "Evaluating the Impact of Broadcast Rates and Collisions on Fake Source Protocols for Source Location Privacy.",
                    "Development and Analysis of Generic VoIP Attack Sequences Based on Analysis of Real Attack Traffic.",
                    "Security Analysis of a Paillier-Based Threshold Proxy Signature Scheme.",
                    "A Novel Evidential Evaluation for Internal Attacks with Dempster-Shafer Theory in WSN.",
                    "PREFETCHing to Overcome DNSSEC Performance Issue on Large Resolving Platform.",
                    "Verifiable and Anonymous Encryption in Asymmetric Bilinear Maps.",
                    "From Mini House Game to Hobby-Driven Behavioral Biometrics-Based Password.",
                    "Towards Automation of Privacy and Security Risks Analysis in Identity Management Systems.",
                    "Identity-Based Mediated RSA Revisited.",
                    "Portable Personal Identity Provider in Mobile Phones.",
                    "Multi-factor Authentication in Key Management Systems.",
                    "A Semantic Policy Framework for Context-Aware Access Control Applications.",
                    "Feature Based Video Watermarking Resistant to Geometric Distortions.",
                    "Exploring the Guessability of Image Passwords Using Verbal Descriptions.",
                    "Public Verification of Outsourced Computation of Polynomial Functions.",
                    "Mitigating Malicious Updates: Prevention of Insider Threat to Databases.",
                    "De-anonymization Attack on Geolocated Data.",
                    "Verifiable and Privacy Preserving Electronic Voting with Untrusted Machines.",
                    "Role Mining Using Boolean Matrix Decomposition with Hierarchy.",
                    "A Secure Social-Aware Incentive Scheme for Delay Tolerant Networks.",
                    "A Place-Aware Stereotypical Trust Supporting Scheme.",
                    "An Endorsement Trust Model.",
                    "Local Monitoring and Maintenance for Operational Wireless Sensor Networks.",
                    "A Probabilistic Model for Estimating the Power Consumption of Processors and Network Interface Cards.",
                    "Automatic Locality Exploitation in the Codelet Model.",
                    "GPU Acceleration of Interior Point Methods in Large Scale SVM Training.",
                    "An Analysis of Driver Domain Offload for Paravirtualized Communication.",
                    "Energy-Performance Modeling and Optimization of Parallel Computing in On-Chip Networks.",
                    "SciHive: Array-Based Query Processing with HiveQL.",
                    "Multivalued and Deterministic Peer-to-Peer Polling in Social Networks with Reputation Conscious Participants.",
                    "Static or Dynamic: Trade-Offs for Task Dependency Analysis for Heterogeneous MPSoC.",
                    "CFIO: A Fast I/O Library for Climate Models.",
                    "Automatic Loop-Based Pipeline Optimization on Reconfigurable Platform.",
                    "Register Allocation by Incremental Graph Colouring for Clustered VLIW Processors.",
                    "TxSnoop: Power-Aware Transactional Snoop.",
                    "Regional Consistency: Programmability and Performance for Non-cache-coherent Systems.",
                    "A Comparative Study of Job Scheduling Strategies in Large-Scale Parallel Computational Systems.",
                    "Bicriteria Load Balancing for Online Placement in Heterogeneous Servers with Pareto Upper Bounds.",
                    "Collaborative Parallel Local Search for Simplified Protein Structure Prediction.",
                    "On Change Detection of XML Schemas.",
                    "Deadlock-Free Fully Adaptive Routing in Irregular Networks without Virtual Channels.",
                    "Quantitative Analysis of Inter-block Dependence in Speculative Execution.",
                    "Heterogeneous Multiconstraint Application Partitioner (HMAP).",
                    "A Hypercubic Overlay Using Bloom-Filter Based Addressing for a Non-dedicated Distributed Tag-Based Pub/Sub System.",
                    "KVM-Loongson: An Efficient Hypervisor on MIPS.",
                    "The Buffered Edge Reconfigurable Cell Array and Its Applications.",
                    "MapReduce: Limitations, Optimizations and Open Issues.",
                    "Scenario-Based Execution Method for Massively Parallel Accelerators.",
                    "An Iterative Optimization Framework for Adaptive Workflow Management in Computational Clouds.",
                    "DataSteward: Using Dedicated Compute Nodes for Scalable Data Management on Public Clouds.",
                    "A Data Prefetching Model for Desktop Grids and the Condor Use Case.",
                    "Scalable Multi Swarm-Based Algorithms with Lagrangian Relaxation for Constrained Problems.",
                    "Real-Time Effective Framework for Unstructured Data Mining.",
                    "Performance Implications of Task Scheduling by Predicting Network Throughput on the Internet.",
                    "H-PFSP: Efficient Hybrid Parallel PFSP Protected Scheduling for MapReduce System.",
                    "Low-Cost Load Balancing for Parallel Particle-in-Cell Simulations with Thick Overlapping Layers.",
                    "An Optimal Algorithm for Extreme Scale Job Launching.",
                    "Power Management Support to Optimal Duty-Cycling in Stateful Multitasking WSN.",
                    "An Efficient Task Partitioning and Scheduling Method for Symmetric Multiple GPU Architecture.",
                    "Performance Optimization of Aho-Corasick Algorithm on a GPU.",
                    "Combining Process-Based Cache Partitioning and Pollute Region Isolation to Improve Shared Last Level Cache Utilization on Multicore Systems.",
                    "Hybrid Range Consistent Hash Partitioning Strategy - A New Data Partition Strategy for NoSQL Database.",
                    "Tuning SPMD Applications in Order to Increase Performability.",
                    "A Parallel Runtime Framework for Communication Intensive Stream Applications.",
                    "A New Design Paradigm for Designing Reactive Pervasive Concurrent Systems with an Ambient Intelligence Example.",
                    "A Path-Adaptive Opto-electronic Hybrid NoC for Chip Multi-processor.",
                    "A Study of Leveraging Memory Level Parallelism for DRAM System on Multi-core/Many-Core Architecture.",
                    "Multi-core Deployment Optimization Using Simulated Annealing and Ant Colony Optimization.",
                    "A Next Generation Object-Oriented Environment for Real-Time Database Application Development.",
                    "Genome Assembly on a Multicore System.",
                    "The Value of Automation: A Study of MPI Application Migration Methods.",
                    "Advanced Validation of the DVMS Approach to Fully Distributed VM Scheduling.",
                    "Partitioned Fixed-Priority Real-Time Scheduling Based on Dependent Task-Split on Multicore Platform.",
                    "Enhanced Method for the Signature Adaptability to the Application Behavior.",
                    "Saving Time in a Program Robustness Evaluation.",
                    "SeaRum: A Cloud-Based Service for Association Rule Mining.",
                    "TurboSockets: Democratizing Distributed Deduplication.",
                    "Dependency-Based Energy-Efficient Scheduling for Homogeneous Multi-core Clusters.",
                    "Context-Aware Routing Algorithm for WSNs Based on Unequal Clustering.",
                    "SMC: A Shared Memory Based SpaceWire Controller Solution.",
                    "LogicCrowd: A Declarative Programming Platform for Mobile Crowdsourcing.",
                    "Conflict and Interference Resolution for Physical Annotation Systems.",
                    "Normal Vector Based Fault-Tolerant Event Boundary Detection in Wireless Sensor Networks.",
                    "Proximity-Based Service beyond 4G Network: Peer-Aware Discovery and Communication Using E-UTRAN and WLAN.",
                    "Characterization of OSPF Convergence with Correlated Failures.",
                    "Fast Intra Mode Decision Algorithm Based on Spatial-Domain Energy for H.264/AVC.",
                    "A Location Management Algorithm for LEO Satellite Networks.",
                    "A Distributed Routing Algorithm for LEO Satellite Networks.",
                    "Communication and Collaboration Service Components for Ubiquitous Communication Applications.",
                    "Quantitative Risk Analysis for Mobile Cloud Computing: A Preliminary Approach and a Health Application Case Study.",
                    "Thermal-Aware On-Chip Memory Architecture Exploration.",
                    "Quality Assessment for Stereoscopic Image Based on DCT Frequency Information.",
                    "Hope: A Fault-Tolerant Distributed Pub/Sub Architecture for Large-Scale Dynamic Network Environment.",
                    "Design of the Farmer's Experience Based Greenhouse Operating Systems.",
                    "Validation of a Rowing Oar Angle Measurement System Based on an Inertial Measurement Unit.",
                    "Platform Zero: A Context-Based Computing Platform for Collaboration.",
                    "A Methodology to Transform an OS-Based Application to a Bare Machine Application.",
                    "Impact of Mobility Models on Social Structure Formation in Opportunistic Networks.",
                    "Comparison SIP and IAX to Voice Packet Signaling over VOIP.",
                    "Reinventing Mobile Community Computing and Communication.",
                    "Measuring Walking and Running Cadence Using Magnetometers.",
                    "VoIP Spam Prevention.",
                    "An Energy-Aware Task Scheduling Algorithm for a Heterogeneous Data Center.",
                    "An OpenFlow-Based Dynamic Path Adjustment Algorithm for Multicast Spanning Trees.",
                    "High Radix Montgomery Modular Multiplier on Modern FPGA.",
                    "A Model-Based Approach for RFID Application Testing.",
                    "A Trust Evaluation Method for Supplier Selection.",
                    "A Trusted Remote Attestation Model Based on Trusted Computing.",
                    "Achieving Collaborative Wi-Fi Sharing without Changing Current Technologies.",
                    "Multivalued Trust Routing Based on Topology Level for Wireless Sensor Networks.",
                    "A Research Model for Trustworthy Pervasive Social Networking.",
                    "The Affect of Familiarity on the Usability of Recognition-Based Graphical Passwords: Cross Cultural Study between Saudi Arabia and the United Kingdom.",
                    "Disability Parking Permit - Lightweight But Trustworthy Identity Documents.",
                    "Evaluating the Trust of Android Applications through an Adaptive and Distributed Multi-criteria Approach.",
                    "Continuous Mobile Authentication Using Virtual Key Typing Biometrics.",
                    "Studies in Socio-technical Security Analysis: Authentication of Identities with TLS Certificates.",
                    "Complete Privacy Preserving Auditing for Data Integrity in Cloud Computing.",
                    "On the Complexity of Authorization of Temporal RBAC in Cloud Computing Service.",
                    "On Subjective Trust for Privacy Policy Enforcement in Cloud Computing.",
                    "A Reliability-Based Trust Management Mechanism for Cloud Services.",
                    "Towards Building an Automated Security Compliance Tool for the Cloud.",
                    "Detecting Intrusive Activity in the Smart Grid Communications Infrastructure Using Self-Organizing Maps.",
                    "A Defense Security Approach for Infrastructures against Hacking.",
                    "A Lightweight Design of Malware Behavior Representation.",
                    "Use of Role Based Access Control for Security-Purpose Hypervisors.",
                    "A Comprehensive Approach to Abusing Locality in Shared Web Hosting Servers.",
                    "Crime Toolkits: The Productisation of Cybercrime.",
                    "Shear-Based Spatial Transformation to Protect Proximity Attack in Outsourced Database.",
                    "Authorization Policies: Using Decision Support System for Context-Aware Protection of User's Private Data.",
                    "Case Study: On the Security of Key Storage on PCs.",
                    "A Power Model Combined of Architectural Level and Gate Level for Multicore Processors.",
                    "Defend against Collusive SSDF Attack Using Trust in Cooperative Spectrum Sensing Environment.",
                    "Efficient Random Key Based Encryption System for Data Packet Confidentiality in WSNs.",
                    "Exposing Clone RFID Tags at the Reader.",
                    "ProTACD: A Generic Privacy Process for Vehicle Development.",
                    "Mutual Chip Authentication.",
                    "Celerity Hardware Implementation of the AES with Data Parallel and Pipelining Architecture inside the Round Function.",
                    "Toward Coercion-Resistant End-to-End Verifiable Electronic Voting Systems.",
                    "Server-Aided Verification Proxy Re-signature.",
                    "Cryptanalysis of \"An Improved Remote Password Authentication Scheme with Smartcard\".",
                    "Trust and Adaptation in STRATUS.",
                    "Using Secure Multiparty Computation for Collaborative Information Exchange.",
                    "Pseudonymous Smart Metering without a Trusted Third Party.",
                    "TARS: Trusted Adaptive Routing Strategy with Back-Off Observing Mechanism.",
                    "Formal Verification of the Coordinated Robust Authentication Protocol for Wireless Networks.",
                    "TimSim: A Timestep-Based Wireless Ad-Hoc Network Simulator.",
                    "HIWL: An Unsupervised Learning Algorithm for Indoor Wireless Localization.",
                    "A Multi-agent Model for Fire Detection in Coal Mines Using Wireless Sensor Networks.",
                    "Power Control and Channel Assignment Mechanisms for Cluster-Based Multichannel Vehicular Ad-Hoc Networks.",
                    "A Novel Device-Device Beam Discovery Scheme with Cross-Layer Design for Millimeter-Wave WPAN.",
                    "A Distributed Localization Algorithm Based on Random Diffusion in WSN.",
                    "A Matrix Transformation Algorithm for Virtual Machine Placement in Cloud.",
                    "Big Data Real-Time Processing Based on Storm.",
                    "Detecting Associations in Large Dataset on MapReduce.",
                    "Protecting Cumulative Node Constraint during XML Update.",
                    "An Algorithmic Approach to Securing the Three-Stage Quantum Cryptography Protocol.",
                    "Social Spam Discovery Using Bayesian Network Classifiers Based on Feature Extractions.",
                    "The Role of Trust in Absorptive Capacity Operationalization.",
                    "An Adaptive Rating System for Service Computing.",
                    "An Automatic Parallel-Stage Decoupled Software Pipelining Parallelization Algorithm Based on OpenMP.",
                    "Mobile Parallel Computing Algorithms for Single-Buffered, Speed-Scalable Processors.",
                    "Probabilistic Analysis of Parallel Program with Partially Eliminated Barriers.",
                    "Simulator Implementation and Performance Study of a Polymorphous Array Computer.",
                    "Multicore Parallel Implementation of Agent Emotional Processes.",
                    "COSCHED: A Scheduling Agent Maximizing Cloud Broker's Revenues under the CompatibleOne Architecture.",
                    "Performance Analysis of Load-Aware Anycasting Based on OpenFlow.",
                    "Parallel Realization of Cognitive Cells on Film Mammography.",
                    "Fast and Accurate On-line Prediction of Performance and Power Consumption in Multicore-based Systems.",
                    "Performance Evaluation of the Time Analysable On-Demand Coherent Cache.",
                    "Communication Pipelining for Code Generation from Simulink Models.",
                    "An Optimizing Strategy Research of LDPC Decoding Based on GPGPU.",
                    "Environmental Spatio-temporal Ontology for the Linked Open Data Cloud."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "11th TrustCom 2012",
        "info": "Liverpool, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2012",
                "sub_name": "11th IEEE International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2012, Liverpool, United Kingdom, June 25-27, 2012.",
                "count": 291,
                "papers": [
                    "The Effectiveness of Intersection Attack Countermeasures for Graphical Passwords.",
                    "Divide and Conquer: An Efficient Attack on Yahoo! CAPTCHA.",
                    "Implementing an Attack on Bluetooth 2.1+ Secure Simple Pairing in Passkey Entry Mode.",
                    "Research on Time Synchronization and Flow Aggregation in LDDoS Attack Based on Cross-correlation.",
                    "Triangle-Area-Based Multivariate Correlation Analysis for Effective Denial-of-Service Attack Detection.",
                    "A Taxonomy of Trust and Reputation System Attacks.",
                    "An Active Detection Mechanism for Detecting ICMP Based Attacks.",
                    "Robust Biometric Based Key Agreement and Remote Mutual Authentication.",
                    "A Delaunay Triangle-Based Fuzzy Extractor for Fingerprint Authentication.",
                    "RFID Mutual Authentication and Secret Update Protocol for Low-Cost Tags.",
                    "A Hybrid Authentication and Key Establishment Scheme for WBAN.",
                    "Towards a Formal Verification of a Multi-factor Authentication Protocol Using Automated Theorem Provers.",
                    "Data Integration in Presence of Authorization Policies.",
                    "Secure Collaborative Outsourced Data Mining with Multi-owner in Cloud Computing.",
                    "Fusion of Opinions under Uncertainty and Conflict - Application to Trust Assessment for Cloud Marketplaces.",
                    "TSD: A Flexible Root of Trust for the Cloud.",
                    "Clouds Trust Anchors.",
                    "Tracking of Data Leaving the Cloud.",
                    "TREASURE: Trust Enhanced Security for Cloud Environments.",
                    "Confidentiality as a Service - Usable Security for the Cloud.",
                    "Constructing a Cloud-Based IDS by Merging VMI with FMA.",
                    "AnonymousCloud: A Data Ownership Privacy Provider Framework in Cloud Computing.",
                    "Virtual Property Theft Detection Framework: An Algorithm to Detect Virtual Propety Theft in Virtual World Environments.",
                    "Efficient Missing Tag Detection in a Large RFID System.",
                    "Cheater Detection in Vehicular Networks.",
                    "A Real-Time NetFlow-based Intrusion Detection System with Improved BBNN and High-Frequency Field Programmable Gate Arrays.",
                    "A Practical Network-Based Intrusion Detection and Prevention System.",
                    "VicSifter: A Collaborative DDoS Detection System with Lightweight Victim Identification.",
                    "Adaptive Character Frequency-Based Exclusive Signature Matching Scheme in Distributed Intrusion Detection Environment.",
                    "An Efficient Cross-Layer Approach for Malicious Packet Dropping Detection in MANETs.",
                    "A Multivariate Classification Algorithm for Malicious Node Detection in Large-Scale WSNs.",
                    "Detecting Imprudence of 'Reliable' Sellers in Online Auction Sites.",
                    "A Novel Scoring Model to Detect Potential Malicious Web Pages.",
                    "Real-Time Diagnosis of Network Anomaly Based on Statistical Traffic Analysis.",
                    "Provably Secure Single Sign-on Scheme in Distributed Systems and Networks.",
                    "Secure Distributed Solution for Optimal Energy Consumption Scheduling in Smart Grid.",
                    "Analysis and Evaluation Framework Based on Spatial Evolutionary Game Theory for Incentive Mechanism in Peer-to-Peer Network.",
                    "Efficient and Provably-Secure Group Key Management Scheme Using Key Derivation.",
                    "Mechanism Design Based Nodes Selection Model for Threshold Key Management in MANETs.",
                    "A Secure Distributed File System Based on Revised Blakley's Secret Sharing Scheme.",
                    "Efficient Contextual Transaction Trust Computation in E-commerce Environments.",
                    "Building Robust Reputation Systems in the E-commerce Environment.",
                    "Feedback as \"Shadow of the Present\": An Alternative to Reputation Systems for E-marketplaces.",
                    "Security Attribute Aggregation Models for E-research Collaborations.",
                    "Determining the Optimal Reporting Strategy in Competitive E-marketplaces.",
                    "K-Anonymous Cloaking Algorithm Based on Weighted Adjacency Graph for Preserving Location Privacy.",
                    "Measuring Anonymity by Profiling Probability Distributions.",
                    "How Practical is Homomorphically Encrypted Program Execution? An Implementation and Performance Evaluation.",
                    "A Privacy Preserving Application Acquisition Protocol.",
                    "An Efficient Trust Management System for Balancing the Safety and Location Privacy in VANETs.",
                    "Reputation Diffusion Simulation for Avoiding Privacy Violation.",
                    "Ring Group Signatures.",
                    "GridPriv: A Smart Metering Architecture Offering k-Anonymity.",
                    "Anonymity and Transferability for an Electronic Bank Check Scheme.",
                    "Evaluating the Optimized Implementations of SNOW3G and ZUC on FPGA.",
                    "Sufficient Encryption with Codewords and Bin-strings of H.264/SVC.",
                    "Anonymous Networking Meets Real-World Business Requirements.",
                    "Subversion Impedance in Covert Communication Networks.",
                    "Simulatable Oblivious Transfer Protocols Based on Blind Signature.",
                    "Ginger: An Access Control Framework for Telematics Applications.",
                    "Overhauling of a ASEA Robot IR6 with Open Architecture.",
                    "Classification of Correlated Internet Traffic Flows.",
                    "Cooperative Trajectory-Based Map Construction.",
                    "Messing with Android's Permission Model.",
                    "Wire - A Formal Intermediate Language for Binary Analysis.",
                    "SEAMS: A Signaling Layer for End-Host-Assisted Middlebox Services.",
                    "An Analytical Model on the Propagation of Modern Email Worms.",
                    "Analysis of SIP-Based Threats Using a VoIP Honeynet System.",
                    "Multiplayer Game Technology to Manage Critical Infrastructure Protection.",
                    "FACIUS: An Easy-to-Deploy SAML-based Approach to Federate Non Web-Based Services.",
                    "Provable Data Possession Using Sigma-protocols.",
                    "Towards Safe and Optimal Network Designs Based on Network Security Requirements.",
                    "Mechanism Design Based Secure Data Object Replication.",
                    "HyperDomain: Enabling Inspection of Malicious VMM's Misbehavior.",
                    "Image Resizing Based on Geometry Preservation with Seam Carving.",
                    "An MCL-Based Approach for Spam Profile Detection in Online Social Networks.",
                    "Efficient Privacy Preserving Matchmaking for Mobile Social Networking against Malicious Users.",
                    "IRIS: A Novel Method of Direct Trust Computation for Generating Trusted Social Networks.",
                    "Multiple QoT Constrained Social Trust Path Selection in Complex Social Networks.",
                    "Effects of Social Characters in Viral Propagation Seeding Strategies in Online Social Networks.",
                    "Evaluating User Community Influence in Online Social Networks.",
                    "Optimal State Management of Data Sharing in Online Social Network (OSN) Services.",
                    "A Distributed ECC-DSS Authentication Scheme Based on CRT-VSS and Trusted Computing in MANET.",
                    "Unwanted Traffic Control via Hybrid Trust Management.",
                    "Offline RFID Grouping Proofs with Trusted Timestamps.",
                    "A Case Based Reasoning Framework for Improving the Trustworthiness of Digital Forensic Investigations.",
                    "Confidence as a Means to Assess the Accuracy of Trust Values.",
                    "A Generalized Stereotypical Trust Model.",
                    "Hashed Random Key Pre-distribution Scheme for Large Heterogeneous Sensor Networks.",
                    "Trusted Administration of Large-Scale Cryptographic Role-Based Access Control Systems.",
                    "A Tunable Mechanism for Identifying Trusted Nodes in Large Scale Distributed Networks.",
                    "A New Efficient Property-Based Attestation Protocol Based on Elliptic Curves.",
                    "Reusable and Extensible Fault Tolerance for RESTful Applications.",
                    "An Area-Based Approach for Node Replica Detection in Wireless Sensor Networks.",
                    "Histogram-Based Online Anomaly Detection in Hierarchical Wireless Sensor Networks.",
                    "Towards Understanding Source Location Privacy in Wireless Sensor Networks through Fake Sources.",
                    "A Hybrid Key Management Protocol for Wireless Sensor Networks.",
                    "Secure Sector Based Bi-path Clustering and Routing Protocol for WSNs.",
                    "Modelling of Secure Data Transmission over a Multichannel Wireless Network in Alloy.",
                    "Collaborative Traffic-Aware Intrusion Monitoring in Multi-channel Mesh Networks.",
                    "Evaluation Criteria for Future Identity Management.",
                    "Privacy-Preserving Statistical Analysis Method for Real-World Data.",
                    "The Multi-layer Imbrication for Data Leakage Prevention from Mobile Devices.",
                    "Gemini: A Handbag for Pervasive Social Communications.",
                    "Adaptive Trust Management Mechanism for Cognitive Radio Networks.",
                    "An Identity Authentication Mechanism Based on Timing Covert Channel.",
                    "A Privacy Preserving Scalable Architecture for Collaborative Event Correlation.",
                    "Dynamic User Revocation and Key Refreshing for Attribute-Based Encryption in Cloud Storage.",
                    "Vulnerabilities through Usability Pitfalls in Cloud Services: Security Problems due to Unverified Email Addresses.",
                    "Insider Attacks in Cloud Computing.",
                    "Resources Collaborative Scheduling Model Based on Trust Mechanism in Cloud.",
                    "Security and Trust Preserving VM Migrations in Public Clouds.",
                    "WallDroid: Cloud Assisted Virtualized Application Specific Firewalls for the Android OS.",
                    "A Secure Node Localization Method Based on the Congruity of Time in Wireless Sensor Networks.",
                    "A Rapid Certification Protocol from Bilinear Pairings for Vehicular Ad Hoc Networks.",
                    "Reputation Based Security Model for Android Applications.",
                    "An Efficient Prevention of Black Hole Problem in AODV Routing Protocol in MANET.",
                    "Effects of IDSs on the WSNs Lifetime: Evidence of the Need of New Approaches.",
                    "Evaluation of a Fast Symmetric Cryptographic Algorithm Based on the Chaos Theory for Wireless Sensor Networks.",
                    "An Investigation into the Evolution of Security Usage in Home Wireless Networks.",
                    "Security Server-Based Architecture for Mobile Ad Hoc Networks.",
                    "CONDOR: A Hybrid IDS to Offer Improved Intrusion Detection.",
                    "An SLA-based Framework for Estimating Trustworthiness of a Cloud.",
                    "A Combined Clustering Scheme for Protecting Location Privacy and Query Privacy in Pervasive Environments.",
                    "Enhancing User Identity Privacy in LTE.",
                    "Privacy-Preserving Digital Rights Management in a Trusted Cloud Environment.",
                    "ILACF: An Incentive-Based Low-Latency Anonymous Communication Framework.",
                    "A Covert Timing Channel Based on Fountain Codes.",
                    "A Lightweight Anonymous On-demand Routing Scheme in Wireless Sensor Networks.",
                    "Network Coding-Based Mutual Anonymity Communication Protocol for Mobile P2P Networks.",
                    "A Lightweight Privacy Preserving Approach for Analyzing Communication Records to Prevent VoIP Attacks Using Toll Fraud as an Example.",
                    "Trustworthy Infrastructure Services for a Secure and Privacy-Respecting Internet of Things.",
                    "Design and Evaluation of SensorSafe: A Framework for Achieving Behavioral Privacy in Sharing Personal Sensory Information.",
                    "Analysis and Improvement of Privacy-Preserving Frequent Item Protocol for Accountable Computation Framework.",
                    "A Light-Weight Commodity Integrity Detection Algorithm Based on Chinese Remainder Theorem.",
                    "An Architecture for the Enforcement of Privacy and Security Requirements in Internet-Centric Services.",
                    "A Quantum-classical Hybrid Architecture for Security Algorithms Acceleration.",
                    "A Quantum TITO Diversity Transmission Scheme with Quantum Teleportation of Non-maximally Entangled Bell State.",
                    "Information Security of IPsec-based Mobile VPN: Authentication and Encryption Algorithms Performance.",
                    "Inflammation Security: A Decentralised Immune Model for Resource Distribution in Networks.",
                    "Analysis and Improvements of Two Identity Based Anonymous Signcryption Schemes for Multiple Receivers.",
                    "Assuring Data Privacy in Cloud Transformations.",
                    "BlendFuzz: A Model-Based Framework for Fuzz Testing Programs with Grammatical Inputs.",
                    "A Dynamic Distributed Key Tunneling Protocol for Heterogeneous Wireless Sensor Networks.",
                    "Static Detection of Logic Vulnerabilities in Java Web Applications.",
                    "A Multi-agent Immunologically-inspired Model for Critical Information Infrastructure Protection - An Immunologically-inspired Conceptual Model for Security on the Power Grid.",
                    "Autonomous Group-Based Authentication Mechanism in Mobile Ad Hoc Networks.",
                    "A Trust Model Based on P2P Trust Models for Secure Global Grids.",
                    "Design and Implementation of Facebook Crawler Based on Interaction Simulation.",
                    "More Choices, More Control: Extending Access Control by Meta-rights Reallocation.",
                    "Assessing Overhead Cost Associated with Encrypting Swap File.",
                    "A Data-Reachability Model for Elucidating Privacy and Security Risks Related to the Use of Online Social Networks.",
                    "Detection and Prevention of Data Manipulation from Client Side in Web Applications.",
                    "Analysing Impact of Scalability and Heterogeneity on the Performance of Federated Cloud Security.",
                    "Cloud SSDLC: Cloud Security Governance Deployment Framework in Secure System Development Life Cycle.",
                    "On Increasing the Computational Efficiency of Long Integer Multiplication on FPGA.",
                    "A Framework for Privacy-Preserving Mobile Payment on Security Enhanced ARM TrustZone Platforms.",
                    "Experimenting with ARM TrustZone - Or: How I Met Friendly Piece of Trusted Hardware.",
                    "Enhanced EDoS-Shield for Mitigating EDoS Attacks Originating from Spoofed IP Addresses.",
                    "Locating the Attacker of Wormhole Attack by Using the Honeypot.",
                    "Malicious AODV: Implementation and Analysis of Routing Attacks in MANETs.",
                    "Securing Trusted Execution Environments with PUF Generated Secret Keys.",
                    "Restricted Identification without Group Keys.",
                    "On a Visual Secret Sharing Scheme with High Quality Decryption.",
                    "Toward Authenticated and Complete Query Results from Cloud Storages.",
                    "Security Issues of a Publicly Accessible Cloud Computing Infrastructure.",
                    "File Exchange in Cloud.",
                    "Towards Semantic-Enhanced Attribute-Based Access Control for Cloud Services.",
                    "Self-Protecting Documents for Cloud Storage Security.",
                    "Border Gateway Protocol Anomaly Detection Using Failure Quality Control Method.",
                    "AMDD: Exploring Entropy Based Anonymous Multi-dimensional Data Detection for Network Optimization in Human Associated DTNs.",
                    "Android Malware Detection via a Latent Network Behavior Analysis.",
                    "A Layered Malware Detection Model Using VMM.",
                    "Distributed Privacy Preserving Classification Based on Local Cluster Identifiers.",
                    "Privacy Protecting by Multiattribute Clustering in Data-Intensive Service.",
                    "Fuzzy Logic Election of Node for Routing in WSNs.",
                    "Location-Based Authentication and Authorization Using Smart Phones.",
                    "A Formally Verified Device Authentication Protocol Using Casper/FDR.",
                    "Provably Secure Two-Party Explicit Authenticated Key Agreement Protocol.",
                    "Integrity Verification Architecture (IVA) Based Security Framework for Windows Operating System.",
                    "Performance Evaluation of Shared Hosting Security Methods.",
                    "Security Aspects of Soft Verified Messages Protected by Message Authentication Codes.",
                    "Using Subjective Logic to Handle Uncertainty and Conflicts.",
                    "Random4: An Application Specific Randomized Encryption Algorithm to Prevent SQL Injection.",
                    "A Multi-tunnel VPN Concurrent System for New Generation Network Based on User Space.",
                    "Development of a Typing Behaviour Recognition Mechanism on Android.",
                    "Domain Name to IP Address Resolution System with Multiple Name Servers Adaptable to MANETs.",
                    "A Scalable Anonymity Scheme Based on DHT Distributed Inquiry.",
                    "Secure Reputation Framework for BitTorrent.",
                    "RedJsod: A Readable JavaScript Obfuscation Detector Using Semantic-based Analysis.",
                    "An Attribute-Based Encryption Scheme Secure against Malicious KGC.",
                    "Social Network Content Management through Watermarking.",
                    "U+F Social Network Protocol: Achieving Interoperability and Reusability between Web Based Social Networks.",
                    "Mitigating SPIT with Social Strength.",
                    "Evolution of Cooperation Based on Reputation on Dynamical Networks.",
                    "Engagement and Cooperation in Social Networks: Do Benefits and Rewards Help?",
                    "Practicable Unified Security, Trust and Privacy (STP) Framework for Federated Access Management (FAM).",
                    "Evaluation of Trustworthiness of Reviews in the Online Travel Community.",
                    "Research on Trust Issue of Current Chinese C2C E-commerce: Problems and Solutions.",
                    "How to Track Your Data: Rule-Based Data Provenance Tracing Algorithms.",
                    "VehiCloud: Cloud Computing Facilitating Routing in Vehicular Networks.",
                    "Geographic-Based Service Request Scheduling Model for Mobile Cloud Computing.",
                    "Evaluating Ubiquitous Sensor Information Sharing on the Internet-of-Things.",
                    "A Block-Based Still Image Coder for Parallel Computing.",
                    "The Load Balancing Problem in Extended OTIS-n-Cube Interconnection Networks.",
                    "Performances of CS-DCSK UWB Communication System in the Presence of Narrow Band Interferers.",
                    "Enhanced Multi-rate Multicast for Optimal User Satisfaction and Efficient Bandwidth Utilization.",
                    "User Satisfaction Based ZFBF Scheduling Algorithm in Multi-user MIMO System.",
                    "Discovering a Large Scale Internet Topology: Complementary and Contrast View.",
                    "Interference Free Integration of Pervasive Applications.",
                    "Including Metadata into an Ontology Based Pervasive Computing Architecture.",
                    "Chronological Accommodation of Oculo-motors in Response to Varying Sizes of Visual Stimuli.",
                    "Ubiquitous Secure Interactions with Intelligent Artifacts on the Internet-of-Things.",
                    "Optimal Resource Allocation for Multi-layered Video Streaming over Multi-channel Cognitive Radio Networks.",
                    "Distributed Rerouting for Multiple Sessions in Cognitive Radio Networks.",
                    "Formal Verification of a Key Agreement Protocol for Wireless Sensor Networks.",
                    "Window Energy Detection for Unmanned Surveillance with PIR Sensor.",
                    "A Dynamic Bandwidth Allocation Algorithm for a Multi-sink Wireless Sensor Network Converged with a Passive Optical Network.",
                    "Fast and Efficient Information Dissemination in Event-Based Wireless Sensor Networks.",
                    "Data-centric Dissemination to Mobile Sink Group in Wireless Sensor Networks.",
                    "Link Stability Evaluation and Stability Based Multicast Routing Protocol in Mobile Ad Hoc Networks.",
                    "A Reliability-Based Routing Scheme for Vehicular Ad Hoc Networks (VANETs) on Highways.",
                    "Hyper-mutation Based Genetic Algorithms for Dynamic Multicast Routing Problem in Mobile Ad Hoc Networks.",
                    "A Reception Based Node Selection Protocol for Multi-hop Routing in Vehicular Ad-hoc Networks.",
                    "Flow-Aware Broadcasting Algorithm.",
                    "User Preferences-Adaptive Dynamic Network Selection Approach in Cooperating Wireless Networks: A Game Theoretic Perspective.",
                    "Design and Analysis of Multicast-Based Publisher/Subscriber Models over Wireless Platforms for Smart Grid Communications.",
                    "A HiperLAN/2 Based MAC Protocol for Efficient Vehicle-to-Infrastructure Communication Using Directional Wireless Mesh Backbone.",
                    "Location Assisted Vertical Handover Algorithm for QoS Optimization in End-to-end Connections.",
                    "Collision and Detection Performance with Three Overlap Signal Collisions in Space-Based AIS Reception.",
                    "Error Performance Analysis of Opportunistic Relaying System Based on DCSK.",
                    "Modelling of Prioritised Vertical Handoff Scheme in Integrated UMTS/WLANs.",
                    "Design and Evaluation of an Operational Mobility Model over IPv6 (OMIPv6) Based on ID/Locator Split Architecture.",
                    "AR Teleport: Digital Reconstruction of Historical and Cultural-Heritage Sites Using Mobile Augmented Reality.",
                    "A Model Driven Infrastructure for Context-Awareness Mobile Assessment Personalization.",
                    "Modeling an Enhanced Tuple Space Based Mobile Middleware in UNITY.",
                    "A Trajectory Model to Deal with Transmission Failures.",
                    "Improving the Energy-Efficiency of GPS Based Location Sensing Smartphone Applications.",
                    "Efficient Internet Mapping in the Presence of Network Load Balancers.",
                    "The Impact of Sensor Node Distribution on Routing Protocols Performance: A Comparitive Study.",
                    "A Temporalised Belief Logic for Reasoning about Authentication Protocols.",
                    "Cross-Technology Overlay Control Protocol for Resource Management in Converged Networks.",
                    "Improving Query for P2P SIP VoIP.",
                    "A Round Robin Load Balancing and Redundancy Protocol for Network Routers.",
                    "Genetic Algorithm in Resource Provider Selection for Personal Live Content Delivery in User-Provided Platform.",
                    "On Designing Privacy-Aware Data Upload Mechanism - Towards Information-Gathering System for Disasters.",
                    "A Hybrid Ontological and Temporal Approach for Composite Activity Modelling.",
                    "Categorising Context and Using Short Term Contextual Information to Obtain Long Term Context.",
                    "Semantic Decision Support Models for Energy Efficiency in Smart-Metered Homes.",
                    "Robot Navigation Using Brain-Computer Interfaces.",
                    "A Comprehensive Ontology for Knowledge Representation in the Internet of Things.",
                    "Hybrid Ontology Matching for Solving the Heterogeneous Problem of the IoT.",
                    "Design of Real Time Multimedia Platform and Protocol to the Internet of Things.",
                    "Knowledge Acquisition and Management Architecture for Mobile and Personal Health Environments Based on the Internet of Things.",
                    "Efficient Searching Mechanism for Trust-Aware Recommender Systems Based on Scale-Freeness of Trust Networks.",
                    "Square-Root Unscented Kalman Filtering Based Localization and Tracking in the Internet of Things.",
                    "A Text Representation Method Based on Harmonic Series.",
                    "Research on Embedding ECC into RFID Authentication Protocol.",
                    "A Hybrid MPI/OpenMP Model Based on DDM for Large-Scale Partial Differential Equations.",
                    "Real-Time Distributed Sensor-Assisted mHealth Applications on the Internet-of-Things.",
                    "Quality Assessment of Video Transmission in Heterogeneous Networks as Applied to Real-Time Telecare.",
                    "Time- and Frequency-Domain Impulsive Noise Spreader for OFDM Systems.",
                    "DSDV, DYMO, OLSR: Link Duration and Path Stability.",
                    "Analysis and Modeling Experiment Performance Parameters of Routing Protocols in MANETs and VANETs.",
                    "Role Based Privacy-Aware Secure Routing in WMNs.",
                    "An Ant Colony Optimization Algorithm for Overlay Backbone Multicast Routing in Content Delivery Networks.",
                    "The Research and Application of a Specific Instruction Processor for SMS4.",
                    "Prediction-Based Algorithm for Event Detection in Wireless Sensor Networks.",
                    "Testing Method of Code Redundancy Simplification Based on Program Dependency Graph.",
                    "Dynamic Optimization on Multi-core Platform.",
                    "A Dynamic Cache Partitioning Mechanism under Virtualization Environment.",
                    "HVD-TLS: A Novel Framework of Thread Level Speculation.",
                    "An Efficient Distributed Transactional Memory System.",
                    "Causal Analysis of Student's Characteristics of Note-Taking Activities and Learning Performance during a Fully Online Course.",
                    "Research on Cooperative Learning of Digital English Writing in Network Environment.",
                    "Development and Validation of a Virtual Worklog as a Collaboration Tool for the Kelluwen Learning Community.",
                    "Actualization of a Course Library through Influential Twitter Knowledge.",
                    "The Current State of Understanding of the Energy Efficiency of Cloud Computing.",
                    "Enabling the IoT Paradigm in E-health Solutions through the VIRTUS Middleware.",
                    "Ubiquitous HealthCare in Wireless Body Area Networks.",
                    "Performance Study of Localization Techniques in Wireless Body Area Sensor Networks.",
                    "Radio Frequency Energy Harvesting Characterization: An Experimental Study.",
                    "A Novel System for Evaluating Website Using Link Analysis.",
                    "An Efficient Detecting Communities Algorithm with Self-Adapted Fuzzy C-Means Clustering in Complex Networks.",
                    "An Analysis of Peer to Peer Protocols for Massively Multiplayer Online Games.",
                    "Padati: A Robust Pedestrian Dead Reckoning System on Smartphones.",
                    "High Accuracy 3D Indoor Positioning Using Broadband Ultrasonic Signals.",
                    "Weighted Flow and Spectral Resource to Enhance QoS for Multi-hop Cognitive Radio Networks.",
                    "An Integrated Mobile System for Long-Term Aerobic Activity Monitoring and Support in Daily Life.",
                    "Foundations for a Platform to Develop Context-aware Systems by Domain Experts.",
                    "Joint Source-Channel Coding Based on P-LDPC Codes for Radiography Images Transmission."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "10th TrustCom 2011",
        "info": "Changsha, China",
        "venues": [
            {
                "sub_name_abbr": "conf/trustcom/2011",
                "sub_name": "IEEE 10th International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom 2011, Changsha, China, 16-18 November, 2011.",
                "count": 258,
                "papers": [
                    "Access Control in Distributed Systems: Merging Theory with Practice.",
                    "TRUSTIE: Design of a Trustworthy Software Production Environment.",
                    "Jacket Matrix and Its Applications to Signal Processing.",
                    "Defending against Large-Scale and Coordinated Attacks in the Ubiquitous Environments.",
                    "Privacy, Identity and Trust in Context-Aware Mobile Services.",
                    "A Cooperative Mechanism to Defense against Distributed Denial of Service Attacks.",
                    "Estimates of Success Rates of Denial-of-Service Attacks.",
                    "Uncovering SIP Vulnerabilities to DoS Attacks Using Coloured Petri Nets.",
                    "Launching Return-Oriented Programming Attacks against Randomized Relocatable Executables.",
                    "A Privacy-Preserving Defense Mechanism against Request Forgery Attacks.",
                    "A Survey on Latest Botnet Attack and Defense.",
                    "Holistic Solution for Confining Insider Attacks in Wireless Sensor Networks Using Reputation Systems Coupled with Clustering Techniques.",
                    "Trusted Block as a Service: Towards Sensitive Applications on the Cloud.",
                    "Privacy-Preserved Access Control for Cloud Computing.",
                    "DACC: Distributed Access Control in Clouds.",
                    "Secure Virtual Layer Management in Clouds.",
                    "Trust Ticket Deployment: A Notion of a Data Owner's Trust in Cloud Computing.",
                    "Establishing Trust in Hybrid Cloud Computing Environments.",
                    "Towards Scalable, Fine-Grained, Intrusion-Tolerant Data Protection Models for Healthcare Cloud.",
                    "A Charged PSO Inspired Method for Generating Immune Detectors for Network Intrusion Detection.",
                    "A New Trust Management Framework for Detecting Malicious and Selfish Behaviour for Mobile Ad Hoc Networks.",
                    "LoongChecker: Practical Summary-Based Semi-simulation to Detect Vulnerability in Binary Code.",
                    "DENNC: A Wireless Malicious Detection Approach Based on Network Coding.",
                    "Geometric Invariant Digital Image Watermarking Scheme Based on Feature Points Detector and Histogram Distribution.",
                    "Forecasting the Distribution of Network Traffic for Anomaly Detection.",
                    "Malware Variant Detection Using Similarity Search over Sets of Control Flow Graphs.",
                    "A Method for Detecting Unknown Malicious Executables.",
                    "Privacy Crisis Due to Crisis Response on the Web.",
                    "A Privacy-Friendly RFID Protocol Using Reusable Anonymous Tickets.",
                    "Learning Whom to Trust in a Privacy-Friendly Way.",
                    "Semantics-Enhanced Privacy Recommendation for Social Networking Sites.",
                    "Towards a Holistic Privacy Engineering Approach for Smart Grid Systems.",
                    "Balancing Security and Performance for Enhancing Data Privacy in Data Warehouses.",
                    "Privacy Preserving Access Control Policy and Algorithms for Conflicting Problems.",
                    "A Trust Prediction Model for Service Web.",
                    "IntRank: Interaction Ranking-Based Trustworthy Friend Recommendation.",
                    "A Research Model for Human-Computer Trust Interaction.",
                    "Worm Propagation Modeling Using 2D Cellular Automata in Bluetooth Networks.",
                    "A Hybrid Trust Model for Authorisation Using Trusted Platforms.",
                    "A Model for a Testbed for Evaluating Reputation Systems.",
                    "SMEF: An Entropy-Based Security Framework for Cloud-Oriented Service Mashup.",
                    "A Reputation Mechanism for Virtual Reality - Five-Sense Oriented Feedback Provision and Subjectivity Alignment.",
                    "SWTrust: Generating Trusted Graph for Trust Evaluation in Online Social Networks.",
                    "Malware Behavior Capturing Based on Taint Propagation and Stack Backtracing.",
                    "Case-Based Trust Evaluation from Provenance Information.",
                    "A Framework for Reputation Bootstrapping Based on Reputation Utility and Game Theories.",
                    "Proactive Blacklisting for Malicious Web Sites by Reputation Evaluation Based on Domain and IP Address Registration.",
                    "Towards Context-Aware Service-Oriented Semantic Reputation Framework.",
                    "A Private and Scalable Authentication for RFID Systems Using Reasonable Storage.",
                    "SWHash: An Efficient Data Integrity Verification Scheme Appropriate for USB Flash Disk.",
                    "An EAP Framework for Unified Authentication in Wireless Networks.",
                    "Inter-Chip Authentication through I/O Character.",
                    "A Simple Balanced Password-Authenticated Key Agreement Protocol.",
                    "Pollination: A Data Authentication Scheme for Unattended Wireless Sensor Networks.",
                    "Mutual Authentication Protocol for Networked RFID Systems.",
                    "A DRTM-Based Method for Trusted Network Connection.",
                    "Biometric Enabled Portable Trusted Computing Platform.",
                    "Ensuring Secure Information Flow in Partially Reconfigurable Architectures by Means of Process Algebra Analysis.",
                    "A New Security Architecture for BitTorrent.",
                    "An Access Control Framework for the Web of Data.",
                    "Trust ME: A Trust Decision Framework for Mobile Environments.",
                    "A Logical Framework of Proof-Carrying Survivability.",
                    "CNSSA: A Comprehensive Network Security Situation Awareness System.",
                    "A Scalability Study of AAA Support in Heterogeneous Networking Environments with Global Roaming Support.",
                    "Secret Sharing Scheme with Fairness.",
                    "Distributed Private-Key Generation Scheme with Self-Certified Identity.",
                    "A Double Key-Sharing Based False Data Filtering Scheme in Wireless Sensor Networks.",
                    "Biometric Identification Using User Interactions with Virtual Worlds.",
                    "Repeated Differential Properties of the AES-128 and AES-256 Key Schedules.",
                    "Lightweight Hidden Services.",
                    "Security Issues in NoSQL Databases.",
                    "A Reliable and Secure Distributed In-network Data Storage Scheme in Wireless Sensor Networks.",
                    "Trust-Based Approaches to Solve Routing Issues in Ad-Hoc Wireless Networks: A Survey.",
                    "Highly Efficient Distance-Based Anomaly Detection through Univariate with PCA in Wireless Sensor Networks.",
                    "RealProct: Reliable Protocol Conformance Testing with Real Nodes for Wireless Sensor Networks.",
                    "A Quantitative Approach to Triaging in Mobile Forensics.",
                    "Trust-Based Cluster Head Selection Algorithm for Mobile Ad Hoc Networks.",
                    "Cross-Platform Application Sharing Mechanism.",
                    "TVLAN: Trusted and Virtualised Local Area Networks.",
                    "A Decentralized Repair Mechanism for Decentralized Erasure Code Based Storage Systems.",
                    "Intelligent Assistant for Context-Aware Policies.",
                    "Publicly Posted Composite Documents in Variably Ordered Workflows.",
                    "Design Comparison to Identify Malicious Hardware in External Intellectual Property.",
                    "Unwanted Traffic Control via Global Trust Management.",
                    "A Secure Multicoupon Solution for Multi-merchant Scenarios.",
                    "Efficiently Achieving Full Three-Way Non-repudiation in Consumer-Level eCommerce and M-Commerce Transactions.",
                    "Exploring and Enhancing the Performance of Parallel IDS on Multi-core Processors.",
                    "A Model for Automating Persistent Identity Clone in Online Social Network.",
                    "Dependable Context-Sensitive Services in Cyber Physical Systems.",
                    "Statistical Fault Localization via Semi-dynamic Program Slicing.",
                    "Decreasing SoC Test Power Dissipation and Test Data Volume Based on Pattern Recombination.",
                    "Flexible Communication: A Secure and Trust-Based Free Wi-Fi Password Sharing Service.",
                    "An ABC-AIS Hybrid Approach to Dynamic Anomaly Detection in AODV-Based MANETs.",
                    "An Enhanced Method for Computation of Similarity between the Contexts in Trust Evaluation Using Weighted Ontology.",
                    "A Trusted Integrity Measurement Architecture for Securing Enterprise Network.",
                    "Design and Implementation of Single Sign on System with Cluster CAS for Public Service Platform of Science and Technology Evaluation.",
                    "A Framework for the Assessment of the Trustworthiness of Digital Records over Time.",
                    "eHCBAC: Flexible Column Based Access Control for Electronic Healthcare Systems.",
                    "Enhancing Flexibility of TCG's TNC through Layered Property Attestation.",
                    "Monitoring Insiders Activities in Cloud Computing Using Rule Based Learning.",
                    "Flogger: A File-Centric Logger for Monitoring File Access and Transfers within Cloud Computing Environments.",
                    "Remedying the Hummingbird Cryptographic Algorithm.",
                    "A RFID-Based Context-Aware Service Model.",
                    "Defining and Analyzing Insiders and Their Threats in Organizations.",
                    "Adaptive Client-Side LUT-Based Digital Watermarking.",
                    "Identity-Based Strong Designated Verifier Signature Scheme with Full Non-Delegatability.",
                    "Protection Profile of Personal Information Security System: Designing a Secure Personal Information Security System.",
                    "Parity Cloud Service: A Privacy-Protected Personal Data Recovery Service.",
                    "Home Service Communities and Authentication.",
                    "Key Privacy in McEliece Public Key Cryptosystem.",
                    "Integrity Protection for Automated Teller Machines.",
                    "Group Formation with Neighbor Similarity Trust in P2P E-Commerce.",
                    "STrust: A Trust Model for Social Networks.",
                    "Attack Vector Analysis and Privacy-Preserving Social Network Data Publishing.",
                    "Theoretical Issues in the Study of Trust in Human-Computer Interaction.",
                    "Implementation of a Reputation System for Pervasive Social Networking.",
                    "Design and Evaluation of an Architecture for Ubiquitous User Authentication Based on Identity Management Systems.",
                    "Building up Trusted Identity Management in Mobile Heterogeneous Environment.",
                    "Internet Users' Security and Privacy While They Interact with Amazon.",
                    "A New Multivariate Hash Function with HAIFA Construction.",
                    "The Role of Trust in Social Life.",
                    "Reputation Based Collaboration among Ethernet Switches.",
                    "Gray Map and Quantum Codes over the Ring F_2+uF_2+u^2F_2.",
                    "Quantum Secure Communication Based on Nonmaximally Entangled Qubit Pair and Dining Cryptographers Problem.",
                    "Multiparty Quantum Group Signature Scheme with Quantum Parallel Computation.",
                    "Quantum Distributed Ballot Scheme Based on Entanglement Swapping.",
                    "Phishing Email Feature Selection Approach.",
                    "Study on IP Prefix Hijacking in Cloud Computing Networks Based on Attack Planning.",
                    "User Privacy Issues in Eucalyptus: A Private Cloud Computing Environment.",
                    "Towards a Trust Management System for Cloud Computing.",
                    "Migration to Cloud as Real Option: Investment Decision under Uncertainty.",
                    "Release Offset Bounds for Response Time Analysis of P-FRP Using Exhaustive Enumeration.",
                    "Permutational Genetic Algorithm for the Optimized Assignment of Priorities to Tasks and Messages in Distributed Real-Time Systems.",
                    "Feasibility Interval for the Transactional Event Handlers of P-FRP.",
                    "Offline Validation of Real-Time Application Constraints Considering Adaptation Rules.",
                    "Efficient Elastic Resource Management for Dynamic Embedded Systems.",
                    "Real-Time Scheduling for Phase Change Main Memory Systems.",
                    "SPARTS: Simulator for Power Aware and Real-Time Systems.",
                    "A Hardware/Software Countermeasure and a Testing Framework for Cache Based Side Channel Attacks.",
                    "hUBI: An Optimized Hybrid Mapping Scheme for NAND Flash-Based SSDs.",
                    "Learning-Directed Dynamic Voltage and Frequency Scaling for Computation Time Prediction.",
                    "DSBS: Distributed and Scalable Barrier Synchronization in Many-Core Network-on-Chips.",
                    "Minimizing Schedule Length via Cooperative Register Allocation and Loop Scheduling for Embedded Systems.",
                    "Optimal Data Placement for Memory Architectures with Scratch-Pad Memories.",
                    "On Partitioned Scheduling of Fixed-Priority Mixed-Criticality Task Sets.",
                    "A Sufficient Schedulability Test for Real-Time Software Transactional Memory.",
                    "Response Time Analysis of COTS-Based Multicores Considering the Contention on the Shared Memory Bus.",
                    "Efficient Implementation of Thermal-Aware Scheduler on a Quad-core Processor.",
                    "Thermal-Aware Scheduling of Critical Applications Using Job Migration and Power-Gating on Multi-core Chips.",
                    "Schedulability Analysis of Transactions in Software Transactional Memory Using Timed Automata.",
                    "Visualization of Computational Processes of Procedural Abstraction Optimization Passes.",
                    "Tool Support for Automated Traceability of Test/Code Artifacts in Embedded Software Systems.",
                    "Automatic Model Building and Verification of Embedded Software with UPPAAL.",
                    "A Precise Memory Model for Operating System Code Verification.",
                    "A Distributed Real-Time Operating System with Location-Transparent System Calls for Task Management and Inter-task Synchronization.",
                    "Parallel Data Cube Construction Based on an Extendible Multidimensional Array.",
                    "Safety Verification of Non-linear, Planar Proportional Control with Differential Inclusions.",
                    "Probabilistic Schedulability Guarantees for Dependable Real-Time Systems under Error Bursts.",
                    "FTGS: Fault-Tolerant Fixed-Priority Scheduling on Multiprocessors.",
                    "A UML Model-Based Approach for Replication Assessment of AUTOSAR Safety-Critical Applications.",
                    "Verification-Based Multi-backup Firmware Architecture, an Assurance of Trusted Boot Process for the Embedded Systems.",
                    "UML-Based Analysis of Power Consumption for Real-Time Embedded Systems.",
                    "Efficient Java Native Interface for Android Based Mobile Devices.",
                    "Resource Management for Robotic Applications.",
                    "Auction-Based Adaptive Sensor Activation Algorithm for Target Tracking in WSNs.",
                    "A Distributed and Shortest-Path-Based Algorithm for Maximum Cover Sets Problem in Wireless Sensor Networks.",
                    "Visual Navigation System with Real-Time Image Processing for Patrol Service Robot.",
                    "An Efficient Stereoscopic Game Conversion System for Embedded Platform.",
                    "Autonomous Parameter and Schedule Configuration for TDMA-Based Communication Protocols Such as FlexRay.",
                    "Comparative Analysis of Power Consumption in the Implementation of Arithmetic Algorithms.",
                    "Extending EAST-ADL2 to Support Aspectual Requirement Specification and Analysis for Automotive Software.",
                    "An Advanced and Effective Literature Search Algorithm Based on Analytic Hierarchy Process.",
                    "Detection DoS Attack on FPGA Using Fuzzy Association Rules.",
                    "Multicast Trusted Routing with QoS Multi-constraints in Wireless Ad Hoc Networks.",
                    "A Software Fault-Tolerant Method Based on Exception Handling in RT/E System.",
                    "Using Project-Based Learning and Collaborative Learning in Software Engineering Talent Cultivation.",
                    "Study of Experiment Structure in the Computer Networks Course Using PBL Methodology.",
                    "The Effective Second Classroom on Embedded System Education.",
                    "The Practice Teaching Reform of Modern Communication Technologies Course for Non-communication Majors.",
                    "Reform and Practice of Training Engineering Professionals in 2C+E Computer Science.",
                    "Study and Practice on Teaching Team Construction of Computer Specialties in Private Undergraduate Universities and Colleges.",
                    "Course Improvements to 'the Principle of Computer Organization' Based on the Goal of Disciplinary Education: Taking the Examples of the Computing Science Faculty of Zhejiang University City College.",
                    "Teaching Method Practicing on Embedded Software Engineering Curriculum.",
                    "Optimal Tracking Agent: A New Framework for Multi-agent Reinforcement Learning.",
                    "A Global Scheduling Algorithm Based on Dynamic Critical Path.",
                    "Power Optimization for GPU Programs Based on Software Prefetching.",
                    "I/O Scheduling by Using Multi-network Interfaces of Virtualization System.",
                    "The Research of Levenberg-Marquardt Algorithm in Curve Fittings on Multiple GPUs.",
                    "Object-Level Data Model for Keyword Search over Relational Databases.",
                    "Efficient GPGPU-Based Parallel Packet Classification.",
                    "Context-Aware Vertical Handoff Decision Scheme in Heterogeneous Wireless Networks.",
                    "An LIRS-Based Replica Replacement Strategy for Data-Intensive Applications.",
                    "Abnormal Process Instances Identification Method in Healthcare Environment.",
                    "A Simulation Study of Unstructured P2P Overlay for Multimedia Streaming.",
                    "Towards User Intent Based Searching.",
                    "An Efficient Load Balancing Multi-core Frequent Patterns Mining Algorithm.",
                    "Fault Tolerance Policy on Dynamic Load Balancing in P2P Grids.",
                    "Power Control Game Algorithm Based on Combination Pricing Function.",
                    "A Block Gathering Based on Mobile Web Page Segmentation Algorithm.",
                    "A Two-Layered Replica Management Method.",
                    "An Email Server Optimized for Storage Issues.",
                    "Improving the Adaptiveness of FAST TCP Based on the Stability with Time-Delay.",
                    "Achieving High Throughput in High-Radix Switch.",
                    "Anisotropic Band-Pass Trilateral Filter for Creating Artistic Painting from Real Image.",
                    "Modeling Trees with Rugged Surfaces.",
                    "A Power Law Transformation Predicting Lightness Conditions Based on Skin Color Space Detection.",
                    "An Efficient Method of Tracking across Multiple Cameras.",
                    "Nose Surgery Simulation Based on Volumetric Laplacian Deformation.",
                    "Fusing Audio-Words with Visual Features for Pornographic Video Detection.",
                    "Text Line Based Correction of Distorted Document Images.",
                    "Overlapping One-Class SVMs for Utterance Verification in Speech Recognition.",
                    "Chinese Traffic Police Gesture Recognition in Complex Scene.",
                    "Preference-Based Top-K Influential Nodes Mining in Social Networks.",
                    "A Weighted Cluster Ensemble Algorithm Based on Graph.",
                    "The Hot Keyphrase Extraction Based on TF*PDF.",
                    "A Decision Making Ontology Building Process for Analytical Requirements Elicitation.",
                    "Clustering Algorithm for High Dimensional Data Stream over Sliding Windows.",
                    "Capability as Requirement Metaphor.",
                    "Variable Precision Rough Set-Based Fault Diagnosis for Web Services.",
                    "A Web Services Composition Model and Its Verification Algorithm Based on Interface Automata.",
                    "Towards a Behavior-Based Restructure Approach for Service Composition.",
                    "Design Pattern for Self-Organization Multi-agent Systems Based on Policy.",
                    "Plug-In Based Integrated Development Platform for Industrial Control System-P-IDP4ICS.",
                    "A Certificate Driven Access Control Strategy for Service Composition and Its Analysis.",
                    "CLOUD SHREDDER: Removing the Laptop On-road Data Disclosure Threat in the Cloud Computing Era.",
                    "Towards Detecting Thread Deadlock in Java Programs with JVM Introspection.",
                    "VerFAT: A Transparent and Efficient Multi-versioning Mechanism for FAT File System.",
                    "A Property-Based Attestation Scheme with the Variable Privacy.",
                    "Multi-relay Cooperative Mechanism with Q-Learning in Cognitive Radio Multimedia Sensor Networks.",
                    "An Iterative Multi-path Routing Protocol in Wireless Ad Hoc Networks.",
                    "A Game Theoretic Coalitional Bidding Scheme for Efficient Routing in Vehicular Ad Hoc Networks.",
                    "A Novel Energy-Efficient Routing Algorithm in Multi-sink Wireless Sensor Networks.",
                    "A Method for Searching the Centroid of a 3D Cluster Based on RSSI.",
                    "Routing with Virtual Region Coordinates in Wireless Sensor Networks.",
                    "Energy Efficient Data Aggregation Scheduling in Wireless Sensor Networks.",
                    "Phase-Wise Clustering of Time Series Gene Expression Data.",
                    "A Formal Approach for Modeling Interactive Visual Interfaces.",
                    "A Quasi Physical Method for the Equal Sphere Packing Problem.",
                    "A Refined and Heuristic Algorithm for LD tagSNPs Selection.",
                    "Improved Partial Parallel Decision Feedback Multiuser Detection for Multiuser-MIMO System.",
                    "A Data Simulator for ZigBee-Base Wireless Sensor Network System.",
                    "Energy Aware Routing Protocols for Wireless Sensor Networks Using Discrete Transmission Energies.",
                    "Performance Design and Analysis of Handoff in Hierarchical Wireless Networks.",
                    "A Biased Modified Binary Query Tree Protocol for RFID Tag Collision Resolution.",
                    "Time-Based Detection and Location of Wormhole Attacks in Wireless Ad Hoc Networks.",
                    "Energy-Efficiency Media Independent Handover Mechanism.",
                    "The Four Corners DV-Hop Localization Algorithm for Wireless Sensor Network.",
                    "Performance Analysis of Key Management Schemes in Wireless Sensor Network Using Analytic Hierarchy Process.",
                    "Chaotic Hash Function Based on Tandem-DM Construction.",
                    "Implementation and Performance Evaluation of an Adaptive Routing Algorithm in MANETs.",
                    "Session Key Generation for a Group Call and Device for Security Control.",
                    "Identification of Masses in Digital Mammogram Using an Optimal Set of Features.",
                    "Automated Inspection Using X-Ray Imaging.",
                    "Semantic Web Service Automatic Composition Based on Service Parameter Relationship Graph.",
                    "Exploit TIVs to Find Faster Paths.",
                    "Context Awareness for Self-Adaptiveness in Smart Terminals.",
                    "Simulation Tools Enabling Research in Convergence of Fixed and Mobile Networks.",
                    "Performance Modelling and Analysis of Dynamic Class-Based Call Admission Control Algorithm Using Fuzzy Logic for Heterogeneous Wireless Networks."
                ]
            }
        ]
    }
]