[
    {
        "year": "2021",
        "name": "14th WISEC 2021",
        "info": "Abu Dhabi, United Arab Emirates",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2021",
                "sub_name": "WiSec '21: 14th ACM Conference on Security and Privacy in Wireless and Mobile Networks, Abu Dhabi, United Arab Emirates, 28 June - 2 July, 2021.",
                "count": 45,
                "papers": [
                    "A comprehensive formal analysis of 5G handover.",
                    "Amazon echo dot or the reverberating secrets of IoT devices.",
                    "Anonymous device authorization for cellular networks.",
                    "Delegated attestation: scalable remote attestation of commodity CPS by blending proofs of execution with software attestation.",
                    "Direct anonymous attestation on the road: efficient and privacy-preserving revocation in C-ITS.",
                    "FADIA: fairness-driven collaborative remote attestation.",
                    "Happy MitM: fun and toys in every bluetooth device.",
                    "Here, there, and everywhere: security analysis of wi-fi fine timing measurement.",
                    "Julia: fast and secure key agreement for IoT devices.",
                    "Let numbers tell the tale: measuring security trends in wi-fi networks and best practices.",
                    "LightningStrike: (in)secure practices of E-IoT systems in the wild.",
                    "LNGate: powering IoT with next generation lightning micro-payments using threshold cryptography.",
                    "Message sieving to mitigate smart gridlock attacks in V2V.",
                    "Misactivation detection and user identification in smart home speakers using traffic flow features.",
                    "No need to ask the Android: bluetooth-low-energy scanning without the location permission.",
                    "Non-IID data re-balancing at IoT edge with peer-to-peer federated learning for anomaly detection.",
                    "On the challenges of automata reconstruction in LTE networks.",
                    "Orbit-based authentication using TDOA signatures in satellite networks.",
                    "OutletSpy: cross-outlet application inference via power factor correction signal.",
                    "Recurring verification of interaction authenticity within bluetooth networks.",
                    "Remotely controlling TrustZone applications?: a study on securely and resiliently receiving remote commands.",
                    "RIP StrandHogg: a practical StrandHogg attack detection method on Android.",
                    "Security analysis of IEEE 802.15.4z/HRP UWB time-of-flight distance measurement.",
                    "SELEST: secure elevation estimation of drones using MPC.",
                    "SigUnder: a stealthy 5G low power attack and defenses.",
                    "SNOW-Vi: an extreme performance variant of SNOW-V for lower grade CPUs.",
                    "SoK: assessing the threat potential of vibration-based attacks against live speech using mobile sensors.",
                    "Spearphone: a lightweight speech privacy exploit via accelerometer-sensed reverberations from smartphone loudspeakers.",
                    "Spectrum-flexible secure broadcast ranging.",
                    "Toward a secure crowdsourced location tracking system.",
                    "VoIPLoc: passive VoIP call provenance via acoustic side-channels.",
                    "Write to know: on the feasibility of wrist motion based user-authentication from handwriting.",
                    "Z-Fuzzer: device-agnostic fuzzing of Zigbee protocol implementation.",
                    "5G SUCI-catchers: still catching them all?",
                    "A defensive man-in-middle approach to filter BLE packets.",
                    "A framework to test and fuzz wi-fi devices.",
                    "AirCollect: efficiently recovering hashed phone numbers leaked via Apple AirDrop.",
                    "OpenHaystack: a framework for tracking personal bluetooth devices via Apple's massive find my network.",
                    "openwifi CSI fuzzer for authorized sensing and covert channels.",
                    "Relay/replay attacks on GNSS signals.",
                    "AgriAuth: sensor collaboration and corroboration for data confidence in smart farms.",
                    "Cross-protocol attacks: weaponizing a smartphone by diverting its bluetooth controller.",
                    "Detecting GNSS misbehaviour with high-precision clocks.",
                    "Identifying device type from cross channel probe request behavior.",
                    "Robust deep-learning-based radio fingerprinting with fine-tuning."
                ]
            },
            {
                "sub_name_abbr": "conf/wisec/2021wiseml",
                "sub_name": "WiseML@WiSec 2021: Proceedings of the 3rd ACM Workshop on Wireless Security and Machine Learning, Abu Dhabi, United Arab Emirates, July 2, 2021.",
                "count": 16,
                "papers": [
                    "A Machine Learning Approach for Detecting and Classifying Jamming Attacks Against OFDM-based UAVs.",
                    "Adversarial Attacks on Deep Learning-based Floor Classification and Indoor Localization.",
                    "Adversarial Classification of the Attacks on Smart Grids Using Game Theory and Deep Learning.",
                    "Adversarial Learning for Cross Layer Security.",
                    "Efficient and Privacy-preserving Distributed Learning in Cloud-Edge Computing Systems.",
                    "Explainability-based Backdoor Attacks Against Graph Neural Networks.",
                    "Inaudible Manipulation of Voice-Enabled Devices Through BackDoor Using Robust Adversarial Audio Attacks: Invited Paper.",
                    "Intermittent Jamming against Telemetry and Telecommand of Satellite Systems and A Learning-driven Detection Strategy.",
                    "Learning Model for Cyber-attack Index Based Virtual Wireless Network Selection.",
                    "Low-cost Influence-Limiting Defense against Adversarial Machine Learning Attacks in Cooperative Spectrum Sensing.",
                    "Machine Learning-Assisted Wireless PHY Key Generation with Reconfigurable Intelligent Surfaces.",
                    "Multi-Agent Reinforcement Learning Approaches to RF Fingerprint Enhancement.",
                    "Poisoning Attack Anticipation in Mobile Crowdsensing: A Competitive Learning-Based Study.",
                    "RiftNeXt™: Explainable Deep Neural RF Scene Classification.",
                    "SWIPEGAN: Swiping Data Augmentation Using Generative Adversarial Networks for Smartphone User Authentication.",
                    "Variational Leakage: The Role of Information Complexity in Privacy Leakage."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "13th WISEC 2020",
        "info": "Linz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2020",
                "sub_name": "WiSec '20: 13th ACM Conference on Security and Privacy in Wireless and Mobile Networks, Linz, Austria, July 8-10, 2020.",
                "count": 30,
                "papers": [
                    "Kratos: multi-user multi-device-aware access control system for the smart home.",
                    "Hacksaw: biometric-free non-stop web authentication in an emerging world of wearables.",
                    "ivPair: context-based fast intra-vehicle device pairing for secure wireless connectivity.",
                    "Acoustic integrity codes: secure device pairing using short-range acoustic communication.",
                    "GNSS spoofing detection via opportunistic IRIDIUM signals.",
                    "MAVPro: ADS-B message verification for aviation security with minimal numbers of on-ground sensors.",
                    "SVM: secure vehicle motion verification with a single wireless receiver.",
                    "Zigator: analyzing the security of zigbee-enabled smart homes.",
                    "Truncate after preamble: PHY-based starvation attacks on IoT networks.",
                    "Countering cross-technology jamming attack.",
                    "MagicPairing: Apple's take on securing bluetooth peripherals.",
                    "BaseSAFE: baseband sanitized fuzzing through emulation.",
                    "Analyzing the attack landscape of Zigbee-enabled IoT systems and reinstating users' privacy.",
                    "An empirical study of potentially malicious third-party libraries in Android apps.",
                    "Protecting wi-fi beacons from outsider forgeries.",
                    "Practical operation extraction from electromagnetic leakage for side-channel analysis and reverse engineering.",
                    "Secure and user-friendly over-the-air firmware distribution in a portable faraday cage.",
                    "Lost and found: stopping bluetooth finders from leaking private information.",
                    "iRyP: a purely edge-based visual privacy-respecting system for mobile cameras.",
                    "Peek-a-boo: i see your smart home activities, even encrypted!",
                    "Process skew: fingerprinting the process for anomaly detection in industrial control systems.",
                    "BrokenStrokes: on the (in)security of wireless keyboards.",
                    "Spotr: GPS spoofing detection via device fingerprinting.",
                    "Fingerprinting encrypted voice traffic on smart speakers with deep learning.",
                    "Protecting location privacy from untrusted wireless service providers.",
                    "Valkyrie: a generic framework for verifying privacy provisions in wireless networks.",
                    "A plug-n-play game theoretic framework for defending against radio window attacks.",
                    "Paging storm attacks against 4G/LTE networks from regional Android botnets: rationale, practicality, and implications.",
                    "ChirpOTLE: a framework for practical LoRaWAN security evaluation.",
                    "Security in terahertz WLANs with Leaky wave antennas."
                ]
            },
            {
                "sub_name_abbr": "conf/wisec/2020wiseml",
                "sub_name": "Proceedings of the 2nd ACM Workshop on Wireless Security and Machine Learning, WiseML@WiSec 2020, Linz, Austria, July 13, 2020.",
                "count": 14,
                "papers": [
                    "Generative adversarial attacks against intrusion detection systems using active learning.",
                    "Open set recognition through unsupervised and class-distance learning.",
                    "Adversarial machine learning based partial-model attack in IoT.",
                    "Wideband spectral monitoring using deep learning.",
                    "Machine learning-driven intrusion detection for Contiki-NG-based IoT networks exposed to NSL-KDD dataset.",
                    "Data augmentation with conditional GAN for automatic modulation classification.",
                    "Algorithm selection framework for cyber attack detection.",
                    "Investigating a spectral deception loss metric for training machine learning-based evasion attacks.",
                    "Generalized wireless adversarial deep learning.",
                    "Encrypted rich-data steganography using generative adversarial networks.",
                    "Over-the-air membership inference attacks as privacy threats for deep learning-based wireless signal classifiers.",
                    "A network security classifier defense: against adversarial machine learning attacks.",
                    "Deep learning based wiretap coding via mutual information estimation.",
                    "Detecting acoustic backdoor transmission of inaudible messages using deep learning."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "12th WISEC 2019",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2019",
                "sub_name": "Proceedings of the 12th Conference on Security and Privacy in Wireless and Mobile Networks, WiSec 2019, Miami, Florida, USA, May 15-17, 2019.",
                "count": 60,
                "papers": [
                    "Insecure connection bootstrapping in cellular networks: the root of all evil.",
                    "Drive me not: GPS spoofing detection via cellular network: (architectures, models, and experiments).",
                    "Digital radio signal cancellation attacks: an experimental evaluation.",
                    "Protecting mobile devices from physical memory attacks with targeted encryption.",
                    "Advancing remote attestation via computer-aided formal verification of designs and synthesis of executables: opinion.",
                    "deWristified: handwriting inference using wrist-based motion sensors revisited.",
                    "2FA-PP: 2nd factor phishing prevention.",
                    "Crowdsourced measurements for device fingerprinting.",
                    "Physical layer plausibility checks for misbehavior detection in V2X networks.",
                    "Characterizing security and privacy practices in emerging digital credit applications.",
                    "Clicktok: click fraud detection using traffic analysis.",
                    "Indraj: digital certificate enrollment for battery-powered wireless devices.",
                    "HomeSnitch: behavior transparency and control for smart home IoT devices.",
                    "Blinded and confused: uncovering systemic flaws in device telemetry for smart-home internet of things.",
                    "ARF: identifying re-delegation vulnerabilities in Android system services.",
                    "Fatal attraction: identifying mobile devices through electromagnetic emissions.",
                    "Scaling pseudonymous authentication for large mobile systems.",
                    "Inside job: diagnosing bluetooth lower layers using off-the-shelf devices.",
                    "Deployment optimization of IoT devices through attack graph analysis.",
                    "Factors influencing users to use unsecured wi-fi networks: evidence in the wild.",
                    "Hestia: simple least privilege network policies for smart homes.",
                    "New vulnerabilities in 4G and 5G cellular access network protocols: exposing device capabilities.",
                    "Quantum distance bounding.",
                    "SurFi: detecting surveillance camera looping attacks with wi-fi channel state information.",
                    "Distance bounding under different assumptions: opinion.",
                    "Lost traffic encryption: fingerprinting LTE/4G traffic on layer two.",
                    "LTE security disabled: misconfiguration in commercial networks.",
                    "Thermal covert channel in bluetooth low energy networks.",
                    "Secrets in the sky: on privacy and infrastructure security in DVB-S satellite broadband.",
                    "Post-quantum cryptography and 5G security: tutorial.",
                    "A cost-effective anomaly detection system using in-DRAM working set of active flows table: poster.",
                    "Analyzing endpoints in the internet of things malware: poster.",
                    "Breaking graph-based IoT malware detection systems using adversarial examples: poster.",
                    "Himiko: A human interface for monitoring and inferring knowledge on bluetooth-low-energy objects: demo.",
                    "Wireless attacks on aircraft landing systems: demo.",
                    "A deep learning method for fraud detection in financial systems: poster.",
                    "RF based entropy sources for jamming resilience: poster.",
                    "Ensemble malware analysis for evaluating the integrity of mission critical devices poster: poster.",
                    "Biometric data transformation for cryptographic domains and its application: poster.",
                    "Cardiac biometrics for continuous and non-contact mobile authentication: poster.",
                    "Are you secure in your car?: poster.",
                    "Secure THz communication with multiplexed orbital angular momentum beams: poster.",
                    "Enclave-based privacy-preserving localization: poster.",
                    "Deep learning approach to detect malicious attacks at system level: poster.",
                    "Privacy preserving distributed matching for device-to-device IoT communications: poster.",
                    "Basebads: Automated security analysis of baseband firmware: poster.",
                    "Deep-evasion: Turn deep neural network into evasive self-contained cyber-physical malware: poster.",
                    "Security, privacy, and ethical concerns on human radio-frequency identification (RFID) implants: poster.",
                    "Exposing the location of anonymous solar-powered homes: poster.",
                    "Attacking HDMI distribution networks: poster.",
                    "Dynamically detecting USB attacks in hardware: poster.",
                    "Investigation of cookie vulnerabilities: poster.",
                    "A digital forensics framework for smart settings: poster.",
                    "Performance evaluation of key management schemes for wireless legacy smart grid environments: poster.",
                    "Preserving privacy of drone videos using proxy re-encryption technique: poster.",
                    "IoT devices discovery and identification using network traffic data: poster.",
                    "Using bluetooth low energy spoofing to dispute device details: demo.",
                    "False data injection attacks against contingency analysis in power grids: poster.",
                    "Analysis and parsing of unstructured cyber-security incident data: poster.",
                    "On the overhead of using zero-knowledge proofs for electric vehicle authentication: poster."
                ]
            },
            {
                "sub_name_abbr": "conf/wisec/2019wiseml",
                "sub_name": "Proceedings of the ACM Workshop on Wireless Security and Machine Learning, WiseML@WiSec 2019, Miami, Florida, USA, May 14, 2019.",
                "count": 13,
                "papers": [
                    "Robust Signal Classification Using Siamese Networks.",
                    "Targeted Adversarial Examples Against RF Deep Classifiers.",
                    "Generative Adversarial Radio Spectrum Networks.",
                    "Threat is in the Air: Machine Learning for Wireless Network Applications.",
                    "Towards Adversarial and Unintentional Collisions Detection Using Deep Learning.",
                    "On the Limitations of Targeted Adversarial Evasion Attacks Against Deep Learning Enabled Modulation Recognition.",
                    "Machine Learning-based Prevention of Battery-oriented Illegitimate Task Injection in Mobile Crowdsensing.",
                    "Efficient Power Adaptation against Deep Learning Based Predictive Adversaries.",
                    "Jammer Detection based on Artificial Neural Networks: A Measurement Study.",
                    "RAPID: Real-time Anomaly-based Preventive Intrusion Detection.",
                    "Generative Adversarial Network for Wireless Signal Spoofing.",
                    "Wireless Network Virtualization by Leveraging Blockchain Technology and Machine Learning.",
                    "Detecting Drones Status via Encrypted Traffic Analysis."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "11th WISEC 2018",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2018",
                "sub_name": "Proceedings of the 11th ACM Conference on Security & Privacy in Wireless and Mobile Networks, WiSec 2018, Stockholm, Sweden, June 18-20, 2018.",
                "count": 40,
                "papers": [
                    "Passwords in the Air: Harvesting Wi-Fi Credentials from SmartCfg Provisioning.",
                    "Beam-Stealing: Intercepting the Sector Sweep to Launch Man-in-the-Middle Attacks on Wireless IEEE 802.11ad Networks.",
                    "I Send, Therefore I Leak: Information Leakage in Low-Power Wide Area Networks.",
                    "Operating Channel Validation: Preventing Multi-Channel Man-in-the-Middle Attacks Against Protected Wi-Fi Networks.",
                    "SRide: A Privacy-Preserving Ridesharing System.",
                    "WADAC: Privacy-Preserving Anomaly Detection and Attack Classification on Wireless Traffic.",
                    "Tracking Private Browsing Sessions using CPU-based Covert Channels.",
                    "On the Impact of Rogue Base Stations in 4G/LTE Self Organizing Networks.",
                    "LTE Misbehavior Detection in Wi-Fi/LTE Coexistence Under the LAA-LTE Standard.",
                    "Listening Watch: Wearable Two-Factor Authentication using Speech Signals Resilient to Near-Far Attacks.",
                    "Towards Inferring Mechanical Lock Combinations using Wrist-Wearables as a Side-Channel.",
                    "Hello, Is It Me You're Looking For?: Differentiating Between Human and Electronic Speakers for Voice Interface Security.",
                    "Interference Suppression in Bandwidth Hopping Spread Spectrum Communications.",
                    "An Algebraic Quality-Time-Advantage-Based Key Establishment Protocol.",
                    "Detecting smartphone state changes through a Bluetooth based timing attack.",
                    "Signal Jamming Attacks Against Communication-Based Train Control: Attack Impact and Countermeasure.",
                    "Efficient, Scalable, and Resilient Vehicle-Centric Certificate Revocation List Distribution in VANETs.",
                    "Threat Detection for Collaborative Adaptive Cruise Control in Connected Cars.",
                    "SWARD: A Secure WAke-up RaDio against Denial-of-Service on IoT devices.",
                    "Lightweight Message Authentication for Constrained Devices.",
                    "Questioning the security and efficiency of the ESIoT approach.",
                    "Opinion: Security Lifetime Labels - Overcoming Information Asymmetry in Security of IoT Consumer Products.",
                    "Towards Dynamically Monitoring Android Applications on Non-rooted Devices in the Wild.",
                    "SCAnDroid: Automated Side-Channel Analysis of Android APIs.",
                    "Automated Binary Analysis on iOS: A Case Study on Cryptographic Misuse in iOS Applications.",
                    "Android STAR: An Efficient Interaction-Preserving Record-Replay System For Messenger App Usage Surveillance.",
                    "My Magnetometer Is Telling You Where I've Been?: A Mobile Device Permissionless Location Attack.",
                    "On the Effect of Update Frequency on Geo-Indistinguishability of Mobility Traces.",
                    "WLAN Device Fingerprinting using Channel State Information (CSI).",
                    "Privacy Preservation through Uniformity.",
                    "Hardened Registration Process for Participatory Sensing.",
                    "Expedited Beacon Verification for VANET.",
                    "Analysis of the Effect of the Distance-Decreasing Attacks on GNSS Authenticated Signals.",
                    "Increasing Mix-Zone Efficacy for Pseudonym Change in VANETs using Chaff Messages.",
                    "Android Escalation Paths: Building Attack-Graphs from SEAndroid Policies.",
                    "An Offline Dictionary Attack against zkPAKE Protocol.",
                    "Towards Battery-free Radio Tomographic Imaging.",
                    "Security on Harvested Power.",
                    "One-Sided Countermeasures for Side-Channel Attacks Can Backfire.",
                    "VPKIaaS: A Highly-Available and Dynamically-Scalable Vehicular Public-Key Infrastructure."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "10. WISEC 2017",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2017",
                "sub_name": "Proceedings of the 10th ACM Conference on Security and Privacy in Wireless and Mobile Networks, WiSec 2017, Boston, MA, USA, July 18-20, 2017.",
                "count": 40,
                "papers": [
                    "User authentication and identification from user interface interactions on touch-enabled devices.",
                    "Using hover to compromise the confidentiality of user input on Android.",
                    "UiRef: analysis of sensitive user inputs in Android applications.",
                    "Towards continuous and passive authentication across mobile devices: an empirical study.",
                    "Quantifying the reflective DDoS attack capability of household IoT devices.",
                    "Power-positive networking using wireless charging: protecting energy against battery exhaustion attacks.",
                    "Physical-layer fingerprinting of LoRa devices using supervised and zero-shot learning.",
                    "SeED: secure non-interactive attestation for embedded devices.",
                    "SCAPI: a scalable attestation protocol to detect software and physical attacks.",
                    "Anonymous attestations made practical.",
                    "HYDRA: hybrid design for remote attestation (using a formally verified microkernel).",
                    "Massive reactive smartphone-based jamming using arbitrary waveforms and adaptive power control.",
                    "HanGuard: SDN-driven protection of smart home WiFi devices from malicious mobile apps.",
                    "Unity is strength!: combining attestation and measurements inspection to handle malicious data injections in WSNs.",
                    "Binary hash tree based certificate access management for connected vehicles.",
                    "Advancing attacker models of satellite-based localization systems: the case of multi-device attackers.",
                    "PHY-layer security is no alternative to cryptography.",
                    "Geosocial query with user-controlled privacy.",
                    "Coresident evil: noisy vibrational pairing in the face of co-located acoustic eavesdropping.",
                    "An autonomic and permissionless Android covert channel.",
                    "YELP: masking sound-based opportunistic attacks in zero-effort deauthentication.",
                    "Trashing IMSI catchers in mobile networks.",
                    "ESIoT: enabling secure management of the internet of things.",
                    "Insecure to the touch: attacking ZigBee 3.0 via touchlink commissioning.",
                    "Breaking and fixing the HB+DB protocol.",
                    "There are many apps for that: quantifying the availability of privacy-preserving apps.",
                    "Resilient privacy protection for location-based services through decentralization.",
                    "Challenges to PHY anonymity for wi-fi.",
                    "Reliability model for multimedia cloud networks: poster.",
                    "Secure infotainment infrastructure of connected car: poster.",
                    "CrowdZen privacy: poster.",
                    "Scalable privacy: poster.",
                    "Bloom filter based certificate validation for VANET: poster.",
                    "TTPP method for validation of k-anonymity on wi-fi association log data: poster.",
                    "Highly-accurate rogue access point detection using intentional channel interference: poster.",
                    "Two-level network monitoring and management in WLAN using software-defined networking: poster.",
                    "Toward secure and efficient attestation for highly dynamic swarms: poster.",
                    "A roaming-based denial of service attack on LTE networks: poster.",
                    "Demonstrating reactive smartphone-based jamming: demo.",
                    "Railway bridge health monitoring system using smart wireless sensor network: demo."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "9. WISEC 2016",
        "info": "Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2016",
                "sub_name": "Proceedings of the 9th ACM Conference on Security & Privacy in Wireless and Mobile Networks, WISEC 2016, Darmstadt, Germany, July 18-22, 2016.",
                "count": 32,
                "papers": [
                    "The Ultimate Frontier for Privacy and Security: Medicine.",
                    "Fingerprinting Wi-Fi Devices Using Software Defined Radios.",
                    "Defeating MAC Address Randomization Through Timing Attacks.",
                    "Profiling the Strength of Physical-Layer Security: A Study in Orthogonal Blinding.",
                    "Interleaving Jamming in Wi-Fi Networks.",
                    "Trust The Wire, They Always Told Me!: On Practical Non-Destructive Wire-Tap Attacks Against Ethernet.",
                    "Exploiting Data-Usage Statistics for Website Fingerprinting Attacks on Android.",
                    "Can Android Applications Be Identified Using Only TCP/IP Headers of Their Launch Time Traffic?",
                    "Slogger: Smashing Motion-based Touchstroke Logging with Transparent System Noise.",
                    "Don't Touch that Column: Portable, Fine-Grained Access Control for Android's Native Content Providers.",
                    "Shatter: Using Threshold Cryptography to Protect Single Users with Multiple Devices.",
                    "Vibreaker: Securing Vibrational Pairing with Deliberate Acoustic Noise.",
                    "Constructive and Destructive Aspects of Adaptive Wormholes for the 5G Tactile Internet.",
                    "A Prover-Anonymous and Terrorist-Fraud Resistant Distance-Bounding Protocol.",
                    "Secure Motion Verification using the Doppler Effect.",
                    "More Semantics More Robust: Improving Android Malware Classifiers.",
                    "Evading Android Runtime Analysis Through Detecting Programmed Interactions.",
                    "Detecting SMS Spam in the Age of Legitimate Bulk Messaging.",
                    "DARPA: Device Attestation Resilient to Physical Attacks.",
                    "Dissecting Customized Protocols: Automatic Analysis for Customized Protocols based on IEEE 802.15.4.",
                    "Smart-Phones Attacking Smart-Homes.",
                    "DEMO: Demonstrating Practical Known-Plaintext Attacks against Physical Layer Security in Wireless MIMO Systems.",
                    "DEMO: Far Away and Yet Nearby - A Framework for Practical Distance Fraud on Proximity Services for Mobile Devices.",
                    "DEMO: Panoptiphone: How Unique is Your Wi-Fi Device?",
                    "DEMO: Using NexMon, the C-based WiFi firmware modification framework.",
                    "POSTER: Assessing the Impact of 802.11 Vulnerabilities using Wicability.",
                    "POSTER: Design Ideas for Privacy-aware User Interfaces for Mobile Devices.",
                    "POSTER: Experimental Analysis of Popular Anonymous, Ephemeral, and End-to-End Encrypted Apps.",
                    "POSTER: Exploiting Dynamic Partial Reconfiguration for Improved Resistance Against Power Analysis Attacks on FPGAs.",
                    "POSTER: Friend or Foe? Context Authentication for Trust Domain Separation in IoT Environments.",
                    "POSTER: Security Design Patterns With Good Usability.",
                    "POSTER: Toward a Secure and Scalable Attestation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "8. WISEC 2015",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2015",
                "sub_name": "Proceedings of the 8th ACM Conference on Security & Privacy in Wireless and Mobile Networks, New York, NY, USA, June 22-26, 2015.",
                "count": 34,
                "papers": [
                    "Lockpicking physical layer key exchange: weak adversary models invite the thief.",
                    "UWB rapid-bit-exchange system for distance bounding.",
                    "HB+DB, mitigating man-in-the-middle attacks against HB+ with distance bounding.",
                    "Freedom of speech: thwarting jammers via a probabilistic approach.",
                    "DroidJust: automated functionality-aware privacy leakage analysis for Android applications.",
                    "CICC: a fine-grained, semantic-aware, and transparent approach to preventing permission leaks for Android permission managers.",
                    "A measurement study of tracking in paid mobile applications.",
                    "How talkative is your mobile device?: an experimental study of Wi-Fi probe requests.",
                    "DroidEagle: seamless detection of visually similar Android apps.",
                    "AppWatcher: unveiling the underground market of trading mobile app reviews.",
                    "Securacy: an empirical investigation of Android applications' network usage, privacy and security.",
                    "Security and system architecture: comparison of Android customizations.",
                    "Injection attacks on 802.11n MAC frame aggregation.",
                    "A practical investigation of identity theft vulnerabilities in Eduroam.",
                    "Danger is my middle name: experimenting with SSL vulnerabilities in Android apps.",
                    "SHIELD: a data verification framework for participatory sensing systems.",
                    "Liveness verifications for citizen journalism videos.",
                    "How far removed are you?: scalable privacy-preserving estimation of social path length with Social PaL.",
                    "A framework for evaluating pseudonym strategies in vehicular ad-hoc networks.",
                    "Device-to-identity linking attack using targeted wi-fi geolocation spoofing.",
                    "CAPS: context-aware privacy scheme for VANET safety applications.",
                    "Is your commute driving you crazy?: a study of misbehavior in vehicular platoons.",
                    "Harvesting developer credentials in Android apps.",
                    "TextLogger: inferring longer inputs on touch screen using motion sensors.",
                    "WeChecker: efficient and precise detection of privilege escalation vulnerabilities in Android apps.",
                    "Applying the protection goals for privacy engineering to mobile devices.",
                    "NFCGate: an NFC relay application for Android.",
                    "A hybrid approach for mobile security threat analysis.",
                    "Security by mobility in location and track verification.",
                    "Study of compliance of Android location APIs with Geopriv.",
                    "SpotShare and nearbyPeople: applications of the Social PaL framework.",
                    "Physical layer location privacy issue in wireless small cell networks.",
                    "SVM-based malware detection for Android applications.",
                    "Device analyzer: a privacy-aware platform to support research on the Android ecosystem."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "7. WISEC 2014",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2014",
                "sub_name": "7th ACM Conference on Security & Privacy in Wireless and Mobile Networks, WiSec'14, Oxford, United Kingdom, July 23-25, 2014.",
                "count": 26,
                "papers": [
                    "Baton: certificate agility for android's decentralized signing infrastructure.",
                    "NativeWrap: ad hoc smartphone application creation for end users.",
                    "ViewDroid: towards obfuscation-resilient mobile application repackaging detection.",
                    "On mobile malware infections.",
                    "SPPEAR: security & privacy-preserving architecture for participatory-sensing applications.",
                    "Short paper: MVSec: secure and easy-to-use pairing of mobile devices with vehicles.",
                    "Short paper: a dangerous 'pyrotechnic composition': fireworks, embedded wireless and insecurity-by-design.",
                    "Short paper: speaking the local dialect: exploiting differences between ieee 802.15.4 receivers with commodity radios for fingerprinting, targeted attacks, and wids evasion.",
                    "Violating privacy through walls by passive monitoring of radio windows.",
                    "Short paper: \"here i am, now pay me!\": privacy concerns in incentivised location-sharing systems.",
                    "Practical privacy-preserving location-sharing based services with aggregate statistics.",
                    "Short paper: detection of GPS spoofing attacks in power grids.",
                    "Gaining insight on friendly jamming in a real-world IEEE 802.11 network.",
                    "Power napping with loud neighbors: optimal energy-constrained jamming and anti-jamming.",
                    "Friendly CryptoJam: a mechanism for securing physical-layer attributes.",
                    "Duet: library integrity verification for android applications.",
                    "GroupTie: toward hidden collusion group discovery in app stores.",
                    "NativeGuard: protecting android applications from third-party native libraries.",
                    "Short paper: attacking and defending lightweight PHY security schemes for wireless communications.",
                    "Short paper: gathering tamper evidence in wi-fi networks based on channel state information.",
                    "Short paper: exploiting WPA2-enterprise vendor implementation weaknesses through challenge response oracles.",
                    "Short paper: extrapolation and prediction of user behaviour from wireless home automation communication.",
                    "Single-stroke language-agnostic keylogging using stereo-microphones and domain specific machine learning.",
                    "Short paper: CHIPS: content-based heuristics for improving photo privacy for smartphones.",
                    "Enabling BYOD through secure meta-market.",
                    "Short paper: WifiLeaks: underestimated privacy implications of the access_wifi_state android permission."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "6. WISEC 2013",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2013",
                "sub_name": "Sixth ACM Conference on Security and Privacy in Wireless and Mobile Networks, WISEC'13, Budapest, Hungary, April 17-19, 2013.",
                "count": 26,
                "papers": [
                    "A pilot study on the security of pattern screen-lock methods and soft side channel attacks.",
                    "Who do you sync you are?: smartphone fingerprinting via application behaviour.",
                    "MAST: triage for market-scale mobile malware analysis.",
                    "Tap-Wave-Rub: lightweight malware prevention for smartphones using intuitive human gestures.",
                    "Counter-jamming using mixed mechanical and software interference cancellation.",
                    "Detection of reactive jamming in DSSS-based wireless networks.",
                    "Selfish manipulation of cooperative cellular communications via channel fabrication.",
                    "6LoWPAN fragmentation attacks and mitigation mechanisms.",
                    "ETA: efficient and tiny and authentication for heterogeneous wireless systems.",
                    "GPS+: a back-end coupons identification for low-cost RFID.",
                    "The weakness of integrity protection for LTE.",
                    "Perfect contextual information privacy in WSNs undercolluding eavesdroppers.",
                    "SnapMe if you can: privacy threats of other peoples' geo-tagged media and what we can do about it.",
                    "Differential privacy in intelligent transportation systems.",
                    "Private proximity testing with an untrusted server.",
                    "Securing the IP-based internet of things with HIP and DTLS.",
                    "Revisiting lightweight authentication protocols based on hard learning problems.",
                    "SeDyA: secure dynamic aggregation in VANETs.",
                    "Adversarial testing of wireless routing implementations.",
                    "Entropy harvesting from physical sensors.",
                    "ASK-BAN: authenticated secret key extraction utilizing channel characteristics for body area networks.",
                    "Chorus: scalable in-band trust establishment for multiple constrained devices over the insecure wireless channel.",
                    "Countermeasures against sybil attacks in WSN based on proofs-of-work.",
                    "Energy attacks and defense techniques for wireless systems.",
                    "Subtle kinks in distance-bounding: an analysis of prominent protocols.",
                    "Efficient, secure, private distance bounding without key updates."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "5. WISEC 2012",
        "info": "Tucson, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2012",
                "sub_name": "Proceedings of the Fifth ACM Conference on Security and Privacy in Wireless and Mobile Networks, WISEC 2012, Tucson, AZ, USA, April 16-18, 2012.",
                "count": 19,
                "papers": [
                    "Toward a healthy wireless privacy ecosystem.",
                    "On the capacity of rate-adaptive packetized wireless communication links under jamming.",
                    "Physical-layer attacks on chirp-based ranging systems.",
                    "BANA: body area network authentication exploiting channel characteristics.",
                    "Zero reconciliation secret key generation for body-worn health monitoring devices.",
                    "Location-aware and safer cards: enhancing RFID security and privacy via location sensing.",
                    "A privacy-restoring mechanism for offline RFID systems.",
                    "Private communication detection: a stochastic approach.",
                    "Detection of malicious packet dropping in wireless ad hoc networks based on privacy-preserving public auditing.",
                    "Security for cyber-physical systems: case studies with medical devices, robots, and automobiles.",
                    "Unsafe exposure analysis of mobile in-app advertisements.",
                    "TapLogger: inferring user inputs on smartphone touchscreens using on-board motion sensors.",
                    "DroidChecker: analyzing android applications for capability leak.",
                    "Design of SMS commanded-and-controlled and P2P-structured mobile botnets.",
                    "Tetherway: a framework for tethering camouflage.",
                    "Wireless security techniques for coordinated manufacturing and on-line hardware trojan detection.",
                    "CHECKER: on-site checking in RFID-based supply chains.",
                    "Entropy attacks and countermeasures in wireless network coding.",
                    "Congestion lower bounds for secure in-network aggregation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "4. WISEC 2011",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2011",
                "sub_name": "Proceedings of the Fourth ACM Conference on Wireless Network Security, WISEC 2011, Hamburg, Germany, June 14-17, 2011.",
                "count": 20,
                "papers": [
                    "The communication and computation cost of wireless security: extended abstract.",
                    "Short paper: the NetSANI framework for analysis and fine-tuning of network trace sanitization.",
                    "Epidemic data survivability in unattended wireless sensor networks.",
                    "Short paper: PEPSI - privacy-enhanced participatory sensing infrastructure.",
                    "Thwarting inside jamming attacks on wireless broadcast communications.",
                    "Short paper: Jamming-resilient multipath routing leveraging availability-based correlation.",
                    "Short paper: reactive jamming in wireless networks: how realistic is the threat?",
                    "Short paper: security evaluation of IEEE 802.11w specification.",
                    "Inferring users' online activities through traffic analysis.",
                    "Interactive decryption of DECT phone calls.",
                    "Cryptographic link signatures for spectrum usage authentication in cognitive radio.",
                    "Short paper: ACE: authenticating the channel estimation process in wireless communication systems.",
                    "On the robustness of IEEE 802.11 rate adaptation algorithms against smart jamming.",
                    "Short paper: lightweight remote attestation using physical functions.",
                    "Accelerometers and randomness: perfect together.",
                    "Address space randomization for mobile devices.",
                    "Short paper: a new identity-based DH key-agreement protocol for wireless sensor networks based on the Arazi-Qi scheme.",
                    "How secret-sharing can defeat terrorist fraud.",
                    "Short paper: a practical view of \"mixing\" identities in vehicular networks.",
                    "Efficient and secure threshold-based event validation for VANETs."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "3. WISEC 2010",
        "info": "Hoboken, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2010",
                "sub_name": "Proceedings of the Third ACM Conference on Wireless Network Security, WISEC 2010, Hoboken, New Jersey, USA, March 22-24, 2010.",
                "count": 22,
                "papers": [
                    "Timing-based localization of in-band wormhole tunnels in MANETs.",
                    "RFID survivability quantification and attack modeling.",
                    "Subverting MIMO wireless systems by jamming the channel estimation procedure.",
                    "Preventing multi-query attack in location-based services.",
                    "pBMDS: a behavior-based malware detection system for cellphone devices.",
                    "Efficient compromising resilient authentication schemes for large scale wireless sensor networks.",
                    "Low-cost untraceable authentication protocols for RFID.",
                    "A secure and scalable identification for hash-based RFID systems using updatable pre-computation.",
                    "On the tradeoff between trust and privacy in wireless ad hoc networks.",
                    "Automating the injection of believable decoys to detect snooping.",
                    "Providing security with insecure systems.",
                    "Attacks on physical-layer identification.",
                    "Zeroing-in on network metric minima for sink location determination.",
                    "Privacy-preserving computation of benchmarks on item-level data using RFID.",
                    "On the efficiency of secure beaconing in VANETs.",
                    "Effectiveness of distance-decreasing attacks against impulse radio ranging.",
                    "honeyM: a framework for implementing virtual honeyclients for mobile devices.",
                    "Secret keys from entangled sensor motes: implementation and analysis.",
                    "Efficient code diversification for network reprogramming in sensor networks.",
                    "Mobile user location-specific encryption (MULE): using your office as your password.",
                    "Secure walking GPS: a secure localization and key distribution scheme for wireless sensor networks.",
                    "On the reliability of wireless fingerprinting using clock skews."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "2. WISEC 2009",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2009",
                "sub_name": "Proceedings of the Second ACM Conference on Wireless Network Security, WISEC 2009, Zurich, Switzerland, March 16-19, 2009.",
                "count": 28,
                "papers": [
                    "On the application of pairing based cryptography to wireless sensor networks.",
                    "Asynchronous group key distribution on top of the cc2420 security mechanisms for sensor networks.",
                    "Certificate-based sequential aggregate signature.",
                    "A ROM-friendly secure code update mechanism for WSNs using a stateful-verifier tau-time signature scheme.",
                    "RFID-based supply chain partner authentication and key agreement.",
                    "Attacks and improvements to an RIFD mutual authentication protocol and its extensions.",
                    "A low-resource public-key identification scheme for RFID tags and sensor nodes.",
                    "Stealthy video capturer: a new video-based spyware in 3G smartphones.",
                    "Practical attacks against WEP and WPA.",
                    "An attacker model for MANET routing security.",
                    "A grammatical evolution approach to intrusion detection on mobile ad hoc networks.",
                    "REAct: resource-efficient accountability for nodemisbehavior in ad hoc networks based on random audits.",
                    "Practical defenses against pollution attacks in intra-flow network coding for wireless mesh networks.",
                    "Privacy-preserving 802.11 access-point discovery.",
                    "Link-layer protection in 802.11i WLANS with dummy authentication.",
                    "Mobi-watchdog: you can steal, but you can't run!",
                    "A coding-theoretic approach for efficient message verification over insecure channels.",
                    "Jamming for good: a fresh approach to authentic communication in WSNs.",
                    "Mitigating control-channel jamming attacks in multi-channel ad hoc networks.",
                    "Secure and precise location verification using distance bounding and simultaneous multilateration.",
                    "A practical secure neighbor verification protocol for wireless sensor networks.",
                    "Towards a theory for securing time synchronization in wireless sensor networks.",
                    "Self-healing control flow protection in sensor applications.",
                    "Evolutionary design of secrecy amplification protocols for wireless sensor networks.",
                    "Collaborative authentication in unattended WSNs.",
                    "A confidential and DoS-resistant multi-hop code dissemination protocol for wireless sensor networks.",
                    "FAIR: fuzzy-based aggregation providing in-network resilience for real-time wireless sensor networks.",
                    "Securing network access in wireless sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "1. WISEC 2008",
        "info": "Alexandria, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wisec/2008",
                "sub_name": "Proceedings of the First ACM Conference on Wireless Network Security, WISEC 2008, Alexandria, VA, USA, March 31 - April 02, 2008.",
                "count": 28,
                "papers": [
                    "RFID security: in the shoulder and on the loading dock.",
                    "Pre-authentication filters: providing dos resistance for signature-based broadcast authentication in sensor networks.",
                    "Defending against false-endorsement-based dos attacks in wireless sensor networks.",
                    "Wireless authentication using remote passwords.",
                    "Comparison of innovative signature algorithms for WSNs.",
                    "Wireless client puzzles in IEEE 802.11 networks: security by wireless.",
                    "Identifying unique devices through wireless fingerprinting.",
                    "Active behavioral fingerprinting of wireless devices.",
                    "A secure privacy-preserving roaming protocol based on hierarchical identity-based encryption for mobile networks.",
                    "An efficient integrity-preserving scheme for hierarchical sensor aggregation.",
                    "Towards event source unobservability with minimum network traffic in sensor networks.",
                    "Mitigating attacks against virtual coordinate based routing in wireless sensor networks.",
                    "Key management and secure software updates in wireless process control environments.",
                    "Slede: a domain-specific verification framework for sensor network security protocol implementations.",
                    "Minimum node degree and kappa-connectivity for key predistribution schemes and distributed sensor networks.",
                    "Mind your manners: socially appropriate wireless key establishment for groups.",
                    "Wireless and physical security via embedded sensor networks.",
                    "RFID authentication protocol for low-cost tags.",
                    "Body sensor network security: an identity-based cryptography approach.",
                    "Self-certified Sybil-free pseudonyms.",
                    "RFID security and privacy: long-term research or short-term tinkering?",
                    "A secure and resilient WSN roadside architecture for intelligent transport systems.",
                    "Towards self-propagate mal-packets in sensor networks.",
                    "Secure multi-hop network programming with multiple one-way key chains.",
                    "Attacks on time-of-flight distance bounding channels.",
                    "Anti-jamming timing channels for wireless networks.",
                    "Emergent properties: detection of the node-capture attack in mobile wireless sensor networks.",
                    "Simple and effective defense against evil twin access points."
                ]
            }
        ]
    }
]