[
    {
        "name": "ACTA",
        "year": "2022",
        "info": "Volume 59, 2022",
        "count": 4,
        "papers": [
            "Configurable verification of timed automata with discrete variables.",
            "Sound reasoning in tock-CSP.",
            "Session-based concurrency, declaratively.",
            "Finite automata with undirected state graphs."
        ]
    },
    {
        "name": "ACTA",
        "year": "2021",
        "info": "Volume 58, 2021",
        "count": 29,
        "papers": [
            "Static versus dynamic reversibility in CCS.",
            "Subsequence versus substring constraints in sequence pattern languages.",
            "A formal methods approach to predicting new features of the eukaryotic vesicle traffic system.",
            "Linear-bounded composition of tree-walking tree transducers: linear size increase and complexity.",
            "On deterministic sensing $5'\\rightarrow 3'$ Watson-Crick finite automata: a full hierarchy in 2detLIN.",
            "Aggregation-based minimization of finite state automata.",
            "A deterministic parsing algorithm for ambiguous regular expressions.",
            "Watson-Crick quantum finite automata.",
            "Preface to Martin Kutrib Festschrift.",
            "Natural language guided object retrieval in images.",
            "Reversible parallel communicating finite automata systems.",
            "Operational complexity and right linear grammars.",
            "On the number of active states in finite automata.",
            "Nilpotency and periodic points in non-uniform cellular automata.",
            "The descriptional power of queue automata of constant length.",
            "On the size of partial derivatives and the word membership problem.",
            "An instruction set for reversible Turing machines.",
            "Reversibility for stateless ordered RRWW-automata.",
            "A new class of the smallest FSSP partial solutions for 1D rings of length n=2k-1.",
            "A faster algorithm for the Birthday Song Singers Synchronization Problem (FSSP) in one-dimensional CA with multiple speeds.",
            "Complement for two-way alternating automata.",
            "Indecision and delays are the parents of failure - taming them algorithmically by synthesizing delay-resilient control.",
            "Team bisimilarity, and its associated modal logic, for BPP nets.",
            "Bitopological duality for algebras of Fitting's logic and natural duality extension.",
            "Equilibria for games with combined qualitative and quantitative objectives.",
            "DKL: an efficient algorithm for learning deterministic Kripke structures.",
            "Measuring the constrained reachability in quantum Markov chains.",
            "Correction to: Solving high-level Petri games.",
            "Correction to: A linear-time branching-time perspective on interface automata."
        ]
    },
    {
        "name": "ACTA",
        "year": "2020",
        "info": "Volume 57, 2020",
        "count": 33,
        "papers": [
            "Preface for the SYNT.",
            "Practical synthesis of reactive systems from LTL specifications via parity games.",
            "Performance heuristics for GR(1) synthesis and related algorithms.",
            "A symbolic algorithm for lazy synthesis of eager strategies.",
            "Reactive synthesis with maximum realizability of linear temporal logic specifications.",
            "Synthesis from hyperproperties.",
            "Programming by predicates: a formal model for interactive synthesis.",
            "Synthesizing optimally resilient controllers.",
            "Automated formal synthesis of provably safe digital controllers for continuous plants.",
            "Safety synthesis for incrementally stable switched systems using discretization-free multi-resolution abstractions.",
            "Parameterized synthesis of self-stabilizing protocols in symmetric networks.",
            "Preface.",
            "Synchronous and asynchronous communication(s) between three parties.",
            "My time with Rob.",
            "Out for coffee: with Rob.",
            "Congruence from the operator's point of view.",
            "All congruences below stability-preserving fair testing or CFFD.",
            "Arithmetical datatypes with true fractions.",
            "Translating between models of concurrency.",
            "Coupled similarity: the first 32 years.",
            "On the probabilistic bisimulation spectrum with silent moves.",
            "A linear-time branching-time perspective on interface automata.",
            "Off-the-shelf automated analysis of liveness properties for just paths.",
            "Solving high-level Petri games.",
            "SMT-based generation of symbolic automata.",
            "Minimal consistent DFA from sample strings.",
            "Characteristic invariants in Hennessy-Milner logic.",
            "A complete axiomatization of weighted branching bisimulation.",
            "Transducer degrees: atoms, infima and suprema.",
            "Preface to special issue: EXPRESS/SOS 2016 + 2017.",
            "Expressiveness of component-based frameworks: a study of the expressiveness of BIP.",
            "Using session types for reasoning about boundedness in the π-calculus.",
            "Correction to: Expressiveness of component-based frameworks: a study of the expressiveness of BIP."
        ]
    },
    {
        "name": "ACTA",
        "year": "2019",
        "info": "Volume 56, 2019",
        "count": 22,
        "papers": [
            "Symbolic checking of Fuzzy CTL on Fuzzy Program Graph.",
            "On path-controlled insertion-deletion systems.",
            "Petri nets are dioids: a new algebraic foundation for non-deterministic net theory.",
            "Negotiation as concurrency primitive.",
            "Verification of asynchronous systems with an unspecified component.",
            "Nested antichains for WS1S.",
            "Associative composition of components with double-sided interfaces.",
            "On the hardness of analyzing probabilistic programs.",
            "A generalised theory of Interface Automata, component compatibility and error.",
            "Equivalence checking of Petri net models of programs using static and dynamic cut-points.",
            "On the decidability of the existence of polyhedral invariants in transition systems.",
            "Red-black trees with constant update time.",
            "Depletable channels: dynamics, behaviour, and efficiency in network design.",
            "A Paxos based algorithm to minimize the overhead of process recovery in consensus.",
            "Weighted iterated linear control.",
            "Identity-based signatures in standard model.",
            "The model checking fingerprints of CTL operators.",
            "Parikh matrices for powers of words.",
            "Structural liveness of Petri nets is ExpSpace-hard and decidable.",
            "Reversible sessions with flexible choices.",
            "Distributive laws for monotone specifications.",
            "Using contracted solution graphs for solving reconfiguration problems."
        ]
    },
    {
        "name": "ACTA",
        "year": "2018",
        "info": "Volume 55, 2018",
        "count": 29,
        "papers": [
            "Sparsification and subexponential approximation.",
            "Conjunctive query containment over trees using schema information.",
            "Online edge coloring of paths and trees with a fixed number of colors.",
            "A new bound for the D0L language equivalence problem.",
            "Preface for the special issue GandALF 2015.",
            "Average-energy games.",
            "Parameterized linear temporal logics meet costs: still not costlier than LTL.",
            "Reachability analysis of reversal-bounded automata on series-parallel graphs.",
            "The complexity of counting models of linear-time temporal logic.",
            "Big data interpolation using functional representation.",
            "Generalized contexts for reaction systems: definition and study of dynamic causalities.",
            "A core calculus for dynamic delta-oriented programming.",
            "Algorithms for monitoring real-time properties.",
            "Factorisation of transition systems.",
            "Event algebra for transition systems composition application to timed automata.",
            "Parity game reductions.",
            "A first step in characterizing three-element codes.",
            "Preface for the special issue \"FM15\".",
            "Probabilistic bisimulation for realistic schedulers.",
            "Replication, refinement & reachability: complexity in dynamic condition-response graphs.",
            "Descending chains and narrowing on template abstract domains.",
            "Fast deterministic parsers for transition networks.",
            "Bounded choice-free Petri net synthesis: algorithmic issues.",
            "An analysis of the M $$^X$$ X /M/1 queue with multiple working vacations by GI/M/1 type Markov process.",
            "Preface for the special issue for ATVA 2015.",
            "Looking at mean payoff through foggy windows.",
            "TSO-to-TSO linearizability is undecidable.",
            "Hierarchical information and the synthesis of distributed strategies.",
            "Spanning the spectrum from safety to liveness."
        ]
    },
    {
        "name": "ACTA",
        "year": "2017",
        "info": "Volume 54, 2017",
        "count": 27,
        "papers": [
            "Special issue: Selected papers from the 26th International Conference on Concurrency Theory (CONCUR 2015).",
            "Reactive synthesis without regret.",
            "Assume-admissible synthesis.",
            "Pseudopolynomial iterative algorithm to solve total-payoff games and min-cost reachability games.",
            "A general account of coinduction up-to.",
            "Verification of population protocols.",
            "Dynamic Bayesian networks for formal verification of structured stochastic processes.",
            "Multiparty session types as coherence proofs.",
            "Characteristic bisimulation for higher-order session processes.",
            "Compositional schedulability analysis of real-time actor-based systems.",
            "Disjunctivity and other properties of sets of pseudo-bordered words.",
            "Regular and context-free nominal traces.",
            "Efficiently solving the Bin Packing problem through bio-inspired mobility.",
            "On the relations between Markov chain lumpability and reversibility.",
            "Reversible Watson-Crick automata.",
            "Signature-free asynchronous Byzantine systems: from multivalued to binary consensus with t< n/3, O(n2) messages, and constant time.",
            "Efficient and secure attribute-based signature for monotone predicates.",
            "Special issue: Synthesis and SYNT 2014.",
            "Symblicit algorithms for mean-payoff and shortest path in monotonic Markov decision processes.",
            "Precise parameter synthesis for stochastic biochemical systems.",
            "Model-checking iterated games.",
            "Safraless LTL synthesis considering maximal realizability.",
            "A theory of formal synthesis via inductive learning.",
            "Special issue of the 21st International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS 2015).",
            "Approximate counting in SMT and value estimation for probabilistic programs.",
            "Model checking the evolution of gene regulatory networks.",
            "Stateless model checking for TSO and PSO."
        ]
    },
    {
        "name": "ACTA",
        "year": "2016",
        "info": "Volume 53, 2016",
        "count": 27,
        "papers": [
            "Analysis of dual-hop and multiple relays cooperative truncated ARQ with relay selection in WSNs.",
            "Characterizations of k-comma codes and k-comma intercodes.",
            "Step traces.",
            "State complexity of deletion and bipolar deletion.",
            "Special issue on temporal representation and reasoning (TIME'13).",
            "Efficient execution of dynamically controllable simple temporal networks with uncertainty.",
            "Optimization in temporal qualitative constraint networks.",
            "A tool for deciding the satisfiability of continuous-time metric temporal logic.",
            "A complete classification of the expressiveness of interval logics of Allen's relations: the general and the dense cases.",
            "Extracting unsatisfiable cores for LTL via temporal resolution.",
            "Metric temporal logic revisited.",
            "Special issue on Rich Models, EU-COST Action IC0901 Rich-Model Toolkit.",
            "Symbolic automata for representing big code.",
            "Verification of heap manipulating programs with ordered data by extended forest automata.",
            "Guiding Craig interpolation with domain-specific abstractions.",
            "Synthesizing efficient systems in probabilistic environments.",
            "Optimal covers in the relational database model.",
            "Concurrent abstract state machines.",
            "A linear-time algorithm for the orbit problem over cyclic groups.",
            "On reversible Turing machines and their function universality.",
            "Special issue: selected papers from the 21st international symposium on temporal representations and reasoning (TIME-2014).",
            "Mining approximate interval-based temporal dependencies.",
            "Checking interval properties of computations.",
            "Metric propositional neighborhood logic with an equivalence relation.",
            "Planning and execution with flexible timelines: a formal account.",
            "Dynamic controllability via Timed Game Automata.",
            "Efficient processing of simple temporal networks with uncertainty: algorithms for dynamic controllability verification."
        ]
    },
    {
        "name": "ACTA",
        "year": "2015",
        "info": "Volume 52, 2015",
        "count": 25,
        "papers": [
            "Letter from the Managing Editor.",
            "Special issue on \"Combining Compositionality and Concurrency\": part 1.",
            "Revisiting causality, coalgebraically.",
            "Synthesis and reengineering of persistent systems.",
            "Revisiting bisimilarity and its modal logic for nondeterministic and probabilistic processes.",
            "Special issue on \"Comprehending asynchrony in specification and analysis\" dedicated to Walter Vogler on the occasion of his 60th birthday.",
            "Modal algebra and Petri nets.",
            "State space axioms for T-systems.",
            "Observable liveness of Petri nets.",
            "CCS: It's not fair! - Fair schedulers cannot be implemented in CCS-like languages even under progress and certain fairness assumptions.",
            "On constructibility and unconstructibility of LTS operators from other LTS operators.",
            "Moving from interface theories to assembly theories.",
            "Refinement checking on parametric modal transition systems.",
            "A life dedicated to informatics: an obituary for Prof. Friedrich L. Bauer.",
            "Special issue on \"Combining Compositionality and Concurrency\": part 2.",
            "Richer interface automata with optimistic and pessimistic compatibility.",
            "Compositional verification of asynchronous concurrent systems using CADP.",
            "Denotational fixed-point semantics for constructive scheduling of synchronous concurrency.",
            "Compositional construction of most general controllers.",
            "Some properties of involution binary relations.",
            "Contextual hyperedge replacement.",
            "Parametrized invariance for infinite state processes.",
            "Two-way pebble transducers for partial functions and their composition.",
            "Gray code orders for q-ary words avoiding a given factor.",
            "Deterministic ordered restarting automata for picture languages."
        ]
    },
    {
        "name": "ACTA",
        "year": "2014",
        "info": "Volume 51, 2014",
        "count": 20,
        "papers": [
            "Termination of nondeterministic quantum programs.",
            "Visibly rational expressions.",
            "Delay and energy efficiency analysis of multicast cooperative ARQ over wireless networks.",
            "On weighted first-order logics with discounting.",
            "An efficient simulation algorithm on Kripke structures.",
            "Editorial: special issue on synthesis.",
            "Strategy synthesis for multi-dimensional quantitative objectives.",
            "Efficient controller synthesis for a fragment of MTL0,∞.",
            "Synthesizing robust systems.",
            "Distributed synthesis for regular and contextfree specifications.",
            "General quantitative specification theories with modal transition systems.",
            "Forward and backward application of symbolic tree transducers.",
            "Controlled finite automata.",
            "Some kinds of primitive and non-primitive words.",
            "Formal communication elimination and sequentialization equivalence proofs for distributed system models.",
            "On the incremental growth and shrinkage of LR goto-graphs.",
            "Exploiting a hypergraph model for finding Golomb rulers.",
            "Parameterized complexity of three edge contraction problems with degree constraints.",
            "Trace- and failure-based semantics for responsiveness.",
            "Head and state hierarchies for unary multi-head finite automata."
        ]
    },
    {
        "name": "ACTA",
        "year": "2013",
        "info": "Volume 50, 2013",
        "count": 17,
        "papers": [
            "Accepting splicing systems with permitting and forbidding words.",
            "Step semantics of boolean nets.",
            "Networks of evolutionary processors: the power of subregular filters.",
            "Compositional type checking of delta-oriented software product lines.",
            "Infinitary rewriting: closure operators, equivalences and models.",
            "Avoiding cross-bifix-free binary words.",
            "Conjunctive grammars and alternating pushdown automata.",
            "Verifying a simplification of mutual exclusion by Lycklama-Hadzilacos.",
            "Deterministic pushdown-CD-systems of stateless deterministic R(1)-automata.",
            "Query optimization in information integration.",
            "On the hierarchy of distribution-sensitive properties for data structures.",
            "A distributed resource allocation algorithm for many processes.",
            "New proof for the undecidability of the circular PCP.",
            "Online multi-coloring on the path revisited.",
            "Judgmental subtyping systems with intersection types and modal types.",
            "A note on the factorization conjecture.",
            "Petri nets with name creation for transient secure association."
        ]
    },
    {
        "name": "ACTA",
        "year": "2012",
        "info": "Volume 49, 2012",
        "count": 24,
        "papers": [
            "An efficient algorithm for finding ideal schedules.",
            "Using transition set sequences to partition behaviors of petri nets.",
            "Equational weighted tree transformations.",
            "Erratum to: Avoidable binary patterns in partial words.",
            "Nonterminal complexity of one-sided random context grammars.",
            "A trace-based service semantics guaranteeing deadlock freedom.",
            "The identity problem of finitely generated bi-ideals.",
            "\"Backward\" coinduction, Nash equilibrium and the rationality of escalation.",
            "Instruction sequence processing operators.",
            "Least common container of tree pattern queries and its applications.",
            "Stochastic game logic.",
            "First-order logics: some characterizations and closure properties.",
            "On timed alternating simulation for concurrent timed games.",
            "Prefix-primitive annihilators of languages under some operations.",
            "An algorithmic study of switch graphs.",
            "Abstract reduction in directed model checking CCS processes.",
            "Algebras for iteration and infinite computations.",
            "Inefficiency of equilibria for the machine covering game on uniform machines.",
            "Finding vertex-surjective graph homomorphisms.",
            "On the power of enzymatic numerical P systems.",
            "Multi-tilde-bar expressions and their automata.",
            "Disjunctive languages related to p-primitive words.",
            "Distinguishing and relating higher-order and first-order processes by expressiveness.",
            "Does indirect addressing matter? - A note."
        ]
    },
    {
        "name": "ACTA",
        "year": "2011",
        "info": "Volume 48, 2011",
        "count": 19,
        "papers": [
            "Some properties of the disjunctive languages contained in Q.",
            "A characterization of rational D0L power series.",
            "Avoidable binary patterns in partial words.",
            "New bounds for the query complexity of an algorithm that learns DFAs with correction and equivalence queries.",
            "Efficient systematic clustering method for k-anonymization.",
            "Nonatomic dual bakery algorithm with bounded tokens.",
            "Testing for refinement in Circus.",
            "One-sided random context grammars.",
            "MAT learners for tree series: an abstract data type and two realizations.",
            "Refined typing to localize the impact of forced strictness on free theorems.",
            "Connectivity of workflow nets: the foundations of stepwise verification.",
            "A Markovian queue with varying number of servers and applications to the performance comparison of HSDPA user equipment.",
            "Multi-letter quantum finite automata: decidability of the equivalence and minimization of states.",
            "Finite optimal control for time-bounded reachability in CTMDPs and continuous-time Markov games.",
            "CHAP and rewrite components.",
            "Correct hardware synthesis - An algebraic approach.",
            "On α 2 - ν 2-products of automata.",
            "Solving a weak NP-complete problem in polynomial time by using mutual mobile membrane systems.",
            "The query complexity of estimating weighted averages."
        ]
    },
    {
        "name": "ACTA",
        "year": "2010",
        "info": "Volume 47, 2010",
        "count": 19,
        "papers": [
            "Automata-based verification of programs with tree updates.",
            "Symmetry and partial order reduction techniques in model checking Rebeca.",
            "M/M/1 retrial queue with working vacations.",
            "Embedding mappings and splittings with applications.",
            "On the observational theory of the CPS-calculus.",
            "Small universal accepting hybrid networks of evolutionary processors.",
            "Lifting non-finite axiomatizability results to extensions of process algebras.",
            "LR error repair using the A* algorithm.",
            "A note on autodense related languages.",
            "Quantum loop programs.",
            "On regular temporal logics with past.",
            "Reachability results for timed automata with unbounded data structures.",
            "Randomization adaptive self-stabilization.",
            "How to allocate review tasks for robust ranking.",
            "A note on pure codes.",
            "A theoretical comparison of LRU and LRU-K.",
            "Equilibria for two parallel links: the strong price of anarchy versus the price of anarchy.",
            "On stateless deterministic restarting automata.",
            "A note on prefix primitive words."
        ]
    },
    {
        "name": "ACTA",
        "year": "2009",
        "info": "Volume 46, 2009",
        "count": 26,
        "papers": [
            "On decidability of LTL model checking for process rewrite systems.",
            "Semi-synchronous transductions.",
            "Exploiting colored Petri nets to decide on permutation admissibility.",
            "A complexity tradeoff in ranking-function termination proofs.",
            "A queue based mutual exclusion algorithm.",
            "A theory of structural stationarity in the pi -Calculus.",
            "The time complexity of typechecking tree-walking tree transducers.",
            "Random walks for selected boolean implication and equivalence problems.",
            "Hardness of equivalence checking for composed finite-state systems.",
            "On the closure of pattern expressions languages under intersection with regular languages.",
            "Liveness of a mutex algorithm in a fair process algebra.",
            "A decomposition theorem for finite persistent transition systems.",
            "Semantics, calculi, and analysis for object-oriented specifications.",
            "The maximum gain of increasing the number of preemptions in multiprocessor scheduling.",
            "Correctness proof of a database replication protocol under the perspective of the I/O automaton model.",
            "A theory of ultimately periodic languages and automata with an application to time granularity.",
            "Final and sequential behaviours of M-automata.",
            "Machine structure oriented control code logic.",
            "Reasoning about faulty quantum programs.",
            "STG decomposition strategies in combination with unfolding.",
            "Preserving key in XML data transformation.",
            "On the power of deep pushdown stacks.",
            "On regular tree languages and deterministic pushdown automata.",
            "Early action in an Earley parser.",
            "Extended multi bottom-up tree transducers.",
            "Strongly transitive automata and the Cerný conjecture."
        ]
    },
    {
        "name": "ACTA",
        "year": "2008",
        "info": "Volume 45, 2008",
        "count": 21,
        "papers": [
            "Picture deformation.",
            "Adaptive sorting: an information theoretic perspective.",
            "A decision procedure for propositional projection temporal logic with infinite models.",
            "On-line graph coloring of P5-free graphs.",
            "Management of interval probabilistic data.",
            "Deciding probabilistic bisimilarity over infinite-state probabilistic systems.",
            "Two-dimensional packing with conflicts.",
            "The Boolean closure of linear context-free languages.",
            "Two-tier relaxed heaps.",
            "Applying relation algebra and Rel View to solve problems on orders and lattices.",
            "Weighted height of random trees.",
            "Relational structures model of concurrency.",
            "Algebraic reasoning for probabilistic action systems and while-loops.",
            "The fibers and range of reduction graphs in ciliates.",
            "Inference rules for proving the equivalence of recursive procedures.",
            "Modelling higher-order dual nondeterminacy.",
            "Regular autodense languages.",
            "A type safe state abstraction for coordination in Java -like languages.",
            "M-nets: a survey.",
            "Charting the completeness frontier of inference systems for multivalued dependencies.",
            "Scattered context grammars that erase nonterminals in a generalized k -limited way."
        ]
    },
    {
        "name": "ACTA",
        "year": "2007",
        "info": "Volume 44, 2007",
        "count": 23,
        "papers": [
            "Parallel LL parsing.",
            "An exact subexponential-time lattice algorithm for Asian options.",
            "On using data abstractions for model checking refinements.",
            "Parallel LL parsing.",
            "Decision problems for pushdown threads.",
            "Infinitary rewriting: meta-theory and convergence.",
            "A criterion for atomicity revisited.",
            "The syntactic monoid of hairpin-free languages.",
            "Recursive descent parsing for Boolean grammars.",
            "Improved matrix pair undecidability results.",
            "On the equivalence between FDs in XML and FDs in relations.",
            "Well-structured languages.",
            "View selection for real conjunctive queries.",
            "Dual unbounded nondeterminacy, recursion, and fixpoints.",
            "Translational lemmas for DLOGTIME-uniform circuits, alternating TMs, and PRAMs.",
            "A general exhaustive generation algorithm for Gray structures.",
            "Distributed Consensus, revisited.",
            "BRNGLR: a cubic Tomita-style GLR parsing algorithm.",
            "Recursive Petri nets.",
            "Solving #SAT using vertex covers.",
            "Synchronous cooperation for explicit multi-threading.",
            "Optimal semi-online algorithms for preemptive scheduling problems with inexact partial information.",
            "The complexity of satisfying constraints on databases of transactions."
        ]
    },
    {
        "name": "ACTA",
        "year": "2006",
        "info": "Volume 43, 2006/2007",
        "count": 24,
        "papers": [
            "Algebraic Correctness Proofs for Compiling Recursive Function Definitions with Strictness Information.",
            "Compositional Analysis of C/C++ Programs with VeriSoft.",
            "Fairness of Actions in System Computations.",
            "Solving HPP and SAT by P Systems with Active Membranes and Separation Rules.",
            "Throughput analysis in wireless networks with multiple users and multiple channels.",
            "Periods in Extensions of Words.",
            "Classifications of Dense Languages.",
            "Refinement verification of the lazy caching algorithm.",
            "Programmed grammars and their relation to the LBA problem.",
            "Distances in random digital search trees.",
            "Linearly bounded infinite graphs.",
            "Representing the integers with powers of 2 and 3.",
            "Merged processes: a new condensed representation of Petri net behaviour.",
            "On the number of nodes in universal networks of evolutionary processors.",
            "A semantic approach to optimize linear datalog programs.",
            "On the tree-transformation power of XSLT.",
            "Representation and uniformization of algebraic transductions.",
            "Verification conditions are code.",
            "Editorial: Hybrid Systems.",
            "Hybridization methods for the analysis of nonlinear systems.",
            "Symbolic models for control systems.",
            "Geometric analysis of nondeterminacy in dynamical systems.",
            "On Abelian 2-avoidable binary patterns.",
            "Fair ambients."
        ]
    },
    {
        "name": "ACTA",
        "year": "2005",
        "info": "Volume 42, 2005/2006",
        "count": 22,
        "papers": [
            "On-line coloring and cliques covering for KKs, t-free graphs.",
            "Enhanced prefetching and caching strategies for single- and multi-disk systems.",
            "N-dimensional versus (N-1)-dimensional connectivity testing of first-order queries to semi-algebraic sets.",
            "Exponentially decreasing number of operations in balanced trees.",
            "Types in concurrency.",
            "Genericity and the pi-calculus.",
            "MOMI: a calculus for mobile mixins.",
            "Subtyping for session types in the pi calculus.",
            "safeDpi: a language for controlling mobile code.",
            "Type-based information flow analysis for the pi-calculus.",
            "A general framework for types in graph rewriting.",
            "Refinement of actions for real-time concurrent systems with causal ambiguity.",
            "Embedding linear orders in grids.",
            "A typed encoding of boxed into safe ambients.",
            "Vector assignment schemes for asymmetric settings.",
            "Equivalences and optimizations in an expressive XSLT subset.",
            "Deep pushdown automata.",
            "Recognizability of graph and pattern languages.",
            "Splitting forward simulations to copewith liveness.",
            "Non uniform random generation of generalized Motzkin paths.",
            "Safe projections of binary data sets.",
            "Abstractions of data types."
        ]
    },
    {
        "name": "ACTA",
        "year": "2004",
        "info": "Volume 41, 2004/2005",
        "count": 23,
        "papers": [
            "Random sprouts as internet models, and Pólya processes.",
            "An axiomatization of graphs.",
            "Erratum: The size of random bucket trees via urn models.",
            "Maintaining mobile transactional consistency in hybrid broadcast environments.",
            "Project scheduling with irregular costs: complexity, approximability, and algorithms.",
            "Limit laws for terminal nodes in random circuits with restricted fan-out: a family of graphs generalizing binary search trees.",
            "Trading polarizations for labels in P systems with active membranes.",
            "P systems with symport/antiport simulating counter automata.",
            "Three-element codes with one d-primitive word.",
            "Type-based hot swapping of running modules.",
            "A deterministic skip list for k-dimensional range search.",
            "Hybrid networks of evolutionary processors are computationally complete.",
            "Fast allocation and deallocation with an improved buddy system.",
            "Families of automata characterizing context-sensitive languages.",
            "Preemptive online algorithms for scheduling with machine cost.",
            "Optimal recovery schemes in fault tolerant distributed computing.",
            "On the complexity of deciding typability in the relational algebra.",
            "The weakest specifunction.",
            "The stuttering principle revisited.",
            "Compiling quantum programs.",
            "A comprehensive database schema integration method based on the theory of formal concepts.",
            "pi-calculus with noisy channels.",
            "Online square and cube packing."
        ]
    },
    {
        "name": "ACTA",
        "year": "2003",
        "info": "Volume 40, 2003/2004",
        "count": 23,
        "papers": [
            "Extending the accommodating function.",
            "Pipelines: Modelling a software architecture through relations.",
            "Element distinctness on one-tape Turing machines: a complete solution.",
            "Canonical prefixes of Petri net unfoldings.",
            "Sticky-free and overhang-free DNA languages.",
            "Providing view synchrony for group communication services.",
            "A distributed QoS-Aware multicast routing protocol.",
            "Program reversals for evolutions with non-uniform step costs.",
            "Specification transformers: a predicate transformer approach to composition.",
            "A bi-criterion single-machine scheduling problem with learning considerations.",
            "Timed automata with urgent transitions.",
            "Self-embedded context-free grammars with regular counterparts.",
            "Optimal algorithms for semi-online preemptive scheduling problems on two uniform machines.",
            "A new natural structural congruence in the pi-calculus with replication.",
            "Past is for free: on the complexity of verifying linear temporal properties with past.",
            "Reducing non-determinism in right nulled GLR parsers.",
            "Trajectory-based codes.",
            "On the equivalence and rewriting of aggregate queries.",
            "Exhaustive generation of combinatorial objects by ECO.",
            "On the complexity of drawing trees nicely: corrigendum.",
            "Self-stabilizing group communication in directed networks.",
            "On best transitive approximations to simple graphs.",
            "Approximation schemes for the Min-Max Starting Time Problem."
        ]
    },
    {
        "name": "ACTA",
        "year": "2003",
        "info": "Volume 39, 2003",
        "count": 22,
        "papers": [
            "A top-down proof procedure for generalized data dependencies.",
            "Synchronized regular expressions.",
            "A functional approach for temporal × modal logics.",
            "Bin stretching revisited.",
            "Stochastic cooperative distributed grammar systems and random graphs.",
            "Edsger W. Dijkstra - Acta Informatica and Marktoberdorf.",
            "Fundamentals of control flow in workflows.",
            "Preference rankings in the face of uncertainty.",
            "Stepwise development of fair distributed systems.",
            "On Gurevich's theorem on sequential algorithms.",
            "Coincidental extension of scattered context languages.",
            "Reasoning about probabilistic sequential programs in a probabilistic logic.",
            "Adding inclusion dependencies to an object-oriented data model with uniqueness constraints.",
            "A word on 7 letters which is non-repetitive up to mod 5.",
            "Strong bisimilarity of simple process algebras: complexity lower bounds.",
            "Structural operational semantics and bounded nondeterminism.",
            "Networks of evolutionary processors.",
            "Towards action refinement for true concurrent real time.",
            "A note on pure and p-pure languages.",
            "Ideal preemptive schedules on two processors.",
            "A comparison of pebble tree transducers with macro tree transducers.",
            "Erratum: Coincidental extension of scattered context languages."
        ]
    },
    {
        "name": "ACTA",
        "year": "2001",
        "info": "Volume 38, 2001/2002",
        "count": 30,
        "papers": [
            "Category-theoretic fibration as an abstraction mechanism in information systems.",
            "Correctness of dataflow and systolic algorithms using algebras of streams.",
            "Timed tree automata with an application to temporal logic.",
            "Group weighted finite transducers.",
            "Tree-systems of morphisms.",
            "Process algebra with action dependencies.",
            "Minimally adequate teacher synthesizes statechart diagrams.",
            "The variance of the height of digital search trees.",
            "Axiomatising timed automata.",
            "Impurity measures in databases.",
            "Containment and disjointedness in partitioned normal form relations.",
            "An assertional criterion for atomicity.",
            "Object type constructors.",
            "Words, univalent factors, and boxes.",
            "Deriving and paraphrasing information grammars using object-oriented analysis models.",
            "A general procedure to check conjunctive query containment.",
            "Automatic verification of concurrent systems using a formula-based compositional approach.",
            "Relaxed red-black trees with group updates.",
            "On the non-approximability of points-to analysis.",
            "Bases for closed sets of implicants and implicates in temporal logic.",
            "Adding a path connectedness operator to FO+poly (linear).",
            "Formal properties of XML grammars and languages.",
            "Packing rectangles in a strip.",
            "Membrane systems with promoters/inhibitors.",
            "Generalized normal form for rewriting P systems.",
            "Comparing the worst-case efficiency of asynchronous systems with PAFAS.",
            "Gray visiting Motzkins.",
            "The size of random bucket trees via urn models.",
            "On the complexity of the identification problem in Hamming spaces.",
            "A quadratic speedup theorem for iterative arrays."
        ]
    },
    {
        "name": "ACTA",
        "year": "2000",
        "info": "Volume 37, 2000/2001",
        "count": 31,
        "papers": [
            "Semantics analysis through elementary meanings.",
            "Data structures for order-sensitive predicates in parallel nondeterministic systems.",
            "Accepting Zeno words: a way toward timed refinements.",
            "Computational complexity via programming languages: constant factors do matter.",
            "Efficiently building a parse tree from a regular expression.",
            "Some results on the Collatz problem.",
            "One-write algorithms for multivalued regular and atomic registers.",
            "The class Steiner minimal tree problem: a lower bound and test problem generation.",
            "Fair sticker languages.",
            "Letter from the Editor.",
            "Refinement of actions and equivalence notions for concurrent systems.",
            "Demonic, angelic and unbounded probabilistic choices in sequential programs.",
            "Analysis of range search for random k-d trees.",
            "A sequential real-time refinement calculus.",
            "Synchronized extension systems.",
            "'Closed Interval Process Algebra' versus 'Interval Process Algebra'.",
            "Parallel communicating grammar systems with terminal transmission.",
            "A theory of bunches.",
            "A construction of distributed reference counting.",
            "Periodic-like words, periodicity, and boxes.",
            "Efficient recognition algorithms for boundary and linear eNCE graph languages.",
            "Even faster generalized LR parsing.",
            "On the tree inclusion problem.",
            "Yet another generation of LALR parsers for regular right part grammars.",
            "Extending stratified datalog to capture complexity classes ranging from P to QH.",
            "Running a job on a collection of partly available machines, with on-line restarts.",
            "Relaxed balance for search trees with local rebalancing.",
            "A polynomial time computable metric between point sets.",
            "Recursion and Petri nets.",
            "Labelled transition logic: an outline.",
            "A Markov modulated multi-server queue with negative customers - The MM CPP/GE/c/L G-queue."
        ]
    },
    {
        "name": "ACTA",
        "year": "1999",
        "info": "Volume 36, 1999/2000",
        "count": 35,
        "papers": [
            "Transformational Design of Real-Time Systems Part I: From Requirements to Program Specifications.",
            "Transformational Design of Real-Time Systems. Part II: From Program Specifications to Programs.",
            "Towards a Theory of Consistency Enforcement.",
            "An Optimal Algorithm for Solving the Searchlight Guarding Problem on Weighted Two-Terminal Series-Parallel Graphs.",
            "Semantic Foundations of 4NF in Relational Database Design.",
            "Parallel PROFIT/COST Algorithms Through Fast Derandomization.",
            "Comparing Expressibility of Normed BPA and Normed BPP Processes.",
            "An Optimal Algorithm for Decomposing a Window into Maximal Quadtree Blocks.",
            "Reasoning with Examples: Propositional Formulae and Database Dependencies.",
            "On-Line Scheduling on a Single Machine: Minimizing the Total Completion Time.",
            "Reasoning Algebraically about Loops.",
            "Causality for Debugging Mobile Agents.",
            "Reasoning with First Order Nondeterministic Specifications.",
            "Finding the k Most Vital Edges with Respect to Minimum Spanning Tree.",
            "Optimal Bounds on the Gain of Permitting Dynamic Allocation of Communication Channels in Distributed Computing.",
            "Memory Requirements for Silent Stabilization.",
            "On the Cost-Effectiveness of PRAMs.",
            "Two Graph Algorithms Derived.",
            "Querying Sequence Databases with Transducers.",
            "How to Calculate Symmetries of Petri Nets.",
            "Specifying Communication in Distributed Information Systems.",
            "A Complete Algebraic Characterization of Behavioral Subtyping.",
            "On the Expressiveness of Subset-Sum Representations.",
            "Single Machine Scheduling with Deadlines and Increasing Rates of Processing Times.",
            "Data Refinement and Algebraic Structure.",
            "Minimal Huffman Trees.",
            "Analytic Variations on Bucket Selection and Sorting.",
            "Abstraction and Performance in the Design of Parallel Programs: An Overview of the SAT Approach.",
            "On Slender 0L Languages over the Binary Alphabet.",
            "On the Generalization of Higman and Kruskal's Theorems to Regular Languages and Rational Trees.",
            "Verification of Clocked and Hybrid Systems.",
            "Evolutionary Systems: A Language Generating Device Inspired by Evolving Communities of Cells.",
            "Class Hierarchy Specialization.",
            "Special Factors, Periodicity, and an Application to Sturmian Words.",
            "Type Introduction for Equational Rewriting."
        ]
    },
    {
        "name": "ACTA",
        "year": "1998",
        "info": "Volume 35, 1998",
        "count": 39,
        "papers": [
            "Structured Numbers: Properties of a Hierarchy of Operations on Binary Trees.",
            "Generating Words Lexicographically: An Average-Case Analysis.",
            "Data Refinement of Mixed Specifications.",
            "Refinement of Fair Action Systems.",
            "About the Collatz Conjecture.",
            "Conceptual Classes and System Classes in Object Databases.",
            "Average-Case Complexity for the Execution of Recursive Definitions on Relational Databases.",
            "Context-Free Languages over Infinite Alphabets.",
            "Lattices in Machine Learning: Complexity Issues.",
            "Modularity and Expressibility for Nets of Relations.",
            "On Time Computability of Functions in One-Way Cellular Automata.",
            "A Fully Abstract Semantics for Causality in the \\pi-Calculus.",
            "DNA Computing, Sticker Systems, and Universality.",
            "Partitioning a Sequence into Few Monotone Subsequences.",
            "Consistent Records in Asynchronous Computations.",
            "A Logic-Based Approach to Program Flow Analysis.",
            "Nonfinite Axiomatizability of the Equational Theory of Shuffle.",
            "List Ranking on Meshes.",
            "Approximating Traces.",
            "On Finite Automata with Limited Nondeterminism.",
            "Decision Problems Concerning Thinness and Slenderness of Formal Languages.",
            "Converting Untyped Formulas to Typed Ones.",
            "Polytime Model Checking for Timed Probabilistic Computation Tree Logic.",
            "On a Relation Between Uniform Coding and Problems of the Form DTIMEF(F) =? DSPACEF(F).",
            "Priority Conflict-Free Petri Nets.",
            "Bi-Catenation and Shuffle Product of Languages.",
            "d-Words and d-Languages.",
            "Denotational Semantics of Object Specification.",
            "A Tree-Based Mergesort.",
            "Machine Scheduling with Availability Constraints.",
            "M-Nets: An Algebra of High-Level Petri Nets, with an Application to the Semantics of Concurrent Programming Languages.",
            "Amortized Constant Relaxed Rebalancing Using Standard Rotations.",
            "On Linear List Recursion in Parallel.",
            "Asymptotic Expansions of the Mergesort Recurrences.",
            "Fusion and Simultaneous Execution in the Refinement Calculus.",
            "Modular Correctness Proofs of Behavioural Implementations.",
            "Dijkstra-Scholten Predicate Calculus: Concepts and Misconceptions.",
            "A Transformation System for Concurrent Processes.",
            "Axioms for Generalized Graphs, Illustrated by a Cantor-Bernstein Proposition."
        ]
    },
    {
        "name": "ACTA",
        "year": "1997",
        "info": "Volume 34, 1997",
        "count": 42,
        "papers": [
            "Weakly Independent Database Schemes.",
            "Net-Based Control Versus Rational Control. The Relation Between ITNC Vector Languages and Rational Relations.",
            "Minimal Equational Representations of Recognizable Tree Languages.",
            "Decidability of Model Checking for Infinite-State Concurrent Systems.",
            "Distance Measures for Point Sets and their Computation.",
            "The Additivity Problem for Functional Dependencies in Incomplete Relations.",
            "Computational Fractal Geometry with WFA.",
            "Relational Database Constraints as Counterexamples.",
            "Using Graph Coloring in an Algebraic Compiler.",
            "A Generalized Distribution Model for Random Recursive Trees.",
            "On the System of word equations x^i_1 x^i_2 ... x^i_m = y^i_1 y^i_2 ...y^i_n (i=1, 2, ...) in a Free Monoid.",
            "Reduced Constants for Simple Cycle Graph Separation.",
            "Efficient Algorithms for the Transformation Between Different Types of Binary Decision Diagrams.",
            "On the Interdependence Between Shuffle and Crossing-Over Operations.",
            "Dynamic LL(k) Parsing.",
            "Locality Based Semantics for Process Algebras.",
            "A Hierarchy of the Class of Apex NLC Graph Languages by Bounds on the Number of Nonterminal Nodes in Productions.",
            "Minimum Feedback Vertex Sets in Cocomparability Graphs and Convex Bipartite Graphs.",
            "Implementing Daubechies Wavelet Transform with Weighted Finite Automata.",
            "Fundamentals of Modelling Concurrency Using Discrete Relational Structures.",
            "A Hierarchy of Uniquely Parsable Grammar Classes and Deterministic Acceptors.",
            "Performance Analysis of Parallel Programs Based on Directed Acyclic Graphs.",
            "An Optimal Emulator and VLSI Layout for Complete Binary Trees.",
            "Algebraic Computational Models of OR-Parallel Execution of Prolog.",
            "A Survey of Stream Processing.",
            "On the Scalability and Mean-Time to Failure of k Resilient Protocols.",
            "Testing Bag-Containment of Conjunctive Queries.",
            "Minimal Communication Cost Software Construction in the Internet Environment.",
            "Code Generation Based on Formal BURS Therory and Heuristic Search.",
            "A New Formula for Speedup and its Characterization.",
            "A Fine-Grained Data-Flow Analysis Framework.",
            "Using the Causal Domain to Specify and verify Distributed Programs.",
            "An Analysis and Implementation of an Efficient In-Place Bucket Sort.",
            "Metric Semantics from Partial Order Semantics.",
            "Prototyping Realistic Programming Languages Based on Formal Specifications.",
            "Context-Free Graph Grammars and Concatenation of Graphs.",
            "Performance Preorder and Competitive Equivalence.",
            "Unconditional Transfer in Regulated Rewriting.",
            "Easy Sets and Hard Certificate Schemes.",
            "Optimal Fault-Tolerant Computing on Multiprocessor Systems.",
            "The Use of Deleted Tuples in Database, Querying and Updating.",
            "Applications of a Categorical Framework for Conceptual Data Modelling."
        ]
    },
    {
        "name": "ACTA",
        "year": "1996",
        "info": "Volume 33, 1996",
        "count": 37,
        "papers": [
            "Possibility and Impossibility Results in a Shared Memory Environment.",
            "Kinded Type Inference for Parametric Overloading.",
            "A Theory of Bisimulation for the pi-Calculus.",
            "Alias Analysis of Pointers in Pascal and Fortran 90: Dependence Analysis Between Pointer References.",
            "Multi-Granularity Locking for Nested Transactions: A Proof Using a Possibilities Mapping.",
            "Parallel Composition of Assumption-Commitment Specifications: A Unifying Approach for Shared Variable and Distributed Message Passing Concurrency.",
            "Simple Extensions of 1-writer Atomic Variable Constructions to Multiwriter Ones.",
            "Modeling Data-Intensive Reactive Systems with Relational Transition Systems.",
            "Bounded Delay for a Free Address.",
            "Optimizing the Costs of Hierarchical Quorum Consensus.",
            "Short Resolution Proofs for a Sequence of Tricky Formulas.",
            "On the Rational Subsets of the Free Group.",
            "The Synthesis Problem of Petri Nets.",
            "Timing and Causality in Process Algebra.",
            "The Log-Structured Merge-Tree (LSM-Tree).",
            "Parallel Approximation Schemes for Problems on Planar Graphs.",
            "Forgetting Automata and Context-Free Languages.",
            "Algebraic Models of Microprocessors: Architecture and Organisation.",
            "Syntactic Complexity of Context-Free Grammars Over Word Monoids.",
            "Undecidability of Restricted Uniform Recurrence Equations.",
            "Category-Based Modularisation for Equational Logic Programming.",
            "Disambiguating Grammars by Exclusion of Sub-Parse Trees.",
            "A Kernel Language for Programmed Rewriting of (Hyper)graphs.",
            "Chromatic Binary Search Trees. A Structure for Concurrent Rebalancing.",
            "On the Recognition of Permuted Supnick and Incomplete Monge Matrices.",
            "The Linear Landscape of External Contextual Languages.",
            "Relating Confluence, Innermost-Confluence and Outermost-Confluence Properties of Term Rewriting Systems.",
            "Parallel Integer Sorting and Simulation Amongst CRCW Models.",
            "Trial and Error. A New Approach to Space-Bounded Learning.",
            "An Observation on Suffix Redundancy in LL(1) Error Repair.",
            "Axiomatizing the Algebra of Net Computations and Processes.",
            "On the Analysis of Petri Nets with Static Priorities.",
            "Reduction Rules for Time Petri Nets.",
            "Calculi for Interaction.",
            "On the Sequential Nature of Interprocedural Program-Analysis Problems.",
            "RETRPROV, A System that Looks for Axioms.",
            "A Direct Complement Construction for LR(1) Grammars."
        ]
    },
    {
        "name": "ACTA",
        "year": "1995",
        "info": "Volume 32, 1995",
        "count": 32,
        "papers": [
            "Optimization of a Subclass of Conjunctive Queries.",
            "What is Failure? An Approach to Constructive Negation.",
            "A Formal Identification between Tuples and Lists with an Application to List-Arithmetic Categories.",
            "Parallel Integer Sorting Using Small Operations.",
            "A Transformation Method for Dynamic-Sized Tabulation.",
            "Inductive Attribute Grammars: A Basis for Incremental Program Execution.",
            "Parallel Tree Contraction and Prefix Computations on a Large Family of Interconnection Topologies.",
            "Efficient Algorithms for Checking the Atomicity of a Run of Read and Write Operations.",
            "Generating Boolean mu-Expressions.",
            "Bounded Self-Stabilizing Petri Nets.",
            "Reexecution in Abstract Interpretation of Prolog.",
            "Lazy Structure Sharing for Query Optimization.",
            "On the Complexity of Concurrency Control Using Semantic Information.",
            "Syntactic Complexity of Scattered Context Grammars.",
            "Invariants, Composition, and Substitution.",
            "S-Invariant Analysis of General Recursive Petri Boxes.",
            "A Petri Nets Semantics for Data Flow Networks.",
            "A Modal Logic for Message Passing Processes.",
            "The Extendes Equivalence Problem for a Class of Non-Real-Time Deterministic Pushdowen Automata.",
            "Compositional Refinements in Multiple Blackboard Systems.",
            "On the Look-Ahead Problem in Lexical Analysis.",
            "Detecting Morphic Images of a Word on the Rank of a Pattern.",
            "Local Hausdorff Dimension.",
            "Concurrent Testing of Processes.",
            "Contextual Nets.",
            "IEH Graphs. A Novel Generalization of Hypercube Graphs.",
            "Variance of Storage Requirements for B+-trees.",
            "A Compositional Dataflow Semantics for Petri Nets.",
            "Trace Nets and Process Automata.",
            "Iterative Weighted Finite Transductions.",
            "Specification and Verification of Object-Oriented Programs Using Supertype Abstraction.",
            "Finding a Maximum Matching in a Permutation Graph."
        ]
    },
    {
        "name": "ACTA",
        "year": "1994",
        "info": "Volume 31, 1994",
        "count": 36,
        "papers": [
            "A. Nico Habermann 1932-1993.",
            "Object Inheritance Beyond Subtyping.",
            "Dependency Preservation in Semantic Databases.",
            "Proving Finiteness of CCS Processes by Non-Standard Semantics.",
            "The Connection between an Event Structure Semantics and an Operational Semantics for TCSP.",
            "The Lattice of Data Refinement.",
            "Geometrical Tools to Map Systems of Affine Recurrence Equations on Regular Arrays.",
            "Context-free Text Grammars.",
            "Dependability Evaluation of Hierarchical Systems.",
            "On two Families of Forests.",
            "Boundedly LR(  k  )-conflictable Grammars.",
            "On n-Column 0, 1-Matrices with all k-Projections Surjective.",
            "Sorting Multisets Stably in Minimum Space.",
            "On Communication-Bounded Synchronized Alternating Finite Automata.",
            "A Recursive Second Order Initial Algebra Specification of Primitive Recursion.",
            "Context-Free Graph Languages of Bounded Degree are Generated by Apex Graph Grammars.",
            "Deterministic Asynchronous Automata for Infinite Traces.",
            "A Typed Logic of Partial Functions Reconstructed Classically.",
            "Synthesized and Inherited Functions. A new Computational Model for Syntax-Directed Semantic.",
            "On Problems with Short Certificates.",
            "Heuristics for Parallel Machine Scheduling with Delivery Times.",
            "Domain Independence and the Relational Calculus.",
            "Prescribed Teams of Grammars.",
            "Well Quasi-Orders and Regular Languages.",
            "Information Theoretic Approximations for the  M/G/  1 Retrial Queue.",
            "Update Operations in Deductive Databases with Functional Dependencies.",
            "Modularity and Reusability in Attribute Grammars.",
            "On Bounds of Response Time Performance Achievable by Multiclass Single-Server Queues.",
            "Behavioural Approaches to Algebraic Specifications: A Comparative Study.",
            "Mellin Transforms and Asymptotics: The Mergesort Recurrence.",
            "Comparing Locality and Causality Based Equivalences.",
            "Petri Net Algorithms in the Theory of Matrix Grammars.",
            "Optimal Search Trees Using Two-Way Key Comparisons.",
            "Tree Automata for Code Selection.",
            "On the Power of L-Systems in Image Generation.",
            "The Path Length of Random Skip Lists."
        ]
    },
    {
        "name": "ACTA",
        "year": "1993",
        "info": "Volume 30, 1993",
        "count": 33,
        "papers": [
            "Plain CHOCS: A Second Generation Calculus for Higher Order Processes.",
            "Logical and Schematic Characterization of Complexity Classes.",
            "Recognizable Trace Languages, Distributed Automata and the Distribution Problem.",
            "Frameworks for Abstract Interpretation.",
            "Performance and Reliability Improvement by Using Asynchronous Algorithms in Disk Buffer Cache Memory.",
            "Contextual Rewriting as a Sound and Complete Proof Method for Conditional LOG-Specifications.",
            "From ATP to Timed Graphs and Hybrid Systems.",
            "On Efficient Entreeings.",
            "The Relaxed min-max Heap.",
            "The Analysis of Heuristics for Search Trees.",
            "A Fine-Grained Solution to the Mutual Exclusion Problem.",
            "Relations among Simultaneous Complexity Classes of Nondeterministic and Alternating Turing Machines.",
            "L-Systems and Mutually Recursive Function Systems.",
            "OBSCURE: A Specification Language for Abstract Data Types.",
            "On the Synchronization in Parallel Communicating Grammar Systems.",
            "Speeding up Dynamic Transitive Closure for Bounded Degree Graphs.",
            "Unavoidable Binary Patterns.",
            "Satisfiability of Co-Nested Formulas.",
            "The Optimal Binary Search Tree for Andersson's Search Algorithm.",
            "Scheduling Saves in Fault-Tolerant Computations.",
            "Decomposing a Window into Maximal Quadtree Blocks.",
            "On Simplest Possible Solutions for Post Correspondence Problems.",
            "On the Expected Height of Fringe-Balanced Trees.",
            "Infinitary Parallelism without Unbounded Nondeterminism in CSP.",
            "On Minimizing the Forall-Not Degree of a Connective-Free Formula.",
            "Program Refinement in Fair Transition Systems.",
            "Proving Termination of (Conditional) Rewrite Systems. A Semantic Approach.",
            "An Algebraic Semantics of Higher-Order Types with Subtypes.",
            "Models for Reactivity.",
            "Querying Datalog Programs with Temporal Logic.",
            "Normal Form Approach to Compiler Design.",
            "Extended Nested Relations.",
            "A Characterisation of Meet and Join Respecting Pre-Orders and Congruences on Finite Lattices."
        ]
    },
    {
        "name": "ACTA",
        "year": "1992",
        "info": "Volume 29, 1992",
        "count": 35,
        "papers": [
            "On Parallel Integer Sorting.",
            "Receptive Process Theory.",
            "Multi-Relations in Z.",
            "A Run-Time Load Balancing Strategy for Highly Parallel Systems.",
            "Every Binary Pattern of Length Six is Avoidable on the Two-Letter Alphabet.",
            "A Simple, Fast, and Effective LL(1) Error Repair Algorithm.",
            "On-Line Multiversion Database Concurrency Control.",
            "Context-Free Hypergraph Grammars have the Same Term-Generating Power as Attribute Grammars.",
            "On the Synthesis of Function Inverses.",
            "The SB-Tree: An Index-Sequential Structure for High-Performance Sequential Access.",
            "On Partitions and Presortedness of Sequences.",
            "A Model and a Fast Algorithm for Multiple Errors Spelling Correction.",
            "An Algebra for Process Creation.",
            "A Robust and Efficient Spatial Data Structure.",
            "Single Machine Flow-Time Scheduling with Scheduled Maintenance.",
            "An All-Round Sweep Algorithm for 2-Dimensional Nearest-Neighbor Problems.",
            "Stacks, Queues, and Deques with Order-Statistic Operations.",
            "Processors Selection and Traffic Splitting in a Parallel Processors System.",
            "Communication for Alternating Machines.",
            "Unbalanced Multiway Trees Improved by Partial Expansions.",
            "A \"Yo-Yo\" Parsing Algorithm for a Large Class of van Wijngaarden Grammars.",
            "On Finitely Recognizable Semigroups.",
            "Analysis of a Class of Communicating Finite State Machines.",
            "An Experience in Proving Regular Networks of Processes by Modular Model Checking.",
            "Deterministic Sequential Functions.",
            "Elementary Transition Systems and Refinement.",
            "Naive Asymptotics for Hitting Time Bounds in Markov Chains.",
            "Two Impossibility Theorems on Behaviour Specification of Abstract Data Types.",
            "Classes of Systolic Y-Tree Automata and a Comparison with Systolic Trellis Automata.",
            "Expressibility of Output Equals Input.",
            "On the Lengths of Values in a Finite Transducer.",
            "Toward Formal Development of Programs from Algebraic Specifications: Parameterisation Revisited.",
            "An Efficiency Preorder for Processes.",
            "Languages Accepted by Systolic Y-Tree Automata: Structural Characterizations.",
            "A Class of Coders Based on GSM."
        ]
    },
    {
        "name": "ACTA",
        "year": "1990",
        "info": "Volume 28, 1990/1991",
        "count": 39,
        "papers": [
            "Nested Satisfiability.",
            "Proof Theory for Exception Handling in a Tasking Environment.",
            "Efficient Memo-Table Management Strategies.",
            "A Characterization of Set Representable Labeled Partial 2-Structures Through Decompositions.",
            "Automating the Knuth Bendix Ordering.",
            "Properties of Data Flow Frameworks.",
            "Binary Search Trees of Almost Optimal Height.",
            "On Characterizations of Recursively Enumerable Languages.",
            "Observational Implementation of Algebraic Specifications.",
            "Concurrent Bisimulations in Petri Nets.",
            "MRE Hierarchical Decomposition of General Queueing Network Models.",
            "A New Explanation of the Glitch Phenomenon.",
            "Sufficient-Completeness, Ground-Reducibility and their Complexity.",
            "Effective Construction of the Syntactic Algebra of a Recognizable Series on Trees.",
            "Theoretical Foundations of Handling Large Substitution Sets in Temporal Integrity Monitoring.",
            "Alan J. Perlis 1922-1990.",
            "The Calculus of Context Relations.",
            "The Expressive Power of Delay Operators in SCCS.",
            "Minimum-Delay Schedules in Layered Networks.",
            "The Virtual Feedback Problem in Hierarchical Representations of Combinational Circuits.",
            "Decision Problems for Finite Special String-Rewriting Systems that are Confluent on Some Congruence Class.",
            "PROCOL: A Concurrent Object-Oriented Language with Protocols Delegation and Constraints.",
            "An Abstract Data Type for Name Analysis.",
            "On the Expansion of Non-Linear Functions.",
            "Branching Processes of Petri Nets.",
            "Some Order Dimension Bounds for Communication Complexity Problems.",
            "Correction to Null Values in Nested Relational Databases by Mark A. Roth, H. F. Korth, and A. Silberschatz.",
            "Addendum to Null Values in Nested Relational Databases.",
            "A Fixed Point Approach to Parallel Discrete Event Simulation.",
            "The Expressive Power of the Bounded-Iteration Construct.",
            "Resource Finding in Store-and-Forward Networks.",
            "Priority Systems with many Identical Processes.",
            "On Fast Multiplication of Polynomials over Arbitrary Algebras.",
            "Postorder Trees and Eulerian Numbers.",
            "Efficient Comparison of Program Slices.",
            "Opportunistic Algorithms for Eliminating Supersets.",
            "Greed in Resource Scheduling.",
            "Independent Database Schemes under Functional and Inclusion Dependencies.",
            "Approximating Queue Lengths in M(t)/G/1 Queue Using the Maximum Entropy Principle."
        ]
    },
    {
        "name": "ACTA",
        "year": "1989",
        "info": "Volume 27, 1989/1990",
        "count": 34,
        "papers": [
            "Iteration of Transformation Passes over Attributed Program Trees.",
            "A Model of the Dynamic Behavior of B-Trees.",
            "An Almost Linear Robinson Unification Algorithm.",
            "A Note on Synthesis and Classification of Sorting Algorithms.",
            "Scattered Versus Context-Sensitive Rewriting.",
            "An Incremental Mechanical Development of Systolic Solutions to the Algebraic Path Problem.",
            "Step Failures Semantics and a Complete Proof System.",
            "Some Efficient Computational Algorithms Related to Phase Models.",
            "HDTOL Matching of Computations of Multitape Automata.",
            "In Memoriam: Andrei Petrovich Ershov.",
            "Merging Sorted Runs Using Large Main Memory.",
            "Describing Semantic Domains with Sprouts.",
            "A Maximum Entropy Priority Approximation for a Stable  G/G/  1 Queue.",
            "Temporal Predicat Transformers and Fair Termination.",
            "Partial (Set) 2-Structures. Part I: Basic Notions and the Representation Problem.",
            "Partial (Set) 2-Structures. Part II: State Spaces of Concurrent Systems.",
            "On Efficient Implementation of an Approximation Algorithm for the Steiner Tree Problem.",
            "Hiding in Stream Semantics of Uniform Concurrency.",
            "The Complexity of Graph Languages Generated by Hyperedge Replacement.",
            "Maintaining Range Trees in Secondary Memory. Part I: Partitions.",
            "Maintaining Range Trees in Secondary Memory. Part II: Lower Bounds.",
            "Data Refinement by Calculation.",
            "Referential Transparency, Definiteness and Unfoldability.",
            "Optimum Checkpoints with Age Dependent Failures.",
            "Representing CCS Programs by Finite Predicate/Transition Nets.",
            "Attribute Storage Optimization by Stacks.",
            "Duality in Specification Languages: A Lattice-Theoretical Approach.",
            "Minimizing Time-Space Cost for Database Version Control.",
            "Proving Relative Lower Bounds for Incremental Algorithms.",
            "On Specification of Multiprocessor Computing.",
            "The Instability of Self-Stabilization.",
            "Tableau-Based Model Checking in the Propositional Mu-Calculus.",
            "On the Valuedness of Finite Transducers.",
            "Context Free Derivations on Word Monoids."
        ]
    },
    {
        "name": "ACTA",
        "year": "1988",
        "info": "Volume 26, 1988/1989",
        "count": 41,
        "papers": [
            "The Formal Development of a Parallel Program Performing LU-Decomposition.",
            "Corrections to \"A Synthesis of Several Sorting Algorithms\" by J. Darlington.",
            "Correctness of Semantic Integrity Checking in Database Management Systems.",
            "A Distributed Operational Semantics for CCS Based on Condition/Event Systems.",
            "Motion Planning Among Time Dependent Obstacles.",
            "Applications of the Theory of Records in the Study of Random Trees.",
            "High Level Tree Transducers and Iterated Pushdown Tree Transducers.",
            "Transforming Unbalanced Multiway Trees into a Practical External Data Structure.",
            "Attribute (Re)evaluation in OPTRAN.",
            "Maximum Entropy Two-Station Cyclic Queues with Multiple General Servers.",
            "A Balanced Search Tree with  O  (1) Worst-case Update Time.",
            "The Method of Forced Enumeration for Nondeterministic Automata.",
            "Erratum: Predicative Methodology.",
            "Laws of Data Refinement.",
            "Predicate-Transformer Semantics of General Recursion.",
            "Failures Semantics and Deadlocking of Modular Petri Nets.",
            "Modeling Splits in File Structures.",
            "On Counting and Approximation.",
            "Through the Mincing Machine with a Boolean Layer Cake.",
            "A Sharp Proof Rule for Procedures in wp Semantics.",
            "Unsafe Operations in B-Trees.",
            "The Expected Behaviour of B+-Trees.",
            "Stable Duplicate-Key Extraction with Optimal Time and Space Bounds.",
            "A Family of NP-Complete Data Aggregation Problems.",
            "Erratum: Maximum Entropy Two-Station Cyclic Queues with Multiple General Servers.",
            "Rational Index of Vector Addition Systems Languages.",
            "On the Finite Degree of Ambiguity of Finite Tree Automata.",
            "Analytic Models for the Primary Site Approach to Fault-Tolerance.",
            "Computational Algorithms for Networks of Queues with Rejection Blocking.",
            "Complexity of Distributed Commit Protocols.",
            "Concurrency and Trie Hashing.",
            "Null Values in Nested Relational Databases.",
            "Time Lower Bounds for Parallel Sorting on a Mesh-Conected Processor Array.",
            "Metatheorems for Decision Problems on Hyperedge Replacement Graph Languages.",
            "Single Machine Flow-Time Scheduling With a Single Breakdown.",
            "An On-Line Algorithm for Variable-Sized Bin Packing.",
            "The Expected Additive Weight of Trees.",
            "Supercube: An Optimally Fault Tolerant Network Architecture.",
            "Iterated GSMs and Co-CFL.",
            "Continuous Reductions Among Combinatorial Optimization Problems.",
            "Erratum: Maximum Entropy Two-Station Cyclic Queues with Multiple General Servers."
        ]
    },
    {
        "name": "ACTA",
        "year": "1988",
        "info": "Volume 25, 1988",
        "count": 26,
        "papers": [
            "Termination Conventions and Comparative Semantics.",
            "Fifo Nets Without Order Deadlock.",
            "The Nearest Common Ancestor in a Dynamic Tree.",
            "Database Survivability Under Dynamic Constraints.",
            "Integrating Code Generation and Peephole Optimization.",
            "Crypt-Equivalent Algebraic Specifications.",
            "Incremental Evaluation for Attribute Grammars with Unrestricted Movement Between Tree Modifications.",
            "On the Existence of Symmetric Algorithms to Find Leaders in Networks of Communicating Sequential Processes.",
            "Recording the Use of Memory in Right-Boundary Grammars and Push-Down Automata.",
            "Toward Formal Development of Programs from Algebraic Specifications: Implementations Revisited.",
            "A Second Order Theory of Data Types.",
            "A Proof System for Distributed Processes.",
            "The Complexity of Reachability in Distributed Communicating Processes.",
            "Composition and Evaluation of Attribute Coupled Grammars.",
            "Resolution on Formula-Trees.",
            "Program-Substitution and Admissibility of Rules in Algorithmic Logic.",
            "On Generating Database Schemes Bounded or Constant-time-maintainable by Extensibility.",
            "Inductive Completion with Retracts.",
            "Graph Complexity.",
            "Apex Graph Grammars and Attribute Grammars.",
            "Elements of Finite Order for Finite Weight-Reducing and Confluent Thue Systems.",
            "A Calculus of Refinements for Program Derivations.",
            "Specification and Verification of Database Dynamics.",
            "Cooperative Distributed Dynamic Load Balancing.",
            "Load Sharing in Distributed Systems with Failures.",
            "Contributions to the Semantics of Logic Perpetual Processes."
        ]
    },
    {
        "name": "ACTA",
        "year": "1987",
        "info": "Volume 24, 1987",
        "count": 36,
        "papers": [
            "Sometime = Always + Recursion = Always on the Equivalence of the Intermittent and Invariant Assertions Methods for Proving Inevitability Properties of Programs.",
            "A Formal Semantics for Concurrent Systems with a Priority Relation.",
            "Partial Parametrization Eliminates Multiple Traversals of Data Structures.",
            "Electing a Leader in a Ring with Link Failures.",
            "Analysis of Space Allocation in a Generally Fragmented Linear Store.",
            "Generalized Theory of Serializability.",
            "Lower Bounds for Sorting on Mesh-Connected Architectures.",
            "Losslessness and Project-Join Constructibility in Relational Databases.",
            "Redundant Proofs of Non-Interference in Levin-Gries CSP Program Proofs.",
            "The Undecidability of the Unification and Matching Problem for Canonical Theories.",
            "An Analysis of a Contention Resolution Algorithm: Another Approach.",
            "SLR(1) and LALR(1) Parsing for Unrestricted Grammars.",
            "Extensional Equivalences for Transition Systems.",
            "Relational Heuristics for the Design of Deterministic Programs.",
            "Branching Processes in the Analysis of the Heights of Trees.",
            "One-Pass Transformations of Attributed Program Trees.",
            "A Linear Space Algorithm for the LCS Problem.",
            "An Easily Testable Optimal-Time VLSI-Multiplier.",
            "Partial-Predicate Logic in Computer Science.",
            "On Sufficient-Completeness and Related Properties of Term Rewriting Systems.",
            "Parallel Approximation Schemes for Subset Sum and Knapsack Problems.",
            "Long Unavoidable Patterns.",
            "A Result on  k  -Valent Graphs and Its Application to a Graph Embedding Problem.",
            "Time Optimal Left to Right Construction of Position Trees.",
            "Optimal Worst Case Trees.",
            "Order and Metric in the Stream Semantics of Elemental Concurrency.",
            "Minimizing Mean Flow-Time with Parallel Processors and Resource Constraints.",
            "Performance Evaluation of Fork and Join Synchronization Primitives.",
            "Worst Case Performance of Weighted Buddy Systems.",
            "Some Techniques for Geometric Searching with Implicit Set Representations.",
            "Improving Time and Space Efficiency in Generalized Binary Search Trees.",
            "The Derivation of Systolic Implementations of Programs.",
            "Lifetime Analysis for Attributes.",
            "Combinator-Based Compilation of Recursive Functions with Different Parameter Passing Modes.",
            "An Efficient General Iterative Algorithm for Dataflow Analysis.",
            "The Expressive Theory of Stacks."
        ]
    },
    {
        "name": "ACTA",
        "year": "1986",
        "info": "Volume 23, 1986",
        "count": 39,
        "papers": [
            "A Simple Fixpoint Argument Without the Restriction to Continuity.",
            "Specification-Oriented Semantics for Communicating Processes.",
            "Acceptable Functional Programming Systems.",
            "On Deciding Whether a Monoid is a Free Monoid or is a Group.",
            "On the Average Internal Path Length of  m  -ary Search Trees.",
            "An Incremental Primal Sieve.",
            "An Efficient ELL(1)-Parser Generator.",
            "Generation of Efficient  LALR  Parsers for Regular Right Part Grammars.",
            "Algorithms for Routing in Planar Graphs.",
            "Files d'attente exponentielles ayant des parametres non-stationnaires dans le temps.",
            "Total Correctness of CSP Programs.",
            "Nearly Optimal Hierarchies for Network and Formula Size.",
            "A Faster Approximation Algorithm for the Steiner Problem in Graphs.",
            "On the Expressive Power of Data Dependencies.",
            "A Regularity Test for Dual Bordered  OS  Systems.",
            "A Workload Model Representative of Static and Dynamic Characteristics.",
            "Constructing Maximal Slicings from Geometry.",
            "Graph Theoretic Closure Properties of the Family of Boundary NLC Graph Languages.",
            " NP  -Hard Problems in Hierarchical-Tree Clustering.",
            "The Complexity of Combinatorial Problems with Succinct Input Representation.",
            "Equivalence of the Gries and Martin Proof Rules for Procedure Calls.",
            "Precedence Technique is not Worse than SLR(1).",
            "A Comparison of Storage Optimizations in Automatically-Generated Attribute Evaluators.",
            "The Merlin-Randell Problem of Train Journeys.",
            "A Single Server Queue with Mixed Types of Interruptions.",
            "Predicative Methodology.",
            "A Logic for the Specification and Proof of Regular Controllable Processes of CCS.",
            "Generating Binary Trees of Bounded Height.",
            "Maximum Entropy and the  G/G/1/N  Queue.",
            "Deterministic Grammars and Grammar Morphisms.",
            "On the Equivalence of Some Transductions Involving Letter to Letter Morphisms on Regular Languages.",
            "Synchronizable Deterministic Pushdown Automata and the Decidability of their Equivalence.",
            "On Merging Software Extensions.",
            "The Reliability of Life-Critical Computer Systems.",
            "Availability of a Distributed Computer System with Failures.",
            "Information Theoretic Analysis for a General Queueing System at Equilibrium with Application to Queues in Tandem.",
            "Sets with Small Generalized Kolmogorov Complexity.",
            "Decomposition of Graphs and Monotone Formula Size of Homogeneous Functions.",
            "Monte Carlo Circuits for the Abelian Permutation Group Intersection Problem."
        ]
    },
    {
        "name": "ACTA",
        "year": "1985",
        "info": "Volume 22, 1985/1986",
        "count": 36,
        "papers": [
            "Throughput of a Satellite Channel Communication.",
            "Analysis of Tree Algorithms for the Simulation Event List.",
            "Thrifty Execution of Task Pipelines.",
            "Strongest Invariant Functions: Their Use in the Systematic Analysis of While Statements.",
            "General Correctness: A Unification of Partial and Total Correctness.",
            "Purely Top-Down Updating Algorithms for Stratified Search Trees.",
            "Performance Bounds for Binary Testing with Arbitrary Weights.",
            "Ramsey Numbers and an Approximation Algorithm for the Vertex Cover Problem.",
            "Querying Fragmented Relations in a Distributed Database.",
            "On Scheduling Tasks with Exponential Service Times and In-Tree Precedence Constraints.",
            "Rewrite Systems on a Lattice of Types.",
            "An Algorithm for Merging Heaps.",
            "Drawing Plane Graphs Nicely.",
            "An Effectively Given Initial Semigroup.",
            "A 2.5n Lower Bound on the Monotone Network Complexity of T_3^n.",
            "A Priority Queue With Interruptions of Service Permitted After a Time Quantum.",
            "Short Proofs for Tricky Formulas.",
            "Decidable Properties of Monadic Recursive Schemas With a Depth Parameter.",
            "Proving Properties of Pascal Programs in MIZAR 2.",
            "Probabilistic Bounds for Dual Bin-Packing.",
            "Necessary and Sufficient Conditions for the Universality of Programming Formalisms.",
            "Complete Problems for Space Bounded Subclasses of NP.",
            "Global Storage Cells for Attributes in an Attribute Grammar.",
            "Complexity of the Word Problem for Commutative Semigroups of Fixed Dimension.",
            "Replaceability and Computational Equivalence for Monotone Boolean Functions.",
            "On the Worst Case Performance of Buddy Systems.",
            "Optimum Decision Trees - An Optimal Variable Theorem and its Related Applications.",
            "Truly Prefix-Correct Chain-Free  LR  (1) Parsers.",
            "On the Algebraic Specification of Infinite Objects - Ordered and Continuous Models of Algebraic Types.",
            "The Family of One-Counter Languages is Closed Under Quotient.",
            "Fooling a Two-Way Nondeterministic Multihead Automaton with Reversal Number Restriction.",
            "A Functional Model for Describing and Reasoning About Time Behaviour of Computing Systems.",
            "Non-deterministic Data Types: Models and Implementations.",
            "Minimal Coverings for Incompletely Specified Sequential Machines.",
            "Investigations on Hotz Groups for Arbitrary Grammars.",
            "Erratum: Proving Properties of Pascal Programs in MIZAR 2."
        ]
    },
    {
        "name": "ACTA",
        "year": "1984",
        "info": "Volume 21, 1984/1985",
        "count": 34,
        "papers": [
            "Data Management Support for Database Management.",
            " LALR  (1, 1) Parser Generation for Regular Right Part Grammars.",
            "Optimal Multiway Search Trees for Variable Size Keys.",
            "Axiomatising Finite Delay Operators.",
            "Free Choice Systems Have Home States.",
            "Maintaining Order in a Generalized Linked List.",
            "Generalized Binary Split Trees.",
            "An Approach to Automating the Verification of Compact Parallel Coordination Programs I.",
            "Characterization of all Optimal Networks for a Simultaneous Computation of AND and NOR.",
            "On Binary Tree Encodements.",
            "A Characterization of Systolic Binary Tree Automata and Applications.",
            "Bicentres de langages algébriques.",
            "A Probabilistic Analysis of the Height of Tries and of the Complexity of Triesort.",
            "Using Circular Programs to Eliminate Multiple Traversals of Data.",
            "A Logic Covering Undefinedness in Program Proofs.",
            "Optimal Divide-and-Conquer to Compute Measure and Contour for a Set of Iso-Rectangles.",
            "The Axiomatic Semantics of Programs Based on Hoare's Logic.",
            "Simulation Output Analysis for Local Area Computer Networks.",
            "Randomized and Deterministic Simulations of PRAMs by Parallel Machines with Restricted Granularity of Parallel Memories.",
            "Speeding up Circularity Tests for Attribute Grammars.",
            "On Real-Time Cellular Automata and Trellis Automata.",
            "A Performance Guarantee for the Greedy Set-Partitioning Algorithm.",
            "A Fair Calculus of Communicating Systems.",
            "A Set-Theoretic Semantics for Clear.",
            "Polyvariant Mixed Computation for Analyzer Programs.",
            "The Paging Drum Queue: A Uniform Perspective and Further Results.",
            "Space Sweep Solves Intersection of Convex Polyhedra.",
            "Finite Complete Rewriting Systems and the Complexity of the Word Problem.",
            "Some Average Performance Measures for the B-Tree.",
            "Practical LL(1)-Based Parsing of van Wijngaarden Grammars.",
            "Deadlock-Freedom in Resource Contentions.",
            "A Denotational Semantics for Shared-Memory Parallelism and Nondeterminism.",
            "Permuting Data with the Omega Network.",
            "The Residue of Vector Sets with Applications to Decidability Problems in Petri Nets."
        ]
    },
    {
        "name": "ACTA",
        "year": "1983",
        "info": "Volume 20, 1983",
        "count": 23,
        "papers": [
            "On Hierarchies of Abstract Data Types.",
            "General Predicate Transformer and the Semantics of a Programming Language With Go To Statement.",
            "A Sound and Relatively * Complete Hoare-Logic for a Language With Higher Type Procedures.",
            "On Sets of Boolean  n  -Projections Surjective.",
            "A Note on Multi-queue Scheduling of Two Tasks.",
            "Performances of an Algorithm Constructing a Nearly Optimal Binary Tree.",
            "Two-Symbol DOS Systems Generating Regular Languages.",
            "On the Relationship of Minimum and Optimum Covers for a Set of Functional Dependencies.",
            "On the Semantics of Polymorphism.",
            "NP-complete Problems Simplified on Tree Schemas.",
            "Hiérarchie et fermeture de certaines classes de tag-systèmes.",
            "A Three-Stage Construction for Multiconnection Networks.",
            "The Temporal Logic of Branching Time.",
            "Pattern Matching in Trees and Nets.",
            "Rational Set of Trees and the Algebraic Semantics of Logic Programming.",
            "Task Allocation in Fault-Tolerant Distributed Systems.",
            "LR Parsing for Affix Grammars.",
            "A General Proof Rule for Procedures in Predicate Transformer Semantics.",
            "A Relational Approach to the Design of Deterministic Programs.",
            "Product Properties and Their Direct Verification.",
            "On the Performance Evaluation of Extendible Hashing and Trie Searching.",
            "Is Text Compression by Prefixes and Suffixes Practical?",
            "On the Generative Power of Regular Pattern Grammars."
        ]
    },
    {
        "name": "ACTA",
        "year": "1983",
        "info": "Volume 19, 1983",
        "count": 24,
        "papers": [
            "An Optimality Theory of Concurrency Control for Databases.",
            "Transposition of Large Tabular Data Structures with Applications to Physical Database Organization.",
            "Storage Utilization in B*-Trees with a Generalized Overflow Technique.",
            "Complexity of Analyzing the Synchronization Structure of Concurrent Programs.",
            "The Universe Problem for Unrestricted Flow Languages.",
            "Standard Model Semantics for DSL A Data Type Specification Language.",
            "Interpretation and Reduction of Attribute Grammars.",
            "The Construction of Operator Interfaces Based on Logical Input Devices.",
            "Transposition of Large Tabular Data Structures with Applications to Physical Database Organization.",
            "New Lower Bounds on the Formula Size of Boolean Functions.",
            "Fairness and Related Properties in Transition Systems - A Temporal Logic to Deal with Fairness.",
            "The Implementation of Retention in a Coroutine Environment.",
            "An Operational Semantics for Specifications of Abstract Data Types with Error Handling.",
            "Computation Sequences: A Way to Characterize Classes of Attribute Grammars.",
            "Efficiency of Universal Parallel Computers.",
            "On the Number of Relational Operators Necessary to Compute Certain Functions of Real Variables.",
            "Inferring Multivalued Dependencies From Functional and Join Dependencies.",
            "Three Measures for Synchronic Dependence in Petri Nets.",
            "A Maximum Entropy Analysis of the  M/G/  1 and  G/M/  1 Queueing Systems at Equilibrium.",
            "On Some Variants of Post's Correspondence Problem.",
            "An Efficient Incremental LR Parser for Grammars With Epsilon Productions.",
            "On-Way Multihead Deterministic Finite Automata.",
            "A Lower Time Bound for the Knapsack Problem on Random Access Machines.",
            "Parallel Language Recognition in Constant Time by Cellular Automata."
        ]
    },
    {
        "name": "ACTA",
        "year": "1982",
        "info": "Volume 18, 1982",
        "count": 27,
        "papers": [
            "Some Modified Algorithms for Dijkstra's Longest Upsequence Problem.",
            "Optimum Reorganization Points for Arbitrary Database Costs.",
            "Two Notions of Correctness and Their Relation to Testing.",
            "Partial Abstract Types.",
            "Langages saturés et cones décroissants Langages et cones bifidèles.",
            "On Termination Problems for Finitely Interpreted ALGOL-like Programs.",
            "On the Hotz Group of a Context-Free Grammar.",
            "Deterministic Buffer Synchronization of Sequential Processes.",
            "Further Analysis of Code Generation for a Single Register Machine.",
            "Verification of Programs with Procedure-Type Parameter.",
            "A Longest Common Subsequence Algorithm Suitable for Similar Text Strings.",
            "Deriving very Efficient Algorithms for Evaluating Linear Recurrence Relations Using the Program Transformation Technique.",
            "Lower Bounds for On-Line Two-Dimensional Packing Algorithms.",
            "Logic for Improving Integrity Checking in Relational Data Bases.",
            "On the Costs of Optimal and Near-Optimal Binary Search Trees.",
            "A Denotational Framework for Data Flow Analysis.",
            "An Alternative Implementation of an Insertion-Only Recovery Technique.",
            "On the Complexity of Some Problems Concerning the Use of Procedures I.",
            "On an Exponential Server with General Cyclic Arrivals.",
            "Systolic Automata for VLSI on Balanced Trees.",
            "Stratified Balanced Search Trees.",
            "Concurrent Algorithms for Root Searching.",
            "The Complexity of Drawing Trees Nicely.",
            "Finite State Relational Programs.",
            "On the Complexity of some Problems Concerning the Use of Procedures II.",
            "A Network for the Detection of Words in Continuous Speech.",
            "Partage de tâches entre processeurs homogenes."
        ]
    },
    {
        "name": "ACTA",
        "year": "1982",
        "info": "Volume 17, 1982",
        "count": 29,
        "papers": [
            "A Theory of Interactive Programming.",
            "Synchronized Behaviours of Processes and Rational Relations.",
            "Scheduling with Slack Time.",
            "Information Theoretic Approximations for  M/G/  1 und  G/G/  1 Queuing Systems.",
            "A Hierarchy Theorem for Multihead Stack-Counter Automata.",
            "Completeness of  E  0  L  Forms is Decidable.",
            "Remarks on the Complexity of an Invariant of Context-Free Grammars.",
            "Program Behavior Prediction and Prepaging.",
            "The Choice Coordination Problem.",
            "Arbitration Without Common Modifiable Variables.",
            "Inner Loops in Flowgraphs and Code Optimization.",
            "A New Data Structure for Representing Sorted Lists.",
            "Testing Attribute Grammars for Circularity.",
            "Formes de langages et de grammaires.",
            "Representation of Graphs.",
            "Ein Modell des P=NP -Problems mit einer positiven Lösung.",
            "Deleting the Root of a Heap.",
            "Dynamic Multi-Dimensional Data Structures Based on Quad- and  K - D  Trees.",
            "On Parsing Arithmetic Expressions in a Multiprocessing Environment.",
            "Performance Considerations in the Parallel Execution of Numerical Algorithms on two Processors.",
            "Recognition and Selection of Idioms for Code Optimization.",
            "On Some Decidable Properties of Finite State Translations.",
            "Robust Data Types.",
            "The Effect of Fixed-Length Record Implementation on File System Response.",
            "Space Efficient Algorithms for Some Graph Theoretical Problems.",
            "On the Power of Chain Rules in Context Free Grammars.",
            "On a Covering Relation for Context-Free Grammars.",
            "Complexity Theory and the Operational Structure of Algebraic Programming Systems.",
            "Explaining the Wheel Sieve."
        ]
    },
    {
        "name": "ACTA",
        "year": "1981",
        "info": "Volume 16, 1981",
        "count": 23,
        "papers": [
            "A Characterization of Database Graphs Admitting a Simple Locking Protocol.",
            "On the Use of History Variables.",
            "Reliability Theory of Program Testing.",
            "Behandlung verschiedener INTEGER-Darstellungen durch optimierende Compiler.",
            "On the Response Time Distribution in a Discrete Round-Robin Queue.",
            "A Characterization of Context-free String Languages by Directed Node-label Controlled Graph Grammars.",
            "Another Look at the \"Longest Ascending Subsequence\" Problem.",
            "A Formal Model of Atomicity in Asynchronous Systems.",
            "Parsing Regular Grammars with Finite Lookahead.",
            "The (  n,k  )-Bounded Emptiness-Problem for Probabilistic Acceptors and Related Problems.",
            "Sound and Complete Hoare-like Calculi Based on Copy Rules.",
            "The Clean Termination of Iterative Programs.",
            "An Axiomatic Definition of Synchronization Primitives.",
            "An Analysis of two Related Loop-free Algorithms for Generating Integer Partitions.",
            "Pathlistings Applied to Data Flow Analysis.",
            "The Formal Power of One-Visit Attribute Grammars.",
            "Varepsilon-Productions in Context-Free Grammars.",
            "The Formal Definition of a Real-Time Language.",
            "A Gap Between the Actual Complexity of Permutations and Their Entropy Defined by Stoß.",
            "Best Huffman Trees.",
            "Problematic Features of Programming Languages: A Situational-Calculus Approach.",
            "A Characterization of Attribute Evaluation in Passes.",
            "Black-White Pebbles and Graph Separation."
        ]
    },
    {
        "name": "ACTA",
        "year": "1981",
        "info": "Volume 15, 1981",
        "count": 29,
        "papers": [
            "Klaus Samelson.",
            "Binary Search Trees in Secondary Memory.",
            "Approximate Analysis of Exponential Queueing Systems with Blocking.",
            "Analysis of a Service Facility with Periodic Checkpointing.",
            "Remarks on R. D. Tennent's Language Design Methods Based on Semantic Principles: Algol 68, A Language Designed Using Semantic Principles.",
            "Backtracking with Multi-Level Dynamic Search Rearrangement.",
            "Parsing Extended  LR(k)  Grammars.",
            "The Characterization of Parallel Ultralinear Grammars by Rational Power Series.",
            "A Fast Algorithm for Steiner Trees.",
            "An Improved Complexity Hierarchy on the Depth of Boolean Functions.",
            "Indépendance Forte de Certaines Opérations.",
            "Hex ist PSPACE-vollständig.",
            "Axiomatic Data Type Specifications: A First Order Theory of Linear Lists.",
            "Flow Languages Equal Recursively Enumerable Languages.",
            "Recursive Assertions and Parallel Programs.",
            "Proving Total Correctness of Nondeterministic Programs in Infinitary Logic.",
            "A Discrete-Time Round-Robin Queue with Bernoulli Input and General Arithmetic Service Time Distributions.",
            " LR  (0) Grammars Generated by  LR  (0) Parsers.",
            "A Proof Technique for Communicating Sequential Processes.",
            "The Equivalence of Horn and Network Complexity for Boolean Functions.",
            "Persistence of Vector Replacement Systems is Decidable.",
            "Computing Extremal and Approximate Distances in Graphs Having Unit Cost Edges.",
            "Efficient Algorithms for Finding Maximum Matchings in Convex Bipartite Graphs and Related Problems.",
            "Regenerative Simulation of Response Times in Networks of Queues: Statistical Efficiency.",
            "The Logic of Aliasing.",
            "Goto Statements: Semantics and Deduction Systems.",
            "A Specification Technique Based on Predicate Transformers.",
            "Eliminating Unit Reductions from  LR(k)  Parsers Using Minimum Contexts.",
            "General Purpose Schedulers for Database System."
        ]
    },
    {
        "name": "ACTA",
        "year": "1980",
        "info": "Volume 14, 1980",
        "count": 22,
        "papers": [
            "Correctness of the Compiling Process Based on Axiomatic Semantics.",
            "The 'Hoare Logic' of Concurrent Programs.",
            "Evaluation des Performances d'un Algorithme de Controle de la Cohérence d'une Base de Données Répartie.",
            "Concurrent Search and Insertion in 2-3 Trees.",
            "Über Separatoren in planaren Graphen.",
            "Memory Fragmentation in Buddy Methods for Dynamic Storage Allocation.",
            "Optimum Multiway Search Trees.",
            "Hierarchical Program Specification and Verification - a Many-sorted Logical Approach.",
            "On the Space Optimizing Effect of Eliminating Single Productions from  LR  Parsers.",
            "On Parsing Two-Level Grammars.",
            "General Purpose Schedulers for Database Systems.",
            "An  O(V5/3 E2/3)  Algorithm for the Maximal Flow Problem.",
            "On Alternation.",
            "Size-depht Tradeoff in Non-monotone Boolean Formulae.",
            "A Survey of Normal Form Covers for Context Free Grammars.",
            "A Note on the Density of Inherently Ambiguous Context-free Languages.",
            "Semantic Routines and  LR(k)  Parsers.",
            "Left Context Precedence Grammars.",
            "First-Order Identities as a Defining Language.",
            "Descriptively Complete Process Logic.",
            "Infinite Proof Rules for Loops.",
            "On Alternation II. A Graph Theoretic Approach to Determinism Versus Nondeterminism."
        ]
    },
    {
        "name": "ACTA",
        "year": "1980",
        "info": "Volume 13, 1980",
        "count": 27,
        "papers": [
            "Some Beautiful Arguments Using Mathematical Induction.",
            "Semantic Properties of Lucid's Compute Clause and its Compilation.",
            "Variance Reduction Techniques for the Simulation of Markov Process.",
            "An Algorithmic and Complexity Analysis of Interpolation Search.",
            "Applications of Efficient Mergeable Heaps for Optimization Problems on Trees.",
            "Gobang ist PSPACE-vollständig.",
            "Paramodulated Connection Graphs.",
            "On Generators and Generative Capacity of EOL Forms.",
            "A new Lower Bound on the Monotone Network Complexity of Boolean Sums.",
            "Methods for the Automatic Construction of Error Correcting Parsers.",
            "Efficient LL(1) Error Correction and Recovery Using Only Insertions.",
            "Efficient Worst-Case Data Structures for Range Searching.",
            "Proving Correctness of Coroutines Without History Variables.",
            "An Ogden-Like Iteration Lemma for Rational Power Series.",
            "Amounts of Nondeterminism in Finite Automata.",
            "A Practical Example of the Specification of Abstract Data Types.",
            "Remarks on \"A Synthesis of Several Sorting Algorithms\" by John Darlington.",
            "Ordered Attributed Grammars.",
            "Context-Free Grammars With Selective Rewriting.",
            "Universal Asynchronous Iterative Arrays of Mealy Automata.",
            "Automaten in planaren Graphen.",
            "Analysis of a Prioritized CSMA Protocol Based on Staggered Delays.",
            "Depth-First K-Trees and Critical Path Analysis.",
            "Sur les générateurs algébriques et linéaires.",
            "Rational Bijection of Rational Sets.",
            "Using the Blankinship Algorithm to Find the General Solution of a Linear Diophantine Equation.",
            "On the Number of Active-Operations Needed to Compute the Discrete Fourier Transform."
        ]
    },
    {
        "name": "ACTA",
        "year": "1979",
        "info": "Volume 12, 1979",
        "count": 18,
        "papers": [
            "Formal Derivation of Strongly Correct Concurrent Programs.",
            "Lower Bounds on Space Complexity for Contextfree Recognition.",
            "On the Max-Entropy Rule for a Binary Search Tree.",
            "Pascal-Clarifications and Recommended Extensions.",
            "Generalized Recursive Data Structures.",
            "COSY - A System Specification Language Based on Paths and Processes.",
            "Regenerative Simulation of Response Times in Networks of Queues with Multiple Job Types.",
            "On Languages Accepted by Space-Bounded Oracle Machines.",
            "Generalized Deterministic Left To Right Parsing.",
            "Computation and Use of Data Flow Information in Optimizing Compilers.",
            "Size-Depth Tradeoff in Monotone Boolean Formulae.",
            "The Multiple Phase Service Network with Generalized Processor Sharing.",
            "Probabilistic Models of Computer Systems.",
            "On a Class of Recursive Procedures and Equivalent Iterative Ones.",
            "Analyse et optimisation d'une procédure de reprise dans un système de gestion de données centralisées.",
            "A Method for Transforming Grammars into LL(k) Form.",
            "Some Remarks on Boolean Sums.",
            "Sequential Method in Propositional Dynamic Logic."
        ]
    },
    {
        "name": "ACTA",
        "year": "1978",
        "info": "Volume 11, 1978/1979",
        "count": 23,
        "papers": [
            "A Synthesis of Several Sorting Algorithms.",
            "Proving and Applying Program Transformations Expressed with Second-Order Patterns.",
            "Remarks on \"Some Comments on Concurrent Readers and Writers\" by Reidar Conradi.",
            "Improved Time and Space Bounds for Boolean Matrix Multiplication.",
            "Precedence Relations in Grammar Forms.",
            "Hierarchy Theorems for Two-Way Finite State Transducers.",
            "An Experimentally Validated Model of the Paging Drum.",
            "Constructing a Theory of a Data Structure as an Aid to Program Development.",
            "Proof Rules for Gotos.",
            "A Binary Operation on Trees and an Initial Algebra Characterization for Finite Tree Types.",
            "On the Definition of ELR(k) and ELL(k) Grammars.",
            "Constructing LR Parsers for Regular Right Part Grammars.",
            "The Clean Termination of Pascal Programs.",
            "The Correctness of the Schorr-Waite List Marking Algorithm.",
            "The Schorr-Waite Graph Marking Algorithm.",
            "Intersections de langages algébriques bornés.",
            "Opérations de Cylindre et applications séquentielles gauches inverses.",
            "Extended Linear Macro Grammars, Iteration Grammars, and Register Programs.",
            "do Considered od: A Contribution to the Programming Calculus.",
            "Procédures de reprise dans les systèmes de gestion de base de données réparties.",
            "Dynamic Weighted Binary Search Trees.",
            "The Average Number of Registers Needed to Evaluate a Binary Tree Optimally.",
            "A Useful Lemma for Context-Free Programmed Grammars."
        ]
    },
    {
        "name": "ACTA",
        "year": "1978",
        "info": "Volume 10, 1978",
        "count": 25,
        "papers": [
            "Proof Rules for the Programming Language Euclid.",
            "The Algebraic Specification of Abstract Data Types.",
            "Algebraic Program Testing.",
            "Bounded Quantification and Relations Recognizable by Finite Automata.",
            "The Ultimate Equivalence Problem for DOL Systems.",
            "Information Management in Context Trees.",
            "Performance Analysis of Multiprocessor Systems Containing Functionally Dedicated Processors.",
            "A Conservation Law for G/G/m Queueing Systems.",
            "Time-Space Trade-Offs in a Pebble Game.",
            "Ianov Pushdown Schemes Are Contained in Boolean Recursive Schemes.",
            "Äquivalente Transformationen für Flußdiagramme.",
            "The Design of a Portable Programming Language.",
            "A Note on Classes of Complements and the LBA Problem.",
            "A Class of Linearly Parsable Graph Grammars.",
            "Linear Regular Sets.",
            "The ELL(1) Parser Generator and the Error Recovery Mechanism.",
            "On Removing the Machine from the Language.",
            "The Method of Attributes for Data Flow Analysis: Part I. Exhaustive Analysis.",
            "The Method of Attributes for Data Flow Analysis: Part II. Demand Analysis.",
            "Optimal alpha-beta Trees with Capacity Constraint.",
            "On the Complementation Rule for Multivalued Dependencies in Database Relations.",
            "Incremental LR Parers.",
            "Two-Level Meta-Controlled Substitution Grammars.",
            "The Semigroups of Linearly Realizable Finite Automata I.",
            "The Semigroups of Linearly Realizable Finite Automata II."
        ]
    },
    {
        "name": "ACTA",
        "year": "1977",
        "info": "Volume 9, 1977/1978",
        "count": 23,
        "papers": [
            "Concurrency of Operations on B-Trees.",
            "Worst-Case Analysis for Region and Partial Region Searches in Multidimensional Binary Search Trees and Balanced Quad Trees.",
            "Eliminating Unit Productions from LR Parsers.",
            "Axioms for Total Correctness.",
            "A Class of Measures on Formal Languages.",
            "Subrekursive Komplexität bei Gruppen: I. Gruppen mit vorgeschriebener Komplexität.",
            "The Report on the Standard Hardware Representation for ALGOL 68.",
            "Proving Programs Correct through Refinement.",
            "A Proof Method for Cyclic Programs.",
            "On Random 2-3 Trees.",
            "On the Complexity of Formal Grammars.",
            "Subrekursive Komplexität bei Gruppen: II. Der Einbettungssatz von Higman für entscheidbare Gruppen.",
            "Program Analysis and Optimization through Kernel-Control Decomposition.",
            "Design and Correctness of a Compiler for a Non-Procedural Language.",
            "Orthogonality of Information Structures.",
            "Bin Packing: Maximizing the Number of Pieces Packed.",
            "Data Encodings and Their Costs.",
            "Functional Behavior in Data Spaces.",
            "Die Zeitkomplexität des Normalisierungsproblems bei kontextsensitiven Grammatiken.",
            "A Multiclass Networt Model of a Demand Paging Computer System.",
            "Good OL Forms.",
            "Static Main Storage Packing Problems.",
            "A Unified Approach to the Generation and the Acception of Formal Languages."
        ]
    },
    {
        "name": "ACTA",
        "year": "1977",
        "info": "Volume 8, 1977",
        "count": 25,
        "papers": [
            "The Parsing Problem for Affix Grammars.",
            "Proof of Termination within a Weak Logic of Programs.",
            "Extended Directed Graphs, a Formalism for Structured Data and Data Structures.",
            "Complete Parameterized Families of Job Scheduling Strategies.",
            "EOL Forms.",
            "Language Design Methods Based on Semantic Principles.",
            "On an Equivalence between Continuation and Stack Semantics.",
            "Backtracking in Recursive Computations.",
            "Rules of Inference for Procedure Calls.",
            "Scheduling According to Job Priority with Prevention of Deadlock and Permanent Blocking.",
            "Iterative Arrays with Direct Central Control.",
            "Van Wijngaarden Grammars and Space Complexity Classs EXSPACE.",
            "Some Extended Semaphore Primitives.",
            "Locations Considered Unnecessary.",
            "LAR: A Logic of Algorithmic Reasoning.",
            "General Properties of Derivational Complexity.",
            "Iterated Deterministic Substitution.",
            "On Computing the Transitive Closure of a Relation.",
            "On a New Approach to Representation Independent Data Classes.",
            "Concurrent Access to Data.",
            "Some Comments on \"Concurrent Readers and Writers\".",
            "A Feedback-Coupled Resource Allocation Policy for Multiprogrammed Computer Systems.",
            "A Note on the Influence of Program Loading on the Page Fault Rate.",
            "The LBA-Problem and the Deterministic Tape Complexity of Two-Way One-Counter Languages over a One-Letter Alphabet.",
            "Corrigenda: Transformational Methods and Their Application to Complexity Problems."
        ]
    },
    {
        "name": "ACTA",
        "year": "1976",
        "info": "Volume 7, 1976/1977",
        "count": 26,
        "papers": [
            "A New Approach to Parallel Computing.",
            "The Synchronization of Independent Processes.",
            "Probabilistic Models of Computer Systems - Part I (Exact Results).",
            "LR-Parsing of Extended Context Free Grammars.",
            "Grammarforms and Grammarhomomorphisms.",
            "The Network Complexity and the Turing Machine Complexity of Finite Functions.",
            "Multitype Multiprogramming Models.",
            "The Behaviour of a Single-Queue in a General Queueing Network.",
            "Validation of a Computer Performance Model of the Exponential Queuing Network Family.",
            "An Endogenous Priority Model for Load Control in Combined Batch-Interactive Computer Systems.",
            "Fundamental Operational Laws of Computer System Performance.",
            "A Study of Queueing Networks with Deterministic Service and Application to Computer Networks.",
            "Optimal Multiprogramming.",
            "Multi-Queue Scheduling of Two Tasks.",
            "On the Self Contained Modelling of DB/DC Systems.",
            "A Practical General Method for Constructing LR(k) Parsers.",
            "Speicheroptimale Formelübersetzung.",
            "Storage Schemes for Boundedly Extendible Arrays.",
            "Monotone Data Flow Analysis Frameworks.",
            "On the Role of Unification in Mechanical Theorem Proving.",
            "Addenda and Corrigenda: Formal Semantics of a Class of High-Level Primitives for Coordinating Concurrent Processes.",
            "The Analysis of Quicksort Programs.",
            "Axiomatic Approach to Side Effects and General Jumps.",
            "Effect of Data Representation on Cost of Sparse Matrix Operations.",
            "Schnelle Multiplikation von Polynomen über Körpern der Charakteristik 2.",
            "Monoïdes syntactiques des langages algébriques."
        ]
    },
    {
        "name": "ACTA",
        "year": "1976",
        "info": "Volume 6, 1976",
        "count": 26,
        "papers": [
            "Algorithms Minimizing Mean Flow Time: Schedule-Length Properties.",
            "Specification and Proving of Command Programs.",
            "A System which Automatically Improves Programs.",
            "Axiomatics for Memory Allocation.",
            "Hierarchies of Complete Problems.",
            "Inherently Nonplanar Automata.",
            "Transformational Methods and their Application to Complexity Problems.",
            "SEMANOL (73) A Metalanguage for Programming the Semantics of Programming Languages.",
            "Affine Relationships Among Variables of a Program.",
            "Another Polynomial Homomorphism.",
            "Edge-Disjoint Spanning Trees and Depth-First Search.",
            "The Mathematical Analysis of the Computer System Modeled as a Two Stage Cyclic Queue.",
            "Some Resource Allocation Policies in a Multi Associative Processor.",
            "On the Efficient Implementation of Conditional Critical Regions and the Construction of Monitors.",
            "A Decomposable Model of Program Paging Behaviour.",
            "An Alternative Approach to the Improvement of LR(k) Parsers.",
            "Grammars on Partial Graphs.",
            "An Axiomatic Proof Technique for Parallel Programs I.",
            "On the Implementation of Strassen's Fast Multiplication Algorithm.",
            "On a Gauntlet Thrown by David Gries.",
            "An O(n) Algorithm for Computing the Set of Available Expressions of D-Charts.",
            "A Model of a Virtual Memory System.",
            "Resolution of Ambiguity in Parsing.",
            "On Grammar Forms with Terminal Context.",
            "Optimal Codes, n-Arcs and Laguerre Geometry.",
            "On Proving that Certain Languages are not ETOL."
        ]
    },
    {
        "name": "ACTA",
        "year": "1975",
        "info": "Volume 5, 1975",
        "count": 10,
        "papers": [
            "Revised Report on the Algorithmic Language ALGOL 68.",
            "Dispatcher Primitives for the Construction of Operating System Kernels.",
            "Interactaive Graphics on Intelligent Terminals in a Time-Sharing Environment.",
            "Parallel Algorithms for Adaptive Quadrature II Metalgorithm Correctness.",
            "Nearly Optimal Binary Search Trees.",
            "Formal Semantics of a Class of High-Level Primitives for Coordinating Concurrent Processes.",
            "A Closer Look at Termination.",
            "A Decidability Criterion for van Wijngaarden Grammars.",
            "Substitution of Grammar Forms.",
            "A Note on Degrees of Context-Sensitivity."
        ]
    },
    {
        "name": "ACTA",
        "year": "1974",
        "info": "Volume 4, 1974",
        "count": 24,
        "papers": [
            "Quad Trees: A Data Structure for Retrieval on Composite Keys.",
            "A Model of a Time Sharing Virtual Memory System Solved Using Equivalence and Decomposition Methods.",
            "The Stability Problem of Broadcast Packet Switching Computer Networks.",
            "Sequentielle Analyse kontextfreier Sprachen.",
            "Multipass Precedence Analysis.",
            "Nonterminals, Homomorphisms and Codings in Different Variations of OL-Systems. I. Deterministic Systems.",
            "Algorithms for Fast Evaluation of Boolean Expressions.",
            "Proving Properties of Interacting Processes.",
            "The Verification and Synthesis of Data Structures.",
            "Automatic Program Verification I: A Logical Basis and its Implementation.",
            "Ambiguity and Precedence in Syntax Description.",
            "On 3-Head Versus 2-Head Finite Automata.",
            "Grundlagen einer Theorie der Datenstrukturen und Zugriffssysteme. Teil I: Datenstrukturen und Schemata.",
            "Nonlinear Pattern Theory.",
            "More Comments on the Programming Language Pascal.",
            "Semantic Decomposition of Computer Programs: An Aid to Program Testing.",
            "Automatic Correction of Syntax-Errors in Programming Languages.",
            "A Principle of Independence for Binary Tree Searching.",
            "Grundlagen einer Theorie der Datenstrukturen und Zugriffssysteme. Teil II: Zugriffssysteme.",
            "A Branch-and-Bound Algorithm to Obtain an Optimal Evaluation Tree for Monotonic Boolean Functions.",
            "Boolesche Minimalpolynome und Überdeckungsprobleme.",
            "Deriving Graphs from Graphs by Applying a Production.",
            "WCS-Analysis of the Context-Sensitive.",
            "EOL Systems with Control Devices."
        ]
    },
    {
        "name": "ACTA",
        "year": "1973",
        "info": "Volume 3, 1973/1974",
        "count": 26,
        "papers": [
            "Page Size in Demand-Paging Systems.",
            "Optimal Disk Merge Patterns.",
            "Node Flows in Graphs with Conservative Flow.",
            "Reducing the Number of Multiplikations in Iterative Processes.",
            "Critical Comments on the Programming Language Pascal.",
            "Normal Forms for Context-Sensitive Grammars.",
            "Lineare Realisierbarkeit endlicher Automaten über endlichen Körpern.",
            "An Analytic Storage Allocation Model.",
            "A Unified View of the Complexity of Evaluation and Interpolation.",
            "Consistent and Complementary Formal Theories of the Semantics of Programming Languages.",
            "Weakly Context-Sensitive Languages as Model for Programming Languages.",
            "Über die Vernetzungsstruktur von Maschinen.",
            "An Abstract Machine Theory for Formal Language Parsers.",
            "Bounds on the Parallel Evaluation of Arithmetic Expressions Using Associativity and Commutativity.",
            "Zur Komplexität von Sortierproblemen.",
            "On Procedures as Open Subroutines. II.",
            "Axiomatic Approach to Total Correctness of Programs.",
            "Nonterminals Versus Homomorphisms in Defining Languages for Some Classes of Rewriting Systems.",
            "On Derivation Languages Corresponding to Context-Free Grammars.",
            "Sur une Conjecture de S. Greibach.",
            "Choosing a Storage Schema.",
            "Analyse d'un algorithme de gestion simultanée Mémoire centrale - Disque de pagination.",
            "Performance Bounds on the Splitting Algorithm for Binary Testing.",
            "Nonterminals, Homomorphisms and Codings in Different Variations of OL-Systems. II. Nondeterministic Systems.",
            "Eigenschaften der von linearen Automaten erkennbaren Worte.",
            "Total lineare Realisierbarkeit endlicher Automaten."
        ]
    },
    {
        "name": "ACTA",
        "year": "1973",
        "info": "Volume 2, 1973",
        "count": 23,
        "papers": [
            "Job Scheduling Guaranteeing Reasonable Turn-Around Times.",
            "Efficient LR(1) Parsers.",
            "On Sentential Forms of Context-Free Grammars.",
            "Program Proving: Coroutines.",
            "Berechnung und Programm. II.",
            "Rangierkomplexität von Permutationen.",
            "Describing an Algorithm by Hopcroft.",
            "On Correct Procedure Parameter Transmission in Higher Programming Languages.",
            "Synchronisationsgraphen.",
            "Sequential and Jumping Machines and their Relation to Computers.",
            "Minimale und m-minimale Variablenmengen für partielle Boole'sche Funktionen.",
            "Sur diverses familles de langages fermées par transduction rationelle.",
            "A Reply to Comments on \"A Comparison of Two Synchronizing Concepts\".",
            "Fast Algorithms for the Elimination of Common Subexpressions.",
            "Developmental Systems with Locally Catenative Formulas.",
            "A Note on Multihead Automata and Context-Sensitive Languages.",
            "Zur Theorie der Partiell-linearen Realisierungen endlicher Automaten.",
            "Die mittlere Additionsdauer eines Paralleladdierwerks.",
            "Relational Level Data Structures for Programming Languages.",
            "On Procedures as Open Subroutines. I.",
            "An Axiomatic Definition of the Programming Language PASCAL.",
            "An Extension of the Theory of Learning Systems.",
            "Familles de langages translatables et fermées par crochet."
        ]
    },
    {
        "name": "ACTA",
        "year": "1971",
        "info": "Volume 1, 1971/1972",
        "count": 28,
        "papers": [
            "Performance Predictions for Extended Paged Memories.",
            "Optimum Binary Search Trees.",
            "A Model for Data Structures and Its Applications. I.",
            "The Programming Language Pascal.",
            "Ein Vollständigkeitssatz für Programme und Schaltkreise.",
            "Top-Down Syntax Analysis.",
            "Application of Regular Canonical Systems to Grammars Translatable from Left to Right.",
            "Hierarchical Ordering of Sequential Processes.",
            "Schnelle Berechnung von Kettenbruchentwicklungen.",
            "Optimal Merging of 2 Elements with n Elements.",
            "Congruences et Automorphismes des Automates Finis.",
            "Organization and Maintenance of Large Ordered Indices.",
            "A Comparison of Two Synchronizing Concepts.",
            "Optimal Scheduling for Two-Processor Systems.",
            "Program Proving: Jumps and Functions.",
            "Der programmierbare endliche Automat.",
            "Direction Controlled Programmed Grammars.",
            "Inhibitionsfelder.",
            "Proof of Correctness of Data Representations.",
            "A Model for Data Structures and its Applications. (Part II).",
            "Symmetric Binary B-Trees: Data Structure and Maintenance Algorithms.",
            "Least Upper Bound on the Cost of Optimum Binary Search Trees.",
            "Bounds on Algorithms for String Generation.",
            "Berechnung und Programm. I.",
            "On Non-Determinancy in Simple Computing Devices.",
            "Endliche Automaten und Zufallsfolgen.",
            "Automatic Analysis of Inflectional Morphems in German Nouns.",
            "Comments on \"A Comparison of Two Synchronizing Concepts by Per Brinch Hansen\"."
        ]
    }
]