[
    {
        "name": "Algorithmica",
        "year": "2022",
        "info": "2022: Volume\n84",
        "count": 45,
        "papers": [
            "Approximation Algorithm for Vertex Cover with Multiple Covering Constraints.",
            "On Perturbation Resilience of Non-uniform k-Center.",
            "Multiple-Edge-Fault-Tolerant Approximate Shortest-Path Trees.",
            "Approximate Minimum Selection with Unreliable Comparisons.",
            "Optimized Silent Self-Stabilizing Scheme for Tree-Based Constructions.",
            "Approximating Dynamic Weighted Vertex Cover with Soft Capacities.",
            "Bounded-Angle Minimum Spanning Trees.",
            "Level-Planar Drawings with Few Slopes.",
            "A Polynomial Kernel for Diamond-Free Editing.",
            "Agglomerative Clustering of Growing Squares.",
            "Bounding the Inefficiency of Compromise in Opinion Formation.",
            "Structural Parameterizations of Clique Coloring.",
            "Tight Bounds for Online Weighted Tree Augmentation.",
            "Approximation Schemes for the Generalized Extensible Bin Packing Problem.",
            "Mechanisms for (Mis)allocating Scientific Credit.",
            "Counting Induced Subgraphs: An Algebraic Approach to #W[1]-Hardness.",
            "On the Parameterized Complexity of Maximum Degree Contraction Problem.",
            "Fast Exact Algorithms Using Hadamard Product of Polynomials.",
            "Additive Approximation of Generalized Turán Questions.",
            "On the Parameterized Complexity of Reconfiguration of Connected Dominating Sets.",
            "Contraction Bidimensionality of Geometric Intersection Graphs.",
            "Matching Regular Expressions on uncertain data.",
            "Special Issue of Algorithmica for the 28th London Stringology Days & London Algorithmic Workshop (LSD & LAW).",
            "k-Approximate Quasiperiodicity Under Hamming and Edit Distance.",
            "A Comparative Study of Dictionary Matching with Gaps: Limitations, Techniques and Challenges.",
            "Space Efficient Merging of de Bruijn Graphs and Wheeler Graphs.",
            "Computing Minimal Unique Substrings for a Sliding Window.",
            "Adaptive Succinctness.",
            "Safety in s-t Paths, Trails and Walks.",
            "Computing The Maximum Exponent in a Stream.",
            "Enumeration of Maximal Common Subsequences Between Two Strings.",
            "On the Complexity of Recognizing Wheeler Graphs.",
            "An Axiomatic Approach to Time-Dependent Shortest Path Oracles.",
            "Parameterized Complexity of (A, ℓ )-Path Packing.",
            "Streaming Dictionary Matching with Mismatches.",
            "A Practical Fixed-Parameter Algorithm for Constructing Tree-Child Networks from Multiple Binary Trees.",
            "Parameter Analysis for Guarding Terrains.",
            "A Refined Branching Algorithm for the Maximum Satisfiability Problem.",
            "Dynamic Averaging Load Balancing on Cycles.",
            "On Proper Labellings of Graphs with Minimum Label Sum.",
            "Linear-Time Algorithms for Maximum-Weight Induced Matchings and Minimum Chain Covers in Convex Bipartite Graphs.",
            "Fast and Longest Rollercoasters.",
            "Posimodular Function Optimization.",
            "A #SAT Algorithm for Small Constant-Depth Circuits with PTF gates.",
            "Linear-Time Recognition of Double-Threshold Graphs."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2021",
        "info": "2021: Volume\n83",
        "count": 129,
        "papers": [
            "Parameterized Dynamic Cluster Editing.",
            "Iterative Partial Rounding for Vertex Cover with Hard Capacities.",
            "Privately Outsourcing Exponentiation to a Single Server: Cryptanalysis and Optimal Constructions.",
            "Flip Distances Between Graph Orientations.",
            "Building a Nest by an Automaton.",
            "Learning Privately with Labeled and Unlabeled Examples.",
            "List 3-Coloring Graphs with No Induced P6+rP3.",
            "Distance and Routing Labeling Schemes for Cube-Free Median Graphs.",
            "On Structural Parameterizations of the Bounded-Degree Vertex Deletion Problem.",
            "Tight Bounds for Online Coloring of Basic Graph Classes.",
            "Polynomial Treedepth Bounds in Linear Colorings.",
            "CADbots: Algorithmic Aspects of Manipulating Programmable Matter with Finite Automata.",
            "Fault-Tolerant Covering Problems in Metric Spaces.",
            "The Complexity of Computational Problems About Nash Equilibria in Symmetric Win-Lose Games.",
            "Covert Computation in Self-Assembled Circuits.",
            "On the Tree Augmentation Problem.",
            "Constrained Minimum Passage Time in Random Geometric Graphs.",
            "On the Complexity of Colouring Antiprismatic Graphs.",
            "Non-Greedy Online Steiner Trees on Outerplanar Graphs.",
            "On Orthogonally Guarding Orthogonal Polygons with Bounded Treewidth.",
            "High Entropy Random Selection Protocols.",
            "Approximation Guarantee of OSP Mechanisms: The Case of Machine Scheduling and Facility Location.",
            "The Power of Cut-Based Parameters for Computing Edge-Disjoint Paths.",
            "Simultaneous Feedback Edge Set: A Parameterized Perspective.",
            "Special Issue on Algorithms and Data Structures (WADS 2019).",
            "Succinct Encodings for Families of Interval Graphs.",
            "Online Bin Covering with Advice.",
            "Graph Isomorphism for (H1, H2)-Free Graphs: An Almost Complete Dichotomy.",
            "Guess Free Maximization of Submodular and Linear Sums.",
            "Improved Streaming Algorithms for Maximizing Monotone Submodular Functions under a Knapsack Constraint.",
            "Preface to the Special Issue on Theory of Genetic and Evolutionary Computation.",
            "Runtime Performances of Randomized Search Heuristics for the Dynamic Weighted Vertex Cover Problem.",
            "Analysis of Noisy Evolutionary Optimization When Sampling Fails.",
            "Analysing the Robustness of Evolutionary Algorithms to Noise: Refined Runtime Bounds and an Example Where Noise is Beneficial.",
            "Runtime Analysis for Self-adaptive Mutation Rates.",
            "A Tight Runtime Analysis for the (μ + λ ) EA.",
            "The Complex Parameter Landscape of the Compact Genetic Algorithm.",
            "Fixed-Parameter Tractability of Crossover: Steady-State GAs on the Closest String Problem.",
            "The Inverse Voronoi Problem in Graphs II: Trees.",
            "Towards a Polynomial Kernel for Directed Feedback Vertex Set.",
            "Budget Feasible Mechanisms on Matroids.",
            "Matching Cut in Graphs with Large Minimum Degree.",
            "The Price of Defense.",
            "Universal Reconfiguration of Facet-Connected Modular Robots by Pivots: The O(1) Musketeers.",
            "Travelling on Graphs with Small Highway Dimension.",
            "Polynomial Time Approximation Schemes for All 1-Center Problems on Metric Rational Set Similarities.",
            "Packing Arc-Disjoint Cycles in Tournaments.",
            "Computing the Largest Bond and the Maximum Connected Cut of a Graph.",
            "Eternal Domination: D-Dimensional Cartesian and Strong Grids and Everything in Between.",
            "Popular Matchings in Complete Graphs.",
            "Approximating the Canadian Traveller Problem with Online Randomization.",
            "A Fast Algorithm for the Product Structure of Planar Graphs.",
            "Obtaining a Proportional Allocation by Deleting Items.",
            "On Structural Parameterizations of the Edge Disjoint Paths Problem.",
            "Average-Case Approximation Ratio of Scheduling without Payments.",
            "Optimal Matroid Partitioning Problems.",
            "Finding Cuts of Bounded Degree: Complexity, FPT and Exact Algorithms, and Kernelization.",
            "Range Majorities and Minorities in Arrays.",
            "Dispersing Obnoxious Facilities on a Graph.",
            "Improved Online Algorithms for Knapsack and GAP in the Random Order Model.",
            "Computing the Rooted Triplet Distance Between Phylogenetic Networks.",
            "Parameterized Counting of Partially Injective Homomorphisms.",
            "A Sub-exponential FPT Algorithm and a Polynomial Kernel for Minimum Directed Bisection on Semicomplete Digraphs.",
            "Active-Learning a Convex Body in Low Dimensions.",
            "Independent Sets and Hitting Sets of Bicolored Rectangular Families.",
            "Sorting a Permutation by Best Short Swaps.",
            "Correlation Clustering in Data Streams.",
            "Cluster Deletion on Interval Graphs and Split Related Graphs.",
            "A New Lower Bound for Classic Online Bin Packing.",
            "Producing Genomic Sequences after Genome Scaffolding with Ambiguous Paths: Complexity, Approximation and Lower Bounds.",
            "A Polynomial Kernel for Distance-Hereditary Vertex Deletion.",
            "Internal Dictionary Matching.",
            "Subexponential Parameterized Algorithms and Kernelization on Almost Chordal Graphs.",
            "Compact Distributed Certification of Planar Graphs.",
            "Convex-Straight-Skeleton Voronoi Diagrams for Segments and Convex Polygons.",
            "On the Minimum Consistent Subset Problem.",
            "Approximation in (Poly-) Logarithmic Space.",
            "The (2, k)-Connectivity Augmentation Problem: Algorithmic Aspects.",
            "On the Complexity of Finding Large Odd Induced Subgraphs and Odd Colorings.",
            "Online Multistage Subset Maximization Problems.",
            "A New Algorithm for the KDMDGP Subclass of Distance Geometry Problems with Exact Distances.",
            "The Maximum Binary Tree Problem.",
            "Special Issue Dedicated to the 14th International Symposium on Parameterized and Exact Computation.",
            "C-Planarity Testing of Embedded Clustered Graphs with Bounded Dual Carving-Width.",
            "Improved Analysis of Highest-Degree Branching for Feedback Vertex Set.",
            "Beating Treewidth for Average-Case Subgraph Isomorphism.",
            "Finding and Counting Permutations via CSPs.",
            "Faster algorithms for counting subgraphs in sparse graphs.",
            "Metric Dimension Parameterized By Treewidth.",
            "Subexponential-Time Algorithms for Finding Large Induced Sparse Subgraphs.",
            "On the Complexity of Broadcast Domination and Multipacking in Digraphs.",
            "Strongly Stable and Maximum Weakly Stable Noncrossing Matchings.",
            "Connectivity Keeping Trees in 2-Connected Graphs with Girth Conditions.",
            "Online Node- and Edge-Deletion Problems with Advice.",
            "Finding Temporal Paths Under Waiting Time Constraints.",
            "Scheduling in the Random-Order Model.",
            "Best Fit Bin Packing with Random Order Revisited.",
            "A Queueing Network-Based Distributed Laplacian Solver.",
            "A New Lower Bound for Deterministic Truthful Scheduling.",
            "On Girth and the Parameterized Complexity of Token Sliding and Token Jumping.",
            "Selfish Vector Packing.",
            "Online Budgeted Maximum Coverage.",
            "Editor's Note: Special Issue on Genetic and Evolutionary Computation.",
            "Multiplicative Up-Drift.",
            "The Runtime of the Compact Genetic Algorithm on Jump Functions.",
            "Self-Adjusting Mutation Rates with Provably Optimal Success Rules.",
            "Time Complexity Analysis of Randomized Search Heuristics for the Dynamic Graph Coloring Problem.",
            "Lower Bounds on the Runtime of Crossover-Based Algorithms via Decoupling and Family Graphs.",
            "Improved Runtime Results for Simple Randomised Search Heuristics on Linear Functions with a Uniform Constraint.",
            "Runtime Analyses of the Population-Based Univariate Estimation of Distribution Algorithms on LeadingOnes.",
            "On H-Topological Intersection Graphs.",
            "Near Isometric Terminal Embeddings for Doubling Metrics.",
            "Recognizing k-Clique Extendible Orderings.",
            "A Class of Random Recursive Tree Algorithms with Deletion.",
            "Encoding Two-Dimensional Range Top-k Queries.",
            "Connected Subgraph Defense Games.",
            "Succinct Encoding of Binary Strings Representing Triangulations.",
            "Network Design under General Wireless Interference.",
            "Maximizing Dominance in the Plane and its Applications.",
            "Translation Invariant Fréchet Distance Queries.",
            "Correction to: Outer 1-Planar Graphs.",
            "Online Makespan Scheduling with Job Migration on Uniform Machines.",
            "Parameterized Complexity of Small Weight Automorphisms and Isomorphisms.",
            "Top Tree Compression of Tries.",
            "Local Geometric Spanners.",
            "U-Bubble Model for Mixed Unit Interval Graphs and Its Applications: The MaxCut Problem Revisited.",
            "Dynamic Programming Approach to the Generalized Minimum Manhattan Network Problem.",
            "Approximation Algorithms for Maximally Balanced Connected Graph Partition.",
            "Maximum Box Problem on Stochastic Points."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2020",
        "info": "2020: Volume\n82",
        "count": 140,
        "papers": [
            "Parameterized Complexity of Geometric Covering Problems Having Conflicts.",
            "Connected Vertex Cover for (sP1+P5)-Free Graphs.",
            "A Polynomial Sized Kernel for Tracking Paths Problem.",
            "Attenuate Locally, Win Globally: Attenuation-Based Frameworks for Online Stochastic Matching with Timeouts.",
            "Extensions of Self-Improving Sorters.",
            "Succinct Non-overlapping Indexing.",
            "Mim-Width II. The Feedback Vertex Set Problem.",
            "Computing Vertex-Disjoint Paths in Large Graphs Using MAOs.",
            "Guest Editorial: Selected Papers from ISAAC 2017.",
            "Tilt Assembly: Algorithms for Micro-factories That Build Objects with Uniform External Forces.",
            "Envy-Free Matchings with Lower Quotas.",
            "Study of a Combinatorial Game in Graphs Through Linear Programming.",
            "A Simple Greedy Algorithm for Dynamic Graph Orientation.",
            "Maximum Induced Matching Algorithms via Vertex Ordering Characterizations.",
            "An Improved Algorithm for Computing All the Best Swap Edges of a Tree Spanner.",
            "On the Convergence Time of a Natural Dynamics for Linear Programming.",
            "Fast Compressed Self-indexes with Deterministic Linear-Time Construction.",
            "On Using Toeplitz and Circulant Matrices for Johnson-Lindenstrauss Transforms.",
            "Crossing Number for Graphs with Bounded Pathwidth.",
            "Special Issue on Analysis of Algorithms.",
            "Analytic Combinatorics of Lattice Paths with Forbidden Patterns, the Vectorial Kernel Method, and Generating Functions for Pushdown Automata.",
            "Asymptotic Analysis of Regular Sequences.",
            "QuickXsort: A Fast Sorting Scheme in Theory and Practice.",
            "Embedding Small Digraphs and Permutations in Binary Trees and Split Trees.",
            "Patterns in Random Permutations Avoiding Some Sets of Multiple Patterns.",
            "A Central Limit Theorem for Almost Local Additive Tree Functionals.",
            "Assortment Optimisation Under a General Discrete Choice Model: A Tight Analysis of Revenue-Ordered Assortments.",
            "Weak Coverage of a Rectangular Barrier.",
            "Local Algorithms for Sparse Spanning Graphs.",
            "Making Bidirected Graphs Strongly Connected.",
            "A Unified Framework for Clustering Constrained Data Without Locality Property.",
            "On the Relation of Strong Triadic Closure and Cluster Deletion.",
            "Quadratic Vertex Kernel for Rainbow Matching.",
            "On Bubble Generators in Directed Graphs.",
            "A Nearly Optimal Algorithm for the Geodesic Voronoi Diagram of Points in a Simple Polygon.",
            "Online Clique Clustering.",
            "Sorting Real Numbers in $O\\big (n\\sqrt{\\log n}\\big )$ Time and Linear Space.",
            "Correction to: Sorting Real Numbers in $O(n\\sqrt{\\log n})$ Time and Linear Space.",
            "Extended Learning Graphs for Triangle Finding.",
            "Streaming Algorithms for Maximizing Monotone Submodular Functions Under a Knapsack Constraint.",
            "Space-Efficient DFS and Applications to Connectivity Problems: Simpler, Leaner, Faster.",
            "Deterministic Dynamic Matching in O(1) Update Time.",
            "Non-Monochromatic and Conflict-Free Colorings on Tree Spaces and Planar Network Spaces.",
            "Stochastic Dominance and the Bijective Ratio of Online Algorithms.",
            "Stable Matchings with Covering Constraints: A Complete Computational Trichotomy.",
            "Computing a Pessimistic Stackelberg Equilibrium with Multiple Followers: The Mixed-Pure Case.",
            "A Constant-Time Algorithm for Middle Levels Gray Codes.",
            "Reachability Oracles for Directed Transmission Graphs.",
            "Testing Proximity to Subspaces: Approximate ℓ ∞ Minimization in Constant Time.",
            "Dividing Splittable Goods Evenly and With Limited Fragmentation.",
            "An Analysis of Budgeted Parallel Search on Conditional Galton-Watson Trees.",
            "Fully-Online Suffix Tree and Directed Acyclic Word Graph Construction for Multiple Texts.",
            "Consensus Strings with Small Maximum Distance and Small Distance Sum.",
            "Stable Matching with Uncertain Linear Preferences.",
            "The Geodesic Farthest-Point Voronoi Diagram in a Simple Polygon.",
            "Solving and Sampling with Many Solutions.",
            "Energy-Optimal Routes for Battery Electric Vehicles.",
            "Sublinear-Space and Bounded-Delay Algorithms for Maximal Clique Enumeration in Graphs.",
            "On the Complexity of Computing Treebreadth.",
            "Speeding Up the Gomory-Hu Parallel Cut Tree Algorithm with Efficient Graph Contractions.",
            "On the Complexity of Finding Internally Vertex-Disjoint Long Directed Paths.",
            "Nested Convex Bodies are Chaseable.",
            "An Optimal XP Algorithm for Hamiltonian Cycle on Graphs of Bounded Clique-Width.",
            "High-Dimensional Approximate r-Nets.",
            "Quasi-Polynomial Time Approximation Schemes for Packing and Covering Problems in Planar Graphs.",
            "Why Did the Shape of Your Network Change? (On Detecting Network Anomalies via Non-local Curvatures).",
            "Walking Through Waypoints.",
            "Shortest Paths in the Plane with Obstacle Violations.",
            "Colouring (Pr + Ps)-Free Graphs.",
            "Subgraph Complementation.",
            "Placing Labels in Road Maps: Algorithms and Complexity.",
            "Parameterized Orientable Deletion.",
            "Parameterized Complexity of Conflict-Free Matchings and Paths.",
            "Robust Reoptimization of Steiner Trees.",
            "The Parameterized Hardness of the k-Center Problem in Transportation Networks.",
            "Parameterized Aspects of Strong Subgraph Closure.",
            "The Generalized Definitions of the Two-Dimensional Largest Common Substructure Problems.",
            "Compressed Dynamic Range Majority and Minority Data Structures.",
            "The Distance-Constrained Matroid Median Problem.",
            "On the Optimality of Tape Merge of Two Lists with Similar Size.",
            "Special Issue Dedicated to the 13th International Symposium on Parameterized and Exact Computation.",
            "Multi-budgeted Directed Cuts.",
            "A Faster Tree-Decomposition Based Algorithm for Counting Linear Extensions.",
            "The Parameterised Complexity of Computing the Maximum Modularity of a Graph.",
            "Best-Case and Worst-Case Sparsifiability of Boolean CSPs.",
            "On the Distance Identifying Set Meta-problem and Applications to the Complexity of Identifying Problems on Graphs.",
            "Counting Induced Subgraphs: A Topological Approach to #W[1]-hardness.",
            "Multivariate Analysis of Orthogonal Range Searching and Graph Distances.",
            "Dual Parameterization of Weighted Coloring.",
            "Parameterized Leaf Power Recognition via Embedding into Graph Products.",
            "Parameterized Complexity of Independent Set in H-Free Graphs.",
            "A New Vertex Coloring Heuristic and Corresponding Chromatic Number.",
            "An Efficient Sum Query Algorithm for Distance-Based Locally Dominating Functions.",
            "On the Tractability of Optimization Problems on H-Graphs.",
            "The Approximability of Multiple Facility Location on Directed Networks with Random Arc Failures.",
            "An Efficient Exhaustive Search Algorithm for the Escherization Problem.",
            "A $3+\\varOmega (1)$ Lower Bound for Page Migration.",
            "Queue Layouts of Planar 3-Trees.",
            "Independent Set Reconfiguration Parameterized by Modular-Width.",
            "The Complexity of Tree Partitioning.",
            "Parameterized Multi-Scenario Single-Machine Scheduling Problems.",
            "On the Approximability of the Stable Matching Problem with Ties of Size Two.",
            "Compression of Dynamic Graphs Generated by a Duplication Model.",
            "A Unified Model and Algorithms for Temporal Map Labeling.",
            "Online Stochastic Matching: New Algorithms and Bounds.",
            "Sensor Network Topology Design and Analysis for Efficient Data Gathering by a Mobile Mule.",
            "Paired-Domination Problem on Distance-Hereditary Graphs.",
            "On Cycle Transversals and Their Connected Variants in the Absence of a Small Linear Forest.",
            "Sequential Metric Dimension.",
            "On the Approximate Compressibility of Connected Vertex Cover.",
            "Lipschitz Continuity and Approximate Equilibria.",
            "Computational Aspects of Ordered Integer Partitions with Bounds.",
            "Upward Planar Morphs.",
            "The Inverse Voronoi Problem in Graphs I: Hardness.",
            "Improved Approximation Algorithms for Path Vertex Covers in Regular Graphs.",
            "Special Issue on Computing and Combinatorics.",
            "Characterizing Star-PCGs.",
            "Approximating Global Optimum for Probabilistic Truth Discovery.",
            "Correction to: Reoptimization Time Analysis of Evolutionary Algorithms on Linear Functions Under Dynamic Uniform Constraints.",
            "Improved Solution to Data Gathering with Mobile Mule.",
            "Local Search Algorithms for the Maximum Carpool Matching Problem.",
            "Dynamic Clustering to Minimize the Sum of Radii.",
            "Lempel-Ziv-Like Parsing in Small Space.",
            "Efficient 1-Space Bounded Hypercube Packing Algorithm.",
            "Deterministic Treasure Hunt in the Plane with Angular Hints.",
            "Embedding Graphs into Embedded Graphs.",
            "Explicit Correlation Amplifiers for Finding Outlier Correlations in Deterministic Subquadratic Time.",
            "Greed is Good for Deterministic Scale-Free Networks.",
            "Efficient Online String Matching Based on Characters Distance Text Sampling.",
            "Correction to: Randomized Algorithms for Tracking Distributed Count, Frequencies, and Ranks.",
            "Non-preemptive Scheduling in a Smart Grid Model and Its Implications on Machine Minimization.",
            "Fault Tolerant Approximate BFS Structures with Additive Stretch.",
            "Using a Min-Cut Generalisation to Go Beyond Boolean Surjective VCSPs.",
            "The Power of Linear-Time Data Reduction for Maximum Matching.",
            "Subgraph Isomorphism on Graph Classes that Exclude a Substructure.",
            "Enumerating k-Arc-Connected Orientations.",
            "On Scheduling Coflows.",
            "An Adversarial Model for Scheduling with Testing.",
            "On the Benefits of Populations for the Exploitation Speed of Standard Steady-State Genetic Algorithms.",
            "Dynamic and Internal Longest Common Substring."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2019",
        "info": "2019: Volume\n81",
        "count": 161,
        "papers": [
            "New Online Algorithms for Story Scheduling in Web Advertising.",
            "Parameterized Algorithms for Max Colorable Induced Subgraph Problem on Perfect Graphs.",
            "On Almost Monge All Scores Matrices.",
            "Guarding Orthogonal Art Galleries with Sliding k-Transmitters: Hardness and Approximation.",
            "The Fair OWA One-to-One Assignment Problem: NP-Hardness and Polynomial Time Special Cases.",
            "Network Pollution Games.",
            "A Simple Projection Algorithm for Linear Programming Problems.",
            "Sparse Selfreducible Sets and Nonuniform Lower Bounds.",
            "Parameterized Complexity of Asynchronous Border Minimization.",
            "An FPT Algorithm for Planar Multicuts with Sources and Sinks on the Outer Face.",
            "Impact of Knowledge on Election Time in Anonymous Networks.",
            "An Optimal Algorithm for Minimum-Link Rectilinear Paths in Triangulated Rectilinear Domains.",
            "Linear Search by a Pair of Distinct-Speed Robots.",
            "Minimum-Cost b-Edge Dominating Sets on Trees.",
            "Structural Results on Matching Estimation with Applications to Streaming.",
            "Assortment Planning with Nested Preferences: Dynamic Programming with Distributions as States?",
            "Correction to: Counting Minimum Weight Arborescences.",
            "Foreword: Special Issue on Parameterized and Exact Computation.",
            "Subexponential-Time Algorithms for Maximum Independent Set in $$P_t$$ P t -Free and Broom-Free Graphs.",
            "Turbocharging Treewidth Heuristics.",
            "Backdoors for Linear Temporal Logic.",
            "Clifford Algebras Meet Tree Decompositions.",
            "Randomised Enumeration of Small Witnesses Using a Decision Oracle.",
            "Fine-Grained Dichotomies for the Tutte Plane and Boolean #CSP.",
            "Cutwidth: Obstructions and Algorithmic Aspects.",
            "Preface to the Special Issue on Theory of Genetic and Evolutionary Computation.",
            "The ( $$1+\\lambda $$ 1 + λ ) Evolutionary Algorithm with Self-Adjusting Mutation Rate.",
            "Upper Bounds on the Running Time of the Univariate Marginal Distribution Algorithm on OneMax.",
            "Level-Based Analysis of the Univariate Marginal Distribution Algorithm.",
            "Solving Problems with Unknown Solution Length at Almost No Extra Cost.",
            "Running Time Analysis of the ( $$1+1$$ 1 + 1 )-EA for OneMax and LeadingOnes Under Bit-Wise Noise.",
            "Sorting by Swaps with Noisy Comparisons.",
            "Reoptimization Time Analysis of Evolutionary Algorithms on Linear Functions Under Dynamic Uniform Constraints.",
            "On the Analysis of Trajectory-Based Search Algorithms: When is it Beneficial to Reject Improvements?",
            "Island Models Meet Rumor Spreading.",
            "Edge Bipartization Faster than $$2^k$$ 2 k.",
            "An Efficient Strongly Connected Components Algorithm in the Fault Tolerant Model.",
            "Beyond Classes of Graphs with \"Few\" Minimal Separators: FPT Results Through Potential Maximal Cliques.",
            "Approximation Algorithms for Min-Sum k-Clustering and Balanced k-Median.",
            "Fixed-Parameter Approximations for k-Center Problems in Low Highway Dimension Graphs.",
            "Polynomial Cases for the Vertex Coloring Problem.",
            "LP-Based Approximation Algorithms for Facility Location in Buy-at-Bulk Network Design.",
            "Station Assignment with Reallocation.",
            "The Minimum Feasible Tileset Problem.",
            "On the Separation and Equivalence of Paging Strategies and Other Online Algorithms.",
            "Space-Efficient Biconnected Components and Recognition of Outerplanar Graphs.",
            "Distributed Methods for Computing Approximate Equilibria.",
            "Faster Algorithms for Security Games on Matroids.",
            "The Power and Limitations of Uniform Samples in Testing Properties of Figures.",
            "Parameterized Algorithms for List K-Cycle.",
            "Deterministic Parallel Algorithms for Bilinear Objective Functions.",
            "Dynamic Graph Coloring.",
            "Independent Feedback Vertex Set for P5-Free Graphs.",
            "Fixed Block Compression Boosting in FM-Indexes: Theory and Practice.",
            "On Plane Constrained Bounded-Degree Spanners.",
            "Temporal Network Optimization Subject to Connectivity Constraints.",
            "On the Choice of the Update Strength in Estimation-of-Distribution Algorithms and Ant Colony Optimization.",
            "On the Classes of Interval Graphs of Limited Nesting and Count of Lengths.",
            "Maximum Plane Trees in Multipartite Geometric Graphs.",
            "A Polynomial-Time Algorithm for Detecting the Possibility of Braess Paradox in Directed Graphs.",
            "Track Layouts, Layered Path Decompositions, and Leveled Planarity.",
            "A Parameterized Algorithmics Framework for Degree Sequence Completion Problems in Directed Graphs.",
            "Explicit Linear Kernels for Packing Problems.",
            "Counting Linear Extensions: Parameterizations by Treewidth.",
            "Parameterized Algorithms and Kernels for Rainbow Matching.",
            "On Singleton Arc Consistency for CSPs Defined by Monotone Patterns.",
            "Expand the Shares Together: Envy-Free Mechanisms with a Small Number of Cuts.",
            "Binary Search in Graphs Revisited.",
            "Online Algorithms for Maximum Cardinality Matching with Edge Arrivals.",
            "O(f) Bi-criteria Approximation for Capacitated Covering with Hard Capacities.",
            "Characterizing and Recognizing 4-Map Graphs.",
            "Computing the Number of Induced Copies of a Fixed Graph in a Bounded Degree Graph.",
            "The k-Server Problem with Advice in d Dimensions and on the Sphere.",
            "Edge-Orders.",
            "Deterministic Leader Election Takes Θ(D+log n) Bit Rounds.",
            "Building an Optimal Point-Location Structure in O( sort (n)) I/Os.",
            "Online Dominating Set.",
            "Dynamic Graph Stream Algorithms in o(n) Space.",
            "Streaming Pattern Matching with d Wildcards.",
            "When Can Graph Hyperbolicity be Computed in Linear Time?",
            "On Smooth Orthogonal and Octilinear Drawings: Relations, Complexity and Kandinsky Drawings.",
            "Succinct Summing over Sliding Windows.",
            "Computing Dense Tensor Decompositions with Optimal Dimension Trees.",
            "Mind the Gap! - Online Dictionary Matching with One Gap.",
            "Approximate Span Programs.",
            "Hierarchical Partial Planarity.",
            "Randomized Algorithms for Tracking Distributed Count, Frequencies, and Ranks.",
            "Optimization with Demand Oracles.",
            "Improved Parameterized Algorithms for Network Query Problems.",
            "An Efficient Randomized Algorithm for Higher-Order Abstract Voronoi Diagrams.",
            "Covering Uncertain Points in a Tree.",
            "A Multiplicative Weight Updates Algorithm for Packing and Covering Semi-infinite Linear Programs.",
            "Computing L1 Shortest Paths Among Polygonal Obstacles in the Plane.",
            "Clustered Planarity with Pipes.",
            "Universal Slope Sets for 1-Bend Planar Drawings.",
            "New and Simple Algorithms for Stable Flow Problems.",
            "Revisiting Connected Dominating Sets: An Almost Optimal Local Information Algorithm.",
            "On the Complexity Landscape of Connected f-Factor Problems.",
            "Longest Common Substring with Approximately k Mismatches.",
            "Optimizing a Generalized Gini Index in Stable Marriage Problems: NP-Hardness, Approximation and a Polynomial Time Special Case.",
            "Region-Based Approximation of Probability Distributions (for Visibility Between Imprecise Points Among Obstacles).",
            "A General Purpose Algorithm for Counting Simple Cycles and Simple Paths of Any Length.",
            "Two Problems in Max-Size Popular Matchings.",
            "A Polynomial Time Algorithm for Read-Once Certification of Linear Infeasibility in UTVPI Constraints.",
            "Algorithms for Outerplanar Graph Roots and Graph Roots of Pathwidth at Most 2.",
            "A New Balanced Subdivision of a Simple Polygon for Time-Space Trade-Off Algorithms.",
            "Can We Recover the Cover?",
            "Rectangle Transformation Problem.",
            "Full Characterization of a Class of Graphs Tailored for Software Watermarking.",
            "A o(n)-Competitive Deterministic Algorithm for Online Matching on a Line.",
            "The Homogeneous Broadcast Problem in Narrow and Wide Strips I: Algorithms.",
            "The Homogeneous Broadcast Problem in Narrow and Wide Strips II: Lower Bounds.",
            "Subquadratic Algorithms for Succinct Stable Matching.",
            "A Unified Framework for Designing EPTAS for Load Balancing on Parallel Machines.",
            "Optimality Program in Segment and String Graphs.",
            "Correction to: Longest Common Substring with Approximately k Mismatches.",
            "Faster Approximate Diameter and Distance Oracles in Planar Graphs.",
            "An Algorithm to Compute the Nucleolus of Shortest Path Games.",
            "Nearly Constant Tile Complexity for any Shape in Two-Handed Tile Assembly.",
            "Stable Secretaries.",
            "Dynamic Space Efficient Hashing.",
            "Approximately Coloring Graphs Without Long Induced Paths.",
            "A Tight Lower Bound for Planar Steiner Orientation.",
            "Flexible Resource Allocation to Interval Jobs.",
            "Constrained Pseudorandom Functions for Turing Machines Revisited: How to Achieve Verifiability and Key Delegation.",
            "Primal-Dual and Dual-Fitting Analysis of Online Scheduling Algorithms for Generalized Flow-Time Problems.",
            "Size Versus Truthfulness in the House Allocation Problem.",
            "NodeTrix Planarity Testing with Small Clusters.",
            "The Complexity of Optimization on Grids.",
            "Two Approaches to Building Time-Windowed Geometric Data Structures.",
            "Minmax Regret k-Sink Location on a Dynamic Path Network with Uniform Capacities.",
            "Subset Feedback Vertex Set in Chordal and Split Graphs.",
            "Tight Tradeoffs for Real-Time Approximation of Longest Palindromes in Streams.",
            "Deleting Vertices to Graphs of Bounded Genus.",
            "An O(n log n) Time Algorithm for Computing the Path-Length Distance Between Trees.",
            "A Faster Algorithm for Cuckoo Insertion and Bipartite Matching in Large Graphs.",
            "A Fully Polynomial-Time Approximation Scheme for Speed Scaling with a Sleep State.",
            "Non-clairvoyantly Scheduling to Minimize Convex Functions.",
            "Improving and Extending the Testing of Distributions for Shape-Restricted Properties.",
            "The Parameterized Complexity of Cycle Packing: Indifference is Not an Issue.",
            "Editor's Note: Special Issue on Parameterized and Exact Computation.",
            "A Fixed-Parameter Perspective on #BIS.",
            "Optimal Data Reduction for Graph Coloring Using Low-Degree Polynomials.",
            "Generalized Feedback Vertex Set Problems on Bounded-Treewidth Graphs: Chordality is the Key to Single-Exponential Parameterized Algorithms.",
            "Turing Kernelization for Finding Long Paths in Graph Classes Excluding a Topological Minor.",
            "Tight Conditional Lower Bounds for Longest Common Increasing Subsequence.",
            "New Tools and Connections for Exponential-Time Approximation.",
            "Generalized Kakeya sets for polynomial evaluation and faster computation of fermionants.",
            "An Exponential Lower Bound for Cut Sparsifiers in Planar Graphs.",
            "How Much Does a Treedepth Modulator Help to Obtain Polynomial Kernels Beyond Sparse Graphs?",
            "Preface: Special Issue on WADS 2017.",
            "Approximating Small Balanced Vertex Separators in Almost Linear Time.",
            "Modular Circulation and Applications to Traffic Management.",
            "A Faster Algorithm for Truth Discovery via Range Cover.",
            "An EPTAS for Scheduling on Unrelated Machines of Few Different Types.",
            "Preface to the Special Issue on Computing and Combinatorics.",
            "Approximation Algorithms for the Maximum Weight Internal Spanning Tree Problem.",
            "Information Complexity of the AND Function in the Two-Party and Multi-party Settings.",
            "Optimal Online Two-Way Trading with Bounded Number of Transactions.",
            "Hardness and Structural Results for Half-Squares of Restricted Tree Convex Bipartite Graphs.",
            "Maximum Matching on Trees in the Online Preemptive and the Incremental Graph Models."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2018",
        "info": "2018: Volume\n80",
        "count": 164,
        "papers": [
            "Recognizing Optimal 1-Planar Graphs in Linear Time.",
            "Induced Minor Free Graphs: Isomorphism and Clique-Width.",
            "Near-Optimal Asymmetric Binary Matrix Partitions.",
            "Beyond Representing Orthology Relations by Trees.",
            "Edge-b-Coloring Trees.",
            "An FPT 2-Approximation for Tree-Cut Decomposition.",
            "3D Rectangulations and Geometric Matrix Multiplication.",
            "Colored Bin Packing: Online Algorithms and Lower Bounds.",
            "Matchings with Lower Quotas: Algorithms and Complexity.",
            "On the Complexity of Compressing Two Dimensional Routing Tables with Order.",
            "Ham-Sandwich Cuts for Abstract Order Types.",
            "A Connection Between Sports and Matroids: How Many Teams Can We Beat?",
            "Robust Proximity Search for Balls Using Sublinear Space.",
            "Stretch and Diameter in Random Geometric Graphs.",
            "Profiles of PATRICIA Tries.",
            "Simpler and Better Approximation Algorithms for the Unweighted Minimum Label s-t Cut Problem.",
            "Erratum to: Greedy Matching: Guarantees and Limitations.",
            "Stable Sets in {ISK4, wheel}-Free Graphs.",
            "Geometric Path Problems with Violations.",
            "Discounted Reward TSP.",
            "Crochemore's Partitioning on Weighted Strings and Applications.",
            "Spanners for Geodesic Graphs and Visibility Graphs.",
            "Approximating (Unweighted) Tree Augmentation via Lift-and-Project, Part I: Stemless TAP.",
            "Polynomial Interpolation and Identity Testing from High Powers Over Finite Fields.",
            "A Theory and Algorithms for Combinatorial Reoptimization.",
            "Approximating (Unweighted) Tree Augmentation via Lift-and-Project, Part II.",
            "New Bounds for the CLIQUE-GAP Problem Using Graph Decomposition Theory.",
            "Sublinear-Time Algorithms for Counting Star Subgraphs via Edge Sampling.",
            "Dictionary Matching with a Bounded Gap in Pattern or in Text.",
            "Output-Polynomial Enumeration on Graphs of Bounded (Local) Linear MIM-Width.",
            "Solving Problems on Graphs of High Rank-Width.",
            "Effect of Gromov-Hyperbolicity Parameter on Cuts and Expansions in Graphs and Some Algorithmic Implications.",
            "Minimizing the Diameter of a Spanning Tree for Imprecise Points.",
            "Guest Editorial: Special Issue on Theoretical Informatics.",
            "Routing in Unit Disk Graphs.",
            "Stabbing Circles for Sets of Segments in the Plane.",
            "Tree Compression Using String Grammars.",
            "Independent Set of Convex Polygons: From $$n^{\\epsilon }$$ n ϵ to $$1+\\epsilon $$ 1 + ϵ via Shrinking.",
            "Improved Spanning Ratio for Low Degree Plane Spanners.",
            "On the Planar Split Thickness of Graphs.",
            "Simple Approximation Algorithms for Balanced MAX 2SAT.",
            "Faster Information Gathering in Ad-Hoc Radio Tree Networks.",
            "Improved Approximation Algorithms for Capacitated Fault-Tolerant k-Center.",
            "Comparison-Based Buffer Management in QoS Switches.",
            "An Improved Approximation Algorithm for Knapsack Median Using Sparsification.",
            "On the Efficiency of All-Pay Mechanisms.",
            "Algorithms Parameterized by Vertex Cover and Modular Width, Through Potential Maximal Cliques.",
            "Approximating the Generalized Minimum Manhattan Network Problem.",
            "How Unsplittable-Flow-Covering Helps Scheduling with Job-Dependent Cost Functions.",
            "Simultaneous Embedding: Edge Orderings, Relative Positions, Cutvertices.",
            "From Discrepancy to Majority.",
            "Greedy Oriented Flows.",
            "Semi-Group Range Sum Revisited: Query-Space Lower Bound Tightened.",
            "An O(log OPT)-Approximation for Covering and Packing Minor Models of θr.",
            "Estimating the Makespan of the Two-Valued Restricted Assignment Problem.",
            "Optimal Staged Self-Assembly of General Shapes.",
            "Editorial: Special Issue on Computing and Combinatorics.",
            "Improved Approximation Algorithms for the Maximum Happy Vertices and Edges Problems.",
            "Sampling in Space Restricted Settings.",
            "Evaluation of Circuits Over Nilpotent and Polycyclic Groups.",
            "An Algorithmic Framework for Labeling Network Maps.",
            "A General Bin Packing Game: Interest Taken into Account.",
            "Towards Flexible Demands in Online Leasing Problems.",
            "Preface to the Special Issue on Theory of Genetic and Evolutionary Computation.",
            "The (1+1) Elitist Black-Box Complexity of LeadingOnes.",
            "How to Escape Local Optima in Black Box Optimisation: When Non-elitism Outperforms Elitism.",
            "The Impact of a Sparse Migration Topology on the Runtime of Island Models in Dynamic Optimization.",
            "Optimal Static and Self-Adjusting Parameter Choices for the (1+(λ, λ)) Genetic Algorithm.",
            "Optimal Mutation Rates for the (1+ λ ) EA on OneMax Through Asymptotically Tight Drift Analysis.",
            "Static and Self-Adjusting Mutation Strengths for Multi-valued Decision Variables.",
            "Guest Editorial: Special Issue on Combinatorial Optimization and Applications.",
            "Scaffolding Problems Revisited: Complexity, Approximation and Fixed Parameter Tractable Algorithms, and Some Special Cases.",
            "Discovering Small Target Sets in Social Networks: A Fast and Effective Algorithm.",
            "Optimal Approximation Algorithms for Maximum Distance-Bounded Subgraph Problems.",
            "Deleting Edges to Restrict the Size of an Epidemic: A New Application for Treewidth.",
            "Structural and Algorithmic Properties of 2-Community Structures.",
            "Optimal Self-Assembly of Finite Shapes at Temperature 1 in 3D.",
            "Trees, Paths, Stars, Caterpillars and Spiders.",
            "Guest Editorial: Special Issue on Compact Data Structures.",
            "LZ77 Computation Based on the Run-Length Encoded BWT.",
            "Lempel-Ziv-78 Compressed String Dictionaries.",
            "Lempel-Ziv Factorization Powered by Space Efficient Suffix Trees.",
            "Constant-Time Tree Traversal and Subtree Equality Check for Grammar-Compressed Trees.",
            "Compact Representation of Graphs of Small Clique-Width.",
            "Editorial: Special Issue on Algorithms and Computation.",
            "Optimal Composition Ordering Problems for Piecewise Linear Functions.",
            "Degree-Constrained Orientation of Maximum Satisfaction: Graph Classes and Parameterized Complexity.",
            "On (1,ϵ)-Restricted Max-Min Fair Allocation Problem.",
            "The Subset Assignment Problem for Data Placement in Caches.",
            "Approximability of Clique Transversal in Perfect Graphs.",
            "Constructing Tree-Child Networks from Distance Matrices.",
            "Planar Bus Graphs.",
            "The Partial Visibility Representation Extension Problem.",
            "Cliques in Hyperbolic Random Graphs.",
            "Ortho-polygon Visibility Representations of Embedded Graphs.",
            "Complexity Results for Generating Subgraphs.",
            "Partial-Matching RMS Distance Under Translation: Combinatorics and Algorithms.",
            "Model-Based Segmentation and Classification of Trajectories.",
            "Fast Compatibility Testing for Rooted Phylogenetic Trees.",
            "Shortest (A+B)-Path Packing Via Hafnian.",
            "Minimizing Latency of Capacitated k-Tours.",
            "Preface to Special Issue Dedicated to the 60th Birthday of Gregory Gutin.",
            "Editor's Note: Special Issue Dedicated to the 60th Birthday of Gregory Gutin.",
            "Clustering with Lower-Bounded Sizes - A General Graph-Theoretic Framework.",
            "Stable Matching Games: Manipulation via Subgraph Isomorphism.",
            "Linear Kernels and Linear-Time Algorithms for Finding Large Cuts.",
            "Fréchet Distance Between a Line and Avatar Point Set.",
            "Dynamic Parameterized Problems.",
            "Complexity of Token Swapping and Its Variants.",
            "Structural Parameterizations of Undirected Feedback Vertex Set: FPT Algorithms and Kernelization.",
            "A Moderately Exponential Time Algorithm for k-IBDD Satisfiability.",
            "A Clustering-Based Approach to Kinetic Closest Pair.",
            "Rank Reduction of Oriented Graphs by Vertex and Edge Deletions.",
            "Scheduling Distributed Clusters of Parallel Machines : Primal-Dual and LP-based Approximation Algorithms.",
            "Upper Domination: Towards a Dichotomy Through Boundary Properties.",
            "The A Priori Traveling Repairman Problem.",
            "The Induced Separation Dimension of a Graph.",
            "Dual-Based Approximation Algorithms for Cut-Based Network Connectivity Problems.",
            "The Ordered Covering Problem.",
            "Complexity of Secure Sets.",
            "Clique Clustering Yields a PTAS for Max-Coloring Interval Graphs.",
            "A Note on Submodular Function Minimization with Covering Type Linear Constraints.",
            "Approximation Algorithms for the Max-Buying Problem with Limited Supply.",
            "On Unrooted and Root-Uncertain Variants of Several Well-Known Phylogenetic Network Problems.",
            "A Faster Exact-Counting Protocol for Anonymous Dynamic Networks.",
            "Bounded-Hop Communication Networks.",
            "Metastability of Logit Dynamics for Coordination Games.",
            "Approximation Schemes for Stochastic Mean Payoff Games with Perfect Information and Few Random Positions.",
            "Algorithms for Communication Scheduling in Data Gathering Network with Data Compression.",
            "Spanning Trees in Multipartite Geometric Graphs.",
            "Optimal Deterministic Shallow Cuttings for 3-d Dominance Ranges.",
            "Dynamic Relative Compression, Dynamic Partial Sums, and Substring Concatenation.",
            "Improved Bounds in Stochastic Matching and Optimization.",
            "Finding Pairwise Intersections Inside a Query Range.",
            "Approximation Algorithms for Highly Connected Multi-dominating Sets in Unit Disk Graphs.",
            "Batch Coloring of Graphs.",
            "Data Structures for Halfplane Proximity Queries and Incremental Voronoi Diagrams.",
            "Online Constrained Forest and Prize-Collecting Network Design.",
            "Building Fences Straight and High: An Optimal Algorithm for Finding the Maximum Length You Can Cut k Times from Given Sticks.",
            "De-anonymization of Heterogeneous Random Graphs in Quasilinear Time.",
            "Correction to: A Connection Between Sports and Matroids: How Many Teams Can We Beat?",
            "Correction to: Trading Off Worst and Expected Cost in Decision Tree Problems.",
            "Fault-Tolerant Approximate Shortest-Path Trees.",
            "The Densest Subgraph Problem with a Convex/Concave Size Function.",
            "A Polynomial Kernel for Trivially Perfect Editing.",
            "An Improved Upper Bound on Maximal Clique Listing via Rectangular Fast Matrix Multiplication.",
            "Quantifying Competitiveness in Paging with Locality of Reference.",
            "Parameterized Complexity of Length-bounded Cuts and Multicuts.",
            "The Sandwich Problem for Decompositions and Almost Monotone Properties.",
            "Canonical Representations for Circular-Arc Graphs Using Flip Sets.",
            "Self-Stabilizing Balls and Bins in Batches - The Power of Leaky Bins.",
            "Not-All-Equal and 1-in-Degree Decompositions: Algorithmic Complexity and Applications.",
            "Dynamic Path Queries in Linear Space.",
            "Path Refinement in Weighted Regions.",
            "Quasimetric Embeddings and Their Applications.",
            "Approximation Schemes for Minimizing the Maximum Lateness on a Single Machine with Release Times Under Non-availability or Deadline Constraints.",
            "$$(k, n-k)$$ ( k , n - k ) -Max-Cut: An $$\\mathcal{O}^*(2^p)$$ O ∗ ( 2 p ) -Time Algorithm and a Polynomial Kernel.",
            "Online Packet Scheduling for CIOQ and Buffered Crossbar Switches.",
            "Fast Approximation Algorithms for p-Centers in Large $$\\delta $$ δ -Hyperbolic Graphs.",
            "Counting Minimum Weight Arborescences.",
            "Lift-and-Project Methods for Set Cover and Knapsack.",
            "Extreme Witnesses and Their Applications.",
            "Editor's Note.",
            "The Fast Search Number of a Complete k-Partite Graph."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2017",
        "info": "2017: Volumes\n77,\n78,\n79",
        "count": 158,
        "papers": [
            "Revenue and Reserve Prices in a Probabilistic Single Item Auction.",
            "Quantum Pattern Matching Fast on Average.",
            "Computing the Visibility Polygon of an Island in a Polygonal Domain.",
            "A Polynomial Time Approximation Scheme for the Closest Shared Center Problem.",
            "Campaign Management Under Approval-Driven Voting Rules.",
            "2D Lyndon Words and Applications.",
            "A Grouping Approach for Succinct Dynamic Dictionary Matching.",
            "Erratum to: A Grouping Approach for Succinct Dynamic Dictionary Matching.",
            "Maximizing a Submodular Function with Viability Constraints.",
            "Reconstructing Phylogenetic Level-1 Networks from Nondense Binet and Trinet Sets.",
            "Greedy Matching: Guarantees and Limitations.",
            "Engineering Parallel String Sorting.",
            "Fast Prefix Adders for Non-uniform Input Arrival Times.",
            "Certifying 3-Edge-Connectivity.",
            "Compressed Subsequence Matching and Packed Tree Coloring.",
            "Bounded-Angle Spanning Tree: Modeling Networks with Angular Constraints.",
            "A 2-Approximation Algorithm for Finding a Spanning Tree with Maximum Number of Leaves.",
            "Resilient Dynamic Programming.",
            "An Optimal Algorithm for the Weighted Backup 2-Center Problem on a Tree.",
            "Improved Subquadratic 3SUM.",
            "Improved Quantum Query Algorithms for Triangle Detection and Associativity Testing.",
            "Computing Approximate Nash Equilibria in Polymatrix Games.",
            "Minimizing Maximum (Weighted) Flow-Time on Related and Unrelated Machines.",
            "Tight Bounds for Active Self-Assembly Using an Insertion Primitive.",
            "Improved Approximation Algorithms for Projection Games.",
            "Max-Throughput for (Conservative) k-of-n Testing.",
            "A Polynomial Turing-Kernel for Weighted Independent Set in Bull-Free Graphs.",
            "Exact Algorithms for Minimum Weighted Dominating Induced Matching.",
            "Evaluation of Monotone DNF Formulas.",
            "Line-Distortion, Bandwidth and Path-Length of a Graph.",
            "I/O-Efficient Path Traversal in Succinct Planar Graphs.",
            "Combinatorial Auctions Without Money.",
            "Efficient Algorithms for Clique-Colouring and Biclique-Colouring Unichord-Free Graphs.",
            "Combinatorial Relaxation Algorithm for the Entire Sequence of the Maximum Degree of Minors.",
            "The Price of Optimum: Complexity and Approximation for a Matching Game.",
            "Online Square-into-Square Packing.",
            "Improved Approximation Algorithms for Box Contact Representations.",
            "The Price of Anarchy in Bilateral Network Formation in an Adversary Model.",
            "Exclusive Graph Searching.",
            "Local Computation Algorithms for Graphs of Non-constant Degrees.",
            "Improved Pseudo-polynomial Bound for the Value Problem and Optimal Strategy Synthesis in Mean Payoff Games.",
            "Strip Planarity Testing for Embedded Planar Graphs.",
            "An On-line Competitive Algorithm for Coloring Bipartite Graphs Without Long Induced Paths.",
            "Extending Partial Representations of Proper and Unit Interval Graphs.",
            "A Constant Factor Approximation Algorithm for the Storage Allocation Problem.",
            "Finding a Shortest Non-zero Path in Group-Labeled Graphs via Permanent Computation.",
            "Short Sequences of Improvement Moves Lead to Approximate Equilibria in Constraint Satisfaction Games.",
            "A Generalization of Multiple Choice Balls-into-Bins: Tight Bounds.",
            "Efficient Indexes for Jumbled Pattern Matching with Constant-Sized Alphabet.",
            "A Tight Algorithm for Strongly Connected Steiner Subgraph on Two Terminals with Demands.",
            "Optimal Program-Size Complexity for Self-Assembled Squares at Temperature 1 in 3D.",
            "Finding Dominating Induced Matchings in P8 -Free Graphs in Polynomial Time.",
            "Binary Pattern Tile Set Synthesis Is NP-Hard.",
            "Minimizing the Aggregate Movements for Interval Coverage.",
            "Steiner Trees with Bounded RC-Delay.",
            "List H-Coloring a Graph by Removing Few Vertices.",
            "Approximating the Maximum Overlap of Polygons under Translation.",
            "A Combinatorial Certifying Algorithm for Linear Feasibility in UTVPI Constraints.",
            "Distribution-Sensitive Construction of the Greedy Spanner.",
            "Computing the Center of Uncertain Points on Tree Networks.",
            "Optimization with Uniform Size Queries.",
            "On the Parameterized Complexity of Reconfiguration Problems.",
            "The Maximum Labeled Path Problem.",
            "Algorithms for k-Internal Out-Branching and k-Tree in Bounded Degree Graphs.",
            "Linear Rank-Width of Distance-Hereditary Graphs I. A Polynomial-Time Algorithm.",
            "Top-k Term-Proximity in Succinct Space.",
            "An External-Memory Algorithm for String Graph Construction.",
            "Strategyproof Mechanisms for Competitive Influence in Networks.",
            "Succinct Indices for Path Minimum, with Applications.",
            "Online Makespan Minimization with Parallel Schedules.",
            "Max-min Fair Rate Allocation and Routing in Energy Harvesting Networks: Algorithmic Analysis.",
            "Preface to the Special Issue on Theory of Genetic and Evolutionary Computation.",
            "Time Complexity Analysis of Evolutionary Algorithms on Random Satisfiable k-CNF Formulas.",
            "The Interplay of Population Size and Mutation Probability in the (1 + λ) EA on OneMax.",
            "OneMax in Black-Box Models with Several Restrictions.",
            "A Runtime Analysis of Parallel Evolutionary Algorithms in Dynamic Optimization.",
            "Populations Can Be Essential in Tracking Dynamic Optima.",
            "Towards a Runtime Comparison of Natural and Artificial Evolution.",
            "On Easiest Functions for Mutation Operators in Bio-Inspired Optimisation.",
            "FPTAS for Minimizing the Earth Mover's Distance Under Rigid Transformations and Related Problems.",
            "Primal-Dual Algorithms for Precedence Constrained Covering Problems.",
            "Resolving Braess's Paradox in Random Networks.",
            "Online Packet-Routing in Grids with Bounded Buffers.",
            "Robustness of the Rotor-Router Mechanism.",
            "On Computing an Optimal Semi-matching.",
            "Identification, Location-Domination and Metric Dimension on Interval and Permutation Graphs. II. Algorithms and Complexity.",
            "Extending Partial Representations of Interval Graphs.",
            "Asynchronous Rumor Spreading on Random Graphs.",
            "Connectivity Graphs of Uncertainty Regions.",
            "On the Succinct Representation of Equivalence Classes.",
            "Improved Algorithms for Distributed Entropy Monitoring.",
            "Stable Matching with Network Externalities.",
            "Guest Editors' Foreword.",
            "An Experimental Evaluation of the Best-of-Many Christofides' Algorithm for the Traveling Salesman Problem.",
            "Improved Analysis of Complete-Linkage Clustering.",
            "How to Sort by Walking and Swapping on Paths and Trees.",
            "On the Approximability of Digraph Ordering.",
            "Multicuts in Planar and Bounded-Genus Graphs with Bounded Number of Terminals.",
            "Explicit Expanding Expanders.",
            "Scheduling with Deadlines and Buffer Management with Processing Requirements.",
            "I/O-Efficient Similarity Join.",
            "Guest Editorial: Special Issue on Parameterized and Exact Computation.",
            "Sparsification Upper and Lower Bounds for Graph Problems and Not-All-Equal SAT.",
            "Strong ETH and Resolution via Games and the Multiplicity of Strategies.",
            "Parameterized Complexity of Sparse Linear Complementarity Problems.",
            "An FPT Algorithm and a Polynomial Kernel for Linear Rankwidth-1 Vertex Deletion.",
            "On Kernelization and Approximation for the Vector Connectivity Problem.",
            "Fixed-Parameter Tractable Distances to Sparse Graph Classes.",
            "Linear Kernels for Outbranching Problems in Sparse Digraphs.",
            "Extending the Kernel for Planar Steiner Tree to the Number of Steiner Vertices.",
            "Parameterized and Approximation Algorithms for the Load Coloring Problem.",
            "Complexity and Approximability of Parameterized MAX-CSPs.",
            "A Polynomial Kernel for Block Graph Deletion.",
            "Quick but Odd Growth of Cacti.",
            "Efficient Computation of Substring Equivalence Classes with Suffix Arrays.",
            "General Caching Is Hard: Even with Small Pages.",
            "Convex Hulls Under Uncertainty.",
            "Set It and Forget It: Approximating the Set Once Strip Cover Problem.",
            "Full-Fledged Real-Time Indexing for Constant Size Alphabets.",
            "On the Recognition of Fan-Planar and Maximal Outer-Fan-Planar Graphs.",
            "Efficiently Correcting Matrix Products.",
            "The Book Thickness of 1-Planar Graphs is Constant.",
            "Incremental Algorithm for Maintaining a DFS Tree for Undirected Graphs.",
            "Efficient Sampling Methods for Discrete Distributions.",
            "Optimal Parallel Quantum Query Algorithms.",
            "Building Efficient and Compact Data Structures for Simplicial Complexes.",
            "Efficient Computation of Optimal Energy and Fractional Weighted Flow Trade-Off Schedules.",
            "On the Value of Job Migration in Online Makespan Minimization.",
            "Random and Conditional (t, k)-Diagnosis of Hypercubes.",
            "Metric Decompositions of Path-Separable Graphs.",
            "On Polynomial Kernelization of H-free Edge Deletion.",
            "Multivariate Complexity Analysis of Geometric Red Blue Set Cover.",
            "Chain Minors are FPT.",
            "Secluded Connectivity Problems.",
            "Exact Sampling Algorithms for Latin Squares and Sudoku Matrices via Probabilistic Divide-and-Conquer.",
            "Decision Trees for Function Evaluation: Simultaneous Optimization of Worst and Expected Cost.",
            "Editor's Note: Special Issue on Combinatorial Pattern Matching.",
            "Parameterized Complexity of Superstring Problems.",
            "String Powers in Trees.",
            "Combinatorial RNA Design: Designability and Structure-Approximating Algorithm in Watson-Crick and Nussinov-Jacobson Energy Models.",
            "A Framework for Space-Efficient String Kernels.",
            "Guest Editors' Foreword.",
            "Trading Off Worst and Expected Cost in Decision Tree Problems.",
            "On the Approximability of the Minimum Rainbow Subgraph Problem and Other Related Problems.",
            "When Patrolmen Become Corrupted: Monitoring a Graph Using Faulty Mobile Robots.",
            "Quantum Algorithm for Triangle Finding in Sparse Graphs.",
            "Partial Sorting Problem on Evolving Data.",
            "Special Issue: Algorithmic Tools in Cryptography.",
            "On the Information Ratio of Non-perfect Secret Sharing Schemes.",
            "On Virtual Grey Box Obfuscation for General Circuits.",
            "On the Impossibility of Cryptography with Tamperable Randomness.",
            "Scalable Zero Knowledge Via Cycles of Elliptic Curves.",
            "Improved Generic Attacks Against Hash-Based MACs and HAIFA.",
            "How to Eat Your Entropy and Have it Too: Optimal Recovery Strategies for Compromised RNGs.",
            "Multiparty Key Exchange, Efficient Traitor Tracing, and More from Indistinguishability Obfuscation.",
            "Self-Bilinear Map on Unknown Order Groups from Indistinguishability Obfuscation and Its Applications.",
            "Hardness of k-LWE and Applications in Traitor Tracing.",
            "On the Implausibility of Differing-Inputs Obfuscation and Extractable Witness Encryption with Auxiliary Input."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2016",
        "info": "2016: Volumes\n74,\n75,\n76",
        "count": 146,
        "papers": [
            "One-Variable Word Equations in Linear Time.",
            "Improved Approximation for Orienting Mixed Graphs.",
            "Space-Efficient Substring Occurrence Estimation.",
            "A 1.5-Approximation Algorithm for Two-Sided Scaffold Filling.",
            "Convergecast and Broadcast by Power-Aware Mobile Agents.",
            "Online Scheduling of Jobs with Fixed Start Times on Related Machines.",
            "Parametric Packing of Selfish Items and the Subset Sum Algorithm.",
            "New Approximability Results for Two-Dimensional Bin Packing.",
            "Fast Algorithms for the Undirected Negative Cost Cycle Detection Problem.",
            "3SUM, 3XOR, Triangles.",
            "Linear-Space Data Structures for Range Frequency Queries on Arrays and Trees.",
            "Parameterizations of Test Cover with Bounded Test Sizes.",
            "Algorithms and Almost Tight Results for 3-Colorability of Small Diameter Graphs.",
            "The Higher-Order Voronoi Diagram of Line Segments.",
            "The Hospitals/Residents Problem with Lower Quotas.",
            "Randomized Fixed-Parameter Algorithms for the Closest String Problem.",
            "Analysis of Quickselect Under Yaroslavskiy's Dual-Pivoting Algorithm.",
            "Online Bin Packing with Advice.",
            "PTAS for Densest k-Subgraph in Interval Graphs.",
            "Backdoors to q-Horn.",
            "The Focus of Attention Problem.",
            "Randomized Approximation for the Set Multicover Problem in Hypergraphs.",
            "How to Allocate Goods in an Online Market?",
            "Parameterized Algorithms for Finding Square Roots.",
            "On Group Feedback Vertex Set Parameterized by the Size of the Cutset.",
            "The Complexity of Separating Points in the Plane.",
            "Authenticated Hash Tables Based on Cryptographic Accumulators.",
            "An Exact Algorithm for TSP in Degree-3 Graphs Via Circuit Procedure and Amortization on Connectivity Structure.",
            "Succinct Dynamic Cardinal Trees.",
            "Multi-rooted Greedy Approximation of Directed Steiner Trees with Applications.",
            "Space-Efficient Estimation of Statistics Over Sub-Sampled Streams.",
            "The Two-Handed Tile Assembly Model is not Intrinsically Universal.",
            "Quantum Walks Can Find a Marked Element on Any Graph.",
            "Anonymous Meeting in Networks.",
            "Constrained Multilinear Detection and Generalized Graph Motifs.",
            "New Approximation Results for Resource Replication Problems.",
            "On the Ordered List Subgraph Embedding Problems.",
            "Fixed-Parameter and Approximation Algorithms for Maximum Agreement Forests of Multifurcating Trees.",
            "Testing Lipschitz Functions on Hypergrid Domains.",
            "Optimal Encodings for Range Majority Queries.",
            "Compressed String Dictionary Search with Edit Distance One.",
            "Strong Articulation Points and Strong Bridges in Large Scale Graphs.",
            "Vertex Cover Meets Scheduling.",
            "Stackelberg Bipartite Vertex Cover and the Preflow Algorithm.",
            "Fair Matchings and Related Problems.",
            "Shrinking Maxima, Decreasing Costs: New Online Packing and Covering Problems.",
            "Maximum Likelihood Analysis of the Ford-Fulkerson Method on Special Graphs.",
            "Configurations and Minority in the String Consensus Problem.",
            "Outer 1-Planar Graphs.",
            "A Closer Look at Multiple Forking: Leveraging (In)Dependence for a Tighter Bound.",
            "On Resilient Graph Spanners.",
            "A 'Stochastic Safety Radius' for Distance-Based Tree Reconstruction.",
            "Distance Oracles for Time-Dependent Networks.",
            "Assigning Channels Via the Meet-in-the-Middle Approach.",
            "Structural Parameterizations for Boxicity.",
            "Erratum to: Signature Theory in Holographic Algorithms.",
            "A Parameterized Study of Maximum Generalized Pattern Matching Problems.",
            "Matroid and Knapsack Center Problems.",
            "New Approximation Algorithms for the Unsplittable Capacitated Facility Location Problem.",
            "A Fast Algorithm for Permutation Pattern Matching Based on Alternating Runs.",
            "Chordal Editing is Fixed-Parameter Tractable.",
            "Computing Directed Pathwidth in O(1.89n) Time.",
            "Two-Page Book Embeddings of 4-Planar Graphs.",
            "Guest Editorial: Selected Papers from WG 2014.",
            "Separation Dimension of Graphs and Hypergraphs.",
            "A New Characterization of Pk-Free Graphs.",
            "Between Treewidth and Clique-Width.",
            "Foreword: Special Issue on IPEC 2014.",
            "Erratum to: Foreword: Special Issue on IPEC 2014.",
            "The Parameterized Complexity of Geometric Graph Isomorphism.",
            "On the Read-Once Property of Branching Programs and CNFs of Bounded Treewidth.",
            "Finding Shortest Paths Between Graph Colourings.",
            "Solving Linear Equations Parameterized by Hamming Weight.",
            "The Relative Exponential Time Complexity of Approximate Counting Satisfying Assignments.",
            "Graph Isomorphism Parameterized by Elimination Distance to Bounded Degree.",
            "Polynomial Kernels and User Reductions for the Workflow Satisfiability Problem.",
            "AND-Compression of NP-Complete Problems: Streamlined Proof and Minor Observations.",
            "Guest Editorial: Theory of Evolutionary Computation.",
            "Runtime Analysis of Non-elitist Populations: From Classical Optimisation to Partial Information.",
            "Robustness of Populations in Stochastic Environments.",
            "Concentration of First Hitting Times Under Additive Drift.",
            "Superpolynomial Lower Bounds for the (1+1) EA on Some Easy Combinatorial Problems.",
            "The Impact of Random Initialization on the Runtime of Randomized Search Heuristics.",
            "MMAS Versus Population-Based EA on a Family of Dynamic Fitness Functions.",
            "Introduction for S.I. AofA14.",
            "An Asymptotic Analysis of Labeled and Unlabeled k-Trees.",
            "Compositions into Powers of b: Asymptotic Enumeration and Parameters.",
            "Analysis of Pivot Sampling in Dual-Pivot Quicksort: A Holistic Analysis of Yaroslavskiy's Partitioning Scheme.",
            "On the Cost of Fixed Partial Match Queries in K-d Trees.",
            "A Unified Approach to Linear Probing Hashing with Buckets.",
            "Asymptotic Lattice Path Enumeration Using Diagonals.",
            "Complexity of Anticipated Rejection Algorithms and the Darling-Mandelbrot Distribution.",
            "Improving Quantum Query Complexity of Boolean Matrix Multiplication Using Graph Collision.",
            "Inference Algorithms for Pattern-Based CRFs on Sequence Data.",
            "Extending Convex Partial Drawings of Graphs.",
            "An Improved Deterministic #SAT Algorithm for Small de Morgan Formulas.",
            "Online Network Design with Outliers.",
            "Convergence to Equilibrium of Logit Dynamics for Strategic Games.",
            "Strategyproof Facility Location for Concave Cost Functions.",
            "Model Counting for CNF Formulas of Bounded Modular Treewidth.",
            "Strict Self-Assembly of Fractals Using Multiple Hands.",
            "Multi-sided Boundary Labeling.",
            "Triangle Counting in Dynamic Graph Streams.",
            "Parameterized Algorithms for Non-separating Trees and Branchings in Digraphs.",
            "Approximate Well-supported Nash Equilibria Below Two-thirds.",
            "Algorithms and Kernels for Feedback Set Problems in Generalizations of Tournaments.",
            "It's a Small World for Random Surfers.",
            "An O(n2) Algorithm for the Limited-Capacity Many-to-Many Point Matching in One Dimension.",
            "Planar Disjoint-Paths Completion.",
            "Matrix Sparsification and the Sparse Null Space Problem.",
            "Succinct Posets.",
            "Observability of Lattice Graphs.",
            "Streaming Algorithms for Independent Sets in Sparse Hypergraphs.",
            "Distributed Universality.",
            "Polynomial-Time Approximation Schemes for Circle and Other Packing Problems.",
            "Largest Chordal and Interval Subgraphs Faster than $$2^n$$ 2 n.",
            "Guest Editorial for Information Complexity and Applications.",
            "Common Information and Unique Disjointness.",
            "Deterministic Compression with Uncertain Priors.",
            "Superlinear Lower Bounds for Multipass Graph Processing.",
            "Zero-Information Protocols and Unambiguity in Arthur-Merlin Communication.",
            "A Direct Product Theorem for Two-Party Bounded-Round Public-Coin Communication Complexity.",
            "Towards a Reverse Newman's Theorem in Interactive Information Complexity.",
            "Direct Sum Fails for Zero-Error Average Communication.",
            "Certifying Equality With Limited Interaction.",
            "A Discrepancy Lower Bound for Information Complexity.",
            "Computing and Combinatorics.",
            "Approximating Maximum Agreement Forest on Multiple Binary Trees.",
            "Building Above Read-Once Polynomials: Identity Testing and Hardness of Representation.",
            "Diffuse Reflection Radius in a Simple Polygon.",
            "Preface-S.I.: LATIN 2014.",
            "A Randomized Incremental Algorithm for the Hausdorff Voronoi Diagram of Non-crossing Clusters.",
            "Conjugacy in Baumslag's Group, Generic Case Complexity, and Division in Power Circuits.",
            "Counting and Generating Permutations in Regular Classes.",
            "2-Xor Revisited: Satisfiability and Probabilities of Functions.",
            "Approximating Vector Scheduling: Almost Matching Upper and Lower Bounds.",
            "Biased Predecessor Search.",
            "Generalised and Quotient Models for Random And/Or Trees and Application to Satisfiability.",
            "A Randomized O(log n)-Competitive Algorithm for the Online Connected Facility Location Problem.",
            "Guest Editor's Foreword.",
            "Dynamic Algorithms for Multimachine Interval Scheduling Through Analysis of Idle Intervals.",
            "On the Computational Complexity of Vertex Integrity and Component Order Connectivity.",
            "A Short Implicant of a CNF Formula with Many Satisfying Assignments.",
            "Faster Algorithms for Computing the R* Consensus Tree.",
            "An FPTAS for the Volume Computation of 0-1 Knapsack Polytopes Based on Approximate Convolution.",
            "The Power and Limitations of Static Binary Search Trees with Lazy Finger."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2015",
        "info": "2015: Volumes\n71,\n72,\n73",
        "count": 130,
        "papers": [
            "Minimum Fill-in of Sparse Graphs: Kernelization and Approximation.",
            "List Coloring in the Absence of a Linear Forest.",
            "Approximating Minimum Manhattan Networks in Higher Dimensions.",
            "Sparse Fault-Tolerant Spanners for Doubling Metrics with Bounded Hop-Diameter or Degree.",
            "Generalised k-Steiner Tree Problems in Normed Planes.",
            "A Quadratic Vertex Kernel for Feedback Arc Set in Bipartite Tournaments.",
            "On Tree-Constrained Matchings and Generalizations.",
            "Colored Hypergraph Isomorphism is Fixed Parameter Tractable.",
            "The Euclidean Bottleneck Full Steiner Tree Problem.",
            "Polynomial Time Algorithm for Min-Ranks of Graphs with Simple Tree Structures.",
            "An O(n4) Time Algorithm to Compute the Bisection Width of Solid Grid Graphs.",
            "An Algorithmic Characterization of Polynomial Functions over Zpn.",
            "Metrical Service Systems with Multiple Servers.",
            "Monotone Drawings of Graphs with Fixed Embedding.",
            "Geometric BWT: Compressed Text Indexing via Sparse Suffixes and Range Searching.",
            "Online File Caching with Rejection Penalties.",
            "Computing Klee's Measure of Grounded Boxes.",
            "Parameterized Analysis of Paging and List Update Algorithms.",
            "Balanced Partitions of Trees and Applications.",
            "An Analysis Framework for Distributed Hierarchical Directories.",
            "Oblivious Algorithms for the Maximum Directed Cut Problem.",
            "The k-Nearest-Neighbor Voronoi Diagram Revisited.",
            "Isotonic Regression for Multiple Independent Variables.",
            "Linear-Time Algorithms for Tree Root Problems.",
            "Local Correction with Constant Error Rate.",
            "Using Patterns to Form Homogeneous Teams.",
            "Guest Editorial: Special Issue on Parameterized and Exact Computation.",
            "On Subexponential and FPT-Time Inapproximability.",
            "Multi-parameter Analysis for Local Graph Partitioning Problems: Using Greediness for Parameterization.",
            "Pure Nash Equilibria in Graphical Games and Treewidth.",
            "On Sparsification for Computing Treewidth.",
            "Speeding Up Dynamic Programming with Representative Sets: An Experimental Evaluation of Algorithms for Steiner Tree on Tree Decompositions.",
            "On the Space and Circuit Complexity of Parameterized Problems: Classes and Completeness.",
            "A Completeness Theory for Polynomial (Turing) Kernelization.",
            "Incompressibility of H-Free Edge Modification Problems.",
            "Obtaining Matrices with the Consecutive Ones Property by Row Deletions.",
            "On Exact Quantum Query Complexity.",
            "Better Approximation Algorithms for the Maximum Internal Spanning Tree Problem.",
            "The Maximum Clique Problem in Multiple Interval Graphs.",
            "Scheduling with an Orthogonal Resource Constraint.",
            "Fast Distance Multiplication of Unit-Monge Matrices.",
            "Analyses of Cardinal Auctions.",
            "Fully Dynamic Recognition of Proper Circular-Arc Graphs.",
            "Linked Dynamic Tries with Applications to LZ-Compression in Sublinear Time and Space.",
            "Faster Parameterized Algorithms for Deletion to Split Graphs.",
            "Data Structures on Event Graphs.",
            "Linear Recognition and Embedding of Fibonacci Cubes.",
            "Asymptotically Optimal Online Page Migration on Three Points.",
            "Testing the Supermodular-Cut Condition.",
            "Capacitated Domination: Problem Complexity and Approximation Algorithms.",
            "Enforcing Efficient Equilibria in Network Design Games via Subsidies.",
            "Streaming Algorithms for Extent Problems in High Dimensions.",
            "Modifying a Graph Using Vertex Elimination.",
            "Approximating Minimum-Cost Connected T-Joins.",
            "Average Case Network Lifetime on an Interval with Adjustable Sensing Ranges.",
            "Incentive Compatible Mulit-Unit Combinatorial Auctions: A Primal Dual Approach.",
            "Special Issue on New Theoretical Challenges in Machine Learning.",
            "A Spectral Algorithm for Latent Dirichlet Allocation.",
            "Provable ICA with Unknown Gaussian Noise, and Implications for Gaussian Mixtures and Autoencoders.",
            "Randomized Partition Trees for Nearest Neighbor Search.",
            "Randomized Algorithms for Low-Rank Matrix Factorizations: Sharp Performance Bounds.",
            "Statistical Active Learning Algorithms for Noise Tolerance and Differential Privacy.",
            "Learning Poisson Binomial Distributions.",
            "Hitting All Maximal Independent Sets of a Bipartite Graph.",
            "Worst-Case Optimal Tree Layout in External Memory.",
            "Optimal Point Movement for Covering Circular Regions.",
            "Exponentially Improved Algorithms and Lower Bounds for Testing Signed Majorities.",
            "Resequencing a Set of Strings Based on a Target String.",
            "Suffix Trays and Suffix Trists: Structures for Faster Text Indexing.",
            "Communication Complexity of Quasirandom Rumor Spreading.",
            "Approximability of Capacitated Network Design.",
            "Compressing Dictionary Matching Index via Sparsification Technique.",
            "Local Embeddings of Metric Spaces.",
            "A Fast Parallel Algorithm for Minimum-Cost Small Integral Flows.",
            "The Approximate Rectangle of Influence Drawability Problem.",
            "Angle-Restricted Steiner Arborescences for Flow Map Layout.",
            "On the Parameterized Complexity of Finding Separators with Non-Hereditary Properties.",
            "An Improved Approximation Algorithm for the Minimum Cost Subset k-Connected Subgraph Problem.",
            "Max-Cut Parameterized Above the Edwards-Erdős Bound.",
            "k-Chordal Graphs: From Cops and Robber to Compact Routing via Treewidth.",
            "A Fast and Simple Subexponential Fixed Parameter Algorithm for One-Sided Crossing Minimization.",
            "Improved Space-Time Tradeoffs for Approximate Full-Text Indexing with One Edit Error.",
            "Parameterized Algorithms for the 2-Clustering Problem with Minimum Sum and Minimum Sum of Squares Objective Functions.",
            "An Incremental Polynomial Time Algorithm to Enumerate All Minimal Edge Dominating Sets.",
            "D2-Tree: A New Overlay with Deterministic Bounds.",
            "Program Size and Temperature in Self-Assembly.",
            "Linear-Space Data Structures for Range Minority Query in Arrays.",
            "Restricted and Swap Common Superstring: A Multivariate Algorithmic Perspective.",
            "A General Reduction Theorem with Applications to Pathwidth and the Complexity of MAX 2-CSP.",
            "A Comparison of Performance Measures for Online Algorithms.",
            "Augmenting Graphs to Minimize the Diameter.",
            "Register Loading via Linear Programming.",
            "A Linear-Time Algorithm for Testing Outer-1-Planarity.",
            "Computing on Rings by Oblivious Robots: A Unified Approach for Different Tasks.",
            "Space-Time Trade-offs for Stack-Based Algorithms.",
            "The (Weighted) Metric Dimension of Graphs: Hard and Easy Cases.",
            "Testing Outerplanarity of Bounded Degree Graphs.",
            "Performance Analysis of the (1+1) Evolutionary Algorithm for the Multiprocessor Scheduling Problem.",
            "Random Shortest Paths: Non-Euclidean Instances for Metric Optimization Problems.",
            "On Feedback Vertex Set: New Measure and New Structures.",
            "Initializing Sensor Networks of Non-uniform Density in the Weak Sensor Model.",
            "A Quasipolynomial Time Approximation Scheme for Euclidean Capacitated Vehicle Routing.",
            "On Minimum Sum of Radii and Diameters Clustering.",
            "Maximum Metric Spanning Tree Made Byzantine Tolerant.",
            "Computing Tree-Depth Faster Than 2n.",
            "Fast Algorithm for Partial Covers in Words.",
            "A General Method for Estimating Correlated Aggregates Over a Data Stream.",
            "What's the Frequency, Kenneth?: Sublinear Fourier Sampling Off the Grid.",
            "b-Coloring is NP-hard on Co-bipartite Graphs and Polytime Solvable on Tree-Cographs.",
            "Regular Augmentation of Planar Graphs.",
            "Algorithmic and Hardness Results for the Colorful Components Problems.",
            "Reallocation Problems in Scheduling.",
            "Facets for Art Gallery Problems.",
            "On Randomized Fictitious Play for Approximating Saddle Points Over Convex Sets.",
            "Improved Approximation Algorithms for the Facility Location Problems with Linear/Submodular Penalties.",
            "A Quantization Framework for Smoothed Analysis of Euclidean Optimization Problems.",
            "Logit Dynamics with Concurrent Updates for Local Interaction Potential Games.",
            "A Faster Computation of All the Best Swap Edges of a Shortest Paths Tree.",
            "Binary Jumbled Pattern Matching on Trees and Tree-Like Structures.",
            "Computing the Greedy Spanner in Linear Space.",
            "The Compressed Annotation Matrix: An Efficient Data Structure for Computing Persistent Cohomology.",
            "Guest Editors Foreword.",
            "RAM-Efficient External Memory Sorting.",
            "Exact Sublinear Binomial Sampling.",
            "Tight Bounds for Sliding Bloom Filters.",
            "On the Number of Edges of Fan-Crossing Free Graphs.",
            "Myhill-Nerode Methods for Hypergraphs.",
            "Pursuit Evasion on Polyhedral Surfaces.",
            "Editorial.",
            "Erratum to: Editorial."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2014",
        "info": "2014: Volumes\n68,\n69,\n70",
        "count": 119,
        "papers": [
            "Algorithms for Placing Monitors in a Flow Network.",
            "A Uniform Paradigm to Succinctly Encode Various Families of Trees.",
            "Parameterized Complexity of Eulerian Deletion Problems.",
            "Graph Balancing: A Special Case of Scheduling Unrelated Parallel Machines.",
            "A Cubic-Vertex Kernel for Flip Consensus Tree.",
            "Contracting Graphs to Paths and Trees.",
            "Online Metric Tracking and Smoothing.",
            "Evolutionary Algorithms for Quantum Computers.",
            "Worst Case and Probabilistic Analysis of the 2-Opt Algorithm for the TSP.",
            "Conflict-Free Chromatic Art Gallery Coverage.",
            "Erratum to: Conflict-Free Chromatic Art Gallery Coverage.",
            "Polynomial-Time Approximation Schemes for Subset-Connectivity Problems in Bounded-Genus Graphs.",
            "Approximation Algorithms for Intersection Graphs.",
            "Finding Best Swap Edges Minimizing the Routing Cost of a Spanning Tree.",
            "Emergency Connectivity in Ad-hoc Networks with Selfish Nodes.",
            "A Randomized O(log2 k)-Competitive Algorithm for Metric Bipartite Matching.",
            "Speed Scaling on Parallel Processors.",
            "An Optimal Lower Bound for Buffer Management in Multi-Queue Switches.",
            "Relative Convex Hulls in Semi-Dynamic Arrangements.",
            "The Complexity of the Empire Colouring Problem.",
            "The Kernelization Complexity of Connected Domination in Graphs with (no) Small Cycles.",
            "On Succinct Greedy Drawings of Plane Triangulations and 3-Connected Plane Graphs.",
            "Sex-Equal Stable Matchings: Complexity and Exact Algorithms.",
            "Ranking-Based Black-Box Complexity.",
            "On Cartesian Trees and Range Minimum Queries.",
            "Efficient Computation of the Characteristic Polynomial of a Tree and Related Tasks.",
            "A Distributed O(1)-Approximation Algorithm for the Uniform Facility Location Problem.",
            "On the Complexity of the Regenerator Cost Problem in General Networks with Traffic Grooming.",
            "Scheduling Partially Ordered Jobs Faster than 2 n.",
            "On Making a Distinguished Vertex of Minimum Degree by Vertex Deletion.",
            "Fixed-Parameter Tractability of Satisfying Beyond the Number of Variables.",
            "A 25/17-Approximation Algorithm for the Stable Marriage Problem with One-Sided Ties.",
            "Multicommodity Flow in Trees: Packing via Covering and Iterated Relaxation.",
            "Computing the Map of Geometric Minimal Cuts.",
            "Spin-the-Bottle Sort and Annealing Sort: Oblivious Sorting via Round-Robin Random Comparisons.",
            "Orthogonal Graph Drawing with Flexibility Constraints.",
            "Constructing Minimal Phylogenetic Networks from Softwired Clusters is Fixed Parameter Tractable.",
            "Fast Sequential Importance Sampling to Estimate the Graph Reliability Polynomial.",
            "On Cutwidth Parameterized by Vertex Cover.",
            "2-Layer Right Angle Crossing Drawings.",
            "Dominating Induced Matchings for P 7-Free Graphs in Linear Time.",
            "Online Square Packing with Gravity.",
            "Improved Approximation Algorithms for the Average-Case Tree Searching Problem.",
            "On the Complexity of Time-Dependent Shortest Paths.",
            "Is Submodularity Testable?",
            "Robust Algorithms for Preemptive Scheduling.",
            "Shortest Path Problems on a Polyhedral Surface.",
            "Approximating Fixation Probabilities in the Generalized Moran Process.",
            "Compact Navigation and Distance Oracles for Graphs with Small Treewidth.",
            "Counting or Producing All Fixed Cardinality Transversals.",
            "Augmenting Edge-Connectivity between Vertex Subsets.",
            "On the Least Trimmed Squares Estimator.",
            "Analysis of Agglomerative Clustering.",
            "Enumerating Minimal Subset Feedback Vertex Sets.",
            "Efficient Fully-Compressed Sequence Representations.",
            "The Parameterized Complexity of the Shared Center Problem.",
            "Necklaces, Convolutions, and X+Y.",
            "Opaque Sets.",
            "On the Complexity of Strongly Connected Components in Directed Hypergraphs.",
            "New Algorithms for Facility Location Problems on the Real Line.",
            "Substring Range Reporting.",
            "Switching to Directional Antennas with Constant Increase in Radius and Hop Distance.",
            "Outlier Respecting Points Approximation.",
            "On Minimum Witnesses for Boolean Matrix Multiplication.",
            "Improved Approximation Algorithms for the Min-max Tree Cover and Bounded Tree Cover Problems.",
            "Limitations of Incremental Dynamic Programming.",
            "Editor's Note.",
            "Polynomial Time Complexity of Edge Colouring Graphs with Bounded Colour Classes.",
            "Detecting Fixed Patterns in Chordal Graphs in Polynomial Time.",
            "Thresholds for Extreme Orientability.",
            "An Intersection Model for Multitolerance Graphs: Efficient Algorithms and Hierarchy.",
            "On the Huffman and Alphabetic Tree Problem with General Cost Functions.",
            "An SDP Primal-Dual Algorithm for Approximating the Lovász-Theta Function.",
            "Improving the Price of Anarchy for Selfish Routing via Coordination Mechanisms.",
            "Improved Algorithms for Partial Curve Matching.",
            "Sparse Covers for Planar Graphs and Graphs that Exclude a Fixed Minor.",
            "Inclusion/Exclusion Meets Measure and Conquer.",
            "Better Size Estimation for Sparse Matrix Products.",
            "Practical and Efficient Circle Graph Recognition.",
            "Practical and Efficient Split Decomposition via Graph-Labelled Trees.",
            "On the Advantage of Overlapping Clusters for Minimizing Conductance.",
            "Cache-Oblivious Hashing.",
            "An Approximation Algorithm for the Tree t-Spanner Problem on Unweighted Graphs via Generalized Chordal Graphs.",
            "Optimal Indexes for Sparse Bit Vectors.",
            "Computing the Throughput of Probabilistic and Replicated Streaming Applications.",
            "Multikey Quickselect.",
            "Editorial: COCOON 2012 Special Issue.",
            "A Linear Time Algorithm for Computing Minmax Regret 1-Median on a Tree Network.",
            "A Simple D 2-Sampling Based PTAS for k-Means and Other Clustering Problems.",
            "Lower Bounds Against Weakly-Uniform Threshold Circuits.",
            "Online Unweighted Knapsack Problem with Removal Cost.",
            "Online Coloring of Bipartite Graphs with and without Advice.",
            "Geodesic Order Types.",
            "Towards Optimal and Expressive Kernelization for d-Hitting Set.",
            "Editorial.",
            "A Generalization of the Convex Kakeya Problem.",
            "An Equivariance Theorem with Applications to Renaming.",
            "Solving the 2-Disjoint Connected Subgraphs Problem Faster than 2 n.",
            "A Randomized Sieving Algorithm for Approximate Integer Programming.",
            "Computing H-Joins with Application to 2-Modular Decomposition.",
            "Analysis of the Strategy \"Hiring Above the $$m$$ m -th Best Candidate\".",
            "Random Walks, Bisections and Gossiping in Circulant Graphs.",
            "The Feedback Arc Set Problem with Triangle Inequality Is a Vertex Cover Problem.",
            "Degree Constrained Node-Connectivity Problems.",
            "Guest Editorial: Selected Papers of European Symposium of Algorithms.",
            "A Model for Minimizing Active Processor Time.",
            "The Simplex Tree: An Efficient Data Structure for General Simplicial Complexes.",
            "Explicit and Efficient Hash Families Suffice for Cuckoo Hashing with a Stash.",
            "Polynomial-Time Algorithms for Energy Games with Special Weight Structures.",
            "Resource Buying Games.",
            "Parameterized Complexity of Induced Graph Matching on Claw-Free Graphs.",
            "Routing Regardless of Network Stability.",
            "On the Computational Complexity of Measuring Global Stability of Banking Networks.",
            "A Nearly Linear-Time PTAS for Explicit Fractional Packing and Covering Linear Programs.",
            "Contention Resolution under Selfishness.",
            "Preface Algorithms and Computation (ISAAC 2012).",
            "A Framework for Succinct Labeled Ordinal Trees over Large Alphabets.",
            "The Minimum Vulnerability Problem.",
            "Strong Conflict-Free Coloring for Intervals."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2013",
        "info": "2013: Volumes\n65,\n66,\n67",
        "count": 108,
        "papers": [
            "Computing Unrestricted Synopses Under Maximum Error Bound.",
            "Mapping Simple Polygons: How Robots Benefit from Looking Back.",
            "Collecting Weighted Items from a Dynamic Queue.",
            "Exact and Parameterized Algorithms for Max Internal Spanning Tree.",
            "Exact Algorithms for Finding Longest Cycles in Claw-Free Graphs.",
            "Relaxed Spanners for Directed Disk Graphs.",
            "Exponential Inapproximability of Selecting a Maximum Volume Sub-matrix.",
            "The Longest Path Problem Is Polynomial on Cocomparability Graphs.",
            "Optimal Tracking of Distributed Heavy Hitters and Quantiles.",
            "Adaptive Drift Analysis.",
            "Online Clustering with Variable Sized Clusters.",
            "Cleaning Interval Graphs.",
            "Route-Enabling Graph Orientation Problems.",
            "Unified Compression-Based Acceleration of Edit-Distance Computation.",
            "A Fully Compressed Algorithm for Computing the Edit Distance of Run-Length Encoded Strings.",
            "I/O Efficient Dynamic Data Structures for Longest Prefix Queries.",
            "Two-stage Robust Network Design with Exponential Scenarios.",
            "Streaming Graph Computations with a Helpful Advisor.",
            "Power Domination in Circular-Arc Graphs.",
            "A Simpler and More Efficient Algorithm for the Next-to-Shortest Path Problem.",
            "Computing a Hamiltonian Path of Minimum Euclidean Length Inside a Simple Polygon.",
            "Improved Approximation Algorithms for the Spanning Star Forest Problem.",
            "The Parameterized Complexity of Unique Coverage and Its Variants.",
            "Approximation Algorithms for the Directed k-Tour and k-Stroll Problems.",
            "Computing Without Communicating: Ring Exploration by Asynchronous Oblivious Robots.",
            "Computing Optimal Steiner Trees in Polynomial Space.",
            "Online Speed Scaling Based on Active Job Count to Minimize Flow Plus Energy.",
            "Stochastic Budget Optimization in Internet Advertising.",
            "Succinct 2D Dictionary Matching.",
            "Sublinear Algorithms for Approximating String Compressibility.",
            "Guest Editorial: Special Issue on Parameterized and Exact Computation, Part II.",
            "Small Vertex Cover makes Petri Net Coverability and Boundedness Easier.",
            "Fixed-Parameter Evolutionary Algorithms and the Vertex Cover Problem.",
            "A Tree Traversal Algorithm for Decision Problems in Knot Theory and 3-Manifold Topology.",
            "Parameterized Two-Player Nash Equilibrium.",
            "On the Exact Complexity of Evaluating Quantified k -CNF.",
            "Finding and Counting Vertex-Colored Subtrees.",
            "Proper Interval Vertex Deletion.",
            "Fast Polynomial-Space Algorithms Using Inclusion-Exclusion.",
            "On the Grundy and b-Chromatic Numbers of a Graph.",
            "On the (Non-)Existence of Polynomial Kernels for P  l -Free Edge Modification Problems.",
            "Tile Complexity of Approximate Squares.",
            "Approximate Shortest Paths Avoiding a Failed Vertex: Near Optimal Data Structures for Undirected Unweighted Graphs.",
            "Engineering a New Algorithm for Distributed Shortest Paths on Dynamic Networks.",
            "Maximum Matching in Regular and Almost Regular Graphs.",
            "Isotonic Regression via Partitioning.",
            "Greedy Δ-Approximation Algorithm for Covering with Arbitrary Constraints and Submodular Cost.",
            "Negative Interactions in Irreversible Self-assembly.",
            "Fast Maximal Cliques Enumeration in Sparse Graphs.",
            "Donation Center Location Problem.",
            "A Lower Bound of 1+φ for Truthful Scheduling Mechanisms.",
            "On the Largest Empty Axis-Parallel Box Amidst n Points.",
            "Improved Bounds for Finger Search on a RAM.",
            "List Factoring and Relative Worst Order Analysis.",
            "Lower Bounds on Performance of Metric Tree Indexing Schemes for Exact Similarity Search in High Dimensions.",
            "Constructing the R* Consensus Tree of Two Trees in Subcubic Time.",
            "Computing the Maximum Degree of Minors in Mixed Polynomial Matrices via Combinatorial Relaxation.",
            "A Linear-Time Algorithm for Finding Locally Connected Spanning Trees on Circular-Arc Graphs.",
            "Smoothed Analysis of Partitioning Algorithms for Euclidean Functionals.",
            "Fast Phylogeny Reconstruction Through Learning of Ancestral Sequences.",
            "PASS Approximation: A Framework for Analyzing and Designing Heuristics.",
            "How to Use Spanning Trees to Navigate in Graphs.",
            "Efficient Coordination Mechanisms for Unrelated Machine Scheduling.",
            "Recognizing d-Interval Graphs and d-Track Interval Graphs.",
            "Approximate Guarding of Monotone and Rectilinear Polygons.",
            "Median Trajectories.",
            "Improved Algorithms for Some Competitive Location Centroid Problems on Paths, Trees and Graphs.",
            "On Finding Min-Min Disjoint Paths.",
            "A Linear Time Algorithm for L(2, 1)-Labeling of Trees.",
            "Approximating Points by a Piecewise Linear Function.",
            "Encoding and Constructing 1-Nested Phylogenetic Networks with Trinets.",
            "Guest Editorial.",
            "A Central Limit Theorem for the Number of Degree-k Vertices in Random Maps.",
            "Analysis of the \"Hiring Above the Median\" Selection Strategy for the Hiring Problem.",
            "Inequalities for the Number of Walks in Graphs.",
            "Asymptotic Enumeration of Extensional Acyclic Digraphs.",
            "Message Passing Algorithms for MLS-3LIN Problem.",
            "Guest Editorial: Selected Papers from ISAAC 2011.",
            "Linear-Time Algorithms for Hole-free Rectilinear Proportional Contact Graph Representations.",
            "External-Memory Multimaps.",
            "The School Bus Problem on Trees.",
            "Diameter and Broadcast Time of Random Geometric Graphs in Arbitrary Dimensions.",
            "The Parameterized Complexity of Local Search for TSP, More Refined.",
            "Editorial Note.",
            "Derandomizing the HSSW Algorithm for 3-SAT.",
            "Compressed Directed Acyclic Word Graph with Application in Local Alignment.",
            "FlipCut Supertrees: Towards Matrix Representation Accuracy in Polynomial Time.",
            "On the Rainbow Connectivity of Graphs: Complexity and FPT Algorithms.",
            "Algorithms for Partition of Some Class of Graphs under Compaction and Vertex-Compaction.",
            "Self-Assembling Rulers for Approximating Generalized Sierpinski Carpets.",
            "Approximately Uniform Online Checkpointing with Bounded Memory.",
            "The Parallel Complexity of Graph Canonization Under Abelian Group Action.",
            "On Total Unimodularity of Edge-Edge Adjacency Matrices.",
            "Guest Editorial for \"Group Testing: models and applications\".",
            "Unbounded Contention Resolution in Multiple-Access Channels.",
            "Rounds in Combinatorial Search.",
            "Two New Perspectives on Multi-Stage Group Testing.",
            "Efficient Two-Stage Group Testing Algorithms for Genetic Screening.",
            "Synthetic Sequence Design for Signal Location Search.",
            "Improved Constructions for Non-adaptive Threshold Group Testing.",
            "Black-Box Trace&Revoke Codes.",
            "Editorial.",
            "Deterministic Discrepancy Minimization.",
            "On Variants of the Matroid Secretary Problem.",
            "A Universal Randomized Packet Scheduling Algorithm.",
            "Preprocess, Set, Query!",
            "Distribution-Aware Compressed Full-Text Indexes.",
            "Motion Planning via Manifold Samples."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2012",
        "info": "2012: Volumes\n62,\n63,\n64",
        "count": 136,
        "papers": [
            "Weighted Matching in the Semi-Streaming Model.",
            "Biased Range Trees.",
            "Complexity of Finding Graph Roots with Girth Conditions.",
            "Stronger Lempel-Ziv Based Compressed Text Indexing.",
            "Approximation Schemes for Packing Splittable Items with Cardinality Constraints.",
            "A Linear Algorithm for the Random Sampling from Regular Languages.",
            "A Self-stabilizing Algorithm for the Median Problem in Partial Rectangular Grids and Their Relatives.",
            "Faster Swap Edge Computation in Minimum Diameter Spanning Trees.",
            "Construction Sequences and Certifying 3-connectivity.",
            "Fast Arc-Annotated Subsequence Matching in Linear Space.",
            "Succinct Representation of Labeled Graphs.",
            "Mapping Filtering Streaming Applications.",
            "Drawing (Complete) Binary Tanglegrams - Hardness, Approximation, Fixed-Parameter Tractability.",
            "Competitive Weighted Matching in Transversal Matroids.",
            "A Scheme for Computing Minimum Covers within Simple Regions.",
            "Many Distances in Planar Graphs.",
            "Fast Algorithms for max independent set.",
            "Shortest Paths in Time-Dependent FIFO Networks.",
            "Pruning 2-Connected Graphs.",
            "Aligning Two Convex Figures to Minimize Area or Perimeter.",
            "An Efficient Quantum Algorithm for the Hidden Subgroup Problem in Nil-2 Groups.",
            "The k-in-a-Path Problem for Claw-free Graphs.",
            "Approximability of the Firefighter Problem - Computing Cuts over Time.",
            "Finding Induced Paths of Given Parity in Claw-Free Graphs.",
            "The Parameterized Complexity of Stabbing Rectangles.",
            "Of Choices, Failures and Asynchrony: The Many Faces of Set Agreement.",
            "The Steiner Ratio Gilbert-Pollak Conjecture Is Still Open - Clarification Statement.",
            "Erratum to: Linear Time Algorithms for Generalized Edge Dominating Set Problems.",
            "Philippe Flajolet, the Father of Analytic Combinatorics.",
            "On Independent Sets and Bicliques in Graphs.",
            "Exponential Lower Bounds on the Complexity of a Class of Dynamic Programs for Combinatorial Optimization Problems.",
            "Property Testing on k-Vertex-Connectivity of Graphs.",
            "Additive Spanners and Distance and Routing Labeling Schemes for Hyperbolic Graphs.",
            "Stackelberg Network Pricing Games.",
            "An O(n+m) Certifying Triconnnectivity Algorithm for Hamiltonian Graphs.",
            "Convergence to Equilibria in Distributed, Selfish Reallocation Processes with Weighted Tasks.",
            "Divide-and-Conquer Algorithms for Partitioning Hypergraphs and Submodular Systems.",
            "Obtaining a Planar Graph by Vertex Deletion.",
            "Partitioning a Weighted Tree into Subtrees with Weights in a Given Range.",
            "Efficient Observer-Dependent Simplification in Polygonal Domains.",
            "Generalizing a Theorem of Wilber on Rotations in Binary Search Trees to Encompass Unordered Binary Trees.",
            "On Smoothed Analysis of Quicksort and Hoare's Find.",
            "Euclidean Prize-Collecting Steiner Forest.",
            "Approximation and Tidying - A Problem Kernel for s-Plex Cluster Vertex Deletion.",
            "An Efficient Algorithm for Haplotype Inference on Pedigrees with a Small Number of Recombinants.",
            "On the Complexity of Optimal Hotlink Assignment.",
            "Ping Pong in Dangerous Graphs: Optimal Black Hole Search with Pebbles.",
            "A Constant-Approximate Feasibility Test for Multiprocessor Real-Time Scheduling.",
            "A Weakly Robust PTAS for Minimum Clique Partition in Unit Disk Graphs.",
            "Fully Dynamic Geometric Spanners.",
            "Continuous Monitoring of Distributed Data Streams over a Time-Based Sliding Window.",
            "Approximating Optimal Binary Decision Trees.",
            "A Linear-Time Algorithm for Star-Shaped Drawings of Planar Graphs with the Minimum Number of Concave Corners.",
            "Schnyder Decompositions for Regular Plane Graphs and Application to Drawing.",
            "Approximation Algorithms for the Traveling Repairman and Speeding Deliveryman Problems.",
            "Near-Linear Approximation Algorithms for Geometric Hitting Sets.",
            "Graph Decomposition for Memoryless Periodic Exploration.",
            "Almost Exact Matchings.",
            "Contribution Games in Networks.",
            "On the Hitting Times of Quantum Versus Random Walks.",
            "Reducing Tile Complexity for the Self-assembly of Scaled Shapes Through Temperature Programming.",
            "Maximum Series-Parallel Subgraph.",
            "A Distributed Algorithm for Computing the Node Search Number in Trees.",
            "A Primal-Dual Approximation Algorithm for the Facility Location Problem with Submodular Penalties.",
            "Succinct and I/O Efficient Data Structures for Traversal in Trees.",
            "Faster Algorithms for All-Pairs Small Stretch Distances in Weighted Graphs.",
            "On Equilibria for ADM Minimization Games.",
            "Minimize the Maximum Duty in Multi-interface Networks.",
            "A Competitive Analysis for Balanced Transactional Memory Workloads.",
            "An Exact Exponential Time Algorithm for Power Dominating Set.",
            "Improved Approximation Algorithms for Data Migration.",
            "Interval Partitions and Polynomial Factorization.",
            "Approximating Node-Connectivity Augmentation Problems.",
            "Improved Competitive Performance Bounds for CIOQ Switches.",
            "Approximation Algorithms and Hardness Results for Packing Element-Disjoint Steiner Trees in Planar Graphs.",
            "External Memory Planar Point Location with Logarithmic Updates.",
            "Layered Working-Set Trees.",
            "Bipartite Matching in the Semi-streaming Model.",
            "Average Case Analysis of Moore's State Minimization Algorithm.",
            "Polynomial Kernelizations for MIN F+Π1 and MAX NP.",
            "Minimum Manhattan Network Problem in Normed Planes with Polygonal Balls: A Factor 2.5 Approximation Algorithm.",
            "Guest Editorial: Special Issue on Latin American Theoretical Informatics Symposium (LATIN).",
            "Pairs of Complementary Unary Languages with \"Balanced\" Nondeterministic Automata.",
            "The Complexity of Counting Eulerian Tours in 4-regular Graphs.",
            "Minimum-Perimeter Intersecting Polygons.",
            "Gradual Sub-lattice Reduction and a New Complexity for Factoring Polynomials.",
            "The Power of Fair Pricing Mechanisms.",
            "Counting Hexagonal Patches and Independent Sets in Circle Graphs.",
            "Optimal Polygonal Representation of Planar Graphs.",
            "Sharp Separation and Applications to Exact and Parameterized Algorithms.",
            "Lightweight Data Indexing and Compression in External Memory.",
            "Guest Editorial.",
            "When LP Is the Cure for Your Matching Woes: Improved Bounds for Stochastic Matchings.",
            "Feasibility Analysis of Sporadic Real-Time Multiprocessor Task Systems.",
            "Caching Is Hard - Even in the Fault Model.",
            "Local Search Algorithms for the Red-Blue Median Problem.",
            "On Space Efficient Two Dimensional Range Minimum Data Structures.",
            "A Complete Characterization of Group-Strategyproof Mechanisms of Cost-Sharing.",
            "f-Sensitivity Distance Oracles and Routing Schemes.",
            "Guest Editorial: Special Issue on Parameterized and Exact Computation, Part I.",
            "Well Quasi Orders in Subclasses of Bounded Treewidth Graphs and Their Algorithmic Applications.",
            "Algorithmic Meta-theorems for Restrictions of Treewidth.",
            "Parameterized Modal Satisfiability.",
            "A New Lower Bound on the Maximum Number of Satisfied Clauses in Max-SAT and Its Algorithmic Applications.",
            "Fast Minor Testing in Planar Graphs.",
            "Parameterized Complexity of the Spanning Tree Congestion Problem.",
            "Parameterized Complexity Results for General Factors in Bipartite Graphs with an Application to Constraint Programming.",
            "Multivariate Complexity Analysis of Swap Bribery.",
            "Cluster Editing: Kernelization Based on Edge Cuts.",
            "An Improved FPT Algorithm and a Quadratic Kernel for Pathwidth One Vertex Deletion.",
            "Parameterized Measure & Conquer for Problems with No Small Kernels.",
            "Guest Editorial: Computing and Combinatorics.",
            "Shorthand Universal Cycles for Permutations.",
            "Zero-Knowledge Argument for Simultaneous Discrete Logarithms.",
            "Tile-Packing Tomography Is NP-hard.",
            "Counting Paths in VPA Is Complete for #NC 1.",
            "Exact and Approximation Algorithms for Geometric and Capacitated Set Cover Problems.",
            "Finding Maximum Edge Bicliques in Convex Bipartite Graphs.",
            "Guest Editorial: Special Issue on Algorithms and Computation.",
            "Beyond Good Partition Shapes: An Analysis of Diffusive Graph Partitioning.",
            "Improved Algorithms for Even Factors and Square-Free Simple b-Matchings.",
            "3-Colouring AT-Free Graphs in Polynomial Time.",
            "Minimum Cost Partitions of Trees with Supply and Demand.",
            "Improved Bounds on the Planar Branchwidth with Respect to the Largest Grid Minor Size.",
            "Computing Sparse Multiples of Polynomials.",
            "Identifying Shapes Using Self-assembly.",
            "From Holant to #CSP and Back: Dichotomy for Holant c Problems.",
            "Exact Algorithms for Edge Domination.",
            "1-Local 7/5-Competitive Algorithm for Multicoloring Hexagonal Graphs.",
            "Competitive Analysis of Organization Networks or Multicast Acknowledgment: How Much to Wait?",
            "Negative Examples for Sequential Importance Sampling of Binary Contingency Tables.",
            "Theory of Randomized Search Heuristics.",
            "Black-Box Search by Unbiased Variation.",
            "A Simple Ant Colony Optimizer for Stochastic Shortest Path Problems.",
            "Multiplicative Drift Analysis.",
            "Theoretical Foundation for CMA-ES from Information Geometry Perspective."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2011",
        "info": "2011: Volumes\n59,\n60,\n61",
        "count": 133,
        "papers": [
            "Guest Editorial: Special Issue on Latin American Theoretical Informatics Symposium (LATIN).",
            "Origami Embedding of Piecewise-Linear Two-Manifolds.",
            "On Dissemination Thresholds in Regular and Irregular Graph Classes.",
            "Quantum Property Testing of Group Solvability.",
            "Random 2 XORSAT Phase Transition.",
            "Making Doubling Metrics Geodesic.",
            "Approximation Algorithms for k-hurdle Problems.",
            "Energy Efficient Monitoring in Sensor Networks.",
            "Approximate Range Searching in External Memory.",
            "The Stackelberg Minimum Spanning Tree Game.",
            "Augmenting the Rigidity of a Graph in R2.",
            "Exact Algorithms for L(2, 1)-Labeling of Graphs.",
            "Improved Algorithms for Maximum Agreement and Compatible Supertrees.",
            "Linear-Time Recognition of Helly Circular-Arc Models and Graphs.",
            "35/44-approximation for Asymmetric Maximum TSP with Triangle Inequality.",
            "Finding Total Unimodularity in Optimization Problems Solved by Linear Programs.",
            "Linear-Time Construction of Two-Dimensional Suffix Trees.",
            "Theory of Evolutionary Computation.",
            "Precision, Local Search and Unimodal Functions.",
            "Computing Minimum Cuts by Randomized Search Heuristics.",
            "Hybridizing Evolutionary Algorithms with Variable-Depth Search to Overcome Local Optima.",
            "Simplified Drift Analysis for Proving Lower Bounds in Evolutionary Computation.",
            "Lower Bounds for Comparison Based Evolution Strategies Using VC-dimension and Sign Patterns.",
            "Combining Markov-Chain Analysis and Drift Analysis - The (1+1) Evolutionary Algorithm on Linear Functions Reloaded.",
            "Log-Linear Convergence and Divergence of the Scale-Invariant (1+1)-ES in Noisy Environments.",
            "Constant-Degree Graph Expansions that Preserve Treewidth.",
            "New Approximation Algorithms for Minimum Cycle Bases of Graphs.",
            "A Unified Approach to Approximating Partial Covering Problems.",
            "Tight Approximation Ratio of a General Greedy Splitting Algorithm for the Minimum k-Way Cut Problem.",
            "Seriation in the Presence of Errors: A Factor 16 Approximation Algorithm for l∞-Fitting Robinson Structures to Distances.",
            "Competitive Algorithms for Due Date Scheduling.",
            "On Bounded Leg Shortest Paths Problems.",
            "An Approximation Algorithm for Binary Searching in Trees.",
            "All-Pairs Bottleneck Paths in Vertex Weighted Graphs.",
            "Guest Editorial: Selected Papers from European Symposium on Algorithms.",
            "Better and Simpler Approximation Algorithms for the Stable Marriage Problem.",
            "An Integer Programming Algorithm for Routing Optimization in IP Networks.",
            "An Almost Space-Optimal Streaming Algorithm for Coresets in Fixed Dimensions.",
            "Time-Dependent SHARC-Routing.",
            "Fitting a Step Function to a Point Set.",
            "Deterministic Sampling Algorithms for Network Design.",
            "Coupled Path Planning, Region Optimization, and Applications in Intensity-modulated Radiation Therapy.",
            "Common Intervals of Multiple Permutations.",
            "Constructing the Simplest Possible Phylogenetic Network from Triplets.",
            "Location-Oblivious Distributed Unit Disk Graph Coloring.",
            "Out-of-Order Event Processing in Kinetic Data Structures.",
            "Capacitated Domination Problem.",
            "An Online Algorithm for a Problem in Scheduling with Set-ups and Release Times.",
            "Exact Algorithms for Cluster Editing: Evaluation and Experiments.",
            "Approximate Pattern Matching with the L1, L2 and L∞ Metrics.",
            "Peeling Meshed Potatoes.",
            "Selfish Bin Packing.",
            "Approximability of Packing Disjoint Cycles.",
            "Testing Periodicity.",
            "Shape Rectangularization Problems in Intensity-Modulated Radiation Therapy.",
            "Improved Approximations for Guarding 1.5-Dimensional Terrains.",
            "On Centralized Smooth Scheduling.",
            "Guest Editor's Foreword: Algorithms, Combinatorics, & Geometry.",
            "Crossing Number and Weighted Crossing Number of Near-Planar Graphs.",
            "Efficient Authenticated Data Structures for Graph Connectivity and Geometric Search Problems.",
            "Injective Colorings of Graphs with Low Average Degree.",
            "Colored Simultaneous Geometric Embeddings and Universal Pointsets.",
            "On the Planarization of Wireless Sensor Networks.",
            "Spiraling and Folding: The Word View.",
            "Minimum Weight Convex Steiner Partitions.",
            "Knowledge State Algorithms.",
            "Crossing Numbers of Graphs with Rotation Systems.",
            "Sweeping Points.",
            "Trade-offs Between the Size of Advice and Broadcasting Time in Trees.",
            "Approximating Minimum-Power Degree and Connectivity Problems.",
            "Competitive Cost Sharing with Economies of Scale.",
            "Testing Convexity Properties of Tree Colorings.",
            "Linear Time Algorithms for Generalizations of the Longest Common Substring Problem.",
            "On Word Equations in One Variable.",
            "Detecting Regular Visit Patterns.",
            "Permutation Betting Markets: Singleton Betting with Extra Information.",
            "Average Rate Speed Scaling.",
            "Finding a Minimum-depth Embedding of a Planar Graph in O(n4) Time.",
            "A Stronger Model of Dynamic Programming Algorithms.",
            "An Approximation Algorithm for the Minimum Co-Path Set Problem.",
            "Planar Feedback Vertex Set and Face Cover: Combinatorial Bounds and Subexponential Algorithms.",
            "Algorithms for Marketing-Mix Optimization.",
            "The Directed Orienteering Problem.",
            "Special Issue: European Symposium on Algorithms, Design and Analysis.",
            "Fast Evaluation of Interlace Polynomials on Graphs of Bounded Treewidth.",
            "A Fast Output-Sensitive Algorithm for Boolean Matrix Multiplication.",
            "On Optimally Partitioning a Text to Improve Its Compression.",
            "Approximability of Sparse Integer Programs.",
            "Piercing Translates and Homothets of a Convex Body.",
            "On the Performance of Approximate Equilibria in Congestion Games.",
            "k-Outerplanar Graphs, Planar Duality, and Low Stretch Spanning Trees.",
            "Dynamic vs. Oblivious Routing in Network Design.",
            "Maximum Flow in Directed Planar Graphs with Vertex Capacities.",
            "Improved Approximation Algorithms for Label Cover Problems.",
            "Geometric Spanners for Weighted Point Sets.",
            "Reoptimization of the Shortest Common Superstring Problem.",
            "Branch and Recharge: Exact Algorithms for Generalized Domination.",
            "Graphical Congestion Games.",
            "Energy-Efficient Paths in Radio Networks.",
            "The Longest Path Problem has a Polynomial Solution on Interval Graphs.",
            "Approximation Algorithms for the Interval Constrained Coloring Problem.",
            "Quadratic Kernelization for Convex Recoloring of Trees.",
            "On Dynamic Shortest Paths Problems.",
            "A Quadratic Algorithm for Finding Next-to-Shortest Paths in Graphs.",
            "Topological Implications of Selfish Neighbor Selection in Unstructured Peer-to-Peer Networks.",
            "On Incentive Compatible Competitive Selection Protocols.",
            "The Cost of Cache-Oblivious Searching.",
            "Nonclairvoyant Speed Scaling for Flow and Energy.",
            "Sleeping on the Job: Energy-Efficient and Robust Broadcast for Radio Networks.",
            "Searching a Bitstream in Linear Time for the Longest Substring of Any Given Density.",
            "Efficiently Testing Sparse GF(2) Polynomials.",
            "Tight Bounds for Selfish and Greedy Load Balancing.",
            "Solving MAX-r-SAT Above a Tight Lower Bound.",
            "A New Algorithm for a Field Splitting Problem in Intensity-Modulated Radiation Therapy.",
            "Preprocessing Imprecise Points for Delaunay Triangulation: Simplified and Extended.",
            "A Simpler Linear-Time Recognition of Circular-Arc Graphs.",
            "Bounded Unpopularity Matchings.",
            "Subgraphs of 4-Regular Planar Graphs.",
            "Editorial: ISAAC 2008 Special Issue.",
            "Signature Theory in Holographic Algorithms.",
            "Faster Parameterized Algorithms for Minimum Fill-in.",
            "How to Guard a Graph?",
            "The Complexity of König Subgraph Problems and Above-Guarantee Vertex Cover.",
            "A New Algorithm for Finding Trees with Many Leaves.",
            "An Efficient Scaling Algorithm for the Minimum Weight Bibranching Problem.",
            "Editors' Note: ISAAC 2009 Special Section.",
            "Exact Algorithms for the Bottleneck Steiner Tree Problem.",
            "Editing Graphs into Disjoint Unions of Dense Clusters.",
            "Augmenting the Edge Connectivity of Planar Straight Line Graphs to Three.",
            "Tighter Approximation Bounds for Minimum CDS in Unit Disk Graphs.",
            "Extending Steinitz's Theorem to Upward Star-Shaped Polyhedra and Spherical Polyhedra.",
            "An Improved Approximation Algorithm for the Traveling Tournament Problem.",
            "Another Sub-exponential Algorithm for the Simple Stochastic Game."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2010",
        "info": "2010: Volumes\n56,\n57,\n58",
        "count": 125,
        "papers": [
            "Foreword.",
            "An Efficient Algorithm for Solving Pseudo Clique Enumeration Problem.",
            "Minimum Degree Orderings.",
            "Faster Combinatorial Algorithms for Determinant and Pfaffian.",
            "On Mixing and Edge Expansion Properties in Randomized Broadcasting.",
            "A Constant-Competitive Algorithm for Online OVSF Code Assignment.",
            "Integer Representation and Counting in the Bit Probe Model.",
            "Geometric Representation of Graphs in Low Dimension Using Axis Parallel Boxes.",
            "Note on the Structure of Kruskal's Algorithm.",
            "Augmenting the Connectivity of Outerplanar Graphs.",
            "Fast Dynamic Transitive Closure with Lookahead.",
            "Approximation Algorithms for Requirement Cut on Graphs.",
            "Faster Two Dimensional Scaled Matching.",
            "Largest and Smallest Convex Hulls for Imprecise Points.",
            "On the Longest Common Rigid Subsequence Problem.",
            "Recent Advances in Computation and Combinatorial Optimization.",
            "A Practical Exact Algorithm for the Individual Haplotyping Problem MEC/GI.",
            "Efficient Algorithms for the Problems of Enumerating Cuts by Non-decreasing Weights.",
            "Structural Identifiability in Low-Rank Matrix Factorization.",
            "A Better Constant-Factor Approximation for Selected-Internal Steiner Minimum Tree.",
            "Resource Bounded Frequency Computations with Three Errors.",
            "Quantum Separation of Local Search and Fixed Point Computation.",
            "On Independent Vertex Sets in Subclasses of Apple-Free Graphs.",
            "A Faster Algorithm for Computing the Principal Sequence of Partitions of a Graph.",
            "Minimum Augmentation of Edge-Connectivity between Vertices and Sets of Vertices in Undirected Graphs.",
            "An Algorithm for Minimum Cost Arc-Connectivity Orientations.",
            "Approximation Algorithms for Treewidth.",
            "Capabilities and Limits of Compact Error Resilience Methods for Algorithmic Self-Assembly.",
            "Bin Packing with Rejection Revisited.",
            "Approximate k-Steiner Forests via the Lagrangian Relaxation Technique with Internal Preprocessing.",
            "A Timing Assumption and Two t-Resilient Protocols for Implementing an Eventual Leader Service in Asynchronous Shared Memory Systems.",
            "l22 Spreading Metrics for Vertex Ordering Problems.",
            "Random Matrices and Codes for the Erasure Channel.",
            "In-Place Algorithms for Computing (Layers of) Maxima.",
            "Collective Tree Spanners in Graphs with Bounded Parameters.",
            "Transactional Contention Management as a Non-Clairvoyant Scheduling Problem.",
            "A Universal Online Caching Algorithm Based on Pattern Matching.",
            "Deciding k-Colorability of P5-Free Graphs in Polynomial Time.",
            "Secure Overlay Network Design.",
            "A Top-Down Approach to Search-Trees: Improved Algorithmics for 3-Hitting Set.",
            "Editorial.",
            "Continuous Lunches Are Free Plus the Design of Optimal Optimization Algorithms.",
            "Stability in the Self-Organized Evolution of Networks.",
            "Analysis of Evolutionary Algorithms for the Longest Common Subsequence Problem.",
            "Evolutionary Algorithms and Matroid Optimization Problems.",
            "Computing median and antimedian sets in median graphs.",
            "Design and Analysis of Online Batching Systems.",
            "Improved Approximation Algorithms for Maximum Resource Bin Packing and Lazy Bin Covering Problems.",
            "On the Planar Piecewise Quadratic 1-Center Problem.",
            "Aggregation of Partial Rankings, p-Ratings and Top-m Lists.",
            "On the Convergence of Multicast Games in Directed Networks.",
            "Approximating Tree Edit Distance through String Edit Distance.",
            "Algorithms for Data Migration.",
            "Planar Polyline Drawings via Graph Transformations.",
            "Fixed-Parameter Approximation: Conceptual Framework and Approximability Results.",
            "New Approximation Bounds for Lpt Scheduling.",
            "Editorial, SWAT 2008 Special Issue.",
            "Boundary Labeling with Octilinear Leaders.",
            "Confluently Persistent Tries for Efficient Version Control.",
            "On Metric Clustering to Minimize the Sum of Radii.",
            "Improved Bounds for Wireless Localization.",
            "A Preemptive Algorithm for Maximizing Disjoint Paths on Trees.",
            "On Covering Problems of Rado.",
            "Kinetic Facility Location.",
            "On Sorting, Heaps, and Minimum Spanning Trees.",
            "Homogeneous String Segmentation using Trees and Weighted Independent Sets.",
            "Constructing Labeling Schemes through Universal Matrices.",
            "Well Supported Approximate Equilibria in Bimatrix Games.",
            "Approximate Shortest Paths Guided by a Small Index.",
            "Complexity Results for Throughput and Latency Optimization of Replicated and Data-parallel Workflows.",
            "An Experimental Study of New and Known Online Packet Buffering Algorithms.",
            "Chordal Deletion is Fixed-Parameter Tractable.",
            "Fully Polynomial Approximation Schemes for a Symmetric Quadratic Knapsack Problem and its Scheduling Applications.",
            "Drawing Colored Graphs with Constrained Vertex Positions and Few Bends per Edge.",
            "Scheduling Jobs on Grid Processors.",
            "Broadcasting on Networks of Workstations.",
            "The Steiner Ratio Conjecture of Gilbert-Pollak May Still Be Open.",
            "Pricing for Fairness: Distributed Resource Allocation for Multiple Objectives.",
            "Guest Editorial: Special Issue on Matching Under Preferences.",
            "Three-Sided Stable Matchings with Cyclic Preferences.",
            "Housing Markets Through Graphs.",
            "Understanding the Generalized Median Stable Matchings.",
            "An Efficient Algorithm for Batch Stability Testing.",
            "Faster Algorithms for Stable Allocation Problems.",
            "The Stable Roommates Problem with Choice Functions.",
            "Almost Stable Matchings by Truncating the Gale-Shapley Algorithm.",
            "Assigning Papers to Referees.",
            "Circular Stable Matching and 3-way Kidney Transplant.",
            "Cheating Strategies for the Gale-Shapley Algorithm with Complete Preference Lists.",
            "Parameterized Complexity and Local Search Approaches for the Stable Marriage Problem with Ties.",
            "A Polynomial-Time Algorithm to Find von Neumann-Morgenstern Stable Matchings in Marriage Games.",
            "Near-Entropy Hotlink Assignments.",
            "The Complexity of Bottleneck Labeled Graph Problems.",
            "Compressed Indexes for Approximate String Matching.",
            "Fingerprint Clustering with Bounded Number of Missing Values.",
            "NBmalloc: Allocating Memory in a Lock-Free Manner.",
            "Space Efficient Algorithms for the Burrows-Wheeler Backtransformation.",
            "Guarding a Terrain by Two Watchtowers.",
            "Approximation Algorithms for Scheduling with Reservations.",
            "Fully Dynamic Algorithm for Recognition and Modular Decomposition of Permutation Graphs.",
            "A Linear-Time Algorithm for Symmetric Convex Drawings of Internally Triconnected Plane Graphs.",
            "New Results on Web Caching with Request Reordering.",
            "Approximation Algorithms for Minimizing Edge Crossings in Radial Drawings.",
            "Absolute and Asymptotic Bounds for Online Frequency Allocation in Cellular Networks.",
            "Fractional Path Coloring in Bounded Degree Trees with Applications.",
            "In Memoriam: Ingo Wegener.",
            "Algorithmic Aspects of Proportional Symbol Maps.",
            "On the Fastest Vickrey Algorithm.",
            "Approximate Boyer-Moore String Matching for Small Alphabets.",
            "Multi-Color Pebble Motion on Graphs.",
            "A Fully Dynamic Graph Algorithm for Recognizing Interval Graphs.",
            "The 1-Fixed-Endpoint Path Cover Problem is Polynomial on Interval Graphs.",
            "Computing the Greedy Spanner in Near-Quadratic Time.",
            "Analysis of the Expected Number of Bit Comparisons Required by Quickselect.",
            "Fast 3-coloring Triangle-Free Planar Graphs.",
            "Efficient Exact Algorithms on Planar Graphs: Exploiting Sphere Cut Decompositions.",
            "On the Benefits of Adaptivity in Property Testing of Dense Graphs.",
            "On Locally Decodable Codes, Self-Correctable Codes, and t-Private PIR.",
            "A Sequential Algorithm for Generating Random Graphs.",
            "Slow Mixing of Markov Chains Using Fault Lines and Fat Contours.",
            "Introduction to the Special Section on Internet and Network Economics.",
            "Gaming Prediction Markets: Equilibrium Strategies with a Market Maker.",
            "On Robustness of Forward-looking in Sponsored Search Auction.",
            "Maintaining Equilibria During Exploration in Sponsored Search Auctions.",
            "Stochastic Models for Budget Optimization in Search-Based Advertising."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2009",
        "info": "2009: Volumes\n53,\n54,\n55",
        "count": 96,
        "papers": [
            "Labeling Schemes for Tree Representation.",
            "Consistent Sets of Secondary Structures in Proteins.",
            "Algorithms for Maximum Independent Set in Convex Bipartite Graphs.",
            "Cache-Oblivious R-Trees.",
            "Approximation Algorithms for Multi-Criteria Traveling Salesman Problems.",
            "Approximating Buy-at-Bulk and Shallow-Light k-Steiner Trees.",
            "Non-Cooperative Tree Creation.",
            "Stackelberg Strategies for Selfish Routing in General Multicommodity Networks.",
            "Guest Editors' Forward.",
            "A PTAS for Cutting Out Polygons with Lines.",
            "On Dynamic Bin Packing: An Improved Lower Bound and Resource Augmentation Analysis.",
            "A Detachment Algorithm for Inferring a Graph from Path Frequency.",
            "Edge Pricing of Multicommodity Networks for Selfish Users with Elastic Demands.",
            "A Simplicial Approach for Discrete Fixed Point Theorems.",
            "Approximation Algorithms for Soft-Capacitated Facility Location in Capacitated Network Design.",
            "Fast Algorithms for the Density Finding Problem.",
            "Real Two Dimensional Scaled Matching.",
            "Approximability of Minimum AND-Circuits.",
            "Nondeterministic Graph Searching: From Pathwidth to Treewidth.",
            "Sorting Networks of Logarithmic Depth, Further Simplified.",
            "Variable Sized Online Interval Coloring with Bandwidth.",
            "Minimum Weakly Fundamental Cycle Bases Are Hard To Find.",
            "An Approximation Algorithm and Dynamic Programming for Reduction in Heterogeneous Environments.",
            "Foreword.",
            "Kinetic Collision Detection for Convex Fat Objects.",
            "Dynamic Connectivity for Axis-Parallel Rectangles.",
            "Single Machine Precedence Constrained Scheduling Is a Vertex Cover Problem.",
            "Preemptive Online Scheduling: Optimal Algorithms for All Speeds.",
            "Lower and Upper Bounds on FIFO Buffer Management in QoS Switches.",
            "Hierarchical Sampling from Sketches: Estimating Functions over Data Streams.",
            "Multiline Addressing by Network Flow.",
            "The Price of Resiliency: a Case Study on Sorting with Memory Faults.",
            "Why Neighbor-Joining Works.",
            "Small Area Drawings of Outerplanar Graphs.",
            "Combinatorial Algorithms for Data Migration to Minimize Average Completion Time.",
            "Casting an Object with a Core.",
            "Resource Allocation in Bounded Degree Trees.",
            "On Locating Disjoint Segments with Maximum Sum of Densities.",
            "Many-to-Many Communication in Radio Networks.",
            "Editorial.",
            "Algorithmic Graph Minor Theory: Improved Grid Minor Bounds and Wagner's Contraction.",
            "On Two Techniques of Combining Branching and Treewidth.",
            "Efficient Prüfer-Like Coding and Counting Labelled Hypertrees.",
            "Faster Deterministic Communication in Radio Networks.",
            "Runtime Analysis of a Simple Ant Colony Optimization Algorithm.",
            "Negation-Limited Complexity of Parity and Inverters.",
            "Models of Greedy Algorithms for Graph Problems.",
            "Minimum-Cost Load-Balancing Partitions.",
            "Optimal External Memory Planar Point Enclosure.",
            "Smallest Bipartite Bridge-Connectivity Augmentation.",
            "Speeding Up HMM Decoding and Training by Exploiting Sequence Repetitions.",
            "A Note on Multiflows and Treewidth.",
            "I/O-Efficient Algorithms for Graphs of Bounded Treewidth.",
            "Editorial, COCOON 2007 Special Issue.",
            "Improved Parameterized Set Splitting Algorithms: A Probabilistic Approach.",
            "An Improved Algorithm for Online Unit Clustering.",
            "Approximation Algorithms for Reconstructing the Duplication History of Tandem Repeats.",
            "On Counting 3-D Matchings of Size k.",
            "Linear Time Algorithms for Finding a Dominating Set of Fixed Size in Degenerated Graphs.",
            "A 1-Local Asymptotic 13/9-Competitive Algorithm for Multicoloring Hexagonal Graphs.",
            "An Improved Parameterized Algorithm for the Minimum Node Multiway Cut Problem.",
            "A Separation Bound for Real Algebraic Expressions.",
            "A Fast Algorithm for Adaptive Prefix Coding.",
            "An Improved Analysis for a Greedy Remote-Clique Algorithm Using Factor-Revealing LPs.",
            "Indexing Factors with Gaps.",
            "The Network as a Storage Device: Dynamic Routing with Bounded Buffers.",
            "Incremental Construction of Minimal Tree Automata.",
            "Foreword.",
            "Derandomized Constructions of k-Wise (Almost) Independent Permutations.",
            "Reconstructive Dispersers and Hitting Set Generators.",
            "What Would Edmonds Do? Augmenting Paths and Witnesses for Degree-Bounded MSTs.",
            "Approximating the Bandwidth of Caterpillars.",
            "Scheduling on Unrelated Machines under Tree-Like Precedence Constraints.",
            "A Primal-Dual Approximation Algorithm for Partial Vertex Cover: Making Educated Guesses.",
            "Approximation Schemes for Node-Weighted Geometric Steiner Tree Problems.",
            "Foreword.",
            "Order Statistics in the Farey Sequences in Sublinear Time and Counting Primitive Lattice Points in Polygons.",
            "Linear Data Structures for Fast Ray-Shooting amidst Convex Polyhedra.",
            "Optimal Algorithms for k-Search with Application in Option Pricing.",
            "Exact Minkowksi Sums of Polyhedra and Exact and Efficient Decomposition of Polyhedra into Convex Pieces.",
            "Graph Spanners in the Streaming Model: An Experimental Study.",
            "Algorithms to Separate {0, \\frac12}\\{0, \\frac{1}{2}\\} -Chvátal-Gomory Cuts.",
            "Foreword from the Guest Editors.",
            "A Polynomial Quantum Algorithm for Approximating the Jones Polynomial.",
            "A New Quantum Lower Bound Method, with Applications to Direct Product Theorems and Time-Space Tradeoffs.",
            "Quantum Information and the PCP Theorem.",
            "Random Measurement Bases, Quantum State Distinction and Applications to the Hidden Subgroup Problem.",
            "Error-Detection-Based Quantum Fault-Tolerance Threshold.",
            "Quantum and Classical Query Complexities of Local Search Are Polynomially Related.",
            "On the Quantum Query Complexity of Local Search in Two and Three Dimensions.",
            "Optimal Algorithms for the Path/Tree-Shaped Facility Location Problems in Trees.",
            "Online Search with Time-Varying Price Bounds.",
            "Weighted Sum Coloring in Batch Scheduling of Conflicting Jobs.",
            "Clamshell Casting.",
            "Structure and Recognition of Graphs with No 6-wheel Subdivision.",
            "A Lower Bound for Scheduling Mechanisms."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2008",
        "info": "2008: Volumes\n50,\n51,\n52",
        "count": 79,
        "papers": [
            "On the Competitive Ratio for Online Facility Location.",
            "An Optimal Algorithm for the Minimum Disc Cover Problem.",
            "Average Case Analysis of Bounded Space Bin Packing Algorithms.",
            "Cost-Sharing Mechanisms for Network Design.",
            "Symbolic Graphs: Linear Solutions to Connectivity Related Problems.",
            "On Enumerating Minimal Dicuts and Strongly Connected Subgraphs.",
            "Introduction to Special Issue.",
            "Improved Approximation Bounds for Planar Point Pattern Matching.",
            "Dynamic Hotlinks.",
            "Max-Stretch Reduction for Tree Spanners.",
            "All-Pairs Shortest Paths with Real Weights in O ( n 3/log n ) Time.",
            "Linear Time Algorithms for Generalized Edge Dominating Set Problems.",
            "Optimally Adaptive Integration of Univariate Lipschitz Functions.",
            "Communication-Aware Processor Allocation for Supercomputers: Finding Point Sets of Small Average Distance.",
            "The Swap Edges of a Multiple-Sources Routing Tree.",
            "Generalization of EDF and LLF: Identifying All Optimal Online Algorithms for Minimizing Maximum Lateness.",
            "On the Stability of Dynamic Diffusion Load Balancing.",
            "New Linear-Time Algorithms for Edge-Coloring Planar Graphs.",
            "From Constrained to Unconstrained Maximum Agreement Subtree in Linear Time.",
            "Delineating Boundaries for Imprecise Regions.",
            "Foreword.",
            "Random Bichromatic Matchings.",
            "Eliminating Cycles in the Discrete Torus.",
            "Incremental Medians via Online Bidding.",
            "Algorithms for Modular Counting of Roots of Multivariate Polynomials.",
            "Gaussian Laws for the Main Parameters of the Euclid Algorithms.",
            "Minimum Cost Source Location Problems with Flow Requirements.",
            "Subquadratic Algorithms for 3SUM.",
            "Approximation Algorithms for Bounded Degree Phylogenetic Roots.",
            "Distribution-Free Connectivity Testing for Sparse Graphs.",
            "Tight Results on Minimum Entropy Set Cover.",
            "Synchronous vs. Asynchronous Unison.",
            "Treewidth Lower Bounds with Brambles.",
            "The Compatibility of Binary Characters on Phylogenetic Networks: Complexity and Parameterized Algorithms.",
            "Inferring (Biological) Signal Transduction Networks via Transitive Reductions of Directed Graphs.",
            "Property-Preserving Data Reconstruction.",
            "Grouping Techniques for Scheduling Problems: Simpler and Faster.",
            "Unique Sink Orientations of Grids.",
            "Preface.",
            "Generating Cut Conjunctions in Graphs and Related Problems.",
            "Embedding of Cycles in Twisted Cubes with Edge-Pancyclic.",
            "Space Efficient Algorithms for Ordered Tree Comparison.",
            "Improved Approximate String Matching Using Compressed Suffix Data Structures.",
            "A Network Game with Attackers and a Defender.",
            "A (2-c(1/sqrt(N)))-Approximation Algorithm for the Stable Marriage Problem.",
            "A Primal-Dual Algorithm for the Computation of Market Equilibrium with Logarithmic Utility Functions.",
            "Competitive Analysis of Scheduling Algorithms for Aggregated Links.",
            "Mantaining Dynamic Matrices for Fully Dynamic Transitive Closure.",
            "An O ( n 3(log log n /log n )5/4) Time Algorithm for All Pairs Shortest Path.",
            "An Algorithm for Simultaneous Backbone Threading and Side-Chain Packing.",
            "Preemptive Scheduling on Uniform Parallel Machines with Controllable Job Processing Times.",
            "Preface.",
            "Inapproximability Results for Combinatorial Auctions with Submodular Utility Functions.",
            "Cost Sharing Mechanisms for Fair Pricing of Resource Usage.",
            "Walrasian Equilibrium: Hardness, Approximations and Tractable Instances.",
            "Truth-Telling Reservations.",
            "Club Formation by Rational Sharing: Content, Viability and Community Structure.",
            "New Algorithms for Mining the Reputation of Participants of Online Auctions.",
            "Foreword from the Guest Editors.",
            "Algorithm Engineering for Color-Coding with Applications to Signaling Pathway Detection.",
            "Fixed-Parameter Complexity of Minimum Profile Problems.",
            "Solving Connected Dominating Set Faster than 2 n .",
            "Faster Fixed-Parameter Tractable Algorithms for Matching and Packing Problems.",
            "Improved Algorithms and Complexity Results for Power Domination in Graphs.",
            "Short Cycles Make W -hard Problems Hard: FPT Algorithms for W -hard Problems in Graphs with no Short Cycles.",
            "Exact Algorithms for Exact Satisfiability and Number of Perfect Matchings.",
            "An Improved (and Practical) Parameterized Algorithm for the Individual Haplotyping Problem MFR with Mate-Pairs.",
            "On the Parameterized Complexity of Layered Graph Drawing.",
            "On the Minimum Feedback Vertex Set Problem: Exact and Enumeration Algorithms.",
            "Sorting and Searching in Faulty Memories.",
            "An [(O)\\tilde](m2n)\\tilde{O}(m^{2}n) Algorithm for Minimum Cycle Basis of Graphs.",
            "Linearized Suffix Tree: an Efficient Index Data Structure with the Capabilities of Suffix Trees and Suffix Arrays.",
            "Practical Methods for Shape Fitting and Kinetic Data Structures using Coresets.",
            "Optimality in External Memory Hashing.",
            "Scheduling Techniques for Media-on-Demand.",
            "Maximum Induced Matchings for Chordal Graphs in Linear Time.",
            "Testing Planarity of Geometric Automorphisms in Linear Time.",
            "Path Hitting in Acyclic Graphs.",
            "Bandwidth-Constrained Allocation in Grid Computing."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2007",
        "info": "2007: Volumes\n47,\n48,\n49",
        "count": 77,
        "papers": [
            "External-Memory Algorithms for Processing Line Segments in Geographic Information Systems.",
            "Tree Spanners for Bipartite Graphs and Probe Interval Graphs.",
            "Approximation Algorithms for the Unsplittable Flow Problem.",
            "Selfish Load Balancing and Atomic Congestion Games.",
            "Deterministic Communication in Radio Networks with Large Labels.",
            "Detecting Holes and Antiholes in Graphs.",
            "Safe Reduction Rules for Weighted Treewidth.",
            "Motorcycle Graphs and Straight Skeletons.",
            "Power Assignment in Radio Networks with Two Power Levels.",
            "R-Kleene: A High-Performance Divide-and-Conquer Algorithm for the All-Pair Shortest Path for Densely Connected Networks.",
            "Foreword.",
            "Call Control in Rings.",
            "A Study of Integrated Document and Connection Caching in the WWW.",
            "Minimizing Total Flow Time and Total Completion Time with Immediate Dispatching.",
            "An Algorithmic View on OVSF Code Assignment.",
            "An FPTAS for Quickest Multicommodity Flows with Inflow-Dependent Transit Times.",
            "Maximizing the Total Profit of Rectangles Packed into a Rectangle.",
            "Real-Time Scheduling with a Budget.",
            "Guest Editors' Foreword.",
            "Reconfiguring Triangulations with Edge Flips and Point Moves.",
            "No-Three-in-Line-in-3D.",
            "Drawing Power Law Graphs Using a Local/Global Decomposition.",
            "Convex Drawings of 3-Connected Plane Graphs.",
            "Random Geometric Graph Diameter in the Unit Ball.",
            "Confluent Layered Drawings.",
            "Representations by Contact and Intersection of Segments.",
            "Train Tracks and Confluent Drawings.",
            "No-Three-in-Line-in-3D.",
            "Broadcasting in Heterogeneous Networks.",
            "A Space and Time Efficient Algorithm for Constructing Compressed Suffix Arrays.",
            "Counting Integer Points in Parametric Polytopes Using Barvinok's Rational Functions.",
            "Mobile Search for a Black Hole in an Anonymous Ring.",
            "The Price of Selfish Routing.",
            "Foreword.",
            "Server Allocation Algorithms for Tiered Systems.",
            "Oblivious and Adaptive Strategies for the Majority and Plurality Problems.",
            "On Walrasian Price of CPU Time.",
            "On-Line Construction of Two-Dimensional Suffix Trees in O(n2 log n) Time.",
            "Rapid Homology Search with Neighbor Seeds.",
            "Algorithmic and Complexity Issues of Three Clustering Methods in Microarray Data Analysis.",
            "Quantum Complexity of Testing Group Commutativity.",
            "Polynomial-Time Algorithms for the Ordered Maximum Agreement Subtree Problem.",
            "Random 2-SAT with Prescribed Literal Degrees.",
            "A Linear-Time Algorithm for the Perfect Phylogeny Haplotype Problem.",
            "The Consecutive Ones Submatrix Problem for Sparse Matrices.",
            "Foreword.",
            "Sampling Conformation Space to Model Equilibrium Fluctuations in Proteins.",
            "An Algorithm for Simultaneous Backbone Threading and Side-Chain Packing.",
            "An Algorithmic Approach to the Identification of Rigid Domains in Proteins.",
            "Finding Pathway Structures in Protein Interaction Networks.",
            "Protein Communication System: Evolution and Genomic Structure.",
            "Rigid Components in Molecular Graphs.",
            "A Fast and Simple Algorithm for the Money Changing Problem.",
            "Toward Unsupervised Segmentation of Semi-Rigid Low-Resolution Molecular Surfaces.",
            "Algorithms for Graphs Embeddable with Few Crossings per Edge.",
            "The Complexity of the Single Individual SNP Haplotyping Problem.",
            "Simple Stochastic Games, Parity Games, Mean Payoff Games and Discounted Payoff Games Are All LP-Type Problems.",
            "SONET ADMs Minimization with Divisible Paths.",
            "Sample Complexity for Computational Classification Problems.",
            "Fast Recognition of Fibonacci Cubes.",
            "Space Efficient Dynamic Orthogonal Range Reporting.",
            "Analysis of Randomized Protocols for Conflict-Free Distributed Access.",
            "Property Testing of Regular Tree Languages.",
            "Choosing a Random Peer in Chord.",
            "Exact and Approximate Truthful Mechanisms for the Shortest Paths Tree Problem.",
            "k-Nearest-Neighbor Clustering and Percolation Theory.",
            "Average Case Analysis of Disk Scheduling, Increasing Subsequences and Spacetime Geometry.",
            "The Number of Tree Stars Is O *(1.357 k ).",
            "A Tight Lower Bound for Computing the Diameter of a 3D Convex Polytope.",
            "Editors Foreword to the Special Issue on Principles of Mobile Communications and Computing.",
            "OVSF-CDMA Code Assignment in Wireless Ad Hoc Networks.",
            "A Class of Algorithms for Collision Resolution with Multiplicity Estimation.",
            "Improved Approximation Results for the Minimum Energy Broadcasting Problem.",
            "On the Fundamental Limits of Topology Control in Ad Hoc Networks.",
            "Accuracy vs. Lifetime: Linear Sketches for Aggregate Queries in Sensor Networks.",
            "On the Feasibility of Time Estimation under Isolation Conditions in Wireless Sensor Networks.",
            "Localized Techniques for Broadcasting in Wireless Sensor Networks."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2006",
        "info": "2006: Volumes\n44,\n45,\n46",
        "count": 77,
        "papers": [
            "Straight-Line Drawing Algorithms for Hierarchical Graphs and Clustered Graphs.",
            "Multiple Spin-Block Decisions.",
            "Combinatorial Algorithms for the Unsplittable Flow Problem.",
            "Drawing Planar Graphs Symmetrically, III: Oneconnected Planar Graphs.",
            "Foreword.",
            "Linear Time Algorithm for Approximating a Curve by a Single-Peaked Curve.",
            "Computing All Immobilizing Grasps of a Simple Polygon with Few Contacts.",
            "The Geometric Dilation of Finite Point Sets.",
            "A Dynamic Dictionary for Priced Information with Application.",
            "Geometric Restrictions on Producible Polygonal Protein Chains.",
            "Exact Sampling from Perfect Matchings of Dense Regular Bipartite Graphs.",
            "An Efficient Algorithm for Finding Maximum Cycle Packings in Reducible Flow Graphs.",
            "Approximating Rooted Connectivity Augmentation Problems.",
            "Three-Dimensional Orthogonal Graph Drawing with Optimal Volume.",
            "Augmenting a (k-1)-Vertex-Connected Multigraph l-Edge-Connected and k-Vertex-Connected Multigraph.",
            "Canonical Forms and Algorithms for Steiner Trees in Uniform Orientation Metrics.",
            "Simultaneous Optimization via Approximate Majorization for Concave Profits or Convex Costs.",
            "Casting with Skewed Ejection Direction.",
            "Planar Graph Coloring Avoiding Monochromatic Subgraphs: Trees and Paths Make It Difficult.",
            "Error Compensation in Leaf Power Problems.",
            "Foreword.",
            "Maximum Matchings in Planar Graphs via Gaussian Elimination.",
            "Hardness and Approximation Results for Packing Steiner Trees.",
            "Direct Routing: Algorithms and Complexity.",
            "Maximizing Throughput in Multi-Queue Switches.",
            "Approximate Unions of Lines and Minkowski Sums.",
            "Swap and Mismatch Edit Distance.",
            "An Experimental Study of Random Knapsack Problems.",
            "Data Migration on Parallel Disks: Algorithms and Evaluation.",
            "A Fixed-Parameter Approach to 2-Layer Planarization.",
            "General Perfectly Periodic Scheduling.",
            "Mixed Covering of Trees and the Augmentation Problem with Odd Diameter Constraints.",
            "Recognizing Hole-Free 4-Map Graphs in Cubic Time.",
            "Guest Editor's Introduction.",
            "Scalable Parallel Algorithms for FPT Problems.",
            "Building Large Phylogenetic Trees on Coarse-Grained Parallel Machines.",
            "A Coarse-Grained Parallel Algorithm for the All-Substrings Longest Common Subsequence Problem.",
            "FastLSA: A Fast, Linear-Space, Parallel and Sequential Algorithm for Sequence Alignment.",
            "CONQUEST: A Coarse-Grained Algorithm for Constructing Summaries of Distributed Discrete Datasets.",
            "Parallel Computation of High-Dimensional Robust Correlation and Covariance Matrices.",
            "Parallelizing Feature Selection.",
            "MOVE: A Distributed Framework for Materialized Ontology View Extraction.",
            "Slabpose Columnsort: A New Oblivious Algorithm for Out-of-Core Sorting on Distributed-Memory Clusters.",
            "Design and Performance of a Heterogeneous Grid Partitioner.",
            "Book Embeddability of Series-Parallel Digraphs.",
            "Online Maintenance of k-Medians and k-Covers on a Line.",
            "An Approximation Algorithm for the Directed Telephone Multicast Problem.",
            "I/O-Efficient Well-Separated Pair Decomposition and Applications.",
            "Foreword.",
            "The Monotone Circuit Complexity of Quadratic Boolean Functions.",
            "Multicriteria Global Minimum Cuts.",
            "Efficient Algorithms for k Maximum Sums.",
            "Random Access to Advice Strings and Collapsing Results.",
            "Partial Lifting and the Elliptic Curve Discrete Logarithm Problem.",
            "Deterministic Rendezvous in Graphs.",
            "Adaptive Spatial Partitioning for Multidimensional Data Streams.",
            "Exact Computation of Polynomial Zeros Expressible by Square Roots.",
            "GCD of Random Linear Combinations.",
            "Algorithms for the Homogeneous Set Sandwich Problem.",
            "A Slightly Improved Sub-Cubic Algorithm for the All PairsShortest Paths Problem with Real Edge Lengths.",
            "The Freeze-Tag Problem: How to Wake Up a Swarm ofRobots.",
            "A Faster and More Space-Efficient Algorithm for Inferring Arc-Annotations of RNA Sequences through Alignment.",
            "Preface.",
            "Scalar Multiplication on Koblitz Curves Using the Frobenius Endomorphism and Its Combination with Point Halving: Extensions and Mathematical Analysis.",
            "Large Deviations for the Weighted Height of an Extended Class of Trees.",
            "The Random Multisection Problem, Travelling Waves and the Distribution of the Height of m-Ary Search Trees.",
            "A Local Limit Theorem in the Theory of Overpartitions.",
            "Destruction of Very Simple Trees.",
            "Profiles of Random Trees: Limit Theorems for Random Recursive Trees and Binary Search Trees.",
            "The Expected Size of the Rule k Dominating Set.",
            "Left and Right Pathlengths in Random Binary Trees.",
            "Asymptotics of the Moments of Extreme-Value Related Distribution Functions.",
            "Average-Case Analysis of Approximate Trie Search.",
            "Asymptotics of Largest Components in Combinatorial Structures.",
            "Optimal Coding and Sampling of Triangulations.",
            "The Average Size of Giant Components between the Double-Jump.",
            "On the Number of t-Ary Trees with a Given Path Length."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2005",
        "info": "2005: Volumes\n41,\n42,\n43",
        "count": 54,
        "papers": [
            "An Experimental Analysis of Simple, Distributed Vertex Coloring Algorithms.",
            "Computing Diameter in the Streaming and Sliding-Window Models.",
            "Approximation Algorithms for Quickest Spanning Tree Problems.",
            "A Polynomial Time Approximation Scheme for Minimum Cost Delay-Constrained Multicast Tree under a Steiner Topology.",
            "Graph Searching, Elimination Trees, and a Generalization of Bandwidth.",
            "New Techniques for Regular Expression Searching.",
            "Approximating the Degree-Bounded Minimum Diameter Spanning Tree Problem.",
            "A Branch-Checking Algorithm for All-Pairs Shortest Paths.",
            "Fast Algorithms for Computing the Smallest k-Enclosing Circle.",
            "Matching Polyhedral Terrains Using Overlays of Envelopes.",
            "How Fast Is the k-Means Method?",
            "Bit-Parallel Witnesses and Their Applications to Approximate String Matching.",
            "Geographic Quorum System Approximations.",
            "Exponential Speedup of Fixed-Parameter Algorithms for Classes of Graphs Excluding Single-Crossing Graphs as Minors.",
            "Optimal Two-Description Scalar Quantizer Design.",
            "Inserting an Edge into a Planar Graph.",
            "New Approximation Results for the Maximum Scatter TSP.",
            "Guest Editors' Foreword.",
            "Key-Independent Optimality.",
            "Universal Asymptotics for Random Tries and PATRICIA Trees.",
            "Biased Skip Lists.",
            "Queaps.",
            "Characterizing History Independent Data Structures.",
            "Reconstructing Curves without Delaunay Computation.",
            "Average-Case Competitive Analyses for Ski-Rental Problems.",
            "Improved Approximation Algorithms for the Quality of Service Multicast Tree Problem.",
            "Approximating Maximum Weight Cycle Covers in Directed Graphs with Weights Zero and One.",
            "A Fast, Accurate, and Simple Method for Pricing European-Asian and Saving-Asian Options.",
            "Drawing Planar Graphs Symmetrically, II: Biconnected Planar Graphs.",
            "Preface.",
            "Near-Linear Time Approximation Algorithms for Curve Simplification.",
            "Approximation Algorithms for a k-Line Center.",
            "The k-Splittable Flow Problem.",
            "Constructing Plane Spanners of Bounded Degree and Low Weight.",
            "Optimal Terrain Construction Problems and Applications in Intensity-Modulated Radiation Therapy.",
            "A Comparison of Multicast Pull Models.",
            "Minimizing Makespan and Preemption Costs on a System of Uniform Machines.",
            "Guest Editor's Introduction.",
            "Simultaneous Optimization for Concave Costs: Single Sink Aggregation or Single Source Buy-at-Bulk.",
            "Building Edge-Failure Resilient Networks.",
            "Wavelength Conversion in All-Optical Networks with Shortest-Path Routing.",
            "Improved Competitive Guarantees for QoS Buffering.",
            "Management of Multi-Queue Switches in QoS Networks.",
            "Adaptive AIMD Congestion Control.",
            "Better Alternatives to OSPF Routing.",
            "Effective Routing and Scheduling in Adversarial Queueing Networks.",
            "A Linear-Time Algorithm for 7-Coloring 1-Plane Graphs.",
            "Sparse Normalized Local Alignment.",
            "Efficient Collision Detection among Moving Spheres with Unknown Trajectories.",
            "Average Case Analysis of Gosper's Algorithm for a Class of Urn Model Inputs.",
            "Labeled Search Trees and Amortized Analysis: Improved Upper Bounds for NP-Hard Problems.",
            "Representing Trees of Higher Degree.",
            "Rooted Maximum Agreement Supertrees.",
            "Optimal Read-Once Parallel Disk Scheduling."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2004",
        "info": "2004: Volumes\n38,\n39,\n40,",
        "count": 74,
        "papers": [
            "Shape Algorithmics.",
            "Polygonal Representations of Digital Sets.",
            "Decomposition of a Three-Dimensional Discrete Object Surface into Discrete Plane Pieces.",
            "Comparison of Distance Measures for Planar Curves.",
            "Combinatorial and Experimental Methods for Approximate Point Pattern Matching.",
            "Free-Form Pose Estimation by Using Twist Representations.",
            "Finding the Consensus Shape for a Protein Family.",
            "New Results on Path Approximation.",
            "Covering with Ellipses.",
            "Testing the Quality of Manufactured Disks and Balls.",
            "Approximating the Medial Axis from the Voronoi Diagram with a Convergence Guarantee.",
            "A Reflective Symmetry Descriptor for 3D Models.",
            "Blowing Bubbles for Multi-Scale Analysis and Decomposition of Triangle Meshes.",
            "Parallel Computation of the Topology of Level Sets.",
            "Foreword.",
            "Multicolorings of Series-Parallel Graphs.",
            "Efficient Algorithms for k-Terminal Cuts on Planar Graphs.",
            "Small Strictly Convex Quadrilateral Meshes of Point Sets.",
            "Labeling Points with Weights.",
            "Balanced Scheduling toward Loss-Free Packet Queuing and Delay Fairness.",
            "Computing the Quartet Distance between Evolutionary Trees in Time O(n log n).",
            "Delay Optimization in Quorum Consensus.",
            "Guest Editors' Introduction.",
            "Approximation Algorithms for a Capacitated Network Design Problem.",
            "An Approximation Algorithm for the Fault Tolerant Metric Facility Location Problem.",
            "Improved Approximations for Tour and Tree Covers.",
            "Inapproximability Results for Set Splitting and Satisfiability Problems with No Mixed Clauses.",
            "The Relative Complexity of Approximate Counting Problems.",
            "Maximum Dispersion and Geometric Maximum Weight Cliques.",
            "Minimizing Mean Completion Time in a Batch Processing System.",
            "Minimum k Arborescences with Bandwidth Constraints.",
            "Disk Embeddings of Planar Graphs.",
            "Computing a (1+epsilon)-Approximate Geometric Minimum-Diameter Spanning Tree.",
            "Erratum to 'Dynamical Sources in Information Theory: Fundamental Intervals and Word Prefixes'.",
            "Algorithms for Minimizing Response Time in Broadcast Scheduling.",
            "Generalization of a Suffix Tree for RNA Structural Pattern Matching.",
            "A General Model for Authenticated Data Structures.",
            "Approximation Schemes for Scheduling on Uniformly Related and Identical Parallel Machines.",
            "Scheduling Malleable Parallel Tasks: An Asymptotic Fully Polynomial Time Approximation Scheme.",
            "Algorithms for Computing the QR Decomposition of a Set of Matrices with Common Columns.",
            "Algorithms for P4-Comparability Graph Recognition and Acyclic P4-Transitive Orientation.",
            "Movement Planning in the Presence of Flows.",
            "Minimizing Makespan in Batch Machine Scheduling.",
            "Approximations for Maximum Transportation with Permutable Supply Vector and Other Capacitated Star Packing Problems.",
            "A Cut-Based Algorithm for the Nonlinear Dual of the Minimum Cost Network Flow Problem.",
            "Simple On-Line Algorithms for the Maximum Disjoint Paths Problem.",
            "Minimising the Number of Bends and Volume in 3-Dimensional Orthogonal Graph Drawings with a Diagonal Vertex Layout.",
            "Solving Systems of Difference Constraints Incrementally with Bidirectional Search.",
            "Three-Dimensional Layers of Maxima.",
            "Maximum Cardinality Search for Computing Minimal Triangulations of Graphs.",
            "Online and Offline Algorithms for the Time-Dependent TSP with Time Zones.",
            "Automated Generation of Search Tree Algorithms for Hard Graph Modification Problems.",
            "Computing Optimal Diameter-Bounded Polygon Partitions.",
            "An Efficient Fixed Parameter Tractable Algorithm for 1-Sided Crossing Minimization.",
            "Engineering a Lightweight Suffix Array Construction Algorithm.",
            "Minimum Cycle Bases for Network Graphs.",
            "The Hausdorff Voronoi Diagram of Point Clusters in the Plane.",
            "Using Nondeterminism to Design Efficient Deterministic Algorithms.",
            "A Conjecture on Wiener Indices in Combinatorial Chemistry.",
            "Nearly Linear Time Minimum Spanning Tree Maintenance for Transient Node Failures.",
            "New Results in Minimum-Comparison Sorting.",
            "Pattern Matching for Sets of Segments.",
            "A Linear-Time Approximation Scheme for Maximum Weight Triangulation of Convex Polygons.",
            "Multidimensional Cube Packing.",
            "Approximation Schemes for Degree-Restricted MST and Red-Blue Separation Problems.",
            "Diameter and Treewidth in Minor-Closed Graph Families, Revisited.",
            "Preface.",
            "Approximating Min Sum Set Cover.",
            "Sum Coloring of Bipartite Graphs with Bounded Degree.",
            "Primal-Dual Algorithms for Connected Facility Location Problems.",
            "The Power of Priority Algorithms for Facility Location and Set Cover.",
            "Admission Control in Networks with Advance Reservations.",
            "Non-Clairvoyant Scheduling for Minimizing Mean Slowdown.",
            "On-Line Dial-a-Ride Problems Under a Restricted Information Model."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2003",
        "info": "2003: Volumes\n35,\n36,\n37,",
        "count": 53,
        "papers": [
            "Reporting Red - Blue Intersections between Two Sets of Connected Line Segments.",
            "Fast Concurrent Access to Parallel Disks.",
            "Swapping a Failing Edge of a Single Source Shortest Paths Tree Is Good and Fast.",
            "Scanning Multiple Sequences Via Cache Memory.",
            "The Minimum Range Assignment Problem on Linear Radio Networks.",
            "TSP Heuristics: Domination Analysis and Complexity.",
            "Dynamic Programming on the Word RAM.",
            "The Data Broadcast Problem with Non-Uniform Transmission Times.",
            "On-Line Edge-Coloring with a Fixed Number of Colors.",
            "Guest Editors' Foreword.",
            "Efficient Parallel Algorithms for Planar st-Graphs.",
            "An Approximation Algorithm for a Large-Scale Facility Location Problem.",
            "Finding a Region with the Minimum Total L1 Distance from Prescribed Terminals.",
            "A Randomized Linear-Work EREW PRAM Algorithm to Find a Minimum Spanning Forest.",
            "A Characterization of Planar Graphs by Pseudo-Line Arrangements.",
            "Compressing Two-Dimensional Routing Tables.",
            "An Explicit Lower Bound for TSP with Distances One and Two.",
            "Detecting Race Conditions in Parallel Programs that Use Semaphores.",
            "Approximate Matching of Run-Length Compressed Strings.",
            "An Edit Distance between Quotiented Trees.",
            "The Solution of Linear Probabilistic Recurrence Relations.",
            "Maintenance of a Piercing Set for Intervals with Applications.",
            "A Heuristic for Dijkstra's Algorithm with Many Targets and Its Use in Weighted Matching Algorithms.",
            "A 3-Party Simultaneous Protocol for SUM-INDEX.",
            "An O(n1.5) Deterministic Gossiping Algorithm for Radio Networks.",
            "Efficient External Memory Algorithms by Simulating Coarse-Grained Parallel Algorithms.",
            "Time-Constrained Scheduling of Weighted Packets on Trees and Meshes.",
            "Drawing Trees Symmetrically in Three Dimensions.",
            "A New Approximation Algorithm for Finding Heavy Planar Subgraphs.",
            "Dynamic TCP Acknowledgment and Other Stories about e/(e-1).",
            "Competitive On-Line Switching Policies.",
            "Static Optimality and Dynamic Search-Optimality in Lists and Trees.",
            "New Bounds for Multidimensional Packing.",
            "Temporary Tasks Assignment Resolved.",
            "Multicast Pull Scheduling: When Fairness Is Fine.",
            "Computing the Maximum Degree of Minors in Matrix Pencils via Combinatorial Relaxation.",
            "Escaping a Grid by Edge-Disjoint Paths.",
            "Polynomial Time Algorithms for 2-Edge-Connectivity Augmentation Problems.",
            "Computing the Treewidth and the Minimum Fill-In with the Modular Decomposition.",
            "The Buffer Tree: A Technique for Designing Batched External Data Structures.",
            "Fixed-Parameter Algorithms for CLOSEST STRING and Related Problems.",
            "Linear Bidirectional On-Line Construction of Affix Trees.",
            "Approximating Node Connectivity Problems via Set Covers.",
            "Linear-Time Recognition of Circular-Arc Graphs.",
            "Online Scheduling with Partial Job Values: Does Timesharing or Randomization Help?",
            "A Distributed Ant Algorithm for Efficiently Patrolling a Network.",
            "Sum Coloring Interval and k-Claw Free Graphs with Application to Scheduling Dependent Jobs.",
            "Approximation Algorithms for Aligning Points.",
            "A Linear Time Lower Bound on McCreight and General Updating Algorithms for Suffix Trees.",
            "Semi-On-line Scheduling on Two Parallel Processors with an Upper Bound on the Items.",
            "Reinforcement Learning with Immediate Rewards and Linear Hypotheses.",
            "(Incremental) Priority Algorithms.",
            "Finding Maximum Induced Matchings in Subclasses of Claw-Free and P 5-Free Graphs, and in Graphs with Matching and Induced Matching of Equal Maximum Size."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2002",
        "info": "2002: Volumes\n32,\n33,\n34",
        "count": 95,
        "papers": [
            "A Theoretical and Experimental Study on the Construction of Suffix Arrays in External Memory.",
            "On-Line Multi-Threaded Paging.",
            "Fast Parallel Reordering and Isomorphism Testing of k-Trees.",
            "The Structure and Complexity of Sports Elimination Numbers.",
            "Algorithms for Coloring Quadtrees.",
            "Computing the Cover Array in Linear Time.",
            "Interleaved Prefetching.",
            "Exploring Unknown Environments with Obstacles.",
            "Improved Algorithms for Constructing Fault-Tolerant Spanners.",
            "A Permanent Algorithm with exp[Omega (n1/3/2 ln n )] Expected Speedup for 0-1 Matrices.",
            "Optimal Time-Critical Scheduling via Resource Augmentation.",
            "On the Competitive Theory and Practice of Online List Accessing Algorithms.",
            "Scheduling Independent Multiprocessor Tasks.",
            "A Divide-and-Conquer Approach to the Minimum k-Way Cut Problem.",
            "New Algorithms for Disk Scheduling.",
            "Property Testing in Bounded Degree Graphs.",
            "One-by-One Cleaning for Practical Parallel List Ranking.",
            "Lower Bounds for Dynamic Data Structures on Algebraic RAMs.",
            "Minimum Congestion Redundant Assignments to Tolerate Random Faults.",
            "Embedding Linkages on an Integer Lattice.",
            "A Functional Approach to External Graph Algorithms.",
            "Caching Documents with Variable Sizes and Fetching Costs: An LP-Based Approach.",
            "Routing Flow Through a Strongly Connected Graph.",
            "Quasi-Upward Planarity.",
            "Linear-Time Approximation Schemes for Scheduling Malleable Parallel Tasks.",
            "Improved Algorithms for Uniform Partitions of Points.",
            "An Online Algorithm for the Dynamic Maximal Dense Tree Problem.",
            "Approximations for a Bottleneck Steiner Tree Problem.",
            "Distributed and On-Line Routing on Tori.",
            "A Generalization of AT-Free Graphs and a Generic Algorithm for Solving Triangulation Problems.",
            "Algorithmic Aspects of Acyclic Edge Colorings.",
            "A Probabilistic Algorithm for k -SAT Based on Limited Local Search and Restart.",
            "Randomized Weighted Caching with Two Page Weights.",
            "Delayed Binary Search, or Playing Twenty Questions with a Procrastinator.",
            "Multiprocessor Scheduling with Machine Allotment and Parallelism Constraints.",
            "Corrigendum: Static Frequency Assignment in Cellular Networks.",
            "Foreword.",
            "Experimental Analysis of Heuristic Algorithms for the Dominating Set Problem.",
            "An Experimental Study of Compression Methods for Dynamic Tries.",
            "An Experimental Study of Algorithms for Weighted Completion Time Scheduling.",
            "A Tutorial for Designing Flexible Geometric Algorithms.",
            "A Neural Algorithm for the Maximum Clique Problem: Analysis, Experiments, and Circuit Implementation.",
            "Experimental Performance of Shared RSA Modulus Generation.",
            "Efficient Bulk Operations on Dynamic R-Trees.",
            "Fault Identification in System-Level Diagnosis: a Logic-Based Framework and an O(n2sqrt(tau/log n) Algorithm.",
            "Efficiently Approximating Polygonal Paths in Three and Higher Dimensions.",
            "Quasi-Fully Dynamic Algorithms for Two-Connectivity and Cycle Equivalence.",
            "Efficient Parallel Graph Algorithms for Coarse-Grained Multicomputers and BSP.",
            "Exact and Approximation Algorithms for Clustering.",
            "Computing Approximate Shortest Paths on Convex Polytopes.",
            "Augmenting Trees to Meet Biconnectivity and Diameter Constraints.",
            "Fast Algorithms for Approximating Distances.",
            "Guest Editor's Foreword.",
            "Fast, Fair and Frugal Bandwidth Allocation in ATM Networks.",
            "Optimal Online Algorithms for an Electronic Commerce Money Distribution System.",
            "Exploiting Regularities in Web Traffic Patterns for Cache Replacement.",
            "Extending Greedy Multicast Routing to Delay Sensitive Applications.",
            "Caching for Web Searching.",
            "On-Line File Caching.",
            "Page Replacement with Multi-Size Pages and Applications to Web Caching.",
            "Some Aperture-Angle Optimization Problems.",
            "Optimal Parallel Randomized Algorithms for the Voronoi Diagram of Line Segments in the Plane.",
            "Fixed Parameter Algorithms for DOMINATING SET and Related Problems on Planar Graphs.",
            "Optimal Solutions for the Temporal Precedence Problem.",
            "Competitive Analysis of the LRFU Paging Algorithm.",
            "A Near-Linear Area Bound for Drawing Binary Trees.",
            "Pinwheel Scheduling: Achievable Densities.",
            "Splitting a Delaunay Triangulation in Linear Time.",
            "The Analysis of Evolutionary Algorithms - A Proof That Crossover Really Can Help.",
            "Testing and Spot-Checking of Data Streams.",
            "Realistic Input Models for Geometric Algorithms.",
            "Erratum: An Approximation Algorithm for Minimum-Cost Vertex-Connectivity Problems.",
            "An Algorithm for Computing a Convex and Simple Path of Bounded Curvature in a Simple Polygon.",
            "Further Thoughts on the Syntenic Distance between Genomes.",
            "Fair versus Unrestricted Bin Packing.",
            "Approximation Algorithms for Access Network Design.",
            "Partitioning a Square into Rectangles: NP-Completeness and Approximation Algorithms.",
            "Max- and Min-Neighborhood Monopolies.",
            "Budget Management with Applications.",
            "Communication - Processor Tradeoffs in a Limited Resources PRAM.",
            "Planar Graph Blocking for External Searching.",
            "Introduction.",
            "Secrecy, Computational Loads and Rates in Practical Quantum Cryptography.",
            "Security of Practical Time-Reversed EPR Quantum Key Distribution.",
            "Security of Practical BB84 Quantum Key Distribution.",
            "Security of Quantum Key Distribution against All Collective Attacks.",
            "Linking Classical and Quantum Key Agreement: Is There a Classical Analog to Bound Entanglement?",
            "Quantum Algorithms for Weighing Matrices and Quadratic Residues.",
            "Quantum Complexities of Ordered Searching, Sorting, and Element Distinctness.",
            "Sharp Quantum versus Classical Query Complexity Separations.",
            "The Quantum Complexity of Set Membership.",
            "The Quantum Black-Box Complexity of Majority.",
            "Remotely Prepared Entanglement: a Quantum Web Page.",
            "A New Proof for the Existence of Mutually Unbiased Bases.",
            "The Representation of Numbers in Quantum Mechanics."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2001",
        "info": "2001: Volumes\n29,\n30,\n31",
        "count": 89,
        "papers": [
            "Average-Case Analysis of Algorithms - Preface.",
            "The Contraction Method for Recursive Algorithms.",
            "An Algorithmic Approach to Discovering and Proving q-Series Identities.",
            "Transitional Behaviors of the Average Cost of Quicksort with Median-of-(2t+1).",
            "Bandwidth Packing.",
            "An Analytic Approach to the Height of Binary Search Trees.",
            "A Unified Presentation of Some Urn Models.",
            "Near-Optimal Bounded-Degree Spanning Trees.",
            "Partial Match Queries in Relaxed Multidimensional Search Trees.",
            "Smallest Components in Decomposable Structures: Exp-Log Class.",
            "Analysis of an Adaptive Algorithm to Find the Two Nearest Neighbors.",
            "On the Analysis of Stochastic Divide and Conquer Algorithms.",
            "Dynamical Sources in Information Theory: Fundamental Intervals and Word Prefixes.",
            "Dynamical Sources in Information Theory: A General Analysis of Trie Structures.",
            "Solving Some Discrepancy Problems in NC.",
            "Static Frequency Assignment in Cellular Networks.",
            "The Dense k-Subgraph Problem.",
            "Ancient and New Algorithms for Load Balancing in the lp Norm.",
            "On Two Class-Constrained Versions of the Multiple Knapsack Problem.",
            "A Randomized Algorithm for Approximate String Matching.",
            "Efficient Parallel Computation of the Characteristic Polynomial of a Sparse, Separable Matrix.",
            "Simple Algorithms for Multimessage Multicasting with Forwarding.",
            "Parallel Algorithms for Series Parallel Graphs and Graphs with Treewidth Two.",
            "Algorithms for the On-Line Travelling Salesman.",
            "Equivalence of epsilon-Approximate Separation and Optimization in Fixed Dimensions.",
            "Efficient Algorithms for Integer Programs with Two Variables per Constraint.",
            "Reactive Local Search for the Maximum Clique Problem.",
            "Steiner Minimal Trees with One Polygonal Obstacle.",
            "On Nonlinear Parametric Search.",
            "Optimal Edge Ranking of Trees in Linear Time.",
            "A Generalization of a Lower Bound Technique due to Fredman and Saks.",
            "Circular Separability of Polygons.",
            "Efficient Construction of Minimum Makespan Schedules for Tasks with a Fixed Number of Distinct Execution Times.",
            "Optimal Search and One-Way Trading Online Algorithms.",
            "Guest Editor's Foreword.",
            "A One-Step Crust and Skeleton Extraction Algorithm.",
            "Efficient Regular Data Structures and Algorithms for Dilation, Location, and Proximity Problems.",
            "Constraint-Based Processing of Multiway Spatial Joins.",
            "Robust Distance-Based Clustering with Applications to Spatial Data Mining.",
            "Structural Lines, TINs, and DEMs.",
            "Right-Triangulated Irregular Networks.",
            "An Iterative Displacement Method for Conflict Resolution in Map Generalization.",
            "Automated Displacement for Large Numbers of Discrete Map Objects.",
            "Contextual Building Typification in Automated Map Generalization.",
            "Three Rules Suffice for Good Label Placement.",
            "Guest Editors' Introduction.",
            "On Rooted Node-Connectivity Problems.",
            "Random Sampling of Euler Tours.",
            "Polynomial Time Approximation Schemes for Some Dense Instances of NP-Hard Optimization Problems.",
            "Best Possible Approximation Algorithm for MAX SAT with Cardinality Constraint.",
            "An Approximation Algorithm for Circular Arc Colouring.",
            "Sample Spaces with Small Bias on Neighborhoods and Error-Correcting Communication Protocols.",
            "On the Hardness of Approximating Spanners.",
            "Approximation of Geometric Dispersion Problems.",
            "Guest Editor's Introduction.",
            "Improving an Algorithm for Approximate Pattern Matching.",
            "An Approximate Determinization Algorithm for Weighted Finite-State Automata.",
            "Approximating Shortest Paths on Weighted Polyhedral Surfaces.",
            "FIST: Fast Industrial-Strength Triangulation of Polygons.",
            "Algorithmic Aspects of Using Small Instance Relaxations in Parallel Branch-and-Cut.",
            "VISOR: Vast Independence System Optimization Routine.",
            "Parallel Implementation of a Class of Adaptive Signal Processing Applications.",
            "The Role of Arithmetic in Fast Parallel Matrix Inversion.",
            "Certification of Numerical Computation of the Sign of the Determinant of a Matrix.",
            "Geometry Helps in Bottleneck Matching and Related Problems.",
            "On-Line Competitive Algorithms for Call Admission in Optical Networks.",
            "Permutation Routing on Reconfigurable Meshes.",
            "Approximation Algorithms for Degree-Constrained Minimum-Cost Network-Design Problems.",
            "Inapproximability Results for Guarding Polygons and Terrains.",
            "Bounded Space On-Line Bin Packing: Best Is Better than First.",
            "Uniquely Restricted Matchings.",
            "All-to-All Optical Routing in Chordal Rings of Degree 4.",
            "An Efficient Output-Size Sensitive Parallel Algorithm for Hidden-Surface Removal for Terrains.",
            "Searching for Mobile Intruders in a Polygonal Region by a Group of Mobile Searchers.",
            "Lopsided Trees, I: Analyses.",
            "On the Probablistic Worst-Case Time of \"Find\".",
            "The Asymptotic Number of Leftist Trees.",
            "Average Profile of the Lempel-Ziv Parsing Scheme for a Markovian Source.",
            "Analytic Variations on the Airy Distribution.",
            "Efficient Reorganization of Binary Search Trees.",
            "A Limit Law for Outputs in Random Recursive Circuits.",
            "Exact Largest and Smallest Size of Components.",
            "A q-Analogue of the Path Length of Binary Search Trees.",
            "Stochastic Analysis of Shell Sort.",
            "Exact Algorithms for Linear Programming over Algebraic Extensions.",
            "Grade of Service Steiner Minimum Trees in the Euclidean Plane.",
            "Relaxed Balance Using Standard Rotations.",
            "Bounding the Inefficiency of Length-Restricted Prefix Codes.",
            "Reconstructing a Minimum Spanning Tree after Deletion of Any Node."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "2000",
        "info": "2000: Volumes\n26,\n27,\n28",
        "count": 73,
        "papers": [
            "Foreword.",
            "Finding Edge-Disjoint Paths in Partial k-Trees.",
            "Computing Mimicking Networks.",
            "A Simplified Õ(nm) Time Edge-Splitting Algorithm in Undirected Graphs.",
            "On Exact Solutions for the Rectilinear Steiner Tree Problem Part I: Theoretical Results.",
            "Efficient Orthogonal Drawings of High Degree Graphs.",
            "Reconstructing the Topology of a CAD Model - a Discrete Approach.",
            "Complexity and Modeling Aspects of Mesh Refinement into Quadrilater.",
            "Practical Performance of Efficient Minimum Cut Algorithms.",
            "Optimization Problems Related to Zigzag Pocket Machining.",
            "Sorting-Based Selection Algorithms for Hypercubic Networks.",
            "A Simultaneous Search Problem.",
            "Parallel Algorithms for Maximum Matching in Complements of Interval Graphs and Related Problems.",
            "Fast Algorithms to Enumerate All Common Intervals of Two Permutations.",
            "Guest Editors' Foreword.",
            "Parts Feeding on a Conveyor with a One Joint Robot.",
            "Probabilistic Algorithms for Efficient Grasping and Fixturing.",
            "Visibility-Based Planning of Sensor Control Strategies.",
            "Algorithms for Sensorless Manipulation Using a Vibrating Surface.",
            "Robot Motion Planning: A Game-Theoretic Foundation.",
            "Grasping and In-Hand Manipulation: Geometry and Algorithms.",
            "Geometric Eccentricity and the Complexity of Manipulation Plans.",
            "Mobile Robot Self-Localization without Explicit Landmarks.",
            "Planning Motions of Polyhedral Parts by Rolling.",
            "A General Framework for Assembly Planning: The Motion Space Approach.",
            "Introduction.",
            "Topology-Oriented Implementation - An Approach to Robust Geometric Algorithms.",
            "Efficient Exact Evaluation of Signs of Determinants.",
            "Shortest Path Geometric Rounding.",
            "A Strong and Easily Computable Separation Bound for Arithmetic Expressions Involving Radicals.",
            "Parameterization in Finite Precision.",
            "Erratum: A Correction to \"Parallel Approximation Algorithms by Positive Linear Programming\".",
            "An Algorithm for Enumerating All Spanning Trees of a Directed Graph.",
            "One for the Price of Two: a Unified Approach for Approximating Covering Problems.",
            "Binary Searching with Nonuniform Costs and Its Application to Text Retrieval.",
            "Smallest Enclosing Cylinders.",
            "Optimal Sublogarithmic Time Parallel Algorithms on Rooted Forests.",
            "Approximation Algorithms for Minimum K-Cut.",
            "Introduction.",
            "Shortest Paths in Digraphs of Small Treewidth. Part I: Sequential Algorithms.",
            "A Linear Algorithm for Finding [{g, f}]-Colorings of Partial {k}-Trees.",
            "Generalized Dominators for Structured Programs.",
            "Linear-Time Algorithms for Partial k-Tree Complements.",
            "Diameter and Treewidth in Minor-Closed Graph Families.",
            "Dynamic Algorithms for Graphs of Bounded Treewidth.",
            "Evaluating Network Reliability and 2-Edge-Connected Reliability in Linear Time for Bounded Pathwidth Graphs.",
            "Faster Algorithms for Subgraph Isomorphism of k-Connected Partial k-Trees.",
            "Definability Equals Recognizability of Partial 3-Trees and k-Connected Partial k-Trees.",
            "Memory Requirements for Table Computations in Partial k-Tree Algorithms.",
            "Graph Searching on Some Subclasses of Chordal Graphs.",
            "Introduction.",
            "Denesting by Bounded Degree Radicals.",
            "A Linear Time Algorithm for the Arc Disjoint Menger Problem in Planar Directed Graphs.",
            "Optimal Adaptive Broadcasting with a Bounded Fraction of Faulty Nodes.",
            "Partitioning Planar Graphs with Vertex Costs: Algorithms and Applications.",
            "Dynamically Switching Vertices in Planar Graphs.",
            "Optimal Reconstruction of Graphs under the Additive Model.",
            "Fault-Tolerant Real-Time Scheduling.",
            "Approximating Satisfiable Satisfiability Problems.",
            "Online Randomized Multiprocessor Scheduling.",
            "Parallel Algorithms for Partitioning Sorted Sets and Related Problems.",
            "Finding the k Shortest Paths in Parallel.",
            "Simple Algorithms for the On-Line Multidimensional Dictionary and Related Problems.",
            "Errata: A New Algorithm for Scheduling Periodic, Real-Time Tasks.",
            "Fast Spatial Decomposition and Closest Pair Computation for Limited Precision Input.",
            "The Temporal Precedence Problem.",
            "A Unified Approach to Conic Visibility.",
            "Sorting by Short Block-Moves.",
            "Linear Size Binary Space Partitions for Uncluttered Scenes.",
            "Improved Algorithms for Dynamic Shortest Paths.",
            "A Faster One-Dimensional Topological Compaction Algorithm with Jog Insertion.",
            "Approximation Algorithms with Bounded Performance Guarantees for the Clustered Traveling Salesman Problem.",
            "Improved Routing and Sorting on Multibutterflies."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1999",
        "info": "1999: Volumes\n23,\n24,\n25",
        "count": 68,
        "papers": [
            "Counting Distinct Strings.",
            "Competitive Implementation of Parallel Programs.",
            "Adaptive Disk Spindown via Optimal Rent-to-Buy in Probabilistic Environments.",
            "Separators in Graphs with Negative and Multiple Vertex Weights.",
            "Compact Routing on Chordal Rings of Degree 4.",
            "A Note on the Expected Time for Finding Maxima by List Algorithms.",
            "On the Sum Coloring Problem on Interval Graphs.",
            "Faster Approximate String Matching.",
            "Upper and Lower Bounds on the Makespan of Schedules for Tree Dags on Linear Arrays.",
            "LRU Is Better than FIFO.",
            "Two-Way and Multiway Partitioning of a Set of Intervals for Clique-Width Maximization.",
            "Algorithms for a Class of Isotonic Regression Problems.",
            "A Linear-Time Algorithm for the Feasibility of Pebble Motion on Trees.",
            "Suffix Trees on Words.",
            "Solving Systems of Difference Constraints Incrementally.",
            "Foreword.",
            "Improved Bounds for On-Line Load Balancing.",
            "Output-Sensitive Reporting of Disjoint Paths.",
            "Harmonic Analysis, Real Approximation, and the Communication Complexity of Boolean Functions.",
            "An O(n log n) Average Time Algorithm for Computing the Shortest Network under a Given Topology.",
            "Reductions Do Not Preserve Fast Convergence Rates in Average Time.",
            "Constructing a Tree from Homeomorphic Subtrees, with Applications to Computational Evolutionary Biology.",
            "Efficiency of Randomized Parallel Backtrack Search.",
            "On-Line Resource Management with Application to Routing and Scheduling.",
            "Computing Vision Points in Polygons.",
            "A Fast Bit-Parallel Algorithm for Computing the Subset Partial Order.",
            "A Comparison of Resource-Bounded Molecular Computation Models.",
            "Bounded Degree Interval Sandwich Problems.",
            "Isomorphism for Graphs of Bounded Distance Width.",
            "Approximating Latin Square Extensions.",
            "Efficient Algorithms for Dynamic Allocation of Distributed Memo.",
            "Guest Editor's Introduction.",
            "String Search in Coarse-Grained Parallel Computers.",
            "d-Dimensional Range Search on Multicomputers.",
            "The Complexity of Parallel Multisearch on Coarse-Grained Machines.",
            "Design and Implementation of a Practical Parallel Delaunay Algorithm.",
            "A Randomized Algorithm for the Voronoi Diagram of Line Segments on Coarse-Grained Multiprocessors.",
            "Memory-Efficient Matrix Multiplication in the BSP Model.",
            "Efficient Algorithms for Block-Cyclic Redistribution of Arrays.",
            "Distributed Matrix-Free Solution of Large Sparse Linear Systems over Finite Fields.",
            "Performing BMMC Permutations Efficiently on Distributed-Memory Multiprocessors with MPI.",
            "A Note on Parallel Selection on Coarse-Grained Multicomputers.",
            "Modeling Parallel Bandwidth: Local versus Global Restrictions.",
            "BSP versus LogP.",
            "Guest Editors' Foreword.",
            "Approximate Option Pricing.",
            "On Capital Investment.",
            "Efficient On-Line Nonparametric Kernel Density Estimation.",
            "Parallel Strategies for Computing the Orthogonal Factorizations Used in the Estimation of Econometric Models.",
            "Analysis of the SSAP Method for the Numerical Valuation of High-Dimensional Multivariate American Securities.",
            "A Risk-Reward Framework for the Competitive Analysis of Financial Games.",
            "Competitive Optimal On-Line Leasing.",
            "Guest Editors' Foreword.",
            "Parallel Biomolecular Computation: Models and Simulations.",
            "On the Linear-Cost Subtree-Transfer Distance between Phylogenetic Trees.",
            "Evolutionary Trees and Ordinal Assertions.",
            "Molecular Computing, Bounded Nondeterminism, and Efficient Recursion.",
            "Simulating Boolean Circuits on a DNA Computer.",
            "The Performance of Neighbor-Joining Methods of Phylogenetic Reconstruction.",
            "On the Intractability of Protein Folding with a Finite Alphabet of Amino Acids.",
            "Mass Estimation of DNA Molecules and Extraction of Ordered Restriction Maps in Optical Mapping Imagery.",
            "Approximation Algorithms for the Fixed-Topology Phylogenetic Number Problem.",
            "An Algorithm for Identifying Similar Amino Acid Clusters among Different Alpha-Helical Coiled-Coil Proteins Using Their Secondary Structure.",
            "Computational Approaches to Drug Design.",
            "Computer Algebra Methods for Studying and Computing Molecular Conformations.",
            "The Seat Reservation Problem.",
            "Concatenation-Based Greedy Heuristics for the Euclidean Steiner Tree Problem.",
            "Optimal Deterministic Sorting and Routing on Grids and Tori with Diagonals."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1998",
        "info": "1998: Volumes\n20,\n21,\n22",
        "count": 73,
        "papers": [
            "Upper and Lower Bounds for Selection in the Mesh.",
            "Average-Case Analysis of Dynamic Graph Algorithms.",
            "Minkowski-Type Theorems and Least-Squares Clustering.",
            "On Learning Decision Trees with Large Output Domains.",
            "Minimizing Mean Flow Time with Error Constraint.",
            "An Algorithm for Straight-Line Drawing of Planar Graphs.",
            "Efficient Randomized Algorithms for the Repeated Median Line Estimator.",
            "Approximating Minimum Feedback Sets and Multicuts in Directed Graphs.",
            "A Unified Analysis of Paging and Caching.",
            "Efficient Algorithms for Computing a Complete Visibility Region in Three-Dimensional Space.",
            "Linear-Time Algorithms for Finding the Shadow Volumes from a Convex Area Light Source.",
            "Maintaining the Classes of 4-Edge-Connectivity in a Graph On-Line.",
            "On Coloring Unit Disk Graphs.",
            "Minimum Dominating Sets of Intervals on Lines.",
            "Subcubic Cost Algorithms for the All Pairs Shortest Path Problem.",
            "A New Approach for the Geodesic Voronoi Diagram of Points in a Simple Polygon and Other Restricted Polygonal Domains.",
            "Two-Dimensional Prefix String Matching and Covering on Square Matrices.",
            "Approximation Algorithms for Connected Dominating Sets.",
            "String Matching in Lempel-Ziv Compressed Strings.",
            "Fast Generation of Random Permutations Via Networks Simulation.",
            "Greedy Algorithms for the Shortest Common Superstring That Are Asymptotically Optimal.",
            "The Analysis of Linear Probing Hashing with Buckets.",
            "Parallel Approximation Algorithms by Positive Linear Programming.",
            "Matching Convex Shapes with Respect to the Symmetric Difference.",
            "On-Line and Off-Line Approximation Algorithms for Vector Covering Problems.",
            "On Minimum-Area Hulls.",
            "Lempel-Ziv Index for q-Grams.",
            "Interval Routing Schemes.",
            "Finding Largest Subtrees and Smallest Supertrees.",
            "Finding All Minimal Shapes in a Routing Channel.",
            "On-Line Load Balancing and Network Flow.",
            "Mapping Clones with a Given Ordering or Interleaving.",
            "A Linear-Time Approximation Scheme for Minimum, Weight Triangulation of Convex Polygons.",
            "Average Case Analyses of List Update Algorithms, with Applications to Data Compression.",
            "Computing Betti Numbers via Combinatiorial Laplacians.",
            "A Lower Bound for Nearly Minimal Adaptive and Hot Potato Algorithms.",
            "On Certificates and Lookahead in Dynamic Graph Problems.",
            "Approximating Biconnectivity in Parallel.",
            "Can Finite Samples Detect Singularities of Reao-Valued Functions?",
            "A Good Oracle Is Hard to Beat.",
            "A Polynomial-Time Algorithm for Learning Noisy Linear Threshold Functions.",
            "PAC Learning Intersections of Halfspaces with Membership Queries.",
            "Learning Boxes in High Dimension.",
            "Learning Matrix Functions over Rings.",
            "On Bayes Methods for On-Line Boolean Prediction.",
            "Strategy Under the Unknown Stochastic Environment: The Nonparametric Lob-Pass Problem.",
            "Classification Accuracy Based on Observed Margin.",
            "Minimizing alpha-Information for Generalization and Interpretation.",
            "A Class of Asymptotically Stable Algorithms for Learning-Rate Adaptation.",
            "On a Kernel-Based Method for Pattern Recognition, Regression, Approximation, and Operator Inversion.",
            "A Fully Dynamic Approximation Scheme for Shortest Paths in Planar Graphs.",
            "Semidynamic Algorithms for Maintaining Single-Source Shortest Path Trees.",
            "Maintaining Spanning Trees of Small Diameter.",
            "An Incremental Distributed Algorithm for Computing Biconnected Components in Dynamic Graphs.",
            "Maintaining Regular Properties Dynamically in k-Terminal Graphs.",
            "Lower Bounds for Fully Dynamic Connectivity Problems in Graphs.",
            "Philippe Flajolet's Research in Analysis of Algorithms and Combinatorics.",
            "A. Metropolis-Type Optimization Algorithm on the Infinite Tree.",
            "The Complete Solution of the Competitive Rank Selection Problem.",
            "Packing Random Intervals On-Line.",
            "A Note on Point Location in Delaunay Triangulations of Random Points.",
            "Average-Case Analysis of the Merging Algorithm of Hwang and Lin.",
            "On the Analysis of Linear Probing Hashing.",
            "Saddle Points in Random Matrices: Analysis of Knuth Search Algorithms.",
            "Asymptotics of Divide-and-Conquer Recurrences: Batcher's Sorting Algorithm and a Minimum Euclidean Matching Heuristic.",
            "A Note on the Asymptotic Behavior of the Depth of Tries.",
            "Linear Probing and Graphs.",
            "Probabilistic Analysis of MULTIPLE QUICK SELECT.",
            "Average-Case Analysis for a Simple Compression Algorithm.",
            "Average-Case Analysis of Priority Trees: A Structure for Priority Queue Administration.",
            "On Pattern Frequency Occurrences in a Markovian Sequence.",
            "The List Update Problem: Improved Bounds for the Counter Scheme.",
            "Dynamics of the Binary Euclidean Algorithm: Functional Analysis and Operators."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1997",
        "info": "1997: Volumes\n17,\n18,\n19",
        "count": 79,
        "papers": [
            "An Algorithm Reminiscent of Euclidean-gcd Computing a Function Related to Pinwheel Scheduling.",
            "Optimal Parallel Verification of Minimum Spanning Trees in Logarithmic Time.",
            "\"The Big Sweep\": On the Power of the Wavefront Approach to Voronoi Diagrams.",
            "Efficient Construction of a Bounded-Degree Spanner with Low Weight.",
            "Fast Integer Merging on the EREW PRAM.",
            "Parallel Algorithms for the Hamiltonian Cycle and Hamiltonian Path Problems in Semicomplete Bipartite Digraphs.",
            "Minimizing Channel Density with Movable Terminals.",
            "Using Quadratic Programming to Solve High Multiplicity Scheduling Problems on Parallel Machines.",
            "Evaluating Signs of Determinants Using Single-Precision Arithmetic.",
            "Algorithms for the Boundary Selection Problem.",
            "A Linear-Time Algorithm for the Generation of Trees.",
            "Maintaining Dynamic Sequences under Equality Tests in Polylogarithmic Time.",
            "Three-Dimensional Graph Drawing.",
            "Finding and Counting Given Length Cycles.",
            "Randomized Multipacket Routing and Sorting on Meshes.",
            "Decomposing the Boundary of a Nonconvex Polyhedron.",
            "Efficient Parallel Recognition of Some Circular Arc Graphs, II.",
            "Proximity Problems for Points on a Rectilinear Plane with Rectangular Obstacles.",
            "The Complexity of Almost-Optimal Simultaneous Coordination.",
            "Randomized Quickhull.",
            "Complexities of Efficient Solutions of Rectilinear Polygon Cover Problems.",
            "Construction of C-Space Roadmaps from Local Sensory Data. What Should the Sensors Look For?",
            "On Counting Pairs of Intersecting Segments and Off-Line Triangle Range Searching.",
            "Efficient Parallel Algorithms for Computing All Pair Shortest Paths in Directed Graphs.",
            "An O(n³) Recognition Algorithm for Bithreshold Graphs.",
            "New Algorithms for Minimizing the Longest Wire Length During Circuit Compaction.",
            "Improved Parallel Approximation of a Class of Integer Programming Problems.",
            "Primal-Dual Approximation Algorithms for Integral Flow and Multicut in Trees.",
            "An Approximation Algorithm for Minimum-Cost Vertex-Connectivity Problems.",
            "Randomized Approximation of Bounded Multicovering Problems.",
            "Improved Approximation Algorithms for MAX k-CUT and MAX BISECTION.",
            "On Approximating the Longest Path in a Graph.",
            "A Series of Approximation Algorithms for the Acyclic Directed Steiner Tree Problem.",
            "An O (log k)-Approximation Algorithm for the k Minimum Spanning Tree Problem in the Plane.",
            "An Algorithm for the Three-Dimensional Packing Problem with Asymptotic Performance Analysis.",
            "Greed is Good: Approximating Independent Sets in Sparse and Bounded-Degree Graphs.",
            "Time-Optimal Trajectories of a Rod in the Plane Subject to Velocity Constraints.",
            "k Best Cuts for Circular-Arc Graphs.",
            "Sorting Helps for Voronoi Diagrams.",
            "Orthogonal Queries in Segments.",
            "Improved Bounds for Electing a Leader in a Synchronous Ring.",
            "A Simpler Minimum Spanning Tree Verification Algorithm.",
            "Classes of Cost Functions for String Edit Distance.",
            "On the Influence of Lookahead in Competitive Paging Algorithms.",
            "Trekking in the Alps Without Freezing or Getting Tired.",
            "Combine and Conquer.",
            "Multicommodity Flows in Even, Planar Networks.",
            "An Efficient Parallel Algorithm for the Layered Planar Monotone Circuit Value Problem.",
            "The Bit Complexity of Distributed Sorting.",
            "Routing on Meshes with Buses.",
            "Optimal Tree Constraction and Term Matching on the Hypercube and Related Networks.",
            "On Algorithm Design for Metrical Task Systems.",
            "Wait-Free Clock Synchronization.",
            "Detecting False Matches in String-Matching Algorithms.",
            "Equivalence of Binary and Ternary Algebraic Decision Trees.",
            "On Constructing Minimum Spanning Trees in Rkl.",
            "A Flexible Algorithm for Generating All the Spanning Trees in Undirected Graphs.",
            "A General Class of Heuristics for Minimum Weight Perfect Matching and Fast Special Cases with Doubly and Triply Logarithmic Errors.",
            "Optimal Graph Constraint Reduction for Symbolic Layout Compaction.",
            "Minimal Fixturing of Frictionless Assemblies: Complexity and Algorithms.",
            "Planning for Modular and Hybrid Fixture.",
            "Feasibility of Design in Stereolithography.",
            "Determining the Castability of Simple Polyhedra.",
            "Visualization of Three-Dimensional Delaunay Meshes.",
            "Coordinated Manipulation of Objects in a Plane.",
            "Multiple Translational Containment. Part I: An Approximate Algorithm.",
            "Multiple Translational Containment. Part II: Exact Algorithms.",
            "Efficient Perturbations for Handling Geometric Degeneracies.",
            "Reconstructing Surfaces and Functions on Surfaces from Unorganized Three-Dimensional Data.",
            "Hexagonal Models for Channel Routing.",
            "Parallel Searching in Generalized Monge Arrays.",
            "Expansion of Linear Steiner Trees.",
            "From Ukkonen to McCreight and Weiner: A Unifying View of Linear-Time Suffix Tree Construction.",
            "Parallel Algorithms for Maximal Acyclic Sets.",
            "Tree-Based Parallel Algorithm Design.",
            "On Implementing the Push-Relabel Method for the Maximum Flow Problem.",
            "A Pinwheel Scheduler for Three Distinct Numbers with a Tight Schedulability Bound.",
            "On Triangulating Planar Graphs Under the Four-Connectivity Constraint.",
            "On the Complexity of Approximating Euclidean Traveling Salesman Tours and Minimum Spanning Trees."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1996",
        "info": "1996: Volumes\n15,\n16",
        "count": 68,
        "papers": [
            "Testing Homotopic Routability Under Polygonal Wiring Rules.",
            "The Optimal Control Approach to Generalized Multiprocessor Scheduling.",
            "A Subquadratic Algorithm for Approximate Limited Expression Matching.",
            "Fast Algorithms for Minimum Matrix Norm with Application in Computer Graphics.",
            "Using Topological Sweep to Extract the Boundaries of Regions in Maps Represented by Region Quadtrees.",
            "Parallel Algorithms for Arrangements.",
            "Sweep Methods for Parallel Computational Geometry.",
            "Optimal Cooperative Search in Fractional Cascaded Data Structures.",
            "Parallel Construction of Binary Trees with Near Optimal Weighted Path Lengt.",
            "Preconditioning Index Set Transformations for Time-Optimal Affine Scheduling.",
            "A Constrained Edit Distance Between Unordered Labeled Trees.",
            "Incremental Topological Flipping Works for Regular Triangulations.",
            "Optimal Parallel Algorithm for Finding st-Ambitus of a Planar Biconnected Graph.",
            "Bidirectional Edges Problem: Part I-A Simple Algorithm.",
            "Designing Checkers for Programs that Run in Parallel.",
            "On-Line Maintenance of Triconnected Components with SPQR-Trees.",
            "Fast Deterministic Selection on Mesh-Connected Processor Arrays.",
            "The Implementation of Linear Programming Algorithms Bases on Homotopies.",
            "A Paradigm for Listing (s, t)-Cuts in Graphs.",
            "Scheduling Tree DAGs on Parallel Architectures.",
            "Weighted and Unweighted Maximum Clique Algorithms with Upper Bounds from Fractional Coloring.",
            "Strongly Adaptive Token Distribution.",
            "Lines in Space: Combinatorics and Algorithms.",
            "Searching Among Intervals and Compact Routing Tables.",
            "Recurrence Relations on Heaps.",
            "Data Structures and Algorithms for the String Statistics Problem.",
            "Optimizing Area for Three-Layer Knock-Knee Channel Routing.",
            "Algorithms for Dense Graphs and Networks on the Random Access Computer.",
            "Area Minimization for Hierarchical Floorplans.",
            "Nonpreemptive Scheduling of Periodic Tasks in Uni- and Multiprocessor Systems.",
            "Proportionate Progress: A Notion of Fairness in Resource Allocation.",
            "Connected Component and Simple Polygon Intersection Searching.",
            "Guest Editors' Introduction to the Special Issue on Graph Drwaing.",
            "Drawing Planar Graphs Using the Canonical Ordering.",
            "Maximum Planar Subgraphs and Nice Embeddings: Practical Layout Tools.",
            "The Realization Problem for Euclidean Minimum Spanning Trees in NP-Hard.",
            "Characterizing Proximity Trees.",
            "Applications of the Crossing Number.",
            "Drawings of Graphs on Surfaces with Few Crossings.",
            "Competitive Distributed Decision-Making.",
            "Fast Stable In-Place Sorting with O (n) Data Moves.",
            "A New Combinatorial Approach to Optimal Embeddings of Rectangles.",
            "Blocking for External Graph Searching.",
            "Efficiently Extendible Mappings for Balanced Data Distribution.",
            "On the Embedding Phase of the Hopcroft and Tarjan Planarity Testing Algorithm.",
            "An NC Algorithm for Finding a Minimum Weighted Completion Time Schedule on Series Parallel Graphs.",
            "Decremental 2- and 3-Connectivity on Planar Graphs.",
            "Covering a String.",
            "Communication Complexity in a 3-Computer Model.",
            "Approximation Algorithms for Tree Alignment with a Given Phylogeny.",
            "Equispreading Tree in Manhattan Distance.",
            "Shortest Noncrossing Paths in Plane Graphs.",
            "Introduction to Special Issue on Randomized and Derandomized Algorithms.",
            "Simulating BPP Using a General Weak Random Source.",
            "A Mildly Exponential Approximation Algorithm for the Permanent.",
            "On the Number of Eulerian Orientations of a Graph.",
            "On Deterministic Approximation of DNF.",
            "Derandomization, Witnesses for Boolean Matrix Multiplication and Construction of Perfect Hash Functions.",
            "Randomized Geometric Algorithms and Pseudorandom Generators.",
            "Randomized Search Trees.",
            "A Subexponential Bound for Linear Programming.",
            "Efficient PRAM Simulation on a Distributed Memory Machine.",
            "A Method for Obtaining Randomized Algorithms with Small Tail Probabilities.",
            "Interval Routing Schemes.",
            "A Nearly Optimal Deterministic Parallel Voroni Diagram Algorithm.",
            "Generating Rooted Triangulations Without Repetitions.",
            "Optimal Algorithms for the Single and Multiple Vertex Updating Problems of a Minimum Spanning Tree.",
            "Shellsort with a Constant Number of Increments."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1995",
        "info": "1995: Volumes\n13,\n14",
        "count": 54,
        "papers": [
            "Guest Editor's Foreword: Special Issue on Computational Molecular Biology.",
            "Combinatiorial Algorithms for DNA Sequence Assembly.",
            "Physical Mapping of Chromosomes: A Combinatorial Problem in Molecular Biology.",
            "DNA Physical Mapping and Alternating Eulerian Cycles in Colored Graphs.",
            "Linear-Space Algorithms that Build Local Alignments from Fragments.",
            "Multiple Filtration and Approximate Pattern Matching.",
            "A Robust Model for Finding Optimal Evolutionary Trees.",
            "Exact and Approximation Algorithms for Sorting by Reversals, with Application to Genome Rearrangement.",
            "Super-Pattern Matching.",
            "Dynamic Expression Trees.",
            "The Complexity of Induced Minors and Related Problems.",
            "A Lower Bound on the Probability of Conflict Under Nonuniform Access in Database Systems.",
            "Maintaining the Visibility Map of Spheres While Moving the Viewpoint on a Circle at Infinity.",
            "The Joint Distribution of the Three Types of Nodes in Uniform Binary Trees.",
            "Dynamic Half-Space Range Reporting and Its Applications.",
            "Random Parallel Algorithms for Finding Exact Branchings, Perfect Matchings, and Cycles.",
            "New Primal and Dual Matching Heuristics.",
            "On Greedy Heuristics for Steiner Minimum Trees.",
            "Point Set Pattern Matching in d-Dimensions.",
            "Squares, Cubes, and Time-Space Efficient String Searching.",
            "All-Pairs Shortest Paths and the Essential Subgraph.",
            "Using Geometry To Solve the Transportation Problem in the Plane.",
            "Asymptotic Speed-Ups in Constructive Solid Geometry.",
            "Landmark-Based Robot Navigation.",
            "Fully Dynamic Biconnectivity in Graphs.",
            "Assembly Sequences for Polyhedra.",
            "An Efficient Parallel Algorithm for Finding Rectangular Duals of Plane Triangular Graphs.",
            "A Linear Algorithm To Decompose Inheritance Graphs Into Modules.",
            "Optimal Edge Ranking of Trees in Polynomial Time.",
            "Staircase Visibility and Computation of Kernels.",
            "Characterizing and Recognizing the Visibility Graph of a Funnel-Shaped Polygon.",
            "O(log log n)-Time Integer Geometry on the CRCW PRAM.",
            "Can PAC Learning Algorithms Tolerate Random Attribute Noise?",
            "Approximate Regular Expression Pattern Matching with Concave Gap Penalties.",
            "Generation of Polynomial-Time Algorithms for Some Optimization Problems on Tree-Decomposable Graphs.",
            "Isomorphic Tree Spanner Problems.",
            "Lower Bounds for Set Intersection Queries.",
            "A Time-Optimal Parallel Algorithm for Three-Dimensional Convex Hulls.",
            "Finding a Closest Visible Vertex Pair Between Two Polygons.",
            "A Linear-Time Algorithm for Constructing a Circular Visibility Diagram.",
            "An O(n²) Incremental Algorithm for Modular Decomposition of Graphs and 2-Structures.",
            "On-Line Construction of Suffix Trees.",
            "Optimal Parallel Algorithms for Rectilinear Link-Distance Problems.",
            "A 2n-2 Step Algorithm for Routing in an n*n Array with Constant-Size Queues.",
            "Balancing Minimum Spanning Trees and Shortest-Path Trees.",
            "An Efficient Parallel Algorithm for Shortest Paths in Planar Layered Digraphs.",
            "Bottom-Up Mergesort - a Detailed Analysis.",
            "Finding All Periods and Initial Palindromes of a String in Parallel.",
            "The Complexity of Oblivious Plans for Orienting and Distinguishing Polygonal Parts.",
            "An Optimal Parallel Algorithm for Planar Cycle Separators.",
            "Minimean Optimal Key Arrangements in Hash Tables.",
            "An Optimal Algorithm for Shortest Paths on Weighted Interval and Circular-Arc Graphs, with Applications.",
            "Provably Good Approximation Algorithms for Optimal Kinodynamic Planning: Robots with Decoupled Dynamics Bounds.",
            "Provably Good Approximation Algorithms for Optimal Kinodynamic Planning for Cartesian Robots and Open-Chain Manipulators."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1994",
        "info": "1994: Volumes\n11,\n12",
        "count": 60,
        "papers": [
            "Guest Editor's Foreword: Special Issue on On-Line Algorithms.",
            "On the Power of Randomization in On-Line Algorithms.",
            "Randomized Competitive Algorithms for the List Update Problem.",
            "On-Line Algorithms for Locating Checkpoints.",
            "Coloring Inductive Graphs On-Line.",
            "A New Measure for the Study of On-Line Algorithms.",
            "Dynamic Programming and Convex Clustering.",
            "A Tight Lower Bound for the Worst Case of Bottom-Up-Heapsort.",
            "Algorithms for Bichromatic Line-Segment Problems Polyhedral Terrains.",
            "Variations on Ray Shooting.",
            "The Derivation of On-Line Algorithms, with an Application To Finding Palindromes.",
            "Planar Geometric Location Problems.",
            "Editor's Foreword: Special Issur on Network Flow Algorithms.",
            "Flow in Planar Graphs with Vertex Capacities.",
            "Tight Bounds on the Number of Minimum-Mean Cycle Cancellations and Related Results.",
            "A New Scaling Algorithm for the Maximum Mean Cut Problem.",
            "Efficient Algorithms for Minimum-Cost Flow Problems with Piecewise-Linear Convex Costs.",
            "A Faster Parametric Minimum-Cut Algorithm.",
            "Network Flow and 2-Satisfiability.",
            "Algorithms and Complexity Analysis for Some Flow Problems.",
            "A Linear Algorithm for Analysis of Minimum Spanning and Shortest-Path Trees of Planar Graphs.",
            "On the Complexity of Preflow-Push Algorithms for Maximum-Flow Problems.",
            "Visibility with a Moving Point of View.",
            "Edge Crossings in Drawings of Bipartite Graphs.",
            "A Workbench for Computational Geometry.",
            "Provably Good Pattern Generators for a Random Pattern Test.",
            "Finding the Closed Partition of a Planar Graph.",
            "An Improved Technique for Output-Sensitive Hidden Surface Removal.",
            "Designing Secure Communication Protocols from Trust Specification.",
            "A Provably Fast Linear-Expected-Time Maxima-Finding Algorithm.",
            "The k-Server Dual and Loose Competitiveness for Paging.",
            "Competitive Randomized Algorithms for Nonuniform Problems.",
            "A Deterministic O(k³)-Competitive k-Server Algorithm for the Circle.",
            "Point Placement Algorithms for Delaunay Triangulation of Polygonal Domains.",
            "An Optimal Algorithm for the On-Line Closest-Pair Problem.",
            "Efficient Ray Shooting and Hidden Surface Removal.",
            "Ray Shooting in Polygons Using Geodesic Triangulations.",
            "Guest Editor's Introduction: Special Issue on Large-Scale Memories.",
            "The Uniform Memory Hierarchy Model of Computation.",
            "Algorithms for Parallel Memory I: Two-Level Memories.",
            "Algorithms for Parallel Memory II: Hierarchical Multilevel Memories.",
            "Locality-Preserving Hash Functions for General Purpose Parallel Computation.",
            "Coding Techniques for Handling Failures in Large Disk Arrays.",
            "String Layouts for a Redundant Array of Inexpensive Disks.",
            "Checking the Correctness of Memories.",
            "Guest Editor's Foreword: Special Issue on String Algorithmics and Its Applications.",
            "Speeding Up Two String-Matching Algorithms.",
            "On Boyer-Moore Automata.",
            "Performance Analysis of Some Simple Heuristics for Computing Longest Common Subsequences.",
            "Parametric Optimization of Sequence Alignment.",
            "Sublinear Approximate String Matching and Biological Applications.",
            "A Sublinear Algorithm for Approximate Keyword Searching.",
            "Pattern Matching in a Digitized Image.",
            "Complexity Aspects of Guessing Prefix Codes.",
            "Rectilinear Steiner Tree Heuristics and Minimum Spanning Tree Algorithms Using Geographic Nearest Neighbors.",
            "Polynomial Algorithms for Linear Programming over the Algebraic Numbers.",
            "Heuristic Sampling on DAGs.",
            "Upward Drawings of Triconnected Digraphs.",
            "External Segment Trees.",
            "New Results for the Minimum Weight Triangulation Problem."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1993",
        "info": "1993: Volumes\n9,\n10",
        "count": 58,
        "papers": [
            "The Slab Dividing Approach To Solve the Euclidean P-Center Problem.",
            "A Parallel Algorithm for Approximating the Minimum Cycle Cover.",
            "Packet Routing on Grids of Processors.",
            "Parity Conditions in Homotopic Knock-Knee Routing.",
            "On Combined Phase 1-Phase 2 Projective Methods for Linear Programming.",
            "Maximum k-Covering of Weighted Transitive Graphs with Applications.",
            "Asymptotic Component Densities in Programmable Gate Arrays Realizing All Circuits of a Given Size.",
            "Constructing the Voronoi Diagram of a Set of Line Segments in Parallel.",
            "Duality of Constrained Voronoi Diagrams and Delaunay Triangulations.",
            "A Faster Parallel Algorithm for a Matrix Searching Problem.",
            "Fast Linear Expected-Time Algorithms for Computing Maxima and Convex Hulls.",
            "On Partial Updating in a Potential Reduction Linear Programming Algorithm of Kojima, Mizuno, and Yoshise.",
            "A Linear Algorithm for the All-Bidirectional-Edges Problem on Planar Graphs.",
            "Efficient Parallel Recognition of Some Circular Arc Graphs, I.",
            "Clocked Adversaries for Hashing.",
            "Packings in Two Dimensions: Asymptotic Average-Case Analysis of Algorithms.",
            "Seven Fingers Allow Force-Torque Closure Grasps on Any Convex Polyhedron.",
            "Single-Layer Cylindrical Compaction.",
            "Sieve Algorithms for Perfect Power Testing.",
            "A Semidynamic Construction of Higher-Order Voronoi Diagrams and Its Randomized Analysis.",
            "Optimal Parallel Algorithms for Multiple Updates of Minimum Spanning Trees.",
            "Tiling a Polygon with Parallelograms.",
            "The Searching over Separators Strategy To Solve Some NP-Hard Problems in Subexponential Time.",
            "Schedulers for Larger Classes of Pinwheel Instances.",
            "An 11/6-Approximation Algorithm for the Network Steiner Problem.",
            "Ray Shooting on Triangles in 3-Space.",
            "Selecting Distances in the Plane.",
            "An Addendum to Parallel Methods for Visibility and Shortest-Path Problems in Simple Polygons.",
            "Computing the Intersection-Depth of Polyhedra.",
            "Constructing Strongly Convex Approximate Hulls with Inaccurate Primitives.",
            "Weaving Patterns of Lines and Line Segments in Space.",
            "Algorithms for Projecting Points To Give the Most Uniform Distribution with Applications to Hashing.",
            "Finding Extrema with Unary Predicates.",
            "Fast Algorithms for the Dominating Set Problem on Permutation Graphs.",
            "Finding Least-Weight Subsequences with Fewer Processors.",
            "Sublinear Merging and Natural Mergesort.",
            "Splitting a Configuration in a Simplex.",
            "An Efficient Algorithm for Finding the CSG Representation of a Simple Polygon.",
            "Optimal Algorithms for Dissemination of Information in Some Interconnection Networks.",
            "Planning a Time-Minimal Motion Among Moving Obstacles.",
            "Extracting Maximal Information About Sets of Minimum Cuts.",
            "Special Issue on Computational Robotics: The Geometric Theory of Manipulation, Planning, and Control.",
            "An Opportunistic Global Path Planner.",
            "Nonholonomic Multibody Mobile Robots: Controllability and Motion Planning in the Presence of Obstacles.",
            "Continuous Alternation: The Complexity of Pursuit in Continuous Domains.",
            "Shortest Paths for Line Segments.",
            "Orienting Polygonal Parts Without Sensors.",
            "Mechanical Parts Orienting: The Case of a Polyhedron on a Table.",
            "Randomization for Robot Tasks: Using Dynamic Programming in the Space of Knowledge States.",
            "Issues in Computing Contact Forces for Non-Penetrating Rigid Bodies.",
            "Approximate String Matching with Suffix Automata.",
            "A Long-Step Barrier Method for Convex Quadratic Programming.",
            "A Lower Bound on the Period Length of a Distributed Scheduler.",
            "Geometric Knapsack Problems.",
            "Floorplanning by Graph Dualization: L-shaped Modules.",
            "Numerical Stability of a Convex Hull Algorithm for Simple Polygons.",
            "Analytic Variations on Quadtrees.",
            "On \"An Improved Algorithm for Finding the Median Distributively\"."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1992",
        "info": "1992: Volumes\n7,\n8",
        "count": 57,
        "papers": [
            "Editor's Foreword.",
            "Optimal Parallel Algorithms for Point-Set and Polygon Problems.",
            "Parallel Computational Geometry of Rectangles.",
            "Efficient Convexity and Domination Algorithms for Fine-and Medium-Grain Hypercube Computers.",
            "Data Reduction and Fast Routing: A Strategy for Efficient Algorithms for Message-Passing Parallel Computers.",
            "Optimal Randomized Parallel Algorithms for Computational Geometry.",
            "Foreword.",
            "A Proof of the Gilbert-Pollak Conjecture on the Steiner Ratio.",
            "How To Find Steiner Minimal Trees in Euclidean d-Space.",
            "On Steiner Minimal Trees with L_p Distance.",
            "Graham's Problem on Shortest Networks for Points on a Circle.",
            "Improved Computation of Plane Steiner Minimal Trees.",
            "Steiner Minimal Trees for a Class of Zigzag Lines.",
            "A Linear-Time Algorithm To Construct a Rectilinear Steiner Minimal Tree for k-Extremal Point Sets.",
            "The Rectilinear Steiner Arborescence Problem.",
            "Two New Criteria for Finding Steiner Hulls in Steiner Tree Problems.",
            "A Note on Bounding k-Terminal Reliability.",
            "Path-Distance Heuristics for the Steiner Problem in Undirected Networks.",
            "Steiner Tree Problems.",
            "Problems with Generalized Steiner Problems.",
            "Parallel Computation of Distance Transforms - Erratum.",
            "A Paradigm for Robust Geometric Algorithms.",
            "Randomized Incremental Construction of Delaunay and Voronoi Diagrams.",
            "Three Priority Queue Applications Revisited.",
            "Editor's Foreword Special Issue on Graph Algorithms.",
            "Maintaining Bridge-Connected and Biconnected Components On-Line.",
            "Forests, Frames, and Games: Algorithms for Matroid Sums and Applications.",
            "A Fast Algorithm for the Generalized Parametric Minimum Cut Problem and Applications.",
            "A Linear-Time Algorithm for Finding an Ambitus.",
            "Automatic Generation of Linear-Time Algorithms from Predicate Calculus Descriptions of Problems on Recursively Constructed Graph Families.",
            "A Linear-Time Algorithm for Finding a Sparse k-Connected Spanning Subgraph of a k-Connected Graph.",
            "Expected Parallel Time and Sequential Space Complexity of Graph and Digraph Problems.",
            "Efficient Parallel Algorithms for Path Problems in Directed Graphs.",
            "Finding Effective \"Force Targets\" for Two-Dimensional Multifinger Frictional Grips.",
            "Optimal Routing Algorithms for Mesh-Connected Processor Arrays.",
            "Linear-Time Border-Tracing Algorithms for Quadtrees.",
            "L_1 Shortest Paths Among Polygonal Obstacles in the Plane.",
            "Path-Matching Problems.",
            "A Bounded Approximation for the Minimum Cost 2-Sat Problem.",
            "Line-Segment Intersection Reporting in Parallel.",
            "Polynomial-Time Primal Simplex Algorithms for the Minimum Cost Network Flow Problem.",
            "A Geometric View of Parametric Linear Programming.",
            "Solving the Euclidean Bottleneck Matching Problem by k-Relative Neighborhood Graphs.",
            "An Efficient Algorithm for One-Step Planar Compliant Motion Planning with Uncertainty.",
            "On the Parallel-Decomposability of Geometric Problems.",
            "Maximum Concurrent Flows and Minimum Cuts.",
            "There Are Planar Graphs Almost as Good as the Complete Graphs and Almost as Cheap as Minimum Spanning Trees.",
            "Output-Sensitive Generation of the Perspective View of Isothetic Parallelepipeds.",
            "Optimal Parallel Detection of Squares in Strings.",
            "Probing a Scene of Nonconvex Polyhedra.",
            "Editor's Foreword: Special Issue on the Sixth Annual Symposium on Computational Geometry.",
            "Constructing Strongly Convex Hulls Using Exact or Rounded Arithmetic.",
            "Simultaneous Inner and Outer Approximation of Shapes.",
            "Approximate Motion Planning and the Complexity of the Boundary of the Union of Simple Geometric Figures.",
            "Quasi-Optimal Upper Bounds for Simplex Range Searching and New Zone Theorems.",
            "Minimum-Link Paths Among Obstacles in the Plan.",
            "Parallel Methods for Visibility and Shortest-Path Problems in Simple Polygons."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1991",
        "info": "1991: Volume\n6",
        "count": 47,
        "papers": [
            "Editors' Introduction.",
            "Retiming Synchronous Circuitry.",
            "Partitioning Circuits for Improved Testability.",
            "Optimal Tradeoffs for Addition on Systolic Arrays.",
            "Multiterminal Global Routing: A Deterministic Approximation Scheme.",
            "Optimal Multilayer Channel Routing with Overlap.",
            "A Generic Algorithm for One-Dimensional Homotopic Compaction.",
            "Multilayer Grid Embeddings for VLSI.",
            "Search Directions for Interior Linear-Programming Methods.",
            "Moving a Disc Between Polygons.",
            "Probabilistic Analysis of a Grouping Algorithm.",
            "An O(n log n) Plane-Sweep Algorithm for L_1 and L_\\infty Delaunay Triangulations.",
            "FFD Bin Packing for Item Sizes with Uniform Distributions on [0, 1/2].",
            "A Lower Bound on the Area of Permutation Layouts.",
            "On the Height of Digital Trees and Related Problems.",
            "Stochastic Rearrangement Rules for Self-Organizing Data Structures.",
            "An Optimal Algorithm for the Boundary of a Cell in a Union of Rays-Corrigendum.",
            "Editor's Foreword.",
            "A Theoretical Framework for Simulated Annealing.",
            "Analysis of Finite Length Annealing Schedules.",
            "Efficient Simulated Annealing on Fractal Energy Landscapes.",
            "Simulated Annealing Type Algorithms for Multivariate Optimization.",
            "Boltzmann Machines as a Model for Parallel Annealing.",
            "Stochastic Neural Networks.",
            "Large Parallel Machines Can Be Extremely Slow for Small Problems.",
            "Order-k Voronoi Diagrams of Sites with Additive Weights in the Plane.",
            "On Sorting Triangles in a Delaunay Tessellation.",
            "Convex Hulls of Objects Bounded by Algebraic Curves.",
            "Parallel Sorting on Cayley Graphs.",
            "Optimal Algorithms for Adjacent Side Routing.",
            "Refinements to Nearest-Neighbor Searching in k-Dimensional Trees.",
            "A Flexible Way of Counting Large Numbers Approximately in Small Registers.",
            "Maximum Queue Size and Hashing with Lazy Deletion.",
            "Editor's Foreword Special Issue on Parallel Algorithms for Geometric Problems on Digitzed Pictures.",
            "Finding a Minimal Cover for Binary Images: An Optimal Parallel Algorithm.",
            "Computing Convexity Properties of Images on a Pyramid Computer.",
            "Parallel Computation of Disease Transforms.",
            "Processor-Time Optimal Parallel Algorithms for Digitized Images on Mesh-Connected Processor Arrays.",
            "Computational Geometry Algorithms for the Systolic Screen.",
            "Topological Numbering of Features on a Mesh.",
            "On Partitioning Rectilinear Polygons into Star-Shaped Polygons.",
            "An Efficient Parallel Algorithm for Computing a Large Independent Set in Planar Graph.",
            "A Strongly Competitive Randomized Paging Algorithm.",
            "Chain Packing in Graphs.",
            "Divided k-d Trees.",
            "Deterministic Parallel List Ranking.",
            "Heuristics for Rapidly Four-Coloring Large Planar Graphs."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1990",
        "info": "1990: Volume\n5",
        "count": 33,
        "papers": [
            "An Improved Parallel Algorithm for Integer GCD.",
            "Approximation Algorithms for Partitioning a Rectangle with Interior Points.",
            "Efficient Parallel Algorithms for Graph Problems.",
            "A New Algorithm for the Largest Empty Rectangle Problem.",
            "Improved Sorting Networks with O(log N) Depth.",
            "On the Complexity of Embedding Planar Graphs To Minimize Certain Distance Measures.",
            "On Heuristics for Minimum Length Rectilinear Partitions.",
            "Efficient Parallel Algorithms for r-Dominating Set and p-Center Problems on Trees.",
            "An Algorithm for Constructing Gröbner Bases from Characteristic Sets and Its Application to Geometry.",
            "Parallel Geometric Algorithms on a Mesh-Connected Computer.",
            "Solving Some Combinatorial Problems on Arrays with One-Way Dataflow.",
            "A Fast Algorithm for Computing Sparse Visibility Graphs.",
            "Dynamic Fractional Cascading.",
            "An Optimal Time Bound for Oblivious Routing.",
            "Internal and External Algorithms for the Points-in-Regions Problem-the INSIDE Join of Geo-Relational Algebra.",
            "Dynamic Detection of Subgraphs in Computer Networks.",
            "Analysis of the Standard Deletion Algorithms in Exact Fit Domain Binary Search Trees.",
            "A Linear-Time Algorithm for Finding Approximate Shortest Common Superstrings.",
            "Asynchronous Distributed Termination-Parallel and Symmetric Solutions with Echo Algorithms.",
            "An Optimal Approximation Algorithm for the Rectilinear m-Center Problem.",
            "The Complexity of Planar Compliant Motion Planning Under Uncertainty.",
            "An Efficient Distributed Algorithm for Maximum Matching in General Graphs.",
            "Computing Euclidean Maximum Spanning Trees.",
            "Computational Geometry in a Curved World.",
            "A Better Performance Guarantee for Approximate Graph Coloring.",
            "A Theory of Rectangular Dual Graphs.",
            "Some Chain Visibility Problems in a Simple Polygon.",
            "Dynamic Maintenance of Planar Digraphs, with Applications.",
            "A New Scheme for the Deterministic Simulation of PRAMs in VLSI.",
            "Efficient Parallel and Sequential Algorithms for 4-Coloring Perfect Planar Graphs.",
            "Searching for Empty Convex Polygons.",
            "An Optimal Algorithm for the Boundary of a Cell in a Union of Rays.",
            "Comments on Bern's Probabilistic Results on Rectilinear Steiner Trees."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1989",
        "info": "1989: Volume\n4",
        "count": 36,
        "papers": [
            "Editor's Foreword: Special Issue on Computational Geometry.",
            "Primitives for the Manipulation of Three-Dimensional Subdivisions.",
            "Discrete Simulation of NC Machining.",
            "A Bucketing Algorithm for the Orthogonal Segment Intersection Search Problem and Its Practical Efficiency.",
            "A Linear-Time Algorithm for Linear L_1 Approximation of Points.",
            "Constrained Delaunay Triangulations.",
            "On the Geodesic Voronoi Diagram of Point Sites in a Simple Polygon.",
            "An Optimal Visibility Graph Algorithm for Triangulated Simple Polygons.",
            "Generation of Configuration Space Obstacles: The Case of Moving Algebraic Curves.",
            "On the Efficiency of Maximum-Flow Algorithms on Networks with Small Integer Capacities.",
            "Fast Heuristic Algorithms for Rectilinear Steiner Trees.",
            "A New Algorithm for Scheduling Periodic Real-Time Tasks.",
            "An Efficient Algorithm for Maxdominance, with Applications.",
            "On the Algebraic Formulation of Certain Geometry Statements and Mechanical Geometry Theorem Proving.",
            "Floorplan Design of VLSI Circuits.",
            "On Selecting the k Largest with Median Tests.",
            "Editor's Foreword: Special Issue on Algorithmic Aspects of Communications.",
            "Computational Complexity of Optimum Multiuser Detection.",
            "A Full Sensing Window Random-Access Algorithm for Messages with Strict Delay Constraints.",
            "A Correction Algorithm for Token-Passing Sequences in Mobile Communication Networks.",
            "Maximal Selection in Tandem Networks with Symmetric Hearing Range.",
            "Scheduling Multihop CDMA Networks in the Presence of Secondary Conflicts.",
            "Optimizing Responses to Broadcast Messages in Radio Networks.",
            "Distributed Deadlock Resolution in Store-and-Forward Networks.",
            "Efficient Elections in Chordal Ring Networks.",
            "Lower Bounds for Maximal and Convex Layers Problems.",
            "An Algorithm for Geometric Minimum Spanning Trees Requiring Nearly Linear Expected Time.",
            "Algorithms for Multicommodity Flows in Planar Graphs.",
            "The Set-Set LCS Problem.",
            "Extending NC and RNC Algorithms.",
            "Average-Case Analysis of the Modified Harmonic Algorithm.",
            "A Dynamic Fixed Windowing Problem.",
            "A Bidirectional Shortest-Path Algorithm with Good Average-Case Behavior.",
            "Approximate Minimum Weight Matching on Points in k-Dimensional Space.",
            "A Preliminary Study of a Diagonal Channel-Routing Model.",
            "Problems in Geometric Probing."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1988",
        "info": "1988: Volume\n3",
        "count": 26,
        "papers": [
            "Editor's Foreword: Special Issue on Parallel and Distributed Computing, Part I.",
            "Parallel Complexity of Logical Query Programs.",
            "Simulations Among Concurrent-Write PRAMs.",
            "Communication-Efficient Parallel Algorithms for Distributed Random-Access Machines.",
            "Competitive Snoopy Caching.",
            "Programming Simultaneous Actions Using Common Knowledge.",
            "Designing Networks with Compact Routing Tables.",
            "Two Probabilistic Results on Rectilinear Steiner Trees.",
            "An Algorithm for Segment-Dragging and Its Implementation.",
            "Data Transfers in Networks.",
            "A Linear Algorithm to Find a Rectangular Dual of a Planar Triangulated Graph.",
            "Parallel Triangulation of a Polygon in Two Cails to the Trapezoidal Map.",
            "Editor's Foreword: Special Issue on Parallel and Distributed Computing, Part II.",
            "Parallel Computational Geometry.",
            "The Accelerated Centroid Decomposition Technique for Optimal Parallel Tree Evaluation in Logarithmic Time.",
            "Parallel Construction of a Suffix Tree with Applications.",
            "Distributed Match-Making.",
            "A Technique for Constructing Highly Available Services.",
            "On the Analysis of Cooperation and Antagonism in Networks of Communicating Processes.",
            "The Synthesis of Communication Protocols.",
            "Decomposition and Intersection of Simple Splinegons.",
            "Optimal VLSI Graph Embeddings in Variable Aspect Ratio Rectangles.",
            "The General Maximum Matching Algorithm of Micali and Vazirani.",
            "Parallel Algorithms for Some Functions of two Convex Polygons.",
            "On Finding Optimal and Near-Optimal Lineal Spanning Trees.",
            "Sorting in Constant Number of Row and Column Phases on a Mesh."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1987",
        "info": "1987: Volume\n2",
        "count": 27,
        "papers": [
            "A Cautious Scheduler for Multistep Transactions.",
            "Generalized Voronoi Diagrams for a Ladder: II. Efficient Construction of the Diagram.",
            "Algorithms for Corner Stitched Data-Structures.",
            "A Linear Time Randomizing Algorithm for Searching Ranked Functions.",
            "The Set LCS Problem.",
            "On Problem Transformability in VLSI.",
            "Global Wire Routing in Two-Dimensional Arrays.",
            "Some Problems in Computational Geometry.",
            "Editor's Foreword.",
            "A Faster Divide-and-Conquer Algorithm for Constructing Delaunay Triangulations.",
            "A Sweepline Algorithm for Voronoi Diagrams.",
            "On Approximation Behavior of the Greedy Triangulation for Convex Polygons.",
            "Geometric Applications of a Matrix-Searching Algorithm.",
            "Linear-Time Algorithms for Visibility and Shortest Path Problems Inside Triangulated Simple Polygons.",
            "An Improved Algorithm for Finding the Median Distributively.",
            "A Minimum-Area Circuit for l-Selection.",
            "Minimizing Channel Density in Standard Cell Layout.",
            "Algorithms for the Compilation of Regular Expressions into PLAs.",
            "The Longest Common Subsequence Problem Revisited.",
            "Computing on a Free Tree via Complexity-Preserving Mappings.",
            "Preface Special Issue on Robotics.",
            "A New Efficient Motion-Planning Algorithm for a Rod in Two-Dimensional Polygonal Space.",
            "Path-Planning Strategies for a Point Mobile Automaton Moving Amidst Unknown Obstacles of Arbitrary Shape.",
            "Motion Planning with Inertial Constraints.",
            "On Multiple Moving Objects.",
            "Optimal Piecewise Linear Motion of an Object Among Obstacles.",
            "On the Existence and Synthesis of Multifinger Positive Grips."
        ]
    },
    {
        "name": "Algorithmica",
        "year": "1986",
        "info": "1986: Volume\n1",
        "count": 29,
        "papers": [
            "Discrete Logarithms in GF(p).",
            "The Complexity of Hashing with Lazy Deletion.",
            "Shortest Paths in Euclidean Graphs.",
            "Visibility of Disjoint Polygons.",
            "Area-Time Lower-Bound Techniques with Applications to Sorting.",
            "Edge-Skeletons in Arrangements with Applications.",
            "The Pairing Heap: A New Form of Self-Adjusting Heap.",
            "Fractional Cascading: I. A Data Structuring Technique.",
            "Fractional Cascading: II. Applications.",
            "Complexity of Some Laction Problems.",
            "Channel Routing in Knock-Knee Mode: Simplified Algorithms and Proofs.",
            "Two-Layer Channel Routing with Vertical Uni-Length Overlap.",
            "Optimal Book Embeddings of the FFT, Benes, and Barrel Shifter Networks.",
            "An O(ND) Difference Algorithm and Its Variations.",
            "On-the-Fly, Incremental, Consistent Reading of Entire Databases.",
            "Bit Transposition for Very Large Scientific and Statistical Databases.",
            "An Evaluation of Buffer Management Strategies for Relational Database Systems.",
            "Understanding the Implications of View Update Policies.",
            "A Time Bound on the Materialization of Some Recursively Defined Views.",
            "Introduction: New Approaches to Linear Programming.",
            "A Modification of Karmarkar's Linear Programming Algorithm.",
            "An Extension of Karmarkar's Algorithm for Linear Programming Using Dual Variables.",
            "A Polynomial Newton Method for Linear Programming.",
            "A Multiplicative Barrier Function Method for Linear Programming.",
            "A Monotonic Projective Algorithm for Fractional Linear Programming.",
            "Determining Basic Variables of Optimal Solutions in Karmarkar's New LP Algorithm.",
            "A Projective Method for Linear Programming with Box-Type Constraints.",
            "Homotopy Techniques in Linear Programming.",
            "The Iterative Step in the Linear Programming Algorithm of N. Karmarkar."
        ]
    }
]