[
    {
        "name": "APAL",
        "year": "2022",
        "info": "2022: Volume 173",
        "count": 35,
        "papers": [
            "Infinite lexicographic products.",
            "Extension of C∞ functions in polynomially bounded o-minimal structure.",
            "The Vietoris functor and modal operators on rings of continuous functions.",
            "Adequate predimension inequalities in differential fields.",
            "Higher dimensional cardinal characteristics for sets of functions.",
            "Indifference to symmetry in Hrushovski's ab initio construction.",
            "The fluted fragment with transitive relations.",
            "Small cardinals and small Efimov spaces.",
            "Corrigendum to \"On stably pointed varieties and generically stable groups in ACVF\" [Ann. Pure Appl. Log. 170(2) (2019) 180-217].",
            "The isomorphism relation of theories with S-DOP in the generalised Baire spaces.",
            "On the ideal J[κ].",
            "Reinhardt cardinals and iterates of V.",
            "Infinitary action logic with exponentiation.",
            "Independence over arbitrary sets in NSOP1 theories.",
            "On Farkas' lemma and related propositions in BISH.",
            "Taming Koepke's Zoo II: Register machines.",
            "On bi-embeddable categoricity of algebraic structures.",
            "Expansions of the group of integers by Beatty sequences.",
            "Quantifier-free epistemic term-modal logic with assignment operator.",
            "Model theory of adeles I.",
            "Ideal topologies in higher descriptive set theory.",
            "Finitary unification in locally tabular modal logics characterized.",
            "Reflection principles and second-order choice principles with urelements.",
            "Complexity in Young's lattice.",
            "On existential definitions of c.e. subsets of rings of functions of characteristic 0.",
            "Definably topological dynamics of p-adic algebraic groups.",
            "On the definability of mad families of vector spaces.",
            "The number of axioms.",
            "Constructive Ackermann's interpretation.",
            "On Guaspari's problem about partially conservative sentences.",
            "The computational complexity of module socles.",
            "The fixed-point property for represented spaces.",
            "From axioms to synthetic inference rules via focusing.",
            "Reflection algebras and conservation results for theories of iterated truth.",
            "Complexity in the interdefinability of timelike, lightlike and spacelike relatedness of Minkowski spacetime."
        ]
    },
    {
        "name": "APAL",
        "year": "2021",
        "info": "2021: Volume 172",
        "count": 91,
        "papers": [
            "The tree property at double successors of singular cardinals of uncountable cofinality with infinite gaps.",
            "Finitely generated groups are universal among finitely generated structures.",
            "Filter-linkedness and its effect on preservation of cardinal characteristics.",
            "|˜-divisibility of ultrafilters.",
            "Open core and small groups in dense pairs of topological structures.",
            "Complexity of syntactical tree fragments of Independence-Friendly logic.",
            "Ax-Schanuel and strong minimality for the j-function.",
            "Computable analogs of cardinal characteristics: Prediction and rearrangement.",
            "Tukey order, calibres and the rationals.",
            "Probabilistic characterisation of models of first-order theories.",
            "Preservation theorems for Namba forcing.",
            "Towards the entropy-limit conjecture.",
            "When Pκ(λ) (vaguely) resembles κ.",
            "Algebraic combinatorics in bounded induction.",
            "On the number of independent orders.",
            "Stationary and closed rainbow subsets.",
            "First-order model theory of free projective planes.",
            "Small models, large cardinals, and induced ideals.",
            "Derivatives of normal functions in reverse mathematics.",
            "The canonical pairs of bounded depth Frege systems.",
            "Computable irrational numbers with representations of surprising complexity.",
            "Ramsey transfer to semi-retractions.",
            "Unbounded towers and products.",
            "More on HOD-supercompactness.",
            "Intuitionistic fixed point logic.",
            "Completion of choice.",
            "A topological zero-one law and elementary equivalence of finitely generated groups.",
            "Lindström theorems in graded model theory.",
            "Superstability, noetherian rings and pure-semisimple rings.",
            "Preserving levels of projective determinacy by tree forcings.",
            "Sets in Prikry and Magidor generic extensions.",
            "On the structure of certain valued fields.",
            "Continuous extension of maps between sequential cascades.",
            "The full basis theorem does not imply analytic wellordering.",
            "Typical forcings, NP search problems and an extension of a theorem of Riis.",
            "Quantum set theory: Transfer Principle and De Morgan's Laws.",
            "Long games and σ-projective sets.",
            "A parametrised functional interpretation of Heyting arithmetic.",
            "A short note on groups in separably closed valued fields.",
            "Introduction.",
            "A microscopic approach to Souslin-tree construction, Part II.",
            "Indestructibility of ideals and MAD families.",
            "An Efimov space with character less than s.",
            "Two applications of topology to model theory.",
            "Corson reflections.",
            "Definable MAD families and forcing axioms.",
            "Convergent sequences in topological groups.",
            "Separating families and order dimension of Turing degrees.",
            "Some remarks on the Open Coloring Axiom.",
            "The Borel complexity of von Neumann equivalence.",
            "Local collection and end-extensions of models of compositional truth.",
            "Determinacy from strong compactness of ω1.",
            "The differential of probabilistic entailment.",
            "Non-forking and preservation of NIP and dp-rank.",
            "Dp-finite fields I(A): The infinitesimals.",
            "Dp-finite fields I(B): Positive characteristic.",
            "The Hart-Shelah example, in stronger logics.",
            "Infinitesimal analysis without the Axiom of Choice.",
            "Finiteness classes arising from Ramsey-theoretic statements in set theory without choice.",
            "Forcing a □(κ)-like principle to hold at a weakly compact cardinal.",
            "Computational complexity for bounded distributive lattices with negation.",
            "On the relationship between mutual and tight stationarity.",
            "Extending Hrushovski's groupoid-cover correspondence using simplicial groupoids.",
            "Simple-like independence relations in abstract elementary classes.",
            "Proof complexity of substructural logics.",
            "Easton's theorem for the tree property below ℵω.",
            "Denseness results in the theory of algebraic fields.",
            "Fundamental group in o-minimal structures with definable Skolem functions.",
            "On the structure of Borel ideals in-between the ideals ED and Fin ⊗ Fin in the Katětov order.",
            "Parametrized Ramsey theory of infinite block sequences of vectors.",
            "Universal graphs and functions on ω1.",
            "Punctual definability on structures.",
            "Cardinality of wellordered disjoint unions of quotients of smooth equivalence relations.",
            "Banach-Stone-like results for combinatorial Banach spaces.",
            "Beth definability and the Stone-Weierstrass Theorem.",
            "Non-density in punctual computability.",
            "Criteria for exact saturation and singular compactness.",
            "Continuous L-domains in logical form.",
            "Mathias like criterion for the extender based Prikry forcing.",
            "Pure Σ2-elementarity beyond the core.",
            "Topological dynamics and NIP fields.",
            "Hilbert-style axiomatization of first-degree entailment and a family of its extensions.",
            "An approach to stochastic processes via non-classical logic.",
            "Strongly compact cardinals and the continuum function.",
            "A characterization of Σ11-reflecting ordinals.",
            "Logics of intuitionistic Kripke-Platek set theory.",
            "Linearly ordered sets with only one operator have the amalgamation property.",
            "Games with finitely generated structures.",
            "A consistency result on long cardinal sequences.",
            "A coinductive approach to proof search through typed lambda-calculi.",
            "Weaker cousins of Ramsey's theorem over a weak base theory."
        ]
    },
    {
        "name": "APAL",
        "year": "2020",
        "info": "2020: Volume 171",
        "count": 50,
        "papers": [
            "Lyndon interpolation theorem of instantial neighborhood logic - constructively via a sequent calculus.",
            "Resolution over linear equations modulo two.",
            "Algebraic description of limit models in classes of abelian groups.",
            "Feasibly constructive proofs of succinct weak circuit lower bounds.",
            "Remarks on generic stability in independent theories.",
            "Determinate logic and the Axiom of Choice.",
            "Uniformly locally o-minimal structures and locally o-minimal structures admitting local definable cell decomposition.",
            "Functional representation of finitely generated free algebras in subvarieties of BL-algebras.",
            "Elementary inductive dichotomy: Separation of open and clopen determinacies with infinite alternatives.",
            "Stationarily ordered types and the number of countable models.",
            "Completeness theorems for σ-additive probabilistic semantics.",
            "Ordered asymptotic classes of finite structures.",
            "On subrecursive complexity of integration.",
            "The tree property at first and double successors of singular cardinals with an arbitrary gap.",
            "Non-finitely axiomatisable modal product logics with infinite canonical axiomatisations.",
            "Short extenders forcings - doing without preparations.",
            "Pincherle's theorem in reverse mathematics and computability theory.",
            "Embeddings between well-orderings: Computability-theoretic reductions.",
            "Bilattice logic of epistemic actions and knowledge.",
            "Characterizations of the weakly compact ideal on Pκλ.",
            "Herbrand's theorem as higher order recursion.",
            "Univalent polymorphism.",
            "Some lower bounds on Shelah rank in the free group.",
            "Definable groups in models of Presburger Arithmetic.",
            "Turing reducibility in the fine hierarchy.",
            "Expander construction in VNC1.",
            "M-separable spaces of functions are productive in the Miller model.",
            "The density zero ideal and the splitting number.",
            "Expansions of real closed fields that introduce no new smooth functions.",
            "On expansions of (Z, +, 0).",
            "A classification of the cofinal structures of precompacta.",
            "The theory of ceers computes true arithmetic.",
            "A forcing axiom for a non-special Aronszajn tree.",
            "Some constructions of ultrafilters over a measurable cardinal.",
            "Computability of pseudo-cubes.",
            "Algebraically closed structures in positive logic.",
            "Epimorphism surjectivity in varieties of Heyting algebras.",
            "Silver type theorems for collapses.",
            "A premouse inheriting strong cardinals from V.",
            "Perfect tree forcings for singular cardinals.",
            "The FAN principle and weak König's lemma in herbrandized second-order arithmetic.",
            "Proofs and surfaces.",
            "Diagonal supercompact Radin forcing.",
            "Rules with parameters in modal logic II.",
            "Modal extension of ideal paraconsistent four-valued logic and its subsystem.",
            "Ultrafilters, finite coproducts and locally connected classifying toposes.",
            "Polish metric spaces with fixed distance set.",
            "Join-completions of partially ordered algebras.",
            "Structure and representation of semimodules over inclines.",
            "On equivalence relations generated by Cauchy sequences in countable metric spaces."
        ]
    },
    {
        "name": "APAL",
        "year": "2019",
        "info": "2019: Volume 170",
        "count": 60,
        "papers": [
            "The Nikodym property and cardinal characteristics of the continuum.",
            "On the classification of first order Gödel logics.",
            "Finite computable dimension and degrees of categoricity.",
            "Hod up to ADR+Θ is measurable.",
            "On eigenvectors, approximations and the Feynman propagator.",
            "Infinitary first-order categorical logic.",
            "On arithmetical completeness of the logic of proofs.",
            "On Stably Pointed Varieties and Generically Stable Groups in ACVF.",
            "Reasoning about proof and knowledge.",
            "Small embedding characterizations for large cardinals.",
            "Reverse Mathematics and parameter-free Transfer.",
            "The approachability ideal without a maximal set.",
            "Acyclicity and reduction.",
            "A note on non-classical nonstandard arithmetic.",
            "A characterization of those categories whose internal logic is Hilbert's ε-calculus.",
            "Comparing material and structural set theories.",
            "Existential monadic second order logic of undirected graphs: The Le Bars conjecture is false.",
            "Isolated maximal d.r.e. degrees.",
            "On the existence of skinny stationary subsets.",
            "On modal logics arising from scattered locally compact Hausdorff spaces.",
            "Completeness for μ-calculi: A coalgebraic approach.",
            "A new look at interpretability and saturation.",
            "Model-completions for Abelian lattice-ordered groups with finitely many disjoint elements.",
            "Computability-theoretic categoricity and Scott families.",
            "Provability logic and the completeness principle.",
            "Model theoretic dynamics in Galois fashion.",
            "On the complexity of the Leibniz hierarchy.",
            "Uniform interpolation and coherence.",
            "Geometric stability theory for μ-structures.",
            "Equivalence of bar induction and bar recursion for continuous functions with continuous moduli.",
            "Representing definable functions of HAω by neighbourhood functions.",
            "Vaught's conjecture for monomorphic theories.",
            "23rd Workshop on Logic, Language, Information and Computation - WoLLIC 2016.",
            "Algorithmic correspondence and canonicity for non-distributive logics.",
            "A logical approach to context-specific independence.",
            "Descriptive complexity of graph spectra.",
            "A model-theoretic characterization of constant-depth arithmetic circuits.",
            "A logician's view of graph polynomials.",
            "The expressive power of k-ary exclusion logic.",
            "Characterising modal definability of team-based logics via the universal modality.",
            "Negation and partial axiomatizations of dependence and independence logic revisited.",
            "Fixed point theorems for precomplete numberings.",
            "When is scalar multiplication decidable?",
            "On transformations of constant depth propositional proofs.",
            "Categories of models of R-mingle.",
            "Categorical linearly ordered structures.",
            "Equivalents of the finitary non-deterministic inductive definitions.",
            "Introducing article numbering to Annals of Pure and Applied Logic.",
            "Non decomposable connectives of linear logic.",
            "The strength of compactness in Computability Theory and Nonstandard Analysis.",
            "Uniform interpolation and the existence of sequent calculi.",
            "Categoricity in multiuniversal classes.",
            "The semi-weak square principle.",
            "A strict implication calculus for compact Hausdorff spaces.",
            "Corrigendum to \"Model-completions for Abelian lattice-ordered groups with finitely many disjoint elements\" [Ann. Pure Appl. Logic 170 (2019) 673-698].",
            "Categories with families and first-order logic with dependent sorts.",
            "Reductions between types of numberings.",
            "Schmerl decompositions in first order arithmetic.",
            "Supersimple ω-categorical theories and pregeometries.",
            "Decidability of the theory of modules over Prüfer domains with dense value groups."
        ]
    },
    {
        "name": "APAL",
        "year": "2018",
        "info": "2018: Volume 169",
        "count": 56,
        "papers": [
            "A computational glimpse at the Leibniz and Frege hierarchies.",
            "Direct twisted Galois stratification.",
            "Pure patterns of order 2.",
            "Determinacy of refinements to the difference hierarchy of co-analytic sets.",
            "Beyond abstract elementary classes: On the model theory of geometric lattices.",
            "Wild theories with o-minimal open core.",
            "The tree property at double successors of singular cardinals of uncountable cofinality.",
            "Capturing k-ary existential second order logic with k-ary inclusion-exclusion logic.",
            "An analysis of the logic of Riesz spaces with strong unit.",
            "No finite axiomatizations for posets embeddable into distributive lattices.",
            "Jumps of computably enumerable equivalence relations.",
            "Martin-Löf random generalized Poisson processes.",
            "Topology and measure in logics for region-based theories of space.",
            "Recognizable sets and Woodin cardinals: computation beyond the constructible universe.",
            "The omega-rule interpretation of transfinite provability logic.",
            "Tarski's theorem on intuitionistic logic, for polyhedra.",
            "Intuitionistic nonstandard bounded modified realisability and functional interpretation.",
            "Corrigendum to \"Advice classes of parameterized tractability\" [Ann. Pure Appl. Logic 84 (1) (1997) 119-138].",
            "The Kierstead's Conjecture and limitwise monotonic functions.",
            "Elementary equivalence of rings with finitely generated additive groups.",
            "The tree property at the double successor of a singular cardinal with a larger gap.",
            "Abstract elementary classes stable in ℵ0.",
            "New-from-old full dualities via axiomatisation.",
            "Ehrenfeucht-Fraïssé games on ordinals.",
            "From realizability to induction via dependent intersection.",
            "A multiplication operation for the hierarchy of norms.",
            "Elementary equivalences and accessible functors.",
            "Functoriality and uniformity in Hrushovski's groupoid-cover correspondence.",
            "Modularity results for interpolation, amalgamation and superamalgamation.",
            "Generic expansion and Skolemization in NSOP1 theories.",
            "Characterizations of pretameness and the Ord-cc.",
            "Splitting into degrees with low computational strength.",
            "On the class of flat stable theories.",
            "Definable E0 classes at arbitrary projective levels.",
            "Henselianity in the language of rings.",
            "First order theory of cyclically ordered groups.",
            "Axiomatizations of team logics.",
            "On constructivity and the Rosser property: a closer look at some Gödelean proofs.",
            "Logic for abstract hoop twist-structures.",
            "The Σ1-provability logic of HA.",
            "Club isomorphisms on higher Aronszajn trees.",
            "The Dyck and the Preiss separation uniformly.",
            "A representation theorem for measurable relation algebras.",
            "Vaught's conjecture for weakly o-minimal theories of convexity rank 1.",
            "Algorithmically random series and Brownian motion.",
            "First order logic without equality on relativized semantics.",
            "Preface.",
            "Cut-elimination for ω1.",
            "A cubical model of homotopy type theory.",
            "A canonical hidden-variable space.",
            "Atomic polymorphism and the existence property.",
            "Virtual large cardinals.",
            "Binary simple homogeneous structures.",
            "Multicomponent proof-theoretic method for proving interpolation properties.",
            "Logical form, mathematical practice, and Frege's Begriffsschrift.",
            "What we talk about when we talk about numbers."
        ]
    },
    {
        "name": "APAL",
        "year": "2017",
        "info": "2017: Volume 168",
        "count": 79,
        "papers": [
            "Products of Menger spaces: A combinatorial approach.",
            "A classification of orbits admitting a unique invariant measure.",
            "Cardinal characteristics at κ in a small u(κ) model.",
            "Bounded stationary reflection II.",
            "Labeled sequent calculus for justification logics.",
            "Effective results on a fixed point algorithm for families of nonlinear mappings.",
            "Vaught's conjecture for quite o-minimal theories.",
            "Proof complexity of intuitionistic implicational formulas.",
            "Pseudo real closed fields, pseudo p-adically closed fields and NTP2.",
            "Foreword for special issue of APAL for GaLoP 2013.",
            "Game semantics for non-monotonic intensional logic programming.",
            "Realizability for Peano arithmetic with winning conditions in HON games.",
            "Interaction graphs: Graphings.",
            "A micrological study of negation.",
            "Reasoning about equilibria in game-like concurrent systems.",
            "Semantics of higher-order quantum computation via geometry of interaction.",
            "Combining control effects and their models: Game semantics for a hierarchy of static, dynamic and delimited control effects.",
            "Representation and duality of the untyped λ-calculus in nominal lattice and topological semantics, with a proof of topological completeness.",
            "Distance structures for generalized metric spaces.",
            "Downward categoricity from a successor inside a good frame.",
            "Algebraic proof theory: Hypersequents and hypercompletions.",
            "A uniform version of non-low2-ness.",
            "Polish G-spaces and continuous logic.",
            "On non-self-referential fragments of modal logics.",
            "Covering the recursive sets.",
            "Ordinals and graph decompositions.",
            "Computable neighbourhoods of points in semicomputable manifolds.",
            "Randomness for computable measures and initial segment complexity.",
            "Bar recursion over finite partial functions.",
            "Mitchell's theorem revisited.",
            "Honest elementary degrees and degrees of relative provability without the cupping property.",
            "Spatial logic of tangled closure operators and modal mu-calculus.",
            "Characterizing model-theoretic dividing lines via collapse of generalized indiscernibles.",
            "Characterizing large cardinals in terms of layered posets.",
            "Germinal theories in Łukasiewicz logic.",
            "The uniform content of partial and linear orders.",
            "Dominating the Erdős-Moser theorem in reverse mathematics.",
            "Condensational equivalence, equimorphism, elementary equivalence and similar similarities.",
            "The countable admissible ordinal equivalence relation.",
            "Unifying the model theory of first-order and second-order arithmetic via.",
            "Polytopes and simplexes in p-adic fields.",
            "On expansions of the real field by complex subgroups.",
            "The ⁎-variation of the Banach-Mazur game and forcing axioms.",
            "Proof lengths for instances of the Paris-Harrington principle.",
            "Superstability from categoricity in abstract elementary classes.",
            "The Gamma question for many-one degrees.",
            "Propositional team logics.",
            "Neostability in countable homogeneous metric spaces.",
            "Reducts of the Henson graphs with a constant.",
            "Erratum to: \"Scott rank of Polish metric spaces\" [Ann. Pure Appl. Logic 165 (12) (2014) 1919-1929].",
            "Full-splitting Miller trees and infinitely often equal reals.",
            "On the decidability of the theory of modules over the ring of algebraic integers.",
            "Forking in short and tame abstract elementary classes.",
            "Disjoint Borel functions.",
            "CE-cell decomposition and open cell property in o-minimal structures.",
            "Supercompact extender based Magidor-Radin forcing.",
            "Elementary recursive quantifier elimination based on Thom encoding and sign determination.",
            "Addendum to: \"The Bolzano-Weierstrass theorem is the jump of weak Kőnig's lemma\" [Ann. Pure Appl. Logic 163 (6) (2012) 623-655].",
            "Shelah's eventual categoricity conjecture in universal classes: Part I.",
            "On generalized Van Benthem-type characterizations.",
            "Nullifying randomness and genericity using symmetric difference.",
            "The strength of infinitary Ramseyan principles can be accessed by their densities.",
            "Homology groups of types in stable theories and the Hurewicz correspondence.",
            "Abelian C-minimal valued groups.",
            "Ceres in intuitionistic logic.",
            "Finding a field in a Zariski-like structure.",
            "Imaginaries in bounded pseudo real closed fields.",
            "Universal graphs at N_ω+1.",
            "Increasing sentences in Simple Type Theory.",
            "Uniform interpolation and compact congruences.",
            "A microscopic approach to Souslin-tree constructions, Part I.",
            "Determinacy in third order arithmetic.",
            "Ramsey type properties of ideals.",
            "Clustered cell decomposition in P-minimal structures.",
            "Monadic second-order properties of very sparse random graphs.",
            "Slow reflection.",
            "The Lascar groups and the first homology groups in model theory.",
            "Orbits of subsets of the monster model and geometric theories.",
            "Corrigendum to \"The d.r.e. degrees are not dense\" [Ann. Pure Appl. Logic 55 (1991) 125-151]."
        ]
    },
    {
        "name": "APAL",
        "year": "2016",
        "info": "2016: Volume 167",
        "count": 58,
        "papers": [
            "Borel structurability on the 2-shift of a countable group.",
            "Simplicity of the automorphism groups of some Hrushovski constructions.",
            "Model theoretic properties of the Urysohn sphere.",
            "Henkin sentences and local reflection principles for Rosser provability.",
            "Interaction graphs: Additives.",
            "Tameness, uniqueness triples and amalgamation.",
            "A generalization of the Łoś-Tarski preservation theorem.",
            "Transductions in arithmetic.",
            "A-computable graphs.",
            "The tree property below ℵω⋅2.",
            "Counterexamples to countable-section uniformization and separation.",
            "Separating club-guessing principles in the presence of fat forcing axioms.",
            "Iterated elementary embeddings and the model theory of infinitary logic.",
            "Cobham recursive set functions.",
            "Reducts of the generic digraph.",
            "Corrigendum to \"An order-theoretic analysis of interpretations among propositional deductive systems\" [Ann. Pure Appl. Logic 164 (2) (2013) 112-130].",
            "Symmetry and the union of saturated models in superstable abstract elementary classes.",
            "Regularity properties on the generalized reals.",
            "Erratum to \"Free abelian lattice-ordered groups\" [Ann. Pure Appl. Logic 134 (2-3) (2005) 265-283].",
            "Simple structures axiomatized by almost sure theories.",
            "Quasiminimal structures, groups and Zariski-like geometries.",
            "Undecidability through Fourier series.",
            "Almost structural completeness; an algebraic approach.",
            "Propositional logics of dependence.",
            "Canonical forking in AECs.",
            "Modal logics, justification logics, and realization.",
            "The poset of all copies of the random graph has the 2-localization property.",
            "Square and Delta reflection.",
            "Expansions of o-minimal structures by dense independent sets.",
            "Proof theory for lattice-ordered groups.",
            "Preface.",
            "Essential and density topologies of continuous domains.",
            "Limit spaces with approximations.",
            "Atomicity, coherence of information, and point-free structures.",
            "A constructive manifestation of the Kleene-Kreisel continuous functionals.",
            "The intrinsic topology of Martin-Löf universes.",
            "Positivity relations on a locale.",
            "Priestley-type dualities for partially ordered structures.",
            "Apartness spaces and uniform neighbourhood structures.",
            "Preface.",
            "Symbioses between mathematical logic and computer science.",
            "A problem of Laczkovich: How dense are set systems with no large independent sets?",
            "Occam bound on lowest complexity of elements.",
            "Turing meets Schanuel.",
            "Duality, non-standard elements, and dynamic properties of r.e. sets.",
            "The automorphism group of the enumeration degrees.",
            "Model theory of special subvarieties and Schanuel-type conjectures.",
            "Building independence relations in abstract elementary classes.",
            "On (uniform) hierarchical decompositions of finite structures and model-theoretic geometry.",
            "Abelian p-groups and the Halting problem.",
            "Multi-posets in algebraic logic, group theory, and non-commutative topology.",
            "A separating hyperplane theorem, the fundamental theorem of asset pricing, and Markov's principle.",
            "Superstability and symmetry.",
            "Infinite games specified by 2-tape automata.",
            "Reverse mathematical bounds for the Termination Theorem.",
            "Inductive inference and reverse mathematics.",
            "Classifying torsion free groups in o-minimal expansions of real closed fields.",
            "The semantic isomorphism theorem in abstract algebraic logic."
        ]
    },
    {
        "name": "APAL",
        "year": "2015",
        "info": "2015: Volume 166",
        "count": 52,
        "papers": [
            "Second-order propositional modal logic and monadic alternation hierarchies.",
            "Circuit lower bounds in bounded arithmetics.",
            "Definable normal measures.",
            "Axiomatizing first-order consequences in independence logic.",
            "Asymmetric regular types.",
            "A new model construction by making a detour via intuitionistic theories I: Operational set theory without choice is Π1-equivalent to KP.",
            "First order S4 and its measure-theoretic semantics.",
            "Categorical characterizations of the natural numbers require primitive recursion.",
            "Triposes, q-toposes and toposes.",
            "Topological dynamics for groups definable in real closed field.",
            "Modal interpolation via nested sequents.",
            "Large cardinals and definable well-orders, without the GCH.",
            "Definable closure in randomizations.",
            "Superrosy fields and valuations.",
            "Geometric triviality of the strongly minimal second Painlevé equations.",
            "Grothendieck rings of theories of modules.",
            "Notes on some second-order systems of iterated inductive definitions and Π11-comprehensions and relevant subsystems of set theory.",
            "Set-theoretic geology.",
            "On a common generalization of Shelah's 2-rank, dp-rank, and o-minimal dimension.",
            "The tree property at the א2n's and the failure of SCH at אω.",
            "Forcing lightface definable well-orders without the GCH.",
            "The comparison of various club guessing principles.",
            "Automorphisms of models of set theory and extensions of NFU.",
            "Galois stratification and ACFA.",
            "Inductive theorem proving based on tree grammars.",
            "Nonstandardness and the bounded functional interpretation.",
            "Cone avoidance and randomness preservation.",
            "Models of intuitionistic set theory in subtoposes of nested realizability toposes.",
            "Uniformly defining p-henselian valuations.",
            "The members of thin and minimal classes, their ranks and Turing degrees.",
            "WKL0 and induction principles in model theory.",
            "A new model construction by making a detour via intuitionistic theories II: Interpretability lower bound of Feferman's explicit mathematics T0.",
            "Connected components of definable groups, and o-minimality II.",
            "On -categoricity of equivalence relations.",
            "Rules with parameters in modal logic I.",
            "Easton's theorem for Ramsey and strongly Ramsey cardinals.",
            "Guessing more sets.",
            "The envelope of a pointclass under a local determinacy hypothesis.",
            "Tight stationarity and tree-like scales.",
            "An example of an automatic graph of intermediate growth.",
            "Universality, optimality, and randomness deficiency.",
            "Template iterations with non-definable ccc forcing notions.",
            "Fragility and indestructibility II.",
            "Why Y-c.c.",
            "Equilibrium points of an AND-OR tree: Under constraints on probability.",
            "Degrees bounding principles and universal instances in reverse mathematics.",
            "Large cardinals need not be large in HOD.",
            "A constructive version of Tarski's geometry.",
            "Realizing an AD+ model as a derived model of a premouse.",
            "Measuring complexities of classes of structures.",
            "An intuitionistic version of Ramsey's Theorem and its use in Program Termination.",
            "The structure of the Mitchell order - II."
        ]
    },
    {
        "name": "APAL",
        "year": "2014",
        "info": "2014: Volume 165",
        "count": 84,
        "papers": [
            "Editorial.",
            "The life and work of Sergei Artemov.",
            "Logical omniscience as infeasibility.",
            "What is relevance logic?",
            "The logic of justified belief, explicit knowledge, and conclusive evidence.",
            "Positive provability logic for uniform reflection principles.",
            "Evidence and plausibility in neighborhood structures.",
            "Hybrid Answer Set Programming.",
            "Intuitionistic completeness of first-order logic.",
            "The Paradox of the Knower revisited.",
            "Possible world semantics for first-order logic of proofs.",
            "Introduction to clarithmetic III.",
            "Symmetry in information flow.",
            "Fluctuations, effective learnability and metastability in analysis.",
            "The Logic of Uncertain Justifications.",
            "Relativized ordinal analysis: The case of Power Kripke-Platek set theory.",
            "Proof internalization in generalized Frege systems for classical logic.",
            "Modeling linear logic with implicit functions.",
            "Self-referentiality of Brouwer-Heyting-Kolmogorov semantics.",
            "Cohesive sets and rainbows.",
            "Relational dual tableau decision procedures and their applications to modal and intuitionistic logics.",
            "Relating first-order set theories, toposes and categories of classes.",
            "Consistent amalgamation for þ-forking.",
            "Nonstandard second-order arithmetic and Riemann's mapping theorem.",
            "On compactifications and the topological dynamics of definable groups.",
            "Constructive Zermelo-Fraenkel set theory and the limited principle of omniscience.",
            "Many countable support iterations of proper forcings preserve Souslin trees.",
            "Separating weak partial square principles.",
            "On supercompactness and the continuum function.",
            "Bounding, splitting, and almost disjointness.",
            "On unification and admissible rules in Gabbay-de Jongh logics.",
            "Squares and covering matrices.",
            "Theories without the tree property of the second kind.",
            "2-Minimality, jump classes and a note on natural definability.",
            "Propagation of partial randomness.",
            "Non-commutative logical algebras and algebraic quantales.",
            "Approximation of o-minimal maps satisfying a Lipschitz condition.",
            "The degrees of bi-hyperhyperimmune sets.",
            "Observing, reporting, and deciding in networks of sentences.",
            "Relativization makes contradictions harder for Resolution.",
            "Reverse mathematics and initial intervals.",
            "Mathias-Prikry and Laver-Prikry type forcing.",
            "Posets of copies of countable scattered linear orders.",
            "Omitting types for infinitary [0,1]-valued logic.",
            "Leibniz interpolation properties.",
            "Algebraic semantics and model completeness for Intuitionistic Public Announcement Logic.",
            "Combinatorics at אω.",
            "A feasible theory of truth over combinatory algebra.",
            "Selective covering properties of product spaces.",
            "Inside the Muchnik degrees I: Discontinuity, learnability and constructivism.",
            "CZF does not have the existence property.",
            "The quantum harmonic oscillator as a Zariski geometry.",
            "Omitting uncountable types and the strength of [0, 1]-valued logics.",
            "Inside the Muchnik degrees II: The degree structures induced by the arithmetical hierarchy of countably continuous functions.",
            "Definability and decidability in infinite algebraic extensions.",
            "Graphs realised by r.e. equivalence relations.",
            "A reducibility related to being hyperimmune-free.",
            "Computable categoricity for pseudo-exponential fields of size ℵ1.",
            "Non-circular proofs and proof realization in modal logic.",
            "Definable functions continuous on curves in o-minimal structures.",
            "Turing Centenary Conference: How the World Computes.",
            "Avoiding uniformity in the Δ20 enumeration degrees.",
            "The axiomatic power of Kolmogorov complexity.",
            "The distribution of ITRM-recognizable reals.",
            "Generics for computable Mathias forcing.",
            "Local induction and provably total computable functions.",
            "On effectively closed sets of effective strong measure zero.",
            "How much randomness is needed for statistics?",
            "An application of proof mining to nonlinear iterations.",
            "The computational strengths of α-tape infinite time Turing machines.",
            "The ω-Turing degrees.",
            "HOD in natural models of AD+.",
            "Models of Cohen measurability.",
            "Thin equivalence relations and inner models.",
            "Cascades, order, and ultrafilters.",
            "Some supplements to Feferman-Vaught related to the model theory of adeles.",
            "Exponentially closed fields and the conjecture on intersections with tori.",
            "Dimension spectra of random subfractals of self-similar fractals.",
            "The equivalence of bar recursion and open recursion.",
            "Fraïssé sequences: category-theoretic approach to universal homogeneous structures.",
            "A model of Cummings and Foreman revisited.",
            "The bounded proof property via step algebras and step frames.",
            "Short propositional refutations for dense random 3CNF formulas.",
            "Scott rank of Polish metric spaces."
        ]
    },
    {
        "name": "APAL",
        "year": "2013",
        "info": "2013: Volume 164",
        "count": 83,
        "papers": [
            "Integration in algebraically closed valued fields with sections.",
            "The isomorphism problem for ω-automatic trees.",
            "Forcing □ω1 with finite conditions.",
            "Erratum to \"Elimination of unbounded quantifiers for some poly-regular groups of infinite rank\" [Ann. Pure Appl. Logic 149 (1-3) (2007) 40-80].",
            "Partial near supercompactness.",
            "Kripke semantics and proof systems for combining intuitionistic logic and classical logic.",
            "An order-theoretic analysis of interpretations among propositional deductive systems.",
            "Erratum to \"Categoricity in abstract elementary classes with no maximal models\" [Ann. Pure Appl. Logic 141 (2006) 108-147].",
            "Non-forking frames in abstract elementary classes.",
            "Duality, projectivity, and unification in Łukasiewicz logic and MV-algebras.",
            "Locally o-minimal structures and structures with locally o-minimal open core.",
            "Characterizing all models in infinite cardinalities.",
            "Order algebraizable logics.",
            "Reverse mathematics and Peano categoricity.",
            "Distal and non-distal NIP theories.",
            "First-order logical duality.",
            "Algebraically closed MV-algebras and their sheaf representation.",
            "Quasi-Polish spaces.",
            "Slow consistency.",
            "Rudimentary and arithmetical constructive set theory.",
            "Characterising dominated weak-operator continuous functionals on subspaces of B(H).",
            "Regular opens in constructive topology and a representation theorem for overlap algebras.",
            "About Goodman's Theorem.",
            "Syntax for split preorders.",
            "Relating Bishop's function spaces to neighbourhood spaces.",
            "Definitional Reflection and Basic Logic.",
            "Cantor theorem and friends, in logical form.",
            "Computability in Europe 2011.",
            "Highness, locally noncappability and nonboundings.",
            "Automata on ordinals and automaticity of linear orders.",
            "Reverse-engineering Reverse Mathematics.",
            "Computability of the ergodic decomposition.",
            "Conditional computability of real functions with respect to a class of operators.",
            "On the Kolmogorov complexity of continuous real functions.",
            "The partial orderings of the computably enumerable ibT-degrees and cl-degrees are not elementarily equivalent.",
            "Preface.",
            "Learning based realizability for HA + EM1 and 1-Backtracking games: Soundness and completeness.",
            "Towards a canonical classical natural deduction system.",
            "Continuation-passing style models complete for intuitionistic logic.",
            "Applicative theories for the polynomial hierarchy of time and its levels.",
            "The λμT-calculus.",
            "Canonical proof nets for classical logic.",
            "Epsilon substitution for first- and second-order predicate logic.",
            "Minimal from classical proofs.",
            "Operations, climbability and the proper forcing axiom.",
            "Cardinal characteristics, projective wellorders and large continuum.",
            "Unification and admissible rules for paraconsistent minimal Johanssons' logic J and positive intuitionistic logic IPC+.",
            "Hyperations, Veblen progressions and transfinite iteration of ordinal functions.",
            "On ω-categorical, generically stable groups and rings.",
            "Operational closure and stability.",
            "Degrees of orders on torsion-free Abelian groups.",
            "Automatic models of first order theories.",
            "Applications of pcf for mild large cardinals to elementary embeddings.",
            "Basic subtoposes of the effective topos.",
            "Bare canonicity of representable cylindric and polyadic algebras.",
            "Super/rosy LkLk-theories and classes of finite structures.",
            "Martin-Löf complexes.",
            "Combinatorial realizability models of type theory.",
            "Elementary geometric local-global principles for fields.",
            "A proof-theoretic account of classical principles of truth.",
            "Natural factors of the Muchnik lattice capturing IPC.",
            "Foreword.",
            "Imperative programs as proofs via game semantics.",
            "Lambek vs. Lambek: Functorial vector space semantics and string diagrams for Lambek calculus.",
            "Axiomatizing first-order consequences in dependence logic.",
            "Full abstraction for Reduced ML.",
            "A game semantics for disjunctive logic programming.",
            "Preface.",
            "Baumgartner's conjecture and bounded forcing axioms.",
            "Kolmogorov complexity and computably enumerable sets.",
            "Topological completeness of the provability logic GLP.",
            "Consistency, optimality, and incompleteness.",
            "Uniformly defining valuation rings in Henselian valued fields with finite or pseudo-finite residue fields.",
            "Fusion and large cardinal preservation.",
            "Proof-theoretic conservations of weak weak intuitionistic constructive set theories.",
            "An Analogy Principle in Inductive Logic.",
            "Chain conditions in dependent groups.",
            "Reducing belief simpliciter to degrees of belief.",
            "Large cardinals and basic sequences.",
            "Expressive completeness through logically tractable models.",
            "The descriptive set-theoretical complexity of the embeddability relation on models of large size.",
            "Goodstein sequences for prominent ordinals up to the ordinal of Π11-CA0.",
            "An exposition of Hrushovski's New Strongly Minimal Set."
        ]
    },
    {
        "name": "APAL",
        "year": "2012",
        "info": "2012: Volume 163",
        "count": 127,
        "papers": [
            "Two-cardinal versions of weak compactness: Partitions of pairs.",
            "Tracking chains of Σ2-elementarity.",
            "Inclusion and exclusion dependencies in team semantics - On some logics of imperfect information.",
            "Preface.",
            "Metric spaces in synthetic topology.",
            "Reflections on function spaces.",
            "A constructive investigation of satisfiability.",
            "Formal neighbourhoods, combinatory Böhm trees, and untyped normalization by evaluation.",
            "Two subcategories of apartness spaces.",
            "Lebesgue's dominated convergence theorem in Bishop's style.",
            "Independence results in formal topology.",
            "Cosheaves and connectedness in formal topology.",
            "Generalizing realizability and Heyting models for constructive set theory.",
            "Cofinal types of ultrafilters.",
            "Expressive power of digraph solvability.",
            "Characterizing strong randomness via Martin-Löf randomness.",
            "Linear orderings and powers of characterizable cardinals.",
            "Visible acyclic differential nets, Part I: Semantics.",
            "Algebraic proof theory for substructural logics: Cut-elimination and completions.",
            "Prefixed tableaus and nested sequents.",
            "Low upper bounds in the LR degrees.",
            "Coding true arithmetic in the Medvedev degrees of Π10 classes.",
            "Algorithmic correspondence and canonicity for distributive modal logic.",
            "Separating the basic logics of the basic recurrences.",
            "Asymptotic probabilities of extension properties and random l-colourable structures.",
            "Bounded linear-time temporal logic: A proof-theoretic investigation.",
            "Tangled modal logic for topological dynamics.",
            "Computability in Europe 2009.",
            "Computably categorical Boolean algebras enriched by ideals and atoms.",
            "Tracing and domination in the Turing degrees.",
            "Randomness and lowness notions via open covers.",
            "Martin-Löf randomness and Galton-Watson processes.",
            "Computable de Finetti measures.",
            "The high/low hierarchy in the local structure of the omega-enumeration degrees.",
            "Empty intervals in the enumeration degrees.",
            "The extensional ordering of the sequential functionals.",
            "Alternating minima and maxima, Nash equilibria and Bounded Arithmetic.",
            "Decidability questions for a ring of Laurent polynomials.",
            "Computability in Europe 2010.",
            "The Bolzano-Weierstrass Theorem is the jump of Weak Kőnig's Lemma.",
            "The limits of tractability in Resolution-based propositional proof systems.",
            "Goodstein sequences for prominent ordinals up to the Bachmann-Howard ordinal.",
            "The Peirce translation.",
            "Effectively closed mass problems and intuitionism.",
            "Streamlined subrecursive degree theory.",
            "Almost universal cupping and diamond embeddings.",
            "Computable fields and the bounded Turing reduction.",
            "Preface.",
            "A bialgebraic approach to automata and formal language theory.",
            "Fixed point theorems on partial randomness.",
            "Product-free Lambek calculus is NP-complete.",
            "Unifying sets and programs via dependent types.",
            "Conservativity for logics of justified belief: Two approaches.",
            "Topological forcing semantics with settling.",
            "Tableaux and hypersequents for justification logics.",
            "Light linear logics with controlled weakening: Expressibility, confluent strong normalization.",
            "In the full propositional logic, 5/8 of classical tautologies are intuitionistically valid.",
            "Lower complexity bounds in justification logic.",
            "Towards NP-P via proof complexity and search.",
            "A relational semantics for parallelism and non-determinism in a functional setting.",
            "Justification Logic as a foundation for certifying mobile computation.",
            "Canonical signed calculi with multi-ary quantifiers.",
            "Completeness results for memory logics.",
            "Foreword.",
            "A predicative completion of a uniform space.",
            "Aligning the weak König lemma, the uniform continuity theorem, and Brouwer's fan theorem.",
            "Closed choice and a Uniform Low Basis Theorem.",
            "Almost new pre-apartness from old.",
            "Lattice properties of congruences for stochastic relations.",
            "On bounded functional interpretations.",
            "The intermediate value theorem in constructive mathematics without choice.",
            "The uniform boundedness theorem and a boundedness principle.",
            "A synthetic theory of sequential domains.",
            "Fine hierarchies via Priestley duality.",
            "Real computation with least discrete advice: A complexity theory of nonuniform computability with applications to effective linear algebra.",
            "Interpreting groups and fields in simple, finitary AECs.",
            "Propositional proofs and reductions between NP search problems.",
            "The bounded functional interpretation of bar induction.",
            "Isometry of Polish metric spaces.",
            "The relational model is injective for multiplicative exponential linear logic (without weakenings).",
            "Indestructible strong compactness but not supercompactness.",
            "Reverse mathematics and properties of finite character.",
            "On n-tardy sets.",
            "Realization for justification logics via nested sequents: Modularity through embedding.",
            "Forcing by non-scattered sets.",
            "A partially non-proper ordinal beyond L(Vλ+1).",
            "Craig interpolation for networks of sentences.",
            "Polarized partitions on the second level of the projective hierarchy.",
            "Erratum to \"Representation theory of MV-algebras\" [Ann. Pure Appl. Logic 161 (8) (2010)].",
            "Preface.",
            "Foundational implications of the Inner Model Hypothesis.",
            "Derived rules for predicative set theory: An application of sheaves.",
            "Constructivist and structuralist foundations: Bishop's and Lawvere's theories of sets.",
            "From the weak to the strong existence property.",
            "Constructive toposes with countable sums as models of constructive set theory.",
            "Intuitionism and the liar paradox.",
            "A constructive analysis of learning in Peano Arithmetic.",
            "Topological inductive definitions.",
            "Classes and truths in set theory.",
            "Covers of Abelian varieties as analytic Zariski structures.",
            "Delimited control operators prove Double-negation Shift.",
            "Gödel functional interpretation and weak compactness.",
            "Independence, order, and the interaction of ultrafilters and theories.",
            "Computably enumerable sets below random sets.",
            "A cut-free sequent system for two-dimensional modal logic, and why it matters.",
            "Characterization of NIP theories by ordered graph-indiscernibles.",
            "Measure, randomness and sublocales.",
            "Guessing models and generalized Laver diamond.",
            "Comparing Peano arithmetic, Basic Law V, and Hume's Principle.",
            "The combinatorial essence of supercompactness.",
            "Dynamic measure logic.",
            "Easton's theorem and large cardinals from the optimal hypothesis.",
            "Decomposing Borel functions and structure at finite levels of the Baire hierarchy.",
            "Some new results on decidability for elementary algebra and geometry.",
            "Realizability models refuting Ishihara's boundedness principle.",
            "Interaction graphs: Multiplicatives.",
            "Syntactic cut-elimination for a fragment of the modal mu-calculus.",
            "Algorithmic randomness, reverse mathematics, and the dominated convergence theorem.",
            "On two topological cardinal invariants of an order-theoretic flavour.",
            "Generalizations of the Kunen inconsistency.",
            "On the existence of indiscernible trees.",
            "First order tameness of measures.",
            "Some characterization and preservation theorems in modal logic.",
            "Generalising canonical extension to the categorical setting.",
            "A functional interpretation for nonstandard arithmetic.",
            "Extension without cut.",
            "Abstract elementary classes and accessible categories."
        ]
    },
    {
        "name": "APAL",
        "year": "2011",
        "info": "2011: Volume\n162",
        "count": 65,
        "papers": [
            "Edge distribution and density in the characteristic sequence.",
            "Recursive analysis of singular ordinary differential equations.",
            "Locatedness and overt sublocales.",
            "Completeness for flat modal fixpoint logics.",
            "A measure-theoretic proof of Turing incomparability.",
            "Generic embeddings associated to an indestructibly weakly compact cardinal.",
            "Wellfoundedness proofs by means of non-monotonic inductive definitions II: First order operators.",
            "Combinatorial analysis of proofs in projective and affine geometry.",
            "Admissible rules in the implication-negation fragment of intuitionistic logic.",
            "Preface.",
            "Unprovability threshold for the planar graph minor theorem.",
            "Computability of finite-dimensional linear subspaces and best approximation.",
            "Authentication schemes from actions on graphs, groups, or rings.",
            "The eskolemization of universal quantifiers.",
            "Structural complexity of AvgBPP.",
            "Some theorems on the algorithmic approach to probability theory and information theory: (1971 Dissertation directed by A.N. Kolmogorov).",
            "Referee's report on Leonid Levin's dissertation \"Some Theorems on the Algorithmic Approach to Probability Theory and Information Theory\" (November 27, 1972).",
            "Cut-free formulations for a quantified logic of here and there.",
            "Classical descriptive set theory as a refinement of effective descriptive set theory.",
            "lambda-structures and s-structures: Translating the models.",
            "A characterization theorem for geometric logic.",
            "On theories of bounded arithmetic for NC1.",
            "A sorting network in bounded arithmetic.",
            "Maximal pairs of c.e. reals in the computably Lipschitz degrees.",
            "New spectra of strongly minimal theories in finite languages.",
            "A combinatorial result related to the consistency of New Foundations.",
            "Integration in algebraically closed valued fields.",
            "An o-minimal structure without mild parameterization.",
            "The provably total NP search problems of weak second order bounded arithmetic.",
            "Quadratic forms in models of IΔ0+Ω1, Part II: Local equivalence.",
            "O-minimal residue fields of o-minimal fields.",
            "Upper bounds on ideals in the computably enumerable Turing degrees.",
            "The geometry of Hrushovski constructions, I: The uncollapsed case.",
            "Preface.",
            "Σ01 and Π01 equivalence structures.",
            "Demuth randomness and computational complexity.",
            "Dimensions, matroids, and dense pairs of first-order structures.",
            "Stable domination and weight.",
            "Dichotomy theorems for countably infinite dimensional analytic hypergraphs.",
            "On guessing generalized clubs at the successors of regulars.",
            "The strength of extensionality II - Weak weak set theories without infinity.",
            "The Suslin operator in applicative theories: Its proof-theoretic analysis via ordinal theories.",
            "A recursion-theoretic approach to NP.",
            "The complexity of central series in nilpotent computable groups.",
            "A focused approach to combining logics.",
            "Notions around tree property 1.",
            "λ-structures and s-structures: Translating the iteration strategies.",
            "A correction to \"A non-implication between fragments of Martin's Axiom related to a property which comes from Aronszajn trees\".",
            "Some model-theoretic correspondences between dimension groups and AF algebras.",
            "Global square and mutual stationarity at the alephn.",
            "Quick cut-elimination for strictly positive cuts.",
            "Completeness and cut-elimination theorems for trilattice logics.",
            "Classifying singularities up to analytic extensions of scalars is smooth.",
            "Projective wellorders and mad families with large continuum.",
            "Greatly Erdős cardinals with some generalizations to the Chang and Ramsey properties.",
            "Category-theoretic aspects of abstract elementary classes.",
            "Groups elementarily equivalent to a free nilpotent group of finite rank.",
            "The provably terminating operations of the subsystem PETJ of explicit mathematics.",
            "Minimal first-order structures.",
            "Logic of secrets in collaboration networks.",
            "Borel reducibility and finitely Hölder(α) embeddability.",
            "Independence results for variants of sharply bounded induction.",
            "Unification in linear temporal logic LTL.",
            "CERES in higher-order logic.",
            "Finite axiomatizability in Łukasiewicz logic."
        ]
    },
    {
        "name": "APAL",
        "year": "2010",
        "info": "2010: Volumes\n161, 162",
        "count": 172,
        "papers": [
            "Modal characterisation theorems over special classes of frames.",
            "On principally generated quantaloid-modules in general, and skew local homeomorphisms in particular.",
            "Covering theorems for the core model, and an application to stationary set reflection.",
            "Dense non-reflection for stationary collections of countable sets.",
            "A completeness result for the simply typed lambdaµ-calculus.",
            "Preface.",
            "Note on witnessed Gödel logics with Delta.",
            "Interpretability in PRA.",
            "Logical structures and genus of proofs.",
            "Commutative integral bounded residuated lattices with an added involution.",
            "State-morphism MV-algebras.",
            "Around provability logic.",
            "First-order t-norm based fuzzy logics with truth-constants: Distinguished semantics and completeness properties.",
            "Ordinal decompositions for preordered root systems.",
            "Arithmetical complexity of fuzzy predicate logics - A survey II.",
            "On the reflection invariance of residuated chains.",
            "Generalizations of Boolean products for lattice-ordered algebras.",
            "Interpretation of De Finetti coherence criterion in Lukasiewicz Logic.",
            "Glivenko theorems revisited.",
            "Preface.",
            "The universal modality, the center of a Heyting algebra, and the Blok-Esakia theorem.",
            "Weighted o-minimal hybrid systems.",
            "Propositional interval neighborhood logics: Expressiveness, decidability, and undecidable extensions.",
            "Reasoning about sequences of memory states.",
            "Automata and logics over finitely varying functions.",
            "Extracting the resolution algorithm from a completeness proof for the propositional calculus.",
            "On intuitionistic modal and tense logics and their classical companion logics: Topological semantics and bisimulations.",
            "Realizations and LP.",
            "A modal provability logic of explicit and implicit proofs.",
            "On complexity of Ehrenfeucht-Fraïssé games.",
            "Model-theoretic complexity of automatic structures.",
            "Hypersequent calculi for intuitionistic logic with classical atoms.",
            "The complexity of recursive constraint satisfaction problems.",
            "Finite automata presentable abelian groups.",
            "A non-implication between fragments of Martin's Axiom related to a property which comes from Aronszajn trees.",
            "Locally definable homotopy.",
            "The strength of sharply bounded induction requires MSP.",
            "Bootstrapping, part I.",
            "A modal logic framework for reasoning about comparative distances and topology.",
            "On the T1 axiom and other separation properties in constructive point-free and point-set topology.",
            "Topological differential fields.",
            "On some definable sets over fields with analytic structure.",
            "Foreword.",
            "Equilibrium semantics of languages of imperfect information.",
            "Resource modalities in tensor logic.",
            "Proof and refutation in MALL as a game.",
            "Totality in arena games.",
            "The variable hierarchy for the games µ-calculus.",
            "Preface.",
            "On the computational complexity of cut-reduction.",
            "The double negation of the intermediate value theorem.",
            "An arithmetical view to first-order logic.",
            "Kripke semantics for provability logic GLP.",
            "Extending and interpreting Post's programme.",
            "Effectiveness in RPL, with applications to continuous logic.",
            "A characterization of the Language Invariant families satisfying Spectrum Exchangeability in Polyadic Inductive Logic.",
            "Quelques effets pervers de la positivité.",
            "Dependence of variables construed as an atomic formula.",
            "Beyond Borel-amenability: Scales and superamenable reducibilities.",
            "The effective theory of Borel equivalence relations.",
            "A decomposition theorem for neutrices.",
            "On lovely pairs of geometric structures.",
            "Forcing absoluteness and regularity properties.",
            "Global singularization and the failure of SCH.",
            "Cardinal characteristics and projective wellorders.",
            "Elementary differences between the degrees of unsolvability and degrees of compressibility.",
            "Filtration-equivalent aleph1-separable abelian groups of cardinality aleph1.",
            "Types directed by constants.",
            "Global square sequences in extender models.",
            "Truth in generic cuts.",
            "Selection over classes of ordinals expanded by monadic predicates.",
            "Representation theory of MV-algebras.",
            "Nonstandard arithmetic and recursive comprehension.",
            "The complexity of temporal logic over the reals.",
            "Cut elimination and strong separation for substructural logics: An algebraic approach.",
            "Spaces of orders and their Turing degree spectra.",
            "The free n-generated BL-algebra.",
            "Strong normalization results by translation.",
            "Cardinal sequences of LCS spaces under GCH.",
            "Countable partition ordinals.",
            "Club-guessing, stationary reflection, and coloring theorems.",
            "A minimal classical sequent calculus free of structural rules.",
            "Games with 1-backtracking.",
            "Borel reductions of profinite actions of SLn(Z).",
            "Higher Kurtz randomness.",
            "Martin's Axiom and embeddings of upper semi-lattices into the Turing degrees.",
            "Relativized Grothendieck topoi.",
            "Preface.",
            "Classical predicative logic-enriched type theories.",
            "Classical proof forestry.",
            "Kripke models for classical logic.",
            "Light Dialectica revisited.",
            "Inhabitation of polymorphic and existential types.",
            "Completeness and partial soundness results for intersection and union typing for lambda_µµ_.",
            "Logic for update products and steps into the past.",
            "The determinacy strength of Pi12-comprehension.",
            "Generating transformation semigroups using endomorphisms of preorders, graphs, and tolerances.",
            "Fundamental results for pointfree convex geometry.",
            "Canonical extensions for congruential logics with the deduction theorem.",
            "Infinitely Peano differentiable functions in polynomially bounded o-minimal structures.",
            "More infinity for a better finitism.",
            "Special transformations in algebraically closed valued fields.",
            "Exponentiations over the universal enveloping algebra of sl2(C).",
            "Projective mad families.",
            "The computable Lipschitz degrees of computably enumerable sets are not dense.",
            "Erratum to \"On the reflection invariance of residuated chains\" [Ann. Pure Appl. Logic 161 (2009) 220-227].",
            "Erratum to \"State-morphism MV-algebras\" [Ann. Pure Appl. Logic 161 (2009) 161-173].",
            "Edge distribution and density in the characteristic sequence.",
            "Recursive analysis of singular ordinary differential equations.",
            "Locatedness and overt sublocales.",
            "Completeness for flat modal fixpoint logics.",
            "A measure-theoretic proof of Turing incomparability.",
            "Generic embeddings associated to an indestructibly weakly compact cardinal.",
            "Wellfoundedness proofs by means of non-monotonic inductive definitions II: First order operators.",
            "Combinatorial analysis of proofs in projective and affine geometry.",
            "Admissible rules in the implication-negation fragment of intuitionistic logic.",
            "Preface.",
            "Unprovability threshold for the planar graph minor theorem.",
            "Computability of finite-dimensional linear subspaces and best approximation.",
            "Authentication schemes from actions on graphs, groups, or rings.",
            "The eskolemization of universal quantifiers.",
            "Structural complexity of AvgBPP.",
            "Some theorems on the algorithmic approach to probability theory and information theory: (1971 Dissertation directed by A.N. Kolmogorov).",
            "Referee's report on Leonid Levin's dissertation \"Some Theorems on the Algorithmic Approach to Probability Theory and Information Theory\" (November 27, 1972).",
            "Cut-free formulations for a quantified logic of here and there.",
            "Classical descriptive set theory as a refinement of effective descriptive set theory.",
            "lambda-structures and s-structures: Translating the models.",
            "A characterization theorem for geometric logic.",
            "On theories of bounded arithmetic for NC1.",
            "A sorting network in bounded arithmetic.",
            "Maximal pairs of c.e. reals in the computably Lipschitz degrees.",
            "New spectra of strongly minimal theories in finite languages.",
            "A combinatorial result related to the consistency of New Foundations.",
            "Integration in algebraically closed valued fields.",
            "An o-minimal structure without mild parameterization.",
            "The provably total NP search problems of weak second order bounded arithmetic.",
            "Quadratic forms in models of IΔ0+Ω1, Part II: Local equivalence.",
            "O-minimal residue fields of o-minimal fields.",
            "Upper bounds on ideals in the computably enumerable Turing degrees.",
            "The geometry of Hrushovski constructions, I: The uncollapsed case.",
            "Preface.",
            "Σ01 and Π01 equivalence structures.",
            "Demuth randomness and computational complexity.",
            "Dimensions, matroids, and dense pairs of first-order structures.",
            "Stable domination and weight.",
            "Dichotomy theorems for countably infinite dimensional analytic hypergraphs.",
            "On guessing generalized clubs at the successors of regulars.",
            "The strength of extensionality II - Weak weak set theories without infinity.",
            "The Suslin operator in applicative theories: Its proof-theoretic analysis via ordinal theories.",
            "A recursion-theoretic approach to NP.",
            "The complexity of central series in nilpotent computable groups.",
            "A focused approach to combining logics.",
            "Notions around tree property 1.",
            "λ-structures and s-structures: Translating the iteration strategies.",
            "A correction to \"A non-implication between fragments of Martin's Axiom related to a property which comes from Aronszajn trees\".",
            "Some model-theoretic correspondences between dimension groups and AF algebras.",
            "Global square and mutual stationarity at the alephn.",
            "Quick cut-elimination for strictly positive cuts.",
            "Completeness and cut-elimination theorems for trilattice logics.",
            "Classifying singularities up to analytic extensions of scalars is smooth.",
            "Projective wellorders and mad families with large continuum.",
            "Greatly Erdős cardinals with some generalizations to the Chang and Ramsey properties.",
            "Category-theoretic aspects of abstract elementary classes.",
            "Groups elementarily equivalent to a free nilpotent group of finite rank.",
            "The provably terminating operations of the subsystem PETJ of explicit mathematics.",
            "Minimal first-order structures.",
            "Logic of secrets in collaboration networks.",
            "Borel reducibility and finitely Hölder(α) embeddability.",
            "Independence results for variants of sharply bounded induction.",
            "Unification in linear temporal logic LTL.",
            "CERES in higher-order logic.",
            "Finite axiomatizability in Łukasiewicz logic."
        ]
    },
    {
        "name": "APAL",
        "year": "2009",
        "info": "2009: Volumes\n157, 158, 159, 160, 161",
        "count": 186,
        "papers": [
            "Large cardinals and locally defined well-orders of the universe.",
            "Quantum deduction rules.",
            "Definable principal congruences and solvability.",
            "Sequences of real functions on [0, 1] in constructive reverse mathematics.",
            "Foreword.",
            "The metamathematics of ergodic theory.",
            "Exact unprovability results for compound well-quasi-ordered combinatorial classes.",
            "A computable version of Banach's Inverse Mapping Theorem.",
            "Space of valuations.",
            "Non-deterministic semantics for dynamic topological logic.",
            "Injecting uniformities into Peano arithmetic.",
            "o-minimal analytic separation of sets in dimension 2.",
            "Index sets for some classes of structures.",
            "Low-distortion embeddings of infinite metric spaces into the real line.",
            "A strong antidiamond principle compatible with CH.",
            "On lengths of proofs in non-classical logics.",
            "On reflection principles.",
            "Realization of phi-types and Keisler's order.",
            "Existential arithmetization of Diophantine equations.",
            "The strength of extensionality I - weak weak set theories with infinity.",
            "Ordinal analysis by transformations.",
            "Phase transitions for Gödel incompleteness.",
            "Order-isomorphic eta1-orderings in Cohen extensions.",
            "Game ideals.",
            "Some applications of mixed support iterations.",
            "Independence and the finite submodel property.",
            "A geometrical procedure for computing relaxation.",
            "Patterns of resemblance of order 2.",
            "Coherence in linear predicate logic.",
            "Preface.",
            "Classifying the phase transition threshold for Ackermannian functions.",
            "Model theoretic forcing in analysis.",
            "Popa Superrigidity and countable Borel equivalence relations.",
            "Maharam algebras.",
            "Relative categoricity in abelian groups II.",
            "Substitution Frege and extended Frege proof systems in non-classical logics.",
            "Towards the decidability of the theory of modules over finite commutative rings.",
            "Large cardinals and gap-1 morasses.",
            "Further notes on cell decomposition in closed ordered differential fields.",
            "Cell decomposition and dimension function in the theory of closed ordered differential fields.",
            "Describing proofs by short tautologies.",
            "Modal languages for topology: Expressivity and definability.",
            "Proof theory for admissible rules.",
            "Effective categoricity of Abelian p-groups.",
            "The strength of choiceless patterns of singular and weakly compact cardinals.",
            "Preface.",
            "A constructive theory of continuous domains suitable for implementation.",
            "Coalgebraic logic for stochastic right coalgebras.",
            "On the classification of (effective) φ-spaces.",
            "D-completions and the d-topology.",
            "A Minkowski type duality mediating between state and predicate transformer semantics for a probabilistic nondeterministic language.",
            "Definability in the h-quasiorder of labeled forests.",
            "Rough concept lattices and domains.",
            "Natural non-dcpo domains and f-spaces.",
            "On the strength of dependent products in the type theory of Martin-Löf.",
            "The structure of the s-degrees contained within a single e-degree.",
            "Organic and tight.",
            "Full operational set theory with unbounded existential quantification and power set.",
            "Distinguished algebraic semantics for t-norm based fuzzy logics: Methods and algebraic equivalencies.",
            "Syntactic cut-elimination for common knowledge.",
            "Dynamic topological S5.",
            "A game on Boolean algebras describing the collapse of the continuum.",
            "Erratum to: \"Some model-theoretic results in the algebraic theory of quadratic forms\" [Ann. Pure Appl. Logic 112 (2-3) (2001) 189-223].",
            "The predicative Frege hierarchy.",
            "A dichotomy result for a pointwise summable sequence of operators.",
            "Classical and effective descriptive complexities of omega-powers.",
            "A new characterization of supercompactness and applications.",
            "On the computational power of random strings.",
            "Preface.",
            "Reverse mathematics and well-ordering principles: A pilot study.",
            "Constructive equivalence relations on computable probability measures.",
            "A foundation for real recursive function theory.",
            "The jump operator on the omega-enumeration degrees.",
            "Post's Problem for ordinal register machines: An explicit approach.",
            "Ordinal machines and admissible recursion theory.",
            "A minimalist two-level foundation for constructive mathematics.",
            "On Fraïssé's conjecture for linear orders of finite Hausdorff rank.",
            "Turing oracle machines, online computing, and three displacements in computability theory.",
            "A non-splitting theorem in the enumeration degrees.",
            "Modal characterisation theorems over special classes of frames.",
            "On principally generated quantaloid-modules in general, and skew local homeomorphisms in particular.",
            "Covering theorems for the core model, and an application to stationary set reflection.",
            "Dense non-reflection for stationary collections of countable sets.",
            "A completeness result for the simply typed lambdaµ-calculus.",
            "Preface.",
            "Note on witnessed Gödel logics with Delta.",
            "Interpretability in PRA.",
            "Logical structures and genus of proofs.",
            "Commutative integral bounded residuated lattices with an added involution.",
            "State-morphism MV-algebras.",
            "Around provability logic.",
            "First-order t-norm based fuzzy logics with truth-constants: Distinguished semantics and completeness properties.",
            "Ordinal decompositions for preordered root systems.",
            "Arithmetical complexity of fuzzy predicate logics - A survey II.",
            "On the reflection invariance of residuated chains.",
            "Generalizations of Boolean products for lattice-ordered algebras.",
            "Interpretation of De Finetti coherence criterion in Lukasiewicz Logic.",
            "Glivenko theorems revisited.",
            "Preface.",
            "The universal modality, the center of a Heyting algebra, and the Blok-Esakia theorem.",
            "Weighted o-minimal hybrid systems.",
            "Propositional interval neighborhood logics: Expressiveness, decidability, and undecidable extensions.",
            "Reasoning about sequences of memory states.",
            "Automata and logics over finitely varying functions.",
            "Extracting the resolution algorithm from a completeness proof for the propositional calculus.",
            "On intuitionistic modal and tense logics and their classical companion logics: Topological semantics and bisimulations.",
            "Realizations and LP.",
            "A modal provability logic of explicit and implicit proofs.",
            "On complexity of Ehrenfeucht-Fraïssé games.",
            "Model-theoretic complexity of automatic structures.",
            "Hypersequent calculi for intuitionistic logic with classical atoms.",
            "The complexity of recursive constraint satisfaction problems.",
            "Finite automata presentable abelian groups.",
            "A non-implication between fragments of Martin's Axiom related to a property which comes from Aronszajn trees.",
            "Locally definable homotopy.",
            "The strength of sharply bounded induction requires MSP.",
            "Bootstrapping, part I.",
            "A modal logic framework for reasoning about comparative distances and topology.",
            "On the T1 axiom and other separation properties in constructive point-free and point-set topology.",
            "Topological differential fields.",
            "On some definable sets over fields with analytic structure.",
            "Foreword.",
            "Equilibrium semantics of languages of imperfect information.",
            "Resource modalities in tensor logic.",
            "Proof and refutation in MALL as a game.",
            "Totality in arena games.",
            "The variable hierarchy for the games µ-calculus.",
            "Preface.",
            "On the computational complexity of cut-reduction.",
            "The double negation of the intermediate value theorem.",
            "An arithmetical view to first-order logic.",
            "Kripke semantics for provability logic GLP.",
            "Extending and interpreting Post's programme.",
            "Effectiveness in RPL, with applications to continuous logic.",
            "A characterization of the Language Invariant families satisfying Spectrum Exchangeability in Polyadic Inductive Logic.",
            "Quelques effets pervers de la positivité.",
            "Dependence of variables construed as an atomic formula.",
            "Beyond Borel-amenability: Scales and superamenable reducibilities.",
            "The effective theory of Borel equivalence relations.",
            "A decomposition theorem for neutrices.",
            "On lovely pairs of geometric structures.",
            "Forcing absoluteness and regularity properties.",
            "Global singularization and the failure of SCH.",
            "Cardinal characteristics and projective wellorders.",
            "Elementary differences between the degrees of unsolvability and degrees of compressibility.",
            "Filtration-equivalent aleph1-separable abelian groups of cardinality aleph1.",
            "Types directed by constants.",
            "Global square sequences in extender models.",
            "Truth in generic cuts.",
            "Selection over classes of ordinals expanded by monadic predicates.",
            "Representation theory of MV-algebras.",
            "Nonstandard arithmetic and recursive comprehension.",
            "The complexity of temporal logic over the reals.",
            "Cut elimination and strong separation for substructural logics: An algebraic approach.",
            "Spaces of orders and their Turing degree spectra.",
            "The free n-generated BL-algebra.",
            "Strong normalization results by translation.",
            "Cardinal sequences of LCS spaces under GCH.",
            "Countable partition ordinals.",
            "Club-guessing, stationary reflection, and coloring theorems.",
            "A minimal classical sequent calculus free of structural rules.",
            "Games with 1-backtracking.",
            "Borel reductions of profinite actions of SLn(Z).",
            "Higher Kurtz randomness.",
            "Martin's Axiom and embeddings of upper semi-lattices into the Turing degrees.",
            "Relativized Grothendieck topoi.",
            "Preface.",
            "Classical predicative logic-enriched type theories.",
            "Classical proof forestry.",
            "Kripke models for classical logic.",
            "Light Dialectica revisited.",
            "Inhabitation of polymorphic and existential types.",
            "Completeness and partial soundness results for intersection and union typing for lambda_µµ_.",
            "Logic for update products and steps into the past.",
            "The determinacy strength of Pi12-comprehension.",
            "Generating transformation semigroups using endomorphisms of preorders, graphs, and tolerances.",
            "Fundamental results for pointfree convex geometry.",
            "Canonical extensions for congruential logics with the deduction theorem.",
            "Infinitely Peano differentiable functions in polynomially bounded o-minimal structures.",
            "More infinity for a better finitism.",
            "Special transformations in algebraically closed valued fields.",
            "Exponentiations over the universal enveloping algebra of sl2(C).",
            "Projective mad families.",
            "The computable Lipschitz degrees of computably enumerable sets are not dense.",
            "Erratum to \"On the reflection invariance of residuated chains\" [Ann. Pure Appl. Logic 161 (2009) 220-227].",
            "Erratum to \"State-morphism MV-algebras\" [Ann. Pure Appl. Logic 161 (2009) 161-173]."
        ]
    },
    {
        "name": "APAL",
        "year": "2008",
        "info": "2008: Volumes\n151, 152, 153, 154, 155, 156",
        "count": 73,
        "papers": [
            "Superrosy dependent groups having finitely satisfiable generics.",
            "The parameterized complexity of maximality and minimality problems.",
            "A remark on equivalent Rosser sentences.",
            "Foreword for special issue of APAL for GaLoP 2005.",
            "An infinite-game semantics for well-founded negation in logic programming.",
            "Angelic semantics of fine-grained concurrency.",
            "Second-order type isomorphisms through game semantics.",
            "A game semantics of names and pointers.",
            "Infinite trace equivalence.",
            "Logic, Language, Information and Computation.",
            "Game-based notions of locality over finite models.",
            "Choiceless polynomial time, counting and the Cai-Fürer-Immerman graphs.",
            "Lowness properties and approximations of the jump.",
            "A quantified logic of evidence.",
            "Characterising nested database dependencies by fragments of propositional logic.",
            "System BV is NP-complete.",
            "Probabilistic verification and approximation.",
            "Full classical S5 in natural deduction with weak normalization.",
            "Cut elimination for a simple formulation of epsilon calculus.",
            "Approximations of modal logics: K and beyond.",
            "The complexity of random ordered structures.",
            "Preface.",
            "Classical Fomega, orthogonality and symmetric candidates.",
            "Strong normalization of classical natural deduction with disjunctions.",
            "Call-by-name reduction and cut-elimination in classical logic.",
            "On the unity of duality.",
            "Programs from proofs using classical dependent choice.",
            "A sequent calculus for limit computable mathematics.",
            "On superstable CSA-groups.",
            "Generalized halfspaces in dimension groups.",
            "Completions of µ-algebras.",
            "On strongly jump traceable reals.",
            "Generalizing proofs in monadic languages.",
            "Weakly o-minimal nonvaluational structures.",
            "Cardinal transfer properties in extender models.",
            "Easton's theorem and large cardinals.",
            "Continuity of capping in CbT.",
            "More on SOP1 and SOP2.",
            "Linear temporal logic with until and next, logical consecutions.",
            "Stochastic coalgebraic logic: Bisimilarity and behavioral equivalence.",
            "Intermediate logics and factors of the Medvedev lattice.",
            "Free equivalential algebras.",
            "Generalized amalgamation and n-simplicity.",
            "Synthetic domain theory and models of linear Abadi & Plotkin logic.",
            "Vaught's conjecture for superstable theories of finite rank.",
            "Proof nets sequentialisation in multiplicative linear logic.",
            "Gödel algebras free over finite distributive lattices.",
            "Resolution over linear equations and multilinear proofs.",
            "Atomic models higher up.",
            "Preface.",
            "Parameter-free polymorphic types.",
            "Structural properties of Q-degrees of n-c. e. sets.",
            "I classes, LR degrees and Turing degrees.",
            "A domain model characterising strong normalisation.",
            "The upward closure of a perfect thin class.",
            "What is o-minimality?",
            "The associated sheaf functor theorem in algebraic set theory.",
            "The nonstandard quantum plane.",
            "Computable categoricity and the Ershov hierarchy.",
            "A note on a theorem of Ax.",
            "Martin's Maximum and definability in H(xaleph2).",
            "Aspects of predicative algebraic set theory I: Exact completion.",
            "Ordinal analysis of non-monotone I-definable inductive definitions.",
            "Effectively closed sets of measures and randomness.",
            "Introduction to Turing categories.",
            "Arithmetic of Dedekind cuts of ordered Abelian groups.",
            "Partial automorphism semigroups.",
            "The internal consistency of Easton's theorem.",
            "A Gdelta ideal of compact sets strictly above the nowhere dense ideal in the Tukey order.",
            "Abstract elementary classes and infinitary logics.",
            "A semi-linear group which is not affine.",
            "Cartesian closed Dialectica categories.",
            "A standard model of Peano arithmetic with no conservative elementary extension."
        ]
    },
    {
        "name": "APAL",
        "year": "2007",
        "info": "2007: Volumes\n145, 146, 147, 148, 149, 150",
        "count": 57,
        "papers": [
            "Non-isolated types in stable theories.",
            "Automorphisms of models of arithmetic: A unified view.",
            "Weak typed Böhm theorem on IMLL.",
            "Partial collapses of the Sigma1 complexity hierarchy in models for fragments of bounded arithmetic.",
            "Interpreting structures of finite Morley Rank in strongly minimal sets.",
            "Bounded functional interpretation and feasible analysis.",
            "Ordinal arithmetic based on Skolem hulling.",
            "Sigma1-elementarity and Skolem hull operators.",
            "A coverage construction of the reals and the irrationals.",
            "A valuation ring analogue of von Neumann regularity.",
            "Derivability in certain subsystems of the Logic of Proofs is Pi2p-complete.",
            "Splitting families and forcing.",
            "Randomness and the linear degrees of computability.",
            "Decidability of the theory of modules over commutative valuation domains.",
            "A categorical semantics for polarized MALL.",
            "Partial Horn logic and cartesian categories.",
            "Criterion for binarity of N0-categorical weakly o-minimal theories.",
            "Constructive characterizations of bar subsets.",
            "Model-theoretic aspects of Sigma-cotorsion modules.",
            "Imaginaries in pairs of algebraically closed fields.",
            "Decidable theories of non-projectable l-groups of continuous functions.",
            "Non-well-founded trees in categories.",
            "Coalgebras in a category of classes.",
            "A lower bound for intuitionistic logic.",
            "Intervals containing exactly one c.e. degree.",
            "Exact approximations to Stone-Cech compactification.",
            "Passive induction and a solution to a Paris-Wilkie open question.",
            "Guessing and non-guessing of canonical functions.",
            "A completeness result for a realisability semantics for an intersection type system.",
            "Double helix in large large cardinals and iteration of elementary embeddings.",
            "Medial commutativity.",
            "Geometry of Robinson consistency in Lukasiewicz logic.",
            "First-order Gödel logics.",
            "A comparison of well-known ordinal notation systems for epsilon0.",
            "On definable filters in computably enumerable degrees.",
            "An algebraic approach to subframe logics. Intuitionistic case.",
            "O-minimal Lambdam-regular stratification.",
            "More on lower bounds for partitioning alpha-large sets.",
            "Coherence in SMCCS and equivalences on derivations in IMLL with unit.",
            "Ind- and pro- definable sets.",
            "The intuitionistic fragment of computability logic at the propositional level.",
            "Bounded fixed-parameter tractability and reducibility.",
            "A generalization of Whitehead's problem and its independence.",
            "Quadratic forms in models of IDelta0+Omega1. I.",
            "A posteriori convergence in complete Boolean algebras with the sequential topology.",
            "On the Turing degrees of minimal index sets.",
            "Certain very large cardinals are not created in small forcing extensions.",
            "Increasing the groupwise density number by c.c.c. forcing.",
            "The hyper-weak distributive law and a related game in Boolean algebras.",
            "'bottom'N as an abstract elementary class.",
            "Elimination of unbounded quantifiers for some poly-regular groups of infinite rank.",
            "Sufficient conditions for cut elimination with complexity analysis.",
            "Local saturation of the non-stationary ideal over Pklambda.",
            "Thorn independence in the field of real numbers with a small multiplicative group.",
            "On Feferman's operational set theory OST.",
            "Formal systems of fuzzy logic and their fragments.",
            "Some elements of Lie-differential algebra and a uniform companion for large Lie-differential fields."
        ]
    },
    {
        "name": "APAL",
        "year": "2006",
        "info": "2006: Volumes\n137, 138, 139, 140, 141, 142, 143, 144",
        "count": 125,
        "papers": [
            "Preface.",
            "Aspects of general topology in constructive set theory.",
            "Pretopologies and a uniform presentation of sup-lattices, quantales and frames.",
            "A globalisation of the Gelfand duality theorem.",
            "Completions, comonoids, and topological spaces.",
            "On the collection of points of a formal space.",
            "Compactly generated Hausdorff locales.",
            "Heyting-valued interpretations for Constructive Set Theory.",
            "Programming interfaces and basic topology.",
            "Complemented sublocales and open maps.",
            "Structures algébriques dynamiques, espaces topologiques sans points et programme de Hilbert.",
            "Maximal and partial points in formal spaces.",
            "Regular universes and formal spaces.",
            "Formal Zariski topology: Positivity and points.",
            "The constructive maximal point space and partial metrizability.",
            "Constructive algebraic integration theory.",
            "On the parallel between the suplattice and preframe approaches to locale theory.",
            "Compactness in locales and in formal topology.",
            "Finite approximation of measure and integration.",
            "Foreword.",
            "What can be efficiently reduced to the Kolmogorov-random strings?",
            "On partial randomness.",
            "The existence of high nonbounding degrees in the difference hierarchy.",
            "On self-embeddings of computable linear orderings.",
            "Final coalgebras and the Hennessy-Milner property.",
            "Complexity of monodic guarded fragments over linear and real time.",
            "Relating word and tree automata.",
            "Parameterized counting problems.",
            "Kolmogorov-Loveland randomness and stochasticity.",
            "1-Generic splittings of computably enumerable degrees.",
            "Equivalence between Fraïssé's conjecture and Jullien's theorem.",
            "Periodicity based decidable classes in a first order timed logic.",
            "Succinct definitions in the first order theory of graphs.",
            "Simplicity and uncountable categoricity in excellent classes.",
            "Fundamental notions of analysis in subsystems of second-order arithmetic.",
            "Some intuitionistic equivalents of classical principles for degree 2 formulas.",
            "The finite submodel property and omega-categorical expansions of pregeometries.",
            "Imaginaries in real closed valued fields.",
            "On properties of theories which preclude the existence of universal models.",
            "Generality's price: Inescapable deficiencies in machine-learned programs.",
            "The spectrum of elementary embeddings j: V->V.",
            "Preface.",
            "Four and more.",
            "A dual open coloring axiom.",
            "The number of translates of a closed nowhere dense set required to cover a Polish group.",
            "Covering the Baire space by families which are not finitely dominating.",
            "Discrete subspaces of countably tight compacta.",
            "Power function on stationary classes.",
            "External cofinalities and the antichain condition in partial orders.",
            "On the consistency strength of the Milner-Sauer conjecture.",
            "Reflecting pictures in cardinal arithmetic.",
            "The Proper Forcing Axiom, Prikry forcing, and the Singular Cardinals Hypothesis.",
            "More on the revised GCH and the black box.",
            "The cardinals below |[omega1]<omega1|.",
            "Levy and set theory.",
            "Adding clubs with square.",
            "CZF and Second Order Arithmetic.",
            "Remarks on isomorphisms in typed lambda calculi with empty and sum types.",
            "The ibT degrees of computably enumerable sets are not dense.",
            "Effective categoricity of equivalence structures.",
            "Bounding computably enumerable degrees in the Ershov hierarchy.",
            "Strongly uniform bounds from semi-constructive proofs.",
            "Categoricity in abstract elementary classes with no maximal models.",
            "Interpolation and Beth's property in propositional many-valued logics: A semantic investigation.",
            "Elementary canonical formulae: extending Sahlqvist's theorem.",
            "On modal logic of deductive closure.",
            "Coherence for star-autonomous categories.",
            "Typing in reflective combinatory logic.",
            "Quotient topologies in constructive set theory and type theory.",
            "The three dimensions of proofs.",
            "Quasi-apartness and neighbourhood spaces.",
            "Preface.",
            "Decidable properties for monadic abstract state machines.",
            "A nonasymptotic lower time bound for a strictly bounded second-order arithmetic.",
            "Unrecognizability of manifolds.",
            "On complexity of verification of interacting agents' behavior.",
            "Iterated pushdown automata and sequences of rational numbers.",
            "Algorithms and complexity in biological pattern formation problems.",
            "Several notes on the power of Gomory-Chvátal cuts.",
            "Effective bounds for convergence, descriptive complexity, and natural examples of simple and hypersimple sets.",
            "Characterizing the interpretation of set theory in Martin-Löf typetheory.",
            "A generalization of the Second Incompleteness Theorem and some exceptions to it.",
            "Ackermann's substitution method (remixed).",
            "Profinite structures interpretable in fields.",
            "Canonical structure in the universe of set theory: part two.",
            "Square and non-reflection in the context of Pk lambda.",
            "Coding by club-sequences.",
            "On analyzability in the forking topology for simple theories.",
            "Computing interpolants in implicational logics.",
            "Computing coproducts of finitely presented Gödel algebras.",
            "Non-commutative proof construction: A constraint-based approach.",
            "Non-primitive recursive decidability of products of modal logics with expanding domains.",
            "The Skolemization of existential quantifiers in intuitionistic logic.",
            "Classifiable theories without finitary invariants.",
            "A model-theoretic characterisation of clique width.",
            "Satisfaction of existential theories in finitely presented groups and some embedding theorems.",
            "Frege systems for extensible modal logics.",
            "Models of real-valued measurability.",
            "The saturation of club guessing ideals.",
            "Codings of separable compact subsets of the first Baire class.",
            "Preface.",
            "A Theory of Hyperfinite Sets.",
            "The metamathematics of random graphs.",
            "Uncountable categoricity of local abstract elementary classes with amalgamation.",
            "An Aristotelian notion of size.",
            "Van Douwen's diagram for dense sets of rationals.",
            "Some isometry groups of the Urysohn space.",
            "Random generations of the countable random graph.",
            "A lemma for cost attained.",
            "Independence in finitary abstract elementary classes.",
            "Cardinal invariants related to permutation groups.",
            "Ramsey classes of topological and metric spaces.",
            "Products of sequential CLP-compact spaces are CLP-compact.",
            "In honor of James E. Baumgartner's sixtieth birthday.",
            "More on Wadge determinacy.",
            "The least strongly compact can be the least strong and indestructible.",
            "Cardinal invariants of the continuum and combinatorics on uncountable cardinals.",
            "Uncountable superperfect forcing and minimality.",
            "Diamond (on the regulars) can fail at any strongly unfoldable cardinal.",
            "Cardinal sequences.",
            "Compact spaces, elementary submodels, and the countable chain condition.",
            "Partition relations on a plain product order type.",
            "On the Hamkins approximation property.",
            "Borel separability of the coanalytic Ramsey sets.",
            "Variable declarations in natural deduction."
        ]
    },
    {
        "name": "APAL",
        "year": "2005",
        "info": "2005: Volumes\n131, 132, 133, 134, 135, 136",
        "count": 75,
        "papers": [
            "Softness of hypercoherences and MALL full completeness.",
            "A Sahlqvist theorem for distributive modal logic.",
            "Faith & falsity.",
            "Dynamic topological logic.",
            "The minimal e-degree problem in fragments of Peano arithmetic.",
            "Coherent phase spaces. Semiclassical semantics.",
            "n-Simple theories.",
            "Logical aspects of Cayley-graphs: the group case.",
            "Completeness of S4 with respect to the real line: revisited.",
            "The logic of proofs, semantically.",
            "Lattice-ordered reduced special groups.",
            "Equivalents of the (Weak) Fan Theorem.",
            "Pseudo-exponentiation on algebraically closed fields of characteristic zero.",
            "Dependence relations in computably rigid computable vector spaces.",
            "Some results on extensionality in lambda calculus.",
            "Analytic Zariski structures and the Hrushovski construction.",
            "Completely mitotic c.e. degrees and non-jump inversion.",
            "Independence results around constructive ZF.",
            "A Banach-Mazur computable but not Markov computable function on the computable real numbers.",
            "Weak elimination of imaginaries for Boolean algebras.",
            "Forcing indestructibility of MAD families.",
            "Stability in geometric theories.",
            "Preface.",
            "A game semantics for generic polymorphism.",
            "Continuous normalization for the lambda-calculus and Gödel's.",
            "About cut elimination for logics of common knowledge.",
            "Zero, successor and equality in BDDs.",
            "Uniform Heyting arithmetic.",
            "Abstract State Machines: a unifying view of models of computation and of system design frameworks.",
            "Algebraically complete semirings and Greibach normal form.",
            "Non-strictly positive fixed points for classical natural deduction.",
            "A proof of topological completeness for S4 in (0, 1).",
            "Control structures in programs and computational complexity.",
            "Elementary arithmetic.",
            "Axioms for strict and lazy functional programs.",
            "Automated search for Gödel's proofs.",
            "WoLLIC'2002.",
            "Comparing and implementing calculi of explicit substitutions with eta-reduction.",
            "Undefinability results in o-minimal expansions of the real numbers.",
            "On sparseness, reducibilities, and complexity.",
            "Safe beliefs for propositional theories.",
            "Finite information logic.",
            "Inductive types and exact completion.",
            "Linear realizability and full completeness for typed lambda-calculi.",
            "Subgroups of the additive group of a separably closed field.",
            "Polarized and focalized linear and classical proofs.",
            "Free abelian lattice-ordered groups.",
            "Explicit mathematics: power types and overloading.",
            "A descending chain condition for groups definable in o-minimal structures.",
            "Tableaux for constructive concurrent dynamic logic.",
            "Bounded functional interpretation.",
            "The elementary theory of Dedekind cuts in polynomially bounded structures.",
            "Upper and lower Ramsey bounds in bounded arithmetic.",
            "Two simple sets that are not positively Borel.",
            "A generalization of von Neumann regularity.",
            "Constructive completions of ordered sets, groups and fields.",
            "Alternating automata and temporal logic normal forms.",
            "Geometric axioms for existentially closed Hasse fields.",
            "Preface.",
            "Ideas in the epsilon substitution method for II 1 0-FIX.",
            "Controlling witnesses.",
            "Separation results for the size of constant-depth propositional proofs.",
            "On the limit existence principles in elementary arithmetic and Sigma n 0-consequences of theories.",
            "A term calculus for (co-)recursive definitions on streamlike data structures.",
            "Remarks on applicative theories.",
            "Reflections on reflections in explicit mathematics.",
            "A simple proof of second-order strong normalization with permutative conversions.",
            "Replacement versus collection and related topics in constructive Zermelo-Fraenkel set theory.",
            "Inductive definitions over a predicative arithmetic.",
            "Analytic combinatorics, proof-theoretic ordinals, and phase transitions for independence results.",
            "Enumerations in computable structure theory.",
            "Structures interpretable in models of bounded arithmetic.",
            "First-order definitions of rational functions and s-integers over holomorphy rings of algebraic functions of characteristic 0.",
            "k-bounded exponential-logarithmic power series fields.",
            "Completing pseudojump operators."
        ]
    },
    {
        "name": "APAL",
        "year": "2004",
        "info": "2004: Volumes\n125, 126, 127, 128, 129, 130",
        "count": 78,
        "papers": [
            "More existence theorems for recursion categories.",
            "An effective version of Wilkie's theorem of the complement and some effective o-minimality results.",
            "More canonical forms and dense free subsets.",
            "Complementing cappable degrees in the difference hierarchy.",
            "On lhd*-maximality.",
            "Constructing omega-stable structures: model completeness.",
            "Preface.",
            "Editorial.",
            "Tarski's conception of logic.",
            "Tarski, truth and natural languages.",
            "The indefinability of truth in the \"Wahrheitsbegriff\".",
            "Reexamination of Tarski's semantics.",
            "Truth and definite truth.",
            "Tarski's definition and truth-makers.",
            "Tarski's theory of definability: common themes in descriptive set theory, recursive function theory, classical pure logic, and finite-universe logic.",
            "What languages have Tarski truth definitions?",
            "Undefinability of truth and nonstandard models.",
            "The incompleteness theorems after 70 years.",
            "Computational inductive definability.",
            "What is the world of mathematics?",
            "Algorithmic uses of the Feferman-Vaught Theorem.",
            "On the tension between Tarski's nominalism and his model theory (definitions for a mathematical model of knowledge).",
            "Applying, extending, and specializing pseudorecursiveness.",
            "Preservation theorems and restricted consistency statements in bounded arithmetic.",
            "On Tarski's contribution to the additive measure theory and its consequences.",
            "Free Boolean algebras and nowhere dense ultrafilters.",
            "On hereditarily indecomposable Banach spaces.",
            "Set theoretical aspects of the Banach space Linfinitf/c0.",
            "Decidability without mathematics.",
            "Independence-friendly logic and axiomatic set theory.",
            "The spectrum of maximal independent subsets of a Boolean algebra.",
            "Dynamic extensions of arrow logic.",
            "Fregean logics.",
            "Boolean algebras arising from information systems.",
            "Unification, finite duality and projectivity in varieties of Heyting algebras.",
            "Finite, integral, and finite-dimensional relation algebras: a brief history.",
            "Minimum bases for equational theories of groups and rings: the work of Alfred Tarski and Thomas Green.",
            "Intuitionistic logic and modality via topology.",
            "First-order intensional logic.",
            "Ternary relations and relevant semantics.",
            "Computational complexity of the semantics of some natural language constructions.",
            "Between Galois connections and (some metamathematical) solutions of equations fgf=f and gfg=g.",
            "Foundations for the formalization of metamathematics and axiomatizations of consequence theories.",
            "Lesniewski's early Liar, Tarski and natural language.",
            "On the Warsaw interactions of logic and mathematics in the years 1919-1939.",
            "Gödel on Tarski.",
            "Philosophical reflection on mathematics in Poland in the interwar period.",
            "Aletheia in Greek thought until Aristotle.",
            "Supercomplete extenders and type 1 mice: Part I.",
            "Simple stable homogeneous expansions of Hilbert spaces.",
            "Provability algebras and proof-theoretic ordinals, I.",
            "On monadic MV-algebras.",
            "Effective completeness theorems for modal logic.",
            "An intensional fixed point theory over first order arithmetic.",
            "Shrinking games and local formulas.",
            "The guarded fragment with transitive guards.",
            "Concept lattices and order in fuzzy logic.",
            "Erratum to \"Applying, extending, and specializing pseudorecursiveness\": [Ann. Pure Appl. Logic 126 (2004) 225-254].",
            "Dual weak pigeonhole principle, Boolean complexity, and derandomization.",
            "Proof theory for theories of ordinals II: Pi3-reflection.",
            "Krivine's intuitionistic proof of classical completeness (for countable languages).",
            "The combinatorics of splittability.",
            "An existential locality theorem.",
            "Internality and interpretable automorphism groups in simple theories.",
            "The Kolmogorov complexity of random reals.",
            "The theory of modules of separably closed fields 2.",
            "Canonical structure in the universe of set theory: part one.",
            "Saturated models of intuitionistic theories.",
            "Foreword.",
            "The complexity of first-order and monadic second-order logic revisited.",
            "Deciding confluence of certain term rewriting systems in polynomial time.",
            "Expressive equivalence of least and inflationary fixed-point logic.",
            "Polarized games.",
            "An approach to deciding the observational equivalence of Algol-like languages.",
            "Modal and guarded characterisation theorems over finite transition systems.",
            "Computational adequacy for recursive types in models of intuitionistic set theory.",
            "The proof complexity of linear algebra.",
            "On the lambdaY calculus."
        ]
    },
    {
        "name": "APAL",
        "year": "2003",
        "info": "2003: Volumes\n119, 120, 121, 122, 123, 124",
        "count": 55,
        "papers": [
            "On gaps under GCH type assumptions.",
            "Thue trees.",
            "Apartness spaces as a framework for constructive topology.",
            "Delta20 - categoricity in Boolean algebras and linear orderings.",
            "P-points in Qmax models.",
            "Universes over Frege structures.",
            "Church-Rosser property of a simple reduction for full first-order classical natural deduction.",
            "Split BN-pairs of finite Morley rank.",
            "Combinatorial principle in nonstandard analysis.",
            "Summable gaps.",
            "The additive mutilboxes.",
            "Generic pairs of SU-rank 1 structures.",
            "The complexity of predicate default logic over a countable domain.",
            "Realization of constructive set theory into explicit mathematics: a lower bound for impredicative Mahlo universe.",
            "Ordinal notations and well-orderings in bounded arithmetic.",
            "Changing cofinalities and collapsing cardinals in models of set theory.",
            "Superrigidity and countable Borel equivalence relations.",
            "Karp complexity and classes with the independence property.",
            "Proof mining in L1-approximation.",
            "On the expressiveness of choice quantification.",
            "Partition relations for kappa-normal ideals on Pkappa(lambda).",
            "Coset-minimal groups.",
            "Analytic colorings.",
            "Epsilon substitution method for ID1(Pi10 or Sigma10).",
            "Turing degrees of hypersimple relations on computable structures.",
            "Simple generic structures.",
            "First-order theories of subgroups of divisible Hahn products.",
            "Erratum to \"Zero-one laws for modal logic\" [Ann. Pure Appl. Logic 69 (1994) 157-193].",
            "Erratum to \"Saturated models of universal theories\": [Ann. Pure Appl. Logic 118 (2002) 219-234].",
            "Proof theory for theories of ordinals - I: recursively Mahlo ordinals.",
            "True cofinality and bounding number for small products of partial orders.",
            "System ST toward a type system for extraction and proofs of programs.",
            "G-dinaturality.",
            "CM-triviality and relational structures.",
            "The proof-theoretic analysis of Sigma11 transfinite dependent choice.",
            "Lovely pairs of models.",
            "On non-abelian C-minimal groups.",
            "On nonelementarily equivalent pairs of fields.",
            "Introduction to computability logic.",
            "Almost free groups and long Ehrenfeucht-Fraïssé games.",
            "A proof-theoretic investigation of a logic of positions.",
            "Equivalence between Wadge and Lipschitz determinacy.",
            "Homomorphisms and quotients of degree structures.",
            "Observational ultraproducts of polynomial coalgebras.",
            "Erratum to \"Ordinal notations and well-orderings in bounded arithmetic\" [Annals of Pure and Applied Logic 120 (2003) 197-223].",
            "Induction-recursion and initial algebras.",
            "Using the prover ANDP to simplify orthogonality.",
            "Inductively generated formal topologies.",
            "Local coherence.",
            "A blend of methods of recursion theory and topology.",
            "Independence of Boolean algebras and forcing.",
            "A second-order system for polytime reasoning based on Grädel's theorem.",
            "SH plus CH does not imply stationary antichains.",
            "Intuitionistic axiomatizations for bounded extension Kripke models.",
            "Repairing the interpolation theorem in quantified modal logic."
        ]
    },
    {
        "name": "APAL",
        "year": "2002",
        "info": "2002: Volumes\n114, 115, 116, 117, 118",
        "count": 42,
        "papers": [
            "Preface.",
            "Refined program extraction form classical proofs.",
            "Logical problems of functional interpretations.",
            "Proof theory in the abstract.",
            "Extending the system T0 of explicit mathematics: the limit and Mahlo axioms.",
            "On uniform weak König's lemma.",
            "Intrinsic reasoning about functional programs I: first order theories.",
            "Type theories, toposes and constructive set theory: predicative aspects of AST.",
            "Analyzing realizability by Troelstra's methods.",
            "Substitutions of Sigma10 - sentences: explorations between intuitionistic propositional logic and intuitionistic arithmetic.",
            "On second-order generalized quantifiers and finite structures.",
            "Inaccessible set axions may have little consistency strength.",
            "Degree spectra and computable dimensions in algebraic structures.",
            "Mekler's construction preserves CM-triviality.",
            "Inherently nonfinitely based lattices.",
            "Abstract complexity theory and the Delta 20 degrees.",
            "Degree spectra of relations on structures of finite computable dimension.",
            "Pi10 classes and orderable groups.",
            "Blowing up power of a lingual cardinal - wider gaps.",
            "Algebraic properties of rings of generalized power series.",
            "Inner models in the region of a Woodin limit of Woodin cardinals.",
            "chi0- categorical structures with a predimension.",
            "More exact completions that are toposes.",
            "The core model for almost linear iterations.",
            "Classes bounded by incomplete sets.",
            "The sequentially realizable functionals.",
            "Skew confluence and the lambda calculus with letrec.",
            "Automata techniques for query inference machines.",
            "A contrast to the low basis theorem.",
            "Nonisolated degrees and the jump operator.",
            "Partition subalgebras for maximal almost disjoint families.",
            "The logic of tasks.",
            "Automorphism groups of differentially closed fields.",
            "Orbits of computably enumerable sets: low sets can avoid an upper cone.",
            "Some conservation results on week König's lemma.",
            "Relative and modified relative realizability.",
            "Axiomatizing the monodic fragment of first-order temporal logic.",
            "Almost free groups and Ehrenfeucht-Fraïssé games for successors of singular cardinals.",
            "A model-theoretic characterization of the weak pigeonhold principle.",
            "The complexity of subdifferentiation and its inverse on convex functions in Banach spaces.",
            "Saturated models of universal theories.",
            "There is no recursive link between the k-size of a model and its cardinality."
        ]
    },
    {
        "name": "APAL",
        "year": "2001",
        "info": "2001: Volumes\n107, 108, 109, 110, 111, 112, 113",
        "count": 86,
        "papers": [
            "Subtle cardinals and linear orderings.",
            "Interpreting N in the computably enumerable weak truth talble degrees.",
            "Model completion of Lie differential fields.",
            "Intersection theory for 0-minimal manifolds.",
            "Normalization without reducibility.",
            "Focussing and proof construction.",
            "Z-modules and ful completeness of multiplicative linear logic.",
            "Some orbits for E.",
            "Reflection of elementary embedding axioms on the L[V Lambda+1] hierarchy.",
            "Generic absoluteness.",
            "Some remarks on Schanuel's conjecture.",
            "Elementary patterns of resemblance.",
            "Strictly orthogonal left linear rewrite systems and primitive recursion.",
            "Modules in the category of sheaves over quantales.",
            "On subvarieties of symmetric closure algebras.",
            "A general theory of confluent rewriting systems for logic programming and its applications.",
            "Basis problem for turbulent actions I: Tsirelson submeasures.",
            "Conservative translations.",
            "Varieties of quasi-Stone algebras.",
            "Normal forms for connectedness in categories.",
            "On free annotated algebras.",
            "Uniqueness of the implication for totally ordered MV-algebras.",
            "Decidable and undecidable prime theories in infinite-valued logic.",
            "An Omitting Types Theorem for positive bounded formulas in normed spaces.",
            "Sandwiches of ages.",
            "Linear Heyting algebras with a quantifier.",
            "On the expressibility and the computability of untyped queries.",
            "Petr Vopenka (* 16.5.1935).",
            "Realism, nonstandard set theory, and large cardinals.",
            "On the computational content of intuitionistic propositional proofs.",
            "A note on the notion of truth in fuzzy logic.",
            "Three clouds may cover the plane.",
            "Needed reals and recursion in generic reals.",
            "Terminal notions in set theory.",
            "Fallen cardinals.",
            "The name for Kojman-shelah collapsing function.",
            "Universes in explicit mathematics.",
            "Fixed points and unfounded chains.",
            "Bounded forcing axioms and the continuum.",
            "On phase semantics and denotational semantics: the exponentials.",
            "Abelian C-minimal groups.",
            "Forcing closed unbounded subsets of Omega2.",
            "On the weak Freese-Nation property of complete Boolean algebras.",
            "The strength of Mac Lane set theory.",
            "Preface.",
            "The topological complexity of a natural class of norms on Banach spaces.",
            "delta-homomorphisms from the Borel delta-algebra into the Loeb delta-algebra.",
            "The generic filter property in nonstandard analysis.",
            "Finite high-order games and an inductive approach towards Gowers's dichotomy.",
            "Logarithmic-exponential series.",
            "Neocompact quantifier elimination in structures based on Banach spaces.",
            "Topics in invariant descriptive set theory.",
            "Trees, fundamental groups and homology groups.",
            "Dynamical method in algebra: effective Nullstellensätze.",
            "Back-and-forth systems for generic curves and a decision algorithm for the limit theory.",
            "A necessary and sufficient condition for embedding principally decomposable finite lattices into the computable enumerable degrees preserving greatest element.",
            "Solovay's theorem cannot be simplified.",
            "The Manin-Mumford conjecture and the model theory of difference fields.",
            "Addendum to \"Choiceless Polynomial Time\": Ann. Pure Appl. Logic 100 (1999) 141-187.",
            "Boolean products of real closed valuation rings and fields.",
            "Embedding of N5 and the contiguous degrees.",
            "Some model-theoretic results in the algebrais theory of quadratic forms.",
            "Relation algebras form cylindric algebras, I.",
            "Relation algebras form cylindric algebras, II.",
            "Preface.",
            "Complexity of t-tautologies.",
            "A first order logic for specification of timed algorithms: basic properties and a decidable class.",
            "The set of the true regular protothetics formulas with partially ordered quantifiers is NEXPTIME-complete.",
            "Window-accumulated subsequence matching problem is linear.",
            "MAX SAT approximation beyond the limits of polynomial-time approximation.",
            "Towards logical operations research - propositional case.",
            "Finite methods in 1-order formalisms.",
            "Complexity of Null-and Positivstellensatz proofs.",
            "A (nother) characterization of intuitionistic propositional logic.",
            "Computational complexity of quantifier-free negationless theory of field of rational numbers.",
            "The single-conclusion proof logic and inference rules specification.",
            "On calculational proofs.",
            "Interpolation theorems for intuitionistic predicate logic.",
            "Arithmetic complexity of the predicate logics of certain complete arithmetic theories.",
            "On a finitary version of mathematical analysis.",
            "Coercion completion and conservativity in coercive subtyping.",
            "A general condition for collapse results.",
            "The Woods-Erdös conjecture for polynomial rings.",
            "Logic of proofs and provability.",
            "Provability logics with quantifiers on proofs.",
            "Dual realizability in symmetric logic."
        ]
    },
    {
        "name": "APAL",
        "year": "2000",
        "info": "2000: Volumes\n101, 102, 103, 104, 105, 106",
        "count": 56,
        "papers": [
            "Definable Homomorphisms of Abelian Groups in oMminimal Structures.",
            "Non-Commutative Logic I: The Multiplicative Fragment.",
            "On N0-Categorical Weakly o-Minimal Structures.",
            "Linear Independence without Choice.",
            "The Lottery Preparation.",
            "Inner Model Operators in L(R).",
            "On o-Amorphous Sets.",
            "Relation Algebras with n-Dimensional Relational Bases.",
            "A Necessary and Sufficient Condition for Embedding Principally Decomposable Finite Lattices into the Computably Enumerable Degrees.",
            "Simplifying von Plato's Axiomatization of Constructive Apartness Geometry.",
            "Classification Theory through Stationary Logic.",
            "Linearization of Definable Order Relations.",
            "Smooth Categories and Global square.",
            "Changing the Heights of Automorphism Towers.",
            "Structure Theorems for o-Minimal Expansions of Groups.",
            "Best Solving Modal Equations.",
            "A Global Version of a Theorem of Ben-David and Magidor.",
            "Things That Can and Things That Cannot Be Done in PRA.",
            "On Phase Semantics and Denotational Semantics in Multiplicative-Additive Linear Logic.",
            "Erratum to \"Definitional Equivalence and Algebraizability of Generalized Logical Systems\".",
            "More on Cardinal Invariants of Boolean Algebras.",
            "Density Zero Slaloms.",
            "The Elementary Theory of e-free PAC Domains.",
            "Scattered Toposes.",
            "Projective Uniformization Revisited.",
            "A Bounded Arithmetic AID for Frege Systems.",
            "Strong Splitting in Stable Homogeneous Models.",
            "Covering a Function on the Plane by Two Continuous Functions on an Uncountable Square - the Consistency.",
            "Preface.",
            "Relative efficency of propositional proof systems: resolution vs. cut-free LK.",
            "Higher type recursion, ramification and polynomial time.",
            "Functional interpretation of Aczel's constructive set theory.",
            "The unfolding of non-finitist arithmetic.",
            "Doing logic b computer: interpolation in fragments ofinstuitionistic propositional logic.",
            "Safe recursion with higher types and BCK-algebra.",
            "Reduction of finite and infinite derivations.",
            "Wellfounded trees in categories.",
            "Deciding the E+ - class by an a posteriori, liftable order.",
            "Axioms and (counter) examples in synthetic domain theory.",
            "Multifunction algebras and the provability of PH.",
            "The non-constructive mu operator, fixed point theories with ordinals, and the bar rule.",
            "Interactive and probabilistic proof-checking.",
            "On well-generated Boolean algebras.",
            "Knowledge, machines, and the consistency of Reinhardt's strong mechanistic thesis.",
            "Intuitionistic logic and implicit definability.",
            "Elementary equivalence of infinite-dimensional classical groups.",
            "The wholeness axiom and Laver sequences.",
            "Essentially periodic ordered groups.",
            "Undecidability and 1-types in intervals of the computably enumerable degrees.",
            "Ranks and pregeometries in finite diagrams.",
            "Decidable fragment of first-order temporal logics.",
            "Martin's Maximum and the Pmaxaxiom(*).",
            "Unraveling Pi11.",
            "Changing cardinal characteristics without changing Omega-sequences or cofinalities.",
            "The definable multiplicity property and generic automorphisms.",
            "Notions of symmetry n set theory with classes."
        ]
    },
    {
        "name": "APAL",
        "year": "1999",
        "info": "1999: Volumes\n96, 97, 98, 99, 100, 101",
        "count": 62,
        "papers": [
            "Belief Revision Conditionals: Basic Iterated Systems.",
            "Modality, Bisimulation and Interpolation in Infinitary Logic.",
            "Bounded Arithmetic, Proof Complexity and Two Papers of Parikh.",
            "Turning Cycles into Spirals.",
            "Behaviorism and Belief.",
            "Common Knowledge Revisited.",
            "A Simple Propositional S5 Tableau System.",
            "Self-Reference and the Acyclicity of Rational Choice.",
            "To Preference via Entrenchment.",
            "Ten Questions and One Problem on Fuzzy Logic.",
            "Computation Paths Logic: An Expressive, yet Elementary, Process Logic.",
            "Dynamic Linear Time Temporal Logic.",
            "Ramified Recurrence and Computational Complexity III: Higher Type Recurrence and Elementary Complexity.",
            "Logic Programs, Well-Orderings, and Forward Chaining.",
            "Coalgebraic Logic.",
            "Chu Spaces from the Representational Viewpoint.",
            "A Note on Applicability of the Incompleteness Theorem to Human Mind.",
            "View-Based Explicit Knowledge.",
            "Toward Categoricity for Classes with no Maximal Models.",
            "On Pi-Conversion in the lambda-Cube and the Combination with Abbreviations.",
            "On Distinguishing Quotients of Symmetric Groups.",
            "Extended Order-Generic Queries.",
            "Cut Normal Forms and Proof Complexity.",
            "Ordinals and Ordinal Functions Representable in the Simply Typed lambda Calculus.",
            "Hierarchies of Measure-Theoretic Ultrafilters.",
            "Bar Induction and omega Model Reflection.",
            "Succinctness as a Source of Complexity in Logical Formalisms.",
            "Definitional Equivalence and Algebraizability of Generalized Logical Systems.",
            "The Number of Types in Simple Theories.",
            "Recursive and Nonextendible Functions over the Reals; Filter Foundation for Recursive Analysis, II.",
            "Typability and Type Checking in System F are Equivalent and Undecidable.",
            "Distinguishing Three Strong Saturation Properties in Nonstandard Analysis.",
            "Some Purely Topological Models for Intuitionistic Analysis.",
            "Canonical Models for N1-Combinatorics.",
            "Categoricity for Abstract Classes with Amalgamation.",
            "Addendum to \"Computably Enumerable Sets and Quasi-Reducibility\".",
            "Erratum to \"Computable Isomorphisms, Degree Spectra of Relations, and Scott Families\".",
            "Saturation and Stability in the Theory of Computation over the Reals.",
            "Analytic Ideals and Their Applications.",
            "Momega Considered as a Programming Language.",
            "The Complexity of the Disjunction and Existential Properties in Intuitionistic Logic.",
            "A Cut-Elimination Proof in Intuitionistic Predicate Logic.",
            "A Geometric Consequence of Residual Smallness.",
            "Analytic Ideals and Cofinal Types.",
            "Strongly Determined Types.",
            "A Boolean Model of Ultrafilters.",
            "Erratum to \"Coalgebraic Logic\": Ann. pure appl. logic 96 (1999) 277-317.",
            "Duplication of Directed Graphs and Exponential Blow Up of Proofs.",
            "Trees and Ehrenfeucht-Fraïssé Games.",
            "Lattices of Modal Logics and Their Groups of Automorphisms.",
            "Choiceless Polynomial Time.",
            "Structure and Definability in General Bounded Arithmetic Theories.",
            "Strong Stability and the Incompleteness of Stable Models for lambda-Calculus.",
            "Definable Homomorphisms of Abelian Groups in oMminimal Structures.",
            "Non-Commutative Logic I: The Multiplicative Fragment.",
            "On N0-Categorical Weakly o-Minimal Structures.",
            "Linear Independence without Choice.",
            "The Lottery Preparation.",
            "Inner Model Operators in L(R).",
            "On o-Amorphous Sets.",
            "Relation Algebras with n-Dimensional Relational Bases.",
            "A Necessary and Sufficient Condition for Embedding Principally Decomposable Finite Lattices into the Computably Enumerable Degrees."
        ]
    },
    {
        "name": "APAL",
        "year": "1998",
        "info": "1998: Volumes\n91, 92, 93, 94, 95",
        "count": 52,
        "papers": [
            "Randomness, Computability, and Algebraic Specifications.",
            "A Semantical Storage Operator Theorem for All Types.",
            "Classifying Toposes for First-Order Theories.",
            "Relecture constructive de la théorie d'Artin-Schreier.",
            "Notions of Density That Imply Representability in Algebraic Logic.",
            "Destruction or Preservation as You Like It.",
            "Typing Untyped lambda-Terms, or Reducibility Strikes Again!",
            "Predicative Functionals and an Interpretation of ID<omega.",
            "Monadic Second-Order Logic, Graph Coverings and Unfoldings of Transition Systems.",
            "Borel Equivalence Relations Induced by Actions of the Symmetric Group.",
            "Well-Ordering, Proofs for Martin-Löf Type Theory.",
            "Is There a Set of Reals Not in K(R)?",
            "Addendum and Corrigendum: Choice Principles in Hyperuniverses.",
            "Erratum to \"Arity and Alternation in Second-Order Logic\".",
            "In Conjunction with Qualitative Probability.",
            "On the Relation between Elementary Partial Difference Equations and Partial Differential Equations.",
            "Exact Upper Bounds and Their Uses in Set Theory.",
            "Complexity of Reals in Inner Models of Set Theory.",
            "Preface.",
            "Index Sets for Pi01 Classes.",
            "Difference Sets and Computability Theory.",
            "On the Finiteness of the Recursive Chromatic Number.",
            "Sigma2-Constructions and I Sigma1.",
            "Turing Degrees of Certain Isomorphic Images of Computable Relations.",
            "Decidable Kripke Models of Intuitionistic Theories.",
            "Point-Free Topological Spaces, Functions and Recursive Points: Filter Foundation for Recursive Analysis I.",
            "Computable Isomorphisms, Degree Spectra of Relations, and Scott Families.",
            "On the Computability of Fractal Dimensions and Hausdorff Measure.",
            "Approximation Methods in Inductive Inference.",
            "What's the Difference?",
            "Applications of Cut-Free Infinitary Derivations to Generalized Recursion Theory.",
            "Feasible Graphs with Standard Universe.",
            "The Dense Simple Sets are Orbit Complete with Respect to the Simple Sets.",
            "Splitting Theorems and the Jump Operator.",
            "Lattice Representations for Computability Theory.",
            "Decidable Boolean Algebras of Low Level.",
            "Definable Properties of the Computably Enumerable Sets.",
            "Coding a Family of Sets.",
            "A Necessary and Sufficient Condition for Embedding Ranked Finite Partial Lattices into the Computably Enumerable Degrees.",
            "Inaccessibility in Constructive Set Theory and Type Theory.",
            "Finite Notations for Infinite Terms.",
            "Weak Presentations of Non-Finitely Generated Fields.",
            "Extending Partial Orders to Dense Linear Orders.",
            "Sets of Generators and Automorphism Bases for the Enumeration Degrees.",
            "Learning via Queries and Oracles.",
            "Computably Enumerable Sets and Quasi-Reducibility.",
            "Dynamic Notions of Genericity and Array Noncomputability.",
            "Generic Structures and Simple Theories.",
            "Some Results on Cut-Elimination, Provable Well-Orderings, Induction, and Reflection.",
            "A General Model Completeness Result for Expansions of the Real Ordered Field.",
            "A Common Axiom Set for Classical and Intuitionistic Plane Geometry.",
            "On the Arithmetical Content of Restricted Forms of Comprehension, Choice and General Uniform Boundedness."
        ]
    },
    {
        "name": "APAL",
        "year": "1997",
        "info": "1997: Volumes\n82, 83, 84, 85, 86, 87, 88, 89, 90",
        "count": 93,
        "papers": [
            "Sparse Parameterized Problems.",
            "A Non-Splitting Theorem for d.r.e. Sets.",
            "In the Random Graph G(n, p), p = n-a: If psi Has Probability O(n-epsilon) for Every epsilon>0 Then it Has Probability O(e-nepsilon) for Some epsilon>0.",
            "Arity Hierarchies.",
            "Formalizing Forcing Arguments in Subsystems of Second-Order Arithmetic.",
            "Systems of Explicit Mathematics with Non-Constructive µ-Operator and Join.",
            "Borel Equivalence Relations and Classifications of Countable Models.",
            "Indiscernible Sequences for Extenders, and the Singular Cardinal Hypothesis.",
            "Cupping and Noncupping in the Enumeration Degrees of Sigma20 Sets.",
            "Strongly Minimal Fusions of Vector Spaces.",
            "On the Proof Theory of Coquand's Calculus of Constructions.",
            "How to Win Some Simple Iteration Games.",
            "Strong Cardinals in the Core Model.",
            "Term Rewriting Theory for the Primitive Recursive Functions.",
            "Domain Representability of Metric Spaces.",
            "Interpolants, Cut Elimination and Flow Graphs for the Propositional Calculus.",
            "An Alternative Linear Semantics for Allowed Logic Programs.",
            "Contraction-Elimination for Implicational Logics.",
            "The Self-Embedding Theorem of WKL0 and a Non-Standard Method.",
            "Characterizing Language Identification in Terms of Computable Numberings.",
            "Syntactic Characterizations of Closure Under Pullbacks and of Locally Polypresentable Categories.",
            "Strong Polynomial-Time Reducibility.",
            "Advice Classes of Parameterized Tractability.",
            "Automorphisms in the PTIME-Turing Degrees of Recursive Sets.",
            "Colouring and Non-Productivity of aleph2-C.C.",
            "Equational Theories for Inductive Types.",
            "The Covering Lemma up to a Woodin Cardinal.",
            "Kripke Models and the (In)equational Logic of the Second-Order lambda-Calculus.",
            "Extensional Realizability.",
            "On the Proof-Theoretic Strength of Monotone Induction in Explicit Mathematics.",
            "Can a Small Forcing Create Kurepa Trees.",
            "A Sheaf-Theoretic Foundation for Nonstandard Analysis.",
            "A Constructive Game Semantics for the Language of Linear Logic.",
            "A Non-Generic Real Incompatible with 0#.",
            "Induction Rules, Reflection Principles, and Provably Recursive Functions.",
            "Canonization for Two Variables and Puzzles on the Square.",
            "Constructive Canonicity in Non-Classical Logics.",
            "Non-Axiomatizable Second Order Intuitionistic Propositional Logic.",
            "The Structure of Lattices of Subframe Logics.",
            "Completeness Results for Linear Logic on Petri Nets.",
            "Combinatorics and Forcing with Distributive Ideals.",
            "Quasi-Simple Relations in Copies of a Given Recursive Structure.",
            "Permitting, Forcing, and Copying of a Given Recursive Relation.",
            "Projective Forcing.",
            "Comparing Cubes of Typed and Type Assignment Systems.",
            "Mouse Sets.",
            "Logic Colloquium '95, Haifa, Israel, 9-17 August 1995 - Preface.",
            "Sigma2 Induction and Infinite Injury Priority Arguments, Part II: Tame Sigma2 Coding and the Jump Operator.",
            "Pi0a Classes and Minimal Degrees.",
            "Boolean Pairs Formed by the Delta0n-Sets.",
            "Possible Degrees in Recursive Copies II.",
            "A Finite Lattice without Critical Triple that cannot be Embedded into the Enumerable Turing Degrees.",
            "Semi-Cohen Boolean Algebras.",
            "On the Semantics of the Universal Quantifier.",
            "How to Define a Linear Order on Finite Models.",
            "Isomorphism Property in Nonstandard Extensions of the ZFC Universe.",
            "Model Completions, r-Heyting Categories.",
            "Narrow Coverings of omega-ary Product Spaces.",
            "Joint AILA-KGS Model Theory Meeting, Florence, Italy, 21-24 August 1995 - Preface.",
            "Model Theory of Finite Fields and Pseudo-Finite Fields.",
            "Finite Covers with Finite Kernels.",
            "Simple Theories.",
            "Generic Automorphisms of Fields.",
            "Differential Galois Theory II.",
            "Interpreting Modules in Modules.",
            "Flatness and Smooth Points of p-adic Subanalytic Sets.",
            "Mittag-Leffler Modules.",
            "An Undecidability Theorem for Lattices Over Group Rings.",
            "End Extensions of Models of Linearly Bounded Arithmetic.",
            "Preface - Logic Colloquium '94, 21-30 July 1994, Clermont-Ferrand, France.",
            "Intuitionistic Formal Theories with Realizability in Subrecursive Classes.",
            "On Pascal Triangles Modulo a Prime Power.",
            "Infinitary Definitions of Equivalence Relations in Models of PA.",
            "Theories of Generalized Pascal Triangles.",
            "Ehrenfeucht Games and Ordinal Addition.",
            "Order Types of Free Subsets.",
            "On the Structure of Stable Groups.",
            "Delta1-Definability.",
            "Patterns of Compact Cardinals.",
            "Atom Structures of Cylindric Algebras and Relation Algebras.",
            "Complexity of Equations Valid in Algebras of Relations: Part I: Strong Non-Finitizability.",
            "Complexity of Equations Valid in Algebras of Relations: Part II: Finite Axiomatizations.",
            "On Parallel Hierarchies and Rik.",
            "Erratum to \"What's So Special About Kruskal's Theorem and the Ordinal Gamma0? A Survey of Some Results in Proof Theory\".",
            "Count(q) Does Not Imply Count(p).",
            "Sticks and Clubs.",
            "Implications Between Strong Large Cardinal Axioms.",
            "Sometimes Slow Growing is Fast Growing.",
            "Proof of a Conjecture of S. Mac Lane.",
            "Nonaxiomatisability of Equivalences over Finite State Processes.",
            "Possible Values for 2alephn and 2alephomega.",
            "Partition Numbers.",
            "Deterministic Automata: Simulation, Universality and Minimality."
        ]
    },
    {
        "name": "APAL",
        "year": "1996",
        "info": "1996: Volumes\n77, 78, 79, 80, 81, 82",
        "count": 66,
        "papers": [
            "Pell Equations and Exponentiation in Fragments of Arithmetic.",
            "Choice Principles in Hyperuniverses.",
            "Pi12 Wadge Degrees.",
            "Definable Sets in Generic Complex Tori.",
            "Classifying Totally Categorical Groups (and Others).",
            "Linear Läuchli Semantics.",
            "The Bounded Injury Priority Method and the Learnability of Unions of Rectangles.",
            "Hierarchies in Transitive Closure Logic, Stratified Datalog and Infinitary Logic.",
            "Projecting Sequential Algorithms on Strongly Stable Functions.",
            "WKL0 and Stone's Separation Theorem for Convex Sets.",
            "Presburger Arithmetic and Recognizability of Sets of Natural Numbers by Automata: New Proofs of Cobham's and Semenov's Theorems.",
            "Applications of Cohomology to Set Theory II: Todorcevic Trees.",
            "Preface - Papers in honor of the Symposium on Logical Foundations of Computer Science \"Logic at St. Petersburg\".",
            "Linear Logic for Nets with Bounded Resources.",
            "Interpolating d-r.e. and REA Degrees between r.e. Degrees.",
            "Data Storage Interpretation of Labeled Modal Logic.",
            "Topological Reasoning and the Logic of Knowledge.",
            "Normal Forms for Second-Order Logic over Finite Structures, and Classification of NP Optimization Problems.",
            "Effective Content of the Calculus of Variations I: Semi-Continuity and the Chattering Lemma.",
            "Linear Logic Automata.",
            "Arity and Alternation in Second-Order Logic.",
            "McNaughton Games and Extracting Strategies for Concurrent Programs.",
            "On Recursively Enumerable Structures.",
            "Was Sierpinski Right? III: Can Continuum-cc. Times c.c.c. be Continuum-c.c.?",
            "Stable Generic Structures.",
            "Systems of Explicit Mathematics with Non-Constructive µ-Operator, Part II.",
            "An Extended Lachlan Splitting Theorem.",
            "On Winning Ehrenfeucht Games and Monadic NP.",
            "Rational Separability over a Global Field.",
            "Sigma5-Completeness of Index Sets Arising from the Recursively Enumerable Turing Degrees.",
            "Nonbounding and Slaman Triples.",
            "On Variants of o-Minimality.",
            "A Study of Singular Points and Supports of Measures in Reverse Mathematics.",
            "Polymorphic Extensions of Simple Type Structures - With an Application to Bar Recursive Minimization.",
            "A Note on Full Intuitionistic Linear Logic.",
            "Saturated Filters at Successors of Singulars, Weak Reflection and Yet Another Weak Club Principle.",
            "Polynomial Games and Determinacy.",
            "Blowing Up the Power of a Singular Cardinal.",
            "Partial Orderings with the Weak Freese-Nation Property.",
            "Sigma5-Completeness of Index Sets Arising from the Lattice of Recursively Enumerable Sets.",
            "Determinacy in the Difference Hierarchy of Co-Analytic Sets.",
            "Another Stable Group.",
            "Morasses, Square and Forcing Axioms.",
            "Reducts of Random Hypergraphs.",
            "An Exponential Separation Between the Parity Principle and the Pigeonhole Principle.",
            "Toward Classifying Unstable Theories.",
            "Effective Inseparability in a Topological Setting.",
            "There is No Fat Orbit.",
            "Preface - Special Volume Dedicated to the late Stephen Cole Kleene.",
            "Stephen Cole Kleene - a Reminiscence.",
            "A Classical View of the Intuitionistic Continuum.",
            "Realizing Brouwer's Sequences.",
            "Computation on Abstract Data Types: The Extensional Approach, with an Application to Streams.",
            "Priority Constructions.",
            "On the Lattices of NP-Subspaces of a Polynomial Time Vector Space over a Finite Field.",
            "Effective Forcing versus Proper Forcing.",
            "Some Intuitions Behind Realizability Semantics for Constructive Logic: Tableaux and Läuchli Countermodels.",
            "Sparse Parameterized Problems.",
            "A Non-Splitting Theorem for d.r.e. Sets.",
            "In the Random Graph G(n, p), p = n-a: If psi Has Probability O(n-epsilon) for Every epsilon>0 Then it Has Probability O(e-nepsilon) for Some epsilon>0.",
            "Arity Hierarchies.",
            "Formalizing Forcing Arguments in Subsystems of Second-Order Arithmetic.",
            "Systems of Explicit Mathematics with Non-Constructive µ-Operator and Join.",
            "Borel Equivalence Relations and Classifications of Countable Models.",
            "Indiscernible Sequences for Extenders, and the Singular Cardinal Hypothesis.",
            "Cupping and Noncupping in the Enumeration Degrees of Sigma20 Sets."
        ]
    },
    {
        "name": "APAL",
        "year": "1995",
        "info": "1995: Volumes\n71, 72, 73, 74, 75, 76",
        "count": 60,
        "papers": [
            "Elementary Descent Recursion and Proof Theory.",
            "Separations of Theories in Weak Bounded Arithmetic.",
            "Applications of Cohomology to Set Theory I: Hausdorff Gaps.",
            "A Model and Its Subset: The Uncountable Case.",
            "Descent and Duality.",
            "An Algebraic Theory of Normal Forms.",
            "Power Set Recursion.",
            "Semimorasses and Nonreflection at Singular Cardinals.",
            "Completeness Results for Intuitionistic and Modal Logic in a Categorical Setting.",
            "The Monadic Second-Order Logic of Graphs VIII: Orientations.",
            "Model Theory of Modules Over a Serial Ring.",
            "Filters and Large Cardinals.",
            "The Real Core Model and It Scales.",
            "Regularity Properties for Dominating Projective Sets.",
            "A Tribute to Dirk van Dalen - Preface.",
            "Enumerators of lambda Terms are Reducing Constructively.",
            "A Data Type Variety of Stack Algebras.",
            "A Model for Intuitionistic Non-Standard Arithmetic.",
            "Strong Normalization in Type Systems: A Model Theoretic Approach.",
            "Natural Deduction for Intuitionistic Linear Logic.",
            "A Course on Bimodal Provability Logic.",
            "Combinatorial Properties of Classical Forcing Notions.",
            "Characterizations of Realizable Space Complexities.",
            "The Structure of Amorphous Sets.",
            "Fixed-Parameter Tractability and Completeness IV: On Completeness for W[P] and PSPACE Analogues.",
            "Sequent Reconstruction in LLM - A Sweepline Proof.",
            "A Constructive Approach to Nonstandard Analysis.",
            "On Grzegorczyk Induction.",
            "Generalized Quantifiers and Pebble Games on Finite Structures.",
            "Projectively Well-Ordered Inner Models.",
            "Totality in Applicative Theories.",
            "On Completeness and Cocompleteness in an Around Small Categories.",
            "Combinatorial Principle in the Core Model for one Woodin Cardinal.",
            "Instances of Dependent Choice and the Measurability of alephomega + 1.",
            "Unprovability of Consistency Statements in Fragments of Bounded Arithmetic.",
            "The Consistency Strength of Projective Absoluteness.",
            "Preface: Special Issue of Papers from the Conference on Proof Theory, Provability Logic, and Computation, Berne, Switzerland, 20-24 March 1994.",
            "Generalizing Theorems in Real Closed Fields.",
            "Iterated Local Reflection Versus Iterated Consistency.",
            "Delta0-Complexity of the Relation y = \\prodi <= n F(i).",
            "Proof-Theoretic Analysis of Termination Proofs.",
            "Relating the Bounded Arithmetic and Polynomial Time Hierarchies.",
            "What are the forall Sigmab1-Consequences of T12 and T22?",
            "Understanding Uniformity in Feferman's Explicit Mathematics.",
            "Petri Nets, Horn Programs, Linear Logic and Vector Games.",
            "On NP-Completeness in Linear Logic.",
            "Towards the Computational Complexity of PRomega-Terms.",
            "Models for the Lambek Calculus.",
            "Possible Degrees in Recursive Copies.",
            "Back and Forth Relations for Reduced Abelian p-Groups.",
            "Cardinal Invariants Above the Continuum.",
            "Interpreting True Arithmetic in the Theory of the r.e. Truth Table Degrees.",
            "A Method to Single out Maximal Propositional Logics with the Disjunction Property I.",
            "Large Cardinals and Definable Counterexamples to the Continuum Hypothesis.",
            "A Strong Normalization Result for Classical Logic.",
            "A Method to Single out Maximal Propositional Logics with the Disjunction Property II.",
            "The Axioms of Constructive Geometry.",
            "Observations about Scott and Karp Trees.",
            "Transfinite Induction within Peano Arithmetic.",
            "More on the Cut and Choose Game."
        ]
    },
    {
        "name": "APAL",
        "year": "1994",
        "info": "1994: Volumes\n66, 67, 68, 69, 70",
        "count": 52,
        "papers": [
            "Reverse Mathematics and Ordinal Exponentiation.",
            "On the Weak Distributivity Game.",
            "A Pi12 Singleton Incompatible with 0#.",
            "The Logic of Arithmetical Hierarchy.",
            "Cell Decompositions of C-Minimal Structures.",
            "Hyperarithmetical Relations in Expansions of Recursive Structures.",
            "Combining Type Disciplines.",
            "Extremes in the Degrees of Inferability.",
            "Context-Sensitive Transitive Closure Operators.",
            "A Selection of Papers Presented at the Symposium \"Logic at Tver '92\" - Preface.",
            "Linear Logic with Fixed Resources.",
            "Logic of Proofs.",
            "On Speedable and Levelable Vector Spaces.",
            "Structured Theory Presentations and Logic Representations.",
            "Computing Definite Logic Programs by Partial Instantiation.",
            "Linear Logic as a Logic of Computations.",
            "Recursive Unary Algebras and Trees.",
            "A Context for Belief Revision: Forward Chaining - Normal Nonmonotonic Rule Systems.",
            "A Direct Method for Simulating Partial Recursive Functions by Diophantine Equations.",
            "Inseparability in Recursive Copies.",
            "Classical Logic, Storage Operators and Second-Order lambda-Calculus.",
            "Expansions of the Real Field with Power Functions.",
            "Cardinalities of Topologies with Small Base.",
            "On Bimodal Logics of Provability.",
            "A Rank one Cohesive Set.",
            "Rings of Monoids Elementarily Equivalent to Polynomial Rings.",
            "Proof Theory of Reflection.",
            "The Model Theory of Unitriangular Groups.",
            "Forcing in Nonstandard Analysis.",
            "Diophantine Undecidability in Some Rings of Algebraic Numbers of Totally Real Infinite Extensions of Q.",
            "Dominating Projective Sets in the Baire Space.",
            "Fragments of Martin's axiom and Delta13 Sets of Reals.",
            "Universal Theories Categorical in Power and kappa-Generated Models.",
            "Superstable Quasi-Varieties.",
            "Semantics of Weakening and Contraction.",
            "Essential Kurepa Trees versus Essential Jech-Kunen Trees.",
            "Preface - Invited papers presented at the 1992 IEEE Symposium on Logic in Computer Science.",
            "Third Order Matching is Decidable.",
            "Zero-One Laws for Modal Logic.",
            "The Complexity of Horn Fragments of Linear Logic.",
            "Progress Measures, Immediate Determinacy, and a Subset Construction for Tree Automata.",
            "A Constructive Logic Behind the Catch and Throw Mechanism.",
            "A Simpler proof of Jensen's Coding Theorem.",
            "Equational Derivation vs. Computation.",
            "A Completeness Theorem for Open Maps.",
            "Axiomatizing Higher-Order Kleene Realizability.",
            "The Structure of the Honest Polynomial m-Degrees.",
            "Meager Forking.",
            "On Borel Ideals.",
            "Ramified Systems.",
            "Coherent Sequences versus Radin Sequences.",
            "A Natural Prior Probability Distribution Derived from the Propositional Calculus."
        ]
    },
    {
        "name": "APAL",
        "year": "1993",
        "info": "1993: Volumes\n59, 60, 61, 62, 63, 64",
        "count": 74,
        "papers": [
            "A Delta22 Well-Order of the Reals and Incompactness of L(QMM).",
            "Compactness and Normality in Abstract Logics.",
            "Systems of Combinatory Logic Related to Predicative and 'Mildly Impredicative' Fragments of Quine's 'New Foundations'.",
            "Stability among r.e. Quotient Algebras.",
            "Riesz Representation Theorem, Borel Measures and Subsystems of Second-Order Arithmetic.",
            "Countable Thin Pi01 Classes.",
            "The Intuitionistic Alternative Set Theory.",
            "Intuitionistic Validity in T-Normal Kripke Structures.",
            "Friedberg Splittings of Recursively Enumerable Sets.",
            "On the Unity of Logic.",
            "More on Simple Forcing Notions and Forcings with Ideals.",
            "A Construction of Boolean Algebras from First-Order Structures.",
            "Generic Degrees are Complemented.",
            "A Decision Algorithm for Linear Sentences on a PFM.",
            "The Possible Turing Degree of the Nonzero Member in a Two Element Degree Spectrum.",
            "Degrees of Convex Dependence in Recursively Enumerable Vector Spaces.",
            "Proof-Theoretic Investigations on Kruskal's Theorem.",
            "Total Sets and Objects in Domain Theory.",
            "Fixed Points in Peano Arithmetic with Ordinals.",
            "Weakly Semirecursive Sets and r.e. Orderings.",
            "Linearizing Intuitionistic Implication.",
            "Loeb Extensions and Ultrapowers of Measures on Fragments.",
            "Every Recursive Boolean Algebra is Isomorphic to One with Incomplete Atoms.",
            "Some Effectively Infinite Classes of Enumerations.",
            "Projective Geometries of Algebraically Closed Fields of Characteristic Zero.",
            "Game Sentences and Ultrapowers.",
            "The Joint Embedding Property in Normal Open Induction.",
            "A Contribution to the End-Extension Problem and the Pi1 Conservativeness Problem.",
            "A Sharpened Version of McAloon's Theorem on Initial Segments of Models of I Delta0.",
            "Hilbert's Tenth Problem for Weak Theories of Arithmetic.",
            "On the Provability Logic of Bounded Arithmetic.",
            "The Analytical Completeness of Dzhaparidze's Polymodal Logics.",
            "A Generalized Notion of Weak Interpretability and the Corresponding Modal Logic.",
            "A Note on the Diagonalizable Algebras of PA and ZF.",
            "On Sigma1 and Pi1 Sentences and Degrees of Interpretability.",
            "Lattice Nonembeddings and Intervals of the Recursively Enumerable Degrees.",
            "Zilber's Conjecture for Some o-Minimal Structures over the Reals.",
            "On the Elimination of Imaginaries from Certain Valued Fields.",
            "Cut Elimination for the Unified Logic.",
            "Preface: A selection of papers presented at the Logic Colloquium '89.",
            "Rudimentary Kripke Models for the Intuitionistic Propositional Calculus.",
            "Periodic Points and Subsystems of Second-Order Arithmetic.",
            "A Normal Form for Logical Derivations Implying One for Arithmetic Derivations.",
            "Preface: A Selection of Papers Presented at the \"Stability in Model Theory III\" Conference.",
            "On the Automorphism Groups of Finite Covers.",
            "An Omitting Types Theorem for Saturated Structures.",
            "Triviality, NDOP and Stable Varieties.",
            "A New Strongly Minimal Set.",
            "On the Undecidability of Some Classes of Abelian-by-Finite Groups.",
            "Unidimensional Modules: Uniqueness of Maximal Non-Modular Submodels.",
            "Remarks on Elementary Duality.",
            "Infima in the d.r.e. Degrees.",
            "Gurevich-Harrington's Games Defined by Finite Automata.",
            "Preface: A Selection of Papers Presented at the 9th International Conference of Logic, Methodology and Philosophy of Science.",
            "Undecidability and 1-Types in the Recursively Enumerable Degrees.",
            "Incomparable Prime Ideals of Recursively Enumerable Degrees.",
            "On p-Reducibility of Numerations.",
            "On Relative Randomness.",
            "Maximal Kripke-Type Semantics for Modal and Superintuitionistic Predicate Logics.",
            "Functional Interpretations of Feasibly Constructive Arithmetic.",
            "Peano Arithmetic as Axiomatization of the Time Frame in Logics of Programs and in Dynamic Logics.",
            "On Measurable Cardinals Violating the Continuum Hypothesis.",
            "Recursive Properties of Relations on Models.",
            "Borel Partitions of Infinite Subtrees of a Perfect Tree.",
            "Infinitesimal Approach of Almost-Automorphic Functions.",
            "The Provability Logic for sigma1-Interpolability.",
            "Effective Moduli from Ineffective Uniqueness Proofs. An Unwinding of de La Vallée Poussin's Proof for Chebycheff Approximation.",
            "Subsystems of True Arithmetic and Hierarchies of Functions.",
            "Suslin's Hypothesis Does Not Imply Stationary Antichains.",
            "Models with Second Order Properties V: A General Principle.",
            "The Continuity of Cupping to 0'.",
            "A Simple Type Theory with Partial Functions and Subtypes.",
            "Large Ideals on Small Cardinals.",
            "Full Intuitionistic Linear Logic (extended abstract)."
        ]
    },
    {
        "name": "APAL",
        "year": "1992",
        "info": "1992: Volumes\n55, 56, 57, 58",
        "count": 47,
        "papers": [
            "The Primal Framework II: Smoothness.",
            "Combinatorial Principles in Elementary Number Theory.",
            "Some Effects of Ash-Nerode and Other Decidability Conditions on Degree Spectra.",
            "Automorphisms of Recursively Saturated Models of Arithmetic.",
            "Finite Type Structures within Combinatory Algebras.",
            "The d.r.e. Degrees are Not Dense.",
            "Locally Finite Weakly Minimal Theories.",
            "Tabular Degrees in alpha-Recursion Theory.",
            "Determinacy and the Sharp Functions on the Reals (Corrected Version).",
            "On Linfty k-free Boolean Algebras.",
            "Woodin Cardinals and Presaturated Ideals.",
            "Sufficiency Conditions for Theories with Recursive Models.",
            "Biography.",
            "Bibliography.",
            "Mints Type Deductive Calculi for Logic Programming.",
            "On the Idea(l) of Logical Closure.",
            "Myhill's Work in Recursion Theory.",
            "Bounded Arithmetic for NC, ALogTIME, L and NL.",
            "How Complicated is the Set of Stable Models of a Recursive Logic Program?",
            "Eight Problems about Nerode Semirings (Recursive Ultrapowers).",
            "Cancellation Laws for Polynomial-Time p-Isolated Sets.",
            "Polynomial-Time Analogues of Isolatedness.",
            "A Game Semantics for Linear Logic.",
            "On co-Simple Isols and Their Intersection Types.",
            "Decision Problems for Propositional Linear Logic.",
            "Polynomial-Time Abelian Groups.",
            "Complete Topoi Representing Models of Set Theory.",
            "Tautologies and Positive Solvability of Linear Homogeneous Systems.",
            "The Indestructability of the Order of the Indescribable Cardinals.",
            "An Intuitionistic Theory of Types with Assumptions of High-Arity Variables.",
            "An Infinitary Ramsey Property.",
            "Quantifier Elimination for Modules with Scalar Variables.",
            "Complexity of Resolution Proofs and Function Introduction.",
            "Moderate Families in Boolean Algebras.",
            "On the Adequacy of Representing Higher Order Intuitionistic Logic as a Pure Type System.",
            "Determinacy and Extended Sharp Functions on the Reals, Part II: Obtaining Sharps from Determinacy.",
            "A Transfer Theorem in Constructive p-adic Algebra.",
            "The Universality Spectrum of Stable Unsuperstable Theories.",
            "Extended use of IST.",
            "Closed Measure Zero Sets.",
            "Existential Instantiation and Normalization in Sequent Natural Deduction.",
            "Decidability Problems in Languages with Henkin Quantifiers.",
            "Generalizations of Enumeration Reducibility Using Recursive Infinitary Propositional Sentences.",
            "Combinatorial Properties of Hechler Forcing.",
            "On the Computational Complexity of Integral Equations.",
            "2-Sequent Calculus: A Proof Theory of Modalities.",
            "Symmetric Submodels of a Cohen Generic Extension."
        ]
    },
    {
        "name": "APAL",
        "year": "1991",
        "info": "1991: Volumes\n51, 52, 53, 54, 55",
        "count": 58,
        "papers": [
            "Domain Theory in Logical Form.",
            "Verification of Concurrent Programs: The Automata-Theoretic Framework.",
            "Kripke-Style Models for Typed lambda Calculus.",
            "Uniform Proofs as a Foundation for Logic Programming.",
            "Inductive Types and Type Constraints in the Second-Order lambda Calculus.",
            "A Unification-Theoretic Method for Investigating the k-Provability Problem.",
            "The Strength of the Failure of the Singular Cardinal Hypothesis.",
            "Schanuel's Conjecture and Free Exponential Rings.",
            "About Prikry Generic Extensions.",
            "lambda-Definability on Free Algebras.",
            "Preface - Papers presented at the International Symposium on Mathematical Logic and its Applications Nagoya, Japan, November 7-11, 1988.",
            "Propositional Consistency Proofs.",
            "Constructive Compact Operators on a Hilbert Space.",
            "Degrees of Orderings Not Isomorphic to Recursive Linear Orderings.",
            "Regressive Partition Relations, n-Subtle Cardinals, and Borel Diagonalization.",
            "Boundedness Theorems for Dilators and Ptykes.",
            "A Strong Boundedness Theorem for Dilators.",
            "From Discrete to Continuous Time.",
            "Bounded Arithmetic and the Polynomial Hierarchy.",
            "The Density of Infima in the Recursively Enumerable Degrees.",
            "Weak Axioms of Determinacy and Subsystems of Analysis II (Sigma02 Games).",
            "Nonstandard Arithmetic of Hilbert Subsets.",
            "Constructing Strongly Equivalent Nonisomorphic Models for Unstable Theories.",
            "Generalizing Classical and Effective Model Theory in Theories of Operations and Classes.",
            "Arithmetizing Uniform NC.",
            "Relative Elimination of Quantifiers for Henselian Valued Fields.",
            "The Undecidability of k-Provability.",
            "Systems of Combinatory Logic Related to Quine's 'New Foundations'.",
            "A Decidable Ehrenfeucht Theory with Exactly Two Hyperarithmetic Models.",
            "The Structure of Models of Decidable Monadic Theories of Graphs.",
            "What's So Special About Kruskal's Theorem and the Ordinal Gamma0? A Survey of Some Results in Proof Theory.",
            "A More Direct Proof of a Result of Shelah.",
            "On-Dimensional Groups over an o-Minimal Structure.",
            "Groups of Dimension Two and Three Over o-Minimal Structures.",
            "Large Cardinals and Iteration Trees of Height omega.",
            "Polynomial-Time versus Recursive Models.",
            "Determinacy and the Sharp Functions on the Reals.",
            "Every Borel Function is Monotone Borel.",
            "A Slow Growing Analogue to Buchholz' Proof.",
            "Model Completeness Results for Elliptic and Abelian Functions.",
            "General Iteration and Unary Functions.",
            "Iterated Extended Ultrapowers and Supercompactness without Choice.",
            "On the Size of Closed Unbounded Sets.",
            "Reverse Mathematics and Homeomorphic Embeddings.",
            "Uncountable Degree Spectra.",
            "Borel Quasi-Orderings in Subsystems of Second-Order Arithmetic.",
            "The Primal Framework II: Smoothness.",
            "Combinatorial Principles in Elementary Number Theory.",
            "Some Effects of Ash-Nerode and Other Decidability Conditions on Degree Spectra.",
            "Automorphisms of Recursively Saturated Models of Arithmetic.",
            "Finite Type Structures within Combinatory Algebras.",
            "The d.r.e. Degrees are Not Dense.",
            "Locally Finite Weakly Minimal Theories.",
            "Tabular Degrees in alpha-Recursion Theory.",
            "Determinacy and the Sharp Functions on the Reals (Corrected Version).",
            "On Linfty k-free Boolean Algebras.",
            "Woodin Cardinals and Presaturated Ideals.",
            "Sufficiency Conditions for Theories with Recursive Models."
        ]
    },
    {
        "name": "APAL",
        "year": "1990",
        "info": "1990: Volumes\n46, 47, 48, 49, 50",
        "count": 53,
        "papers": [
            "Diophantine Induction.",
            "Some Highly Undecidable Lattices.",
            "Weakly Minimal Formulas: A Global Approach.",
            "Some Applications of Positive Formulas in Descriptive Set Theory and Logic.",
            "Topological Models of Epistemic Set Theory.",
            "Omega-Categoricity, Relative Categoricity and Coordinatisation.",
            "Counterexamples to a Conjecture on Relative Categoricity.",
            "Pairs of Recursive Structures.",
            "The Primal Framework I.",
            "Minimal Collapsing Extensions of Models of ZFC.",
            "A Diamond Example of an Ordinal Graph with No Infinite Paths.",
            "Weak Comparability of Well Orderings and Reverse Mathematics.",
            "Martin's Axiom and Ordinal Graphs: Large Independent Sets or Infinite Paths.",
            "Categoricity of Theories in Lk omega, with k a Compact Ordinal.",
            "Labelling Systems and r.e. Structures.",
            "Post Complete and 0-Axiomatizable Modal Logics.",
            "A New Model for Intuitionistic Analysis.",
            "Fixed Point Theory in Weak Second-Order Arithmetic.",
            "Algorithms for Sentences over Integral Domains.",
            "Inductive Full Satisfaction Classes.",
            "A Theorem on Barr-Exact Categories, with an Infinitary Generalization.",
            "The Notion of Independence in Categories of Algebraic Structures, Part III: Equational Classes.",
            "A Uniform Method for Proving Lower Bounds on the Computational Complexity of Logical Theories.",
            "Partition Properties and Well-Ordered Sequences.",
            "Parametrization over Inductive Relations of a Bounded Number of Variables.",
            "Domain Interpretations of Martin-Löf's Partial Type Theory.",
            "Jumping with Random Reals.",
            "Minimal Degrees Recursive in 1-Generic Degrees.",
            "The Degree of a Sigman Cut.",
            "Constructions by Transfinitely Many Workers.",
            "Exponentiation and Second-Order Bounded Arithmetic.",
            "Extension of Gurevich-Harrington's Restricted Memory Determinacy Theorem: A Criterion for the Winning Player and an Explicit Class of Winning Strategies.",
            "Corrigendum: Correction to \"Undecidability of L(Finfty) and Other Lattices of r.e. Substructures\".",
            "Equational Theory of Positive Numbers with Exponentiation is Not Finitely Axiomatizable.",
            "Rationality of p-adic Poincaré Series: Uniformity in p.",
            "On Restricted Forms of Enumeration Reducibility.",
            "Lattice Nonembeddings and Initial Segments of the Recursively Enumerable Degrees.",
            "Ramsey Ultrafilters and the Reaping Number - Con(r<u).",
            "Sub-Arithmetical Ultrapowers: A Survey.",
            "The Monadic Second-Order Logic of Graphs IV: Definability Properties of Equational Graphs.",
            "A Hierarchy of Ramsey Cardinals.",
            "An Extension of Borel Determinacy.",
            "Real Numbers, Continued Fractions and Complexity Classes.",
            "When Is Arithmetic Possible?",
            "Projective Subsets of Separable Metric Spaces.",
            "Problems of Substitution and Admissibility in the Modal System Grz and in Intuitionistic Propositional Calculus.",
            "Boolean Powers of Abelian Groups.",
            "Undimensional Theories are Superstable.",
            "Extended Bar Induction in Applicative Theories.",
            "Non-Bounding Constructions.",
            "Shelah's pcf Theory and Its Applications.",
            "The Borel Conjecture.",
            "Constructive Modal Logics I."
        ]
    },
    {
        "name": "APAL",
        "year": "1989",
        "info": "1989: Volumes\n41, 42, 43, 44, 45",
        "count": 61,
        "papers": [
            "Intervals and Sublattices of the r.e. Weak Truth Table Degrees, Part I: Density.",
            "Countable Valued Fields in Weak Subsystems of Second-Order Arithmetic.",
            "Conceptual Completeness for First-Order Intuitionistic Logic: An Application of Categorical Logic.",
            "More on Brouwer's Refutations.",
            "Filter Spaces: Toward a Unified Theory of Large Cardinals and Embedding Axioms.",
            "Nondeterministic Bounded Query Reducibilities.",
            "Completely Mitotic r.e. Degrees.",
            "On the Number of Steps in Proofs.",
            "Infinite Combinatorics and Definability.",
            "Dimensional Order Property and Pairs of Models.",
            "Minimal Coding.",
            "Applications of Fodor's Lemma to Vaught's Conjecture.",
            "Nonstandard Definability.",
            "Chang's Model and Covering Properties.",
            "The Galvin-Prikry Theorem and Set Existence Axioms.",
            "Classification of Degree Classes Associated with r.e. Subspaces.",
            "Forcing with Filters and Complete Combinatorics.",
            "Maslov's Inverse Method and Decidable Classes.",
            "Generic Copies of Countable Structures.",
            "Delta12-Sets of Reals.",
            "Retracts of Numerations.",
            "Index Sets Related to Prompt Simplicity.",
            "Monotone Inductive Definitions in a Constructive Theory of Functions and Classes.",
            "Dominoes and the Complexity of Subclasses of Logical Theories.",
            "Sequential Evaluation Strategies for Parallel-Or and Related Reduction Systems.",
            "Primes and Their Residue Rings in Models of Open Induction.",
            "A Type-Free System Extending (ZFC).",
            "Three-Valued Logics: An Introduction, a Comparison of Various Logical Lexica, and Some Philosophical Remarks.",
            "Stable Theories, Pseudoplanes and the Number of Countable Models.",
            "Borel Ideals vs. Borel Sets of Countable Relations and Trees.",
            "RRC-Fields with Small Absolute Galois Groups.",
            "The Negation of the Singular Cardinal Hypothesis from o(k) = k++.",
            "Definability Hierarchies of Generalized Quantifiers.",
            "Henkin and Function Quantifiers.",
            "A Categorical Approach to the Theory of Computation.",
            "The Recursively Enumerable Degrees have Infinitely Many One-Types.",
            "Hyperhypersimple Sets and Delta2 Systems.",
            "Completeness Proofs for Propositional Logic with Polynomial-Time Connectives.",
            "Transfer Theorems for pi-Monads.",
            "Some Combinatorial Principles Equivalent to Restrictions of Transfinite Induction up to Gamma0.",
            "Complexity-Theoretic Algebra II: Boolean Algebras.",
            "Injecting Inconsistencies into Models of PA.",
            "Inductive Rings and Fields.",
            "The Machinery of Consistency Proofs.",
            "Intervals and Sublattices of the r.e. Weak Truth Table Degrees, Part II: Nonbounding.",
            "Varieties of Complex Algebras.",
            "Positive Definite Functions over Regular f-Rings and Representations as Sums of Squares.",
            "Independent Axiomatizability of Sets of Sentences.",
            "On the Complexity of Finding the Chromatic Number of a Recursive Graph I: The Bounded Case.",
            "Some Principles Related to Chang's Conjecture.",
            "Papers presented at the Meeting on \"Stability in Model Theory II\", July 13-17, 1987, Trento, Italy - Preface.",
            "Semisimple Stable and Superstable Groups.",
            "Elementary Pairs of Models.",
            "Almost Orthogonal Regular Types.",
            "A Dichotomy Theorem for Regular Types.",
            "Groups with Identities.",
            "Dimension of Definable Sets, Algebraic Boundedness and Henselian Fields.",
            "First-Order Definability on Finite Structures.",
            "On the Complexity of Finding the Chromatic Number of a Recursive Graph II: The Unbounded Case.",
            "Towers in omegaomega and omega omega.",
            "On the Existence of Regular Types."
        ]
    },
    {
        "name": "APAL",
        "year": "1988",
        "info": "1988: Volumes\n37,\n38,\n39,\n40",
        "count": 37,
        "papers": [
            "Countable ultraproducts without CH.",
            "Categoricity results for L∞κ.",
            "Index sets in the arithmetical Hierarchy.",
            "On the programs-as-formulas interpretation of parallel programs in peano arithmetic.",
            "Normal functors, power series and λ-calculus.",
            "Some applications of short core models.",
            "On the computational complexity of the theory of Abelian groups.",
            "Topology and duality in modal logic.",
            "Proof-theoretical analysis: weak systems of functions and classes.",
            "The syntax of nonstandard analysis.",
            "Diophantine equations in fragments of arithmetic.",
            "A graph which embeds all small graphs on any large set of vertices.",
            "The notion of independence in categories of algebraic structures, part I: Basic properties.",
            "Selective ultrafilters and homogeneity.",
            "φ11-complete families of elementary sequences.",
            "Recursion theorems and effective domains.",
            "Another extension of Van de Wiele's theorem.",
            "Substructures and uniform elimination for p-adic fields.",
            "Applications of iterated perfect set forcing.",
            "The notion of independence in categories of algebraic structures, part II: S-minimal extensions.",
            "Bounded arithmetic and truth definition.",
            "Intrinsically gs;0alpha; relations.",
            "A unification algorithm for second-order monadic terms.",
            "On the Mitchell and Rudin-Kiesler orderings of ultrafilters.",
            "Cardinality logics, part I: inclusions between languages based on 'exactly'.",
            "Totally transcendental theories of modules: decomposition of models and types.",
            "Some descriptive set theory and core models.",
            "The disjunction and existence properties for axiomatic systems of truth.",
            "Homogeneous finite rings in characteristic 2n.",
            "A transfer theorem in constructive real algebra.",
            "Number of strongly alephɛ-saturated models - an addition.",
            "On church's formal theory of functions and functionals: The λ-calculus: connections to higher type recursion theory, proof theory, category theory.",
            "A small complete category.",
            "Strong conceptual completeness for first-order logic.",
            "Primitive iteration and unary functions.",
            "Admissibility spectra and minimality.",
            "A non-inversion theorem for the jump operator."
        ]
    },
    {
        "name": "APAL",
        "year": "1987",
        "info": "1987: Volumes\n33,\n34,\n35,\n36",
        "count": 49,
        "papers": [
            "An axiomatic approach to self-referential truth.",
            "On Gödel incompleteness and finite combinatorics.",
            "Combinatorial problems on trees: Partitions, δ-systems and large free subtrees.",
            "An application of tarskis principle to absolute Galois groups of function fields.",
            "Remarks on superatomic boolean algebras.",
            "An independence result for (II11-CA)+BI.",
            "Ordinal notations based on a hierarchy of inaccessible cardinals.",
            "A cut elimination theorem for stationary logic.",
            "Globalization of intui tionistic set theory.",
            "There may be simple Paleph1 and Paleph2-points and the Rudin-Keisler ordering may be downward directed.",
            "Maximal theories.",
            "Some higher-gap examples in combinatorial set theory.",
            "Some coloring properties for uncountable cardinals.",
            "Categoricity in hyperarithmetical degrees.",
            "Complementing below recursively enumerable degrees.",
            "Implication and analysis in classical frege structures.",
            "Extraspecial p-groups.",
            "Maximality in modal logic.",
            "Measures and forking.",
            "Simplified Gap-2 morasses.",
            "Trivial pursuit: Remarks on the main gap.",
            "Set existence axioms for general (not necessarily countable) stability theory.",
            "Structures coordinatized by indiscernible sets.",
            "Discrete o-minimal structures.",
            "Existence of many L∞, λ-equivalent, non- isomorphic models of T of power λ.",
            "Strong coding.",
            "A guide to \"strong coding\".",
            "Models of arithmetic and categories with finiteness conditions.",
            "Choice and well-ordering.",
            "Lindenbaum algebras of intuitionistic theories and free categories.",
            "Decidability and definability with circumscription.",
            "The undecidability of the lattice of R.E. closed subsets of an effective topological space.",
            "On countable locally described structures.",
            "Representations of the real numbers and of the open subsets of the set of real numbers.",
            "On the scheme of induction for bounded arithmetic formulas.",
            "K-continuous lattices and comprehension principles for frege structures.",
            "Effective topological spaces III: Forcing and definability.",
            "Compactness in constructive analysis revisited.",
            "Recursively rigid Boolean algebras.",
            "The expressive power of Malitz quantifiers for linear orderings.",
            "On some extensions of the projective hierarchy.",
            "Lattices of c-degrees.",
            "A theorem and some consistency results in partition calculus.",
            "Uncountable groups have many nonconjugate subgroups.",
            "Nonconvergence, undecidability, and intractability in asymptotic problems.",
            "Menas' conjecture and generic ultrapowers.",
            "On varieties of cylindric algebras with applications to logic.",
            "On the number of strongly alephε-saturated models of power λ.",
            "The model N = ∪ {L[A]: A countable set of ordinals}."
        ]
    },
    {
        "name": "APAL",
        "year": "1986",
        "info": "1986: Volumes\n30,\n31,\n32",
        "count": 50,
        "papers": [
            "Superstable groups.",
            "Superstable groups; a partial answer to conjectures of Cherlin and Zil'ber.",
            "Quasi finitely axiomatizable totally categorical theories.",
            "Locally modular theories of finite rank.",
            "Superstable groups of finite rank without pseudoplanes.",
            "Intersections of algebraically closed fields.",
            "On elementary properties of free lie algebras.",
            "Undecidability of some elementary theories over pac fields.",
            "Intuitionistically provable recursive well-orderings.",
            "Approximation to measurable functions and its relation to probabilistic computation.",
            "Diagonalization of continuous matrices as a representation of intuitionistic reals.",
            "Souslin trees and successors of singular cardinals.",
            "Perfect measurable spaces.",
            "Degrees which do not bound minimal degrees.",
            "More on real algebra in scott's model.",
            "ω1-constructible universe and measurable cardinals.",
            "Sound, totally sound, and unsound recursive equivalence types.",
            "Representable cylindric algebras.",
            "A completeness proof for adapted probability logic.",
            "Hyperfinite models of adapted probability logic.",
            "The limits of E-recursive enumerability.",
            "Preface.",
            "Which set existence axioms are needed to prove the separable Hahn-Banach theorem?",
            "Members of countable π10 classes.",
            "1-Generic degrees and minimal degrees in higher recursion theory, II.",
            "Incorporating equality into logic programming via surface deduction.",
            "Recursive categoricity and recursive stability.",
            "Structural interactions of the recursively enumerable T- and W-degrees.",
            "Paris-Harrington principles, reflection principles and transfinite induction up to ε0.",
            "Generic objects in recursion theory II: Operations on recursive approximation spaces.",
            "Factorization of polynomials and Σ10 induction.",
            "Global intuitionistic analysis.",
            "Henkin quantifiers and complete problems.",
            "Undecidability of L(F∞) and other lattices of r.e. substructures.",
            "Integrating classical and intuitionistic type theory.",
            "Epistemic and intuitionistic formal systems.",
            "Forking, normalization and canonical bases.",
            "Quantifier elimination in discriminator varieties.",
            "Embedding sheaf models for set theory into boolean-valued permutation models with an interior operator.",
            "Preface.",
            "Stability of recursive structures in arithmetical degrees.",
            "Recursion theory and ordered groups.",
            "Realizability and recursive set theory.",
            "Graph colorings and recursively bounded Π10-classes.",
            "A new system of proof-theoretic ordinal functions.",
            "Generalised algebraic theories and contextual categories.",
            "Isols and burnside's lemma.",
            "Fixed-point extensions of first-order logic.",
            "Adjointness in recursion.",
            "On the impossibility of explicit upper bounds on lengths of some provably finite algorithms in computable analysis."
        ]
    },
    {
        "name": "APAL",
        "year": "1985",
        "info": "1985: Volumes\n28,\n29",
        "count": 22,
        "papers": [
            "Narrow boolean algebras.",
            "Finite QE rings in characteristic p2.",
            "Fragments of arithmetic.",
            "Reduction of higher type levels by means of an ordinal analysis of finite terms.",
            "aleph0-Categorical, aleph0-stable structures.",
            "Probability logic with conditional expectation.",
            "The model-theoretic structure of abelian group rings.",
            "Monadic logic and löwenheim numbers.",
            "Set recursion and Πhalf-logic.",
            "Non-closure of the image model and absence of fixed points.",
            "More on the weak diamond.",
            "Addendum to \"countable algebra and set existence axioms\".",
            "Effective topological spaces I: a definability theory.",
            "Lower bound results on lengths of second-order formulas.",
            "Recursive properties of euclidean domains.",
            "Reflection and forcing in E-recursion theory.",
            "P-points and Q-points over a measurable cardinal.",
            "On the consistency of some partition theorems for continuous colorings, and the structure of aleph1-dense real order types.",
            "Effective topological spaces II: A hierarchy.",
            "Upper bounds for the arithmetical degrees.",
            "Remarks in abstract model theory.",
            "Regularity properties of definable sets of reals."
        ]
    },
    {
        "name": "APAL",
        "year": "1984",
        "info": "1984: Volumes\n26,\n27",
        "count": 25,
        "papers": [
            "A note on r-maximal subspaces of V∞.",
            "More game-theoretic properties of boolean algebras.",
            "Some properties of κ-complete ideals defined in terms of infinite games.",
            "Stationary logic of ordinals.",
            "Recursive automorphisms of recursive linear orderings.",
            "On universal graphs without instances of CH.",
            "Characterizing weak compactness.",
            "Model theory for L∞ω1.",
            "Existentially closed structures in the power of the continuum.",
            "Model theory of modules.",
            "First-order theories of abstract dependence relations.",
            "Fundamentals of forking.",
            "Countably decomposable admissible sets.",
            "Large sets in intuitionistic set theory.",
            "A constructive consistency proof of a fragment of set theory.",
            "Sheaf models for choice sequences.",
            "Saturation and simple extensions of models of peano arithmetic.",
            "Decidability and the number of countable models.",
            "On some non-classical extensions of second-order intuitionistic propositional calculus.",
            "Cancellation laws for surjective cardinals.",
            "A nonconservativity result on global choice.",
            "Ultrafilters and types on models of arithmetic.",
            "Recursive linear orders with recursive successivities.",
            "Tautologies with a unique craig interpolant, uniform vs. nonuniform complexity.",
            "The real-algebraic structure of Scott's model of intuitionistic analysis."
        ]
    },
    {
        "name": "APAL",
        "year": "1983",
        "info": "1983: Volumes\n24,\n25",
        "count": 26,
        "papers": [
            "Editorial.",
            "Farewell and welcome.",
            "∑11-Formulae on finite structures.",
            "Locally pure topological abelian groups: elementary invariants.",
            "Degree theory on alephω.",
            "Global and local admissibility: II. Major subsets and automorphisms.",
            "The density of the nonbranching degrees.",
            "Some examples of precipitous ideals.",
            "Set-theoretical models of λ-calculus: theories, expansions, isomorphisms.",
            "The intervals of the lattice of recursively enumerable sets determined by major subsets.",
            "Aronszajn trees on aleph2 and aleph3.",
            "The number of uncountable models of ω-stable theories.",
            "Iterating ordinal definability.",
            "Some results on consecutive large cardinals.",
            "Recursive coloration of countable graphs.",
            "Automorphisms of substructure lattices in recursive algebra.",
            "Magidor-like and radin-like forcing.",
            "A sequent calculus for relation algebras.",
            "Generalizing the Mahlo Hierarchy, with Applications to the Mitchell Models.",
            "Set existence property for intuitionistic theories with dependent choice.",
            "Countable algebra and set existence axioms.",
            "Models with second order properties IV. A general method and eliminating diamonds.",
            "Real closed rings II. model theory.",
            "On the consistency strength of 'Accessible' Jonsson Cardinals and of the Weak Chang Conjecture.",
            "Positive results in abstract model theory: a theory of compact logics.",
            "A topological characterization of (λ, μ)*-compactness."
        ]
    },
    {
        "name": "APAL",
        "year": "1982",
        "info": "1982: Volumes\n22,\n23",
        "count": 21,
        "papers": [
            "The covering lemma for K.",
            "Steel forcing and barwise compactness.",
            "On Martin's conjecture.",
            "Automorphisms of the lattice of recursively enumerable sets. Part II: Low sets.",
            "Determinacy in the Mitchell models.",
            "The covering lemma for L[U].",
            "Chains in Boolean algebras.",
            "Some applications of Jensen's coding theorem.",
            "Compactness, interpolation and Friedman's third problem.",
            "Reflection and partition properties of admissible ordinals.",
            "Adding closed cofinal sequences to large cardinals.",
            "On the completenes principle: A study of provability in heyting's arithmetic and extensions.",
            "Decidability and stability of free nilpotent lie algebras and free nilpotent p-groups of finite exponent.",
            "The Boolean algebra of formulas of first-order logic.",
            "Concepts of general topology in constructive mathematics and in sheaves, II.",
            "A correction to \"concepts of general topology in constructive mathematics and in sheaves\".",
            "A very absolute Π21 real singleton.",
            "Δ31 reals.",
            "Recursive models for constructive set theories.",
            "Monadic theory of order and topology in ZFC.",
            "Morasses, diamond, and forcing."
        ]
    }
]