[
    {
        "year": "2021",
        "name": "28th CADE 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2021",
                "sub_name": "Automated Deduction - CADE 28 - 28th International Conference on Automated Deduction, Virtual Event, July 12-15, 2021, Proceedings.",
                "count": 38,
                "papers": [
                    "Non-well-founded Deduction for Induction and Coinduction.",
                    "Towards the Automatic Mathematician.",
                    "Tableau-based Decision Procedure for Non-Fregean Logic of Sentential Identity.",
                    "Learning from Łukasiewicz and Meredith: Investigations into Proof Structures.",
                    "Efficient Local Reductions to Basic Modal Logic.",
                    "Isabelle's Metalogic: Formalization and Proof Checker.",
                    "The ksmt Calculus Is a δ-complete Decision Procedure for Non-linear Constraints.",
                    "Universal Invariant Checking of Parametric Systems with Quantifier-free SMT Reasoning.",
                    "Politeness and Stable Infiniteness: Stronger Together.",
                    "Equational Theorem Proving Modulo.",
                    "Unifying Decidable Entailments in Separation Logic with Inductive Definitions.",
                    "Subformula Linking for Intuitionistic Logic with Application to Type Theory.",
                    "Efficient SAT-based Proof Search in Intuitionistic Propositional Logic.",
                    "Proof Search and Certificates for Evidential Transactions.",
                    "Non-clausal Redundancy Properties.",
                    "Multi-Dimensional Interpretations for Termination of Term Rewriting.",
                    "Finding Good Proofs for Description Logic Entailments using Recursive Quality Measures.",
                    "Computing Optimal Repairs of Quantified ABoxes w.r.t. Static EL TBoxes.",
                    "Generalized Completeness for SOS Resolution and its Application to a New Notion of Relevance.",
                    "A Unifying Splitting Framework.",
                    "Integer Induction in Saturation.",
                    "Superposition with First-class Booleans and Inprocessing Clausification.",
                    "Superposition for Full Higher-order Logic.",
                    "Making Higher-Order Superposition Work.",
                    "Dual Proof Generation for Quantified Boolean Formulas with a BDD-based Solver.",
                    "Reliable Reconstruction of Fine-grained Proofs in a Proof Assistant.",
                    "An Automated Approach to the Collatz Conjecture.",
                    "Verified Interactive Computation of Definite Integrals.",
                    "Confidences for Commonsense Reasoning.",
                    "Neural Precedence Recommender.",
                    "Improving ENIGMA-style Clause Selection while Learning From History.",
                    "A Normative Supervisor for Reinforcement Learning Agents.",
                    "Automatically Building Diagrams for Olympiad Geometry Problems.",
                    "The Fusemate Logic Programming System.",
                    "Twee: An Equational Theorem Prover.",
                    "The Isabelle/Naproche Natural Language Proof Assistant.",
                    "The Lean 4 Theorem Prover and Programming Language.",
                    "Harpoon: Mechanizing Metatheory Interactively - (System Description)."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th CADE 2019",
        "info": "Natal, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2019",
                "sub_name": "Automated Deduction - CADE 27 - 27th International Conference on Automated Deduction, Natal, Brazil, August 27-30, 2019, Proceedings.",
                "count": 34,
                "papers": [
                    "Unification Modulo Lists with Reverse Relation with Certain Word Equations.",
                    "On the Width of Regular Classes of Finite Structures.",
                    "Extending SMT Solvers to Higher-Order Logic.",
                    "Superposition with Lambdas.",
                    "Restricted Combinatory Unification.",
                    "dLι: Definite Descriptions in Differential Dynamic Logic.",
                    "SPASS-SATT - A CDCL(LA) Solver.",
                    "GRUNGE: A Grand Unified ATP Challenge.",
                    "Model Completeness, Covers and Superposition.",
                    "A Tableaux Calculus for Default Intuitionistic Logic.",
                    "NIL: Learning Nonlinear Interpolants.",
                    "ENIGMA-NG: Efficient Neural and Gradient-Boosted Inference Guidance for E.",
                    "Towards Physical Hybrid Systems.",
                    "SCL Clause Learning from Simple Models.",
                    "Names Are Not Just Sound and Smoke: Word Embeddings for Axiom Selection.",
                    "Computing Expected Runtimes for Constant Probability Programs.",
                    "Automatic Generation of Logical Models with AGES.",
                    "Automata Terms in a Lazy WSkS Decision Procedure.",
                    "Confluence by Critical Pair Analysis Revisited.",
                    "Composing Proof Terms.",
                    "Combining ProVerif and Automated Theorem Provers for Security Protocol Verification.",
                    "Towards Bit-Width-Independent Proofs in SMT Solvers.",
                    "On Invariant Synthesis for Parametric Systems.",
                    "The Aspect Calculus.",
                    "Uniform Substitution at One Fell Swoop.",
                    "A Formally Verified Abstract Account of Gödel's Incompleteness Theorems.",
                    "Old or Heavy? Decaying Gracefully with Age/Weight Shapes.",
                    "Induction in Saturation-Based Proof Search.",
                    "Faster, Higher, Stronger: E 2.3.",
                    "Certified Equational Reasoning via Ordered Completion.",
                    "JGXYZ: An ATP System for Gap and Glut Logics.",
                    "GKC: A Reasoning System for Large Knowledge Bases.",
                    "Optimization Modulo the Theory of Floating-Point Numbers.",
                    "FAME(Q): An Automated Tool for Forgetting in Description Logics with Qualified Number Restrictions."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "26th CADE 2017",
        "info": "Gothenburg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2017",
                "sub_name": "Automated Deduction - CADE 26 - 26th International Conference on Automated Deduction, Gothenburg, Sweden, August 6-11, 2017, Proceedings.",
                "count": 34,
                "papers": [
                    "Reasoning About Concurrency in High-Assurance, High-Performance Software Systems.",
                    "Towards Logic-Based Verification of JavaScript Programs.",
                    "Formal Verification of Financial Algorithms.",
                    "Satisfiability Modulo Theories and Assignments.",
                    "Notions of Knowledge in Combinations of Theories Sharing Constructors.",
                    "On the Combination of the Bernays-Schönfinkel-Ramsey Fragment with Simple Linear Integer Arithmetic.",
                    "Satisfiability Modulo Transcendental Functions via Incremental Linearization.",
                    "Satisfiability Modulo Bounded Checking.",
                    "Short Proofs Without New Variables.",
                    "Relational Constraint Solving in SMT.",
                    "Decision Procedures for Theories of Sets with Measures.",
                    "A Decision Procedure for Restricted Intensional Sets.",
                    "Decidability of the Monadic Shallow Linear First-Order Fragment with Straight Dismatching Constraints.",
                    "Efficient Certified RAT Verification.",
                    "Efficient Verified (UN)SAT Certificate Checking.",
                    "Translating Between Implicit and Explicit Versions of Proof.",
                    "A Unifying Principle for Clause Elimination in First-Order Logic.",
                    "Splitting Proofs for Interpolation.",
                    "Detecting Inconsistencies in Large First-Order Knowledge Bases.",
                    "Theorem Proving for Metric Temporal Logic over the Naturals.",
                    "Scavenger 0.1: A Theorem Prover Based on Conflict Resolution.",
                    "WorkflowFM: A Logic-Based Framework for Formal Process Specification and Composition.",
                    "DepQBF 6.0: A Search-Based QBF Solver Beyond Traditional QCDCL.",
                    "CSI: New Evidence - A Progress Report.",
                    "Scalable Fine-Grained Proofs for Formula Processing.",
                    "Certifying Confluence of Quasi-Decreasing Strongly Deterministic Conditional Term Rewrite Systems.",
                    "A Transfinite Knuth-Bendix Order for Lambda-Free Higher-Order Terms.",
                    "Certifying Safety and Termination Proofs for Integer Transition Systems.",
                    "Biabduction (and Related Problems) in Array Separation Logic.",
                    "Automatically Verifying Temporal Properties of Pointer Programs with Cyclic Proof.",
                    "Satisfiability of Compositional Separation Logic with Tree Predicates and Data Constraints.",
                    "A Proof Strategy Language and Proof Script Generation for Isabelle/HOL.",
                    "The Binomial Pricing Model in Finance: A Formalization in Isabelle.",
                    "Monte Carlo Tableau Proof Search."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "25th CADE 2015",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2015",
                "sub_name": "Automated Deduction - CADE-25 - 25th International Conference on Automated Deduction, Berlin, Germany, August 1-7, 2015, Proceedings.",
                "count": 42,
                "papers": [
                    "History and Prospects for First-Order Automated Deduction.",
                    "Stumbling Around in the Dark: Lessons from Everyday Mathematics.",
                    "Automated Reasoning in the Wild.",
                    "Automating Leibniz's Theory of Concepts.",
                    "Confluence Competition 2015.",
                    "Termination Competition (termCOMP 2015).",
                    "Non-E-Overlapping, Weakly Shallow, and Non-Collapsing TRSs are Confluent.",
                    "CoLL: A Confluence Tool for Left-Linear Term Rewrite Systems.",
                    "Term Rewriting with Prefix Context Constraints and Bottom-Up Strategies.",
                    "Encoding Dependency Pair Techniques and Control Strategies for Maximal Completion.",
                    "Reducing Relative Termination to Dependency Pair Problems.",
                    "Decidability of Univariate Real Algebra with Predicates for Rational and Integer Powers.",
                    "A Decision Procedure for (Co)datatypes in SMT Solvers.",
                    "Deciding ATL*Satisfiability by Tableaux.",
                    "A Formalisation of Finite Automata Using Hereditarily Finite Sets.",
                    "SEPIA: Search for Proofs Using Inferred Automata.",
                    "Proving Correctness of a KRK Chess Endgame Strategy by Using Isabelle/HOL and Z3.",
                    "Inductive Beluga: Programming Proofs.",
                    "SMTtoTPTP - A Converter for Theorem Proving Formats.",
                    "CTL Model Checking in Deduction Modulo.",
                    "Quantifier-Free Equational Logic and Prime Implicate Generation.",
                    "Quantomatic: A Proof Assistant for Diagrammatic Reasoning.",
                    "Cooperating Proof Attempts.",
                    "Towards the Compression of First-Order Resolution Proofs by Lowering Unit Clauses.",
                    "Beagle - A Hierarchic Superposition Theorem Prover.",
                    "The Lean Theorem Prover (System Description).",
                    "System Description: E.T. 0.1.",
                    "Playing with AVATAR.",
                    "A Polite Non-Disjoint Combination Method: Theories with Bridging Functions Revisited.",
                    "Exploring Theories with a Model-Finding Assistant.",
                    "Abstract Interpretation as Automated Deduction.",
                    "A Uniform Substitution Calculus for Differential Dynamic Logic.",
                    "Program Synthesis Using Dual Interpretation.",
                    "Automated Theorem Proving for Assertions in Separation Logic with All Connectives.",
                    "KeY-ABS: A Deductive Verification Tool for the Concurrent Modelling Language ABS.",
                    "KeYmaera X: An Axiomatic Tactical Theorem Prover for Hybrid Systems.",
                    "Tableaux Methods for Propositional Dynamic Logics with Separating Parallel Composition.",
                    "Regular Patterns in Second-Order Unification.",
                    "Theorem Proving with Bounded Rigid E-Unification.",
                    "Expressing Symmetry Breaking in DRAT Proofs.",
                    "MathCheck: A Math Assistant via a Combination of Computer Algebra Systems and SAT Solvers.",
                    "Linear Integer Arithmetic Revisited."
                ]
            },
            {
                "sub_name_abbr": "conf/cade/2015bridging",
                "sub_name": "Proceedings of the Workshop on Bridging the Gap between Human and Automated Reasoning - A workshop of the 25th International Conference on Automated Deduction (CADE-25), Berlin, Germany, August 1, 2015.",
                "count": 5,
                "papers": [
                    "Weak Completion Semantics and its Applications in Human Reasoning.",
                    "A Computational Logic Approach to Syllogisms in Human Reasoning.",
                    "There is no one Logic to Model Human Reasoning: the Case from Interpretation.",
                    "Tackling Benchmark Problems of Commonsense Reasoning.",
                    "Interactive Theorem Proving - Modelling the User in the Proof Process."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th CADE 2013",
        "info": "Lake Placid, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2013",
                "sub_name": "Automated Deduction - CADE-24 - 24th International Conference on Automated Deduction, Lake Placid, NY, USA, June 9-14, 2013. Proceedings.",
                "count": 33,
                "papers": [
                    "One Logic to Use Them All.",
                    "The Tree Width of Separation Logic with Recursive Definitions.",
                    "Hierarchic Superposition with Weak Abstraction.",
                    "Completeness and Decidability Results for First-Order Clauses with Indices.",
                    "A Proof Procedure for Hybrid Logic with Binders, Transitivity and Relation Hierarchies.",
                    "Tractable Inference Systems: An Extension with a Deducibility Predicate.",
                    "Computing Tiny Clause Normal Forms.",
                    "System Description: E-KRHyper 1.4 - Extensions for Unique Names and Description Logic.",
                    "Analysing Vote Counting Algorithms via Logic - And Its Application to the CADE Election Scheme.",
                    "Automated Reasoning, Fast and Slow.",
                    "Foundational Proof Certificates in First-Order Logic.",
                    "Computation in Real Closed Infinitesimal and Transcendental Extensions of the Rationals.",
                    "A Symbiosis of Interval Constraint Propagation and Cylindrical Algebraic Decomposition.",
                    "dReal: An SMT Solver for Nonlinear Theories over the Reals.",
                    "Solving Difference Constraints over Modular Arithmetic.",
                    "Asymmetric Unification: A New Unification Paradigm for Cryptographic Protocol Analysis.",
                    "Hierarchical Combination.",
                    "PRocH: Proof Reconstruction for HOL Light.",
                    "An Improved BDD Method for Intuitionistic Propositional Logic: BDDIntKt System Description.",
                    "Towards Modularly Comparing Programs Using Automated Theorem Provers.",
                    "Reuse in Software Verification by Abstract Method Calls.",
                    "Dynamic Logic with Trace Semantics.",
                    "Temporalizing Ontology-Based Data Access.",
                    "Verifying Refutations with Extended Resolution.",
                    "Hierarchical Reasoning and Model Generation for the Verification of Parametric Hybrid Systems.",
                    "Quantifier Instantiation Techniques for Finite Model Finding in SMT.",
                    "Automating Inductive Proofs Using Theory Exploration.",
                    "E-MaLeS 1.1.",
                    "TFF1: The TPTP Typed First-Order Form with Rank-1 Polymorphism.",
                    "Propositional Temporal Proving with Reductions to a SAT Problem.",
                    "InKreSAT: Modal Reasoning via Incremental Reduction to SAT.",
                    ": A Tool for Polynomially Translating Quantifier-Free Bit-Vector Formulas into.",
                    "The 481 Ways to Split a Clause and Deal with Propositional Variables."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "23rd CADE 2011",
        "info": "Wroclaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2011",
                "sub_name": "Automated Deduction - CADE-23 - 23rd International Conference on Automated Deduction, Wroclaw, Poland, July 31 - August 5, 2011. Proceedings.",
                "count": 38,
                "papers": [
                    "The Anatomy of Equinox - An Extensible Automated Reasoning Tool for First-Order Logic and Beyond - (Talk Abstract).",
                    "Advances in Proving Program Termination and Liveness.",
                    "Translating between Language and Logic: What Is Easy and What Is Difficult.",
                    "ASASP: Automated Symbolic Analysis of Security Policies.",
                    "Backward Trace Slicing for Rewriting Logic Theories.",
                    "Deciding Security for Protocols with Recursive Tests.",
                    "The Matita Interactive Theorem Prover.",
                    "Unification in the Description Logic EL without the Top Concept.",
                    "Model Evolution with Equality Modulo Built-in Theories.",
                    "Blocked Clause Elimination for QBF.",
                    "Extending Sledgehammer with SMT Solvers.",
                    "Automated Cyclic Entailment Proofs in Separation Logic.",
                    "Reducing Higher-Order Theorem Proving to a Sequence of SAT Problems.",
                    "Experimenting with Deduction Modulo.",
                    "Heaps and Data Structures: A Challenge for Automated Provers.",
                    "Optimized Query Rewriting for OWL 2 QL.",
                    "Sort It Out with Monotonicity - Translating between Many-Sorted and Unsorted First-Order Logic.",
                    "Exploiting Symmetry in SMT Problems.",
                    "Compression of Propositional Resolution Proofs via Partial Regularization.",
                    "Dynamic Behavior Matching: A Complexity Analysis and New Approximation Algorithms.",
                    "A Connection-Based Characterization of Bi-intuitionistic Validity.",
                    "Automated Reasoning in ALCQ\\mathcal{ALCQ} via SMT.",
                    "Sine Qua Non for Large Theory Reasoning.",
                    "Predicate Completion for non-Horn Clause Sets.",
                    "System Description: SPASS-FD.",
                    "Cutting to the Chase Solving Linear Integer Arithmetic.",
                    "A Hybrid Method for Probabilistic Satisfiability.",
                    "Solving Systems of Linear Inequalities by Bound Propagation.",
                    "On Transfinite Knuth-Bendix Orders.",
                    "Scala to the Power of Z3: Integrating SMT and Programming.",
                    "Efficient General Unification for XOR with Homomorphism.",
                    "A Dependency Pair Framework for Innermost Complexity Analysis of Term Rewrite Systems.",
                    "Static Analysis of Android Programs.",
                    "Stochastic Differential Dynamic Logic for Stochastic Hybrid Programs.",
                    "Reasoning in the OWL 2 Full Ontology Language Using First-Order Automated Theorem Proving.",
                    "An Efficient Decision Procedure for Imperative Tree Data Structures.",
                    "AC Completion with Termination Tools.",
                    "CSI - A Confluence Tool."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "22nd CADE 2009",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2009",
                "sub_name": "Automated Deduction - CADE-22, 22nd International Conference on Automated Deduction, Montreal, Canada, August 2-7, 2009. Proceedings.",
                "count": 35,
                "papers": [
                    "Integrated Reasoning and Proof Choice Point Selection in the Jahob System - Mechanisms for Program Survival.",
                    "Superposition and Model Evolution Combined.",
                    "On Deciding Satisfiability by DPLL(G+T) and Unsound Theorem Proving.",
                    "Combinable Extensions of Abelian Groups.",
                    "Locality Results for Certain Extensions of Theories with Bridging Functions.",
                    "Axiom Pinpointing in Lightweight Description Logics via Horn-SAT Encoding and Conflict Analysis.",
                    "Does This Set of Clauses Overlap with at Least One MUS?",
                    "Progress in the Development of Automated Theorem Proving for Higher-Order Logic.",
                    "System Description: H-PILoT.",
                    "SPASS Version 3.5.",
                    "Dei: A Theorem Prover for Terms with Integer Exponents.",
                    "veriT: An Open, Trustable and Efficient SMT-Solver.",
                    "Divvy: An ATP Meta-system Based on Axiom Relevance Ordering.",
                    "Instantiation-Based Automated Reasoning: From Theory to Practice.",
                    "Interpolant Generation for UTVPI.",
                    "Ground Interpolation for Combined Theories.",
                    "Interpolation and Symbol Elimination.",
                    "Complexity and Algorithms for Monomial and Clausal Predicate Abstraction.",
                    "Efficient Intuitionistic Theorem Proving with the Polarized Inverse Method.",
                    "A Refined Resolution Calculus for CTL.",
                    "Fair Derivations in Monodic Temporal Reasoning.",
                    "A Term Rewriting Approach to the Automated Termination Analysis of Imperative Programs.",
                    "Solving Non-linear Polynomial Arithmetic via SAT Modulo Linear Arithmetic.",
                    "Building Theorem Provers.",
                    "Termination Analysis by Dependency Pairs and Inductive Theorem Proving.",
                    "Beyond Dependency Graphs.",
                    "Computing Knowledge in Security Protocols under Convergent Equational Theories.",
                    "Complexity of Fractran and Productivity.",
                    "Automated Inference of Finite Unsatisfiability.",
                    "Decidability Results for Saturation-Based Model Building.",
                    "A Tableau Calculus for Regular Grammar Logics with Converse.",
                    "An Optimal On-the-Fly Tableau-Based Decision Procedure for PDL-Satisfiability.",
                    "Volume Computation for Boolean Combination of Linear Arithmetic Constraints.",
                    "A Generalization of Semenov's Theorem to Automata over Real Numbers.",
                    "Real World Verification."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "21st CADE 2007",
        "info": "Bremen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2007",
                "sub_name": "Automated Deduction - CADE-21, 21st International Conference on Automated Deduction, Bremen, Germany, July 17-20, 2007, Proceedings.",
                "count": 38,
                "papers": [
                    "Games, Automata and Matching.",
                    "Formalization of Continuous Probability Distributions.",
                    "Compilation as Rewriting in Higher Order Logic.",
                    "Barendregt's Variable Convention in Rule Inductions.",
                    "Automating Elementary Number-Theoretic Proofs Using Gröbner Bases.",
                    "Optimized Reasoning in Description Logics Using Hypertableaux.",
                    "Conservative Extensions in the Lightweight Description Logic EL.",
                    "An Incremental Technique for Automata-Based Decision Procedures.",
                    "Bidirectional Decision Procedures for the Intuitionistic Propositional Modal Logic IS4.",
                    "A Labelled System for IPL with Variable Splitting.",
                    "Logical Interpretation: Static Program Analysis Using Theorem Proving.",
                    "Solving Quantified Verification Conditions Using Satisfiability Modulo Theories.",
                    "Efficient E-Matching for SMT Solvers.",
                    "T-Decision by Decomposition.",
                    "Towards Efficient Satisfiability Checking for Boolean Algebra with Presburger Arithmetic.",
                    "Improvements in Formula Generalization.",
                    "On the Normalization and Unique Normalization Properties of Term Rewrite Systems.",
                    "Handling Polymorphism in Automated Deduction.",
                    "Automated Reasoning in Kleene Algebra.",
                    "SRASS - A Semantic Relevance Axiom Selection System.",
                    "Labelled Clauses.",
                    "Automatic Decidability and Combinability Revisited.",
                    "Designing Verification Conditions for Software.",
                    "Encodings of Bounded LTL Model Checking in Effectively Propositional Logic.",
                    "Combination Methods for Satisfiability and Model-Checking of Infinite-State Systems.",
                    "The KeY system 1.0 (Deduction Component).",
                    "KeY-C: A Tool for Verification of C Programs.",
                    "The Bedwyr System for Model Checking over Syntactic Expressions.",
                    "System for Automated Deduction (SAD): A Tool for Proof Verification.",
                    "Logical Engineering with Instance-Based Methods.",
                    "Predictive Labeling with Dependency Pairs Using SAT.",
                    "Dependency Pairs for Rewriting with Non-free Constructors.",
                    "Proving Termination by Bounded Increase.",
                    "Certified Size-Change Termination.",
                    "Encoding First Order Proofs in SAT.",
                    "Hyper Tableaux with Equality.",
                    "System Description: E-KRHyper.",
                    "System Description: SpassVersion 3.0."
                ]
            },
            {
                "sub_name_abbr": "conf/cade/2007esarlt",
                "sub_name": "Proceedings of the CADE-21 Workshop on Empirically Successful Automated Reasoning in Large Theories, Bremen, Germany, 17th July 2007.",
                "count": 6,
                "papers": [
                    "Invited talk: Developing Efficient SMT Solvers.",
                    "Extensional Reasoning.",
                    "Semantic Selection of Premisses for Automated Theorem Proving.",
                    "MaLARea: a Metasystem for Automated Reasoning in Large Theories.",
                    "Invited talk: Cyc Design Challenges and Solutions.",
                    "First Order Reasoning on a Large Ontology."
                ]
            },
            {
                "sub_name_abbr": "conf/cade/2007verify",
                "sub_name": "Proceedings of 4th International Verification Workshop in connection with CADE-21, Bremen, Germany, July 15-16, 2007.",
                "count": 16,
                "papers": [
                    "Reflecting Linear Arithmetic: From Dense Linear Orders to Presburger Arithmetic.",
                    "Lightweight Verification with Dependent Types.",
                    "Trends and Challenges in Satisfiability Modulo Theories.",
                    "Formal Device and Programming Model for a Serial Interface.",
                    "A Mechanization of Phylogenetic Trees.",
                    "Combinations of Theories and the Bernays-Schönfinkel-Ramsey Class.",
                    "ALICE: An Advanced Logic for Interactive Component Engineering.",
                    "A History-based Verification of Distributed Applications.",
                    "Symbolic Fault Injection.",
                    "A Termination Checker for Isabelle Hoare Logic.",
                    "The Heterogeneous Tool Set (Hets).",
                    "Fully Verified Java Card API Reference Implementation.",
                    "Automation of Formal Verification of PLC Programs Written in IL.",
                    "Combining Deduction and Algebraic Constraints for Hybrid System Analysis.",
                    "A Sequent Calculus for Integer Arithmetic with Counterexample Generation.",
                    "Inferring Invariants by Symbolic Execution."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th CADE 2005",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2005",
                "sub_name": "Automated Deduction - CADE-20, 20th International Conference on Automated Deduction, Tallinn, Estonia, July 22-27, 2005, Proceedings.",
                "count": 33,
                "papers": [
                    "What Do We Know When We Know That a Theory Is Consistent?.",
                    "Reflecting Proofs in First-Order Logic with Equality.",
                    "Reasoning in Extensional Type Theory with Equality.",
                    "Nominal Techniques in Isabelle/HOL.",
                    "Tabling for Higher-Order Logic Programming.",
                    "A Focusing Inverse Method Theorem Prover for First-Order Linear Logic.",
                    "The CoRe Calculus.",
                    "Simulating Reachability Using First-Order Logic with Applications to Verification of Linked Data Structures.",
                    "Privacy-Sensitive Information Flow with JML.",
                    "The Decidability of the First-Order Theory of Knuth-Bendix Order.",
                    "Well-Nested Context Unification.",
                    "Termination of Rewrite Systems with Shallow Right-Linear, Collapsing, and Right-Ground Rules.",
                    "The OWL Instance Store: System Description.",
                    "Temporal Logics over Transitive States.",
                    "Deciding Monodic Fragments by Temporal Resolution.",
                    "Hierarchic Reasoning in Local Theory Extensions.",
                    "Proof Planning for First-Order Temporal Logic.",
                    "System Description: Multi A Multi-strategy Proof Planner.",
                    "Decision Procedures Customized for Formal Verification.",
                    "An Algorithm for Deciding BAPA: Boolean Algebra with Presburger Arithmetic.",
                    "Connecting Many-Sorted Theories.",
                    "A Proof-Producing Decision Procedure for Real Arithmetic.",
                    "The MathSAT 3 System.",
                    "Deduction with XOR Constraints in Security API Modelling.",
                    "On the Complexity of Equational Horn Clauses.",
                    "A Combination Method for Generating Interpolants.",
                    "sKizzo: A Suite to Evaluate and Certify QBFs.",
                    "Regular Protocols and Attacks with Regular Knowledge.",
                    "The Model Evolution Calculus with Equality.",
                    "Model Representation via Contexts and Implicit Generalizations.",
                    "Proving Properties of Incremental Merkle Trees.",
                    "Computer Search for Counterexamples to Wilkie's Identity.",
                    "KRHyper - In Your Pocket."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "19th CADE 2003",
        "info": "Miami Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2003",
                "sub_name": "Automated Deduction - CADE-19, 19th International Conference on Automated Deduction Miami Beach, FL, USA, July 28 - August 2, 2003, Proceedings.",
                "count": 41,
                "papers": [
                    "SAT-Based Counterexample Guided Abstraction Refinement in Model Checking.",
                    "Equational Abstractions.",
                    "Deciding Inductive Validity of Equations.",
                    "Automating the Dependency Pair Method.",
                    "An AC-Compatible Knuth-Bendix Order.",
                    "The Complexity of Finite Model Reasoning in Description Logics.",
                    "Optimizing a BDD-Based Modal Solver.",
                    "A Translation of Looping Alternating Automata into Description Logics.",
                    "Foundational Certified Code in a Metalogical Framework.",
                    "Proving Pointer Programs in Higher-Order Logic.",
                    "adbmal.",
                    "Subset Types and Partial Functions.",
                    "Reasoning about Quantifiers by Matching in the E-graph.",
                    "A Randomized Satisfability Procedure for Arithmetic and Uninterpreted Function Symbols.",
                    "Superposition Modulo a Shostak Theory.",
                    "Canonization for Disjoint Unions of Theories.",
                    "Matching in a Class of Combined Non-disjoint Theories.",
                    "Reasoning about Iteration in Gödel's Class Theory.",
                    "Algorithms for Ordinal Arithmetic.",
                    "Certifying Solutions to Permutation Group Problems.",
                    "TRP++2.0: A Temporal Resolution Prover.",
                    "IsaPlanner: A Prototype Proof Planner in Isabelle.",
                    "'Living Book': -'Deduction', 'Slicing', 'Interaction'.",
                    "The Homer System.",
                    "The CADE-19 ATP System Competition.",
                    "Proof Search and Proof Check for Equational and Inductive Theorems.",
                    "The New WALDMEISTER Loop at Work.",
                    "About VeriFun.",
                    "How to Prove Inductive Theorems? QUODLIBET!",
                    "Reasoning about Qualitative Representations of Space and Time.",
                    "Superposition with Equivalence Reasoning and Delayed Clause Normal Form Transformation.",
                    "The Model Evolution Calculus.",
                    "Translation of Resolution Proofs into Short First-Order Proofs without Choice Axioms.",
                    "Efficient Instance Retrieval with Standard and Relational Path Indexing.",
                    "Monodic Temporal Resolution.",
                    "A Principle for Incorporating Axioms into the First-Order Translation of Modal Formulae.",
                    "Schematic Saturation for Decision and Unification Problems.",
                    "Unification Modulo ACU I Plus Homomorphisms/Distributivity.",
                    "Source-Tracking Unification.",
                    "Optimizing Higher-Order Pattern Unification.",
                    "Decidability of Arity-Bounded Higher-Order Matching."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "18th CADE 2002",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2002",
                "sub_name": "Automated Deduction - CADE-18, 18th International Conference on Automated Deduction, Copenhagen, Denmark, July 27-30, 2002, Proceedings.",
                "count": 40,
                "papers": [
                    "Reasoning with Expressive Description Logics: Theory and Practice.",
                    "BDD-Based Decision Procedures for K.",
                    "Temporal Logic for Proof-Carrying Code.",
                    "A Gradual Approach to a More Trustworthy, Yet Scalable, Proof-Carrying Code.",
                    "Formal Verification of a Java Compiler in Isabelle.",
                    "Embedding Lax Logic into Intuitionistic Logic.",
                    "Combining Proof-Search and Counter-Model Construction for Deciding Gödel-Dummett Logic.",
                    "Connection-Based Proof Search in Propositional BI Logic.",
                    "DDDLIB: A Library for Solving Quantified Difference Inequalities.",
                    "An LCF-Style Interface between HOL and First-Order Logic.",
                    "System Description: The MathWeb Software Bus for Distributed Mathematical Reasoning.",
                    "Proof Development with OMEGA.",
                    "Learn Omega-matic: System Description.",
                    "HyLoRes 1.0: Direct Resolution for Hybrid Logics.",
                    "Testing Satisfiability of CNF Formulas by Computing a Stable Set of Points.",
                    "A Note on Symmetry Heuristics in SEM.",
                    "A SAT Based Approach for Solving Formulas over Boolean and Linear Mathematical Propositions.",
                    "Deductive Search for Errors in Free Data Type Specifications Using Model Generation.",
                    "Reasoning by Symmetry and Function Ordering in Finite Model Generation.",
                    "Algorithmic Aspects of Herbrand Models Represented by Ground Atoms with Ground Equations.",
                    "A New Clausal Class Decidable by Hyperresolution.",
                    "S PASS Version 2.0.",
                    "System Description: GrAnDe 1.0.",
                    "The HR Program for Theorem Generation.",
                    "AutoBayes/CC - Combining Program Synthesis with Automatic Code Certification - System Description.",
                    "The Quest for Efficient Boolean Satisfiability Solvers.",
                    "Recursive Path Orderings Can Be Context-Sensitive.",
                    "Shostak Light.",
                    "Formal Verification of a Combination Decision Procedure.",
                    "Combining Multisets with Integers.",
                    "The Reflection Theorem: A Study in Meta-theoretic Reasoning.",
                    "Faster Proof Checking in the Edinburgh Logical Framework.",
                    "Solving for Set Variables in Higher-Order Theorem Proving.",
                    "The Complexity of the Graded µ-Calculus.",
                    "Lazy Theorem Proving for Bounded Model Checking over Infinite Domains.",
                    "Well-Foundedness Is Sufficient for Completeness of Ordered Paramodulation.",
                    "Basic Syntactic Mutation.",
                    "The Next W ALDMEISTER Loop.",
                    "Focussing Proof-Net Construction as a Middleware Paradigm.",
                    "Proof Analysis by Resolution."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "17th CADE 2000",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/2000",
                "sub_name": "Automated Deduction - CADE-17, 17th International Conference on Automated Deduction, Pittsburgh, PA, USA, June 17-20, 2000, Proceedings.",
                "count": 49,
                "papers": [
                    "High-Level Verification Using Theorem Proving and Formalized Mathematics.",
                    "Machine Instruction Syntax and Semantics in Higher Order Logic.",
                    "Proof Generation in the Touchstone Theorem Prover.",
                    "Wellfounded Schematic Definitions.",
                    "Abstract Congruence Closure and Specializations.",
                    "A Framework for Cooperating Decision Procedures.",
                    "Modular Reasoning in Isabelle.",
                    "An Infrastructure for Intertheory Reasoning.",
                    "Gödel's Algorithm for Class Formation.",
                    "Automated Proof Construction in Type Theory Using Resolution.",
                    "System Description: TPS: A Theorem Proving System for Type Theory.",
                    "The Nuprl Open Logical Environment.",
                    "System Description: ARA - An Automatic Theorem Prover for Relation Algebras.",
                    "Scalable Knowledge Representation and Reasoning Systems.",
                    "Efficient Minimal Model Generation Using Branching Lemmas.",
                    "FDPLL - A First Order Davis-Putnam-Longeman-Loveland Procedure.",
                    "Rigid E-Unification Revisited.",
                    "Connecting Bits with Floating-Point Numbers: Model Checking and Theorem Proving in Practice.",
                    "Reducing Model Checking of the Many to the Few.",
                    "Simulation Based Minimization.",
                    "Rewriting for Cryptographic Protocol Verification.",
                    "System Description: *SAT: A Platform for the Development of Modal Decision Procedures.",
                    "System Description: DLP.",
                    "Two Techniques to Improve Finite Model Search.",
                    "Eliminating Dummy Elimination.",
                    "Extending Decision Procedures with Induction Schemes.",
                    "Complete Monotonic Semantic Path Orderings.",
                    "Stratified Resolution.",
                    "Support Ordered Resolution.",
                    "System Description: IVY.",
                    "System Description: SystemOn TPTP.",
                    "System Description: PTTP+GLiDes: Semantically Guided PTTP.",
                    "A Formalization of a Concurrent Object Calculus up to alpha-Conversion.",
                    "A Resolution Decision Procedure for Fluted Logic.",
                    "ZRES: The Old Davis-Putman Procedure Meets ZBDD.",
                    "System Description: MBASE, an Open Mathematical Knowledge Base.",
                    "System Description: TRAMP: Transformation of Machine-Found Proofs into ND-Proofs at the Assertion Level.",
                    "On Unification for Bonded Distributive Lattices.",
                    "Reasoning with Individuals for the Description Logic SHIQ.",
                    "System Description: Embedding Verification into Microsoft Excel.",
                    "System Description: Interactive Proof Critics in XBarnacle.",
                    "Tutorial: Meta-logical Frameworks.",
                    "Tutorial: Automated Deduction and Natural Language Understanding.",
                    "Tutorial: Using TPS for Higher-Order Theorem Proving and ETPS for Teaching Logic.",
                    "Workshop: Model Computation - Principles, Algorithms, Applications.",
                    "Workshop: Automation of Proofs by Mathematical Induction.",
                    "Workshop: Type-Theoretic Languages: Proof-Search and Semantics.",
                    "Workshop: Automated Deduction in Education.",
                    "Workshop: The Role of Automated Deduction in Mathematics."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "16th CADE 1999",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1999",
                "sub_name": "Automated Deduction - CADE-16, 16th International Conference on Automated Deduction, Trento, Italy, July 7-10, 1999, Proceedings.",
                "count": 40,
                "papers": [
                    "A dynamic programming approach to categorial deduction.",
                    "Tractable Transformations from Modal Provability Logics into First-Order Logic.",
                    "Invited Talk: Decision procedures for guarded logics.",
                    "A PSpace Algorithm for Graded Modal Logic.",
                    "Solvability of Context Equations with Two Context Variables is Decidable.",
                    "Complexity of the higher order matching.",
                    "Solving Equational Problems Efficiently.",
                    "VSDITLU: a verifiable symbolic definite integral table look-up.",
                    "A Framework for the Flexible Integration of a Class of Decision Procedures into Theorem Provers.",
                    "Presenting Proofs in a Human-Oriented Way.",
                    "On the Universal Theory of Varieties of Distributive Lattices with Operators: Some Decidability and Complexity Results.",
                    "Maslov's Class K Revisited.",
                    "Prefixed Resolution: A Resolution Method for Modal and Description Logics.",
                    "System Description: Twelf - A Meta-Logical Framework for Deductive Systems.",
                    "System Description: inka 5.0 - A Logic Voyager.",
                    "System Description: CutRes 0.1: Cut Elimination by Resolution.",
                    "System Description: MathWeb, an Agent-Based Communication Layer for Distributed Automated Theorem Proving.",
                    "System Description: Using OBDD's for the validation of Skolem verification conditions.",
                    "Fault-Tolerant Distributed Theorem Proving.",
                    "System Description: Waldmeister - Improvements in Performance and Ease of Use.",
                    "Formal Metatheory using Implicit Syntax, and an Application to Data Abstraction for Asynchronous Systems.",
                    "A formalization of Static Analyses in System F.",
                    "On Explicit Reflection in Theorem Proving and Formal Verification.",
                    "System Description: Kimba, A Model Generator for Many-Valued First-Order Logics.",
                    "System Description: Teyjus - A Compiler and Abstract Machine Based Implementation of lambda-Prolog.",
                    "Vampire.",
                    "System Abstract: E 0.3.",
                    "Invited Talk: Rewrite-based Deduction and Symbolic Constraints.",
                    "Towards an Automatic Analysis of Security Protocols in First-Order Logic.",
                    "A Confluent Connection Calculus.",
                    "Abstraction-Based Relevancy Testing for Model Elimination.",
                    "A Breadth-First Strategy for Mating Search.",
                    "The Design of the CADE-16 Inductive Theorem Prover Contest.",
                    "System Description: Spass Version 1.0.0.",
                    "KK: a theorem prover for K.",
                    "System Description: CyNTHIA.",
                    "System Description: MCS: Model-based Conjecture Searching.",
                    "Invited Talk: Embedding Programming Languages in Theorem Provers (Abstract).",
                    "Extensional Higher-Order Paramodulation and RUE-Resolution.",
                    "Automatic Generation of Proof Search Strategies for Second-order Logic."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "15th CADE 1998",
        "info": "Lindau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1998",
                "sub_name": "Automated Deduction - CADE-15, 15th International Conference on Automated Deduction, Lindau, Germany, July 5-10, 1998, Proceedings.",
                "count": 37,
                "papers": [
                    "Reasoning About Deductions in Linear Logic (Abstract of Invited Talk).",
                    "A Combination of Nonstandard Analysis and Geometry Theorem Proving, with Application to Newton's Principia.",
                    "Proving Geometric Theorems Using Clifford Algebra and Rewrite Rules.",
                    "System Description: Similarity-Based Lemma Generation for Model Elimination.",
                    "System Description: Verification of Distributed Erlang Programs.",
                    "System Description: Cooperation in Model Elimination: CPTHEO.",
                    "System Description: card TAP: The First Theorem Prover on a Smart Card.",
                    "System Description: leanK 2.0.",
                    "Extensional Higher-Order Resolution.",
                    "X.R.S : Explicit Reduction Systems - A First-Order Calculus for Higher-Order Calculi.",
                    "About the Confluence of Equational Pattern Rewrite Systems.",
                    "Unification in Lambda-Calculi with if-then-else.",
                    "System Description: An Equational Constraints Solver.",
                    "System Description: CRIL Platform for SAT.",
                    "System Description: Proof Planning in Higher-Order Logic with Lambda-Clam.",
                    "System Description: An Interface Between CLAM and HOL.",
                    "System Description: LEO - A Higher-Order Theorem Prover.",
                    "Superposition for Divisible Torsion-Free Abelian Groups.",
                    "Strict Basic Superposition.",
                    "Elimination of Equality via Transformation with Ordering Constraints.",
                    "A Resolution Decision Procedure for the Guarded Fragment.",
                    "Combining Hilbert Style and Semantic Reasoning in a Resolution Framework.",
                    "ACL2 Support for Verification Projects (Invited Talk).",
                    "A Fast Algorithm for Uniform Semi-Unification.",
                    "Termination Analysis by Inductive Evaluation.",
                    "Admissibility of Fixpoint Induction over Partial Types.",
                    "Automated Theorem Proving in a Simple Meta-Logic for LF.",
                    "Deductive vs. Model-Theoretic Approaches to Formal Verification (Abstract of Invited Talk).",
                    "Automated Deduction of Finite-State Control Programs for Reactive Systems.",
                    "A Proof Environment for the Development of Group Communication Systems.",
                    "On the Relationship Between Non-Horn Magic Sets and Relevancy Testing.",
                    "A Certified Version of Buchberger's Algorithm.",
                    "Selectively Instantiating Definitions.",
                    "Using Matings for Pruning Connection Tableaux.",
                    "On Generating Small Clause Normal Forms.",
                    "Rank/Activity: A Canonical Form for Binary Resolution.",
                    "Towards Efficient Subsumption."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "14th CADE 1997",
        "info": "Townsville, North Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1997",
                "sub_name": "Automated Deduction - CADE-14, 14th International Conference on Automated Deduction, Townsville, North Queensland, Australia, July 13-17, 1997, Proceedings.",
                "count": 44,
                "papers": [
                    "The Char-Set Method and Its Applications to Automated Reasoning.",
                    "Decidable Call by Need Computations in term Rewriting (Extended Abstract).",
                    "A New Approach for Combining Decision Procedure for the Word Problem, and Its Connection to the Nelson-Oppen Combination Method.",
                    "On Equality Up-to Constraints over Finite Trees, Context Unification, and One-Step Rewriting.",
                    "Dedan: A Kernel of Data Structures and Algorithms for Automated Deduction with Equality Clauses.",
                    "The Clause-Diffusion Theorem Prover Peers-mcd (System Description).",
                    "Integration of Automated and Interactive Theorem Proving in ILP.",
                    "ILF-SETHEO: Processing Model Elimination Proofs for Natural Language Output.",
                    "SETHEO Goes Software Engineering: Application of ATP to Software Reuse.",
                    "Proving System Correctness with KIV 3.0.",
                    "A Practical Symbolic Algorithm for the Inverse Kinematics of 6R Manipulators with Simple Geometry.",
                    "Automatic Verification of Cryptographic Protocols with SETHEO.",
                    "A Practical Integration of First-Order Reasoning and Decision Procedures.",
                    "Some Pitfalls of LK-to-LJ Translations and How to Avoid Them.",
                    "Deciding Intuitionistic Propositional Logic via Translation into Classical Logic.",
                    "Lemma Matching for a PTTP-based Top-down Theorem Prover.",
                    "Exact Kanowledge Compilation in Predicate Calculus: The Partial Achievement Case.",
                    "Non-Horn Magic Sets to Incorporate Top-down Inference into Bottom-up Theorem Proving.",
                    "Alternating Automata: Unifying Truth and Validity Checking for Temporal Logics.",
                    "Connection-Based Proof Construction in Linear Logic.",
                    "Resource-Distribution via Boolean Constraint (Extended Abstract).",
                    "Constructing a Normal Form for Property Theory.",
                    "Omega: Towards a Mathematical Assistant.",
                    "Plagiator - A Learning Prover.",
                    "CODE: A Powerful Prover for Problems of Condensed Detachment.",
                    "A New Method for Testing Decision Procedures in Modal Logics.",
                    "Minlog: A Minimal Logic Theorem Prover.",
                    "SATO: An Efficient Propositional Prover.",
                    "Using A Generalisation Critic to Find Bisimulations for Coinductive Proofs.",
                    "A Colored Version of the Lambda-Calculus.",
                    "A Practical Implementation of Simple Consequence Relations Using Inductive Definitions.",
                    "Soft Typing for Ordered Resolution.",
                    "A Classification of Non-liftable Orders for Resolution.",
                    "Hybrid Interactive Theorem Proving Using Nuprl and HOL.",
                    "Proof Tactics for a Theory of State Machines in a Graphical Environment.",
                    "RALL: Machine-Supported Proofs for Relation Algebra.",
                    "Nuprl-Light: An Implementation Framework for Higher-Order Logics.",
                    "XIsabelle: A System Description.",
                    "XBarnacle: Making Theorem Provers More Accessible.",
                    "The Tableau Browser SNARKS.",
                    "Jape: A Calculator for Animating Proof-on-Paper.",
                    "Evolving Combinators.",
                    "Partial Matching for Analogy Discovery in Proofs and Counter-Examples.",
                    "DiaLog: A System for Dialogue Logic."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "13th CADE 1996",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1996",
                "sub_name": "Automated Deduction - CADE-13, 13th International Conference on Automated Deduction, New Brunswick, NJ, USA, July 30 - August 3, 1996, Proceedings.",
                "count": 63,
                "papers": [
                    "Saturation-Based Theorem Proving: Past Successes and Future Potential (Abstract).",
                    "A Resolution Theorem Prover for Intuitonistic Logic.",
                    "Proof-Terms for Classical and Intuitionistic Resolution (Extended Abstract).",
                    "Proof-Search in Intuitionistic Logic with Equality, or Back to Simultaneous Rigid E-Unification.",
                    "Extensions to a Generalization Critic for Inductive Proof.",
                    "Learning Domain Knowledge to Improve Theorem Proving.",
                    "Patching Faulty Conjectures.",
                    "Internal Analogy in Theorem Proving.",
                    "Termination of Theorem Proving by Reuse.",
                    "Termination of Algorithms over Non-freely Generated Data Types.",
                    "ABSFOL: A Proof Checker with Abstraction.",
                    "SPASS & FLOTTER Version 0.42.",
                    "The Design of the CADE-13 ATP System Competition.",
                    "SCAN - Elimination of Predicate Quantifiers.",
                    "GEOTHER: A Geometry Theorem Prover.",
                    "Structuring Metatheory on Inductive Definitions.",
                    "An Embedding of Ruby in Isabelle.",
                    "Mechanical Verification of Mutually Recursive Procedures.",
                    "FasTraC: A Decentralized Traffic Control System Based on Logic Programming.",
                    "Presenting Machine-Found Proofs.",
                    "MUltlog 1.0: Towards an Expert System for Many-Valued Logics.",
                    "CtCoq: A System Presentation.",
                    "An Introduction to Geometry Expert.",
                    "SiCoTHEO: Simple Competitive Parallel Theorem Provers.",
                    "What Can We Hope to Achieve From Automated Deduction? (Abstract).",
                    "Unification Algorithms Cannot be Combined in Polynomial Time.",
                    "Unification and Matching Modulo Nilpotence.",
                    "An Improved Lower Bound for the Elementary Theories of Trees.",
                    "INKA: The Next Generation.",
                    "XRay: A Prolog Technology Theorem Prover for Default Reasoning: A System Description.",
                    "IMPS: An Updated System Description.",
                    "The Tableau-based Theorem Prover 3TAP Version 4.0.",
                    "System Description: Generating Models by SEM.",
                    "Optimizing Proof Search in Model Elimination.",
                    "An Abstract Machine for Fixed-Order Dynamically Stratified Programs.",
                    "Unification in Pseudo-Linear Sort Theories is Decidable.",
                    "Theorem Proving with Group Presentations: Examples and Questions.",
                    "Transforming Termination by Self-Labelling.",
                    "Theorem Proving in Cancellative Abelian Monoids (Extended Abstract).",
                    "On the Practical Value of Different Definitional Translations to Normal Form.",
                    "Converting Non-Classical Matrix Proofs into Sequent-Style Systems.",
                    "Efficient Model Generation through Compilation.",
                    "Algebra and Automated Deduction.",
                    "On Shostak's Decision Procedure for Combinations of Theories.",
                    "Ground Resolution with Group Computations on Semantic Symmetries.",
                    "A New Method for Knowledge Compilation: The Achievement by Cycle Search.",
                    "Rewrite Semantics for Production Rule Systems: Theory and Applications.",
                    "Experiments in the Heuristic Use of Past Proof Experience.",
                    "Lemma Discovery in Automated Induction.",
                    "Advanced Indexing Operations on Substitution Trees.",
                    "Semantic Trees Revisited: Some New Completeness Results.",
                    "Building Decision Procedures for Modal Logics from Propositional Decision Procedure - The Case Study of Modal K.",
                    "Resolution-Based Calculi for Modal and Temporal Logics.",
                    "Tableaux and Algorithms for Propositional Dynamic Logic with Converse.",
                    "Reflection of Formal Tactics in a Deductive Reflection Framework.",
                    "Walther Recursion.",
                    "Proof Search with Set Variable Instantiation in the Calculus of Constructions.",
                    "Search Strategies for Resolution in Temporal Logics.",
                    "Optimal Axiomatizations for Multiple-Valued Operators and Quantifiers Based on Semi-lattices.",
                    "Grammar Specification in Categorial Logics and Theorem Proving.",
                    "Path Indexing for AC-Theories.",
                    "More Church-Rosser Proofs (in Isabelle/HOL).",
                    "Partitioning Methods for Satisfiability Testing on Large Formulas."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "12th CADE 1994",
        "info": "Nancy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1994",
                "sub_name": "Automated Deduction - CADE-12, 12th International Conference on Automated Deduction, Nancy, France, June 26 - July 1, 1994, Proceedings.",
                "count": 73,
                "papers": [
                    "The Crisis in Finite Mathematics: Automated Reasoning as Cause and Cure.",
                    "A Divergence Critic.",
                    "Synthesis of Induction Orderings for Existence Proofs.",
                    "Lazy Generation of Induction Hypotheses.",
                    "The Search Efficiency of Theorem Proving Strategies.",
                    "A Method for Building Models Automatically. Experiments with an Extension of OTTER.",
                    "Model Elimination Without Contrapositives.",
                    "Induction using Term Orderings.",
                    "Mechanizable Inductive Proofs for a Class of Forall Exists Formulas.",
                    "On the Connection between Narrowing and Proof by Consistency.",
                    "A Fixedpoint Approach to Implementing (Co)Inductive Definitions.",
                    "On Notions of Inductive Validity for First-Oder Equational Clauses.",
                    "A New Application for Explanation-Based Generalisation within Automated Deduction.",
                    "Semantically Guided First-Order Theorem Proving using Hyper-Linking.",
                    "The Applicability of Logic Program Analysis and Transformation to Theorem Proving.",
                    "Detecting Non-Provable Goals.",
                    "Panel Discussion: A Mechanically Proof-Checked Encyclopedia of Mathematics: Should We Build One? Can We?",
                    "The QED Manifesto.",
                    "The TPTP Problem Library.",
                    "Combination Techniques for Non-Disjoint Equational Theories.",
                    "Primal Grammars and Unification Modulo a Binary Clause.",
                    "Conservative Query Normalization on Parallel Circumscription.",
                    "Bottom-up Evaluation of Datalog Programs with Arithmetic Constraints.",
                    "On Intuitionistic Query Answering in Description Bases.",
                    "Deductive Composition of Astronomical Software from Subroutine Libraries.",
                    "Proof Script Pragmatics in IMPS.",
                    "A Mechanization of Strong Kleene Logic for Partial Functions.",
                    "Algebraic Factoring and Geometry Proving.",
                    "Mechanically Proving Geometry Theorems Using a Combination of Wu's Method and Collins' Method.",
                    "Str+ve and Integers.",
                    "What is a Proof? (Abstract).",
                    "Termination, Geometry and Invariants.",
                    "Ordered Chaining for Total Orderings.",
                    "Simple Termination Revisited.",
                    "Termination Orderings for Rippling.",
                    "A Novel Asynchronous Parallelism Scheme for First-Order Logic.",
                    "Proving with BDDs and Control of Information.",
                    "Extended Path-Indexing.",
                    "Exporting and Refecting Abstract Metamathematics.",
                    "Associative-Commutative Deduction with Constraints.",
                    "AC-Superposition with Constraints: No AC-Unifiers Needed.",
                    "The Complexity of Counting Problems in Equational Matching.",
                    "Representing Proof Transformations for Program Optimizations.",
                    "Exploring Abstract Algebra in Constructive Type Theory.",
                    "Tactic Theorem Proving with Refinement-Tree Proofs and Metavariables.",
                    "Unification in an Extensional Lambda Calculus with Ordered Function Sorts and Constant Overloading.",
                    "Decidable Higher-Order Unification Problems.",
                    "Theory and Practice of Minimal Modular Higher-Order E-Unification.",
                    "A Refined Version of General E-Unification.",
                    "A Completion-Based Method for Mixed Universal and Rigid E-Unification.",
                    "On Pot, Pans and Pudding or How to Discover Generalised Critical Pairs.",
                    "Semantic Tableaux with Ordering Restrictions.",
                    "Strongly Analytic Tableaux for Normal Modal Logics.",
                    "Reconstruction Proofs at the Assertion Level.",
                    "Problems on the Generation of Finite Models.",
                    "Combining Symbolic Computation and Theorem Proving: Some Problems of Ramanujan.",
                    "SCOTT: Semantically Constrained Otter System Description.",
                    "PROTEIN: A PROver with a Theory Extension INterface.",
                    "DELTA - A Bottom-up Preprocessor for Top-Down Theorem Provers - System Abstract.",
                    "SETHEO V3.2: Recent Developments - System Abstract.",
                    "KoMeT.",
                    "Omega-MKRP: A Proof Development Environment.",
                    "leanTAP: Lean Tableau-Based Theorem Proving (Extended Abstract).",
                    "FINDER: Finite Domain Enumerator - System Description.",
                    "Symlog: Automated Advice in Fitch-style Proof Construction.",
                    "KEIM: A Toolkit for Automated Deduction.",
                    "Elf: A Meta-Language for Deductive Systems (System Descrition).",
                    "EUODHILOS-II on Top of GNU Epoch.",
                    "Pi: an Interactive Derivation Editor for the Calculus of Partial Inductive Definitions.",
                    "Mollusc: A General Proof-Development Shell for Sequent-Based Logics.",
                    "KITP-93: An Automated Inference System for Program Analysis.",
                    "SPIKE: a System for Sufficient Completeness and Parameterized Inductive Proofs.",
                    "Distributed Theorem Proving by Peers."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "11th CADE 1992",
        "info": "Saratoga Springs, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1992",
                "sub_name": "Automated Deduction - CADE-11, 11th International Conference on Automated Deduction, Saratoga Springs, NY, USA, June 15-18, 1992, Proceedings.",
                "count": 74,
                "papers": [
                    "The Impossibility of the Automation of Logical Reasoning.",
                    "Automatic Proofs in Mathematical Logic and Analysis.",
                    "Proving Geometry Statements of Constructive Type.",
                    "The Central Variable Strategy of Str+ve.",
                    "Unification in the Union of Disjoint Equational Theories: Combining Decision Procedures.",
                    "Reduction and Unification in Lambda Calculi with Subtypes.",
                    "A Combinatory Logic Approach to Higher-order E-unification (Extended Abstract).",
                    "Cycle Unification.",
                    "A Parallel Completion Procedure for Term Rewriting Systems.",
                    "Grammar Rewriting.",
                    "Polynomial Interpretations and the Complexity of Algorithms.",
                    "Uniform Traversal Combinators: Definition, Use and Properties.",
                    "Sorted Unification Using Set Constraints.",
                    "An Abstract View of Sorted Unification.",
                    "Unification in Order-Sorted Algebras with Overloading.",
                    "Puzzles and Paradoxes (Abstract).",
                    "Experiments in Automated Deduction with Condensed Detachment.",
                    "Caching and Lemmaizing in Model Elimination Theorem Provers.",
                    "LIM+ Challenge Problems by RUE Hyper-Resolution.",
                    "Computing Prime Implicates Incrementally.",
                    "Linear-Input Subset Analysis.",
                    "Theoretical Study of Symmetries in Propositional Calculus and Applications.",
                    "Difference Matching.",
                    "Using Middle-Out Reasoning to Control the Synthesis of Tail-Recursive Programs.",
                    "The Use of Proof Plans to Sum Series.",
                    "Disproving Conjectures.",
                    "An Interval-based Temporal Logic in a Multivalued Setting.",
                    "A Normal Form for First-Order Temporal Formulae.",
                    "Semantic Entailment in Non Classical Logics Based on Proofs Found in Classical Logic.",
                    "Embedding Negation as Failure into a Model Generation Theorem Prover.",
                    "Automated Correctness Proofs of Machine Code Programs for a Commercial Microprocessor.",
                    "Proving the Chinese Remainder Theorem by the Cover Set Induction.",
                    "Automatic Program Optimization Through Proof Transformation.",
                    "Basic Paramodulation and Superposition.",
                    "Theorem Proving with Ordering Constrained Clauses.",
                    "The Special-Relation Rules are Incomplete.",
                    "An Improved Method for Adding Equality to Free Variable Semantic Tableaux.",
                    "Proof Search in the Intuitionistic Sequent Calculus.",
                    "Implementing the Meta-Theory of Deductive Systems.",
                    "Tactic-based Theorem Proving and Knowledge-based Forward Chaining: an Experiment with Nuprl and Ontic.",
                    "Little Theories.",
                    "Some Termination Criteria for Narrowing and E-Narrowing.",
                    "Decidable Matching for Convergent Systems (Preliminary Version).",
                    "Free Sequentially in Orthogonal Order-Sorted Rewriting Systems with Constructors.",
                    "Programming with Equations: A Framework for Lazy Parallel Evaluation.",
                    "A Many Sorted Logic with Possibly Empty Sorts.",
                    "Theorem Proving in Non-Standard Logics Based on the Inverse Method.",
                    "One More Logic with Uncertainty and Resolution Principle for it.",
                    "A Natural Deduction Automated Theorem Proving System.",
                    "Isabelle-91.",
                    "The Semantically Guided Linear Deduction System.",
                    "The SHUNYATA System.",
                    "A Geometry Theorem Prover for Macintoshes.",
                    "FRI: Failure-Resistant Induction in RRL.",
                    "Herky: High Performance Rewriting in RRL.",
                    "IMPS: System Description.",
                    "Proving Equality Theorems with Hyper-Linking.",
                    "Xpnet: A Graphical Interface to Proof Nets with an Efficient Proof Checker.",
                    "&: Automated Natural Deduction.",
                    "An Overview of FRAPPS 2.0: A Framework for Resolution-based Automated Proof Procedure Systems.",
                    "The GAZER Theorem Prover.",
                    "ROO: A Parallel Theorem Prover.",
                    "RVF: An Automated Formal Verification System.",
                    "KPROP - An AND-parallel Theorem Prover for Propositional Logic implemented in KL1 (System Abstract).",
                    "A Report in ICL HOL.",
                    "PVS: A Prototype Verification System.",
                    "The KIV System: Systematic Construction of Verified Software.",
                    "The Tableau-Based Theorem Prover 3TAP for Multi-Valued Logics.",
                    "Analytica - A Theorem Prover in Mathematica.",
                    "The FAUST - Prover.",
                    "Eves System Description.",
                    "MGTP: A Parallel Theorem Prover Based on Lazy Model Generation.",
                    "Benchmark Problems in Which Equality Plays the Major Role.",
                    "Computing Transivity Tables: A Challenge For Automated Theorem Provers."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "10th CADE 1990",
        "info": "Kaiserslautern, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1990",
                "sub_name": "10th International Conference on Automated Deduction, Kaiserslautern, FRG, July 24-27, 1990, Proceedings.",
                "count": 74,
                "papers": [
                    "A Theorem Prover for a Computational Logic.",
                    "A Complete Semantic Back Chaining Proof System.",
                    "Parallelizing the Closure Computation in Automated Deduction.",
                    "PARTHEO: A High-Performance Parallel Theorem Prover.",
                    "Substitution-based Compilation of Extended Rules in Deductive Databases.",
                    "Automatic Theorem Proving in Paraconsistent Logics: Theory and Implementation.",
                    "Case-Free Programs: An Abstraction of Definite Horn Programs.",
                    "Generalized Well-founded Semantics for Logic Programs (Extended Abstract).",
                    "Tactical Theorem Proving in Program Verification.",
                    "Extensions to the Rippling-Out Tactic for Guiding Inductive Proofs.",
                    "Guiding Induction Proofs.",
                    "Term Rewriting Induction.",
                    "A Resolution Principle for Clauses with Constraints.",
                    "Str+ve-Subset: The Str+ve-based Subset Prover.",
                    "Ritt-Wu's Decomposition Algorithm and Geometry Theorem Proving.",
                    "Encoding a Dependent-Type Lambda-Calculus in a Logic Programming Language.",
                    "Investigations into Proof-Search in a System of First-Order Dependent Function Types.",
                    "Equality of Terms Containing Associative-Commutative Functions and Commutative Binding Operators in Isomorphism Complete.",
                    "An Improved General E-Unification Method.",
                    "Some Results on Equational Unification.",
                    "Unification in a Combination of Equational Theories: an Efficient Algorithm.",
                    "SLIM: An Automated Reasoner For Equivalences, Applied To Set Theory.",
                    "An Examination of the Prolog Technology Theorem-Prover.",
                    "Presenting Intuitive Deductions via Symmetric Simplification.",
                    "Toward Mechanical Methods for Streamlining Proofs.",
                    "Ordered Rewriting and Confluence.",
                    "Complete Sets of Reductions with Constraints.",
                    "Rewrite Systems for Varieties of Semigroups.",
                    "Improving Assoviative Path Orderings.",
                    "Perspectives on Automated Deduction (Abstract).",
                    "On Restrictions of Ordered Paramodulation with Simplification.",
                    "Simultaneous Paramodulation.",
                    "Hyper Resolution and Equality Axioms without Function Substitutions.",
                    "Automatic Acquisition of Search Guiding Heuristics.",
                    "Automated Reasoning Contributed to Mathematics and Logic.",
                    "A Mechanically Assisted Constructive Proof in Category Theory.",
                    "Dynamic Logic as a Uniform Framework for Theorem Proving in Intensional Logic.",
                    "A Tableau-Based Theorem Prover for a Decidable Subset of Default Logic.",
                    "Computing Prime Implicants.",
                    "Minimizing the Number of Clauses by Renaming.",
                    "Higher Order E-Unification.",
                    "Programming by Example and Proving by Example Using Higher-order Unification.",
                    "Retrieving Library Identifiers via Equational Matching of Types.",
                    "Unification in Monoidal Theories.",
                    "A Science of Reasoning: Extended Abstract.",
                    "The TPS Theorem Proving System.",
                    "Schemata.",
                    "Cylindric Algebra Equation Solver.",
                    "The Oyster-Clam System.",
                    "A High-Performance Parallel Theorem Prover.",
                    "The Romulus Proof Checker.",
                    "IMPS: An Interactive Mathematical Proof System.",
                    "UNICOM: A Refined Completion Based Inductive Theorem Prover.",
                    "The Theorem Prover of the Program Verifier Tatzelwurm.",
                    "RCL: A Lisp Verification System.",
                    "ORME: An Implementation of Completion Procedures as Sets of Transition Rules.",
                    "OTTER 2.0.",
                    "DISSOLVER: A Dissolution-based Theorem Prover.",
                    "TRIP: An Implementation of Clausal Rewriting.",
                    "OSCAR.",
                    "EXPERT THINKER: An Adaptation of F-Prolog to Microcomputers.",
                    "A Prolog Technology Theorem Prover.",
                    "A General Clause Theorem Prover.",
                    "LISS - The Logic Inference Search System.",
                    "ACE: The Abstract Clause Engine.",
                    "Tutorial on High-Performance Automated Theorem Proving.",
                    "Tutorial on Reasoning and Representation with Concept Languages.",
                    "Tutorial on Lambda-Prolog.",
                    "Tutorial on Equational Unification.",
                    "Tutorial on Compilation techniques for Logics.",
                    "Tutorial on High-Performance Theorem Provers: Efficient Implementation and Parallelisation.",
                    "Tutorial on Rewrite-Based Theorem Proving.",
                    "Tutorial on Program-Synthetic Deduction.",
                    "Tutorial on Computing Models of Propositional Logics."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "9th CADE 1988",
        "info": "Argonne, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1988",
                "sub_name": "9th International Conference on Automated Deduction, Argonne, Illinois, USA, May 23-26, 1988, Proceedings.",
                "count": 73,
                "papers": [
                    "First-Order Theorem Proving Using Conditional Rewrite Rules.",
                    "Elements of Z-Module Reasoning.",
                    "Learning and Applying Generalised Solutions using Higher Order Resolution.",
                    "Specifying Theorem Provers in a Higher-Order Logic Programming Language.",
                    "Query Processing in Quantitative Logic Programming.",
                    "An Environment For Automated Reasoning About Partial Functions.",
                    "The Use of Explicit Plans to Guide Inductive Proofs.",
                    "LOGICALC: An Environment for Interactive Proof Development.",
                    "Implementing Verification Strategies in the KIV-System.",
                    "Checking Natural Language Proofs.",
                    "Consistency of Rule-based Expert System.",
                    "A Mechanizable Induction Principle for Equational Specifications.",
                    "Finding Canonical Rewriting Systems Equivalent to a Finite Set of Ground Equations in Polynomial Time.",
                    "Towards Efficient \"Knowledge-Based\" Automated Theorem Proving for Non-Standard Logics.",
                    "Propositional Temporal Interval Logic is PSPACE Complete.",
                    "Computational Metatheory in Nuprl.",
                    "Type Inference in Prolog.",
                    "Procedural Interpretation of Non-Horn Logic Programs.",
                    "Recursive Query Answering with Non-Horn Clauses.",
                    "Case Inference in Resolution-Based Languages.",
                    "Notes on Prolog Program Transformations, Prolog Style, and Efficient Compilation to The Warren Abstract Machine.",
                    "Exploitation of Parallelism in Prototypical Deduction Problems.",
                    "A Decision Procedure for Unquantified Formulas of Graph Theory.",
                    "Adventures in Associative-Commutative Unification (A Summary).",
                    "Unification in Finite Algebras is Unitary (?).",
                    "Unification in a Combination of Arbitrary Disjoint Equational Theories.",
                    "Partial Unification for Graph Based Equational Reasoning.",
                    "SATCHMO: A Theorem Prover Implemented in Prolog.",
                    "Term Rewriting: Some Experimental Results.",
                    "Analogical Reasoning and Proof Discovery.",
                    "Hyper-Chaining and Knowledge-Based Theorem Proving.",
                    "Linear Modal Deductions.",
                    "A Resolution Calculus for Modal Logics.",
                    "Solving Disequations in Equational Theories.",
                    "On Word Problems in Horn Theories.",
                    "Canonical Conditional Rewrite Systems.",
                    "Program Synthesis by Completion with Dependent Subtypes.",
                    "Reasoning about Systems of Linear Inequalities.",
                    "A Subsumption Algorithm Based on Characteristic Matrices.",
                    "A Restriction of Factoring in Binary Resolution.",
                    "Supposition-Based Logic for Automated Nonmontonic Reasoning.",
                    "Argument-Bounded Algorithms as a Basis for Automated Termination Proofs.",
                    "Two Automated Methods in Implementation Proofs.",
                    "A New Approach to Universal Unification and Its Application to AC-Unification.",
                    "An Implementation of a Dissolution-Based System Employing Theory Links.",
                    "Decision Procedure for Autoepistemic Logic.",
                    "Logical Matrix Generation and Testing.",
                    "Optimal Time Bounds for Parallel Term Matching.",
                    "Challenge Equality Problems in Lattice Theory.",
                    "Single Axioms in the Implicational Propositional Calculus.",
                    "Challenge Problems Focusing on Equality and Combinatory Logic: Evaluating Automated Theorem-Proving Programs.",
                    "Challenge Problems from Nonassociative Rings for Theorem Provers.",
                    "An Interactive Enhancement to the Boyer-Moore Theorem Prover.",
                    "A Goal Directed Theorem Prover.",
                    "m-NEVER System Summary.",
                    "EFS - An Interactive Environment for Formal Systems.",
                    "Ontic: A Knowledge Representation System for Mathematics.",
                    "Some Tools for an Inference Laboratory (ATINF).",
                    "QUANTLOG: A System for Approximate Reasoning in Inconsistent Formal Systems.",
                    "LP: The Larch Prover.",
                    "The KLAUS Automated Deduction System.",
                    "A Prolog Technology Theorem Prover.",
                    "Lambda-Prolog: An Extended Logic Programming Language.",
                    "SYMEVAL: A Theorem Prover Based on the Experimental Logic.",
                    "ZPLAN: An Automatic Reasoning System for Situations.",
                    "The TPS Theorem Proving System.",
                    "MOLOG: a Modal PROLOG.",
                    "PARTHENON: A Parallel Theorem Prover for Non-Horn Clauses.",
                    "An nH-Prolog Implementation.",
                    "RRL: A Rewrite Rule Laboratory.",
                    "GEOMETER: A Theorem Prover for Algebraic Geometry.",
                    "Isabelle: The Next Seven Hundred Theorem Provers.",
                    "The CHIP System: Constraint Handling In Prolog."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "8th CADE 1986",
        "info": "Oxford, England",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1986",
                "sub_name": "8th International Conference on Automated Deduction, Oxford, England, July 27 - August 1, 1986, Proceedings.",
                "count": 72,
                "papers": [
                    "Connections and Higher-Order Logic.",
                    "Commutation, Transformation, and Termination.",
                    "Full-Commutation and Fair-Termination in Equational (and Combined) Term-Rewriting Systems.",
                    "An Actual Implementation of a Procedure That Mechanically Proves Termination of Rewriting Systems Based on Inequalities Between Polynomial Interpretations.",
                    "Proving Termination of Associative Commutative Rewriting Systems by Rewriting.",
                    "Relating Resolution and Algebraic Completion for Horn Logic.",
                    "A Simple Non-Termination Test for the Knuth-Bendix Method.",
                    "A New Formula for the Execution of Categorial Combinators.",
                    "Proof by Induction Using Test Sets.",
                    "How to Prove Equivalence of Term Rewriting Systems without Induction.",
                    "Sufficient Completness, Term Rewriting Systems and \"Anti-Unification\".",
                    "A New Method for Establishing Refutational Completeness in Theorem Proving.",
                    "Some Contributions to the Logical Analysis of Circumscrition.",
                    "Modal Theorem Proving.",
                    "Computational Aspects of Three-Valued Logic.",
                    "Resolution and Quantified Epistemic Logics.",
                    "A Commonsense Theory of Nonmonotonic Reasoning.",
                    "Negative Paramodulation.",
                    "The Heuristics and Experimental Results of a New Hyperparamodulation: HL-Resolution.",
                    "ECR: An Equality Conditional Resolution Proof Procedure.",
                    "Using Narrowing to do Isolation in Symbolic Equation Solving - An Experiment in Automated Reasoning.",
                    "Formulation of Induction Formulas in Verification of Prolog Programs.",
                    "Program Verifier \"Tatzelwurm\": Reasoning about Systems of Linear Inequalities.",
                    "An Interactive Verification System Based on Dynamic Logic.",
                    "What You Always Wanted to Know About Clause Graph Resolution.",
                    "Parallel Theorem Proving with Connection Graphs.",
                    "Theory Links in Semantic Graphs.",
                    "Abstraction Using Generalization Functions.",
                    "An Improvement of Deduction Plans: Refutation Plans.",
                    "Controlling Deduction with Proof Condensation and Heuristics.",
                    "Nested Resolution.",
                    "Mechanizing Constructive Proofs (Abstract).",
                    "Implementing Number Theory: An Experiment with Nuprl.",
                    "Parallel Algorithms for Term Matching.",
                    "Unification in Combinations of Collapse-Free Theories with Disjoint Sets of Function Symbols.",
                    "Combination of Unification Algorithms.",
                    "Unification in the Data Structure Sets.",
                    "NP-Completeness of the Set Unification and Matching Problems.",
                    "Matching with Distributivity.",
                    "Unification in Boolean Rings.",
                    "Some Relationships between Unification, restricted Unification, and Matching.",
                    "A Classification of Many-Sorted Unification Problems.",
                    "Unification in Many-Sorted Eqational Theories.",
                    "Classes of First Order Formulas Under Various Satisfiability Definitions.",
                    "Diamond Formulas in the Dynamic Logic of Recursively Enumerable Programs.",
                    "A prolog Technology Theorem Prover: Implementation by an Extended Prolog Compiler.",
                    "Paths to High-Performance Automated Theorem Proving.",
                    "Purely Functional Implementation of a Logic.",
                    "Causes for Events: Their Computation and Applications.",
                    "How to Clear a Block: Plan Formation in Situational Logic.",
                    "Deductive Synthesis of Sorting Programs.",
                    "The TPS Theorem Proving System.",
                    "TRSPEC: A Term Rewriting Based System for Algebraic Specifications.",
                    "Highly Parallel Inference Machine.",
                    "Automatic Theorem Proving in the ISDV System.",
                    "The Karlsruhe Induction Theorem Proving System.",
                    "Overview of a Theorem-Prover for A Computational Logic.",
                    "GEO-Prover - A Geometry Theorem Prover Developed at UT.",
                    "The Markgraf Karl Refutation Procedure (MKRP).",
                    "The J-Machine: Functional Programming with Combinators.",
                    "The Illinois Prover: A General Purpose Resolution Theorem Prover.",
                    "Theorem Proving Systems of the Formel Project.",
                    "The Passau RAP System: Prototyping Algebraic Specifications Using Conditional Narrowing.",
                    "RRL: A Rewrite Rule Laboratory.",
                    "A Geometry Theorem Prover Based on Buchberger's Algorithm.",
                    "REVE a Rewrite Rule Laboratory.",
                    "ITP at Argonne National Laboratory.",
                    "AUTOLOGIC at University of Victoria.",
                    "THINKER.",
                    "The KLAUS Automated Deduction System.",
                    "The KRIPKE Automated Theorem Proving System.",
                    "SHD-Prover at University of Texas at Austin."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "7th CADE 1984",
        "info": "Napa, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1984",
                "sub_name": "7th International Conference on Automated Deduction, Napa, California, USA, May 14-16, 1984, Proceedings.",
                "count": 29,
                "papers": [
                    "Universal Unification.",
                    "A Portable Environment for Research in Automated Reasoning.",
                    "A Natural Proof System Based on rewriting Techniques.",
                    "EKL - A Mathematically Oriented Proof Checker.",
                    "A Linear Characterization of NP-Complete Problems.",
                    "A Satisfiability Tester for Non-Clausal Propositional Calculus.",
                    "A Decision Method for Linear Temporal Logic.",
                    "A Progress Report on New Decision Algorithms for Finitely Prsented Abelian Groups.",
                    "Canonical Forms in Finitely Presented Algebras.",
                    "Term Rewriting Systems and Algebra.",
                    "Termination of a Set of Rules Modulo a Set of Equations.",
                    "Associative-Commutative Unification.",
                    "A Linear Time Algorithm for a Subcase of Second Order Instantiation.",
                    "A New Equational Unification Method: A Generalization of Martelli-Montanari's Algorithm.",
                    "A Case Study of Theorem Proving by the Knuth-Bendix Method: Discovering That x³=x Implies Ring Commutativity.",
                    "A Narrowing Procedure for Theories with Constructors.",
                    "A General Inductive Completion Algorithm and Application to Abstract Data Types.",
                    "The Next Generation of Interactive Theorem Provers.",
                    "The Linked Inference Principle, II: The User's Viewpoint.",
                    "A New Interpretation of the Resolution Principle.",
                    "Using Examples, Case Analysis, and Dependency Graphs in Theorem Proving.",
                    "Expansion Tree Proofs and Their Conversion to Natural Deduction Proofs.",
                    "Analytic and Non-analytic Proofs.",
                    "Applications of Protected Circumscription.",
                    "Implementation Strategies for Plan-Based Deduction.",
                    "A Programming Notation for Tactical Reasoning.",
                    "The Mechanization of Existence Proofs of Recursive Predicates.",
                    "Solving Word Problems in Free Algebras Using Complexity Functions.",
                    "Solving a Problem in Relevance Logic with an Automated Theorem Prover."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "6th CADE 1982",
        "info": "New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1982",
                "sub_name": "6th Conference on Automated Deduction, New York, USA, June 7-9, 1982, Proceedings.",
                "count": 23,
                "papers": [
                    "Solving Open Questions with an Automated Theorem-Proving Program.",
                    "STP: A Mechanized Logic for Specification and Verification.",
                    "A Look at TPS.",
                    "Logic Machine Architecture: Kernel Funtions.",
                    "Logic Machine Architecture: Inference Mechanisms.",
                    "Procedure Implementation Through Demodulation and Related Tricks.",
                    "The Application of Homogenization to Simultaneous Equations.",
                    "Meta-Level Inference and Program Verification.",
                    "An Example of FOL Using Metatheory.",
                    "Comparison of Natural Deduction and Locking Resolution Implementations.",
                    "Derived Preconditions and Their Use in Program Synthesis.",
                    "Automatic Construction of Special Purpose Programs.",
                    "Deciding Combinations of Theories.",
                    "Exponential Improvement of Efficient Backtracking: A Strategy for Plan-Based Deduction.",
                    "Exponential Improvement of Efficient Backtracking: data Structure and Implementation.",
                    "Intuitonistic Basis for Non-Monotonic Logic.",
                    "Knowledge Retrieval as Limited Inference.",
                    "On Indefinite Databases and the Closed World Assumption.",
                    "Proof by Matrix Reduction as Plan + Validation.",
                    "Improvements of a Tautology-Testing Algorithm.",
                    "Representing Infinite Sequences of Resolvents in recursive First-Order Horn Databases.",
                    "The Power of the Church-Rosser Property for String Rewriting Systems.",
                    "Universal Unification and a Classification of Equational Theories."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "5th CADE 1980",
        "info": "Les Arcs, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cade/1980",
                "sub_name": "5th Conference on Automated Deduction, Les Arcs, France, July 8-11, 1980, Proceedings.",
                "count": 28,
                "papers": [
                    "Using Meta-Theoretic Reasoning to do Algebra.",
                    "Generating Contours of Integration: An Application of Prolog in Symbolic Computing.",
                    "Using Meta-Level Inference for Selective Application of Multiple Rewrite Rules in Algebraic Manipulation.",
                    "Proofs as Description of Computation.",
                    "Program Synthesis from Incomplete Specifiactions.",
                    "A System for Proving Equivalences of Recursive Programs.",
                    "Variable Elimination and Chaining in a Resolution-based Prover for Inequalities.",
                    "Decision Procedures for Some Fragments of Set Theory.",
                    "Simplifying Interpreted Formulas.",
                    "Specification and Verification of Real-Time, Distributed Systems Using the Theory of Constraints.",
                    "Reasoning by Plausible Inference.",
                    "Logical Support in a Time-Varying Model.",
                    "An Experiment with the Boyer-Moore Theorem Prover: A Proof of the Correctness of a Simple Parser of Expressions.",
                    "An Experiment with \"Edinburgh LCF\".",
                    "An Approach to Theorem Proving on the Basis of a Typed Lambda-Calculus.",
                    "Adding Dynamic Paramodulation to Rewrite Algorithms.",
                    "Hyperparamodulation: A Refinement of Paramodulation.",
                    "The AFFIRM Theorem Prover: Proof Forests and Management of Large Proofs.",
                    "Data Structures and Control Architectures for Implementation of Theorem-Proving Programs.",
                    "A Note on Resolution: How to Get Rid of Factoring without Loosing Completeness.",
                    "Abstraction Mappings in Mechanical Theorem Proving.",
                    "Transforming Matings into Natural Deduction Proofs.",
                    "Analysis of Dependencies to Improve the Behaviour of Logic Programs.",
                    "Selective Backtracking for Logic Programs.",
                    "Canonical Forms and Unification.",
                    "Deciding Unique Termination of Permutative Rewriting Systems: Choose Your Term Algebra Carefully.",
                    "How to Prove Algebraic Inductive Hypotheses Without Induction.",
                    "A Complete, Nonredundant Algorithm for Reversed Skolemization."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "4th CADE 1979",
        "info": "Austin, Texas, USA",
        "venues": []
    },
    {
        "year": "1977",
        "name": "3rd CADE 1977",
        "info": "MIT, USA",
        "venues": []
    },
    {
        "year": "1976",
        "name": "2nd CADE 1976",
        "info": "Oberwolfach, Germany",
        "venues": []
    },
    {
        "year": "1974",
        "name": "1st CADE 1974",
        "info": "Argonne National Laboratory, USA",
        "venues": []
    }
]