[
    {
        "year": "2021",
        "name": "33rd CAV 2021",
        "info": "Los Angeles, CA, USA [virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2021-1",
                "sub_name": "Computer Aided Verification - 33rd International Conference, CAV 2021, Virtual Event, July 20-23, 2021, Proceedings, Part I.",
                "count": 42,
                "papers": [
                    "NNrepair: Constraint-Based Repair of Neural Network Classifiers.",
                    "Balancing Automation and Control for Formal Verification of Microprocessors.",
                    "Algebraic Program Analysis.",
                    "Programmable Program Synthesis.",
                    "Deductive Synthesis of Programs with Pointers: Techniques, Challenges, Opportunities - (Invited Paper).",
                    "DNNV: A Framework for Deep Neural Network Verification.",
                    "Robustness Verification of Quantum Classifiers.",
                    "BDD4BNN: A BDD-Based Quantitative Analysis Framework for Binarized Neural Networks.",
                    "Automated Safety Verification of Programs Invoking Neural Networks.",
                    "Scalable Polyhedral Verification of Recurrent Neural Networks.",
                    "Verisig 2.0: Verification of Neural Network Controllers Using Taylor Model Preconditioning.",
                    "Robustness Verification of Semantic Segmentation Neural Networks Using Relaxed Reachability.",
                    "PEREGRiNN: Penalized-Relaxation Greedy Neural Network Verifier.",
                    "Isla: Integrating Full-Scale ISA Semantics and Axiomatic Concurrency Models.",
                    "Summing up Smart Transitions.",
                    "Stateless Model Checking Under a Reads-Value-From Equivalence.",
                    "Gobra: Modular Specification and Verification of Go Programs.",
                    "Delay-Bounded Scheduling Without Delay!",
                    "Checking Data-Race Freedom of GPU Kernels, Compositionally.",
                    "GenMC: A Model Checker for Weak Memory Models.",
                    "Synthesizing Invariant Barrier Certificates via Difference-of-Convex Programming.",
                    "An Iterative Scheme of Safe Reinforcement Learning for Nonlinear Systems via Barrier Certificate Generation.",
                    "HybridSynchAADL: Modeling and Formal Analysis of Virtually Synchronous CPSs in AADL.",
                    "Computing Bottom SCCs Symbolically Using Transition Guided Reduction.",
                    "Implicit Semi-Algebraic Abstraction for Polynomial Dynamical Systems.",
                    "IMITATOR 3: Synthesis of Timing Parameters Beyond Decidability.",
                    "Formally Verified Switching Logic for Recoverability of Aircraft Controller.",
                    "SceneChecker: Boosting Scenario Verification Using Symmetry Abstractions.",
                    "Effective Hybrid System Falsification Using Monte Carlo Tree Search Guided by QB-Robustness.",
                    "Fast Zone-Based Algorithms for Reachability in Pushdown Timed Automata.",
                    "Verified Cryptographic Code for Everybody.",
                    "Not All Bugs Are Created Equal, But Robust Reachability Can Tell the Difference.",
                    "A Temporal Logic for Asynchronous Hyperproperties.",
                    "Product Programs in the Wild: Retrofitting Program Verifiers to Check Information Flow Security.",
                    "Constraint-Based Relational Verification.",
                    "Pre-deployment Security Assessment for Cloud Services Through Semantic Reasoning.",
                    "Synthesis with Asymptotic Resource Bounds.",
                    "Program Sketching by Automatically Generating Mocks from Tests.",
                    "Counterexample-Guided Partial Bounding for Recursive Function Synthesis.",
                    "PAYNT: A Tool for Inductive Synthesis of Probabilistic Programs.",
                    "Adapting Behaviors via Reactive Synthesis.",
                    "Causality-Based Game Solving."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2021-2",
                "sub_name": "Computer Aided Verification - 33rd International Conference, CAV 2021, Virtual Event, July 20-23, 2021, Proceedings, Part II.",
                "count": 42,
                "papers": [
                    "Learning Probabilistic Termination Proofs.",
                    "Ghost Signals: Verifying Termination of Busy Waiting - Verifying Termination of Busy Waiting.",
                    "Reflections on Termination of Linear Loops.",
                    "Decision Tree Learning in CEGIS-Based Termination Analysis.",
                    "ATLAS: Automated Amortised Complexity Analysis of Self-adjusting Data Structures.",
                    "Theory Exploration Powered by Deductive Synthesis.",
                    "CoqQFBV: A Scalable Certified SMT Quantifier-Free Bit-Vector Solver.",
                    "Porous Invariants.",
                    "JavaSMT 3: Interacting with SMT Solvers in Java.",
                    "Efficient SMT-Based Analysis of Failure Propagation.",
                    "ddSMT 2.0: Better Delta Debugging for the SMT-LIBv2 Language and Friends.",
                    "Learning Union of Integer Hypercubes with Queries - (with Applications to Monadic Decomposition).",
                    "Interpolation and Model Checking for Nonlinear Arithmetic.",
                    "An SMT Solver for Regular Expressions and Linear Arithmetic over String Length.",
                    "Counting Minimal Unsatisfiable Subsets.",
                    "Sound Verification Procedures for Temporal Properties of Infinite-State Systems.",
                    "Progress in Certifying Hardware Model Checking Results.",
                    "Model-Checking Structured Context-Free Languages.",
                    "Model Checking ømega-Regular Properties with Decoupled Search.",
                    "AIGEN: Random Generation of Symbolic Transition Systems.",
                    "GPU Acceleration of Bounded Model Checking with ParaFROST.",
                    "Pono: A Flexible and Extensible SMT-Based Model Checker.",
                    "Towards a Trustworthy Semantics-Based Language Framework via Proof Generation.",
                    "Foundations of Fine-Grained Explainability.",
                    "Latticed k-Induction with an Application to Probabilistic Programs.",
                    "Runtime Monitors for Markov Decision Processes.",
                    "Model Checking Finite-Horizon Markov Chains with Probabilistic Inference.",
                    "Enforcing Almost-Sure Reachability in POMDPs.",
                    "Rigorous Roundoff Error Analysis of Probabilistic Floating-Point Computations.",
                    "Model-Free Reinforcement Learning for Branching Markov Decision Processes.",
                    "Cameleer: A Deductive Verification Tool for OCaml.",
                    "LLMC: Verifying High-Performance Software.",
                    "Formally Validating a Practical Verification Condition Generator.",
                    "Automatic Generation and Validation of Instruction Encoders and Decoders.",
                    "An SMT Encoding of LLVM's Memory Model for Bounded Translation Validation.",
                    "Automatically Tailoring Abstract Interpretation to Custom Usage Scenarios.",
                    "Functional Correctness of C Implementations of Dijkstra's, Kruskal's, and Prim's Algorithms.",
                    "Gillian, Part II: Real-World Verification for JavaScript and C.",
                    "Debugging Network Reachability with Blocked Paths.",
                    "Lower-Bound Synthesis Using Loop Specialization and Max-SMT.",
                    "Fast Computation of Strong Control Dependencies.",
                    "Diffy: Inductive Reasoning of Array Programs Using Difference Invariants."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2021fmbc",
                "sub_name": "3rd International Workshop on Formal Methods for Blockchains, FMBC@CAV 2021, July 18-19, 2021, Los Angeles, California, USA (Virtual Conference).",
                "count": 6,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Towards Verified Price Oracles for Decentralized Exchange Protocols.",
                    "Money Grows on (Proof-)Trees: The Formal FA1.2 Ledger Standard.",
                    "Using Coq to Enforce the Checks-Effects-Interactions Pattern in DeepSEA Smart Contracts (Short Paper).",
                    "Formally Documenting Tenderbake (Short Paper).",
                    "Towards Contract Modules for the Tezos Blockchain (Short Paper)."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "32nd CAV 2020",
        "info": "Los Angeles, CA, USA [virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2020-1",
                "sub_name": "Computer Aided Verification - 32nd International Conference, CAV 2020, Los Angeles, CA, USA, July 21-24, 2020, Proceedings, Part I.",
                "count": 32,
                "papers": [
                    "NNV: The Neural Network Verification Tool for Deep Neural Networks and Learning-Enabled Cyber-Physical Systems.",
                    "Verification of Deep Convolutional Neural Networks Using ImageStars.",
                    "An Abstraction-Based Framework for Neural Network Verification.",
                    "Improved Geometric Path Enumeration for Verifying ReLU Neural Networks.",
                    "Systematic Generation of Diverse Benchmarks for DNN Verification.",
                    "Formal Analysis and Redesign of a Neural Network-Based Aircraft Taxiing System with VerifAI.",
                    "The Move Prover.",
                    "End-to-End Formal Verification of Ethereum 2.0 Deposit Smart Contract.",
                    "Stratified Abstraction of Access Control Policies.",
                    "Synthesis of Super-Optimized Smart Contracts Using Max-SMT.",
                    "Verification of Quantitative Hyperproperties Using Trace Enumeration Relations.",
                    "Validation of Abstract Side-Channel Models for Computer Architectures.",
                    "Semantics, Specification, and Bounded Verification of Concurrent Libraries in Replicated Systems.",
                    "Refinement for Structured Concurrent Programs.",
                    "Parameterized Verification of Systems with Global Synchronization and Guards.",
                    "Hampa: Solver-Aided Recency-Aware Replication.",
                    "Root Causing Linearizability Violations.",
                    "Symbolic Partial-Order Execution for Testing Multi-Threaded Programs.",
                    "fault: A Python Embedded Domain-Specific Language for Metaprogramming Portable Hardware Verification Components.",
                    "Nonlinear Craig Interpolant Generation.",
                    "Approximate Counting of Minimal Unsatisfiable Subsets.",
                    "Tinted, Detached, and Lazy CNF-XOR Solving and Its Applications to Counting and Sampling.",
                    "Automated and Scalable Verification of Integer Multipliers.",
                    "Interpolation-Based Semantic Gate Extraction and Its Applications to QBF Preprocessing.",
                    "TarTar: A Timed Automata Repair Tool.",
                    "SAW: A Tool for Safety Analysis of Weakly-Hard Systems.",
                    "PIRK: Scalable Interval Reachability Analysis for High-Dimensional Nonlinear Systems.",
                    "AEON: Attractor Bifurcation Analysis of Parametrised Boolean Networks.",
                    "A Novel Approach for Solving the BMI Problem in Barrier Certificates Generation.",
                    "Reachability Analysis Using Message Passing over Tree Decompositions.",
                    "Fast and Guaranteed Safe Controller Synthesis for Nonlinear Vehicle Models.",
                    "SeQuaiA: A Scalable Tool for Semi-Quantitative Analysis of Chemical Reaction Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2020-2",
                "sub_name": "Computer Aided Verification - 32nd International Conference, CAV 2020, Los Angeles, CA, USA, July 21-24, 2020, Proceedings, Part II.",
                "count": 33,
                "papers": [
                    "Automata Tutor v3.",
                    "Seminator 2 Can Complement Generalized Büchi Automata via Improved Semi-determinization.",
                    "RTLola Cleared for Take-Off: Monitoring Autonomous Aircraft.",
                    "Realizing ømega-regular Hyperproperties.",
                    "AdamMC: A Model Checker for Petri Nets with Transits against Flow-LTL.",
                    "Action-Based Model Checking: Logic, Automata, and Reduction.",
                    "Global Guidance for Local Generalization in Model Checking.",
                    "Towards Model Checking Real-World Software-Defined Networks.",
                    "Code2Inv: A Deep Learning Framework for Program Verification.",
                    "MetaVal: Witness Validation via Verification.",
                    "Recursive Data Structures in SPARK.",
                    "Ivy: A Multi-modal Verification Tool for Distributed Algorithms.",
                    "Reasoning over Permissions Regions in Concurrent Separation Logic.",
                    "Local Reasoning About the Presence of Bugs: Incorrectness Separation Logic.",
                    "Maximum Causal Entropy Specification Inference from Demonstrations.",
                    "Certifying Certainty and Uncertainty in Approximate Membership Query Structures.",
                    "Global PAC Bounds for Learning Discrete Time Markov Chains.",
                    "Unbounded-Time Safety Verification of Stochastic Differential Dynamics.",
                    "Widest Paths and Global Propagation in Bounded Value Iteration for Stochastic Games.",
                    "Checking Qualitative Liveness Properties of Replicated Systems with Stochastic Scheduling.",
                    "Stochastic Games with Lexicographic Reachability-Safety Objectives.",
                    "Qualitative Controller Synthesis for Consumption Markov Decision Processes.",
                    "STMC: Statistical Model Checker with Stratified and Antithetic Sampling.",
                    "AMYTISS: Parallelized Automated Controller Synthesis for Large-Scale Stochastic Systems.",
                    "PRISM-games 3.0: Stochastic Game Verification with Concurrency, Equilibria and Time.",
                    "Optimistic Value Iteration.",
                    "PrIC3: Property Directed Reachability for MDPs.",
                    "Good-Enough Synthesis.",
                    "Synthesizing JIT Compilers for In-Kernel DSLs.",
                    "Program Synthesis Using Deduction-Guided Reinforcement Learning.",
                    "Manthan: A Data-Driven Approach for Boolean Function Synthesis.",
                    "Decidable Synthesis of Programs with Uninterpreted Functions.",
                    "Must Fault Localization for Program Repair."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2020fmbc",
                "sub_name": "2nd Workshop on Formal Methods for Blockchains, FMBC@CAV 2020, July 20-21, 2020, Los Angeles, California, USA (Virtual Conference).",
                "count": 12,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Formal Design, Implementation and Verification of Blockchain Languages Using K (Invited Talk).",
                    "Formal Specification and Verification of Solidity Contracts with Events (Short Paper).",
                    "Populating the Peephole Optimizer of a Smart Contract Compiler.",
                    "Tezla, an Intermediate Representation for Static Analysis of Michelson Smart Contracts.",
                    "A Blockchain Model in Tamarin and Formal Analysis of Hash Time Lock Contract.",
                    "Authenticated Data Structures as Functors in Isabelle/HOL.",
                    "Mechanized Formal Model of Bitcoin's Blockchain Validation Procedures.",
                    "Towards Verifying the Bitcoin-S Library (Short Paper).",
                    "On the Formal Verification of the Stellar Consensus Protocol.",
                    "Formal Specification and Model Checking of the Tendermint Blockchain Synchronization Protocol (Short Paper).",
                    "Inter-Blockchain Protocols with the Isabelle Infrastructure Framework."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "31st CAV 2019",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2019-1",
                "sub_name": "Computer Aided Verification - 31st International Conference, CAV 2019, New York City, NY, USA, July 15-18, 2019, Proceedings, Part I.",
                "count": 37,
                "papers": [
                    "Symbolic Register Automata.",
                    "Abstraction Refinement Algorithms for Timed Automata.",
                    "Fast Algorithms for Handling Diagonal Constraints in Timed Automata.",
                    "Safety and Co-safety Comparator Automata for Discounted-Sum Inclusion.",
                    "Clock Bound Repair for Timed Systems.",
                    "Verifying Asynchronous Interactions via Communicating Session Automata.",
                    "Verifying Hyperliveness.",
                    "Quantitative Mitigation of Timing Side Channels.",
                    "Property Directed Self Composition.",
                    "Security-Aware Synthesis Using Delayed-Action Games.",
                    "Automated Hypersafety Verification.",
                    "Automated Synthesis of Secure Platform Mappings.",
                    "Synthesizing Approximate Implementations for Unrealizable Specifications.",
                    "Quantified Invariants via Syntax-Guided Synthesis.",
                    "Efficient Synthesis with Probabilistic Constraints.",
                    "Membership-Based Synthesis of Linear Hybrid Automata.",
                    "Overfitting in Synthesis: Theory and Practice.",
                    "Proving Unrealizability for Syntax-Guided Synthesis.",
                    "BMC for Weak Memory Models: Relation Analysis for Compact SMT Encodings.",
                    "When Human Intuition Fails: Using Formal Methods to Find an Error in the \"Proof\" of a Multi-agent Protocol.",
                    "Extending nuXmv with Timed Transition Systems and Timed Temporal Properties.",
                    "Cerberus-BMC: A Principled Reference Semantics and Exploration Tool for Concurrent and Sequential C.",
                    "Multi-armed Bandits for Boolean Connectives in Hybrid System Falsification.",
                    "StreamLAB: Stream-based Monitoring of Cyber-Physical Systems.",
                    "VerifAI: A Toolkit for the Formal Design and Analysis of Artificial Intelligence-Based Systems.",
                    "The Marabou Framework for Verification and Analysis of Deep Neural Networks.",
                    "Probabilistic Bisimulation for Parameterized Systems - (with Applications to Verifying Anonymous Protocols).",
                    "Semi-quantitative Abstraction and Analysis of Chemical Reaction Networks.",
                    "PAC Statistical Model Checking for Markov Decision Processes and Stochastic Games.",
                    "Symbolic Monitoring Against Specifications Parametric in Time and Data.",
                    "STAMINA: STochastic Approximate Model-Checker for INfinite-State Analysis.",
                    "Local and Compositional Reasoning for Optimized Reactive Systems.",
                    "Robust Controller Synthesis in Timed Büchi Automata: A Symbolic Approach.",
                    "Flexible Computational Pipelines for Robust Abstraction-Based Control Synthesis.",
                    "Temporal Stream Logic: Synthesis Beyond the Bools.",
                    "Run-Time Optimization for Learned Controllers Through Quantitative Games.",
                    "Taming Delays in Dynamical Systems - Unbounded Verification of Delay Differential Equations."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2019-2",
                "sub_name": "Computer Aided Verification - 31st International Conference, CAV 2019, New York City, NY, USA, July 15-18, 2019, Proceedings, Part II.",
                "count": 30,
                "papers": [
                    "Satisfiability Checking for Mission-Time LTL.",
                    "High-Level Abstractions for Simplifying Extended String Constraints in SMT.",
                    "Alternating Automata Modulo First Order Theories.",
                    "Q3B: An Efficient BDD-based SMT Solver for Quantified Bit-Vectors.",
                    "cvc4sy: Smart and Fast Term Enumeration for Syntax-Guided Synthesis.",
                    "Incremental Determinization for Quantifier Elimination and Functional Synthesis.",
                    "Loop Summarization with Rational Vector Addition Systems.",
                    "Invertibility Conditions for Floating-Point Formulas.",
                    "Numerically-Robust Inductive Proof Rules for Continuous Dynamical Systems.",
                    "Icing: Supporting Fast-Math Style Optimizations in a Verified Compiler.",
                    "Sound Approximation of Programs with Elementary Functions.",
                    "Formal Verification of Quantum Algorithms Using Quantum Hoare Logic.",
                    "SecCSL: Security Concurrent Separation Logic.",
                    "Reachability Analysis for AWS-Based Networks.",
                    "Verification of Threshold-Based Distributed Algorithms by Decomposition to Decidable Logics.",
                    "Gradual Consistency Checking.",
                    "Checking Robustness Against Snapshot Isolation.",
                    "Efficient Verification of Network Fault Tolerance via Counterexample-Guided Refinement.",
                    "On the Complexity of Checking Consistency for Replicated Data Types.",
                    "Communication-Closed Asynchronous Protocols.",
                    "Interpolating Strong Induction.",
                    "Verifying Asynchronous Event-Driven Programs Using Partial Abstract Transformers.",
                    "Inferring Inductive Invariants from Phase Structures.",
                    "Termination of Triangular Integer Loops is Decidable.",
                    "AliveInLean: A Verified LLVM Peephole Optimization Verifier.",
                    "Automated Parameterized Verification of CRDTs.",
                    "What's Wrong with On-the-Fly Partial Order Reduction.",
                    "Integrating Formal Schedulability Analysis into a Verified OS Kernel.",
                    "Rely-Guarantee Reasoning About Concurrent Memory Management in Zephyr RTOS.",
                    "Violat: Generating Tests of Observational Refinement for Concurrent Objects."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2019nsv",
                "sub_name": "Numerical Software Verification - 12th International Workshop, NSV@CAV 2019, New York City, NY, USA, July 13-14, 2019, Proceedings.",
                "count": 9,
                "papers": [
                    "Trust, Resilience and Interpretability of AI Models.",
                    "Reinforcement Learning and Formal Requirements.",
                    "An Evaluation of Monte-Carlo Tree Search for Property Falsification on Hybrid Flight Control Laws.",
                    "Rigorous Continuous Evolution of Uncertain Systems.",
                    "Stochastic Local Search for Solving Floating-Point Constraints.",
                    "Evaluating Branching Heuristics in Interval Constraint Propagation for Satisfiability.",
                    "Approximate Probabilistic Relations for Compositional Abstractions of Stochastic Systems.",
                    "Polytopic Trees for Verification of Learning-Based Controllers.",
                    "Mutant Accuracy Testing for Assessing the Implementation of Numerical Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "30th CAV 2018",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2018-1",
                "sub_name": "Computer Aided Verification - 30th International Conference, CAV 2018, Held as Part of the Federated Logic Conference, FloC 2018, Oxford, UK, July 14-17, 2018, Proceedings, Part I.",
                "count": 39,
                "papers": [
                    "Semantic Adversarial Deep Learning.",
                    "From Programs to Interpretable Deep Models and Back.",
                    "Formal Reasoning About the Security of Amazon Web Services.",
                    "Foundations and Tools for the Static Analysis of Ethereum Smart Contracts.",
                    "Layered Concurrent Programs.",
                    "Propositional Dynamic Logic for Higher-Order Functional Programs.",
                    "Syntax-Guided Termination Analysis.",
                    "Model Checking Quantitative Hyperproperties.",
                    "Exploiting Synchrony and Symmetry in Relational Verification.",
                    "JBMC: A Bounded Model Checking Tool for Verifying Java Bytecode.",
                    "Eager Abstraction for Symbolic Model Checking.",
                    "Fast Numerical Program Analysis with Reinforcement Learning.",
                    "A Direct Encoding for NNC Polyhedra.",
                    "What's Hard About Boolean Functional Synthesis?",
                    "Counterexample Guided Inductive Synthesis Modulo Theories.",
                    "Synthesizing Reactive Systems from Hyperproperties.",
                    "Reactive Control Improvisation.",
                    "Constraint-Based Synthesis of Coupling Proofs.",
                    "Controller Synthesis Made Real: Reach-Avoid Specifications and Linear Dynamics.",
                    "Synthesis of Asynchronous Reactive Programs from Temporal Specifications.",
                    "Syntax-Guided Synthesis with Quantitative Syntactic Objectives.",
                    "Learning Abstractions for Program Synthesis.",
                    "The Learnability of Symbolic Automata.",
                    "Reachable Set Over-Approximation for Nonlinear Systems Using Piecewise Barrier Tubes.",
                    "Space-Time Interpolants.",
                    "Monitoring Weak Consistency.",
                    "Monitoring CTMCs by Multi-clock Timed Automata.",
                    "Start Pruning When Time Gets Urgent: Partial Order Reduction for Timed Systems.",
                    "A Counting Semantics for Monitoring LTL Specifications over Finite Traces.",
                    "Rabinizer 4: From LTL to Your Favourite Deterministic Automaton.",
                    "Strix: Explicit Reactive Synthesis Strikes Back!",
                    "Btor2 , BtorMC and Boolector 3.0.",
                    "Nagini: A Static Verifier for Python.",
                    "Peregrine: A Tool for the Analysis of Population Protocols.",
                    "ADAC: Automated Design of Approximate Circuits.",
                    "Value Iteration for Simple Stochastic Games: Stopping Criterion and Learning Algorithm.",
                    "Sound Value Iteration.",
                    "Safety-Aware Apprenticeship Learning.",
                    "Deciding Probabilistic Bisimilarity Distance One for Labelled Markov Chains."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2018-2",
                "sub_name": "Computer Aided Verification - 30th International Conference, CAV 2018, Held as Part of the Federated Logic Conference, FloC 2018, Oxford, UK, July 14-17, 2018, Proceedings, Part II.",
                "count": 31,
                "papers": [
                    "Let this Graph Be Your Witness! - An Attestor for Verifying Java Pointer Programs.",
                    "MaxSMT-Based Type Inference for Python 3.",
                    "The JKind Model Checker.",
                    "The DEEPSEC Prover.",
                    "SimpleCAR: An Efficient Bug-Finding Tool Based on Approximate Reachability.",
                    "StringFuzz: A Fuzzer for String Solvers.",
                    "Permission Inference for Array Programs.",
                    "Program Analysis Is Harder Than Verification: A Computability Perspective.",
                    "Automata vs Linear-Programming Discounted-Sum Inclusion.",
                    "Model Checking Indistinguishability of Randomized Security Protocols.",
                    "Lazy Self-composition for Security Verification.",
                    "SCInfer: Refinement-Based Verification of Software Countermeasures Against Side-Channel Attacks.",
                    "Symbolic Algorithms for Graphs and Markov Decision Processes with Fairness Objectives.",
                    "Attracting Tangles to Solve Parity Games.",
                    "Delta-Decision Procedures for Exists-Forall Problems over the Reals.",
                    "Solving Quantified Bit-Vectors Using Invertibility Conditions.",
                    "Understanding and Extending Incremental Determinization for 2QBF.",
                    "The Proof Complexity of SMT Solvers.",
                    "Model Generation for Quantified Formulas: A Taint-Based Approach.",
                    "Partial Order Aware Concurrency Sampling.",
                    "Reasoning About TSO Programs Using Reduction and Abstraction.",
                    "Quasi-Optimal Partial Order Reduction.",
                    "On the Completeness of Verifying Message Passing Programs Under Bounded Asynchrony.",
                    "Constrained Dynamic Partial Order Reduction.",
                    "Formal Verification of a Vehicle-to-Vehicle (V2V) Messaging System.",
                    "Continuous Formal Verification of Amazon s2n.",
                    "Symbolic Liveness Analysis of Real-World Software.",
                    "Model Checking Boot Code from AWS Data Centers.",
                    "Android Stack Machine.",
                    "Formally Verified Montgomery Multiplication.",
                    "Inner and Outer Approximating Flowpipes for Delay Differential Equations."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "29th CAV 2017",
        "info": "Heidelberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2017-1",
                "sub_name": "Computer Aided Verification - 29th International Conference, CAV 2017, Heidelberg, Germany, July 24-28, 2017, Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "Safety Verification of Deep Neural Networks.",
                    "Program Verification Under Weak Memory Consistency Using Separation Logic.",
                    "The Power of Symbolic Automata and Transducers.",
                    "Maximum Satisfiability in Software Analysis: Applications and Techniques.",
                    "Reluplex: An Efficient SMT Solver for Verifying Deep Neural Networks.",
                    "Automated Recurrence Analysis for Almost-Linear Expected-Runtime Bounds.",
                    "Markov Automata with Multiple Objectives.",
                    "Ensuring the Reliability of Your Model Checker: Interval Iteration for Markov Decision Processes.",
                    "Repairing Decision-Making Programs Under Uncertainty.",
                    "Value Iteration for Long-Run Average Reward in Markov Decision Processes.",
                    "STLInspector: STL Validation with Guarantees.",
                    "Learning a Static Analyzer from Data.",
                    "Synthesis with Abstract Examples.",
                    "Data-Driven Synthesis of Full Probabilistic Programs.",
                    "Logical Clustering and Learning for Time-Series Data.",
                    "Montre: A Tool for Monitoring Timed Regular Expressions.",
                    "Runtime Monitoring with Recovery of the SENT Communication Protocol.",
                    "Runtime Verification of Temporal Properties over Out-of-Order Data Streams.",
                    "Lagrangian Reachabililty.",
                    "Simulation-Equivalent Reachability of Large Linear Systems with Inputs.",
                    "MightyL: A Compositional Translation from MITL to Timed Automata.",
                    "DryVR: Data-Driven Verification and Compositional Reasoning for Automotive Systems.",
                    "Automated Formal Synthesis of Digital Controllers for State-Space Physical Plants.",
                    "Classification and Coverage-Based Falsification for Embedded Control Systems.",
                    "GPUDrano: Detecting Uncoalesced Accesses in GPU Programs.",
                    "Context-Sensitive Dynamic Partial Order Reduction.",
                    "Starling: Lightweight Concurrency Verification with Views.",
                    "Compositional Model Checking with Incremental Counter-Example Construction.",
                    "Pithya: A Parallel Tool for Parameter Synthesis of Piecewise Multi-affine Dynamical Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2017-2",
                "sub_name": "Computer Aided Verification - 29th International Conference, CAV 2017, Heidelberg, Germany, July 24-28, 2017, Proceedings, Part II.",
                "count": 32,
                "papers": [
                    "Verified Compilation of Space-Efficient Reversible Circuits.",
                    "Ascertaining Uncertainty for Efficient Exact Cache Analysis.",
                    "Non-polynomial Worst-Case Analysis of Recursive Programs.",
                    "Automated Resource Analysis with Coq Proof Objects.",
                    "Look for the Proof to Find the Program: Decorated-Component-Based Program Synthesis.",
                    "E-QED: Electrical Bug Localization During Post-silicon Validation Enabled by Quick Error Detection and Formal Methods.",
                    "SMTCoq: A Plug-In for Integrating SMT Solvers into Coq.",
                    "Efficient Parallel Strategy Improvement for Parity Games.",
                    "Model-Checking Linear-Time Properties of Parametrized Asynchronous Shared-Memory Pushdown Systems.",
                    "Minimization of Symbolic Transducers.",
                    "Abstract Interpretation with Unfoldings.",
                    "Cutoff Bounds for Consensus Algorithms.",
                    "Towards Verifying Nonlinear Integer Arithmetic.",
                    "Network-Wide Configuration Synthesis.",
                    "Verifying Equivalence of Spark Programs.",
                    "Synchronization Synthesis for Network Programs.",
                    "BoSy: An Experimentation Framework for Bounded Synthesis.",
                    "Bounded Synthesis for Streett, Rabin, and \\text CTL^*.",
                    "Quantitative Assume Guarantee Synthesis.",
                    "Syntax-Guided Optimal Synthesis for Chemical Reaction Networks.",
                    "Model Counting for Recursively-Defined Strings.",
                    "A Three-Tier Strategy for Reasoning About Floating-Point Numbers in SMT.",
                    "A Correct-by-Decision Solution for Simultaneous Place and Route.",
                    "Scaling Up DPLL(T) String Solvers Using Context-Dependent Simplification.",
                    "On Expansion and Resolution in CEGAR Based QBF Solving.",
                    "A Decidable Fragment in Separation Logic with Inductive Predicates and Arithmetic.",
                    "Finding Fix Locations for CFL-Reachability Analyses via Minimum Cuts.",
                    "Proving Linearizability Using Forward Simulations.",
                    "EAHyper: Satisfiability, Implication, and Equivalence Checking of Hyperproperties.",
                    "Automating Induction for Solving Horn Clauses.",
                    "A Storm is Coming: A Modern Probabilistic Model Checker.",
                    "On Multiphase-Linear Ranking Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2017nsv",
                "sub_name": "Numerical Software Verification - 10th International Workshop, NSV 2017, Heidelberg, Germany, July 22-23, 2017, Proceedings [collocated with CAV 2017].",
                "count": 8,
                "papers": [
                    "Verified Computations Using Taylor Models and Their Applications.",
                    "Introduction to the IEEE 1788-2015 Standard for Interval Arithmetic.",
                    "Formal Correctness of Comparison Algorithms Between Binary64 and Decimal64 Floating-Point Numbers.",
                    "Sound Numerical Computations in Abstract Acceleration.",
                    "Studying the Numerical Quality of an Industrial Computing Code: A Case Study on Code_aster.",
                    "Challenges and Tool Implementation of Hybrid Rapidly-Exploring Random Trees.",
                    "Rigorous Reachability Analysis and Domain Decomposition of Taylor Models.",
                    "A Study of Model-Order Reduction Techniques for Verification."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/abs-1711-10224",
                "sub_name": "Proceedings Sixth Workshop on Synthesis, SYNT@CAV 2017, Heidelberg, Germany, 22nd July 2017.",
                "count": 7,
                "papers": [
                    "CTL* synthesis via LTL synthesis.",
                    "Symbolic vs. Bounded Synthesis for Petri Games.",
                    "A Class of Control Certificates to Ensure Reach-While-Stay for Switched Systems.",
                    "Performance Heuristics for GR(1) Synthesis and Related Algorithms.",
                    "SyGuS Techniques in the Core of an SMT Solver.",
                    "SyGuS-Comp 2017: Results and Analysis.",
                    "The 4th Reactive Synthesis Competition (SYNTCOMP 2017): Benchmarks, Participants & Results."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "28th CAV 2016",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2016-1",
                "sub_name": "Computer Aided Verification - 28th International Conference, CAV 2016, Toronto, ON, Canada, July 17-23, 2016, Proceedings, Part I.",
                "count": 29,
                "papers": [
                    "Termination Analysis of Probabilistic Programs Through Positivstellensatz's.",
                    "Markov Chains and Unambiguous Büchi Automata.",
                    "Synthesizing Probabilistic Invariants via Doob's Decomposition.",
                    "PSI: Exact Symbolic Inference for Probabilistic Programs.",
                    "PSCV: A Runtime Verification Tool for Probabilistic SystemC Models.",
                    "Structural Synthesis for GXW Specifications.",
                    "Bounded Cycle Synthesis.",
                    "Fast, Flexible, and Minimal CTL Synthesis via SMT.",
                    "Synthesis of Self-Stabilising and Byzantine-Resilient Distributed Systems.",
                    "A Decision Procedure for Sets, Binary Relations and Partial Functions.",
                    "Precise and Complete Propagation Based Local Search for Satisfiability Modulo Theories.",
                    "Progressive Reasoning over Recursively-Defined Strings.",
                    "String Analysis via Automata Manipulation with Logic Circuit Representation.",
                    "Rahft: A Tool for Verifying Horn Clauses Using Abstract Interpretation and Finite Tree Automata.",
                    "Infinite-State Liveness-to-Safety via Implicit Abstraction and Well-Founded Relations.",
                    "Proving Parameterized Systems Safe by Generalizing Clausal Proofs of Small Instances.",
                    "Learning-Based Assume-Guarantee Regression Verification.",
                    "Automated Circular Assume-Guarantee Reasoning with N-way Decomposition and Alphabet Refinement.",
                    "JayHorn: A Framework for Verifying Java programs.",
                    "Trigger Selection Strategies to Stabilize Program Verifiers.",
                    "Satisfiability Modulo Heap-Based Programs.",
                    "Automatic Verification of Iterated Separating Conjunctions Using Symbolic Execution.",
                    "From Shape Analysis to Termination Analysis in Linear Time.",
                    "RV-Match: Practical Semantics-Based Program Analysis.",
                    "Under-Approximating Backward Reachable Sets by Polytopes.",
                    "Parsimonious, Simulation Based Verification of Linear Systems.",
                    "Counterexample Guided Abstraction Refinement for Stability Analysis.",
                    "Symbolic Optimal Reachability in Weighted Timed Automata.",
                    "Automatic Reachability Analysis for Nonlinear Hybrid Models with C2E2."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2016-2",
                "sub_name": "Computer Aided Verification - 28th International Conference, CAV 2016, Toronto, ON, Canada, July 17-23, 2016, Proceedings, Part II.",
                "count": 29,
                "papers": [
                    "Model Checking at Scale: Automated Air Traffic Control Design Space Exploration.",
                    "Investigating Safety of a Radiotherapy Machine Using System Models with Pluggable Checkers.",
                    "End-to-End Verification of Processors with ISA-Formal.",
                    "A Practical Verification Framework for Preemptive OS Kernels.",
                    "Probabilistic Automated Language Learning for Configuration Files.",
                    "The Commutativity Problem of the MapReduce Framework: A Transducer-Based Approach.",
                    "Liveness of Randomised Parameterised Systems under Arbitrary Schedulers.",
                    "Stateless Model Checking for POWER.",
                    "Hitting Families of Schedules for Asynchronous Programs.",
                    "ParCoSS: Efficient Parallelized Compiled Symbolic Simulation.",
                    "XSat: A Fast Floating-Point Satisfiability Solver.",
                    "Effectively Propositional Interpolants.",
                    "Array Folds Logic.",
                    "Compositional Synthesis of Reactive Controllers for Multi-agent Systems.",
                    "Solving Parity Games via Priority Promotion.",
                    "A Simple Algorithm for Solving Qualitative Probabilistic Parity Games.",
                    "Limit-Deterministic Büchi Automata for Linear Temporal Logic.",
                    "Slugs: Extensible GR(1) Synthesis.",
                    "Synthesis of Fault-Attack Countermeasures for Cryptographic Circuits.",
                    "A SAT-Based Counterexample Guided Method for Unbounded Synthesis.",
                    "Qlose: Program Repair with Quantitative Objectives.",
                    "BDD-Based Boolean Functional Synthesis.",
                    "Soufflé: On Synthesis of Program Analyzers.",
                    "Property Directed Equivalence via Abstract Simulation.",
                    "Combining Model Learning and Model Checking to Analyze TCP Implementations.",
                    "BFS-Based Model Checking of Linear-Time Properties with an Application on GPUs.",
                    "BigraphER: Rewriting and Analysis Engine for Bigraphs.",
                    "Verification-Aided Debugging: An Interactive Web-Service for Exploring Error Witnesses.",
                    "The Kind 2 Model Checker."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2016nsv",
                "sub_name": "Numerical Software Verification - 9th International Workshop, NSV 2016, Toronto, ON, Canada, July 17-18, 2016, [collocated with CAV 2016], Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "Verification of Networks of Smart Energy Systems over the Cloud.",
                    "Proving Properties on PWA Systems Using Copositive and Semidefinite Programming.",
                    "Formal Analysis of Engineering Systems Based on Signal-Flow-Graph Theory.",
                    "Computing a Correct and Tight Rounding Error Bound Using Rounding-to-Nearest.",
                    "Studying Sequences of Jumps in Hybrid Systems to Detect Zeno Phenomenon.",
                    "Toward a Standard Benchmark Format and Suite for Floating-Point Analysis.",
                    "Falsification of Dynamical Systems - An Industrial Perspective.",
                    "Model Based Automatic Code Generation for Nonlinear Model Predictive Control.",
                    "Reduce the Complexity of the Polyhedron Minimization Using the Max Plus Pruning Method."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/PiskacD16",
                "sub_name": "Proceedings Fifth Workshop on Synthesis, SYNT@CAV 2016, Toronto, Canada, July 17-18, 2016.",
                "count": 11,
                "papers": [
                    "Using SyGuS to Synthesize Reactive Motion Plans.",
                    "What You Really Need To Know About Your Neighbor.",
                    "Symbolic BDD and ADD Algorithms for Energy Games.",
                    "Approaching Symbolic Parallelization by Synthesis of Recurrence Decompositions.",
                    "Leveraging Parallel Data Processing Frameworks with Verified Lifting.",
                    "Developing a Practical Reactive Synthesis Tool: Experience and Lessons Learned.",
                    "An Update on Deductive Synthesis and Repair in the Leon Tool.",
                    "A High-Level LTL Synthesis Format: TLSF v1.1.",
                    "The Reactive Synthesis Competition: SYNTCOMP 2016 and Beyond.",
                    "The 3rd Reactive Synthesis Competition (SYNTCOMP 2016): Benchmarks, Participants & Results.",
                    "SyGuS-Comp 2016: Results and Analysis."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "27th CAV 2015",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2015-1",
                "sub_name": "Computer Aided Verification - 27th International Conference, CAV 2015, San Francisco, CA, USA, July 18-24, 2015, Proceedings, Part I.",
                "count": 44,
                "papers": [
                    "A Trusted Mechanised Specification of JavaScript: One Year On.",
                    "On Automation of CTL* Verification for Infinite-State Systems.",
                    "Algorithms for Model Checking HyperLTL and HyperCTL ^*.",
                    "Fairness Modulo Theory: A New Approach to LTL Software Model Checking.",
                    "Model Checking Parameterized Asynchronous Shared-Memory Systems.",
                    "SMT and POR Beat Counter Abstraction: Parameterized Model Checking of Threshold-Based Distributed Algorithms.",
                    "Skipping Refinement.",
                    "Percentile Queries in Multi-dimensional Markov Decision Processes.",
                    "Faster Algorithms for Quantitative Verification in Constant Treewidth Graphs.",
                    "Counterexample Explanation by Learning Small Strategies in Markov Decision Processes.",
                    "Symbolic Polytopes for Quantitative Interpolation and Verification.",
                    "Adaptive Aggregation of Markov Chains: Quantitative Analysis of Chemical Reaction Networks.",
                    "PROPhESY: A PRObabilistic ParamEter SYnthesis Tool.",
                    "Effective Search-Space Pruning for Solvers of String Equations, Regular Expressions and Length Constraints.",
                    "Automata-Based Model Counting for String Constraints.",
                    "OpenJDK's Java.utils.Collection.sort() Is Broken: The Good, the Bad and the Worst Case.",
                    "Tree Buffers.",
                    "Learning Commutativity Specifications.",
                    "Angelic Verification: Precise Verification Modulo Unknowns.",
                    "The SeaHorn Verification Framework.",
                    "Automatic Rootcausing for Program Equivalence Failures in Binaries.",
                    "Fine-Grained Caching of Verification Results.",
                    "Predicting a Correct Program in Programming by Example.",
                    "Abstract Interpretation with Higher-Dimensional Ellipsoids and Conic Extrapolation.",
                    "Adam: Causality-Based Synthesis of Distributed Systems.",
                    "Alchemist: Learning Guarded Affine Functions.",
                    "OptiMathSAT: A Tool for Optimization Modulo Theories.",
                    "Systematic Asynchrony Bug Exploration for Android Apps.",
                    "Norn: An SMT Solver for String Constraints.",
                    "PVSio-web 2.0: Joining PVS to HCI.",
                    "The Hanoi Omega-Automata Format.",
                    "The Open-Source LearnLib - A Framework for Active Automata Learning.",
                    "Bbs: A Phase-Bounded Model Checker for Asynchronous Programs.",
                    "Time-Aware Abstractions in HybridSal.",
                    "A Type-Directed Approach to Program Repair.",
                    "Formal Design and Safety Analysis of AIR6110 Wheel Brake System.",
                    "Meeting a Powertrain Verification Challenge.",
                    "Synthesising Executable Gene Regulatory Networks from Single-Cell Gene Expression Data.",
                    "Empirical Software Metrics for Benchmarking of Verification Tools.",
                    "Property-Directed Inference of Universal Invariants or Proving Their Absence.",
                    "Efficient Anytime Techniques for Model-Based Safety Analysis.",
                    "Boosting k-Induction with Continuously-Refined Invariants.",
                    "Fast Interpolating BMC.",
                    "Counterexample-Guided Polynomial Loop Invariant Generation by Lagrange Interpolation."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2015",
                "sub_name": "Computer Aided Verification - 27th International Conference, CAV 2015, San Francisco, CA, USA, July 18-24, 2015, Proceedings, Part II.",
                "count": 26,
                "papers": [
                    "Poling: SMT Aided Linearizability Proofs.",
                    "Finding Bounded Path in Graph Using SMT for Automatic Clock Routing.",
                    "Cutting the Mix.",
                    "The Inez Mathematical Programming Modulo Theories Framework.",
                    "Using Minimal Correction Sets to More Efficiently Compute Minimal Unsatisfiable Sets.",
                    "Deciding Local Theory Extensions via E-matching.",
                    "Modular Deductive Verification of Multiprocessor Hardware Designs.",
                    "Word-Level Symbolic Trajectory Evaluation.",
                    "Verifying Linearizability of Intel® Software Guard Extensions.",
                    "Synthesis Through Unification.",
                    "From Non-preemptive to Preemptive Scheduling Using Synchronization Synthesis.",
                    "Counterexample-Guided Quantifier Instantiation for Synthesis in SMT.",
                    "Deductive Program Repair.",
                    "Quantifying Conformance Using the Skorokhod Metric.",
                    "Pareto Curves of Multidimensional Mean-Payoff Games.",
                    "Conflict-Driven Conditional Termination.",
                    "Predicate Abstraction and CEGAR for Disproving Termination of Higher-Order Functional Programs.",
                    "Complexity of Bradley-Manna-Sipma Lexicographic Ranking Functions.",
                    "Measuring with Timed Patterns.",
                    "Automatic Verification of Stability and Safety for Delay Differential Equations.",
                    "Time Robustness in MTL and Expressivity in Hybrid System Falsification.",
                    "Adaptive Concretization for Parallel Program Synthesis.",
                    "Automatic Completion of Distributed Protocols with Symmetry.",
                    "An Axiomatic Specification for Sequential Memory Models.",
                    "Approximate Synchrony: An Abstraction for Distributed Almost-Synchronous Systems.",
                    "Automated and Modular Refinement Reasoning for Concurrent Programs."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2015snr",
                "sub_name": "1st International Workshop on Symbolic and Numerical Methods for Reachability Analysis, SNR@CAV 2015, San Francisco, CA, USA, July 19, 2015.",
                "count": 6,
                "papers": [
                    "Symbolic-Numeric Reachability Analysis of Hybrid Systems.",
                    "Verification of Stochastic Systems by Stochastic Satisfiability Modulo Theories with Continuous Domain.",
                    "Abstract Interpretation with Infinitesimals: Towards Scalability in Nonstandard Static Analysis.",
                    "A Summary of Recent Progress on Efficient Parametric Approximations of Viability and Discriminating Kernels.",
                    "An Algorithmic Approach to Stability Verification of Hybrid Systems: A Summary.",
                    "ProbReach: A Tool for Guaranteed Reachability Analysis of Stochastic Hybrid Systems."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/CernyKM16",
                "sub_name": "Proceedings Fourth Workshop on Synthesis, SYNT 2015, San Francisco, CA, USA, 18th July 2015.",
                "count": 7,
                "papers": [
                    "Results and Analysis of SyGuS-Comp'15.",
                    "The Second Reactive Synthesis Competition (SYNTCOMP 2015).",
                    "Synthesizing a Lego Forklift Controller in GR(1): A Case Study.",
                    "A multi-paradigm language for reactive synthesis.",
                    "Compositional Algorithms for Succinct Safety Games.",
                    "Specification Format for Reactive Synthesis Problems.",
                    "The complexity of approximations for epistemic synthesis (extended abstract)."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "26th CAV 2014",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2014",
                "sub_name": "Computer Aided Verification - 26th International Conference, CAV 2014, Held as Part of the Vienna Summer of Logic, VSL 2014, Vienna, Austria, July 18-22, 2014. Proceedings.",
                "count": 57,
                "papers": [
                    "The Spirit of Ghost Code.",
                    "SMT-Based Model Checking for Recursive Programs.",
                    "Property-Directed Shape Analysis.",
                    "Shape Analysis via Second-Order Bi-Abduction.",
                    "ICE: A Robust Framework for Learning Invariants.",
                    "From Invariant Checking to Invariant Inference Using Randomized Search.",
                    "SMACK: Decoupling Source Language Details from Verifier Implementations.",
                    "Synthesis of Masking Countermeasures against Side Channel Attacks.",
                    "Temporal Mode-Checking for Runtime Monitoring of Privacy Policies.",
                    "String Constraints for Verification.",
                    "A Conference Management System with Verified Document Confidentiality.",
                    "Vac - Verifier of Administrative Role-Based Access Control Policies.",
                    "From LTL to Deterministic Automata: A Safraless Compositional Approach.",
                    "Symbolic Visibly Pushdown Automata.",
                    "Engineering a Static Verification Tool for GPU Kernels.",
                    "Lazy Annotation Revisited.",
                    "Interpolating Property Directed Reachability.",
                    "Verifying Relative Error Bounds Using Symbolic Simulation.",
                    "Regression Test Selection for Distributed Software Histories.",
                    "GPU-Based Graph Decomposition into Strongly Connected and Maximal End Components.",
                    "Software Verification in the Google App-Engine Cloud.",
                    "The nuXmv Symbolic Model Checker.",
                    "Analyzing and Synthesizing Genomic Logic Functions.",
                    "Finding Instability in Biological Models.",
                    "Invariant Verification of Nonlinear Hybrid Automata Networks of Cardiac Cells.",
                    "Diamonds Are a Girl's Best Friend: Partial Order Reduction for Timed Automata with Abstractions.",
                    "Reachability Analysis of Hybrid Systems Using Symbolic Orthogonal Projections.",
                    "Verifying LTL Properties of Hybrid Systems with K-Liveness.",
                    "Safraless Synthesis for Epistemic Temporal Specifications.",
                    "Minimizing Running Costs in Consumption Systems.",
                    "CEGAR for Qualitative Analysis of Probabilistic Systems.",
                    "Optimal Guard Synthesis for Memory Safety.",
                    "Don't Sit on the Fence - A Static Analysis Approach to Automatic Fence Insertion.",
                    "MCMAS-SLK: A Model Checker for the Verification of Strategy Logic Specifications.",
                    "Solving Games without Controllable Predecessor.",
                    "G4LTL-ST: Automatic Generation of PLC Programs.",
                    "Automatic Atomicity Verification for Clients of Concurrent Data Structures.",
                    "Regression-Free Synthesis for Concurrency.",
                    "Bounded Model Checking of Multi-threaded C Programs via Lazy Sequentialization.",
                    "An SMT-Based Approach to Coverability Analysis.",
                    "LEAP: A Tool for the Parametrized Verification of Concurrent Datatypes.",
                    "Monadic Decomposition.",
                    "A DPLL(T) Theory Solver for a Theory of Strings and Regular Expressions.",
                    "Bit-Vector Rewriting with Automatic Rule Generation.",
                    "A Tale of Two Solvers: Eager and Lazy Approaches to Bit-Vectors.",
                    "AVATAR: The Architecture for First-Order Theorem Provers.",
                    "Automating Separation Logic with Trees and Data.",
                    "A Nonlinear Real Arithmetic Fragment.",
                    "Yices 2.2.",
                    "A Simple and Scalable Static Analysis for Bound Analysis and Amortized Complexity Analysis.",
                    "Symbolic Resource Bound Inference for Functional Programs.",
                    "Proving Non-termination Using Max-SMT.",
                    "Termination Analysis by Learning Terminating Programs.",
                    "Causal Termination of Multi-threaded Programs.",
                    "Counterexample to Induction-Guided Abstraction-Refinement (CTIGAR).",
                    "Unbounded Scalable Verification Based on Approximate Property-Directed Reachability and Datapath Abstraction.",
                    "QUICr: A Reusable Library for Parametric Abstraction of Sets and Numbers."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2014vpt",
                "sub_name": "VPT 2014. Second International Workshop on Verification and Program Transformation, July 17-18, 2014, Vienna, Austria, The workshop is an event of the Vienna Summer of Logic 2014 and it is co-located with the 26th International Conference on Computer Aided Verification CAV 2014.",
                "count": 9,
                "papers": [
                    "Towards Constraint-Solving over Higher-Order Unbounded Datatypes using Formal Methods Tools.",
                    "Towards Automated Proving of Relational Properties of Probabilistic Programs (Invited Talk).",
                    "Program Verification using Constraint Handling Rules and Array Constraint Generalizations.",
                    "Branching Processes of Conservative Nested Petri Nets.",
                    "Local Driving in Higher-Order Positive Supercompilation via the Omega-theorem.",
                    "A Note on Program Specialization. What Syntactical Properties of Residual Programs Can Reveal?",
                    "On Unfolding for Programs Using Strings as a Data Type.",
                    "Verification of Multi-Party Ping-Pong Protocols via Program Transformation.",
                    "Formal Replay of Translation Validation for Highly Optimised C."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/ChatterjeeEJ14",
                "sub_name": "Proceedings 3rd Workshop on Synthesis, SYNT 2014, Vienna, Austria, July 23-24, 2014.",
                "count": 8,
                "papers": [
                    "Synthesis of a simple self-stabilizing system.",
                    "Program Synthesis and Linear Operator Semantics.",
                    "How to Handle Assumptions in Synthesis.",
                    "Symblicit algorithms for optimal strategy synthesis in monotonic Markov decision processes.",
                    "Parameterized Synthesis Case Study: AMBA AHB.",
                    "Are There Good Mistakes? A Theoretical Analysis of CEGIS.",
                    "AbsSynthe: abstract synthesis from succinct safety specifications.",
                    "Low-Effort Specification Debugging and Analysis."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "25th CAV 2013",
        "info": "Saint Petersburg, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2013",
                "sub_name": "Computer Aided Verification - 25th International Conference, CAV 2013, Saint Petersburg, Russia, July 13-19, 2013. Proceedings.",
                "count": 72,
                "papers": [
                    "First-Order Theorem Proving and Vampire.",
                    "Software Model Checking for People Who Love Automata.",
                    "Multi-solver Support in Symbolic Execution.",
                    "Under-Approximating Cut Sets for Reachability in Large Scale Automata Networks.",
                    "Model-Checking Signal Transduction Networks through Decreasing Reachability Sets.",
                    "TTP: Tool for Tumor Progression.",
                    "Exploring Parameter Space of Stochastic Biochemical Systems Using Quantitative Model Checking.",
                    "Parameterized Verification of Asynchronous Shared-Memory Systems.",
                    "Partial Orders for Efficient Bounded Model Checking of Concurrent Software.",
                    "Incremental, Inductive Coverability.",
                    "Automatic Linearizability Proofs of Concurrent Objects with Cooperating Updates.",
                    "Duet: Static Analysis for Unbounded Parallelism.",
                    "SVA and PSL Local Variables - A Practical Approach.",
                    "Formal Verification of Hardware Synthesis.",
                    "CacBDD: A BDD Package with Dynamic Cache Management.",
                    "Distributed Explicit State Model Checking of Deadlock Freedom.",
                    "Exponential-Condition-Based Barrier Certificate Generation for Safety Verification of Hybrid Systems.",
                    "Flow*: An Analyzer for Non-linear Hybrid Systems.",
                    "Efficient Robust Monitoring for STL.",
                    "Abstraction Based Model-Checking of Stability of Hybrid Systems.",
                    "System Level Formal Verification via Model Checking Driven Simulation.",
                    "Beautiful Interpolants.",
                    "Efficient Generation of Small Interpolants in CNF.",
                    "Disjunctive Interpolants for Horn-Clause Verification.",
                    "Generating Non-linear Interpolants by Semidefinite Programming.",
                    "Under-Approximating Loops in C Programs for Fast Counterexample Detection.",
                    "Proving Termination Starting from the End.",
                    "Better Termination Proving through Cooperation.",
                    "Relative Equivalence in the Presence of Ambiguity.",
                    "Combining Relational Learning with SMT Solvers Using CEGAR.",
                    "A Fully Verified Executable LTL Model Checker.",
                    "Automatic Generation of Quality Specifications.",
                    "Upper Bounds for Newton's Method on Monotone Polynomial Systems, and P-Time Model Checking of Probabilistic One-Counter Automata.",
                    "Probabilistic Program Analysis with Martingales.",
                    "Polynomial-Time Verification of PCTL Properties of MDPs with Convex Uncertainties.",
                    "Faster Algorithms for Markov Decision Processes with Low Treewidth.",
                    "Automata with Generalized Rabin Pairs for Probabilistic Model Checking and LTL Synthesis.",
                    "Importance Splitting for Statistical Model Checking Rare Properties.",
                    "Minimal Sets over Monotone Predicates in Boolean Formulae.",
                    "A Scalable and Nearly Uniform Generator of SAT Witnesses.",
                    "Equivalence of Extended Symbolic Finite Transducers.",
                    "Finite Model Finding in SMT.",
                    "JBernstein: A Validity Checker for Generalized Polynomial Constraints.",
                    "ILP Modulo Theories.",
                    "Smten: Automatic Translation of High-Level Symbolic Computations into SMT Queries.",
                    "Explain: A Tool for Performing Abductive Inference.",
                    "A Tool for Estimating Information Leakage.",
                    "The TAMARIN Prover for the Symbolic Analysis of Security Protocols.",
                    "QUAIL: A Quantitative Security Analyzer for Imperative Code.",
                    "Lengths May Break Privacy - Or How to Check for Equivalences with Length.",
                    "Finding Security Vulnerabilities in a Network Protocol Using Parameterized Systems.",
                    "Fully Automated Shape Analysis Based on Forest Automata.",
                    "Effectively-Propositional Reasoning about Reachability in Linked Data Structures.",
                    "Automating Separation Logic Using SMT.",
                    "SeLoger: A Tool for Graph-Based Reasoning in Separation Logic.",
                    "Validating Library Usage Interactively.",
                    "Learning Universally Quantified Invariants of Linear Data Structures.",
                    "Towards Distributed Software Model-Checking Using Decision Diagrams.",
                    "Automatic Abstraction in SMT-Based Unbounded Software Model Checking.",
                    "DiVinE 3.0 - An Explicit-State Model Checker for Multithreaded C & C++ Programs.",
                    "Solving Existentially Quantified Horn Clauses.",
                    "GOAL for Games, Omega-Automata, and Logics.",
                    "PRALINE: A Tool for Computing Nash Equilibria in Concurrent Games.",
                    "Program Repair without Regret.",
                    "Programs from Proofs - A PCC Alternative.",
                    "PARTY Parameterized Synthesis of Token Rings.",
                    "Recursive Program Synthesis.",
                    "Efficient Synthesis for Concurrency by Semantics-Preserving Transformations.",
                    "Multi-core Emptiness Checking of Timed Büchi Automata Using Inclusion Abstraction.",
                    "PSyHCoS: Parameter Synthesis for Hierarchical Concurrent Real-Time Systems.",
                    "Lazy Abstractions for Timed Automata.",
                    "Shrinktech: A Tool for the Robustness Analysis of Timed Automata."
                ]
            },
            {
                "sub_name_abbr": "conf/cav/2013vpt",
                "sub_name": "First International Workshop on Verification and Program Transformation, VPT 2013, Saint Petersburg, Russia, July 12-13, 2013.",
                "count": 10,
                "papers": [
                    "Ranking Functions for Linear-Constraint Loops.",
                    "Transforming Undecidable Synthesis Problems into Decidable Problems.",
                    "Acceleration For Presburger Petri Nets.",
                    "Program Transformation for Program Verification.",
                    "Building trustworthy refactoring tools.",
                    "Cryptographic Protocol Verification via Supercompilation (A Case Study).",
                    "Verification of Imperative Programs through Transformation of Constraint Logic Programs.",
                    "On the Termination of Positive Supercompilation.",
                    "Transforming Event B Models into Verified C# Implementations.",
                    "Ping-Pong Protocols as Prefix Grammars and Turchin Relation."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/FinkbeinerS14",
                "sub_name": "Proceedings Second Workshop on Synthesis, SYNT 2013, Saint Petersburg, Russia, July 13th and July 14th, 2013.",
                "count": 1,
                "papers": [
                    "Toward Synthesis of Network Updates."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "24th CAV 2012",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2012",
                "sub_name": "Computer Aided Verification - 24th International Conference, CAV 2012, Berkeley, CA, USA, July 7-13, 2012 Proceedings.",
                "count": 64,
                "papers": [
                    "Synthesis and Some of Its Challenges.",
                    "Model Checking Cell Biology.",
                    "Synthesizing Programs with Constraint Solvers.",
                    "IC3 and beyond: Incremental, Inductive Verification.",
                    "Formal Verification of Genetic Circuits.",
                    "From C to Infinity and Back: Unbounded Auto-active Verification with VCC.",
                    "Deterministic Automata for the (F, G)-Fragment of LTL.",
                    "Efficient Controller Synthesis for Consumption Games with Multiple Resource Types.",
                    "ACTL ∩ LTL Synthesis.",
                    "Learning Boolean Functions Incrementally.",
                    "Interpolants as Classifiers.",
                    "Termination Analysis with Algorithmic Learning.",
                    "Automated Termination Proofs for Java Programs with Cyclic Data.",
                    "Proving Termination of Probabilistic Programs Using Patterns.",
                    "The Gauge Domain: Scalable Analysis of Linear Inequality Invariants.",
                    "Diagnosing Abstraction Failure for Separation Logic-Based Analyses.",
                    "A Method for Symbolic Computation of Abstract Operations.",
                    "Leveraging Interpolant Strength in Model Checking.",
                    "Detecting Fair Non-termination in Multithreaded Programs.",
                    "Lock Removal for Concurrent Trace Programs.",
                    "How to Prove Algorithms Linearisable.",
                    "Synchronisation- and Reversal-Bounded Analysis of Multithreaded Programs with Counters.",
                    "Software Model Checking via IC3.",
                    "Delayed Continuous-Time Markov Chains for Genetic Regulatory Circuits.",
                    "Assume-Guarantee Abstraction Refinement for Probabilistic Systems.",
                    "Cross-Entropy Optimisation of Importance Sampling Parameters for Statistical Model Checking.",
                    "Timed Relational Abstractions for Sampled Data Control Systems.",
                    "Approximately Bisimilar Symbolic Models for Digital Control Systems.",
                    "Formal Verification and Validation of ERTMS Industrial Railway Train Spacing System.",
                    "Minimum Satisfying Assignments for SMT.",
                    "When Boolean Satisfiability Meets Gaussian Elimination in a Simplex Way.",
                    "A Solver for Reachability Modulo Theories.",
                    "On Decidability of Prebisimulation for Timed Automata.",
                    "Exercises in Nonstandard Static Analysis of Hybrid Systems.",
                    "A Box-Based Distance between Regions for Guiding the Reachability Analysis of SpaceEx.",
                    "An Axiomatic Memory Model for POWER Multiprocessors.",
                    "nuTAB-BackSpace: Rewriting to Normalize Non-determinism in Post-silicon Debug Traces.",
                    "Incremental, Inductive CTL Model Checking.",
                    "Efficient Runtime Policy Enforcement Using Counterexample-Guided Abstraction Refinement.",
                    "Automatic Quantification of Cache Side-Channels.",
                    "Secure Programming via Visibly Pushdown Safety Games.",
                    "Alternate and Learn: Finding Witnesses without Looking All over.",
                    "A Complete Method for Symmetry Reduction in Safety Verification.",
                    "Synthesizing Number Transformations from Input-Output Examples.",
                    "Acacia+, a Tool for LTL Synthesis.",
                    "MGSyn: Automatic Synthesis for Industrial Automation.",
                    "OpenNWA: A Nested-Word Automaton Library.",
                    "Ufo: A Framework for Abstraction- and Interpolation-Based Software Verification.",
                    "SAFARI: SMT-Based Abstraction for Arrays with Interpolants.",
                    "Bma: Visual Tool for Modeling and Analyzing Biological Networks.",
                    "APEX: An Analyzer for Open Probabilistic Programs.",
                    "Recent Developments in FDR.",
                    "A Model Checker for Hierarchical Probabilistic Real-Time Systems.",
                    "SYMDIFF: A Language-Agnostic Semantic Diff Tool for Imperative Programs.",
                    "Cubicle: A Parallel SMT-Based Model Checker for Parameterized Systems - Tool Paper.",
                    "HybridSAL Relational Abstracter.",
                    "Euler: A System for Numerical Optimization of Programs.",
                    "SPT: Storyboard Programming Tool.",
                    "CSolve: Verifying C with Liquid Types.",
                    "passert: A Tool for Debugging Parallel Programs.",
                    "TRACER: A Symbolic Execution Tool for Verification.",
                    "Joogie: Infeasible Code Detection for Java.",
                    "Hector: An Equivalence Checker for a Higher-Order Fragment of ML.",
                    "Resource Aware ML."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/abs-1207-0554",
                "sub_name": "Proceedings First Workshop on Synthesis, SYNT 2012, Berkeley, California, USA, 7th and 8th July 2012.",
                "count": 4,
                "papers": [
                    "Sparse Positional Strategies for Safety Games.",
                    "Towards Algorithmic Synthesis of Synchronization for Shared-Memory Concurrent Programs.",
                    "Theory and Techniques for Synthesizing a Family of Graph Algorithms.",
                    "Synthesizing Robust Systems with RATSY."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "23rd CAV 2011",
        "info": "Snowbird, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2011",
                "sub_name": "Computer Aided Verification - 23rd International Conference, CAV 2011, Snowbird, UT, USA, July 14-20, 2011. Proceedings.",
                "count": 60,
                "papers": [
                    "HAMPI: A String Solver for Testing, Analysis and Vulnerability Detection.",
                    "Using Types for Software Verification.",
                    "SMT-Based Modular Analysis of Sequential Systems Code.",
                    "Logic and Compositional Verification of Hybrid Systems - (Invited Tutorial).",
                    "Using Coverage to Deploy Formal Verification in a Simulation World.",
                    "Stability in Weak Memory Models.",
                    "Verification of Certifying Computations.",
                    "Parameter Identification for Markov Models of Biochemical Reactions.",
                    "Getting Rid of Store-Buffers in TSO Analysis.",
                    "Malware Analysis with Tree Automata Inference.",
                    "State/Event-Based LTL Model Checking under Parametric Generalized Fairness.",
                    "Resolution Proofs and Skolem Functions in QBF Evaluation and Applications.",
                    "The BINCOA Framework for Binary Code Analysis.",
                    "CVC4.",
                    "SLAyer: Memory Safety for Systems-Level Code.",
                    "CPAchecker: A Tool for Configurable Software Verification.",
                    "Existential Quantification as Incremental SAT.",
                    "Efficient Analysis of Probabilistic Programs with an Unbounded Counter.",
                    "Model Checking Algorithms for CTMDPs.",
                    "Quantitative Synthesis for Concurrent Programs.",
                    "Symbolic Algorithms for Qualitative Analysis of Markov Decision Processes with Büchi Objectives.",
                    "Smoothing a Program Soundly and Robustly.",
                    "A Specialization Calculus for Pruning Disjunctive Predicates to Support Verification.",
                    "Kratos - A Software Model Checker for SystemC.",
                    "Efficient Scenario Verification for Hybrid Automata.",
                    "Temporal Property Verification as a Program Analysis Task.",
                    "Time for Statistical Model Checking of Real-Time Systems.",
                    "Symmetry-Aware Predicate Abstraction for Shared-Variable Concurrent Programs.",
                    "Predator: A Practical Tool for Checking Manipulation of Dynamic Data Structures Using Separation Logic.",
                    "SpaceEx: Scalable Verification of Hybrid Systems.",
                    "From Cardiac Cells to Genetic Regulatory Networks.",
                    "Threader: A Constraint-Based Verifier for Multi-threaded Programs.",
                    "Interactive Synthesis of Code Snippets.",
                    "Forest Automata for Verification of Heap Manipulation.",
                    "Synthesizing Cyber-Physical Architectural Models with Real-Time Constraints.",
                    "μZ- An Efficient Engine for Fixed Points with Constraints.",
                    "BAP: A Binary Analysis Platform.",
                    "HMC: Verifying Functional Programs Using Abstract Interpreters.",
                    "A Quantifier Elimination Algorithm for Linear Modular Equations and Disequations.",
                    "Bug-Assist: Assisting Fault Localization in ANSI-C Programs.",
                    "Synthesis of Distributed Control through Knowledge Accumulation.",
                    "Language Equivalence for Probabilistic Automata.",
                    "Formalization and Automated Verification of RESTful Behavior.",
                    "Linear Completeness Thresholds for Bounded Model Checking.",
                    "Interpolation-Based Software Verification with Wolverine.",
                    "Synthesizing Biological Theories.",
                    "PRISM 4.0: Verification of Probabilistic Real-Time Systems.",
                    "Program Analysis for Overlaid Data Structures.",
                    "KLOVER: A Symbolic Execution and Automatic Test Generation Tool for C++ Programs.",
                    "Fully Symbolic Model Checking for Timed Automata.",
                    "Complete Formal Hardware Verification of Interfaces for a FlexRay-Like Bus.",
                    "Synthia: Verification and Synthesis for Timed Automata.",
                    "FixBag: A Fixpoint Calculator for Quantified Bag Constraints.",
                    "Analyzing Unsynthesizable Specifications for High-Level Robot Behavior Using LTLMoP.",
                    "Practical, Low-Effort Equivalence Verification of Real Code.",
                    "Relational Abstractions for Continuous and Hybrid Systems.",
                    "Simplifying Loop Invariant Generation Using Splitter Predicates.",
                    "Monitorability of Stochastic Dynamical Systems.",
                    "Equality-Based Translation Validator for LLVM.",
                    "Model Checking Recursive Programs with Numeric Data Types."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "22nd CAV 2010",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2010",
                "sub_name": "Computer Aided Verification, 22nd International Conference, CAV 2010, Edinburgh, UK, July 15-19, 2010. Proceedings.",
                "count": 58,
                "papers": [
                    "Policy Monitoring in First-Order Temporal Logic.",
                    "Retrofitting Legacy Code for Security.",
                    "Quantitative Information Flow: From Theory to Practice?",
                    "Memory Management in Concurrent Algorithms.",
                    "ABC: An Academic Industrial-Strength Verification Tool.",
                    "There's Plenty of Room at the Bottom: Analyzing and Verifying Machine Code.",
                    "Constraint Solving for Program Verification: Theory and Practice by Example.",
                    "Invariant Synthesis for Programs Manipulating Lists with Unbounded Data.",
                    "Termination Analysis with Compositional Transition Invariants.",
                    "Lazy Annotation for Program Testing and Verification.",
                    "The Static Driver Verifier Research Platform.",
                    "Dsolve: Safety Verification via Liquid Types.",
                    "Contessa: Concurrency Testing Augmented with Symbolic Analysis.",
                    "Simulation Subsumption in Ramsey-Based Büchi Automata Universality and Inclusion Testing.",
                    "Efficient Emptiness Check for Timed Büchi Automata.",
                    "Merit: An Interpolating Model-Checker.",
                    "Breach, A Toolbox for Verification and Parameter Synthesis of Hybrid Systems.",
                    "Jtlv: A Framework for Developing Verification Algorithms.",
                    "Petruchio: From Dynamic Networks to Nets.",
                    "Synthesis of Quantized Feedback Control Software for Discrete Time Linear Hybrid Systems.",
                    "Safety Verification for Probabilistic Hybrid Systems.",
                    "A Logical Product Approach to Zonotope Intersection.",
                    "Fast Acceleration of Ultimately Periodic Relations.",
                    "An Abstraction-Refinement Approach to Verification of Artificial Neural Networks.",
                    "Fences in Weak Memory Models.",
                    "Generating Litmus Tests for Contrasting Memory Consistency Models.",
                    "Directed Proof Generation for Machine Code.",
                    "Verifying Low-Level Implementations of High-Level Datatypes.",
                    "Automatic Generation of Inductive Invariants from High-Level Microarchitectural Models of Communication Fabrics.",
                    "Efficient Reachability Analysis of Büchi Pushdown Systems for Hardware/Software Co-verification.",
                    "LTSmin: Distributed and Symbolic Reachability.",
                    "libalf: The Automata Learning Framework.",
                    "Symbolic Bounded Synthesis.",
                    "Measuring and Synthesizing Systems in Probabilistic Environments.",
                    "Achieving Distributed Control through Model Checking.",
                    "Robustness in the Presence of Liveness.",
                    "RATSY - A New Requirements Analysis Tool with Synthesis.",
                    "Comfusy: A Tool for Complete Functional Synthesis.",
                    "Universal Causality Graphs: A Precise Happens-Before Model for Detecting Bugs in Concurrent Programs.",
                    "Automatically Proving Linearizability.",
                    "Model Checking of Linearizability of Concurrent List Implementations.",
                    "Local Verification of Global Invariants in Concurrent Programs.",
                    "Abstract Analysis of Symbolic Executions.",
                    "Automated Assume-Guarantee Reasoning through Implicit Learning.",
                    "Learning Component Interfaces with May and Must Abstractions.",
                    "A Dash of Fairness for Compositional Reasoning.",
                    "SPLIT: A Compositional LTL Verifier.",
                    "A Model Checker for AADL.",
                    "PESSOA: A Tool for Embedded Controller Synthesis.",
                    "On Array Theory of Bounded Elements.",
                    "Quantifier Elimination by Lazy Model Enumeration.",
                    "Bounded Underapproximations.",
                    "Global Reachability in Bounded Phase Multi-stack Pushdown Systems.",
                    "Model-Checking Parameterized Concurrent Programs Using Linear Interfaces.",
                    "Dynamic Cutoff Detection in Parameterized Concurrent Programs.",
                    "PARAM: A Model Checker for Parametric Markov Models.",
                    "Gist: A Solver for Probabilistic Games.",
                    "A NuSMV Extension for Graded-CTL Model Checking."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "21st CAV 2009",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2009",
                "sub_name": "Computer Aided Verification, 21st International Conference, CAV 2009, Grenoble, France, June 26 - July 2, 2009. Proceedings.",
                "count": 60,
                "papers": [
                    "Transactional Memory: Glimmer of a Theory.",
                    "Mixed-Signal System Verification: A High-Speed Link Example.",
                    "Modelling Epigenetic Information Maintenance: A Kappa Tutorial.",
                    "Component-Based Construction of Real-Time Systems in BIP.",
                    "Models and Proofs of Protocol Security: A Progress Report.",
                    "Predictability vs. Efficiency in the Multicore Era: Fight of Titans or Happy Ever after?.",
                    "SPEED: Symbolic Complexity Bound Analysis.",
                    "Regression Verification: Proving the Equivalence of Similar Programs.",
                    "Symbolic Counter Abstraction for Concurrent Software.",
                    "Priority Scheduling of Distributed Systems Based on Model Checking.",
                    "Explaining Counterexamples Using Causality.",
                    "Size-Change Termination, Monotonicity Constraints and Ranking Functions.",
                    "Linear Functional Fixed-points.",
                    "Better Quality in Synthesis through Quantitative Objectives.",
                    "Automatic Verification of Integer Array Programs.",
                    "Automated Analysis of Java Methods for Confidentiality.",
                    "Requirements Validation for Hybrid Systems.",
                    "Towards Performance Prediction of Compositional Models in Industrial GALS Designs.",
                    "Image Computation for Polynomial Dynamical Systems Using the Bernstein Expansion.",
                    "Cuts from Proofs: A Complete and Practical Technique for Solving Linear Inequalities over Integers.",
                    "Meta-analysis for Atomicity Violations under Nested Locking.",
                    "An Antichain Algorithm for LTL Realizability.",
                    "On Extending Bounded Proofs to Inductive Proofs.",
                    "Games through Nested Fixpoints.",
                    "Complete Instantiation for Quantified Formulas in Satisfiabiliby Modulo Theories.",
                    "Software Transactional Memory on Relaxed Memory Models.",
                    "Sliding Window Abstraction for Infinite Markov Chains.",
                    "Centaur Technology Media Unit Verification.",
                    "Incremental Instance Generation in Local Reasoning.",
                    "Quantifier Elimination via Functional Composition.",
                    "Monotonic Partial Order Reduction: An Optimal Symbolic Partial Order Reduction Technique.",
                    "Replacing Testing with Formal Verification in Intel CoreTM i7 Processor Execution Engine Validation.",
                    "Generating and Analyzing Symbolic Traces of Simulink/Stateflow Models.",
                    "A Markov Chain Monte Carlo Sampler for Mixed Boolean/Integer Constraints.",
                    "Generalizing DPLL to Richer Logics.",
                    "Reducing Context-Bounded Concurrent Reachability to Sequential Reachability.",
                    "Intra-module Inference.",
                    "Static and Precise Detection of Concurrency Errors in Systems Code Using SMT Solvers.",
                    "Predecessor Sets of Dynamic Pushdown Networks with Tree-Regular Constraints.",
                    "Reachability Analysis of Hybrid Systems Using Support Functions.",
                    "Reducing Test Inputs Using Information Partitions.",
                    "On Using Floating-Point Computations to Help an Exact Linear Arithmetic Decision Procedure.",
                    "Cardinality Abstraction for Declarative Networking Applications.",
                    "Equivalence Checking of Static Affine Programs Using Widening to Handle Recurrences.",
                    "D-Finder: A Tool for Compositional Deadlock Detection and Verification.",
                    "HybridFluctuat: A Static Analyzer of Numerical Programs within a Continuous Environment.",
                    "The Zonotope Abstract Domain Taylor1+.",
                    "InvGen: An Efficient Invariant Generator.",
                    "INFAMY: An Infinite-State Markov Model Checker.",
                    "Browser-Based Enforcement of Interface Contracts in Web Applications with BeepBeep.",
                    "Homer: A Higher-Order Observational Equivalence Model checkER.",
                    "Apron: A Library of Numerical Abstract Domains for Static Analysis.",
                    "Beaver: Engineering an Efficient SMT Solver for Bit-Vector Arithmetic.",
                    "CalFuzzer: An Extensible Active Testing Framework for Concurrent Programs.",
                    "MCMAS: A Model Checker for the Verification of Multi-Agent Systems.",
                    "TASS: Timing Analyzer of Scenario-Based Specifications.",
                    "Translation Validation: From Simulink to C.",
                    "VS3: SMT Solvers for Program Verification.",
                    "PAT: Towards Flexible Verification under Fairness.",
                    "A Concurrent Portfolio Approach to SMT Solving."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "20th CAV 2008",
        "info": "Princeton, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2008",
                "sub_name": "Computer Aided Verification, 20th International Conference, CAV 2008, Princeton, NJ, USA, July 7-14, 2008, Proceedings.",
                "count": 53,
                "papers": [
                    "Singularity: Designing Better Software (Invited Talk).",
                    "Coping with Outside-the-Box Attacks.",
                    "Assertion-Based Verification: Industry Myths to Realities (Invited Tutorial).",
                    "Theorem Proving for Verification (Invited Tutorial).",
                    "Tutorial on Separation Logic (Invited Tutorial).",
                    "Abstract Interpretation with Applications to Timing Validation.",
                    "Reducing Concurrent Analysis Under a Context Bound to Sequential Analysis.",
                    "Monitoring Atomicity in Concurrent Programs.",
                    "Dynamic Verification of MPI Programs with Reductions in Presence of Split Operations and Relaxed Orderings.",
                    "A Hybrid Type System for Lock-Freedom of Mobile Processes.",
                    "Implied Set Closure and Its Application to Memory Consistency Verification.",
                    "Effective Program Verification for Relaxed Memory Models.",
                    "Mechanical Verification of Transactional Memories with Non-transactional Memory Accesses.",
                    "Automated Assume-Guarantee Reasoning by Abstraction Refinement.",
                    "Local Proofs for Linear-Time Properties of Concurrent Programs.",
                    "Probabilistic CEGAR.",
                    "Computing Differential Invariants of Hybrid Systems as Fixedpoints.",
                    "Constraint-Based Approach for Analysis of Hybrid Systems.",
                    "AutoMOTGen: Automatic Model Oriented Test Generator for Embedded Control Systems.",
                    "FShell: Systematic Test Case Generation for Dynamic Analysis and Measurement.",
                    "Applying the Graph Minor Theorem to the Verification of Graph Transformation Systems.",
                    "Conflict-Tolerant Features.",
                    "Ranking Automata and Games for Prioritized Requirements.",
                    "Efficient Craig Interpolation for Linear Diophantine (Dis)Equations and Linear Modular Equations.",
                    "Linear Arithmetic with Stars.",
                    "Inferring Congruence Equations Using SAT.",
                    "The Barcelogic SMT Solver.",
                    "The MathSAT 4SMT Solver.",
                    "CSIsat: Interpolation for LA+EUF.",
                    "Prover's Palette: A User-Centric Approach to Verification with Isabelle and QEPCAD-B.",
                    "Heap Assumptions on Demand.",
                    "Proving Conditional Termination.",
                    "Monotonic Abstraction for Programs with Dynamic Memory Heaps.",
                    "Enhancing Program Verification with Lemmas.",
                    "A Numerical Abstract Domain Based on Expression Abstraction and Max Operator with Application in Timing Analysis.",
                    "Scalable Shape Analysis for Systems Code.",
                    "Thread Quantification for Concurrent Shape Analysis.",
                    "The Scyther Tool: Verification, Falsification, and Analysis of Security Protocols.",
                    "The CASPA Tool: Causality-Based Abstraction for Security Protocol Analysis.",
                    "Jakstab: A Static Analysis Platform for Binaries.",
                    "THOR: A Tool for Reasoning about Shape and Arithmetic.",
                    "Functional Verification of Power Gated Designs by Compositional Reasoning.",
                    "A Practical Approach to Word Level Model Checking of Industrial Netlists.",
                    "Validating High-Level Synthesis.",
                    "An Algebraic Approach for Proving Data Correctness in Arithmetic Data Paths.",
                    "Application of Formal Word-Level Analysis to Constrained Random Simulation.",
                    "Producing Short Counterexamples Using \"Crucial Events\".",
                    "Discriminative Model Checking.",
                    "Correcting a Space-Efficient Simulation Algorithm.",
                    "Semi-external LTL Model Checking.",
                    "QMC: A Model Checker for Quantum Systems.",
                    "T(O)RMC: A Tool for (omega)-Regular Model Checking.",
                    "Faster Than Uppaal?"
                ]
            },
            {
                "sub_name_abbr": "conf/spin/5000",
                "sub_name": "25 Years of Model Checking - History, Achievements, Perspectives.",
                "count": 13,
                "papers": [
                    "The Birth of Model Checking.",
                    "The Beginning of Model Checking: A Personal Perspective.",
                    "Verification Technology Transfer.",
                    "New Challenges in Model Checking.",
                    "A Retrospective on Murphi.",
                    "Model Checking: From Tools to Theory.",
                    "Value Iteration.",
                    "Fifteen Years of Formal Property Verification in Intel.",
                    "A View from the Engine Room: Computational Support for Symbolic Model Checking.",
                    "From Church and Prior to PSL.",
                    "On the Merits of Temporal Testers.",
                    "Design and Synthesis of Synchronization Skeletons Using Branching Time Temporal Logic.",
                    "Specification and Verification of Conurrent Systems in Cesar."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "19th CAV 2007",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2007",
                "sub_name": "Computer Aided Verification, 19th International Conference, CAV 2007, Berlin, Germany, July 3-7, 2007, Proceedings.",
                "count": 54,
                "papers": [
                    "Automatically Proving Program Termination.",
                    "A Mathematical Approach to RTL Verification.",
                    "Software Bugs Seen from an Industrial Perspective or Can Formal Methods Help on Automotive Software Development?",
                    "Algorithms for Interface Synthesis.",
                    "A Tutorial on Satisfiability Modulo Theories.",
                    "A JML Tutorial: Modular Specification and Verification of Functional Behavior for Java.",
                    "Verification of Hybrid Systems.",
                    "SAT-Based Compositional Verification Using Lazy Learning.",
                    "Local Proofs for Global Safety Properties.",
                    "Low-Level Library Analysis and Summarization.",
                    "Verification Across Intellectual Property Boundaries.",
                    "On Synthesizing Controllers from Bounded-Response Properties.",
                    "An Accelerated Algorithm for 3-Color Parity Games with an Application to Timed Games.",
                    "UPPAAL-Tiga: Time for Playing Games!",
                    "The TASM Toolset: Specification, Simulation, and Formal Verification of Real-Time Systems.",
                    "Systematic Acceleration in Regular Model Checking.",
                    "Parameterized Verification of Infinite-State Processes with Global Conditions.",
                    "CADP 2006: A Toolbox for the Construction and Analysis of Distributed Processes.",
                    "jMoped: A Test Environment for Java Programs.",
                    "Hector: Software Model Checking with Cooperating Analysis Plugins.",
                    "The Why/Krakatoa/Caduceus Platform for Deductive Program Verification.",
                    "Shape Analysis for Composite Data Structures.",
                    "Array Abstractions from Proofs.",
                    "Context-Bounded Analysis of Multithreaded Programs with Dynamic Linked Structures.",
                    "Revamping TVLA: Making Parametric Shape Analysis Competitive.",
                    "Fast and Accurate Static Data-Race Detection for Concurrent Programs.",
                    "Parametric and Sliced Causality.",
                    "Spade: Verification of Multithreaded Dynamic and Recursive Programs.",
                    "Anzu: A Tool for Property Synthesis.",
                    "RAT: A Tool for the Formal Analysis of Requirements.",
                    "Parallelising Symbolic State-Space Generators.",
                    "I/O Efficient Accepting Cycle Detection.",
                    "C32SAT: Checking C Expressions.",
                    "CVC3.",
                    "BAT: The Bit-Level Analysis Tool.",
                    "LIRA: Handling Constraints of Linear Arithmetics over the Integers and the Reals.",
                    "Three-Valued Abstraction for Continuous-Time Markov Chains.",
                    "Magnifying-Lens Abstraction for Markov Decision Processes.",
                    "Underapproximation for Model-Checking Based on Random Cryptographic Constructions.",
                    "Using Counterexamples for Improving the Precision of Reachability Computation with Polyhedra.",
                    "Structural Abstraction of Software Verification Conditions.",
                    "An Abstract Domain for Analyzing Heap-Manipulating Low-Level Software.",
                    "Adaptive Symmetry Reduction.",
                    "From Liveness to Promptness.",
                    "Automated Assumption Generation for Compositional Verification.",
                    "Abstraction and Counterexample-Guided Construction of omega -Automata for Model Checking of Step-Discrete Linear Hybrid Models.",
                    "Test Coverage for Continuous and Hybrid Systems.",
                    "Hybrid Systems: From Verification to Falsification.",
                    "Comparison Under Abstraction for Verifying Linearizability.",
                    "Leaping Loops in the Presence of Abstraction.",
                    "Configurable Software Verification: Concretizing the Convergence of Model Checking and Program Analysis.",
                    "A Decision Procedure for Bit-Vectors and Arrays.",
                    "Boolean Abstraction for Temporal Logic Satisfiability.",
                    "A Lazy and Layered SMT($\\mathcal{BV}$) Solver for Hard Industrial Verification Problems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "18th CAV 2006",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2006",
                "sub_name": "Computer Aided Verification, 18th International Conference, CAV 2006, Seattle, WA, USA, August 17-20, 2006, Proceedings.",
                "count": 49,
                "papers": [
                    "Formal Specifications on Industrial-Strength Code-From Myth to Reality.",
                    "I Think I Voted: E-Voting vs. Democracy.",
                    "Playing with Verification, Planning and Aspects: Unusual Methods for Running Scenario-Based Programs.",
                    "The Ideal of Verified Software.",
                    "Antichains: A New Algorithm for Checking Universality of Finite Automata.",
                    "Safraless Compositional Synthesis.",
                    "Minimizing Generalized Büchi Automata.",
                    "Ticc: A Tool for Interface Compatibility and Composition.",
                    "FAST Extended Release.",
                    "Don't Care Words with an Application to the Automata-Based Approach for Real Addition.",
                    "A Fast Linear-Arithmetic Solver for DPLL(T).",
                    "Bounded Model Checking for Weak Alternating Büchi Automata.",
                    "Deriving Small Unsatisfiable Cores with Dominators.",
                    "Lazy Abstraction with Interpolants.",
                    "Using Statically Computed Invariants Inside the Predicate Abstraction and Refinement Loop.",
                    "Counterexamples with Loops for Predicate Abstraction.",
                    "cascade: C Assertion Checker and Deductive Engine.",
                    "Yasm: A Software Model-Checker for Verification and Refutation.",
                    "SAT-Based Assistance in Abstraction Refinement for Symbolic Trajectory Evaluation.",
                    "Automatic Refinement and Vacuity Detection for Symbolic Trajectory Evaluation.",
                    "Some Complexity Results for SystemVerilog Assertions.",
                    "Check It Out: On the Efficient Formal Verification of Live Sequence Charts.",
                    "Symmetry Reduction for Probabilistic Model Checking.",
                    "Communicating Timed Automata: The More Synchronous, the More Difficult to Verify.",
                    "Allen Linear (Interval) Temporal Logic - Translation to LTL and Monitor Synthesis.",
                    "DiVinE - A Tool for Distributed Verification.",
                    "EverLost: A Flexible Platform for Industrial-Strength Abstraction-Guided Simulation.",
                    "Symbolic Model Checking of Concurrent Programs Using Partial Orders and On-the-Fly Transactions.",
                    "Model Checking Multithreaded Programs with Asynchronous Atomic Methods.",
                    "Causal Atomicity.",
                    "Languages of Nested Trees.",
                    "Improving Pushdown System Model Checking.",
                    "Repair of Boolean Programs with an Application to C.",
                    "Termination of Integer Linear Programs.",
                    "Automatic Termination Proofs for Programs with Shape-Shifting Heaps.",
                    "Termination Analysis with Calling Context Graphs.",
                    "Terminator: Beyond Safety.",
                    "CUTE and jCUTE: Concolic Unit Testing and Explicit Path Model-Checking Tools.",
                    "SMT Techniques for Fast Predicate Abstraction.",
                    "The Power of Hybrid Acceleration.",
                    "Lookahead Widening.",
                    "The Heuristic Theorem Prover: Yet Another SMT Modulo Theorem Prover.",
                    "LEVER: A Tool for Learning Based Verification.",
                    "Formal Verification of a Lazy Concurrent List-Based Set Algorithm.",
                    "Bounded Model Checking of Concurrent Data Types on Relaxed Memory Models: A Case Study.",
                    "Fast and Generalized Polynomial Time Memory Consistency Verification.",
                    "Programs with Lists Are Counter Automata.",
                    "Lazy Shape Analysis.",
                    "Abstraction for Shape Analysis with Fast and Precise Transformers."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "17th CAV 2005",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2005",
                "sub_name": "Computer Aided Verification, 17th International Conference, CAV 2005, Edinburgh, Scotland, UK, July 6-10, 2005, Proceedings.",
                "count": 52,
                "papers": [
                    "Randomized Algorithms for Program Analysis and Verification.",
                    "Validating a Modern Microprocessor.",
                    "Algorithmic Algebraic Model Checking I: Challenges from Systems Biology.",
                    "SMT-COMP: Satisfiability Modulo Theories Competition.",
                    "Predicate Abstraction via Symbolic Decision Procedures.",
                    "Interpolant-Based Transition Relation Approximation.",
                    "Concrete Model Checking with Abstract Matching and Refinement.",
                    "Abstraction for Falsification.",
                    "Bounded Model Checking of Concurrent Programs.",
                    "Incremental and Complete Bounded Model Checking for Full PLTL.",
                    "Abstraction Refinement for Bounded Model Checking.",
                    "Symmetry Reduction in SAT-Based Model Checking.",
                    "Saturn: A SAT-Based Tool for Bug Detection.",
                    "JVer: A Java Verifier.",
                    "Building Your Own Software Model Checker Using the Bogor Extensible Model Checking Framework.",
                    "Wolf - Bug Hunter for Concurrent Software Using Formal Methods.",
                    "Model Checking x86 Executables with CodeSurfer/x86 and WPDS++.",
                    "The ComFoRT Reasoning Framework.",
                    "Formal Verification of Pentium® 4 Components with Symbolic Simulation and Inductive Invariants.",
                    "Formal Verification of Backward Compatibility of Microcode.",
                    "Compositional Analysis of Floating-Point Linear Numerical Filters.",
                    "Syntax-Driven Reachable State Space Construction of Synchronous Reactive Programs.",
                    "Program Repair as a Game.",
                    "Improved Probabilistic Models for 802.11 Protocol Verification.",
                    "Probabilistic Verification for \"Black-Box\" Systems.",
                    "On Statistical Model Checking of Stochastic Systems.",
                    "The AVISPA Tool for the Automated Validation of Internet Security Protocols and Applications.",
                    "The Orchids Intrusion Detection Tool.",
                    "TVOC: A Translation Validator for Optimizing Compilers.",
                    "Cogent: Accurate Theorem Proving for Program Verification.",
                    "F-Soft: Software Verification Platform.",
                    "Yet Another Decision Procedure for Equality Logic.",
                    "DPLL(T) with Exhaustive Theory Propagation and Its Application to Difference Logic.",
                    "Efficient Satisfiability Modulo Theories via Delayed Theory Combination.",
                    "Symbolic Systems, Explicit Properties: On Hybrid Approaches for LTL Symbolic Model Checking.",
                    "Efficient Monitoring of omega-Languages.",
                    "Verification of Tree Updates for Optimization.",
                    "Expand, Enlarge and Check... Made Efficient.",
                    "IIV: An Invisible Invariant Verifier.",
                    "Action Language Verifier, Extended.",
                    "Romeo: A Tool for Analyzing Time Petri Nets.",
                    "TRANSYT: A Tool for the Verification of Asynchronous Concurrent Systems.",
                    "Ymer: A Statistical Model Checker.",
                    "Extended Weighted Pushdown Systems.",
                    "Incremental Algorithms for Inter-procedural Analysis of Safety Properties.",
                    "A Policy Iteration Algorithm for Computing Fixed Points in Static Analysis of Programs.",
                    "Data Structure Specifications via Local Equality Axioms.",
                    "Linear Ranking with Reachability.",
                    "Reasoning About Threads Communicating via Locks.",
                    "Abstraction Refinement via Inductive Learning.",
                    "Automated Assume-Guarantee Reasoning for Simulation Conformance.",
                    "Symbolic Compositional Verification by Learning Assumptions."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "16th CAV 2004",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2004",
                "sub_name": "Computer Aided Verification, 16th International Conference, CAV 2004, Boston, MA, USA, July 13-17, 2004, Proceedings.",
                "count": 51,
                "papers": [
                    "Rob Tristan Gerth: 1956?2003.",
                    "Static Program Analysis via 3-Valued Logic.",
                    "Deductive Verification of Pipelined Machines Using First-Order Quantification.",
                    "A Formal Reduction for Lock-Free Parallel Algorithms.",
                    "An Efficiently Checkable, Proof-Based Formulation of Vacuity in Model Checking.",
                    "Termination of Linear Programs.",
                    "Symbolic Model Checking of Non-regular Properties.",
                    "Proving More Properties with Bounded Model Checking.",
                    "Parallel LTL-X Model Checking of High-Level Petri Nets Based on Unfoldings.",
                    "Using Interface Refinement to Integrate Formal Verification into the Design Cycle.",
                    "Indexed Predicate Discovery for Unbounded System Verification.",
                    "Range Allocation for Separation Logic.",
                    "An Experimental Evaluation of Ground Decision Procedures.",
                    "DPLL( T): Fast Decision Procedures.",
                    "Verifying omega-Regular Properties of Markov Chains.",
                    "Statistical Model Checking of Black-Box Probabilistic Systems.",
                    "Compositional Specification and Model Checking in GSTE.",
                    "GSTE Is Partitioned Model Checking.",
                    "Stuck-Free Conformance.",
                    "Symbolic Simulation, Model Checking and Abstraction with Partially Ordered Boolean Functional Vectors.",
                    "Functional Dependency for Verification Reduction.",
                    "Verification via Structure Simulation.",
                    "Symbolic Parametric Safety Analysis of Linear Hybrid Systems with BDD-Like Data-Structures.",
                    "Abstraction-Based Satisfiability Solving of Presburger Arithmetic.",
                    "Widening Arithmetic Automata.",
                    "Why Model Checking Can Improve WCET Analysis.",
                    "Regular Model Checking for LTL(MSO).",
                    "Image Computation in Infinite State Model Checking.",
                    "Abstract Regular Model Checking.",
                    "Global Model-Checking of Infinite-State Systems.",
                    "QB or Not QB: An Efficient Execution Verification Tool for Memory Orderings.",
                    "Verification of an Advanced mips-Type Out-of-Order Execution Algorithm.",
                    "Automatic Verification of Sequential Consistency for Unbounded Addresses and Data Values.",
                    "Efficient Modeling of Embedded Memories in Bounded Model Checking.",
                    "Understanding Counterexamples with explain.",
                    "Zapato: Automatic Theorem Proving for Predicate Abstraction Refinement.",
                    "JNuke: Efficient Dynamic Analysis for Java.",
                    "The HiVy Tool Set.",
                    "ObsSlice: A Timed Automata Slicer Based on Observers.",
                    "The UCLID Decision Procedure.",
                    "MCK: Model Checking the Logic of Knowledge.",
                    "Zing: A Model Checker for Concurrent Software.",
                    "The Mec 5 Model-Checker.",
                    "PlayGame: A Platform for Diagnostic Games.",
                    "SAL 2.",
                    "Formal Analysis of Java Programs in JavaFAN.",
                    "A Toolset for Modelling and Verification of GALS Systems.",
                    "WSAT: A Tool for Formal Analysis of Web Services.",
                    "CVC Lite: A New Implementation of the Cooperating Validity Checker Category B.",
                    "CirCUs: A Satisfiability Solver Geared towards Bounded Model Checking.",
                    "Mechanical Mathematical Methods for Microprocessor Verification."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "15th CAV 2003",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2003",
                "sub_name": "Computer Aided Verification, 15th International Conference, CAV 2003, Boulder, CO, USA, July 8-12, 2003, Proceedings.",
                "count": 41,
                "papers": [
                    "Interpolation and SAT-Based Model Checking.",
                    "Bounded Model Checking and Induction: From Refutation to Verification (Extended Abstract, Category A).",
                    "Reasoning with Temporal Logic on Truncated Paths.",
                    "Structural Symbolic CTL Model Checking of Asynchronous Systems.",
                    "A Work-Efficient Distributed Algorithm for Reachability Analysis.",
                    "Modular Strategies for Infinite Games on Recursive Graphs.",
                    "Fast Mu-Calculus Model Checking when Tree-Width Is Bounded.",
                    "Dense Counter Machines and Verification Problems.",
                    "TRIM: A Tool for Triggered Message Sequence Charts.",
                    "Model Checking Multi-Agent Programs with CASP.",
                    "Monitoring Temporal Rules Combined with Time Series.",
                    "FAST: Fast Acceleration of Symbolikc Transition Systems.",
                    "Rabbit: A Tool for BDD-Based Verification of Real-Time Systems.",
                    "Making Predicate Abstraction Efficient: How to Eliminate Redundant Predicates.",
                    "A Symbolic Approach to Predicate Abstraction.",
                    "Unbounded, Fully Symbolic Model Checking of Timed Automata using Boolean Methods.",
                    "Digitizing Interval Duration Logic.",
                    "Timed Control with Partial Observability.",
                    "Hybrid Acceleration Using Real Vector Automata (Extended Abstract).",
                    "Abstraction and BDDs Complement SAT-Based BMC in DiVer.",
                    "TLQSolver: A Temporal Logic Query Checker.",
                    "Evidence Explorer: A Tool for Exploring Model-Checking Proofs.",
                    "HERMES: An Automatic Tool for Verification of Secrecy in Security Protocols.",
                    "Iterating Transducers in the Large (Extended Abstract).",
                    "Algorithmic Improvements in Regular Model Checking.",
                    "Efficient Image Computation in Infinite State Model Checking.",
                    "Thread-Modular Abstraction Refinement.",
                    "A Game-Based Framework for CTL Counterexamples and 3-Valued Abstraction-Refinement.",
                    "Abstraction for Branching Time Properties.",
                    "Certifying Optimality of State Estimation Programs.",
                    "Domain-Specific Optimization in Automata Learning.",
                    "Model Checking Conformance with Scenario-Based Specifications.",
                    "Deductive Verification of Advanced Out-of-Order Microprocessors.",
                    "Theorem Proving Using Lazy Proof Explication.",
                    "Enhanced Vacuity Detection in Linear Temporal Logic.",
                    "Bridging the Gap between Fair Simulation and Trace Inclusion.",
                    "An Improved On-The-Fly Tableau Construction for a Real-Time Temporal Logic.",
                    "Strengthening Invariants by Symbolic Consistency Testing.",
                    "Linear Invariant Generation Using Non-linear Constraint Solving.",
                    "To Store or Not to Store.",
                    "Calculating-Confluence Compositionally."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "14th CAV 2002",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2002",
                "sub_name": "Computer Aided Verification, 14th International Conference, CAV 2002,Copenhagen, Denmark, July 27-31, 2002, Proceedings.",
                "count": 51,
                "papers": [
                    "Software Analysis and Model Checking.",
                    "The Quest for Efficient Boolean Satisfiability Solvers.",
                    "On Abstraction in Software Verification.",
                    "The Symbolic Approach to Hybrid Systems.",
                    "Infinite Games and Verification (Extended Abstract of a Tutorial).",
                    "Symbolic Localization Reduction with Reconstruction Layering and Backtracking.",
                    "Modeling and Verifying Systems Using a Logic of Counter Arithmetic with Lambda Expressions and Uninterpreted Functions.",
                    "Combining Symmetry Reduction and Under-Approximation for Symbolic Model Checking.",
                    "Liveness with (0, 1, infty)-Counter Abstraction.",
                    "Shared Memory Consistency Protocol Verification Against Weak Memory Models: Refinement via Model-Checking.",
                    "Automatic Abstraction Using Generalized Model Checking.",
                    "Property Checking via Structural Analysis.",
                    "Conformance Checking for Models of Asynchronous Message Passing Software.",
                    "A Modular Checker for Multithreaded Programs.",
                    "Automatic Derivation of Timing Constraints by Failure Analysis.",
                    "Deciding Separation Formulas with SAT.",
                    "Probabilistic Verification of Discrete Event Systems Using Acceptance Sampling.",
                    "Checking Satisfiability of First-Order Formulas by Incremental Translation to SAT.",
                    "Applying SAT Methods in Unbounded Symbolic Model Checking.",
                    "SAT Based Abstraction-Refinement Using ILP and Machine Learning Techniques.",
                    "Semi-formal Bounded Model Checking.",
                    "Algorithmic Verification of Invalidation-Based Protocols.",
                    "Formal Verification of Complex Out-of-Order Pipelines by Combining Model-Checking and Theorem-Proving.",
                    "Automated Unbounded Verification of Security Protocols.",
                    "Exploiting Behavioral Hierarchy for Efficient Model Checking.",
                    "IF-2.0: A Validation Environment for Component-Based Real-Time Systems.",
                    "The AVISS Security Protocol Analysis Tool.",
                    "SPeeDI - A Verification Tool for Polygonal Hybrid Systems.",
                    "NuSMV 2: An OpenSource Tool for Symbolic Model Checking.",
                    "The d/dt Tool for Verification of Hybrid Systems.",
                    "Model Checking Linear Properties of Prefix-Recognizable Systems.",
                    "Using Canonical Representations of Solutions to Speed Up Infinite-State Model Checking.",
                    "On Discrete Modeling and Model Checking for Nonlinear Analog Systems.",
                    "Synchronous and Bidirectional Component Interfaces.",
                    "Interface Compatibility Checking for Software Modules.",
                    "Practical Methods for Proving Program Termination.",
                    "Evidence-Based Model Checking.",
                    "Mixing Forward and Backward Traversals in Guided-Prioritized BDD-Based Verification.",
                    "Vacuum Cleaning CTL Formulae.",
                    "CVC: A Cooperating Validity Checker.",
                    "chi-Chek: A Multi-valued Model-Checker.",
                    "PathFinder: A Tool for Design Exploration.",
                    "Abstracting C with abC.",
                    "AMC: An Adaptive Model Checker.",
                    "Temporal-Safety Proofs for Systems Code.",
                    "Extrapolating Tree Transformations.",
                    "Regular Tree Model Checking.",
                    "Compressing Transitions for Model Checking.",
                    "Canonical Prefixes of Petri Net Unfoldings.",
                    "State Space Reduction by Proving Confluence.",
                    "Fair Simulation Minimization."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "13th CAV 2001",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2001",
                "sub_name": "Computer Aided Verification, 13th International Conference, CAV 2001, Paris, France, July 18-22, 2001, Proceedings.",
                "count": 48,
                "papers": [
                    "Software Documentation and the Verification Process.",
                    "Certifying Model Checkers.",
                    "Formalizing a JVML Verifier for Initialization in a Theorem Prover.",
                    "Automated Inductive Verification of Parameterized Protocols.",
                    "Efficient Model Checking Via Büchi Tableau Automata.",
                    "Fast LTL to Büchi Automata Translation.",
                    "A Practical Approach to Coverage in Model Checking.",
                    "A Fast Bisimulation Algorithm.",
                    "Symmetry and Reduced Symmetry in Model Checking.",
                    "Transformation-Based Verification Using Generalized Retiming.",
                    "Meta-BDDs: A Decomposed Representation for Layered Symbolic Manipulation of Boolean Functions.",
                    "CLEVER: Divide and Conquer Combinational Logic Equivalence VERification with False Negative Elimination.",
                    "Finite Instantiations in Equivalence Logic with Uninterpreted Functions.",
                    "Model Checking with Formula-Dependent Abstract Models.",
                    "Verifying Network Protocol Implementations by Symbolic Refinement Checking.",
                    "Automatic Abstraction for Verification of Timed Circuits and Systems.",
                    "Automated Verification of a Randomized Distributed Consensus Protocol Using Cadence SMV and PRISM.",
                    "Analysis of Recursive State Machines.",
                    "Parameterized Verification with Automatically Computed Inductive Assertions.",
                    "EVC: A Validity Checker for the Logic of Equality with Uninterpreted Functions and Memories, Exploiting Positive Equality, and Conservative Transformations.",
                    "AGVI - Automatic Generation, Verification, and Implementation of Security Protocols.",
                    "ICS: Integrated Canonizer and Solver.",
                    "µCRL: A Toolset for Analysing Algebraic Specifications.",
                    "Truth/SLC - A Parallel Verification Platform for Concurrent Systems.",
                    "The SLAM Toolkit.",
                    "Java Bytecode Verification: An Overview.",
                    "Iterating Transducers.",
                    "Attacking Symbolic State Explosion.",
                    "A Unifying Model Checking Approach for Safety Properties of Parameterized Systems.",
                    "A BDD-Based Model Checker for Recursive Programs.",
                    "Model Checking the World Wide Web.",
                    "Distributed Symbolic Model Checking for µ-Calculus.",
                    "The Temporal Logic Sugar.",
                    "TReX: A Tool for Reachability Analysis of Complex Systems.",
                    "BooStER: Speeding Up RTL Property Checking of Digital Designs by Word-Level Abstarction.",
                    "SDLcheck: A Model Checking Tool.",
                    "EASN: Integrating ASN.1 and Model Checking.",
                    "Rtdt: A Front-End for Efficient Model Checking of Synchronous Timing Diagrams.",
                    "TAXYS: A Tool for the Development and Verification of Real-Time Embedded Systems.",
                    "Microarchitecture Verification by Compositional Model Checking.",
                    "Rewriting for Symbolic Execution of State Machine Models.",
                    "Using Timestamping and History Variables to Verify Sequential Consistency.",
                    "Benefits of Bounded Model Checking at an Industrial Setting.",
                    "Finding Bugs in an Alpha Microprocessor Using Satisfiability Solvers.",
                    "Towards Efficient Verification of Arithmetic Algorithms over Galois Fields GF(2m).",
                    "Job-Shop Scheduling Using Timed Automata.",
                    "As Cheap as Possible: Efficient Cost-Optimal Reachability for Priced Timed Automata.",
                    "Binary Reachability Analysis of Pushdown Timed Automata with Dense Clocks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "12th CAV 2000",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/2000",
                "sub_name": "Computer Aided Verification, 12th International Conference, CAV 2000, Chicago, IL, USA, July 15-19, 2000, Proceedings.",
                "count": 48,
                "papers": [
                    "Keynote Address: Abstraction, Composition, Symmetry, and a Little Deduction: The Remedies to State Explosion.",
                    "Invited Address: Applying Formal Methods to Cryptographic Protocol Analysis.",
                    "Invited Tutorial: Boolean Satisfiability Algorithms and Applications in Electronic Design Automation.",
                    "Invited Tutorial: Verification of Infinite-State and Parameterized Systems.",
                    "An Abstraction Algorithm for the Verification of Generalized C-Slow Designs.",
                    "Achieving Scalability in Parallel Reachability Analysis of Very Large Circuits.",
                    "An Automata-Theoretic Approach to Reasoning about Infinite-State Systems.",
                    "Automatic Verification of Parameterized Cache Coherence Protocols.",
                    "Binary Reachability Analysis of Discrete Pushdown Timed Automata.",
                    "Boolean Satisfiability with Transitivity Constraints.",
                    "Bounded Model Construction for Monadic Second-Order Logics.",
                    "Building Circuits from Relations.",
                    "Combining Decision Diagrams and SAT Procedures for Efficient Symbolic Model Checking.",
                    "On the Competeness of Compositional Reasoning.",
                    "Counterexample-Guided Abstraction Refinement.",
                    "Decision Procedures for Inductive Boolean Functions Based on Alternating Automata.",
                    "Detecting Errors Before Reaching Them.",
                    "A Discrete Strategy Improvement Algorithm for Solving Parity Games.",
                    "Distributing Timed Model Checking - How the Search Order Matters.",
                    "Efficient Algorithms for Model Checking Pushdown Systems.",
                    "Efficient Büchi Automata from LTL Formulae.",
                    "Efficient Detection of Global Properties in Distributed Systems Using Partial-Order Methods.",
                    "Efficient Reachability Analysis of Hierarchical Reactive Machines.",
                    "Formal Verification of VLIW Microprocessors with Speculative Execution.",
                    "Induction in Compositional Model Checking.",
                    "Liveness and Acceleration in Parameterized Verification.",
                    "Mechanical Verification of an Ideal Incremental ABR Conformance.",
                    "Model Checking Continuous-Time Markov Chains by Transient Analysis.",
                    "Model-Checking for Hybrid Systems by Quotienting and Constraints Solving.",
                    "Prioritized Traversal: Efficient Reachability Analysis for Verification and Falsification.",
                    "Regular Model Checking.",
                    "Symbolic Techniques for Parametric Reasoning about Counter and Clock Systems.",
                    "Syntactic Program Transformations for Automatic Abstraction.",
                    "Temporal-Locig Queries.",
                    "Are Timed Automata Updatable?",
                    "Tuning SAT Checkers for Bounded Model Checking.",
                    "Unfoldings of Unbounded Petri Nets.",
                    "Verification Diagrams Revisited: Disjunctive Invariants for Easy Verification.",
                    "Verifying Advanced Microarchitectures that Support Speculation and Exceptions.",
                    "FoCs: Automatic Generation of Simulation Checkers from Formal Specifications.",
                    "IF: A Validation Environment for Timed Asynchronous Systems.",
                    "Integrating WS1S with PVS.",
                    "PET: An Interactive Software Testing Tool.",
                    "A Proof-Carrying Code Architecture for Java.",
                    "The STATEMATE Verification Environment - Making It Real.",
                    "TAPS: A First-Order Verifier for Cryptographic Protocols.",
                    "VINAS-P: A Tool for Trace Theoretic Verification of Timed Asynchronous Circuits.",
                    "XMC: A Logic-Programming-Based Verification Toolset."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "11th CAV 1999",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1999",
                "sub_name": "Computer Aided Verification, 11th International Conference, CAV '99, Trento, Italy, July 6-10, 1999, Proceedings.",
                "count": 43,
                "papers": [
                    "Alternative Approaches to Hardware Verification (abstract).",
                    "The Compositional Specification of Timed Systems - A Tutorial.",
                    "Timed Automata.",
                    "Verification of Parameterized Systems by Dynamic Induction on Diagrams.",
                    "Formal Methods for Conformance Testing: Theory Can Be Practical.",
                    "Verifiying Safety Properties of a Power PC Microprocessor Using Symbolic Model Checking without BDDs.",
                    "Model Checking the IBM Gigahertz Processor: An Abstraction Algorithm for High-Performance Netlists.",
                    "Validation of Pipelined Processor Designs Using Esterel Tools: A Case Study.",
                    "Automated Verification of a Parametric Real-Time Program: The ABR Conformance Protocol.",
                    "Test Generation Derived from Model-Checking.",
                    "Latency Insensitive Protocols.",
                    "Handling Global Conditions in Parameterized System Verification.",
                    "Verification of Infinite-State Systems by Combining Abstraction and Reachability Analysis.",
                    "Experience with Predicate Abstraction.",
                    "Model Checking of Safety Properties.",
                    "A Complete Finite Prefix for Process Algebra.",
                    "The Mathematical Foundation fo Symbolic Trajectory Evaluation.",
                    "Assume-Guarantee Refinement Between Different Time Scales.",
                    "Efficient Decision Procedures for Model Checking of Linear Time Logic Properties.",
                    "Stutter-Invariant Languages, omega-Automata, and Temporal Logic.",
                    "Improved Automata Generation for Linear Temporal Logic.",
                    "On the Representation of Probabilities over Structured Domains.",
                    "Model Checking Partial State Spaces with 3-Valued Temporal Logics.",
                    "Elementary Microarchitecture Algebra.",
                    "Verifying Sequential Consistency on Shared-Memory Multiprocessor Systems.",
                    "Stepwise CTL Model Checking of State/Event Systems.",
                    "Optimizing Symbolic Model Checking for Constraint-Rich Models.",
                    "Efficient Timed Reachability Analysis Using Clock Difference Diagrams.",
                    "Mechanizing Proofs of Computation Equivalence.",
                    "Linking Theorem Proving and Model-Checking with Well-Founded Bisimulation.",
                    "Automatic Verification of Combinatorial and Pipelined FFT.",
                    "Efficient Analysis of Cyclic Definitions.",
                    "A Theory of Restrictions for Logics and Automata.",
                    "Model Checking Based on Sequential ATPG.",
                    "Automatic Verification of Abstract State Machines.",
                    "Abstract and Model Check While You Prove.",
                    "Deciding Equality Formulas by Small Domains Instantiations.",
                    "Exploiting Positive Equality in a Logic of Equality with Uninterpreted Functions.",
                    "A Toolbox for the Analysis of Discrete Event Dynamic Systems.",
                    "TIPPtool: Compositional Specification and Analysis of Markovian Performance Models.",
                    "Java Bytecode Verification by Model Checking.",
                    "NUSMV: A New Symbolic Model Verifier.",
                    "PIL/SETHEO: A Tool for the Automatic Analysis of Authentication Protocols."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "10th CAV 1998",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1998",
                "sub_name": "Computer Aided Verification, 10th International Conference, CAV '98, Vancouver, BC, Canada, June 28 - July 2, 1998, Proceedings.",
                "count": 54,
                "papers": [
                    "Synchronous Programming of Reactive Systems.",
                    "Ten Years of Partial Order Reduction.",
                    "An ACL2 Proof of Write Invalidate Cache Coherence.",
                    "Transforming the Theorem Prover into a Digital Design Tool: From Concept Car to Off-Road Vehicle.",
                    "A Role for Theorem Proving in Multi-Processor Design.",
                    "A Formal Method Experience at Secure Computing Corporation.",
                    "Formal Methods in an Industrial Environment.",
                    "On Checking Model Checkers.",
                    "Finite-State Analysis of Security Protocols.",
                    "Integrating Proof-Based and Model-Checking Techniques for the Formal Verification of Cryptographic Protocols.",
                    "Verifying Systems with Infinite but Regular State Spaces.",
                    "Formal Verification of Out-of-Order Execution Using Incremental Flushing.",
                    "Verification of an Implementation of Tomasulo's Algorithm by Compositional Model Checking.",
                    "Decomposing the Proof of Correctness of pipelined Microprocessors.",
                    "Processor Verification with Precise Exeptions and Speculative Execution.",
                    "Symmetry Reductions in Model Checking.",
                    "Structural Symmetry and Model Checking.",
                    "Using Magnatic Disk Instead of Main Memory in the Murphi Verifier.",
                    "On-the-Fly Model Checking of RCTL Formulas.",
                    "From Pre-historic to Post-modern Symbolic Model Checking.",
                    "Model Checking LTL Using Net Unforldings.",
                    "Model Checking for a First-Order Temporal Logic Using Multiway Decision Graphs.",
                    "On the Limitations of Ordered Representations of Functions.",
                    "BDD Based Procedures for a Theory of Equality with Uninterpreted Functions.",
                    "Computing Reachable Control States of Systems Modeled with Uninterpreted Functions and Infinite Memory.",
                    "Multiple Counters Automata, Safety Analysis and Presburger Arithmetic.",
                    "A Comparison of Presburger Engines for EFSM Reachability.",
                    "Generating Finite-State Abstractions of Reactive Systems Using Decision Procedures.",
                    "On-the-Fly Analysis of Systems with Unbounded, Lossy FIFO Channels.",
                    "Computing Abstractions of Infinite State Systems Compositionally and Automatically.",
                    "Normed Simulations.",
                    "An Experiment in Parallelizing an Application Using Formal Methods.",
                    "Efficient Symbolic Detection of Global Properties in Distributed Systems.",
                    "A Machine-Checked Proof of the Optimality of a Real-Time Scheduling Policy.",
                    "A General Approach to Partial Order Reductions in Symbolic Verification (Extended Abstract).",
                    "Correctness of the Concurrent Approach to Symbolic Verification of Interleaved Models.",
                    "Verification of Timed Systems Using POSETs.",
                    "Mechanising BAN Kerberos by the Inductive Method.",
                    "Protocol Verification in Nuprl.",
                    "You Assume, We Guarantee: Methodology and Case Studies.",
                    "Verification of Parameterized Bus Arbitration Protocol.",
                    "The 'Test Model-Checking' Approach to the Verification of Formal Memory Models of Multiprocessors.",
                    "Design Constraints in Symbolic Model Checking.",
                    "Verification of Floating-Point Adders.",
                    "XEVE, an ESTEREL Verification Environment.",
                    "InVeST: A Tool for the Verification of Invariants.",
                    "Verifying Mobile Processes in the HAL Environment.",
                    "MONA 1.x: New Techniques for WS1S and WS2S.",
                    "MOCHA: Modularity in Model Checking.",
                    "SCR*: A Toolset for Specifying and Analyzing Software Requirements.",
                    "A Toolset for Message Sequence Charts.",
                    "Real-Time Verification of Statemate Designs.",
                    "Optikron: A Tool Suite for Enhancing Model-Checking of Real-Time Systems.",
                    "Kronos: A Model-Checking Tool for Real-Time Systems."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "9th CAV 1997",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1997",
                "sub_name": "Computer Aided Verification, 9th International Conference, CAV '97, Haifa, Israel, June 22-25, 1997, Proceedings.",
                "count": 52,
                "papers": [
                    "Practical Challenges for Industrial Formal Verification Tools.",
                    "Formal Verification of Digital Systems, from ASICs to HW/SW Codesign - a Pragmatic Approach.",
                    "The Industrial Success of Verification Tools Based on Stålmarck's Method.",
                    "Formal Verification - Applications & Case Studies.",
                    "Automatic Abstraction Techniques for Propositional µ-calculus Model Checking.",
                    "A Compositional Rule for Hardware Design Refinement.",
                    "Module Checking Revisited.",
                    "Using Compositional Preorders in the Verification of Sliding Window Protocal.",
                    "An Efficient Decision Procedure for the Theory of Fixed-Sized Bit-Vectors.",
                    "Construction of Abstract State Graphs with PVS.",
                    "Verification of a Chemical Process Leak Test Procedure.",
                    "Automatic Datapath Extraction for Efficient Usage of HDD.",
                    "An n log n Algorithm for Online BDD Refinement.",
                    "Weak Bisimulation for Fully Probabilistic Processes.",
                    "Towards a Mechanization of Cryptographic Protocal Verification.",
                    "Efficient Model Checking Using Tabled Resolution.",
                    "Containing of Regular Languages in Non-Regular Timing Diagram Languages is Decidable.",
                    "An Improved Reachability Analysis Method for Strongly Linear Hybrid Systems (Extended Abstract).",
                    "Some Progress in the Symbolic Verification of Timed Automata.",
                    "STARI: A Case Study in Compositional and Hierarchical Timing Verification.",
                    "A Provably Correct Embedded Verifier for the Certification of Safety Critical Software.",
                    "Model Checking in a Microprocessor Design Project.",
                    "Some Thoughts on Statecharts, 13 Years Later.",
                    "On-the-Fly Model Checking Under Fairness That Exploits Symmetry.",
                    "Exploiting Symmetry When Verifying Transitor-Level Circuits by Symbolic Trajectory Evaluation.",
                    "Parallelizing the Murphi Verifier.",
                    "Efficient Detection of Vacuity in ACTL Formulaas.",
                    "Model Checking and Transitive-Closure Logic.",
                    "Boolean and 2-adic Numbers Based Techniques for Verifying Synchronous Design.",
                    "Programs with Quasi-Stable Channels are Effectively Recognizable (Extended Abstract).",
                    "Combining Constraint Solving and Symbolic Model Checking for a Class of a Systems with Non-linear Constraints.",
                    "Relaxed Visibility Enhances Partial Order Reduction.",
                    "Partial-Order Reduction in Symbolic State Space Exploration.",
                    "Deadlock Checking Using Net Unfoldings.",
                    "Trace Table Based Approach for Pipeline Microprocessor Verification.",
                    "On Combining Formal and Informal Verification.",
                    "Efficient Modeling of Memory Arrays in Symbolic Simulation.",
                    "Symbolic Model Checking of Infinite State Systems Using Presburger Arithmetic.",
                    "Parametrized Verification of Linear Networks Using Automata as Invariants.",
                    "Symbolic Model Checking with Rich ssertional Languages.",
                    "The Invariant Checker: Automated Deductive Verification of Reactive Systems.",
                    "The PEP Tool.",
                    "TermiLog: A System for Checking Termination of Queries to Logic Programs.",
                    "MOSEL: A Sound and Efficient Tool for M2L(Str).",
                    "The Verus Tool: A Quantitative Approach to the Formal Verification of Real-Time Systems.",
                    "UPPAAL: Status & Developments.",
                    "HYTECH: A Model Checker for Hybrid Systems.",
                    "SMC: A Symmetry Based Model Checker for Verification of Liveness Properties.",
                    "µcke - Efficient µ-Calculus Model Checking.",
                    "prod 3.2: An Advanced Tool for Efficient Reachability Analysis.",
                    "VeriSoft: A Tool for the Automatic Analysis of Concurrent Reactive Software.",
                    "RuleBase: Model Checking at IBM."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "8th CAV 1996",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1996",
                "sub_name": "Computer Aided Verification, 8th International Conference, CAV '96, New Brunswick, NJ, USA, July 31 - August 3, 1996, Proceedings.",
                "count": 51,
                "papers": [
                    "Symbolic Verification of Communication Protocols with Infinite State Spaces Using QDDs (Extended Abstract).",
                    "A Conjunctively Decomposed Boolean Representation for Symbolic Model Checking.",
                    "Symbolic Model Checking Using Algebraic Geometry.",
                    "A Partition Refinement Algorithm for the pi-Calculus (Extended Abstract).",
                    "Polynomial Time Algorithms for Testing Probabilistic Bisimulation and Simulation.",
                    "Pushdown Processes: Games and Model Checking.",
                    "Module Checking.",
                    "Automatic Verification of Parameterized Synchronous Systems (Extended Abstract).",
                    "HORNSAT, Model Checking, Verification and games (Extended Abstract).",
                    "Verifying the SRT Division Algorithm Using Theorem Proving Techniques.",
                    "Modular Verification of SRT Division.",
                    "Mechanically Verifying a Family of Multiplier Circuits.",
                    "Verifying Systems with Replicated Components in Murphi.",
                    "Verification of Arithmetic Circuits by Comparing Two Similar Circuits.",
                    "Automated Deduction and Formal Methods.",
                    "A Platform for Combining Deductive with Algorithmic Verification.",
                    "Verifying Invariants Using theorem Proving.",
                    "Deductive Model Checking.",
                    "Automated Verification by Induction with Associative-Commutative Operators.",
                    "Analysis of Timed Systems Based on Time-Abstracting Bisimulation.",
                    "Verification of an Audio Protocol with Bus Collision Using UPPAAL.",
                    "Selective Quantitative Analysis and Interval Model Checking: Verifying Different Facets of a System.",
                    "Verifying Continuous Time Markov Chains.",
                    "Verifying Safety Properties of Differential Equations.",
                    "Temporal Verification by Diagram Transformations.",
                    "Protocol Verification by Aggregation of Distributed Transactions.",
                    "Atomicity Refinement and Trace Reduction Theorems.",
                    "Powerful Techniques for the Automatic Generation of Invariants.",
                    "Saving Space by Fully Exploiting Invisible Transitions.",
                    "Using On-The-Fly Verification Techniques for the Generation of test Suites.",
                    "Automatic Translation of Natural Language System Specifications.",
                    "Verification of Fair Transisiton Systems.",
                    "The State of SPIN.",
                    "The Murphi Verification System.",
                    "The NCSU Concurrency Workbench.",
                    "The Concurrency Factory: A Development Environment for Concurrent Systems.",
                    "XVERSA: An Integrated Graphical and Textual Toolset for the Specification and Analysis of Resource-Bound Real-Time Systems.",
                    "EVP: Integration of FDTs for the Analysis and Verification of Communication Protocols.",
                    "PVS: Combining Specification, Proof Checking, and Model Checking.",
                    "STeP: Deductive-Algorithmic Verification of Reactive and Real-Time Systems.",
                    "Symbolic Model Checking.",
                    "VIS: A System for Verification and Synthesis.",
                    "MDG Tools for the Verification of RTL Designs.",
                    "CADP - A Protocol Validation and Verification Toolbox.",
                    "The FC2TOOLS Set.",
                    "The Real-Time Graphical Interval Logic Toolset.",
                    "The METAFrame'95 Environment.",
                    "Verification Support Environment.",
                    "Marella: A Tool for Simulation and Verification.",
                    "Verifying the Safety of a Practical Concurrent Garbage Collector.",
                    "Verification by Behaviour Abstraction - A Case Study of Service Interaction Detection in Intelligent Telephone Networks."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "7th CAV 1995",
        "info": "Liège, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1995",
                "sub_name": "Computer Aided Verification, 7th International Conference, Liège, Belgium, July, 3-5, 1995, Proceedings.",
                "count": 34,
                "papers": [
                    "Multipliers and Dividers: Insights on Arithmetic Circuits Verification (Extended Abstract).",
                    "Global rebuilding of OBDDs Avoiding Memory Requirement Maxima.",
                    "Generating BDD Models for Process Algebra Terms.",
                    "Hardware Verification using Monadic Second-Order Logic.",
                    "Verifying Safety Properties of a Class of Infinite-State Distributed Algorithms.",
                    "Model Checking for Infinite State Systems Using Data Abstraction, Assumption-Commitment Style reasoning and Theorem Proving.",
                    "CAVEAT: Technique and Tool for Computer Aided VErification And Transformation.",
                    "An Integration of Model Checking with Automated Proof Checking.",
                    "Automatic Datapath Abstraction In Hardware Systems.",
                    "Toupie = µ-Calculus + Constraints.",
                    "Safety Property Verification of ESTEREL Programs and Applications to Telecommunications Software.",
                    "Methods for Mu-calculus Model Checking: A Tutorial (Abstract).",
                    "Efficient Checking of Behavioural Relations and Modal Assertions using Fixed-Point Inversion.",
                    "It Usually Works: The Temporal Logic of Stochastic Systems.",
                    "Local Liveness for Compositional Modeling of Fair Reactive Systems.",
                    "Trace Theoretic Verification of Asynchronous Circuits Using Unfoldings.",
                    "From Duration Calculus To Linear Hybrid Automata.",
                    "Local Model Checking for Real-Time Systems (Extended Abstract).",
                    "Algorithmic Analysis of Nonlinear Hybrid Systems.",
                    "On Polynomial-Size Programs Winning Finite-State Games.",
                    "The Rabin Index and Chain Automata, with Applications to Automatas and Games.",
                    "An Automata-Theoretic Approach to Fair Realizability and Synthesis.",
                    "Supervisory Control of Finite State Machines.",
                    "Compositional and Inductive Semantic Definitions in Fixpoint, Equational, Constraint, Closure-condition, Rule-based and Game-Theoretic Form.",
                    "Utilizing Symmetry when Model Checking under Fairness Assumptions: An Automata-theoretic Approach.",
                    "Augmenting Branching Temporal Logics with Existential Quantification over Atomic Propositions.",
                    "Modelling Asynchrony with a Synchronous Model.",
                    "On the Model Checking Problem for Branching Time Logics and Basic Parallel Processes.",
                    "Using Formal Verification/Analysis Methods on the Critical Path in System Design: A Case Study.",
                    "Automated Analysis of an Audio Control Protocol.",
                    "Interactively Verifying a Simple Real-time Scheduler.",
                    "Verification of Real-Time Systems by Successive Over and Under Approximation.",
                    "Efficient Timing Analysis of a Class of Petri Nets.",
                    "Verifying omega-Regular Properties for a Subclass of Linear Hybrid Systems."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "6th CAV 1994",
        "info": "Stanford, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1994",
                "sub_name": "Computer Aided Verification, 6th International Conference, CAV '94, Stanford, California, USA, June 21-23, 1994, Proceedings.",
                "count": 38,
                "papers": [
                    "A Determinizable Class of Timed Automata.",
                    "Real-Time System Verification using P/T Nets.",
                    "Criteria for the Simple Path Property in Timed Automata.",
                    "Hierarchical Representations of Discrete Functions, with Application to Model Checking.",
                    "Symbolic Verification with Periodic Sets.",
                    "Automatic verification of Pipelined Microprocessor Control.",
                    "Using Abstractions for the Verification of Linear Hybrid Systems.",
                    "Decidability of Hybrid Systems with Rectangular Differential Inclusion.",
                    "Suspension Automata: A Decidable Class of Hybrid Automata.",
                    "Verification of Context-Free Timed Systems Using Linear Hybrid Observers.",
                    "On the Random Walk Method for Protocol Testing.",
                    "An Automata-Theoretic Approach to Branching-Time Model Checking (Extended Abstract).",
                    "Realizability and Synthesis of Reactive Modules.",
                    "Model Checking of macro Processes.",
                    "Methodology and System for Practical Formal Verification of Reactive Hardware.",
                    "Modeling and Verification of a Real Life Protocol Using Symbolic Model Checking.",
                    "Verification of a Distributed Cache Memory by Using Abstractions.",
                    "Beyond Model Checking.",
                    "Models Whose Checks Don't Explode.",
                    "On the Automatic Computation of Network Invariants.",
                    "Ground Temporal Logic: A Logic for Hardware Verification.",
                    "A Hybrid Model for Reasoning about Composed Hardware Systems.",
                    "Composing Symbolic Trajectory Evaluation Results.",
                    "The Completeness of a Hardware Inference System.",
                    "Efficient Model Checking by Automated Ordering of Transition Relation Partitions.",
                    "The Verifiacation Problem for Safe Replaceability.",
                    "Formula-Dependent Equivalence for Compositional CTL Model Checking.",
                    "An Improved Algorithm for the Evaluation of Fixpoint Expressions.",
                    "Incremental Model Checking in the Modal Mu-Calculus.",
                    "Performance Improvement of State Space Exploration by Regular & Diffrential Hashing Functions.",
                    "Combining Partial Order Reductions with On-the-fly Model-Checking.",
                    "Improving Language Containment Using Fairness Graphs.",
                    "A Parallel Algorithm for Relational Coarsest Partition Problems and Its Implementation.",
                    "Another Look at LTL Model Checking.",
                    "The Mobility Workbench - A Tool for the pi-Calculus.",
                    "Compositional Semantics of ESTEREL and Verification by Compositional Reductions.",
                    "Model Checking Using Adaptive State and Data Abstraction.",
                    "Automatic Verification of Timed Circuits."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "5th CAV 1993",
        "info": "Elounda, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1993",
                "sub_name": "Computer Aided Verification, 5th International Conference, CAV '93, Elounda, Greece, June 28 - July 1, 1993, Proceedings.",
                "count": 40,
                "papers": [
                    "Logic Synthesis and Design Verification.",
                    "Efficient Verification with BDDs using Implicitly Conjoined Invariants.",
                    "Parametric Circuit Representation Using Inductive Boolean Functions.",
                    "An Iterative Approach to Language Containment.",
                    "BDD-Based Debugging Of Design Using Language Containment and Fair CTL.",
                    "Reliable Hashing without Collosion Detection.",
                    "A Tool for Symbolic Program Verification and Abstration.",
                    "Symbolic Equivalence Checking.",
                    "A Decision Algorithm for Full Propositional Temporal Logic.",
                    "Reachability and Recurrence in Extended Finite State Machines: Modular Vector Addition Systems.",
                    "Automatic Generation of Network Invariants for the Verification of Iterative Sequential Systems.",
                    "A Graphical Interval Logic Toolset for Verifying Concurrent Systems.",
                    "Combining Model Checking and Theorem Proving to Verify Parallel Processes.",
                    "Verification of a Multiplier: 64 Bits and Beyond.",
                    "Protocol Design for an Automated Highway System (Abstract).",
                    "Computing Accumulated Delays in Real-time Systems.",
                    "Reachability Analysis of Planar Multi-limear Systems.",
                    "An Efficient Algorithm for Minimizing Real-time Transition Systems.",
                    "Verification of timing Properties of VHDL.",
                    "Alternating RQ Timed Automata.",
                    "Timed Modal Specification - Theory and Tools.",
                    "A Mechanically Verified Application for a Mechanically Verified Environment.",
                    "Verification of Real-Time Systems Using PVS.",
                    "The Formal Verification of an Algorithm for Interactive Consistency under a Hybrid Fault Model.",
                    "Computer-Assisted Simulation Proofs.",
                    "A Verifier and Timing Analyser for Simple Imperative Programs (Abstract).",
                    "Efficient Verification of Parallel Real-Time Systems.",
                    "Delay Analysis in Synchronous Programs.",
                    "Verifying Quantitative Real-Time Properties of Synchronous Programs.",
                    "A Modal Logic for Message passing Processes (Extended Abstract).",
                    "Functionality Decomposition by Compositional Correstness Preserving Transformation.",
                    "On Model-Checking for Fragments of µ-Calculus.",
                    "On-the-Fly Verification with Stubborn Sets.",
                    "All from One, One for All: on Model Checking Using Representatives.",
                    "Verifying Timed Behavior Automata with Input/Output Critical Races.",
                    "Refining Dependencies Improves Partial-Order Verification Methods (Extended Abstract).",
                    "Exploiting Symmetry In Temporal Logic Model Checking.",
                    "Symmetry and Model Checking.",
                    "Generation of Reduced Models for Checking Fragments of CTL.",
                    "A Structural Linearization Principle for Processes."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "4th CAV 1992",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1992",
                "sub_name": "Computer Aided Verification, Fourth International Workshop, CAV '92, Montreal, Canada, June 29 - July 1, 1992, Proceedings.",
                "count": 32,
                "papers": [
                    "Computer-Hindered Verification (Humans Can Do It Too).",
                    "Modular Abstractions for Verifying Real-Time Distributed Systems.",
                    "Layering Techniques for Development of Parallel Systems.",
                    "Efficient Local Correctness Checking.",
                    "Mechanical Verification of Concurrent Systems with TLA.",
                    "Using a Theorem Prover for Reasoning about Concurrent Algorithms.",
                    "Verifying a Logic Synthesis Tool in Nuprl: A Case Study in Software Verification.",
                    "Higher-Level Specification and Verification with BDDs.",
                    "Symbolic Bisimulation Minimisation.",
                    "Towards a Verification Technique for Large Synchronous Circuits.",
                    "Verifying Timed Behavior Automata with Nonbinary Delay Constraints.",
                    "Timing Verification by Successive Approximation.",
                    "A Verification Strategy for Timing-Constrained Systems.",
                    "Using Unfoldings to Avoid the State Explosion Problem in the Verification of Asynchronous Circuits.",
                    "State-Space Caching Revisited.",
                    "Verification in Process Algebra of the Distributed Control of Track Vehicles - A Case Study.",
                    "Design Verification of a Microprocessor Using Branching Time Regular Temporal Logic.",
                    "A Case Study in Safety-Critical Design.",
                    "Automatic Reduction in CTL Compositional Model Checking.",
                    "Compositional Model Checking for Linear-Time Temporal Logic.",
                    "Property Preserving Simulations.",
                    "Verification with Real-Time COSPAN.",
                    "Model-Checking for Real-Time Systems Specified in Lotos.",
                    "Decidability of Bisimulation Equivalences for Parallel Timer Processes.",
                    "A Proof Assistant for Symbolic Model-Checking.",
                    "Tableau Recycling.",
                    "Crocos: An Integrated Environment for Interactive Verification of SDL Specifications.",
                    "Verifying General Safety and Liveness Propterties with Integer Programming.",
                    "Generating Diagnostic Information for Behavioral Preorders.",
                    "A Verification Procedure via Invariant for Extended Communicating Finite-State Machines.",
                    "Efficient omega-Regular Language Containment.",
                    "Faster Model Checking for the Modal Mu-Calculus."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "3rd CAV 1991",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1991",
                "sub_name": "Computer Aided Verification, 3rd International Workshop, CAV '91, Aalborg, Denmark, July, 1-4, 1991, Proceedings.",
                "count": 44,
                "papers": [
                    "Taming Infinite State Spaces.",
                    "Silence is Golden: Branching Bisimilarity is Decidable for Context-Free Processes.",
                    "Computing Distinguishing Formulas for Branching Bisimulation.",
                    "Compositional Checking of Satisfaction.",
                    "An Action Based Framework for Verifying Logical and Behavioural Properties of Concurrent Systems.",
                    "A Linear-Time Model-Checking Algorithm for the Alternation-Free Modal Mu-Calculus.",
                    "Automatic Temporal Verification of Buffer Systems.",
                    "Mechanically Checked Proofs of Kernel Specification.",
                    "A Top Down Approach to the Formal Specification of SCI Cache Coherence.",
                    "Integer Programming in the Analysis of Concurrent Systems.",
                    "The Lotos Model of a Fault Protected System and its Verification Using a Petri Net Based Approach.",
                    "Error Diagnosis in Finite Communicating Systems.",
                    "Temporal Precondition Verification of Design Transformations.",
                    "PAM: A Process Algebra Manipulator.",
                    "The Concurrency Workbench with Priorities.",
                    "A Proof Assistant for PSF.",
                    "Avoiding State Exposion by Composition of Minimal Covering Graphs.",
                    "\"On the Fly\" Verification of Behavioural Equivalences and Preorders.",
                    "Bounded-memory Algorithms for Verification On-the-fly.",
                    "Generating BDDs for Symbolic Model Checking in CCS.",
                    "Vectorized Symbolic Model Checking of Computation Tree Logic for Sequential Machine Verification.",
                    "Functional Extension of Symbolic Model Checking.",
                    "An Automated Proof Technique for Finite-State Machine Equivalence.",
                    "From Data Structure to Process Structure.",
                    "Checking for Language Inclusion Using Simulation Preorders.",
                    "A Semantic Driven Method to Check the Finiteness of CCS Processes.",
                    "Using the HOL Prove Assistant for proving the Correctness of term Rewriting Rules reducing Terms of Sequential Behavior.",
                    "Mechanizing a Proof by Induction of Process Algebrs Specifications in Higher Order Logic.",
                    "A Two-Level Formal Verification Methodology using HOL and COSMOS.",
                    "Efficient Algorithms for Verification of Equivalences for Probabilistic Processes.",
                    "Partial-Order Model Checking: A Guide for the Perplexed.",
                    "Using Partial Orders for the Efficient Verification of Deadlock Freedom and Safety Properties.",
                    "Complexity Results for POMSET Languages.",
                    "Mechanically Verifying Safety and Liveness Properties of Delay Insensitive Circuits.",
                    "Automating Most Parts of Hardware Proofs in HOL.",
                    "An Overview and Synthesis on Timed Process Algebras.",
                    "Minimum and Maximum Delay Problems in Real-Time Systems.",
                    "Formal Verification of Speed-Dependent Asynchronous Cicuits Using Symbolic Model Checking of branching Time Regular Temporal Logic.",
                    "Verifying Properties of HMS Machine Specifications of Real-Time Systems.",
                    "A Linear Time Process Algebra.",
                    "Deciding Properties of Regular Real Time Processes.",
                    "An Algebra of Boolean Processes.",
                    "Comparing Generic State Machines.",
                    "An Automata Theoretic Approach to Temporal Logic."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "2nd CAV 1990",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cav/1990",
                "sub_name": "Computer Aided Verification, 2nd International Workshop, CAV '90, New Brunswick, NJ, USA, June 18-21, 1990, Proceedings.",
                "count": 38,
                "papers": [
                    "Temporal Logic Model Checking: Two Techniques for Avoiding the State Explosion Problem.",
                    "Automatic Verification of Extensions of Hardware Descriptions.",
                    "PAPETRI: Environment for the Analysis of Petri Nets.",
                    "Verifying Temporal Properties of Sequential Machines Without Building their State Diagrams.",
                    "Formal Verification of Digital Circuits Using Symbolic Ternary System Models.",
                    "Vectorized Model Checking for Computation Tree Logic.",
                    "Introduction to a Computational Theory and Implementation of Sequential Hardware Equivalence.",
                    "Auto/Autograph.",
                    "A Data Path Verifier for Register Transfer Level Using Temporal Logic Language Tokio.",
                    "The Use of Model Checking in ATPG for Sequential Circuits.",
                    "Compositional Design and Verification of Communication Protocols, Using Labelled Petri Nets.",
                    "Issues Arising in the Analysis of L.0.",
                    "Automated RTL Verification Based on Predicate Calculus.",
                    "On Using Protean To Verify ISO FTAM Protocol.",
                    "Quantitative Temporal Reasoning.",
                    "Using Partial-Order Semantics to Avoid the State Explosion Problem in Asynchronous Systems.",
                    "A Stubborn Attack On State Explosion.",
                    "Using Optimal Simulations to Reduce Reachability Graphs.",
                    "Using Partial Orders to Improve Automatic Verification Methods.",
                    "Compositional Minimization of Finite State Systems.",
                    "Minimal Model Generation.",
                    "A Context Dependent Equivalence Relation Between Kripke Structures.",
                    "The Modular Framework of Computer-Aided Verification.",
                    "Verifying Liveness Properties by Verifying Safety Properties.",
                    "Memory Efficient Algorithms for the Verification of Temporal Properties.",
                    "A Unified Approach to the Deadlock Detection Problem in Networks of Communicating Finite State Machines.",
                    "Branching Time Regular Temporal Logic for Model Checking with Linear Time Complexity.",
                    "The Algebraic Feedback Product of Automata.",
                    "Synthesizing Processes and Schedulers from Temporal Specifications.",
                    "Task-Driven Supervisory Control of Discrete Event Systems.",
                    "A Proof Lattice-Based Technique for Analyzing Liveness of Resource Controllers.",
                    "Verification of a Multiprocessor Cache Protocol Using Simulation Relations and Higher-Order Logic.",
                    "Computer Assistance for Program Refinement.",
                    "Program Verification by Symbolic Execution of Hyperfinite Ideal Machines.",
                    "Extension of the Karp and Miller Procedure to Lotos Specifications.",
                    "An Algebra for Delay-Insensitive Circuits.",
                    "Finiteness Conditions and Structural Construction of Automata for All Process Algebras.",
                    "On Automatically Explaining Bisimulation Inequivalence."
                ]
            },
            {
                "sub_name_abbr": "conf/dimacs/1990a",
                "sub_name": "Computer-Aided Verification, Proceedings of a DIMACS Workshop 1990, New Brunswick, New Jersey, USA, June 18-21, 1990.",
                "count": 38,
                "papers": [
                    "Preface.",
                    "Temporal Logic Model Checking: Two Techniques for Avoiding the State Explosion Problem.",
                    "Automatic Verification of Extensions of Hardware Descriptions.",
                    "Using Partial-Order Semantics to Avoid the State Explosion Problem in Asynchronous Systems.",
                    "A Stubborn Attack on State Explosion.",
                    "PAPETRI: Environment for the Analysis of PETRI Nets.",
                    "Compositional Minimization of Finite State Systems.",
                    "Verifying Temporal Properties of Sequential Machines without Building Their State Diagrams.",
                    "Minimal Model Generation.",
                    "Verifying Liveness Properties by Verifying Safety Properties.",
                    "Extension of the Karp and Miller Procedure to LOTOS Specifications.",
                    "Formal Verification of Digital Circuits Using Symbolic Ternary System Models.",
                    "An Algebra for Delay-Insensitive Circuits.",
                    "Synthesizing Processes and Schedulers from Temporal Specifications.",
                    "Verification of Multiprocessor Cache Protocol Using Simulation Relations and Higher-Order Logic.",
                    "Memory Efficient Algorithms for the Verification of Temporal Properties.",
                    "Vectorized Model Checking for Computation Tree Logic.",
                    "On Some Implementation of Optimal Simulations.",
                    "Finiteness Conditions and Structural Construction of Automata for All Process Algebras.",
                    "A Computation Theory and Implementation of Sequential Hardware Equivalence.",
                    "Using Partial Orders to Improve Automatic Verification Methods.",
                    "A Context Dependent Equivalence Relation between Kripke Structures.",
                    "The Modular Framework of Computer-Aided Verification.",
                    "Tool Support for the Refinement Calculus.",
                    "A Unified Approach to the Deadlock Detection Problem in Networks of Communicating Finite State Machines.",
                    "A Computer-Aided Verification Tool for Finite State Controller Systems.",
                    "Program Verification by Symbolic Execution of Hyperfinite Ideal Machines.",
                    "On Automatically Distinguishing Inequivalent Processes.",
                    "Auto/Autograph.",
                    "A Data Path Verifier for Register Transfer Level Using Temporal Logic Language Tokio.",
                    "Model Checking and Graph Theory in Sequential ATPG.",
                    "Compositional Design and Verification of Communication Protocols, Using Labelled PETRI Nets.",
                    "Liveness Analysis and the Automatic Generation of Concurrent Programs.",
                    "Branching Time Regular Temporal Logic for Model Checking with Linear Time Complexity.",
                    "Issues Arising in the Analysis of L.0.",
                    "Automated RTL Verification Based on Predicate Calculus.",
                    "The Algebraic Feedback Product of Automata. A State Machine Based Model of Concurrent Systems.",
                    "Results on the Interface between Formal Verification and ATPG."
                ]
            }
        ]
    }
]