[
    {
        "year": "2021",
        "name": "36th CCC 2021",
        "info": "Toronto, ON, Canada (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2021",
                "sub_name": "36th Computational Complexity Conference, CCC 2021, July 20-23, 2021, Toronto, Ontario, Canada (Virtual Conference).",
                "count": 42,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Rate Amplification and Query-Efficient Distance Amplification for Linear LCC and LDC.",
                    "An Improved Protocol for the Exactly-N Problem.",
                    "Proof Complexity of Natural Formulas via Communication Arguments.",
                    "A Lower Bound on Determinantal Complexity.",
                    "Optimal Tiling of the Euclidean Space Using Permutation-Symmetric Bodies.",
                    "On the Power and Limitations of Branch and Cut.",
                    "Separating ABPs and Some Structured Formulas in the Non-Commutative Setting.",
                    "The (Generalized) Orthogonality Dimension of (Generalized) Kneser Graphs: Bounds and Applications.",
                    "Shadows of Newton Polytopes.",
                    "Fractional Pseudorandom Generators from Any Fourier Level.",
                    "Deterministic Identity Testing Paradigms for Bounded Top-Fanin Depth-4 Circuits.",
                    "Robustly Self-Ordered Graphs: Constructions and Applications to Property Testing.",
                    "Barriers for Recent Methods in Geodesic Optimization.",
                    "Communication Complexity with Defective Randomness.",
                    "On the Cut Dimension of a Graph.",
                    "On p-Group Isomorphism: Search-To-Decision, Counting-To-Decision, and Nilpotency Class Reductions via Tensors.",
                    "Branching Programs with Bounded Repetitions and Flow Formulas.",
                    "A Majority Lemma for Randomised Query Complexity.",
                    "Hitting Sets and Reconstruction for Dense Orbits in VP_{e} and ΣΠΣ Circuits.",
                    "Variety Evasive Subspace Families.",
                    "A Lower Bound for Polynomial Calculus with Extension Rule.",
                    "Error Reduction for Weighted PRGs Against Read Once Branching Programs.",
                    "A Stress-Free Sum-Of-Squares Lower Bound for Coloring.",
                    "Junta Distance Approximation with Sub-Exponential Queries.",
                    "Arithmetic Circuit Complexity of Division and Truncation.",
                    "SOS Lower Bound for Exact Planted Clique.",
                    "A Direct Product Theorem for One-Way Quantum Communication.",
                    "Quantum Complexity of Minimum Cut.",
                    "On the Complexity of Evaluating Highest Weight Vectors.",
                    "On Query-To-Communication Lifting for Adversary Bounds.",
                    "Hardness of Constant-Round Communication Complexity.",
                    "Polynomial Time Algorithms in Invariant Theory for Torus Actions.",
                    "Pseudodistributions That Beat All Pseudorandom Generators (Extended Abstract).",
                    "GSF-Locality Is Not Sufficient For Proximity-Oblivious Testing.",
                    "Hardness of KT Characterizes Parallel Cryptography.",
                    "On the Pseudo-Deterministic Query Complexity of NP Search Problems.",
                    "A Simple Proof of a New Set Disjointness with Applications to Data Streams.",
                    "Toward Better Depth Lower Bounds: The XOR-KRW Conjecture.",
                    "Fourier Growth of Parity Decision Trees.",
                    "The Power of Negative Reasoning.",
                    "Matrix Rigidity Depends on the Target Field."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "35th CCC 2020",
        "info": "Saarbrücken, Germany (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2020",
                "sub_name": "35th Computational Complexity Conference, CCC 2020, July 28-31, 2020, Saarbrücken, Germany (Virtual Conference).",
                "count": 39,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Near-Optimal Erasure List-Decodable Codes.",
                    "A Quadratic Lower Bound for Algebraic Branching Programs.",
                    "Super Strong ETH Is True for PPSZ with Small Resolution Width.",
                    "Approximability of the Eight-Vertex Model.",
                    "Lower Bounds for Matrix Factorization.",
                    "Log-Seed Pseudorandom Generators via Iterated Restrictions.",
                    "Quantum Lower Bounds for Approximate Counting via Laurent Polynomials.",
                    "A Generalized Sylvester-Gallai Type Theorem for Quadratic Polynomials.",
                    "Simultaneous Max-Cut Is Harder to Approximate Than Max-Cut.",
                    "Hitting Sets Give Two-Sided Derandomization of Small Space.",
                    "Palette-Alternating Tree Codes.",
                    "Search Problems in Algebraic Complexity, GCT, and Hardness of Generators for Invariant Rings.",
                    "Statistical Physics Approaches to Unique Games.",
                    "Schur Polynomials Do Not Have Small Formulas If the Determinant Doesn't.",
                    "Algorithms and Lower Bounds for De Morgan Formulas of Low-Communication Leaf Gates.",
                    "On the Quantum Complexity of Closest Pair and Related Problems.",
                    "Limits of Preprocessing.",
                    "Sign Rank vs Discrepancy.",
                    "On the Complexity of Modulo-q Arguments and the Chevalley - Warning Theorem.",
                    "Non-Disjoint Promise Problems from Meta-Computational View of Pseudorandom Generator Constructions.",
                    "Algebraic Branching Programs, Border Complexity, and Tangent Spaces.",
                    "NP-Hardness of Circuit Minimization for Multi-Output Functions.",
                    "A Super-Quadratic Lower Bound for Depth Four Arithmetic Circuits.",
                    "Multiparty Karchmer - Wigderson Games and Threshold Circuits.",
                    "Optimal Error Pseudodistributions for Read-Once Branching Programs.",
                    "Circuit Lower Bounds from NP-Hardness of MCSP Under Turing Reductions.",
                    "Finding Small Satisfying Assignments Faster Than Brute Force: A Fine-Grained Perspective into Boolean Constraint Satisfaction.",
                    "Exponential Resolution Lower Bounds for Weak Pigeonhole Principle and Perfect Matching Formulas over Sparse Graphs.",
                    "Groups with ALOGTIME-Hard Word Problems and PSPACE-Complete Circuit Value Problems.",
                    "Optimal Lower Bounds for Matching and Vertex Cover in Dynamic Graph Streams.",
                    "Connecting Perebor Conjectures: Towards a Search to Decision Reduction for Minimizing Formulas.",
                    "Quantum Query-To-Communication Simulation Needs a Logarithmic Overhead.",
                    "Factorization of Polynomials Given By Arithmetic Branching Programs.",
                    "On the Complexity of Branching Proofs.",
                    "Geometric Rank of Tensors and Subrank of Matrix Multiplication.",
                    "Hardness of Bounded Distance Decoding on Lattices in ℓp Norms.",
                    "Algebraic Hardness Versus Randomness in Low Characteristic.",
                    "Sum of Squares Bounds for the Ordering Principle."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "34th CCC 2019",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2019",
                "sub_name": "34th Computational Complexity Conference, CCC 2019, July 18-20, 2019, New Brunswick, NJ, USA.",
                "count": 33,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Criticality of Regular Formulas.",
                    "Almost Optimal Distribution-Free Junta Testing.",
                    "UG-Hardness to NP-Hardness by Losing Half.",
                    "Simple and Efficient Pseudorandom Generators from Gaussian Processes.",
                    "From DNF Compression to Sunflower Theorems via Regularity.",
                    "Resolution and the Binary Encoding of Combinatorial Principles.",
                    "Fourier Bounds and Pseudorandom Generators for Product Tests.",
                    "Sherali - Adams Strikes Back.",
                    "Typically-Correct Derandomization for Small Time and Space.",
                    "Optimal Short-Circuit Resilient Formulas.",
                    "A Time-Distance Trade-Off for GDD with Preprocessing - Instantiating the DLW Heuristic.",
                    "Limits on the Universal Method for Matrix Multiplication.",
                    "Optimality of Linear Sketching Under Modular Updates.",
                    "Equality Alone Does not Simulate Randomness.",
                    "Counting Basic-Irreducible Factors Mod p^k in Deterministic Poly-Time and p-Adic Applications.",
                    "Near-Optimal Pseudorandom Generators for Constant-Depth Read-Once Formulas.",
                    "Fourier and Circulant Matrices Are Not Rigid.",
                    "Nullstellensatz Size-Degree Trade-offs from Reversible Pebbling.",
                    "Stronger Connections Between Circuit Analysis and Circuit Lower Bounds, via PCPs of Proximity.",
                    "Universality of EPR Pairs in Entanglement-Assisted Communication Complexity, and the Communication Cost of State Conversion.",
                    "Average-Case Quantum Advantage with Shallow Circuits.",
                    "Time-Space Lower Bounds for Two-Pass Learning.",
                    "Parity Helps to Compute Majority.",
                    "Size-Degree Trade-Offs for Sums-of-Squares and Positivstellensatz Proofs.",
                    "Complexity Lower Bounds for Computing the Approximately-Commuting Operator Value of Non-Local Games to High Precision.",
                    "Barriers for Fast Matrix Multiplication from Irreversibility.",
                    "Hardness Magnification near State-Of-The-Art Lower Bounds.",
                    "Non-Malleable Extractors and Non-Malleable Codes: Partially Optimal Constructions.",
                    "Optimal Separation and Strong Direct Sum for Randomized Query Complexity.",
                    "Relations and Equivalences Between Circuit Lower Bounds and Karp-Lipton Theorems.",
                    "A Fine-Grained Analogue of Schaefer's Theorem in P: Dichotomy of Exists^k-Forall-Quantified First-Order Graph Properties.",
                    "Imperfect Gaps in Gap-ETH and PCPs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "33rd CCC 2018",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2018",
                "sub_name": "33rd Computational Complexity Conference, CCC 2018, June 22-24, 2018, San Diego, CA, USA.",
                "count": 29,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Pseudorandom Generators from Polarizing Random Walks.",
                    "A PRG for Boolean PTF of Degree 2 with Seed Length Subpolynomial in epsilon and Logarithmic in n.",
                    "A New Approach for Constructing Low-Error, Two-Source Extractors.",
                    "Lossless Dimension Expanders via Linearized Polynomials and Subspace Designs.",
                    "NP-hardness of Minimum Circuit Size Problem for OR-AND-MOD Circuits.",
                    "Limits on Representing Boolean Functions by Linear Combinations of Simple Functions: Thresholds, ReLUs, and Low-Degree Polynomials.",
                    "The Power of Natural Properties as Oracles.",
                    "Linear Sketching over F_2.",
                    "Communication Complexity with Small Advantage.",
                    "Algebraic Dependencies and PSPACE Algorithms in Approximative Complexity.",
                    "Unbalancing Sets and an Almost Quadratic Lower Bound for Syntactically Multilinear Arithmetic Circuits.",
                    "Hardness Amplification for Non-Commutative Arithmetic Circuits.",
                    "Hardness vs Randomness for Bounded Depth Arithmetic Circuits.",
                    "On The Hardness of Approximate and Exact (Bichromatic) Maximum Inner Product.",
                    "Hardness of Function Composition for Semantic Read once Branching Programs.",
                    "Reordering Rule Makes OBDD Proof Systems Stronger.",
                    "Testing Linearity against Non-Signaling Strategies.",
                    "Earthmover Resilience and Testing in Ordered Structures.",
                    "New Hardness Results for the Permanent Using Linear Optics.",
                    "Two-Player Entangled Games are NP-Hard.",
                    "Complexity Classification of Conjugated Clifford Circuits.",
                    "Efficient Batch Verification for UP.",
                    "A Tight Lower Bound for Entropy Flattening.",
                    "Worst-Case to Average Case Reductions for the Distance to a Code.",
                    "On the Complexity of the Cayley Semigroup Membership Problem.",
                    "Small Normalized Boolean Circuits for Semi-disjoint Bilinear Forms Require Logarithmic Conjunction-depth.",
                    "Lower Bounds on Non-Adaptive Data Structures Maintaining Sets of Numbers, from Sunflowers.",
                    "Dimension Reduction for Polynomials over Gaussian Space and Applications."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "32nd CCC 2017",
        "info": "Riga, Latvia",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2017",
                "sub_name": "32nd Computational Complexity Conference, CCC 2017, July 6-9, 2017, Riga, Latvia.",
                "count": 34,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Awards, Conference Organization, External Reviewers.",
                    "Random Resolution Refutations.",
                    "Graph Colouring is Hard for Algorithms Based on Hilbert's Nullstellensatz and Gröbner Bases.",
                    "Representations of Monotone Boolean Functions by Linear Programs.",
                    "A Note on Amortized Branching Program Complexity.",
                    "Derandomizing Isolation in Space-Bounded Settings.",
                    "The Computational Complexity of Integer Programming with Alternations.",
                    "On the Average-Case Complexity of MCSP and Its Variants.",
                    "Easiness Amplification and Uniform Circuit Lower Bounds.",
                    "PPSZ for General k-SAT - Making Hertli's Analysis Simpler and 3-SAT Faster.",
                    "Noise Stability Is Computable and Approximately Low-Dimensional.",
                    "From Weak to Strong LP Gaps for All CSPs.",
                    "Query-to-Communication Lifting for P^NP.",
                    "Improved Bounds for Quantified Derandomization of Constant-Depth Circuits and Polynomials.",
                    "Bounded Independence Plus Noise Fools Products.",
                    "Tight Bounds on the Fourier Spectrum of AC0.",
                    "Trading Information Complexity for Error.",
                    "Stochasticity in Algorithmic Statistics for Polynomial Time.",
                    "Conspiracies Between Learning Algorithms, Circuit Lower Bounds, and Pseudorandomness.",
                    "A Quadratic Lower Bound for Homogeneous Algebraic Branching Programs.",
                    "On Algebraic Branching Programs of Small Width.",
                    "Reconstruction of Full Rank Algebraic Branching Programs.",
                    "Complexity-Theoretic Foundations of Quantum Supremacy Experiments.",
                    "Augmented Index and Quantum Streaming Algorithms for DYCK(2).",
                    "Separating Quantum Communication and Approximate Rank.",
                    "Optimal Quantum Sample Complexity of Learning Algorithms.",
                    "Settling the Query Complexity of Non-Adaptive Junta Testing.",
                    "An Adaptivity Hierarchy Theorem for Property Testing.",
                    "Distribution Testing Lower Bounds via Reductions from Communication Complexity.",
                    "Exponentially Small Soundness for the Direct Product Z-Test.",
                    "On the Polynomial Parity Argument Complexity of the Combinatorial Nullstellensatz.",
                    "An Exponential Lower Bound for Homogeneous Depth-5 Circuits over Finite Fields.",
                    "Complete Derandomization of Identity Testing and Reconstruction of Read-Once Formulas.",
                    "Greedy Strikes Again: A Deterministic PTAS for Commutative Rank of Matrix Spaces."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "31st CCC 2016",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2016",
                "sub_name": "31st Conference on Computational Complexity, CCC 2016, May 29 to June 1, 2016, Tokyo, Japan.",
                "count": 36,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Awards, Conference Organization, External Reviewers.",
                    "Average-Case Lower Bounds and Satisfiability Algorithms for Small Threshold Circuits.",
                    "Strong ETH Breaks With Merlin and Arthur: Short Non-Interactive Proofs of Batch Evaluation.",
                    "Toward the KRW Composition Conjecture: Cubic Formula Lower Bounds via Communication Complexity.",
                    "Nearly Optimal Separations Between Communication (or Query) Complexity and Partitions.",
                    "A Composition Theorem for Conical Juntas.",
                    "Tight Bounds for Communication-Assisted Agreement Distillation.",
                    "New Extractors for Interleaved Sources.",
                    "Non-Malleable Extractors - New Tools and Improved Constructions.",
                    "Pseudorandomness When the Odds are Against You.",
                    "Learning Algorithms from Natural Proofs.",
                    "Decoding Reed-Muller Codes Over Product Sets.",
                    "Lower Bounds for Constant Query Affine-Invariant LCCs and LTCs.",
                    "Degree and Sensitivity: Tails of Two Distributions.",
                    "New Hardness Results for Graph and Hypergraph Colorings.",
                    "Invariance Principle on the Slice.",
                    "Harmonicity and Invariance on Slices of the Boolean Cube.",
                    "On the Sum-of-Squares Degree of Symmetric Quadratic Functions.",
                    "Limits of Minimum Circuit Size Problem as Oracle.",
                    "New Non-Uniform Lower Bounds for Uniform Classes.",
                    "New Characterizations in Turnstile Streams with Applications.",
                    "Evolution and Computation (Invited Talk).",
                    "Tight SoS-Degree Bounds for Approximate Nash Equilibria.",
                    "Understanding PPA-Completeness.",
                    "Polynomial Bounds for Decoupling, with Applications.",
                    "Polynomials, Quantum Query Complexity, and Grothendieck's Inequality.",
                    "Sculpting Quantum Speedups.",
                    "A Linear Time Algorithm for Quantum 2-SAT.",
                    "Complexity Classification of Two-Qubit Commuting Hamiltonians.",
                    "Identity Testing for Constant-Width, and Commutative, Read-Once Oblivious ABPs.",
                    "Identity Testing and Lower Bounds for Read-k Oblivious Algebraic Branching Programs.",
                    "Reconstruction of Real Depth-3 Circuits with Top Fan-In 2.",
                    "Proof Complexity Lower Bounds from Algebraic Circuit Complexity.",
                    "Functional Lower Bounds for Arithmetic Circuits and Connections to Boolean Circuit Complexity.",
                    "Arithmetic Circuits with Locally Low Algebraic Rank.",
                    "Sums of Products of Polynomials in Few Variables: Lower Bounds and Polynomial Identity Testing."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "30th CCC 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2015",
                "sub_name": "30th Conference on Computational Complexity, CCC 2015, June 17-19, 2015, Portland, Oregon, USA.",
                "count": 31,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Strong Locally Testable Codes with Relaxed Local Decoders.",
                    "An Entropy Sumset Inequality and Polynomially Fast Convergence to Shannon Capacity Over All Alphabets.",
                    "The List-Decoding Size of Fourier-Sparse Boolean Functions.",
                    "Nonclassical Polynomials as a Barrier to Polynomial Lower Bounds.",
                    "Simplified Lower Bounds on the Multiparty Communication Complexity of Disjointness.",
                    "How to Compress Asymmetric Communication.",
                    "Majority is Incompressible by AC^0[p] Circuits.",
                    "Lower Bounds for Depth Three Arithmetic Circuits with Small Bottom Fanin.",
                    "A Depth-Five Lower Bound for Iterated Matrix Multiplication.",
                    "Factors of Low Individual Degree Polynomials.",
                    "Verifiable Stream Computation and Arthur-Merlin Communication.",
                    "Identifying an Honest EXP^NP Oracle Among Many.",
                    "Adaptivity Helps for Testing Juntas.",
                    "A Characterization of Hard-to-cover CSPs.",
                    "Subexponential Size Hitting Sets for Bounded Depth Multilinear Formulas.",
                    "Deterministic Identity Testing for Sum of Read-once Oblivious Arithmetic Branching Programs.",
                    "Kolmogorov Width of Discrete Linear Spaces: an Approach to Matrix Rigidity.",
                    "On the (Non) NP-Hardness of Computing Circuit Complexity.",
                    "Circuits with Medium Fan-In.",
                    "Correlation Bounds Against Monotone NC^1.",
                    "Non-Commutative Formulas and Frege Lower Bounds: a New Characterization of Propositional Proofs.",
                    "The Space Complexity of Cutting Planes Refutations.",
                    "Tight Size-Degree Bounds for Sums-of-Squares Proofs.",
                    "A Generalized Method for Proving Polynomial Calculus Degree Lower Bounds.",
                    "Generalized Quantum Arthur-Merlin Games.",
                    "Parallel Repetition for Entangled k-player Games via Fast Quantum Search.",
                    "Upper Bounds on Quantum Query Complexity Inspired by the Elitzur-Vaidman Bomb Tester.",
                    "A Polylogarithmic PRG for Degree 2 Threshold Functions in the Gaussian Setting.",
                    "Incompressible Functions, Relative-Error Extractors, and the Power of Nondeterministic Reductions (Extended Abstract).",
                    "On Randomness Extraction in AC0."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "29th CCC 2014",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2014",
                "sub_name": "IEEE 29th Conference on Computational Complexity, CCC 2014, Vancouver, BC, Canada, June 11-13, 2014.",
                "count": 31,
                "papers": [
                    "Goldreich's PRG: Evidence for Near-Optimal Polynomial Stretch.",
                    "On the Power of Symmetric LP and SDP Relaxations.",
                    "Quantum Algorithms for Learning Symmetric Juntas via Adversary Bound.",
                    "On Physical Problems that are Slightly More Difficult than QMA.",
                    "AM with Multiple Merlins.",
                    "Counting List Matrix Partitions of Graphs.",
                    "Counting the Number of Perfect Matchings in K5-Free Graphs.",
                    "Hardness of Finding Independent Sets in 2-Colorable Hypergraphs and of Satisfiable CSPs.",
                    "Locally Dense Codes.",
                    "On the Closest Vector Problem with a Distance Guarantee.",
                    "Algorithms for Group Isomorphism via Group Extensions and Cohomology.",
                    "Low Influence Functions over Slices of the Boolean Hypercube Depend on Few Coordinates.",
                    "On the Sum of L1 Influences.",
                    "A Composition Theorem for Parity Kill Number.",
                    "Recent Progress on Lower Bounds for Arithmetic Circuits.",
                    "Hitting Sets for Low-Degree Polynomials with Optimal Density.",
                    "Equivalence of Polynomial Identity Testing and Deterministic Multivariate Polynomial Factorization.",
                    "Noncommutative Determinant is Hard: A Simple Proof Using an Extension of Barrington's Theorem.",
                    "Direct Product Testing.",
                    "A Parallel Repetition Theorem for Entangled Projection Games.",
                    "A Parallel Repetition Theorem for Entangled Two-Player One-Round Games under Product Distributions.",
                    "A Pseudorandom Generator for Polynomial Threshold Functions of Gaussian with Subpolynomial Seed Length.",
                    "Deterministic Approximate Counting for Juntas of Degree-2 Polynomial Threshold Functions.",
                    "Linear List-Approximation for Short Programs (or the Power of a Few Random Bits).",
                    "Algorithms for Circuits and Circuits for Algorithms.",
                    "Mining Circuit Lower Bound Proofs for Meta-algorithms.",
                    "Unifying Known Lower Bounds via Geometric Complexity Theory.",
                    "Narrow Proofs May Be Maximally Long.",
                    "Overlays and Limited Memory Communication.",
                    "Lower Bounds for Testing Properties of Functions over Hypergrid Domains.",
                    "Fourier Concentration from Shrinkage."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "28th CCC 2013",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2013",
                "sub_name": "Proceedings of the 28th Conference on Computational Complexity, CCC 2013, K.lo Alto, California, USA, 5-7 June, 2013.",
                "count": 29,
                "papers": [
                    "Random Arithmetic Formulas Can Be Reconstructed Efficiently.",
                    "Formulas are Exponentially Stronger than Monotone Circuits in Non-commutative Setting.",
                    "On Medium-Uniformity and Circuit Lower Bounds.",
                    "Towards a Reverse Newman's Theorem in Interactive Information Complexity.",
                    "Shared Randomness and Quantum Communication in the Multi-party Model.",
                    "On the Power of Non-adaptive Learning Graphs.",
                    "The Correct Exponent for the Gotsman-Linial Conjecture.",
                    "Approaching the Chasm at Depth Four.",
                    "Approximating Boolean Functions with Depth-2 Circuits.",
                    "Constructing Hard Functions Using Learning Algorithms.",
                    "Short Lists with Short Programs in Short Time.",
                    "Lower Bounds for DNF-refutations of a Relativized Weak Pigeonhole Principle.",
                    "LS+ Lower Bounds from Pairwise Independence.",
                    "Just a Pebble Game.",
                    "Quantum XOR Games.",
                    "Two-Message Quantum Interactive Proofs and the Quantum Separability Problem.",
                    "Collapse of the Hierarchy of Constant-Depth Exact Quantum Circuits.",
                    "How Low Can Approximate Degree and Quantum Query Complexity Be for Total Boolean Functions?",
                    "Composition Limits and Separating Examples for Some Boolean Function Complexity Measures.",
                    "On Rigid Matrices and U-polynomials.",
                    "Covering CSPs.",
                    "Optimal Inapproximability for Scheduling Problems via Structural Hardness for Hypergraph Vertex Cover.",
                    "On the Lattice Smoothing Parameter Problem.",
                    "A Derandomized Switching Lemma and an Improved Derandomization of AC0.",
                    "The Distinguishability of Product Distributions by Read-Once Branching Programs.",
                    "Strong LTCs with Inverse Polylogarithmic Rate and Soundness.",
                    "On the Parameterized and Approximation Hardness of Metric Dimension.",
                    "An O(n½+∑)-Space and Polynomial-Time Algorithm for Directed Planar Reachability.",
                    "Superlinear Lower Bounds for Multipass Graph Processing."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "27th CCC 2012",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2012",
                "sub_name": "Proceedings of the 27th Conference on Computational Complexity, CCC 2012, Porto, Portugal, June 26-29, 2012.",
                "count": 36,
                "papers": [
                    "Amplifying Circuit Lower Bounds against Polynomial Time with Applications.",
                    "Is Valiant-Vazirani's Isolation Probability Improvable?",
                    "Parallel Approximation of Min-max Problems with Applications to Classical and Quantum Zero-Sum Games.",
                    "The Complexity of the Separable Hamiltonian Problem.",
                    "Quantum Money with Classical Verification.",
                    "On the Usefulness of Predicates.",
                    "Reductions between Expansion Problems.",
                    "On Problems as Hard as CNF-SAT.",
                    "Testing List H-homomorphisms.",
                    "A Dichotomy for Real Weighted Holant Problems.",
                    "A Satisfiability Algorithm and Average-Case Hardness for Formulas over the Full Binary Basis.",
                    "Approximating AC^0 by Small Height Decision Trees and a Deterministic Algorithm for #AC^0SAT.",
                    "DNF Sparsification and a Faster Deterministic Counting Algorithm.",
                    "Communication Complexity and Information Complexity: Foundations and New Directions.",
                    "Gaussian Noise Sensitivity and Fourier Tails.",
                    "Junto-Symmetric Functions, Hypergraph Isomorphism and Crunching.",
                    "Complexity Lower Bounds through Balanced Graph Properties.",
                    "Limitations of Lower-Bound Methods for the Wire Complexity of Boolean Operators.",
                    "Limits on Alternation-Trading Proofs for Time-Space Lower Bounds.",
                    "The Hardness of Being Private.",
                    "Matrix Isomorphism of Matrix Lie Algebras.",
                    "On Sunflowers and Matrix Multiplication.",
                    "Algebras of Minimal Multiplicative Complexity.",
                    "Prospects for Geometric Complexity Theory.",
                    "A Strong Direct Product Theorem for Quantum Query Complexity.",
                    "A Strong Parallel Repetition Theorem for Projection Games on Expanders.",
                    "Share Conversion and Private Information Retrieval.",
                    "Nondeterministic Circuit Lower Bounds from Mildly De-randomizing Arthur-Merlin Games.",
                    "Hitting Set Generators for Sparse Polynomials over Any Finite Fields.",
                    "Pseudorandom Generators for Read-Once ACC^0.",
                    "Non-malleable Extractors with Short Seeds and Applications to Privacy Amplification.",
                    "Better Condensers and New Extractors from Parvaresh-Vardy Codes.",
                    "List Decoding Barnes-Wall Lattices.",
                    "Space-Efficient Algorithms for Reachability in Surface-Embedded Graphs.",
                    "Space Complexity in Polynomial Calculus.",
                    "Combinatorial PCPs with Short Proofs."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "26th CCC 2011",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2011",
                "sub_name": "Proceedings of the 26th Annual IEEE Conference on Computational Complexity, CCC 2011, San Jose, California, USA, June 8-10, 2011.",
                "count": 30,
                "papers": [
                    "Improved Direct Product Theorems for Randomized Query Complexity.",
                    "Making Branching Programs Oblivious Requires Superlogarithmic Overhead.",
                    "Hardness of Max-2Lin and Max-3Lin over Integers, Reals, and Large Cyclic Groups.",
                    "Lower Bounds on Query Complexity for Testing Bounded-Degree CSPs.",
                    "Non-negatively Weighted #CSP: An Effective Complexity Dichotomy.",
                    "Symmetric LDPC Codes are not Necessarily Locally Testable.",
                    "Towards Lower Bounds on Locally Testable Codes via Density Arguments.",
                    "Linear-Algebraic List Decoding of Folded Reed-Solomon Codes.",
                    "Noisy Interpolation of Sparse Polynomials, and Applications.",
                    "Paris-Harrington Tautologies.",
                    "Relativized Separations of Worst-Case and Average-Case Complexities for NP.",
                    "Non-uniform ACC Circuit Lower Bounds.",
                    "Improved Constructions of Three Source Extractors.",
                    "A New Approach to Affine Extractors and Dispersers.",
                    "Symmetry of Information and Bounds on Nonuniform Randomness Extraction via Kolmogorov Extractors.",
                    "Near-Optimal and Explicit Bell Inequality Violations.",
                    "Symmetry-Assisted Adversaries for Quantum State Generation.",
                    "Approximation Algorithms for QMA-Complete Problems.",
                    "On Arthur Merlin Games in Communication Complexity.",
                    "On the Minimal Fourier Degree of Symmetric Boolean Functions.",
                    "Property Testing Lower Bounds via Communication Complexity.",
                    "Pseudorandomness for Permutation and Regular Branching Programs.",
                    "Pseudorandom Generators for Combinatorial Checkerboards.",
                    "Bounded-Depth Circuits Cannot Sample Good Codes.",
                    "k-Independent Gaussians Fool Polynomial Threshold Functions.",
                    "Explicit Dimension Reduction and Its Applications.",
                    "Derandomizing Polynomial Identity Testing for Multilinear Constant-Read Formulae.",
                    "Tensor Rank: Some Lower and Upper Bounds.",
                    "On the Sum of Square Roots of Polynomials and Related Problems.",
                    "Linear Systems over Finite Abelian Groups."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "25th CCC 2010",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2010",
                "sub_name": "Proceedings of the 25th Annual IEEE Conference on Computational Complexity, CCC 2010, Cambridge, Massachusetts, USA, June 9-12, 2010.",
                "count": 28,
                "papers": [
                    "Parallel Repetition of Two Prover Games (Invited Survey).",
                    "No Strong Parallel Repetition with Entangled and Non-signaling Provers.",
                    "Derandomized Parallel Repetition of Structured PCPs.",
                    "Derandomized Parallel Repetition Theorems for Free Games.",
                    "Derandomizing Arthur-Merlin Games and Approximate Counting Implies Exponential-Size Lower Bounds.",
                    "Simple Affine Extractors Using Dimension Expansion.",
                    "Derandomizing from Random Strings.",
                    "On the Power of Randomized Reductions and the Checkability of SAT.",
                    "A New Sampling Protocol and Applications to Basing Cryptographic Primitives on the Hardness of NP.",
                    "The Program-Enumeration Bottleneck in Average-Case Complexity Theory.",
                    "On the Unique Games Conjecture (Invited Survey).",
                    "Spectral Algorithms for Unique Games.",
                    "A Log-Space Algorithm for Reachability in Planar Acyclic Digraphs with Few Sources.",
                    "On the Matching Problem for Special Graph Classes.",
                    "On the Relative Strength of Pebbling and Resolution.",
                    "Trade-Off Lower Bounds for Stack Machines.",
                    "Symmetry Coincides with Nondeterminism for Time-Bounded Auxiliary Pushdown Automata.",
                    "Completely Inapproximable Monotone and Antimonotone Parameterized Problems.",
                    "The Learning with Errors Problem (Invited Survey).",
                    "The Gaussian Surface Area and Noise Sensitivity of Degree-d Polynomial Threshold Functions.",
                    "A Regularity Lemma, and Low-Weight Approximators, for Low-Degree Polynomial Threshold Functions.",
                    "Fooling Functions of Halfspaces under Product Distributions.",
                    "Lower Bounds for Testing Function Isomorphism.",
                    "The Partition Bound for Classical Communication Complexity and Query Complexity.",
                    "Communication Complexity with Synchronized Clocks.",
                    "Exact Threshold Circuits.",
                    "Relationless Completeness and Separations.",
                    "On Matrix Rigidity and Locally Self-Correctable Codes."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "24th CCC 2009",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2009",
                "sub_name": "Proceedings of the 24th Annual IEEE Conference on Computational Complexity, CCC 2009, Paris, France, 15-18 July 2009.",
                "count": 37,
                "papers": [
                    "Poly-logarithmic Independence Fools AC0 Circuits.",
                    "k-Subgraph Isomorphism on AC0 Circuits.",
                    "Fixed-Polynomial Size Circuit Bounds.",
                    "A New Characterization of ACC0 and Probabilistic CC0.",
                    "A Superpolynomial Lower Bound on the Size of Uniform Non-constant-depth Threshold Circuits for the Permanent.",
                    "The Proof Complexity of Polynomial Identities.",
                    "Locally Testable Codes Require Redundant Testers.",
                    "Every Permutation CSP of arity 3 is Approximation Resistant.",
                    "Inapproximability of Vertex Cover and Independent Set in Bounded Degree Graphs.",
                    "Are PCPs Inherent in Efficient Arguments?",
                    "Extractors for Low-Weight Affine Sources.",
                    "Extractors for Varieties.",
                    "Weak Derandomization of Weak Algorithms: Explicit Versions of Yao's Lemma.",
                    "Regularity, Boosting, and Efficiently Simulating Every High-Entropy Distribution.",
                    "An Almost Optimal Rank Bound for Depth-3 Identities.",
                    "Lipschitz Continuous Ordinary Differential Equations are Polynomial-Space Complete.",
                    "Improved Approximation of Linear Threshold Functions.",
                    "On the Complexity of Boolean Functions in Different Characteristics.",
                    "The Complexity of the Annihilating Polynomial.",
                    "One-Way Functions and the Berman-Hartmanis Conjecture.",
                    "Planar Graph Isomorphism is in Log-Space.",
                    "Oracularization and Two-Prover One-Round Interactive Proofs against Nonlocal Strategies.",
                    "Quantum Copy-Protection and Quantum Money.",
                    "Parallel Approximation of Non-interactive Zero-sum Quantum Games.",
                    "Lower Bounds on Quantum Multiparty Communication Complexity.",
                    "Increasing the Gap between Descriptional Complexity and Algorithmic Probability.",
                    "Reconstruction of Generalized Depth-3 Arithmetic Circuits with Bounded Top Fan-in.",
                    "Multitask Efficiencies in the Decision Tree Model.",
                    "Worst-Case Running Times for Average-Case Algorithms.",
                    "On Basing ZK ≠ BPP on the Hardness of PAC Learning.",
                    "Infinite vs. Finite Space-Bounded Randomized Computations.",
                    "On the Communication Complexity of Read-Once AC^0 Formulae.",
                    "Lower Bounds on the Randomized Communication Complexity of Read-Once Functions.",
                    "An Approximation Algorithm for Approximation Rank.",
                    "A Multi-Round Communication Lower Bound for Gap Hamming and Some Consequences.",
                    "New Results in the Simultaneous Message Passing Model via Information Theoretic Techniques.",
                    "The Maximum Communication Complexity of Multi-Party Pointer Jumping."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "23rd CCC 2008",
        "info": "College Park, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2008",
                "sub_name": "Proceedings of the 23rd Annual IEEE Conference on Computational Complexity, CCC 2008, 23-26 June 2008, College Park, Maryland, USA.",
                "count": 32,
                "papers": [
                    "NP-Hard Sets Are Exponentially Dense Unless coNP C NP/poly.",
                    "Approximation of Natural W[P]-Complete Minimisation Problems Is Hard.",
                    "Hardness Amplification within NP against Deterministic Algorithms.",
                    "Amplifying Lower Bounds by Means of Self-Reducibility.",
                    "Amplifying ZPP^SAT[1] and the Two Queries Problem.",
                    "Learning Complexity vs. Communication Complexity.",
                    "Communication Complexity under Product and Nonproduct Distributions.",
                    "A Direct Product Theorem for Discrepancy.",
                    "Disjointness Is Hard in the Multi-party Number-on-the-Forehead Model.",
                    "Constant Width Planar Branching Programs Characterize ACC^0 in Quasipolynomial Size.",
                    "On the Relative Efficiency of Resolution-Like Proofs and Ordered Binary Decision Diagram Proofs.",
                    "Approximate Inclusion-Exclusion for Arbitrary Symmetric Functions.",
                    "The Sum of d Small-Bias Generators Fools Polynomials of Degree d.",
                    "Lower Bounds and Separations for Constant Depth Multilinear Circuits.",
                    "Noisy Interpolating Sets for Low Degree Polynomials.",
                    "Constraint Logic: A Uniform Framework for Modeling Computation as Games.",
                    "Soft Decoding, Dual BCH Codes, and Better List-Decodable e-Biased Codes.",
                    "Locally Decodable Codes From Nice Subsets of Finite Fields and Prime Factors of Mersenne Numbers.",
                    "Generalized Tsirelson Inequalities, Commuting-Operator Provers, and Multi-prover Interactive Proof Systems.",
                    "The Quantum Moment Problem and Bounds on Entangled Multi-prover Games.",
                    "Using Entanglement in Quantum Multi-prover Interactive Proofs.",
                    "The Power of Unentanglement.",
                    "The Multiplicative Quantum Adversary.",
                    "Approximation Resistant Predicates from Pairwise Independence.",
                    "2-Transitivity Is Insufficient for Local Testability.",
                    "New Results on Noncommutative and Commutative Polynomial Identity Testing.",
                    "Black Box Polynomial Identity Testing of Generalized Depth-3 Arithmetic Circuits with Bounded Top Fan-In.",
                    "Quantum Expanders: Motivation and Constructions.",
                    "Towards Dimension Expanders over Finite Fields.",
                    "Detecting Rational Points on Hypersurfaces over Finite Fields.",
                    "Randomised Individual Communication Complexity.",
                    "Exponential Separation of Quantum and Classical Non-interactive Multi-party Communication Complexity."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "22nd CCC 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2007",
                "sub_name": "22nd Annual IEEE Conference on Computational Complexity (CCC 2007), 13-16 June 2007, San Diego, California, USA.",
                "count": 30,
                "papers": [
                    "On Derandomizing Probabilistic Sublinear-Time Algorithms.",
                    "The Communication Complexity of Correlation.",
                    "On Computation and Communication with Small Bias.",
                    "Lower Bounds for Multi-Player Pointer Jumping.",
                    "Low-Depth Witnesses are Easy to Find.",
                    "Bounded Queries and the NP Machine Hypothesis.",
                    "On C-Degrees, H-Degrees and T-Degrees.",
                    "Time-Space Tradeoffs for Counting NP Solutions Modulo Integers.",
                    "Halfspace Matrices.",
                    "Unbalanced Expanders and Randomness Extractors from Parvaresh-Vardy Codes.",
                    "Perfect Parallel Repetition Theorem for Quantum XOR Proof Systems.",
                    "Quantum versus Classical Proofs and Advice.",
                    "Quantum t-designs: t-wise Independence in the Quantum World.",
                    "Norms, XOR Lemmas, and Lower Bounds for GF(2) Polynomials and Multiparty Protocols.",
                    "On Approximate Majority and Probabilistic Time.",
                    "An Exponential Lower Bound on the Size of Constant-Depth Threshold Circuits with Small Energy Complexity.",
                    "Understanding Parallel Repetition Requires Understanding Foams.",
                    "The Complexity of Polynomials and Their Coefficient Functions.",
                    "A Linear Round Lower Bound for Lovasz-Schrijver SDP Relaxations of Vertex Cover.",
                    "Directed Planar Reachability is in Unambiguous Log-Space.",
                    "Parity Problems in Planar Graphs.",
                    "S-T Connectivity on Digraphs with a Known Stationary Distribution.",
                    "On Parameterized Path and Chordless Path Problems.",
                    "Testing Properties of Constraint-Graphs.",
                    "Efficient Arguments without Short PCPs.",
                    "Bases Collapse in Holographic Algorithms.",
                    "On the Theory of Matchgate Computations.",
                    "A New Interactive Hashing Theorem.",
                    "Limits on the Hardness of Lattice Problems in ell _p Norms.",
                    "On Heuristic Time Hierarchies."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "21st CCC 2006",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2006",
                "sub_name": "21st Annual IEEE Conference on Computational Complexity (CCC 2006), 16-20 July 2006, Prague, Czech Republic.",
                "count": 34,
                "papers": [
                    "Preface.",
                    "Committees.",
                    "Reviewers.",
                    "Awards.",
                    "Godel and Computations (Abstract).",
                    "Polynomial Identity Testing for Depth 3 Circuits.",
                    "Every Linear Threshold Function has a Low-Weight Approximator.",
                    "Constructions of Low-Degree and Error-Correcting in-Biased Generators.",
                    "How to Get More Mileage from Randomness Extractors.",
                    "Exposure-Resilient Extractors.",
                    "Making Hard Problems Harder.",
                    "Distinguishing SAT from Polynomial-Size Circuits, through Black-Box Queries.",
                    "Parallel Repetition of Zero-Knowledge Proofs and the Possibility of Basing Cryptography on NP-Hardness.",
                    "Applications of the Sum-Product Theorem in Finite Fields.",
                    "Constructing Ramsey Graphs from Boolean Function Representations.",
                    "A Generic Time Hierarchy for Semantic Models with One Bit of Advice.",
                    "Hardness of the Covering Radius Problem on Lattices.",
                    "A 3-Query Non-Adaptive PCP with Perfect Completeness.",
                    "New Lower Bounds for Vertex Cover in the Lovasz-Schrijver Hierarchy.",
                    "FO[<]-Uniformity.",
                    "Circuit Lower Bounds via Ehrenfeucht-Fraisse Games.",
                    "On Modular Counting with Polynomials.",
                    "Learning Monotone Decision Trees in Polynomial Time.",
                    "Optimal Hardness Results for Maximizing Agreements with Monomials.",
                    "Minimizing DNF Formulas and AC0d Circuits Given a Truth Table.",
                    "A Duality between Clause Width and Clause Density for SAT.",
                    "QMA/qpoly \\subseteq PSPACE/poly: De-Merlinizing Quantum Protocols.",
                    "Random Measurement Bases, Quantum State Distinction and Applications to the Hidden Subgroup Problem.",
                    "Strengths and Weaknesses of Quantum Fingerprinting.",
                    "Grid Graph Reachability Problems.",
                    "An Isomorphism between Subexponential and Parameterized Complexity Theory.",
                    "On the Complexity of Numerical Analysis.",
                    "Oracles Are Subtle But Not Malicious.",
                    "Derandomization of Probabilistic Auxiliary Pushdown Automata Classes."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th CCC 2005",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2005",
                "sub_name": "20th Annual IEEE Conference on Computational Complexity (CCC 2005), 11-15 June 2005, San Jose, CA, USA.",
                "count": 33,
                "papers": [
                    "Preface.",
                    "Committees.",
                    "Awards.",
                    "On the Ring Isomorphism and Automorphism Problems.",
                    "Bounded Color Multiplicity Graph Isomorphism is in the #L Hierarchy.",
                    "The Complexity of the Inertia and Some Closure Properties of GapL.",
                    "Better Time-Space Lower Bounds for SAT and Related Problems.",
                    "A Direct Sum Theorem for Corruption and the Multiparty NOF Communication Complexity of Set Disjointness.",
                    "Monotone Circuits for Weighted Threshold Functions.",
                    "The Quantum Adversary Method and Classical Formula Size Lower Bounds.",
                    "More on Noncommutative Polynomial Identity Testing.",
                    "New Results on the Complexity of the Middle Bit of Multiplication.",
                    "On the Fourier Spectrum of Symmetric Boolean Functions with Applications to Learning Symmetric Juntas.",
                    "Short PCPs Verifiable in Polylogarithmic Time.",
                    "Tolerant Versus Intolerant Testing for Boolean Properties.",
                    "On the Hardness of Approximating Multicut and Sparsest-Cut.",
                    "Hardness of Max 3SAT with No Mixed Clauses.",
                    "On the Sensitivity of Cyclically-Invariant Boolean Functions.",
                    "On the Complexity of Hardness Amplification.",
                    "On Constructing Parallel Pseudorandom Generators from One-Way Functions.",
                    "Pseudorandom Bits for Constant Depth Circuits with Few Arbitrary Symmetric Gates.",
                    "Pseudorandomness for Approximate Counting and Sampling.",
                    "NP with Small Advice.",
                    "Average-Case Computations - Comparing AvgP, HP, and Nearly-P.",
                    "If NP Languages are Hard on the Worst-Case Then It is Easy to Find Their Hard Instances.",
                    "Computationally Private Randomizing Polynomials and Their Applications.",
                    "A Geometric Approach to Information-Theoretic Private Information Retrieval.",
                    "Prior Entanglement, Message Compression and Privacy in Quantum Communication.",
                    "Topology Inside NC¹.",
                    "Toward a Model for Backtracking and Dynamic Programming.",
                    "On the Complexity of Succinct Zero-Sum Games.",
                    "Upper Bounds for Quantum Interactive Proofs with Competing Provers.",
                    "On the Hardness of Distinguishing Mixed-State Quantum Computations."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "19th CCC 2004",
        "info": "Amherst, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2004",
                "sub_name": "19th Annual IEEE Conference on Computational Complexity (CCC 2004), 21-24 June 2004, Amherst, MA, USA.",
                "count": 30,
                "papers": [
                    "Compression of Samplable Sources.",
                    "Language Compression and Pseudorandom Generators.",
                    "On Pseudoentropy versus Compressibility.",
                    "Reductions between Disjoint NP-Pairs.",
                    "Relativized NP Search Problems and Propositional Proof Systems.",
                    "The Complexity of Treelike Systems over lamda-Local Formulae.",
                    "Lower Bounds for Testing Bipartiteness in Dense Graphs.",
                    "Polylogarithmic-Round Interactive Proofs for coNP Collapse the Exponential Hierarchy.",
                    "Solvable Group Isomorphism.",
                    "Small Spans in Scaled Dimension.",
                    "Computing in Fault Tolerance Broadcast Networks.",
                    "Some Results on Majority Quantifiers over Words.",
                    "Separating Complexity Classes Using Structural Properties.",
                    "Parameterized Complexity of Constraint Satisfaction Problems.",
                    "Tight Lower Bounds for Certain Parameterized NP-Hard Problems.",
                    "The Complexity of the Covering Radius Problem on Lattices and Codes.",
                    "Dimension, Entropy Rates, and Compression.",
                    "Properties of NP-Complete Sets.",
                    "Partial Bi-immunity and NP-Completeness.",
                    "Abelian Permutation Group Problems and Logspace Counting Classes.",
                    "Deterministic Polynomial Identity Testing in Non-Commutative Models.",
                    "Polynomials That Sign Represent Parity and Descartes Rule of Signs.",
                    "Consequences and Limits of Nonlocal Strategies.",
                    "Multiparty Quantum Coin Flipping.",
                    "On the Power of Quantum Proofs.",
                    "Quantum Arthur-Merlin Games.",
                    "Graph Properties and Circular Functions: How Low Can Quantum Query Complexity Go?",
                    "Lower Bounds for Randomized and Quantum Query Complexity Using Kolmogorov Arguments.",
                    "Towards the Classical Communication Complexity of Entanglement Distillation Protocols with Incomplete Information.",
                    "Limitations of Quantum Advice and One-Way Communication."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "18th CCC 2003",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2003",
                "sub_name": "18th Annual IEEE Conference on Computational Complexity (Complexity 2003), 7-10 July 2003, Aarhus, Denmark.",
                "count": 31,
                "papers": [
                    "Extremal properties of polynomial threshold functions.",
                    "Bounded Nondeterminism and Alternation in Parameterized Complexity Theory.",
                    "Uniform hardness vs. randomness tradeoffs for Arthur-Merlin games.",
                    "A zero one law for RP.",
                    "Hardness vs. Randomness within Alternating Time.",
                    "Lower bounds for predecessor searching in the cell probe model.",
                    "Minimization of Decision Trees Is Hard to Approximate.",
                    "Optimal Separation of EROW and CROWPRAMs.",
                    "Near-Optimal Lower Bounds on the Multi-Party Communication Complexity of Set Disjointness.",
                    "Rectangle Size Bounds and Threshold Covers in Communication Complexity.",
                    "The Complexity of Unique k-SAT: An Isolation Lemma for k-CNFs.",
                    "Quantum Certificate Complexity.",
                    "Quantum query complexity and semi-definite programming.",
                    "On Statistical Query Sampling and NMR Quantum Computing.",
                    "Derandomization and Distinguishing Complexity.",
                    "Extracting the Mutual Information for a Triple of Binary Strings.",
                    "The complexity of stochastic sequences.",
                    "A Combinatorial Characterization of Resolution Width.",
                    "Memoization and DPLL: Formula Caching Proof Systems.",
                    "Inapproximability Some history and some open problems.",
                    "Holographic Proofs and Derandomization.",
                    "Three-Query PCPs with Perfect Completeness over non-Boolean Domains.",
                    "List Decoding with Side Information.",
                    "Disjoint NP-Pairs.",
                    "Are Cook and Karp Ever the Same?",
                    "Universal Languages and the Power of Diagonalization.",
                    "Proving SAT does not have Small Circuits with an Application to the Two.",
                    "On Derandomizing Tests for Certain Polynomial Identities.",
                    "Improved Inapproximability of Lattice and Coding Problems with Preprocessing.",
                    "A Strong Inapproximability Gap for a Generalization of Minimum Bisection.",
                    "Vertex Cover Might be Hard to Approximate to within 2-\\varepsilon."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "17th CoCo 2002",
        "info": "Montréal, Québec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2002",
                "sub_name": "Proceedings of the 17th Annual IEEE Conference on Computational Complexity, Montréal, Québec, Canada, May 21-24, 2002.",
                "count": 36,
                "papers": [
                    "Resolution Lower Bounds for the Weak Pigeonhole Principle.",
                    "Hard Examples for Bounded Depth Frege.",
                    "Relations between Average Case Complexity and Approximation Complexity.",
                    "Vertex Cover on 4-Regular Hyper-graphs Is Hard to Approximate within 2 - ε.",
                    "Improved Cryptographic Hash Functions with Worst-Case/Average-Case Connection.",
                    "Algorithmic Derandomization via Complexity Theory.",
                    "Pseudo-Random Generators for All Hardnesses.",
                    "Randomness Conductors and Constant-Degree Lossless Expanders.",
                    "Expanders from Symmetric Codes.",
                    "The Complexity of Approximating the Entropy.",
                    "Time-Space Tradeoffs, Multiparty Communication Complexity, and Nearest-Neighbor Problems.",
                    "On Communication over an Entanglement-Assisted Quantum Channel.",
                    "Hardness Amplification within NP.",
                    "3-MANIFOLD KNOT GENUS is NP-complete.",
                    "On the Power of Unique 2-Prover 1-Round Games.",
                    "Learnability beyond AC0.",
                    "Resolution Lower Bounds for Perfect Matching Principles.",
                    "Resolution Width-Size Trade-offs for the Pigeon-Hole Principle.",
                    "The Inapproximability of Lattice and Coding Problems with Preprocessing.",
                    "Sampling Short Lattice Vectors and the Closest Lattice Vector Problem.",
                    "The History of Complexity.",
                    "The Correlation Between Parity and Quadratic Polynomials Mod 3.",
                    "Functions that have Read-Twice Constant Width Branching Programs are not Necessarily Testable.",
                    "On the Complexity of Integer Multiplication in Branching Programs with Multiple Tests and in Read-Once Branching Programs with Limited Nondeterminism.",
                    "Information Theory Methods in Communication Complexity.",
                    "Extracting Quantum Entanglement.",
                    "Algebras of Minimal Rank over Perfect Fields.",
                    "Rapid Mixing.",
                    "Pseudorandomness and Average-Case Complexity via Uniform Reductions.",
                    "Pseudo-Random Generators and Structure of Complete Degrees.",
                    "Decoding Concatenated Codes using Soft Information.",
                    "Arthur and Merlin in a Quantum World.",
                    "Streaming Computation of Combinatorial Objects.",
                    "Lower Bounds for Linear Locally Decodable Codes and Private Information Retrieval.",
                    "Better Lower Bounds for Locally Decodable Codes.",
                    "Universal Arguments and their Applications."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "16th CoCo 2001",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2001",
                "sub_name": "Proceedings of the 16th Annual IEEE Conference on Computational Complexity, Chicago, Illinois, USA, June 18-21, 2001.",
                "count": 30,
                "papers": [
                    "In Search of an Easy Witness: Exponential Time vs. Probabilistic Polynomial Time.",
                    "Towards Uniform AC0 - Isomorphisms.",
                    "Universal Traversal Sequences with Backtracking.",
                    "Comparing Notions of Full Derandomization.",
                    "Monotone Simulations of Nonmonotone Proofs.",
                    "Space Complexity of Random Formulae in Resolution.",
                    "Resolution Complexity of Independent Sets in Random Graphs.",
                    "Tree Resolution Proofs of the Weak Pigeon-Hole Principle.",
                    "Separation of NP-Completeness Notions.",
                    "Bounded Query Functions with Limited Output Bits.",
                    "A Linear Lower Bound on the Unbounded Error Probabilistic Communication Complexity.",
                    "Towards Proving Strong Direct Product Theorems.",
                    "Communication Complexity Lower Bounds by Polynomials.",
                    "Quantum Algorithms for Element Distinctness.",
                    "Quantum versus Classical Learnability.",
                    "Uniform Circuits for Division: Consequences and Problems.",
                    "Affine Projections of Symmetric Polynomials.",
                    "On the Non-Approximability of Boolean Functions by OBDDs and Read-K-Times Branching Programs.",
                    "Lower Bounds for Approximations by Low Degree Polynomials Over Zm.",
                    "On the Power of Nonlinear Secrect-Sharing.",
                    "A Stronger Kolmogorov Zero-One Law for Resource-Bounded Measure.",
                    "Hausdorff Dimension in Exponential Time.",
                    "On the Complexity of Approximating the VC Dimension.",
                    "Links Between Complexity Theory and Constrained Block Coding.",
                    "Simple Analysis of Graph Tests for Linearity and PCP.",
                    "Logical Operations and Kolmogorov Complexity II.",
                    "Computational Depth.",
                    "Quantum Algorithmic Entropy.",
                    "On Separators, Segregators and Time versus Space.",
                    "Time-Space Tradeoffs in the Counting Hierarchy."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "15th CoCo 2000",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/2000",
                "sub_name": "Proceedings of the 15th Annual IEEE Conference on Computational Complexity, Florence, Italy, July 4-7, 2000.",
                "count": 29,
                "papers": [
                    "Time-Space Tradeoffs for Nondeterministic Computation.",
                    "A Lower Bound for the Shortest Path Problem.",
                    "Time-Space Lower Bounds for SAT on Uniform and Non-Uniform Machines.",
                    "BP(L(f)1+epsilon).",
                    "The Communication Complexity of Enumeration, Elimination, and Selection.",
                    "The Query Complexity of Order-Finding.",
                    "On the Complexity of Some Problems on Groups Input as Multiplication Tables.",
                    "The Complexity of Tensor Calculus.",
                    "The Complexity of Verifying the Characteristic Polynomial and Testing Similarity.",
                    "A Dual Version of Reimer's Inequality and a Proof of Rudich's Conjecture.",
                    "Computational Complexity and Phase Transitions.",
                    "An Application of Matroid Theory to the SAT Problem.",
                    "New Bounds for the Language Compression Problem.",
                    "Combinatorial Interpretation of Kolmogorov Complexity.",
                    "Independent Minimum Length Programs to Translate between Given Strings.",
                    "A Survey of Optimal PCP Characterizations of NP.",
                    "Easiness Assumptions and Hardness Tests: Trading Time for Zero Error.",
                    "Dimension in Complexity Classes.",
                    "Average Case Complexity of Unbounded Fanin Circuits.",
                    "On the Hardness of 4-Coloring a 3-Colorable Graph.",
                    "Deciding the K-Dimension is PSPACE-Complete.",
                    "Integer Circuit Evaluation is PSPACE-Complete.",
                    "A Separation of Determinism, Las Vegas and Nondeterminism for Picture Recognition.",
                    "On the Complexity of Intersecting Finite State Automata.",
                    "On the Complexity of the Monotonicity Verification.",
                    "Quantum Kolmogorov Complexity.",
                    "On the Complexity of Quantum ACC.",
                    "Three Approaches to the Quantitative Definition of Information in an Individual Pure Quantum State.",
                    "Characterization of Non-Deterministic Quantum Query and Quantum Communication Complexity."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "14th CoCo 1999",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1999",
                "sub_name": "Proceedings of the 14th Annual IEEE Conference on Computational Complexity, Atlanta, Georgia, USA, May 4-6, 1999.",
                "count": 30,
                "papers": [
                    "Short Proofs Are Narrow - Resolution Made Simple (Abstract).",
                    "On the Complexity of Diophantine Geometry in Low Dimensions (Abstract).",
                    "Pseudorandom Generators without the XOR Lemma (Abstract).",
                    "Linear Gaps Between Degrees for the Polynomial Calculus Modulo Distinct Primes (Abstract).",
                    "Graph Ramsey Theory and the Polynomial Hierarchy (Abstract).",
                    "The Communication Complexity of Pointer Chasing Applications of Entropy and Sampling (Abstract).",
                    "A Lower Bound for Primality.",
                    "Non-Automatizability of Bounded-Depth Frege Proofs.",
                    "On Monotone Planar Circuits.",
                    "Computing from Partial Solutions.",
                    "Proofs, Codes, and Polynomial-Time Reducibilities.",
                    "Comparing Entropies in Statistical Zero Knowledge with Applications to the Structure of SZK.",
                    "De-Randomizing BPP: The State of the Art.",
                    "The Complexity of Solving Equations over Finite Groups.",
                    "Depth-3 Arithmetic Formulae over Fields of Characteristic Zero.",
                    "Stronger Separations for Random-Self-Reducibility, Rounds, and Advice.",
                    "The Expected Size of Heilbronn's Triangles.",
                    "Upper Semilattice of Binary Strings with the Relation \"x is Simple Conditional to y\".",
                    "Gaps in Bounded Query Hierarchies.",
                    "Query Order and NP-Completeness.",
                    "Quantum Bounded Query Complexity.",
                    "Some Recent Progress on the Complexity of Lattice Problems.",
                    "Quantum Simulations of Classical Random Walks and Undirected Graph Connectivity.",
                    "Deterministic Amplification of Space-Bounded Probabilistic Algorithms.",
                    "A Note on the Shortest Lattice Vector Problem.",
                    "Applications of a New Transference Theorem to Ajtai's Connection Factor.",
                    "Learning DNF by Approximating Inclusion-Exclusion Formulae.",
                    "Circuit Lower Bounds Collapse Relativized Complexity Classes.",
                    "Complicated Complementations.",
                    "Complexity of k-SAT."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "13th CoCo 1998",
        "info": "Buffalo, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1998",
                "sub_name": "Proceedings of the 13th Annual IEEE Conference on Computational Complexity, Buffalo, New York, USA, June 15-18, 1998.",
                "count": 27,
                "papers": [
                    "On Membership Comparable Sets.",
                    "Nonrelativizing Separations.",
                    "Two Queries.",
                    "Computational Indistinguishability: A Sample Hierarchy.",
                    "Proofs of Membership vs. Proofs of Knowledge.",
                    "Approximating the SVP to within a Factor is NP-Hard under Randomized Reductions.",
                    "Arthur-Merlin Games in Boolean Decision Trees.",
                    "On Arithmetic Branching Programs.",
                    "The Satisfiability Problem for Probabilistic Ordered Branching Programs.",
                    "Isolation, Matching, and Counting.",
                    "A Note on the Hardness of Tree Isomorphism.",
                    "Theory of Periodically Specified Problems: Complexity and Approximability.",
                    "Models of Computation in Coding Theory.",
                    "How to Encode a Logical Structure by an OBDD.",
                    "Complete Problems for Promise Classes by Optimal Proof Systems for Test Sets.",
                    "Lower Bounds for Computation with Limited Nondeterminism.",
                    "Solving Intractable Problems with DNA Computing.",
                    "Hard Sets are Hard to Find.",
                    "On the Resource Bounded Measure of P/poly.",
                    "Probabilistic Martingales and BPTIME Classes.",
                    "Complexity Limitations on Quantum Computation.",
                    "Relationships Between Quantum and Classical Space-Bounded Complexity Classes.",
                    "Uniformly Hard Languages.",
                    "Resource-Bounded Measure.",
                    "Randomness is Hard.",
                    "Resource Bounded Measure and Learnability.",
                    "Complexity Issues in Markov Decision Processes."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "12th CoCo 1997",
        "info": "Ulm, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1997",
                "sub_name": "Proceedings of the Twelfth Annual IEEE Conference on Computational Complexity, Ulm, Germany, June 24-27, 1997.",
                "count": 31,
                "papers": [
                    "Six Hypotheses in Search of a Theorem.",
                    "Inequalities for Shannon entropies and Kolmogorov complexities.",
                    "Circuits Over PP and PL.",
                    "The General Notion of a Dot-Operator.",
                    "Reversible Space Equals Deterministic Space.",
                    "Nondeterministic Polynomial Time versus Nondeterministic Logarithmic Space: Time-Space Tradeoffs for Satisfiability.",
                    "Polynomial Vicinity Circuits and Nonlinear Lower Bounds.",
                    "A Note on Universal Distributions for Polynomial-Time Computable Distributions.",
                    "LR(k) Testing is Average Case Complete.",
                    "Complexity and Expressive Power of Logic Programming.",
                    "Hyper-Polynomial Hierarchies and the NP-Jump.",
                    "The Density of Weakly Complete Problems under Adaptive Reductions.",
                    "Separating NP-Completeness Notions under Strong Hypotheses.",
                    "Undecidability Results for Low Complexity Degree Structures.",
                    "On TC0, AC0, and Arithmetic Circuits.",
                    "Upper and Lower Bounds for Some Depth-3 Circuit Classes.",
                    "Circuit Bottom Fan-in and Computational Power.",
                    "A Lower Bound for Perceptrons and an Oracle Separation of the PPPH Hierarchy.",
                    "On Operators of Higher Types.",
                    "Time Bounded Frequency Computations.",
                    "Circuits and Expressions with NOn-Associative Gates.",
                    "A Nonadaptive NC Checker for Permutation Group Intersection.",
                    "Acceptance by Transformation Monoids (with an Application to Local Self Reductions).",
                    "On Ranomization in Online Computation.",
                    "Randomized Simultaneous Messages: Solution of a Problem of Yao in Communication Complexity.",
                    "The Communication Complexity of the Universal Relation.",
                    "A Short Guide to Approximation Preserving Reductions.",
                    "Tight Bound on Johnson's Algoritihm for Max-SAT.",
                    "Constraint Satisfaction: The Approximability of Minimization Problems.",
                    "A Note on the Bottleneck Counting Argument.",
                    "Finite Limits and Monotone Computations: The Lower Bounds Criterion."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "11th CoCo 1996",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1996",
                "sub_name": "Proceedings of the Eleveth Annual IEEE Conference on Computational Complexity, Philadelphia, Pennsylvania, USA, May 24-27, 1996.",
                "count": 30,
                "papers": [
                    "An Isomorphism Theorem for Circuit Complexity.",
                    "Nondeterministic NC1 Computation.",
                    "Parallel Complexity Hierarchies Based on PRAMs and DLOGTIME-Uniform Circuits.",
                    "Collapsing Oracle-Tape Hierarchies.",
                    "Extracting Randomness: How and Why A survey.",
                    "On Coherence, Random-self-reducibility, and Self-correction.",
                    "Error Reduction by Parallel Repetition - a Negative Result.",
                    "Deciding the Vapnik-Cervonenkis dimension is SigmaP3-complete.",
                    "VC Dimension in Circuit Complexity.",
                    "Reducing P to a Sparse Set using a Constant Number of Queries Collapses P to L.",
                    "L-Printable Sets.",
                    "Hierarchies of Circuit Classes that are Closed under Complement.",
                    "Succinct Representation, Leaf Languages, and Projection Reductions.",
                    "Randomization and Derandomization in Space_Bounded Computation.",
                    "On the Measure of Two-Dimensional Regions with Polynomial-Time computables Boundaries.",
                    "On Positive P.",
                    "A Comparison of Weak Completeness Notions.",
                    "The Law of the Iterated Logarithm for p-Random Sequences.",
                    "Truth-table Closure and Turing Closure of Average Polynomial Time have Different Measures in EXP.",
                    "Much Ado about Functions.",
                    "Inverting Onto Functions.",
                    "A Note on P-selective sets and on Adaptive versus Nonadaptive Queries to NP.",
                    "Good Degree Bounds on Nullstellensatz Refutations of the Induction Principle.",
                    "The Complexity of Knowledge Representation.",
                    "Integer Programming as a Framework for Optimization and Approximability.",
                    "Complements of Multivalued Functions.",
                    "A Note on Decision versus Search for Graph Automorphism.",
                    "Zero Knowledge and the Chromatic Number.",
                    "DNA Models and Algorithms for NP-complete Problems.",
                    "Reversible Simulation of Irreversible Computation."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "10th SCT 1995",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1995",
                "sub_name": "Proceedings of the Tenth Annual Structure in Complexity Theory Conference, Minneapolis, Minnesota, USA, June 19-22, 1995.",
                "count": 30,
                "papers": [
                    "Counting Quantifiers, Successor Relations, and Logarithmic Space.",
                    "Weighted NP Optimization Problems: Logical Definability and Approximation Properties.",
                    "Intractability of Read-Once Resolution.",
                    "Semantics versus Syntax versus Computations.",
                    "On Superlinear Lower Bounds in Complexity Theory.",
                    "Fault Tolerant Circuits and Probabilistically Checkable Proofs.",
                    "Decision Trees with AND, OR Queries.",
                    "Semi-Unbounded Fan-In Circuits: Boolean vs. Arithmetic.",
                    "The Isomorphism Conjecture Holds and One-Way Functions Exist Relative to an Oracle.",
                    "Inverting the Turing Jump in Complexity Theory.",
                    "The Instance Complexity Conjecture.",
                    "Frequency Computation and Bounded Queries.",
                    "A Personal View of Average-Case Complexity.",
                    "Towards Average-Case Complexity Analysis of NP Optimization Problems.",
                    "Resource-Bounded Genericity.",
                    "Resource-Bounded Baire Category: A Stronger Approach.",
                    "A Note on Genericity and Bi-Immunity.",
                    "An Excursion to the Kolmogorov Random Strings.",
                    "Restricted Information from Nonadaptive Queries to NP.",
                    "On Approximation Algorithms for Hierarchical MAX-SAT.",
                    "A Game-Theoretic Classification of Interactive Complexity Classes.",
                    "Optimizing TRIEs for Ordered Pattern Matching is PiP2-Complete.",
                    "On the Structure of Low Sets.",
                    "On P-Immunity of Nondeterministic Complete Sets.",
                    "Reductions of Self-Reducible Sets to Depth-1 Weighted Threshold Circuit Classes, and Sparse Sets.",
                    "The Power of Local Self-Reductions.",
                    "On Finding the Number of Graph Automorphisms.",
                    "On the Power of Number-Theoretic Operations with Respect to Counting.",
                    "DSPACE(n)=?NSPACE(n): A Degree Theoretic Characterization.",
                    "A Small Span Theorem for P/Poly-Turing Reductions."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "9th SCT 1994",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1994",
                "sub_name": "Proceedings of the Ninth Annual Structure in Complexity Theory Conference, Amsterdam, The Netherlands, June 28 - July 1, 1994.",
                "count": 37,
                "papers": [
                    "Polynomial-Time Membership Comparable Sets.",
                    "Approximable Sets.",
                    "Polynomial Time Truth-Table Reductions to P-Selective Sets.",
                    "On the Query Complexity of Clique Size and Maximum Satisfiability.",
                    "On Functions Computable with Nonadaptive Queries to NP.",
                    "Using Bounded Query Classes to Separate Classes in the Exponential Time Hierarchy from Classes in PH.",
                    "NL/poly <= +/poly (Preliminary Version).",
                    "The Complexity World below Logarithmic Space.",
                    "Some Consequences of Our Failure to Prove Non-Linear Lower Bounds on Explicit Functions.",
                    "A Direct Product Theorem.",
                    "On Ultrafilters and NP.",
                    "Unambiguous Polynomial Hierarchies and Exponential Size.",
                    "On the Structure of Complete Sets.",
                    "Downward separation fails catastrophically for limited nondeterminism classes.",
                    "Generic Separations.",
                    "Weakly Hard Problems.",
                    "Relative to a Random Oracle, NP is Not Small.",
                    "Time, Hardware, and Uniformity.",
                    "Space Lower-Bounds for Pseudorandom-Generators.",
                    "Constructive Separation of Classes of Indistinguishable Ensembles.",
                    "Test Instance Generation for Promise NP Search Problems.",
                    "Random Strings Make Hard Instances.",
                    "Complexity Classes Defined via k-valued Functions.",
                    "Predicate Classes and Promise Classes.",
                    "Logspace and Logtime Leaf Languages.",
                    "Logical Definability of Counting Functions.",
                    "Relationships Among PL, #L, and the Determinant.",
                    "Random Debaters and the Hardness of Approximating Stochastic Functions.",
                    "Alternation in Interaction.",
                    "Towards the Parallel Repetition Conjecture.",
                    "Multi-Prover Encoding Schemes and Three-Prover Proof Systems.",
                    "The Complexity of Optimal Queueing Network Control.",
                    "The Complexity of Learning with Queries.",
                    "On the Isomorphism Problem for Weak Reducibilities.",
                    "Generalized CNF Satisfiability Problems and Non-Efficient.",
                    "Collapsing Degrees in Subexponential Time.",
                    "Complexity Theory and Genetics."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "8th SCT 1993",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1993",
                "sub_name": "Proceedings of the Eigth Annual Structure in Complexity Theory Conference, San Diego, CA, USA, May 18-21, 1993.",
                "count": 31,
                "papers": [
                    "Towards Uncheatable benchmarks.",
                    "On Limited Nondeterminism and the Complexity of the V.C Dimension (Extended Abstract).",
                    "On Monadic NP vs. Monadic co-NP (Extended Abstract).",
                    "Polynomial-time Optimization, Parallel Approximation, and Fixpoint Logic (Extended Abstract).",
                    "P-Selective Self-reducibles Sets: A New Characterization of P.",
                    "P-Selective Sets, and Reducing Search to Decision vs. Self-Reducability.",
                    "Isomorphisms of NP Complete Problems on Random Instances.",
                    "Polynomial Isomorphism of 1-L-Complete Sets.",
                    "The Polynomial Method in Circuit Complexity.",
                    "Lower Bounds on Representing Boolean Functions as Polynomials in Zm.",
                    "On Span Programs.",
                    "On Proving Lower Bounds for Circuit Size.",
                    "An Oarcle Builder's Toolkit.",
                    "Relationships between NP-sets, Co-NP-sets, and P-sets relative to random oracles.",
                    "On Closure Properties of #P in the Context of PF°#P.",
                    "On the Power of Generalized MOD-Classes.",
                    "The Quantitative Structure of Exponential Time.",
                    "On Completeness under Random Reductions.",
                    "With Quasi-linear Queries, EXP is not Polynomial Time Turing Reducible to ?Sparse Sets.",
                    "Sperner's Lemma and Robust Machines.",
                    "On the Power of Polynomial Time Bit-Reductions (Extended Abstract).",
                    "SPARSE reduces conjunctively to TALLY.",
                    "Relativized limitations of left set technique and closure classes of sparse sets (Extended Abstract).",
                    "Complexity and Structure in Formal Language Theory.",
                    "Pointers versus Arithmetic in PRAMs.",
                    "Some Structural Complexity Aspects of Neural Computation.",
                    "Alternating Time Versus Deterministic Time: A Separation.",
                    "Computing Functions with Parallel Queries to NP.",
                    "Taking it to the Limit: On Infinite Variants of NP-Complete Problems.",
                    "NP-Complete Problems Have a Version That's Hard to Approximate.",
                    "The Complexity of Selecting Maximal Solutions."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "7th SCT 1992",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1992",
                "sub_name": "Proceedings of the Seventh Annual Structure in Complexity Theory Conference, Boston, Massachusetts, USA, June 22-25, 1992.",
                "count": 34,
                "papers": [
                    "Majority Gates vs. General Weighted Threshold Gates.",
                    "Perceptrons, PP, and the Polynomial Hierarchy.",
                    "The Power of Negative Thinking in Constructing Threshold Circuits for Addition.",
                    "A Sublinear Space, Polynomial Time Algorithm for Directed s-t Connectivity.",
                    "Fixed-Parameter Intractability.",
                    "Some Properties of Exponential Time Complexity Classes.",
                    "Set Bit Enumeration is Hard.",
                    "Saving Queries with Randomness.",
                    "Quasipolynomial Size Circuit Classes.",
                    "Cicuits, Matrices, and Nonassociative Computation.",
                    "Self-Witnessing Polynomial-Time Complexity and Prime Factorization.",
                    "The Power of the Middle Bit.",
                    "On the Nonuniform Complexity on the Graph Isomorphism Problem.",
                    "The Quantum Challenge to Structural Complexity Theory.",
                    "On The Power of PP.",
                    "Formal Power Series: An Algebraic Approach to the GapP and #P Functions.",
                    "Fixpoint Logics, Relational Machines, and Computational Complexity.",
                    "Descriptive Complexity of #P Functions.",
                    "A Purely Logical Characterization of Circuit Uniformity.",
                    "Functional Characterizations of Uniform Log-depth and Polylog-depth Circuit Families.",
                    "Universal Relations.",
                    "How Hard Are Sparse Sets?",
                    "On Randomized Reductions to Sparse Sets.",
                    "On Closeness of NP-Hard Sets to Other Complexity Classes.",
                    "Bounding the Complexity of Advice Functions.",
                    "On Languages with Very High Information Content.",
                    "Fractional Covers and Communication Complexity.",
                    "Non-deterministic Communication Complexity with Few Witness.",
                    "Interactive Proof Systems with Polynomially Bounded Strategies.",
                    "Some Lower and Upper Bounds for Algebraic Decision Trees and the Separation Problem.",
                    "Average Dependence and Random Oracles.",
                    "On Average P vs. Average NP.",
                    "A Note on the Instance Complexity of Pseudorandom Sets.",
                    "The Power of Adaptiveness and Additional Queries in Random-Self-Reductions."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "6th SCT 1991",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1991",
                "sub_name": "Proceedings of the Sixth Annual Structure in Complexity Theory Conference, Chicago, Illinois, USA, June 30 - July 3, 1991.",
                "count": 38,
                "papers": [
                    "Counting Classes Are at Least as Hard as the Polynomial-Time Hierarchy.",
                    "PP is Closed Under Truth-Table Reductions.",
                    "A Complexity Theory for Feasible Closure Properties.",
                    "Gap-Definable Counting Classes.",
                    "The Power of Witness Reduction.",
                    "Bounded Queries in Recursion Theory: A Survey.",
                    "On Reductions of NP Sets to Sparse Sets.",
                    "On the Computational Complexity of Small Descriptions.",
                    "Complexity Classes and Sparse Oracles.",
                    "PSPACE Is Provable By Two Provers In One Round.",
                    "On the Success Probability of the Two Provers in One-Round Proof Systems.",
                    "On the Random-Self-Reducibility of Complete Sets.",
                    "One-Way Functions, Hard on Average Problems, and Statistical Zero-Knowledge Proofs.",
                    "On One Query Self-Reducible Sets.",
                    "Combinatorics and Kolmogorov Complexity.",
                    "The Complexity of Malign Ensembles.",
                    "Randomized vs.Deterministic Decision Tree Complexity for Read-Once Boolean Functions.",
                    "On the Monte Carlo Boolean Decision Tree Complexity of Read-Once Formulae.",
                    "A Pseudorandom Oracle Characterization of BPP.",
                    "Notions of Resource-Bounded Category and Genericity.",
                    "BPP has Subexponential Time Simulation unless EXPTIME has Pubishable Proofs.",
                    "Relating Equivalence and Reducibility to Sparse Sets.",
                    "Exponential Time and Subexponential Time Sets.",
                    "Adaptive Logspace and Depth-Bounded Reducibilities.",
                    "Connections between the Complexity of Unique Satisfiability and the Threshold Behavior of Randomized Reductions.",
                    "Counting auxiliary pushdown automata and semi-unbounded arithmetic circuits.",
                    "Degree Compexity of Boolean Functions and Its Applications to Realivized Separations.",
                    "The Perceptron Strikes Back.",
                    "Monotone Separation of Logspace from NC.",
                    "Super-logarithmic Depth Lower Bounds via Direct Sum in Communication Coplexity.",
                    "Superlinear Lower Bounds for Bounded-Width Branching Programs.",
                    "Geometric Arguments Yield Better Bounds for Threshold Circuits and Distributed Computing.",
                    "Lower Bounds with Smaller Domain Size On Concurrent Write Parallel Machines.",
                    "DSPACE[nk] = VAR[k+1].",
                    "Capturing Complexity Classes by Fragments of Second Order Logic.",
                    "Approximation Properties of NP Minimization Classes.",
                    "Approximation and Small Depth Frege Proofs.",
                    "Errata for Circuit Size to Pseudorandom Oracles."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "5th SCT 1990",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1990",
                "sub_name": "Proceedings: Fifth Annual Structure in Complexity Theory Conference, Universitat Politècnica de Catalunya, Barcelona, Spain, July 8-11, 1990.",
                "count": 33,
                "papers": [
                    "On Polynominal Time Bounded Truth-Table Reducibility of NP Sets to Sparse Sets (Abstract).",
                    "Structural Properties of Nondeterministic Complete Sets.",
                    "On Sets with Efficient Implicit Membership Tests.",
                    "On the Instance Complexity of NP-Hard Problems.",
                    "E-mail and the Unexpected Power of Interaction.",
                    "On Bounded Round Multi-Prover Interactive Proof Systems.",
                    "Privacy, Additional Information, and Communication.",
                    "On the Power of Randomness in the Decision Tree Model.",
                    "On Read-Once Threshold Formulae and Their Randomized Decision Tree Complexity.",
                    "The Computational Complexity of Universal Hashing.",
                    "Perfect Hashing, Graph Entropy, and Circuit Complexity.",
                    "Lower Bounds on Random-Self-Reducibility.",
                    "Non-Uniform Complexity Classes and Random Languages.",
                    "Width-Bounded Reducibility and Binary Search over Complexity Classes.",
                    "Unambiguity of Circuits.",
                    "A Survey on Counting Classes.",
                    "A Very Hard Log Space Counting Class.",
                    "The Boolean Hierarchy and the Polynomial Hierarchy: a Closer Connection.",
                    "On Read-Once vs. Multiple Access to Randomness in Logspace.",
                    "Bounded Arithmetic and Computational Complexity.",
                    "Extensions to Barrington's M-Program Model.",
                    "The Quantifier Structure of Sentences that Characterize Nondeterministic Time Complexity.",
                    "Circuits, Pebbling and Expressibility.",
                    "Some Connections Between Bounded Query Classes and Non-Uniform Complexity.",
                    "Quantifiers and Approximation (Abstract).",
                    "Impossibilities and Possibilities of Weak Separation Between NP and Exponential Time.",
                    "P-Productivity and Polynominal Time Approximations.",
                    "Circuit Size Relative to Pseudorandom Oracles.",
                    "A Note on Relativizing Complexity Classes with Tally Oracles.",
                    "An Oracle Separating +P From PPph.",
                    "On Separating Complexity Classes.",
                    "Complexity Classes with Advice.",
                    "Errata for On the Power of Multi-Prover Interactive Protocols."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "4th SCT 1989",
        "info": "Eugene, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1989",
                "sub_name": "Proceedings: Fourth Annual Structure in Complexity Theory Conference, University of Oregon, Eugene, Oregon, USA, June 19-22, 1989.",
                "count": 30,
                "papers": [
                    "The Isomorphism Conjecture Fails Relative to a Random Oracle (abstract).",
                    "Oracles for Structural Properties: The Isomorphism Problem and Public-Key Cryptography.",
                    "On Polynomial Time Turing and Many-One Completeness in PSPACE.",
                    "P-Creative Sets vs. P-Completely Creative Sets.",
                    "On the Theory of Average Case Complexity (abstract).",
                    "Almost Everywhere High Nonuniform Complexity.",
                    "Hardness vs. Randomness - A Survey (abstract).",
                    "Boolean Functions, Invariance Groups and Parallel Complexity.",
                    "The P-T-Degrees of the Recursive Sets: Lattice Embeddings, Extension of Embeddings and the Two Quantifier Theory.",
                    "Composition is Almost as Good as S-1-1.",
                    "Finitary Substructure Languages.",
                    "The Power of Parallel Random Access Machines with Augmented Instruction Sets.",
                    "The Complexity of Iterated Multiplication.",
                    "The Complexity of Circuit Value and Network Stability.",
                    "Decomposing NC and AC.",
                    "On Finding Locally Optimal Solutions.",
                    "The Complexity Of The Real Line Is A Fractal.",
                    "Results on Communication Complexity Classes.",
                    "Multi-Oracle Interactive Protocols with Space Bounded Verifiers.",
                    "Inductive Reasoning and Komogorov Complexity.",
                    "The Generalized Kolmogorov Complexity of Sets.",
                    "On Honest Polynomial Reductions, Relativizations, and P=NP.",
                    "Turing Machines with few Accepting Computations and low Sets for PP.",
                    "On the Relativized Power of Additional Accepting Paths.",
                    "On the Power of Probabilistic Polynomial Time: PNP[log] subseteq PP.",
                    "The Minimum Consistent DFA Problem Cannot be Approximated within any Polynomial (abstract).",
                    "The Complexity Types of Computable Sets.",
                    "Seperating Complexity Classes Related to Certain Input Oblivious Logarithmic Space-Bounded Turing Machines.",
                    "On the Structure of Bounded Queries to Arbitrary NP Sets.",
                    "Nondeterministic Witnesses and Nonuniform Advice."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "3rd SCT 1988",
        "info": "Washington, D. C., USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1988",
                "sub_name": "Proceedings: Third Annual Structure in Complexity Theory Conference, Georgetown University, Washington, D. C., USA, June 14-17, 1988.",
                "count": 29,
                "papers": [
                    "Relativized polynomial time hierarchies having exactly K levels.",
                    "The power of counting.",
                    "On tally relativizations of BP-complexity classes.",
                    "Relations between communication complexity classes.",
                    "Decision trees and downward closures.",
                    "Logspace self-reducibility.",
                    "On uniformity within NC1.",
                    "Reductions among prediction problems: on the difficulty of predicting automata.",
                    "Trading reversals for alternation.",
                    "Two decades of applied Kolmogorov complexity: in memoriam Andrei Nikolaevich Kolmogorov 1903-87.",
                    "Kolmogorov complexity and degrees of tally sets.",
                    "Nondeterministic space is closed under complementation.",
                    "Two applications of complementation via inductive counting.",
                    "Juris Hartmanis: the beginnings of computational complexity.",
                    "Juris Hartmanis: building a department-building a discipline.",
                    "Juris Hartmanis: fundamental contributions to isomorphism problems.",
                    "On the power of multi-power interactive protocols.",
                    "Space bounded probabilistic game automata.",
                    "Pseudorandom sources for BPP.",
                    "Distinguishing bounded reducibilities by sparse sets.",
                    "Enumerative counting is hard.",
                    "The complexity of ranking.",
                    "An oracle characterization of the counting hierarchy.",
                    "On truth-table reducibility to SAT and the difference hierarchy over NP.",
                    "On polynomial and generalized complexity cores.",
                    "On the theory of the PTIME degrees of the recursive sets.",
                    "Bounded query computations.",
                    "The polynomial time hierarchy collapses if the Boolean hierarchy collapses.",
                    "Cook is faster than Karp: a study of reducibilities in NP."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "2nd SCT 1987",
        "info": "Ithaca, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1987",
                "sub_name": "Proceedings of the Second Annual Conference on Structure in Complexity Theory, Cornell University, Ithaca, New York, USA, June 16-19, 1987.",
                "count": 28,
                "papers": [
                    "Lowness and probabilistic complexity classes.",
                    "On hiding information from an oracle.",
                    "Complexity characterizations of attribute grammar languages.",
                    "Reversal complexity.",
                    "Polynomial terse sets.",
                    "A structural theorem that depends quantitatively on the complexity of SAT.",
                    "PNP[log n] and sparse turing complete sets for NP.",
                    "The probabilistic communication complexity of set intersection.",
                    "Near-testable, P-cheatable, and P-terse sets.",
                    "Honest polynomial reducibilities, recursively enumerable sets, and the P=?NP problem.",
                    "Unprovably intractable languages.",
                    "Resource bounded baire category and small circuits in exponential space.",
                    "PSPACE survives three-bit bottlenecks.",
                    "On ranking.",
                    "On threshold circuits and polynomial computation.",
                    "One-way functions, robustness, and the non-isomorphism of NP-complete sets.",
                    "Strong nondeterministic reduction - a technique for proving intractability.",
                    "Polynomial time reducibility to a set of small density.",
                    "On sets reducible to sparse sets.",
                    "The complexity of perfect zero-knowledge.",
                    "Some consequences of the existence of pseudorandom generators.",
                    "Progress on collapsing degrees.",
                    "A theory of oracle machines.",
                    "On helping by robust oracle machines.",
                    "The strong exponential hierarchy collapses.",
                    "Expressibility as a complexity measure: results and directions.",
                    "Characterization of complexity classes in higher-order logic.",
                    "Complexity theoretic algebra I - vector spaces over finite fields."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "1st SCT 1986",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/coco/1986",
                "sub_name": "Structure in Complexity Theory, Proceedings of the Conference hold at the University of California, Berkeley, California, USA, June 2-5, 1986.",
                "count": 28,
                "papers": [
                    "The Complexity of Sparse Sets in P.",
                    "Isomorphisms and 1-L Reductions.",
                    "Randomness, Relativizations, and Polynomial Reducibilities.",
                    "On Non- uniform Polynomial Space.",
                    "One- Way Functions and Circuit Complexity.",
                    "Relativized Alternation.",
                    "The Polynomial Hierarchy and Intuitionistic Bounded Arithmetic.",
                    "With Probability One, A Random Oracle Separates PSPACE from the Polynomial- Time Hierarchy.",
                    "The Boolean Hierarchy: Hardware over NP.",
                    "Exponential Time and Bounded Arithmetic.",
                    "Probabilistic Game Automata.",
                    "two Lower Bound Arguments with \"Inaccessible\" Numbers.",
                    "Resource- Bounded Kolmogorov Complexity of Hard Languages.",
                    "A Note on One- Way Functions and Polynomial Time Isomorphisms.",
                    "What Is a Hard Instance of a Computational Problem?.",
                    "The Complexity of Optimization Problems.",
                    "The Power of the Queue.",
                    "A Depth- Size Tradeoff for Boolean Circuits with Unbounded Fan- In.",
                    "An Optimal Lower Bound for Turing Machines with One Work Tape and a Two- way Input Tape.",
                    "Separation Results for Bounded Alternation.",
                    "Parallel Computation with Threshold Functions.",
                    "The Topology of Provability in Complexity Theory.",
                    "Optimal Approximations of Complete Sets.",
                    "Expanders, Randomness, or Time versus Space.",
                    "Diagonalisation methods in a polynomial setting.",
                    "Bounded Oracles and Complexity Classes Inside Linear Space.",
                    "Parallel Computation and the NC Hierarchy Relativized.",
                    "Probabilistic Quantifiers, Adversaries, and Complexity Classes: An Overview."
                ]
            }
        ]
    }
]