[
    {
        "name": "Computational complexity",
        "year": "2022",
        "info": "Volume 31, 2022",
        "count": 4,
        "papers": [
            "Rank and border rank of Kronecker powers of tensors and Strassen's laser method.",
            "The complexity of approximating the complex-valued Potts model.",
            "Amplification with One NP Oracle Query.",
            "Expander-Based Cryptography Meets Natural Proofs."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2021",
        "info": "Volume 30, 2021",
        "count": 16,
        "papers": [
            "Smooth and Strong PCPs.",
            "Resolution with Counting: Dag-Like Lower Bounds and Different Moduli.",
            "Explicit List-Decodable Codes with Optimal Rate for Computationally Bounded Channels.",
            "Nullstellensatz Size-Degree Trade-offs from Reversible Pebbling.",
            "Subquadratic-Time Algorithms for Normal Bases.",
            "Lower Bounds for Matrix Factorization.",
            "Reversible Pebble Games and the Relation Between Tree-Like and General Resolution Space.",
            "Blackbox identity testing for sum of special ROABPs and its border class.",
            "Correction to: Smooth and Strong PCPs.",
            "Nondeterministic and Randomized Boolean Hierarchies in Communication Complexity.",
            "The hardest halfspace.",
            "An Exponential Separation Between MA and AM Proofs of Proximity.",
            "Near-Optimal Lower Bounds on Regular Resolution Refutations of Tseitin Formulas for All Constant-Degree Graphs.",
            "Lower Bounds for Arithmetic Circuits via the Hankel Matrix.",
            "Factorization of Polynomials Given by Arithmetic Branching Programs.",
            "Correction to: Near-Optimal Lower Bounds on Regular Resolution Refutations of Tseitin Formulas for All Constant-Degree Graphs."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2020",
        "info": "Volume 29, 2020",
        "count": 9,
        "papers": [
            "On the characterization of 1-sided error strongly testable graph properties for bounded-degree graphs.",
            "Communication Complexity with Small Advantage.",
            "Toward Better Depth Lower Bounds: Two Results on the Multiplexor Relation.",
            "Correction to: Communication complexity with small advantage.",
            "Two-closures of supersolvable permutation groups in polynomial time.",
            "On ε-sensitive monotone computations.",
            "The Robustness of LWPP and WPP, with an Application to Graph Reconstruction.",
            "The Computational Complexity of Plethysm Coefficients.",
            "Linear Matroid Intersection is in Quasi-NC."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2019",
        "info": "Volume 28, 2019",
        "count": 19,
        "papers": [
            "Approximate Nonnegative Rank is Equivalent to the Smooth Rectangle Bound.",
            "Tensor surgery and tensor rank.",
            "Asymptotic tensor rank of graph tensors: beyond matrix multiplication.",
            "Query-to-Communication Lifting for P NP.",
            "Prediction from Partial Information and Hindsight, with Application to Circuit Lower Bounds.",
            "Random resolution refutations.",
            "Vanishing of Littlewood-Richardson polynomials is in P.",
            "Improved Bounds for Quantified Derandomization of Constant-Depth Circuits and Polynomials.",
            "A decidable dichotomy theorem on directed graph homomorphisms with non-negative weights.",
            "A quadratic lower bound for homogeneous algebraic branching programs.",
            "Interactive proofs and a Shamir-like result for real number computations.",
            "Lower Bounds and PIT for Non-commutative Arithmetic Circuits with Restricted Parse Trees.",
            "Correction to: Query-to-Communication Lifting for P NP.",
            "Depth-4 Lower Bounds, Determinantal Complexity: A Unified Approach.",
            "On the Relationship Between Statistical Zero-Knowledge and Statistical Randomized Encodings.",
            "Simulation Theorems via Pseudo-random Properties.",
            "On Derandomized Composition of Boolean Functions.",
            "Hierarchy Theorems for Testing Properties in Size-Oblivious Query Complexity.",
            "Average-case linear matrix factorization and reconstruction of low width algebraic branching programs."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2018",
        "info": "Volume 27, 2018",
        "count": 16,
        "papers": [
            "On the hardness of the noncommutative determinant.",
            "Short lists with short programs in short time.",
            "Autoreducibility of NP-Complete Sets under Strong Hypotheses.",
            "Non-interactive proofs of proximity.",
            "The Average Sensitivity of Bounded-Depth Formulas.",
            "Local Expanders.",
            "The Landscape of Communication Complexity Classes.",
            "Matrix rigidity of random Toeplitz matrices.",
            "Some observations on holographic algorithms.",
            "Toward the KRW Composition Conjecture: Cubic Formula Lower Bounds via Communication Complexity.",
            "Communication with Contextual Uncertainty.",
            "On Space and Depth in Resolution.",
            "Constructive non-commutative rank computation is in deterministic polynomial time.",
            "On semiring complexity of Schur polynomials.",
            "Algebraic independence over positive characteristic: New criterion and applications to locally low-algebraic-rank circuits.",
            "An adaptivity hierarchy theorem for property testing."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2017",
        "info": "Volume 26, 2017",
        "count": 24,
        "papers": [
            "On the complexity of computing Kronecker coefficients.",
            "Sparse affine-invariant linear codes are locally testable.",
            "Nondeterministic circuit lower bounds from mildly derandomizing Arthur-Merlin games.",
            "The Value of Help Bits in Randomized and Average-Case Complexity.",
            "Information-theoretic approximations of the nonnegative rank.",
            "Multipartite Quantum Correlation and Communication Complexities.",
            "On the Structure of Boolean Functions with Small Spectral Norm.",
            "Fourier Concentration from Shrinkage.",
            "Block-symmetric polynomials correlate with parity better than symmetric.",
            "List-Decoding Barnes-Wall Lattices.",
            "On Approximating the Eigenvalues of Stochastic Matrices in Probabilistic Logspace.",
            "On the connection between interval size functions and path counting.",
            "The Minimum Oracle Circuit Size Problem.",
            "Sunflowers and Testing Triangle-Freeness of Functions.",
            "Low-degree test with polynomially small error.",
            "Dual VP Classes.",
            "Graph Isomorphism, Color Refinement, and Compactness.",
            "Topological lower bounds for arithmetic networks.",
            "Non-commutative Edmonds' problem and matrix semi-invariants.",
            "The Complexity of Approximating complex-valued Ising and Tutte partition functions.",
            "Deterministic Identity Testing for Sum of Read-Once Oblivious Arithmetic Branching Programs.",
            "Sparse multivariate polynomial interpolation on the basis of Schubert polynomials.",
            "Tight Size-Degree Bounds for Sums-of-Squares Proofs.",
            "On vanishing of Kronecker coefficients."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2016",
        "info": "Volume 25, 2016",
        "count": 23,
        "papers": [
            "Combinatorial PCPs with Short Proofs.",
            "Quantum commitments from complexity assumptions.",
            "The complexity of estimating min-entropy.",
            "Relativizing small complexity classes and their theories.",
            "On the power of algebraic branching programs of width two.",
            "A Dichotomy for Real Weighted Holant Problems.",
            "Special issue \"Computational Complexity Conference 2015\" Guest Editors' Foreword.",
            "Kolmogorov Width of Discrete Linear Spaces: an Approach to Matrix Rigidity.",
            "Incompressible Functions, Relative-Error Extractors, and the Power of Nondeterministic Reductions.",
            "Lower Bounds for Depth-Three Arithmetic Circuits with small bottom fanin.",
            "Subexponential Size Hitting Sets for Bounded Depth Multilinear Formulas.",
            "Factors of low individual degree polynomials.",
            "Special Issue on the 10th Theory of Cryptography Conference: Editor's Foreword.",
            "A counterexample to the chain rule for conditional HILL entropy.",
            "Unprovable Security of Perfect NIZK and Non-interactive Non-malleable Commitments.",
            "Cryptographic Hardness of Random Local Functions - Survey.",
            "Quantum Query Complexity of Almost All Functions with Fixed On-set Size.",
            "Testing list H-homomorphisms.",
            "The complexity of intersecting finite automata having few final states.",
            "Connect Four and Graph Decomposition.",
            "Collapse of the Hierarchy of Constant-Depth Exact Quantum Circuits.",
            "A thirty Year old conjecture about promise problems.",
            "Affine extractors over large fields with exponential error."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2015",
        "info": "Volume 24, 2015",
        "count": 19,
        "papers": [
            "Monomials in Arithmetic Circuits: Complete Problems in the Counting Hierarchy.",
            "Complexity of Tropical and Min-plus Linear Prevarieties.",
            "Lower bounds for testing triangle-freeness in Boolean functions.",
            "The remote set problem on lattices.",
            "Rank-one quantum games.",
            "Special issue \"Conference on Computational Complexity 2014\" Guest Editor's Foreword.",
            "A parallel repetition theorem for entangled projection games.",
            "Quantum Algorithms for Learning Symmetric Juntas via the Adversary Bound.",
            "Equivalence of Polynomial Identity Testing and Polynomial Factorization.",
            "Mining Circuit Lower Bound Proofs for Meta-Algorithms.",
            "Unifying Known Lower Bounds via Geometric Complexity Theory.",
            "Read-once polynomial identity testing.",
            "Limits on Alternation Trading Proofs for Time-Space Lower Bounds.",
            "Composition of semi-LTCs by two-wise tensor products.",
            "The NOF Multiparty Communication Complexity of Composed Functions.",
            "Deterministic polynomial identity tests for multilinear bounded-read formulae.",
            "On the complexity of inverting integer and polynomial matrices.",
            "Query Complexity in Errorless Hardness Amplification.",
            "On Rigid Matrices and U-Polynomials."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2014",
        "info": "Volume 23, 2014",
        "count": 17,
        "papers": [
            "Choosing, Agreeing, and Eliminating in Communication Complexity.",
            "Lower Bounds on the Query Complexity of Non-uniform and Adaptive Reductions Showing Hardness Amplification.",
            "ReachFewL = ReachUL.",
            "Tradeoff lower lounds for stack machines.",
            "Special Issue \"Conference on Computational Complexity 2013\" Guest editor's foreword.",
            "The correct exponent for the Gotsman-Linial Conjecture.",
            "On Uniformity and Circuit Lower Bounds.",
            "Random arithmetic formulas can be reconstructed efficiently.",
            "How Low can Approximate Degree and Quantum Query Complexity be for Total Boolean Functions?",
            "On the Power of Non-adaptive Learning Graphs.",
            "Combinatorial PCPs with Efficient Verifiers.",
            "Randomness Buys Depth for Approximate Counting.",
            "Variety Evasive Sets.",
            "Using Elimination Theory to Construct Rigid Matrices.",
            "Short lists for shortest descriptions in short time.",
            "Lifting lower bounds for tree-like proofs.",
            "An AC 1-complete model checking problem for intuitionistic logic."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2013",
        "info": "Volume 22, 2013",
        "count": 23,
        "papers": [
            "Small Space Analogues of Valiant's Classes and the Limitations of Skew Formulas.",
            "A Case of Depth-3 Identity Testing, Sparse Factorization and Duality.",
            "Complexity of Solving Tropical Linear Systems.",
            "Comparing the strength of query types in property testing: The case of k-colorability.",
            "2-Transitivity is Insufficient for Local Testability.",
            "Query-Efficient Locally Decodable Codes of Subexponential Length.",
            "Rank complexity gap for Lovász-Schrijver and Sherali-Adams proof systems.",
            "Special Issue \"Conference on Computational Complexity 2012\" Guest editors' foreword.",
            "On sunflowers and matrix multiplication.",
            "A satisfiability algorithm and average-case hardness for formulas over the full binary basis.",
            "DNF sparsification and a faster deterministic counting algorithm.",
            "Amplifying circuit lower bounds against polynomial time, with applications.",
            "Is Valiant-Vazirani's isolation probability improvable?",
            "Parallel Approximation of Min-Max Problems.",
            "A strong direct product theorem for quantum query complexity.",
            "Modular Composition Modulo Triangular Sets and Applications.",
            "Resource Trade-offs in Syntactically Multilinear Arithmetic Circuits.",
            "Derandomized Parallel Repetition Theorems for Free Games.",
            "Hadamard tensors and lower bounds on multiparty communication complexity.",
            "Improved Approximation of Linear Threshold Functions.",
            "Pseudorandom generators for CC0[p] and the Fourier spectrum of low-degree polynomials over finite fields.",
            "Pseudorandom generators for combinatorial checkerboards.",
            "Space Functions and Space Complexity of the Word Problem in Semigroups."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2012",
        "info": "Volume 21, 2012",
        "count": 20,
        "papers": [
            "Special issue from RANDOM'09: Editors' Foreword.",
            "Pseudorandom Generators, Typically-Correct Derandomization, and Circuit Lower Bounds.",
            "Random low-degree polynomials are hard to approximate.",
            "On the security of Goldreich's one-way function.",
            "Hierarchy Theorems for Property Testing.",
            "Special Issue \"Conference on Computational Complexity 2011\" Guest Editor's Foreword.",
            "Improved direct product theorems for randomized query complexity.",
            "Bounded-Depth Circuits Cannot Sample Good Codes.",
            "Towards lower bounds on locally testable codes via density arguments.",
            "Property Testing Lower Bounds via Communication Complexity.",
            "Complexity and Approximability of the Cover Polynomial.",
            "On reducing factorization to the discrete logarithm problem modulo a composite.",
            "On a Theorem of Razborov.",
            "Low-Depth Witnesses are Easy to Find.",
            "A Quantum Characterization Of NP.",
            "Length 3 Edge-Disjoint Paths Is NP-Hard.",
            "Extractors for varieties.",
            "Holographic reduction, interpolation and hardness.",
            "Inapproximability of the Tutte polynomial of a planar graph.",
            "On the power of unambiguity in log-space."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2011",
        "info": "Volume 20, 2011",
        "count": 22,
        "papers": [
            "Interpolation in Valiant's Theory.",
            "Generic Complexity of Finitely Presented Monoids and Semigroups.",
            "Parameterized Proof Complexity.",
            "Weak Derandomization of Weak Algorithms: Explicit Versions of Yao's Lemma.",
            "Complexity of Hard-Core Set Proofs.",
            "Special Issue \"Conference on Computational Complexity 2010\" Guest Editor's Foreword.",
            "Spectral Algorithms for Unique Games.",
            "Derandomized Parallel Repetition via Structured PCPs.",
            "Derandomizing Arthur-Merlin Games and Approximate Counting Implies Exponential-Size Lower Bounds.",
            "On Matrix Rigidity and Locally Self-correctable Codes.",
            "The Gaussian Surface Area and Noise Sensitivity of Degree-d Polynomial Threshold Functions.",
            "PCP Characterizations of NP: Toward a Polynomially-Small Error-Probability.",
            "Arthur and Merlin as Oracles.",
            "Homogeneous Formulas and Symmetric Polynomials.",
            "Special Issue In Memory of Misha Alekhnovich. Foreword.",
            "Obituary.",
            "Lower Bounds for k-DNF Resolution on Random 3-CNFs.",
            "Towards Strong Nonapproximability Results in the Lovász-Schrijver Hierarchy.",
            "Satisfiability, Branch-Width and Tseitin tautologies.",
            "Toward a Model for Backtracking and Dynamic Programming.",
            "Hardness of Approximating the Closest Vector Problem with Pre-Processing.",
            "More on Average Case vs Approximation Complexity."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2010",
        "info": "Volume 19, 2010",
        "count": 22,
        "papers": [
            "Counting Irreducible Components of Complex Algebraic Varieties.",
            "Quadratic Lower Bound for Permanent Vs. Determinant in any Characteristic.",
            "Classifying Problems on Linear Congruences and Abelian Permutation Groups Using Logspace Counting Classes.",
            "On The Randomness Complexity of Property Testing.",
            "Communication Complexity Under Product and Nonproduct Distributions.",
            "Special Issue \"Conference on Computational Complexity 2009\" Guest Editor's Foreword.",
            "Lower Bounds on the Randomized Communication Complexity of Read-Once Functions.",
            "k-Subgraph Isomorphism on AC0 Circuits.",
            "A New Characterization of ACC0 and Probabilistic CC0.",
            "The Complexity of Boolean Functions in Different Characteristics.",
            "Are PCPs Inherent in Efficient Arguments?",
            "Lipschitz Continuous Ordinary Differential Equations are Polynomial-Space Complete.",
            "Interpolation of Shifted-Lacunary Polynomials.",
            "Efficiently Certifying Non-Integer Powers.",
            "Sub-Constant Error Probabilistically Checkable Proof of Almost-Linear Size.",
            "Space Hierarchy Results for Randomized and other Semantic Models.",
            "All Natural NP-Complete Problems Have Average-Case Complete Versions.",
            "Random Cnf's are Hard for the Polynomial Calculus.",
            "New Results on Noncommutative and Commutative Polynomial Identity Testing.",
            "The Complexity of the Inertia.",
            "Lower Bounds for Agnostic Learning via Approximate Rank.",
            "A Complexity Dichotomy For Hypergraph Partition Functions."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2009",
        "info": "Volume 18, 2009",
        "count": 21,
        "papers": [
            "Extractors And Rank Extractors For Polynomial Sources.",
            "The Black-Box Query Complexity of Polynomial Summation.",
            "On Defining Integers And Proving Arithmetic Circuit Lower Bounds.",
            "Robust Algorithms For Generalized Pham Systems.",
            "Nullstellensätze for Zero-Dimensional Gröbner Bases.",
            "Special Issue \"Conference on Computational Complexity 2008\" Guest Editors' Foreword.",
            "Lower Bounds and Separations for Constant Depth Multilinear Circuits.",
            "The Sum of D Small-Bias Generators Fools Polynomials of Degree D.",
            "Approximate Inclusion-Exclusion for Arbitrary Symmetric Functions.",
            "Approximation Resistant Predicates from Pairwise Independence.",
            "Using Entanglement in Quantum Multi-Prover Interactive Proofs.",
            "Disjointness is Hard in the Multiparty Number-on-the-Forehead Model.",
            "On Approximate Majority and Probabilistic Time.",
            "Upper Bounds for Monotone Planar Circuit Value and Variants.",
            "On the Approximation Resistance of a Random Predicate.",
            "Private Approximation of Clustering and Vertex Cover.",
            "Constructions of Low-degree and Error-Correcting epsilon-Biased Generators.",
            "Parallel Time and Quantifier Prefixes.",
            "VPSPACE and a Transfer Theorem over the Reals.",
            "Reduced Kronecker Coefficients and Counter-Examples to Mulmuley's Strong Saturation Conjecture SH.",
            "Space-Efficient Counting in Graphs on Surfaces."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2008",
        "info": "Volume 17, 2008",
        "count": 22,
        "papers": [
            "Preface to the Special Issue from Random'06.",
            "Randomness-Efficient Sampling within NC1.",
            "On Pseudorandom Generators with Linear Stretch in NC0.",
            "Space Complexity Vs. Query Complexity.",
            "Inverse NP Problems.",
            "Hardness Hypotheses, Derandomization, and Circuit Complexity.",
            "Special Issue: \"Conference on Computational Complexity 2007\" Guest Editor's Foreword.",
            "Halfspace Matrices.",
            "Time-Space Tradeoffs for Counting NP Solutions Modulo Integers.",
            "Exposure-Resilient Extractors and the Derandomization of Probabilistic Sublinear Time.",
            "Basis Collapse in Holographic Algorithms.",
            "Perfect Parallel Repetition Theorem for Quantum Xor Proof Systems.",
            "Limits on the Hardness of Lattice Problems in lp Norms.",
            "On the Complexity of Succinct Zero-Sum Games.",
            "Polynomials that Sign Represent Parity and Descartes' Rule of Signs.",
            "The Strength of Multilinear Proofs.",
            "Dimension Characterizations of Complexity Classes.",
            "Hardness Amplification via Space-Efficient Direct Products.",
            "2-Local Random Reductions to 3-Valued Functions.",
            "Balancing Syntactically Multilinear Arithmetic Circuits.",
            "Probabilistic Communication Complexity Over The Reals.",
            "Every 2-csp Allows Nontrivial Approximation."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2007",
        "info": "Volume 16, 2007",
        "count": 14,
        "papers": [
            "Communication vs. Computation.",
            "An Improved Analysis of Linear Mergers.",
            "The Complexity of Tensor Circuit Evaluation.",
            "Special Issue \"Conference on Computational Complexity 2006\" Guest Editors' Foreword.",
            "Polynomial Identity Testing for Depth 3 Circuits.",
            "A Generic Time Hierarchy with One Bit of Advice.",
            "Every Linear Threshold Function has a Low-Weight Approximator.",
            "The Complexity of Membership Problems for Circuits Over Sets of Natural Numbers.",
            "The Resolution Complexity of Independent Sets and Vertex Covers in Random Graphs.",
            "New Results on the Complexity of the Middle Bit of Multiplication.",
            "Special Issue On Worst-case Versus Average-case Complexity Editors' Foreword.",
            "Pseudorandomness and Average-Case Complexity Via Uniform Reductions.",
            "Generalized Compact Knapsacks, Cyclic Lattices, and Efficient One-Way Functions.",
            "If NP Languages are Hard on the Worst-Case, Then it is Easy to Find Their Hard Instances."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2006",
        "info": "Volume 15, 2006",
        "count": 18,
        "papers": [
            "Quantum computation of zeta functions of curves.",
            "On the complexity of approximating k-set packing.",
            "Free binary decision diagrams for the computation of EARn.",
            "Circuits on cylinders.",
            "A tight lower bound for restricted pir protocols.",
            "Special Issue \"Conference on Computational Complexity 2005\" Guest Editor's Foreword.",
            "On the Hardness of Approximating Multicut and Sparsest-Cut.",
            "Computationally Private Randomizing Polynomials and Their Applications.",
            "The Quantum Adversary Method and Classical Formula Size Lower Bounds.",
            "The complexity of semilinear problems in succinct representation.",
            "Efficient algorithm for computing the Euler-Poincaré characteristic of a semi-algebraic set defined by few quadratic inequalities.",
            "Polynomial multiplication over finite fields: from quadratic to straight-line complexity.",
            "Lower bounds for linear locally decodable codes and private information retrieval.",
            "Special Issue \"Conference on Computational Complexity 2005\" Guest Editor's Foreword.",
            "Pseudorandomness for Approximate Counting and Sampling.",
            "Complexity of Ring Morphism Problems.",
            "A Strong Direct Product Theorem for Corruption and the Multiparty Communication Complexity of Disjointness.",
            "Inductive Time-Space Lower Bounds for Sat and Related Problems."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2005",
        "info": "Volume 14, 2005/2006",
        "count": 16,
        "papers": [
            "Deterministic polynomial identity testing in non-commutative models.",
            "Polynomial-time computing over quadratic maps i: sampling in real algebraic sets.",
            "Computing the euler-poincaré characteristics of sign conditions.",
            "Neat function algebraic characterizations of logspace and linspace.",
            "Special issue \"Conference on Computational Complexity 2004\" Guest Editor's foreword.",
            "The complexity of the covering radius problem.",
            "Quantum Arthur-Merlin games.",
            "Parameterized complexity of constraint satisfaction problems.",
            "Special issue, final part \"Conference on Computational Complexity 2004 \" Guest Editor's foreword.",
            "Compression of Samplable Sources.",
            "Language compression and pseudorandom generators.",
            "Derandomizing Arthur-Merlin Games using Hitting Sets.",
            "On the complexity of approximating tsp with neighborhoods and related problems.",
            "The complexity of chromatic strength and chromatic edge strength.",
            "Languages to diagonalize against advice classes.",
            "On the computational power of Boolean decision lists."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2004",
        "info": "Volume 13, 2004/2005",
        "count": 6,
        "papers": [
            "Derandomizing Polynomial Identity Tests Means Proving Circuit Lower Bounds.",
            "Non-Automatizability of Bounded-Depth Frege Proofs.",
            "Recursion Schemata for Slowly Growing Depth Circuit Classes.",
            "On the complexity of computing determinants.",
            "Valiant's model and the cost of computing integers.",
            "The complexity of constructing pseudorandom generators from hard functions."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2003",
        "info": "Volume 12, 2003",
        "count": 7,
        "papers": [
            "Towards proving strong direct product theorems.",
            "Complexity of some arithmetic problems for binary polynomials.",
            "On the complexity of simulating space-bounded quantum computations.",
            "Uniform hardness versus randomness tradeoffs for Arthur-Merlin games.",
            "On the complexity of vertex-disjoint length-restricted path problems.",
            "Straight-line programs and torsion points on elliptic curves.",
            "Deterministic polynomial-time quantum algorithms for Simon's problem."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2002",
        "info": "Volume 11, 2002",
        "count": 6,
        "papers": [
            "On interactive proofs with a laconic prover.",
            "The complexity of tensor calculus.",
            "Homogenization and the polynomial calculus.",
            "Hard examples for the bounded depth Frege proof system.",
            "Separability and one-way functions.",
            "On the hardness of approximating the permanent of structured matrices."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2001",
        "info": "Volume 10, 2001",
        "count": 15,
        "papers": [
            "Depth-3 arithmetic circuits over fields of characteristic zero.",
            "Which bases admit non-trivial shrinkage of formulae?",
            "Fast computation of the Smith form of a sparse integer matrix.",
            "The \"log rank\" conjecture for modular communication complexity.",
            "Two oracles that force a big crunch.",
            "Reducing the complexity of reductions.",
            "Complexity of Positivstellensatz proofs for the knapsack.",
            "On the size of randomized OBDDs and read-once branching programs for k-stable functions.",
            "A complexity gap for tree resolution.",
            "Communication complexity towards lower bounds on circuit depth.",
            "Derandomizing Arthur-Merlin games under uniform assumptions.",
            "Optimality of size-width tradeoffs for resolution.",
            "A characterization of span program size and improved lower bounds for monotone span programs.",
            "Pseudorandom functions in TC0 and cryptographic limitations to proving lower bounds.",
            "Errata for: \"On randomized one-round communication complexity\"."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "2000",
        "info": "Volume 9, 2000",
        "count": 11,
        "papers": [
            "Exponential lower bounds for depth three Boolean circuits.",
            "A complex-number Fourier technique for lower bounds on the Mod-m degree.",
            "The average sensitivity of square-freeness.",
            "The complexity of counting colourings and independent sets in sparse graphs and hypergraphs.",
            "Lower bounds for the bilinear complexity of associative algebras.",
            "The BNS-Chung criterion for multi-party communication complexity.",
            "A compendium of problems complete for symmetric logarithmic space.",
            "On the relation between entropy and the average complexity of trajectories in dynamical systems.",
            "Small PCPs with low query complexity.",
            "Alternation in interaction.",
            "A separation of syntactic and nonsyntactic (1, +k)-branching programs."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1999",
        "info": "Volume 8, 1999",
        "count": 18,
        "papers": [
            "Symmetric Approximation Arguments for Monotone Lower Bounds Without Sunflowers.",
            "On Randomized One-Round Communication Complexity.",
            "Quantifying Knowledge Complexity.",
            "The Complexity of Matrix Rank and Feasible Systems of Linear Equations.",
            "Lower Bounds for the Polynomial Calculus and the Gröbner Basis Algorithm.",
            "Randomness Complexity of Private Computation.",
            "Adaptive Versus Nonadaptive Queries to NP and p-Selective Sets.",
            "Feasibly Continuous Type-Two Functionals.",
            "Lower bounds for the multiplicative complexity of matrix multiplication.",
            "Solvability of systems of polynomial congruences modulo a large prime.",
            "Lower bounds for modular counting by circuits with modular gates.",
            "On small space complexity classes of stochastic Turing machines and Arthur-Merlin-games.",
            "On lower bounds for the complexity of polynomials and their multiples.",
            "Complexity lower bounds for randomized computation trees over zero characteristic fields.",
            "Interactive protocols over the reals.",
            "Function algebraic characterizations of the polytime functions.",
            "On P versus NP cap co-NP for decision trees and read-once branching programs.",
            "Matching upper and lower bounds for simulations of several linear tapes on one multidimensional tape."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1998",
        "info": "Volume 7, 1998",
        "count": 16,
        "papers": [
            "Circuits and Multi-Party Protocols.",
            "Complexity Theoretic Hardness Results for Query Learning.",
            "Monadic Logical Definability of Nondeterministic Linear Time.",
            "A Lower Bound on the Mod 6 Degree of the Or Function.",
            "Some Bounds on Multiparty Communication Complexity of Pointer Jumping.",
            "Verifying the Determinant in Parallel.",
            "Symmetric Alternation Captures BPP.",
            "Sperner's Lemma and Robust Machines.",
            "On Coherence, Random-Self-Reducibility, and Self-Correction.",
            "An exponential lower bound on the size of algebraic decision trees for Max.",
            "A quantifier elimination for the theory of p-adic numbers.",
            "Probabilistic Type-2 Operators and \"Almost\"-Classes.",
            "Lower Bounds for the Polynomial Calculus.",
            "Improved Depth Lower Bounds for Small Distance Connectivity.",
            "Computing Boolean Functions by Polynomials and Threshold Circuits.",
            "Automaticity III: Polynomial Automaticity and Context-Free Languages."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1996",
        "info": "Volume 6, 1996/1997",
        "count": 20,
        "papers": [
            "Undirected s-t Connectivity in Polynomial Time and Sublinear Space.",
            "Lower Bounds for Monotone Span Programs.",
            "Using Amplification to Compute Majority with Small Majority Gates.",
            "Counting Curves and Their Projections.",
            "On the Hardness of Computing the Permanent of Random Matrices.",
            "An Average Complexity Measure that Yields Tight Hierarchies.",
            "Simple Learning Algorithms Using Divide and Conquer.",
            "Tribute to Roman Smolensky.",
            "Representations of Sets of Boolean Functions by Commutative Rings.",
            "Reflections on \"Representations of Sets of Boolean Functions by Commutative Rings\" by Roman Smolensky.",
            "Easy Lower Bound for a Strange Computational Model.",
            "Lower Bounds on Arithmetic Circuits Via Partial Derivatives.",
            "Upper and Lower Bounds for Some Depth-3 Circuit Classes.",
            "Proof Complexity in Algebraic Systems and Bounded Depth Frege Systems with Modular Counting.",
            "Well-Known Bound for the VC-Dimension Made Easy.",
            "Lower Bounds for Polynomial Evaluation and Interpolation Problems.",
            "The Electrical Resistance of a Graph Captures its Commute and Cover Times.",
            "Collecting Coupons on Trees, and the Cover Time of Random Walks.",
            "A Lower Bound for Randomized Algebraic Decision Trees.",
            "Randomization and the Computational Power of Analytic and Algebraic Decision Trees."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1995",
        "info": "Volume 5, 1995",
        "count": 16,
        "papers": [
            "On-line Learning of Linear Functions.",
            "On the Complexity of Planar Boolean Circuits.",
            "The Privacy of Dense Symmetric Functions.",
            "Derandomized Graph Products.",
            "The Computational Complexity of Recognizing Permutation Functions.",
            "Top-Down Lower Bounds for Depth-Three Circuits.",
            "Retrieval of Scattered Information by EREW, CREW, and CRCW PRAMs.",
            "PIk Mass Production and an Optimal Circuit for the Neciporuk Slice.",
            "A Note on Logspace Optimization.",
            "Evaluating Spectral Norms for Constant Depth Circuits with Symmetric Gates.",
            "Super-Logarithmic Depth Lower Bounds Via the Direct Sum in Communication Complexity.",
            "Fourier Analysis for Probabilistic Communication Complexity.",
            "How can a Complex Square Root be Computed in an Optimal Way.",
            "On the Oracle Complexity of Factoring Integers.",
            "Pseudorandom Generators and Learning Algorithms for AC^0.",
            "Weakly Complete Problems are not Rare."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1994",
        "info": "Volume 4, 1994",
        "count": 20,
        "papers": [
            "RL <= SC.",
            "A Note on Rabin's Width of a Complete Proof.",
            "An Algorithm to Learn Read-Once Threshold Formulas, and Transformations Between Learning Models.",
            "Invariance Properties of Rams and Linear Time.",
            "Finding Irreducible Components of Some Real Transcendental Varieties.",
            "The Hardness of Approximation: Gap Location.",
            "The Power of Adaptiveness and Additional Queries in Random-Self-Reductions.",
            "Function-Algebraic Characterizations of Log and Polylog Parallel Time.",
            "On the Complexity of Computing the Diameter of a Polytope.",
            "A Theory of Strict P-Completeness.",
            "On Closure Properties of GapP.",
            "Space-Efficient Recognition of Sparse Self-Reducible Languages.",
            "Special Issue on Circuit Complexity: Foreword.",
            "On the Degree of Boolean Functions as Real Polynomials.",
            "When do Extra Majority Gates Help? Polylog(N) Majority Gates Are Equivalent to One.",
            "Complex Polynomials and Circuit Lower Bounds for Modular Counting.",
            "Perceptrons, PP, and the Polynomial Hierarchy.",
            "On ACC.",
            "Representing Boolean Functions as Polynomials Modulo Composite Numbers.",
            "Circuits Constructed with Mod_q Gates Cannot Compute \"And\" in Sublinear Size."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1993",
        "info": "Volume 3, 1993",
        "count": 18,
        "papers": [
            "On Lower Bounds for Read-K-Times Branching Programs.",
            "Parallel Pointer Machines.",
            "(Working Group Noaï Fitchas) Algorithmic Aspects of Suslin's Proof of Serre's Conjecture.",
            "On the Efficiency of Effective Nullstellensätze.",
            "Exponential Lower Bounds for the Pigeonhole Principle.",
            "Bounds on Tradeoffs Between Randomness and Communication Complexity.",
            "Improving Known Solutions is Hard.",
            "Relativized Isomorphisms of NP-Complete Sets.",
            "The Alternation Hierarchy for Sublogarithmic Space is Infinite.",
            "The Relative Power of Logspace and Polynomial Time Reductions.",
            "Finding Maximal Orders in Semisimple Algebras Over Q.",
            "Shallow Circuits and Concise Formulae for Multiple Addition and Multiplication.",
            "The Complexity of the Max Word Problem and the Power of One-Way Interactive Proof Systems.",
            "BPP Has Subexponential Time Simulations Unless EXPTIME has Publishable Proofs.",
            "Randomness in Interactive Proofs.",
            "Primality Testing with Fewer Random Bits.",
            "The Complexity of Computing Maximal Word Functions.",
            "Two Tapes Versus One for Off-Line Turing Machines."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1992",
        "info": "Volume 2, 1992",
        "count": 17,
        "papers": [
            "On Being Incoherent Without Being Very Hard.",
            "Polynomial-Time Compression.",
            "The Quantifier Structure of Sentences That Characterize Nondeterministic Time Complexity.",
            "Efficient Randomized Generation of Optimal Algorithms for Multiplication in Certain Finite Fields.",
            "A New Recursion-Theoretic Characterization of the Polytime Functions.",
            "Improved Low-Density Subset Sum Algorithms.",
            "A Deterministic Test for Permutation Polynomials.",
            "Counting Connected Components of a Semialgebraic Set in Subexponential Time.",
            "Computing Frobenius Maps and Factoring Polynomials.",
            "Algorithmic Properties of Maximal Orders in Simple Algebras over Q.",
            "Fast Exponentiation Using the Truncation Operation.",
            "Selection Problems via M-Ary Queries.",
            "Majority Gates VS. General Weighted Threshold Gates.",
            "Graph Isomorphism is Low for PP.",
            "Cartesian Graph Factorization at Logarithmic Cost per Edge.",
            "Randomized Range-Maxima in Nearly-Constant Parallel Time.",
            "Addendum to Non-Deterministic Exponential Time has Two-Prover Interactive Protocols."
        ]
    },
    {
        "name": "Computational complexity",
        "year": "1991",
        "info": "Volume 1, 1991",
        "count": 15,
        "papers": [
            "Non-Deterministic Exponential Time has Two-Prover Interactive Protocols.",
            "Arithmetization: A New Method in Structural Complexity Theory.",
            "On the Decidability of Sparse Univariate Polynomial Interpolation.",
            "Towards Optimal Simulations of Formulas by Bounded-Width Programs.",
            "On the Power of Small-Depth Threshold Circuits.",
            "Some Computational Problems in Linear Algebra as Hard as Matrix Multiplication.",
            "On the Rank of Certain Finite Fields.",
            "Decomposition of Algebras Over Finite Fields and Number Fields.",
            "Decompositions of Algebras Over R and C.",
            "Existence and Efficient Construction of Fast Fourier Transforms on Supersolvable Groups.",
            "Lower Bounds for the Non-Linear Complexity of Algebraic Computation Trees with Integer Inputs.",
            "Three Sigma^p_2-Complete Problems in Computational Learning Theory.",
            "Randomized VS. Deterministic Decision Tree Complexity for Read-Once Boolean Functions.",
            "NC¹: The Automata-Theoretic Viewpoint.",
            "Efficient and Optimal Exponentiation in Finite Fields."
        ]
    }
]