[
    {
        "year": "2021",
        "name": "32nd CONCUR 2021",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2021",
                "sub_name": "32nd International Conference on Concurrency Theory, CONCUR 2021, August 24-27, 2021, Virtual Conference.",
                "count": 37,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "CONCUR Test-Of-Time Award 2021 (Invited Paper).",
                    "Reducing (To) the Ranks: Efficient Rank-Based Büchi Automata Complementation.",
                    "Inclusion Testing of Büchi Automata Based on Well-Quasiorders.",
                    "Nominal Büchi Automata with Name Allocation.",
                    "Enforcing ω-Regular Properties in Markov Chains by Restarting.",
                    "Linear-Time Model Checking Branching Processes.",
                    "Quantified Linear Temporal Logic over Probabilistic Systems with an Application to Vacuity Checking.",
                    "Subgame-Perfect Equilibria in Mean-Payoff Games.",
                    "Fragility and Robustness in Mean-Payoff Adversarial Stackelberg Games.",
                    "Continuous Positional Payoffs.",
                    "Transience in Countable MDPs.",
                    "Strategy Complexity of Mean Payoff, Total Payoff and Point Payoff Objectives in Countable MDPs.",
                    "Model Checking Quantum Continuous-Time Markov Chains.",
                    "A Unifying Framework for Deciding Synchronizability.",
                    "Guard Automata for the Verification of Safety and Liveness of Distributed Algorithms.",
                    "Dynamic Data-Race Detection Through the Fine-Grained Lens.",
                    "Adaptive Synchronisation of Pushdown Automata.",
                    "Decomposing Permutation Automata.",
                    "Algebra and Coalgebra of Stream Products.",
                    "Formally Verified Simulations of State-Rich Processes Using Interaction Trees in Isabelle/HOL.",
                    "Fibrational Initial Algebra-Final Coalgebra Coincidence over Initial Algebras: Turning Verification Witnesses Upside Down.",
                    "SMT-Based Model Checking of Max-Plus Linear Systems.",
                    "A Decidable Non-Regular Modal Fixpoint Logic.",
                    "A Temporal Logic for Strategic Hyperproperties.",
                    "Time Flies When Looking out of the Window: Timed Games with Window Parity Objectives.",
                    "Arena-Independent Finite-Memory Determinacy in Stochastic Games.",
                    "Stackelberg-Pareto Synthesis.",
                    "The Orbit Problem for Parametric Linear Dynamical Systems.",
                    "Scope-Bounded Reachability in Valence Systems.",
                    "Deciding Polynomial Termination Complexity for VASS Programs.",
                    "Bisimulation by Partitioning Is Ω((m+n)log n).",
                    "Explaining Behavioural Inequivalence Generically in Quasilinear Time.",
                    "Enabling Preserving Bisimulation Equivalence.",
                    "Sized Types with Usages for Parallel Complexity of Pi-Calculus Processes.",
                    "Generalising Projection in Asynchronous Multiparty Session Types.",
                    "Separating Sessions Smoothly."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st CONCUR 2020",
        "info": "Vienna, Austria (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2020",
                "sub_name": "31st International Conference on Concurrency Theory, CONCUR 2020, September 1-4, 2020, Vienna, Austria (Virtual Conference).",
                "count": 51,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "On Privacy and Accuracy in Data Releases (Invited Paper).",
                    "A Survey of Bidding Games on Graphs (Invited Paper).",
                    "Safe Reinforcement Learning Using Probabilistic Shields (Invited Paper).",
                    "Modern Applications of Game-Theoretic Principles (Invited Paper).",
                    "CONCUR Test-Of-Time Award 2020 Announcement (Invited Paper).",
                    "Reactive Bisimulation Semantics for a Process Algebra with Time-Outs.",
                    "How Reversibility Can Solve Traditional Questions: The Example of Hereditary History-Preserving Bisimulation.",
                    "A Near-Linear-Time Algorithm for Weak Bisimilarity on Markov Chains.",
                    "Characterizing Consensus in the Heard-Of Model.",
                    "A Classification of Weak Asynchronous Models of Distributed Computing.",
                    "Scalable Termination Detection for Distributed Actor Systems.",
                    "Session Subtyping and Multiparty Compatibility Using Circular Sequents.",
                    "Session Types with Arithmetic Refinements.",
                    "Probabilistic Analysis of Binary Sessions.",
                    "On Ranking Function Synthesis and Termination for Polynomial Programs.",
                    "On the Separability Problem of String Constraints.",
                    "Weighted Transducers for Robustness Verification.",
                    "On the Axiomatisability of Parallel Composition: A Journey in the Spectrum.",
                    "Wreath/Cascade Products and Related Decomposition Results for the Concurrent Setting of Mazurkiewicz Traces.",
                    "Partially Observable Concurrent Kleene Algebra.",
                    "Model-Free Reinforcement Learning for Stochastic Parity Games.",
                    "Decidability of Cutpoint Isolation for Probabilistic Finite Automata on Letter-Bounded Inputs.",
                    "Multi-Dimensional Long-Run Average Problems for Vector Addition Systems with States.",
                    "Games Where You Can Play Optimally with Arena-Independent Finite Memory.",
                    "Abstraction, Up-To Techniques and Games for Systems of Fixpoint Equations.",
                    "Reaching Your Goal Optimally by Playing at Random with No Memory.",
                    "Characteristic Logics for Behavioural Metrics via Fuzzy Lax Extensions.",
                    "Monads and Quantitative Equational Theories for Nondeterminism and Probability.",
                    "Non Axiomatisability of Positive Relation Algebras with Constants, via Graph Homomorphisms.",
                    "Decidability and Synthesis of Abstract Inductive Invariants.",
                    "Decidable Inductive Invariants for Verification of Cryptographic Protocols with Unbounded Sessions.",
                    "Algebraic Invariants for Linear Hybrid Automata.",
                    "A General Approach to Derive Uncontrolled Reversible Semantics.",
                    "On the Representation of References in the Pi-Calculus.",
                    "Canonical Solutions to Recursive Equations and Completeness of Equational Axiomatisations.",
                    "Universality Problem for Unambiguous VASS.",
                    "Reachability in Two-Dimensional Vector Addition Systems with States: One Test Is for Free.",
                    "Coverability in 1-VASS with Disequality Tests.",
                    "Strategy Complexity of Parity Objectives in Countable MDPs.",
                    "Monte Carlo Tree Search Guided by Symbolic Advice for MDPs.",
                    "The Big-O Problem for Labelled Markov Chains and Weighted Automata.",
                    "Determinisability of One-Clock Timed Automata.",
                    "Synthesis of Computable Regular Functions of Infinite Words.",
                    "Residual Nominal Automata.",
                    "Flatness and Complexity of Immediate Observation Petri Nets.",
                    "Deciding the Existence of Cut-Off in Parameterized Rendez-Vous Networks.",
                    "Parametrized Universality Problems for One-Counter Nets.",
                    "Reachability in Fixed Dimension Vector Addition Systems with States.",
                    "Bounded Reachability Problems Are Decidable in FIFO Machines.",
                    "Propositional Dynamic Logic for Hyperproperties."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th CONCUR 2019",
        "info": "Amsterdam, the Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2019",
                "sub_name": "30th International Conference on Concurrency Theory, CONCUR 2019, August 27-30, 2019, Amsterdam, the Netherlands.",
                "count": 42,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Safety Verification for Deep Neural Networks with Provable Guarantees (Invited Paper).",
                    "Synthesis of Safe, Optimal and Compact Strategies for Stochastic Hybrid Games (Invited Paper).",
                    "Program Invariants (Invited Talk).",
                    "Concurrent Algorithms and Data Structures for Model Checking (Invited Talk).",
                    "Of Cores: A Partial-Exploration Framework for Markov Decision Processes.",
                    "Combinations of Qualitative Winning for Stochastic Parity Games.",
                    "Near-Linear Time Algorithms for Streett Objectives in Graphs and MDPs.",
                    "Life Is Random, Time Is Not: Markov Decision Processes with Window Objectives.",
                    "Computing Probabilistic Bisimilarity Distances for Probabilistic Automata.",
                    "Asymmetric Distances for Approximate Differential Privacy.",
                    "Event Structures for Mixed Choice.",
                    "Verification of Flat FIFO Systems.",
                    "The Complexity of Subgame Perfect Equilibria in Quantitative Reachability Games.",
                    "On the Complexity of Reachability in Parametric Markov Decision Processes.",
                    "Timed Basic Parallel Processes.",
                    "Revisiting Local Time Semantics for Networks of Timed Automata.",
                    "Approximate Learning of Limit-Average Automata.",
                    "Alternating Weak Automata from Universal Trees.",
                    "Good for Games Automata: From Nondeterminism to Alternation.",
                    "Determinacy in Discrete-Bidding Infinite-Duration Games.",
                    "Energy Mean-Payoff Games.",
                    "Equilibrium Design for Concurrent Games.",
                    "Partial Order Reduction for Reachability Games.",
                    "Synthesis of Data Word Transducers.",
                    "Register-Bounded Synthesis.",
                    "Translating Asynchronous Games for Distributed Synthesis.",
                    "Long-Run Average Behavior of Vector Addition Systems with States.",
                    "Reachability for Bounded Branching VASS.",
                    "Reasoning About Distributed Knowledge of Groups with Infinitely Many Agents.",
                    "Robustness Against Transactional Causal Consistency.",
                    "Expressive Power of Broadcast Consensus Protocols.",
                    "Reconfiguration and Message Losses in Parameterized Broadcast Networks.",
                    "Verification of Randomized Consensus Algorithms Under Round-Rigid Adversaries.",
                    "A Sound Foundation for the Topological Approach to Task Solvability.",
                    "Game-Based Local Model Checking for the Coalgebraic mu-Calculus.",
                    "Graded Monads and Graded Logics for the Linear Time - Branching Time Spectrum.",
                    "Bialgebraic Semantics for String Diagrams.",
                    "A Sound Algorithm for Asynchronous Session Subtyping.",
                    "Domain-Aware Session Types.",
                    "Reordering Derivatives of Trace Closures of Regular Languages.",
                    "Kleene Algebra with Observations."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th CONCUR 2018",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2018",
                "sub_name": "29th International Conference on Concurrency Theory, CONCUR 2018, September 4-7, 2018, Beijing, China.",
                "count": 43,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "The Siren Song of Temporal Synthesis (Invited Talk).",
                    "Bisimulations for Probabilistic and Quantum Processes (Invited Paper).",
                    "Is Speed-Independent Mutual Exclusion Implementable? (Invited Talk).",
                    "Verifying Arithmetic Assembly Programs in Cryptographic Primitives (Invited Talk).",
                    "Coalgebraic Theory of Büchi and Parity Automata: Fixed-Point Specifications, Categorically (Invited Tutorial).",
                    "Universal Safety for Timed Petri Nets is PSPACE-complete.",
                    "It Is Easy to Be Wise After the Event: Communicating Finite-State Machines Capture First-Order Logic with \"Happened Before\".",
                    "Learning-Based Mean-Payoff Optimization in an Unknown MDP under Omega-Regular Constraints.",
                    "Deciding Probabilistic Bisimilarity Distance One for Probabilistic Automata.",
                    "Non-deterministic Weighted Automata on Random Words.",
                    "Ergodic Mean-Payoff Games for the Analysis of Attacks in Crypto-Currencies.",
                    "Bounded Context Switching for Valence Systems.",
                    "Alternating Nonzero Automata.",
                    "Affine Extensions of Integer Vector Addition Systems with States.",
                    "Verifying Quantitative Temporal Properties of Procedural Programs.",
                    "Narrowing down the Hardness Barrier of Synthesizing Elementary Net Systems.",
                    "Up-To Techniques for Behavioural Metrics via Fibrations.",
                    "Completeness for Identity-free Kleene Lattices.",
                    "Reachability in Parameterized Systems: All Flavors of Threshold Automata.",
                    "Selective Monitoring.",
                    "Synchronizing the Asynchronous.",
                    "A Semantics for Hybrid Iteration.",
                    "GPU Schedulers: How Fair Is Fair Enough?.",
                    "Linear Equations with Ordered Data.",
                    "A Coalgebraic Take on Regular and omega-Regular Behaviour for Systems with Internal Moves.",
                    "Relating Syntactic and Semantic Perturbations of Hybrid Automata.",
                    "Updating Probabilistic Knowledge on Condition/Event Nets using Bayesian Networks.",
                    "Reachability in Timed Automata with Diagonal Constraints.",
                    "Parameterized complexity of games with monotonically ordered omega-regular objectives.",
                    "A Universal Session Type for Untyped Asynchronous Communication.",
                    "Verification of Immediate Observation Population Protocols.",
                    "The Satisfiability Problem for Unbounded Fragments of Probabilistic CTL.",
                    "Automatic Analysis of Expected Termination Time for Population Protocols.",
                    "On Runtime Enforcement via Suppressions.",
                    "Regular Separability of Well-Structured Transition Systems.",
                    "Separable GPL: Decidable Model Checking with More Non-Determinism.",
                    "(Metric) Bisimulation Games and Real-Valued Modal Logics for Coalgebras.",
                    "The Complexity of Rational Synthesis for Concurrent Games.",
                    "Logics Meet 1-Clock Alternating Timed Automata.",
                    "Progress-Preserving Refinements of CTA.",
                    "Automated Detection of Serializability Violations Under Weak Consistency.",
                    "Effective Divergence Analysis for Linear Recurrence Sequences."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28th CONCUR 2017",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2017",
                "sub_name": "28th International Conference on Concurrency Theory, CONCUR 2017, September 5-8, 2017, Berlin, Germany.",
                "count": 41,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Forward Progress on GPU Concurrency (Invited Talk).",
                    "Admissibility in Games with Imperfect Information (Invited Talk).",
                    "Probabilistic Programming (Invited Talk).",
                    "A New Notion of Compositionality for Concurrent Program Proofs (Invited Talk).",
                    "Bidirectional Nested Weighted Automata.",
                    "k-Bounded Petri Net Synthesis from Modal Transition Systems.",
                    "A Characterisation of Open Bisimilarity using an Intuitionistic Modal Logic.",
                    "Consistently-Detecting Monitors.",
                    "Flow Logic.",
                    "Rule Formats for Nominal Process Calculi.",
                    "Divergence and Unique Solution of Equations.",
                    "Controlling a Population.",
                    "The Robot Routing Problem for Collecting Aggregate Stochastic Rewards.",
                    "Coverability Synthesis in Parametric Petri Nets.",
                    "Divide and Congruence III: Stability & Divergence.",
                    "Checking Linearizability of Concurrent Priority Queues.",
                    "Nash Equilibrium and Bisimulation Invariance.",
                    "Goal-Driven Unfolding of Petri Nets.",
                    "Probabilistic Automata of Bounded Ambiguity.",
                    "Two Lower Bounds for BPA.",
                    "Infinite-Duration Bidding Games.",
                    "On the Power of Name-Passing Communication.",
                    "The Power of Convex Algebras.",
                    "Refinement for Signal Flow Graphs.",
                    "Brzozowski Goes Concurrent - A Kleene Theorem for Pomset Languages.",
                    "Algebraic Laws for Weak Consistency.",
                    "Algorithms to Compute Probabilistic Bisimilarity Distances for Labelled Markov Chains.",
                    "On Decidability of Concurrent Kleene Algebra.",
                    "Model-Checking Counting Temporal Logics on Flat Structures.",
                    "Concurrent Reversible Sessions.",
                    "Unbounded Product-Form Petri Nets.",
                    "Efficient Coalgebraic Partition Refinement.",
                    "The Complexity of Flat Freeze LTL.",
                    "Higher-Order Linearisability.",
                    "Model Checking Omega-regular Properties for Quantum Markov Chains .",
                    "Uniform Sampling for Networks of Automata.",
                    "Tractability of Separation Logic with Inductive Definitions: Beyond Lists.",
                    "Data Multi-Pushdown Automata.",
                    "Towards an Efficient Tree Automata Based Technique for Timed Systems.",
                    "On Petri Nets with Hierarchical Special Arcs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27th CONCUR 2016",
        "info": "Québec City, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2016",
                "sub_name": "27th International Conference on Concurrency Theory, CONCUR 2016, August 23-26, 2016, Québec City, Canada.",
                "count": 38,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization .",
                    "Bayesian Inversion by ω-Complete Cone Duality.",
                    "Ethical Preference-Based Decision Support Systems.",
                    "Consistency in 3D.",
                    "Love Thy Neighbor: V-Formation as a Problem of Model Predictive Control.",
                    "The Benefits of Duality in Verifying Concurrent Programs under TSO.",
                    "Local Linearizability for Concurrent Container-Type Data Structures.",
                    "Robustness against Consistency Models with Atomic Visibility.",
                    "Optimal Assumptions for Synthesis.",
                    "Minimizing Expected Cost Under Hard Boolean Constraints, with Applications to Quantitative Synthesis.",
                    "Stability in Graphs and Games.",
                    "On the Complexity of Heterogeneous Multidimensional Games.",
                    "Soundness in Negotiations.",
                    "Deciding Hyperproperties.",
                    "Homogeneous Equations of Algebraic Petri Nets.",
                    "Bounded Petri Net Synthesis from Modal Transition Systems is Undecidable.",
                    "Decentralized Asynchronous Crash-Resilient Runtime Verification.",
                    "Lazy Reachability Analysis in Distributed Systems.",
                    "Causally Consistent Dynamic Slicing.",
                    "Topological Self-Stabilization with Name-Passing Process Calculi.",
                    "Linear Distances between Markov Chains.",
                    "Complete Axiomatization for the Bisimilarity Distance on Markov Chains.",
                    "Computing Probabilistic Bisimilarity Distances via Policy Iteration.",
                    "Robustly Parameterised Higher-Order Probabilistic Models.",
                    "Coalgebraic Trace Semantics for Buechi and Parity Automata.",
                    "Bisimulations and Unfolding in P-Accessible Categorical Models.",
                    "A Uniform Framework for Timed Automata.",
                    "Analyzing Timed Systems Using Tree Automata.",
                    "On the Expressiveness of QCTL.",
                    "Model Checking Flat Freeze LTL on One-Counter Automata.",
                    "Parameterized Systems in BIP: Design and Model Checking.",
                    "Private Names in Non-Commutative Logic.",
                    "Causality vs. Interleavings in Concurrent Game Semantics.",
                    "Coherence Generalises Duality: A Logical Explanation of Multiparty Session Types.",
                    "Global Caching for the Alternation-free μ-Calculus.",
                    "Up-To Techniques for Generalized Bisimulation Metrics.",
                    "Modal Decomposition on Nondeterministic Probabilistic Processes.",
                    "Diagnosis in Infinite-State Probabilistic Systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26th CONCUR 2015",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2015",
                "sub_name": "26th International Conference on Concurrency Theory, CONCUR 2015, Madrid, Spain, September 1.4, 2015.",
                "count": 39,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Committees, External Reviewers.",
                    "Automatic Application Deployment in the Cloud: from Practice to Theory and Back (Invited Paper).",
                    "Reachability Problems for Continuous Linear Dynamical Systems (Invited Paper).",
                    "Notions of Conformance Testing for Cyber-Physical Systems: Overview and Roadmap (Invited Paper).",
                    "Behavioural Equivalences for Co-operating Transactions (Invited Paper).",
                    "Applications of Automata and Concurrency Theory in Networks (Invited Paper).",
                    "Distributed Local Strategies in Broadcast Networks.",
                    "A Framework for Transactional Consistency Models with Atomic Visibility.",
                    "Safety of Parametrized Asynchronous Shared-Memory Systems is Almost Always Decidable.",
                    "On the Succinctness of Idioms for Concurrent Programming.",
                    "Assume-Admissible Synthesis.",
                    "Reactive Synthesis Without Regret.",
                    "Synthesis of Bounded Choice-Free Petri Nets.",
                    "Polynomial Time Decidability of Weighted Synchronization under Partial Observability.",
                    "SOS Specifications of Probabilistic Systems by Uniformly Continuous Operators.",
                    "Dynamic Bayesian Networks as Formal Abstractions of Structured Stochastic Processes.",
                    "On Frequency LTL in Probabilistic Systems.",
                    "Modal Logics for Nominal Transition Systems.",
                    "Howe's Method for Contextual Semantics.",
                    "Forward and Backward Bisimulations for Chemical Reaction Networks.",
                    "Lax Bialgebras and Up-To Techniques for Weak Bisimulations.",
                    "On the Satisfiability of Indexed Linear Temporal Logics.",
                    "Expresiveness and Complexity Results for Strategic Reasoning.",
                    "Meeting Deadlines Together.",
                    "To Reach or not to Reach? Efficient Algorithms for Total-Payoff Games.",
                    "On the Value Problem in Weighted Timed Games.",
                    "Repairing Multi-Player Games.",
                    "An Automata-Theoretic Approach to the Verification of Distributed Algorithms.",
                    "Lazy Probabilistic Model Checking without Determinisation.",
                    "A Modular Approach for Büchi Determinization.",
                    "On Reachability Analysis of Pushdown Systems with Transductions: Application to Boolean Programs with Call-by-Reference.",
                    "Characteristic Bisimulation for Higher-Order Session Processes.",
                    "Multiparty Session Types as Coherence Proofs.",
                    "On Coinduction and Quantum Lambda Calculi.",
                    "Toward Automatic Verification of Quantum Cryptographic Protocols.",
                    "Unfolding-based Partial Order Reduction.",
                    "Verification of Population Protocols.",
                    "Rely/Guarantee Reasoning for Asynchronous Programs.",
                    "Partial Order Reduction for Security Protocols."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25th CONCUR 2014",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2014",
                "sub_name": "CONCUR 2014 - Concurrency Theory - 25th International Conference, CONCUR 2014, Rome, Italy, September 2-5, 2014. Proceedings.",
                "count": 39,
                "papers": [
                    "Laws of Programming: The Algebraic Unification of Theories of Concurrency.",
                    "The Benefits of Sometimes Not Being Discrete.",
                    "Deterministic Negotiations: Concurrency for Free.",
                    "Generalized Bisimulation Metrics.",
                    "Choreographies, Logically.",
                    "Deadlock Analysis of Unbounded Process Networks.",
                    "Trees from Functions as Processes.",
                    "Bisimulations Up-to: Beyond First-Order Transition Systems.",
                    "Parameterized Model Checking of Rendezvous Systems.",
                    "On the Completeness of Bounded Model Checking for Threshold-Based Distributed Algorithms: Reachability.",
                    "Lost in Abstraction: Monotonicity in Multi-threaded Programs.",
                    "Synthesis from Component Libraries with Costs.",
                    "Compositional Controller Synthesis for Stochastic Games.",
                    "Synchronizing Strategies under Partial Observability.",
                    "Probabilistic Robust Timed Games.",
                    "Perturbation Analysis in Verification of Discrete-Time Markov Chains.",
                    "Robust Synchronization in Markov Decision Processes.",
                    "Probabilistic Bisimulation: Naturally on Distributions.",
                    "Averaging in LTL.",
                    "Decidable Topologies for Communicating Automata with FIFO and Bag Channels.",
                    "Controllers for the Verification of Communicating Multi-pushdown Systems.",
                    "Pairwise Reachability Analysis for Higher Order Concurrent Programs by Higher-Order Model Checking.",
                    "A Linear-Time Algorithm for the Orbit Problem over Cyclic Groups.",
                    "A Nearly Optimal Upper Bound for the Self-Stabilization Time in Herman's Algorithm.",
                    "Bounds on Mobility.",
                    "Typing Messages for Free in Security Protocols: The Case of Equivalence Properties.",
                    "Using Higher-Order Contracts to Model Session Types (Extended Abstract).",
                    "A Semantic Deconstruction of Session Types.",
                    "Timed Multiparty Session Types.",
                    "A Categorical Semantics of Signal Flow Graphs.",
                    "Generic Forward and Backward Simulations III: Quantitative Simulations by Matrices.",
                    "A General Framework for Well-Structured Graph Transformation Systems.",
                    "(Un)decidable Problems about Reachability of Quantum Systems.",
                    "Ordered Navigation on Multi-attributed Data Words.",
                    "Verification for Timed Automata Extended with Unbounded Discrete Data Structures.",
                    "Reducing Clocks in Timed Automata while Preserving Bisimulation.",
                    "Qualitative Concurrent Parity Games: Bounded Rationality.",
                    "Adding Negative Prices to Priced Timed Games.",
                    "Tight Game Abstractions of Probabilistic Automata."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th CONCUR 2013",
        "info": "Buenos Aires, Argentina",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2013",
                "sub_name": "CONCUR 2013 - Concurrency Theory - 24th International Conference, CONCUR 2013, Buenos Aires, Argentina, August 27-30, 2013. Proceedings.",
                "count": 38,
                "papers": [
                    "Reasoning with MAD Distributed Systems.",
                    "The Power of Well-Structured Systems.",
                    "Impact of Resource Sharing on Performance and Performance Prediction: A Survey.",
                    "Concurrency Meets Probability: Theory and Practice - (Abstract).",
                    "Modular Semantics for Transition System Specifications with Negative Premises.",
                    "Mutually Testing Processes - (Extended Abstract).",
                    "Hennessy-Milner Logic with Greatest Fixed Points as a Complete Behavioural Specification Theory.",
                    "Merging Partial Behaviour Models with Different Vocabularies.",
                    "Solving Parity Games on Integer Vectors.",
                    "Well-Structured Pushdown Systems.",
                    "A Relational Trace Logic for Vector Addition Systems with Application to Context-Freeness.",
                    "Expand, Enlarge, and Check for Branching Vector Addition Systems.",
                    "Symbolic Bisimulation for a Higher-Order Distributed Language with Passivation - (Extended Abstract).",
                    "A Theory of Name Boundedness.",
                    "A Hierarchy of Expressiveness in Concurrent Interaction Nets.",
                    "An Epistemic Perspective on Consistency of Concurrent Computations.",
                    "Characterizing Progress Properties of Concurrent Objects via Contextual Refinements.",
                    "Aspect-Oriented Linearizability Proofs.",
                    "Causality-Based Verification of Multi-threaded Programs.",
                    "From Model Checking to Model Measuring.",
                    "Safety Verification of Asynchronous Pushdown Systems with Shaped Stacks.",
                    "Reversibility and Asymmetric Conflict in Event Structures.",
                    "The Power of Priority Channel Systems.",
                    "Reachability Probabilities of Quantum Markov Chains.",
                    "Cost Preserving Bisimulations for Probabilistic Automata.",
                    "Compositional Verification and Optimization of Interactive Markov Chains.",
                    "Thermodynamic Graph-Rewriting.",
                    "Globally Governed Session Semantics.",
                    "A General Proof System for Modalities in Concurrent Constraint Programming.",
                    "Compositional Choreographies.",
                    "On Negotiation as Concurrency Primitive.",
                    "Satisfiability of CTL* with Constraints.",
                    "Proof Graphs for Parameterised Boolean Equation Systems.",
                    "Generalizing Simulation to Abstract Domains.",
                    "Hyperplane Separation Technique for Multidimensional Mean-Payoff Games.",
                    "Borel Determinacy of Concurrent Games.",
                    "A Faster Algorithm for Solving One-Clock Priced Timed Games.",
                    "Robust Controller Synthesis in Timed Automata."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "23rd CONCUR 2012",
        "info": "Newcastle upon Tyne, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2012",
                "sub_name": "CONCUR 2012 - Concurrency Theory - 23rd International Conference, CONCUR 2012, Newcastle upon Tyne, UK, September 4-7, 2012. Proceedings.",
                "count": 39,
                "papers": [
                    "Turing Meets Milner.",
                    "Concurrency and the Algebraic Theory of Effects - (Abstract).",
                    "A Turing Enigma.",
                    "False Concurrency and Strange-but-True Machines - (Abstract).",
                    "Concurrent Games on VASS with Inhibition.",
                    "Reachability Problem for Weak Multi-Pushdown Automata.",
                    "Reachability and Termination Analysis of Concurrent Quantum Programs.",
                    "Making Weighted Containment Feasible: A Heuristic Based on Simulation and Abstraction.",
                    "Avoiding Shared Clocks in Networks of Timed Automata.",
                    "Strategy Synthesis for Multi-Dimensional Quantitative Objectives.",
                    "Quantitative Languages Defined by Functional Automata.",
                    "A Comparison of Succinctly Represented Finite-State Systems.",
                    "All Linear-Time Congruences for Familiar Operators Part 2: Infinite LTSs.",
                    "Quantified CTL: Expressiveness and Model Checking - (Extended Abstract).",
                    "What Makes Atl* Decidable? A Decidable Fragment of Strategy Logic.",
                    "Specifying Stateful Asynchronous Properties for Distributed Programs.",
                    "Synthesising Choreographies from Local Session Types.",
                    "A Theory of History Dependent Abstractions for Learning Interface Automata.",
                    "Linearizability with Ownership Transfer.",
                    "Nested Protocols in Session Types.",
                    "Intensional and Extensional Characterisation of Global Progress in the π-Calculus.",
                    "Duality and i/o-Types in the π-Calculus.",
                    "Spatial and Epistemic Modalities in Constraint-Based Process Calculi.",
                    "Fluid Model Checking.",
                    "Playing Stochastic Games Precisely.",
                    "Efficient Modelling and Generation of Markov Automata.",
                    "Exact Fluid Lumpability for Markovian Process Algebra.",
                    "Compositionality of Probabilistic Hennessy-Milner Logic through Structural Operational Semantics.",
                    "Coalgebraic Trace Semantics for Probabilistic Transition Systems Based on Measure Theory.",
                    "Modeling Interval Order Structures with Partially Commutative Monoids.",
                    "A Polynomial Translation of π-Calculus (FCP) to Safe Petri Nets.",
                    "Algebraic Structure of Combined Traces.",
                    "Verification of Petri Nets with Read Arcs.",
                    "Efficient Checking of Link-Reversal-Based Concurrent Systems.",
                    "Efficient Coverability Analysis by Proof Minimization.",
                    "A Framework for Formally Verifying Software Transactional Memory Algorithms.",
                    "Propositional Dynamic Logic with Converse and Repeat for Message-Passing Systems.",
                    "MSO Decidability of Multi-Pushdown Systems via Split-Width.",
                    "Decidability Problems for Actor Systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22nd CONCUR 2011",
        "info": "Aachen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2011",
                "sub_name": "CONCUR 2011 - Concurrency Theory - 22nd International Conference, CONCUR 2011, Aachen, Germany, September 6-9, 2011. Proceedings.",
                "count": 36,
                "papers": [
                    "Carrying Probabilities to the Infinite World.",
                    "Generalized Universality.",
                    "Causal Nets: A Modeling Language Tailored towards Process Discovery.",
                    "On Causal Semantics of Petri Nets.",
                    "On Expressive Powers of Timed Logics: Comparing Boundedness, Non-punctuality, and Deterministic Freezing.",
                    "Timed Automata Can Always Be Made Implementable.",
                    "Coarse Abstractions Make Zeno Behaviours Difficult to Detect.",
                    "Bisimulations Meet PCTL Equivalences for Probabilistic Automata.",
                    "A Spectrum of Behavioral Relations over LTSs on Probability Distributions.",
                    "Fixed-Delay Events in Generalized Semi-Markov Processes Revisited.",
                    "Semantic Analysis of Gossip Protocols for Wireless Sensor Networks.",
                    "An Automaton over Data Words That Captures EMSO Logic.",
                    "Advanced Ramsey-Based Büchi Automata Inclusion Testing.",
                    "Reachability of Multistack Pushdown Systems with Scope-Bounded Matching Relations.",
                    "Granularity and Concurrent Separation Logic.",
                    "Tractable Reasoning in a Fragment of Separation Logic.",
                    "On Locality and the Exchange Law for Concurrent Processes.",
                    "Typed ψ-calculi.",
                    "Full Abstraction in a Subtyped pi-Calculus with Linear Types.",
                    "Controlling Reversibility in Higher-Order Pi.",
                    "A Connector Algebra for P/T Nets Interactions.",
                    "Vector Addition System Reversible Reachability Problem.",
                    "Efficient Contextual Unfolding.",
                    "Parameterized Complexity Results for 1-safe Petri Nets.",
                    "The Decidability of the Reachability Problem for CCS!",
                    "Static Livelock Analysis in CSP.",
                    "Dynamic Reactive Modules.",
                    "Weak Kripke Structures and LTL.",
                    "Efficient CTL Model-Checking for Pushdown Systems.",
                    "Reasoning about Threads with Bounded Lock Chains.",
                    "A Temporal Logic for the Interaction of Strategies.",
                    "The Complexity of Nash Equilibria in Limit-Average Games.",
                    "Two Variable vs. Linear Temporal Logic in Model Checking and Games.",
                    "A Compositional Framework for Controller Synthesis.",
                    "Decidability of Branching Bisimulation on Normed Commutative Context-Free Processes.",
                    "Refining the Process Rewrite Systems Hierarchy via Ground Tree Rewrite Systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21st CONCUR 2010",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2010",
                "sub_name": "CONCUR 2010 - Concurrency Theory, 21th International Conference, CONCUR 2010, Paris, France, August 31-September 3, 2010. Proceedings.",
                "count": 40,
                "papers": [
                    "Dating Concurrent Objects: Real-Time Modeling and Schedulability Analysis.",
                    "Applications of Shellable Complexes to Distributed Computing - (Invited Talk).",
                    "Concurrency and Composition in a Stochastic World.",
                    "Taming Distributed Asynchronous Systems.",
                    "Trust in Anonymity Networks.",
                    "Learning I/O Automata.",
                    "Constrained Monotonic Abstraction: A CEGAR for Parameterized Verification.",
                    "Information Flow in Interactive Systems.",
                    "From Multi to Single Stack Automata.",
                    "A Geometric Approach to the Problem of Unique Decomposition of Processes.",
                    "A Logic for True Concurrency.",
                    "A Theory of Design-by-Contract for Distributed Multiparty Interactions.",
                    "Bisimilarity of One-Counter Processes Is PSPACE-Complete.",
                    "Nash Equilibria for Reachability Objectives in Multi-player Timed Games.",
                    "Stochastic Real-Time Games with Qualitative Timed Automata Objectives.",
                    "Session Types as Intuitionistic Linear Propositions.",
                    "Session Types for Access and Information Flow Control.",
                    "Simulation Distances.",
                    "Mean-Payoff Automaton Expressions.",
                    "Obliging Games.",
                    "Multipebble Simulations for Alternating Automata - (Extended Abstract).",
                    "Parameterized Verification of Ad Hoc Networks.",
                    "Termination in Impure Concurrent Languages.",
                    "Buffered Communication Analysis in Distributed Multiparty Sessions.",
                    "Efficient Bisimilarities from Second-Order Reaction Semantics for pi-Calculus.",
                    "On the Use of Non-deterministic Automata for Presburger Arithmetic.",
                    "Reasoning about Optimistic Concurrency Using a Program Logic for History.",
                    "Theory by Process.",
                    "On the Compositionality of Round Abstraction.",
                    "A Linear Account of Session Types in the Pi Calculus.",
                    "Generic Forward and Backward Simulations II: Probabilistic Simulation.",
                    "Kleene, Rabin, and Scott Are Available.",
                    "Reversing Higher-Order Pi.",
                    "Modal Logic over Higher Dimensional Automata.",
                    "A Communication Based Model for Games of Imperfect Information.",
                    "Flat Coalgebraic Fixed Point Logics.",
                    "Conditional Automata: A Tool for Safe Removal of Negligible Events.",
                    "Representations of Petri Net Interactions.",
                    "Communicating Transactions - (Extended Abstract).",
                    "Consistent Correlations for Parameterised Boolean Equation Systems with Applications in Correctness Proofs for Manipulations."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20th CONCUR 2009",
        "info": "Bologna, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2009",
                "sub_name": "CONCUR 2009 - Concurrency Theory, 20th International Conference, CONCUR 2009, Bologna, Italy, September 1-4, 2009. Proceedings.",
                "count": 41,
                "papers": [
                    "Perspectives on Transactional Memory.",
                    "The Effect of Tossing Coins in Omega-Automata.",
                    "Bigraphical Categories.",
                    "BlenX Static and Dynamic Semantics.",
                    "Flow Policy Awareness for Distributed Mobile Code.",
                    "Volume and Entropy of Regular Timed Languages: Discretization Approach.",
                    "A Logical Interpretation of the λ-Calculus into the π-Calculus, Preserving Spine Reduction and Types.",
                    "Encoding Asynchronous Interactions Using Open Petri Nets.",
                    "Distributed Asynchronous Automata.",
                    "Algebra for Infinite Forests with an Application to the Temporal Logic EF.",
                    "Deriving Syntax and Axioms for Quantitative Regular Behaviours.",
                    "Weighted Bisimulation in Linear Algebraic Form.",
                    "A Logic-Based Framework for Reasoning about Composite Data Structures.",
                    "Measuring Permissivity in Finite Games.",
                    "Contracts for Mobile Processes.",
                    "Power of Randomization in Automata on Infinite Strings.",
                    "Probabilistic Weighted Automata.",
                    "Partially-Commutative Context-Free Processes.",
                    "Testing Finitary Probabilistic Processes.",
                    "A Demonic Approach to Information in Probabilistic Systems.",
                    "HYPE: A Process Algebra for Compositional Flows and Emergent Behaviour.",
                    "Variable Binding, Symmetric Monoidal Closed Theories, and Bigraphs.",
                    "Partial Order Reduction for Probabilistic Systems: A Revision for Distributed Schedulers.",
                    "Model-Checking Games for Fixpoint Logics with Partial Order Models.",
                    "Reachability in Succinct and Parametric One-Counter Automata.",
                    "Winning Regions of Pushdown Parity Games: A Saturation Method.",
                    "Concurrent Kleene Algebra.",
                    "Concavely-Priced Probabilistic Timed Automata.",
                    "Compositional Control Synthesis for Partially Observable Systems.",
                    "Howe's Method for Calculi with Passivation.",
                    "On the Relationship between π-Calculus and Finite Place/Transition Petri Nets.",
                    "Modeling Radio Networks.",
                    "Time-Bounded Verification.",
                    "Secure Enforcement for Global Process Specifications.",
                    "On Convergence of Concurrent Systems under Regular Interactions.",
                    "Computing Stuttering Simulations.",
                    "Weak Time Petri Nets Strike Back!.",
                    "A General Testability Theory.",
                    "Counterexamples in Probabilistic LTL Model Checking for Markov Chains.",
                    "Query-Based Model Checking of Ad Hoc Network Protocols.",
                    "Strict Divergence for Probabilistic Timed Automata."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19th CONCUR 2008",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2008",
                "sub_name": "CONCUR 2008 - Concurrency Theory, 19th International Conference, CONCUR 2008, Toronto, Canada, August 19-22, 2008. Proceedings.",
                "count": 39,
                "papers": [
                    "Beyond Nash Equilibrium: Solution Concepts for the 21st Century.",
                    "Service Choreography and Orchestration with Conversations.",
                    "Knowledge and Information in Probabilistic Systems.",
                    "Taming Concurrency: A Program Verification Perspective.",
                    "A Model of Dynamic Separation for Transactional Memory.",
                    "Completeness and Nondeterminism in Model Checking Transactional Memories.",
                    "Semantics of Deterministic Shared-Memory Systems.",
                    "A Scalable and Oblivious Atomicity Assertion.",
                    "R-Automata.",
                    "Distributed Timed Automata with Independently Evolving Clocks.",
                    "A Context-Free Process as a Pushdown Automaton.",
                    "Modeling Computational Security in Long-Lived Systems.",
                    "Contract-Directed Synthesis of Simple Orchestrators.",
                    "Environment Assumptions for Synthesis.",
                    "Smyle: A Tool for Synthesizing Distributed Models from Scenarios by Learning.",
                    "SYCRAFT: A Tool for Synthesizing Distributed Fault-Tolerant Programs.",
                    "Subsequence Invariants.",
                    "Invariants for Parameterised Boolean Equation Systems.",
                    "Unfolding-Based Diagnosis of Systems with an Evolving Topology.",
                    "On the Construction of Sorted Reactive Systems.",
                    "Dynamic Partial Order Reduction Using Probe Sets.",
                    "A Space-Efficient Probabilistic Simulation Algorithm.",
                    "Least Upper Bounds for Probability Measures and Their Applications to Abstractions.",
                    "Abstraction for Stochastic Systems by Erlang's Method of Stages.",
                    "On the Minimisation of Acyclic Models.",
                    "Quasi-Static Scheduling of Communicating Tasks.",
                    "Strategy Construction for Parity Games with Imperfect Information.",
                    "Mixing Lossy and Perfect Fifo Channels.",
                    "On the Reachability Analysis of Acyclic Networks of Pushdown Systems.",
                    "Spatial and Behavioral Types in the Pi-Calculus.",
                    "A Spatial Equational Logic for the Applied pi-Calculus.",
                    "Structured Interactional Exceptions in Session Types.",
                    "Global Progress in Dynamically Interleaved Multiparty Sessions.",
                    "Normed BPA vs. Normed BPP Revisited.",
                    "A Rule Format for Associativity.",
                    "Deriving Structural Labelled Transitions for Mobile Ambients.",
                    "Termination Problems in Chemical Kinetics.",
                    "Towards a Unified Approach to Encodability and Separation Results for Process Calculi.",
                    "A Notion of Glue Expressiveness for Component-Based Systems."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18th CONCUR 2007",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2007",
                "sub_name": "CONCUR 2007 - Concurrency Theory, 18th International Conference, CONCUR 2007, Lisbon, Portugal, September 3-8, 2007, Proceedings.",
                "count": 33,
                "papers": [
                    "Mapping the Security Landscape: A Role for Language Techniques.",
                    "The Saga of the Axiomatization of Parallel Composition.",
                    "Rule-Based Modelling of Cellular Signalling.",
                    "Making Random Choices Invisible to the Scheduler.",
                    "Strategy Logic.",
                    "Solving Games Via Three-Valued Abstraction Refinement.",
                    "Linear Time Logics Around PSL: Complexity, Expressiveness, and a Little Bit of Succinctness.",
                    "On Modal Refinement and Consistency.",
                    "Equivalence Checking for Infinite Systems Using Parameterized Boolean Equation Systems.",
                    "Decidability Results for Well-Structured Transition Systems with Auxiliary Storage.",
                    "A Nice Labelling for Tree-Like Event Structures of Degree 3.",
                    "Causal Message Sequence Charts.",
                    "Checking Coverage for Infinite Collections of Timed Scenarios.",
                    "Is Observational Congruence Axiomatisable in Equational Horn Logic?",
                    "The Must Preorder Revisited.",
                    "Topology-Dependent Abstractions of Broadcast Networks.",
                    "On the Expressive Power of Global and Local Priority in Process Calculi.",
                    "A Marriage of Rely/Guarantee and Separation Logic.",
                    "Fair Cooperative Multithreading.",
                    "Precise Fixpoint-Based Analysis of Programs with Thread-Creation and Procedures.",
                    "Automatic Derivation of Compositional Rules in Automated Compositional Reasoning.",
                    "Compositional Event Structure Semantics for the Internal pi -Calculus.",
                    "Interpreting a Finitary Pi-calculus in Differential Interaction Nets.",
                    "Mobility Control Via Passports.",
                    "Coalgebraic Models for Reactive Systems.",
                    "Reactive Systems over Directed Bigraphs.",
                    "Asynchronous Games: Innocence Without Alternation.",
                    "Bisimulation and Logical Preservation for Continuous-Time Markov Decision Processes.",
                    "Strategy Synthesis for Markov Decision Processes and Branching-Time Logics.",
                    "Timed Concurrent Game Structures.",
                    "Pushdown Module Checking with Imperfect Information.",
                    "Alternating Automata and a Temporal Fixpoint Calculus for Visibly Pushdown Languages.",
                    "Temporal Antecedent Failure: Refining Vacuity."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17th CONCUR 2006",
        "info": "Bonn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2006",
                "sub_name": "CONCUR 2006 - Concurrency Theory, 17th International Conference, CONCUR 2006, Bonn, Germany, August 27-30, 2006, Proceedings.",
                "count": 34,
                "papers": [
                    "Modeling Timed Concurrent Systems.",
                    "Some Remarks on Definability of Process Graphs.",
                    "Sanity Checks in Formal Verification.",
                    "Welcome to the Jungle: A Subjective Guide to Mobile Process Calculi.",
                    "Probability and Nondeterminism in Operational Models of Concurrency.",
                    "A Livelock Freedom Analysis for Infinite State Asynchronous Reactive Systems.",
                    "Proving Liveness by Backwards Reachability.",
                    "Model Checking Quantified Computation Tree Logic.",
                    "Liveness, Fairness and Impossible Futures.",
                    "Checking a Mutex Algorithm in a Process Algebra with Fairness.",
                    "A Complete Axiomatic Semantics for the CSP Stable-Failures Model.",
                    "Transition Systems of Elementary Net Systems with Localities.",
                    "Operational Determinism and Fast Algorithms.",
                    "Minimization, Learning, and Conformance Testing of Boolean Programs.",
                    "A Capability Calculus for Concurrency and Determinism.",
                    "A New Type System for Deadlock-Free Processes.",
                    "Sortings for Reactive Systems.",
                    "Dynamic Access Control in a Concurrent Object Calculus.",
                    "Concurrent Rewriting for Graphs with Equivalences.",
                    "Event Structure Semantics for Nominal Calculi.",
                    "Encoding CDuce in the Cpi-Calculus.",
                    "A Complete Axiomatisation of Branching Bisimulation for Probabilistic Systems with an Application in Protocol Verification.",
                    "Probabilistic I/O Automata: Theories of Two Equivalences.",
                    "Reachability in Recursive Markov Decision Processes.",
                    "Strategy Improvement for Stochastic Rabin and Streett Games.",
                    "Weak Bisimulation Up to Elaboration.",
                    "Generic Forward and Backward Simulations.",
                    "On Finite Alphabets and Infinite Bases III: Simulation.",
                    "Inference of Event-Recording Automata Using Timed Decision Trees.",
                    "Controller Synthesis for MTL Specifications.",
                    "On Interleaving in Timed Automata.",
                    "A Language for Task Orchestration and Its Semantic Properties.",
                    "Finding Shortest Witnesses to the Nonemptiness of Automata on Infinite Words.",
                    "Second-Order Simple Grammars."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16th CONCUR 2005",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2005",
                "sub_name": "CONCUR 2005 - Concurrency Theory, 16th International Conference, CONCUR 2005, San Francisco, CA, USA, August 23-26, 2005, Proceedings.",
                "count": 42,
                "papers": [
                    "Static Analysis Versus Model Checking for Bug Finding.",
                    "The Benefits of Exposing Calls and Returns.",
                    "A Compositional Approach to the Stochastic Dynamics of Gene Networks.",
                    "Games Other People Play.",
                    "Type-Directed Concurrency.",
                    "Multiport Interaction Nets and Concurrency.",
                    "Model Checking for pi-Calculus Using Proof Search.",
                    "A Game Semantics of the Asynchronous pi-Calculus.",
                    "Efficient On-the-Fly Algorithms for the Analysis of Timed Games.",
                    "Modal Logics for Timed Control.",
                    "Timed Shuffle Expressions.",
                    "A New Modality for Almost Everywhere Properties in Timed Automata.",
                    "The Coarsest Congruence for Timed Automata with Deadlines Contained in Bisimulation.",
                    "A Behavioural Pseudometric for Metric Labelled Transition Systems.",
                    "On Probabilistic Program Equivalence and Refinement.",
                    "Probabilistic Anonymity.",
                    "Secrecy Despite Compromise: Types, Cryptography, and the Pi-Calculus.",
                    "Timed Spi-Calculus with Types for Secrecy and Authenticity.",
                    "Selecting Theories and Recursive Protocols.",
                    "Constraint Solving for Contract-Signing Protocols.",
                    "A Ground-Complete Axiomatization of Finite State Processes in Process Algebra.",
                    "Decomposition and Complexity of Hereditary History Preserving Bisimulation on BPP.",
                    "Bisimulations Up-to for the Linear Time Branching Time Spectrum.",
                    "Deriving Weak Bisimulation Congruences from Reduction Systems.",
                    "SOS for Higher Order Processes.",
                    "The Individual and Collective Token Interpretations of Petri Nets.",
                    "Merged Processes - A New Condensed Representation of Petri Net Behaviour.",
                    "Concurrent Clustered Programming.",
                    "A Theory of System Behaviour in the Presence of Node and Link Failures.",
                    "Comparing Two Approaches to Compensable Flow Composition.",
                    "Transactions in RCCS.",
                    "Two-Player Nonzero-Sum omega-Regular Games.",
                    "Games Where You Can Play Optimally Without Any Memory.",
                    "On Implementation of Global Concurrent Systems with Local Asynchronous Controllers.",
                    "Defining Fairness.",
                    "Regular Symbolic Analysis of Dynamic Networks of Pushdown Systems.",
                    "Termination Analysis of Integer Linear Loops.",
                    "A Practical Application of Geometric Semantics to Static Analysis of Concurrent Programs.",
                    "Verification of Qualitative Constraints.",
                    "Uniform Satisfiability Problem for Local Temporal Logics over Mazurkiewicz Traces.",
                    "Taming Interface Specifications.",
                    "Synthesis of Distributed Systems from Knowledge-Based Specifications."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15th CONCUR 2004",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2004",
                "sub_name": "CONCUR 2004 - Concurrency Theory, 15th International Conference, London, UK, August 31 - September 3, 2004, Proceedings.",
                "count": 33,
                "papers": [
                    "Zing: Exploiting Program Structure for Model Checking Concurrent Software.",
                    "A Semantics for Concurrent Separation Logic.",
                    "A Survey of Regular Model Checking.",
                    "Resources, Concurrency and Local Reasoning.",
                    "Resource Control for Synchronous Cooperative Threads.",
                    "Verifying Finite-State Graph Grammars: An Unfolding-Based Approach.",
                    "The Pros and Cons of Netcharts.",
                    "Basic Theory of Reduction Congruence forTwo Timed Asynchronous pi-Calculi.",
                    "Characterizing EF and EX Tree Logics.",
                    "Message-Passing Automata Are Expressively Equivalent to EMSO Logic.",
                    "Symbolic Bisimulation in the Spi Calculus.",
                    "A Symbolic Decision Procedure for Cryptographic Protocols with Time Stamps (Extended Abstract).",
                    "Deciding Probabilistic Bisimilarity Over Infinite-State Probabilistic Systems.",
                    "µABC: A Minimal Aspect Calculus.",
                    "Type Based Discretionary Access Control.",
                    "Elimination of Quantifiers and Undecidability in Spatial Logics for Concurrency.",
                    "Modular Construction of Modal Logics.",
                    "Verification by Network Decomposition.",
                    "Reversible Communicating Systems.",
                    "Parameterised Boolean Equation Systems (Extended Abstract).",
                    "An Extensional Spatial Logic for Mobile Processes.",
                    "Timed vs. Time-Triggered Automata.",
                    "Extended Process Rewrite Systems: Expressiveness and Reachability.",
                    "A General Approach to Comparing Infinite-State Systems with Their Finite-State Specifications.",
                    "Model Checking Timed Automata with One or Two Clocks.",
                    "On Flatness for 2-Dimensional Vector Addition Systems with States.",
                    "Compiling Pattern Matching in Join-Patterns.",
                    "Model Checking Restricted Sets of Timed Paths.",
                    "Asynchronous Games 2: The True Concurrency of Innocence.",
                    "Open Maps, Alternating Simulations and Control Synthesis.",
                    "Probabilistic Event Structures and Domains.",
                    "Session Types for Functional Multithreading.",
                    "A Higher Order Modal Fixed Point Logic."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14th CONCUR 2003",
        "info": "Marseille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2003",
                "sub_name": "CONCUR 2003 - Concurrency Theory, 14th International Conference, Marseille, France, September 3-5, 2003, Proceedings.",
                "count": 33,
                "papers": [
                    "Distributed Monitoring of Concurrent and Asynchronous Systems.",
                    "Synthesis of Distributed Algorithms Using Asynchronous Automata.",
                    "Compression of Partially Ordered Strings.",
                    "Bundle Event Structures and CCSP.",
                    "Syntactic Formats for Free.",
                    "Priority Rewrite Systems for OSOS Process Languages.",
                    "Quantitative Verification and Control via the Mu-Calculus.",
                    "Playing Games with Boxes and Diamonds.",
                    "The Element of Surprise in Timed Games.",
                    "Deciding Bisimilarity between BPA and BPP Processes.",
                    "Verification of Parametric Concurrent Systems with Prioritized FIFO Resource Management.",
                    "Input/Output Automata: Basic, Timed, Hybrid, Probabilistic, Dynamic, ...",
                    "A Process-Algebraic Language for Probabilistic I/O Automata.",
                    "Compositionality for Probabilistic Automata.",
                    "Satisfiability and Model Checking for MSO-definable Temporal Logics are in PSPACE.",
                    "Equivalence Checking of Non-Flat Systems Is EXPTIME-hard.",
                    "Model Checking a Path.",
                    "Multi-Valued Model Checking via Classical Model Checking.",
                    "An Extension of Pushdown System and Its Model Checking Method.",
                    "Netcharts: Bridging the gap between HMSCs and executable specifications.",
                    "High-Level Message Sequence Charts and Projections.",
                    "Composition of Cryptographic Protocols in a Probabilistic Polynomial-Time Process Calculus.",
                    "Unifying Simulatability Definitions in Cryptographic Systems under Different Timing Assumptions.",
                    "Contract Signing, Optimism, and Advantage.",
                    "Full Abstraction for HOPLA.",
                    "Modeling Consensus in a Process Calculus.",
                    "Linear Forwarders.",
                    "Abstract Patterns of Compositional Reasoning.",
                    "Relating Fairness and Timing in Process Algebras.",
                    "A Compositional Semantic Theory for Synchronous Component-based Design.",
                    "Conditional Expectation and the Approximation of Labelled Markov Processes.",
                    "Comparative Branching-Time Semantics.",
                    "Quantitative Relations and Approximate Process Equivalences."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13th CONCUR 2002",
        "info": "Brno, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2002",
                "sub_name": "CONCUR 2002 - Concurrency Theory, 13th International Conference, Brno, Czech Republic, August 20-23, 2002, Proceedings.",
                "count": 39,
                "papers": [
                    "Refinement and Verification Applied to an In-Flight Data Acquisition Unit.",
                    "A Deductive Proof System for CTL.",
                    "Event-State Duality: The Enriched Case.",
                    "Expressive Power of Temporal Logics.",
                    "Types, or: Where's the Difference Between CCS and pi?",
                    "Introduction to Modal and Temporal Mu-Calculi (Abstract).",
                    "Types for Cryptographic Protocols.",
                    "Network Invariants in Action.",
                    "Regular Model Checking Made Simple and Efficient.",
                    "A Hierarchy of Polynomial-Time Computable Simulations for Automata.",
                    "A Decidable Class of Asynchronous Distributed Controllers.",
                    "Alphabet-Based Synchronisation is Exponentially Cheaper.",
                    "Safe Realizability of High-Level Message Sequence Charts.",
                    "Widening the Boundary between Decidable and Undecidable Hybrid Systems.",
                    "A Spatial Logic for Concurrency (Part II).",
                    "Reducing Model Checking from Multi-valued {\\rm CTL}^{\\ast} to {\\rm CTL}^{\\ast}.",
                    "Local Model Checking Games for Fixed Point Logic with Chop.",
                    "A Decidable Fixpoint Logic for Time-Outs.",
                    "A Calculus of Mobile Resources.",
                    "Using Ambients to Control Resources.",
                    "Typing and Subtyping Mobility in Boxed Ambients.",
                    "Orchestrating Transactions in Join Calculus.",
                    "Simulation for Continuous-Time Markov Chains.",
                    "Weak Bisimulation is Sound and Complete for PCTL*.",
                    "Decision Algorithms for Probabilistic Bisimulation.",
                    "Axiomatizing an Algebra of Step Reactions for Synchronous Languages.",
                    "Regular Sets of Pomsets with Autoconcurrency.",
                    "The Fusion Machine.",
                    "HOPLA-A Higher-Order Process Language.",
                    "A First Order Coalgebraic Model of pi-Calculus Early Observational Equivalence.",
                    "Traces, Pomsets, Fairness and Full Abstraction for Communicating Processes.",
                    "A Framework for the Analysis of Security Protocols.",
                    "On Name Generation and Set-Based Analysis in the Dolev-Yao Model.",
                    "On the Decidability of Cryptographic Protocols with Open-Ended Data Structures.",
                    "Causality Semantics of Petri Nets with Weighted Inhibitor Arcs.",
                    "Refinement-Robust Fairness.",
                    "Decidability of Strong Bisimilarity for Timed BPP.",
                    "Undecidability of Weak Bisimilarity for Pushdown Processes.",
                    "Why Is Simulation Harder than Bisimulation?"
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "12th CONCUR 2001",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2001",
                "sub_name": "CONCUR 2001 - Concurrency Theory, 12th International Conference, Aalborg, Denmark, August 20-25, 2001, Proceedings.",
                "count": 38,
                "papers": [
                    "Channel Representations in Protocol Verification.",
                    "Bigraphical Reactive Systems.",
                    "Control of Networks of Unmanned Vehicles.",
                    "Process Algebra and Security.",
                    "Using the Bandera Tool Set to Model-Check Properties of Concurrent Java Software.",
                    "Performance Evaluation : = (Process Algebra + Model Checking) × Markov Chains.",
                    "Typing Mobility in the Seal Calculus.",
                    "Reasoning about Security in Mobile Ambients.",
                    "Synchronized Hyperedge Replacement with Name Mobility.",
                    "Dynamic Input/Output Automata: A Formal Model for Dynamic Systems.",
                    "Probabilistic Information Flow in a Process Algebra.",
                    "Symbolic Computation of Maximal Probabilistic Reachability.",
                    "Randomized Non-sequential Processes.",
                    "Liveness and Fairness in Process-Algebraic Verification.",
                    "Bounded Reachability Checking with Process Semantics.",
                    "Techniques for Smaller Intermediary BDDs.",
                    "An Algebraic Characterization of Data and Timed Languages.",
                    "A Faster-than Relation for Asynchronous Processes.",
                    "On the Power of Labels in Transition Systems.",
                    "On Barbed Equivalences in pi-Calculus.",
                    "CCS with Priority Guards.",
                    "A Testing Theory for Generally Distributed Stochastic Processes.",
                    "An Algorithm for Quantitative Verification of Probabilistic Transition Systems.",
                    "Compositional Methods for Probabilistic Systems.",
                    "Towards an Efficient Algorithm for Unfolding Petri Nets.",
                    "A Static Analysis Technique for Graph Transformation Systems.",
                    "Local First Search - A New Paradigm for Partial Order Reductions.",
                    "Extending Memory Consistency of Finite Prefixes to Infinite Computations.",
                    "Abstraction-Based Model Checking Using Modal Transition Systems.",
                    "Efficient Multiple-Valued Model-Checking Using Lattice Representations.",
                    "Divide and Compose: SCC Refinement for Language Emptiness.",
                    "Unavoidable Configurations of Parameterized Rings of Processes.",
                    "Logic of Global Synchrony.",
                    "Compositional Modeling of Reactive Systems Using Open Nets.",
                    "Extended Temporal Logic Revisited.",
                    "Symbolic Algorithms for Infinite-State Games.",
                    "A Game-Based Verification of Non-repudiation and Fair Exchange Protocols.",
                    "The Control of Synchronous Systems, Part II."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "11th CONCUR 2000",
        "info": "Pennsylvania State University, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/2000",
                "sub_name": "CONCUR 2000 - Concurrency Theory, 11th International Conference, University Park, PA, USA, August 22-25, 2000, Proceedings.",
                "count": 42,
                "papers": [
                    "Combining Theorem Proving and Model Checking through Symbolic Analysis.",
                    "Verification Is Experimentation!",
                    "Compositional Performance Analysis Using Probabilistic I/O Automata.",
                    "Formal Models for Communication-Based Design.",
                    "Programming Access Control: The KLAIM Experience.",
                    "Exploiting Hierarchical Structure for Efficient Formal Verification.",
                    "From Process Calculi to Process Frameworks.",
                    "Verification Using Tabled Logic Programming.",
                    "Open Systems in Reactive Environments: Control and Synthesis.",
                    "Model Checking with Finite Complete Prefixes Is PSPACE-Complete.",
                    "Verifying Quantitative Properties of Continuous Probabilistic Timed Automata.",
                    "The Impressive Power of Stopwatches.",
                    "Optimizing Büchi Automata.",
                    "Generalized Model Checking: Reasoning about Partial State Spaces.",
                    "Reachability Analysis for Some Models of Infinite-State Transition Systems.",
                    "Process Spaces.",
                    "Failure Semantics for the Exchange of Information in Multi-Agent Systems.",
                    "Proof-Outlines for Threads in Java.",
                    "Deriving Bisimulation Congruences for Reactive Systems.",
                    "Bisimilarity Congruences for Open Terms and Term Graphs via Tile Logic.",
                    "Process Languages for Rooted Eager Bisimulation.",
                    "Action Contraction.",
                    "A Theory of Testing for Markovian Processes.",
                    "Reasoning about Probabilistic Lossy Channel Systems.",
                    "Weak Bisimulation for Probabilistic Systems.",
                    "Nondeterminism and Probabilistic Choice: Obeying the Laws.",
                    "Secrecy and Group Creation.",
                    "On the Reachability Problem in Cryptographic Protocols.",
                    "Secure Information Flow for Concurrent Processes.",
                    "LP Deadlock Checking Using Partial Order Dependencies.",
                    "Pomsets for Local Trace Languages - Recognizability, Logic & Petri Nets.",
                    "Functorial Concurrent Semantics for Petri Nets with Read and Inhibitor Arcs.",
                    "The Control of Synchronous Systems.",
                    "Typing Non-uniform Concurrent Objects.",
                    "An Implicitly-Typed Deadlock-Free Process Calculus.",
                    "Typed Mobile Objects.",
                    "Synthesizing Distributed Finite-State Systems from MSCs.",
                    "Emptiness Is Decidable for Asynchronous Cellular Machines.",
                    "Revisiting Safety and Liveness in the Context of Failures.",
                    "Well-Abstracted Transition Systems.",
                    "A Unifying Approach to Data-Independence.",
                    "Chi Calculus with Mismatch."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "10th CONCUR 1999",
        "info": "Eindhoven, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1999",
                "sub_name": "CONCUR '99: Concurrency Theory, 10th International Conference, Eindhoven, The Netherlands, August 24-27, 1999, Proceedings.",
                "count": 38,
                "papers": [
                    "Temporal Process Logic (Abstract).",
                    "An Unfolding Algorithm for Synchronous Products of Transition Systems.",
                    "Petri Nets, Configuration Structures and Higher Dimensional Automata.",
                    "Expressiveness and Distributed Implementation of Conciurrent Calculi with Link Mobility.",
                    "Techniques for Decidability and Undecidability of Bisimilarity.",
                    "Testing Concurrent Systems: A Formal Approach.",
                    "Computing Minimum and Maximum Reachability Times in Probabilistic Systems.",
                    "Automating Modular Verification.",
                    "\"Next\" Heuristic for On-the-Fly Model Checking.",
                    "Model Checking of Message Sequence Charts.",
                    "Synthesis of Large Concurrent Programs via Pairwise Composition.",
                    "Approximate Symbolic Model Checking of Continuous-Time Markov Chains.",
                    "From Synchrony to Asynchrony.",
                    "Reachability Analysis of (Timed) Petri Nets Using Real Arithmetic.",
                    "Weak and Strong Composition of High-Level Petri-Nets.",
                    "Model Checking of Time Petri Nets Based on Partial Order Semantics.",
                    "Generic Process Algebras for Asynchronous Communication.",
                    "Timed Automata and the Theory of Real Numbers.",
                    "Metrics for Labeled Markov Systems.",
                    "The Expressive Power of Temporal Logic of Actions (Extended Abstract).",
                    "Object Types against Races.",
                    "Open Bisimulations on Chi Processes.",
                    "Rectangular Hybrid Games.",
                    "Localizability of Fairness Constraints and Their Distributed Implementations.",
                    "Generating Type Systems for Process Graphs.",
                    "Weak Bisimilarity with Infinite-State Systems Can Be Decided in Polynomial Time.",
                    "Robust Satisfaction.",
                    "Statecharts Via Process Algebra.",
                    "A Partial Order Event Model for Concurrent Objects.",
                    "Partial Order Reduction for Model Checking of Timed Automata.",
                    "On the Semantics of Place/Transition Nets.",
                    "Validating Firewalls in Mobile Ambients.",
                    "On Coherence Properties in Team Rewriting Models of Concurrency.",
                    "Synchronous Structures.",
                    "Weakest-Congruence Results for Livelock-Preserving Equivalences.",
                    "Proof-Checking Protocols Using Bisimulations.",
                    "Event Structures as Presheaves -Two Representation Theorems.",
                    "Suptyping and Locality in Distributed Higher Order Processes (extended abstract)."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "9th CONCUR 1998",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1998",
                "sub_name": "CONCUR '98: Concurrency Theory, 9th International Conference, Nice, France, September 8-11, 1998, Proceedings.",
                "count": 41,
                "papers": [
                    "Sometimes and Not Never Re-revisited: On Branching Versus Linear Time.",
                    "Controllers for Discrete Event Systems via Morphisms.",
                    "Synthesis from Knowledge-Based Specifications (Extended Abstract).",
                    "The Regular Viewpoint on PA-Processes.",
                    "Herbrand Automata for Hardware Verification.",
                    "Control Flow Analysis for the pi-calculus.",
                    "The Tau-Laws of Fusion.",
                    "From Higher-Order pi-Calculus to pi-Calculus in the Presence of Static Operators.",
                    "Minimality and Separation Results on Asynchronous Mobile Processes: Representability Theorems by Concurrent Combinators (Extended Abstract).",
                    "Abstract Games for Infinite State Processes.",
                    "Alternating Refinement Relations.",
                    "Possible Worlds for Process Algebras.",
                    "Automata and Coinduction (An Exercise in Coalgebra).",
                    "Axioms for Real-Time Logics.",
                    "Priority and Maximal Progress Are Completely Axioatisable (Extended Abstract).",
                    "Simulation Is Decidable for One-Counter Nets (Extended Abstract).",
                    "From Rewrite to Bisimulation Congruences.",
                    "Reasoning about Asynchronous Communication in Dynamically Evolving Object Structures.",
                    "Modelling IP Mobility.",
                    "Reduction in TLA.",
                    "Detecting Deadlocks in Concurrent Systems.",
                    "Unfold/Fold Transformations of CCP Programs.",
                    "Type Systems for Concurrent Calculi (Abstract).",
                    "Stochastic Process Algebras Benefits for Performance Evaluation and Challenges (Extended Abstract).",
                    "Algebraic Techniques for Timed Systems.",
                    "Praobabilistic Resource Failure in Real-Time Process Algebra.",
                    "Towards Performance Evaluation with General Distributions in Process Algebras.",
                    "Stochastic Transition Systems.",
                    "It's About Time: Real-Time Logics Reviewed.",
                    "Controlled Timed Automata.",
                    "On Discretization of Delays in Timed Automata and Digital Circuits.",
                    "Partial Order Reductions for Timed Systems.",
                    "Unfolding and Finite Prefix for Nets with Read Arcs.",
                    "Asynchronous Cellular Automata and Asynchronous Automata for Pomsets.",
                    "Deriving Unbounded Petri Nets from Formal Languages.",
                    "Decompositions of Asynchronous Systems.",
                    "Synthesis of ENI-systems Using Minimal Regions.",
                    "A Categorical Axiomatics for Bisimulation.",
                    "Fibrational Semantics of Dataflow Networks.",
                    "A Relational Model of Non-deterministic Dataflow.",
                    "Checking Verifications of Protocols and Distributed Systems by Computer."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "8th CONCUR 1997",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1997",
                "sub_name": "CONCUR '97: Concurrency Theory, 8th International Conference, Warsaw, Poland, July 1-4, 1997, Proceedings.",
                "count": 28,
                "papers": [
                    "Recent Developments in the Mathematics of Reactive Systems (Extended Abstract).",
                    "Partial-Order Reduction in the Weak Modal Mu-Calculus.",
                    "Cyclic Vector Languages.",
                    "A Product Version of Dynamic Linear Time Temporal Logic.",
                    "Reasoning about Cryptographic Protocols in the Spi Calculus.",
                    "Modularity for Timed and Hybrid Systems.",
                    "A Universal Reactive Machine.",
                    "Bounded Stacks, Bags and Queues.",
                    "Adding Partial Orders to Linear Temporal Logic.",
                    "Reachability Analysis of Pushdown Automata: Application to Model-Checking.",
                    "Synthesis of Nets with Inhibitor Arcs.",
                    "An Algebraic Theory of Multiple Clocks.",
                    "Horizontal and Vertical Structuring Techniques for Statecharts.",
                    "Implicit Typing à la ML for the Join-Calculus.",
                    "Proving Safety Properties of Infinite State Systems by Compilation into Presburger Arithmetic.",
                    "Axiomatizing Flat Iteration.",
                    "Probabilistic Concurrent Constraint Programming.",
                    "On the Complexity of Verifying Concurrent Transition Systems.",
                    "Fair Simulation.",
                    "High Level Expressions with their SOS Semantics (Extended Abstract).",
                    "How to Parallelize Sequential Processes.",
                    "Causal Ambiguity and Partial Orders in Event Structures.",
                    "Model Checking PA-Processes.",
                    "Bisimulation and Propositional Intuitionistic Logic.",
                    "A Rigorous Analysis of Concurrent Operations on B-Trees.",
                    "First-Order Axioms for Asynchrony.",
                    "On Implementations and Semantics of a Concurrent Programming Language.",
                    "Algebraic Characterization of Petri Net Pomset Semantics."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "7th CONCUR 1996",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1996",
                "sub_name": "CONCUR '96, Concurrency Theory, 7th International Conference, Pisa, Italy, August 26-29, 1996, Proceedings.",
                "count": 44,
                "papers": [
                    "Retracing Some Paths in Process Algebra.",
                    "Process Calculus Based upon Evaluation to Committed Form.",
                    "A Process Algebra with Distributed Priorities.",
                    "Symbolic Transition Graph with Assignment.",
                    "Models for Concurrent Constraint Programming.",
                    "Comparing Transition Systems with Independence and Asynchronous Transition Systems.",
                    "A Presheaf Semantics of Value-Passing Processes.",
                    "Elementary Control Structures.",
                    "On Transformations of Concurrent Object Programs.",
                    "On Bisimulations for the Asynchronous pi-Calculus.",
                    "On the Expressiveness of Internal Mobility in Name-Passing Calculi.",
                    "Decoding Choice Encodings.",
                    "Infinite Results.",
                    "Decidability of Bisimulation Equivalence for Normed Pushdown Processes.",
                    "The Modal mu-calculus Alternation Hierarchy is Strict.",
                    "Bisimulation Collapse and the Process Taxonomy.",
                    "On the Expressive Completeness of the Propositional mu-Calculus with Respect to Monadic Second Order Logic.",
                    "A Facile Tutorial.",
                    "Testing Probabilistic Automata.",
                    "Extended Markovian Process Algebra.",
                    "Rewriting Logic as a Semantic Framework for Concurrency: a Progress Report.",
                    "Truly Concurrent Constraint Programming.",
                    "Constraints as Processes.",
                    "A Calculus of Mobile Agents.",
                    "Algebraic Interpretation of Lambda Calculus with Resources.",
                    "Concurrent Graph and Term Graph Rewriting.",
                    "Petri Boxes and Finite Precedence.",
                    "Constrained Properties, Semilinear Systems, and Petri Nets.",
                    "Linear Constraint Systems as High-Level Nets.",
                    "A Space-Efficient On-the-fly Algorithm for Real-Time Model Checking.",
                    "State Equivalences for Rectangular Hybrid Automata.",
                    "Verifying Abstractions of Timed Systems.",
                    "Towards Automatic Temporal Logic Verification of Value Passing Process Algebra Using Abstract Interpretation.",
                    "Modelling and Verification of Distributed Algorithms.",
                    "An Algorithmic Approach for Checking Closure Properties of omega-Regular Languages.",
                    "Towards Automata for Branching Time and Partial Order.",
                    "Asynchronous Cellular Automata for Pomsets Without Auto-concurrency.",
                    "Action Refinement and Property Inheritance in Systems of Sequential Agents.",
                    "A Calculus for Concurrent Objects.",
                    "Refinement in Interworkings.",
                    "Equivalences of Statecharts.",
                    "Modular Verification for Shared-Variable Concurrent Programs.",
                    "The Impact of Hardware Models on Shared Memory Consistency Conditions.",
                    "Synchronous Development of Asynchonous Systems."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "6th CONCUR 1995",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1995",
                "sub_name": "CONCUR '95: Concurrency Theory, 6th International Conference, Philadelphia, PA, USA, August 21-24, 1995, Proceedings.",
                "count": 40,
                "papers": [
                    "Lokal Model Checking Games.",
                    "Compositional Proof Systems for Model Checking Infinite State Processes.",
                    "Compositional Model Checking of Real Time Systems.",
                    "Checking Bisimilarity for Finitary pi-Calculus.",
                    "The Weak Late pi-Calculus Semantics as Observation Equivalence.",
                    "The Fixpoint-Analysis Machine.",
                    "Unique Fixpoint Induction for Mobile Processes.",
                    "A Polymorphic Type System for the Polyadic pi-calculus.",
                    "Fibrational Control Structures.",
                    "Fully Abstract Models for Nondeterministic Regular Expressions.",
                    "A Petri Net Semantics for pi-Calculus.",
                    "A Complete Theory of Deterministic Event Structures.",
                    "Characterizing Behavioural Congruences for Petri Nets.",
                    "Verification of a Distributed Summation Algorithm.",
                    "Confluence for Process Verification.",
                    "Axiomatisations of Weak Equivalences for De Simone Languages.",
                    "A Compositional Trace-Based Semantics for Probabilistic Automata.",
                    "Acceptance Trees for Probabilistic Processes.",
                    "Will I be Preety, Will I be Rich? Some Thoughts on Theory vs. Practice in Systems Engineering.",
                    "Towards a denotational semantics for ET-LOTOS.",
                    "Reachability Analysis at Procedure Level through Timing Coincidence.",
                    "Faster Asynchronous Systems.",
                    "Fair Testing.",
                    "Formal Methods Technology Transfer: Impediments and Innovation (Abstract).",
                    "Decidability of Simulation and Bisimulation between Lossy Channel Systems and Finite State Systems (Extended Abstract).",
                    "Checking Regular Properties of Petri Nets.",
                    "Metric Predicate Transformers: Towards a Notion of Refinement for Concurrency.",
                    "A Refinement Theory that Supports both 'Decrease of Nondeterminism' and 'Increase of Parallelism'.",
                    "Efficient Automation of Temporal Reasoning.",
                    "Veryfying Parameterized Networks using Abstraction and Regular Languages.",
                    "On the Complexity of Branching Modular Model Checking (Extended Abstract).",
                    "Axiomatising Linear Time Mu-calculus.",
                    "A Trace Consistent Subset of PTL.",
                    "Tutorial: Proving Properties of Concurrent System with SPIN.",
                    "On Sharing and Determinacy in Concurrent Systems.",
                    "Process Semantics of Graph Reduction.",
                    "Bisimulations for a Calculus of Broadcasting Systems.",
                    "Delayed choice for process algebra with abstraction.",
                    "CTR: A Calculus of Timed Refinement.",
                    "Temporal Logic + Timed Automata: Expressiveness and Decidability."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "5th CONCUR 1994",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1994",
                "sub_name": "CONCUR '94, Concurrency Theory, 5th International Conference, Uppsala, Sweden, August 22-25, 1994, Proceedings.",
                "count": 37,
                "papers": [
                    "Geometry of Interaction (Abstract).",
                    "A Compositional Semantics for Statecharts using Labeled Transition Systems.",
                    "On the Decidability of Non-Interleaving Process Equivalences.",
                    "Regularity of BPA-Systems is Decidable.",
                    "A Fast Algorithm for Deciding Bisimilarity of Normed Context-Free Processes.",
                    "Model-Based Verification Methods and Tools (Abstract).",
                    "New Results on the Analysis of Concurrent Systems with an Infinite Number of Processes.",
                    "Verification of Nonregular Temporal Properties for Context-Free Processes.",
                    "Pushdown Processes: Parallel Composition and Model Checking.",
                    "Local Model Checking for Parallel Compositions of Context-Free Processes.",
                    "The Logical Structure of Concurrent Constraint Programming Languages (Abstract).",
                    "Countable Non-Determinism and Uncountable Limits.",
                    "SProc Categorically.",
                    "From Timed Graphs to Hybrid Automata (Abstract).",
                    "Hierarchical Models of Synchronous Circuits (Abstract).",
                    "The Observational Power of Clocks.",
                    "A Dynamic Approach to Timed Behaviour.",
                    "Algebras of Processes of Timed Petri Nets.",
                    "Operational Semantics for the Petri Box Calculus.",
                    "Weak Sequential Composition in Process Algebras.",
                    "Efficient Parallelism vs Reliable Distribution: A Trade-off for Concurrent Computations.",
                    "On Unifying Assumption-Commitment Style Proof Rules for Concurrency.",
                    "Liveness and Fairness in Duration Calculus.",
                    "A Symbolic Semantics for the pi-calculus (Extended Abstract).",
                    "On Bisimulation in the pi-calculus.",
                    "Characterizing Bisimulation Congruence in the pi-Calculus (Extended Abstract).",
                    "The Limit View of Infinite Computations.",
                    "Trace Refinement of Action Systems.",
                    "Bisimulation for Models in Concurrency.",
                    "Invariants in Process Algebra with Data.",
                    "Testing-Based Abstractions for Value-Passing Systems.",
                    "A Congruence Theorem for Structured Operational Semantics with Predicates and Negative Premises.",
                    "Deriving Complete Inference Systems for a Class of GSOS Languages Generation Regular Behaviours.",
                    "Process Algebra with Partial Choice.",
                    "Probabilistic Simulations for Probabilistic Processes.",
                    "Fully Abstract Characterizations of Testing Preorders for Probabilistic Processes.",
                    "Composition and Behaviors of Probabilistic I/O Automata."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th CONCUR 1993",
        "info": "Hildesheim, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1993",
                "sub_name": "CONCUR '93, 4th International Conference on Concurrency Theory, Hildesheim, Germany, August 23-26, 1993, Proceedings.",
                "count": 37,
                "papers": [
                    "The Lambda-Calculus with Multiplicities (Abstract).",
                    "A Multiset Semantics for the pi-Calculus with Replication.",
                    "Model Checking Mobile Processes.",
                    "A Practical Technique for Process Abstraction.",
                    "Modular Completeness for Communication Closed Layers.",
                    "The Linear Time - Branching Time Spectrum II.",
                    "A Classification of Models for Concurrency.",
                    "On the Ill-Timed but Well-Caused.",
                    "On the Reduction of Chocs Bisimulation to pi-Calculus Bisimulation.",
                    "A Theory of Bisimulation for the pi-Calculus.",
                    "Bisimulation Equivalence is Decidable for Basic Parallel Processes.",
                    "A pi-Calculus Semantics for an Object-Based Design Notation.",
                    "Programming with Broadcasts.",
                    "Interpreting Broadcast Communication in SCCS.",
                    "Proof Systems for Message-Passing Process Algebras.",
                    "Refinement and Decomposition of Value-Passing Action Systems.",
                    "Partial-Order Methods for Temporal Verification.",
                    "Model Construction for Implicit Specifications in Model Logic.",
                    "Branching Time Temporal Logic and Amorphous Tree Automata.",
                    "A Generalized Event Structure for the Muller Unfolding of a Safe Net.",
                    "Domains of Higher-Dimensional Automata.",
                    "Non Interleaving Process Algebra.",
                    "Quiescence, Fairness, Testing, and the Notion of Implementation (Extended Abstract).",
                    "Two Fully Abstract Models for UNITY.",
                    "Transformations Preserving Properties and Properties Preserved by Transformations in Fair Transition Systems (Extended Abstract).",
                    "Minimal Memory Schedules for Dataflow Networks.",
                    "Networks of Real-Time Processes.",
                    "Loop Parallelization in the Polytope Model.",
                    "ACSR: An Algebra of Communicating Shared Resources with Dense Time and Priorities.",
                    "An Elimination Theorem for Regular Behaviours with Integration.",
                    "A Linear Local Model Checking Algorithm for CTL.",
                    "Local Event Structures and Petri Nets.",
                    "A Congruence Theorem for Structured Operational Semantics with Predicates.",
                    "From CML to Process Algebras (Extended Abstract).",
                    "Types for Dyadic Interaction.",
                    "Principal Typing Schemes in a Polyadic pi-Calculus.",
                    "Structured Operational Sematics for Process Algebras and Equational Axiom Systems."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3rd CONCUR 1992",
        "info": "Stony Brook, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1992",
                "sub_name": "CONCUR '92, Third International Conference on Concurrency Theory, Stony Brook, NY, USA, August 24-27, 1992, Proceedings.",
                "count": 39,
                "papers": [
                    "The Polyadic Pi-calculus (Abstract).",
                    "Testing Equivalence for Mobile Processes (Extended Abstract).",
                    "Testing Equivalence for Petri Nets with Action Refinement: Preliminary Report.",
                    "The Problem of \"Weak Bisimulation up to\".",
                    "On the Uniqueness of Fixpoints Modulo Observation Congruence.",
                    "Verification of Parallel Systems via Decomposition.",
                    "Interface Refinement in Reactive Systems (Extended Abstract).",
                    "Concurrent Testing of Processes (Extended Abstract).",
                    "A Theory of Process with Localities (Extended Abstract).",
                    "Model Checking for Context-Free Processes.",
                    "Bisimulation Equivalence is Decidable for all Context-Free Processes.",
                    "Distributed Bisimularity is Decidable for a Class of Infinite State-Space Systems.",
                    "How Vital is Liveness? Verifying Timing Properties of Reactive and Hybrid Systems (Extended Abstract).",
                    "Preserving Specific Properties in Programm Development: How to Debug Programs (Conference Version).",
                    "Sometimes 'Some' is as Good as 'All'.",
                    "The Weakest Compositional Semantic Equivalence Preserving Nexttime-less Linear temporal Logic.",
                    "Propositional Temporal Logics and Equivalences.",
                    "The Duality of TIme and Information.",
                    "Homology of Higher Dimensional Automata.",
                    "Posets for Configurations!",
                    "On the Semantics of Petri Nets.",
                    "Structural Operational Specifications and the Trace Automata.",
                    "At-Most-Once Message Delivery. A Case Study in Algorithm Verification.",
                    "Games I/O Automata Play (Extended Abstract).",
                    "Minimization of Timed Transition Systems.",
                    "Using CSP to Verify a Timed Protocol over a Fair Medium.",
                    "Timed Ethernet: Real-Time Formal Specification of Ethernet.",
                    "Implementing LOTOS Specifications by Communicating State Machines.",
                    "Discrete Time Process Algebra.",
                    "The Silent Step in Time.",
                    "Action Transducers and Timed Automata.",
                    "Compositional Verification of Probabilistic Processes.",
                    "Axiomization Probabilistic Processes: ACP with Generative Probabililties (Extended Abstract).",
                    "Embeddings Among Concurrent Programming Languages (Preliminary Version).",
                    "Logic of Trace Languages (Extended Abstract).",
                    "Multiway Synchronization Verified with Coupled Simulation.",
                    "Programming in a General Model of Synchronization.",
                    "Operational and Compositional Semantics of Synchronous Automaton Compositions.",
                    "Towards a Theory of Actor Computation."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd CONCUR 1991",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1991",
                "sub_name": "CONCUR '91, 2nd International Conference on Concurrency Theory, Amsterdam, The Netherlands, August 26-29, 1991, Proceedings.",
                "count": 37,
                "papers": [
                    "Formal Techniques for Parallel Object-Oriented Languages.",
                    "Causal Models for Rational Algebraic Processes.",
                    "Action and State-based Logics for Process Algebras.",
                    "A Tool Set for deciding Behavioral Equivalences.",
                    "Causality Based Models for the Design of Concurrent Systems.",
                    "Modal Logics for Mobile Processes.",
                    "Towards a Design Calculus for Communicationg Programs.",
                    "A Theory of Testing for ACP.",
                    "Real Space Process Algebra.",
                    "The Failure of Failures in a Paradigm for Asynchronous Communication.",
                    "Embedding as a Tool for Language Comparison: On the CSP Hierarchy.",
                    "A Conditional Operator for CCS.",
                    "Algebraic Formulations of Trace Theory.",
                    "Compositional Synthesis of Live and Bounded Free Choice Petri Nets.",
                    "The Observation Algebra of Spatial Pomsets.",
                    "Synchrony Loosening Transformations for Interacting Processes.",
                    "A Compositional Model for Layered Distributed Systems.",
                    "Process Algebra with Guards - Combining Hoare Logic with Process Algebra (Extended Abstract).",
                    "Model Checking and Modular Verification.",
                    "Geometric Logic, Causality and Event Structures.",
                    "Extended Horn Clauses: The Framework and Some Semantics.",
                    "Action Systems and Action Refinement in the Development of Parallel Systems - An Algebraic Approach.",
                    "Invariant Semantics of Nets with Inhibitor Arcs.",
                    "Abstract Timed Observation and Process Algebra.",
                    "Simulations Between Specifications of Distributed Systems.",
                    "Using Truth-Preserving Reductions to Improve the Clarity of Kripke-Models.",
                    "Completeness in Real Time Process Algebra.",
                    "Distributed CCS.",
                    "Time-Constrained Automata (Extended Abstract).",
                    "Relating Processes With Respect to Speed.",
                    "Testing, Betting and Timed True Concurrency.",
                    "Fairness in Models with True Concurrency.",
                    "Efficient Verification of Determinate Processes.",
                    "Experiments on Processes with Backtracking.",
                    "Some Finite-Graph Models for Process Algebra.",
                    "A Method for the Development of Totally Correct Shared-State Parallel Programs.",
                    "Reduced Labelled Transition Systems Save Verification Effort."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "1st CONCUR 1990",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1990",
                "sub_name": "CONCUR '90, Theories of Concurrency: Unification and Extension, Amsterdam, The Netherlands, August 27-30, 1990, Proceedings.",
                "count": 36,
                "papers": [
                    "Partial Order Semantics of Concurrent Programs (Abstract).",
                    "SCONE: A Simple Calculus of Nets.",
                    "Value-Passing in Process Algebras (Abstract).",
                    "Let's Make Models (Abstract).",
                    "Ideal Specification Formalism + Expressivity + Compositionality + Decidability + Testability + ...",
                    "An Axiomatization of Lamport's Temporal Logic of Actions.",
                    "Convergence of Iteration Systems (Extended Abstract).",
                    "Process Algebra with a Zero Object.",
                    "On the Asynchronous Nature of Communication in Concurrent Logic Languages: A Fully Abstract Model Based on Sequences.",
                    "Verifying Temporal Properties of Processes.",
                    "Testing Equivalences and Fully Abstract Models for Probabilistic Processes.",
                    "A Preorder for Partial Process Specifications.",
                    "Back and Forth Bisimulations.",
                    "Reduction and Design of Well-behaved Concurrent Systems.",
                    "Synthesis Rules for Petri Nets, and How they Lead to New Results.",
                    "The Need for Headers: An Impossibility Result for Communication over Unreliable Channels.",
                    "A Temporal Approach to Algebraic Specifications.",
                    "Superimposition for Interacting Processes.",
                    "An Implementation of a Translational Semantics for an Imperative Language.",
                    "CCSR: A Calculus for Communicating Shared Resources.",
                    "The Linear Time-Branching Time Spectrum (Extended Abstract).",
                    "A Programming Logic for Formal Concurent Systems.",
                    "A New Strategy for Proving omega-Completeness applied to Process Algebra.",
                    "Transition System Specifications with Negative Premises (Extended Abstract).",
                    "Delay-Insensitive Circuits: An Algebraic Approach to their Design.",
                    "Equivalences, Congruences, and Complete Axiomatizations for Probabilistic Processes.",
                    "Rewriting as a Unified Model of Concurrency.",
                    "A Temporal Calculus of Communicating Systems.",
                    "Proving Termination of Communicating Programs.",
                    "Factorization of Finite State Machines under Observational Equivalence.",
                    "Partial Order Logics for Elementary Net Systems: State- and Event-approaches.",
                    "Priority as Extremal Probability.",
                    "A Synchronous Calculus of Relative Frequency.",
                    "On the Compositional Checking of Validity (Extended Abstract).",
                    "Real-Time Behaviour of Asynchronous Agents.",
                    "Effective Solutions to Domain Equations - An Approach to Effective Denotational Semantics."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "Concurrency",
        "info": "Theory, Language, And Architecture 1989",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1989",
                "sub_name": "Concurrency: Theory, Language, And Architecture, UK/Japan Workshop, Oxford, UK, September 25-27, 1989, Proceedings.",
                "count": 18,
                "papers": [
                    "An Introduction to Modal and Temporal Logics for CCS.",
                    "Some Results on the pi-Calculus.",
                    "Analysing TMFS: a Study of Nondeterminism in Real-Time Concurrency.",
                    "Using the Temporal Logic RDL for Design Specifications.",
                    "Logic of Execution: An Outline.",
                    "Exception Handling and Real Time Features in an Object-Oriented Concurrent Language.",
                    "Reuse of Concurrent Object Descriptions.",
                    "The Computational Field Model for Open Distributed Environments.",
                    "Concurrent Programming in COB.",
                    "A Parallel Object Oriented Language FLENG++ and Its Control System on the Parallel Machine PIE64.",
                    "An Operational Semantics of ANDOR-II, A Parallel Logic Programming Language with AND- and OR- Parallelism.",
                    "Premature Return - Another Interpretation of the Future Construct.",
                    "Semantic Specifications for the Rewrite Rule Machine.",
                    "Graph Rewriting as a Computational Model.",
                    "An Ultra-Multiprocessing Machine Architecture for Efficient Parallel Execution of Functional Languages.",
                    "A Hierarchical Approach to Hardware Design.",
                    "Transformational Derivation of Systolic Arrays.",
                    "Locally Computable Coding for Unary Operations."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "Concurrency 1988",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1988",
                "sub_name": "Concurrency 88: International Conference on Concurrency, Hamburg, FRG, October 18-19, 1988, Proceedings.",
                "count": 26,
                "papers": [
                    "While Waiting for the Millennium: Formal Specification and Verficiation of Concurrent Systems Now (Abstract).",
                    "A Framework for the Synthesis of Reactive Modules.",
                    "Modelling Knowledge and Action in Distributed Systems.",
                    "Requirement and Design Specification for Distributed Systems.",
                    "Data Base Distribution and Concurrency for End-Users (Abstract).",
                    "On Safety and Timeliness in Distributed Data Management.",
                    "An Automata-Theoretic Approach to Protocol Verification (Abstract).",
                    "On the Power of Cooperative Concurrency.",
                    "Executing Temporal Logic: Review and Prospects (Abstract).",
                    "A Graphical Representation of Interval Logic.",
                    "Temporal Logic and Causality in Concurrent Systems.",
                    "Data in a Concurrent Environment.",
                    "The Scope and Limits of Synchronous Concurrent Computation.",
                    "A Logic-Functional Approach to the Execution of CCS Specifications Modulo Behavioural Equivalences.",
                    "A Top-down Step-wise Refinement Methodology for Protocol Specification.",
                    "A State Transformation Equivalence for Concurrent Systems: Exhibited Functionality-equivalence.",
                    "External Behaviour Equivalence between two Petri Nets.",
                    "Weighted Basic Petri Nets.",
                    "Total Algorithms.",
                    "Semancitcs of Real-time Distributed Programs.",
                    "An Example of Communicating Production Systems.",
                    "Assertional Verification of a Majority Consensus Algorithm for Concurrency Control in Multiple Copy Databases.",
                    "Analysis of ESTELLE Specifications.",
                    "Optimal Synchronization of ABD Networks.",
                    "Adequacy-Preserving Transformations of COSY Path Programs.",
                    "Deterministic Systems of Sequential Processes: Theory and Tools."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "Seminar on Concurrency 1984",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/concur/1984",
                "sub_name": "Seminar on Concurrency, Carnegie-Mellon University, Pittsburg, PA, USA, July 9-11, 1984.",
                "count": 25,
                "papers": [
                    "On the Axiomatic Treatment of Concurrency.",
                    "Hierarchical Development of Cncurrent Systems in a Temporal Logic Framework.",
                    "On the Composition and Decomposition of Assertions.",
                    "Process Algebra with Asynchronous Communication Mechanisms.",
                    "Axioms for Memory Access in Asynchronous Hardware Systems.",
                    "Executing Temporal Logic Programs.",
                    "The Static Derivation of Concurrency and its Mechanzed Certification.",
                    "Semantic Considerations in the Actor Paradigm of Concurrent Computation.",
                    "The Pomset Model of Parallel Processes: Unifying the Temporal and the Spatial.",
                    "Lectures on a Calculus for Communicating Systems.",
                    "Concurrent Behaviour: Sequences, Processes and Axioms.",
                    "Categories of Models for Concurrency.",
                    "Maximally Concurrent Evolution of Non-sequential Systems.",
                    "An Improved Failures Model for Communicating Processes.",
                    "Denotational Semantics for occam.",
                    "Linguistic Support of Receptionists for Shared Resources.",
                    "Applications of Topology to Semantics of Communicating Processes.",
                    "Denotational Models Based on Synchronously Communicating Processes: Refusal, Acceptance, Safety.",
                    "The ESTEREL Synchronous Programming Language and its Mathematical Semantics.",
                    "An Implementation Model of Rendezvous Communication.",
                    "A Fully Abstract Model of Fair Asynchrony.",
                    "Alternative Semantics for McCarthy's amb.",
                    "Semantics of Networks Containing Indeterminate Operators.",
                    "Abstract Interpretation and Indeterminacy.",
                    "The NIL Distributed Systems Programming Language: A Status Report."
                ]
            }
        ]
    }
]