[
    {
        "year": "2022",
        "name": "30th CSL 2022",
        "info": "Göttingen, Germany [virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2022",
                "sub_name": "30th EACSL Annual Conference on Computer Science Logic, CSL 2022, February 14-19, 2022, Göttingen, Germany (Virtual Conference).",
                "count": 38,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Between Deterministic and Nondeterministic Quantitative Automata (Invited Talk).",
                    "How to Develop an Intuition for Risk... and Other Invisible Phenomena (Invited Talk).",
                    "Simulation by Rounds of Letter-To-Letter Transducers.",
                    "Useful Open Call-By-Need.",
                    "Gardening with the Pythia A Model of Continuity in a Dependent Setting.",
                    "Weighted Automata and Expressions over Pre-Rational Monoids.",
                    "Optimal Strategies in Concurrent Reachability Games.",
                    "Finite-Memory Strategies in Two-Player Infinite Games.",
                    "Constructing the Space of Valuations of a Quasi-Polish Space as a Space of Ideals.",
                    "On the Complexity of SPEs in Parity Games.",
                    "Synthetic Integral Cohomology in Cubical Agda.",
                    "On the Minimisation of Transition-Based Rabin Automata and the Chromatic Memory Requirements of Muller Conditions.",
                    "Fuzzy Algebraic Theories.",
                    "Realising Intensional S4 and GL Modalities.",
                    "Localisable Monads.",
                    "An Internal Language for Categories Enriched over Generalised Metric Spaces.",
                    "MSO Undecidability for Hereditary Classes of Unbounded Clique Width.",
                    "Constructive Many-One Reduction from the Halting Problem to Semi-Unification.",
                    "Dynamic Cantor Derivative Logic.",
                    "Global Winning Conditions in Synthesis of Distributed Systems with Causal Memory.",
                    "Inferring Symbolic Automata.",
                    "Differential Games, Locality, and Model Checking for FO Logic of Graphs.",
                    "Cyclic Proofs for Transfinite Expressions.",
                    "Decidability for Sturmian Words.",
                    "Games, Mobile Processes, and Functions.",
                    "Parallelism in Soft Linear Logic.",
                    "Encoding Tight Typing in a Unified Framework.",
                    "Generalized Universe Hierarchies and First-Class Universe Levels.",
                    "Succinct Graph Representations of μ-Calculus Formulas.",
                    "Spatial Existential Positive Logics for Hyperedge Replacement Grammars.",
                    "Structural Properties of the First-Order Transduction Quasiorder.",
                    "BV and Pomset Logic Are Not the Same.",
                    "Revisiting Parameter Synthesis for One-Counter Automata.",
                    "First-Order Logic with Connectivity Operators.",
                    "Planar Realizability via Left and Right Applications.",
                    "Number of Variables for Graph Differentiation and the Resolution of GI Formulas.",
                    "Anti-Unification of Unordered Goals."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "29th CSL 2021",
        "info": "Ljubljana, Slovenia [virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2021",
                "sub_name": "29th EACSL Annual Conference on Computer Science Logic, CSL 2021, January 25-28, 2021, Ljubljana, Slovenia (Virtual Conference).",
                "count": 39,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "μ-Calculi with Atoms (Invited Talk).",
                    "Mathematical Structures in Dependent Type Theory (Invited Talk).",
                    "Branching in Well-Structured Transition Systems (Invited Talk).",
                    "Borel Sets in Reverse Mathematics (Invited Talk).",
                    "The Logic of Contextuality.",
                    "Factorize Factorization.",
                    "The Best a Monitor Can Do.",
                    "Are Two Binary Operators Necessary to Finitely Axiomatise Parallel Composition?",
                    "A Quasi-Polynomial Black-Box Algorithm for Fixed Point Evaluation.",
                    "Learning Concepts Described By Weight Aggregation Logic.",
                    "Open Bar - a Brouwerian Intuitionistic Logic with a Pinch of Excluded Middle.",
                    "Discounted-Sum Automata with Multiple Discount Factors.",
                    "Reachability in Distributed Memory Automata.",
                    "Pregrammars and Intersection Types.",
                    "Learning Automata and Transducers: A Categorical Approach.",
                    "Game Comonads & Generalised Quantifiers.",
                    "Semiring Provenance for Fixed-Point Logic.",
                    "Extension Preservation in the Finite and Prefix Classes of First Order Logic.",
                    "Realizability with Stateful Computations for Nonstandard Analysis.",
                    "Decidable Entailments in Separation Logic with Inductive Definitions: Beyond Establishment.",
                    "Church's Thesis and Related Axioms in Coq's Type Theory.",
                    "Computing Measure as a Primitive Operation in Real Number Computation.",
                    "A Partial Metric Semantics of Higher-Order Types and Approximate Program Transformations.",
                    "A Deep Quantitative Type System.",
                    "Categorifying Non-Idempotent Intersection Types.",
                    "The Alternating-Time μ-Calculus with Disjunctive Explicit Strategies.",
                    "On the Complexity of Horn and Krom Fragments of Second-Order Boolean Logic.",
                    "Domain Theory in Constructive and Predicative Univalent Foundations.",
                    "A Cyclic Proof System for HFL_ℕ.",
                    "Compositional Modelling of Network Games.",
                    "Canonization for Bounded and Dihedral Color Classes in Choiceless Polynomial Time.",
                    "Preservation Theorems Through the Lens of Topology.",
                    "Choiceless Computation and Symmetry: Limitations of Definability.",
                    "Typable Fragments of Polynomial Automatic Amortized Resource Analysis.",
                    "The Yoneda Reduction of Polymorphic Types.",
                    "Degrees of Ambiguity for Parity Tree Automata.",
                    "On Flat Lossy Channel Machines.",
                    "Realizability Without Symmetry."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th CSL 2020",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2020",
                "sub_name": "28th EACSL Annual Conference on Computer Science Logic, CSL 2020, January 13-16, 2020, Barcelona, Spain.",
                "count": 38,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Verification of Security Protocols (Invited Talk).",
                    "Symmetric Computation (Invited Talk).",
                    "Solving Word Equations (And Other Unification Problems) by Recompression (Invited Talk).",
                    "Strong Bisimulation for Control Operators (Invited Talk).",
                    "From Classical Proof Theory to P versus NP: a Guide to Bounded Theories (Invited Talk).",
                    "Generalized Connectives for Multiplicative Linear Logic.",
                    "On Free Completely Iterative Algebras.",
                    "Strongly Unambiguous Büchi Automata Are Polynomially Predictable With Membership Queries.",
                    "A Robust Class of Linear Recurrence Sequences.",
                    "Coverage and Vacuity in Network Formation Games.",
                    "A Complete Axiomatisation of a Fragment of Language Algebra.",
                    "Proof Complexity of Systems of (Non-Deterministic) Decision Trees and Branching Programs.",
                    "Internal Parametricity for Cubical Type Theory.",
                    "Unifying Cubical Models of Univalent Type Theory.",
                    "FO-Definability of Shrub-Depth.",
                    "Taylor expansion for Call-By-Push-Value.",
                    "Tangent Categories from the Coalgebras of Differential Categories.",
                    "Reverse Derivative Categories.",
                    "Internal Calculi for Separation Logics.",
                    "Monitoring Event Frequencies.",
                    "Automatic Equivalence Structures of Polynomial Growth.",
                    "Guarded Teams: The Horizontally Guarded Case.",
                    "Order-Invariant First-Order Logic over Hollow Trees.",
                    "Glueability of Resource Proof-Structures: Inverting the Taylor Expansion.",
                    "On the Union Closed Fragment of Existential Second-Order Logic and Logics with Team Semantics.",
                    "Expressive Logics for Coinductive Predicates.",
                    "State Space Reduction For Parity Automata.",
                    "Syntactic Interpolation for Tense Logics and Bi-Intuitionistic Logic via Nested Sequents.",
                    "The Keys to Decidable HyperLTL Satisfiability: Small Models or Very Simple Formulas.",
                    "Revisiting the Duality of Computation: An Algebraic Analysis of Classical Realizability Models.",
                    "Separation and Renaming in Nominal Sets.",
                    "Parity Games: Another View on Lehtinen's Algorithm.",
                    "De Jongh's Theorem for Intuitionistic Zermelo-Fraenkel Set Theory.",
                    "Computing Haar Measures.",
                    "The Call-By-Value Lambda-Calculus with Generalized Applications.",
                    "Dynamic Complexity Meets Parameterised Algorithms.",
                    "Dynamic Complexity of Parity Exists Queries."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "27th CSL 2018",
        "info": "Birmingham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2018",
                "sub_name": "27th EACSL Annual Conference on Computer Science Logic, CSL 2018, September 4-7, 2018, Birmingham, UK.",
                "count": 38,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "The Ackermann Award 2018.",
                    "Relating Structure and Power: Comonadic Semantics for Computational Resources.",
                    "Climbing up the Elementary Complexity Classes with Theories of Automatic Structures.",
                    "High-Level Signatures and Initial Semantics.",
                    "The True Concurrency of Herbrand's Theorem.",
                    "Cartesian Cubical Computational Type Theory: Constructive Reasoning with Paths and Equalities.",
                    "Definable Inapproximability: New Challenges for Duplicator.",
                    "Safety, Absoluteness, and Computability.",
                    "Combining Linear Logic and Size Types for Implicit Complexity.",
                    "Beyond Admissibility: Dominance Between Chains of Strategies.",
                    "Rule Algebras for Adhesive Categories.",
                    "Submodular Functions and Valued Constraint Satisfaction Problems over Infinite Domains.",
                    "Graphical Conjunctive Queries.",
                    "Approximating Probabilistic Automata by Regular Languages.",
                    "An Application of Parallel Cut Elimination in Unit-Free Multiplicative Linear Logic to the Taylor Expansion of Proof Nets.",
                    "Fully Abstract Models of the Probabilistic lambda-calculus.",
                    "Uniform Inductive Reasoning in Transitive Closure Logic via Infinite Descent.",
                    "A Recursion-Theoretic Characterisation of the Positive Polynomial-Time Functions.",
                    "Non-Wellfounded Proof Theory For (Kleene+Action)(Algebras+Lattices).",
                    "Symmetric Circuits for Rank Logic.",
                    "Beyond Polarity: Towards a Multi-Discipline Intermediate Language with Sharing.",
                    "Expressivity Within Second-Order Transitive-Closure Logic.",
                    "Quantifying Bounds in Strategy Logic.",
                    "A Fully Abstract Game Semantics for Countable Nondeterminism.",
                    "Dependency Concepts up to Equivalence.",
                    "Finite Bisimulations for Dynamical Systems with Overlapping Trajectories.",
                    "A Contextual Reconstruction of Monadic Reflection.",
                    "An Algebraic Decision Procedure for Two-Variable Logic with a Between Relation.",
                    "Basic Operational Preorders for Algebraic Effects in General, and for Combined Probability and Nondeterminism in Particular.",
                    "Canonical Models and the Complexity of Modal Team Logic.",
                    "A Decidable Fragment of Second Order Logic With Applications to Synthesis.",
                    "Quantitative Foundations for Resource Theories.",
                    "On Compositionality of Dinatural Transformations.",
                    "Synthesizing Optimally Resilient Controllers.",
                    "Local Validity for Circular Proofs in Linear Logic with Fixed Points.",
                    "Parity Games with Weights.",
                    "MacNeille Completion and Buchholz' Omega Rule for Parameter-Free Second Order Logics."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "26th CSL 2017",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2017",
                "sub_name": "26th EACSL Annual Conference on Computer Science Logic, CSL 2017, August 20-24, 2017, Stockholm, Sweden.",
                "count": 43,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization, External Reviewers.",
                    "The Ackermann Award 2017.",
                    "Schema Mappings: Structural Properties and Limits (Invited Talk).",
                    "First-Order Interpolation and Grey Areas of Proofs (Invited Talk).",
                    "Current Trends and New Perspectives for First-Order Model Checking (Invited Talk).",
                    "Arithmetic Circuits: An Overview (Invited Talk).",
                    "Determinacy of Infinite Games: Perspectives of the Algorithmic Approach (Invited Talk).",
                    "Symbolic Automata Theory with Applications (Invited Talk).",
                    "Categorical Structures for Type Theory in Univalent Foundations.",
                    "Removing Cycles from Proofs.",
                    "Query Learning of Derived Omega-Tree Languages in Polynomial Time.",
                    "Extending Two-Variable Logic on Trees.",
                    "On the (In)Succinctness of Muller Automata.",
                    "Stone Duality and the Substitution Principle.",
                    "A Decidable Intuitionistic Temporal Logic.",
                    "Decidable Logics with Associative Binary Modalities.",
                    "Noetherian Quasi-Polish spaces.",
                    "Fast(er) Reasoning in Interval Temporal Logic.",
                    "Improved Set-Based Symbolic Algorithms for Parity Games.",
                    "Slicewise Definability in First-Order Logic with Bounded Quantifier Rank.",
                    "Integral Categories and Calculus Categories.",
                    "Partial Elements and Recursion via Dominances in Univalent Type Theory.",
                    "Polishness of Some Topologies Related to Automata.",
                    "Separating Functional Computation from Relations.",
                    "Diagrammatic Semantics for Digital Circuits.",
                    "Precongruence Formats with Lookahead through Modal Decomposition.",
                    "Capturing Logarithmic Space and Polynomial Time on Chordal Claw-Free Graphs.",
                    "The Model-Theoretic Expressiveness of Propositional Proof Systems.",
                    "Validity and Entailment in Modal and Propositional Dependence Logics.",
                    "CALF: Categorical Automata Learning Framework.",
                    "Modal mu-Calculus with Atoms.",
                    "The Power of the Filtration Technique for Modal Logics with Team Semantics.",
                    "The Dynamic Geometry of Interaction Machine: A Call-by-Need Graph Rewriter.",
                    "On Supergraphs Satisfying CMSO Properties.",
                    "Inductive and Functional Types in Ludics.",
                    "Advice Automatic Structures and Uniformly Automatic Classes.",
                    "Strongly Normalizing Audited Computation.",
                    "A Finitary Analogue of the Downward Löwenheim-Skolem Property.",
                    "Aleph1 and the Modal mu-Calculus.",
                    "Taylor Expansion, lambda-Reduction and Normalization.",
                    "On the First-Order Complexity of Induced Subgraph Isomorphism.",
                    "Strategies with Parallel Causes.",
                    "An Algebraic Approach to Valued Constraint Satisfaction."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "25th CSL 2016",
        "info": "Marseille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2016",
                "sub_name": "25th EACSL Annual Conference on Computer Science Logic, CSL 2016, August 29 - September 1, 2016, Marseille, France.",
                "count": 43,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization, External Reviewers.",
                    "The Ackermann Award 2016.",
                    "Infinite Domain Constraint Satisfaction Problem.",
                    "Automated Synthesis: Going Distributed.",
                    "Analytic Calculi for Non-Classical Logics: Theory and Applications.",
                    "Coalgebraic Learning.",
                    "The Matrix Ring of a μ-Continuous Chomsky Algebra is mu-Continuous.",
                    "Completeness for Coalgebraic Fixpoint Logic.",
                    "AC Dependency Pairs Revisited.",
                    "The Directed Homotopy Hypothesis.",
                    "Robust Linear Temporal Logic.",
                    "Models of Lambda-Calculus and the Weak MSO Logic.",
                    "On the Parallel Complexity of Bisimulation on Finite Systems.",
                    "Monadic Second Order Finite Satisfiability and Unbounded Tree-Width.",
                    "Dependence Logic vs. Constraint Satisfaction.",
                    "Quantified Constraint Satisfaction on Monoids.",
                    "Non-Homogenizable Classes of Finite Structures.",
                    "Context-Free Graph Properties via Definable Decompositions.",
                    "Successor-Invariant First-Order Logic on Graphs with Excluded Topological Subgraphs.",
                    "Definability of Cai-Fürer-Immerman Problems in Choiceless Polynomial Time.",
                    "Descriptive Complexity of #AC0 Functions.",
                    "Extending Homotopy Type Theory with Strict Equality.",
                    "The Seifert-van Kampen Theorem in Homotopy Type Theory.",
                    "Guarded Cubical Type Theory: Path Equality for Guarded Recursion.",
                    "Axioms for Modelling Cubical Type Theory in a Topos.",
                    "Bar Recursion in Classical Realisability: Dependent Choice and Continuum Hypothesis.",
                    "Extracting Non-Deterministic Concurrent Programs.",
                    "Polymorphic Game Semantics for Dynamic Binding.",
                    "High-Quality Synthesis Against Stochastic Environments.",
                    "Hedging Bets in Markov Decision Processes.",
                    "Minimizing Regret in Discounted-Sum Games.",
                    "Easy to Win, Hard to Master: Optimal Strategies in Parity Games with Costs.",
                    "A Sequent Calculus for a Modal Logic on Finite Data Trees.",
                    "Axiomatizations for Propositional and Modal Team Logic.",
                    "Semantics for \"Enough-Certainty\" and Fitting's Embedding of Classical Logic in S4.",
                    "Counting in Team Semantics.",
                    "The Logical Strength of Büchi's Decidability Theorem.",
                    "The Height of Piecewise-Testable Languages with Applications in Logical Complexity.",
                    "One-Dimensional Logic over Words.",
                    "Quine's Fluted Fragment is Non-Elementary.",
                    "Free-Cut Elimination in Linear Logic and an Application to a Feasible Arithmetic.",
                    "The Relational Model Is Injective for Multiplicative Exponential Linear Logic.",
                    "Infinitary Proof Theory: the Multiplicative Additive Case."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "24th CSL 2015",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2015",
                "sub_name": "24th EACSL Annual Conference on Computer Science Logic, CSL 2015, September 7-10, 2015, Berlin, Germany.",
                "count": 44,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organisation, External Reviewers.",
                    "The Ackermann Award 2015.",
                    "The Prophecy of Timely Rollback (Invited Talk).",
                    "Temporal Logics with Local Constraints (Invited Talk).",
                    "Thinking Algorithmically About Impossibility (Invited Talk).",
                    "Simple Parsimonious Types and Logarithmic Space.",
                    "First-Order Queries on Finite Abelian Groups.",
                    "A Definability Dichotomy for Finite Valued CSPs.",
                    "Evidence for Fixpoint Logic.",
                    "Elementary Elimination of Prenex Cuts in Disjunction-free Intuitionistic Logic.",
                    "Tree Grammars for the Elimination of Non-prenex Cuts.",
                    "Automata Theoretic Account of Proof Search.",
                    "Maximal Partition Logic: Towards a Logical Characterization of Copyless Cost Register Automata.",
                    "Aperiodic Two-way Transducers and FO-Transductions.",
                    "On Relative and Probabilistic Finite Counterability.",
                    "A Model Checking Procedure for Interval Temporal Logics based on Track Representatives.",
                    "Contextuality, Cohomology and Paradox.",
                    "A Model for Behavioural Properties of Higher-order Programs.",
                    "Reachability Analysis of First-order Definable Pushdown Systems.",
                    "Relational Semantics of Linear Logic and Higher-order Model Checking.",
                    "A Van Benthem Theorem for Modal Team Semantics.",
                    "Axiomatizing Propositional Dependence Logics.",
                    "Static Analysis for Logic-based Dynamic Programs.",
                    "Sub-classical Boolean Bunched Logics and the Meaning of Par.",
                    "Classical and Intuitionistic Arithmetic with Higher Order Comprehension Coincide on Inductive Well-Foundedness.",
                    "Functions out of Higher Truncations.",
                    "Leaving the Nest: Nominal Techniques for Variables with Interleaving Scopes.",
                    "Rank Logic is Dead, Long Live Rank Logic!.",
                    "Two-Restricted One Context Unification is in Polynomial Time.",
                    "Confluence of Layered Rewrite Systems.",
                    "A Unified Approach to Boundedness Properties in MSO.",
                    "Deciding the First Levels of the Modal mu Alternation Hierarchy by Formula Construction.",
                    "Infinite and Bi-infinite Words with Decidable Monadic Theories.",
                    "A Coalgebraic Decision Procedure for WS1S.",
                    "Weak Subgame Perfect Equilibria and their Application to Quantitative Reachability.",
                    "What are Strategies in Delay Games? Borel Determinacy for Games with Lookahead.",
                    "On Unambiguous Regular Tree Languages of Index (0, 2).",
                    "Least and Greatest Fixed Points in Ludics.",
                    "Modelling Coeffects in the Relational Semantics of Linear Logic.",
                    "On Classical PCF, Linear Logic and the MIX Rule.",
                    "Uniform One-Dimensional Fragments with One Equivalence Relation.",
                    "Finite-Degree Predicates and Two-Variable First-Order Logic.",
                    "Two-variable Logic with Counting and a Linear Order.",
                    "Binding Forms in First-Order Logic."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "23rd CSL - 29th LICS 2014",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2014",
                "sub_name": "Joint Meeting of the Twenty-Third EACSL Annual Conference on Computer Science Logic (CSL) and the Twenty-Ninth Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), CSL-LICS '14, Vienna, Austria, July 14 - 18, 2014.",
                "count": 80,
                "papers": [
                    "Trade-off analysis meets probabilistic model checking.",
                    "Abstract interpretation: past, present and future.",
                    "Understanding biology through logic.",
                    "Computer-checked mathematics: a formal proof of the odd order theorem.",
                    "The Ackermann award 2014.",
                    "Citations for the test-of-time award from 1994.",
                    "Infinite-state energy games.",
                    "Beta reduction is invariant, indeed.",
                    "Regular combinators for string transformations.",
                    "Asymptotic behaviour in temporal logic.",
                    "Weight monitoring with linear temporal logic: complexity and decidability.",
                    "Graph logics with rational relations: the role of word combinatorics.",
                    "Effective interpolation and preservation in guarded logics.",
                    "On the discriminating power of passivation and higher-order interaction.",
                    "A domain-theoretic approach to Brownian motion and general continuous stochastic processes.",
                    "Two-way cost automata and cost logics over infinite trees.",
                    "Decomposition theorems and model-checking for the modal μ-calculus.",
                    "Logic for communicating automata with parameterized topology.",
                    "Logical characterization of weighted pebble walking automata.",
                    "Coinduction up-to in a fibrational setting.",
                    "Model checking existential logic on partially ordered sets.",
                    "Zero-reachability in probabilistic multi-counter automata.",
                    "The complexity of admissibility in Omega-regular games.",
                    "On the characterization of models of H.",
                    "A decision procedure for satisfiability in separation logic with inductive predicates.",
                    "Secure equilibria in weighted games.",
                    "Weak MSO: automata and expressiveness modulo bisimilarity.",
                    "Symmetry in concurrent games.",
                    "Decidability of weak logics with deterministic transitive closure.",
                    "Equality and fixpoints in the calculus of structures.",
                    "The tractability frontier of graph-like first-order query sets.",
                    "One hierarchy spawns another: graph deconstructions and the complexity classification of conjunctive queries.",
                    "On the total variation distance of labelled Markov chains.",
                    "System F with coercion constraints.",
                    "The geometry of synchronization.",
                    "On the pigeonhole and related principles in deep inference and monotone systems.",
                    "Expressive completeness of separation logic with two variables and no separating conjunction.",
                    "A new correctness criterion for MLL proof nets.",
                    "On periodically iterated morphisms.",
                    "Pattern logics and auxiliary relations.",
                    "Substitution, jumps, and algebraic effects.",
                    "Satisfiability modulo counting: a new approach for analyzing privacy properties.",
                    "Achieving new upper bounds for the hypergraph duality problem through logic.",
                    "KAT + B!",
                    "Symmetric normalisation for intuitionistic logic.",
                    "Equilibria of concurrent games on event structures.",
                    "Subclasses of presburger arithmetic and the weak EXP hierarchy.",
                    "Senescent ground tree rewrite systems.",
                    "Preservation and decomposition theorems for bounded degree structures.",
                    "No proof nets for MLL with units: proof equivalence in MLL is PSPACE-complete.",
                    "Abstract interpretation from Büchi automata.",
                    "Memoryful geometry of interaction: from coalgebraic components to algebraic effects.",
                    "Axioms and decidability for type isomorphism in the presence of sums.",
                    "Functional reactive types.",
                    "Probably safe or live.",
                    "A quest for algorithmically random infinite structures.",
                    "On the succinctness of query rewriting over shallow ontologies.",
                    "Turing machines with atoms, constraint satisfaction problems, and descriptive complexity.",
                    "Local temporal reasoning.",
                    "On Hanf-equivalence and the number of embeddings of small induced subgraphs.",
                    "Non-elementary complexities for branching VASS, MELL, and extensions.",
                    "Infinite sequential games with real-valued payoffs.",
                    "Hyper-Ackermannian bounds for pushdown vector addition systems.",
                    "Transition systems over games.",
                    "Compositional verification of termination-preserving refinement of concurrent programs.",
                    "Eilenberg-MacLane spaces in homotopy type theory.",
                    "MSO queries on trees: enumerating answers under updates.",
                    "On the computing power of +, -, and ×.",
                    "On the Hoare theory of monadic recursion schemes.",
                    "Formulae-as-types for an involutive negation.",
                    "A type theory for productive coprogramming via guarded recursion.",
                    "Deadlock and lock freedom in the linear π-calculus.",
                    "On context semantics and interaction nets.",
                    "Anchored LTL separation.",
                    "Separating regular languages with first-order logic.",
                    "Logics with counting and equivalence.",
                    "A functional functional interpretation.",
                    "Compositional higher-order model checking via ω-regular games over Böhm trees.",
                    "Finite-memory strategy synthesis for robust multidimensional mean-payoff objectives.",
                    "Faster decision of first-order graph properties."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "CSL 2013",
        "info": "Torino, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2013",
                "sub_name": "Computer Science Logic 2013 (CSL 2013), CSL 2013, September 2-5, 2013, Torino, Italy.",
                "count": 43,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Conference Organization.",
                    "The Ackermann Award 2013.",
                    "Res Publica: The Universal Model of Computation (Invited Talk).",
                    "Three lightings of logic (Invited Talk).",
                    "From determinism, non-determinism and alternation to recursion schemes for P, NP and Pspace (Invited Talk).",
                    "Means and Limits of Decision (Invited Talk).",
                    "On closure ordinals for the modal mu-calculus.",
                    "Realizability and Strong Normalization for a Curry-Howard Interpretation of HA + EM1.",
                    "Bounds for the quantifier depth in finite-variable logics: Alternation hierarchy.",
                    "Unambiguity and uniformization problems on infinite trees.",
                    "A characterization of the Taylor expansion of lambda-terms.",
                    "Team building in dependence.",
                    "Saturation-Based Model Checking of Higher-Order Recursion Schemes.",
                    "Descriptive complexity of approximate counting CSPs.",
                    "What is Decidable about Partially Observable Markov Decision Processes with omega-Regular Objectives.",
                    "Infinite-state games with finitary conditions.",
                    "Annotation-Free Sequent Calculi for Full Intuitionistic Linear Logic.",
                    "Deciding the weak definability of Büchi definable tree languages.",
                    "Innocent Game Semantics via Intersection Type Assignment Systems.",
                    "Cuts for circular proofs: semantics and cut-elimination.",
                    "Hierarchies in independence logic.",
                    "Inclusion Logic and Fixed Point Logic.",
                    "Theories for Subexponential-size Bounded-depth Frege Proofs.",
                    "The Structure of Interaction.",
                    "The Fixed-Parameter Tractability of Model Checking Concurrent Systems.",
                    "One-variable first-order linear temporal logics with counting.",
                    "On the locality of arb-invariant first-order logic with modulo counting quantifiers.",
                    "When is Metric Temporal Logic Expressively Complete?.",
                    "Proving Strong Normalisation via Non-deterministic Translations into Klop's Extended lambda-Calculus.",
                    "Kleene Algebra with Products and Iteration Theories.",
                    "Internalizing Relational Parametricity in the Extensional Calculus of Constructions.",
                    "Modal Logic and Distributed Message Passing Automata.",
                    "Global semantic typing for inductive and coinductive computing.",
                    "Two-Variable Logic on 2-Dimensional Structures.",
                    "Categorical Duality Theory: With Applications to Domains, Convexity, and the Distribution Monad.",
                    "Axiomatizing Subtyped Delimited Continuations.",
                    "On dialogue games and coherent strategies.",
                    "Elementary Modal Logics over Transitive Structures.",
                    "A Fully Abstract Game Semantics for Parallelism with Non-Blocking Synchronization on Shared Variables.",
                    "Extracting Herbrand trees in classical realizability using forcing.",
                    "The Complexity of Abduction for Equality Constraint Languages.",
                    "A New Type Assignment for Strongly Normalizable Terms.",
                    "Semantics of Intensional Type Theory extended with Decidable Equational Theories."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "26th CSL 2012",
        "info": "Fontainebleau, France",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2012",
                "sub_name": "Computer Science Logic (CSL'12) - 26th International Workshop/21st Annual Conference of the EACSL, CSL 2012, September 3-6, 2012, Fontainebleau, France.",
                "count": 41,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Conference Organization.",
                    "A Syntactical Approach to Weak omega-Groupoids.",
                    "The Ackermann Award 2012.",
                    "Sharing Distributed Knowledge on the Web (Invited Talk).",
                    "Connecting Complexity Classes, Weak Formal Theories, and Propositional Proof Systems (Invited Talk).",
                    "Satisfiability: where Theory meets Practice (Invited Talk).",
                    "Definability and Complexity of Graph Parameters (Invited Talk).",
                    "Interactive Realizability for Classical Peano Arithmetic with Skolem Axioms.",
                    "Relational Parametricity for Higher Kinds.",
                    "Higher-Order Interpretations and Program Complexity.",
                    "Knowledge Spaces and the Completeness of Learning Strategies.",
                    "Bounded Satisfiability for PCTL.",
                    "A Concurrent Logical Relation.",
                    "Equivalence Constraint Satisfaction Problems.",
                    "A Negative Conjunctive Query is Easy if and only if it is Beta-Acyclic.",
                    "On the equational consistency of order-theoretic models of the lambda-calculus.",
                    "Faster Algorithms for Alternating Refinement Relations.",
                    "A Systematic Approach to Canonicity in the Classical Sequent Calculus.",
                    "ML with PTIME complexity guarantees.",
                    "Definability of linear equation systems over groups and rings.",
                    "Cut Reduction in Linear Logic as Asynchronous Session-Typed Communication.",
                    "Bounded Combinatory Logic.",
                    "Collapsing non-idempotent intersection types.",
                    "Descriptive complexity for pictures languages.",
                    "Pebble Games and Linear Equations.",
                    "Banach-Mazur Games with Simple Winning Strategies.",
                    "Herbrand-Confluence for Cut Elimination in Classical First Order Logic.",
                    "A Computational Interpretation of the Axiom of Determinacy in Arithmetic.",
                    "Church-Rosser Properties of Normal Rewriting.",
                    "A Counting Logic for Structure Transition Systems.",
                    "Parametricity in an Impredicative Sort.",
                    "Two-Variable Universal Logic with Transitive Closure.",
                    "Connection Matrices and the Definability of Graph Parameters.",
                    "The FO2 alternation hierarchy is decidable.",
                    "Axiomatizing proof tree concepts in Bounded Arithmetic.",
                    "Isomorphisms of scattered automatic linear orders.",
                    "Undecidable First-Order Theories of Affine Geometries.",
                    "Towards CERes in intuitionistic logic.",
                    "Variants of Collapsible Pushdown Systems.",
                    "A Proof of Kamp's theorem.",
                    "Commutative Data Automata."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "25th CSL 2011",
        "info": "Bergen, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2011",
                "sub_name": "Computer Science Logic, 25th International Workshop / 20th Annual Conference of the EACSL, CSL 2011, September 12-15, 2011, Bergen, Norway, Proceedings.",
                "count": 43,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Conference Organization.",
                    "Resource Lambda-Calculus: the Differential Viewpoint.",
                    "The Freedoms of Guarded Bisimulation.",
                    "Branching vs. Linear Time: Semantical Perspective.",
                    "Ontology-Based Data Access and Constraint Satisfaction.",
                    "Power-Set Functors and Saturated Trees.",
                    "Transfinite Update Procedures for Predicative Systems of Analysis.",
                    "A Non-Standard Semantics for Kahn Networks in Continuous Time.",
                    "Filter Models: Non-idempotent Intersection Types, Orthogonality and Polymorphism.",
                    "Algebraic Characterization of FO for Scattered Linear Orderings.",
                    "Determinizing Discounted-Sum Automata.",
                    "Full Abstraction for Resource Calculus with Tests.",
                    "Tight Upper Bounds for Streett and Parity Complementation.",
                    "A Decidable Quantified Fragment of Set Theory Involving Ordered Pairs with Applications to Description Logics.",
                    "Continuous Markovian Logic - From Complete Axiomatization to the Metric Space of Formulas.",
                    "The Focused Calculus of Structures.",
                    "A Semantic Approach to Illative Combinatory Logic.",
                    "Enumeration Complexity of Logical Query Problems with Second-order Variables.",
                    "On Constraint Satisfaction Problems below P.",
                    "Non-Definability Results for Randomised First-Order Logic.",
                    "System T and the Product of Selection Functions.",
                    "Unifying Büchi Complementation Constructions.",
                    "Degrees of Lookahead in Context-free Infinite Games.",
                    "L-Recursion and a new Logic for Logarithmic Space.",
                    "The Lax Braided Structure of Streaming I/O.",
                    "The Church Synthesis Problem with Metric.",
                    "A Pumping Lemma for Collapsible Pushdown Graphs of Level 2.",
                    "Decidability Issues for Two-Variable Logics with Several Linear Orders.",
                    "Coalgebraic Derivations in Logic Programming.",
                    "Trees in Trees: Is the Incomplete Information about a Tree Consistent?.",
                    "A Formal Theory for the Complexity Class Associated with the Stable Marriage Problem.",
                    "Relating Two Semantics of Locally Scoped Names.",
                    "Synthesis from Probabilistic Components.",
                    "Synthesizing Reactive Programs.",
                    "Concurrency Semantics for the Geiger-Paz-Pearl Axioms of Independence.",
                    "Axiomatizing the Quote.",
                    "Relative Completeness for Logics of Functional Programs.",
                    "The Exact Hardness of Deciding Derivational and Runtime Complexity.",
                    "A Category Theoretic View of Nondeterministic Recursive Program Schemes.",
                    "Step-Indexed Relational Reasoning for Countable Nondeterminism.",
                    "Algebraic Characterization of the Alternation Hierarchy in FO2[<] on Finite Words.",
                    "Non-Commutative Infinitary Peano Arithmetic.",
                    "Model Theory in Computer Science: My Own Recurrent Themes."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "24th CSL 2010",
        "info": "Brno, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2010",
                "sub_name": "Computer Science Logic, 24th International Workshop, CSL 2010, 19th Annual Conference of the EACSL, Brno, Czech Republic, August 23-27, 2010. Proceedings.",
                "count": 41,
                "papers": [
                    "Degrees of Security: Protocol Guarantees in the Face of Compromising Adversaries.",
                    "Definability in Games.",
                    "From Feasible Proofs to Feasible Computations.",
                    "Tree Dualities for Constraint Satisfaction.",
                    "Ordered Sets in the Calculus of Data Structures.",
                    "Abductive, Inductive and Deductive Reasoning about Resources.",
                    "Constraint Solving for Program Verification: Theory and Practice by Example.",
                    "Tableau Calculi for CSL\\mathcal{CSL} over minspaces.",
                    "A Resolution Mechanism for Prenex Gödel Logic.",
                    "Efficient Enumeration for Conjunctive Queries over X-underbar Structures.",
                    "A Formalisation of the Normal Forms of Context-Free Grammars in HOL4.",
                    "Automata vs. Logics on Data Words.",
                    "Graded Computation Tree Logic with Binary Coding.",
                    "Exact Exploration and Hanging Algorithms.",
                    "Embedding Deduction Modulo into a Prover.",
                    "Exponentials with Infinite Multiplicities.",
                    "Classical and Intuitionistic Subexponential Logics Are Equally Expressive.",
                    "On Slicewise Monotone Parameterized Problems and Optimal Proof Systems for TAUT.",
                    "A Logic of Sequentiality.",
                    "Environment and Classical Channels in Categorical Quantum Mechanics.",
                    "Formal Theories for Linear Algebra.",
                    "Energy and Mean-Payoff Games with Imperfect Information.",
                    "Randomisation and Derandomisation in Descriptive Complexity Theory.",
                    "Towards a Canonical Classical Natural Deduction System.",
                    "Coordination Logic.",
                    "Second-Order Equational Logic (Extended Abstract).",
                    "Fibrational Induction Rules for Initial Algebras.",
                    "A Sequent Calculus with Implicit Term Representation.",
                    "New Algorithm for Weak Monadic Second-Order Logic on Inductive Structures.",
                    "The Structural lambda-Calculus.",
                    "The Isomorphism Problem for omega-Automatic Trees.",
                    "Complexity Results for Modal Dependence Logic.",
                    "The Complexity of Positive First-Order Logic without Equality II: The Four-Element Case.",
                    "On the Computability of Region-Based Euclidean Logics.",
                    "Inductive-Inductive Definitions.",
                    "Quantified Differential Dynamic Logic for Distributed Hybrid Systems.",
                    "Untyping Typed Algebraic Structures and Colouring Proof Nets of Cyclic Linear Logic.",
                    "Two-Variable Logic with Two Order Relations - (Extended Abstract).",
                    "Signature Extensions Preserve Termination - An Alternative Proof via Dependency Pairs.",
                    "Coq Modulo Theory.",
                    "The Ackermann Award 2010."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "23rd CSL 2009",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2009",
                "sub_name": "Computer Science Logic, 23rd international Workshop, CSL 2009, 18th Annual Conference of the EACSL, Coimbra, Portugal, September 7-11, 2009. Proceedings.",
                "count": 40,
                "papers": [
                    "Algebra for Tree Languages.",
                    "Forcing and Type Theory.",
                    "Functional Interpretations of Intuitionistic Linear Logic.",
                    "Fixed-Point Definability and Polynomial Time.",
                    "Kleene's Amazing Second Recursion Theorem.",
                    "Typed Applicative Structures and Normalization by Evaluation for System Fomega.",
                    "Jumping Boxes.",
                    "Tree-Width for First Order Formulae.",
                    "Algorithmic Analysis of Array-Accessing Programs.",
                    "Decidable Relationships between Consistency Notions for Constraint Satisfaction Problems.",
                    "Cardinality Quantifiers in MLO over Trees.",
                    "From Coinductive Proofs to Exact Real Arithmetic.",
                    "On the Relation between Sized-Types Based Termination and Semantic Labelling.",
                    "Expanding the Realm of Systematic Proof Theory.",
                    "EXPTIME Tableaux for the Coalgebraic µ-Calculus.",
                    "On the Word Problem for SP{Sigma Pi}-Categories, and the Properties of Two-Way Communication.",
                    "Intersection, Universally Quantified, and Reference Types.",
                    "Linear Game Automata: Decidable Hierarchy Problems for Stripped-Down Alternating Tree Automata.",
                    "Enriching an Effect Calculus with Linear Types.",
                    "Degrees of Undecidability in Term Rewriting.",
                    "Upper Bounds on Stream I/O Using Semantic Interpretations.",
                    "Craig Interpolation for Linear Temporal Languages.",
                    "On Model Checking Boolean BI.",
                    "Efficient Type-Checking for Amortised Heap-Space Analysis.",
                    "Deciding the Inductive Validity of FOR ALL THERE EXISTS * Queries.",
                    "On the Parameterised Intractability of Monadic Second-Order Logic.",
                    "Automatic Structures of Bounded Degree Revisited.",
                    "Nondeterminism and Observable Sequentiality.",
                    "A Decidable Spatial Logic with Cone-Shaped Cardinal Directions.",
                    "Focalisation and Classical Realisability.",
                    "Decidable Extensions of Church's Problem.",
                    "Nested Hoare Triples and Frame Rules for Higher-Order Store.",
                    "A Complete Characterization of Observational Equivalence in Polymorphic lambda-Calculus with General References.",
                    "Non-Commutative First-Order Sequent Calculus.",
                    "Model Checking FO(R) over One-Counter Processes and beyond.",
                    "Confluence of Pure Differential Nets with Promotion.",
                    "Decision Problems for Nash Equilibria in Stochastic Games.",
                    "On the Complexity of Branching-Time Logics.",
                    "Nominal Domain Theory for Concurrency.",
                    "The Ackermann Award 2009."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "22nd CSL 2008",
        "info": "Bertinoro, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2008",
                "sub_name": "Computer Science Logic, 22nd International Workshop, CSL 2008, 17th Annual Conference of the EACSL, Bertinoro, Italy, September 16-19, 2008. Proceedings.",
                "count": 36,
                "papers": [
                    "The Computability Path Ordering: The End of a Quest.",
                    "The Joy of String Diagrams.",
                    "Model Transformations in Decidability Proofs for Monadic Theories.",
                    "Molecules as Automata.",
                    "An Infinite Automaton Characterization of Double Exponential Time.",
                    "Recursion Schemata for NCk.",
                    "Extensional Uniformity for Boolean Circuits.",
                    "Pure Pointer Programs with Iteration.",
                    "Quantified Positive Temporal Constraints.",
                    "Non-uniform Boolean Constraint Satisfaction Problems with Cardinality Constraint.",
                    "Fractional Collections with Cardinality Bounds, and Mixed Linear Arithmetic with Stars.",
                    "Continuous Fragment of the mu-Calculus.",
                    "On the Relations between the Syntactic Theories of lambda-mu-Calculi.",
                    "A Constructive Semantic Approach to Cut Elimination in Type Theories with Axioms.",
                    "Proving Infinitude of Prime Numbers Using Binomial Coefficients.",
                    "A Tight Karp-Lipton Collapse Result in Bounded Arithmetic.",
                    "A Calculus of Realizers for EM1 Arithmetic (Extended Abstract).",
                    "Quantitative Game Semantics for Linear Logic.",
                    "A Characterization of Hypercoherent Semantic Correctness in Multiplicative Additive Linear Logic.",
                    "An Indexed System for Multiplicative Additive Polarized Linear Logic.",
                    "A Characterisation of Lambda Definability with Sums Via TT-Closure Operators.",
                    "Superposition for Fixed Domains.",
                    "Non-finite Axiomatizability and Undecidability of Interval Temporal Logics with C, D, and T.",
                    "On the Almighty Wand.",
                    "On Counting Generalized Colorings.",
                    "The Descriptive Complexity of Parity Games.",
                    "An Optimal Strategy Improvement Algorithm for Solving Parity and Payoff Games.",
                    "Quantitative Languages.",
                    "Characterization of Logics over Ranked Tree Languages.",
                    "The Nesting-Depth of Disjunctive µ-Calculus for Tree Languages and the Limitedness Problem.",
                    "Upper Bounds on the Automata Size for Integer and Mixed Real and Integer Linear Arithmetic (Extended Abstract).",
                    "Syntactic Metatheory of Higher-Order Subtyping.",
                    "On Isomorphisms of Intersection Types.",
                    "Undecidability of Type-Checking in Domain-Free Typed Lambda-Calculi with Existence.",
                    "Type-Based Termination with Sized Products.",
                    "The Ackermann Award 2008."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "21st CSL 2007",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2007",
                "sub_name": "Computer Science Logic, 21st International Workshop, CSL 2007, 16th Annual Conference of the EACSL, Lausanne, Switzerland, September 11-15, 2007, Proceedings.",
                "count": 43,
                "papers": [
                    "Full Completeness: Interactive and Geometric Characterizations of the Space of Proofs (Abstract).",
                    "The Symbolic Approach to Repeated Games (Abstract).",
                    "Proofs, Programs and Abstract Complexity.",
                    "Model-Checking First-Order Logic: Automata and Locality.",
                    "Tightening the Exchange Rates Between Automata.",
                    "Precise Relational Invariants Through Strategy Iteration.",
                    "Omega-Regular Half-Positional Winning Conditions.",
                    "Clique-Width and Parity Games.",
                    "Logical Refinements of Church's Problem.",
                    "The Power of Counting Logics on Restricted Classes of Finite Structures.",
                    "Comparing the Expressive Power of Well-Structured Transition Systems.",
                    "There Exist Some omega -Powers of Any Borel Rank.",
                    "Satisfiability of a Spatial Logic with Tree Variables.",
                    "Forest Expressions.",
                    "MSO on the Infinite Binary Tree: Choice and Order.",
                    "Classical and Intuitionistic Logic Are Asymptotically Identical.",
                    "Qualitative Temporal and Spatial Reasoning Revisited.",
                    "On Acyclic Conjunctive Queries and Constant Delay Enumeration.",
                    "Integrating Linear Arithmetic into Superposition Calculus.",
                    "The Theory of Calculi with Explicit Substitutions Revisited.",
                    "A Soft Type Assignment System for lambda -Calculus.",
                    "Lambda Theories of Effective Lambda Models.",
                    "Typed Normal Form Bisimulation.",
                    "Not Enough Points Is Enough.",
                    "Classical Program Extraction in the Calculus of Constructions.",
                    "Building Decision Procedures in the Calculus of Inductive Constructions.",
                    "Structure Theorem and Strict Alternation Hierarchy for FO2 on Words.",
                    "On the Complexity of Reasoning About Dynamic Policies.",
                    "Relativizing Small Complexity Classes and Their Theories.",
                    "Subexponential Time and Fixed-Parameter Tractability: Exploiting the Miniaturization Mapping.",
                    "From Proofs to Focused Proofs: A Modular Proof of Focalization in Linear Logic.",
                    "Linear Realizability.",
                    "Correctness of Multiplicative (and Exponential) Proof Structures is NL -Complete.",
                    "Focusing and Polarization in Intuitionistic Logic.",
                    "Incorporating Tables into Proofs.",
                    "A Cut-Free and Invariant-Free Sequent Calculus for PLTL.",
                    "Unbounded Proof-Length Speed-Up in Deduction Modulo.",
                    "Propositional Logic for Circuit Classes.",
                    "Game Characterizations and the PSPACE-Completeness of Tree Resolution Space.",
                    "Continuous Previsions.",
                    "Bad Variables Under Control.",
                    "A Games Model of Bunched Implications.",
                    "The Ackermann Award 2007."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "20th CSL 2006",
        "info": "Szeged, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2006",
                "sub_name": "Computer Science Logic, 20th International Workshop, CSL 2006, 15th Annual Conference of the EACSL, Szeged, Hungary, September 25-29, 2006, Proceedings.",
                "count": 41,
                "papers": [
                    "Functorial Boxes in String Diagrams.",
                    "Some Results on a Game-Semantic Approach to Verifying Finitely-Presentable Infinite Structures (Extended Abstract).",
                    "Automata and Logics for Words and Trees over an Infinite Alphabet.",
                    "Nonmonotonic Logics and Their Algebraic Foundations.",
                    "Semi-continuous Sized Types and Termination.",
                    "Visibly Pushdown Automata: From Language Equivalence to Simulation and Bisimulation.",
                    "A Finite Semantics of Simply-Typed Lambda Terms for Infinite Runs of Automata.",
                    "The Power of Linear Functions.",
                    "Logical Omniscience Via Proof Complexity.",
                    "Verification of Ptime Reducibility for System F Terms Via Dual Light Affine Logic.",
                    "MSO Queries on Tree Decomposable Structures Are Computable with Linear Delay.",
                    "Abstracting Allocation.",
                    "Collapsibility in Infinite-Domain Quantified Constraint Satisfaction.",
                    "Towards an Implicit Characterization of NCk.",
                    "On Rational Trees.",
                    "Reasoning About States of Probabilistic Sequential Programs.",
                    "Concurrent Games with Tail Objectives.",
                    "Nash Equilibrium for Upward-Closed Objectives.",
                    "Algorithms for Omega-Regular Games with Imperfect Information, .",
                    "Relating Two Standard Notions of Secrecy.",
                    "Jump from Parallel to Sequential Proofs: Multiplicatives.",
                    "First-Order Queries over One Unary Function.",
                    "Infinite State Model-Checking of Propositional Dynamic Logics.",
                    "Weak Bisimulation Approximants.",
                    "Complete Problems for Higher Order Logics.",
                    "Solving Games Without Determinization.",
                    "Game Quantification on Automatic Structures and Hierarchical Model Checking Games.",
                    "An Algebraic Point of View on the Crane Beach Property.",
                    "A Sequent Calculus for Type Theory.",
                    "Universality Results for Models in Locally Boolean Domains.",
                    "Universal Structures and the Logic of Forbidden Patterns.",
                    "On the Expressive Power of Graph Logic.",
                    "Hoare Logic in the Abstract.",
                    "Normalization of IZF with Replacement.",
                    "Acyclicity and Coherence in Multiplicative Exponential Linear Logic.",
                    "Church Synthesis Problem with Parameters.",
                    "Decidable Theories of the Ordering of Natural Numbers with Unary Predicates.",
                    "Separation Logic for Higher-Order Store.",
                    "Satisfiability and Finite Model Property for the Alternating-Time mu-Calculus.",
                    "Space-Efficient Computation by Interaction.",
                    "The Ackermann Award 2006."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "19th CSL 2005",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2005",
                "sub_name": "Computer Science Logic, 19th International Workshop, CSL 2005, 14th Annual Conference of the EACSL, Oxford, UK, August 22-25, 2005, Proceedings.",
                "count": 39,
                "papers": [
                    "XML Navigation and Tarski's Relation Algebras.",
                    "Verification in Predicate Logic with Time: Algorithmic Questions.",
                    "Note on Formal Analogical Reasoning in the Juridical Context.",
                    "An Abstract Strong Normalization Theorem.",
                    "On Bunched Polymorphism.",
                    "Distributed Control Flow with Classical Modal Logic.",
                    "A Logic of Coequations.",
                    "A Semantic Formulation of TT-Lifting and Logical Predicates for Computational Metalanguage.",
                    "Order Structures on Böhm-Like Models.",
                    "Higher-Order Matching and Games.",
                    "Decidability of Type-Checking in the Calculus of Algebraic Constructions with Size Annotations.",
                    "On the Role of Type Decorations in the Calculus of Inductive Constructions.",
                    "L-Nets, Strategies and Proof-Nets.",
                    "Permutative Logic.",
                    "Focusing the Inverse Method for Linear Logic.",
                    "Towards a Typed Geometry of Interaction.",
                    "From Pebble Games to Tractability: An Ambidextrous Consistency Algorithm for Quantified Constraint Satisfaction.",
                    "An Algebraic Approach for the Unsatisfiability of Nonlinear Constraints.",
                    "Coprimality in Finite Models.",
                    "Towards a Characterization of Order-Invariant Queries over Tame Structures.",
                    "Decidability of Term Algebras Extending Partial Algebras.",
                    "Results on the Guarded Fragment with Equivalence or Transitive Relations.",
                    "The Modular Decomposition of Countable Graphs: Constructions in Monadic Second-Order Logic.",
                    "On the Complexity of Hybrid Logics with Binders.",
                    "The Complexity of Independence-Friendly Fixpoint Logic.",
                    "Closure Properties of Weak Systems of Bounded Arithmetic.",
                    "Transfinite Extension of the Mu-Calculus.",
                    "Bounded Model Checking of Pointer Programs.",
                    "PDL with Intersection and Converse Is Decidable.",
                    "On Deciding Topological Classes of Deterministic Tree Languages.",
                    "Complexity and Intensionality in a Type-1 Framework for Computable Analysis.",
                    "Computing with Sequences, Weak Topologies and the Axiom of Choice.",
                    "Light Functional Interpretation.",
                    "Feasible Proofs of Matrix Properties with Csanky's Algorithm.",
                    "A Propositional Proof System for Log Space.",
                    "Identifying Polynomial-Time Recursive Functions.",
                    "Confluence of Shallow Right-Linear Rewrite Systems.",
                    "The Ackermann Award 2005.",
                    "Clemens Lautemann: 1951-2005 An Obituary."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "18th CSL 2004",
        "info": "Karpacz, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2004",
                "sub_name": "Computer Science Logic, 18th International Workshop, CSL 2004, 13th Annual Conference of the EACSL, Karpacz, Poland, September 20-24, 2004, Proceedings.",
                "count": 38,
                "papers": [
                    "Notions of Average-Case Complexity for Random 3-SAT.",
                    "Abstract Interpretation of Proofs: Classical Propositional Calculus.",
                    "Applications of Craig Interpolation to Model Checking.",
                    "Bindings, Mobility of Bindings, and the \"generic judgments\"-Quantifier: An Abstract.",
                    "My (Un)Favourite Things.",
                    "On Nash Equilibria in Stochastic Games.",
                    "A Bounding Quantifier.",
                    "Parity and Exploration Games on Infinite Graphs.",
                    "Integrating Equational Reasoning into Instantiation-Based Theorem Proving.",
                    "Goal-Directed Methods for Lukasiewicz Logic.",
                    "A General Theorem on Termination of Rewriting.",
                    "Predicate Transformers and Linear Logic: Yet Another Denotational Model.",
                    "Structures for Multiplicative Cyclic Linear Logic: Deepness vs Cyclicity.",
                    "On Proof Nets for Multiplicative Linear Logic with Units.",
                    "The Boundary Between Decidability and Undecidability for Transitive-Closure Logics.",
                    "Game-Based Notions of Locality Over Finite Models.",
                    "Fixed Points of Type Constructors and Primitive Recursion.",
                    "On the Building of Affine Retractions.",
                    "Higher-Order Matching in the Linear lambda-calculus with Pairing.",
                    "A Dependent Type Theory with Names and Binding.",
                    "Towards Mechanized Program Verification with Separation Logic.",
                    "A Functional Scenario for Bytecode Verification of Resource Bounds.",
                    "Proving Abstract Non-interference.",
                    "Intuitionistic LTL and a New Characterization of Safety and Liveness.",
                    "Moving in a Crumbling Network: The Balanced Case.",
                    "Parameterized Model Checking of Ring-Based Message Passing Systems.",
                    "A Third-Order Bounded Arithmetic Theory for PSPACE.",
                    "Provably Total Primitive Recursive Functions: Theories with Induction.",
                    "Logical Characterizations of PSPACE.",
                    "The Logic of the Partial lambda-Calculus with Equality.",
                    "Complete Lax Logical Relations for Cryptographic Lambda-Calculi.",
                    "Subtyping Union Types.",
                    "Pfaffian Hybrid Systems.",
                    "Axioms for Delimited Continuations in the CPS Hierarchy.",
                    "Set Constraints on Regular Terms.",
                    "Unsound Theorem Proving.",
                    "A Space Efficient Implementation of a Tableau Calculus for a Logic with a Constructive Negation.",
                    "Automated Generation of Analytic Calculi for Logics with Linearity."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "17th CSL 2003",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2003",
                "sub_name": "Computer Science Logic, 17th International Workshop, CSL 2003, 12th Annual Conference of the EACSL, and 8th Kurt Gödel Colloquium, KGC 2003, Vienna, Austria, August 25-30, 2003, Proceedings.",
                "count": 48,
                "papers": [
                    "Deciding Monotonic Games.",
                    "The Commuting V-Diagram.",
                    "Concurrent Construction of Proof-Nets.",
                    "Back to the Future: Explicit Logic for Computer Science (Invited Lecture).",
                    "Constraint Satisfaction with Countable Homogeneous Templates.",
                    "Quantified Constraints: Algorithms and Complexity.",
                    "Verification of Infinite State Systems (Tutorial).",
                    "Parity of Imperfection of Fixing Independence.",
                    "Atomic Cut Elimination for classical Logic.",
                    "Computational Mathematics, Computational Logic, and Symbolic Computation (Invited Lecture).",
                    "Simple Stochastic Parity Games.",
                    "Machine Characterization of the Classes of the W-Hierarchy.",
                    "Extending the Dolev-Yao Intruder for Analyzing an Unbounded Number of Sessions.",
                    "On Relativisation and Complexity Gap.",
                    "Strong Normalization of the Typed gammaws-Calculus.",
                    "A Fixed-Point Logic with Symmetric Choice.",
                    "Positive Games and Persistent Strategies.",
                    "Generating All Abductive Explanations for Queries on Propositional Horn Theories.",
                    "Refined Complexity Analysis of Cut Elimination.",
                    "Comparing the Succinctness of Monadic Query Languages over Finite Trees.",
                    "The Arithmetical Complexity of Dimension and Randomness.",
                    "Towards a Proof System for Admissibility.",
                    "Program Complexity of Dynamic LTL Model Checking.",
                    "Coping Polynomially with Numerous but Identical Elements within Planning Problems.",
                    "On Algebraic Specifications of Abstract Data Types.",
                    "On the Complexity of Existential Pebble Games.",
                    "Computational Aspects of sigma-Definability over the Real Numbers without the Equality Test.",
                    "The Surprising Power of Restricted Programs and Gödel's Functionals.",
                    "Pebble Games on Trees.",
                    "Bistability: An Extensional Characterization of Sequentiality.",
                    "Automata on Lempel-ziv Compressed Strings.",
                    "Complexity of Some Problems in Modal and Intuitionistic Calculi.",
                    "Goal-Directed Calculli for Gödel-Dummett Logics.",
                    "A Logic for Probability in Quantum Systems.",
                    "A Strongly Normalising Curry-Howard Correspondence for IZF Set Theory.",
                    "The Epsilon Calculus (Tutorial).",
                    "Modular Semantics and Logics of Classes.",
                    "Validity of CTL Queries Revisited.",
                    "Calculi of Meta-variables.",
                    "Henkin Models of the Partial sigma-Calculus.",
                    "Nominal Unificaiton.",
                    "Friends or Foes? Communities in Software Verification (Invited Lecture).",
                    "More Computation Power for a Denotational Semantics for First Order Logic.",
                    "Effective Model Completeness of the Theory of Restricted Pfaffian Functions (Invited Lecture).",
                    "Effective Quantifier Elimination over Real Closed Fields (Tutorial).",
                    "Fast Infinite-State Model Checking in Integer-Based Systems (Invited Lecture).",
                    "Winning Strategies and Synthesis of Controllers (Tutorial).",
                    "Logical Relations for Dynamic Name Creation."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "16th CSL 2002",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2002",
                "sub_name": "Computer Science Logic, 16th International Workshop, CSL 2002, 11th Annual Conference of the EACSL, Edinburgh, Scotland, UK, September 22-25, 2002, Proceedings.",
                "count": 40,
                "papers": [
                    "Limit-Computable Mathematics and Its Applications.",
                    "Automata, Logic, and XML.",
                    "µ-Calculus via Games.",
                    "Bijections between Partitions by Two-Directional Rewriting Techniques.",
                    "On Continuous Normalization.",
                    "Variants of Realizability for Propositional Formulas and the Logic of the Weak Law of Excluded Middle.",
                    "Compactness and Continuity, Constructively Revisited.",
                    "Hoare Logics for Recursive Procedures and Unbounded Nondeterminism.",
                    "A Fixpoint Theory for Non-monotonic Parallelism.",
                    "Greibach Normal Form in Algebraically Complete Semirings.",
                    "Proofnets and Context Semantics for the Additives.",
                    "A Tag-Frame System of Resource Management for Proof Search in Linear-Logic Programming.",
                    "Resource Tableaux.",
                    "Configuration Theories.",
                    "A Logic for Probabilities in Semantics.",
                    "Possible World Semantics for General Storage in Call-By-Value.",
                    "A Fully Abstract Relational Model of Syntactic Control of Interference.",
                    "Optimal Complexity Bounds for Positive LTL Games.",
                    "The Stuttering Principle Revisited: On the Expressiveness of Nested X and U Operators in the Logic LTL.",
                    "Trading Probability for Fairness.",
                    "A Logic of Probability with Decidable Model-Checking.",
                    "Solving Pushdown Games with a Sigma3 Winning Condition.",
                    "Partial Fixed-Point Logic on Infinite Structures.",
                    "On the Variable Hierarchy of the Modal µ-Calculus.",
                    "Implicit Computational Complexity for Higher Type Functionals.",
                    "On Generalizations of Semi-terms of Particularly Simple Form.",
                    "Local Problems, Planar Local Problems and Linear Time.",
                    "Equivalence and Isomorphism for Boolean Constraint Satisfaction.",
                    "Travelling on Designs.",
                    "Designs, Disputes and Strategies.",
                    "Classical Linear Logic of Implications.",
                    "Higher-Order Positive Set Constraints.",
                    "A Proof Theoretical Account of Continuation Passing Style.",
                    "Duality between Call-by-Name Recursion and Call-by-Value Iteration.",
                    "Decidability of Bounded Higher-Order Unification.",
                    "Open Proofs and Open Terms: A Basis for Interactive Logic.",
                    "Logical Relations for Monadic Types.",
                    "On the Automatizability of Resolution and Related Propositional Proof Systems.",
                    "Extraction of Proofs from the Clausal Normal Form Transformation.",
                    "Resolution Refutations and Propositional Proofs with Height-Restrictions."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "15th CSL 2001",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2001",
                "sub_name": "Computer Science Logic, 15th International Workshop, CSL 2001. 10th Annual Conference of the EACSL, Paris, France, September 10-13, 2001, Proceedings.",
                "count": 42,
                "papers": [
                    "Local Reasoning about Programs that Alter Data Structures.",
                    "Applications of Alfred Tarski's Ideas in Database Theory.",
                    "Locus Solum: From the Rules of Logic to the Logic of Rules.",
                    "The Expressive Power of Horn Monadic Linear Logic.",
                    "Non-commutativity and MELL in the Calculus of Structures.",
                    "Quadratic Correctness Criterion for Non-commutative Logic.",
                    "Capture Complexity by Partition.",
                    "An Existential Locality Theorem.",
                    "Actual Arithmetic and Feasibility.",
                    "The Natural Order-Generic Collapse for omega-Representable Databases over the Rational and the Real Ordered Group.",
                    "An Algebraic Foundation for Higraphs.",
                    "Semantic Characterisations of Second-Order Computability over the Real Numbers.",
                    "An Abstract Look at Realizability.",
                    "The Anatomy of Innocence.",
                    "An Improved Extensionality Criterion for Higher-Order Logic Programs.",
                    "A Logic for Abstract State Machines.",
                    "Constrained Hyper Tableaux.",
                    "Modal Logic and the Two-Variable Fragment.",
                    "A Logic for Approximate First-Order Reasoning.",
                    "Inflationary Fixed Points in Modal Logic.",
                    "Categorical and Kripke Semantics for Constructive S4 Modal Logic.",
                    "Labelled Natural Deduction for Interval Logics.",
                    "Decidable Navigation Logics for Object Structures.",
                    "The Decidability of Model Checking Mobile Ambients.",
                    "A Generalization of the Büchi-Elgot-Trakhtenbrot Theorem.",
                    "An Effective Extension of the Wagner Hierarchy to Blind Counter Automata.",
                    "Decision Procedure for an Extension of WS1S.",
                    "Limiting Partial Combinatory Algebras towards Infinitary Lambda-Calculi and Classical Logic.",
                    "Intersection Logic.",
                    "Life without the Terminal Type.",
                    "Fully Complete Minimal PER Models for the Simply Typed lambda-Calculus.",
                    "A Principle of Induction.",
                    "On a Generalisation of Herbrand's Theorem.",
                    "Well-Founded Recursive Relations.",
                    "Stratified Context Unification Is in PSPACE.",
                    "Uniform Derivation of Decision Procedures by Superposition.",
                    "Complete Categorical Equational Deduction.",
                    "Beyond Regularity: Equational Tree Automata for Associative and Commutative Theories.",
                    "Normalized Types.",
                    "Markov's Principle for Propositional Type Theory.",
                    "Recursion for Higher-Order Encodings.",
                    "Monotone Inductive and Coinductive Constructors of Rank 2."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "14th CSL 2000",
        "info": "Fischbachau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2000",
                "sub_name": "Computer Science Logic, 14th Annual Conference of the EACSL, Fischbachau, Germany, August 21-26, 2000, Proceedings.",
                "count": 36,
                "papers": [
                    "Background, Reserve, and Gandy Machines.",
                    "Choiceless Polynominal Time Computation and the Zero-One Law.",
                    "Composition and Submachine Concepts for Sequential ASMs.",
                    "Une tentative malheureuse do construire une structure éliminant rapidement les quanteurs.",
                    "Translating Theory into Practice - Abstract State Machines within Microsoft.",
                    "Choiceless Polynominal Time Logic: Inability to Express.",
                    "Schema Revisited.",
                    "Automated Verification = Graphs, Automata, and Logic.",
                    "A Fully Complete PER Model for ML Polymorphic Types.",
                    "Subtyping with Power Types.",
                    "The Descriptive Comlexity of the Fixed-Points of Bounded Formulas.",
                    "Hypersequent and the Proof Theory of Intuitionistic Fuzzy Logic.",
                    "Continuous Functionals of Dependent Types and Equilogical Spaces.",
                    "Definability over Linear Constraints.",
                    "Bounded Arithmetic and Descriptive Complexity.",
                    "Independence: Logics and Concurrency.",
                    "Flatness Is Not a Weakness.",
                    "Sequents, Frames, and Completeness.",
                    "Disjunctive Tautologies as Synchronisation Schemes.",
                    "Axiomatizing the Least Fixed Point Operation and Binary Supremum.",
                    "Interactive Programs in Dependent Type Theory.",
                    "Modal Satisfiability Is in Deterministic Linear Space.",
                    "Logic Programming and Co-inductive Definitions.",
                    "A Theory of Explicit Mathematics Equivalent to ID1.",
                    "On the Complexity of Explicit Modal Logics.",
                    "Finite Models and Full Completeness.",
                    "On the Complexity of Combinatorial and Metafinite Generating Functions of Graph Properties in the Computational Model of Blum, Shub and Smale.",
                    "Elimination of Negation in a Logical Framework.",
                    "Discreet Games, Light Affine Logic and PTIME Computation.",
                    "Completeness of Higher-Order Duration Calculus.",
                    "Equational Termination by Semantic Labelling.",
                    "On the Computational Interpretation of Negation.",
                    "From Programs to Games: Invariance and Safety for Bisimulation.",
                    "Logical Relations and Data Abstraction.",
                    "Elementary Choiceless Constructive Analysis.",
                    "On the Logic of the Standard Proof Predicate."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "13th CSL 1999",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1999",
                "sub_name": "Computer Science Logic, 13th International Workshop, CSL '99, 8th Annual Conference of the EACSL, Madrid, Spain, September 20-25, 1999, Proceedings.",
                "count": 41,
                "papers": [
                    "Topological Queries in Spatial Databases.",
                    "The Consistency Dimension, Compactness, and Query Learning.",
                    "Descriptive and Parameterized Complexity.",
                    "Logical Specification of Operational Semantics.",
                    "Constraint-Based Analysis of Broadcast Protocols.",
                    "Descriptive Complexity Theory for Constraint Databases.",
                    "Applicative Control and Computational Complexity.",
                    "Applying Rewriting Techniques to the Verification of Erlang Processes.",
                    "Difference Decision Diagrams.",
                    "Analysis of Hybrid Systems: An Ounce of Realism Can Save an Infinity of States.",
                    "Verifying Liveness by Augmented Abstraction.",
                    "Signed Interval Logic.",
                    "Quantitative Temporal Logic.",
                    "An Expressively Complete Temporal Logic without Past Tense Operators for Mazurkiewicz Traces.",
                    "Using Fields and Explicit Substitutions to Implement Objects and Functions in a de Bruijn Setting.",
                    "Closed Reductions in the lambda-Calculus.",
                    "Kripke Resource Models of a Dependently-Typed, Bunched lambda-Calculus.",
                    "A Linear Logical View of Linear Type Isomorphisms.",
                    "Choice Logic Programs and Nash Equilibria in Strategic Games.",
                    "Resolution Method for Modal Logic with Well-Founded Frames.",
                    "A NExpTime-Complete Description Logic Strictly Contained in C2.",
                    "A Road-Map on Complexity for Hybrid Logics.",
                    "MonadicNLIN and Quantifier-Free Reductions.",
                    "Directed Reachability: From Ajtai-Fagin to Ehrenfeucht-Fraïssé Games.",
                    "Fixpoint Alternation and the Game Quantifier.",
                    "Lower Bounds for Space in Resolution.",
                    "Program Schemes, Arrays, Lindström Quantifiers and Zero-One Laws.",
                    "Open Least Element Principle and Bounded Query Computation.",
                    "A Universal Innocent Game Model for the Böhm Tree Lambda Theory.",
                    "Anti-Symmetry of Higher-Order Subtyping.",
                    "Safe Proof Checking in Type Theory with Y.",
                    "Monadic Presentations of Lambda Terms Using Generalized Inductive Types.",
                    "A P-Time Completeness Proof for Light Logics.",
                    "On Guarding Nested Fixpoints.",
                    "A Logical Viewpoint on Process-Algebraic Quotients.",
                    "A Truly Concurrent Semantics for a Simple Parallel Programming Language.",
                    "Specification Refinement with System F.",
                    "Pre-logical Relations.",
                    "Data-Refinement for Call-By-Value Programming Languages.",
                    "Term Rewriting.",
                    "Interactive Theorem Proving Using Type Theory."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "12th CSL 1998",
        "info": "Brno, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1998",
                "sub_name": "Computer Science Logic, 12th International Workshop, CSL '98, Annual Conference of the EACSL, Brno, Czech Republic, August 24-28, 1998, Proceedings.",
                "count": 28,
                "papers": [
                    "Trakhtenbrot Theorem and Fuzzy Logic.",
                    "Descriptive Complexity, Lower Bounds and Linear Time.",
                    "Testing for Finite State Systems.",
                    "On the Power of Quantifers in First-Order Algebraic Specification.",
                    "On the Effective Semantics of Nondeterministic, Nonmonotonic, Temporal Logic Databases.",
                    "Revision Programming = Logic Programming + Integrity Constraints.",
                    "Quantifers and the System KE: Some Surprising Results.",
                    "Choice Construct and Lindström Logics.",
                    "Monadic NP and Graph Minors.",
                    "Invariant Definability and P/poly.",
                    "Computational Complexity of Ehrenfeucht-Fraïssé Games on Finite Structures.",
                    "An Upper Bound for Minimal Resolution Refutations.",
                    "On an Optimal Deterministic Algorithm for SAT.",
                    "Characteristic Properties of Majorant-Computability over the Reals.",
                    "Theorems af Péter and Parsons in Computer Programming.",
                    "Belnap, Urquhart and Relevant Decidability & Complexity. \"Das ist nicht Mathematik, das ist Theologie.\".",
                    "Existence and Uniqueness of Normal Forms in Pure Type Systems with betaeta-Conversion.",
                    "Normalization of Typable Terms by Superdevelopments.",
                    "Subtyping Functional+Nonempty Record Types.",
                    "Monotone Fixed-Point Types and Strong Normalization.",
                    "Morphisms and Partitions of V-sets.",
                    "Computational Adequacy in an Elementary Topos.",
                    "Logical Relations and Inductive/Coinductive Types.",
                    "On the Complexity of H-Subsumption.",
                    "Complexity Classes and Rewrite Systems with Polynomial Interpretation.",
                    "RPO Constraint Solving Is in NP.",
                    "Quantifier Elimination in Fuzzy Logic.",
                    "Many-Valued First-Order Logics with Probabilistic Semantics."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "11th CSL 1997",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1997",
                "sub_name": "Computer Science Logic, 11th International Workshop, CSL '97, Annual Conference of the EACSL, Aarhus, Denmark, August 23-29, 1997, Selected Papers.",
                "count": 30,
                "papers": [
                    "Call-by-Value Games.",
                    "LISA: A Specification Language Based on WS2S.",
                    "Evolution as a Computational Engine.",
                    "Timeless Games.",
                    "From Action Calculi to Linear Logic.",
                    "A Sequent Calculus for Circumscription.",
                    "Linear Lower Bounds and Simulations in Frege Systems with Substitutions.",
                    "A Formulation of Linear Logic Based on Dependency-Relations.",
                    "Resolution and the Weak Pigeonhole Principle.",
                    "Higher-Order Matching and Tree Automata.",
                    "A Proof-Theoretical Investigation of Zantema's Problem.",
                    "Spectra with Only Unary Function Symbols.",
                    "Classical Proofs via Basic Logic.",
                    "Canonization for Lk-equivalence is Hard.",
                    "Full Abstractness for a Functional/Concurrent Language with Higher-Order Value-Passing (Extended Abstract).",
                    "A Duality Theory for Quantitative Semantics.",
                    "A Mixed Modal/Linear Lambda Calculus with Applications to Bellantoni-Cook Safe Recursion.",
                    "Equational Axioms of Test Algebra.",
                    "Mona & Fido: The Logic-Automaton Connection in Practice.",
                    "Existence of Reduction Hierarchies.",
                    "A Game-Theoretic, Concurrent and Fair Model of the Typed Lambda-calculus, with Full Recursion.",
                    "A Conjunctive Logical Characterization of Nondeterministic Linear Time.",
                    "On the Computational Complexity of Type 2 Functionals.",
                    "Categories with Algebraic Structure.",
                    "Concurrent Constraint Programming and Non-commutative Logic.",
                    "A Hierarchical Approach to Monadic Second-Order Logic over Graphs.",
                    "The Monadic Quantifier Alternation Hierarchy over Grids and Pictures.",
                    "Padding and the Expressive Power of Existential Second-Order Logics.",
                    "Rich omega-Words and Monadic Second-Order Arithmetic.",
                    "A Simple Ordinal Recursive Normalization of Gödel's T."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "10th CSL 1996",
        "info": "Utrecht, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1996",
                "sub_name": "Computer Science Logic, 10th International Workshop, CSL '96, Annual Conference of the EACSL, Utrecht, The Netherlands, September 21-27, 1996, Selected Papers.",
                "count": 28,
                "papers": [
                    "Four-Valued Diagnoses for Stratified Knowledge-Bases.",
                    "Fast Cut-Elimination by Projection.",
                    "On the Subject Reduction Property for Algebraic Type Systems.",
                    "Presheaf Models for Concurrency.",
                    "Directed Virtual Reductions.",
                    "Bounded-Variable Fixpoint Queries are PSPACE-complete.",
                    "Graph Rewriting Semantics for Functional Programming Languages.",
                    "An Extension of Models of Axiomatic Domain Theory to Models of Synthetic Domain Theory.",
                    "Relative Undecidability in Term Rewriting.",
                    "Extending Models of Second Order Predicate Logic to Models of Second Dependent Type Theory.",
                    "Eta-Expansions in Fomega.",
                    "Cut-free Display Calculi for Relation Algebras.",
                    "Computational Aspects of Arity Hierarchies.",
                    "Weak Semantics Based on Lighted Button Pressing Experiments.",
                    "Kleene Algebra with Tests: Completeness and Decidability.",
                    "Monadic NP and Built-in Trees.",
                    "Coercive Subtyping in Type Theory.",
                    "Proofs in System Fomega Can Be Done in System Fomega1.",
                    "Optimization Problems with Approximation Schemes.",
                    "Computational Representations of Herbrand Models Using Grammars.",
                    "Exact Pairs for Abstract Bounded Reducibilities.",
                    "The Logic of Explicitly Presentation-Invariant Circuits.",
                    "Social Confluence in Client-Server Systems.",
                    "A Type-Free Resource-Aware Lambda-Calculus.",
                    "Inductive Definitions with Decidable Atomic Formulas.",
                    "Call-by-Value, Call-by-Name and the Logic of Values.",
                    "On Cartesian Monoids.",
                    "New Intuitionistic Logical Constants: Undecidability of the Conservativsness Problem."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "9th CSL 1995",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1995",
                "sub_name": "Computer Science Logic, 9th International Workshop, CSL '95, Annual Conference of the EACSL, Paderborn, Germany, September 22-29, 1995, Selected Papers.",
                "count": 27,
                "papers": [
                    "Incompleteness of a First-Order Gödel Logic and Some Temporal Logics of Programs.",
                    "Semantics of Non-terminating Rewrite Systems Using Minimal Coverings.",
                    "Congruence Types.",
                    "Deduction by Combining Semantic Tableaux and Integer Programming.",
                    "leanEA: A Lean Evolving Algebra Compiler.",
                    "A Proof System for Finite Trees.",
                    "Representing Unification in a Logical Framework.",
                    "Decision Procedures Using Model Building Techniques.",
                    "A Note on the Relation Between Polynomial Time Functionals and Constable's Class K.",
                    "First Order Logic, Fixed Point Logic and Linear Order.",
                    "Simultaneous Regid E-Unification Is Undecidable.",
                    "An Evolving Algebra Abstract Machine.",
                    "Rewriting with Extensional Polymorphic Lambda-Calculus.",
                    "Languages and Logical Definability in Concurrency Monoids.",
                    "Generalized Implicit Definitions on Finite Structures.",
                    "The Railroad Crossing Problem: An Experiment with Instantaneous Actions and Immediate Reactions.",
                    "A Logical Aspect of Parametric Polymorphism.",
                    "On the Modal Logic K Plus Theories.",
                    "Improved Decision Procedures for the Modal Logics K, T, and S4.",
                    "A Fully Abstract Denotational Model for Observational Precongruence.",
                    "On Sharply Bounded Length Induction.",
                    "Effective Strategies for Enumeration Games.",
                    "Bounded Fixed-Point Definability and Tabular Recognition of Languages.",
                    "Equivalences among Various Logical Frameworks of Partial Algebras.",
                    "Some Extensions to Propositional Mean-Value Caculus: Expressiveness and Decidability.",
                    "Theorem Proving modulo Associativity.",
                    "Positive Deduction modulo Regular Theories."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "8th CSL 1994",
        "info": "Kazimierz, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1994",
                "sub_name": "Computer Science Logic, 8th International Workshop, CSL '94, Kazimierz, Poland, September 25-30, 1994, Selected Papers.",
                "count": 38,
                "papers": [
                    "Subtyping with Singleton Types.",
                    "A Subtyping for the Fisher-Honsell-Mitchell Lambda Calculus of Objects.",
                    "The Girard Translation Extended with Recursion.",
                    "Decidability of Higher-Order Subtyping with Intersection Types.",
                    "A Lambda-Calculus Structure Isomorphic to Gentzen-Style Sequent Calculus Structure.",
                    "Usability: Formalising (Un)definedness in Typed Lambda Calculus.",
                    "Lambda Representation of Operations Between Fifferent Term Algebras.",
                    "Semi-Unification and Generalizations of a Particularly Simple Form.",
                    "A Mixed Linear and Non-Linear Logic: Proofs, Terms and Models (Extended Abstract).",
                    "Cut Free Formalization of Logic with Finitely Many Variables. Part I.",
                    "How to Lie Without Being (Easily) Convicted and the Length of Proofs in Propositional Calculus.",
                    "Monadic Second-Order Logic and Linear Orderings of Finite Structures.",
                    "First-Order Spectra with One Binary Predicate.",
                    "Monadic Logical Definability of NP-Complete Problems.",
                    "Logics For Context-Free Languages.",
                    "Log-Approximable Minimization Problems on Random Inputs.",
                    "Convergence and 0-1 Laws for L_inf, omega^k under Arbitrary Measures.",
                    "Is First Order Contained in an Initial Segment of PTIME?",
                    "Logic Programming in Tau Categories.",
                    "Reasoning and Rewriting with Set-Relations I: Ground Completeness.",
                    "Resolution Games and Non-Liftable Resolution Orderings.",
                    "On Existential Theories of List Concatenation.",
                    "Completeness of Resolution for Definite Answers with Case Analysis.",
                    "Subrecursion as a Basis for a Feasible Programming Language.",
                    "A Sound Metalogical Semantics for Input/Output Effects.",
                    "An Intuitionistic Modal Logic with Applications to the Formal Verification of Hardware.",
                    "Towards Machine-Checked Compiler Correctness for Higher-order Pure Functional Languages.",
                    "Powerdomains, Powerstructures and Fairness.",
                    "Canonical Forms for Data-Specifications.",
                    "An Algebraic View of Structural Induction.",
                    "On the Interpretation of Type Theory in Locally Cartesian Closed Categories.",
                    "Algorithmic Aspects of Propositional Tense Logics.",
                    "Stratified Default Theories.",
                    "A Homomorphism Concepts for omega-Regularity.",
                    "Ramified Recurrence and Computational Complexity II: Substitution and Poly-Space.",
                    "General Form Recursive Equations I.",
                    "Modal Logics Preserving Admissible for S4 Inference Rules.",
                    "A Bounded Set Theory with Anti-Foundation Axiom and Inductive Definability."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "7th CSL 1993",
        "info": "Swansea, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1993",
                "sub_name": "Computer Science Logic, 7th Workshop, CSL '93, Swansea, United Kingdom, September 13-17, 1993, Selected Papers.",
                "count": 22,
                "papers": [
                    "The Complexity of Set Constraints.",
                    "On Duality for the Modal µ-Calculus.",
                    "Short Proofs of Tautologies Using the Schema of Equivalence.",
                    "Process Algebra with Combinators.",
                    "Is Game Semantics Necessary?",
                    "The Model Theory of Concurrency.",
                    "From Semantics to Rules: A Machine Assisted Analysis.",
                    "On the Reasons for Average Superlinear Speedup in Parallel Backtrack Search.",
                    "Negation as Inconsistency in PROLOG via Intuitionistic Logic.",
                    "Approximable Minimization Problems and Optimal Solutions on Random Inputs.",
                    "Bounded-Arity Hierarchies in Fixed-Point Logics.",
                    "Petri Nets and the Equivalence Problem.",
                    "Logical Aspects of Set Constraints.",
                    "Oracles and Quantifiers.",
                    "A Horn Clause that Implies and Undecidable Set of Horn Clauses.",
                    "Higher-Order Action Calculi.",
                    "A Generic Strong Normalization Argument: Application to the Calculus of Constructions.",
                    "Data Types, Infinity and Equality in System AF2.",
                    "Normalization for Typed Lambda Calculi with Explicit Substitution.",
                    "Program Transformation and Proof Transformation.",
                    "Incorporating Generalized Quantifiers and the Least Fixed Point Operator.",
                    "ERRATA to \"The Semantics of the C Programming Language\"."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "6th CSL 1992",
        "info": "San Miniato, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1992",
                "sub_name": "Computer Science Logic, 6th Workshop, CSL '92, San Miniato, Italy, September 28 - October 2, 1992, Selected Papers.",
                "count": 26,
                "papers": [
                    "A Universal Turing Machine.",
                    "Recursive Inseparability in Linear Logic.",
                    "The Basic Logic of Proofs.",
                    "Algorithmic Structuring of Cut-free Proofs.",
                    "Optimization Problems: Expressibility, Approximation Properties and Expected Asymptotic Growth of Optimal Solutions.",
                    "Linear Lambda-Calculus and Categorial Models Revisited.",
                    "A Self-Interpreter of Lambda Calculus Having a Normal Form.",
                    "An \"Ehrenfeucht-Fraïssé Game\" for Fixpoint Logic and Stratified Fixpoint Logic.",
                    "The Class of Problems that are Linear Equivalent to Satisfiability or a Uniform Method for Proving NP-Completeness.",
                    "Model Building by Resolution.",
                    "Comparative Transition System Semantics.",
                    "Reasoning with Higher Order Partial Functions.",
                    "Communicating Evolving Algebras.",
                    "On the Completeness of Narrowing as the Operational Semantics of Functional Logic Programming.",
                    "Inductive Definability with Counting on Finite Structures.",
                    "Linear Time Algorithms and NP-Complete Problems.",
                    "The Semantics of the C Programming Language.",
                    "A Theory of Classes for a Functional Language with Effects.",
                    "Logical Definability of NP-Optimization Problems with Monadic Auxiliary Predicates.",
                    "Universes in the Theory of Types and Names.",
                    "Notes on Sconing and Relators.",
                    "Solving 3-Satisfiability in Less Then 1, 579n Steps.",
                    "Kleene's Slash and Existence of Values of Open Terms in Type Theory.",
                    "Negation-Complete Logic Programs.",
                    "Logical Characterization of Bounded Query Classes II: Polynomial-Time Oracle Machines.",
                    "On Asymptotic Probabilities of Monadic Second Order Properties."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "5th CSL 1991",
        "info": "Berne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1991",
                "sub_name": "Computer Science Logic, 5th Workshop, CSL '91, Berne, Switzerland, October 7-11, 1991, Proceedings.",
                "count": 32,
                "papers": [
                    "The Expressive Power of Transitive Closue and 2-way Multihead Automata.",
                    "Correctness Proof For the WAM with Types.",
                    "Model Checking of Persistent Petri Nets.",
                    "Provability in TBLL: A Decision Procedure.",
                    "How to Implement First Order Formulas in Local Memory Machine Models.",
                    "A New Approach to Abstract Data Types II: Computation on ADTs as Ordinary Computation.",
                    "A Primitive Recursive Set Theory and AFA: On the Logical Complexity of the Largest Bisimulation.",
                    "On Bounded Theories.",
                    "The Cutting Plane Proof System with Bounded Degree of Falsity.",
                    "Denotational Versus Declarative Semantics for Functional Programming.",
                    "On Transitive Closure Logic.",
                    "Some Aspects of the Probabilistic Behavior of Variants of Resolution.",
                    "Safe Queries in Relational Databases with Functions.",
                    "Logical Inference and Polyhedral Projection.",
                    "Stable Logic.",
                    "A Transformational Methodology for Proving Termination of Logic Programs.",
                    "Plausibility Logic.",
                    "Towards Kleene Algebra with Recursion.",
                    "Equational Specification of Abstract Types and Combinators.",
                    "Normal Forms in Infinite-Valued Logic: The Case of One Variable.",
                    "A Fragment of First Order Logic Adequate for Observation Equivalence.",
                    "Ordinal Processes in Comparative Concurrency Semantics.",
                    "Logical Semantics of Modularisation.",
                    "A Cut-Elimination Procedure Designed for Evaluating Proofs as Programs.",
                    "Minimal from Classical Proofs.",
                    "Quantifier Hierarchies over Word Relations.",
                    "On Completeness for NP via Projection Translations.",
                    "Control of omega-Automata, Church's Problem, and the Emptiness Problem for Tree omega-Automata.",
                    "Comparing the Theory of Representations and Constructive Mathematics.",
                    "Infinitary Queries and Their Asymptotic Probabilities I: Properties Definable in Transitive Closue Logic.",
                    "On Completeness of Program Synthesis Systems.",
                    "Proving Termination for Term Rewriting Systems."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "4th CSL 1990",
        "info": "Heidelberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1990",
                "sub_name": "Computer Science Logic, 4th Workshop, CSL '90, Heidelberg, Germany, October 1-5, 1990, Proceedings.",
                "count": 24,
                "papers": [
                    "Monadic Second Order Logic, Tree Automata and Forbidden Minors.",
                    "On the Reduction Theory for Average Case Complexity.",
                    "From Prolog Algebras Towards WAM - A Mathematical Study of Implementation.",
                    "A Formal Operational Semantics for Languages of Type Prolog III.",
                    "Efficiency Considerations on Goal-Directed Chaining for Logic Programs.",
                    "Decision Problems for Tarski and Presburger Arithmetics Extended With Sets.",
                    "A Fast Garbage Collection Algorithm for WAM-Based Prolog.",
                    "A Resolution Variant Deciding some Classes of Clause Sets.",
                    "Subclasses of Quantified Boolean Formulas.",
                    "Algorithmic Proof with Diminishing Resources, Part 1.",
                    "Cuting Plane Versus Frege Proof Systems.",
                    "RAM with Compact Memory: A Realistic and Robust Model of Computation.",
                    "Randomness and Turing Reducibility Restraints.",
                    "Towards an Efficient Tableau Proof Procedure for Multiple-Valued Logics.",
                    "Interactive Proof Systems: Provers, Rounds, and Error Bounds.",
                    "Logics for Belief Dependence.",
                    "A Generalization of Stability and its Application to Circumscription of Positive Introspective Knowledge.",
                    "The Complexity of Adaptive Error-Correcting Codes.",
                    "Ramsey's Theorem in Bounded Arithmetic.",
                    "Nontrivial Lower Bounds for some NP-Problems on Directed Graphs.",
                    "Expansions and Models of Autoepistemic Theories.",
                    "On the Existence of Fixpoints in Moore's Autoepistemic Logic and the Non-Monotonic Logic of McDermott and Doyle.",
                    "On the Tracking of Loops in Automated Deductions.",
                    "The Gap-Language-Technique Revisited."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "3rd CSL 1989",
        "info": "Kaiserslautern, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1989",
                "sub_name": "CSL '89, 3rd Workshop on Computer Science Logic, Kaiserslautern, Germany, October 2-6, 1989, Proceedings.",
                "count": 28,
                "papers": [
                    "Honest Polynomial-Time Degrees of Elementary Recursive Sets.",
                    "On the Verification of Modules.",
                    "A Logical Operational Semantics of Full Prolog. Part I: Selection Core and Control.",
                    "Set-Theoretic Reductions of Hilbert's Tenth Problem.",
                    "The Complexity of Subtheories of the Existential Linear Theory of Reals.",
                    "On Test Classes for Universal Theories.",
                    "Generalizing Allowedness While Retaining Completeness of SLDNF-Resolution.",
                    "Effectively Given Information Systems and Domains.",
                    "Davis-Putnam Resolution versus Unrestricted Resolution.",
                    "On Logical Descriptions of Some Concepts in Structural Complexity Theory.",
                    "Algebraic Operational Semantics and Occam.",
                    "Propositional Provability and Models of Weak Arithmetic.",
                    "Polymorphic Recursion and Semi-Unification.",
                    "Deciding Horn Classes by Hyperresolution.",
                    "Omega-Branching Programs of Bounded Width.",
                    "A Predicate Calculus with Control of Derivations.",
                    "Reducibility of Monotone Formulas to µ-Formulas.",
                    "New Ways for Developing Proof Theories for First-Order Multi Modal Logics.",
                    "On the Representation of Data in Lambda-Calculus.",
                    "A Streamlined Temporal Completeness Theorem.",
                    "A Concurrent Branching Time Temporal Logic.",
                    "Semantic for Abstract Fairness using Metric Spaces.",
                    "On the Average Time Complexity of Set Partitioning.",
                    "A Direct Proof for the Completeness of SLD-Resolution.",
                    "A Quantifier-Free Completion of Logic Programs.",
                    "Stratification of Definite Clause Programs and of General Logic Programs.",
                    "The Semantics of Disjunctive Deductive Databases.",
                    "Sequential Representation of Primitive Recursive Functions, and Complexity Classes."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "2nd CSL 1988",
        "info": "Duisburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1988",
                "sub_name": "CSL '88, 2nd Workshop on Computer Science Logic, Duisburg, Germany, October 3-7, 1988, Proceedings.",
                "count": 24,
                "papers": [
                    "On Disjunctive Self-Reducibility.",
                    "The Knowledge Representation Language LLILOG.",
                    "Completeness with Respect to Interpretations in Deterministic and Nondeterministic Polynomial Time.",
                    "A temporal Logic Approach to Specify and to Prove Properties of Finite State Concurrent Systems.",
                    "A Comparison of the Resolution Caculus and the Connection Method, and a new Calculus Generalizing Both Methods.",
                    "Characterizing Complexity Classes by General Recursive Definitions in Higher Types.",
                    "Size of Models versus Length of Computations: On Inseparability by Nondeterministic Time Complexity Classes.",
                    "Boolean Complexity of Algebraic Interpolation Problems.",
                    "Loop Detection in Propositional Prolog Programs.",
                    "Numberings of R1 union F.",
                    "Interval Temporal Logic and Star-Free Expressions.",
                    "An Interpreter with Lazy Evaluation for Prolog with Functions.",
                    "On the Complexity of the Decision Problem in Propositional Nonmonotonic Logic.",
                    "Gentzen-Systems for Propositional Temporal Logics.",
                    "Predicate Inequalities as a Basis for Automated Termination Proofs for Prolog Programs.",
                    "On the Existence of Fair Schedulers.",
                    "Using Finite-Linear Temporal Logic for Specifying Database Dynamics.",
                    "Is Average Superlinear Speedup Possible?",
                    "Enforcement of Integrity Constraints in a Semantic Data Model.",
                    "Delete Operations and Horn Formulas.",
                    "Integration of Descriptive and Procedural Language Constructs.",
                    "Normal Forms and the Complexity of Computations of Logic Programs.",
                    "A Remark on Minimal Polynomials of Boolean Functions.",
                    "On the Emptiness Problem of Tree Automata and Completeness of Modal Logics of Programs."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "1st CSL 1987",
        "info": "Karlsruhe, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/1987",
                "sub_name": "CSL '87, 1st Workshop on Computer Science Logic, Karlsruhe, Germany, October 12-16, 1987, Proceedings.",
                "count": 24,
                "papers": [
                    "Diagonalizing over Deterministic Polynomial Time.",
                    "Resolution with Feature Unification.",
                    "Surjectivity for Finite Sets of Combinators by Weak Reduction.",
                    "Proving Finite Satisfiability of Deductive Databases.",
                    "Is SETL a Suitable Language for Parallel Programming - A Theoretical Approach.",
                    "Loose Diagrams, Semigroupoids, Categories, Groupoids and Iteration.",
                    "Algebraic Operational Semantics and Modula-2.",
                    "Program Verification Using Dynamic Logic.",
                    "Induction in the Elementary Theory of Types and Names.",
                    "On the Computational Complexity of Quantified Horn Clauses.",
                    "The Conjunctive Complexity of Quadratic Boolean Functions.",
                    "On Type Inference for Object-Oriented Programming Languages.",
                    "Optimization Aspects of Logical Formulas.",
                    "Logic of Approximation Reasoning.",
                    "Deciding the Path- and Word-Fair Equivalence Problem.",
                    "Learning by Teams from Examples with Errors.",
                    "A Survey of Rewrite Systems.",
                    "Interfacing a Logic Machine.",
                    "Complexity Cores and Hard-To-Prove Formulas.",
                    "On the Average Case Complexity of Backtracking for the Exact-Satisfiability Problem.",
                    "On Functions Computable in Nondeterministic Polynomial Time: Some Characterizations.",
                    "Developing Logic Programs: Computing Through Normalizing.",
                    "Model Theory of Deductive Databases.",
                    "Algorithms for Propositional Updates."
                ]
            }
        ]
    }
]