[
    {
        "year": "2021",
        "name": "8th DSAA 2021",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2021",
                "sub_name": "8th IEEE International Conference on Data Science and Advanced Analytics, DSAA 2021, Porto, Portugal, October 6-9, 2021.",
                "count": 89,
                "papers": [
                    "Embed2Detect: Temporally Clustered Embedded Words for Event Detection in Social Media: Extended Abstract.",
                    "NEDRL-CIM: Network Embedding Meets Deep Reinforcement Learning to Tackle Competitive Influence Maximization on Evolving Social Networks.",
                    "Reducing Unintended Bias of ML Models on Tabular and Textual Data.",
                    "Efficient Modeling of Digital Shadows for Production Processes: A Case Study for Quality Prediction in High Pressure Die Casting Processes.",
                    "Classification of Space Particle Events using Supervised Machine Learning Algorithms.",
                    "Misalignment problem in matrix decomposition with missing values.",
                    "A Generalized Optimization Embedded Framework of Undersampling Ensembles for Imbalanced Classification.",
                    "Unsupervised Tensor based Feature Extraction and Outlier Detection for Multivariate Time Series.",
                    "A Data-Driven Approach based on Tensor Completion for Replacing \"Physical Sensors\" with \"Virtual Sensors\".",
                    "Overfitting Measurement of Deep Neural Networks Using No Data.",
                    "motif2vec: Semantic-aware Representation Learning for Wearables' Time Series Data.",
                    "Predicting hybrid vehicles' fuel and electric consumption using multitask learning.",
                    "Leveraging Latent Economic Concepts and Sentiments in the News for Market Prediction.",
                    "Bayesian Independence Test with Mixed-type Variables.",
                    "Constructing Global Coherence Representations: Identifying Interpretability and Coherences of Transformer Attention in Time Series Data.",
                    "Machine Learning Model for Frailty Detectxion using Electric Power Consumption Data from Smart Meter.",
                    "Adaptive Noisy Data Augmentation for Regularized Construction of Undirected Graphical Models.",
                    "Learning User Preferences Without Feedbacks.",
                    "Online Ensemble Aggregation using Deep Reinforcement Learning for Time Series Forecasting.",
                    "Ordinal Regression with Explainable Distance Metric Learning Based on Ordered Sequences: Extended Abstract.",
                    "Early Classification of Time Series: Cost-based multiclass Algorithms.",
                    "RB-CCR: Radial-Based Combined Cleaning and Resampling algorithm for imbalanced data classification.",
                    "Decoupling Autoencoders for Robust One-vs-Rest Classification.",
                    "Extracting Cancer Treatments from Clinical Text written in Spanish: A Deep Learning Approach.",
                    "Hybrid Recommender System for Detection of Rare Cases Applied to Pulsar Candidate Selection.",
                    "Time-Aware Tensor Decomposition for Sparse Tensors.",
                    "Combining Static and Dynamic Analysis to Improve Machine Learning-based Malware Classification.",
                    "Active Learning for Imbalanced Domains: the ALOD and ALOD-RE Algorithms.",
                    "Improved Automated CASH Optimization with Tree Parzen Estimators for Class Imbalance Problems.",
                    "Tensor Decision Trees for Continual Learning from Drifting Data Streams.",
                    "Interpretable Prediction of Diabetes from Tabular Health Screening Records Using an Attentional Neural Network.",
                    "Resolving the message riddle: A multi-pronged approach to infer trouble tickets.",
                    "XPROAX-Local explanations for text classification with progressive neighborhood approximation.",
                    "Discovery of Patient Phenotypes through Multi-layer Network Analysis on the Example of Tinnitus.",
                    "A Sequential Framework Towards an Exact SDP Verification of Neural Networks.",
                    "A Personalized Overdraft Protection Framework.",
                    "Soft-Churn: Optimal Switching between Prepaid Data Subscriptions on E-SIM support Smartphones.",
                    "Interpretable Summaries of Black Box Incident Triaging with Subgroup Discovery.",
                    "Explainable Artificial Intelligence for Data Science on Customer Churn.",
                    "Non-Technical Losses Detection in Energy Consumption Focusing on Energy Recovery and Explainability: Extended Abstract.",
                    "AssistML: A Concept to Recommend ML Solutions for Predictive Use Cases.",
                    "Analyzing Cultural Assimilation through the Lens of Yelp Restaurant Reviews.",
                    "MLife: A Lite Framework for Machine Learning Lifecycle Initialization.",
                    "A Full-Stack Machine Learning Environment for Rapidly Evolving Industry Applications.",
                    "Towards Treatment Patterns Validation in Lung Cancer Patients.",
                    "Migrate On-Premises Real-Time Data Analytics Jobs Into the Cloud.",
                    "Explaining Multimodal Errors in Autonomous Vehicles.",
                    "Predictive maintenance based on anomaly detection using deep learning for air production unit in the railway industry.",
                    "Extracting Invariant Features for Predicting State of Health of Batteries in Hybrid Energy Buses.",
                    "Feature-Option-Action: A domain adaption transfer reinforcement learning framework.",
                    "A Neural Approach for Detecting Morphological Analogies.",
                    "A Multilayer Network Perspective on Customer Segmentation Through Cashless Payment Data.",
                    "Source detection on networks using spatial temporal graph convolutional networks.",
                    "PEAR: A Product Expiry-Aware and Revenue-Conscious Itemset Placement Scheme.",
                    "Atlastic Reputation AI: Four Years of Advancing and Applying a SOTA NLP Classifier.",
                    "Analyzing and Repairing Concept Drift Adaptation in Data Stream Classification.",
                    "A generic framework for forecasting short-term traffic conditions on urban highways.",
                    "Mining Mavericks - A data-driven approach to detect spend leakage.",
                    "Parallel Multi-Graph Convolution Network For Metro Passenger Volume Prediction.",
                    "A Framework for Statistically-Sound Customer Segment Search.",
                    "A Neural Network Architecture with an Attention-based Layer for Spatial Prediction of Fine Particulate Matter.",
                    "Adversarially Generating Rank-Constrained Graphs.",
                    "The use of machine learning to identify the correctness of HS Code for the customs import declarations.",
                    "An Overview on Supervised Semi-structured Data Classification.",
                    "Dynamic Graph Convolutional LSTM application for traffic flow estimation from error-prone measurements: results and transferability analysis.",
                    "Towards optimized actions in critical situations of soccer games with deep reinforcement learning.",
                    "CAUSALYSIS: Causal Machine Learning for Real-Estate Investment Decisions.",
                    "Conditional t-SNE: More informative t-SNE embeddings.",
                    "Opportunistic Resource Allocation driven by pattern recognition to attain High Availability in Vision based Edge Compute Systems.",
                    "A Unified Framework for Closed-Form Nonparametric Regression, Classification, Preference and Mixed Problems with Skew Gaussian Processes.",
                    "DaskDB: Scalable Data Science with Unified Data Analytics and In Situ Query Processing.",
                    "Deep Learning and Multivariate Time Series for Cheat Detection in Video Games.",
                    "Explainable clustering with multidimensional bounding boxes.",
                    "Centrality-based Interpretability Measures for Graph Embeddings.",
                    "Individual Survival Curves with Conditional Normalizing Flows.",
                    "Anytime Subgroup Discovery in High Dimensional Numerical Data.",
                    "Sequential Dependency Enhanced Graph Neural Networks for Session-based Recommendations.",
                    "Two-Phase Multi-armed Bandit for Online Recommendation.",
                    "V2W-BERT: A Framework for Effective Hierarchical Multiclass Classification of Software Vulnerabilities.",
                    "Explainable anomaly detection for Hot-rolling industrial process.",
                    "DeepHateExplainer: Explainable Hate Speech Detection in Under-resourced Bengali Language.",
                    "3M-Transformers for Event Coding on Organized Crime Domain.",
                    "ResGCN: Attention-based Deep Residual Modeling for Anomaly Detection on Attributed Networks.",
                    "ZipLine: An Optimized Algorithm for the Elastic Bulk Synchronous Parallel Model.",
                    "Learning Fashion Similarity Based on Hierarchical Attribute Embedding.",
                    "Predicting batch process to prevent business outages.",
                    "Improving Portuguese Semantic Role Labeling with Transformers and Transfer Learning.",
                    "On the Use of Class Activation Maps in Remote Sensing: the case of Illegal Landfills.",
                    "Dynamic Graph Convolutional LSTM application for traffic flow estimation from error-prone measurements: results and transferability analysis."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "7th DSAA 2020",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2020",
                "sub_name": "7th IEEE International Conference on Data Science and Advanced Analytics, DSAA 2020, Sydney, Australia, October 6-9, 2020.",
                "count": 108,
                "papers": [
                    "Accurately Quantifying a Billion Instances per Second.",
                    "Discovering Maximal Periodic-Frequent Patterns in Very Large Temporal Databases.",
                    "Interpretability and Refinement of Clustering.",
                    "Learning Fair and Transferable Representations with Theoretical Guarantees.",
                    "Period Estimation For Incomplete Time Series.",
                    "Ensemble of Hierarchical Temporal Memory for Anomaly Detection.",
                    "Improving Product Placement in Retail with Generalized High-Utility Itemsets.",
                    "Block-Approximated Exponential Random Graphs.",
                    "Spatio-Temporal Functional Neural Networks.",
                    "AdvPL: Adversarial Personalized Learning.",
                    "Coordinate Descent Method for Log-linear Model on Posets.",
                    "Active Learning of SVDD Hyperparameter Values.",
                    "Mix2Vec: Unsupervised Mixed Data Representation.",
                    "Sequence Learning with Side Dependencies.",
                    "Benchmarking Network Embedding Models for Link Prediction: Are We Making Progress?",
                    "CO2Vec: Embeddings of Co-Ordered Networks Based on Mutual Reinforcement.",
                    "FONDUE: Framework for Node Disambiguation Using Network Embeddings.",
                    "OnlineBTD: Streaming Algorithms to Track the Block Term Decomposition of Large Tensors.",
                    "Shells within Minimum Enclosing Balls.",
                    "Weakly Supervised Person Search.",
                    "Dimensionality-adaptive k-center in sliding windows.",
                    "Body Pose and Deep Hand-shape Feature Based American Sign Language Recognition.",
                    "Estimating countries' peace index through the lens of the world news as monitored by GDELT.",
                    "Optimal Data Placement for Data-Centric Algorithms on NVM-Based Hybrid Memory.",
                    "Positive Influence Maximization and Negative Influence Minimization in Signed Networks under Competitive Independent Cascade Model.",
                    "Simultaneous Link Prediction on Unaligned Networks Using Graph Embedding and Optimal Transport.",
                    "Denoising of Magnetic Resonance Images with Deep Neural Regularizer Driven by Image Prior.",
                    "Active Sampling for Learning Interpretable Surrogate Machine Learning Models.",
                    "Near-duplicated Loss for Accurate Object Localization.",
                    "Information Exposure From Relational Background Knowledge on Social Media.",
                    "MEE : An Automatic Metric for Evaluation Using Embeddings for Machine Translation.",
                    "A Graph Convolutional Encoder and Decoder Model for Rumor Detection.",
                    "Efficient Frequent Subgraph Mining in Transactional Databases.",
                    "Joint Bayesian Variable Selection and Graph Estimation for Non-linear SVM with Application to Genomics Data.",
                    "MRSweep: Distributed In-Memory Sweep-line for Scalable Object Intersection Problems.",
                    "Attributed Network Embedding with Community Preservation.",
                    "Economic Worth-Aware Word Embeddings.",
                    "Exploiting BERT with Global-Local Context and Label Dependency for Aspect Term Extraction.",
                    "SesameBERT: Attention for Anywhere.",
                    "RIC-NN: A Robust Transferable Deep Learning Framework for Cross-sectional Investment Strategy.",
                    "Driving with Data in the Motor City: Understanding and Predicting Fleet Maintenance Patterns.",
                    "Classification Benchmarks for Under-resourced Bengali Language based on Multichannel Convolutional-LSTM Network.",
                    "Boosting Fashion Image Attributes Classification Performance with MT-GAN Training Technique.",
                    "HANKE: Hierarchical Attention Networks for Knowledge Extraction in Political Science Domain.",
                    "Precision Coupon Targeting with Dynamic Customer Triage.",
                    "Automating and Analyzing Whole-Farm Carbon Models.",
                    "Probability of default estimation, with a reject option.",
                    "Profiling US Restaurants from Billions of Payment Card Transactions.",
                    "Embedding for Anomaly Detection on Health Insurance Claims.",
                    "Cross-Layer Profiling of Encrypted Network Data for Anomaly Detection.",
                    "Interactive Machine Learning Tool for Clustering in Visual Analytics.",
                    "Stress Prediction from Head Motion.",
                    "Using Data Science to Improve the Identification of Plant Nutritional Status.",
                    "A Distance Metric for Sets of Events.",
                    "Matching Research Publications to the United Nations' Sustainable Development Goals by Multi-Label-Learning with Hierarchical Categories.",
                    "Why Should I Trust This Item? Explaining the Recommendations of any Model.",
                    "Cardea: An Open Automated Machine Learning Framework for Electronic Health Records.",
                    "No Cloud on the Horizon: Probabilistic Gap Filling in Satellite Image Series.",
                    "Urban and socio-economic correlates of property prices in Dublin's area.",
                    "Performance Evaluation of Low-cost PurpleAir Sensors in Ambient Air.",
                    "On-Board Unit Big Data: Short-term Traffic Forecasting in Urban Transportation Networks.",
                    "Traffic Flow Estimation using Probe Vehicle Data.",
                    "Vehicle Relocation for Ride-Hailing.",
                    "Detecting Fake News Spreaders on Twitter from a Multilingual Perspective.",
                    "Watch 'n' Check: Towards a Social Media Monitoring Tool to Assist Fact-Checking Experts.",
                    "Simulation of misinformation spreading processes in social networks: an application with NetLogo.",
                    "Using markup language to differentiate between reliable and unreliable news.",
                    "Profiling Bots and Fake News Spreaders at PAN'19 and PAN'20 : Bots and Gender Profiling 2019, Profiling Fake News Spreaders on Twitter 2020.",
                    "Are You Human? Detecting Bots on Twitter Using BERT.",
                    "Modelling User Influence and Rumor Propagation on Twitter using Hawkes Processes.",
                    "Multimodal Multi-image Fake News Detection.",
                    "Privacy-aware Cold-Start Recommendation based on Collaborative Filtering and Enhanced Trust.",
                    "Reinforcement Learning Based Test Case Prioritization for Enhancing the Security of Software.",
                    "Towards Privacy-Preserving Deep Learning: Opportunities and Challenges.",
                    "Privacy-Preserving GWAS Computation on Outsourced Data Encrypted under Multiple Keys Through Hybrid System.",
                    "Personalized Course Recommendation Based on Eye-Tracking Technology and Deep Learning.",
                    "Practical Privacy Protection Scheme In WiFi Fingerprint-based Localization.",
                    "Naive Bayes Classification under Local Differential Privacy.",
                    "Detecting Protected Health Information with an Incremental Learning Ensemble: A Case Study on New Zealand Clinical Text.",
                    "Fair pairwise learning to rank.",
                    "Classification Between Machine Translated Text and Original Text By Part Of Speech Tagging Representation.",
                    "An Adaptive Utilization of Convolutional Matrix Methods of Neuron Cell Segmentation with an Application Interface to Aid the Understanding of How Memory Recall Works.",
                    "DermaDetect: A novel computer vision model for an accurate diagnosis of skin conditions and rashes.",
                    "Improving Sentiment Analysis in Arabic and English Languages by Using Multi-Layer Perceptron Model (MLP).",
                    "Cluster Quality Analysis Using Silhouette Score.",
                    "Bayesian Modeling Approach in Big Data Contexts: an Application in Spatial Epidemiology.",
                    "An Automatic Document Summarization Approach based on Fuzzy Ontology and Machine Learning.",
                    "Robust Multivariate Regression on Riemannian Manifolds.",
                    "Adapting Established Text Representations for Predicting Review Sentiment in Turkish.",
                    "Querying Influential Maximum Connected Community in Large Graphs.",
                    "Building Multiclass Classification Baselines for Anomaly-based Network Intrusion Detection Systems.",
                    "Building up Explainability in Multi-layer Perceptrons for Credit Risk Modeling.",
                    "Predicting Workplace Injuries Using Machine Learning Algorithms.",
                    "Towards An Empirical and Theoretical Evaluation of Gradient Based Approaches for finding Kernel Minimum Enclosing Balls.",
                    "Measuring Indirect External Threat: A Time Series Sentiment Analysis of NATO Resolutions.",
                    "The Directionality Function Defect of Performance Evaluation Method in Regression Neural Network for Stock Price Prediction.",
                    "Improving Neural Networks using Slice Models for Similar Classes.",
                    "Landmarks-based Blocking Method For Large-scale Entity Resolution.",
                    "Fake News Detection using Multilingual Evidence.",
                    "Bayesian Estimation of the Effect of Television Advertising on Web Metrics.",
                    "Data Profiling Method for Metadata Management.",
                    "Machine Learning for evaluating Kaizens in Volkswagen Production System - An Industrial Case study.",
                    "Using Network Features for Credit Scoring in MicroFinance: Extended Abstract.",
                    "Incremental learning strategies for credit cards fraud detection: Extended abstract.",
                    "Linking Bank Clients using Graph Neural Networks Powered by Rich Transactional Data: Extended Abstract.",
                    "Cryptocurrencies asset pricing via machine learning: Extended abstract.",
                    "Big Data Quality Prediction on Banking Applications: Extended Abstract.",
                    "Generalized Isolation Forest: Some Theory and More Applications Extended Abstract."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "6th DSAA 2019",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2019",
                "sub_name": "2019 IEEE International Conference on Data Science and Advanced Analytics, DSAA 2019, Washington, DC, USA, October 5-8, 2019.",
                "count": 66,
                "papers": [
                    "Grade Prediction with Neural Collaborative Filtering.",
                    "MARS: Memory Attention-Aware Recommender System.",
                    "Variable-Lag Granger Causality for Time Series Analysis.",
                    "Residual Networks Behave Like Boosting Algorithms.",
                    "Hierarchical LSTM Framework for Long-Term Sea Surface Temperature Forecasting.",
                    "Semantically-Aware Statistical Metrics via Weighting Kernels.",
                    "Short Text Embedding for Clustering Based on Word and Topic Semantic Information.",
                    "A Rademacher Complexity Based Method for Controlling Power and Confidence Level in Adaptive Statistical Analysis.",
                    "SeqScout: Using a Bandit Model to Discover Interesting Subgroups in Labeled Sequences.",
                    "FSSD - A Fast and Efficient Algorithm for Subgroup Set Discovery.",
                    "Biased Resampling Strategies for Imbalanced Spatio-Temporal Forecasting.",
                    "Explaining the Performance of Black Box Regression Models.",
                    "Dynamic Graph Embedding via LSTM History Tracking.",
                    "Least Squares and Maximum Likelihood Estimation of Sufficient Reductions in Regressions with Matrix Valued Predictors.",
                    "Cross-Media Image-Text Retrieval Combined with Global Similarity and Local Similarity.",
                    "Sensor-Based Human Activity Mining Using Dirichlet Process Mixtures of Directional Statistical Models.",
                    "Truth Discovery from Multi-Sourced Text Data Based on Ant Colony Optimization.",
                    "On the Classification Consistency of High-Dimensional Sparse Neural Network.",
                    "Deep Crowd Counting In Congested Scenes Through Refine Modules.",
                    "A Study on the Impact of Data Characteristics in Imbalanced Regression Tasks.",
                    "Sign Language Recognition Analysis using Multimodal Data.",
                    "An Incremental Technique for Mining Coverage Patterns in Large Databases.",
                    "Customized Interpretable Conformal Regressors.",
                    "A Novel Multiple Classifier Generation and Combination Framework Based on Fuzzy Clustering and Individualized Ensemble Construction.",
                    "VizCertify: A Framework for Secure Visual Data Exploration.",
                    "Joint Selection of Central and Extremal Prototypes Based on Kernel Minimum Enclosing Balls.",
                    "A Rapid Prototyping Approach for High Performance Density-Based Clustering.",
                    "Feature Enhanced Fully Convolutional Networks for Monocular Depth Estimation.",
                    "Breast Cancer Classification using Deep Transfer Learning on Structured Healthcare Data.",
                    "Shape Constrained Tensor Decompositions.",
                    "Range Analysis and Applications to Root Causing.",
                    "Unsupervised Drift Detector Ensembles for Data Stream Mining.",
                    "Topology-Based Clusterwise Regression for User Segmentation and Demand Forecasting.",
                    "FARE: Schema-Agnostic Anomaly Detection in Social Event Logs.",
                    "SliceNDice: Mining Suspicious Multi-Attribute Entity Groups with Multi-View Graphs.",
                    "Constrained Multi-Objective Optimization for Automated Machine Learning.",
                    "Detecting Sensitive Content in Spoken Language.",
                    "Higher Order Mining for Monitoring District Heating Substations.",
                    "Learning Personalized Treatment Rules from Electronic Health Records Using Topic Modeling Feature Extraction.",
                    "Lightweight and Scalable Particle Tracking and Motion Clustering of 3D Cell Trajectories.",
                    "Uplift Modeling for Multiple Treatments with Cost Optimization.",
                    "Chest Tube Management After Lung Resection Surgery using a Classifier.",
                    "Maximum Relevance and Minimum Redundancy Feature Selection Methods for a Marketing Machine Learning Platform.",
                    "Towards Automated Breast Mass Classification using Deep Learning Framework.",
                    "Matrix Profile XVI: Efficient and Effective Labeling of Massive Time Series Archives.",
                    "Colorwall: An Embedded Temporal Display of Bibliographic Data.",
                    "Data-Driven Fault Diagnosis in End-of-Line Testing of Complex Products.",
                    "Towards Automatic Screening of Typical and Atypical Behaviors in Children With Autism.",
                    "On Analysing Supply and Demand in Labor Markets: Framework, Model and System.",
                    "Martensite Start Temperature Predictor for Steels Using Ensemble Data Mining.",
                    "Comparison of Variable Selection Methods for Forecasting from Short Time Series.",
                    "A Real-Time Iterative Machine Learning Approach for Temperature Profile Prediction in Additive Manufacturing Processes.",
                    "Bighead: A Framework-Agnostic, End-to-End Machine Learning Platform.",
                    "Machine Learning for Efficient Integration of Record Systems for Missing US Service Members.",
                    "Paths to Empathy: Heterogeneous Effects of Reading Personal Stories Online.",
                    "A Novel Record Linkage Interface That Incorporates Group Structure to Rapidly Collect Richer Labels.",
                    "Analyzing Driving Data using the ADAPT Distributed Analytics Platform for Connected Vehicles.",
                    "Augmenting U.S. Census data on industry and occupation of respondents.",
                    "Data Reduction for real-time bridge vibration data on Edge.",
                    "Using Machine Learning to Predict High School Student Employability - A Case Study.",
                    "Improving the Personalized Recommendation in the Cold-start Scenarios.",
                    "Universal Consistency of Support Tensor Machine.",
                    "Automating Big Data Analysis Based on Deep Learning Generation by Automatic Service Composition.",
                    "Detection Model of Depression Based on Eye Movement Trajectory.",
                    "Exploring the Relationship Between Conversation Using #MeToo and University Harassment Policies.",
                    "Don't Cry Wolf."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "5th DSAA 2018",
        "info": "Turin, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2018",
                "sub_name": "5th IEEE International Conference on Data Science and Advanced Analytics, DSAA 2018, Turin, Italy, October 1-3, 2018.",
                "count": 79,
                "papers": [
                    "Estimating Heterogeneous Causal Effects in the Presence of Irregular Assignment Mechanisms.",
                    "Citizen Contributions and Minor Heritage: Feedback on Modeling and Visualising an Information Mash-up.",
                    "Unification of Deconvolution Algorithms for Cherenkov Astronomy.",
                    "Recommendation of Points-of-Interest Using Graph Embeddings.",
                    "Adaptive Threshold for Outlier Detection on Data Streams.",
                    "Neuro-Ensemble for Time Series Data Classification.",
                    "Estimating Causal Effects on Social Networks.",
                    "Hoeffding Trees with Nmin Adaptation.",
                    "Explaining Explanations: An Overview of Interpretability of Machine Learning.",
                    "Multivariate Time Series Early Classification Using Multi-Domain Deep Neural Network.",
                    "Pattern-Based Automatic Parallelization of Representative-Based Clustering Algorithms.",
                    "Generalized Bayesian Factor Analysis for Integrative Clustering with Applications to Multi-Omics Data.",
                    "Kernel Regression on Manifold Valued Data.",
                    "Fully Heterogeneous Collective Regression.",
                    "Towards Efficient Closed Infrequent Itemset Mining Using Bi-Directional Traversing.",
                    "SMOTEBoost for Regression: Improving the Prediction of Extreme Values.",
                    "Automatic Semantic Labelling of Images by Their Content Using Non-Parametric Bayesian Machine Learning and Image Search Using Synthetically Generated Image Collages.",
                    "Cohort Representation and Exploration.",
                    "Predicting Worker Disagreement for More Effective Crowd Labeling.",
                    "Gradient Reversal against Discrimination: A Fair Neural Network Learning Approach.",
                    "Forest of Normalized Trees: Fast and Accurate Density Estimation of Streaming Data.",
                    "Model Adaptation and Personalization for Physiological Stress Detection.",
                    "Random Forest Framework Customized to Handle Highly Correlated Variables: An Extensive Experimental Study Applied to Feature Selection in Genetic Data.",
                    "Parallel Continuous Outlier Mining in Streaming Data.",
                    "Learning to Make Predictions on Graphs with Autoencoders.",
                    "Entity-Level Stream Classification: Exploiting Entity Similarity to Label the Future Observations Referring to an Entity.",
                    "Forecasting Retweet Count during Elections Using Graph Convolution Neural Networks.",
                    "Practical Deep Learning Architecture Optimization.",
                    "DNA: General Deterministic Network Adaptive Framework for Multi-Round Multi-Party Influence Maximization.",
                    "DeepClean: Data Cleaning via Question Asking.",
                    "Towards Bankruptcy Prediction: Deep Sentiment Mining to Detect Financial Distress from Business Management Reports.",
                    "Wetting and Drying of Soil: From Data to Understandable Models for Prediction.",
                    "Starting Movement Detection of Cyclists Using Smart Devices.",
                    "The Economic Value of Neighborhoods: Predicting Real Estate Prices from the Urban Environment.",
                    "A Multi-Task Deep Learning Architecture for Maritime Surveillance Using AIS Data Streams.",
                    "Scalable and Interpretable Predictive Models for Electronic Health Records.",
                    "Mining Sensor Data for Predictive Maintenance in the Automotive Industry.",
                    "Learning Data Mining.",
                    "Large-Scale Railway Networks Train Movements: A Dynamic, Interpretable, and Robust Hybrid Data Analytics System.",
                    "Selection of a Nominal Device Using Functional Data Analysis.",
                    "A Data Science Approach to Modelling a Manufacturing Facility's Electrical Energy Profile from Plant Production Data.",
                    "Big Data-Driven Platform for Cross-Media Monitoring.",
                    "Detecting and Counting Panicles in Sorghum Images.",
                    "A Case Study on Reducing Auto Insurance Attrition with Econometrics, Machine Learning, and A/B Testing.",
                    "Captioning with Language-Based Attention.",
                    "Developing and Deploying a Taxi Price Comparison Mobile App in the Wild: Insights and Challenges.",
                    "Classifying Sensitive Content in Online Advertisements with Deep Learning.",
                    "Optimizing New User Experience in Online Services.",
                    "Towards Simulation-Data Science - A Case Study on Material Failures.",
                    "Using Data Analytics to Optimize Public Transportation on a College Campus.",
                    "DSAA 2018 Special Session: Data Science for Social Good.",
                    "Weak Nodes Detection in Urban Transport Systems: Planning for Resilience in Singapore.",
                    "A Hybrid Recommender System for Patient-Doctor Matchmaking in Primary Care.",
                    "Coolabilities API.",
                    "Global Income Inequality and Savings: A Data Science Perspective.",
                    "Fine-Grained Analysis of Cyberbullying Using Weakly-Supervised Topic Models.",
                    "Data Fusion to Describe and Quantify Search and Rescue Operations in the Mediterranean Sea.",
                    "Data Science Challenges in Computational Psychiatry and Psychiatric Research.",
                    "MixDir: Scalable Bayesian Clustering for High-Dimensional Categorical Data.",
                    "Latent Dirichlet Allocation in Discovering Goals in Patients Undergoing Bladder Cancer Surgery.",
                    "Analysing Activities, Contextualized for General Health, Depression and Demographics.",
                    "MRI-Based Diagnostics of Depression Concomitant with Epilepsy: In Search of the Potential Biomarkers.",
                    "Outcome-Weighted Learning for Personalized Medicine with Multiple Treatment Options.",
                    "Environmental and Geo-Spatial Data Analytics (EnGeoData'2018).",
                    "Airpred: A Flexible R Package Implementing Methods for Predicting Air Pollution.",
                    "On Non-Routine Places in Urban Human Mobility.",
                    "Convolutional Neural Networks for Disaggregated Population Mapping Using Open Data.",
                    "Crowdsourcing Landforms for Open GIS Enrichment.",
                    "Opportunities and Risks for Data Science in Organizations: Banking, Finance, and Policy - Special Session Overview.",
                    "Determinants of Growth in Micro and Small Enterprises: Empirical Evidence from Jordan.",
                    "Network-Based Models to Improve Credit Scoring Accuracy.",
                    "Predictive Modeling for Identifying Return Defaulters in Goods and Services Tax.",
                    "SeCredISData 2018: Special Session on Sentiment, Emotion, and Credibility of Information in Social Data.",
                    "A Methodological Template to Construct Ground Truth of Authentic and Fake Online Reviews.",
                    "Behind Our Words: Psychological Paths Underlying the Un/Supportive Stance Toward Immigrants in Social Media.",
                    "Portability of Aspect Based Sentiment Analysis: Thirty Minutes for a Proof of Concept.",
                    "Willingness to Share Emotion Information on Social Media: Influence of Personality and Social Context.",
                    "An Empirical Analysis of the Role of Amplifiers, Downtoners, and Negations in Emotion Classification in Microblogs.",
                    "Utilizing Tweet Content for the Detection of Sentiment-Based Interaction Communities on Twitter."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "4th DSAA 2017",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2017",
                "sub_name": "2017 IEEE International Conference on Data Science and Advanced Analytics, DSAA 2017, Tokyo, Japan, October 19-21, 2017.",
                "count": 83,
                "papers": [
                    "The k-Nearest Representatives Classifier: A Distance-Based Classifier with Strong Generalization Bounds.",
                    "Cyclic Classifier Chain for Cost-Sensitive Multilabel Classification.",
                    "Learning Low-Rank Document Embeddings with Weighted Nuclear Norm Regularization.",
                    "Learning Through Utility Optimization in Regression Tasks.",
                    "Animal Recognition and Identification with Deep Convolutional Neural Networks for Automated Wildlife Monitoring.",
                    "Nazr-CNN: Fine-Grained Classification of UAV Imagery for Damage Assessment.",
                    "Website Navigation Behavior Analysis for Bot Detection.",
                    "Inform Product Change through Experimentation with Data-Driven Behavioral Segmentation.",
                    "Scalable RFM-enriched Representation Learning for Churn Prediction.",
                    "A Comparative Study of Different Approaches for Tracking Communities in Evolving Social Networks.",
                    "The Initialization and Parameter Setting Problem in Tensor Decomposition-Based Link Prediction.",
                    "Combining Instance and Feature Neighbors for Efficient Multi-label Classification.",
                    "Expert Estimates for Feature Relevance are Imperfect.",
                    "Multi-label Learning with Label-Specific Features via Clustering Ensemble.",
                    "Customizing Travel Packages with Interactive Composite Items.",
                    "Materials Science Literature-Patent Relevance Search: A Heterogeneous Network Analysis Approach.",
                    "NDlib: Studying Network Diffusion Dynamics.",
                    "Full-Text or Abstract? Examining Topic Coherence Scores Using Latent Dirichlet Allocation.",
                    "Incremental Author Name Disambiguation for Scientific Citation Data.",
                    "Supercharging Crowd Dynamics Estimation in Disasters via Spatio-Temporal Deep Neural Network.",
                    "Geo-Spatial Multimedia Sentiment Analysis in Disasters.",
                    "Situational Awareness from Social Media Photographs Using Automated Image Captioning.",
                    "Machine Learning Independent of Population Distributions for Measurement.",
                    "A Dynamic Factor Machine Learning Method for Multi-variate and Multi-step-Ahead Forecasting.",
                    "CSAR: The Cross-Sectional Autoregression Model.",
                    "Dynamic and Heterogeneous Ensembles for Time Series Forecasting.",
                    "Forward-Backward Smoothing for Hidden Markov Models of Point Pattern Data.",
                    "RadiusSketch: Massively Distributed Indexing of Time Series.",
                    "BJR-Tree: Fast Skyline Computation Algorithm for Serendipitous Searching Problems.",
                    "A Directional Change Based Trading Strategy with Dynamic Thresholds.",
                    "Subsequence Search Considering Duration and Relations of Events in Time Interval-Based Events Sequences.",
                    "There's a Path for Everyone: A Data-Driven Personal Model Reproducing Mobility Agendas.",
                    "Heterogeneous Information Integration for Mountain Augmented Reality Mobile Apps.",
                    "Predictive Classification of Water Consumption Time Series Using Non-homogeneous Markov Models.",
                    "DP-POIRS: A Diversified and Personalized Point-of-Interest Recommendation System.",
                    "On the Jeffreys-Lindley Paradox and the Looming Reproducibility Crisis in Machine Learning.",
                    "M3A: Model, MetaModel and Anomaly Detection for Inter-arrivals of Web Searches and Postings.",
                    "A Consistency-Based Multimodal Graph Embedding Method for Dimensionality Reduction.",
                    "Sample, Estimate, Tune: Scaling Bayesian Auto-Tuning of Data Science Pipelines.",
                    "What Makes a Video Memorable?",
                    "Convolutional Neural Networks Based Multi-task Deep Learning for Movie Review Classification.",
                    "Masked Conditional Neural Networks for Automatic Sound Events Recognition.",
                    "A Spatial-Cue-Based Probabilistic Model for Bird Song Scene Analysis.",
                    "The Data and Science behind GrabShare Carpooling.",
                    "Regression Based Model for Autosteering of a Car with Delayed Steering Response.",
                    "Ensemble-Based Location Tracking Using Passive RFID.",
                    "Leveraging on Predictive Analytics to Manage Clinic No Show and Improve Accessibility of Care.",
                    "A Shape-Based Approach to Spatio-Temporal Data Analysis Using Satellite Imagery.",
                    "Mobility Genome™- A Framework for Mobility Intelligence from Large-Scale Spatio-Temporal Data.",
                    "A Peak Detection Method to Uncover Events from Social Media.",
                    "Semantic Trajectory Modeling for Dynamic Built Environments.",
                    "HiSPEED: A System for Mining Performance Appraisal Data and Text.",
                    "Identification of Signal and Noise Components in Spacecraft Neutral Particle Data Using a Bi-Level Mixture Model.",
                    "A Collaborative Filtering-Based Two Stage Model with Item Dependency for Course Recommendation.",
                    "Enriching Course-Specific Regression Models with Content Features for Grade Prediction.",
                    "Steganalysis Feature Subspace Selection Based on Fisher Criterion.",
                    "Coupled Bayesian Matrix Factorization in Recommender Systems.",
                    "A Comparative Study of Performance Estimation Methods for Time Series Forecasting.",
                    "On Spectral Analysis of Directed Signed Graphs.",
                    "AnonML: Locally Private Machine Learning over a Network of Peers.",
                    "Maximizing Network Performance Based on Group Centrality by Creating Most Effective k-Links.",
                    "Multi-task Network Embedding.",
                    "Multiple Social Role Embedding.",
                    "FeatureHub: Towards Collaborative Data Science.",
                    "Identifying Anomalous Nodes in Multidimensional Networks.",
                    "Discovering Community Structure in Multilayer Networks.",
                    "Learning to Compress Unstructured Mesh Data from Simulations.",
                    "An Assessment of Streaming Active Learning Strategies for Real-Life Credit Card Fraud Detection.",
                    "A Probabilistic, Mechanism-Indepedent Outlier Detection Method for Online Experimentation.",
                    "News Consumption during the Italian Referendum: A Cross-Platform Analysis on Facebook and Twitter.",
                    "Feature Analysis for Fake Review Detection through Supervised Classification.",
                    "Online k-Maxoids Clustering.",
                    "Disentangled Link Prediction for Signed Social Networks via Disentangled Representation Learning.",
                    "Exploiting Digital DNA for the Analysis of Similarities in Twitter Behaviours.",
                    "Where are You Going? Next Place Prediction from Twitter.",
                    "A Study of Stochastic Mixed Membership Models for Link Prediction in Social Networks.",
                    "Latent Dimensionality Estimation for Probabilistic Canonical Correlation Analysis Using Normalized Maximum Likelihood Code-Length.",
                    "A Novel Approach for Estimating Multiple Sparse Precision Matrices Using ℓ0, 0 Regularization.",
                    "Copula-Based High Dimensional Cross-Market Dependence Modeling.",
                    "Causal Patterns: Extraction of Multiple Causal Relationships by Mixture of Probabilistic Partial Canonical Correlation Analysis.",
                    "SECODA: Segmentation- and Combination-Based Detection of Anomalies.",
                    "Extended Methods to Handle Classification Biases.",
                    "Toward Optimal Streaming Feature Selection."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "3rd DSAA 2016",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2016",
                "sub_name": "2016 IEEE International Conference on Data Science and Advanced Analytics, DSAA 2016, Montreal, QC, Canada, October 17-19, 2016.",
                "count": 86,
                "papers": [
                    "On the Evaluation of Outlier Detection and One-Class Classification Methods.",
                    "Active Semi-Supervised Classification Based on Multiple Clustering Hierarchies.",
                    "Combining Static and Dynamic Features for Multivariate Sequence Classification.",
                    "Correcting Relational Bias to Improve Classification in Sparsely-Labeled Networks.",
                    "Hyperparameter Optimization Machines.",
                    "Temporal Network Change Detection Using Network Centralities.",
                    "Harvester: Influence Optimization in Symmetric Interaction Networks.",
                    "Pattern Matching Trajectories for Investigative Graph Searches.",
                    "A Framework for Description and Analysis of Sampling-Based Approximate Triangle Counting Algorithms.",
                    "Limiting the Diffusion of Information by a Selective PageRank-Preserving Approach.",
                    "An Exploratory Statistical Cusp Catastrophe Model.",
                    "Using Loglinear Model for Discrimination Discovery and Prevention.",
                    "Fraud Detection in Energy Consumption: A Supervised Approach.",
                    "Anomaly Detection in Automobile Control Network Data with Long Short-Term Memory Networks.",
                    "Anonymizing NYC Taxi Data: Does It Matter?",
                    "Infinite Langevin Mixture Modeling and Feature Selection.",
                    "Efficient Identification of Tanimoto Nearest Neighbors.",
                    "Parallel Least-Squares Policy Iteration.",
                    "Dilation of Chisini-Jensen-Shannon Divergence.",
                    "Projecting \"Better Than Randomly\": How to Reduce the Dimensionality of Very Large Datasets in a Way That Outperforms Random Projections.",
                    "Task Composition in Crowdsourcing.",
                    "On the Role of Mentions on Tweet Virality.",
                    "Mining Pre-Exposure Prophylaxis Trends in Social Media.",
                    "Overlapping Target Event and Story Line Detection of Online Newspaper Articles.",
                    "Online Collaborative Prediction of Regional Vote Results.",
                    "Continuous Monitoring of A/B Tests without Pain: Optional Stopping in Bayesian Testing.",
                    "Learning Temporal Dependence from Time-Series Data with Latent Variables.",
                    "Trend Detection Based Regret Minimization for Bandit Problems.",
                    "A Symbolic Tree Model for Oil and Gas Production Prediction Using Time-Series Production Data.",
                    "Resampling Strategies for Imbalanced Time Series.",
                    "Performance Improvement of MapReduce Process by Promoting Deep Data Locality.",
                    "Closest Interval Join Using MapReduce.",
                    "EM*: An EM Algorithm for Big Data.",
                    "Efficient Sampling-Based ADMM for Distributed Data.",
                    "A Parallel Framework for Grid-Based Bottom-Up Subspace Clustering.",
                    "Impact of Query Sample Selection Bias on Information Retrieval System Ranking.",
                    "Mining Research Problems from Scientific Literature.",
                    "Perceived, Projected, and True Investment Expertise: Not All Experts Provide Expert Recommendations.",
                    "A Multi-Granularity Pattern-Based Sequence Classification Framework for Educational Data.",
                    "Inconsistent Node Flattening for Improving Top-Down Hierarchical Classification.",
                    "Learning Multifaceted Latent Activities from Heterogeneous Mobile Data.",
                    "The Synthetic Data Vault.",
                    "A Decision Tree-Based Approach for Categorizing Spatial Database Query Results.",
                    "The Semantic Knowledge Graph: A Compact, Auto-Generated Model for Real-Time Traversal and Ranking of any Relationship within a Domain.",
                    "Label, Segment, Featurize: A Cross Domain Framework for Prediction Engineering.",
                    "What Would a Data Scientist Ask? Automatically Formulating and Solving Predictive Problems.",
                    "Detecting Inaccurate Predictions of Pediatric Surgical Durations.",
                    "Advanced Analytics for Train Delay Prediction Systems by Including Exogenous Weather Data.",
                    "Waiting to Be Sold: Prediction of Time-Dependent House Selling Probability.",
                    "Customer Simulation for Direct Marketing Experiments.",
                    "Behavior-Oriented Time Segmentation for Mining Individualized Rules of Mobile Phone Users.",
                    "Online Experimentation Diagnosis and Troubleshooting Beyond AA Validation.",
                    "Role Models: Mining Role Transitions Data in IT Project Management.",
                    "Deconstructing Domain Names to Reveal Latent Topics.",
                    "Reserve Price Optimization at Scale.",
                    "Uncovering the Bitcoin Blockchain: An Analysis of the Full Users Graph.",
                    "Testing Interestingness Measures in Practice: A Large-Scale Analysis of Buying Patterns.",
                    "Data-Driven Sales Leads Prediction for Everything-as-a-Service in the Cloud.",
                    "Churn Prediction in Mobile Social Games: Towards a Complete Assessment Using Survival Ensembles.",
                    "Web Behavior Analysis Using Sparse Non-Negative Matrix Factorization.",
                    "Evidence-Based Behavioral Model for Calendar Schedules of Individual Mobile Phone Users.",
                    "Disease Detection and Severity Estimation in Cotton Plant from Unconstrained Images.",
                    "Digital Knowledge Ecosystem for Achieving Sustainable Agriculture Production: A Case Study from Sri Lanka.",
                    "Efficient Large Scale Clustering Based on Data Partitioning.",
                    "Traffic Risk Mining Using Partially Ordered Non-Negative Matrix Factorization.",
                    "On the Use of Ontology as A Priori Knowledge into Constrained Clustering.",
                    "Maritime Pattern Extraction from AIS Data Using a Genetic Algorithm.",
                    "Using Players' Gameplay Action-Decision Profiles to Prescribe Training: Reducing Training Costs with Serious Games Analytics.",
                    "What Did I Do Wrong in My MOBA Game? Mining Patterns Discriminating Deviant Behaviours.",
                    "On the Tiny Yet Real Happiness Phenomenon in the Mobile Games Market.",
                    "Actitracker: A Smartphone-Based Activity Recognition System for Improving Health and Well-Being.",
                    "The Highly Adaptive Lasso Estimator.",
                    "Meeting Health Care Research Needs in a Kimball Integrated Data Warehouse.",
                    "MedCare: Leveraging Medication Similarity for Disease Prediction.",
                    "Connecting Opinions to Opinion-Leaders: A Case Study on Brazilian Political Protests.",
                    "Exploiting a Bootstrapping Approach for Automatic Annotation of Emotions in Texts.",
                    "Senpy: A Pragmatic Linked Sentiment Analysis Framework.",
                    "Word Segmentation Algorithms with Lexical Resources for Hashtag Classification.",
                    "A Distributed Decision Tree Algorithm and Its Implementation on Big Data Platforms.",
                    "Analysing the History of Autism Spectrum Disorder Using Topic Models.",
                    "Sparse Linear Discriminant Analysis in Structured Covariates Space.",
                    "Informative Priors and Bayesian Computation.",
                    "Causal Structure Learning with Reduced Partial Correlation Thresholding.",
                    "Nonparametric Adjoint-Based Inference for Stochastic Differential Equations.",
                    "The Uniqueness and Greedy Method for Quadratic Compressive Sensing.",
                    "Robust Online Time Series Prediction with Recurrent Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "2nd DSAA 2015",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2015",
                "sub_name": "2015 IEEE International Conference on Data Science and Advanced Analytics, DSAA 2015, Campus des Cordeliers, Paris, France, October 19-21, 2015.",
                "count": 129,
                "papers": [
                    "Toward personal knowledge bases.",
                    "Special session on trends & controversies in data science (TCDS).",
                    "The sexy job in the next ten years will be statisticians.",
                    "Tutorial 1: NVIDIA's platform for Deep Neural Networks.",
                    "Matrix factorization approach to behavioral mode analysis from acceleration data.",
                    "Random-shapelet: An algorithm for fast shapelet discovery.",
                    "On-line detection of continuous changes in stochastic processes.",
                    "Duration models for activity recognition and prediction in buildings using Hidden Markov Models.",
                    "Temporal Needleman-Wunsch.",
                    "Exploiting big data in time series forecasting: A cross-sectional approach.",
                    "Compression rate distance measure for time series.",
                    "Multi-class learning using data driven ECOC with deep search and re-balancing.",
                    "Calibration of One-Class SVM for MV set estimation.",
                    "Improved risk predictions via sparse imputation of patient conditions in electronic medical records.",
                    "Label noise correction methods.",
                    "Hierarchical label partitioning for large scale classification.",
                    "Detecting human emotion via speech recognition by using speech spectrogram.",
                    "An effective and economic bi-level approach to ranking and rating spam detection.",
                    "Multi-objective clustering ensemble for high-dimensional data based on Strength Pareto Evolutionary Algorithm (SPEA-II).",
                    "Spherical wards clustering and generalized Voronoi diagrams.",
                    "A new consensus function based on dual-similarity measurements for clustering ensemble.",
                    "Relational active learning for link-based classification.",
                    "Scalable relational learning for large heterogeneous networks.",
                    "Integrating spatial information into probabilistic relational models.",
                    "From one star to three stars: Upgrading legacy open data using crowdsourcing.",
                    "An approach to cover more advertisers in Adwords.",
                    "Learning from missing data using selection bias in movie recommendation.",
                    "An accurate rating aggregation method for generating item reputation.",
                    "The NIST data science initiative.",
                    "Predictive reliability mining for early warnings in populations of connected machines.",
                    "Towards predictable and risk-free enterprise systems.",
                    "Classification with a reject option under Concept Drift: The Droplets algorithm.",
                    "The layered structure of company share networks.",
                    "A unifying model for representing time-varying graphs.",
                    "Sensor network partitioning based on homogeneity.",
                    "Selecting representative instances from datasets.",
                    "Improved algorithms for exact and approximate boolean matrix decomposition.",
                    "Modeling recurrent distributions in streams using possible worlds.",
                    "Information preserving and locally isometric&conformal embedding via Tangent Manifold Learning.",
                    "The HIM glocal metric and kernel for network comparison and classification.",
                    "Learning hyperparameter optimization initializations.",
                    "Fast and user-friendly non-linear principal manifold learning by method of elastic maps.",
                    "Efficient metric learning for the analysis of motion data.",
                    "Modeling temporal dependencies in data using a DBN-LSTM.",
                    "Behavioral entropy and profitability in retail.",
                    "Discovering characterizing regions for consumer products.",
                    "The harsh rule of the goals: Data-driven performance indicators for football teams.",
                    "When cyberathletes conceal their game: Clustering confusion matrices to identify avatar aliases.",
                    "Data science foundry for MOOCs.",
                    "TSMH Graph Cube: A novel framework for large scale multi-dimensional network analysis.",
                    "A mining based approach for efficient enumeration of algebraic structures.",
                    "FactorBase : Multi-relational model learning with SQL all the way.",
                    "A text block context informations based multiple Web contents extraction.",
                    "LDA based semi-supervised learning from streaming short text.",
                    "A context-aware approach to detection of short irrelevant texts.",
                    "Document similarity analysis via involving both explicit and implicit semantic couplings.",
                    "Learning better while sending less: Communication-efficient online semi-supervised learning in client-server settings.",
                    "EXP3 with drift detection for the switching bandit problem.",
                    "Beyond two-sample-tests: Localizing data discrepancies in high-dimensional spaces.",
                    "Multi-task learning with selective cross-task transfer for predicting bleeding and other important patient outcomes.",
                    "P-N-RMiner: A generic framework for mining interesting structured relational patterns.",
                    "Interactive exploration over RDF data using formal concept analysis.",
                    "Cohesion based co-location pattern mining.",
                    "Mining actionable combined patterns of high utility and frequency.",
                    "Nonparametric discovery of online mental health-related communities.",
                    "Human judgments in hiring decisions based on online social network profiles.",
                    "A model-based approach for identifying spammers in social networks.",
                    "Dynamics of multi-campaign propagation in online social networks.",
                    "Quantification in social networks.",
                    "Discovering and tracking influencer-influencee relationships between online communities.",
                    "A mixture model clustering approach for temporal passenger pattern characterization in public transport.",
                    "Evaluating and predicting energy consumption of data mining algorithms on mobile devices.",
                    "Hermessem: A semantic-aware framework for the management and analysis of our LifeSteps.",
                    "Scalable extraction of timeline information from road traffic data using MapReduce.",
                    "IOHMM for location prediction with missing data.",
                    "Random walk based context-aware activity recommendation for location based social networks.",
                    "A talent management tool using propensity to leave analytics.",
                    "Financial crisis and global market couplings.",
                    "Sentiment and stock market volatility predictive modelling - A hybrid approach.",
                    "Time series contextual anomaly detection for detecting market manipulation in stock market.",
                    "An unsupervised attribute clustering algorithm for unsupervised feature selection.",
                    "Deep feature synthesis: Towards automating data science endeavors.",
                    "Exploiting feature relationships towards stable feature selection.",
                    "Context weight considered for implicit feature extracting.",
                    "Mining high-utility itemsets with various discount strategies.",
                    "Design of an NGS MicroRNA predictor using multilayer hierarchical MapReduce framework.",
                    "An ensemble of machine learning and anti-learning methods for predicting tumour patient survival rates.",
                    "Patient classification based on expanded query using 5-gram collocation and binary tree.",
                    "Improved approach for protein function prediction by exploiting prominent proteins.",
                    "MIAT: A novel attribute selection approach to better predict upper gastrointestinal cancer.",
                    "Modeling heterogeneous clinical sequence data in semantic space for adverse drug event detection.",
                    "A data-driven analytics approach in the study of pneumonia's fatalities.",
                    "Cascading adverse drug event detection in electronic health records.",
                    "Characterizing chronic disease and polymedication prescription patterns from electronic health records.",
                    "Ensemble of deep long short term memory networks for labelling origin of replication sequences.",
                    "Anomaly detection in ECG time signals via deep long short-term memory networks.",
                    "Predicting online video engagement using clickstreams.",
                    "Profit maximizing logistic regression modeling for customer churn prediction.",
                    "A fusion-based approach for user activities recognition on smart phones.",
                    "Tracking the evolution of community structures in time-evolving social networks.",
                    "Mining relationships in learning-oriented social networks.",
                    "Constrained spectral clustering for regionalization: Exploring the trade-off between spatial contiguity and landscape homogeneity.",
                    "Multifactorial uncertainty assessment for monitoring population abundance using computer vision.",
                    "Detection, tracking, and visualization of spatial event clusters for real time monitoring.",
                    "Big data from cellular networks: How to estimate energy demand at real-time.",
                    "Sentiment analysis as a text categorization task: A study on feature and algorithm selection for Italian language.",
                    "Sentiment analysis of Facebook data using Hadoop based open source technologies.",
                    "Debate on political reforms in Twitter: A hashtag-driven analysis of political polarization.",
                    "Hot spot detection - An interactive cluster heat map for sentiment analysis.",
                    "Monitoring the Twitter sentiment during the Bulgarian elections.",
                    "Using emotions to predict user interest areas in online social networks.",
                    "Detecting irony and sarcasm in microblogs: The role of expressive signals and ensemble classifiers.",
                    "Traffic risk mining from heterogeneous road statistics.",
                    "Learning urban users' choices to improve trip recommendations.",
                    "RIMM: A novel map matching model with rotational invariance.",
                    "Assistive classification for improving the efficiency of avian species richness surveys.",
                    "Data-driven semantic concept analysis for automatic actionable ontology design.",
                    "MapReduce-based k-prototypes clustering method for big data.",
                    "Cluster-based data oriented hashing.",
                    "Error detection of oceanic observation data using sequential labeling.",
                    "Constrained independence for detecting interesting patterns.",
                    "A ranking-based approach for hierarchical classification.",
                    "A combination of CUSUM-EWMA for Anomaly Detection in time series data.",
                    "Multi-target regression from high-speed data streams with adaptive model rules.",
                    "Scalable image annotation using a product compressive sampling approach.",
                    "Time series analysis with graph-based semi-supervised learning.",
                    "IQ4EC: Intensional answers as a support to exploratory computing.",
                    "TESS: Temporal event sequence summarization.",
                    "Succinctly summarizing machine usage via multi-subspace clustering of multi-sensor data."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "1st DSAA 2014",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/dsaa/2014",
                "sub_name": "International Conference on Data Science and Advanced Analytics, DSAA 2014, Shanghai, China, October 30 - November 1, 2014.",
                "count": 93,
                "papers": [
                    "Assessing the longevity of online videos: A new insight of a video's quality.",
                    "Welcome from DSAA 2014 chairs.",
                    "Minimizing expected loss for risk-avoiding reinforcement learning.",
                    "Large-scale factorization of type-constrained multi-relational data.",
                    "Pseudo labels for imbalanced multi-label learning.",
                    "Proactive learning with multiple class-sensitive labelers.",
                    "Itemset approximation using Constrained Binary Matrix Factorization.",
                    "Community detection in social networks: The power of ensemble methods.",
                    "Semi-randomized hashing for large scale data retrieval.",
                    "Storage efficient graph search by composite dynamic-and-static indexing of a single network.",
                    "Indexing and retrieval of human motion data based on a growing self-organizing map.",
                    "An improved dynamic adaptive multi-tree search anti-collision algorithm based on RFID.",
                    "Exploiting mobility for location promotion in location-based social networks.",
                    "Investigating sample selection bias in the relevance feedback algorithm of the vector space model for Information Retrieval.",
                    "Learning a proximity measure to complete a community.",
                    "A confidence-based entity resolution approach with incomplete information.",
                    "Matrix completion based on feature vector and function approximation.",
                    "An accuracy enhancement algorithm for fingerprinting method.",
                    "Probabilistic Category-based Location Recommendation Utilizing Temporal Influence and Geographical Influence.",
                    "Recommending funding collaborators with scholar social networks.",
                    "An incremental scheme for large-scale social-based recommender systems.",
                    "Diversification in news recommendation for privacy concerned users.",
                    "Similarity analysis of service descriptions for efficient Web service discovery.",
                    "Active learning for text classification: Using the LSI Subspace Signature Model.",
                    "A semisupervised associative classification method for POS tagging.",
                    "Optimizing specificity under perfect sensitivity for medical data classification.",
                    "Interactive correlation clustering.",
                    "Rough possibilistic meta-clustering of retail datasets.",
                    "Detecting hidden propagation structure and its application to analyzing phishing.",
                    "Account level demand estimation and intelligence framework.",
                    "A new pre-pushing VoD scheme in hierarchical network environment.",
                    "Usage signatures analysis an alternative method for preventing fraud in E-Commerce applications.",
                    "Exploring new privacy approaches in a scalable classification framework.",
                    "Efficient analysis of node influence based on SIR model over huge complex networks.",
                    "Social influence-aware reverse nearest neighbor search.",
                    "Influence maximization in a social network in the presence of multiple influences and acceptances.",
                    "Diversified ranking on graphs from the influence maximization viewpoint.",
                    "Mining influence in evolving entities: A study on stock market.",
                    "Sentiment detection and visualization of Chinese micro-blog.",
                    "Critical class sensitive active learning method for classification of remote sensing imagery.",
                    "Content specific coverage patterns for banner advertisement placement.",
                    "Appliance and state recognition using Hidden Markov Models.",
                    "Exploring technological trends for patent evaluation.",
                    "Crowdsourced data analytics: A case study of a predictive modeling competition.",
                    "A model-selection framework for concept-drifting data streams.",
                    "A probabilistic condensed representation of data for stream mining.",
                    "Incrementally mining temporal patterns in interval-based databases.",
                    "The purpose of motion: Learning activities from Individual Mobility Networks.",
                    "On selecting feature-value pairs on smart phones for activity inferences.",
                    "Learning sparse and scale-free networks.",
                    "Overlapping Community Detection in social network based on Microblog User Model.",
                    "Information diffusion among users on Facebook fan pages over time: Its impact on movie box office.",
                    "Inferring potential users in mobile social networks.",
                    "A token authentication solution for hadoop based on kerberos pre-authentication.",
                    "Hadoop based Deep Packet Inspection system for traffic analysis of e-business websites.",
                    "A data reusing strategy based on hive.",
                    "Dehazing algorithm's high performance and parallel computing for GF-1 Satellite Images.",
                    "General in-situ matrix transposition algorithm for massively parallel environments.",
                    "Efficient learning of general Bayesian network Classifier by Local and Adaptive Search.",
                    "A naïve Bayesian classifier in categorical uncertain data streams.",
                    "A new set of Random Forests with varying dynamic data reduction and voting techniques.",
                    "Centroid Training to achieve effective text classification.",
                    "Representing sentence with unfolding recursive autoencoders and dynamic average pooling.",
                    "A novel context-based implicit feature extracting method.",
                    "Local feature based dynamic time warping.",
                    "Mobile user stability prediction with Random Forest model.",
                    "Detecting stock market manipulation using supervised learning algorithms.",
                    "Recommending missing citations for newly granted patents.",
                    "FCA for Common Interest Communities discovering.",
                    "Diversification recommendation of popular articles in micro-blog scenario.",
                    "Analysis of circadian rhythms from online communities of individuals with affective disorders.",
                    "Link prediction and threads in email networks.",
                    "Mining approximate multi-relational patterns.",
                    "A detecting community method in complex networks with fuzzy clustering.",
                    "Neural network-based approaches for predicting query response times.",
                    "User preference space partition and product filters for reverse top-k queries.",
                    "Finding top-k semantically related terms from relational keyword search.",
                    "Design process for Big Data Warehouses.",
                    "23-bit metaknowledge template towards Big Data knowledge discovery and management.",
                    "Location semantics prediction for living analytics by mining smartphone data.",
                    "Management of complex data objects in ship designing process.",
                    "SAR target recognition based on deep learning.",
                    "Mining frequent Time Interval-based Event with duration patterns from temporal database.",
                    "Sharing sensitive medical data sets for research purposes - A case study.",
                    "Mobile-based food classification for Type-2 Diabetes using nutrient and textual features.",
                    "Individualized arrhythmia detection with ECG signals from wearable devices.",
                    "Exploratory computing: a draft Manifesto.",
                    "Exploratory portals: The need for a new generation.",
                    "Exploring emotions over time within the blogosphere.",
                    "StatsReduce in the cloud for approximate Analytics.",
                    "An implementation of the efficient huge amount of pseudo-random unique numbers generator and the acceleration analysis of parallelization.",
                    "Toward robust classification using the Open Directory Project.",
                    "Generating, communicating, accessing and analyzing data in a context-aware perspective."
                ]
            }
        ]
    }
]