[
    {
        "year": "2021",
        "name": "29th ESA 2021",
        "info": "Lisbon, Portugal (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2021",
                "sub_name": "29th Annual European Symposium on Algorithms, ESA 2021, September 6-8, 2021, Lisbon, Portugal (Virtual Conference).",
                "count": 83,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Network Planning and Routing Problems over Time: Models, Complexity and Algorithms (Invited Talk).",
                    "A User Friendly Power Tool for Deriving Online Learning Algorithms (Invited Talk).",
                    "Bi-Objective Search with Bi-Directional A.",
                    "A Unified Approach for All Pairs Approximate Shortest Paths in Weighted Undirected Graphs.",
                    "The Voronoi Diagram of Rotating Rays With applications to Floodlight Illumination.",
                    "Parallel Computation of Combinatorial Symmetries.",
                    "Graph Connectivity and Single Element Recovery via Linear and OR Queries.",
                    "Fully Dynamic Set Cover via Hypergraph Maximal Matching: An Optimal Approximation Through a Local Approach.",
                    "The Randomized Competitive Ratio of Weighted k-Server Is at Least Exponential.",
                    "Orienting (Hyper)graphs Under Explorable Stochastic Uncertainty.",
                    "k-Distinct Branchings Admits a Polynomial Kernel.",
                    "Incremental Edge Orientation in Forests.",
                    "k-Center Clustering with Outliers in the Sliding-Window Model.",
                    "Incremental SCC Maintenance in Sparse Graphs.",
                    "Lyndon Words Accelerate Suffix Sorting.",
                    "Online Euclidean Spanners.",
                    "Distant Representatives for Rectangles in the Plane.",
                    "Near-Optimal Deterministic Single-Source Distance Sensitivity Oracles.",
                    "Synchronized Planarity with Applications to Constrained Planarity Problems.",
                    "Efficiently Approximating Vertex Cover on Scale-Free Networks with Underlying Hyperbolic Geometry.",
                    "Efficiently Computing Maximum Flows in Scale-Free Networks.",
                    "Asymptotically Optimal Welfare of Posted Pricing for Multiple Items with MHR Distributions.",
                    "Covert Computation in Staged Self-Assembly: Verification Is PSPACE-Complete.",
                    "An Instance-Optimal Algorithm for Bichromatic Rectangular Visibility.",
                    "Worst-Case Efficient Dynamic Geometric Independent Set.",
                    "Balanced Crown Decomposition for Connectivity Constraints.",
                    "All-Pairs Shortest Paths for Real-Weighted Undirected Graphs with Small Additive Error.",
                    "Dynamic Colored Orthogonal Range Searching.",
                    "ℓp-Norm Multiway Cut.",
                    "Faster Algorithms for Longest Common Substring.",
                    "Feature Cross Search via Submodular Optimization.",
                    "An FPT Algorithm for the Embeddability of Graphs into Two-Dimensional Simplicial Complexes.",
                    "Efficient Sequential and Parallel Algorithms for Multistage Stochastic Integer Programming Using Proximity.",
                    "Modular Counting of Subgraphs: Matchings, Matching-Splittable Graphs, and Paths.",
                    "Minimum Common String Partition: Exact Algorithms.",
                    "An Accelerated Newton-Dinkelbach Method and Its Application to Two Variables per Inequality Systems.",
                    "Faster 3-Coloring of Small-Diameter Graphs.",
                    "Stability Yields Sublinear Time Algorithms for Geometric Optimization in Machine Learning.",
                    "Data Structures Lower Bounds and Popular Conjectures.",
                    "Approximation Schemes for Bounded Distance Problems on Fractionally Treewidth-Fragile Graphs.",
                    "Modular and Submodular Optimization with Multiple Knapsack Constraints via Fractional Grouping.",
                    "Differentially Private Algorithms for Graphs Under Continual Observation.",
                    "Experimental Comparison of PC-Trees and PQ-Trees.",
                    "Boundary-Sensitive Approach for Approximate Nearest-Neighbor Classification.",
                    "Compression by Contracting Straight-Line Programs.",
                    "Space Efficient Two-Dimensional Orthogonal Colored Range Counting.",
                    "Computing the 4-Edge-Connected Components of a Graph in Linear Time.",
                    "Deep Multilevel Graph Partitioning.",
                    "Faster (1+ε)-Approximation for Unsplittable Flow on a Path via Resource Augmentation and Back.",
                    "Quantum Sub-Gaussian Mean Estimator.",
                    "Improved Approximation Algorithms for Tverberg Partitions.",
                    "Near-Linear-Time, Optimal Vertex Cut Sparsifiers in Directed Acyclic Graphs.",
                    "Closing the Gap for Single Resource Constraint Scheduling.",
                    "Certified Approximation Algorithms for the Fermat Point and n-Ellipses.",
                    "Parameterized Algorithms for Diverse Multistage Problems.",
                    "Fast and Space-Efficient Construction of AVL Grammars from the LZ77 Parsing.",
                    "Convex Drawings of Hierarchical Graphs in Linear Time, with Applications to Planar Graph Morphing.",
                    "QCSP on Reflexive Tournaments.",
                    "Learnable and Instance-Robust Predictions for Online Matching, Flows and Load Balancing.",
                    "Telescoping Filter: A Practical Adaptive Filter.",
                    "Finding an Approximate Mode of a Kernel Density Estimate.",
                    "An Efficient Reduction of a Gammoid to a Partition Matroid.",
                    "Efficient Algorithms for Least Square Piecewise Polynomial Regression.",
                    "Bidirectional String Anchors: A New String Sampling Mechanism.",
                    "The Visibility Center of a Simple Polygon.",
                    "Extension of Additive Valuations to General Valuations on the Existence of EFX.",
                    "FPT and FPT-Approximation Algorithms for Unsplittable Flow on Trees.",
                    "A Simple Algorithm for Graph Reconstruction.",
                    "Generalized Max-Flows and Min-Cuts in Simplicial Complexes.",
                    "Hypersuccinct Trees - New Universal Tree Source Codes for Optimal Compressed Tree Data Structures and Range Minima.",
                    "Determining 4-Edge-Connected Components in Linear Time.",
                    "Isomorphism Testing Parameterized by Genus and Beyond.",
                    "Restricted t-Matchings via Half-Edges.",
                    "Beating Random Assignment for Approximating Quantum 2-Local Hamiltonian Problems.",
                    "Additive Sparsification of CSPs.",
                    "Faster Deterministic Modular Subset Sum.",
                    "Hardness of Detecting Abelian and Additive Square Factors in Strings.",
                    "On Approximate Compressions for Connected Minor-Hitting Sets.",
                    "Restricted Adaptivity in Stochastic Scheduling.",
                    "A General Framework for Enumerating Equivalence Classes of Solutions.",
                    "Engineering MultiQueues: Fast Relaxed Concurrent Priority Queues.",
                    "Evidence for Long-Tails in SLS Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th ESA 2020",
        "info": "Pisa, Italy (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2020",
                "sub_name": "28th Annual European Symposium on Algorithms, ESA 2020, September 7-9, 2020, Pisa, Italy (Virtual Conference).",
                "count": 84,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Planar Bichromatic Bottleneck Spanning Trees.",
                    "Parallel Batch-Dynamic Trees via Change Propagation.",
                    "Reconstructing Biological and Digital Phylogenetic Trees in Parallel.",
                    "Kruskal-Based Approximation Algorithm for the Multi-Level Steiner Tree Problem.",
                    "Analysis of the Period Recovery Error Bound.",
                    "Approximation of the Diagonal of a Laplacian's Pseudoinverse for Complex Network Analysis.",
                    "Cutting Polygons into Small Pieces with Chords: Laser-Based Localization.",
                    "Set Cover with Delay - Clairvoyance Is Not Required.",
                    "Improved Bounds for Metric Capacitated Covering Problems.",
                    "Minimum Neighboring Degree Realization in Graphs and Trees.",
                    "Tight Approximation Algorithms for p-Mean Welfare Under Subadditive Valuations.",
                    "Mincut Sensitivity Data Structures for the Insertion of an Edge.",
                    "Linear Time LexDFS on Chordal Graphs.",
                    "Grundy Distinguishes Treewidth from Pathwidth.",
                    "On the Complexity of BWT-Runs Minimization via Alphabet Reordering.",
                    "Simulating Population Protocols in Sub-Constant Time per Interaction.",
                    "An Optimal Decentralized (Δ + 1)-Coloring Algorithm.",
                    "Noisy, Greedy and Not so Greedy k-Means++.",
                    "An Algorithmic Study of Fully Dynamic Independent Sets for Map Labeling.",
                    "Lower Bounds and Approximation Algorithms for Search Space Sizes in Contraction Hierarchies.",
                    "The Minimization of Random Hypergraphs.",
                    "Acyclic, Star and Injective Colouring: A Complexity Picture for H-Free Graphs.",
                    "An Algorithmic Weakening of the Erdős-Hajnal Conjecture.",
                    "Reconfiguration of Spanning Trees with Many or Few Leaves.",
                    "When Lipschitz Walks Your Dog: Algorithm Engineering of the Discrete Fréchet Distance Under Translation.",
                    "Improved Algorithms for Alternating Matrix Space Isometry: From Theory to Practice.",
                    "Sometimes Reliable Spanners of Almost Linear Size.",
                    "New Binary Search Tree Bounds via Geometric Inversions.",
                    "More on Change-Making and Related Problems.",
                    "The Maximum Binary Tree Problem.",
                    "Single-Source Shortest Paths and Strong Connectivity in Dynamic Planar Graphs.",
                    "The Number of Repetitions in 2D-Strings.",
                    "New Bounds on Augmenting Steps of Block-Structured Integer Programs.",
                    "Distance Bounds for High Dimensional Consistent Digital Rays and 2-D Partially-Consistent Digital Rays.",
                    "Finding Large H-Colorable Subgraphs in Hereditary Graph Classes.",
                    "Compact Oblivious Routing in Weighted Graphs.",
                    "Approximation Algorithms for Clustering with Dynamic Points.",
                    "A Sub-Linear Time Framework for Geometric Optimization with Outliers in High Dimensions.",
                    "Practical Performance of Space Efficient Data Structures for Longest Common Extensions.",
                    "First-Order Model-Checking in Random Graphs and Complex Networks.",
                    "Optimally Handling Commitment Issues in Online Throughput Maximization.",
                    "A Polynomial Kernel for Line Graph Deletion.",
                    "Approximate CVPp in Time 20.802 n.",
                    "A (1-e-1-ε)-Approximation for the Monotone Submodular Multiple Knapsack Problem.",
                    "Linear Expected Complexity for Directional and Multiplicative Voronoi Diagrams.",
                    "Polynomial Time Approximation Schemes for Clustering in Low Highway Dimension Graphs.",
                    "Coresets for the Nearest-Neighbor Rule.",
                    "Kernelization of Whitney Switches.",
                    "Subexponential Parameterized Algorithms and Kernelization on Almost Chordal Graphs.",
                    "On the Complexity of Recovering Incidence Matrices.",
                    "An Algorithmic Meta-Theorem for Graph Modification to Planarity and FOL.",
                    "A Constant-Factor Approximation for Directed Latency in Quasi-Polynomial Time.",
                    "On Compact RAC Drawings.",
                    "Fast Preprocessing for Optimal Orthogonal Range Reporting and Range Successor with Applications to Text Indexing.",
                    "Dual Half-Integrality for Uncrossable Cut Cover and Its Application to Maximum Half-Integral Flow.",
                    "An Efficient, Practical Algorithm and Implementation for Computing Multiplicatively Weighted Voronoi Diagrams.",
                    "Fully-Dynamic Coresets.",
                    "Dynamic Matching Algorithms in Practice.",
                    "Finding All Global Minimum Cuts in Practice.",
                    "Approximate Turing Kernelization for Problems Parameterized by Treewidth.",
                    "The Fine-Grained Complexity of Median and Center String Problems Under Edit Distance.",
                    "Capacitated Sum-Of-Radii Clustering: An FPT Approximation.",
                    "Optimal Polynomial-Time Compression for Boolean Max CSP.",
                    "A Linear Fixed Parameter Tractable Algorithm for Connected Pathwidth.",
                    "Exploiting c-Closure in Kernelization Algorithms for Graph Problems.",
                    "Many Visits TSP Revisited.",
                    "Light Euclidean Spanners with Steiner Points.",
                    "Settling the Relationship Between Wilber's Bounds for Dynamic Optimality.",
                    "On the Computational Complexity of Linear Discrepancy.",
                    "Augmenting the Algebraic Connectivity of Graphs.",
                    "Chordless Cycle Packing Is Fixed-Parameter Tractable.",
                    "Incompressibility of H-Free Edge Modification Problems: Towards a Dichotomy.",
                    "Approximating k-Connected m-Dominating Sets.",
                    "Full Complexity Classification of the List Homomorphism Problem for Bounded-Treewidth Graphs.",
                    "Generalizing CGAL Periodic Delaunay Triangulations.",
                    "Engineering Fast Almost Optimal Algorithms for Bipartite Graph Matching.",
                    "Efficient Computation of 2-Covers of a String.",
                    "Improved Approximation Algorithm for Set Multicover with Non-Piercing Regions.",
                    "Improved Distance Sensitivity Oracles with Subcubic Preprocessing Time.",
                    "Fine-Grained Complexity of Regular Expression Pattern Matching and Membership.",
                    "Space-Efficient, Fast and Exact Routing in Time-Dependent Road Networks.",
                    "Improved Prophet Inequalities for Combinatorial Welfare Maximization with (Approximately) Subadditive Agents.",
                    "On the Approximation Ratio of the k-Opt and Lin-Kernighan Algorithm for Metric and Graph TSP."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th ESA 2019",
        "info": "Munich/Garching, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2019",
                "sub_name": "27th Annual European Symposium on Algorithms, ESA 2019, September 9-11, 2019, Munich/Garching, Germany.",
                "count": 84,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Constant-Factor FPT Approximation for Capacitated k-Median.",
                    "Fragile Complexity of Comparison-Based Algorithms.",
                    "Universal Reconfiguration of Facet-Connected Modular Robots by Pivots: The O(1) Musketeers.",
                    "Constructing Light Spanners Deterministically in Near-Linear Time.",
                    "Repetition Detection in a Dynamic String.",
                    "Longest Common Substring Made Fully Dynamic.",
                    "Bilu-Linial Stability, Certified Algorithms and the Independent Set Problem.",
                    "On the Complexity of Anchored Rectangle Packing.",
                    "Quantum Walk Sampling by Growing Seed Sets.",
                    "PUFFINN: Parameterless and Universally Fast FInding of Nearest Neighbors.",
                    "Online Multistage Subset Maximization Problems.",
                    "A Constant Approximation for Colorful k-Center.",
                    "Parametrized Complexity of Expansion Height.",
                    "UnLimited TRAnsfers for Multi-Modal Route Planning: An Efficient Solution.",
                    "Streaming and Massively Parallel Algorithms for Edge Coloring.",
                    "Quantum Algorithms for Classical Probability Distributions.",
                    "More Applications of the d-Neighbor Equivalence: Connectivity and Acyclicity Constraints.",
                    "Online Bin Covering with Limited Migration.",
                    "Computing k-Modal Embeddings of Planar Digraphs.",
                    "Cost Sharing over Combinatorial Domains: Complement-Free Cost Functions and Beyond.",
                    "Efficiently Generating Geometric Inhomogeneous and Hyperbolic Random Graphs.",
                    "Randomized Incremental Construction of Delaunay Triangulations of Nice Point Sets.",
                    "Fine-Grained Complexity of k-OPT in Bounded-Degree Graphs for Solving TSP.",
                    "Linear Transformations Between Colorings in Chordal Graphs.",
                    "Patching Colors with Tensors.",
                    "On Geometric Set Cover for Orthants.",
                    "Simpler and Better Algorithms for Minimum-Norm Load Balancing.",
                    "On Computing Centroids According to the p-Norms of Hamming Distance Vectors.",
                    "Non-Cooperative Rational Interactive Proofs.",
                    "Stronger ILPs for the Graph Genus Problem.",
                    "Complexity of Ck-Coloring in Hereditary Classes of Graphs.",
                    "Consistent Digital Curved Rays and Pseudoline Arrangements.",
                    "Efficient Approximation Schemes for Uniform-Cost Clustering Problems in Planar Graphs.",
                    "Improved Bounds for the Excluded-Minor Approximation of Treedepth.",
                    "Building a Nest by an Automaton.",
                    "Robustness of Randomized Rumour Spreading.",
                    "Structural Rounding: Approximation Algorithms for Graphs Near an Algorithmically Tractable Class.",
                    "Dense Peelable Random Uniform Hypergraphs.",
                    "Efficient Gauss Elimination for Near-Quadratic Matrices with One Short Random Block per Row, with Applications.",
                    "Greedy Strategy Works for k-Center Clustering with Outliers and Coreset Construction.",
                    "Bidirectional Text Compression in External Memory.",
                    "Bisection of Bounded Treewidth Graphs by Convolutions.",
                    "Oracle-Based Primal-Dual Algorithms for Packing and Covering Semidefinite Programs.",
                    "Online Disjoint Set Cover Without Prior Knowledge.",
                    "Bayesian Generalized Network Design.",
                    "Obviously Strategyproof Mechanisms for Machine Scheduling.",
                    "Going Far From Degeneracy.",
                    "Group Activity Selection with Few Agent Types.",
                    "Optimal Sorting with Persistent Comparison Errors.",
                    "Dynamic Dominators and Low-High Orders in DAGs.",
                    "On the Hardness and Inapproximability of Recognizing Wheeler Graphs.",
                    "Evaluation of a Flow-Based Hypergraph Bipartitioning Algorithm.",
                    "Parameterized Approximation Schemes for Independent Set of Rectangles and Geometric Knapsack.",
                    "Packing Cars into Narrow Roads: PTASs for Limited Supply Highway.",
                    "Engineering Negative Cycle Canceling for Wind Farm Cabling.",
                    "Towards Improving Christofides Algorithm for Half-Integer TSP.",
                    "Counting to Ten with Two Fingers: Compressed Counting with Spiking Neurons.",
                    "Triconnected Planar Graphs of Maximum Degree Five are Subhamiltonian.",
                    "Parallel Weighted Random Sampling.",
                    "External Memory Priority Queues with Decrease-Key and Applications to Graph Algorithms.",
                    "Shortest Reconfiguration of Perfect Matchings via Alternating Cycles.",
                    "Closing the Gap for Pseudo-Polynomial Strip Packing.",
                    "Odd-Cycle Separation for Maximum Cut and Binary Quadratic Optimization.",
                    "Triangles and Girth in Disk Graphs and Transmission Graphs.",
                    "Reliable Hubs for Partially-Dynamic All-Pairs Shortest Paths in Directed Graphs.",
                    "Min-Cost Flow in Unit-Capacity Planar Graphs.",
                    "Global Curve Simplification.",
                    "Trace Reconstruction: Generalized and Parameterized.",
                    "Generalized Assignment via Submodular Optimization with Reserved Capacity.",
                    "Resilient Dictionaries for Randomly Unreliable Memory.",
                    "Hermitian Laplacians and a Cheeger Inequality for the Max-2-Lin Problem.",
                    "Packing Directed Circuits Quarter-Integrally.",
                    "Equal-Subset-Sum Faster Than the Meet-in-the-Middle.",
                    "Hardness of Bichromatic Closest Pair with Jaccard Similarity.",
                    "Compact Oblivious Routing.",
                    "Geometric Crossing-Minimization - A Scalable Randomized Approach.",
                    "An Approximate Kernel for Connected Feedback Vertex Set.",
                    "Multicommodity Multicast, Wireless and Fast.",
                    "Recognizing Planar Laman Graphs.",
                    "Simultaneous Representation of Proper and Unit Interval Graphs.",
                    "Correlation Clustering with Same-Cluster Queries Bounded by Optimal Cost.",
                    "Graph Balancing with Orientation Costs.",
                    "FPT-Algorithms for Computing Gromov-Hausdorff and Interleaving Distances Between Trees."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th ESA 2018",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2018",
                "sub_name": "26th Annual European Symposium on Algorithms, ESA 2018, August 20-22, 2018, Helsinki, Finland.",
                "count": 74,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Algorithms for Inverse Optimization Problems.",
                    "Two-Dimensional Maximal Repetitions.",
                    "Approximate Convex Intersection Detection with Applications to Width and Minkowski Sums.",
                    "On the Worst-Case Complexity of TimSort.",
                    "A New and Improved Algorithm for Online Bin Packing.",
                    "Practical Access to Dynamic Programming on Tree Decompositions.",
                    "Average Whenever You Meet: Opportunistic Protocols for Community Detection.",
                    "Polynomial-Time Approximation Schemes for k-center, k-median, and Capacitated Vehicle Routing in Bounded Highway Dimension.",
                    "Fine-grained Lower Bounds on Cops and Robbers.",
                    "A Polynomial Kernel for Diamond-Free Editing.",
                    "Parallel and I/O-efficient Randomisation of Massive Networks using Global Curveball Trades.",
                    "Space-Optimal Quasi-Gray Codes with Logarithmic Read Complexity.",
                    "A Framework for In-place Graph Algorithms.",
                    "Self-Assembly of Any Shape with Constant Tile Types using High Temperature.",
                    "A Unified PTAS for Prize Collecting TSP and Steiner Tree Problem in Doubling Metrics.",
                    "Near-Optimal Distance Emulator for Planar Graphs.",
                    "Approximation Schemes for Geometric Coverage Problems.",
                    "Amortized Analysis of Asynchronous Price Dynamics.",
                    "Cycles to the Rescue! Novel Constraints to Compute Maximum Planar Subgraphs Fast.",
                    "Parameterized Approximation Algorithms for Bidirected Steiner Network Problems.",
                    "Online Facility Location with Deletions.",
                    "Improved Routing on the Delaunay Triangulation.",
                    "On Geometric Prototype and Applications.",
                    "Improved Bounds for Multipass Pairing Heaps and Path-Balanced Binary Search Trees.",
                    "Improved Time and Space Bounds for Dynamic Range Mode.",
                    "Online Makespan Scheduling with Job Migration on Uniform Machines.",
                    "Truthful Prompt Scheduling for Minimizing Sum of Completion Times.",
                    "Weighted Model Counting on the GPU by Exploiting Small Treewidth.",
                    "Light Spanners for High Dimensional Norms via Stochastic Decompositions.",
                    "On the Tractability of Optimization Problems on H-Graphs.",
                    "On the Optimality of Pseudo-polynomial Algorithms for Integer Programming.",
                    "Symmetry Exploitation for Online Machine Covering with Bounded Migration.",
                    "Edit Distance with Block Operations.",
                    "A QPTAS for Gapless MEC.",
                    "FPT Algorithms for Embedding into Low Complexity Graphic Metrics.",
                    "The Stochastic Score Classification Problem.",
                    "Improved Space-Time Tradeoffs for kSUM.",
                    "Dynamic Trees with Almost-Optimal Access Cost.",
                    "A Tree Structure For Dynamic Facility Location.",
                    "Dynamic Effective Resistances and Approximate Schur Complement on Separable Graphs.",
                    "Buffered Count-Min Sketch on SSD: Theory and Experiments.",
                    "Scalable Katz Ranking Computation in Large Static and Dynamic Graphs.",
                    "Round-Hashing for Data Storage: Distributed Servers and External-Memory Tables.",
                    "Algorithmic Building Blocks for Asymmetric Memories.",
                    "On the Decision Tree Complexity of String Matching.",
                    "Decremental SPQR-trees for Planar Graphs.",
                    "Computing the Chromatic Number Using Graph Decompositions via Matrix Rank.",
                    "Polynomial Kernels for Hitting Forbidden Minors under Structural Parameterizations.",
                    "Quantum Algorithms for Connectivity and Related Problems.",
                    "Generalized Coloring of Permutations.",
                    "Solving Partition Problems Almost Always Requires Pushing Many Vertices Around.",
                    "String Attractors: Verification and Optimization.",
                    "Data Reduction for Maximum Matching on Real-World Graphs: Theory and Experiments.",
                    "Searching a Tree with Permanently Noisy Advice.",
                    "Efficient and Adaptive Parameterized Algorithms on Modular Decompositions.",
                    "On Nondeterministic Derandomization of Freivalds' Algorithm: Consequences, Avenues and Algorithmic Progress.",
                    "Optimal Online Contention Resolution Schemes via Ex-Ante Prophet Inequalities.",
                    "Equilibrium Computation in Atomic Splittable Routing Games.",
                    "Online Non-Preemptive Scheduling to Minimize Weighted Flow-time on Unrelated Machines.",
                    "Finding Stable Matchings That Are Robust to Errors in the Input.",
                    "Disconnected Cuts in Claw-free Graphs.",
                    "Practical Low-Dimensional Halfspace Range Space Sampling.",
                    "Nearly-Optimal Mergesorts: Fast, Practical Sorting Methods That Optimally Adapt to Existing Runs.",
                    "On a Problem of Danzer.",
                    "Quasi-Polynomial Time Approximation Schemes for Packing and Covering Problems in Planar Graphs.",
                    "On Learning Linear Functions from Subset and Its Applications in Quantum Computing.",
                    "Strong Collapse for Persistence.",
                    "On the Complexity of the (Approximate) Nearest Colored Node Problem.",
                    "Planar Support for Non-piercing Regions and Applications.",
                    "An Exact Algorithm for the Steiner Forest Problem.",
                    "Large Low-Diameter Graphs are Good Expanders.",
                    "Improved Dynamic Graph Coloring.",
                    "Soft Subdivision Motion Planning for Complex Planar Robots."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th ESA 2017",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2017",
                "sub_name": "25th Annual European Symposium on Algorithms, ESA 2017, September 4-6, 2017, Vienna, Austria.",
                "count": 71,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Programm Commitees, External Reviewers.",
                    "Sketching for Geometric Problems (Invited Talk).",
                    "Permuting and Batched Geometric Lower Bounds in the I/O Model.",
                    "Independent Range Sampling, Revisited.",
                    "Approximate Nearest Neighbor Search Amid Higher-Dimensional Flats.",
                    "Output Sensitive Algorithms for Approximate Incidences and Their Applications.",
                    "Randomized Contractions for Multiobjective Minimum Cuts.",
                    "Tight Bounds for Online Coloring of Basic Graph Classes.",
                    "Combinatorics of Local Search: An Optimal 4-Local Hall's Theorem for Planar Graphs.",
                    "In-Place Parallel Super Scalar Samplesort (IPSSSSo).",
                    "Online Bin Packing with Cardinality Constraints Resolved.",
                    "Modeling and Engineering Constrained Shortest Path Algorithms for Battery Electric Vehicles.",
                    "A Quasi-Polynomial-Time Approximation Scheme for Vehicle Routing on Planar and Bounded-Genus Graphs.",
                    "The Directed Disjoint Shortest Paths Problem.",
                    "Triangle Packing in (Sparse) Tournaments: Approximation and Kernelization.",
                    "Improved Algorithm for Dynamic b-Matching.",
                    "Fast Dynamic Arrays.",
                    "On the Impact of Singleton Strategies in Congestion Games.",
                    "Tight Lower Bounds for the Complexity of Multicoloring.",
                    "Exploring the Tractability of the Capped Hose Model.",
                    "Sampling Geometric Inhomogeneous Random Graphs in Linear Time.",
                    "Cache Oblivious Algorithms for Computing the Triplet Distance Between Trees.",
                    "Online Algorithms for Maximum Cardinality Matching with Edge Arrivals.",
                    "Computing Optimal Homotopies over a Spiked Plane with Polygonal Boundary.",
                    "Online Submodular Maximization Problem with Vector Packing Constraint.",
                    "Faster Approximate Diameter and Distance Oracles in Planar Graphs.",
                    "Stability and Recovery for Independence Systems.",
                    "On the Complexity of Bounded Context Switching.",
                    "Improved Approximate Rips Filtrations with Shifted Integer Lattices.",
                    "The Sparse Awakens: Streaming Algorithms for Matching Size Estimation in Sparse Graphs.",
                    "Improving TSP Tours Using Dynamic Programming over Tree Decompositions.",
                    "On Minimizing the Makespan When Some Jobs Cannot Be Assigned on the Same Machine.",
                    "Optimal Stopping Rules for Sequential Hypothesis Testing.",
                    "The Online House Numbering Problem: Min-Max Online List Labeling.",
                    "Temporal Clustering.",
                    "Pricing Social Goods.",
                    "Half-Integral Linkages in Highly Connected Directed Graphs.",
                    "Bounds on the Satisfiability Threshold for Power Law Distributed Random SAT.",
                    "An Encoding for Order-Preserving Matching.",
                    "Distance-Preserving Subgraphs of Interval Graphs.",
                    "Dispersion on Trees.",
                    "Real-Time Streaming Multi-Pattern Search for Constant Alphabet.",
                    "Improved Bounds for 3SUM, k-SUM, and Linear Degeneracy.",
                    "Profit Sharing and Efficiency in Utility Games.",
                    "Improved Guarantees for Vertex Sparsification in Planar Graphs.",
                    "The Power of Vertex Sparsifiers in Dynamic Graph Algorithms.",
                    "Single-Sink Fractionally Subadditive Network Design.",
                    "Path-Contractions, Edge Deletions and Connectivity Preservation.",
                    "Dynamic Clustering to Minimize the Sum of Radii.",
                    "Shortest Paths in the Plane with Obstacle Violations.",
                    "Contracting a Planar Graph Efficiently.",
                    "Minimizing Maximum Flow Time on Related Machines via Dynamic Posted Pricing.",
                    "Finding Axis-Parallel Rectangles of Fixed Perimeter or Area Containing the Largest Number of Points.",
                    "LZ-End Parsing in Linear Time.",
                    "Combinatorial n-fold Integer Programming and Applications.",
                    "Local Search Algorithms for Maximum Carpool Matching.",
                    "Computing Maximum Agreement Forests without Cluster Partitioning is Folly.",
                    "A Linear-Time Parameterized Algorithm for Node Unique Label Cover.",
                    "Dynamic Space Efficient Hashing.",
                    "Subexponential Parameterized Algorithms for Graphs of Polynomial Growth.",
                    "Benchmark Graphs for Practical Graph Isomorphism.",
                    "On the Tree Augmentation Problem.",
                    "Prize-Collecting TSP with a Budget Constraint.",
                    "Counting Restricted Homomorphisms via Möbius Inversion over Matroid Lattices.",
                    "Clustering in Hypergraphs to Minimize Average Edge Service Time.",
                    "K-Dominance in Multidimensional Data: Theory and Applications.",
                    "New Abilities and Limitations of Spectral Graph Bisection.",
                    "A Space-Optimal Grammar Compression.",
                    "Positive-Instance Driven Dynamic Programming for Treewidth.",
                    "Exponential Lower Bounds for History-Based Simplex Pivot Rules on Abstract Cubes.",
                    "Maxent-Stress Optimization of 3D Biomolecular Models."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th ESA 2016",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2016",
                "sub_name": "24th Annual European Symposium on Algorithms, ESA 2016, August 22-24, 2016, Aarhus, Denmark.",
                "count": 79,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Programm Commitee, External Reviewers.",
                    "2-Connectivity in Directed Graphs.",
                    "Algorithms with Provable Guarantees for Clustering.",
                    "Beating Ratio 0.5 for Weighted Oblivious Matching Problems.",
                    "Outer Common Tangents and Nesting of Convex Hulls in Linear Time and Constant Workspace.",
                    "Sublinear Distance Labeling.",
                    "Probabilistic Routing for On-Street Parking Search.",
                    "Scalable Exact Visualization of Isocontours in Road Networks via Minimum-Link Paths.",
                    "Computing Equilibria in Markets with Budget-Additive Utilities.",
                    "On the Lattice Distortion Problem.",
                    "Plurality Consensus in Arbitrary Graphs: Lessons Learned from Load Balancing.",
                    "On the Hardness of Learning Sparse Parities.",
                    "Online Algorithms for Multi-Level Aggregation.",
                    "Compact and Fast Sensitivity Oracles for Single-Source Distances.",
                    "Efficient Algorithms with Asymmetric Read and Write Costs.",
                    "Hyperbolic Random Graphs: Separators and Treewidth.",
                    "Efficient Embedding of Scale-Free Graphs in the Hyperbolic Plane.",
                    "Fully Dynamic Spanners with Worst-Case Update Time.",
                    "Fixed-Parameter Approximability of Boolean MinCSPs.",
                    "Parameterized Hardness of Art Gallery Problems.",
                    "KADABRA is an ADaptive Algorithm for Betweenness via Random Approximation.",
                    "Separation of Cycle Inequalities for the Periodic Timetabling Problem.",
                    "Mapping Polygons to the Grid with Small Hausdorff and Fréchet Distance.",
                    "Hitting Set for Hypergraphs of Low VC-dimension.",
                    "New Algorithms, Better Bounds, and a Novel Model for Online Stochastic Matching.",
                    "Solving k-SUM Using Few Linear Queries.",
                    "Optimal Staged Self-Assembly of General Shapes.",
                    "Homotopy Measures for Representative Trajectories.",
                    "Optimal Reachability and a Space-Time Tradeoff for Distance Queries in Constant-Treewidth Graphs.",
                    "An ILP-based Proof System for the Crossing Number Problem.",
                    "Strategic Contention Resolution with Limited Feedback.",
                    "Cell-Probe Lower Bounds for Bit Stream Computation.",
                    "Stochastic Streams: Sample Complexity vs. Space Complexity.",
                    "Counting Matchings with k Unmatched Vertices in Planar Graphs.",
                    "On Interference Among Moving Sensors and Related Problems.",
                    "SimBa: An Efficient Tool for Approximating Rips-Filtration Persistence via Simplicial Batch-Collapse.",
                    "Exponential Time Paradigms Through the Polynomial Time Lens.",
                    "On the Power of Advice and Randomization for Online Bipartite Matching.",
                    "BlockQuicksort: Avoiding Branch Mispredictions in Quicksort.",
                    "Counting Linear Extensions: Parameterizations by Treewidth.",
                    "A Constant Approximation Algorithm for Scheduling Packets on Line Networks.",
                    "Distributed Signaling Games.",
                    "New Algorithms for Maximum Disjoint Paths Based on Tree-Likeness.",
                    "Streaming Property Testing of Visibly Pushdown Languages.",
                    "Streaming Pattern Matching with d Wildcards.",
                    "How Hard is it to Find (Honest) Witnesses?.",
                    "Incremental Exact Min-Cut in Poly-logarithmic Amortized Update Time.",
                    "Packing and Covering with Non-Piercing Regions.",
                    "Incremental and Fully Dynamic Subgraph Connectivity For Emergency Planning.",
                    "A Combinatorial Approximation Algorithm for Graph Balancing with Light Hyper Edges.",
                    "epsilon-Kernel Coresets for Stochastic Points.",
                    "Every Property Is Testable on a Natural Class of Scale-Free Multigraphs.",
                    "Explicit Correlation Amplifiers for Finding Outlier Correlations in Deterministic Subquadratic Time.",
                    "Faster Worst Case Deterministic Dynamic Connectivity.",
                    "Think Eternally: Improved Algorithms for the Temp Secretary Problem and Extensions.",
                    "Hardness of Bipartite Expansion.",
                    "A Streaming Algorithm for the Undirected Longest Path Problem.",
                    "A Note On Spectral Clustering.",
                    "On the Fine-Grained Complexity of Rainbow Coloring.",
                    "A Randomized Polynomial Kernelization for Vertex Cover with a Smaller Parameter.",
                    "The Strongly Stable Roommates Problem.",
                    "Faster External Memory LCP Array Construction.",
                    "Almost All Even Yao-Yao Graphs Are Spanners.",
                    "Online Non-Preemptive Scheduling in a Resource Augmentation Model Based on Duality.",
                    "Admissible Colourings of 3-Manifold Triangulations for Turaev-Viro Type Invariants.",
                    "The Computational Complexity of Genetic Diversity.",
                    "Approximation and Hardness of Token Swapping.",
                    "A 7/3-Approximation for Feedback Vertex Sets in Tournaments.",
                    "Scheduling Distributed Clusters of Parallel Machines: Primal-Dual and LP-based Approximation Algorithms.",
                    "Finding Large Set Covers Faster via the Representation Method.",
                    "Graph Isomorphism for Unit Square Graphs.",
                    "The Alternating Stock Size Problem and the Gasoline Puzzle.",
                    "New Parameterized Algorithms for APSP in Directed Graphs.",
                    "Online Budgeted Maximum Coverage.",
                    "Min-Sum Scheduling Under Precedence Constraints.",
                    "The Power of Migration for Online Slack Scheduling.",
                    "Sampling-Based Bottleneck Pathfinding with Applications to Fréchet Matching.",
                    "On the Geodesic Centers of Polygonal Domains.",
                    "The Complexity of the k-means Method."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd ESA 2015",
        "info": "Patras, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2015",
                "sub_name": "Algorithms - ESA 2015 - 23rd Annual European Symposium, Patras, Greece, September 14-16, 2015, Proceedings.",
                "count": 86,
                "papers": [
                    "Improved Approximation Algorithms for Stochastic Matching.",
                    "Sorting and Permuting without Bank Conflicts on GPUs.",
                    "Approximating Minimum-Area Rectangular and Convex Containers for Packing Convex Polygons.",
                    "Primal-Dual and Dual-Fitting Analysis of Online Scheduling Algorithms for Generalized Flow Time Problems.",
                    "Buffer Management for Packets with Processing Times.",
                    "A Triplet-Based Exact Method for the Shift Minimisation Personnel Task Scheduling Problem.",
                    "Exact Minkowski Sums of Polygons With Holes.",
                    "λ > 4.",
                    "Revenue Maximization for Selling Multiple Correlated Items.",
                    "Efficient Implementation of a Synchronous Parallel Push-Relabel Algorithm.",
                    "Towards Tight Lower Bounds for Scheduling Problems.",
                    "1-Planar Graphs have Constant Book Thickness.",
                    "Access, Rank, and Select in Grammar-compressed Strings.",
                    "Fully-Dynamic Approximation of Betweenness Centrality.",
                    "Improved Purely Additive Fault-Tolerant Spanners.",
                    "Subexponential Time Algorithms for Finding Small Tree and Path Decompositions.",
                    "Enumeration of 2-Level Polytopes.",
                    "Upper and Lower Bounds for Online Routing on Delaunay Triangulations.",
                    "On Computing the Hyperbolicity of Real-World Graphs.",
                    "Towards Single Face Shortest Vertex-Disjoint Paths in Undirected Planar Graphs.",
                    "Consensus Patterns (Probably) Has no EPTAS.",
                    "Fast Quasi-Threshold Editing.",
                    "Sublinear Estimation of Weighted Matchings in Dynamic Data Streams.",
                    "An Improved Approximation Algorithm for Knapsack Median Using Sparsification.",
                    "Output-Sensitive Algorithms for Enumerating the Extreme Nondominated Points of Multiobjective Combinatorial Optimization Problems.",
                    "Self-Adjusting Binary Search Trees: What Makes Them Tick?",
                    "On Element-Connectivity Preserving Graph Simplification.",
                    "On Randomized Algorithms for Matching in the Online Preemptive Model.",
                    "A Characterization of Consistent Digital Line Segments in ℤ2.",
                    "On the Efficiency of All-Pay Mechanisms.",
                    "Dictionary Matching in a Stream.",
                    "Multicuts in Planar and Bounded-Genus Graphs with Bounded Number of Terminals.",
                    "A Fixed Parameter Tractable Approximation Scheme for the Optimal Cut Graph of a Surface.",
                    "Explicit Expanding Expanders.",
                    "On the Threshold of Intractability.",
                    "A Polynomial Kernel for Trivially Perfect Editing.",
                    "Polymatroid Prophet Inequalities.",
                    "Node-Balancing by Edge-Increments.",
                    "The Price of Matching with Metric Preferences.",
                    "Selfish Vector Packing.",
                    "Approximate Deadline-Scheduling with Precedence Constraints.",
                    "Prophet Secretary.",
                    "Smoothed Analysis of the Squared Euclidean Maximum-Cut Problem.",
                    "Maximizing Symmetric Submodular Functions.",
                    "Approximating LZ77 via Small-Space Multiple-Pattern Matching.",
                    "Fast Algorithms for Parameterized Problems with Relaxed Disjointness Constraints.",
                    "Medial Axis Based Routing Has Constant Load Balancing Factor.",
                    "An Experimental Evaluation of the Best-of-Many Christofides' Algorithm for the Traveling Salesman Problem.",
                    "Approximating the Smallest Spanning Subgraph for 2-Edge-Connectivity in Directed Graphs.",
                    "A Probabilistic Approach to Reducing Algebraic Complexity of Delaunay Triangulations.",
                    "A Characterization of Visibility Graphs for Pseudo-polygons.",
                    "Faster and More Dynamic Maximum Flow by Incremental Breadth-First Search.",
                    "The Temp Secretary Problem.",
                    "How to Sort by Walking on a Tree.",
                    "Improved Analysis of Complete-Linkage Clustering.",
                    "Structural Parameterizations of the Mixed Chinese Postman Problem.",
                    "Online Appointment Scheduling in the Random Order Model.",
                    "Approximation Algorithms for Connected Maximum Cut and Related Problems.",
                    "The Offset Filtration of Convex Objects.",
                    "Approximation Algorithms for Polynomial-Expansion and Low-Density Graphs.",
                    "Monotone Drawings of 3-Connected Plane Graphs.",
                    "Faster Fully-Dynamic Minimum Spanning Forest.",
                    "On the Equivalence among Problems of Bounded Width.",
                    "Fast Output-Sensitive Matrix Multiplication.",
                    "A Structural Approach to Kernels for ILPs: Treewidth and Total Unimodularity.",
                    "On the Approximability of Digraph Ordering.",
                    "Welfare Maximization with Deferred Acceptance Auctions in Reallocation Problems.",
                    "On the Pathwidth of Almost Semicomplete Digraphs.",
                    "Quicksort, Largest Bucket, and Min-Wise Hashing with Limited Independence.",
                    "Maximum Matching in Turnstile Streams.",
                    "A Lasserre Lower Bound for the Min-Sum Single Machine Scheduling Problem.",
                    "Optimal Parameterized Algorithms for Planar Facility Location Problems Using Voronoi Diagrams.",
                    "Randomization Helps Computing a Minimum Spanning Tree under Uncertainty.",
                    "Compressed Data Structures for Dynamic Sequences.",
                    "Geometric Hitting Sets for Disks: Theory and Practice.",
                    "Efficient Computation of Middle Levels Gray Codes.",
                    "Computing the Similarity Between Moving Curves.",
                    "I/O-Efficient Similarity Join.",
                    "Improved Approximation Algorithms for Weighted 2-Path Partitions.",
                    "A Multivariate Approach for Weighted FPT Algorithms.",
                    "Incidences with Curves in ℝ d.",
                    "D3-Tree: A Dynamic Deterministic Decentralized Structure.",
                    "Ignorant vs. Anonymous Recommendations.",
                    "Lower Bounds in the Preprocessing and Query Phases of Routing Algorithms.",
                    "Trip-Based Public Transit Routing.",
                    "Mixing Color Coding-Related Techniques."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd ESA 2014",
        "info": "Wroclaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2014",
                "sub_name": "Algorithms - ESA 2014 - 22th Annual European Symposium, Wroclaw, Poland, September 8-10, 2014. Proceedings.",
                "count": 69,
                "papers": [
                    "Losing Weight by Gaining Edges.",
                    "Optimal Coordination Mechanisms for Multi-job Scheduling Games.",
                    "Theory and Practice of Chunked Sequences.",
                    "Convex Hulls under Uncertainty.",
                    "The Space-Stretch-Time Tradeoff in Distance Oracles.",
                    "Distribution-Sensitive Construction of the Greedy Spanner.",
                    "Recognizing Shrinkable Complexes Is NP-Complete.",
                    "Improved Approximation Algorithms for Box Contact Representations.",
                    "Minimum Partial-Matching and Hausdorff RMS-Distance under Translation: Combinatorics and Algorithms.",
                    "The Batched Predecessor Problem in External Memory.",
                    "Polynomial Decompositions in Polynomial Time.",
                    "Fault-Tolerant Approximate Shortest-Path Trees.",
                    "Fast Witness Extraction Using a Decision Oracle.",
                    "Complexity of Higher-Degree Orthogonal Graph Embedding in the Kandinsky Model.",
                    "A Subexponential Parameterized Algorithm for Proper Interval Completion.",
                    "Computing Persistent Homology with Various Coefficient Fields in a Single Pass.",
                    "De-anonymization of Heterogeneous Random Graphs in Quasilinear Time.",
                    "Competitive Algorithms for Restricted Caching and Matroid Caching.",
                    "Improved Algorithms for Resource Allocation under Varying Capacity.",
                    "Nearly Tight Approximability Results for Minimum Biclique Cover and Partition.",
                    "Succinct Indices for Path Minimum, with Applications to Path Reporting.",
                    "Online Bipartite Matching with Decomposable Weights.",
                    "A Faster Algorithm for Computing Straight Skeletons.",
                    "Optimal Time-Space Tradeoff for the 2D Convex-Hull Problem.",
                    "Cache-Oblivious Persistence.",
                    "Lightweight Approximate Selection.",
                    "Robust Distance Queries on Massive Networks.",
                    "A Dynamic Data Structure for MSO Properties in Graphs with Bounded Tree-Depth.",
                    "Large Independent Sets in Triangle-Free Planar Graphs.",
                    "GRASP. Extending Graph Separators for the Single-Source Shortest-Path Problem.",
                    "Switching Colouring of G(n, d/n) for Sampling up to Gibbs Uniqueness Threshold.",
                    "From Graph to Hypergraph Multiway Partition: Is the Single Threshold the Only Route?",
                    "Deterministic Stateless Centralized Local Algorithms for Bounded Degree Graphs.",
                    "Bicriteria Data Compression: Efficient and Usable.",
                    "Amortized Õ(|V|) -Delay Algorithm for Listing Chordless Cycles in Undirected Graphs.",
                    "LP Approaches to Improved Approximation for Clique Transversal in Perfect Graphs.",
                    "Representative Sets of Product Families.",
                    "Weighted Ancestors in Suffix Trees.",
                    "Improved Practical Matrix Sketching with Guarantees.",
                    "Computing Regions Decomposable into m Stars.",
                    "The Parameterized Complexity of Graph Cyclability.",
                    "Dimension Reduction via Colour Refinement.",
                    "How Experts Can Solve LPs Online.",
                    "Parameterized Complexity of the k-Arc Chinese Postman Problem.",
                    "Approximating the Maximum Overlap of Polygons under Translation.",
                    "Ordering without Forbidden Patterns.",
                    "Halving Balls in Deterministic Linear Time.",
                    "Turing Kernelization for Finding Long Paths and Cycles in Restricted Graph Classes.",
                    "Optimal Parallel Quantum Query Algorithms.",
                    "Sublinear Space Algorithms for the Longest Common Substring Problem.",
                    "Nested Set Union.",
                    "Improved Explicit Data Structures in the Bitprobe Model.",
                    "Deeper Local Search for Better Approximation on Maximum Internal Spanning Trees.",
                    "FPTAS for Counting Weighted Edge Covers.",
                    "Solving Multicut Faster Than 2 n.",
                    "Tight Bounds for Active Self-assembly Using an Insertion Primitive.",
                    "Trace Reconstruction Revisited.",
                    "PReaCH: A Fast Lightweight Reachability Index Using Pruning and Contraction Hierarchies.",
                    "Polynomial-Time Approximation Schemes for Circle Packing Problems.",
                    "Document Retrieval on Repetitive Collections.",
                    "An Improved Analysis of the Mömke-Svensson Algorithm for Graph-TSP on Subquartic Graphs.",
                    "The Input/Output Complexity of Sparse Matrix Multiplication.",
                    "Faster FPTASes for Counting and Random Generation of Knapsack Solutions.",
                    "Improved Guarantees for Tree Cut Sparsifiers.",
                    "Representative Families: A Unified Tradeoff-Based Approach.",
                    "A Branch and Price Procedure for the Container Premarshalling Problem.",
                    "Space-Efficient Randomized Algorithms for K-SUM.",
                    "Equivalence between Priority Queues and Sorting in External Memory.",
                    "Amortized Bounds for Dynamic Orthogonal Range Reporting."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st ESA 2013",
        "info": "Sophia Antipolis, France",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2013",
                "sub_name": "Algorithms - ESA 2013 - 21st Annual European Symposium, Sophia Antipolis, France, September 2-4, 2013. Proceedings.",
                "count": 69,
                "papers": [
                    "The Online Replacement Path Problem.",
                    "Flip Distance between Triangulations of a Simple Polygon is NP-Complete.",
                    "Empirical Evaluation of the Parallel Distribution Sweeping Framework on Multicore Architectures.",
                    "Computing the Greedy Spanner in Linear Space.",
                    "Friendship and Stable Matching.",
                    "An Optimal and Practical Cache-Oblivious Algorithm for Computing Multiresolution Rasters.",
                    "Logit Dynamics with Concurrent Updates for Local Interaction Games.",
                    "On Resilient Graph Spanners.",
                    "Maximizing Barrier Coverage Lifetime with Mobile Sensors.",
                    "Theory and Implementation of Online Multiselection Algorithms.",
                    "An Implementation of I/O-Efficient Dynamic Breadth-First Search Using Level-Aligned Hierarchical Clustering.",
                    "Versatile Succinct Representations of the Bidirectional Burrows-Wheeler Transform.",
                    "Tight Lower and Upper Bounds for the Complexity of Canonical Colour Refinement.",
                    "A Faster Computation of All the Best Swap Edges of a Shortest Paths Tree.",
                    "Parallel String Sample Sort.",
                    "Exclusive Graph Searching.",
                    "Largest Chordal and Interval Subgraphs Faster Than 2 n.",
                    "Revisiting the Problem of Searching on a Line.",
                    "On the Existence of 0/1 Polytopes with High Semidefinite Extension Complexity.",
                    "The Encoding Complexity of Two Dimensional Range Minimum Data Structures.",
                    "Computing the Fréchet Distance with a Retractable Leash.",
                    "Vertex Deletion for 3D Delaunay Triangulations.",
                    "Economic 3-Colored Subdivision of Triangulations.",
                    "Limitations of Deterministic Auction Design for Correlated Bidders.",
                    "Connectivity Inference in Mass Spectrometry Based Structure Determination.",
                    "Secluded Connectivity Problems.",
                    "List H-Coloring a Graph by Removing Few Vertices.",
                    "Rumor Spreading in Random Evolving Graphs.",
                    "Dynamic Graphs in the Sliding-Window Model.",
                    "A Quantization Framework for Smoothed Analysis of Euclidean Optimization Problems.",
                    "Tight Kernel Bounds for Problems on Graphs with Small Degeneracy - (Extended Abstract).",
                    "Labeling Moving Points with a Trade-Off between Label Speed and Label Overlap.",
                    "Inefficiency of Standard Multi-unit Auctions.",
                    "FPTAS for Minimizing Earth Mover's Distance under Rigid Transformations.",
                    "Maximizing a Submodular Function with Viability Constraints.",
                    "Table Cartograms.",
                    "Network Bargaining with General Capacities.",
                    "Nearly Optimal Private Convolution.",
                    "Tractable Parameterizations for the Minimum Linear Arrangement Problem.",
                    "Compressed Cache-Oblivious String B-tree.",
                    "BICO: BIRCH Meets Coresets for k-Means Clustering.",
                    "Long Circuits and Large Euler Subgraphs.",
                    "Subexponential Parameterized Algorithm for Computing the Cutwidth of a Semi-complete Digraph.",
                    "Binary Jumbled Pattern Matching on Trees and Tree-Like Structures.",
                    "Kernelization Using Structural Parameters on Sparse Graph Classes.",
                    "On the Computational Complexity of Erdős-Szekeres and Related Problems in ℝ3.",
                    "Encodings for Range Selection and Top-k Queries.",
                    "Fréchet Queries in Geometric Trees.",
                    "A Computationally Efficient FPTAS for Convex Stochastic Dynamic Programs.",
                    "An Optimal Online Algorithm for Weighted Bipartite Matching and Extensions to Combinatorial Auctions.",
                    "Balls into Bins Made Faster.",
                    "An Alternative Approach to Alternative Routes: HiDAR.",
                    "Efficient Indexes for Jumbled Pattern Matching with Constant-Sized Alphabet.",
                    "Better Approximation Algorithms for Technology Diffusion.",
                    "On Polynomial Kernels for Integer Linear Programs: Covering, Packing and Feasibility.",
                    "Balanced Neighbor Selection for BitTorrent-Like Networks.",
                    "Parameterized Complexity of Directed Steiner Tree on Sparse Graphs.",
                    "Improved Approximation Algorithms for Projection Games - (Extended Abstract).",
                    "The Compressed Annotation Matrix: An Efficient Data Structure for Computing Persistent Cohomology.",
                    "Approximation Algorithms for Facility Location with Capacitated and Length-Bounded Tree Connections.",
                    "The Recognition of Simple-Triangle Graphs and of Linear-Interval Orders Is Polynomial.",
                    "Z-Skip-Links for Fast Traversal of ZDDs Representing Large-Scale Sparse Datasets.",
                    "Optimal Color Range Reporting in One Dimension.",
                    "Lagrangian Duality in Online Scheduling with Resource Augmentation and Speed Scaling.",
                    "Euclidean Greedy Drawings of Trees.",
                    "Sparse Fault-Tolerant BFS Trees.",
                    "On the Most Likely Convex Hull of Uncertain Points.",
                    "Top-k Document Retrieval in External Memory.",
                    "Shell: A Spatial Decomposition Data Structure for 3D Curve Traversal on Many-Core Architectures."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th ESA 2012",
        "info": "Ljubljana, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2012",
                "sub_name": "Algorithms - ESA 2012 - 20th Annual European Symposium, Ljubljana, Slovenia, September 10-12, 2012. Proceedings.",
                "count": 71,
                "papers": [
                    "On Big Data Algorithmics.",
                    "Open Problems in Throughput Scheduling.",
                    "Preemptive Coordination Mechanisms for Unrelated Machines.",
                    "Hierarchical Hub Labelings for Shortest Paths.",
                    "Bottleneck Non-crossing Matching in the Plane.",
                    "Lower Bounds for Sorted Geometric Queries in the I/O Model.",
                    "Constructing Street Networks from GPS Trajectories.",
                    "I/O-efficient Hierarchical Diameter Approximation.",
                    "On the Value of Job Migration in Online Makespan Minimization.",
                    "Simplifying Massive Contour Maps.",
                    "Explicit and Efficient Hash Families Suffice for Cuckoo Hashing with a Stash.",
                    "On Online Labeling with Polynomially Many Labels.",
                    "A 5-Approximation for Capacitated Facility Location.",
                    "Weighted Geometric Set Multi-cover via Quasi-uniform Sampling.",
                    "A Bicriteria Approximation for the Reordering Buffer Problem.",
                    "Time-Dependent Route Planning with Generalized Objective Functions.",
                    "New Lower and Upper Bounds for Representing Sequences.",
                    "Span Programs and Quantum Algorithms for st-Connectivity and Claw Detection.",
                    "The Stretch Factor of L 1- and L ∞ -Delaunay Triangulations.",
                    "Two Dimensional Range Minimum Queries and Fibonacci Lattices.",
                    "Locally Correct Fréchet Matchings.",
                    "The Clique Problem in Ray Intersection Graphs.",
                    "Revenue Guarantees in Sponsored Search Auctions.",
                    "Optimizing Social Welfare for Network Bargaining Games in the Face of Unstability, Greed and Spite.",
                    "Optimal Lower Bound for Differentially Private Multi-party Aggregation.",
                    "A Model for Minimizing Active Processor Time.",
                    "Polynomial-Time Algorithms for Energy Games with Special Weight Structures.",
                    "Data Structures on Event Graphs.",
                    "Improved Distance Oracles and Spanners for Vertex-Labeled Graphs.",
                    "The Quantum Query Complexity of Read-Many Formulas.",
                    "A Path-Decomposition Theorem with Applications to Pricing and Covering on Trees.",
                    "Steiner Forest Orientation Problems.",
                    "A Dual-Fitting $\\frac{3}{2}$ -Approximation Algorithm for Some Minimum-Cost Graph Problems.",
                    "Kinetic Compressed Quadtrees in the Black-Box Model with Applications to Collision Detection for Low-Density Scenes.",
                    "Finding Social Optima in Congestion Games with Positive Externalities.",
                    "Better Bounds for Graph Bisection.",
                    "On the Complexity of Metric Dimension.",
                    "Embedding Paths into Trees: VM Placement to Minimize Congestion.",
                    "Faster Geometric Algorithms via Dynamic Determinant Computation.",
                    "Lines through Segments in 3D Space.",
                    "A Polynomial Kernel for Proper Interval Vertex Deletion.",
                    "Knowledge, Level of Symmetry, and Time of Leader Election.",
                    "An Experimental Study of Dynamic Dominators.",
                    "Optimizing over the Growing Spectrahedron.",
                    "Induced Disjoint Paths in Claw-Free Graphs.",
                    "On Min-Power Steiner Tree.",
                    "Maximum Multicommodity Flows over Time without Intermediate Storage.",
                    "Approximating Earliest Arrival Flows in Arbitrary Networks.",
                    "Resource Buying Games.",
                    "Succinct Data Structures for Path Queries.",
                    "Approximation of Minimum Cost Homomorphisms.",
                    "Property Testing in Sparse Directed Graphs: Strong Connectivity and Subgraph-Freeness.",
                    "Improved Implementation of Point Location in General Two-Dimensional Subdivisions.",
                    "Parameterized Complexity of Induced H-Matching on Claw-Free Graphs.",
                    "Solving Simple Stochastic Games with Few Coin Toss Positions.",
                    "Efficient Communication Protocols for Deciding Edit Distance.",
                    "Approximation Algorithms for Wireless Link Scheduling with Flexible Data Rates.",
                    "Extending Partial Representations of Function Graphs and Permutation Graphs.",
                    "A Fast and Simple Subexponential Fixed Parameter Algorithm for One-Sided Crossing Minimization.",
                    "Minimum Average Distance Triangulations.",
                    "Colouring AT-Free Graphs.",
                    "Routing Regardless of Network Stability.",
                    "The Simplex Tree: An Efficient Data Structure for General Simplicial Complexes.",
                    "Succinct Posets.",
                    "Polynomial-Time Approximation Schemes for Shortest Path with Alternatives.",
                    "On Computing Straight Skeletons by Means of Kinetic Triangulations.",
                    "A Self-adjusting Data Structure for Multidimensional Point Sets.",
                    "TSP Tours in Cubic Graphs: Beyond 4/3.",
                    "FPT Algorithms for Domination in Biclique-Free Graphs.",
                    "Maximum Flow Networks for Stability Analysis of LEGO®Structures.",
                    "Average Case Analysis of Java 7's Dual Pivot Quicksort."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th ESA 2011",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2011",
                "sub_name": "Algorithms - ESA 2011 - 19th Annual European Symposium, Saarbrücken, Germany, September 5-9, 2011. Proceedings.",
                "count": 67,
                "papers": [
                    "Polynomial-Time Approximation Schemes for Maximizing Gross Substitutes Utility under Budget Constraints.",
                    "Approximating the Smallest 2-Vertex Connected Spanning Subgraph of a Directed Graph.",
                    "Improved Approximation Algorithms for Bipartite Correlation Clustering.",
                    "Bounds on Greedy Algorithms for MAX SAT.",
                    "Approximating Minimum Manhattan Networks in Higher Dimensions.",
                    "On Isolating Points Using Disks.",
                    "An Output-Sensitive Approach for the L 1/L ∞ k-Nearest-Neighbor Voronoi Diagram.",
                    "Can Nearest Neighbor Searching Be Simple and Always Fast?",
                    "On the Approximation Performance of Fictitious Play in Finite Games.",
                    "How Profitable Are Strategic Behaviors in a Market?",
                    "Improving the Price of Anarchy for Selfish Routing via Coordination Mechanisms.",
                    "Algorithms for Finding a Maximum Non-k-linked Graph.",
                    "An $\\mathcal{O}(n^4)$ Time Algorithm to Compute the Bisection Width of Solid Grid Graphs.",
                    "Min-Cuts and Shortest Cycles in Planar Graphs in O(n loglogn) Time.",
                    "Near-Popular Matchings in the Roommates Problem.",
                    "The Hospitals/Residents Problem with Quota Lower Bounds.",
                    "Multi-parameter Mechanism Design under Budget and Matroid Constraints.",
                    "Quantified Linear Programs: A Computational Study.",
                    "Recoverable Robustness by Column Generation.",
                    "Passenger Flow-Oriented Train Disposition.",
                    "One to Rule Them All: A General Randomized Algorithm for Buffer Management with Bounded Delay.",
                    "Better Bounds for Incremental Frequency Allocation in Bipartite Graphs.",
                    "Two-Bounded-Space Bin Packing Revisited.",
                    "Output-Sensitive Listing of Bounded-Size Trees in Undirected Graphs.",
                    "Exact Algorithm for the Maximum Induced Planar Subgraph Problem.",
                    "Scheduling Partially Ordered Jobs Faster Than 2 n.",
                    "AdCell: Ad Allocation in Cellular Networks.",
                    "Submodular Max-SAT.",
                    "On Variants of the Matroid Secretary Problem.",
                    "Hitting Sets Online and Vertex Ranking.",
                    "Fast Sub-exponential Algorithms and Compactness in Planar Graphs.",
                    "Isomorphism of (mis)Labeled Graphs.",
                    "Paths, Flowers and Vertex Cover.",
                    "Hitting and Harvesting Pumpkins.",
                    "Deterministic Discrepancy Minimization.",
                    "Pattern Matching in Lempel-Ziv Compressed Strings: Fast, Simple, and Deterministic.",
                    "An Experimental Study on Approximating K Shortest Simple Paths.",
                    "Scope-Based Route Planning.",
                    "Maximum Flows by Incremental Breadth-First Search.",
                    "Engineering Multilevel Graph Partitioning Algorithms.",
                    "A Nearly Optimal Algorithm for Finding L 1 Shortest Paths among Polygonal Obstacles in the Plane.",
                    "Motion Planning via Manifold Samples.",
                    "Ray-Shooting Depth: Computing Statistical Data Depth of Point Sets in the Plane.",
                    "Improved Algorithms for Partial Curve Matching.",
                    "On the Configuration-LP for Scheduling on Unrelated Machines.",
                    "Resource Allocation for Covering Time Varying Demands.",
                    "Mixed-Criticality Scheduling of Sporadic Task Systems.",
                    "Robust Algorithms for Preemptive Scheduling.",
                    "Approximate Distance Queries for Weighted Polyhedral Surfaces.",
                    "The Union of Probabilistic Boxes: Maintaining the Volume.",
                    "Preprocess, Set, Query!",
                    "Cuckoo Hashing with Pages.",
                    "Approximation Algorithms and Hardness Results for the Joint Replenishment Problem with Constant Demands.",
                    "Approximation Algorithms for Conflict-Free Vehicle Routing.",
                    "A $\\frac{3}{2}$ Approximation for a Constrained Forest Problem.",
                    "External-Memory Network Analysis Algorithms for Naturally Sparse Graphs.",
                    "Approximate Counting of Cycles in Streams.",
                    "Algorithms for Solving Rubik's Cubes.",
                    "Boundary Patrolling by Mobile Agents with Distinct Maximal Speeds.",
                    "Optimal Discovery Strategies in White Space Networks.",
                    "Social-Aware Forwarding Improves Routing Performance in Pocket Switched Networks.",
                    "Tolerant Algorithms.",
                    "Alphabet-Independent Compressed Text Indexing.",
                    "Distribution-Aware Compressed Full-Text Indexes.",
                    "Smoothed Performance Guarantees for Local Search.",
                    "Improved Approximations for k-Exchange Systems - (Extended Abstract).",
                    "Cover-Decomposition and Polychromatic Numbers."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th ESA 2010",
        "info": "Liverpool, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2010-1",
                "sub_name": "Algorithms - ESA 2010, 18th Annual European Symposium, Liverpool, UK, September 6-8, 2010. Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "The Robustness of Level Sets.",
                    "Solving an Avionics Real-Time Scheduling Problem by Advanced IP-Methods.",
                    "Non-clairvoyant Speed Scaling for Weighted Flow Time.",
                    "A Robust PTAS for Machine Covering and Packing.",
                    "Balancing Degree, Diameter and Weight in Euclidean Spanners.",
                    "Testing Euclidean Spanners.",
                    "Fast Approximation in Subspaces by Doubling Metric Decomposition.",
                    "f-Sensitivity Distance Oracles and Routing Schemes.",
                    "Fast Minor Testing in Planar Graphs.",
                    "On the Number of Spanning Trees a Planar Graph Can Have.",
                    "Contractions of Planar Graphs in Polynomial Time.",
                    "Communication Complexity of Quasirandom Rumor Spreading.",
                    "A Complete Characterization of Group-Strategyproof Mechanisms of Cost-Sharing.",
                    "Contribution Games in Social Networks.",
                    "Improved Bounds for Online Stochastic Matching.",
                    "Online Stochastic Packing Applied to Display Ad Allocation.",
                    "Caching Is Hard - Even in the Fault Model.",
                    "Superselectors: Efficient Constructions and Applications.",
                    "Estimating the Average of a Lipschitz-Continuous Function from One Sample.",
                    "Streaming Graph Computations with a Helpful Advisor.",
                    "Algorithms for Dominating Set in Disk Graphs: Breaking the logn Barrier - (Extended Abstract).",
                    "Minimum Vertex Cover in Rectangle Graphs.",
                    "Feedback Vertex Sets in Tournaments.",
                    "n-Level Graph Partitioning.",
                    "Fast Routing in Very Large Public Transportation Networks Using Transfer Patterns.",
                    "Finding the Diameter in Real-World Graphs - Experimentally Turning a Lower Bound into an Upper Bound.",
                    "Budgeted Red-Blue Median and Its Generalizations.",
                    "All Ternary Permutation Constraint Satisfaction Problems Parameterized above Average Have Kernels with Quadratic Numbers of Variables.",
                    "Strong Formulations for the Multi-module PESP and a Quadratic Algorithm for Graphical Diophantine Equation Systems.",
                    "Robust Algorithms for Sorting Railway Cars.",
                    "Cloning Voronoi Diagrams via Retroactive Data Structures.",
                    "A Unified Approach to Approximate Proximity Searching.",
                    "Spatio-temporal Range Searching over Compressed Kinetic Sensor Data.",
                    "Constructing the Exact Voronoi Diagram of Arbitrary Lines in Three-Dimensional Space - with Fast Point-Location.",
                    "Local Graph Exploration and Fast Property Testing.",
                    "A Fully Compressed Algorithm for Computing the Edit Distance of Run-Length Encoded Strings.",
                    "Fast Prefix Search in Little Space, with Applications.",
                    "On the Huffman and Alphabetic Tree Problem with General Cost Functions.",
                    "Medium-Space Algorithms for Inverse BWT.",
                    "Median Trajectories.",
                    "Optimal Cover of Points by Disks in a Simple Polygon.",
                    "Stability of epsilon-Kernels.",
                    "The Geodesic Diameter of Polygonal Domains.",
                    "Polyhedral and Algorithmic Properties of Quantified Linear Programs.",
                    "Approximating Parameterized Convex Optimization Problems.",
                    "Approximation Schemes for Multi-Budgeted Independence Systems.",
                    "Algorithmic Meta-theorems for Restrictions of Treewidth.",
                    "Determining Edge Expansion and Other Connectivity Measures of Graphs of Bounded Genus.",
                    "Constructing the R* Consensus Tree of Two Trees in Subcubic Time."
                ]
            },
            {
                "sub_name_abbr": "conf/esa/2010-2",
                "sub_name": "Algorithms - ESA 2010, 18th Annual European Symposium, Liverpool, UK, September 6-8, 2010. Proceedings, Part II.",
                "count": 20,
                "papers": [
                    "Data Structures: Time, I/Os, Entropy, Joules!",
                    "Weighted Congestion Games: Price of Anarchy, Universal Worst-Case Examples, and Tightness.",
                    "Computing Pure Nash and Strong Equilibria in Bottleneck Congestion Games.",
                    "Combinatorial Auctions with Verification Are Tractable.",
                    "How to Allocate Goods in an Online Market?",
                    "Fréchet Distance of Surfaces: Some Simple Hard Cases.",
                    "Geometric Algorithms for Private-Cache Chip Multiprocessors - (Extended Abstract).",
                    "Volume in General Metric Spaces.",
                    "Shortest Cut Graph of a Surface with Prescribed Vertex Set.",
                    "Induced Matchings in Subcubic Planar Graphs.",
                    "Robust Matchings and Matroid Intersections.",
                    "A 25/17-Approximation Algorithm for the Stable Marriage Problem with One-Sided Ties.",
                    "Strongly Stable Assignment.",
                    "Data Structures for Storing Small Sets in the Bitprobe Model.",
                    "On Space Efficient Two Dimensional Range Minimum Data Structures.",
                    "Pairing Heaps with Costless Meld.",
                    "Top-k Ranked Document Search in General Text Databases.",
                    "Shortest Paths in Planar Graphs with Real Lengths in O(nlog2n/loglogn) Time.",
                    "When LP Is the Cure for Your Matching Woes: Improved Bounds for Stochastic Matchings - (Extended Abstract).",
                    "Feasibility Analysis of Sporadic Real-Time Multiprocessor Task Systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th ESA 2009",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2009",
                "sub_name": "Algorithms - ESA 2009, 17th Annual European Symposium, Copenhagen, Denmark, September 7-9, 2009. Proceedings.",
                "count": 69,
                "papers": [
                    "Some Open Questions Related to Cuckoo Hashing.",
                    "Efficient Computation of the Characteristic Polynomial of a Tree and Related Tasks.",
                    "Improved Approximation Algorithms for Label Cover Problems.",
                    "A Linear Time Algorithm for L(2, 1)-Labeling of Trees.",
                    "On Inducing Polygons and Related Problems.",
                    "Computing 3D Periodic Triangulations.",
                    "Cauchy's Theorem for Orthogonal Polyhedra of Genus 0.",
                    "Approximability of Sparse Integer Programs.",
                    "Iterative Rounding for Multi-Objective Optimization Problems.",
                    "A Global-Optimization Algorithm for Mixed-Integer Nonlinear Programs Having Separable Non-convexity.",
                    "Constructing Delaunay Triangulations along Space-Filling Curves.",
                    "Piercing Translates and Homothets of a Convex Body.",
                    "Output-Sensitive Algorithms for Enumerating Minimal Transversals for Some Geometric Hypergraphs.",
                    "On Revenue Maximization in Second-Price Ad Auctions.",
                    "Clustering-Based Bidding Languages for Sponsored Search.",
                    "Altruism in Atomic Congestion Games.",
                    "Geometric Spanners for Weighted Point Sets.",
                    "k-Outerplanar Graphs, Planar Duality, and Low Stretch Spanning Trees.",
                    "Narrow-Shallow-Low-Light Trees with and without Steiner Points.",
                    "Bounded Budget Betweenness Centrality Game for Strategic Network Formations.",
                    "Exact and Approximate Equilibria for Optimal Group Network Formation.",
                    "On the Performance of Approximate Equilibria in Congestion Games.",
                    "Optimality and Competitiveness of Exploring Polygons by Mobile Robots.",
                    "Tractable Cases of Facility Location on a Network with a Linear Reliability Order of Links.",
                    "Dynamic vs. Oblivious Routing in Network Design.",
                    "Algorithms Meet Art, Puzzles, and Magic.",
                    "Polynomial-Time Algorithm for the Leafage of Chordal Graphs.",
                    "Breaking the O(m2n) Barrier for Minimum Cycle Bases.",
                    "Shape Fitting on Point Sets with Probability Distributions.",
                    "An Efficient Algorithm for Haplotype Inference on Pedigrees with a Small Number of Recombinants (Extended Abstract).",
                    "Complete Parsimony Haplotype Inference Problem and Algorithms.",
                    "Linear-Time Recognition of Probe Interval Graphs.",
                    "Wireless Scheduling with Power Control.",
                    "On the Power of Uniform Power: Capacity of Wireless Networks with Bounded Resources.",
                    "Approximability of OFDMA Scheduling.",
                    "Maximum Flow in Directed Planar Graphs with Vertex Capacities.",
                    "A Fast Output-Sensitive Algorithm for Boolean Matrix Multiplication.",
                    "On Optimally Partitioning a Text to Improve Its Compression.",
                    "An Average-Case Analysis for Rate-Monotonic Multiprocessor Real-Time Scheduling.",
                    "Minimizing Maximum Response Time and Delay Factor in Broadcast Scheduling.",
                    "Preemptive Online Scheduling with Reordering.",
                    "d-Dimensional Knapsack in the Streaming Model.",
                    "Sparse Cut Projections in Graph Streams.",
                    "Bipartite Graph Matchings in the Semi-streaming Model.",
                    "The Oil Searching Problem.",
                    "Hyperbolic Dovetailing.",
                    "On the Expansion and Diameter of Bluetooth-Like Topologies.",
                    "Minimum Makespan Multi-vehicle Dial-a-Ride.",
                    "Google's Auction for TV Ads.",
                    "Inclusion/Exclusion Meets Measure and Conquer.",
                    "Dynamic Programming on Tree Decompositions Using Generalised Fast Subset Convolution.",
                    "Counting Paths and Packings in Halves.",
                    "Accelerating Multi-modal Route Planning by Access-Nodes.",
                    "Parallel Algorithms for Mean-Payoff Games: An Experimental Evaluation.",
                    "Experimental Study of FPT Algorithms for the Directed Feedback Vertex Set Problem.",
                    "Fast Evaluation of Interlace Polynomials on Graphs of Bounded Treewidth.",
                    "Kernel Bounds for Disjoint Cycles and Disjoint Paths.",
                    "Constant Ratio Fixed-Parameter Approximation of the Edge Multicut Problem.",
                    "Rank-Pairing Heaps.",
                    "3.5-Way Cuckoo Hashing for the Price of 2-and-a-Bit.",
                    "Hash, Displace, and Compress.",
                    "Solving Dominating Set in Larger Classes of Graphs: FPT Algorithms and Polynomial Kernels.",
                    "Contraction Bidimensionality: The Accurate Picture.",
                    "Minimizing Movement: Fixed-Parameter Tractability.",
                    "Storing a Compressed Function with Constant Time Access.",
                    "Experimental Variations of a Theoretically Good Retrieval Data Structure.",
                    "Short Labels for Lowest Common Ancestors in Trees.",
                    "Disproof of the Neighborhood Conjecture with Implications to SAT.",
                    "Reconstructing 3-Colored Grids from Horizontal and Vertical Projections Is NP-hard."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th ESA 2008",
        "info": "Karlsruhe, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2008",
                "sub_name": "Algorithms - ESA 2008, 16th Annual European Symposium, Karlsruhe, Germany, September 15-17, 2008. Proceedings.",
                "count": 69,
                "papers": [
                    "Flexible Path Planning Using Corridor Maps.",
                    "A Bridging Model for Multi-core Computing.",
                    "Robust Kinetic Convex Hulls in 3D.",
                    "On Dominance Reporting in 3D.",
                    "Stabbing Convex Polygons with a Segment or a Polygon.",
                    "An Efficient Algorithm for 2D Euclidean 2-Center with Outliers.",
                    "A Near-Tight Bound for the Online Steiner Tree Problem in Graphs of Bounded Asymmetry.",
                    "Cache-Oblivious Red-Blue Line Segment Intersection.",
                    "The Complexity of Bisectors and Voronoi Diagrams on Realistic Terrains.",
                    "Space-Time Tradeoffs for Proximity Searching in Doubling Spaces.",
                    "A Scaling Algorithm for the Maximum Node-Capacitated Multiflow Problem.",
                    "Linear Time Planarity Testing and Embedding of Strongly Connected Cyclic Level Graphs.",
                    "Straight Skeletons of Three-Dimensional Polyhedra.",
                    "Randomized Competitive Analysis for Two-Server Problems.",
                    "Decompositions and Boundary Coverings of Non-convex Fat Polyhedra.",
                    "Approximating Multi-criteria Max-TSP.",
                    "An Integer Programming Algorithm for Routing Optimization in IP Networks.",
                    "A Constant-Approximate Feasibility Test for Multiprocessor Real-Time Scheduling.",
                    "Tight Bounds and a Fast FPT Algorithm for Directed Max-Leaf Spanning Tree.",
                    "Engineering Tree Labeling Schemes: A Case Study on Least Common Ancestors.",
                    "A Practical Quicksort Algorithm for Graphics Processors.",
                    "Bloomier Filters: A Second Look.",
                    "Coupled Path Planning, Region Optimization, and Applications in Intensity-Modulated Radiation Therapy.",
                    "A New Approach to Exact Crossing Minimization.",
                    "A Characterization of 2-Player Mechanisms for Scheduling.",
                    "A Local-Search 2-Approximation for 2-Correlation-Clustering.",
                    "The Alcuin Number of a Graph.",
                    "Time-Dependent SHARC-Routing.",
                    "Detecting Regular Visit Patterns.",
                    "Improved Approximation Algorithms for Relay Placement.",
                    "Selfish Bin Packing.",
                    "Improved Randomized Results for That Interval Selection Problem.",
                    "Succinct Representations of Arbitrary Graphs.",
                    "Edge Coloring and Decompositions of Weighted Graphs.",
                    "The Complexity of Sorting with Networks of Stacks and Queues.",
                    "Faster Steiner Tree Computation in Polynomial-Space.",
                    "Fitting a Step Function to a Point Set.",
                    "Faster Swap Edge Computation in Minimum Diameter Spanning Trees.",
                    "The Partial Augment-Relabel Algorithm for the Maximum Flow Problem.",
                    "An Optimal Dynamic Spanner for Doubling Metric Spaces.",
                    "RFQ: Redemptive Fair Queuing.",
                    "Range Medians.",
                    "Locality and Bounding-Box Quality of Two-Dimensional Space-Filling Curves.",
                    "Probabilistic Analysis of Online Bin Coloring Algorithms Via Stochastic Comparison.",
                    "On the Complexity of Optimal Hotlink Assignment.",
                    "Oblivious Randomized Direct Search for Real-Parameter Optimization.",
                    "Path Minima in Incremental Unrooted Trees.",
                    "Improved Competitive Performance Bounds for CIOQ Switches.",
                    "Two-Stage Robust Network Design with Exponential Scenarios.",
                    "An Optimal Incremental Algorithm for Minimizing Lateness with Rejection.",
                    "More Robust Hashing: Cuckoo Hashing with a Stash.",
                    "Better and Simpler Approximation Algorithms for the Stable Marriage Problem.",
                    "Edit Distances and Factorisations of Even Permutations.",
                    "Speed Scaling Functions for Flow Time Scheduling Based on Active Job Count.",
                    "Facility Location in Dynamic Geometric Data Streams.",
                    "The Effects of Local Randomness in the Adversarial Queueing Model.",
                    "Parallel Imaging Problem.",
                    "An Online Algorithm for Finding the Longest Previous Factors.",
                    "Collusion-Resistant Mechanisms with Verification Yielding Optimal Solutions.",
                    "Improved BDD Algorithms for the Simulation of Quantum Circuits.",
                    "Mobile Route Planning.",
                    "How Reliable Are Practical Point-in-Polygon Strategies?",
                    "Fast Divide-and-Conquer Algorithms for Preemptive Scheduling Problems with Controllable Processing Times - A Polymatroid Optimization Approach.",
                    "Approximability of Average Completion Time Scheduling on Unrelated Machines.",
                    "Relative Convex Hulls in Semi-dynamic Subdivisions.",
                    "An Experimental Analysis of Robinson-Foulds Distance Matrix Algorithms.",
                    "On the Size of the 3D Visibility Skeleton: Experimental Results.",
                    "An Almost Space-Optimal Streaming Algorithm for Coresets in Fixed Dimensions.",
                    "Deterministic Sampling Algorithms for Network Design."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th ESA 2007",
        "info": "Eilat, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2007",
                "sub_name": "Algorithms - ESA 2007, 15th Annual European Symposium, Eilat, Israel, October 8-10, 2007, Proceedings.",
                "count": 66,
                "papers": [
                    "Nash Equilibria: Where We Stand.",
                    "Small Worlds as Navigable Augmented Networks: Model, Analysis, and Validation.",
                    "Arrangements in Geometry: Recent Advances and Challenges.",
                    "Nash Equilibria in Voronoi Games on Graphs.",
                    "Evolutionary Equilibrium in Bayesian Routing Games: Specialization and Niche Formation.",
                    "Convergence to Equilibria in Distributed, Selfish Reallocation Processes with Weighted Tasks.",
                    "Finding Frequent Elements in Non-bursty Streams.",
                    "Tradeoffs and Average-Case Equilibria in Selfish Routing.",
                    "On the Variance of Subset Sum Estimation.",
                    "On Minimum Power Connectivity Problems.",
                    "On the Cost of Interchange Rearrangement in Strings.",
                    "Finding Mobile Data: Efficiency vs. Location Inaccuracy.",
                    "A Faster Query Algorithm for the Text Fingerprinting Problem.",
                    "Polynomial Time Algorithms for Minimum Energy Scheduling.",
                    "k -Mismatch with Don't Cares.",
                    "Finding Branch-Decompositions and Rank-Decompositions.",
                    "Fast Algorithms for Maximum Subset Matching and All-Pairs Shortest Paths in Graphs with a (Not So) Small Vertex Cover.",
                    "Linear-Time Ranking of Permutations.",
                    "Radix Sorting with No Extra Space.",
                    "Fast Low Degree Connectivity of Ad-Hoc Networks Via Percolation.",
                    "Order Statistics in the Farey Sequences in Sublinear Time.",
                    "New Results on Minimax Regret Single Facility Ordered Median Location Problems on Networks.",
                    "Dial a Ride from k -Forest.",
                    "Online Primal-Dual Algorithms for Maximizing Ad-Auctions Revenue.",
                    "Unique Lowest Common Ancestors in Dags Are Almost as Easy as Matrix Multiplication.",
                    "Optimal Algorithms for k -Search with Application in Option Pricing.",
                    "Linear Data Structures for Fast Ray-Shooting Amidst Convex Polyhedra.",
                    "Stackelberg Strategies for Atomic Congestion Games.",
                    "Good Quality Virtual Realization of Unit Ball Graphs.",
                    "Algorithms for Playing Games with Limited Randomness.",
                    "Approximation of Partial Capacitated Vertex Cover.",
                    "Optimal Resilient Dynamic Dictionaries.",
                    "Determining the Smallest k Such That G Is k -Outerplanar.",
                    "On the Size of Succinct Indices.",
                    "Compact Oracles for Approximate Distances Around Obstacles in the Plane.",
                    "Convex Combinations of Single Source Unsplittable Flows.",
                    "Farthest-Polygon Voronoi Diagrams.",
                    "Equitable Revisited.",
                    "Online Scheduling of Equal-Length Jobs on Parallel Machines.",
                    "k -Anonymization with Minimal Loss of Information.",
                    "A Quasi-PTAS for Profit-Maximizing Pricing on Line Graphs.",
                    "Improved Upper Bounds on the Competitive Ratio for Online Realtime Scheduling.",
                    "Bundle Pricing with Comparable Items.",
                    "Approximating Interval Scheduling Problems with Bounded Profits.",
                    "Pricing Tree Access Networks with Connected Backbones.",
                    "Distance Coloring.",
                    "An O (log2 k )-Competitive Algorithm for Metric Bipartite Matching.",
                    "To Fill or Not to Fill: The Gas Station Problem.",
                    "Online Bandwidth Allocation.",
                    "Two's Company, Three's a Crowd: Stable Family and Threesome Roommates Problems.",
                    "On the Complexity of Sequential Rectangle Placement in IEEE 802.16/WiMAX Systems.",
                    "Shorter Implicit Representation for Planar Graphs and Bounded Treewidth Graphs.",
                    "Dynamic Plane Transitive Closure.",
                    "Small Stretch Spanners in the Streaming Model: New Algorithms and Experiments.",
                    "Estimating Clustering Indexes in Data Streams.",
                    "Complete, Exact and Efficient Implementation for Computing the Adjacency Graph of an Arrangement of Quadrics.",
                    "Sweeping and Maintaining Two-Dimensional Arrangements on Surfaces: A First Step.",
                    "Fast and Compact Oracles for Approximate Distances in Planar Graphs.",
                    "Exact Minkowksi Sums of Polyhedra and Exact and Efficient Decomposition of Polyhedra in Convex Pieces.",
                    "A New ILP Formulation for 2-Root-Connected Prize-Collecting Steiner Networks.",
                    "Algorithms to Separate {0, 1/2}-Chvátal-Gomory Cuts.",
                    "Fast Lowest Common Ancestor Computations in Dags.",
                    "A Practical Efficient Fptas for the 0-1 Multi-objective Knapsack Problem.",
                    "Solutions to Real-World Instances of PSPACE-Complete Stacking.",
                    "Non-clairvoyant Batch Sets Scheduling: Fairness Is Fair Enough.",
                    "An Experimental Study of New and Known Online Packet Buffering Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th ESA 2006",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2006",
                "sub_name": "Algorithms - ESA 2006, 14th Annual European Symposium, Zurich, Switzerland, September 11-13, 2006, Proceedings.",
                "count": 73,
                "papers": [
                    "Origami, Linkages, and Polyhedra: Folding with Algorithms.",
                    "Reliable and Efficient Geometric Computing.",
                    "Some Computational Challenges in Today's Bio-medicine.",
                    "Kinetic Collision Detection for Convex Fat Objects.",
                    "Dynamic Connectivity for Axis-Parallel Rectangles.",
                    "Single Machine Precedence Constrained Scheduling Is a Vertex Cover Problem.",
                    "Cooperative TSP.",
                    "Fréchet Distance for Curves, Revisited.",
                    "Resource Allocation in Bounded Degree Trees.",
                    "Dynamic Algorithms for Graph Spanners.",
                    "Latency Constrained Aggregation in Sensor Networks.",
                    "Competitive Analysis of Flash-Memory Algorithms.",
                    "Contention Resolution with Heterogeneous Job Sizes.",
                    "Deciding Relaxed Two-Colorability - A Hardness Jump.",
                    "Negative Examples for Sequential Importance Sampling of Binary Contingency Tables.",
                    "Estimating Entropy over Data Streams.",
                    "Necklaces, Convolutions, and X + Y.",
                    "Purely Functional Worst Case Constant Time Catenable Sorted Lists.",
                    "Taxes for Linear Atomic Congestion Games.",
                    "Spanners with Slack.",
                    "Compressed Indexes for Approximate String Matching.",
                    "Traversing the Machining Graph.",
                    "Efficient Computation of Nash Equilibria for Very Sparse Win-Lose Bimatrix Games.",
                    "Distributed Almost Exact Approximations for Minor-Closed Families.",
                    "Spectral Clustering by Recursive Partitioning.",
                    "Finite Termination of \"Augmenting Path\" Algorithms in the Presence of Irrational Problem Data.",
                    "Dynamic Programming and Fast Matrix Multiplication.",
                    "Near-Entropy Hotlink Assignments.",
                    "Subspace Sampling and Relative-Error Matrix Approximation: Column-Row-Based Methods.",
                    "Finding Total Unimodularity in Optimization Problems Solved by Linear Programs.",
                    "Preemptive Online Scheduling: Optimal Algorithms for All Speeds.",
                    "On the Complexity of the Multiplication Method for Monotone CNF/DNF Dualization.",
                    "Lower and Upper Bounds on FIFO Buffer Management in QoS Switches.",
                    "Graph Coloring with Rejection.",
                    "A Doubling Dimension Threshold Theta(loglogn) for Augmented Graph Navigability.",
                    "Violator Spaces: Structure and Algorithms.",
                    "Region-Restricted Clustering for Geographic Data Mining.",
                    "An O(n3 (loglogn/logn)5/4) Time Algorithm for All Pairs Shortest Paths.",
                    "Cheating by Men in the Gale-Shapley Stable Matching Algorithm.",
                    "Approximating Almost All Instances of Max-Cut Within a Ratio Above the Håstad Threshold.",
                    "Enumerating Spanning and Connected Subsets in Graphs and Matroids.",
                    "Less Hashing, Same Performance: Building a Better Bloom Filter.",
                    "A Unified Approach to Approximating Partial Covering Problems.",
                    "Navigating Low-Dimensional and Hierarchical Population Networks.",
                    "Popular Matchings in the Capacitated House Allocation Problem.",
                    "Inner-Product Based Wavelet Synopses for Range-Sum Queries.",
                    "Approximation in Preemptive Stochastic Online Scheduling.",
                    "Greedy in Approximation Algorithms.",
                    "I/O-Efficient Undirected Shortest Paths with Unbounded Edge Lengths.",
                    "Stochastic Shortest Paths Via Quasi-convex Maximization.",
                    "Path Hitting in Acyclic Graphs.",
                    "Minimum Transversals in Posi-modular Systems.",
                    "An LP-Designed Algorithm for Constraint Satisfaction.",
                    "Approximate k-Steiner Forests Via the Lagrangian Relaxation Technique with Internal Preprocessing.",
                    "Balancing Applied to Maximum Network Flow Problems.",
                    "Out-of-Order Event Processing in Kinetic Data Structures.",
                    "Kinetic Algorithms Via Self-adjusting Computation.",
                    "Parallel Machine Scheduling Through Column Generation: Minimax Objective Functions.",
                    "Reporting Flock Patterns.",
                    "On Exact Algorithms for Treewidth.",
                    "An Improved Construction for Counting Bloom Filters.",
                    "An MINLP Solution Method for a Water Network Problem.",
                    "Skewed Binary Search Trees.",
                    "Algorithmic Aspects of Proportional Symbol Maps.",
                    "Does Path Cleaning Help in Dynamic All-Pairs Shortest Paths?",
                    "Multiline Addressing by Network Flow.",
                    "The Engineering of a Compression Boosting Library: Theory vs Practice in BWT Compression.",
                    "The Price of Resiliency: A Case Study on Sorting with Memory Faults.",
                    "How Branch Mispredictions Affect Quicksort.",
                    "Robust, Generic and Efficient Construction of Envelopes of Surfaces in Three-Dimensional Spaces.",
                    "Engineering Highway Hierarchies.",
                    "Univariate Polynomial Real Root Isolation: Continued Fractions Revisited.",
                    "Exact and Efficient Construction of Planar Minkowski Sums Using the Convolution Method."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th ESA 2005",
        "info": "Palma de Mallorca, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2005",
                "sub_name": "Algorithms - ESA 2005, 13th Annual European Symposium, Palma de Mallorca, Spain, October 3-6, 2005, Proceedings.",
                "count": 78,
                "papers": [
                    "Designing Reliable Algorithms in Unreliable Memories.",
                    "From Balanced Graph Partitioning to Balanced Metric Labeling.",
                    "Fearful Symmetries: Quantum Computing, Factoring, and Graph Isomorphism.",
                    "Exploring an Unknown Graph Efficiently.",
                    "Online Routing in Faulty Meshes with Sub-linear Comparative Time and Traffic Ratio.",
                    "Heuristic Improvements for Computing Maximum Multicommodity Flow and Minimum Multicut.",
                    "Relax-and-Cut for Capacitated Network Design.",
                    "On the Price of Anarchy and Stability of Correlated Equilibria of Linear Congestion Games.",
                    "The Complexity of Games on Highly Regular Graphs.",
                    "Computing Equilibrium Prices: Does Theory Meet Practice?.",
                    "Efficient Exact Algorithms on Planar Graphs: Exploiting Sphere Cut Branch Decompositions.",
                    "An Algorithm for the SAT Problem for Formulae of Linear Length.",
                    "Linear-Time Enumeration of Isolated Cliques.",
                    "Finding Shortest Non-separating and Non-contractible Cycles for Topologically Embedded Graphs.",
                    "Delineating Boundaries for Imprecise Regions.",
                    "EXACUS: Efficient and Exact Algorithms for Curves and Surfaces.",
                    "Min Sum Clustering with Penalties.",
                    "Improved Approximation Algorithms for Metric Max TSP.",
                    "Unbalanced Graph Cuts.",
                    "Low Degree Connectivity in Ad-Hoc Networks.",
                    "5-Regular Graphs are 3-Colorable with Positive Probability.",
                    "Optimal Integer Alphabetic Trees in Linear Time.",
                    "Predecessor Queries in Constant Time?.",
                    "An Algorithm for Node-Capacitated Ring Routing.",
                    "On Degree Constrained Shortest Paths.",
                    "A New Template for Solving p-Median Problems for Trees in Sub-quadratic Time.",
                    "Roll Cutting in the Curtain Industry.",
                    "Space Efficient Algorithms for the Burrows-Wheeler Backtransformation.",
                    "Cache-Oblivious Comparison-Based Algorithms on Multisets.",
                    "Oblivious vs. Distribution-Based Sorting: An Experimental Evaluation.",
                    "Allocating Memory in a Lock-Free Manner.",
                    "Generating Realistic Terrains with Higher-Order Delaunay Triangulations.",
                    "I/O-Efficient Construction of Constrained Delaunay Triangulations.",
                    "Convex Hull and Voronoi Diagram of Additively Weighted Points.",
                    "New Tools and Simpler Algorithms for Branchwidth.",
                    "Treewidth Lower Bounds with Brambles.",
                    "Minimal Interval Completions.",
                    "A 2-Approximation Algorithm for Sorting by Prefix Reversals.",
                    "Approximating the 2-Interval Pattern Problem.",
                    "A Loopless Gray Code for Minimal Signed-Binary Representations.",
                    "Efficient Approximation Schemes for Geometric Problems?.",
                    "Geometric Clustering to Minimize the Sum of Cluster Sizes.",
                    "Approximation Schemes for Minimum 2-Connected Spanning Subgraphs in Weighted Planar Graphs.",
                    "Packet Routing and Information Gathering in Lines, Rings and Trees.",
                    "Jitter Regulation for Multiple Streams.",
                    "Efficient c-Oriented Range Searching with DOP-Trees.",
                    "Matching Point Sets with Respect to the Earth Mover's Distance.",
                    "Small Stretch Spanners on Dynamic Graphs.",
                    "An Experimental Study of Algorithms for Fully Dynamic Transitive Closure.",
                    "Experimental Study of Geometric t-Spanners.",
                    "Highway Hierarchies Hasten Exact Shortest Path Queries.",
                    "Preemptive Scheduling of Independent Jobs on Identical Parallel Machines Subject to Migration Delays.",
                    "Fairness-Free Periodic Scheduling with Vacations.",
                    "Online Bin Packing with Cardinality Constraints.",
                    "Fast Monotone 3-Approximation Algorithm for Scheduling Related Machines.",
                    "Engineering Planar Separator Algorithms.",
                    ": Standard Template Library for XXL Data Sets.",
                    "Negative Cycle Detection Problem.",
                    "An Optimal Algorithm for Querying Priced Information: Monotone Boolean Functions and Game Trees.",
                    "Online View Maintenance Under a Response-Time Constraint.",
                    "Online Primal-Dual Algorithms for Covering and Packing Problems.",
                    "Efficient Algorithms for Shared Backup Allocation in Networks with Partial Information.",
                    "Using Fractional Primal-Dual to Schedule Split Intervals with Demands.",
                    "An Approximation Algorithm for the Minimum Latency Set Cover Problem.",
                    "Workload-Optimal Histograms on Streams.",
                    "Finding Frequent Patterns in a String in Sublinear Time.",
                    "Online Occlusion Culling.",
                    "Shortest Paths in Matrix Multiplication Time.",
                    "Computing Common Intervals of K Permutations, with Applications to Modular Decomposition of Graphs.",
                    "Greedy Routing in Tree-Decomposed Graphs.",
                    "Making Chord Robust to Byzantine Attacks.",
                    "Bucket Game with Applications to Set Multicover and Dynamic Page Migration.",
                    "Bootstrapping a Hop-Optimal Network in the Weak Sensor Model.",
                    "Approximating Integer Quadratic Programs and MAXCUT in Subdense Graphs.",
                    "A Cutting Planes Algorithm Based Upon a Semidefinite Relaxation for the Quadratic Assignment Problem.",
                    "Approximation Complexity of min-max (Regret) Versions of Shortest Path, Spanning Tree, and Knapsack.",
                    "Robust Approximate Zeros.",
                    "Optimizing a 2D Function Satisfying Unimodality Properties."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th ESA 2004",
        "info": "Bergen, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2004",
                "sub_name": "Algorithms - ESA 2004, 12th Annual European Symposium, Bergen, Norway, September 14-17, 2004, Proceedings.",
                "count": 72,
                "papers": [
                    "A Survey of FPT Algorithm Design Techniques with an Emphasis on Recent Advances and Connections to Practical Computing.",
                    "Algorithmic Aspects of Web Search Engines.",
                    "Efficient Tradeoff Schemes in Data Structures for Querying Moving Objects.",
                    "Swap and Mismatch Edit Distance.",
                    "Path Decomposition Under a New Cost Measure with Applications to Optical Network Design.",
                    "Optimal External Memory Planar Point Enclosure.",
                    "Maximizing Throughput in Multi-queue Switches.",
                    "An Improved Algorithm for CIOQ Switches.",
                    "Labeling Smart Dust.",
                    "Graph Decomposition Lemmas and Their Role in Metric Embedding Methods.",
                    "Modeling Locality: A Probabilistic Analysis of LRU and FWF.",
                    "An Algorithm for Computing DNA Walks.",
                    "Algorithms for Generating Minimal Blockers of Perfect Matchings in Bipartite Graphs and Related Problems.",
                    "Direct Routing: Algorithms and Complexity.",
                    "Lower Bounds for Embedding into Distributions over Excluded Minor Graph Families.",
                    "A Parameterized Algorithm for Upward Planarity Testing.",
                    "Fisher Equilibrium Price with a Class of Concave Utility Functions.",
                    "Hardness and Approximation Results for Packing Steiner Trees.",
                    "Approximation Hardness of Dominating Set Problems.",
                    "Improved Online Algorithms for Buffer Management in QoS Switches.",
                    "Time Dependent Multi Scheduling of Multicast.",
                    "Convergence Properties of the Gravitational Algorithm in Asynchronous Robot Systems.",
                    "The Average Case Analysis of Partition Sorts.",
                    "A Fast Distributed Algorithm for Approximating the Maximum Matching.",
                    "Extreme Points Under Random Noise.",
                    "Fixed Parameter Algorithms for Counting and Deciding Bounded Restrictive List H-Colorings.",
                    "On Variable-Sized Multidimensional Packing.",
                    "An Inductive Construction for Plane Laman Graphs via Vertex Splitting.",
                    "Faster Fixed-Parameter Tractable Algorithms for Matching and Packing Problems.",
                    "On the Evolution of Selfish Routing.",
                    "Competitive Online Approximation of the Optimal Search Ratio.",
                    "Incremental Algorithms for Facility Location and k-Median.",
                    "Dynamic Shannon Coding.",
                    "Fractional Covering with Upper Bounds on the Variables: Solving LPs with Negative Entries.",
                    "Negotiation-Range Mechanisms: Coalition-Resistant Markets.",
                    "Approximation Algorithms for Quickest Spanning Tree Problems.",
                    "An Approximation Algorithm for Maximum Triangle Packing.",
                    "Approximate Parameterized Matching.",
                    "Approximation of Rectangle Stabbing and Interval Stabbing Problems.",
                    "Fast 3-Coloring Triangle-Free Planar Graphs.",
                    "Approximate Unions of Lines and Minkowski Sums.",
                    "Radio Network Clustering from Scratch.",
                    "Seeking a Vertex of the Planar Matching Polytope in NC.",
                    "Equivalence of Search Capability Among Mobile Guards with Various Visibilities.",
                    "Load Balancing in Hypercubic Distributed Hash Tables with Heterogeneous Processors.",
                    "On the Stability of Multiple Partner Stable Marriages with Ties.",
                    "Flows on Few Paths: Algorithms and Lower Bounds.",
                    "Maximum Matchings in Planar Graphs via Gaussian Elimination.",
                    "Fast Multipoint Evaluation of Bivariate Polynomials.",
                    "On Adaptive Integer Sorting.",
                    "Tiling a Polygon with Two Kinds of Rectangles.",
                    "On Dynamic Shortest Paths Problems.",
                    "Uniform Algorithms for Deterministic Construction of Efficient Dictionaries.",
                    "Fast Sparse Matrix Multiplication.",
                    "An Experimental Study of Random Knapsack Problems.",
                    "Contraction and Treewidth Lower Bounds.",
                    "Load Balancing of Indivisible Unit Size Tokens in Dynamic and Heterogeneous Networks.",
                    "Comparing Real Algebraic Numbers of Small Degree.",
                    "Code Flexibility and Program Efficiency by Genericity: Improving Cgal's Arrangements.",
                    "Finding Dominators in Practice.",
                    "Data Migration on Parallel Disks.",
                    "Classroom Examples of Robustness Problems in Geometric Computations.",
                    "Stable Minimum Storage Merging by Symmetric Comparisons.",
                    "On Rectangular Cartograms.",
                    "Multi-word Atomic Read/Write Registers on Multiprocessor Systems.",
                    "Beyond Optimal Play in Two-Person-Zerosum Games.",
                    "Solving Geometric Covering Problems by Data Reduction.",
                    "Efficient IP Table Lookup via Adaptive Stratified Trees with Selective Reconstructions.",
                    "Super Scalar Sample Sort.",
                    "Construction of Minimum-Weight Spanners.",
                    "A Straight Skeleton Approximating the Medial Axis.",
                    "Non-additive Shortest Paths."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th ESA 2003",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2003",
                "sub_name": "Algorithms - ESA 2003, 11th Annual European Symposium, Budapest, Hungary, September 16-19, 2003, Proceedings.",
                "count": 69,
                "papers": [
                    "Sublinear Computing.",
                    "Authenticated Data Structures.",
                    "Approximation Algorithms and Network Games.",
                    "I/O-Efficient Structures for Orthogonal Range-Max and Stabbing-Max Queries.",
                    "Line System Design and a Generalized Coloring Problem.",
                    "Lagrangian Relaxation for the k-Median Problem: New Insights and Continuity Properties.",
                    "Scheduling for Flow-Time with Admission Control.",
                    "On Approximating a Geometric Prize-Collecting Traveling Salesman Problem with Time Windows: Extended Abstract.",
                    "Semi-clairvoyant Scheduling.",
                    "Algorithms for Graph Rigidity and Scene Analysis.",
                    "Optimal Dynamic Video-on-Demand Using Adaptive Broadcasting.",
                    "Multi-player and Multi-round Auctions with Severely Bounded Communication.",
                    "Network Lifetime and Power Assignment in ad hoc Wireless Networks.",
                    "Disjoint Unit Spheres admit at Most Two Line Transversals.",
                    "An Optimal Algorithm for the Maximum-Density Segment Problem.",
                    "Estimating Dominance Norms of Multiple Data Streams.",
                    "Smoothed Motion Complexity.",
                    "Kinetic Dictionaries: How to Shoot a Moving Target.",
                    "Deterministic Rendezvous in Graphs.",
                    "Fast Integer Programming in Fixed Dimension.",
                    "Correlation Clustering - Minimizing Disagreements on Arbitrary Weighted Graphs.",
                    "Dominating Sets and Local Treewidth.",
                    "Approximating Energy Efficient Paths in Wireless Multi-hop Networks.",
                    "Bandwidth Maximization in Multicasting.",
                    "Optimal Distance Labeling for Interval and Circular-Arc Graphs.",
                    "Improved Approximation of the Stable Marriage Problem.",
                    "Fast Algorithms for Computing the Smallest k-Enclosing Disc.",
                    "The Minimum Generalized Vertex Cover Problem.",
                    "An Approximation Algorithm for MAX-2-SAT with Cardinality Constraint.",
                    "On-Demand Broadcasting Under Deadline.",
                    "Improved Bounds for Finger Search on a RAM.",
                    "The Voronoi Diagram of Planar Convex Objects.",
                    "Buffer Overflows of Merging Streams.",
                    "Improved Competitive Guarantees for QoS Buffering.",
                    "On Generalized Gossiping and Broadcasting (Extended Abstract).",
                    "Approximating the Achromatic Number Problem on Bipartite Graphs.",
                    "Adversary Immune Leader Election in ad hoc Radio Networks.",
                    "Universal Facility Location.",
                    "A Method for Creating Near-Optimal Instances of a Certified Write-All Algorithm (Extended Abstract).",
                    "I/O-Efficient Undirected Shortest Paths.",
                    "On the Complexity of Approximating TSP with Neighborhoods and Related Problems.",
                    "A Lower Bound for Cake Cutting.",
                    "Ray Shooting and Stone Throwing.",
                    "Parameterized Tractability of Edge-Disjoint Paths on Directed Acyclic Graphs.",
                    "Binary Space Partition for Orthogonal Fat Rectangles.",
                    "Sequencing by Hybridization in Few Rounds.",
                    "Efficient Algorithms for the Ring Loading Problem with Demand Splitting.",
                    "Seventeen Lines and One-Hundred-and-One Points.",
                    "Jacobi Curves: Computing the Exact Topology of Arrangements of Non-singular Algebraic Curves.",
                    "Streaming Geometric Optimization Using Graphics Hardware.",
                    "An Efficient Implementation of a Quasi-polynomial Algorithm for Generating Hypergraph Transversals.",
                    "Experiments on Graph Clustering Algorithms.",
                    "More Reliable Protein NMR Peak Assignment via Improved 2-Interval Scheduling.",
                    "The Minimum Shift Design Problem: Theory and Practice.",
                    "Loglog Counting of Large Cardinalities (Extended Abstract).",
                    "Packing a Trunk.",
                    "Fast Smallest-Enclosing-Ball Computation in High Dimensions.",
                    "Automated Generation of Search Tree Algorithms for Graph Modification Problems.",
                    "Boolean Operations on 3D Selective Nef Complexes: Data Structure, Algorithms, and Implementation.",
                    "Fleet Assignment with Connection Dependent Ground Times.",
                    "A Practical Minimum Spanning Tree Algorithm Using the Cycle Property.",
                    "The Fractional Prize-Collecting Steiner Tree Problem on Trees: Extended Abstract.",
                    "Algorithms and Experiments for the Webgraph.",
                    "Finding Short Integral Cycle Bases for Cyclic Timetabling.",
                    "Slack Optimization of Timing-Critical Nets.",
                    "Multisampling: A New Approach to Uniform Sampling and Approximate Counting.",
                    "Multicommodity Flow Approximation Used for Exact Graph Partitioning.",
                    "A Linear Time Heuristic for the Branch-Decomposition of Planar Graphs.",
                    "Geometric Speed-Up Techniques for Finding Shortest Paths in Large Sparse Graphs."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th ESA 2002",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2002",
                "sub_name": "Algorithms - ESA 2002, 10th Annual European Symposium, Rome, Italy, September 17-21, 2002, Proceedings.",
                "count": 78,
                "papers": [
                    "Solving Traveling Salesman Problems.",
                    "Computing Shapes from Point Cloud Data.",
                    "Mechanism Design for Fun and Profit.",
                    "On Distance Oracles and Routing in Graphs.",
                    "Kinetic Medians and kd-Trees.",
                    "Range Searching in Categorical Data: Colored Range Searching on Grid.",
                    "Near-Linear Time Approximation Algorithms for Curve Simplification.",
                    "Translating a Planar Object to Maximize Point Containment.",
                    "Approximation Algorithms for k-Line Center.",
                    "New Heuristics and Lower Bounds for the Min-Max k -Chinese Postman Problem.",
                    "SCIL - Symbolic Constraints in Integer Linear Programming.",
                    "Implementing I/O-efficient Data Structures Using TPIE.",
                    "On the k-Splittable Flow Problem.",
                    "Partial Alphabetic Trees.",
                    "Classical and Contemporary Shortest Path Problems in Road Networks: Implementation and Experimental Analysis of the TRANSIMS Router.",
                    "Scanning and Traversing: Maintaining Data for Traversals in a Memory Hierarchy.",
                    "Two Simplified Algorithms for Maintaining Order in a List.",
                    "Efficient Tree Layout in a Multilevel Memory Hierarchy.",
                    "A Computational Basis for Conic Arcs and Boolean Operations on Conic Polygons.",
                    "TSP with Neighborhoods of Varying Size.",
                    "1.375-Approximation Algorithm for Sorting by Reversals.",
                    "Radio Labeling with Pre-assigned Frequencies.",
                    "Branch-and-Bound Algorithms for the Test Cover Problem.",
                    "Constructing Plane Spanners of Bounded Degree and Low Weight.",
                    "Eager st-Ordering.",
                    "Three-Dimensional Layers of Maxima.",
                    "Optimal Terrain Construction Problems and Applications in Intensity-Modulated Radiation Therapy.",
                    "Geometric Algorithms for Density-Based Data Clustering.",
                    "Balanced-Replication Algorithms for Distribution Trees.",
                    "Butterflies and Peer-to-Peer Networks.",
                    "Estimating Rarity and Similarity over Data Stream Windows.",
                    "Efficient Constructions of Generalized Superimposed Codes with Applications to Group Testing and Conflict Resolution in Multiple Access Channels.",
                    "Frequency Estimation of Internet Packet Streams with Limited Space.",
                    "Truthful and Competitive Double Auctions.",
                    "Optimal Graph Exploration without Good Maps.",
                    "Approximating the Medial Axis from the Voronoi Diagram with a Convergence Guarantee.",
                    "Non-independent Randomized Rounding and an Application to Digital Halftoning.",
                    "Computing Homotopic Shortest Paths Efficiently.",
                    "An Algorithm for Dualization in Products of Lattices and Its Applications.",
                    "Determining Similarity of Conformational Polymorphs.",
                    "Minimizing the Maximum Starting Time On-line.",
                    "Vector Assignment Problems: A General Framework.",
                    "Speeding Up the Incremental Construction of the Union of Geometric Objects in Practice.",
                    "Simple and Fast: Improving a Branch-And-Bound Algorithm for Maximum Clique.",
                    "Online Companion Caching.",
                    "Deterministic Communication in Radio Networks with Large Labels.",
                    "A Primal Approach to the Stable Set Problem.",
                    "Wide-Sense Nonblocking WDM Cross-Connects.",
                    "Efficient Implementation of a Minimal Triangulation Algorithm.",
                    "Scheduling Malleable Parallel Tasks: An Asymptotic Fully Polynomial-Time Approximation Scheme.",
                    "The Probabilistic Analysis of a Greedy Satisfiability Algorithm.",
                    "Dynamic Additively Weighted Voronoi Diagrams in 2D.",
                    "Time-Expanded Graphs for Flow-Dependent Transit Times.",
                    "Partially-Ordered Knapsack and Applications to Scheduling.",
                    "A Software Library for Elliptic Curve Cryptography.",
                    "Real-Time Dispatching of Guided and Unguided Automobile Service Units with Soft Time Windows.",
                    "Randomized Approximation Algorithms for Query Optimization Problems on Two Processors.",
                    "Covering Things with Things.",
                    "On-Line Dial-a-Ride Problems under a Restricted Information Model.",
                    "Approximation Algorithm for the Maximum Leaf Spanning Tree Problem for Cubic Graphs.",
                    "Engineering a Lightweight Suffix Array Construction Algorithm.",
                    "Complexity of Compatible Decompositions of Eulerian Graphs and Their Transformations.",
                    "External-Memory Breadth-First Search with Sublinear I/O.",
                    "Frequency Channel Assignment on Planar Networks.",
                    "Design and Implementation of Efficient Data Types for Static Graphs.",
                    "An Exact Algorithm for the Uniformly-Oriented Steiner Tree Problem.",
                    "A Fast, Accurate and Simple Method for Pricing European-Asian and Saving-Asian Options.",
                    "Sorting 13 Elements Requires 34 Comparisons.",
                    "Extending Reduction Techniques for the Steiner Tree Problem.",
                    "A Comparison of Multicast Pull Models.",
                    "Online Scheduling for Sorting Buffers.",
                    "Finding the Sink Takes Some Time.",
                    "Lagrangian Cardinality Cuts and Variable Fixing for Capacitated Network Design.",
                    "Minimizing Makespan and Preemption Costs on a System of Uniform Machines.",
                    "Minimizing the Total Completion Time On-line on a Single Machine, Using Restarts.",
                    "High-Level Filtering for Arrangements of Conic Arcs.",
                    "An Approximation Scheme for Cake Division with a Linear Number of Cuts.",
                    "A Simple Linear Time Algorithm for Finding Even Triangulations of 2-Connected Bipartite Plane Graphs."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th ESA 2001",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2001",
                "sub_name": "Algorithms - ESA 2001, 9th Annual European Symposium, Aarhus, Denmark, August 28-31, 2001, Proceedings.",
                "count": 44,
                "papers": [
                    "External Memory Data Structures.",
                    "Some Algorithmic Problems in Large Networks.",
                    "Exact and Approximate Distances in Graphs - A Survey.",
                    "Strongly Competitive Algorithms for Caching with Pipelined Prefetching.",
                    "Duality between Prefetching and Queued Writing with Parallel Disks.",
                    "Online Bin Coloring.",
                    "A General Decomposition Theorem for the k-Server Problem.",
                    "Buying a Constant Competitive Ratio for Paging.",
                    "Simple Minimal Perfect Hashing in Less Space.",
                    "Cuckoo Hashing.",
                    "Coupling Variable Fixing Algorithms for the Automatic Recording Problem.",
                    "Approximation Algorithms for Scheduling Malleable Tasks under Precedence Constraints.",
                    "On the Approximability of the Minimum Test Collection Problem.",
                    "Finding Approximate Repetitions under Hamming Distance.",
                    "SNPs Problems, Complexity, and Algorithms.",
                    "A FPTAS for Approximating the Unrelated Parallel Machines Scheduling Problem with Costs.",
                    "Grouping Techniques for Scheduling Problems: Simpler and Faster.",
                    "A 2-Approximation Algorithm for the Multi-vehicle Scheduling Problem on a Path with Release and Handling Times.",
                    "A Simple Shortest Path Algorithm with Linear Average Time.",
                    "A Heuristic for Dijkstra's Algorithm with Many Targets and Its Use in Weighted Matching Algorithms.",
                    "A Separation Bound for Real Algebraic Expressions.",
                    "Property Testing with Geometric Queries.",
                    "Smallest Color-Spanning Objects.",
                    "Explicit Deterministic Constructions for Membership in the Bitprobe Model.",
                    "Lossy Dictionaries.",
                    "Splitting a Delaunay Triangulation in Linear Time.",
                    "A Fast Algorithm for Approximating the Detour of a Polygonal Chain.",
                    "An Approximation Algorithm for MINIMUM CONVEX COVER with Logarithmic Performance Guarantee.",
                    "Distributed O(Delta log(n))-Edge-Coloring Algorithm.",
                    "Modeling Replica Placement in a Distributed File System: Narrowing the Gap between Analysis and Simulation.",
                    "Computing Cycle Covers without Short Cycles.",
                    "A Polynomial Time Algorithm for the Cutwidth of Bounded Degree Graphs with Small Treewidth.",
                    "Lower Bounds and Exact Algorithms for the Graph Partitioning Problem Using Multicommodity Flows.",
                    "Fast Pricing of European Asian Options with Provable Accuracy: Single-Stock and Basket Options.",
                    "Competitive Auctions for Multiple Digital Goods.",
                    "Algorithms for Efficient Filtering in Content-Based Multicast.",
                    "Approximation Algorithms for Minimum-Time Broadcast under the Vertex-Disjoint Paths Mode.",
                    "Round Robin Is Optimal for Fault-Tolerant Broadcasting on Wireless Networks.",
                    "Online and Offline Distance Constrained Labeling of Disk Graphs.",
                    "Approximate Distance Labeling Schemes.",
                    "On the Parameterized Complexity of Layered Graph Drawing.",
                    "A General Model of Undirected Web Graphs.",
                    "Packing Cycles and Cuts in Undirected Graphs.",
                    "Greedy Algorithms for Minimisation Problems in Random Regular Graphs."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th ESA 2000",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/2000",
                "sub_name": "Algorithms - ESA 2000, 8th Annual European Symposium, Saarbrücken, Germany, September 5-8, 2000, Proceedings.",
                "count": 40,
                "papers": [
                    "Web Information Retrieval - an Algorithmic Perspective.",
                    "Computational Biology - Algorithms and More.",
                    "Polygon Decomposition for Efficient Construction of Minkowski Sums.",
                    "An Approximation Algorithm for Hypergraph Max k-Cut with Given Sizes of Parts.",
                    "Offline List Update is NP-Hard.",
                    "Computing Largest Common Point Sets under Approximate Congruence.",
                    "Online Algorithms for Caching Multimedia Streams.",
                    "On Recognizing Cayley Graphs.",
                    "Fast Algorithms for Even/Odd Minimum Cuts and Generalizations.",
                    "Efficient Algorithms for Centers and Medians in Interval and Circular-Arc Graphs.",
                    "Exact Point Pattern Matching and the Number of Congruent Triangles in a Three-Dimensional Pointset.",
                    "Range Searching Over Tree Cross Products.",
                    "A 2 1/10-Approximation Algorithm for a Generalization of the Weighted Edge-Dominating Set Problem.",
                    "The Minimum Range Assignment Problem on Linear Radio Networks.",
                    "Property Testing in Computational Geometry.",
                    "On R-trees with Low Stabbing Number.",
                    "K-D Trees Are Better when Cut on the Longest Side.",
                    "On Multicriteria Online Problems.",
                    "Online Scheduling Revisited.",
                    "Constan Ratio Approximation Algorithms for the Rectangle Stabbing Problem and the Rectilinear Partitioning Problem.",
                    "I/O-Efficient Well-Separated Pair Decomposition and Its Applications.",
                    "Higher Order Delaunay Triangulations.",
                    "On Representations of Algebraic-Geometric Codes for List Decoding.",
                    "Minimizing a Convex Cost Closure Set.",
                    "Preemptive Scheduling with Rejection.",
                    "Simpler and Faster Vertex-Connectivity Augmentation Algorithms.",
                    "Scheduling Broadcasts in Wireless Networks.",
                    "Jitter Regulation in an Internet Router with Delay Consideration.",
                    "Approximation of Curvature-Constrained Shortest Paths through a Sequence of Points.",
                    "Resource Constrained Shortest Paths.",
                    "On the Competitiveness of Linear Search.",
                    "Maintaining a Minimum Spanning Tree Under Transient Node Failures.",
                    "Minimum Depth Graph Embedding.",
                    "New Algorithms for Two-Label Point Labeling.",
                    "Analysing the Cache Behaviour of Non-uniform Distribution Sorting Algorithms.",
                    "How Helpers Hasten h-Relations.",
                    "Computing Optimal Linear Layouts of Trees in Linear Time.",
                    "Coloring Sparse Random Graphs in Polynominal Average Time.",
                    "Restarts Can Help in the On-Line Minimization of the Maximum Delivery Time on a Single Machine.",
                    "Collision Detection Using Bounding Boxes: Convexity Helps."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th ESA 1999",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1999",
                "sub_name": "Algorithms - ESA '99, 7th Annual European Symposium, Prague, Czech Republic, July 16-18, 1999, Proceedings.",
                "count": 46,
                "papers": [
                    "Adaptively-Secure Distributed Public-Key Systems.",
                    "How Long Does a Bit Live in a Computer? (abstract).",
                    "Approximation Algorithms for the Traveling Purchaser Problem and its Variants in Network Design.",
                    "The Impact of Knowledge on Broadcasting Time in Radio Networks.",
                    "Multipacket Routing on 2-D Meshes and Its Application to Fault-Tolerant Routing.",
                    "IP Address Lookup Made Fast and Simple.",
                    "On-Line Load Banancing in a Hierarchical Server Topology.",
                    "Provably Good and Practical Strategies for Non-Uniform Data Management in Networks.",
                    "Approximation Algorithms for Restoration Capacity Planning.",
                    "Efficient Algorithms for Integer Programs with Two Variables per Constraint.",
                    "Convex Quadratic Programming Relaxations for Network Scheduling Problems.",
                    "Resource-Constrained Project Scheduling: Computing Lower Bounds by Solving Minimum Cut Problems.",
                    "Approximation Schemes for Scheduling on Uniformly Related and Identical Parallel Machines.",
                    "Off-Line Temporary Tasks Assignment.",
                    "Load Balancing Using Bisectors - A Tight Average-Case Analysis.",
                    "On the Analysis of Evolutionary Algorithms - A Proof That Crossover Really Can Help.",
                    "Motif Statistics.",
                    "Approximate Protein Folding in the HP Side Chain Model on Extended Cubic Lattices.",
                    "On Constructing Suffix Arrays in External Memory.",
                    "Strategies for Searching with Different Access Costs.",
                    "On the Informational Asymmetry between Upper and Lower Bounds for Ultrametric Evolutionary Trees.",
                    "Optimal Binary Search with Two Unreliable Tests and Minimum Adaptiveness.",
                    "Improving Mergesort for Linked Lists.",
                    "Efficient Algorithms foe On-Line Symbol Ranking Compression.",
                    "On List Update and Work Function Algorithms.",
                    "The 3-Server Problem in the Plane.",
                    "Quartet Cleaning: Improved Algorithms and Simulations.",
                    "Fast and Robust Smallest Enclosing Balls.",
                    "Efficient Searching for Multi-dimensional Data Made Simple.",
                    "Geometric Searching over the Rationals.",
                    "On Computing the Diameter of a Point Set in High Dimensional Euclidean Space.",
                    "A Nearly Linear-Time Approximation Scheme for the Euclidean kappa-median Problem.",
                    "Sum Multi-coloring of Graphs.",
                    "Efficient Approximation Algorithms for the Achromatic Number.",
                    "Augmenting a (kappa-1)-Vertex-Connected Multigraph to an iota-Edge-Connected and kappa-Vertex-Connected Multigraph.",
                    "An Optimisation Algorithm for Maximum Independent Set with Applications in Map Labelling.",
                    "A Decomposition Theorem for Maximum Weight Bipartite Matchings with Applications to Evolutionary Trees.",
                    "Faster Exact Solutions for Some NP-Hard Problems.",
                    "A Polyhedral Algorithm for Packings and Designs.",
                    "Threshold Phenomena in Random Lattices and Efficient Reduction Algorithms.",
                    "On Finding the Maximum Number of Disjoint Cuts in Seymour Graphs.",
                    "Dilworth's Theorem and Its Application for Path Systems of a Cycle - Implementation and Analysis.",
                    "On 2-Coverings and 2-Packings of Laminar Families.",
                    "Random Cayley Graphs with O(log[G]) Generators Are Expanders.",
                    "A Fully Dynamic Algorithm for Recognizing and Representing Proper Interval Graphs.",
                    "A Fast General Methodology for Information - Theoretically Optimal Encodings of Graphs."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th ESA 1998",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1998",
                "sub_name": "Algorithms - ESA '98, 6th Annual European Symposium, Venice, Italy, August 24-26, 1998, Proceedings.",
                "count": 42,
                "papers": [
                    "External Memory Algorithms.",
                    "Design and Analysis of Dynamic Processes: A Stochastic Approach.",
                    "Car-Pooling as a Data Structuring Device: The Soft Heap.",
                    "Optimal Prefix-Free Codes for Unequal Letter Costs: Dynamic Programming with the Monge Property.",
                    "Finding All the Best Swaps of a Minimum Diameter Spanning Tree under Transient Edge Failures.",
                    "Augmenting Suffix Trees, with Applications.",
                    "Longest Common Subsequence from Fragments via Sparse Dynamic Programming.",
                    "Computing the Edit-Distance between Unrooted Ordered Trees.",
                    "Analogs and Duals of the MAST Problem for Sequences and Trees.",
                    "Complexity Estimates Depending on Condition and Round-Off Error.",
                    "Intrinsic Near Quadratic Complexity Bounds for Real Multivariate Root Counting.",
                    "Fast Algorithms for for Linear Algebra Modulo N.",
                    "A Probabilistic Zero-Test for Expressions Involving Root of Rational Numbers.",
                    "Geometric Searching in Walkthrough Animations with Weak Spanners in Real Time.",
                    "Robust Region Approach to the Computation of Geometric Graphs (Extended Abstract).",
                    "Positioning Guards at Fixed Height Above a Terrain - An Optimum Inapproximability Result.",
                    "Two-Center Problems for a Convex Polygon (Extended Abstract).",
                    "Constructing Binary Space Partitions for Orthogonal Rectabgles in Practice.",
                    "A Fast Random Greedy Algorithm for the Component Commonality Problem.",
                    "Maximizing Job Completions Online.",
                    "A Randomized Algorithm for Two Servers on the Line (Extended Abstract).",
                    "On Nonblocking Properties on the Benes Network.",
                    "Adaptability and the Usefulness of Hints (Extended Abstract).",
                    "Fault-Tolerant Broadcasting in Radio Networks (Extended Abstract).",
                    "New Bounds for Oblivious Mesh Routing.",
                    "Evaluating Server-Assisted Cache Replacement in the Web.",
                    "Fully Dynamic Shortest Paths and Negative Cycles Detection on Digraphs with Arbitrary Arc Weights.",
                    "A Functional Approach to External Graph Algorithms.",
                    "Minimal Triangulations for Graphs with \"Few\" Minimal Separators.",
                    "Finding an Optimal Path without Growing the Tree.",
                    "An Experimental Study of Dynamic Algorithms for Directed Graphs.",
                    "Matching Medical Students to Pairs of Hospitals: A New Variation on a Well-Known Theme.",
                    "Delta-Stepping: A Parallel Single Source Shortest Path Algorithm.",
                    "Improved Deterministic Parallel Padded Sorting.",
                    "Analyzing an Infinite Parallel Job Allocation Process.",
                    "Nearest Neighbor Load Balancing on Graphs.",
                    "2-Approximation Algorithm for Finding a Spanning Tree with Maximum Number of Leaves.",
                    "Moving-Target TSP and Related Problems.",
                    "Fitting Points on the Real Line and Its Application to RH Mapping.",
                    "Approximate Coloring of Uniform Hypergraphs (Extended Abstract).",
                    "Techniques for Scheduling with Rejection.",
                    "Computer-Aided Way to Prove Theorems in Scheduling."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th ESA 1997",
        "info": "Graz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1997",
                "sub_name": "Algorithms - ESA '97, 5th Annual European Symposium, Graz, Austria, September 15-17, 1997, Proceedings.",
                "count": 38,
                "papers": [
                    "Scheduling Independent Multiprocessor Tasks.",
                    "On Local Search for Weighted k-Set Packing.",
                    "On-Line Machine Covering.",
                    "Area-Efficient Static and Incremental Graph Drawings.",
                    "Denesting by Bounded Degree Radicals.",
                    "A Linear Time Algorithm for the Arc Disjoint Menger Problem in Planar Directed Graphs (Extended Abstract).",
                    "Distance Approximating Trees for Chordal and Dually Chordal Graphs (Extended Abstract).",
                    "Decomposition of Integer Programs and of Generating Sets.",
                    "Bounded Degree Spanning Trees (Extended Abstract).",
                    "Optimal Adaptive Broadcasting with a Bounded Fraction of Faulty Nodes (Extended Abstract).",
                    "Weighted Graph Separators and Their Applications.",
                    "A New Exact Algorithm for General Orthogonal D-Dimensional Knapsack Problems.",
                    "Dynamic Data Structures for Realtime Management of Large Geormetric Scences (Extended Abstract).",
                    "Solving Rectilinear Steiner Tree Problems Exactly in Theory and Practice.",
                    "Dynamically Switching Vertices in Planar Graphs (Extended Abstract).",
                    "A New Family of Randomized Algorithms for List Accessing.",
                    "On-Line Construction of Two-Dimensional Suffix Trees.",
                    "Scheduling Multiclass Queueing Networks on Parallel Servers: Approximate and Heavy-Traffic Optimality of Klimov's Priority Rule.",
                    "Optimal Reconstruction of Graphs Under the Additive Model.",
                    "Fixing Variables in Semidefinite Relaxations.",
                    "Test Sets of the Knapsack Problem and Simultaneous Diophantine Approximations.",
                    "Three-Dimensional Meshes are Less Powerful than Two-Dimensional Ones in Oblivious Routing.",
                    "Fault-Tolerant Real-Time Scheduling.",
                    "Collecting Garbage Pages in a Distributed Shared Memory with Reduced Memory and Communication Overhead.",
                    "Quasi-Fully Dynamic Algorithms for Two-Connectivity, Cycle Equivalence and Related Problems.",
                    "Minimum Spanning Trees in d Dimensions.",
                    "Relaxed Balance for Search Trees with Local Rebalancing.",
                    "Improved Approximations for Minimum Cardinality Quadrangulations of Finite Element Meshes.",
                    "Dynamic Storage Allocation with Known Durations.",
                    "Coloring in Sublinear Time.",
                    "Competivive Analysis of on-line Stack-Up Algorithms.",
                    "Scheduling-LPs Bear Probabilities: Randomized Approximations for Min-Sum Criteria.",
                    "On Piercing Sets of Axis-Parallel Rectangles and Rings.",
                    "Seven Problems: So Different yet Close.",
                    "Linear-Time Reconstruction of Delaunay Triangulations with Applications.",
                    "Approximating Satisfiable Satisfiability Problems (Extended Abstract).",
                    "Algorithms for Computing Signs of 2×2 Determinants: Dynamics and Average-Case Analysis.",
                    "Reconstructing the Topology of a CAD Model: A Discrete Approach."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th ESA 1996",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1996",
                "sub_name": "Algorithms - ESA '96, Fourth Annual European Symposium, Barcelona, Spain, September 25-27, 1996, Proceedings.",
                "count": 41,
                "papers": [
                    "Analysis of Shellsort and Related Algorithms.",
                    "Drawing with Colors (Extended Abstract).",
                    "Approximating the Unsatisfiability Threshold of Random Formulas (Extended Abstract).",
                    "Preemptive Weighted Completion Time Scheduling of Parallel Jobs.",
                    "Approximation Algorithms for Dynamic Storage Allocations.",
                    "Positive Linear Programming, Parallel Approximation and PCP's.",
                    "Scheduling Jobs with Communication Delays: Using Infeasible Solutions for Approximation (Extended Abstract).",
                    "Randomization of Search Trees by Subtree Size.",
                    "Efficient Dynamic Method-Lookup for Object Oriented Languages (Extended Abstract).",
                    "Priority Queues: Small, Monotone and Trans-dichotomous.",
                    "Simulated Annealing and Its Problems to Color Graphs.",
                    "The Capacitated K-Center Problem (Extended Abstract).",
                    "A Unified Local Ratio Approximation of Node-Deletion Problems (Extended Abstract).",
                    "Approximation Algorithms for Connected Dominating Sets.",
                    "Greedy Algorithms for the Shortest Common Superstring that are Asmtotically Optimal.",
                    "On the Depth of Randomly Generated Circuits.",
                    "The Analysis of Linear Probing Hashing with Buckets (Extended Abstract).",
                    "Parallel Algorithms for Partitioning Sorted Sets and Related Problems.",
                    "Fast Generation of Random Permutations via Networks Simulation.",
                    "On the Parallel Dynamic Dictionary Matching Problem: New Results with Applications.",
                    "Parallel Algorithms for Series Parallel Graphs.",
                    "Parallel Complexity of Householder QR Factorization.",
                    "Reporting Red-Blue Intersections between Two Sets of Connected Line Segments.",
                    "Matching Convex Shapes with Respect to the Symmetric Difference.",
                    "On Minimum-Area Hulls (Extended Abstract).",
                    "Negative-Cycle Detection Algorithms.",
                    "A New Regular Grammar Pattern Matching Algorithm.",
                    "Lempel-Ziv Index for q-Grams.",
                    "Computing Upper and Lower Bounds on Textile Nesting Problems.",
                    "On-line and Off-line Approximation Algorithms for Vector Covering Problems.",
                    "Competive Analysis of Randomized Paging Algorithms.",
                    "On-line Competive Algorithms for Call Admission in Optical Networks.",
                    "Race-Condition Detection in Parallel Computation with Semaphores (Extended Abstract).",
                    "Efficient Wavelength Routing on Directed Fiber Trees.",
                    "A Lower Bound for Nearly Minimal Adaptive and Hot Potato Algorithms.",
                    "The Structure of Circular Decomposable Metrics.",
                    "Faster Algorithms for Subgraph Isomorphism of k-Connected Partial k-Trees.",
                    "Planar Spanners and Approximate Shortest Path Queries among Obstacles in the Plane.",
                    "A New Approach to Optimal Planning of Robot Motion on a Tree with Obstacles.",
                    "Generalized Streets Revisited.",
                    "Computational Aspacts of Organization Theory (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd ESA 1995",
        "info": "Corfu, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1995",
                "sub_name": "Algorithms - ESA '95, Third Annual European Symposium, Corfu, Greece, September 25-27, 1995, Proceedings.",
                "count": 43,
                "papers": [
                    "On Mixed Connectivity Certificates (Extended Abstract).",
                    "Truly Efficient Parallel Algorithms: c-Optimal Multisearch for an Extension of the BSP Model (Extended Abstract).",
                    "Optimal Parallel Shortest Paths in Small Treewidth Digraphs.",
                    "Shared Memory Simulations with Triple-Logarithmic Delay.",
                    "Implementing Shared Memory on Mult-Dimensional Meshes and on the Fat-Tree (Extended Abstract).",
                    "Beyond the Worst-Case Bisection Bound: Fast Sorting and Ranking on Meshes.",
                    "Fast Deterministic Simulation of Computations on Faulty Parallel Machines.",
                    "Average Circuit Depth and Average Communication Complexity.",
                    "Packing Trees.",
                    "Sometimes Travelling is Easy: The Master Tour Problem.",
                    "Interval Graphs with Side (and Size) Constraints.",
                    "Maximum Skew-Symmetric Flows.",
                    "Certificates and Fast Algorithms for Biconnectivity in Fully-Dynamic Graphs.",
                    "On the All-Pairs Shortest Path Algorithm of Moffat and Takaoka.",
                    "Fully Dynamic Transitive Closure in Plane Dags with One Source and One Sink.",
                    "Planarity for Clustered Graphs.",
                    "A Geometric Approach to Betweenness.",
                    "Efficient Computation of the Geodesic Voronoi Diagram of Points in a Simple Polygon (Extended Abstract).",
                    "Linear Size Binary Space Partitions for Fat Objects.",
                    "Geometric Pattern Matching in d-Dimensional Space.",
                    "Finding the Constrained Delaunay Triangulation and Constrainted Voronoi Diagram of a Simple Polygon in Linear-Time (Extended Abstract).",
                    "External-Memory Algorithms for Processing Line Segments in Geographic Information Systems (Extended Abstract).",
                    "Optimized Binary Search and Text Retrieval.",
                    "On Using q-Gram Locations in Approximate String Matching.",
                    "Routing with Bounded Buffers and Hot-Potato Routing in Vertex-Symmetric Networks.",
                    "Load Balancing for Response Time.",
                    "Self-Simulation for the Passive Optical Star Model.",
                    "Computing the Agreement of Trees with Bounded Degrees.",
                    "Approximation Algorithms for Feasible Cut and Multicut Problems.",
                    "On Parallel versus Sequential Approximation.",
                    "An Efficient and Effective Approximation Algorithm for the Map Labeling Problem.",
                    "Approximating the Bandwidth for Asteroidal Triple-Free Graphs.",
                    "Near-Optimal Distributed Edge Coloring.",
                    "The Centroid of Points with Approximate Weights.",
                    "0/1-Integer Programming: Optimization and Augmentation are Equivalent.",
                    "The Online Transportation Problem.",
                    "A Polyhedral Approach to Planar Augmentation and Related Problems.",
                    "Optimal Layouts on a Chain ATM Network (Extended Abstract).",
                    "Efficient Dynamic-Resharing \"Verifiable Secret Sharing\" Against Mobile Adversary.",
                    "Adaptive Video on Demand.",
                    "The Binomial Transform and its Application to the Analysis of Skip Lists.",
                    "An Optimal Parallel Algorithm for Digital Curve Segmentation Using Hough Polygons and Monotone Function Search.",
                    "Fast Skeleton Construction."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2nd ESA 1994",
        "info": "Utrecht, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1994",
                "sub_name": "Algorithms - ESA '94, Second Annual European Symposium, Utrecht, The Netherlands, September 26-28, 1994, Proceedings.",
                "count": 45,
                "papers": [
                    "Optimization Algorithms For Large Networks.",
                    "Wanna Buy an Algorithm? Cheap! or: Algorithms for Text Searching Which Could Have Commercial Value (Abstract).",
                    "Planar Drawings and Angular Resolution: Algorithms and Bounds (Extended Abstract).",
                    "A Better Heuristic for Orthogonal Graph Drawings.",
                    "Hamilton Triangulations for Fast Rendering.",
                    "Efficient Construction of a Bounded Degree Spanner with Low Weight.",
                    "Approaching the 5/4-Approximation for Rectilinear Steiner Trees.",
                    "Membership in Constant Time and Minimum Space.",
                    "Faster Searching in Tries and Quadtrees - An Analysis of Level Compression.",
                    "The Analysis of a Hashing Schema by the Diagonal Poisson Transform (Extended Abstract).",
                    "Some Lower Bounds for Comparison-Based Algorithms.",
                    "An Efficient Algorithm for Edge-Ranking Trees.",
                    "Edge-Disjoint (s, t)-Paths on Undirected Planar Graphs in Linear Time.",
                    "A Simple Min Cut Algorithm.",
                    "Approximation Algorithm on Multi-Way Maxcut Partitioning.",
                    "A Linear-Time Algorithm for Finding a Central Vertex of a Chordal Graph.",
                    "The Time Complexity of Updating Snapshot Memories.",
                    "Non-Exploratory Self-Stabilization for Constant-Space Symmetry-Breaking.",
                    "On-Line Distributed Data Management.",
                    "A Unified Scheme for Detecting Fundamental Curves in Binary Edge Images.",
                    "How to Compute the Voronoi Diagram of Line Segments: Theoretical and Experimental Results.",
                    "Range Searching and Point Location among Fat Objects.",
                    "Convex Tours on Bounded Curvature.",
                    "Optimal Shortest Path and Minimum-Link Path Queries in the Presence of Obstacles (Extended Abstract).",
                    "Fast Algorithms for Collision and Proximity Problems Involving Moving Geometric Objects.",
                    "Reverse-Fit: A 2-Optimal Algorithm for Packing Rectangles.",
                    "An Optimal Algorithm for Preemptive On-line Scheduling.",
                    "Tight Approximations for Resource Constrained Scheduling Problems.",
                    "An Algorithm for 0-1 Programming with Application to Airline Crew Scheduling.",
                    "An o(n) Work EREW Parallel Algorithm for Updating MST.",
                    "On the Structure of DFS-Forests on Directed Graphs and the Dynamic Maintenance of DFS on DAG's.",
                    "Finding and Counting Given Length Cycles (Extended Abstract).",
                    "Greedy Hot-Potato Routing on the Mesh.",
                    "Desnakification of Mesh Sorting Algorithms.",
                    "Tight Bounds on Deterministic PRAM Emulations with Constant Redundancy.",
                    "PRAM Computations Resilient to Memory Faults.",
                    "An Area Lower Bound for a Class of Fat-Trees (Extended Abstract).",
                    "A Unified Approach to Approximation Schemes for NP- and PSPACE-Hard Problems for Geometric Graphs.",
                    "The Parallel Complexity of Eden Growth, Solid-on-Solid Groth and Ballistic Deposition (Extended Abstract).",
                    "A New Approach to Resultant Computations and Other Algorithms with Exact Division.",
                    "Testing Equivalence of Morphisms on Context-Free Languages.",
                    "Work-Time Optimal Parallel Prefix Matching (Extended Abstract).",
                    "On the Exact Complexity of the String Prefix-Matching Problem (Extended Abstract).",
                    "Incremental Text Editing: A New Data Structure.",
                    "Erratum: Computing Treewidth and Minimum Fill-In: All You Need are the Minimal Separators."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1st ESA 1993",
        "info": "Bad Honnef, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esa/1993",
                "sub_name": "Algorithms - ESA '93, First Annual European Symposium, Bad Honnef, Germany, September 30 - October 2, 1993, Proceedings.",
                "count": 38,
                "papers": [
                    "The Influence of Lookahead in Competitive Paging Algorithms (Extended Abstract).",
                    "An Optimal Algorithm for Shortest Paths on Weighted Interval and Circular-Arc Graphs, with Applications.",
                    "Efficient Self Simulation Algorithms for Reconfigurable Arrays.",
                    "Optimal Upward Planarity Testing of Single-Source Digraphs.",
                    "On Bufferless Routing of Variable-length Message in Leveled Networks (Extended Abstract).",
                    "Saving Comparisons in the Crochemore-Perrin String Matching Algorithm.",
                    "Unambiguity of Extended Regular Expressions in SGML Document Grammars.",
                    "On the Direct Sum Conjecture in the Straight Line Model.",
                    "Combine and Conquer: a General Technique for Dynamic Algorithms (Extended Abstract).",
                    "Optimal CREW-PRAM Algorithms for Direct Dominance Problems.",
                    "Trekking in the Alps Without Freezing or Getting Tired.",
                    "Dog Bites Postman: Point Location in the Moving Voronoi Diagram and Related Problems.",
                    "Parallel Approximation Schemes for problems on planar graphs (Extended Abstract).",
                    "DNA Physical Mapping: Three Ways Difficult.",
                    "A Calculus of Random Generation.",
                    "The Bit Complexity of Distributed Sorting (Extended Abstract).",
                    "Three-Clustering of Points in the Plane.",
                    "Gossiping in Vertex-Disjoint Paths Mode in d-Dimensional Grids and Planar Graphs.",
                    "Fully Dynamic Planarity Testing in Planar Embedded Graphs (Extended Abstract).",
                    "Fully Dynamic Algorithms for Bin Packing: Being (mostly) Myopic Helps.",
                    "Incresing the Vertex-Connectivity in Directed Graphs.",
                    "On the Recognition of Permuted Bottleneck Monge Matrices.",
                    "Computing Treewidth and Minimum Fill-In: All You Need are the Minimal Separators.",
                    "Block Gossiping on Grids and Tori: Deterministic Sorting and Routing Match the Bisection Bound.",
                    "The Complexity of Scheduling Trees with Communication Delays (Extended Abstract).",
                    "Optimal Tree Contraction on the Hypercube and Related Networks.",
                    "Evolution of an Algorithm.",
                    "Mesh Connected Computers with Fixed and Reconfigurable Buses: Packet Routing, Sorting, and Selection.",
                    "An Efficient Parallel Algorithm for the Layered Planar Monotone Circuit Value Problem.",
                    "Randomized Routing on Meshes with Buses.",
                    "On the Distribution of the Transitive Closure in a Random Acyclic Digraph.",
                    "Complexity of Disjoint Paths Problems in Planar Graphs.",
                    "Integer Multicommodity Flows with Reduced Demands.",
                    "A Fully Dynamic Data Structure for Reachability in Planar Digraphs.",
                    "A Linear-Time Algorithm for Edge-Disjoint Paths in Planar Graphs.",
                    "Sequence Comparison and Statistical Significance in Molecular Biology (Abstract).",
                    "Surface Reconstruction Between Simple Polygons via Angle Criteria.",
                    "A Linear Algorithm for Edge-Coloring Partial k-Trees."
                ]
            }
        ]
    }
]