[
    {
        "year": "2021",
        "name": "21st FMCAD 2021",
        "info": "New Haven, CT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2021",
                "sub_name": "Formal Methods in Computer Aided Design, FMCAD 2021, New Haven, CT, USA, October 19-22, 2021.",
                "count": 38,
                "papers": [
                    "From Viewstamped Replication to Blockchains.",
                    "Induction with Recursive Definitions in Superposition.",
                    "Active Automata Learning: from L* to L#.",
                    "Reactive Synthesis Beyond Realizability.",
                    "The FMCAD 2021 Student Forum.",
                    "Formal Methods for the Security Analysis of Smart Contracts.",
                    "Pruning and Slicing Neural Networks using Formal Verification.",
                    "COCOALMA: A Versatile Masking Verifier.",
                    "Stainless Verification System Tutorial.",
                    "Algorithms for the People.",
                    "Engineering with Full-scale Formal Architecture: Morello, CHERI, Armv8-A, and RISC-V.",
                    "End-to-End Formal Verification of a RISC-V Processor Extended with Capability Pointers.",
                    "Hardware Security Leak Detection by Symbolic Simulation.",
                    "Scaling Up Hardware Accelerator Verification using A-QED with Functional Decomposition.",
                    "Sound and Automated Verification of Real-World RTL Multipliers.",
                    "IC3 with Internal Signals.",
                    "Single Clause Assumption without Activation Literals to Speed-up IC3.",
                    "Logical Characterization of Coherent Uninterpreted Programs.",
                    "Data-driven Optimization of Inductive Generalization.",
                    "Model Checking AUTOSAR Components with CBMC.",
                    "Automating System Configuration.",
                    "Towards an Automatic Proof of Lamport's Paxos.",
                    "Refinement-Based Verification of Device-to-Device Information Flow.",
                    "Celestial: A Smart Contracts Verification Framework.",
                    "The Civl Verifier.",
                    "Synthesizing Pareto-Optimal Interpretations for Black-Box Models.",
                    "Dynamic Partial Order Reductions for Spinloops.",
                    "Robustness between Weak Memory Models.",
                    "Towards Scalable Verification of Deep Reinforcement Learning.",
                    "Exploiting Isomorphic Subgraphs in SAT.",
                    "On Decomposition of Maximal Satisfiable Subsets.",
                    "Designing Samplers is Easy: The Boon of Testers.",
                    "SAT-Inspired Eliminations for Superposition.",
                    "SAT Solving in the Serverless Cloud.",
                    "Fair and Adventurous Enumeration of Quantifier Instantiations.",
                    "Mathematical Programming Modulo Strings.",
                    "Lookahead in Partitioning SMT.",
                    "A Multithreaded Vampire with Shared Persistent Grounding."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "20th FMCAD 2020",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2020",
                "sub_name": "2020 Formal Methods in Computer Aided Design, FMCAD 2020, Haifa, Israel, September 21-24, 2020.",
                "count": 34,
                "papers": [
                    "Anytime Algorithms for MaxSAT and Beyond.",
                    "The FMCAD 2020 Student Forum.",
                    "Formal Verification for Natural and Engineered Biological Systems.",
                    "How testable is business software?",
                    "From Correctness to High Quality.",
                    "A Theoretical Framework for Symbolic Quick Error Detection.",
                    "Tutorial on World-Level Model Checking.",
                    "Effective System Level Liveness Verification.",
                    "Accelerating Parallel Verification via Complementary Property Partitioning and Strategy Exploration.",
                    "Runtime Verification on FPGAs with LTLf Specifications.",
                    "Distributed Bounded Model Checking.",
                    "EUFicient Reachability in Software with Arrays.",
                    "Thread-modular Counter Abstraction for Parameterized Program Safety.",
                    "Incremental Verification by SMT-based Summary Repair.",
                    "Reactive Synthesis from Extended Bounded Response LTL Specifications.",
                    "SYSLITE: Syntax-Guided Synthesis of PLTL Formulas from Finite Traces.",
                    "Learning Properties in LTL ∩ ACTL from Positive Examples Only.",
                    "Automating Compositional Analysis of Authentication Protocols.",
                    "Selecting Stable Safe Configurations for Systems Modelled by Neural Networks with ReLU Activation.",
                    "Parallelization Techniques for Verifying Neural Networks.",
                    "Formal Methods with a Touch of Magic.",
                    "Art: Abstraction Refinement-Guided Training for Provably Correct Neural Networks.",
                    "Automating Modular Verification of Secure Information Flow.",
                    "Angelic Checking within Static Driver Verifier: Towards high-precision defects without (modeling) cost.",
                    "Model Checking Software-Defined Networks with Flow Entries that Time Out.",
                    "Using model checking tools to triage the severity of security bugs in the Xen hypervisor.",
                    "Verifying Properties of Bit-vector Multiplication Using Cutting Planes Reasoning.",
                    "On Optimizing a Generic Function in SAT.",
                    "Ternary Propagation-Based Local Search for more Bit-Precise Reasoning.",
                    "Reductions for Strings and Regular Expressions Revisited.",
                    "Switss: Computing Small Witnessing Subsystems.",
                    "Smart Induction for Isabelle/HOL (Tool Paper).",
                    "Trace Logic for Inductive Loop Reasoning.",
                    "The Proof Checkers Pacheck and Pastèque for the Practical Algebraic Calculus."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "19th FMCAD 2019",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2019",
                "sub_name": "2019 Formal Methods in Computer Aided Design, FMCAD 2019, San Jose, CA, USA, October 22-25, 2019.",
                "count": 33,
                "papers": [
                    "Safe and Interactive Autonomy: A Journey Starting from Formal Methods (Keynote).",
                    "An Increasing Need for Formality (Keynote).",
                    "SuSLik: Synthesis of Safe Pointer-Manipulating Programs (Invited Tutorial).",
                    "The FMCAD 2019 Student Forum.",
                    "Challenges and Solutions in Post-Silicon Validation of High-end Processors (Invited Tutorial).",
                    "Integrating SMT with Theorem Proving for Verification of Analog and Mixed-Signal Circuits (Invited Tutorial).",
                    "Boosting Verification Scalability via Structural Grouping and Semantic Partitioning of Properties.",
                    "Input Elimination Transformations for Scalable Verification and Trace Reconstruction.",
                    "Chasing Minimal Inductive Validity Cores in Hardware Model Checking.",
                    "Verifying Large Multipliers by Combining SAT and Computer Algebra.",
                    "Unification-based Pointer Analysis without Oversharing.",
                    "Concurrent Chaining Hash Maps for Software Model Checking.",
                    "Proving Data Race Freedom in Task Parallel Programs Using a Weaker Partial Order.",
                    "BDD-Based Algorithms for Packet Classification.",
                    "TSNSCHED: Automated Schedule Generation for Time Sensitive Networking.",
                    "Verification and Synthesis of Symmetric Uni-Rings for Leads-To Properties.",
                    "Scalable Translation Validation of Unverified Legacy OS Code.",
                    "Kaizen: Building a Performant Blockchain System Verified for Consensus and Integrity.",
                    "KAIROS: Incremental Verification in High-Level Synthesis through Latency-Insensitive Design.",
                    "Verification of Authenticated Firmware Loaders.",
                    "Learning-Based Synthesis of Safety Controllers.",
                    "Shield Synthesis for Real: Enforcing Safety in Cyber-Physical Systems.",
                    "Syntroids: Synthesizing a Game for FPGAs using Temporal Logic Specifications.",
                    "Synthesizing Reactive Systems Using Robustness and Recovery Specifications.",
                    "Property Directed Inference of Relational Invariants.",
                    "Knowledge Compilation for Boolean Functional Synthesis.",
                    "Verifying Relational Properties using Trace Logic.",
                    "Autarkies for DQCNF.",
                    "Localizing Quantifiers for DQBF.",
                    "Anytime Weighted MaxSAT with Improved Polarity Selection and Bit-Vector Optimization.",
                    "GUIDEDSAMPLER: Coverage-guided Sampling of SMT Solutions.",
                    "Extending enumerative function synthesis via SMT-driven classification.",
                    "Proving Non-Termination via Loop Acceleration."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "18th FMCAD 2018",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2018",
                "sub_name": "2018 Formal Methods in Computer Aided Design, FMCAD 2018, Austin, TX, USA, October 30 - November 2, 2018.",
                "count": 29,
                "papers": [
                    "Automata Learning for Symbolic Execution.",
                    "Complete and Efficient DRAT Proof Checking.",
                    "Semantic-based Automated Reasoning for AWS Access Policies using SMT.",
                    "The FMCAD 2018 Graduate Student Forum.",
                    "Trau: SMT solver for string constraints.",
                    "k-FAIR = k-LIVENESS + FAIR Revisiting SAT-based Liveness Algorithms.",
                    "Automatic Synchronization for GPU Kernels.",
                    "Functional Synthesis via Input-Output Separation.",
                    "Analyzing the Fundamental Liveness Property of the Chord Protocol.",
                    "Design-Time Railway Capacity Verification using SAT modulo Discrete Event Simulation.",
                    "Expansion-Based QBF Solving Without Recursion.",
                    "Using Loop Bound Analysis For Invariant Generation.",
                    "Complete Test Sets And Their Approximations.",
                    "Analysis of Relay Interlocking Systems via SMT-based Model Checking of Switched Multi-Domain Kirchhoff Networks.",
                    "Temporal Prophecy for Proving Temporal Properties of Infinite-State Systems.",
                    "Template-Based Verification of Heap-Manipulating Programs.",
                    "Deductive Verification of Distributed Protocols in First-Order Logic.",
                    "Solving Constrained Horn Clauses Using Syntax and Data.",
                    "The ELDARICA Horn Solver.",
                    "CoSA: Integrated Verification for Agile Hardware Design.",
                    "ILA-MCM: Integrating Memory Consistency Models with Instruction-Level Abstractions for Heterogeneous System-on-Chip Verification.",
                    "Learning Linear Temporal Properties.",
                    "Formal Verification of Deep Neural Networks.",
                    "Post-Verification Debugging and Rectification of Finite Field Arithmetic Circuits using Computer Algebra Techniques.",
                    "A Verified Certificate Checker for Finite-Precision Error Bounds in Coq and HOL4.",
                    "Rely-Guarantee Reasoning for Automated Bound Analysis of Lock-Free Algorithms.",
                    "BMC with Memory Models as Modules.",
                    "Certifying Proofs for LTL Model Checking.",
                    "Bit-Vector Interpolation and Quantifier Elimination by Lazy Reduction."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "17th FMCAD 2017",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2017",
                "sub_name": "2017 Formal Methods in Computer Aided Design, FMCAD 2017, Vienna, Austria, October 2-6, 2017.",
                "count": 36,
                "papers": [
                    "How formal analysis and verification add security to blockchain-based systems.",
                    "Symbolic security analysis using the Tamarin prover.",
                    "Coalition, intrigue, ambush, destruction and pride: Herding cats can be challenging.",
                    "Automated formal reasoning about AWS systems.",
                    "Formal methods in industrial dependable systems design - The TTTech example.",
                    "Hardware model checking competition 2017.",
                    "The FMCAD 2017 graduate student forum.",
                    "goSAT: Floating-point satisfiability as global optimization.",
                    "On sound relative error bounds for floating-point arithmetic.",
                    "Column-wise verification of multipliers using computer algebra.",
                    "Efficient generation of all minimal inductive validity cores.",
                    "Duality-based interpolation for quantifier-free equalities and uninterpreted functions.",
                    "Solving linear arithmetic with SAT-based model checking.",
                    "Z3str3: A string solver with theory-aware heuristics.",
                    "Verification of a lazy cache coherence protocol against a weak memory model.",
                    "Safety verification of phaser programs.",
                    "Learning to prove safety over parameterised concurrent systems.",
                    "Lasso detection using partial-state caching.",
                    "Exact quantitative probabilistic model checking through rational search.",
                    "Sampling invariants from frequency distributions.",
                    "Tagged BDDs: Combining reduction rules from different decision diagram types.",
                    "First order temporal logic monitoring with BDDs.",
                    "Factored boolean functional synthesis.",
                    "Property directed reachability with word-level abstraction.",
                    "Learning support sets in IC3 and Quip: The good, the bad, and the ugly.",
                    "K-induction without unrolling.",
                    "Designing parallel PDR.",
                    "FuseIC3: An algorithm for checking large design spaces.",
                    "FAR-Cubicle - A new reachability algorithm for Cubicle.",
                    "Theta: A framework for abstraction refinement-based model checking.",
                    "Modular SMT-based analysis of nonlinear hybrid systems.",
                    "SMT-based analysis of switching multi-domain linear Kirchhoff networks.",
                    "Automatic verification of application-tailored OSEK kernels.",
                    "Estimating worst-case latency of on-chip interconnects with formal simulation.",
                    "Parameterized verification of algorithms for oblivious robots on a ring.",
                    "Automated repair by example for firewalls."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "16th FMCAD 2016",
        "info": "Mountain View, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2016",
                "sub_name": "2016 Formal Methods in Computer-Aided Design, FMCAD 2016, Mountain View, CA, USA, October 3-6, 2016.",
                "count": 34,
                "papers": [
                    "Formal verification for computer security: Lessons learned and future directions.",
                    "Understanding evolution through algorithms.",
                    "Network verification - When Clarke meets Cerf.",
                    "Machine learning and systems for the next frontier in formal verification.",
                    "Verifying hyperproperties of hardware systems.",
                    "A paradigm shift in verification methodology.",
                    "Program synthesis for networks.",
                    "The FMCAD 2016 graduate student forum.",
                    "Soundness of the quasi-synchronous abstraction.",
                    "Synthesizing adaptive test strategies from temporal logic specifications.",
                    "Reducing interpolant circuit size by ad-hoc logic synthesis and SAT-based weakening.",
                    "Extracting behaviour from an executable instruction set model.",
                    "Categorical semantics of digital circuits.",
                    "Equivalence checking by logic relaxation.",
                    "Minimal unsatisfiable core extraction for SMT.",
                    "Efficient uninterpreted function abstraction and refinement for word-level model checking.",
                    "Optimizing horn solvers for network repair.",
                    "On ∃ ∀ ∃! solving: A case study on automated synthesis of magic card tricks.",
                    "Property-directed k-induction.",
                    "Lazy proofs for DPLL(T)-based SMT solvers.",
                    "Verifiable hierarchical protocols with network invariants on parametric systems.",
                    "Modular specification and verification of a cache-coherent interface.",
                    "Proof certificates for SMT-based model checkers for infinite-state systems.",
                    "Routing under constraints.",
                    "A consistency checker for memory subsystem traces.",
                    "Hybrid partial order reduction with under-approximate dynamic points-to and determinacy information.",
                    "Formal verification of division and square root implementations, an Oracle report.",
                    "Integrating proxy theories and numeric model lifting for floating-point arithmetic.",
                    "Trustworthy specifications of ARM® v8-A and v8-M system level architecture.",
                    "Equivalence checking using Gröbner bases.",
                    "Accurate ICP-based floating-point reasoning.",
                    "SWAPPER: A framework for automatic generation of formula simplifiers based on conditional rewrite rules.",
                    "Lazy sequentialization for TSO and PSO via shared memory abstractions.",
                    "Combining requirement mining, software model checking and simulation-based verification for industrial automotive systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15th FMCAD 2015",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2015",
                "sub_name": "Formal Methods in Computer-Aided Design, FMCAD 2015, Austin, Texas, USA, September 27-30, 2015.",
                "count": 29,
                "papers": [
                    "Proving Hybrid Systems.",
                    "Formal Verification of Arithmetic Datapaths using Algebraic Geometry and Symbolic Computation.",
                    "Reactive Synthesis.",
                    "Abductive Inference and Its Applications in Program Analysis, Verification, and Synthesis.",
                    "Democratization of Formal Verification with Collective Intelligence.",
                    "Detecting Hardware Trojans: A Tale of Two Techniques.",
                    "The Genesis and Development of Model Checking: Fact vs. Fiction.",
                    "The FMCAD 2015 Graduate Student Forum.",
                    "Verification of Cache Coherence Protocols wrt. Trace Filters.",
                    "Compositional Reasoning Gotchas in Practice.",
                    "Universal Boolean Functional Vectors.",
                    "Compositional Safety Verification with Max-SMT.",
                    "Formal Verification of Automatic Circuit Transformations for Fault-Tolerance.",
                    "An SMT-based Approach to Fair Termination Analysis.",
                    "Compositional Recurrence Analysis.",
                    "Pushing to the Top.",
                    "Skolem Functions for Factored Formulas.",
                    "Theory-Aided Model Checking of Concurrent Transition Systems.",
                    "Compositional Verification of Procedural Programs using Horn Clauses over Integers and Arrays.",
                    "IC3 Software Model Checking on Control Flow Automata.",
                    "Accelerating Invariant Generation.",
                    "Comparing Different Functional Allocations in Automated Air Traffic Control Design.",
                    "Pattern-based Synthesis of Synchronization for the C++ Memory Model.",
                    "Better Lemmas with Lambda Extraction.",
                    "CAQE: A Certifying QBF Solver.",
                    "Difference Constraints: An adequate Abstraction for Complexity Analysis of Imperative Programs.",
                    "Reverse Engineering with Simulation Graphs.",
                    "Template-based Synthesis of Instruction-Level Abstractions for SoC Verification.",
                    "Transaction Flows and Executable Models: Formalization and Analysis of Message passing Protocols."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14th FMCAD 2014",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2014",
                "sub_name": "Formal Methods in Computer-Aided Design, FMCAD 2014, Lausanne, Switzerland, October 21-24, 2014.",
                "count": 35,
                "papers": [
                    "Challenging problems in industrial formal verification.",
                    "Challenges in bit-precise reasoning.",
                    "Efficient symbolic execution for software testing.",
                    "A tour of CVC4: How it works, and how to use it.",
                    "Compiler verification for fun and profit.",
                    "Computer-aided verification technology for biology.",
                    "The FMCAD 2014 graduate student forum.",
                    "Response property checking via distributed state space exploration.",
                    "Towards Pareto-optimal parameter synthesis for monotonic cost functions.",
                    "SAT-based methods for circuit synthesis.",
                    "Synthesis of synchronization using uninterpreted functions.",
                    "Interpolation with Guided Refinement: Revisiting incrementality in SAT-based unbounded model checking.",
                    "Efficient verification of periodic programs using sequential consistency and snapshots.",
                    "Under-approximate flowpipes for non-linear continuous systems.",
                    "Disproving termination with overapproximation.",
                    "Faster temporal reasoning for infinite-state programs.",
                    "Template-based circuit understanding.",
                    "Simulation and formal verification of x86 machine-code programs that make system calls.",
                    "DRUPing for interpolates.",
                    "Efficient extraction of Skolem functions from QRAT proofs.",
                    "Small inductive safe invariants.",
                    "On interpolants and variable assignments.",
                    "Post-silicon timing diagnosis made simple using formal technology.",
                    "Leveraging linear and mixed integer programming for SMT.",
                    "A program transformation for faster goal-directed search.",
                    "Infinite-state backward exploration of Boolean broadcast programs.",
                    "Kuai: A model checker for software-defined networks.",
                    "ILP Modulo Data.",
                    "Turbo-charging Lemmas on demand with don't care reasoning.",
                    "Reduction for compositional verification of multi-threaded programs.",
                    "Finding conflicting instances of quantified formulas in SMT.",
                    "Using interval constraint propagation for pseudo-Boolean constraint solving.",
                    "Patient-specific models from inter-patient biological models and clinical records.",
                    "Reducing CTL-live model checking to first-order logic validity checking.",
                    "Predicate abstraction for reactive synthesis."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th FMCAD 2013",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2013",
                "sub_name": "Formal Methods in Computer-Aided Design, FMCAD 2013, Portland, OR, USA, October 20-23, 2013.",
                "count": 37,
                "papers": [
                    "Preface.",
                    "Syntax-guided synthesis.",
                    "Tutorial: Practical verification of network programs.",
                    "Firmware validation: challenges and opportunities.",
                    "Secure programs via game-based synthesis.",
                    "Using process modeling and analysis techniques to reduce errors in healthcare.",
                    "Static verification based signoff - A key enabler for managing verification complexity in the modern soc.",
                    "The FMCAD graduate student forum.",
                    "Distributed synthesis for LTL fragments.",
                    "Counter-strategy guided refinement of GR(1) temporal logic specifications.",
                    "Efficient handling of obligation constraints in synthesis from omega-regular specifications.",
                    "On the feasibility of automation for bandwidth allocation problems in data centers.",
                    "Computing prime implicants.",
                    "A circuit approach to LTL model checking.",
                    "Invariants for finite instances and beyond.",
                    "Exploring interpolants.",
                    "Synthesizing multiple boolean functions using interpolation on a single proof.",
                    "Quantifier elimination via clause redundancy.",
                    "Interpolation for synthesis on unbounded domains.",
                    "Relational STE and theorem proving for formal verification of industrial circuit designs.",
                    "Satisfiability modulo ODEs.",
                    "Verifying global convergence for a digital phase-locked loop.",
                    "Formal co-validation of low-level hardware/software interfaces.",
                    "An SMT based method for optimizing arithmetic computations in embedded software code.",
                    "Verifying periodic programs with priority inheritance locks.",
                    "Abstractions for model checking SDN controllers.",
                    "Efficient modular SAT solving for IC3.",
                    "Better generalization in IC3.",
                    "Parameter synthesis with IC3.",
                    "Generalized counterexamples to liveness properties.",
                    "Trimming while checking clausal proofs.",
                    "Simplex with sum of infeasibilities for SMT.",
                    "Efficient MUS extraction with resolution.",
                    "Parameterized model checking of fault-tolerant distributed algorithms by abstraction.",
                    "Verifying multi-threaded software with impact.",
                    "Proving termination of imperative programs using Max-SMT.",
                    "On the concept of variable roles and its use in software analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/fmcad/2013difts",
                "sub_name": "Proceedings of the Second International Workshop on Design and Implementation of Formal Tools and Systems, Portland, OR, USA, October 19, 2013.",
                "count": 6,
                "papers": [
                    "Lemmas on Demand for Lambdas.",
                    "Trading-off Incrementality and Dynamic Restart of Multiple Solvers in IC3.",
                    "LEC: Learning Driven Data-path Equivalence Checking.",
                    "A Fast Reparameterization Procedure.",
                    "Abstraction-Based Livelock/Deadlock Checking for Hardware Verification.",
                    "CHIMP: A Tool for Assertion-Based Dynamic Verification of SystemC Models."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12th FMCAD 2012",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2012",
                "sub_name": "Formal Methods in Computer-Aided Design, FMCAD 2012, Cambridge, UK, October 22-25, 2012.",
                "count": 31,
                "papers": [
                    "Formal methods in cell Biology.",
                    "Answer Set Programming.",
                    "Formal methods for aerospace applications.",
                    "Application of SMT solvers to hybrid system verification.",
                    "Algebra of concurrent design.",
                    "Efficient predictive analysis for detecting nondeterminism in multi-threaded programs.",
                    "Automatic lock insertion in concurrent programs.",
                    "Multi-pushdown systems with budgets.",
                    "Quantifier elimination by Dependency Sequents.",
                    "Preprocessing techniques for first-order clausification.",
                    "A liveness checking algorithm that counts.",
                    "A formal model of a large memory that supports efficient execution.",
                    "Verification with small and short worlds.",
                    "Decompilation into logic - Improved.",
                    "Complete and effective robustness checking by means of interpolation.",
                    "Symbolically synthesizing small circuits.",
                    "Automated debugging of missing input constraints in a formal verification environment.",
                    "Algorithms for software model checking: Predicate abstraction vs. Impact.",
                    "Incremental upgrade checking by means of interpolation-based function summaries.",
                    "Verification of parametric system designs.",
                    "Deciding floating-point logic with systematic abstraction.",
                    "Formal verification of error correcting circuits using computational algebraic geometry.",
                    "Symbolic Trajectory Evaluation: The primary validation Vehicle for next generation Intel® Processor Graphics FPU.",
                    "Enhanced reachability analysis via automated dynamic netlist-based hint generation.",
                    "Oscillator verification with probability one.",
                    "Lazy abstraction and SAT-based reachability in hardware model checking.",
                    "IC3-guided abstraction.",
                    "Formal for everyone - Challenges in achievable multicore design and verification.",
                    "A quantifier-free SMT encoding of non-linear hybrid automata.",
                    "Piecewise linear modeling of nonlinear devices for formal verification of analog circuits.",
                    "Forward and backward: Bounded model checking of linear hybrid automata from two directions."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11th FMCAD 2011",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2011",
                "sub_name": "International Conference on Formal Methods in Computer-Aided Design, FMCAD '11, Austin, TX, USA, October 30 - November 02, 2011.",
                "count": 34,
                "papers": [
                    "Verifying concurrent programs: tutorial talk.",
                    "Self-timing: a step beyond synchrony (tutorial talk).",
                    "IC3: where monolithic and incremental meet.",
                    "Planning for end-to-end formal using simulation-based coverage: invited tutorial.",
                    "Specification based testing with QuickCheck: tutorial talk.",
                    "The role of human creativity in mechanized verification: invited talk.",
                    "Interpolants from Z3 proofs.",
                    "Effective word-level interpolation for software verification.",
                    "Accelerating MUS extraction with recursive model rotation.",
                    "Pseudo-Boolean Solving by incremental translation to SAT.",
                    "Automated specification analysis using an interactive theorem prover.",
                    "Proving and explaining the unfeasibility of message sequence charts for hybrid systems.",
                    "Post-silicon fault localisation using maximum satisfiability and backbones.",
                    "Algebraic approach to arithmetic design verification.",
                    "Time-bounded analysis of real-time systems.",
                    "Timing analysis of interrupt-driven programs under context bounds.",
                    "Automated error localization and correction for imperative programs.",
                    "Optimal redundancy removal without fixedpoint computation.",
                    "Approximate reachability with combined symbolic and ternary simulation.",
                    "Learning conditional abstractions.",
                    "Efficient implementation of property directed reachability.",
                    "Incremental formal verification of hardware.",
                    "An incremental approach to model checking progress properties.",
                    "Hardware model checking: status, challenges, and opportunities.",
                    "Realtime regular expressions for analog and mixed-signal assertions.",
                    "Formal analysis of fractional order systems in HOL.",
                    "Static scheduling of latency insensitive designs with Lucy-n.",
                    "A theory of abstraction for arrays.",
                    "Parameterized verification of deadlock freedom in symmetric cache coherence protocols.",
                    "Scaling probabilistic timing verification of hardware using abstractions in design source code.",
                    "Pervasive formal verification in control system design.",
                    "Hybrid verification of a hardware modular reduction engine.",
                    "Desynchronization: design for verification.",
                    "Hunting deadlocks efficiently in microarchitectural models of communication fabrics."
                ]
            },
            {
                "sub_name_abbr": "conf/fmcad/2011difts",
                "sub_name": "Proceedings of the First International Workshop on Design and Implementation of Formal Tools and Systems, Austin, USA, November 3, 2011.",
                "count": 6,
                "papers": [
                    "Enhancing ABC for stabilization verification of SystemVerilog/VHDL models.",
                    "Data Structure Choices for On-the-Fly Model Checking of Real-Time Systems.",
                    "A Study of Sweeping Algorithms in the Context of Model Checking.",
                    "An Application of Formal Methods to Cognitive Radios.",
                    "On Incremental Satisfiability and Bounded Model Checking.",
                    "metaSMT: Focus on Your Application not on Solver Integration."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10th FMCAD 2010",
        "info": "Lugano, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2010",
                "sub_name": "Proceedings of 10th International Conference on Formal Methods in Computer-Aided Design, FMCAD 2010, Lugano, Switzerland, October 20-23.",
                "count": 39,
                "papers": [
                    "Dimensions in program synthesis.",
                    "Verifying VIA Nano microprocessor components.",
                    "Embedded systems design - Scientific challenges and work directions.",
                    "Formal verification of an ASIC ethernet switch block.",
                    "Formal verification of arbiters using property strengthening and underapproximations.",
                    "SAT-based semiformal verification of hardware.",
                    "DFT logic verification through property based formal methods - SOC to IP.",
                    "SLAM2: Static driver verification with under 4% false alarms.",
                    "Precise static analysis of untrusted driver binaries.",
                    "Verifying SystemC: A software model checking approach.",
                    "Coping with Moore's Law (and more): Supporting arrays in state-of-the-art model checkers.",
                    "CalCS: SMT solving for non-linear convex constraints.",
                    "Integrating ICP and LRA solvers for deciding nonlinear real arithmetic problems.",
                    "A halting algorithm to determine the existence of decoder.",
                    "Synthesis for regular specifications over unbounded domains.",
                    "Automatic inference of memory fences.",
                    "Applying SMT in symbolic execution of microcode.",
                    "Automated formal verification of processors based on architectural models.",
                    "Encoding industrial hardware verification problems into effectively propositional logic.",
                    "Combinational techniques for sequential equivalence checking.",
                    "Automatic verification of estimate functions with polynomials of bounded functions.",
                    "A framework for incremental modelling and verification of on-chip protocols.",
                    "Modular specification and verification of interprocess communication.",
                    "Large-scale application of formal verification: From fiction to fact.",
                    "A single-instance incremental SAT formulation of proof- and counterexample-based abstraction.",
                    "Predicate abstraction with adjustable-block encoding.",
                    "Modular bug detection with inertial refinement.",
                    "Path predicate abstraction by complete interval property checking.",
                    "Relieving capacity limits on FPGA-based SAT-solvers.",
                    "Boosting minimal unsatisfiable core extraction.",
                    "Propelling SAT and SAT-based BMC using careset.",
                    "Efficiently solving quantified bit-vector formulas.",
                    "Boosting multi-core reachability performance with shared hash tables.",
                    "Incremental component-based construction and verification using invariants.",
                    "Verifying shadow page table algorithms.",
                    "Impacting verification closure using formal analysis.",
                    "Scalable and precise program analysis at NEC.",
                    "Achieving earlier verification closure using advanced formal verification.",
                    "PINCETTE - Validating changes and upgrades in networked software."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th FMCAD 2009",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2009",
                "sub_name": "Proceedings of 9th International Conference on Formal Methods in Computer-Aided Design, FMCAD 2009, 15-18 November 2009, Austin, Texas, USA.",
                "count": 30,
                "papers": [
                    "Interpolation-sequence based model checking.",
                    "Structure-aware computation of predicate abstraction.",
                    "Enhanced verification by temporal decomposition.",
                    "Software model checking via large-block encoding.",
                    "Verification of recursive methods on tree-like data structures.",
                    "MCC: A runtime verification tool for MCAPI user applications.",
                    "Generalized, efficient array decision procedures.",
                    "Decision diagrams for linear arithmetic.",
                    "Efficient decision procedure for non-linear arithmetic constraints using CORDIC.",
                    "Mixed abstractions for floating-point arithmetic.",
                    "Safety first: A two-stage algorithm for LTL games.",
                    "Synthesizing robust systems.",
                    "Formal verification of analog designs using MetiTarski.",
                    "Formal verification of correctness and performance of random priority-based arbiters.",
                    "Assume-guarantee validation for STE properties within an SVA environment.",
                    "Data mining based decomposition for assume-guarantee reasoning.",
                    "Scalable conditional equivalence checking: An automated invariant-generation based approach.",
                    "Verifying equivalence of memories using a first order logic theorem prover.",
                    "A compositional theory for post-reboot observational equivalence checking of hardware.",
                    "Scaling VLSI design debugging with interpolation.",
                    "Debugging formal specifications using simple counterstrategies.",
                    "Connecting pre-silicon and post-silicon verification.",
                    "A verified platform for a gate-level electronic control unit.",
                    "Protocol verification using flows: An industrial experience.",
                    "Industrial strength refinement checking.",
                    "Towards a formally verified network-on-chip.",
                    "Hardware/software co-verification of cryptographic algorithms using Cryptol.",
                    "Retiming and resynthesis with sweep are complete for sequential transformation.",
                    "SAT-based synthesis of clock gating functions using 3-valued abstraction.",
                    "Finding heap-bounds for hardware synthesis."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th FMCAD 2008",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2008",
                "sub_name": "Formal Methods in Computer-Aided Design, FMCAD 2008, Portland, Oregon, USA, 17-20 November 2008.",
                "count": 29,
                "papers": [
                    "Invited Tutorial: Considerations in the Design and Verification of Microprocessors for Safety-Critical and Security-Critical Applications.",
                    "Invariant-Strengthened Elimination of Dependent State Elements.",
                    "Optimal Constraint-Preserving Netlist Simplification.",
                    "Recording Synthesis History for Sequential Verification.",
                    "BackSpace: Formal Analysis for Post-Silicon Debug.",
                    "Automatic Formal Verification of Block Cipher Implementations.",
                    "Verifying an Arbiter Circuit.",
                    "Formal Verification of Hardware Support for Advanced Encryption Standard.",
                    "BACH : Bounded ReAchability CHecker for Linear Hybrid Automata.",
                    "Going with the Flow: Parameterized Verification Using Message Flows.",
                    "Automatic Non-Interference Lemmas for Parameterized Model Checking.",
                    "Model Checking Nash Equilibria in MAD Distributed Systems.",
                    "A Theory-Based Decision Heuristic for DPLL(T).",
                    "A Write-Based Solver for SAT Modulo the Theory of Arrays.",
                    "Scaling Up the Formal Verification of Lustre Programs with SMT-Based Techniques.",
                    "Word-Level Sequential Memory Abstraction for Model Checking.",
                    "Combining Predicate and Numeric Abstraction for Software Model Checking.",
                    "A Refinement Approach to Design and Verification of On-Chip Communication Protocols.",
                    "Symbolic Program Analysis Using Term Rewriting and Generalization.",
                    "Machine-Code Verification for Multiple Architectures - An Application of Decompilation into Logic.",
                    "Scheduling Optimisations for SPIN to Minimise Buffer Requirements in Synchronous Data Flow.",
                    "A Temporal Language for SystemC.",
                    "Augmenting a Regular Expression-Based Temporal Logic with Local Variables.",
                    "Beyond Vacuity: Towards the Strongest Passing Formula.",
                    "A Theory of Mutations with Applications to Vacuity, Coverage, and Fault Tolerance.",
                    "Trading-Off SAT Search and Variable Quantifications for Effective Unbounded Model Checking.",
                    "Automatic Generation of Local Repairs for Boolean Programs.",
                    "Consistency Checking of All Different Constraints over Bit-Vectors within a SAT Solver.",
                    "Mechanized Information Flow Analysis through Inductive Assertions."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7th FMCAD 2007",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2007",
                "sub_name": "Formal Methods in Computer-Aided Design, 7th International Conference, FMCAD 2007, Austin, Texas, USA, November 11-14, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "Exploiting Resolution Proofs to Speed Up LTL Vacuity Detection for BMC.",
                    "Improved Design Debugging Using Maximum Satisfiability.",
                    "Industrial Strength SAT-based Alignability Algorithm for Hardware Equivalence Verification.",
                    "Boosting Verification by Automatic Tuning of Decision Procedures.",
                    "Verifying Correctness of Transactional Memories.",
                    "Algorithmic Analysis of Piecewise FIFO Systems.",
                    "Transaction Based Modeling and Verification of Hardware Protocols.",
                    "Automating Hazard Checking in Transaction-Level Microarchitecture Models.",
                    "Computing Predicate Abstractions by Integrating BDDs and SMT Solvers.",
                    "Induction in CEGAR for Detecting Counterexamples.",
                    "Lifting Propositional Interpolants to the Word-Level.",
                    "Global Optimization of Compositional Systems.",
                    "Cross-Entropy Based Testing.",
                    "Automatic Abstraction Refinement for Generalized Symbolic Trajectory Evaluation.",
                    "A Logic for GSTE.",
                    "Automatic Abstraction in Symbolic Trajectory Evaluation.",
                    "A Coverage Analysis for Safety Property Lists.",
                    "What Triggers a Behavior?",
                    "Two-Dimensional Regular Expressions for Compositional Bus Protocols.",
                    "A Quantitative Completeness Analysis for Property-Sets.",
                    "Automated Extraction of Inductive Invariants to Aid Model Checking.",
                    "Checking Safety by Inductive Generalization of Counterexamples to Induction.",
                    "Fast Minimum-Register Retiming via Binary Maximum-Flow.",
                    "Formal Verification of Partial Good Self-Test Fencing Structures.",
                    "Case study: Integrating FV and DV in the Verification of the Intel CoreTM 2 Duo Microprocessor.",
                    "Circuit Level Verification of a High-Speed Toggle.",
                    "Combining Symbolic Simulation and Interval Arithmetic for the Verification of AMS Designs.",
                    "Analyzing Gene Relationships for Down Syndrome with Labeled Transition Graphs.",
                    "A Formal Model of Clock Domain Crossing and Automated Verification of Time-Triggered Hardware.",
                    "Modeling Time-Triggered Protocols and Verifying Their Real-Time Schedules.",
                    "A Mechanized Refinement Framework for Analysis of Custom Memories."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6th FMCAD 2006",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2006",
                "sub_name": "Formal Methods in Computer-Aided Design, 6th International Conference, FMCAD 2006, San Jose, California, USA, November 12-16, 2006, Proceedings.",
                "count": 26,
                "papers": [
                    "Enabling Large-Scale Pervasive Logic Verification through Multi-Algorithmic Formal Reasoning.",
                    "Post-reboot Equivalence and Compositional Verification of Hardware.",
                    "Synchronous Elastic Networks.",
                    "Finite Instantiations for Integer Difference Logic.",
                    "Tracking MUSes and Strict Inconsistent Covers.",
                    "Ario: A Linear Integer Arithmetic Logic Solver.",
                    "Understanding the Dynamic Behavior of Modern DPLL SAT Solvers through Visual Analysis.",
                    "Over-Approximating Boolean Programs with Unbounded Thread Creation.",
                    "An Improved Distance Heuristic Function for Directed Software Model Checking.",
                    "Liveness and Boundedness of Synchronous Data Flow Graphs.",
                    "Model Checking Data-Dependent Real-Time Properties of the European Train Control System.",
                    "Reducing Verification Complexity of a Multicore Coherence Protocol Using Assume/Guarantee.",
                    "Advanced Unbounded Model Checking Based on AIGs, BDD Sweeping, And Quantifier Scheduling.",
                    "Symmetry Reduction for STE Model Checking.",
                    "Thorough Checking Revisited.",
                    "Optimizations for LTL Synthesis.",
                    "From PSL to NBA: a Modular Symbolic Encoding.",
                    "Assume-Guarantee Reasoning for Deadlock.",
                    "A Refinement Method for Validity Checking of Quantified First-Order Formulas in Hardware Verification.",
                    "An Integration of HOL and ACL2.",
                    "ACL2SIX: A Hint used to Integrate a Theorem Prover and an Automated Verification Tool.",
                    "Automatic Generation of Schedulings for Improving the Test Coverage of Systems-on-a-Chip.",
                    "Simulation Bounds for Equivalence Verification of Arithmetic Datapaths with Finite Word-Length Operands.",
                    "Design for Verification of the PCI-X Bus.",
                    "Formal Analysis and Verification of an OFDM Modem Design using HOL.",
                    "A Formal Model of Lower System Layers."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "5th FMCAD 2004",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2004",
                "sub_name": "Formal Methods in Computer-Aided Design, 5th International Conference, FMCAD 2004, Austin, Texas, USA, November 15-17, 2004, Proceedings.",
                "count": 30,
                "papers": [
                    "Challenges in System-Level Design.",
                    "Generating Fast Multipliers Using Clever Circuits.",
                    "Verification of Analog and Mixed-Signal Circuits Using Hybrid System Techniques.",
                    "A Methodology for the Formal Verification of FFT Algorithms in HOL.",
                    "A Functional Approach to the Formal Specification of Networks on Chip.",
                    "Proof Styles in Operational Semantics.",
                    "Integrating Reasoning About Ordinal Arithmetic into ACL2.",
                    "Combining Equivalence Verification and Completion Functions.",
                    "Synchronization-at-Retirement for Pipeline Verification.",
                    "Late Design Changes (ECOs) for Sequentially Optimized Esterel Designs.",
                    "Non-miter-based Combinational Equivalence Checking by Comparing BDDs with Different Variable Orders.",
                    "Scalable Automated Verification via Expert-System Guided Transformations.",
                    "Simple Yet Efficient Improvements of SAT Based Bounded Model Checking.",
                    "Simple Bounded LTL Model Checking.",
                    "QuBE++: An Efficient QBF Solver.",
                    "Bounded Probabilistic Model Checking with the Muralpha Verifier.",
                    "Increasing the Robustness of Bounded Model Checking by Computing Lower Bounds on the Reachable States.",
                    "Bounded Verification of Past LTL.",
                    "A Hybrid of Counterexample-Based and Proof-Based Abstraction.",
                    "Memory Efficient All-Solutions SAT Solver and Its Application for Reachability Analysis.",
                    "Approximate Symbolic Model Checking for Incomplete Designs.",
                    "Extending Extended Vacuity.",
                    "Parameterized Vacuity.",
                    "An Operational Semantics for Weak PSL.",
                    "Accepting Predecessors Are Better than Back Edges in Distributed LTL Model-Checking.",
                    "Bloom Filters in Probabilistic Verification.",
                    "A Simple Method for Parameterized Verification of Cache Coherence Protocols.",
                    "A Partitioning Methodology for BDD-Based Verification.",
                    "Invariant Checking Combining Forward and Backward Traversal.",
                    "Variable Reuse for Efficient Image Computation."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4th FMCAD 2002",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2002",
                "sub_name": "Formal Methods in Computer-Aided Design, 4th International Conference, FMCAD 2002, Portland, OR, USA, November 6-8, 2002, Proceedings.",
                "count": 23,
                "papers": [
                    "Abstraction by Symbolic Indexing Transformations.",
                    "Counter-Example Based Predicate Discovery in Predicate Abstraction.",
                    "Automated Abstraction Refinement for Model Checking Large State Spaces Using SAT Based Conflict Analysis.",
                    "Simplifying Circuits for Formal Verification Using Parametric Representation.",
                    "Generalized Symbolic Trajectory Evaluation - Abstraction in Action.",
                    "Analysis of Symbolic SCC Hull Algorithms.",
                    "Sharp Disjunctive Decomposition for Language Emptiness Checking.",
                    "Relating Multi-step and Single-Step Microprocessor Correctness Statements.",
                    "Modeling and Verification of Out-of-Order Microprocessors in UCLID.",
                    "On Solving Presburger and Linear Arithmetic with SAT.",
                    "Deciding Presburger Arithmetic by Model Checking and Comparisons with Other Methods.",
                    "QUBOS: Deciding Quantified Boolean Logic Using Propositional Satisfiability Solvers.",
                    "Exploiting Transition Locality in the Disk Based Mur phi Verifier.",
                    "Traversal Techniques for Concurrent Systems.",
                    "A Fixpoint Based Encoding for Bounded Model Checking.",
                    "Using Edge-Valued Decision Diagrams for Symbolic Generation of Shortest Paths.",
                    "Mechanical Verification of a Square Root Algorithm Using Taylor's Theorem.",
                    "A Specification and Verification Framework for Developing Weak Shared Memory Consistency Protocols.",
                    "Model Checking the Design of an Unrestricted, Stuck-at Fault Tolerant, Asynchronous Sequential Circuit Using SMV.",
                    "Functional Design Using Behavioural and Structural Components.",
                    "Compiling Hardware Descriptions with Relative Placement Information for Parametrised Libraries.",
                    "Input/Output Compatibility of Reactive Systems.",
                    "Smart Play-out of Behavioral Requirements."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd FMCAD 2000",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/2000",
                "sub_name": "Formal Methods in Computer-Aided Design, Third International Conference, FMCAD 2000, Austin, Texas, USA, November 1-3, 2000, Proceedings.",
                "count": 32,
                "papers": [
                    "Trends in Computing.",
                    "A Case Study in Fomal Verification of Register-Transfer Logic with ACL2: The Floating Point Adder of the AMD AthlonTM Processor.",
                    "An Algorithm for Strongly Connected Component Analysis in n log n Symbolic Steps.",
                    "Automated Refinement Checking for Asynchronous Processes.",
                    "Border-Block Triangular Form and Conjunction Schedule in Image Computation.",
                    "B2M: A Semantic Based Tool for BLIF Hardware Descriptions.",
                    "Checking Safety Properties Using Induction and a SAT-Solver.",
                    "Combining Stream-Based and State-Based Verification Techniques.",
                    "A Comparative Study of Symbolic Algorithms for the Computation of Fair Cycles.",
                    "Correctness of Pipelined Machines.",
                    "Do You Trust Your Model Checker?",
                    "Executable Protocol Specification in ESL.",
                    "Formal Verification of Floating Point Trigonometric Functions.",
                    "Hardware Modeling Using Function Encapsulation.",
                    "A Methodology for the Formal Analysis of Asynchronous Micropipelines.",
                    "A Methodology for Large-Scale Hardware Verification.",
                    "Model Checking Synchronous Timing Diagrams.",
                    "Model Reductions and a Case Study.",
                    "Modeling and Parameters Synthesis for an Air Traffic Management System.",
                    "Monitor-Based Formal Specification of PCI.",
                    "SAT-Based Image Computation with Application in Reachability Analysis.",
                    "SAT-Based Verification without State Space Traversal.",
                    "Scalable Distributed On-the-Fly Symbolic Model Checking.",
                    "The Semantics of Verilog Using Transition System Combinators.",
                    "Sequential Equivalence Checking by Symbolic Simulation.",
                    "Speeding Up Image Computation by Using RTL Information.",
                    "Symbolic Checking of Signal-Transition Consistency for Verifying High-Level Designs.",
                    "Symbolic Simulation with Approximate Values.",
                    "A Theory of Consistency for Modular Synchronous Systems.",
                    "Verifying Transaction Ordering Properties in Unbounded Bus Networks through Combined Deductive/Algorithmic Methods.",
                    "Visualizing System Factorizations with Behavior Tables.",
                    "Applications of Hierarchical Verification in Model Checking."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "2nd FMCAD 1998",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/1998",
                "sub_name": "Formal Methods in Computer-Aided Design, Second International Conference, FMCAD '98, Palo Alto, California, USA, November 4-6, 1998, Proceedings.",
                "count": 34,
                "papers": [
                    "Minimalist Proof Assistants: Interactions of Technology and Methodology in Formal System Level Verification (abstract).",
                    "Reducing Manual Abstraction in Formal Verification of Out-of-Order Execution.",
                    "Bit-Level Abstraction in the Verfication of Pipelined Microprocessors by Correspondence Checking.",
                    "Solving Bit-Vector Equations.",
                    "The Formal Design of 1M-gate ASICs.",
                    "Design of Experiments for Evaluation of BDD Packages Using Controlled Circuit Mutations.",
                    "A Tutorial on Stålmarcks's Proof Procedure for Propositional Logic.",
                    "Almana: A BDD Minimization Tool Integrating Heuristic and Rewriting Methods.",
                    "Bisimulation Minimization in an Automata-Theoretic Verification Framework.",
                    "Automatic Verification of Mixed-Level Logic Circuits.",
                    "Maximum Time Separation of Events in Cyclic Systems with Linear and Latest Timing Constraints.",
                    "Using MTBDDs for Compostion and Model Checking of Real-Time Systems.",
                    "Formal Methods in CAD from an Industrial Perspective (abstract).",
                    "A Methodology for Automated Verification of Synthesized RTL Designs and Its Integration with a High-Level Synthesis Tool.",
                    "Combined Formal Post- and Presynthesis Verification in High Level Synthesis.",
                    "Formalization and Proof of a Solution to the PCI 2.1 Bus Transaction Ordering Problem.",
                    "A Performance Study of BDD-Based Model Checking.",
                    "Symbolic Model Checking Visualization.",
                    "Input Elimination and Abstraction in Model Checking.",
                    "Symbolic Simulation of the JEM1 Microprocessor.",
                    "Symbolic Simulation: An ACL2 Approach.",
                    "Verification of Data-Insensitive CIrcuits: An In-Order-Retirement Case Study.",
                    "Combining Symbolic Model Checking with Uninterpreted Functions for Out-of-Order Processor Verification.",
                    "Formally Verifying Data and Control with Weak Reachability Invariants.",
                    "Generalized Reversible Rules.",
                    "An Assume-Guarantee Rule for Checking Simulation.",
                    "Three Approaches to Hardware Verification: HOL, MDG and VIS Compared.",
                    "An Instruction Set Process Calculus.",
                    "Techniques for Implicit State Enumeration of EFSMs.",
                    "Model Checking on Product Structures.",
                    "BDDNOW: A Parallel BDD Package.",
                    "Model Checking VHDL with CV.",
                    "Alexandria: A Tool for Hierarchical Verification.",
                    "PV: An Explicit Enumeration Model-Checker."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "1st FMCAD 1996",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/fmcad/1996",
                "sub_name": "Formal Methods in Computer-Aided Design, First International Conference, FMCAD '96, Palo Alto, California, USA, November 6-8, 1996, Proceedings.",
                "count": 32,
                "papers": [
                    "The Need for Formal Methods for Integrated Circuit Design.",
                    "Verification of All Circuits in a Floating-Point Unit Using Word-Level Model Checking.",
                    "BMDs Can Delay the Use of Theorem Proving for Verifying Arithmetic Assembly Instructions.",
                    "Modular Verification of Multipliers.",
                    "Verification of IEEE Compliant Subtractive Division Algorithms.",
                    "Hierarchical Verification of Two-Dimensional High-Speed Multiplication in PVS: A Case Study.",
                    "Experiments in Automating Hardware Verification Using Inductive Proof Planning.",
                    "Verifying Nondeterministic Implementations of Deterministic Systems.",
                    "A Methodology for Processor Implementation Verification.",
                    "Coverage-Directed Test Generation Using Symbolic Techniques.",
                    "Self-Consistency Checking.",
                    "Inverting the Abstraction Mapping: A Methodology for Hardware Verification.",
                    "Validity Checking for Combinations of Theories with Equality.",
                    "A Unified Approach for Combining Different Formalisms for Hardware Verification.",
                    "Verification Using Uninterpreted Functions and Finite Instantiations.",
                    "Formal Verification of the Island Tunnel Controller Using Multiway Decision Graphs.",
                    "VIS.",
                    "PVS: Combining Specification, Proof Checking, and Model Checking.",
                    "HOL Light: A Tutorial Introduction.",
                    "A Tutorial on Digital Design Derivation Using DRS.",
                    "ACL2 Theorems About Commercial Microprocessors.",
                    "Formal Synthesis in Circuit Design - A Classification and Survey.",
                    "Formal Specification and Verification of VHDL.",
                    "Specification of Control Flow Properties for Verification of Synthesized VHDL Designs.",
                    "An Algebraic Model of Correctness for Superscalar Microprocessors.",
                    "Mechanically Checking a Lemma Used in an Automatic Verification Tool.",
                    "Automatic Generation of Invariants in Processor Verification.",
                    "A Brief Study of BDD Package Performance.",
                    "Local Encoding Transformations for Optimizing OBDD-Representations of Finite State Machines.",
                    "Decomposition Techniques for Efficient ROBDD Construction.",
                    "BDDs vs. Zero-Suppressed BDDs: for CTL Symbolic Model Checking of Petri Nets.",
                    "HDL-Based Integration of Formal Methods and CAD Tools in the PREVAIL Environment."
                ]
            }
        ]
    }
]