[
    {
        "name": "FMSD",
        "year": "2021",
        "info": "2021: Volumes\n57",
        "count": 19,
        "papers": [
            "Preface of the special issue on the conference on computer-aided verification 2018.",
            "Quasi-optimal partial order reduction.",
            "Model checking boot code from AWS data centers.",
            "Boolean functional synthesis: hardness and practical algorithms.",
            "On solving quantified bit-vector constraints using invertibility conditions.",
            "2018 CAV award.",
            "Preface of the special issue on the conference on formal methods in computer aided design 2018.",
            "Interpolating bit-vector formulas using uninterpreted predicates and Presburger arithmetic.",
            "Two SAT solvers for solving quantified Boolean formulas with an arbitrary number of quantifier alternations.",
            "Certifying proofs for SAT-based model checking.",
            "SAT modulo discrete event simulation applied to railway design capacity analysis.",
            "Temporal prophecy for proving temporal properties of infinite-state systems.",
            "Rely-guarantee bound analysis of parameterized concurrent shared-memory programs.",
            "Preface of the special issue on the Conference on Formal Methods in Computer-Aided Design 2017.",
            "Towards efficient verification of population protocols.",
            "A relational shape abstract domain.",
            "Faster algorithms for quantitative verification in bounded treewidth graphs.",
            "Automatic proofs of memory deallocation for a Whiley-to-C Compiler.",
            "Vacuity in synthesis."
        ]
    },
    {
        "name": "FMSD",
        "year": "2020",
        "info": "2020: Volumes\n56",
        "count": 6,
        "papers": [
            "First-order temporal logic monitoring with BDDs.",
            "Incremental column-wise verification of arithmetic circuits using computer algebra.",
            "Parameterized verification of algorithms for oblivious robots on a ring.",
            "Exact quantitative probabilistic model checking through rational search.",
            "Automated repair by example for firewalls.",
            "Learning inductive invariants by sampling from frequency distributions."
        ]
    },
    {
        "name": "FMSD",
        "year": "2019",
        "info": "2019: Volumes\n54,\n55",
        "count": 22,
        "papers": [
            "Foreword to the special issue on the 2017 Static Analysis Symposium.",
            "Abstract semantic diffing of evolving concurrent programs.",
            "Template polyhedra and bilinear optimization.",
            "Quantitative static analysis of communication protocols using abstract Markov chains.",
            "A new abstraction framework for affine transformers.",
            "Statistical verification of PCTL using antithetic and stratified samples.",
            "SAT-based explicit LTL reasoning and its application to satisfiability checking.",
            "Some complexity results for stateful network verification.",
            "Incrementally closing octagons.",
            "A survey of challenges for runtime verification from advanced application domains (beyond software).",
            "Monitoring hyperproperties.",
            "TeLEx: learning signal temporal logic from positive examples using tightness metric.",
            "Annotation guided collection of context-sensitive parallel execution profiles.",
            "Probabilistic black-box reachability checking (extended version).",
            "Almost event-rate independent monitoring.",
            "Alloy*: a general-purpose higher-order relational constraint solver.",
            "Exploiting partial variable assignment in interpolation-based model checking.",
            "Correction to: A survey of challenges for runtime verification from advanced application domains (beyond software).",
            "Refutation-based synthesis in SMT.",
            "Synthesizing adaptive test strategies from temporal logic specifications.",
            "Abstraction refinement and antichains for trace inclusion of infinite state systems.",
            "Multi-scale verification of distributed synchronisation."
        ]
    },
    {
        "name": "FMSD",
        "year": "2018",
        "info": "2018: Volumes\n52,\n53",
        "count": 28,
        "papers": [
            "Efficient verification of railway infrastructure designs against standard regulations.",
            "Theory and methodology of assumption/commitment based system interface specification and architectural contracts.",
            "Tightening the contract refinements of a system architecture.",
            "On relative and probabilistic finite counterability.",
            "Conditions of contracts for separating responsibilities in heterogeneous systems.",
            "Solving parity games via priority promotion.",
            "Special issue: program equivalence.",
            "Automating regression verification of pointer programs by predicate abstraction.",
            "Automated verification of automata communicating via FIFO and bag buffers.",
            "Algorithmic games for full ground references.",
            "Introduction to the special issue on runtime verification.",
            "On the complexity of monitoring Orchids signatures, and recurrence equations.",
            "Wireless protocol validation under uncertainty.",
            "Inferring event stream abstractions.",
            "Quantitative monitoring of STL with edit distance.",
            "Non-intrusive runtime monitoring through power consumption to enforce safety and security properties in embedded systems.",
            "Finite-trace linear temporal logic: coinductive completeness.",
            "Foreword.",
            "Securing a compiler transformation.",
            "Learning analysis strategies for octagon and context sensitivity from labeled data generated by static analyses.",
            "Inferring functional properties of matrix manipulating programs by abstract interpretation.",
            "Abstracting Nash equilibria of supermodular games.",
            "Validating numerical semidefinite programming solvers for polynomial invariants.",
            "Enforcing termination of interprocedural analysis.",
            "Realizability of concurrent recursive programs.",
            "An improved algorithm for the control synthesis of nonlinear sampled switched systems.",
            "Improving the results of program analysis by abstract interpretation beyond the decreasing sequence.",
            "Compact and efficiently verifiable models for concurrent systems."
        ]
    },
    {
        "name": "FMSD",
        "year": "2017",
        "info": "2017: Volumes\n50,\n51",
        "count": 33,
        "papers": [
            "Reachability computation for polynomial dynamical systems.",
            "SAT solver management strategies in IC3: an experimental approach.",
            "An empirical study of adaptive concretization for parallel program synthesis.",
            "From non-preemptive to preemptive scheduling using synchronization synthesis.",
            "Model checking parameterized asynchronous shared-memory systems.",
            "Quantifying conformance using the Skorokhod metric.",
            "Percentile queries in multi-dimensional Markov decision processes.",
            "Z3str2: an efficient solver for strings, regular expressions, and length constraints.",
            "Empirical software metrics for benchmarking of verification tools.",
            "Symbolic trajectory evaluation for word-level verification: theory and implementation.",
            "Introduction to the special issue on runtime verification.",
            "Robust online monitoring of signal temporal logic.",
            "R2U2: monitoring and diagnosis of security threats for unmanned aerial systems.",
            "Collision avoidance for mobile robots with limited sensing and limited information about moving obstacles.",
            "Monitorability for the Hennessy-Milner logic with recursion.",
            "Formal analysis and offline monitoring of electronic exams.",
            "Predictive runtime enforcement.",
            "Verifying data- and control-oriented properties combining static and runtime verification: theory and tools.",
            "Preface of the Special Issue in Memoriam Helmut Veith.",
            "Para2: parameterized path reduction, acceleration, and SMT for reachability in threshold-guarded distributed algorithms.",
            "On compiling Boolean circuits optimized for secure multi-party computation.",
            "Shield synthesis.",
            "Program synthesis for interactive-security systems.",
            "A methodology to take credit for high-level verification during RTL verification.",
            "Keeping logic in the trivium of computer science: a teaching perspective.",
            "Preface to special issue on satisfiability modulo theories.",
            "New techniques for linear arithmetic: cubes and equalities.",
            "raSAT: an SMT solver for polynomial constraints.",
            "Solving quantified linear arithmetic by counterexample-guided instantiation.",
            "NP-completeness of small conflict set generation for congruence closure.",
            "Cardinality constraints for arrays (decidability results and applications).",
            "Compositional entailment checking for a fragment of separation logic.",
            "Propagation based local search for bit-precise reasoning."
        ]
    },
    {
        "name": "FMSD",
        "year": "2016",
        "info": "2016: Volumes\n48,\n49",
        "count": 18,
        "papers": [
            "Causality problem in real-time calculus.",
            "Decentralised LTL monitoring.",
            "Synthesis of large dynamic concurrent programs from dynamic specifications.",
            "2014 CAV award announcement.",
            "The spirit of ghost code.",
            "SMT-based model checking for recursive programs.",
            "An efficient SMT solver for string constraints.",
            "From invariant checking to invariant inference using randomized search.",
            "A search-based procedure for nonlinear real arithmetic.",
            "Efficient GPU algorithms for parallel decomposition of graphs into strongly connected and maximal end components.",
            "Abstraction and mining of traces to explain concurrency bugs.",
            "ModelPlex: verified runtime validation of verified cyber-physical system models.",
            "Scalable offline monitoring of temporal specifications.",
            "Organising LTL monitors over distributed systems with a global clock.",
            "Model checking mobile ad hoc networks.",
            "Infinite-state invariant checking with IC3 and predicate abstraction.",
            "From LTL to deterministic automata - A safraless compositional approach.",
            "A layered algorithm for quantifier elimination from linear modular constraints."
        ]
    },
    {
        "name": "FMSD",
        "year": "2015",
        "info": "2015: Volumes\n46,\n47",
        "count": 23,
        "papers": [
            "Generating models of infinite-state communication protocols using regular inference with abstraction.",
            "A game approach to determinize timed automata.",
            "Vacuity in practice: temporal antecedent failure.",
            "Hybrid automata-based CEGAR for rectangular hybrid systems.",
            "Optimization techniques for craig interpolant compaction in unbounded model checking.",
            "Practical policy iterations - A practical use of policy iterations for static analysis: the quadratic case.",
            "Practical interruptible conversations: distributed dynamic verification with multiparty session types and Python.",
            "Synthesising correct concurrent runtime monitors.",
            "Monitoring of temporal first-order properties with aggregations.",
            "The ins and outs of first-order runtime verification.",
            "Runtime verification with minimal intrusion through parallelism.",
            "On recursion-free Horn clauses and Craig interpolation.",
            "Program repair without regret.",
            "Efficient generation of small interpolants in CNF.",
            "Under-approximating loops in C programs for fast counterexample detection.",
            "Extended symbolic finite automata and transducers.",
            "Quantified data automata for linear data structures: a register automaton model with applications to learning invariants of programs manipulating arrays and lists.",
            "Juggrnaut: using graph grammars for abstracting unbounded heap structures.",
            "Proving mutual termination.",
            "CEGAR for compositional analysis of qualitative properties in Markov decision processes.",
            "Evaluation of anonymity and confidentiality protocols using theorem proving.",
            "Regression verification for multi-threaded programs (with extensions to locks and dynamic thread creation).",
            "A zonotopic framework for functional abstractions."
        ]
    },
    {
        "name": "FMSD",
        "year": "2014",
        "info": "2014: Volumes\n44,\n45",
        "count": 23,
        "papers": [
            "QoS-aware management of monotonic service orchestrations.",
            "Automata-based symbolic string analysis for vulnerability detection.",
            "Safety verification of non-linear hybrid systems is quasi-decidable.",
            "Some notes on the abstraction operation for multi-terminal binary decision diagrams.",
            "Numerical invariants through convex relaxation and max-strategy iteration.",
            "An abstraction-refinement framework for trigger querying.",
            "Model checking approach to automated planning.",
            "Runtime verification of embedded real-time systems.",
            "A modal characterization of alternating approximate bisimilarity.",
            "Hardness and inapproximability of minimizing adaptive distinguishing sequences.",
            "Resolution proof transformation for compression and interpolation.",
            "SAT-LP-IIS joint-directed path-oriented bounded reachability analysis of linear hybrid automata.",
            "An extension of lazy abstraction with interpolation for programs with arrays.",
            "Quantifier elimination by dependency sequents.",
            "Scalable reachability analysis via automated dynamic netlist-based hint generation.",
            "Quantifier-free encoding of invariants for hybrid systems.",
            "Verification of Galois field based circuits by formal reasoning based on computational algebraic geometry.",
            "Deciding floating-point logic with abstract conflict driven clause learning.",
            "Verifying global start-up for a Möbius ring-oscillator.",
            "Budget-bounded model-checking pushdown systems.",
            "Finite controlled invariants for sampled switched systems.",
            "On regions and zones for event-clock automata.",
            "Runtime enforcement of timed properties revisited."
        ]
    },
    {
        "name": "FMSD",
        "year": "2013",
        "info": "2013: Volumes\n42,\n43",
        "count": 32,
        "papers": [
            "Preface to the special issue \"SI: Satisfiability Modulo Theories\".",
            "Efficiently solving quantified bit-vector formulas.",
            "Symbolic backward reachability with effectively propositional logic - Applications to security policy analysis.",
            "SMT-based scenario verification for hybrid systems.",
            "Being careful about theory combination.",
            "SMT proof checking using a logical framework.",
            "An extension of the inverse method to probabilistic timed automata.",
            "Code aware resource management.",
            "An approximation algorithm for box abstraction of transition systems on real state spaces.",
            "Weighted modal transition systems.",
            "Loop summarization using state and transition invariants.",
            "Event clock message passing automata: a logical characterization and an emptiness checking algorithm.",
            "Symbolic algorithms for qualitative analysis of Markov decision processes with Büchi objectives.",
            "Modeling and visualizing object-oriented programs with Codecharts.",
            "Time-triggered runtime verification.",
            "Automatic verification of competitive stochastic systems.",
            "Ranking function synthesis for bit-vector relations.",
            "Preface to the special issue on Probabilistic Model Checking.",
            "Analyzing probabilistic pushdown automata.",
            "Model checking for probabilistic timed automata.",
            "A compositional modelling and analysis framework for stochastic hybrid systems.",
            "Computable fixpoints in well-structured symbolic model checking.",
            "A survey of partial-observation stochastic parity games.",
            "Algorithmic probabilistic game semantics - Playing games with automata.",
            "On-the-fly verification and optimization of DTA-properties for large Markov chains.",
            "Bayesian statistical model checking with application to Stateflow/Simulink verification.",
            "Composition of password-based protocols.",
            "Applying string-rewriting to sequence-based specification.",
            "Verification and enforcement of access control policies.",
            "Symbolic unfolding of parametric stopwatch Petri nets.",
            "Modelling temporal behaviour in complex systems with Timebands.",
            "Beyond vacuity: towards the strongest passing formula."
        ]
    },
    {
        "name": "FMSD",
        "year": "2012",
        "info": "2012: Volumes\n40,\n41",
        "count": 31,
        "papers": [
            "Transparent partial order reduction.",
            "Explaining counterexamples using causality.",
            "Interrupt Timed Automata: verification and expressiveness.",
            "Synthesis of opaque systems with static and dynamic masks.",
            "2010 CAV award announcement.",
            "Preface.",
            "Efficient emptiness check for timed Büchi automata.",
            "Automatic generation of inductive invariants from high-level microarchitectural models of communication fabrics.",
            "Fences in weak memory models (extended version).",
            "Bounded underapproximations.",
            "Symbolic bounded synthesis.",
            "Achieving distributed control through model checking.",
            "Constructive Boolean circuits and the exactness of timed ternary simulation.",
            "A concurrency-preserving translation from time Petri nets to networks of timed automata.",
            "Bisimulation and simulation algorithms on probabilistic transition systems by abstract interpretation.",
            "2011 CAV award announcement.",
            "Preface.",
            "A divide-and-conquer approach for analysing overlaid data structures.",
            "Counterexample-guided abstraction refinement for symmetric concurrent programs.",
            "Unified QBF certification and its applications.",
            "Temporal property verification as a program analysis task - Extended Version.",
            "Forest automata for verification of heap manipulation.",
            "Recognizing malicious software behaviors with tree automata inference.",
            "Deadlock-freedom in component systems with architectural constraints.",
            "A formal hierarchy of weak memory models.",
            "Probabilistic contracts for component-based design.",
            "Introduction to the special issue on runtime verification.",
            "Optimized temporal monitors for SystemC.",
            "Safer asynchronous runtime monitoring using compensations.",
            "InterAspect: aspect-oriented instrumentation with GCC.",
            "Efficient data race detection for async-finish parallelism."
        ]
    },
    {
        "name": "FMSD",
        "year": "2011",
        "info": "2011: Volumes\n38,\n39",
        "count": 22,
        "papers": [
            "Probabilistic contracts: a compositional reasoning methodology for the design of systems with stochastic and/or non-deterministic aspects.",
            "Certifying compilers using higher-order theorem provers as certificate checkers.",
            "Bisimulation conversion and verification procedure for goal-based control systems.",
            "Faster algorithms for mean-payoff games.",
            "A WSDL-based type system for asynchronous WS-BPEL processes.",
            "Programs with lists are counter automata.",
            "MSO logics for weighted timed automata.",
            "Runtime enforcement monitors: composition, synthesis, and enforcement abilities.",
            "Conjugate symmetry.",
            "On the refinement of liveness properties of distributed systems.",
            "Verification of continuous dynamical systems by timed automata.",
            "Automatic analysis of DMA races using model checking and k-induction.",
            "Preface.",
            "Exploring structural symmetry automatically in symbolic trajectory evaluation.",
            "Specification and encoding of transaction interaction properties.",
            "Feasibility analysis for robustness quantification by symbolic model checking.",
            "Incremental preprocessing methods for use in BMC.",
            "Benchmarking a model checker for algorithmic improvements and tuning for performance.",
            "Priority scheduling of distributed systems based on model checking.",
            "Cuts from proofs: a complete and practical technique for solving linear inequalities over integers.",
            "Antichains and compositional algorithms for LTL synthesis.",
            "Verification of STM on relaxed memory models."
        ]
    },
    {
        "name": "FMSD",
        "year": "2010",
        "info": "2010: Volumes\n36,\n37",
        "count": 20,
        "papers": [
            "Performability assessment by model checking of Markov reward models.",
            "Efficient methods for formally verifying safety properties of hierarchical cache coherence protocols.",
            "Pushdown module checking.",
            "On simulation-based probabilistic model checking of mixed-analog circuits.",
            "Analog property checkers: a DDR2 case study.",
            "Advanced methods for equivalence checking of analog circuits with strong nonlinearities.",
            "Simple concurrent garbage collection almost without synchronization.",
            "Causal semantics for the algebra of connectors.",
            "2009 CAV award announcement.",
            "Partially-shared zero-suppressed multi-terminal BDDs: concept, algorithms and applications.",
            "Context-aware counter abstraction.",
            "A game-based abstraction-refinement framework for Markov decision processes.",
            "Theorem prover approach to semistructured data design.",
            "MAVEN: modular aspect verification and interference analysis.",
            "Special issue: 2nd World Congress on Formal Methods.",
            "Pointfree expression and calculation: from quantification to temporal logic.",
            "Reasoning about memory layouts.",
            "Doomed program points.",
            "Scenario-based verification of real-time systems using Uppaal.",
            "Model-based construction and verification of critical systems using composition and partial refinement."
        ]
    },
    {
        "name": "FMSD",
        "year": "2009",
        "info": "2009: Volumes\n34,\n35",
        "count": 28,
        "papers": [
            "Safely composing security protocols.",
            "Before and after vacuity.",
            "Timed verification of the generic architecture of a memory circuit using parametric timed automata.",
            "From liveness to promptness.",
            "Local proofs for global safety properties.",
            "Approximated parameterized verification of infinite-state processes with global conditions.",
            "Hybrid systems: from verification to falsification by combining motion planning and discrete search.",
            "Coverage-guided test generation for continuous and hybrid systems.",
            "Distributed synthesis for well-connected architectures.",
            "Conformance testing for real-time systems.",
            "Preface.",
            "The CAV award.",
            "The 2008 CAV Award citation.",
            "Efficient Craig interpolation for linear Diophantine (dis)equations and linear modular equations.",
            "Functional verification of power gated designs by compositional reasoning.",
            "Word level bitwidth reduction for unbounded hardware model checking.",
            "Reducing concurrent analysis under a context bound to sequential analysis.",
            "Computing differential invariants of hybrid systems as fixedpoints.",
            "Decision problems for lower/upper bound parametric timed automata.",
            "Full simulation coverage for SystemC transaction-level models of systems-on-a-chip.",
            "Automating the addition of fault tolerance with discrete controller synthesis.",
            "Foreword: Special issue on numerical software verification.",
            "Why does Astrée scale up?",
            "Enhancing the implementation of mathematical formulas for fixed-point and floating-point arithmetics.",
            "Weakly-relational shapes for numeric abstractions: improved algorithms and proofs of correctness.",
            "Action Language verifier: an infinite-state model checker for reactive software specifications.",
            "Summarization for termination: no return!",
            "Testing-based translation validation of generated code in the context of IEC 61508."
        ]
    },
    {
        "name": "FMSD",
        "year": "2008",
        "info": "2008: Volumes\n32,\n33",
        "count": 16,
        "papers": [
            "Introduction.",
            "Optimal infinite scheduling for multi-priced timed automata.",
            "Constructing invariants for hybrid systems.",
            "Abstractions for hybrid systems.",
            "A congruence relation for sPBC.",
            "Verification of parametric concurrent systems with prioritised FIFO resource management.",
            "Special issue on learning techniques for compositional reasoning.",
            "Learning to divide and conquer: applying the L* algorithm to automate assume-guarantee reasoning.",
            "Automatic symbolic compositional verification by learning assumptions.",
            "Verification of evolving software via component substitutability analysis.",
            "Three optimizations for Assume-Guarantee reasoning with L*.",
            "Automated assumption generation for compositional verification.",
            "An approach for extracting a small unsatisfiable core.",
            "The symbolic OBDD scheme for generating mechanical assembly sequences.",
            "Robust safety of timed automata.",
            "Don't care words with an application to the automata-based approach for real addition."
        ]
    },
    {
        "name": "FMSD",
        "year": "2007",
        "info": "2007: Volumes\n30,\n31",
        "count": 25,
        "papers": [
            "Guest editorial.",
            "Verification of SpecC using predicate abstraction.",
            "Static priority scheduling of event-triggered real-time embedded systems.",
            "Static priority scheduling of event-triggered real-time embedded systems.",
            "Bounded model checking of infinite state systems.",
            "Providing a formal linkage between MDG and HOL.",
            "Designing communicating transaction processes by supervisory control theory.",
            "Verification of bounded Petri nets using integer programming.",
            "Foreword: Selected papers from the ninth international workshop on formal methods for industrial critical systems (FMICS 04), Linz, Austria.",
            "HySAT: An efficient proof engine for bounded model checking of hybrid systems.",
            "From NuSMV to SPIN: Experiences with model checking flight guidance systems.",
            "Object oriented concepts identification from formal B specifications.",
            "Early verification and validation of mission critical systems.",
            "An abstract interpretation toolkit for µCRL.",
            "Refinement preserving approximations for the design and verification of heterogeneous systems.",
            "Learning to verify branching time properties.",
            "Exploiting interleaving semantics in symbolic state-space generation.",
            "Timed substitutions for regular signal-event languages.",
            "On the optimal reachability problem of weighted timed automata.",
            "GSTE is partitioned model checking.",
            "Checking extended CTL properties using guarded quotient structures.",
            "Design and results of the 2nd annual satisfiability modulo theories competition (SMT-COMP 2006).",
            "Finding optimal hardware/software partitions.",
            "The word problem for visibly pushdown languages described by grammars.",
            "Memory model sensitive bytecode verification."
        ]
    },
    {
        "name": "FMSD",
        "year": "2006",
        "info": "2006: Volumes\n28,\n29",
        "count": 25,
        "papers": [
            "Compositional SCC Analysis for Language Emptiness.",
            "An Algorithm for Strongly Connected Component Analysis in n log n Symbolic Steps.",
            "Model Checking with Strong Fairness.",
            "Special issue on formal methods for globally asynchronous and locally synchronous (GALS) systems.",
            "A Framework for Modeling the Distributed Deployment of Synchronous Designs.",
            "Concurrency in Synchronous Systems.",
            "An algebraic theory for behavioral modeling and protocol synthesis in system design.",
            "Reasoning about synchronization in GALS systems.",
            "A predictive synchronizer for periodic clock domains.",
            "Coverage metrics for temporal logic model checking*.",
            "Feature interaction detection by pairwise analysis of LTL properties - A case study.",
            "Optimistic synchronization-based state-space reduction.",
            "Cones and foci: A mechanical framework for protocol verification.",
            "Performance analysis of probabilistic timed automata using digital clocks.",
            "Some ways to reduce the space dimension in polyhedra computations.",
            "On using priced timed automata to achieve optimal scheduling.",
            "Foreword.",
            "Distributed breadth-first search LTL model checking.",
            "CTL* model checking on a shared-memory architecture.",
            "A work-efficient distributed algorithm for reachability analysis.",
            "Distributed disk-based algorithms for model checking very large Markov chains.",
            "Dealing with practical limitations of distributed timed model checking for timed automata.",
            "Question-guided stubborn set methods for state properties.",
            "Specification and analysis of the AER/NCA active network protocol suite in Real-Time Maude.",
            "Data structures for symbolic multi-valued model-checking."
        ]
    },
    {
        "name": "FMSD",
        "year": "2005",
        "info": "2005: Volumes\n26,\n27",
        "count": 25,
        "papers": [
            "Introduction: Special Issue on Partial Order in Formal Methods.",
            "Deciding Global Partial-Order Properties.",
            "Difficult Configurations-On the Complexity of LTrL.",
            "On Stubborn Sets in the Verification of Linear Time Temporal Properties.",
            "Foreword.",
            "Software Model Checking: The VeriSoft Approach.",
            "Verifying Time Partitioning in the DEOS Scheduling Kernel.",
            "Translating Java for Multiple Model Checkers: The Bandera Back-End.",
            "Automated Analysis of Fault-Tolerance in Distributed Systems.",
            "Distributed Symbolic Model Checking for µ-Calculus.",
            "Formal Verification of the VAMP Floating Point Unit.",
            "Checking Timed Büchi Automata Emptiness Efficiently.",
            "Stepwise Development of Process-Algebraic Specifications in Decorated Trace Semantics.",
            "Reduced Models for Efficient CCS Verification.",
            "A Complete Mechanization of Correctness of a String-Preprocessing Algorithm.",
            "Combining Symmetry Reduction and Under-Approximation for Symbolic Model Checking.",
            "A Formal Framework for Verification of Embedded Custom Memories of the Motorola MPC7450 Microprocessor.",
            "Two Case Studies of Semantics Execution in Maude: CCS and LOTOS.",
            "Formalization of Fixed-Point Arithmetic in HOL.",
            "Foreword.",
            "Network Event Recognition.",
            "Collecting Statistics Over Runtime Executions.",
            "jContractor: Introducing Design-by-Contract to Java Using Reflective Bytecode Instrumentation.",
            "Using Static Analysis to Reduce Dynamic Analysis Overhead.",
            "Translation and Run-Time Validation of Loop Transformations."
        ]
    },
    {
        "name": "FMSD",
        "year": "2004",
        "info": "2004: Volumes\n24,\n25",
        "count": 20,
        "papers": [
            "Accelerating Bounded Model Checking of Safety Properties.",
            "SAT-Solving the Coverability Problem for Petri Nets.",
            "A Constructive Approach to Hardware/Software Partitioning.",
            "Foreword - Selected Papers from the First International Workshop on Runtime Verification held in Paris, July 2001 (RV'01).",
            "Checking Finite Traces Using Alternating Automata.",
            "Java-MaC: A Run-Time Assurance Approach for Java Programs.",
            "A Suite of Tools for Debugging Distributed Autonomous Systems.",
            "An Overview of the Runtime Verification Tool Java PathExplorer.",
            "Properties of Hybrid Systems-A Computer Science Perspective.",
            "Polyhedral Flows in Hybrid Automata.",
            "Forward Analysis of Updatable Timed Automata.",
            "Connectivity Testing.",
            "Using Forward Reachability Analysis for Verification of Lossy Channel Systems.",
            "Static Analysis for State-Space Reductions Preserving Temporal Logics.",
            "Guest Editorial.",
            "Predicate Abstraction of ANSI-C Programs Using SAT.",
            "Efficient Verification of Sequential and Concurrent C Programs.",
            "Experimental Evaluation of Verification and Validation Tools on Martian Rover Software.",
            "Exploiting Object Escape and Locking Information in Partial-Order Reductions for Concurrent Object-Oriented Programs.",
            "Lessons Learned from Model Checking a NASA Robot Controller."
        ]
    },
    {
        "name": "FMSD",
        "year": "2003",
        "info": "2003: Volumes\n22,\n23",
        "count": 25,
        "papers": [
            "Mexitl: Multimedia in Executable Interval Temporal Logic.",
            "Polynomial Formal Verification of Multipliers.",
            "Compared Study of Two Correctness Proofs for the Standardized.",
            "Industrial Practice of Formal Hardware Verification: A Sampling.",
            "Model Checking at IBM.",
            "Experience with Applying Formal Methods to Protocol Specification and System Architecture.",
            "Formal Verification Successes at Motorola.",
            "Checking Cache-Coherence Protocols with TLA+.",
            "Formal Design of Cache Memory Protocols in IBM.",
            "Formal Verification of Square Root Algorithms.",
            "Verifying the Implementation of an Error Control Code.",
            "Verisym: Verifying Circuits by Symbolic Simulation.",
            "True Concurrency in Models of Asynchronous Circuit Behavior.",
            "BDD Based Procedures for a Theory of Equality with Uninterpreted Functions.",
            "Design and Verification of Distributed Recovery Blocks with CSP.",
            "Analysis of an Industrial System.",
            "Dynamic Partitioning in Linear Relation Analysis: Application to the Verification of Reactive Systems.",
            "An Abstraction Algorithm for the Verification of Level-Sensitive Latch-Based Netlists.",
            "Symbolic Verification and Analysis of Discrete Timed Systems.",
            "A Mechanized Proof Environment for the Convenient Computations Proof Method.",
            "Behavioral Subtyping Relations for Active Objects.",
            "Formal Verification of a Complex Pipelined Processor.",
            "Hazard Algebras.",
            "Constraint-Based Verification of Parameterized Cache Coherence Protocols.",
            "From Pre-Historic to Post-Modern Symbolic Model Checking."
        ]
    },
    {
        "name": "FMSD",
        "year": "2002",
        "info": "2002: Volumes\n20,\n21",
        "count": 26,
        "papers": [
            "Editorial Note.",
            "An Experiment in Program Composition and Proof.",
            "A Simple, Object-Based View of Multiprogramming.",
            "A Notation and Logic for Mobile Computing.",
            "Reduction and Quantifier Elimination Techniques for Program Validation.",
            "The Correctness of the Fast Fourier Transform: A Structured Proof in ACL2.",
            "Deriving Efficient Cache Coherence Protocols Through Refinement.",
            "Introduction: Special Issue on Microprocessor Verifications.",
            "Formal Verification of Out-of-Order Execution with Incremental Flushing.",
            "Verification of Out-Of-Order Processor Designs Using Model Checking and a Light-Weight Completion Function.",
            "Verification of FM9801: An Out-of-Order Microprocessor Model with Speculative Execution, Exceptions, and Program-Modifying Capability.",
            "An Efficient Partial Order Reduction Algorithm with an Alternative Proviso Implementation.",
            "Generating Model Checkers from Algebraic Specifications.",
            "An Improvement of McMillan's Unfolding Algorithm.",
            "On WLCDs and the Complexity of Word-Level Decision Diagrams-A Lower Bound for Division.",
            "Modular and Visual Specification of Hybrid Systems: An Introduction to HyCharts.",
            "Bisimulation Minimization and Symbolic Model Checking.",
            "Silicon Debug of a PowerPC[tm] Microprocessor Using Model Checking.",
            "Efficient Combinational Verification Using Overlapping Local BDDs and a Hash Table.",
            "A Formal Framework for Viewpoint Consistency.",
            "Limits of Using Signatures for Permutation Independent Boolean Comparison.",
            "Formula-Dependent Equivalence for Compositional CTL Model Checking.",
            "Verification of Hierarchical State/Event Systems using Reusability and Compositionality.",
            "Combining Software and Hardware Verification Techniques.",
            "Hierarchical Reachability Graph Generation for Petri Nets.",
            "A Scalable Parallel Algorithm for Reachability Analysis of Very Large Circuits."
        ]
    },
    {
        "name": "FMSD",
        "year": "2001",
        "info": "2001: Volumes\n18,\n19",
        "count": 27,
        "papers": [
            "Verification of Large State/Event Systems Using Compositionality and Dependency Analysis.",
            "Analysis of Timed Systems Using Time-Abstracting Bisimulations.",
            "Structural Operational Semantics for a Portable Subset of Behavioral VHDL-93.",
            "Introduction: Special Issue on CAV '97.",
            "Partial-Order Reduction in Symbolic State-Space Exploration.",
            "Parallelizing the Murj Verifier.",
            "A New Heuristic for Bad Cycle Detection Using BDDs.",
            "Efficient Detection of Vacuity in Temporal Model Checking.",
            "Abstractions of Random Finite-State Machines.",
            "Non-Abelian Groups in Optimization of Decision Diagrams Representations of Discrete Functions.",
            "Efficient Simulation of Formal Processor Models.",
            "Specification, Refinement and Verification of Concurrent Systems-An Integration of Object-Z and CSP.",
            "Local Encoding Transformations for Optimizing OBDD-Representations of Finite State Machines.",
            "Foreword.",
            "Bounded Model Checking Using Satisfiability Solving.",
            "On the Effective Deployment of Functional Formal Verification.",
            "LSCs: Breathing Life into Message Sequence Charts.",
            "Formal Methods in Designing Embedded Systems-the SACRES Experience.",
            "Introduction: Special Issue on the Fourth International Workshop of the ERCIM Working Group on Formal Methods for Industrial Critical Systems, Trento, July 11-12, 1999 - Selected Papers.",
            "Verification of a Radio-Based Signaling System Using the STATEMATE Verification Environment.",
            "Using Hybrid Automata to Support Human Factors Analysis in a Critical System.",
            "A Timed Verification of the IEEE 1394 Leader Election Protocol.",
            "Software Engineering with Formal Methods: The Development of a Storm Surge Barrier Control System Revisiting Seven Myths of Formal Methods.",
            "A Comparison of Free BDDs and Transformed BDDs.",
            "Theorem Proving Guided Development of Formal Assertions in a Resource-Constrained Scheduler for High-Level Synthesis.",
            "Relaxed Visibility Enhances Partial Order Reduction.",
            "Model Checking of Safety Properties."
        ]
    },
    {
        "name": "FMSD",
        "year": "2000",
        "info": "2000: Volumes\n16,\n17",
        "count": 21,
        "papers": [
            "Introduction: Formal Methods for CAD: Enabling Technologies and System-level Applications.",
            "The Formal Design of 1M-gate ASICs.",
            "A Tutorial on Stålmarck's Proof Procedure for Propositional Logic.",
            "Automated Correctness Condition Generation for Formal Verification of Synthesized RTL Designs.",
            "Formalization and Analysis of a Solution to the PCI 2.1 Bus Transaction Ordering Problem.",
            "Reasoning About Analog-Level Implementations of Digital Systems.",
            "Verification of Safety Properties Using Integer Programming: Beyond the State Equation.",
            "Delay-Insensitivity and Semi-Modularity.",
            "Verifying Temporal Properties of Reactive Systems: A STeP Tutorial.",
            "Floating Point Verification in HOL Light: The Exponential Function.",
            "Verification of a Leader Election Protocol: Formal Methods Applied to IEEE 1394.",
            "Timing Analysis of Combinational Circuits in Intuitionistic Propositional Logic.",
            "Parametric Analysis of Computer Systems.",
            "Modelling IP Mobility.",
            "Verification of Similar FSMs by Mixing Incremental Re-encoding, Reachability Analysis, and Combinational Checks.",
            "An Implementation of Constructive Synchronous Programs in POLIS.",
            "Selective Quantitative Analysis and Interval Model Checking: Verifying Different Facets of a System.",
            "Introduction: Special Issues for FM'99, the First World Congress on Formal Methods in the Development of Computing Systems.",
            "Logic Based Abstractions of Real-Time Systems.",
            "Proving the Correctness of the Standardized Algorithm for ABR Conformance.",
            "The Use of the B Formal Method for the Design and the Validation of the Transaction Mechanism for Smart Card Applications."
        ]
    },
    {
        "name": "FMSD",
        "year": "1999",
        "info": "1999: Volumes\n14,\n15",
        "count": 23,
        "papers": [
            "Introduction to the Special Issue on Verification of Arithmetic Hardware.",
            "Verifying the SRT Division Algorithm Using Theorem Proving Techniques.",
            "Modular Verification of SRT Division.",
            "A Mechanically Checked Proof of Correctness of the AMD K5 Floating Point Square Root Microcode.",
            "Formal Verification of Dynamic Properties in an Aerospace Application.",
            "Model-Based Verification of a Security Protocol for Conditional Access to Services.",
            "Validation of HOL Proofs by Proof Checking.",
            "A Mechanically Checked Proof of a Multiprocessor Result via a Uniprocessor View.",
            "Introduction.",
            "Symbolic Verification of Communication Protocols with Infinite State Spaces using QDDs.",
            "Symbolic Protocol Verification with Queue BDDs.",
            "Verifying Systems with Replicated Components in Mur[b.phiv].",
            "Saving Space by Fully Exploiting Invisible Transitions.",
            "Introduction.",
            "Reactive Modules.",
            "Deductive Model Checking.",
            "Automatic Generation of Invariants.",
            "Modeling a Hardware Synthesis Methodology in Isabelle.",
            "A Comparative Study of Synthesis Methods for Discrete Event Controllers.",
            "Modelling Asynchrony with a Synchronous Model.",
            "Undefined Expressions and Logic in Z and B.",
            "On-the-Fly Model Checking Under Fairness that Exploits Symmetry.",
            "Model-Checking with Coverability Graphs."
        ]
    },
    {
        "name": "FMSD",
        "year": "1998",
        "info": "1998: Volumes\n12,\n13",
        "count": 18,
        "papers": [
            "Analysis of Petri Nets by Ordering Relations in Reduced Unfoldings.",
            "Designing Control Logic for Counterflow Pipeline Processor Using Petri Nets.",
            "Relative Liveness: From Intuition to Automated Verification.",
            "Special Issue on the First International workshop of the ERCIM Working Group on Formal Methods for Industrial Critical Systems, St. Hugh's College, Oxford, March 19, 1996 - Selected Papers.",
            "Formal Methods Technology Transfer: A View from NASA.",
            "A Formal Verification Environment for Railway Signaling System Design.",
            "The Synchronous Approach to Designing Reactive Systems.",
            "A Consistent Causality-Based View on a Timed Process Algebra Including Urgent Interactions.",
            "On Deducing Timing Constraints in the Verification of Interfaces.",
            "Efficient Algorithms for Interface Timing Verification.",
            "The General Product Machine: a New Model for Symbolic FSM Traversal.",
            "Reasoning about Action Systems using the B-Method.",
            "Checking Combinational Equivalence of Speed-Independent Circuits.",
            "A Functional Rephrasing of the Assumption/Commitment Specification Style.",
            "Mechanical Verification of Adder Circuits using Rewrite Rule Laboratory.",
            "A Practical Methodology for the Formal Verification of RISC Processors.",
            "The Theory of Zero-Suppressed BDDs and the Number of Knight's Tours.",
            "An Analysis of Bitstate Hashing."
        ]
    },
    {
        "name": "FMSD",
        "year": "1997",
        "info": "1997: Volumes\n10,\n11",
        "count": 24,
        "papers": [
            "Editorial.",
            "Multiway Decision Graphs for Automated Hardware Verification.",
            "Another Look at LTL Model Checking.",
            "Generating Validation Feedback for Automatic Interpretation of Informal Requirements.",
            "Formal Verification of a Distributed Computer System.",
            "Introduction to the Special Issue on Multi-Terminal Binary Decision Diagrams.",
            "Spectral Transforms for Large Boolean Functions with Applications to Technology Mapping.",
            "Multi-Terminal Binary Decision Diagrams: An Efficient Data Structure for Matrix Representation.",
            "Algebraic Decision Diagrams and Their Applications.",
            "A Symbolic Algorithms for Maximum Flow in 0-1 Networks.",
            "Arithmetic Boolean Expression Manipulator Using BDDs.",
            "Factored Edge-Valued Binary Decision Diagrams.",
            "On the Expressive Power of OKFDDs.",
            "Stubborn Sets for Real-Time Petri Nets.",
            "Joint Minimization of Code and Data for Synchronous Dataflow Programs.",
            "The DUAL-EVAL Hardware Description Language and Its Use in the Formal Specification and Verification of the FM9001 Microprocessor.",
            "Introduction to the Special Issue on Computer-Aided Verification (CAV93).",
            "An Efficient Algorithm for Minimizing Real-Time Transition Systems.",
            "Computing Accumulated Delays in Real-time Systems.",
            "Verification of Real-Time Systems using Linear Relation Analysis.",
            "Efficient Verification of Parallel Real-Time Systems.",
            "A Unifying Theoretical Background for Some Bdd-based Data Structures.",
            "The T-Ruby Design System.",
            "Bounded Delay Timing Analysis of a Class of CSP Programs."
        ]
    },
    {
        "name": "FMSD",
        "year": "1996",
        "info": "1996: Volumes\n8,\n9",
        "count": 18,
        "papers": [
            "Automatic Verification of Distributed Systems: The Process Algebra Approach.",
            "Combining Partial Order Reductions with On-the-Fly Model-Checking.",
            "On the Computational Power of Binary Decision Diagram with Redundant Variables.",
            "Hiding Propositional Constants in BDDs.",
            "Accommodating Interference in the Formal Design of Concurrent Object-Based Programs.",
            "A Formal Approach to Reactive Systems Software: A Telecommunications Application in ESTEREL.",
            "Applying Formal Verification to the AAMP5 Microprocessor: A Case Study in the Industrial Use of Formal Methods.",
            "On a Class of Optimal Abstractions of Finite-State Machines.",
            "Experiences with Software Specification and Verification Using LP, The Larch Proof Assistant.",
            "Mod-2-OBDDs - A Data Structure that Generalizes EXOR-Sum-of-Products and Ordered Binary Decision Diagrams.",
            "Condensed State Spaces for Symmetrical Coloured Petri Nets.",
            "Better Verification Through Symmetry.",
            "Exploiting Symmetry in Temporal Logic Model Checking.",
            "Symmetry and Model Checking.",
            "A Unified Signal Transition Graph Model for Asynchronous Control Circuit Synthesis.",
            "On the Models for Asynchronous Circuit Behaviour with OR Causality.",
            "The Incorporation of Testing into Formal Verification: Direct, Modular, and Hierarchical Correctness Degrees.",
            "Regrouping Parallel Processes."
        ]
    },
    {
        "name": "FMSD",
        "year": "1995",
        "info": "1995: Volumes\n6,\n7",
        "count": 20,
        "papers": [
            "Property Preserving Abstractions for the Verification of Concurrent Systems.",
            "A Technique of State Space Search Based on Unfolding.",
            "An Iterative Approach to Verification of Real-Time Systems.",
            "Using Integer Programming to Verify General Safety and Liveness Properties.",
            "The Implicit Set Paradigm: A New Approach to Finite State System Verification.",
            "Formal Verification by Symbolic Evaluation of Partially-Ordered Trajectories.",
            "An Environment for Formal Verification Based on Symbolic Computations.",
            "Verification of the Futurebus+ Cache Coherence Protocol.",
            "Generality in Design and Compositional Verification Using TAV.",
            "Merging Behavior Specifications.",
            "Localized Verification of Modular Designs.",
            "A Formalization of a Subset of VHDL in the Boyer-Moore Logic.",
            "A Simple Denotational Semantics, Proof Theory and a Validation Condition Generator for Unit-Delay VHDL.",
            "Denotational Semantics of a Synchronous VHDL Subset.",
            "A Flowgraph Semantics of VHDL: Toward a VHDL Verification Workbench in HOL.",
            "A Colored Petri Net Model of VHDL.",
            "Translating VHDL into Functional Symbolic Finite-State Models.",
            "Correct Compilation of Specifications to Deterministic Asynchronous Circuits.",
            "State-Space Caching Revisited.",
            "PAM: A Process Algebra Manipulator."
        ]
    },
    {
        "name": "FMSD",
        "year": "1994",
        "info": "1994: Volumes\n4,\n5",
        "count": 21,
        "papers": [
            "A Proof of the Nonrestoring Division Algorithm and its Implementation on an ALU.",
            "Analysis and Identification of Speed-Independent Circuits on an Event Model.",
            "Verifying the Summit Bus Converter Protocols with Symbolic Model Checking.",
            "Verification in Process Algebra of the Distributed Control of Track Vehicles - A Case Study.",
            "Verification of the MultiStream Potocol (MSP) Using COSPAN.",
            "Description of a Design Management System for the P-ASIC Design Flow Using EXPDL.",
            "Extended BDDs: Trading off Canonicity for Structure in Verification Algorithms.",
            "Model Checking for Action-Based Logics.",
            "An Exercise in the Automatic Verification of Asynchronous Designs.",
            "Assisting Requirement Formalization by Means of Natural Language Translation.",
            "Gordon's Computer: A Hardware Verification Case Study in OBJ3.",
            "Rule-Based Induction.",
            "Constructing the Real Numbers in HOL.",
            "Modeling Multi-rate DSP Specification Semantics for Formal Transformational Design in HOL.",
            "A Methodology for Efficient Hardware Verification.",
            "Annotations in Formal Specifications and Proofs.",
            "Accelerating Tableaux Proofs Using Compact Representations.",
            "Looped Schedules for Dataflow Descriptions of Multirate Signal Processing Algorithms.",
            "Mechanically Verifying Safety and Liveness Properties of Delay Insensitive Circuits.",
            "A Structural Linearization Principle for Processes.",
            "Signal Transition Graph Constraints for Synthesis of Hazard-Free Asynchronous Circuits with Unbounded-Gate Delays."
        ]
    },
    {
        "name": "FMSD",
        "year": "1993",
        "info": "1993: Volumes\n2,\n3",
        "count": 19,
        "papers": [
            "Modular Abstractions for Verifying Real-Time Distributed Systems.",
            "On the Comparison of HOL and Boyer-Moore for Formal Hardware Verification.",
            "Using Fixed-Point Semantics to Prove Retiming Lemmas.",
            "Gate-Delay-Fault Testability Properties of Multiplexor-Based Networks.",
            "A Linear-Time Model-Checking Algorithm for the Alternation-Free Modal Mu-Calculus.",
            "Using Partial Orders for the Efficient Verification of Deadlock Freedom and Safety Properties.",
            "Structuring and Automating Hardware Proofs in a Higher-Order Theorem-Proving Environment.",
            "Formal Analysis of Correctness of Behavioral Transformations.",
            "A Unified Framework for Describing and Verifying Hardware Synchronous Sequential Systems.",
            "Test Case Verification by Model Checking.",
            "The HOL Logic Extended with Quantification over Type Variables.",
            "Lazy Techniques for Fully Expansive Theorem Proving.",
            "Mechanizing Some Advanced Refinement Concepts.",
            "Deriving Correctness Properties of Compiled Code.",
            "A Formal Theory of Simulations between Infinite Automata.",
            "An Embedding of Timed Transition Systems in HOL.",
            "Using Transformations and Verification in Circuit Design.",
            "Design and Analysis of Delay-Insensitive Modulo-N Counters.",
            "Newtonian Arbiters Cannot be Proven Correct."
        ]
    },
    {
        "name": "FMSD",
        "year": "1992",
        "info": "1992: Volume\n1",
        "count": 12,
        "papers": [
            "A Model for Synchronous Switching Circuits and its Theory of Correctness.",
            "Specification and Automatic Verification of Self-Timed Queues.",
            "Probabilistic Verification of Boolean Functions.",
            "Asynchronous Datapaths and the Design of an Asynchronous Adder.",
            "Formal Hardware Verification Methods: A Survey.",
            "Auto/Autograph.",
            "On-the-fly Verification of Finite Transition Systems.",
            "Memory-Efficient Algorithms for the Verification of Temporal Properties.",
            "A Stubborn Attack on State Explosion.",
            "Compositional Checking of Satsfaction.",
            "Verification of a Multiprocessor Cache Protocol Using Simulation Relations and Higher-Order Logic.",
            "Minimum and Maximum Delay Problems in Real-Time Systems."
        ]
    }
]