[
	{
		"year": "2020",
		"name": "40th FSTTCS 2020",
		"info": "Goa, India [virtual]",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2021",
				"sub_name": "41st IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2021, December 15-17, 2021, Virtual Conference.",
				"count": 53,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"BQP After 28 Years (Invited Talk).",
					"State Complexity of Population Protocols (Invited Talk).",
					"Approximately Counting Graph Homomorphisms and Retractions (Invited Talk).",
					"Indistinguishability Obfuscation from Well-Founded Assumptions (Invited Talk).",
					"The Complexity of Gradient Descent (Invited Talk).",
					"Scheduling in the Secretary Model.",
					"One-Way Functions and a Conditional Variant of MKTP.",
					"Generalizations of Length Limited Huffman Coding for Hierarchical Memory Settings.",
					"Approximation Algorithms for Flexible Graph Connectivity.",
					"Tight Chang's-Lemma-Type Bounds for Boolean Functions.",
					"Approximate Trace Reconstruction via Median String (In Average-Case).",
					"Approximating the Center Ranking Under Ulam.",
					"Towards Stronger Counterexamples to the Log-Approximate-Rank Conjecture.",
					"Functional Lower Bounds for Restricted Arithmetic Circuits of Depth Four.",
					"On (Simple) Decision Tree Rank.",
					"Reachability and Matching in Single Crossing Minor Free Graphs.",
					"Approximating the Number of Prime Factors Given an Oracle to Euler's Totient Function.",
					"Fully Dynamic Algorithms for Knapsack Problems with Polylogarithmic Update Time.",
					"Largest Similar Copies of Convex Polygons in Polygonal Domains.",
					"A Faster Algorithm for Finding Closest Pairs in Hamming Metric.",
					"ETH Tight Algorithms for Geometric Intersection Graphs: Now in Polynomial Space.",
					"On Fair and Efficient Allocations of Indivisible Public Goods.",
					"Time Space Optimal Algorithm for Computing Separators in Bounded Genus Graphs.",
					"Near-Optimal Cayley Expanders for Abelian Groups.",
					"Matchings, Critical Nodes, and Popular Solutions.",
					"Fast and Exact Convex Hull Simplification.",
					"Lower Bounds and Improved Algorithms for Asymmetric Streaming Edit Distance and Longest Common Subsequence.",
					"An ETH-Tight Algorithm for Multi-Team Formation.",
					"Dominating Set in Weakly Closed Graphs is Fixed Parameter Tractable.",
					"Popular Matchings in the Hospital-Residents Problem with Two-Sided Lower Quotas.",
					"Property B: Two-Coloring Non-Uniform Hypergraphs.",
					"Harmonic Algorithms for Packing d-Dimensional Cuboids into Bins.",
					"Resilience of Timed Systems.",
					"On the Complexity of Intersection Non-emptiness for Star-Free Language Classes.",
					"Complexity of Coverability in Bounded Path Broadcast Networks.",
					"On Classical Decidable Logics Extended with Percentage Quantifiers and Arithmetics.",
					"Branching Automata and Pomset Automata.",
					"History Determinism vs. Good for Gameness in Quantitative Automata.",
					"Local First-Order Logic with Two Data Values.",
					"Diagrammatic Polyhedral Algebra.",
					"From Local to Global Determinacy in Concurrent Graph Games.",
					"Quantitative Verification on Product Graphs of Small Treewidth.",
					"Synthesizing Computable Functions from Rational Specifications over Infinite Words.",
					"Confluence of Conditional Rewriting in Logic Form.",
					"On the Expressive Equivalence of TPTL in the Pointwise and Continuous Semantics.",
					"Separating Regular Languages over Infinite Words with Respect to the Wagner Hierarchy.",
					"Normal Sequences with Non-Maximal Automatic Complexity.",
					"Approximate Bisimulation Minimisation.",
					"Simple Derivation Systems for Proving Sufficient Completeness of Non-Terminating Term Rewriting Systems.",
					"Parikh Images of Register Automata.",
					"Concrete Categorical Model of a Quantum Circuit Description Language with Measurement.",
					"Linear-Time Temporal Logic with Team Semantics: Expressivity and Complexity."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "40th FSTTCS 2020",
		"info": "Goa, India [virtual]",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2021",
				"sub_name": "41st IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2021, December 15-17, 2021, Virtual Conference.",
				"count": 53,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"BQP After 28 Years (Invited Talk).",
					"State Complexity of Population Protocols (Invited Talk).",
					"Approximately Counting Graph Homomorphisms and Retractions (Invited Talk).",
					"Indistinguishability Obfuscation from Well-Founded Assumptions (Invited Talk).",
					"The Complexity of Gradient Descent (Invited Talk).",
					"Scheduling in the Secretary Model.",
					"One-Way Functions and a Conditional Variant of MKTP.",
					"Generalizations of Length Limited Huffman Coding for Hierarchical Memory Settings.",
					"Approximation Algorithms for Flexible Graph Connectivity.",
					"Tight Chang's-Lemma-Type Bounds for Boolean Functions.",
					"Approximate Trace Reconstruction via Median String (In Average-Case).",
					"Approximating the Center Ranking Under Ulam.",
					"Towards Stronger Counterexamples to the Log-Approximate-Rank Conjecture.",
					"Functional Lower Bounds for Restricted Arithmetic Circuits of Depth Four.",
					"On (Simple) Decision Tree Rank.",
					"Reachability and Matching in Single Crossing Minor Free Graphs.",
					"Approximating the Number of Prime Factors Given an Oracle to Euler's Totient Function.",
					"Fully Dynamic Algorithms for Knapsack Problems with Polylogarithmic Update Time.",
					"Largest Similar Copies of Convex Polygons in Polygonal Domains.",
					"A Faster Algorithm for Finding Closest Pairs in Hamming Metric.",
					"ETH Tight Algorithms for Geometric Intersection Graphs: Now in Polynomial Space.",
					"On Fair and Efficient Allocations of Indivisible Public Goods.",
					"Time Space Optimal Algorithm for Computing Separators in Bounded Genus Graphs.",
					"Near-Optimal Cayley Expanders for Abelian Groups.",
					"Matchings, Critical Nodes, and Popular Solutions.",
					"Fast and Exact Convex Hull Simplification.",
					"Lower Bounds and Improved Algorithms for Asymmetric Streaming Edit Distance and Longest Common Subsequence.",
					"An ETH-Tight Algorithm for Multi-Team Formation.",
					"Dominating Set in Weakly Closed Graphs is Fixed Parameter Tractable.",
					"Popular Matchings in the Hospital-Residents Problem with Two-Sided Lower Quotas.",
					"Property B: Two-Coloring Non-Uniform Hypergraphs.",
					"Harmonic Algorithms for Packing d-Dimensional Cuboids into Bins.",
					"Resilience of Timed Systems.",
					"On the Complexity of Intersection Non-emptiness for Star-Free Language Classes.",
					"Complexity of Coverability in Bounded Path Broadcast Networks.",
					"On Classical Decidable Logics Extended with Percentage Quantifiers and Arithmetics.",
					"Branching Automata and Pomset Automata.",
					"History Determinism vs. Good for Gameness in Quantitative Automata.",
					"Local First-Order Logic with Two Data Values.",
					"Diagrammatic Polyhedral Algebra.",
					"From Local to Global Determinacy in Concurrent Graph Games.",
					"Quantitative Verification on Product Graphs of Small Treewidth.",
					"Synthesizing Computable Functions from Rational Specifications over Infinite Words.",
					"Confluence of Conditional Rewriting in Logic Form.",
					"On the Expressive Equivalence of TPTL in the Pointwise and Continuous Semantics.",
					"Separating Regular Languages over Infinite Words with Respect to the Wagner Hierarchy.",
					"Normal Sequences with Non-Maximal Automatic Complexity.",
					"Approximate Bisimulation Minimisation.",
					"Simple Derivation Systems for Proving Sufficient Completeness of Non-Terminating Term Rewriting Systems.",
					"Parikh Images of Register Automata.",
					"Concrete Categorical Model of a Quantum Circuit Description Language with Measurement.",
					"Linear-Time Temporal Logic with Team Semantics: Expressivity and Complexity."
				]
			},
			{
				"sub_name_abbr": "conf/fsttcs/2020",
				"sub_name": "40th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2020, December 14-18, 2020, BITS Pilani, K K Birla Goa Campus, Goa, India (Virtual Conference).",
				"count": 59,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"The Quest for Mathematical Understanding of Deep Learning (Invited Talk).",
					"Proofs of Soundness and Proof Search (Invited Talk).",
					"Convex Optimization and Dynamic Data Structure (Invited Talk).",
					"Holonomic Techniques, Periods, and Decision Problems (Invited Talk).",
					"Algorithmic Improvisation for Dependable Intelligent Autonomy (Invited Talk).",
					"On Some Recent Advances in Algebraic Complexity (Invited Talk).",
					"Faster Property Testers in a Variation of the Bounded Degree Model.",
					"Clustering Under Perturbation Stability in Near-Linear Time.",
					"Width Notions for Ordering-Related Problems.",
					"Optimal Output Sensitive Fault Tolerant Cuts.",
					"Online Matching with Recourse: Random Edge Arrivals.",
					"Hard QBFs for Merge Resolution.",
					"On Sampling Based Algorithms for k-Means.",
					"String Indexing for Top-k Close Consecutive Occurrences.",
					"Fair Tree Connection Games with Topology-Dependent Edge Cost.",
					"Locally Decodable/Correctable Codes for Insertions and Deletions.",
					"Maximum Clique in Disk-Like Intersection Graphs.",
					"Parameterized Complexity of Feedback Vertex Sets on Hypergraphs.",
					"Size Bounds on Low Depth Circuits for Promise Majority.",
					"Lower Bounds for Semi-adaptive Data Structures via Corruption.",
					"Stability-Preserving, Time-Efficient Mechanisms for School Choice in Two Rounds.",
					"New Verification Schemes for Frequency-Based Functions on Data Streams.",
					"Online Carpooling Using Expander Decompositions.",
					"On the (Parameterized) Complexity of Almost Stable Marriage.",
					"Min-Cost Popular Matchings.",
					"Constructing Large Matchings via Query Access to a Maximal Matching Oracle.",
					"Planted Models for the Densest k-Subgraph Problem.",
					"Sample-And-Gather: Fast Ruling Set Algorithms in the Low-Memory MPC Model.",
					"On Parity Decision Trees for Fourier-Sparse Boolean Functions.",
					"Colored Cut Games.",
					"Randomness Efficient Noise Stability and Generalized Small Bias Sets.",
					"Connectivity Lower Bounds in Broadcast Congested Clique.",
					"Fully Dynamic Sequential and Distributed Algorithms for MAX-CUT.",
					"Weighted Tiling Systems for Graphs: Evaluation Complexity.",
					"Process Symmetry in Probabilistic Transducers.",
					"Reachability in Dynamical Systems with Rounding.",
					"Parameterized Complexity of Safety of Threshold Automata.",
					"Uncertainty Reasoning for Probabilistic Petri Nets via Bayesian Networks.",
					"Synthesizing Safe Coalition Strategies.",
					"Dynamic Network Congestion Games.",
					"On the Succinctness of Alternating Parity Good-For-Games Automata.",
					"A Framework for Consistency Algorithms.",
					"Equivalence of Hidden Markov Models with Continuous Observations.",
					"Nivat-Theorem and Logic for Weighted Pushdown Automata on Infinite Words.",
					"Synchronization of Deterministic Visibly Push-Down Automata.",
					"Synthesis from Weighted Specifications with Partial Domains over Finite Words.",
					"Reachability for Updatable Timed Automata Made Faster and More Effective.",
					"Active Prediction for Discrete Event Systems.",
					"Comparing Labelled Markov Decision Processes.",
					"Computable Analysis for Verified Exact Real Computation.",
					"Perspective Games with Notifications.",
					"On the Complexity of Multi-Pushdown Games.",
					"Higher-Order Nonemptiness Step by Step.",
					"The Degree of a Finite Set of Words.",
					"What You Must Remember When Transforming Datawords.",
					"Minimising Good-For-Games Automata Is NP-Complete.",
					"Static Race Detection for RTOS Applications.",
					"Synchronization Under Dynamic Constraints."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "39th FSTTCS 2019",
		"info": "Bombay, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2019",
				"sub_name": "39th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2019, December 11-13, 2019, Bombay, India.",
				"count": 52,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Practical Formal Methods for Real World Cryptography (Invited Talk).",
					"Sketching Graphs and Combinatorial Optimization (Invited Talk).",
					"Finkel Was Right: Counter-Examples to Several Conjectures on Variants of Vector Addition Systems (Invited Talk).",
					"Progress in Lifting and Applications in Lower Bounds (Invited Talk).",
					"How Computer Science Informs Modern Auction Design (Invited Talk).",
					"An Algebraic Framework to Reason About Concurrency (Invited Talk).",
					"Connected Search for a Lazy Robber.",
					"Parameterized Streaming Algorithms for Min-Ones d-SAT.",
					"Fast Exact Algorithms Using Hadamard Product of Polynomials.",
					"Approximate Online Pattern Matching in Sublinear Time.",
					"Constructing Faithful Homomorphisms over Fields of Finite Characteristic.",
					"Maximum-Area Rectangles in a Simple Polygon.",
					"Motif Counting in Preferential Attachment Graphs.",
					"Parameterized k-Clustering: Tractability Island.",
					"Nonnegative Rank Measures and Monotone Algebraic Branching Programs.",
					"Unambiguous Catalytic Computation.",
					"A Fast Exponential Time Algorithm for Max Hamming Distance X3SAT.",
					"Exact and Approximate Digraph Bandwidth.",
					"An O(n^(1/4 +epsilon)) Space and Polynomial Algorithm for Grid Graph Reachability.",
					"Popular Roommates in Simply Exponential Time.",
					"The Complexity of Finding S-Factors in Regular Graphs.",
					"More on AC^0[oplus] and Variants of the Majority Function.",
					"Planted Models for k-Way Edge and Vertex Expansion.",
					"Online Non-Preemptive Scheduling to Minimize Maximum Weighted Flow-Time on Related Machines.",
					"On the AC^0[oplus] Complexity of Andreev's Problem.",
					"The Preemptive Resource Allocation Problem.",
					"Online and Offline Algorithms for Circuit Switch Scheduling.",
					"On the Probabilistic Degrees of Symmetric Boolean Functions.",
					"Classification Among Hidden Markov Models.",
					"Minimisation of Event Structures.",
					"Concurrent Parameterized Games.",
					"Expected Window Mean-Payoff.",
					"Interval Temporal Logic for Visibly Pushdown Systems.",
					"Taming the Complexity of Timeline-Based Planning over Dense Temporal Domains.",
					"Dynamics on Games: Simulation-Based Techniques and Applications to Routing.",
					"Query Preserving Watermarking Schemes for Locally Treelike Databases.",
					"Complexity of Liveness in Parameterized Systems.",
					"Greibach Normal Form for omega-Algebraic Systems and Weighted Simple omega-Pushdown Automata.",
					"Transformations of Boolean Functions.",
					"Two-Way Parikh Automata.",
					"The Well Structured Problem for Presburger Counter Machines.",
					"A Categorical Account of Replicated Data Types.",
					"New Results on Cutting Plane Proofs for Horn Constraint Systems.",
					"The Tree-Generative Capacity of Combinatory Categorial Grammars.",
					"Cyclic Proofs and Jumping Automata.",
					"Reachability in Concurrent Uninterpreted Programs.",
					"Distance Between Mutually Reachable Petri Net Configurations.",
					"Boolean Algebras from Trace Automata.",
					"Widths of Regular and Context-Free Languages.",
					"Degrees of Ambiguity of Büchi Tree Automata.",
					"Regular Separability and Intersection Emptiness Are Independent Problems."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "38th FSTTCS 2018",
		"info": "Ahmedabad, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2018",
				"sub_name": "38th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2018, December 11-13, 2018, Ahmedabad, India.",
				"count": 49,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Random Testing for Distributed Systems with Theoretical Guarantees (Invited Paper).",
					"Model Checking Randomized Security Protocols (Invited Paper).",
					"Algorithms for the Asymmetric Traveling Salesman Problem (Invited Paper).",
					"Continuous Algorithms (Invited Paper).",
					"On the Probabilistic Degree of OR over the Reals.",
					"Quasipolynomial Hitting Sets for Circuits with Restricted Parse Trees.",
					"Univariate Ideal Membership Parameterized by Rank, Degree, and Number of Generators.",
					"Verification of Timed Asynchronous Programs.",
					"The Cayley-Graph of the Queue Monoid: Logic and Decidability.",
					"Uniformly Automatic Classes of Finite Structures.",
					"Towards a General Direct Product Testing Theorem.",
					"Space Complexity of Two Adaptive Bitprobe Schemes Storing Three Elements.",
					"New Constructions with Quadratic Separation between Sensitivity and Block Sensitivity.",
					"Lambda-Definable Order-3 Tree Functions are Well-Quasi-Ordered.",
					"A Hypersequent Calculus with Clusters for Tense Logic over Ordinals.",
					"Büchi Good-for-Games Automata Are Efficiently Recognizable.",
					"Popular Matchings in Complete Graphs.",
					"Graph Pattern Polynomials.",
					"Shortest k-Disjoint Paths via Determinants.",
					"Hyper Partial Order Logic.",
					"On the Way to Alternating Weak Automata.",
					"Origin-Equivalence of Two-Way Word Transducers Is in PSPACE.",
					"Constant Factor Approximation Algorithm for Uniform Hard Capacitated Knapsack Median Problem.",
					"A 5-Approximation for Universal Facility Location.",
					"On Fair Division for Indivisible Items.",
					"Combinatorial Algorithms for General Linear Arrow-Debreu Markets.",
					"On the Welfare of Cardinal Voting Mechanisms.",
					"Symbolic Approximation of Weighted Timed Games.",
					"A Symbolic Framework to Analyse Physical Proximity in Security Protocols.",
					"On Canonical Models for Rational Functions over Infinite Words.",
					"Reachability for Two-Counter Machines with One Test and One Reset.",
					"The Parikh Property for Weighted Context-Free Grammars.",
					"Characterizing Demand Graphs for (Fixed-Parameter) Shallow-Light Steiner Network.",
					"On the Parameterized Complexity of [1, j]-Domination Problems.",
					"Sub-Exponential Time Parameterized Algorithms for Graph Layout Problems on Digraphs with Bounded Independence Number.",
					"Safe and Optimal Scheduling for Hard and Soft Tasks.",
					"The Delta-Framework.",
					"Extending Finite-Memory Determinacy by Boolean Combination of Winning Conditions.",
					"Deterministic Algorithms for Maximum Matching on General Graphs in the Semi-Streaming Model.",
					"Sketching, Streaming, and Fine-Grained Complexity of (Weighted) LCS.",
					"On the Inner Product Predicate and a Generalization of Matching Vector Families.",
					"Extending Propositional Separation Logic for Robustness Properties.",
					"Bundled Fragments of First-Order Modal Logic: (Un)Decidability.",
					"On the Boundedness Problem for Higher-Order Pushdown Vector Addition Systems.",
					"Stronger Tradeoffs for Orthogonal Range Querying in the Semigroup Model.",
					"Parameterized Dynamic Cluster Editing.",
					"The Complexity of Separation for Levels in Concatenation Hierarchies.",
					"Reducing Transducer Equivalence to Register Automata Problems Solved by \"Hilbert Method\"."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "37th FSTTCS 2017",
		"info": "Kanpur, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2017",
				"sub_name": "37th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2017, December 11-15, 2017, Kanpur, India.",
				"count": 48,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Justified Representation in Multiwinner Voting: Axioms and Algorithms.",
					"A Markov Chain Theory Approach to Characterizing the Minimax Optimality of Stochastic Gradient Descent (for Least Squares).",
					"Automated Synthesis: a Distributed Viewpoint.",
					"Matrix Estimation, Latent Variable Model and Collaborative Filtering.",
					"Some Open Problems in Information-Theoretic Cryptography.",
					"Backward Deterministic Büchi Automata on Infinite Words.",
					"Monitoring for Silent Actions.",
					"Maintaining Reeb Graphs of Triangulated 2-Manifolds.",
					"On the Parameterized Complexity of Simultaneous Deletion Problems.",
					"A Composition Theorem for Randomized Query Complexity.",
					"Verification of Asynchronous Programs with Nested Locks.",
					"Modulo Counting on Words and Trees.",
					"Probabilistic Disclosure: Maximisation vs. Minimisation.",
					"Reasons for Hardness in QBF Proof Systems.",
					"An Improved Dictatorship Test with Perfect Completeness.",
					"Forward Analysis for WSTS, Part III: Karp-Miller Trees.",
					"Rabin vs. Streett Automata.",
					"How Deterministic are Good-For-Games Automata?.",
					"Popular Matchings with Multiple Partners.",
					"Non-Adaptive Data Structure Bounds for Dynamic Predecessor.",
					"On Colourability of Polygon Visibility Graphs.",
					"Vertex Deletion Problems on Chordal Graphs.",
					"A Lifting Theorem with Applications to Symmetric Functions.",
					"Local Patterns.",
					"On Symbolic Heaps Modulo Permission Theories.",
					"Symmetric Synthesis.",
					"Approximation Algorithms for Stochastic k-TSP.",
					"Synthesis in Distributed Environments.",
					"Train Scheduling on a Unidirectional Path.",
					"On the Control of Asynchronous Automata.",
					"Streaming for Aibohphobes: Longest Palindrome with Mismatches.",
					"Understanding the Correlation Gap For Matchings.",
					"Hardness of Rainbow Coloring Hypergraphs.",
					"Network Construction with Ordered Constraints.",
					"Complexity of Model Checking MDPs against LTL Specifications.",
					"A Unified Method for Placing Problems in Polylogarithmic Depth.",
					"Finding Pseudorandom Colorings of Pseudorandom Graphs.",
					"Flow Games.",
					"A Dichotomy Theorem for the Inverse Satisfiability Problem.",
					"Balanced Judicious Bipartition is Fixed-Parameter Tractable.",
					"On Hashing-Based Approaches to Approximate DNF-Counting.",
					"Average Stack Cost of Büchi Pushdown Automata.",
					"Querying Best Paths in Graph Databases.",
					"Popular Matchings with Lower Quotas.",
					"The Complexity of the Diagonal Problem for Recursion Schemes.",
					"A Combinatorial Proof of Ihara-Bass's Formula for the Zeta Function of Regular Graphs.",
					"VLDL Satisfiability and Model Checking via Tree Automata."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "36th FSTTCS 2016",
		"info": "Chennai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2016",
				"sub_name": "36th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2016, December 13-15, 2016, Chennai, India.",
				"count": 51,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization, External Reviewers.",
					"Fast and Powerful Hashing Using Tabulation (Invited Talk).",
					"Simple Invariants for Proving the Safety of Distributed Protocols (Invited Talk).",
					"My O Is Bigger Than Yours (Invited Talk).",
					"Continuous Optimization: The \"Right\" Language for Graph Algorithms? (Invited Talk).",
					"Graph Decompositions and Algorithms (Invited Talk).",
					"Side Channel Analysis Using a Model Counting Constraint Solver and Symbolic Execution (Invited Talk).",
					"Mixed-Criticality Scheduling to Minimize Makespan.",
					"Capacitated k-Center Problem with Vertex Weights.",
					"Improved Pseudo-Polynomial-Time Approximation for Strip Packing.",
					"Embedding Approximately Low-Dimensional l_2^2 Metrics into l_1.",
					"Relational Logic with Framing and Hypotheses.",
					"FO-Definable Transformations of Infinite Strings.",
					"Aperiodicity of Rational Functions Is PSPACE-Complete.",
					"Homomorphism Problems for First-Order Definable Structures.",
					"On the Sensitivity Conjecture for Disjunctive Normal Forms.",
					"The Zero-Error Randomized Query Complexity of the Pointer Function.",
					"Robust Multiplication-Based Tests for Reed-Muller Codes.",
					"Querying Regular Languages over Sliding Windows.",
					"Decidability and Complexity of Tree Share Formulas.",
					"One-Counter Automata with Counter Observability.",
					"Strong Parameterized Deletion: Bipartite Graphs.",
					"Parameterized Algorithms for List K-Cycle.",
					"Lossy Kernels for Graph Contraction Problems.",
					"Faster Exact and Parameterized Algorithm for Feedback Vertex Set in Bipartite Tournaments.",
					"Probabilistic Mu-Calculus: Decidability and Complete Axiomatization.",
					"Interval vs. Point Temporal Logic Model Checking: an Expressiveness Comparison.",
					"Model Checking Population Protocols.",
					"Visibly Linear Dynamic Logic.",
					"Stable Matching Games: Manipulation via Subgraph Isomorphism.",
					"The Adwords Problem with Strict Capacity Constraints.",
					"Most Likely Voronoi Diagrams in Higher Dimensions.",
					"Fréchet Distance Between a Line and Avatar Point Set.",
					"Greed is Good for Deterministic Scale-Free Networks.",
					"Independent-Set Reconfiguration Thresholds of Hereditary Graph Classes.",
					"LZ77 Factorisation of Trees.",
					"Finger Search in Grammar-Compressed Strings.",
					"Characterization and Lower Bounds for Branching Program Size Using Projective Dimension.",
					"Finer Separations Between Shallow Arithmetic Circuits.",
					"Sum of Products of Read-Once Formulas.",
					"Understanding Cutting Planes for QBFs.",
					"Summaries for Context-Free Games.",
					"Admissibility in Quantitative Graph Games.",
					"Prompt Delay.",
					"Mean-Payoff Games on Timed Automata.",
					"The Power and Limitations of Uniform Samples in Testing Properties of Figures.",
					"Local Testing for Membership in Lattices.",
					"Super-Fast MST Algorithms in the Congested Clique Using o(m) Messages.",
					"Why Liveness for Timed Automata Is Hard, and What We Can Do About It.",
					"Verified Analysis of List Update Algorithms.",
					"Tunable Online MUS/MSS Enumeration."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "35th FSTTCS 2015",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2015",
				"sub_name": "35th IARCS Annual Conference on Foundation of Software Technology and Theoretical Computer Science, FSTTCS 2015, December 16-18, 2015, Bangalore, India.",
				"count": 49,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Bypassing Worst Case Analysis: Tensor Decomposition and Clustering (Invited Talk).",
					"Checking Correctness of Concurrent Objects: Tractable Reductions to Reachability (Invited Talk).",
					"Reachability Problems for Continuous Linear Dynamical Systems (Invited Talk).",
					"Convexity, Bayesianism, and the Quest Towards Optimal Algorithms (Invited Talk).",
					"Beyond Matrix Completion (Invited Talk).",
					"Relational Refinement Types for Higher-Order Shape Transformers (Invited Talk).",
					"Robust Reoptimization of Steiner Trees.",
					"Minimizing Weighted lp-Norm of Flow-Time in the Rejection Model.",
					"On Correcting Inputs: Inverse Optimization for Online Structured Prediction.",
					"Dynamic Sketching for Graph Optimization Problems with Applications to Cut-Preserving Sketches.",
					"Weighted Strategy Logic with Boolean Goals Over One-Counter Games.",
					"Decidability in the Logic of Subsequences and Supersequences.",
					"Fragments of Fixpoint Logic on Data Words.",
					"Efficient Algorithms for Morphisms over Omega-Regular Languages.",
					"Approximating the Regular Graphic TSP in Near Linear Time.",
					"On Weighted Bipartite Edge Coloring.",
					"Deciding Orthogonality in Construction-A Lattices.",
					"Ordered Tree-Pushdown Systems.",
					"One-way Definability of Sweeping Transducer.",
					"What's Decidable about Availability Languages?.",
					"Towards Better Separation between Deterministic and Randomized Query Complexity.",
					"Dimension, Pseudorandomness and Extraction of Pseudorandomness.",
					"On the NP-Completeness of the Minimum Circuit Size Problem.",
					"Counting Euler Tours in Undirected Bounded Treewidth Graphs.",
					"Revisiting Robustness in Priced Timed Games.",
					"Simple Priced Timed Games are not That Simple.",
					"Quantitative Games under Failures.",
					"Games with Delays - A Frankenstein Approach.",
					"Forbidden Extension Queries.",
					"On Density, Threshold and Emptiness Queries for Intervals in the Streaming Model.",
					"Clustering on Sliding Windows in Polylogarithmic Space.",
					"Congestion Games with Multisets of Resources and Applications in Synthesis.",
					"The Sensing Cost of Monitoring and Synthesis.",
					"An omega-Algebra for Real-Time Energy Problems.",
					"Parameterized Complexity of Secluded Connectivity Problems.",
					"Parameterized Algorithms for Deletion to (r, ell)-Graphs.",
					"Finding Even Subgraphs Even Faster.",
					"The Parameterized Complexity of the Minimum Shared Edges Problem.",
					"Control Improvisation.",
					"A Provably Correct Sampler for Probabilistic Programs.",
					"On the Problem of Computing the Probability of Regular Sets of Trees.",
					"Probabilistic Regular Expressions and MSO Logic on Finite Trees.",
					"Rumors Across Radio, Wireless, Telephone.",
					"The Price of Local Power Control in Wireless Scheduling.",
					"Allocation of Divisible Goods Under Lexicographic Preferences.",
					"On the Expressiveness of Multiparty Sessions.",
					"Secure Refinements of Communication Channels.",
					"Failure-aware Runtime Verification of Distributed Systems."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "34th FSTTCS 2014",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2014",
				"sub_name": "34th International Conference on Foundation of Software Technology and Theoretical Computer Science, FSTTCS 2014, December 15-17, 2014, New Delhi, India.",
				"count": 54,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"New Developments in Iterated Rounding (Invited Talk).",
					"Reasoning About Distributed Systems: WYSIWYG (Invited Talk).",
					"Colour Refinement: A Simple Partitioning Algorithm with Applications From Graph Isomorphism Testing to Machine Learning (Invited Talk).",
					"Properties and Utilization of Capacitated Automata (Invited Talk).",
					"Algorithms, Games, and Evolution (Invited Talk).",
					"The Polynomial Method in Circuit Complexity Applied to Algorithm Design (Invited Talk).",
					"Vertex Exponential Algorithms for Connected f-Factors.",
					"Connecting Vertices by Independent Trees.",
					"Tree Deletion Set Has a Polynomial Kernel (but no OPT^O(1) Approximation).",
					"Editing to Eulerian Graphs.",
					"Parameterized Complexity of Fixed Variable Logics.",
					"Synchronizing Words for Weighted and Timed Automata.",
					"Finite-Valued Weighted Automata.",
					"First-order Definable String Transformations.",
					"Regular Sensing.",
					"Symbolic Solving of Extended Regular Expression Inequalities.",
					"Solving the Stable Set Problem in Terms of the Odd Cycle Packing Number.",
					"Lift & Project Systems Performing on the Partial Vertex Cover Polytope.",
					"Replica Placement on Directed Acyclic Graphs.",
					"Maintaining Approximate Maximum Matching in an Incremental Bipartite Graph in Polylogarithmic Update Time.",
					"The Complexity of Counting Models of Linear-time Temporal Logic.",
					"Extending Temporal Logics with Data Variable Quantifications.",
					"Generalized Data Automata and Fixpoint Logic.",
					"Consistency of Injective Tree Patterns.",
					"Asymptotically Optimal Encodings for Range Selection.",
					"Output-Sensitive Pattern Extraction in Sequences.",
					"Robust Proximity Search for Balls Using Sublinear Space.",
					"The Benes Network is q*(q-1)/2n-Almost q-set-wise Independent.",
					"Notes on Counting with Finite Machines.",
					"Mixed Nash Equilibria in Concurrent Terminal-Reward Games.",
					"Quantitative Games with Interval Objectives.",
					"Playing Safe.",
					"Metaconfluence of Calculi with Explicit Substitutions at a Distance.",
					"Behavioral Metrics via Functor Lifting.",
					"Foundation of Diagnosis and Predictability in Probabilistic Systems.",
					"Lipschitz Robustness of Finite-state Transducers.",
					"Separating Cook Completeness from Karp-Levin Completeness Under a Worst-Case Hardness Hypothesis.",
					"Constructing Small Tree Grammars and Small Circuits for Formulas.",
					"One Time-traveling Bit is as Good as Logarithmically Many.",
					"New Bounds for the Garden-Hose Model.",
					"Homomorphism Polynomials Complete for VP.",
					"Computing Information Flow Using Symbolic Model-Checking.",
					"Information Leakage of Non-Terminating Processes.",
					"Multiple-Environment Markov Decision Processes.",
					"Summary-Based Inter-Procedural Analysis via Modular Trace Refinement.",
					"A Two-Level Logic Approach to Reasoning About Typed Specification Languages.",
					"On the Complexity of Computing Maximum Entropy for Markovian Models.",
					"New Time-Space Upperbounds for Directed Reachability in High-genus and H-minor-free Graphs.",
					"Polynomial Min/Max-weighted Reachability is in Unambiguous Log-space.",
					"On Bounded Reachability Analysis of Shared Memory Systems.",
					"Parameterized Communicating Automata: Complementation and Model Checking.",
					"Distributed Synthesis for Acyclic Architectures.",
					"Verification of Dynamic Register Automata."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "33rd FSTTCS 2013",
		"info": "Guwahati, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2013",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2013, December 12-14, 2013, Guwahati, India.",
				"count": 46,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization.",
					"Polar Codes: Reliable Communication with Complexity Polynomial in the Gap to Shannon Capacity (Invited Talk).",
					"Computing With a Fixed Number of Pointers (Invited Talk).",
					"On Approximation Resistance of Predicates (Invited Talk).",
					"Characterisations of Nowhere Dense Graphs (Invited Talk).",
					"Intersection Types for Normalization and Verification (Invited Talk).",
					"Polynomial Kernels for lambda-extendible Properties Parameterized Above the Poljak-Turzik Bound.",
					"On the Parameterised Complexity of String Morphism Problems.",
					"Partially Polynomial Kernels for Set Cover and Test Cover.",
					"Parameterized Complexity of the Anchored k-Core Problem for Directed Graphs.",
					"Böhm Trees as Higher-Order Recursive Schemes.",
					"Evaluation is MSOL-compatible.",
					"Model Checking and Functional Program Transformations.",
					"A Theory of Partitioned Global Address Spaces.",
					"A Strong Direct Product Theorem for the Tribes Function via the Smooth-Rectangle Bound.",
					"Inapproximability of Rainbow Colouring.",
					"Primal Infon Logic: Derivability in Polynomial Time.",
					"Composition Problems for Braids.",
					"DLOGTIME Proof Systems.",
					"On Improved Degree Lower Bounds for Polynomial Approximation.",
					"Implementing Realistic Asynchronous Automata.",
					"Computation of Summaries Using Net Unfoldings.",
					"Faster Deterministic Algorithms for r-Dimensional Matching Using Representative Sets.",
					"Distributed and Parallel Algorithms for Set Cover Problems with Small Neighborhood Covers.",
					"Replica Placement via Capacitated Vertex Cover.",
					"Knapsack Cover Subject to a Matroid Constraint.",
					"Jumping Automata for Uniform Strategies.",
					"Emptiness Of Alternating Tree Automata Using Games With Imperfect Information.",
					"Saturation of Concurrent Collapsible Pushdown Systems.",
					"Decidability Results on the Existence of Lookahead Delegators for NFA.",
					"Fair Matchings and Related Problems.",
					"Ranking with Diverse Intents and Correlated Contents.",
					"Separating Regular Languages by Locally Testable and Locally Threshold Testable Languages.",
					"On the Structure and Complexity of Rational Sets of Regular Languages.",
					"Geometric Avatar Problems.",
					"Clustering With Center Constraints.",
					"On Infinite Words Determined by Stack Automata.",
					"The Combinatorics of Non-determinism.",
					"Renting a Cloud.",
					"Energy Efficient Scheduling and Routing via Randomized Rounding.",
					"PTAS for Ordered Instances of Resource Allocation Problems.",
					"On the Pseudoperiodic Extension of u^l = v^m w^n.",
					"Solvency Markov Decision Processes with Interest.",
					"Parameterized Verification of Many Identical Probabilistic Timed Processes.",
					"Simulation Over One-counter Nets is PSPACE-Complete.",
					"Optimal Constructions for Active Diagnosis."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "32nd FSTTCS 2012",
		"info": "Hyderabad, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2012",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2012, December 15-17, 2012, Hyderabad, India.",
				"count": 49,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization.",
					"Learning Mixtures of Distributions over Large Discrete Domains.",
					"Imperative Programming in Sets with Atoms.",
					"Algorithmic Improvements of the Lovász Local Lemma via Cluster Expansion .",
					"Test Generation Using Symbolic Execution.",
					"Automated Reasoning and Natural Proofs for Programs Manipulating Data Structures.",
					"Certifying polynomials for AC^0(parity) circuits, with applications.",
					"Randomly-oriented k-d Trees Adapt to Intrinsic Dimension.",
					"Lower Bounds for the Average and Smoothed Number of Pareto Optima.",
					"Exponential Space Improvement for minwise Based Algorithms.",
					"An effective characterization of the alternation hierarchy in two-variable logic.",
					"Decidable classes of documents for XPath.",
					"Faster Deciding MSO Properties of Trees of Fixed Height, and Some Consequences.",
					"Cost-Parity and Cost-Streett Games.",
					"Super-Fast 3-Ruling Sets.",
					"New bounds on the classical and quantum communication complexity of some graph properties.",
					"On Bisimilarity of Higher-Order Pushdown Automata: Undecidability at Order Two.",
					"Scope-bounded Multistack Pushdown Systems: Fixed-Point, Sequentialization, and Tree-Width.",
					"Scheduling with Setup Costs and Monotone Penalties.",
					"Scheduling Resources for Executing a Partial Set of Jobs.",
					"Visibly Rational Expressions.",
					"Safety Verification of Communicating One-Counter Machines.",
					"Density Functions subject to a Co-Matroid Constraint.",
					"Efficient on-line algorithm for maintaining k-cover of sparse bit-strings.",
					"Maintaining Approximate Maximum Weighted Matching in Fully Dynamic Graphs.",
					"Approximation Algorithms for the Unsplittable Flow Problem on Paths and Trees.",
					"Graphs, Rewriting and Pathway Reconstruction for Rule-Based Models.",
					"On the Complexity of Parameterized Reachability in Reconfigurable Broadcast Networks.",
					"Extending the Rackoff technique to Affine nets.",
					"Accelerating tree-automatic relations.",
					"k-delivery traveling salesman problem on tree networks.",
					"Rerouting shortest paths in planar graphs.",
					"Space Efficient Edge-Fault Tolerant Routing.",
					"Approximate Determinization of Quantitative Automata.",
					"Timed Lossy Channel Systems.",
					"Solving the Canonical Representation and Star System Problems for Proper Circular-Arc Graphs in Logspace.",
					"Directed Acyclic Subgraph Problem Parameterized above the Poljak-Turzik Bound.",
					"Beyond Max-Cut: lambda-Extendible Properties Parameterized Above the Poljak-Turzik Bound.",
					"Subexponential Parameterized Odd Cycle Transversal on Planar Graphs.",
					"Deciding Probabilistic Automata Weak Bisimulation in Polynomial Time.",
					"Bisimilarity of Probabilistic Pushdown Automata.",
					"Average Case Analysis of the Classical Algorithm for Markov Decision Processes with Büchi Objectives.",
					"Verification of Open Interactive Markov Chains.",
					"On the Sensitivity of Shape Fitting Problems.",
					"Overlap of Convex Polytopes under Rigid Motion.",
					"Minimum Enclosing Circle with Few Extra Variables.",
					"Static Analysis for Checking Data Format Compatibility of Programs.",
					"The Complexity of Quantitative Information Flow in Recursive Programs.",
					"Computationally Complete Symbolic Attacker in Action."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "31st FSTTCS 2011",
		"info": "Mumbai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2011",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2011, December 12-14, 2011, Mumbai, India.",
				"count": 45,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization, External Reviewers.",
					"Author Index.",
					"Energy-Efficient Algorithms (Invited Talk).",
					"Constraints, Graphs, Algebra, Logic, and Complexity (Invited Talk).",
					"Physical limits of Communication (Invited Talk).",
					"A Domain-Specific Language for Computing on Encrypted Data (Invited Talk).",
					"Schema Mappings and Data Examples: Deriving Syntax from Semantics (Invited Talk).",
					"Quantum State Description Complexity (Invited Talk).",
					"Approximation Algorithms for Union and Intersection Covering Problems.",
					"Tight Gaps for Vertex Cover in the Sherali-Adams SDP Hierarchy.",
					"Applications of Discrepancy Theory in Multiobjective Approximation.",
					"Quasi-Weak Cost Automata: A New Variant of Weakness.",
					"Using non-convex approximations for efficient analysis of timed automata.",
					"Shrinking Timed Automata.",
					"The Quantitative Linear-Time--Branching-Time Spectrum.",
					"Isomorphism testing of read-once functions and polynomials.",
					"The Limited Power of Powering: Polynomial Identity Testing and a Depth-four Lower Bound for the Permanent.",
					"Petri Net Reachability Graphs: Decidability Status of FO Properties.",
					"Approximating Petri Net Reachability Along Context-free Traces.",
					"Minimum Fill-in of Sparse Graphs: Kernelization and Approximation.",
					"Cubicity, Degeneracy, and Crossing Number.",
					"Conditional Reactive Systems.",
					"Transforming Password Protocols to Compose.",
					"Obtaining a Bipartite Graph by Contracting Few Edges.",
					"Simultaneously Satisfying Linear Equations Over F_2: MaxLin2 and Max-r-Lin2 Parameterized Above Average.",
					"Rainbow Connectivity: Hardness and Tractability.",
					"Dependence logic with a majority quantifier.",
					"Modal Logics Definable by Universal Three-Variable Formulas.",
					"The First-Order Theory of Ground Tree Rewrite Graphs.",
					"Layer Systems for Proving Confluence.",
					"The Semi-stochastic Ski-rental Problem.",
					"Streamability of Nested Word Transductions.",
					"The update complexity of selection and related problems.",
					"A Tight Lower Bound for Streett Complementation.",
					"Parameterized Regular Expressions and Their Languages.",
					"Definable Operations On Weakly Recognizable Sets of Trees.",
					"Nash Equilibria in Concurrent Games with Büchi Objectives.",
					"A Perfect-Information Construction for Coordination in Games.",
					"Efficient Approximation of Optimal Control for Continuous-Time Markov Games.",
					"Minimal Disclosure in Partially Observable Markov Decision Processes.",
					"Optimal Packed String Matching.",
					"Dynamic programming in faulty memory hierarchies (cache-obliviously).",
					"Deciding Probabilistic Simulation between Probabilistic Pushdown Automata and Finite-State Systems.",
					"Parameterised Pushdown Systems with Non-Atomic Writes.",
					"Higher order indexed monadic systems."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "30th FSTTCS 2010",
		"info": "Chennai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2010",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2010, December 15-18, 2010, Chennai, India.",
				"count": 44,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization, Author Index.",
					"Expressiveness of streaming string transducers.",
					"Special tree-width and the verification of monadic second-order graph pr operties.",
					"On extracting computations from propositional proofs (a survey).",
					"Recent Progress and Open Problems in Algorithmic Convex Geometry.",
					"Playing in stochastic environment: from multi-armed bandits to two-player games.",
					"Better Algorithms for Satisfiability Problems for Formulas of Bounded Rank-width.",
					"Satisfiability of Acyclic and Almost Acyclic CNF Formulas.",
					"The effect of girth on the kernelization complexity of Connected Dominating Set.",
					"One-Counter Stochastic Games.",
					"ATL with Strategy Contexts: Expressiveness and Model Checking.",
					"Reasoning About Strategies.",
					"New Results on Quantum Property Testing.",
					"Lower bounds for Quantum Oblivious Transfer.",
					"Minimizing Busy Time in Multiple Machine Real-time Scheduling.",
					"A Near-linear Time Constant Factor Algorithm for Unsplittable Flow Problem on Line with Bag Constraints.",
					"Place-Boundedness for Vector Addition Systems with one zero-test.",
					"Model checking time-constrained scenario-based specifications.",
					"Global Model Checking of Ordered Multi-Pushdown Systems.",
					"The Complexity of Model Checking (Collapsible) Higher-Order Pushdown Systems.",
					"A graph polynomial for independent sets of bipartite graphs.",
					"Finding Independent Sets in Unions of Perfect Graphs.",
					"Fast equivalence-checking for normed context-free processes.",
					"Generalizing the powerset construction, coalgebraically.",
					"Uniqueness of Normal Forms is Decidable for Shallow Term Rewrite Systems.",
					"Deterministic Black-Box Identity Testing $pi$-Ordered Algebraic Branching Programs.",
					"Computing Rational Radical Sums in Uniform TC^0.",
					"Graph Isomorphism is not AC^0 reducible to Group Isomorphism.",
					"Colored Hypergraph Isomorphism is Fixed Parameter Tractable.",
					"Global Escape in Multiparty Sessions.",
					"Computationally Sound Abstraction and Verification of Secure Multi-Party Computations.",
					"Model Checking Concurrent Programs with Nondeterminism and Randomization.",
					"Two Size Measures for Timed Languages.",
					"Average Analysis of Glushkov Automata under a BST-Like Model.",
					"Beyond Hyper-Minimisation---Minimising DBAs and DPAs is NP-Complete.",
					"Parityizing Rabin and Streett.",
					"Finding Sparser Directed Spanners.",
					"Combinatorial Problems with Discounted Price Functions in Multi-agent Systems.",
					"Quasi-Random PCP and Hardness of 2-Catalog Segmentation.",
					"Determining the Winner of a Dodgson Election is Hard.",
					"Verifying Recursive Active Documents with Positive Data Tree Rewriting.",
					"Temporal Logics on Words with Multiple Data Values.",
					"First-Order Logic with Reachability Predicates on Infinite Systems.",
					"Generalized Mean-payoff and Energy Games."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "29th FSTTCS 2009",
		"info": "Kanpur, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2009",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2009, December 15-17, 2009, IIT Kanpur, India.",
				"count": 40,
				"papers": [
					"Preface -- IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science (2009).",
					"Mediating for Reduction (on Minimizing Alternating Büchi Automata).",
					"Algorithms for Message Ferrying on Mobile ad hoc Networks.",
					"Arithmetic Circuits and the Hadamard Product of Polynomials.",
					"Kernels for Feedback Arc Set In Tournaments.",
					"On the Memory Consumption of Probabilistic Pushdown Automata.",
					"Continuous-Time Stochastic Games with Time-Bounded Reachability.",
					"Deterministic Automata and Extensions of Weak MSO.",
					"On Timed Alternating Simulation for Concurrent Timed Games.",
					"Covering of ordinals.",
					"Fractional Pebbling and Thrifty Branching Programs.",
					"The Wadge Hierarchy of Max-Regular Languages.",
					"Automata and temporal logic over arbitrary linear time.",
					"Graph Isomorphism for K_{3, 3}-free and K_5-free graphs is in Log-space.",
					"Domination Problems in Nowhere-Dense Classes.",
					"Simulation based security in the applied pi calculus.",
					"The Covering and Boundedness Problems for Branching Vector Addition Systems.",
					"Subexponential Algorithms for Partial Cover Problems.",
					"On the Tightening of the Standard SDP for Vertex Cover with $ell_1$ Inequalities.",
					"Kolmogorov Complexity in Randomness Extraction.",
					"Donation Center Location Problem.",
					"Non-Local Box Complexity and Secure Function Evaluation.",
					"Verification and Refutation of Probabilistic Specifications via Games.",
					"Approximating Fault-Tolerant Group-Steiner Problems.",
					"Bounded Size Graph Clustering with Applications to Stream Processing.",
					"A Fine-grained Analysis of a Simple Independent Set Algorithm.",
					"Using Elimination Theory to construct Rigid Matrices.",
					"On Nondeterministic Unranked Tree Automata with Sibling Constraints.",
					"Functionally Private Approximations of Negligibly-Biased Estimators.",
					"Nash Equilibrium in Generalised Muller Games.",
					"Modelchecking counting properties of 1-safe nets with buffers in paraPSPACE.",
					"Synthesis of Finite-state and Definable Winning Strategies.",
					"The Power of Depth 2 Circuits over Algebras.",
					"Deductive Verification of Continuous Dynamical Systems.",
					"Recurrence and Transience for Probabilistic Automata.",
					"Structure and Specification as Sources of Complexity.",
					"Priced Timed Automata: Theory and Tools.",
					"Fighting bit Rot with Types (Experience Report: Scala Collections).",
					"Iterative Methods in Combinatorial Optimization.",
					"Randomness extractors -- applications and constructions."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "28th FSTTCS 2008",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2008",
				"sub_name": "IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2008, December 9-11, 2008, Bangalore, India.",
				"count": 37,
				"papers": [
					"Implicit Branching and Parameterized Partial Cover Problems (Extended Abstract).",
					"Sound Lemma Generation for Proving Inductive Validity of Equations.",
					"Some Sieving Algorithms for Lattice Problems.",
					"Analyzing Asynchronous Programs with Preemption.",
					"Runtime Monitoring of Metric First-order Temporal Properties.",
					"Solvency Games.",
					"On the Power of Imperfect Information.",
					"Boolean algebras of unambiguous context-free languages.",
					"Increasing the power of the verifier in Quantum Zero Knowledge.",
					"Algorithms for Game Metrics.",
					"Pruning 2-Connected Graphs.",
					"Single-Sink Network Design with Vertex Connectivity Requirements.",
					"Graph Games on Ordinals.",
					"3-connected Planar Graph Isomorphism is in Log-space.",
					"A new upper bound for 3-SAT.",
					"Abstraction Refinement for Games with Incomplete Information.",
					"A new approach to the planted clique problem.",
					"All-Norms and All-L_p-Norms Approximation Algorithms.",
					"An Optimal Construction of Finite Automata from Regular Expressions.",
					"The unfolding of general Petri nets.",
					"Explicit Muller Games are PTIME.",
					"The Complexity of Tree Transducer Output Languages.",
					"STCON in Directed Unique-Path Graphs.",
					"Dynamic matrix rank with partial lookahead.",
					"A Cubic-Vertex Kernel for Flip Consensus Tree.",
					"Leaf languages and string compression.",
					"Complexity Analysis of Term Rewriting Based on Matrix and Context Dependent Interpretations.",
					"Analyzing the Implicit Computational Complexity of object-oriented programs.",
					"A Hierarchy of Semantics for Non-deterministic Term Rewriting Systems.",
					"Average-Time Games.",
					"About models of security protocols.",
					"On Estimation Algorithms vs Approximation Algorithms.",
					"Banach-Mazur Games on Graphs.",
					"Harnessing the Multicores: Nested Data Parallelism in Haskell.",
					"Knowledge Infusion: In Pursuit of Robustness in Artificial Intelligence.",
					"2008 Preface - IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science.",
					"2008 Abstracts Collection - IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "27th FSTTCS 2007",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2007",
				"sub_name": "FSTTCS 2007: Foundations of Software Technology and Theoretical Computer Science, 27th International Conference, New Delhi, India, December 12-14, 2007, Proceedings.",
				"count": 45,
				"papers": [
					"The Multicore Revolution.",
					"Streaming Algorithms for Selection and Approximate Sorting.",
					"Adventures in Bidirectional Programming.",
					"Program Analysis Using Weighted Pushdown Systems.",
					"The Complexity of Zero Knowledge.",
					"The Priority k-Median Problem.",
					"\"Rent-or-Buy\" Scheduling and Cost Coloring Problems.",
					"Order Scheduling Models: Hardness and Algorithms.",
					"On Simulatability Soundness and Mapping Soundness of Symbolic Cryptography.",
					"Key Substitution in the Symbolic Analysis of Cryptographic Protocols.",
					"Symbolic Bisimulation for the Applied Pi Calculus.",
					"Non-mitotic Sets.",
					"Reductions to Graph Isomorphism.",
					"Strong Reductions and Isomorphism of Complete Sets.",
					"Probabilistic and Topological Semantics for Timed Automata.",
					"A Theory for Game Theories.",
					"An Incremental Bisimulation Algorithm.",
					"Logspace Algorithms for Computing Shortest and Longest Paths in Series-Parallel Graphs.",
					"Communication Lower Bounds Via the Chromatic Number.",
					"The Deduction Theorem for Strong Propositional Proof Systems.",
					"Satisfiability of Algebraic Circuits over Sets of Natural Numbers.",
					"Post Embedding Problem Is Not Primitive Recursive, with Applications to Channel Systems.",
					"Synthesis of Safe Message-Passing Systems.",
					"Automata and Logics for Timed Message Sequence Charts.",
					"Propositional Dynamic Logic for Message-Passing Systems.",
					"Better Algorithms and Bounds for Directed Maximum Leaf Problems.",
					"Faster Algorithms for All-Pairs Small Stretch Distances in Weighted Graphs.",
					"Covering Graphs with Few Complete Bipartite Subgraphs.",
					"Safely Composing Security Protocols.",
					"Computationally Sound Typing for Non-interference: The Case of Deterministic Encryption.",
					"Bounding Messages for Free in Security Protocols.",
					"Triangulations of Line Segment Sets in the Plane.",
					"Reconstructing Convex Polygons and Polyhedra from Edge and Face Counts in Orthogonal Projections.",
					"Finding a Rectilinear Shortest Path in R2 Using Corridor Based Staircase Structures.",
					"Compressed Dynamic Tries with Applications to LZ-Compression in Sublinear Time and Space.",
					"Stochastic Müller Games are PSPACE-Complete.",
					"Solving Parity Games in Big Steps.",
					"Efficient and Expressive Tree Filters.",
					"Markov Decision Processes with Multiple Long-Run Average Objectives.",
					"A Formal Investigation of.",
					"Probabilistic Analysis of the Degree Bounded Minimum Spanning Tree Problem.",
					"Undirected Graphs of Entanglement 2.",
					"Acceleration in Convex Data-Flow Analysis.",
					"Model Checking Almost All Paths Can Be Less Expensive Than Checking All Paths.",
					"Closures and Modules Within Linear Logic Concurrent Constraint Programming."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "26th FSTTCS 2006",
		"info": "Kolkata, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2006",
				"sub_name": "FSTTCS 2006: Foundations of Software Technology and Theoretical Computer Science, 26th International Conference, Kolkata, India, December 13-15, 2006, Proceedings.",
				"count": 38,
				"papers": [
					"Shared-Variable Concurrency: A Proposal.",
					"Hennessy-Plotkin-Brookes Revisited.",
					"Approximation Algorithms for 2-Stage Stochastic Optimization Problems.",
					"The Number of Crossing Free Configurations on Finite Point Sets in the Plane.",
					"Normal and Feature Approximations from Noisy Point Clouds.",
					"Coresets for Discrete Integration and Clustering.",
					"Self-assemblying Classes of Shapes with a Minimum Number of Tiles, and in Optimal Time.",
					"One-Input-Face MPCVP Is Hard for L, But in LogDCFL.",
					"Hardness of Approximation Results for the Problem of Finding the Stopping Distance in Tanner Graphs.",
					"Multi-stack Boundary Labeling Problems.",
					"Computing a Center-Transversal Line.",
					"On Obtaining Pseudorandomness from Error-Correcting Codes.",
					"Fast Edge Colorings with Fixed Number of Colors to Minimize Imbalance.",
					"Zero Error List-Decoding Capacity of the q/(q-1) Channel.",
					"Fast Exponential Algorithms for Maximum r-Regular Induced Subgraph Problems.",
					"Solving Connected Dominating Set Faster Than 2n.",
					"Linear-Time Algorithms for Two Subtree-Comparison Problems on Phylogenetic Trees with Different Species.",
					"Computationally Sound Symbolic Secrecy in the Presence of Hash Functions.",
					"Some Results on Average-Case Hardness Within the Polynomial Hierarchy.",
					"Unbiased Rounding of Rational Matrices.",
					"Rational Behaviour and Strategy Construction in Infinite Multiplayer Games.",
					"The Anatomy of Innocence Revisited.",
					"Testing Probabilistic Equivalence Through Reinforcement Learning.",
					"On Decidability of LTL Model Checking for Process Rewrite Systems.",
					"Monitoring of Real-Time Properties.",
					"A Proof System for the Linear Time µ-Calculus.",
					"Tree Automata Make Ordinal Theory Easy.",
					"Context-Sensitive Dependency Pairs.",
					"On Reduction Criteria for Probabilistic Reward Models.",
					"Distributed Synthesis for Well-Connected Architectures.",
					"The Meaning of Ordered SOS.",
					"Almost Optimal Strategies in One Clock Priced Timed Games.",
					"Expressivity Properties of Boolean.",
					"On Continuous Timed Automata with Input-Determined Guards.",
					"Safely Freezing LTL.",
					"Branching Pushdown Tree Automata.",
					"Validity Checking for Finite Automata over Linear Arithmetic Constraints.",
					"Game Semantics for Higher-Order Concurrency."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "25th FSTTCS 2005",
		"info": "Hyderabad, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2005",
				"sub_name": "FSTTCS 2005: Foundations of Software Technology and Theoretical Computer Science, 25th International Conference, Hyderabad, India, December 15-18, 2005, Proceedings.",
				"count": 45,
				"papers": [
					"Semiperfect-Information Games.",
					"Computational Complexity Since 1980.",
					"Developments in Data Structure Research During the First 25 Years of FSTTCS.",
					"Inference Systems for Logical Algorithms.",
					"From Logic to Games.",
					"Proving Lower Bounds Via Pseudo-random Generators.",
					"Erdös Magic.",
					"No Coreset, No Cry: II.",
					"Improved Bounds on the Union Complexity of Fat Objects.",
					"On the Bisimulation Congruence in chi-Calculus.",
					"Extending Howe's Method to Early Bisimulations for Typed Mobile Embedded Resources with Local Names.",
					"Approximation Algorithms for Wavelength Assignment.",
					"The Set Cover with Pairs Problem.",
					"Non-disclosure for Distributed Mobile Code.",
					"Quantitative Models and Implicit Complexity.",
					"The MSO Theory of Connectedly Communicating Processes.",
					"Reachability of Hennessy-Milner Properties for Weakly Extended PRS.",
					"Decision Procedures for Queues with Integer Constraints.",
					"The Directed Planar Reachability Problem.",
					"Dimensions of Copeland-Erdös Sequences.",
					"Refining the Undecidability Frontier of Hybrid Automata.",
					"When Are Timed Automata Weakly Timed Bisimilar to Time Petri Nets?",
					"Subquadratic Algorithms for Workload-Aware Haar Wavelet Synopses.",
					"Practical Algorithms for Tracking Database Join Sizes.",
					"On Sampled Semantics of Timed Systems.",
					"Eventual Timed Automata.",
					"Causal Closure for MSC Languages.",
					"Reachability Analysis of Multithreaded Software with Asynchronous Communication.",
					"Probabilistic Analysis for a Multiple Depot Vehicle Routing Problem.",
					"Computing the Expected Accumulated Reward and Gain for a Subclass of Infinite Markov Chains.",
					"Towards a CTL* Tableau.",
					"Bisimulation Quantified Logics: Undecidability.",
					"Logarithmic-Time Single Deleter, Multiple Inserter Wait-Free Queues and Stacks.",
					"Monitoring Stable Properties in Dynamic Peer-to-Peer Distributed Systems.",
					"On the Expressiveness of TPTL and MTL.",
					"Modal Strength Reduction in Quantified Discrete Duration Calculus.",
					"Comparing Trees Via Crossing Minimization.",
					"On Counting the Number of Consistent Genotype Assignments for Pedigrees.",
					"Fixpoint Logics on Hierarchical Structures.",
					"The Equivalence Problem for Deterministic MSO Tree Transducers Is Decidable.",
					"Market Equilibrium for CES Exchange Economies: Existence, Multiplicity, and Computation.",
					"Testing Concurrent Systems: An Interpretation of Intuitionistic Logic.",
					"Proofs of Termination of Rewrite Systems for Polytime Functions.",
					"On the Controller Synthesis for Finite-State Markov Decision Processes.",
					"Reasoning About Quantum Knowledge."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "24th FSTTCS 2004",
		"info": "Chennai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2004",
				"sub_name": "FSTTCS 2004: Foundations of Software Technology and Theoretical Computer Science, 24th International Conference, Chennai, India, December 16-18, 2004, Proceedings.",
				"count": 43,
				"papers": [
					"Genome Halving Problem Revisited.",
					"Verifying Probabilistic Procedural Programs.",
					"Streaming Algorithms for Geometric Problems.",
					"Toward a Grainless Semantics for Shared-Variable Concurrency.",
					"Regular Languages, Unambiguous Concatenation and Computational Complexity.",
					"Decidability of Zenoness, Syntactic Boundedness and Token-Liveness for Dense-Timed Petri Nets.",
					"On the Urgency Expressiveness.",
					"Asynchronous Automata-Theoretic Characterization of Aperiodic Trace Languages.",
					"A Decidable Fragment of Separation Logic.",
					"Approximate Range Searching Using Binary Space Partitions.",
					"Representable Disjoint NP-Pairs.",
					"Symbolic Reachability Analysis of Higher-Order Context-Free Processes.",
					"Optimal Strategies in Priced Timed Game Automata.",
					"A Calculus for Trust Management.",
					"Short-Cuts on Star, Source and Planar Unfoldings.",
					"Subdividing Alpha Complex.",
					"Real-Counter Automata and Their Decision Problems.",
					"Adjunct Elimination Through Games in Static Ambient Logic.",
					"On the Bisimulation Invariant Fragment of Monadic S1 in the Finite.",
					"On the Complexity of Hilbert's 17th Problem.",
					"Who is Pointing When to Whom?",
					"An Almost Linear Time Approximation Algorithm for the Permanen of a Random (0-1) Matrix.",
					"Distributed Games with Causal Memory Are Decidable for Series-Parallel Systems.",
					"Expand, Enlarge, and Check: New Algorithms for the Coverability Problem of WSTS.",
					"Minimum Weight Pseudo-Triangulations.",
					"Join Algorithms for the Theory of Uninterpreted Functions.",
					"No, Coreset, No Cry.",
					"Hardness Hypotheses, Derandomization, and Circuit Complexity.",
					"Improved Approximation Algorithms for Maximum Graph Partitioning Problems.",
					"Learning Languages from Positive Data and a Finite Number of Queries.",
					"The Complexity of the Local Hamiltonian Problem.",
					"Quantum and Classical Communication-Space Tradeoffs from Rectangle Bounds.",
					"Adaptive Stabilization of Reactive Protocols.",
					"Visibly Pushdown Games.",
					"Refinement and Separation Contexts.",
					"Decidability of MSO Theories of Tree Structures.",
					"Distributed Algorithms for Coloring and Domination in Wireless Ad Hoc Networks.",
					"Monotone Multilinear Boolean Circuits for Bipartite Perfect Matching Require Exponential Size.",
					"Testing Geometric Convexity.",
					"Complexity of Linear Connectivity Problems in Directed Hypergraphs.",
					"Actively Learning to Verify Safety for FIFO Automata.",
					"Reasoning About Game Equilibria Using Temporal Logic.",
					"Alternation in Equational Tree Automata Modulo XOR."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "23rd FSTTCS 2003",
		"info": "Mumbai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2003",
				"sub_name": "FST TCS 2003: Foundations of Software Technology and Theoretical Computer Science, 23rd Conference, Mumbai, India, December 15-17, 2003, Proceedings.",
				"count": 38,
				"papers": [
					"A Cryptographically Sound Security Proof of the Needham-Schroeder-Lowe Public-Key Protocol.",
					"Constructions of Sparse Asymmetric Connectors: Extended Abstract.",
					"A Separation Logic for Resource Distribution: Extended Abstract.",
					"An Equational Theory for Transactions.",
					"Axioms for Regular Words: Extended Abstract.",
					"1-Bounded TWA Cannot Be Determinized.",
					"Reachability Analysis of Process Rewrite Systems.",
					"Pushdown Games with Unboundedness and Regular Conditions.",
					"Real-Time Model-Checking: Parameters Everywhere.",
					"The Caucal Hierarchy of Infinite Graphs in Terms of Logic and Higher-Order Pushdown Automata.",
					"Deciding the Security of Protocols with Diffie-Hellman Exponentiation and Products in Exponents.",
					"Subtyping Constraints in Quasi-lattices.",
					"An Improved Approximation Scheme for Computing Arrow-Debreu Prices for the Linear Case.",
					"Word Equations over Graph Products.",
					"Analysis and Experimental Evaluation of a Simple Algorithm for Collaborative Filtering in Planted Partition Models: Extended Abstract.",
					"Comparing Sequences with Segment Rearrangements.",
					"On Logically Defined Recognizable Tree Languages.",
					"Randomized Time-Space Tradeoffs for Directed Graph Connectivity.",
					"Distance-Preserving Approximations of Polygonal Paths.",
					"Joint Separation of Geometric Clusters and the Extreme Irregularities of Regular Polyhedra.",
					"On the Covering Steiner Problem.",
					"Minimality Results for the Spatial Logics.",
					"Algorithms for Non-uniform Size Data Placement on Parallel Disks.",
					"Efficient Algorithms for Abelian Group Isomorphism and Related Problems.",
					"Quasi-polynomial Time Approximation Algorithm for Low-Degree Minimum-Cost Steiner Trees.",
					"Model Checking and Satisfiability for Sabotage Modal Logic.",
					"Merging and Sorting By Strip Moves.",
					"The Macro Tree Transducer Hierarchy Collapses for Functions of Linear Size Increase.",
					"Distributed Games.",
					"Maintenance of Multidimensional Histograms.",
					"Tagging Makes Secrecy Decidable with Unbounded Nonces as Well.",
					"Quantum and Classical Complexity Classes: Separations, Collapses, and Closure Properties.",
					"On the Greedy Superstring Conjecture.",
					"Reasoning about Infinite State Systems Using Boolean Methods.",
					"Stringent Relativization.",
					"Component-Based Construction of Deadlock-Free Systems: Extended Abstract.",
					"Moderately Hard Functions: From Complexity to Spam Fighting.",
					"Zigzag Products, Expander Constructions, Connections, and Applications."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "22nd FSTTCS 2002",
		"info": "Kanpur, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2002",
				"sub_name": "FST TCS 2002: Foundations of Software Technology and Theoretical Computer Science, 22nd Conference Kanpur, India, December 12-14, 2002, Proceedings.",
				"count": 31,
				"papers": [
					"Primality Testing with Gaussian Periods.",
					"From Hilbert Spaces to Dilbert Spaces: Context Semantics Made Simple.",
					"Encoding Generic Judgments.",
					"Model Checking Algol-Like Languages Using Game Semantics.",
					"Modeling Software: From Theory to Practice.",
					"Local Normal Forms for Logics over Traces.",
					"On the Hardness of Constructing Minimal 2-Connected Spanning Subgraphs in Complete Graphs with Sharpened Triangle Inequality.",
					"Communication Interference in Mobile Boxed Ambients.",
					"The Seal Calculus Revisited: Contextual Equivalence and Bisimilarity.",
					"Composing Strand Spaces.",
					"Generalising Automaticity to Modal Properties of Finite Structures.",
					"An Automata-Theoretic Approach to Constraint LTL.",
					"Hardness Results for Multicast Cost Sharing.",
					"How to Compose Presburger-Accelerations: Applications to Broadcast Protocols.",
					"State Space Reductions for Alternating Büchi Automata.",
					"Algorithmic Combinatorics Based on Slicing Posets.",
					"Pattern Matching for Arc-Annotated Sequences.",
					"Knowledge over Dense Flows of Time (from a Hybrid Point of View).",
					"The Complexity of the Inertia.",
					"The Quantum Communication Complexity of the Pointer Chasing Problem: The Bit Version.",
					"The Decidability of the First-Order Theory of the Knuth-Bendix Order in the Case of Unary Signatures.",
					"Deciding the First Level of the µ-Calculus Alternation Hierarchy.",
					"Dynamic Message Sequence Charts.",
					"The Complexity of Compositions of Deterministic Tree Transducers.",
					"On the Hardness of Approximating Minimum Monopoly Problems.",
					"Hereditary History Preserving Bisimulation Is Decidable for Trace-Labelled Systems.",
					"Lower Bounds for Embedding Graphs into Graphs of Smaller Characteristic.",
					"Nearest Neighbors Search Using Point Location in Balls with Applications to Approximate Voronoi Decompositions.",
					"Formal Languages and Algorithms for Similarity Based Retrieval from Sequence Databases.",
					"Decomposition in Asynchronous Circuit Design.",
					"Queue Layouts, Tree-Width, and Three-Dimensional Graph Drawing."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "21st FSTTCS 2001",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2001",
				"sub_name": "FST TCS 2001: Foundations of Software Technology and Theoretical Computer Science, 21st Conference, Bangalore, India, December 13-15, 2001, Proceedings.",
				"count": 28,
				"papers": [
					"When Worlds Collide: Derandomization, Lower Bounds, and Kolmogorov Complexity.",
					"Approximation Schemes for Geometric NP-Hard Problems: A Survey.",
					"On Clustering Using Random Walks.",
					"An Introduction to Decidability of DPDA Equivalence.",
					"Semidefinite Programming Based Approximation Algorithms.",
					"Hard Sets and Pseudo-random Generators for Constant Depth Circuits.",
					"The First-Order Isomorphism Theorem.",
					"Thresholds and Optimal Binary Comparison Search Trees.",
					"Distributed LTL Model Checking Based on Negative Cycle Detection.",
					"Computability and Complexity Results for a Spatial Assertion Language for Data Structures.",
					"Using Nondeterminism to Design Deterministic Algorithms.",
					"Liveness Verification of Reversal-Bounded Multicounter Machines with a Free Counter.",
					"A Mechanically Verified Compiling Specification for a Lisp Compiler.",
					"Beyond Regular Model Checking.",
					"Relations Between Communication Complexity, Linear Arrangements, and Computational Complexity.",
					"Optimal, Output-Sensitive Algorithms for Constructing Upper Envelope of Line Segments in Parallel.",
					"List Decoding from Erasures: Bounds and Code Constructions.",
					"Verification of a Leader Election Algorithm in Timed Asynchronous Systems.",
					"Efficient Addition on Field Programmable Gate Arrays.",
					"The Directed Minimum-Degree Spanning Tree Problem.",
					"I/O-Efficient Batched Range Counting and Its Applications to Proximity Problems.",
					"Beyond Message Sequence Graphs.",
					"Grouping Techniques for One Machine Scheduling Subject to Precedence Constraints.",
					"Properties of Distributed Timed-Arc Petri Nets.",
					"From Falsification to Verification.",
					"On Polynomial Representations of Boolean Functions Related to Some Number Theoretic Problems.",
					"Range Allocation for Equivalence Logic.",
					"Rewrite Closure for Ground and Cancellative AC Theories."
				]
			}
		]
	},
	{
		"year": "2000",
		"name": "20th FSTTCS 2000",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/2000",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 20th Conference, FST TCS 2000 New Delhi, India, December 13-15, 2000, Proceedings.",
				"count": 42,
				"papers": [
					"Model Checking: Theory into Practice.",
					"An Algebra for XML Query.",
					"Irregularities of Distribution, Derandomization, and Complexity Theory.",
					"Rewriting Logic as a Metalogical Framework.",
					"Frequency Assignment in Mobile Phone Systems.",
					"Data Provenance: Some Basic Issues.",
					"Fast On-Line/Off-Line Algorithms for Optimal Reinforcement of a Network and Its Connections with Principal Partition.",
					"On-Line Edge-Coloring with a Fixed Number of Colors.",
					"On Approximability of the Independent/Connected Edge Dominating Set Problems.",
					"Model Checking CTL Properties of Pushdown Systems.",
					"A Decidable Dense Branching-Time Temporal Logic.",
					"Fair Equivalence Relations.",
					"Arithmetic Circuits and Polynomial Replacement Systems.",
					"Depth-3 Arithmetic Circuits for Sn2(X) and Extensions of the Graham-Pollack Theorem.",
					"The Bounded Weak Monadic Quantifier Alternation Hierarchy of Equational Graphs Is Infinite.",
					"Combining Semantics with Non-standard Interpreter Hierarchies.",
					"Using Modes to Ensure Subject Reduction for Typed Logic Programs with Subtyping.",
					"Dynamically Ordered Probabilistic Choice Logic Programming.",
					"Coordinatized Kernels and Catalytic Reductions: An Improved FPT Algorithm for Max Leaf Spanning Tree and Other Problems.",
					"Planar Graph Blocking for External Searching.",
					"A Complete Fragment of Higher-Order Duration µ-Calculus.",
					"A Complete Axiomatisation for Timed Automata.",
					"Text Sparsification via Local Maxima.",
					"Approximate Swapped Matching.",
					"A Semantic Theory for Heterogeneous System Design.",
					"Formal Verification of the Ricart-Agrawala Algorithm.",
					"On Distribution-Specific Learning with Membership Queries versus Pseudorandom Generation.",
					"Theta2p-Completeness: A Classical Approach for New Results.",
					"Is the Standard Proof System for SAT P-Optimal?",
					"A General Framework for Types in Graph Rewriting.",
					"The Ground Congruence for Chi Calculus.",
					"Inheritance in the Join Calculus.",
					"Approximation Algorithms for Bandwidth and Storage Allocation Problems under Real Time Constraints.",
					"Dynamic Spectrum Allocation: The Impotency of Duration Notification.",
					"The Fine Structure of Game Lambda Models.",
					"Strong Normalization of Second Order Symmetric lambda-Calculus.",
					"Scheduling to Minimize the Average Completion Time of Dedicated Tasks.",
					"Hunting for Functionally Analogous Genes.",
					"Keeping Track of the Latest Gossip in Shared Memory Systems.",
					"Concurrent Knowledge and Logical Clock Abstractions.",
					"Decidable Hierarchies of Starfree Languages.",
					"Prefix Languages of Church-Rosser Languages."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "19th FSTTCS 1999",
		"info": "Chennai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1999",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 19th Conference, Chennai, India, December 13-15, 1999, Proceedings.",
				"count": 36,
				"papers": [
					"Recent Developments in the Theory of Arrangements of Surfaces.",
					"Dynamic Compressed Hypertoctrees with Application to the N-Body Problem.",
					"Largest Empty Rectangle among a Point Set.",
					"Renaming is Necessary in Timed Regular Expressions.",
					"Product Interval Automata: A Subclass of Timed Automata.",
					"The Complexity of Rebalancing a Binary Search Tree.",
					"Fast Allocation and Deallocation with an Improved Buddy System.",
					"Optimal Bounds for Transformations of omega-Automata.",
					"CTL+ is Exponentially more Succinct than CTL.",
					"A Top-Down Look at a Secure Message.",
					"Explaining Updates by Minimal Sums.",
					"A Foundation for Hybrid Knowledge Bases.",
					"Hoare Logic for Mutual Recursion and Local Variables.",
					"Explicit Substitutions and Programming Languages.",
					"Approximation Algorithms for Routing and Call Scheduling in All-Optical Chains and Rings.",
					"A Randomized Algorithm for Flow Shop Scheduling.",
					"Synthesizing Distributed Transition Systems from Global Specification.",
					"Beyond Region Graphs: Symbolic Forward Analysis of Timed Automata.",
					"Implicit Temporal Query Languages: Towards Completeness.",
					"On the Undecidability of some Sub-Classical First-Order Logics.",
					"How to Compute with DNA.",
					"A High Girth Graph Construction and a Lower Bound for Hitting Set Size for Combinatorial Rectangles.",
					"Protecting Facets in Layered Manufacturing.",
					"The Receptive Distributed pi-Calculus (Extended Abstract).",
					"Series and Parallel Operations on Pomsets.",
					"Unreliable Failure Detectors with Limited Scope Accuracy and an Application to Consensus.",
					"Graph Isomorphism: Its Complexity and Algorithms (Abstract).",
					"Computing with Restricted Nondeterminism: The Dependence of the OBDD Size on the Number of Nondeterministic Variables.",
					"Lower Bounds for Linear Transformed OBDDs and FBDDs (Extende Abstract).",
					"A Unifying Framework for Model Checking Labeled Kripke Structures, Modal Transition Systems and Interval Transition Systems.",
					"Graded Modalities and Resource Bisimulation.",
					"The Non-Recursive Power of Erroneous Computation.",
					"Analysis of Quantum Functions (Preliminary Version).",
					"On Sets Growing Continously.",
					"Model Checking Knowledge and Time in Systems with Perfect Recall (Extended Abstract).",
					"The Engineering of some Bipartite Matching Programs."
				]
			}
		]
	},
	{
		"year": "1998",
		"name": "18th FSTTCS 1998",
		"info": "Chennai, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1998",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 18th Conference, Chennai, India, December 17-19, 1998, Proceedings.",
				"count": 34,
				"papers": [
					"Descriptive Complexity and Model Checking.",
					"Approximation Algorithms with Bounded Performance Guarantees for the Clustered Traveling Salesman Problem.",
					"A Hamiltonian Approach to the Assignment of Non-reusable Frequencies.",
					"Deadlock Sensitive Types for Lambda Calculus with Resources.",
					"On Encoding p-pi in m-pi.",
					"Improved Methods for Approximating Node Weighted Steiner Trees and Connected Dominating Sets.",
					"Red-Black Prefetching: An Approximation Algorithm for Parallel Disk Scheduling.",
					"A Synchronous Semantics of Higher-Order Processes for Modeling Reconfigurable Reactive Systems.",
					"Testing Theories for Asynchronous Languages.",
					"Alternative Computational Models: A Comparison of Biomolecular and Quantum Computation.",
					"Optimal Regular Tree Pattern Matching Using Pushdown Automata.",
					"Locating Matches of Tree Patterns in Forests.",
					"Benefits of Tree Transducers for Optimizing Functional Programs.",
					"Implementable Failure Detectors in Asynchronous Systems.",
					"BRICS and Quantum Information Processing.",
					"Martingales and Locality in Distributed Computing.",
					"Space Efficient Suffix Trees.",
					"Formal Verification of an O. S. Submodule.",
					"Infinite Probabilistic and Nonprobabilistic Testing.",
					"On Generating Strong Elimination Orderings of Strongly Chordal Graphs.",
					"A Parallel Approximation Algorithm for Minimum Weight Triangulation.",
					"The Power of Reachability Testing for Timed Automata.",
					"Recursive Mean-Value Calculus.",
					"Efficient Formal Verification of Hierarchical Descriptions.",
					"Proof Rules for Model Checking Systems with Data.",
					"Partial Order Reductions for Bisimulation Checking.",
					"First-Order-CTL Model Checking.",
					"On the Complexity of Counting the Number of Vertices Moved by Graph Automorphisms.",
					"Remarks on Graph Complexity.",
					"On the Confluence of Trace Rewriting Systems.",
					"A String-Rewriting Characterization of Muller and Schupp's Context-Free Graphs.",
					"Different Types of Monotonicity for Restarting Automata.",
					"A Kleene Iteration for Parallelism.",
					"Quantum Computation and Information."
				]
			}
		]
	},
	{
		"year": "1997",
		"name": "17th FSTTCS 1997",
		"info": "Kharagpur, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1997",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 17th Conference, Kharagpur, India, December 18-20, 1997, Proceedings.",
				"count": 23,
				"papers": [
					"QSM: A General Purpose Shared-Memory Model for Parallel Computation.",
					"Approximating Geometric Domains through Topological Triangulations.",
					"Solving Some Discrepancy Problems in NC.",
					"Graph Editing to Bipartite Interval Graphs: Exact and Asymtotic Bounds.",
					"Model Cheking.",
					"Recursion Versus Iteration at Higher-Orders.",
					"Compilation and Equivalence of Imperative Objects.",
					"On the Expressive Power of Rewriting.",
					"Mechanizing Verification of Arithmetic Circuits: SRT Division.",
					"On the Complexity of Parallel Implementation of Logic Programs.",
					"An Abductive Semantics for Disjunctive Logic Programs and Its Proof Procedure.",
					"Assumption-Commitment in Automata.",
					"Compositional Design of Multitolerant Repetitive Byzantine Agreement.",
					"Algorithmic Issues in Coding Theory.",
					"Sharper Results on the Expressive Power of Generalized Quantifiers.",
					"Improved Lowness Results for Solvable Black-box Group Problems.",
					"On Resource-Bounded Measure and Pseudorandomness.",
					"Verification of Open Systems.",
					"Hoare-Style Compositional Proof Systems for Reactive Shared Variable Concurency.",
					"A Simple Characterization of Stuttering Bisimulation.",
					"General Refinement for High Level Petri Nets.",
					"Polynomial-Time Manz-One Reductions for Petri Nets.",
					"Computing Reachability Properties Hidden in Finite Net Unfoldings."
				]
			}
		]
	},
	{
		"year": "1996",
		"name": "16th FSTTCS 1996",
		"info": "Hyderabad, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1996",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 16th Conference, Hyderabad, India, December 18-20, 1996, Proceedings.",
				"count": 32,
				"papers": [
					"Circuit Complexity before the Dawn of the New Millennium.",
					"A Lambda Calculus with Letrecs and Barriers.",
					"Tables.",
					"Mechanized Formal Methods: Progress and Prospects.",
					"The Parameter Space of the d-step Conjecture.",
					"On the Complexity of Approximating Euclidean Traveling Salesman Tours and Minimum Spanning Trees.",
					"Efficient Computation of Rectilinear Geodesic Voronoi Neighbor in Presence of Obstacles.",
					"Weak Bisimulation and Model Checking for Basic Parallel Processes.",
					"Testing Processes for Efficiency.",
					"Regularity is Decidable for Normed PA Processes in Polynomial Time.",
					"Dynamic Maintenance of Shortest Path Trees in Simple Polygons.",
					"Close Approximation of Minimum Rectangular Coverings.",
					"A New Competitive Algorithm for Agent Searching in Unknown Streets.",
					"On the Design of Hybrid Control Systems Using Automata Models.",
					"Constraint Reaction in FD.",
					"Winskel is (Almost) Right: Towards a Mechanized Semantics Textbook.",
					"An Optimal Deterministic Algorithm for Online b-Matching.",
					"Tight Bounds for Prefetching and Buffer Management Algorithms for Parallel I/O Systems.",
					"Complexity of the Gravitational Method for Linear Programming.",
					"Optimal and Information Theoretic Syntactic Pattern Recognition Involving Traditional and Transposition Errors.",
					"Minimal Relative Normalization in Orthogonal Expression Reduction Systems.",
					"Trace Consistency and Inevitablity.",
					"Finite State Implementations of Knowledge-Based Programs.",
					"Higher-Order Proof by Consistency.",
					"Advocating Ownership.",
					"Non-cancellative Boolean Circuits: A Generalization of Monotone Boolean Circuits.",
					"Limitations of the QRQW and EREW PRAM Models.",
					"Pinpointing Computation with Modular Queries in the Boolean Hierarchy.",
					"Characterization of the Principal Type of Normal Forms in an Intersection Type System.",
					"Correcting Errors in the Curry System.",
					"Immediate Fixpoints and Their Use in Groundness Analysis.",
					"Graph Types for Monadic Mobile Processes."
				]
			}
		]
	},
	{
		"year": "1995",
		"name": "15th FSTTCS 1995",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1995",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 15th Conference, Bangalore, India, December 18-20, 1995, Proceedings.",
				"count": 35,
				"papers": [
					"Looking for MUM and DAD: Text-Text Comparisons Do Help.",
					"Branch and Bound on the Network Model.",
					"A Near Optimal Algorithm for the Extended Cow-Path Problem in the Presence of Relative Errors.",
					"Efficient Algorithms for Vertex Arboricity of Planar Graphs.",
					"A Condition for the Three Colourability of Planar Locally Path Graphs.",
					"A Framework for the Specification of Reactive and Concurrent Systems in Z.",
					"Synthesizing Different Development Paradigms: Combining Top-Down with Bottom-Up Reasoning About Distributed Systems.",
					"Verifying Part of the ACCESS.bus Protocol Using PVS.",
					"Reusing Batch Parsers as Incremental Parsers.",
					"The Expressive Power of Indeterminate Primitives in Asynchronous Computation.",
					"The Transformation Calculus.",
					"Equational Axiomatization of Bicoercibility for Polymorphic Types.",
					"From Causal Consistency to Sequential Consistency in Shared Memory Systems.",
					"Observation of Software for Distributed Systems with RCL.",
					"Partiality and Approximation Schemes for Local Consistency in Networks of Constraints.",
					"Maximal Extensions os Simplification Orderings.",
					"Average Polynominal Time Is Hard for Exponential Time Under sn-Reductions.",
					"On Self-Testing without the Generator Bottleneck.",
					"Obseving Behaviour Categorically.",
					"An Algorithm for Reducing Binary Branchings.",
					"On the Complexity of Bisimilarity for Value-Passing Processes (Extended Abstract).",
					"On the Expressive Power of CCS.",
					"Polarized Name Passing.",
					"Path Balance Heuristic for Self-Adjusting Binary Search Trees.",
					"Pattern Matching in Compressed Texts.",
					"All-Pairs Min-Cut in Sparse Networks.",
					"Minimizing Space Usage in Evaluation of Expression Trees.",
					"Smooth Surfaces for Multi-Scale Shape Representation.",
					"On Parallel Complexity of Planar Triangulations.",
					"Computing a Largest Empty Anchored Cylinder, and Related Problems.",
					"Computing Hierarchies of Clusters from the Euclidean Minimum Spanning Tree in Linear Time.",
					"Determinizing Büchi Asnchronous Automata.",
					"Achilles and the Tortoise Climbing Up the Arithmetical Hierarchy.",
					"Generalized Temporal Verification Diagrams.",
					"Model Checking of Probabalistic and Nondeterministic Systems."
				]
			}
		]
	},
	{
		"year": "1994",
		"name": "14th FSTTCS 1994",
		"info": "Madras, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1994",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 14th Conference, Madras, India, December 15-17, 1994, Proceedings.",
				"count": 36,
				"papers": [
					"Efficient Resolution of Singularities of Plane Curves.",
					"On the Interactive Complexity of Graph Reliability.",
					"Matching Upper and Lower Bounds for Simulation of Several Tapes on One Multidimensional Tape.",
					"The Complexity of Computing over Quasigroups.",
					"Non-commutative Computation, Depth Reduction, and Skew Circuits (Extended Abstract).",
					"Inductive Definitions and Type Theory: an Introduction (Preliminary Version).",
					"Interpreter Verification for a Functional Language.",
					"An Epistemic Foundation for Logic Programming with Uncertainty.",
					"On Typed Calculi with a Merge Operator.",
					"Incremental Algorithms for the Single-Source Shortest Path Problem.",
					"An O(n) Algorithm for Realizing Degree Sequences.",
					"Coloring Semi-Random Graphs in Polynomial Expected Time.",
					"Finite-State Strategies in Regular Infinite Games.",
					"Location of the Largest Empty Rectangle among Arbitrary Obstacles.",
					"Efficient Parallel and Linear Time Sequential Split Decomposition (Extended Abstract).",
					"Algorithms for Convex Visibility Problems.",
					"Lower Bounds for Parallel Algebraic Decision Trees, Complexity of Convex Hulls and Related Problems.",
					"Localities and Failures (Extended Abstract).",
					"Priority and Abstraction in Process Algebra.",
					"On the Computational Power of Operators in ICSP with Fairness.",
					"Decidability of Timed Language-Inclusion for Networks of Real-Time Communicating Sequential Processes.",
					"My Favorite Ten Complexity Theorems of the Past Decade.",
					"Solving a Unification Problem under Constrained Substitutions Using Tree Automata.",
					"Automata-Driven Efficient Subterm Unification.",
					"Randomized Approximation Algorithms in Combinatorial Optimization.",
					"A Limited-Backtrack Greedy Schema for Approximation Algorithms.",
					"On Approximation Scheme Preserving Reducability and Its Applications.",
					"Approximation Schemes Using L-Reductions.",
					"An Explanation of Splaying.",
					"Proving Non-Reachabililty by Modulo-Place-Invariants.",
					"Soundness and Completeness of UNITY Logic.",
					"Efficient Algorithms for the Transformation Betweeen Different Types of Binary Decision Diagrams.",
					"Extending the Limits of Sequentially Phased Reasoning.",
					"Foundations for Faster External Sorting (Extended Abstract).",
					"Branching Rules for Satisfiability (Extended Abstract).",
					"Using Linear Arithmetic Procedure for Generating Induction Schemes."
				]
			}
		]
	},
	{
		"year": "1993",
		"name": "13th FSTTCS 1993",
		"info": "Bombay, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1993",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 13th Conference, Bombay, India, December 15-17, 1993, Proceedings.",
				"count": 38,
				"papers": [
					"Some Observations About the Nature of Computer Science.",
					"Essential Intersection Type Assignment.",
					"Label-Selective lambda-Calculus Syntax and Confluence.",
					"Conventional and Uniqueness Typing in Graph Rewrite Systems.",
					"A Meta-Language for Typed Object-Oriented Languages.",
					"Preemption in Concurrent Systems.",
					"Local Versus Non-local Computation of Length of Digitized Curves.",
					"Data-Independences of Parallel Random Access Machines.",
					"Proving Termination of Logic Programs by Transforming them into Equivalent Term Rewriting Systems.",
					"Completeness of Hierarchical Combinations of term Rewriting Systems.",
					"Higher-Order and Semantic Unification.",
					"A Conservative Extension of First-order Logic and Its Application to Theorem Proving.",
					"Well-Founded Ordered Search (Extended Abstract).",
					"A Real-Time Interval Logic and Its Decision Procedure.",
					"On the Semantics of Optimization Predicates in CLP Languages.",
					"Incremental Algorithms for Constraint Solving and Entailment over Rational Trees.",
					"Proximity Problems and the Voronoi Diagram an a Rectilinear Plane with Rectangular Obstacles.",
					"Feasability of Design in Stereolithography.",
					"Compact Location Problems.",
					"On Some Communication Complexity Problems Related to THreshold Functions.",
					"Recursiveness over the Complex Numbers is Time-Bounded.",
					"A lOwer Bound for Solvability of Polynomial Equations.",
					"Reuse of Proofs in Software Verification.",
					"Induce-Statements and Induce-Expressions: Constructs for Inductive Programming.",
					"A Graphic Language Based on Timing Diagrams.",
					"Panel on Software Technology: Integrating Theory and Practice.",
					"Generating Degrees of Belief from Statistical Information: An Overview.",
					"Complexity Results for 1-safe Nets.",
					"Some Results About Logical Descriptions of Non-Deterministic Behaviours.",
					"Order Structures and Generalisations of Szpilrajn's Theorem.",
					"ICSP and Its Relationship with ACSP and CSP.",
					"On Reduction-Based Semantics.",
					"Keeping Track of the Latest Gossip: Bounded Time-Stamps Suffice.",
					"Time Optimal Self-Stabilizing Spanning Tree Algorithms.",
					"Efficient Algorithm to Sort Linear Combinations of Arrays.",
					"A Simple File Structure for the Weighted Dictionary Problem.",
					"Searching, Sorting and Randomised Algorithms for Central Elements and Ideal Counting in Posets.",
					"Learning Classes of Regular and Linear Languages in Valiant's Learnability Framework."
				]
			}
		]
	},
	{
		"year": "1992",
		"name": "12th FSTTCS 1992",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1992",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 12th Conference, New Delhi, India, December 18-20, 1992, Proceedings.",
				"count": 31,
				"papers": [
					"System Specification and Refinement in Temporal Logic.",
					"Fixed Points of Büchi Automata.",
					"An Automata-Theoretic Decision Procedure for Future Interval Logic.",
					"Improving the Results of Static Analyses Programs by Local Decreasing Iteration.",
					"Implicit Point Location in Arrangements of Line Segments, with an Application to Motion Planning.",
					"An Optimal Algorithm for the Intersection Radius of a Set of Convex Polygons.",
					"C-sensitive Triangulations Approximate the MinMax Length Triangulation.",
					"Superpolynomial Circuits, Almost Sparse Oracles and the Exponential Hierarchy.",
					"Structural Average Case Complexity.",
					"On Bounded Truth-Table, Conjunctive, and Randomized Reductions to Sparse Sets.",
					"One-way Functions and Isomorphism Conjecture.",
					"Solving the Lagrangian Dual when the Number of Constraints is Fixed.",
					"Superfiniteness of Query Answers in Deductive Databases: An Automata-Theoretic Approach.",
					"Proving Polynomials Positive.",
					"An Abstract Interpretation Scheme for Groundedness, Freeness, and Sharing Analysis of Logic Programs.",
					"Polymorphic Typing by Abstract Interpretation.",
					"The Gallina Specification language: A Case Study.",
					"Verification of Large Software Systems.",
					"Detection of Unstable Predicates in Distributed Programs.",
					"Fast Sequential and Randomised Parallel Algorithms for Rigidity and approximate Min k-cut.",
					"Approximation Through Local Optimality: Designing Networks with Small Degree.",
					"Games and Full Completeness for Multiplicative Linear Logic (Extended Abstract).",
					"Real-Time Calculi and Expansion Theorems.",
					"Branching Bisimulation for Context-free Processes.",
					"CCS, Location and Asynchronous Transition Systems.",
					"Reasonong about Safety and Liveness Properties for Probabilistic Processes.",
					"String Matching Under a General Matching Relation.",
					"On the Complexity of Certified Write All Algorithms.",
					"Selection from Read-Only Memory and Sorting with Optimum Data Movement.",
					"Some Observations on 2-way Probabilistic Finite Automata.",
					"Recent Developments in Algorithms for the Maximum-Flow Problem (Abstract)."
				]
			}
		]
	},
	{
		"year": "1991",
		"name": "11th FSTTCS 1991",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1991",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, 11th Conference, New Delhi, India, December 17-19, 1991, Proceedings.",
				"count": 28,
				"papers": [
					"Program Checking.",
					"Randomizing Reductions of Search Problems.",
					"Time Analysis, Cost Equivalence and Program Refinement.",
					"AC-Equation Solving.",
					"On the Operational Interpretation of Complex Types.",
					"Tense Logics for Local Reasoning in Distributed Systems.",
					"Failures Semantics for a Simple Process Language with Refinement.",
					"Correstness of Programs over Poor Signatures.",
					"Complexity Issues for Vacillatory Function Identification.",
					"A Purely Algebraic Proof of McNaughton's Theorem on Infinite Words.",
					"The Structure and Complexity of Minimal NFA's over a Unary Alphabet.",
					"Relativised Cellular Automata and Complexity Classes.",
					"Computing the Order of a Locally Testable Automaton.",
					"On the Structure and Complexity of Infinite Sets with Minimal Perfect Hash Functions.",
					"NP-hard Sets and Creativeness over Constant Time Languages.",
					"Complete Problems Involving Boolean Labelled Structures and Projections Translations.",
					"Is BP.+P a Probabilistic Class?",
					"Fast Sorting In-Place Sorting with O(n) Data.",
					"A Theorem on the Approximation of Set Cover and Vertex Cover.",
					"A Fast Algorithm for the Principle Partition of a Graph.",
					"Uniform Circuits and Exclusive Read PRAMs.",
					"Contracting Planar Graphs Efficiency in Parallel.",
					"Fast Deterministic Selection on Mesh-Connected Processor Arrays.",
					"Improved Selection on Totally Monotone Arrays.",
					"Designing Secure Communication Protocols from Trust Specifications.",
					"Computing the Shortest Path Tree in a Weak Visibility Polygon.",
					"Usefulness of Angle-Sweep over Line-Sweep.",
					"Petri Nets and Transition Systems (Abstract for an invited talk)."
				]
			}
		]
	},
	{
		"year": "1990",
		"name": "10th FSTTCS 1990",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1990",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Tenth Conference, Bangalore, India, December 17-19, 1990, Proceedings.",
				"count": 30,
				"papers": [
					"Reasoning About Linear Constraints Using Parametric Queries.",
					"Discriminant Circumscription.",
					"Complexity of Algebraic Specification.",
					"A New Method for Undecidability Proofs of First Order Theories.",
					"Generating Plans in Linear Logic.",
					"Automata-Theoretic Techniques for Image Generation and Compression.",
					"Recognizable Infinite Tree Sets and their Complexity.",
					"The Expressibility of Nondeterministic Auxiliary Stack Automata and its Relation to Treesize Bounded Alternating Auxiliary Pushdown Automata.",
					"Towards Constructive Program Derivation in VDM.",
					"A New Method for Proving Termination of AC-Rewrite Systems.",
					"Efficient Parallel Algorithms for Optical Computing with the DFT Primitive.",
					"The Power of Collision: Randomized Parallel Algorithms for Chaining and Integer Sorting.",
					"Fast Parallel Algorithms for Cographs.",
					"Optimally Representing Euclidean Space Discretely for Analogically Simulating Physical Phenomena.",
					"Optimal Parallel Algorithms for Testing Isomorphism of Trees and Outerplanar Graphs.",
					"Randomized Parallel Selection.",
					"A Fast Parallel Algorithm for Finding a Maximal Bipartite Set.",
					"On Parallel Evaluation of Classes of Circuits.",
					"Voronoi Diagrams of Moving Points in the Plane.",
					"Efficient algorithms for Identifying All Maximal Isothetic Empty Rectangles in VLSI Layout Design.",
					"On Some Largest Empty Orthoconvex Polygons in a Point Set.",
					"Defining Process Fairness for Non-Interleaving Concurrency.",
					"Observational Logics and Concurrency Models.",
					"Distributed Reset (Extended Abstract).",
					"Refinement and Composition of Transition-based Rely-Guarantee Specification with Auxiliary Variables.",
					"Efficient Algorithms for Crash Recovery in Distributed Systems.",
					"A Non-Standard Inductive Semantics.",
					"Relating Full Abstraction Results for Different Programming Languages.",
					"Towards a Theory of Commonsense Visual Reasoning.",
					"Natural Language Processing, Complexity Theory and Logic (Extended Abstract)."
				]
			}
		]
	},
	{
		"year": "1989",
		"name": "9th FSTTCS 1989",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1989",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Ninth Conference, Bangalore, India, December 19-21, 1989, Proceedings.",
				"count": 27,
				"papers": [
					"A Linear-Time Recognition Algorithm for P4-Reducible Graphs.",
					"Fast Parallel Approximations of hte Maximum Weighted Cut Problem through Derandomization.",
					"A New Class of Separators and Planarity of Chordal Graphs.",
					"Optimal Parallel Algorithms on Circular-Arc Graphs.",
					"Algebraic Properties of The Space of Multivalued and Paraconsistent Logic Programs.",
					"An Autoepistemic Logical View of Knowledge Base.",
					"A Natural Semantics for Logic Programs with Negation.",
					"A Transformation System for Deductive Database Modules with Perfect Model Semantics.",
					"An Efficient Distributed Algorithm for Finding Articulation Points, Bridges, and Biconnected Components in Asynchronous Networks.",
					"Impossibility Results in the Presence of Multiple Faulty Processes (Preliminary Version).",
					"An Adaptive Regulator Approach for the Design of Load Sharing Algorithms.",
					"An Algebraic Compositional Semantics of an Object Oriented Notation with Concurrency.",
					"An Axiomatization of Event Structures.",
					"Deducing Causal Relationships in CCS.",
					"Annotated Program Transformations.",
					"Algebraic Software Development Concepts for Module and Configuration Families.",
					"On the Limitations of Locally Robust Positive Reductions.",
					"Query Evaluation with Null Values: How Complex is Completeness?",
					"Average Case Complexity Analysis of RETE Pattern-Match Algorithm and Average Size of Join in Database.",
					"The Frobenius Problem.",
					"An Efficient Implicit Data Structure for Path Testing and Searching in Rooted Trees and Forests.",
					"Robust Decompositions of Polyhedra.",
					"Gate Matrix Layout Revisited: Algorithmic Performance and Probabilistic Analysis.",
					"Parallel Parsing on a One-way Linear Array of Finite-State Machines.",
					"Energy-Time Trade-offs in VLSI Computation.",
					"Time and Real-time in Programs.",
					"A Proof System for Communicating Processes with Value-passing (Extended Abstract)."
				]
			}
		]
	},
	{
		"year": "1988",
		"name": "8th FSTTCS 1988",
		"info": "Pune, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1988",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Eighth Conference, Pune, India, December 21-23, 1988, Proceedings.",
				"count": 33,
				"papers": [
					"Planar Point Location Revisited (A Guided Tour of a Decade of Research).",
					"Computing a Viewpoint of a Set of Points Inside a Polygon.",
					"Analysis of Preflow Push Algorithms for Maximum Network Flow.",
					"A New Linear Algorithm for the Two Path Problem on Chordal Graphs.",
					"Extending Planar Graph Algorithms to K 3, 3-free Graphs.",
					"Constant-Space String-Matching.",
					"Inherent Nonslicibility of Rectangular Duals in VLSI Floorplanning.",
					"Path Planning with Local Information.",
					"Linear Broadcast Routing.",
					"Predicting deadlock in Store-and-Forward Networks.",
					"On Parallel Sorting and Addition with Concurrent Writes.",
					"On Optimal Parallel Algorithm for Sorting Presorted Files.",
					"Superlinear Speedup in Parallel State-Space Search.",
					"Circuit Definitions of Nondeterministic Complexity Classes.",
					"Non-Uniform Proof System: A New Framework to Describe Non-Uniform and Probabalistic Complexity Classes.",
					"Padding, Commitment and Self-reducability.",
					"The Complexity of a Counting Finite-State Automaton.",
					"A Hierarchy Theorem for Pram-Based Complexity Classes.",
					"A Natural Deduction treatment of Operational Semantics.",
					"Unformly Applicative Structures, A Theory of Computability and Polyadic Functions.",
					"A Proof Technique for Register Automicity.",
					"Relation Level Semantics.",
					"A Constructive Set Theory for Program Development.",
					"McCarthy's Amb Cannot Implement Fair Merge.",
					"GHC - A Language for a New Age of Parallel Programming.",
					"Accumulators: A New Logic Variable Abstractions for Functional Languages.",
					"A Resolution Rule for Well-Formed Formulae.",
					"Algebraic and Operational Semantics of Positive/Negative Conditional Algebraic Specification.",
					"Semi-Unification.",
					"A Method to Check Knowledge Base Consistency.",
					"Knowledgebases as Structured Theories.",
					"On Functional Independencies.",
					"A Generic Algorithm for Transaction Processing During Network Partitioning."
				]
			}
		]
	},
	{
		"year": "1987",
		"name": "7th FSTTCS 1987",
		"info": "Pune, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1987",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Seventh Conference, Pune, India, December 17-19, 1987, Proceedings.",
				"count": 36,
				"papers": [
					"Algenraic Operational Semantics.",
					"On Ambiguity of DTOL Systems.",
					"The Equivalence Problem for n-Tape Finite Automata with Simple Cycles.",
					"Relating the Degree of Ambiguity of Finite Automata to the Succinctness of their Representation.",
					"Automata, Games, and Positive Monadic Theories of Trees.",
					"An Algorithm for Colouring Perfect Planar Graphs.",
					"Efficient Algorithms for Domination and Hamilton Circuit Problems on Permutation Graphs.",
					"Fast Parallel Algorithms for the Subgraph Homophormism and the Subgraph Isomorphism Problem for Classes of Planat Graphs.",
					"Improved Bounds for Covering General Polygons with Rectangles.",
					"Submodule Construction as Equation Solving CCS.",
					"Computations in Undistinguished Networks.",
					"A Distributed Algorithm to Implement N-Party Rendevouz.",
					"Merge and Termination in Process Algebra.",
					"Parallelism and Programming: A Perspective.",
					"On Optimal Parallelization of Sorting Networks.",
					"Parallel Algorithms for Approximate Edge Colouring of Simple graphs.",
					"An Optimal Randomized Routing Algorithm for the Mesh and A Class of Efficient Mesh-like Routing Networks.",
					"An O(n²) Algorithm for Fan-Out Free Query Optimization.",
					"Weak Consistency Of Read-only Transactions: A Tool to Improve Concurrency in Heterogeneous Locking Protocols.",
					"Optimizing Join Queries in Distributed Database.",
					"Reasoning in Systems of Equations and Inequations.",
					"Specification = Program + Types.",
					"Paraconsistent Logic Programming.",
					"Semantics of Distributed Horn Clause Programs.",
					"The Calculus of Constructions: State of the Art.",
					"Models for Re-Use.",
					"Hierarchical Refinement Of A Z Specification.",
					"Lazy pattern matching in the ML language.",
					"Program Development Using Lambda Abstraction.",
					"Relativized Arthur-Merlin versus Merlin-Arthur Games.",
					"Probabalistic Quantifiers vs. Distrustful Adversaries.",
					"On Certain Bandwidth Restricted Versions of the Satisfaiability Problem of Propositional CNF Formulas.",
					"A Look-Ahead Interpreter for Sequential Prolog and Its Implementation.",
					"Extension of Weakest Precondition Formalism to a Low Level Language.",
					"Retrospection on the Compiler Structure.",
					"Some Recent Applications of Knowledge."
				]
			}
		]
	},
	{
		"year": "1986",
		"name": "6th FSTTCS 1986",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1986",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Sixth Conference, New Delhi, India, December 18-20, 1986, Proceedings.",
				"count": 31,
				"papers": [
					"Software Development Graphs. A Unifying Concept for Software Development?",
					"Concurrent Runtime Checking of Annotated Ada Programs.",
					"Recovery of Noncurrent Variables in Source-Level Debugging of Optimized Code.",
					"Automatic Retargetable Code Generation: A New Technique.",
					"An Implementation of OBJ2: An Object-Oriented Language for Abstract Program Specification.",
					"Explicit Representation of Terms Defined by Counter Examples.",
					"A Framework for Intelligent Backtracking in Logic Programs.",
					"A Generalization of Backus' FP.",
					"Shortest-Path Motion.",
					"Via Assignment in Single Row Routing.",
					"Average-Case Analysis of the Modified Marmonic Algorithm.",
					"Covering Minima and Lattice Point Free Convex Bodies.",
					"Binary Decompositions and Acyclic Schemes.",
					"Thin Homogeneous Sets of Factors.",
					"Irreducible Polynomials over Finite Fields.",
					"Basis Reduction and Evidence for Transcendence of Certain Numbers.",
					"A Characterization of Asynchronous Message-Passing.",
					"Modular Synthesis of Deadlock-Free Control Structures.",
					"Distributed Resource Sharing in Computer Networks.",
					"On Proving Communication Closedness of Distributed Layers.",
					"A Distributed Algorithm for Edge-Disjoint Path Problem.",
					"Scheduling of Hard Real-Time Systems.",
					"A Polynomial Approximation Scheme for Machine Scheduling on Uniform Processors: Using the Dual Approximation Approach.",
					"Connectivity Algorithms Using Rubber-bands.",
					"On Simple and Creative Sets in NP.",
					"Complexity of Sufficient-Completeness.",
					"Sampling a Population with a Semi-Random Source.",
					"An Optimal Parallel Algorithm for Dynamic Expression Evaluation and Its Applications.",
					"Extension of the Parallel Nested Dissection Algorithm to Path Algebra Problems.",
					"On Synthesizing Systolic Arrays from Recurrence Equations with Linear Dependencies.",
					"An Efficient Parallel Algorithm for Term Matching."
				]
			}
		]
	},
	{
		"year": "1985",
		"name": "5th FSTTCS 1985",
		"info": "New Delhi, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1985",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Fifth Conference, New Delhi, India, December 16-18, 1985, Proceedings.",
				"count": 28,
				"papers": [
					"The Mathematics of Programming.",
					"Concurrent Programming Using Actors: Exploiting large-Scale Parallelism.",
					"A New Class of High Level Programs for Distributed Computing Systems.",
					"A Class of Termination Detection Algorithms For Distributed Computation.",
					"New Protocols for the Election od a Leader in a Ring.",
					"Program Simplification via Symbolic Interpretation.",
					"PROLOG-Based Inductive Theorem Proving.",
					"On the Calling Behaviour of Procedures.",
					"Approximation Algorithms for Planar Matching.",
					"Geometric Optimization and Polynomial Hierarchy.",
					"Deriving Object Octree from Images.",
					"Deduction with Relation Matching.",
					"Recursively Defined Domains and Their Induction Principles.",
					"Large Database Specification from Small Views.",
					"A Decision Method for Temporal Logic Based on Resolution.",
					"A Generalization of the Parikh Vector for Finite and Infinite Words.",
					"The Implication Problem for Functional and Multivalued Dependencies: An Algebraic Approach.",
					"A Simple Characterization of Database Serializability.",
					"Partial correctness semantics for CP [ , | , &].",
					"A Proof Technique for Rely/Guarantee Properties.",
					"A Complete System for SCCS with Modal Assertions.",
					"Demand-Driven Evaluation on Dataflow Machine.",
					"Design and Implementation for a Procedural VLSI Layout.",
					"VLSI Systems For Matrix Multiplication.",
					"Parallel Algorithms for Solving Certain Classes of Linear Recurrences.",
					"O(1) Parallel Time Incremental Graph Algorithms.",
					"NC Algorithms for Comparability Graphs, Interval Gaphs, and Testing for Unique Perfect Matching.",
					"Fast and Efficient Parallel Algorithms for the Exact Inversion of Integer Matrices."
				]
			}
		]
	},
	{
		"year": "1984",
		"name": "4th FSTTCS 1984",
		"info": "Bangalore, India",
		"venues": [
			{
				"sub_name_abbr": "conf/fsttcs/1984",
				"sub_name": "Foundations of Software Technology and Theoretical Computer Science, Fourth Conference, Bangalore, India, December 13-15, 1984, Proceedings.",
				"count": 29,
				"papers": [
					"Logic for Knowledge Representation.",
					"Logical Specification and Implementation.",
					"Process Specification of Logic Programs.",
					"Functional Programming System Revisited.",
					"Models and Transformations for Nondeterministic Extensions of Functional Programming.",
					"Degrees of Non-Determinism and Concurrency: A Petri Net View.",
					"Proof Rules for Communication Abstractions (Abstract).",
					"A Distributed Algorithm for Detecting Communication Deadlocks.",
					"On the Existence and Construction of Robust Communication Protocals for Unreliable Channels.",
					"Heuristic Search Approach to Optimal Routing in a Distributed Architecture.",
					"Replacement in Monotone Boolean Networks: An Algebraic Perspective.",
					"A New Characterization of BPP.",
					"Treating Terminals as Function Values of Time.",
					"Logics of Knowledge, Games and Dynamic Logic.",
					"Persistent First Class Procedures are Enough.",
					"Abstraction Concepts for Modeling Screen Oriented Dialogue Interfaces.",
					"VLSI Systems For Design Rule Checks.",
					"Bounds on the Length of Convex Partitions of Polygons.",
					"On Mapping Cube Graphs onto VLSI Arrays.",
					"A Linear-Time Algorithm for Determining the Intersection Type of Two Star Polygons.",
					"Eliminating Cascading Rollback in Structured Database.",
					"Recognition and Top-Down Generation of beta-Acyclic Database Schemes.",
					"Universal and Representative Instances Using Unmarked Nulls.",
					"On Some Computational Problems Related to Data Base Coding (Abstract).",
					"Generic Oracles (Abstract).",
					"Approximation Algorithm for Maximum Independent Set in Planar Tiangle-Free Graphs.",
					"Grid File Algorithms: An Analysis in the Biased Case.",
					"On the Mean Weight Balance Factor of Binary Trees.",
					"An Efficient Algorithm for Random Sampling without Replacement."
				]
			}
		]
	}
]