[
    {
        "name": "FUIN",
        "year": "2021",
        "info": "2021: Volumes\n178,\n179,\n180,\n181,\n182,\n183,\n184,",
        "count": 107,
        "papers": [
            "Preface.",
            "The Complexity of Model-Checking Tail-Recursive Higher-Order Fixpoint Logic.",
            "Verification and Parameter Synthesis for Real-Time Programs using Refinement of Trace Abstraction.",
            "Copyful Streaming String Transducers.",
            "Topological Characterisation of Multi-Buffer Simulation.",
            "Probabilistic Timed Automata with Clock-Dependent Probabilities.",
            "Stubborn Sets, Frozen Actions, and Fair Testing.",
            "Diamond Subgraphs in the Reduction Graph of a One-Rule String Rewriting System.",
            "Optimal Wirelength of Balanced Complete Multipartite Graphs onto Cartesian Product of {Path, Cycle} and Trees.",
            "Parallel Algorithms for Minimal Nondeterministic Finite Automata Inference.",
            "Causal-Consistent Replay Reversible Semantics for Message Passing Concurrent Programs.",
            "On the General Position Number of Complementary Prisms.",
            "Preface.",
            "Checking Sets of Pure Evolving Association Rules.",
            "An Improved Set-based Reasoner for the Description Logic 𝒟ℒD4, ×.",
            "Declarative Parameterized Verification of Distributed Protocols via the Cubicle Model Checker.",
            "A Multi-level Refinement Approach for Structural Synthesis of Optimal Probabilistic Models.",
            "Static Scheduling with Load Balancing for Solving Triangular Band Linear Systems on Multicore Processors.",
            "Digital Jordan Curves and Surfaces with Respect to a Closure Operator.",
            "On Variable Precision Generalized Rough Sets and Incomplete Decision Tables.",
            "Preface.",
            "Extensions of Elementary Cause-Effect Structures.",
            "Reasoning on the Efficiency of Distributed Complex Event Processing.",
            "Quantitative Verification of Stochastic Regular Expressions.",
            "Automated Comparative Study of Some Generalized Rough Approximations.",
            "A Novel Ensemble Model - The Random Granular Reflections.",
            "Encoding Threshold Boolean Networks into Reaction Systems for the Analysis of Gene Regulatory Networks.",
            "Computing Singular Elements Modulo Squares.",
            "Residuated Algebraic Structures in the Vicinity of Pre-rough Algebra and Decidability.",
            "On Rough Approximations of Languages under Infinite Index Indiscernibility Relations.",
            "Continuous Domains in Formal Concept Analysis.",
            "Using Hoare Logic in a Process Algebra Setting.",
            "Recognizing Visibility Graphs of Triangulated Irregular Networks.",
            "Scattered Context Grammars with One Non-Context-Free Production are Computationally Complete.",
            "Freeness Problem for Matrix Semigroups of Parikh Matrices.",
            "A New Description of Transversal Matroids Through Rough Set Approach.",
            "Preface.",
            "Self-Verifying Pushdown and Queue Automata.",
            "Two-Sided Strictly Locally Testable Languages.",
            "Decidability Questions for Insertion Systems and Related Models.",
            "A Complete Taxonomy of Restarting Automata without Auxiliary Symbols.",
            "Non-Self-Embedding Grammars and Descriptional Complexity.",
            "Generative Capacity of Contextual Grammars with Subregular Selection Languages.",
            "Languages Accepted by Weighted Restarting Automata.",
            "Causal Semantics for BPP Nets with Silent Moves.",
            "A Dynamical System Approach to Polyominoes Generation.",
            "Place the Vertices Anywhere on the Curve and Simplify.",
            "Preface.",
            "A Linear Bound on the k-rendezvous Time for Primitive Sets of NZ Matrices.",
            "On the Length of Shortest Strings Accepted by Two-way Finite Automata.",
            "Reversible Regular Languages: Logical and Algebraic Characterisations.",
            "Coinductive Algorithms for Büchi Automata.",
            "Separating the Words of a Language by Counting Factors.",
            "Preface.",
            "Persistent Stochastic Non-Interference.",
            "Complexity Assessments for Decidable Fragments of Set Theory. I: A Taxonomy for the Boolean Case.",
            "Adding Metalogic Features to Knowledge Representation Languages.",
            "Preface.",
            "Minimal Size of Counters for (Real-Time) Multicounter Automata.",
            "Physical Computational Complexity and First-order Logic.",
            "On Boolean Automata Networks (de)Composition.",
            "Improved Descriptional Complexity Results for Simple Semi-Conditional Grammars.",
            "Circular Interval-valued Computers and Simulation of (Red-green) Turing Machines.",
            "Relations between Control Mechanisms for Sequential Grammars.",
            "Free-choice Nets with Home Clusters are Lucent.",
            "Compression on the Twisted Jacobi Intersection.",
            "Polynomial-time Classification of Skew-symmetrizable Matrices with a Positive Definite Quasi-Cartan Companion.",
            "A Unified Method to Decentralized State Detection and Fault Diagnosis/prediction of Discrete-event Systems.",
            "Preface.",
            "Soundness Verification of Data-Aware Process Models with Variable-to-Variable Conditions.",
            "Parametric Schedulability Analysis of a Launcher Flight Control System under Reactivity Constraints.",
            "Parametric Analyses of Attack-fault Trees.",
            "Preface: Information Granulation in Data Science and Scalable Computing.",
            "KNN Loss and Deep KNN.",
            "A Detailed Study of the Distributed Rough Set Based Locality Sensitive Hashing Feature Selection Technique.",
            "Mining Clinical Process from Hospital Information System: A Granular Computing Approach.",
            "Exact and Approximate Algorithms for Computing Betweenness Centrality in Directed Graphs.",
            "Time-free Solution to Independent Set Problem using P Systems with Active Membranes.",
            "Efficient Algorithms for Maximum Induced Matching Problem in Permutation and Trapezoid Graphs.",
            "Edge Forcing in Butterfly Networks.",
            "Query-Points Visibility Constraint Minimum Link Paths in Simple Polygons.",
            "Testing Boolean Functions Properties.",
            "The Inverse of Ackermann Function is Computable in Linear Time.",
            "Perpetual Free-choice Petri Nets are Lucent Proof of a Theorem of van der Aalst Using CP-exhaustions.",
            "Preface.",
            "Articulations and Products of Transition Systems and their Applications to Petri Net Synthesis.",
            "Coverability, Termination, and Finiteness in Recursive Petri Nets.",
            "Investigating Reversibility of Steps in Petri Nets.",
            "Cost Problems for Parametric Time Petri Nets.",
            "The Complexity of Synthesis of b-Bounded Petri Nets.",
            "Preface.",
            "Piecewise Affine Dynamical Models of Petri Nets - Application to Emergency Call Centers.",
            "Inferring Unobserved Events in Systems with Shared Resources and Queues.",
            "On the Expressive Power of Non-deterministic and Unambiguous Petri Nets over Infinite Words.",
            "Automated Repair of Process Models with Non-local Constraints Using State-Based Region Theory.",
            "Symbolic and Structural Model-Checking.",
            "A Congruence-Based Perspective on Finite Tree Automata.",
            "A Graph Theoretical Framework for the Strong Gram Classification of Non-negative Unit Forms of Dynkin Type 𝔸n.",
            "Right Buchberger Algorithm over Bijective Skew PBW Extensions.",
            "High-degree Compression Functions on Alternative Models of Elliptic Curves and their Applications.",
            "A Non-Deterministic Multiset Query Language.",
            "On the Hardness of Energy Minimisation for Crystal Structure Prediction.",
            "Clustering Geometrically-Modeled Points in the Aggregated Uncertainty Model.",
            "Theory of Constructive Semigroups with Apartness - Foundations, Development and Practice.",
            "Acyclic and Cyclic Reversing Computations in Petri Nets.",
            "Computing the Length of Sum of Squares and Pythagoras Element in a Global Field.",
            "A Polynomial-Time Construction of a Hitting Set for Read-Once Branching Programs of Width 3."
        ]
    },
    {
        "name": "FUIN",
        "year": "2020",
        "info": "2020: Volumes\n171,\n172,\n173,\n174,\n175,\n176,\n177",
        "count": 118,
        "papers": [
            "Preface.",
            "A Common Framework to Recognize Two-dimensional Languages.",
            "Unveiling the Hidden Dimension of Pedestrian Crowds: Introducing Personal Space and Crowding into Simulations.",
            "Logic and Algebra in Unfolded Petri Nets: on a Duality Between Concurrency and Causal Dependence.",
            "Computational Intelligence for Life Sciences.",
            "Unavoidable Sets, Prefix Graphs and Regularity of Circular Splicing Languages.",
            "Some Investigations on Similarity Measures Based on Absent Words.",
            "Insertions Yielding Equivalent Double Occurrence Words.",
            "On Languages of P Automata.",
            "Word Blending in Formal Languages.",
            "The Many Roads to the Simulation of Reaction Systems.",
            "How Hard is it to Predict Sandpiles on Lattices? A Survey.",
            "CospanSpan(Graph): a Compositional Description of the Heart System.",
            "On Expansivity and Pseudo-Orbit Tracing Property for Cellular Automata.",
            "Reaction Systems and Enabling Equivalence.",
            "The Influence of Nutrients Diffusion on a Metabolism-driven Model of a Multi-cellular System.",
            "Membrane Creation in Polarizationless P Systems with Active Membranes.",
            "P Systems with Rule Production and Removal.",
            "A Computational Model for The Access to Medical Service in a Basic Prototype of a Healthcare System.",
            "A Survey on Nature-Inspired Medical Image Analysis: A Step Further in Biomedical Data Integration.",
            "Integrating Petri Nets and Flux Balance Methods in Computational Biology Models: a Methodological and Computational Practice.",
            "How to Synchronize Cellular Automata - Recent Developments -.",
            "Verification Techniques for a Network Algebra.",
            "Deterministic Integer Factorization with Oracles for Euler's Totient Function.",
            "On Szilard Languages of Labelled Insertion Grammars.",
            "On the Compactness Property of Mereological Spaces.",
            "Detour Number of 1-Fault Connected Graphs.",
            "Preface.",
            "Joint Maximum Likelihood Estimation of Motion and T1 Parameters from Magnetic Resonance Images in a Super-resolution Framework: a Simulation Study.",
            "Scale Invariance in Projection Selection Using Binary Tomography.",
            "An Efficient Interpolation Approach for Exploring the Parameter Space of Regularized Tomography Algorithms.",
            "Characterising Functional Brain Connectivity as Social Network: the Transtopic Centrality Index.",
            "A L1 Minimization Strategy for Robust Joint Activity and Attenuation Estimation in Positron Emission Tomography.",
            "A Phase Field Approach to Limited-angle Tomographic Reconstruction.",
            "Uniqueness Results for Grey Scale Digital Images.",
            "Preface.",
            "Improvement of Automated Essay Grading by Grouping Similar Graders.",
            "Improving Short Text Classification using Information from DBpedia Ontology.",
            "Time and Space Efficient Large Scale Link Discovery using String Similarities.",
            "On Commuting Parikh q-Matrices.",
            "A Second-order Corrector Infeasible Interior-point Method with One-norm wide Neighborhood for Symmetric Optimization.",
            "On the Consistency of k-means++ algorithm.",
            "On Orthogonal Projections on the Space of Consistent Pairwise Comparisons Matrices.",
            "Action Rules of Lowest Cost and Action Set Correlations.",
            "Morphisms in Binary Rough Set Theory.",
            "Higher-Order Rank Functions on Directed Graphs.",
            "The Conditional-(g, d, k)-Connectivity and Conditional-(g, d, k)-edge-Connectivity on the Hypercubes.",
            "Flash-Aware Storage of the Column Oriented Databases.",
            "A Hybrid Protocol to Solve Authenticated Byzantine Consensus.",
            "Preface.",
            "Parametric Systems: Verification and Synthesis.",
            "Adaptive Virtual Organisms: A Compositional Model for Complex Hardware-software Binding, .",
            "Modal Equivalence and Bisimilarity in Many-valued Modal Logics with Many-valued Accessibility Relations.",
            "A Many-sorted Polyadic Modal Logic.",
            "Causal Reasoning for Safety in Hennessy Milner Logic.",
            "Preface.",
            "Justifications in Constraint Handling Rules for Logical Retraction in Dynamic Algorithms: Theory, Implementations, and Complexity.",
            "Combining Static and Dynamic Contract Checking for Curry.",
            "A Constructor-Based Reachability Logic for Rewrite Theories.",
            "Computing the Edge Irregularity Strength of Bipartite Graphs and Wheel Related Graphs.",
            "Disjunctive Total Domination Subdivision Number of Graphs.",
            "Finding Minimum Locating Arrays Using a CSP Solver.",
            "On Combining the Methods of Link Residual and Domination in Networks.",
            "Special issue of Teams in Multiagent Systems (TEAMAS): Preface.",
            "Human-aware Contingent Planning.",
            "Solving the Team Composition Problem in a Classroom.",
            "Local Face Antimagic Evaluations and Coloring of Plane Graphs.",
            "Combinatorial Algorithms for Binary Operations on LR-tableaux with Entries Equal to 1 with Applications to Nilpotent Linear Operators.",
            "BCK-codes Based on a Parity Check Matrix.",
            "Minimal Base for Finite Topological Space by Matrix Method.",
            "A Propositional Metric Logic with Fixed Finite Ranges.",
            "Preface.",
            "An Experimental Comparison of Algebraic Crossover Operators for Permutation Problems.",
            "MILP, Pseudo-Boolean, and OMT Solvers for Optimal Fault-Tolerant Placements of Relay Nodes in Mission Critical Wireless Networks.",
            "Analyzing Heuristic-based Randomized Search Strategies for the Quantum Circuit Compilation Problem.",
            "Optimal Personalised Treatment Computation through In Silico Clinical Trials on Patient Digital Twins.",
            "Partial (Neighbourhood) Singleton Arc Consistency for Constraint Satisfaction Problems.",
            "Preface.",
            "Discovering Object-centric Petri Nets.",
            "Comparing Degenerate Strings.",
            "Dynamic Exploration of Multi-agent Systems with Periodic Timed Tasks.",
            "Target-oriented Petri Net Synthesis.",
            "Flexible Process Model Mapping using Relaxation Labeling.",
            "Stop-transitions of Petri Nets.",
            "Roots and Powers in Regular Languages: Recognizing Nonregular Properties by Finite Automata.",
            "Companions and an Essential Motion of a Reaction System.",
            "On Shuffling a Word with its Letter-to-Letter Substitution.",
            "Multi-valued Verification of Strategic Ability.",
            "Algebraic Structure of Step Traces and Interval Traces.",
            "Network Controllability Analysis of Three Multiple-myeloma Patient Genetic Mutation Datasets.",
            "A Theory of Distributed Markov Chains.",
            "L-systems from 3D-imaging of Phenotypes of Arborized Structures.",
            "Additional Closeness and Networks Growth.",
            "The Structure of Multigranular Rough Sets.",
            "Small Universal Numerical P Systems with Thresholds for Computing Functions.",
            "Topology as Faithful Communication Through Relations.",
            "Social Network Optimization for Cluster Ensemble Selection.",
            "Constructing Node-Independent Spanning Trees in Augmented Cubes.",
            "Axiomatizing Rectangular Grids with no Extra Non-unary Relations.",
            "Preface.",
            "Pattern and Rule Mining for Identifying Signatures of Epileptic Patients from Clinical EEG Data.",
            "Comparison of Different Data Mining Methods to Determine Disease Progression in Dissimilar Groups of Parkinson's Patients.",
            "Structured Gaussian Process Regression of Music Mood.",
            "Preface.",
            "A Unifying Approach for Nonmonotonic S4F, (Reflexive) Autoepistemic Logic, and Answer Set Programming.",
            "Reasoning about Exceptions in Ontologies: from the Lexicographic Closure to the Skeptical Closure.",
            "Unsatisfiable Core Analysis and Aggregates for Optimum Stable Model Search.",
            "Towards a Logic Programming Tool for Cancer Data Analysis.",
            "Dischargeable Obligations in the 𝒮CIFF Framework.",
            "A Set-theoretic Approach to Reasoning Services for the Description Logic 𝒟ℒD4, ×.",
            "Preface.",
            "A Formal, Resource Consumption-Preserving Translation from Actors with Cooperative Scheduling to Haskell.",
            "Abstract Contract Synthesis and Verification in the Symbolic K Framework.",
            "lpopt: A Rule Optimization Tool for Answer Set Programming.",
            "Order-sorted Homeomorphic Embedding Modulo Combinations of Associativity and/or Commutativity Axioms.",
            "Dynamic Slicing for Concurrent Constraint Languages.",
            "Selective Unification in (Constraint) Logic Programming.",
            "Deriving Efficient Sequential and Parallel Generators for Closed Simply-Typed Lambda Terms and Normal Forms."
        ]
    },
    {
        "name": "FUIN",
        "year": "2019",
        "info": "2019: Volumes\n164,\n165,\n166,\n167,\n168,\n169,\n170",
        "count": 116,
        "papers": [
            "Complexity and (Un)decidability of Fragments of 〈 ω ω λ ;× 〉.",
            "Advanced Morphological Distances Based on Dilation and Erosion.",
            "Elementary Matrix-computational Proof of Quillen-Suslin Theorem for Ore Extensions.",
            "Complex Interval-valued Intuitionistic Fuzzy Sets and their Aggregation Operators.",
            "Rough-Fuzzy Circular Clustering for Color Normalization of Histological Images.",
            "Two-center of the Convex Hull of a Point Set: Dynamic Model, and Restricted Streaming Model.",
            "Preface.",
            "Handling Non-determinism in Spiking Neural P Systems: Algorithms and Simulations.",
            "The Hamiltonian Cycle and Travelling Salesman Problems in cP Systems.",
            "Complex Complement Circuit Design of Four Inputs Based on DNA Strand Displacement.",
            "DNA Ion Detector and Logic Circulation Amplification Model Based on Mercury and Silver Ions.",
            "The Computational Power of Cell-like P Systems with Symport/Antiport Rules and Promoters.",
            "Adaptive Differential Evolution with Elite Opposition-Based Learning and its Application to Training Artificial Neural Networks.",
            "A Circuit Simplification Mechanism Based on DNA Combinatorial Strands Displacement.",
            "A Novel Chaotic System and its Modified Compound Synchronization.",
            "Logic Operation Model of the Complementer Based on Two-domain DNA Strand Displacement.",
            "The Design of RNA Biosensor Based on Nano-gold and Magnetic Nano-particle.",
            "Introduction.",
            "A Modal Logic of a Truth Definition for Finite Models.",
            "Continuation Semantics for Multi-Quantifier Sentences: Operation-Based Approaches.",
            "Some Remarks on Least Moduli.",
            "co-Semi-analytic Functors.",
            "One Henkin Quantifier in the Empty Vocabulary Suffices for Undecidability.",
            "Reliable Restricted Process Theory.",
            "An Algorithm using Context Reduction for Efficient Incremental Generation of Concept Set.",
            "Graphical Partitions and Graphical Relations.",
            "Algorithm for Pythagorean Fuzzy Multi-criteria Decision Making Based on WDBA with New Score Function.",
            "Universal Computation in a Simplified Brownian Cellular Automaton with von Neumann Neighborhood.",
            "Three-way Decisions with Rough Membership Functions in Covering Approximation Space.",
            "Preface.",
            "What Are Justification Logics?",
            "Semantics and Controllability of Time-Aware Business Processes.",
            "Experimental Study of Totally Optimal Decision Trees.",
            "A Classifier Based on a Decision Tree with Temporal Cuts.",
            "Linking Reaction Systems with Rough Sets.",
            "Studying Opacity of Reaction Systems through Formula Based Predictors.",
            "Applying Modern SAT-solvers to Solving Hard Problems.",
            "Towards Encoding of the Transition Relation in Dialogue Games Model Checking.",
            "From Data to Pattern Structures: Near Set Approach.",
            "Comparison of Heuristics for Optimization of Association Rules.",
            "Regular Orthomodular Posets.",
            "Representation of Lattices with Modal Operators in Two-Sorted Frames.",
            "Pythagorean Fuzzy Hamacher Power Aggregation Operators in Multiple Attribute Decision Making.",
            "Application of Residual Power Series Method for the Solution of Time-fractional Schrödinger Equations in One-dimensional Space.",
            "Numerical Algorithm for the Solutions of Fractional Order Systems of Dirichlet Function Types with Comparative Analysis.",
            "Special issue of the Knowledge Representation and Reasoning Track, Symposium on Applied Computing (SAC) 2017.",
            "Candidate Selection and Instance Ordering for Realtime Algorithm Configuration.",
            "A Reconstruction of Default Conditionals within Epistemic Logic.",
            "Word Matrix Rewriting Systems.",
            "Introducing Mass-based Rough Mereology in a Mereological Universe with Relations to Fuzzy Logics and a Generalization of the Łukasiewicz Logical Foundations of Probability.",
            "An Approach of Proximity in Rough Set Theory.",
            "An Uncertainty Measure Based on Lower and Upper Approximations for Generalized Rough set Models.",
            "Satisfiability Calculus: An Abstract Formulation of Semantic Proof Systems.",
            "Data Mining with Histograms and Domain Knowledge - Case Studies and Considerations.",
            "Combining the Concepts of Residual and Domination in Graphs.",
            "Preface.",
            "Argumentation Reasoning via Circumscription with Pyglaf.",
            "Model Enumeration via Assumption Literals.",
            "Expansion-based QBF Solving on Tree Decompositions.",
            "Efficient Approaches for Solving a Multiobjective Energy-aware Job Shop Scheduling Problem.",
            "Tackling Permutation-based Optimization Problems with an Algebraic Particle Swarm Optimization Algorithm.",
            "A Computational Maple Library for Skew PBW Extensions.",
            "On Boolean Representation of Continuous Data Biclustering.",
            "Networks with Extremal Closeness.",
            "Algebras of Definable Sets vs. Concept Lattices.",
            "Computable Contact Algebras.",
            "Approximate Hotspots of Orthogonal Trajectories.",
            "Universal (and Existential) Nulls.",
            "From Box Algebra to Interval Temporal Logic.",
            "Communication P Systems with Channel States Working in Flat Maximally Parallel Manner.",
            "On the Existence of Kernel Function for Kernel-Trick of k-Means in the Light of Gower Theorem.",
            "On the Density of Regular Languages.",
            "Algorithmic Completeness of Imperative Programming Languages.",
            "A Note on the Durda, Caron, and Buchanan Word Ambiguity Detection Algorithm.",
            "Foreword.",
            "Symbolic Tensor Neural Networks for Digital Media - from Tensor Processing via BNF Graph Rules to CREAMS Applications.",
            "Deep Learning Optimization Tasks and Metaheuristic Methods.",
            "Abnormality Diagnosis in Mammograms by Transfer Learning Based on ResNet18.",
            "Improvement of Cerebral Microbleeds Detection Based on Discriminative Feature Learning.",
            "Method for Clustering of Brain Activity Data Derived from EEG Signals.",
            "Classifying and Visualizing Emotions with Emotional DAN.",
            "Human Face Expressions from Images.",
            "Comixify: Transform Video Into Comics.",
            "A Novel Two-stage Residual Learning Based Convolutional Neural Network for Image Super Resolution.",
            "Preface.",
            "Analysis and Synthesis of Weighted Marked Graph Petri Nets: Exact and Approximate Methods.",
            "Operational Semantics, Interval Orders and Sequences of Antichains.",
            "Synthesis for Various Petri Net Classes with Union/Find.",
            "Formal Properties of Petri's Cycloid Systems.",
            "Co-Finiteness and Co-Emptiness of Reachability Sets in Vector Addition Systems with States.",
            "Lucent Process Models and Translucent Event Logs.",
            "A Dynamic Logic Account of Active Integrity Constraints.",
            "Geodesic Center of a Simple Polygon using a Logarithmic Number of Extra Variables.",
            "A Query Language Based on Term Matching and Rewriting.",
            "Preface.",
            "Jacobians of Hyperelliptic Curves over ℤn and Factorization of n.",
            "Determining Formulas Related to Point Compression on Alternative Models of Elliptic Curves.",
            "CTRL-PACE: Controlled Randomness for e-Passport Password Authentication.",
            "Malicious SHA-3.",
            "Hybrid Encryption from McEliece Cryptosystem with Pseudo-random Error Vector.",
            "Preface.",
            "Skolem's Theorem in Coherent Logic.",
            "The Magda Language: Ten Years After.",
            "The Duality of Classical Intersection and Union Types.",
            "Undecidability of Intersection Type Inhabitation at Rank 3 and its Formalization.",
            "Decidability of Several Concepts of Finiteness for Simple Types.",
            "Strong Normalization for Truth Table Natural Deduction.",
            "Certifying Dictionary Construction in Isabelle/HOL.",
            "Personal Reflections on the Role of Mathematical Logic in Computer Science.",
            "Neighbourhood and Lattice Models of Second-Order Intuitionistic Propositional Logic.",
            "New Semantical Insights Into Call-by-Value λ-Calculus.",
            "Observational Equivalence for Multiparty Sessions.",
            "Simple SubTypes of Intersection Types.",
            "Intrinsic Factorization of Ideals in Dedekind Domains.",
            "Computing with Infinite Terms and Infinite Reductions.",
            "Gamma-Reduction in Type Theory of Acyclic Recursion."
        ]
    },
    {
        "name": "FUIN",
        "year": "2018",
        "info": "2018: Volumes\n157,\n158,\n159,\n160,\n161,\n162,\n163",
        "count": 138,
        "papers": [
            "Preface.",
            "ADR-lrABE: New Mechanism of Direct-revocable Attribute-Based Encryption with Continual-leakage Tolerances.",
            "Star-Topological Encryption: Talking to the Sever but Hiding Identities to Others.",
            "An Efficient Construction of Quantum Attack Resistant Proxy Re-Encryption Based on (Semi)group Factorization Problems.",
            "A Secure Data Forwarding Protocol for Data Statistic Services in Multi-Hop Marine Sensor Networks.",
            "Hybridization of ICBC and Genetic Algorithm for Optimizing Encryption Process in Cloud Computing Application Service.",
            "Cryptanalysis and Improvement for Certificateless Aggregate Signature.",
            "Differential Fault Attacks on Lightweight Cipher LBlock.",
            "Proof of Multicopy via Proof of File Position in Cloud.",
            "A New Approach to Security Analysis of Smart Home Authentication Systems.",
            "RoFa: A Robust and Flexible Fine-Grained Access Control Scheme for Mobile Cloud and IoT based Medical Monitoring.",
            "An Improved Secure Cloud Storage Auditing Protocol Based on Distributed String Equality Checking.",
            "A Provably Secure Anonymous Two-Factor Authenticated Key Exchange Protocol for Cloud Computing.",
            "Anatomy of the Chase.",
            "Picture Fuzzy Hamacher Aggregation Operators and their Application to Multiple Attribute Decision Making.",
            "Preface.",
            "Superposition Principle in Composable Hybrid Automata.",
            "Reversing Transitions in Bounded Petri Nets.",
            "A Protocol of Mutual Exclusion for DSM Based on Vectors of Global Timestamps.",
            "Rough Sets and Sorites Paradox.",
            "Computing Bisimulation-Based Comparisons.",
            "TripICS - a Web Service Composition System for Planning Trips and Travels.",
            "Full Axiomatisation of Timed Processes of Interval-Timed Petri Nets.",
            "Extrapolation of an Optimal Policy using Statistical Probabilistic Model Checking.",
            "Trying to Understand PEG.",
            "Preface.",
            "Multi-Party Persuasion: a Paraconsistent Approach.",
            "Strategy-proof Cake Cutting Mechanisms for All-or-nothing Utility.",
            "Leximin Multiple Objective DCOPs on Factor Graphs for Preferences of Agents.",
            "Programming Agent Deliberation Using Procedural Reflection.",
            "The Long-Term Benefits of Following Fairness Norms under Dynamics of Learning and Evolution.",
            "A Dynamic-Logical Characterization of Solutions to Sight-limited Extensive Games.",
            "Multi-Context Systems with Preferences.",
            "Sequence Semantics for Modelling Reason-based Preferences.",
            "Logics for Modelling Collective Attitudes.",
            "Collaborative Rankings.",
            "Reference Abstract Domains and Applications to String Analysis.",
            "On Desirable Semantics of Functional Dependencies over Databases with Incomplete Information.",
            "Precise Sets in Approximation Spaces and Textures.",
            "Cubic Algorithm to Compute the Dynkin Type of a Positive Definite Quasi-Cartan Matrix.",
            "A Color Image Watermarking Approach Based on Synchronization Correction.",
            "Preface.",
            "Commitment-based Agent Interaction in JaCaMo+.",
            "Evaluating Compliance: From LTL to Abductive Logic Programming.",
            "Reasoning on Datalog± Ontologies with Abductive Logic Programming.",
            "Towards a Rational Closure for Expressive Description Logics: the Case of 풮풽풾퓆.",
            "The Impact of Active Domain Predicates on Guarded Existential Rules.",
            "A Granular Computing Method for OWL Ontologies.",
            "Additional Winning Strategies in Reachability Games.",
            "A Petri Net Based Modeling of Active Objects and Futures.",
            "PageRank Topic Model: Estimation of Multinomial Distributions using Network Structure Analysis Methods.",
            "On Axiomatizability of the Multiplicative Theory of Numbers.",
            "Finding Shortest Triangular Path and its Family inside a Digital Object.",
            "Shelah-Stupp's Iteration and Muchnik's Iteration.",
            "Ordered Weighted Hesitant Fuzzy Information Fusion-Based Approach to Multiple Attribute Decision Making with Probabilistic Linguistic Term Sets.",
            "Some Novel Pythagorean Fuzzy Interaction Aggregation Operators in Multiple Attribute Decision Making.",
            "Neighborhood Systems: Rough Set Approximations and Definability.",
            "Preface.",
            "A Hybrid Petri Net Model of the Akt-Wnt-mTOR-p70S6K Signalling Network in Neurons.",
            "Petri Nets for Modelling and Analysing Trophic Networks.",
            "Adaptive and Bio-semantics of Continuous Petri Nets: Choosing the Appropriate Interpretation.",
            "Semi-quantitative Modelling of Gene Regulatory Processes with Unknown Parameter Values Using Fuzzy Logic and Petri Nets.",
            "Colored Fuzzy Petri Nets for Dealing with Genetic Regulatory Networks.",
            "Activity Networks with Delays an Application to Toxicity Analysis.",
            "Factors Influencing Essential Hypertension and Cardiovascular Disease Modeled and Analyzed using Stochastic Petri Nets.",
            "Stochastic Simulation-based Prediction of the Behavior of the p16-mediated Signaling Pathway.",
            "Discrete-Time Leap Method For Stochastic Simulation.",
            "Verification of Dynamic Behaviour in Qualitative Molecular Networks Describing Gene Regulation, Signalling and Whole-cell Metabolism.",
            "BioModelKit: Spatial Modelling of Complex Multiscale Molecular Biosystems Based on Modular Models.",
            "State Complexity of Multiple Catenations.",
            "Deterministic Meeting of Sniffing Agents in the Plane.",
            "A Novel Framework for Reliable Network Prediction of Small Scale Wireless Sensor Networks (SSWSNs).",
            "On Graph Algorithms for Degeneracy Test and Recursive Description of Stream Ciphers.",
            "Pure Strategies in Imperfect Information Stochastic Games.",
            "Operation Properties and Algebraic Application of Covering Rough Sets.",
            "Certificateless Proxy Signature Scheme in the Standard Model.",
            "Minimum Cardinality Point-to-point Connectivity Augmentation Problem.",
            "Preface.",
            "From Constructivism to Logic Programming: an Homage to Mario Ornaghi.",
            "Constraint Logic Programming with Polynomial Constraints over Finite Domains.",
            "ASP Based Generation of Information Terms for Constructive ɛℒ.",
            "Extending Logic Programming with Labelled Variables: Model and Semantics.",
            "Compliance in Business Processes with Incomplete Information and Time Constraints: a General Framework based on Abductive Reasoning.",
            "Logic-based Verification of the Distributed Dining Philosophers Protocol.",
            "Defeasible Reasoning in 풮ℛ풪ℰℒ: from Rational Entailment to Rational Closure.",
            "Revision of Ontologies to Accommodate Exceptions: a Typicality-based Approach.",
            "Multi-Agent Dialogues and Dialogue Sequents for Proof Search and Scheduling in Intuitionistic Logic and the Modal Logic S4.",
            "Certificateless Public Key Cryptography in the Standard Model.",
            "Design of Epidemic Computer Virus Model with Effect of Quarantine in the Presence of Immunity.",
            "Boolean Representation for Exact Biclustering.",
            "Detecting Insider Malicious Activities in Cloud Collaboration Systems.",
            "Preface.",
            "The Complexity of Diagnosability and Opacity Verification for Petri Nets.",
            "A Distributed Fixed-Point Algorithm for Extended Dependency Graphs.",
            "On Deadlockability, Liveness and Reversibility in Subclasses of Weighted Petri Nets.",
            "Interleaving Based Model Checking of Concurrency and Causality.",
            "Residual Closeness of Generalized Thorn Graphs.",
            "Dialogue in Hierarchical Learning of Concept using Prototypes and Counterexamples.",
            "A Note on the Higher-order Nonlinearity of Niho Function.",
            "On the Number of Nonterminal Symbols in Unambiguous Conjunctive Grammars.",
            "Finding Shortest Triangular Path and its Family inside a Digital Object.",
            "Perface.",
            "Decision Problems and Applications of Rational Sets of Regular Languages.",
            "Preserving λ-scrambling Matrices.",
            "On {ℓ}-Metric Dimensions in Graphs.",
            "Vector Ambiguity and Freeness Problems in SL(2, ℤ).",
            "Trim Strongly Connected Synchronizing Automata and Ideal Languages.",
            "Subset Synchronization in Monotonic Automata.",
            "Studying Word Equations by a Method of Weighted Frequencies.",
            "Preface.",
            "Gender-Based Analysis of Intra-Institutional Research Productivity and Collaboration.",
            "Impact of Credibility on Opinion Analysis in Social Media.",
            "Quality-aware Architectural Model Transformations in Adaptive Mashups User Interfaces.",
            "A Unified Approach to Multisource Data Analyses.",
            "Preface.",
            "A Data Consistent Variational Segmentation Approach Suitable for Real-time Tomography.",
            "A Generating Tree for Permutations Avoiding the Pattern 122+3.",
            "Super-resolution in Clinical Conditions: Deep Brain Stimulation Case Study.",
            "Network Models in Neuroimaging: A Survey of Multimodal Applications.",
            "Graph Model Simulation of Human Brain's Functional Activity at Resting State by Means of the FD Model.",
            "Intermediate Results Materialization Selection and Format for Data-Intensive Flows.",
            "Finite IUML-algebras, Finite Forests and Orthopairs.",
            "Satisfiability versus Finite Satisfiability in Elementary Modal Logics.",
            "Maximum Flows in Planar Dynamic Networks with Lower Bounds.",
            "A Simple Butterfly Particle Swarm Optimization Algorithm with the Fitness-based Adaptive Inertia Weight and the Opposition-based Learning Average Elite Strategy.",
            "Preface.",
            "On Abelian Longest Common Factor with and without RLE.",
            "A Linear Space Data Structure for Range LCP Queries.",
            "Efficient Computation of Palindromes in Sequences with Uncertainties.",
            "On Computing Average Common Substring Over Run Length Encoded Sequences.",
            "Frequency Covers for Strings.",
            "Efficient Approaches to Compute Longest Previous Non-overlapping Factor Array.",
            "A Descriptive Tolerance Nearness Measure for Performing Graph Comparison.",
            "A Full-Newton Step Interior-point Method Based on a Class of Specific Algebra Transformation.",
            "The Graph Theory General Position Problem on Some Interconnection Networks.",
            "Towards Obtaining Upper Bound on Sensitivity Computation Process for Cluster Validity Measures.",
            "Approximation Algorithms for Three Dimensional Protein Folding.",
            "Attribute-based Data Integrity Checking for Cloud Storage."
        ]
    },
    {
        "name": "FUIN",
        "year": "2017",
        "info": "2017: Volumes\n150,\n151,\n152,\n153,\n154,\n155,\n156",
        "count": 158,
        "papers": [
            "Preface.",
            "A Framework for the Verification of Parameterized Infinite-state Systems.",
            "From Argumentation Frameworks to Voting Systems and Back.",
            "Herbrand-satisfiability of a Quantified Set-theoretic Fragment.",
            "Program Verification using Constraint Handling Rules and Array Constraint Generalizations.",
            "JTabWb: a Java Framework for Implementing Terminating Sequent and Tableau Calculi.",
            "Stochastic Semantics.",
            "Identity-Based Multi-Proxy Signature Scheme in the Standard Model.",
            "Fast and Efficient Parallel Coarsest Refinement.",
            "Theory of Mind and Empathy. Part I - Model of Social Emotional Thinking.",
            "A Note on Spiking Neural P Systems with Homogenous Neurons and Synapses.",
            "Preface.",
            "Infinitary Axiomatization of the Equational Theory of Context-Free Languages.",
            "Non-monotonic Pre-fix Points and Learning.",
            "Pebble Games with Algebraic Rules.",
            "Łukasiewicz μ-calculus.",
            "CoCaml: Functional Programming with Regular Coinductive Types.",
            "From Branching to Linear Time, Coalgebraically.",
            "Guard Your Daggers and Traces: Properties of Guarded (Co-)recursion.",
            "Preface.",
            "A Comprehensive Survey on Fractional Fourier Transform.",
            "Coefficient Estimate of bi-Bazilevič Functions Associated with Fractional q-calculus Operators.",
            "A New Family of the Local Fractional PDEs.",
            "Two-Dimensional Chebyshev Wavelet Method for Camassa-Holm Equation with Riesz Fractional Derivative Describing Propagation of Shallow Water Waves.",
            "Solvability of a Coupled System of Fractional Differential Equations with Nonlocal and Integral Boundary Conditions.",
            "On Fractional Neutral Integro-differential Systems with State-dependent Delay in Banach Spaces.",
            "On Analytical Approximate Solution of the Fractional Type Rosenau-Hyman Equation.",
            "Model of Thin Viscous Fluid Sheet Flow within the Scope of Fractional Calculus: Fractional Derivative with and No Singular Kernel.",
            "Analysis of Riccati Differential Equations within a New Fractional Derivative without Singular Kernel.",
            "Exp(-ϕ(η))-expansion Method and Shifted Chebyshev Wavelets for Generalized Sawada-Kotera of Fractional Order.",
            "Abnormal Breast Detection in Mammogram Images by Feed-forward Neural Network Trained by Jaya Algorithm.",
            "Residual Power Series Method for Fractional Diffusion Equations.",
            "Nonoverlapping Schwarz Waveform Relaxation Algorithm for a Class of Time-Fractional Heat Equations.",
            "Monotone Convergence of Extended Iterative Methods and Fractional Calculus with Applications.",
            "An Optimization Wavelet Method for Multi Variable-order Fractional Differential Equations.",
            "Pathological Brain Detection via Wavelet Packet Tsallis Entropy and Real-Coded Biogeography-based Optimization.",
            "SM-Algorithms for Approximating the Variable-Order Fractional Derivative of High Order.",
            "A New Approach for Modeling with Discrete Fractional Equations.",
            "Tea Category Identification using Computer Vision and Generalized Eigenvalue Proximal SVM.",
            "Fractional Diffusion Equation with Spherical Symmetry and Reactive Boundary Conditions.",
            "On General Solution for Fractional Differential Equations with Not Instantaneous Impulses.",
            "Transient Space-fractional Diffusion with a Power-law Superdiffusivity: Approximate Integral-balance Approach.",
            "Dynamics of Commodities Prices: Integer and Fractional Models.",
            "Non-differentiable Solutions for Local Fractional Nonlinear Riccati Differential Equations.",
            "The RC Circuit Described by Local Fractional Differential Equations.",
            "Interpretation of Fractional Derivatives as Reconstruction from Sequence of Integer Derivatives.",
            "A New Optimization Method Based on Generalized Polynomials for Fractional Differential Equations.",
            "On the Critical Strip of the Riemann zeta Fractional Derivative.",
            "Nonlinear Degenerate Fractional Evolution Equations with Nonlocal Conditions.",
            "Existence Results for Fractional Evolution Systems with Riemann-Liouville Fractional Derivatives and Nonlocal Conditions.",
            "Texture Analysis Method Based on Fractional Fourier Entropy and Fitness-scaling Adaptive Genetic Algorithm for Detecting Left-sided and Right-sided Sensorineural Hearing Loss.",
            "Hybrid Watermarking Algorithm using Finite Radon and Fractional Fourier Transform.",
            "On Finding the Maximum and Minimum Density Axes-parallel Regions in IRd.",
            "A Sign Function Approach to Solve Algebraically Interval System of Linear Equations for Nonnegative Solutions.",
            "A Predictor-corrector Infeasible-interior-point Algorithm for Semidefinite Optimization in a Wide Neighborhood.",
            "Jumping Scattered Context Grammars.",
            "On Infinite Divisibility of Convolution and Mapping Kernels.",
            "Tolerance Soft Set Relation on a Soft Set and its Matrix Applications.",
            "Depth Lower Bounds against Circuits with Sparse Orientation.",
            "Metaheuristic Search Algorithms in Solving the n-Similarity Problem.",
            "Characterizing Rough Algebras.",
            "Numeric Algorithms for Corank Two Edge-bipartite Graphs and their Mesh Geometries of Roots.",
            "SMC4AC: A New Symbolic Model Checker for Intelligent Agent Communication.",
            "Similarities and Differences Between the Vertex Cover Number and the Weakly Connected Domination Number of a Graph.",
            "On Deterministic Reduction of Factoring Integers to Computing the Exponents of Elements in Modular Group.",
            "A Revised TOPSIS Method Based on Interval Fuzzy Soft Set Models with Incomplete Weight Information.",
            "Computational Complexity on the Blackboard.",
            "An Approach to Functional Formal Models of Constraint-Based Lexicalized Grammar.",
            "Interval-valued Fuzzy Soft Decision Making Methods Based on MABAC, Similarity Measure and EDAS.",
            "On Tight Separation for Blum Measures Applied to Turing Machine Buffer Complexity.",
            "SMT-based Searching for k-quasi-optimal Runs in Weighted Timed Automata.",
            "Methods for Distributed and Concurrent Systems: Special Issue on the occasion of the 60th Birthday of Professor Gabriel Ciobanu.",
            "Modelling and Analysing Qualitative Biological Models using Rewriting Logic.",
            "Contradiction-Tolerant Process Algebra with Propositional Signals.",
            "Semantics for Specialising Attack Trees based on Linear Logic.",
            "P Systems Simulating Bacterial Conjugation: Universality and Properties.",
            "Binary Analysis based on Symbolic Execution and Reversible x86 Instructions.",
            "Concurrency Semantics in Continuation-Passing Style.",
            "Computational Efficiency of Minimal Cooperation and Distribution in Polarizationless P Systems with Active Membranes.",
            "Monitoring with Parametrized Extended Life Sequence Charts.",
            "Naming a Channel with Beeps.",
            "Low Distortion Embedding of the Hamming Space into a Sphere with Quadrance Metric and k-means Clustering of Nominal-continuous Data.",
            "Enhanced Grey Wolf Optimization Algorithm for Global Optimization.",
            "Roots Multiplicity without Companion Matrices.",
            "Neighborhood Systems and Variable Precision Generalized Rough Sets.",
            "Rough Set Theory and Digraphs.",
            "A Wide Neighborhood Second-order Predictor-corrector Interior-point Algorithm for Semidefinite Optimization with Modified Corrector Directions.",
            "Turing Machines with One-sided Advice and Acceptance of the co-RE Languages.",
            "Inflation Agorithm for Cox-regular Postive Edge-bipartite Graphs with Loops.",
            "Constructing Elliptic Curves for the GLV Method with Low-cost Decomposition.",
            "Preface.",
            "Incremental Process Discovery using Petri Net Synthesis.",
            "A Foundational Framework for Step-by-step Model Construction.",
            "Synthesis of Transition Systems from Quantum Logics.",
            "It is Undecidable if Two Regular Tree Languages can be Separated by a Deterministic Tree-walking Automaton.",
            "Species-Driven Persistent Phylogeny.",
            "k-Abelian Equivalence and Rationality.",
            "Interactive Logical Structures.",
            "The Weighted Matching Approach to Maximum Cardinality Matching.",
            "Enforcing Regular Languages.",
            "CCS(25, 12) is Turing-complete.",
            "A New Proof for Undecidability of the Bi-Infinite Post Correspondence Problem.",
            "Small Semi-Thue System Universal with Respect to the Termination Problem.",
            "State Complexity of k-Parallel Tree Concatenation.",
            "D0L Sequences and their Equality Sets.",
            "Alphabets of Acyclic Invariant Structures.",
            "Patterns and Distances in Words Related to DNA Rearrangement.",
            "Smart Tile Self-Assembly and Replication.",
            "Tissue P Systems with Small Cell Volume.",
            "On Fixed Points of the Burrows-Wheeler Transform.",
            "Verification of Linear-Time Temporal Properties for Reaction Systems with Discrete Concentrations.",
            "Efficient Simulation of Reaction Systems on Graphics Processing Units.",
            "Morphic Characterizations of Language Families Based on Local and Star Languages.",
            "From Leśniewski, Łukasiewicz, Tarski to Pawlak: Enriching Rough Set Based Data Analysis. A Retrospective Survey.",
            "Oritatami System; a Survey and the Impossibility of Simple Simulation at Small Delays.",
            "Cooperation in Transport of Chemical Substances: A Complexity Approach within Membrane Computing.",
            "Preface / Editorial.",
            "Invariant Structures and Dependence Relations.",
            "Reversible Limited Automata.",
            "Tinput-Driven Pushdown, Counter, and Stack Automata.",
            "Tight Bounds for Cut-Operations on Deterministic Finite Automata.",
            "Watson-Crick T0L Systems and Red-Green Register Machines.",
            "The Simulation Powers and Limitations of Higher Temperature Hierarchical Self-Assembly Systems.",
            "Universality and Computational Completeness of Controlled Leftist Insertion-Deletion Systems.",
            "A Shift-free Characterization of NP within Interval-valued Computing.",
            "Non-Isometric Contextual Array Grammars and the Role of Regular Control and Local Selectors.",
            "Preface.",
            "Relating Concrete Defeasible Reasoning Formalisms and Abstract Argumentation.",
            "Representing Argumentation Frameworks in Answer Set Programming.",
            "Abducible Semantics and Argumentation.",
            "Preface.",
            "Reconstructing Binary Matrices under Window Constraints from their Row and Column Sums.",
            "Improving Analytical Tomographic Reconstructions Through Consistency Conditions.",
            "Fast Granulometry Operator for the 3D Identification of Cell Structures.",
            "A 3D Bayesian Computed Tomography Reconstruction Algorithm with Gauss-Markov-Potts Prior Model and its Application to Real Data.",
            "Regions of Uniqueness Quickly Reconstructed by Three Directions in Discrete Tomography.",
            "Consistency Conditions for Discrete Tomography.",
            "X-ray Computed Tomography using a Sparsity Enforcing Prior Model Based on Haar Transformation in a Bayesian Framework.",
            "Pattern Avoiding Languages and Recurrence Relations Interpretation.",
            "A Meta-Heuristic Algorithm Combining Between Tabu and Variable Neighborhood Search for the Minimum Latency Problem.",
            "On Seeking Consensus Between Document Similarity Measures.",
            "Tree Automata Constructions from Regular Expressions: a Comparative Study.",
            "On Determining the AND-OR Hierarchy in Workflow Nets.",
            "The Maximum Parametric Flow in Discrete-time Dynamic Networks.",
            "Rough Fuzzy Concept Analysis.",
            "Eigenvector Method and Rank Reversal in Group Decision Making Revisited.",
            "Large Sieve, Miller-Rabin Compositeness Witnesses and Integer Factoring Problem.",
            "Spiking Neural P Systems with Rules on Synapses Working in Sum Spikes Consumption Strategy.",
            "A Novel Similarity Measure for Content Based Image Retrieval in Discrete Cosine Transform Domain.",
            "Applications of Bipartite Graphs and their Adjacency Matrices to Covering-based Rough Sets.",
            "Preface.",
            "Forcing for First-Order Languages from the Perspective of Rasiowa-Sikorski Lemma.",
            "A Discrete Representation for Dicomplemented Lattices.",
            "On Modalities and Quantifiers.",
            "Duality for Quasilattices and Galois Connections.",
            "Representation Theorems and Locality for Subsumption Testing and Interpolation in the Description Logics ɛℒ, ɛℒ+ and their Extensions with n-ary Roles and Numerical Domains.",
            "Mereotopologies with Predicates of Actual Existence and Actual Contact.",
            "AUTHOR INDEX VOLUME 156."
        ]
    },
    {
        "name": "FUIN",
        "year": "2016",
        "info": "2016: Volumes\n143,\n144,\n145,\n146,\n147,\n148,\n149",
        "count": 158,
        "papers": [
            "Preface.",
            "A Classifier Based on a Decision Tree with Verifying Cuts.",
            "Classifiers for Behavioral Patterns Identification Induced from Huge Temporal Data.",
            "Programming Self-Assembly of DNA Tiles.",
            "A Function Elimination Method for Checking Satisfiability of Arithmetical Logics.",
            "Differential Privacy and Security.",
            "An Upper Bound for the Reachability Problem of Safe, Elementary Hornets.",
            "Controlling Petri Net Behavior using Priorities for Transitions.",
            "A Tractable Rule Language in the Modal and Description Logic that Combines CPDL with Regular Grammar Logic.",
            "Cut Points in PEG.",
            "Inverted Fuzzy Implications in Approximate Reasoning.",
            "SAT-based Bounded Model Checking for Weighted Deontic Interpreted Systems.",
            "Preface.",
            "Robustness of Time Petri Nets under Guard Enlargement.",
            "Interrupt Timed Automata with Auxiliary Clocks and Parameters.",
            "A New Sandpile Model with Smoothness Assumptions.",
            "Adding Data Registers to Parameterized Networks with Broadcast.",
            "Relating Reachability Problems in Timed and Counter Automata.",
            "Branching-Time Model Checking Gap-Order Constraint Systems.",
            "Completeness Results for Generalized Communication-free Petri Nets with Arbitrary Arc Multiplicities.",
            "Constructing Minimal Coverability Sets.",
            "On The Complexity of Counter Reachability Games.",
            "Abstract Interpretations in the Framework of Invariant Sets.",
            "Multiple Controlled Random Testing.",
            "Duality via Truth for Information Algebras Based on De Morgan Lattices.",
            "Tissue P Systems with Protein on Cells.",
            "Pattern-based Rewriting through Abstraction.",
            "State Complexity of Basic Operations on Non-Returning Regular Languages.",
            "Representation Theorems for Lattice-ordered Modal Algebras and their Axiomatic Extensions.",
            "On the Universality of Colored One-Catalyst P Systems.",
            "Preface.",
            "Continuous Pairwise Comparisons.",
            "Complex Ranking Procedures.",
            "Two Squares of Oppositions and Their Applications in Pairwise Comparisons Analysis.",
            "Eigenvector Priority Function Causes Strong Rank Reversal in Group Decision Making.",
            "Mathematical Support for the Geometric Mean when Deriving a Consistent Matrix from a Pairwise Ratio Matrix.",
            "Efficiency Analysis of Simple Perturbed Pairwise Comparison Matrices.",
            "Important Facts and Observations about Pairwise Comparisons (the special issue edition).",
            "Incomplete Pairwise Comparison Matrices and Weighting Methods.",
            "Recent Advances on Inconsistency Indices for Pairwise Comparisons - A Commentary.",
            "A Hierarchical Decision Model Based on Pairwise Comparisons.",
            "Representation of The Pairwise Comparisons in AHP Using Hesitant Cloud Linguistic Term Sets.",
            "Intuitionistic Fuzzy Optimized Weighted Geometric Bonferroni Means and Their Applications in Group Decision Making.",
            "Deriving Weights of the Decision Makers Using AHP Group Consistency Measures.",
            "Balancing Pairwise Comparison Matrices by Transitive Matrices.",
            "Computing Modulo-n by Composing Cellular Automata Rules.",
            "Symbolic Algorithms Computing Gram Congruences in the Coxeter Spectral Classification of Edge-bipartite Graphs, I. A Gram Classification.",
            "Symbolic Algorithms Computing Gram Congruences in the Coxeter Spectral Classification of Edge-bipartite Graphs, II. Isotropy Mini-groups.",
            "A Generalization of Join and an Algorithmic Recognition Problem.",
            "Rough Approximation Operators in Group Mapping and Their Applications to Coding Theory.",
            "Construction of Efficient MDS Matrices Based on Block Circulant Matrices for Lightweight Application.",
            "Dense Projection Tomography on the Triangular Tiling.",
            "Small Generating Sets and DLPC Problem.",
            "A New Graph Theoretic Approach for Protein Threading.",
            "Identity-based Signatures from Lattices: Simpler, Faster, Shorter.",
            "Quaternion Exponent Moments and Their Invariants for Color Image.",
            "Transformations and Soliton Solutions for a Variable-coefficient Nonlinear Schrödinger Equation in the Dispersion Decreasing Fiber with Symbolic Computation.",
            "Preface.",
            "Approximation of Reset Thresholds with Greedy Algorithms.",
            "Tight Lower Bounds on the Resolution Complexity of Perfect Matching Principles.",
            "Minimum Number of Input Clues in Robust Information Retrieval.",
            "Piecewise Affine Functions, Sturmian Sequences and Wang Tiles.",
            "Minimal k-connected Graphs with Small Number of Vertices of Degree k.",
            "Forest Fire Models on Configuration Random Graphs.",
            "Communication Leading to Subgroup Nash Equilibrium for Generalized Information.",
            "Game-Theoretic Centrality Measures for Weighted Graphs.",
            "Combinatorial Geometry and Coding Theory.",
            "The Number of Distinct Subpalindromes in Random Words.",
            "Equivalence Relations Defined by Numbers of Occurrences of Factors.",
            "On the Multiplicative Complexity of Boolean Functions.",
            "Probabilistic and Fuzzy Process Classifiers for Operating Systems Scheduler.",
            "A Formal and Unified Description of XML Manipulation Languages.",
            "On the Complexity of L-reachability.",
            "On String Languages Generated by Sequential Numerical P Systems.",
            "Preface.",
            "Characterizing Stable and Deriving Valid Inequalities of Petri Nets.",
            "Petri Nets with Structured Data.",
            "On Liveness and Reversibility of Equal-Conflict Petri Nets.",
            "Congruences of Edge-bipartite Graphs with Applications to Grothendieck Group Recognition I. Inflation Algorithm Revisited.",
            "Congruences of Edge-bipartite Graphs with Applications to Grothendieck Group Recognition II. Coxeter Type Study.",
            "Preface.",
            "On J-additivity and Bounded Additivity.",
            "Tiling the Space by Polycube Analogues of Fedorov's Polyhedra.",
            "Method to find the Minimum 1D Linear Gradient Model for Seismic Tomography.",
            "An Orientation-space Super Sampling Technique for Six-dimensional Diffraction Contrast Tomography.",
            "Approximate Solutions of DASs with Nonclassical Boundary Conditions using Novel Reproducing Kernel Algorithm.",
            "An Arc-search Interior Point Method in the 풩-∞ Neighborhood for Symmetric Optimization.",
            "An Analysis of the 풞 Class of Bent Functions.",
            "Recut: A Seriation Algorithm Balancing Smooth Display and Aggregated Features.",
            "Parikh Matrices and Parikh Rewriting Systems.",
            "Efficacy Analysis of Ratios from Pairwise Comparisons.",
            "Preface.",
            "Distributional Learning of Some Nonlinear Tree Grammars.",
            "Grammatical Inference of PCFGs Applied to Language Modelling and Unsupervised Parsing.",
            "Designing and Learning Substitutable Plane Graph Grammars.",
            "A Canonical Semi-Deterministic Transducer.",
            "Preface.",
            "Shift Design with Answer Set Programming.",
            "D-FLAT2: Subset Minimization in Dynamic Programming on Tree Decompositions Made Easy.",
            "Answer Set Programming Modulo Acyclicity.",
            "Towards Deriving Conclusions from Cause-effect Relations.",
            "Logic Programming with Graded Introspection.",
            "Preface.",
            "Dynamic Programming Approach for Construction of Association Rule Systems.",
            "Specialized Predictor for Reaction Systems with Context Properties.",
            "The Method for Describing Changes in the Perception of Stenosis in Blood Vessels Caused by an Additional Drug.",
            "Remarks on Memory Consistency Description.",
            "Lattice Theory for Rough Sets - A Case Study with Mizar.",
            "Core for Large Datasets: Rough Sets on FPGA.",
            "ExpTime Tableaux with Global Caching for Graded Propositional Dynamic Logic.",
            "Concrete Planning in PlanICS Framework by Combining SMT with GEO and Simulated Annealing.",
            "An Efficient Equivalence-checking Algorithm for a Model of Programs with Commutative and Absorptive Statements.",
            "Betweenness, Łukasiewicz Rough Inclusions, Euclidean Representations in Information Systems, Hyper-granules and Conflict Resolution.",
            "Selected Methods of Combining Classifiers, when Predictions are Stored in Probability Vectors, in a Dispersed Decision-making System.",
            "Rough Sets and Interactive Granular Computing.",
            "Semantics and Execution Time of New Timed Statecharts.",
            "Fundamental Properties of Pythagorean Fuzzy Aggregation Operators.",
            "Reliability Hosoya-Wiener Polynomial of Double Weighted Trees.",
            "On Four Types of Multi-Covering Rough Sets.",
            "Topological Structure of Relation-based Generalized Rough Sets.",
            "Preface.",
            "Logical Aspects of Dealing with Domain Knowledge in Data Mining with Association Rules.",
            "Mining Rule-based Knowledge Bases Inspired by Rough Set Theory.",
            "Post-processing of BRACID Rules Induced from Imbalanced Data.",
            "ACBC-Adequate Association and Decision Rules Versus Key Generators and Rough Sets Approximations.",
            "Application of Dynamic Programming Approach to Optimization of Association Rules Relative to Coverage and Length.",
            "Rough Sets Based LEM2 Rules Generation Supported by FPGA.",
            "On Some Issues in the Foundation of Rough Sets: the Problem of Definition.",
            "Rough Hypercuboid Based Supervised Regularized Canonical Correlation for Multimodal Data Analysis.",
            "Rough Granular Computing in Modal Settings: Generalised Approximation Spaces.",
            "Categories and Algebras from Rough Sets: New Facets.",
            "A Relational Logic for Spatial Contact Based on Rough Set Approximation.",
            "Generalizations of Rough Set Tools Inspired by Graph Theory.",
            "Paradigmatic and Syntagmatic Relations in Information Systems over Ontological Graphs.",
            "Preface.",
            "Distinguishability Operations and Closures.",
            "On the Computational Complexity of Partial Word Automata Problems.",
            "Visibly Pushdown Automata and Transducers with Counters.",
            "Two-Dimensional Limited Context Restarting Automata.",
            "Reversible Queue Automata.",
            "Strongly Limited Automata.",
            "Preface.",
            "Evaluating Answer Set Programming with Non-Convex Recursive Aggregates.",
            "An Experimental Study of Influence of Modeling and Solving Techniques on Performance of a Tabled Logic Programming Planner.",
            "Now or Never: Negotiating Efficiently with Unknown or Untrusted Counterparts.",
            "SyLVaaS: System Level Formal Verification as a Service.",
            "Twelve Years of QBF Evaluations: QSAT Is PSPACE-Hard and It Shows.",
            "Modeling Variations of First-Order Horn Abduction in Answer Set Programming.",
            "Identifying and Exploiting Features for Effective Plan Retrieval in Case-Based Planning.",
            "Graph Theoretical and Algorithmic Characterizations of Positive Definite Symmetric Quasi-Cartan Matrices.",
            "Tiered Objects.",
            "Instruction Sequence Size Complexity of Parity.",
            "Constrained Expressions and their Derivatives.",
            "Bisimulation Cuts For Structuring Markov Transition Systems.",
            "Pairing-Friendly Primes for Abelian Varieties.",
            "True Concurrent Equivalences in Time Petri Nets.",
            "Rule Quality Measures Settings in Classification, Regression and Survival Rule Induction - an Empirical Approach.",
            "Small Universal Spiking Neural P Systems with Homogenous Neurons and Synapses."
        ]
    },
    {
        "name": "FUIN",
        "year": "2015",
        "info": "2015: Volumes\n136,\n137,\n138,\n139,\n140,\n141,\n142",
        "count": 156,
        "papers": [
            "Preface.",
            "On the Power of Accepting Networks of Evolutionary Processors with Special Topologies and Random Context Filters.",
            "The Supports of Weighted Unranked Tree Automata.",
            "Catalytic and Purely Catalytic P Systems and P Automata: Control Mechanisms for Obtaining Computational Completeness.",
            "Power of S-kR-RRWW-automata.",
            "Minimization and Characterizations for Biautomata.",
            "Deterministic One-Way Turing Machines with Sublinear Space.",
            "Limited Automata and Context-Free Languages.",
            "Asynchronous Systems of Parallel Communicating Finite Automata.",
            "Preface.",
            "A Hybrid Distribution Algorithm Based on Membrane Computing for Solving the Multiobjective Multiple Traveling Salesman Problem.",
            "Relating Computations in Non-cooperative Transition P Systems and Evolution-Communication P Systems with Energy.",
            "Reversible Spiking Neural P Systems with Astrocytes.",
            "On String Languages Generated by Spiking Neural P Systems with Astrocytes.",
            "Artificial Bee Colony Algorithm for the Protein Structure Prediction Based on the Toy Model.",
            "Extending Simulation of Asynchronous Spiking Neural P Systems in P-Lingua.",
            "Simulating P Systems on GPU Devices: A Survey.",
            "Uniform Solution to Common Algorithmic Problem by P Systems Working in the Minimally Parallel Mode.",
            "Parameterized Complexity of Weighted Satisfiability Problems: Decision, Enumeration, Counting.",
            "Discrete Duality for Tense Łukasiewicz-Moisil Algebras.",
            "An Algorithmic Construction of Finite Elliptic Curves of Order Divisible by a Large Prime.",
            "A Horizontal Mesh Algorithm for a Class of Edge-bipartite Graphs and their Matrix Morsifications.",
            "Consistency-based Revision of Structured Belief Bases.",
            "Simultaneous Feature Selection and Extraction Using Feature Significance.",
            "Bases for AC0 and Other Complexity Classes.",
            "On Projection Based Operators in lp Space for Exact Similarity Search.",
            "Preface.",
            "Complexity Analysis of Continuous Petri Nets.",
            "ω-Petri Nets: Algorithms and Complexity.",
            "Complexity Results for Problems of Communication-Free Petri Nets and Related Formalisms.",
            "Generalizing the Compositions of Petri Nets Modules.",
            "Verification of Scenarios in Petri Nets Using Compact Tokenflows.",
            "Persistent and Nonviolent Steps and the Design of GALS Systems.",
            "Preface.",
            "Formal Framework for Data Mining with Association Rules and Domain Knowledge - Overview of an Approach.",
            "Limiting Data Exposure in Multi-Label Classification Processes.",
            "Maintenance and Discovery of Domain Knowledge for Nursing Care using Data in Hospital Information System.",
            "Privacy Issues in SOAP Message Exchange Pattern for Social Services.",
            "Search Result Clustering Based on Query Context.",
            "A Locality Sensitive Hashing Filter for Encrypted Vector Databases.",
            "Communication Complexity of Consensus in Anonymous Message Passing Systems.",
            "Description Languages for Relational Information Granules.",
            "Tolerances Induced by Irredundant Coverings.",
            "Fast Convergence of Distance-based Inconsistency in Pairwise Comparisons.",
            "Random-Grid Based Region Incrementing Visual Secret Sharing.",
            "Modification of Near Sets Theory.",
            "Higher Order Nonlinearity of Niho Functions.",
            "On the Completion of Rough Sets System Determined by Arbitrary Binary Relations.",
            "Two-Sided Derivatives for Regular Expressions and for Hairpin Expressions.",
            "On Characterization of Fuzzy Soft Rough Sets Based on a Pair of Border Implicators.",
            "Assessing Rough Classifiers.",
            "On the Complexity of Optimal Parallel Cooperative Path-Finding.",
            "Preface.",
            "On the Dynamics of Cellular Automata with Memory.",
            "Universal Reversible Turing Machines with a Small Number of Tape Symbols.",
            "Finite Automata with Multiset Memory: A New Characterization of Chomsky Hierarchy.",
            "An Optimal Frontier of the Efficiency of Tissue P Systems with Cell Separation.",
            "Semilinear Sets and Counter Machines: a Brief Survey.",
            "Universality and Almost Decidability.",
            "Ambiguity of the Multiple Interpretations on Regular Languages.",
            "Membrane Division, Oracles, and the Counting Hierarchy.",
            "An Algorithmic Approach to Tilings of Hyperbolic Spaces: Universality Results.",
            "Random Context and Semi-conditional Insertion-deletion Systems.",
            "The Structure of Elementary Strategies for Gene Assembly in Ciliates.",
            "Logical Theory of the Monoid of Languages over a Non Tally Alphabet.",
            "A Formal Language Model of DNA Polymerase Enzymatic Activity.",
            "Spatially Localised Membrane Systems.",
            "Domains as Models for Semantic Information.",
            "Variants of Small Universal P Systems with Catalysts.",
            "Yurii Rogozhin's Contributions to the Field of Small Universal Turing Machines.",
            "Iterating Transducers.",
            "Yurii Rogozhin's Biography and Publications.",
            "Modelling Progressive Filtering.",
            "A Fast and Automated Granulometric Image Analysis Based on Digital Geometry.",
            "Complete Characterization of Zero-expressible Functions.",
            "Homomorphisms Between Covering Approximation Spaces.",
            "Efficiently Mining Sequential Generator Patterns Using Prefix Trees.",
            "A Clustering Based Archive Multi Objective Gravitational Search Algorithm.",
            "On Algorithmic Equivalence of Instruction Sequences for Computing Bit String Functions.",
            "Hybrid Cloud Scheduling Method for Cloud Bursting.",
            "Self-Correcting Neural Network for Stereo-matching Problem Solving.",
            "True Concurrency in Long-running Transactions for Digital Ecosystems.",
            "Maximizing T-complexity.",
            "Characterising Concurrent Histories.",
            "Particle Swarm Optimization based Sequential and Parallel Tasks Scheduling Model for Heterogeneous Multiprocessor Systems.",
            "Multigranulation Decision-theoretic Rough Set in Ordered Information System.",
            "Immunological Computation for Protein Function Prediction.",
            "Simple Linear Comparison of Strings in V-order.",
            "On Q-rationality of Fuzzy Choice Functions on Base Domains.",
            "Mesh Algorithms for Coxeter Spectral Classification of Cox-regular Edge-bipartite Graphs with Loops, I. Mesh Root Systems.",
            "Mesh Algorithms for Coxeter Spectral Classification of Cox-regular Edge-bipartite Graphs with Loops, II. Application to Coxeter Spectral Analysis.",
            "A P_Lingua Based Simulator for P Systems with Symport/Antiport Rules.",
            "Latency of Neighborhood Based Recommender Systems.",
            "Algorithms for Isotropy Groups of Cox-regular Edge-bipartite Graphs.",
            "On Promptness in Parity Games.",
            "S-approximation Spaces: A Three-way Decision Approach.",
            "On Hypercomputation, Universal and Diagonalization Complete Problems.",
            "On Algorithmic Study of Non-negative Posets of Corank at Most Two and their Coxeter-Dynkin Types.",
            "Factored Cost-Optimal Planning Using Message Passing Algorithms.",
            "On the Properties of the Priority Deriving Procedure in the Pairwise Comparisons Method.",
            "Boolean Matrices and their Applications to Covering Reductions.",
            "A Causal View on Non-Interference.",
            "Synthesis of Live and Bounded Persistent Systems.",
            "Catching a Structural Bug with a Flower.",
            "Soundness of Timed-Arc Workflow Nets in Discrete and Continuous-Time Semantics.",
            "Non-dominating Sequences of Vectors Using only Resets and Increments.",
            "Graph Transformation Systems for Modeling Three Dimensional Finite Element Method. Part I.",
            "Graph Transformation Systems for Modeling Three Dimensional Finite Element Method. Part II.",
            "Stochastic Bounded Diameter Minimum Spanning Tree Problem.",
            "A Theoretical Perspective of Coinductive Logic Programming.",
            "A Semantical Analysis of Focusing and Contraction in Intuitionistic Logic.",
            "A Comparative Test on the Enumeration of Extensions in Abstract Argumentation.",
            "Negation as a Resource: a Novel View on Answer Set Semantics.",
            "Mapping Sets and Hypersets into Numbers.",
            "A Rule-based Verification Strategy for Array Manipulating Programs.",
            "Explicit Constructive Logic ECL: a New Representation of Construction and Selection of Logical Information by an Epistemic Agent.",
            "Learning in Description Logics with Fuzzy Concrete Domains.",
            "Nondeterministic Programming in Java with JSetL.",
            "The Lattice Structure of Equally Extended Signed Partitions.",
            "Algebras of Definable and Rough Sets in Quasi Order-based Approximation Spaces.",
            "On the Strong Metric Dimension of Cartesian Sum Graphs.",
            "Interval-valued Hesitant Fuzzy Soft Sets and their Application in Decision Making.",
            "Certificate-based Fair Exchange Protocol of Schnorr Signatures in Chosen-key Model.",
            "Preface.",
            "Computerized Tomography Noise Reduction by CICT Optimized Exponential Cyclic Sequences (OECS) Co-domain.",
            "Eliminating Switching Components in Binary Matrices by 0-1 Flips and Column Permutations.",
            "A Measure of Directional Convexity Inspired by Binary Tomography.",
            "An Algorithm for the Reconstruction of hv-convex Planar Bodies by Finitely Many and Noisy Measurements of their Coordinate X-rays.",
            "The Identity Transform of a Permutation and its Applications.",
            "Experimental Study on Multivalued Phantoms Using Different Filters in the DART Algorithm.",
            "Enhanced and Flexible Software Tools for X-ray Computed Tomography at the Italian Synchrotron Radiation Facility Elettra.",
            "GPU-optimized Direct Fourier Method for On-line Tomography.",
            "An Open Source GPU Accelerated Framework for Flexible Algebraic Reconstruction at Synchrotron Light Sources.",
            "A Similarity Based Supervised Decision Rule for Qualitative Improvement of Text Categorization.",
            "Coding Theory: A General Framework and Two Inverse Problems.",
            "Two-way Automata and Regular Languages of Overlapping Tiles.",
            "On Computing Discrete Logarithms in Bulk and Randomness Extractors.",
            "On Generating Hierarchical Workflow Nets and their Extensions and Verifying Hierarchicality.",
            "Preface.",
            "Structures of Opposition in Fuzzy Rough Sets.",
            "Approximation-oriented Fuzzy Rough Set Approaches.",
            "Applications of Fuzzy Rough Set Theory in Machine Learning: a Survey.",
            "Using One Axiom to Characterize Fuzzy Rough Approximation Operators Determined by a Fuzzy Implication Operator.",
            "On Quasi-discrete Fuzzy Closure Spaces.",
            "Decision-theoretic Rough Sets-based Three-way Approximations of Interval-valued Fuzzy Sets.",
            "Rough Set Approximations in Multi-granulation Fuzzy Approximation Spaces.",
            "A Comparative Study of MGRSs and their Uncertainty Measures.",
            "Rough Approximations Based on Valued Tolerance Relations.",
            "T-Rough Approximation Pairs and Covering Based Rough Sets.",
            "Generalized Quantifiers in the Context of Rough Set Semantics.",
            "SoBT-RFW: Rough-Fuzzy Computing and Wavelet Analysis Based Automatic Brain Tumor Detection Method from MR Images.",
            "Where Rough Sets and Fuzzy Sets Meet.",
            "Compression of Dynamic Fuzzy Relation Information Systems.",
            "Knowledge Reduction in Crisply Generated Fuzzy Concept Lattices.",
            "A Granular Computing Approach to Symbolic Value Partitioning.",
            "Incremental Computing Approximations with the Dynamic Object set in Interval-valued Ordered Information System."
        ]
    },
    {
        "name": "FUIN",
        "year": "2014",
        "info": "2014: Volumes\n129,\n130,\n131,\n132,\n133,\n134,\n135",
        "count": 186,
        "papers": [
            "Preface.",
            "Relationships Between Length and Coverage of Decision Rules.",
            "Relationships between Average Depth and Number of Misclassifications for Decision Trees.",
            "Self-Modifying Nets for Synchronous, Connection-Oriented, Multicast Communication.",
            "Towards Assessment of Innovativeness Economy Determinant Correlation: the Double Self-Organizing Feature Map Approach.",
            "Petri Net-Based Collaborative Simulation and Steering of Biochemical Reaction Networks.",
            "Perspectives on Uncertainty and Risk in Rough Sets and Interactive Rough-Granular Computing.",
            "Blending Timed Formal Models with Clock Transition Systems.",
            "On the Complexity of the Reachability Problem for Safe, Elementary Hornets.",
            "Properties of Languages with Catenation and Shuffle.",
            "Matching Observed with Empirical Reality - What you see is what you get?",
            "Boundaries, Borders, Fences, Hedges.",
            "Formal Description of Alvis Language with α0 System Layer.",
            "Universal Query Language for Unified State Model.",
            "Multi-Relational Model Tree Induction Tightly-Coupled with a Relational Database.",
            "Social Networks with Competing Products.",
            "Grasp and Path-Relinking for Coalition Structure Generation.",
            "The Incremental Maintenance of Transition Tour.",
            "Definability and Canonicity for Boolean Logic with a Binary Relation.",
            "Computing a Longest Common Palindromic Subsequence.",
            "Using Domain Knowledge in Initial Stages of KDD: Optimization of Compound Object Processing.",
            "Cryptanalysis and Improvement of a Certificateless Multi-proxy Signature Scheme.",
            "Rough Set Characterization for 2-circuit Matroid.",
            "Fast Scalar Multiplications on the Curve v2 = up - au - b over the Finite Field of Characteristic p.",
            "Preface.",
            "Synthesis of Reo Connectors for Strategies and Controllers.",
            "On the π-calculus and Co-intuitionistic Logic. Notes on Logic for Concurrency and λP Systems.",
            "Substructural Meta-Theory of a Type-Safe Language for Web Programming.",
            "A Survey of Decidability Results for Elementary Object Systems.",
            "On the Computational Interpretation of CKn for Contextual Information Processing.",
            "Preface.",
            "Quadratic Algorithms for Testing of Codes and ◊-Codes.",
            "An Efficient Framework for Extracting Parallel Sentences from Non-Parallel Corpora.",
            "Unsupervised and Interactive Semi-supervised Clustering for Large Image Database Indexing and Retrieval.",
            "A Better Heuristic Algorithm for Finding the Closest Trio of 3-colored Points from a Given Set of 3-colored Points on a Plane.",
            "Heuristics to Solve a Real-world Asymmetric Vehicle Routing Problem with Side Constraints.",
            "Extraction of Discriminative Patterns from Skeleton Sequences for Accurate Action Recognition.",
            "Infinite Hierarchy of Permutation Languages.",
            "Translation from Multisingular Hybrid Petri Nets to Multisingular Hybrid Automata.",
            "Centrality Measures, Upper Bound, and Influence Maximization in Large Scale Directed Social Networks.",
            "Apriori-Based Rule Generation in Incomplete Information Databases and Non-Deterministic Information Systems.",
            "Distributed Timed Automata with Independently Evolving Clocks.",
            "A Lower Bound for the HBC Transversal Hypergraph Generation.",
            "An Algorithm for Listing all Minimal Double Dominating Sets of a Tree.",
            "On-the-fly Trace Generation Approach to the Security Analysis of Cryptographic Protocols: Coloured Petri Nets-based Method.",
            "A Robust Audio Watermarking Scheme using Higher-order Statistics in Empirical Mode Decomposition Domain.",
            "Preface.",
            "Old and New Algorithms for Minimal Coverability Sets.",
            "A Sweep-Line Method for Büchi Automata-based Model Checking.",
            "Safety and Soundness for Priced Resource-Constrained Workflow Nets.",
            "Complexity of the Soundness Problem of Workflow Nets.",
            "Process Discovery and Conformance Checking Using Passages.",
            "Modelling Search Engines Performance Using Coloured Petri Nets.",
            "A Reliable Real-time Multicast Authentication Protocol with Provable Accuracy.",
            "Spaced Seed Design Using Perfect Rulers.",
            "Monteiro Spaces and Rough Sets Determined by Quasiorder Relations: Models for Nelson algebras.",
            "The Undecidability of the Logic of Subintervals.",
            "NAO Soccer Robots Path Planning Based on Rough Mereology.",
            "Evolvability by Mimicking Common Properties of a Nervous System and Computer Software.",
            "Preface.",
            "Nominal Groups and Their Homomorphism Theorems.",
            "Reaction System Models for the Heat Shock Response.",
            "Towards a Formal Representation of Interactive Systems.",
            "Accepting Networks of Evolutionary Picture Processors.",
            "The Measurable Space of Stochastic Processes.",
            "Continuation Semantics for Asynchronous Concurrency.",
            "A Nonarchimedian Discretization for Timed Languages.",
            "Syllabic Languages and Go-through Automata.",
            "Natural Language Understanding and Prediction: from Formal Grammars to Large Scale Machine Learning.",
            "Can Machine Learning Learn a Decision Oracle for NP Problems? A Test on SAT.",
            "On Controlled P Systems.",
            "Regularising Ill-posed Discrete Optimisation: Quests with P Systems.",
            "Counting Dependent and Independent Strings.",
            "Preface.",
            "Probabilistic Constructions of Computable Objects and a Computable Version of Lovász Local Lemma.",
            "Periodic Partial Words and Random Bipartite Graphs.",
            "Balances of m-bonacci Words.",
            "Certificates of Non-Membership for Classes of Read-Once Functions.",
            "On the Transition Reduction Problem for Finite Automata.",
            "Principal Ideal Languages and Synchronizing Automata.",
            "More on Square-free Words Obtained from Prefixes by Permutations.",
            "On Fast Heuristic Non-deterministic Algorithms and Short Heuristic Proofs.",
            "Playing with Subshifts.",
            "Preface.",
            "Using a Time Granularity Table for Gradual Granular Data Aggregation.",
            "Querying Cardinal Directions between Complex Objects in Data Warehouses.",
            "Complex Object-Based Multidimensional Modeling and Cube Construction.",
            "A Decomposition Framework for Computing and Querying Multidimensional OLAP Data Cubes over Probabilistic Relational Data.",
            "OLAPing Field Data: a Theoretical and Implementation Framework.",
            "Preface.",
            "Preorder Information Based Attributes' Weights Learning in Multi-attribute Decision Making.",
            "Data-driven Valued Tolerance Relation Based on the Extended Rough Set.",
            "An Analysis of Probabilistic Approximations for Rule Induction from Incomplete Data Sets.",
            "Interactive Method for Semantic Document Indexing Based on Explicit Semantic Analysis.",
            "Incremental Maintenance of Rough Fuzzy Set Approximations under the Variation of Object Set.",
            "Application of Rough Set Theory to Prediction of Antimicrobial Activity of Bis-Quaternary Imidazolium Chlorides.",
            "Fuzzy Rough Decision Trees.",
            "A Multifaceted Analysis of Probabilistic Three-way Decisions.",
            "Deciding Whether or Not a Synchronous Relation is Regular Prefix.",
            "Segmental Mapping and Distance for Rooted Labeled Ordered Trees.",
            "On Axiomatization of Inconsistency Indicators for Pairwise Comparisons.",
            "Extended Generalized Hyperbolic-function Method and New Exact Solutions of the Generalized Hamiltonian and NNV Equations by the Symbolic Computation.",
            "Combinatorial Algorithms for Computing Degenerations of Modules of Finite Dimension.",
            "On the Accuracy of Rough Approximations of Regular Languages.",
            "Graded Consequence with Fuzzy Set of Premises.",
            "Non-probabilistic Solutions of Uncertain Fractional Order Diffusion Equations.",
            "A Generic Methodological Framework for Cyber-ITS: Using Cyber-infrastructure in ITS Data Analysis Cases.",
            "A New Multi-Step Backward Cloud Transformation Algorithm Based on Normal Cloud Model.",
            "A Novel Image Encryption Scheme Based on Generalized Multi-sawtooth Maps.",
            "Preface.",
            "DNA Tiles, Wang Tiles and Combinators.",
            "Floating Channels Between Communicating Nets.",
            "A Domain View of Timed Behaviors.",
            "Rough Inclusion Functions and Similarity Indices.",
            "Simulation Opacity.",
            "Interactive Complex Granules.",
            "Discovery of Cancellation Regions within Process Mining Techniques.",
            "Parameter Synthesis for Timed Kripke Structures.",
            "Analysis of MultiLayer Neural Networks with Direct and Cross Forward Connection.",
            "On the Problem of Boundaries from Mereology and Rough Mereology Points of View.",
            "More About Converting BNF to PEG.",
            "Towards an Object-Oriented Programming Language for Physarum Polycephalum Computing: A Petri Net Model Approach.",
            "Bisimulation-Based Concept Learning in Description Logics.",
            "A Holistic State Equation for Timed Petri Nets.",
            "Closed Sets in Occurrence Nets with Conflicts.",
            "A Neuro-Fuzzy System Combined with Particle Swarm Optimization for Handwritten Character Recognition.",
            "Heuristic Rating Estimation Approach to The Pairwise Comparisons Method.",
            "An Efficient Decoding of Goppa Codes for the McEliece Cryptosystem.",
            "Free Word-Order and Restarting Automata.",
            "A Numerical Algorithm and a Variational Iteration Technique for Solving Higher Order Fuzzy Integro-differential Equations.",
            "Near Groups of Weak Cosets on Nearness Approximation Spaces.",
            "Enjoying to Work.",
            "Tree-Child Cluster Networks.",
            "Length P Systems.",
            "Describing Membrane Computations with a Chemical Calculus.",
            "P Colonies Processing Strings.",
            "Monitoring Changes in Dynamic Multiset Systems.",
            "Antimatter as a Frontier of Tractability in Membrane Computing.",
            "Conventional Verification for Unconventional Computing: a Genetic XOR Gate Example.",
            "Constant-Space P Systems with Active Membranes.",
            "Uniformity is Weaker than Semi-Uniformity for Some Membrane Systems.",
            "Sevilla Carpets Revisited: Enriching the Membrane Computing Toolbox.",
            "Three Universal Homogeneous Spiking Neural P Systems Using Max Spike.",
            "The Stochastic Loss of Spikes in Spiking Neural P Systems: Design and Implementation of Reliable Arithmetic Circuits.",
            "Weighted Spiking Neural P Systems with Rules on Synapses.",
            "From Models to Languages.",
            "Circular Causality in Event Structures.",
            "A Secure Non-monotonic Soft Concurrent Constraint Language.",
            "On Hierarchical Graphs: Reconciling Bigraphs, Gs-monoidal Theories and Gs-graphs.",
            "Epichristoffel Words and Minimization of Moore Automata.",
            "Algebraic Characterization of the Class of Languages Recognized by Measure Only Quantum Automata.",
            "An Abstract Interpretation Framework for Type and Effect Systems.",
            "Categories of Coalgebraic Games with Selective Sum.",
            "Preface.",
            "Approximating Algebraic Tomography Methods by Filtered Backprojection: A Local Filter Approach.",
            "Aligning Projection Images from Binary Volumes.",
            "A New Approach for the Reconstruction of Object-Based Images in Discrete Tomography.",
            "Reconstructing Words from a σ-palindromic Language.",
            "Phase Transitions and Cosparse Tomographic Recovery of Compound Solid Bodies from Few Projections.",
            "Random Generation of hv-Convex Polyominoes with Given Horizontal Projection.",
            "Probabilistic Reconstruction of hv-convex Polyominoes from Noisy Projection Data.",
            "How Random is Your Tomographic Noise? A Number Theoretic Transform (NTT) Approach.",
            "X-ray Microtomography under Loading and 3D-Volume Digital Image Correlation. A Review.",
            "TDOA-based Localization in Two Dimensions: the Bifurcation Curve.",
            "An Algorithmic-type Classification of Tetravalent One-regular Graphs Using Computer Algebra Tools.",
            "Computations in Boolean Algebra with Approximation.",
            "A Robust Digital Watermarking Based on Local Complex Angular Radial Transform.",
            "Quantitative Analysis of Lattice-valued Kripke Structures.",
            "The Impact of a Bi-connected Graph Decomposition on Solving Cooperative Path-finding Problems.",
            "Content-based Image Retrieval using Visual Attention Point Features.",
            "A Unified Definition of Consistent Functions.",
            "Preface.",
            "Engineering MAS - A Device Integration Framework for Smart Home Environments.",
            "A Specification Format for Rooted Branching Bisimulation.",
            "Efficient Rough Set Theory Merging.",
            "Structural and Dynamic Restrictions of Elementary Object Systems.",
            "Identification of Formal Fallacies in a Natural Dialogue.",
            "Genetic Algorithm with Path Relinking for the Orienteering Problem with Time Windows.",
            "An ExpTime Tableau Method for Dealing with Nominals and Qualified Number Restrictions in Deciding the Description Logic SHOQ.",
            "SMT Versus Genetic and OpenOpt Algorithms: Concrete Planning in the PlanICS Framework.",
            "SMT-Based Reachability Checking for Bounded Time Petri Nets.",
            "A Bi-objective Optimization Framework for Heterogeneous CPU/GPU Query Plans.",
            "About New Version of RSDS System.",
            "Preprocessing for Network Reconstruction: Feasibility Test and Handling Infeasibility.",
            "Query Rewriting Based on Meta-Granular Aggregation.",
            "Checking MTL Properties of Discrete Timed Automata via Bounded Model Checking."
        ]
    },
    {
        "name": "FUIN",
        "year": "2013",
        "info": "2013: Volumes\n122,\n123,\n124,\n125,\n126,\n127,\n128",
        "count": 176,
        "papers": [
            "Preface.",
            "Minimal Coverability Set for Petri Nets: Karp and Miller Algorithm with Pruning.",
            "Branching Processes of General Petri Nets.",
            "Refinement of Synchronizable Places with Multi-workflow Nets.",
            "A Petri Net Interpretation of Open Reconfigurable Systems.",
            "Mutex Causality in Processes and Traces of General Elementary Nets.",
            "Synthesis and Analysis of Product-form Petri Nets.",
            "Stochastic Populations, Power Law and Fitness Aggregation in Genetic Algorithms.",
            "Crisp and Fuzzy Topological Interior and Closure Operators with Inclusion Degree. Theory and Applications.",
            "Some Methodological Remarks Inspired by the Paper \"On inner classes\" by A. Igarashi and B. Pierce.",
            "Neighbourhood of Constant Order in the Interval Graph of a Random Boolean Function.",
            "Modeling Group Scheduling Problems in Space and Time by Timed Petri Nets.",
            "On the Trade-off Between Ambiguity and Complexity in Contextual Languages.",
            "Application of Reduction of the Set of Conditional Attributes in the Process of Global Decision-making.",
            "Interactive Exploration of Multi-Dimensional and Hierarchical Information Spaces with Real-Time Preference Elicitation.",
            "A Translation of the Existential Model Checking Problem from MITL to HLTL.",
            "Preface.",
            "Decision Problems for Probabilistic Finite Automata on Bounded Languages.",
            "Z-reachability Problem for Games on 2-dimensional Vector Addition Systems with States is in P.",
            "Gödel Homomorphisms as Gödel Modal Operators.",
            "Better Algorithms for Satisfiability Problems for Formulas of Bounded Rank-width.",
            "A Consequence Relation for Graded Inference within the Frame of Infinite-valued Łukasiewicz Logic.",
            "Efficient Construction of Semilinear Representations of Languages Accepted by Unary Nondeterministic Finite Automata.",
            "Proving the Power of Postselection.",
            "Filtrations of Formal Languages by Arithmetic Progressions.",
            "CHIRA - Convex Hull Based Iterative Algorithm of Rules Aggregation.",
            "Redefinition of Decision Rules Based on the Importance of Elementary Conditions Evaluation.",
            "Making DNA Expressions Minimal.",
            "A Minimal Normal Form for DNA Expressions.",
            "Building Occurrence Nets from Reveals Relations.",
            "On Flooding in the Presence of Random Faults.",
            "Left Random Context ET0L Grammars.",
            "Fuzzy and Intuitionistic Fuzzy Turing Machines.",
            "On the Computational Complexity of Bongartz's Algorithm.",
            "Clustering with Missing Values.",
            "A Comparative Study of Ordered and Covering Information Systems.",
            "On Characterizing Hierarchies of Granulation Structures via Distances.",
            "The Complexity of Szilard Languages of Matrix Grammars Revisited.",
            "Relational Operations and Uncertainty Measure in Rough Relational Database.",
            "Araucaria Trees: Construction and Grafting Theorems.",
            "Algorithms Determining Matrix Morsifications, Weyl orbits, Coxeter Polynomials and Mesh Geometries of Roots for Dynkin Diagrams.",
            "Preface.",
            "Comparing Problem Solving Strategies for NP-hard Optimization Problems.",
            "Lexicon-based Document Representation.",
            "Coupling as Strategy for Reducing Concept-Drift in Never-ending Learning Environments.",
            "Unsupervised Tracking, Roughness and Quantitative Indices.",
            "Knowledge Representation for Human-Computer Interaction in a System Supporting Conceptual Design.",
            "Simulated Activation Patterns of Biological Neurons Cultured onto a Multi-Electrode Array Based on a Modified Izhikevich's Model.",
            "Automatic Learning of Temporal Relations Under the Closed World Assumption.",
            "Robust Rough-Fuzzy C-Means Algorithm: Design and Applications in Coding and Non-coding RNA Expression Data Clustering.",
            "Sufficiently Near Neighbourhoods of Points in Flow Graphs. A Near Set Approach.",
            "An Insight Into The Z-number Approach To CWW.",
            "Soft Nearness Approximation Spaces.",
            "Learning Behaviors of Functions with Teams.",
            "Complete Conceptual Schema Algebras.",
            "Residual Closeness in Cycles and Related Networks.",
            "A Framework for Coxeter Spectral Analysis of Edge-bipartite Graphs, their Rational Morsifications and Mesh Geometries of Root Orbits.",
            "Toroidal Algorithms for Mesh Geometries of Root Orbits of the Dynkin Diagram $\\mathbb{D}_4$.",
            "Preface.",
            "The CHR-based Implementation of the SCIFF Abductive System.",
            "Coalitions of Arguments: An Approach with Constraint Programming.",
            "Product and Production Process Modeling and Configuration.",
            "On the Satisfiability Problem for a 4-level Quantified Syllogistic and Some Applications to Modal Logic.",
            "Nested Weight Constraints in ASP.",
            "On Modal μ-Calculus in S5 and Applications.",
            "Controlling Polyvariance for Specialization-based Verification.",
            "A Logic-based Computational Method for the Automated Induction of Fuzzy Ontology Axioms.",
            "MCINTYRE: A Monte Carlo System for Probabilistic Logic Programming.",
            "Logic-based Reasoning Support for SBVR.",
            "A Tabled Prolog Program for Solving Sokoban.",
            "Local Verification Using a Distributed State Space.",
            "Computer Algebra Technique for Coxeter Spectral Study of Edge-bipartite Graphs and Matrix Morsifications of Dynkin Type 𝔸n.",
            "Reasoning about Resources and Information: A Linear Logic Approach.",
            "A Complete Generalization of Atkin's Square Root Algorithm.",
            "Does there Exist an Algorithm which to Each Diophantine Equation Assigns an Integer which is Greater than the Modulus of Integer Solutions, if these Solutions form a Finite Set?",
            "A Resolution Calculus for First-order Schemata.",
            "Decomposition and Approximation of Loopy Bayesian Networks.",
            "Wide-diameter of Product Graphs.",
            "Algorithms for Relatively Cyclotomic Primes.",
            "On the Validation of Invariants at Runtime.",
            "Preface.",
            "Discrete Tomography Data Footprint Reduction by Information Conservation.",
            "Approximate Discrete Reconstruction Algorithm.",
            "Polygons Drawn from Permutations.",
            "Discrete Tomography in MRI: a Simulation Study.",
            "The Reconstruction of Polyominoes from Horizontal and Vertical Projections and Morphological Skeleton is NP-complete.",
            "A Regularized, Pyramidal Multi-grid Approach to Global 3D-Volume Digital Image Correlation Based on X-ray Micro-tomography.",
            "Critical Parameter Values and Reconstruction Properties of Discrete Tomography: Application to Experimental Fluid Dynamics.",
            "Discrete Tomography Data Footprint Reduction via Natural Compression.",
            "Solving Multicolor Discrete Tomography Problems by Using Prior Knowledge.",
            "On Language Equations with One-sided Concatenation.",
            "Decomposition of Relations and Concept Lattices.",
            "Algebra of Rough Sets based on Quasi Order.",
            "Chameleon Hash Functions and One-Time Signature Schemes from Inner Automorphism Groups.",
            "Preface.",
            "Stochastic Cellular Automata: Correlations, Decidability and Simulations.",
            "On Completeness and Decidability of Phase Space Invertible Asynchronous Cellular Automata.",
            "Periodic Orbits and Dynamical Complexity in Cellular Automata.",
            "One-Dimensional Cellular Automaton Transducers.",
            "Two-Way Finite Automata: Old and Recent Results.",
            "A 6-state Universal Semi-totalistic Cellular Automaton on Kite and Dart Penrose Tilings.",
            "Constructions with Countable Subshifts of Finite Type.",
            "Preface.",
            "An Improved Cop-Kmeans Clustering for Solving Constraint Violation Based on MapReduce Framework.",
            "Hybridization of the Gravitational Search Algorithm and Big Bang-Big Crunch Algorithm for Data Clustering.",
            "ROSECON: a Computer Tool for Synthesis and Verification of Concurrent Systems Specified by Information Systems.",
            "Decision-theoretic Rough Sets in Incomplete Information System.",
            "A Novel Method for Elimination of Inconsistencies in Ordinal Classification with Monotonicity Constraints.",
            "Vector-based Attribute Reduction Method for Formal Contexts.",
            "Non-Monotonic Attribute Reduction in Decision-Theoretic Rough Sets.",
            "Nearness of Sets in Local Admissible Covers. Theory and Application in Micropalaeontology.",
            "Preface.",
            "Rough Sets: Some Foundational Issues.",
            "Concept Formation: Rough Sets and Scott Systems.",
            "Discrete Duality for Rough Relation Algebras.",
            "Duality in Rough Set Theory Based on the Square of Opposition.",
            "On a Notion of Extensionality for Artifacts.",
            "Rough Net Structures - Example of Information System.",
            "Bridging Membrane and Reaction Systems - Further Results and Research Topics.",
            "Proving Theorems by Program Transformation.",
            "Automated Generation of Logical Constraints on Approximation Spaces Using Quantifier Elimination.",
            "Classifiers Based on Optimal Decision Rules.",
            "Finding Meaningful Bayesian Confirmation Measures.",
            "An Experimental Comparison of Three Probabilistic Approximations Used for Rule Induction.",
            "Weak Dependencies in Approximation Spaces.",
            "Incremental Induction of Medical Diagnostic Rules Based on Incremental Sampling Scheme and SubRule Layers.",
            "Mining Meta-Actions for Action Rules Reduction.",
            "Lattice Machine Classification based on Contextual Probability.",
            "A Rough Set Approach to Information Systems Decomposition.",
            "Random Reducts: A Monte Carlo Rough Set-based Method for Feature Selection in Large Datasets.",
            "A Weighted Threshold for Detection of Cancerous miRNA Expressions.",
            "Using Non-Zero Dimensions for the Cosine and Tanimoto Similarity Search Among Real Valued Vectors.",
            "Music Recommendation Based on Multidimensional Description and Similarity Measures.",
            "Complex Decision Systems and Conflicts Analysis Problem.",
            "Treasure Trove at Banacha. Set Patterns in Descriptive Proximity Spaces.",
            "An Approach to Pattern Recognition Based on Hierarchical Granular Computing.",
            "Granular Computing Based on Gaussian Cloud Transformation.",
            "From Numeric to Granular Description and Interpretation of Information Granules.",
            "Unifying Rough Set Theories via Large Scaled Granular Computing.",
            "The First Step Toward Processor for Rough Set Methods.",
            "Two Database Related Interpretations of Rough Approximations: Data Organization and Query Execution.",
            "Generalized Hybrid Encoding of Polyhierarchical Structures.",
            "Utilizing BDI Agents and a Topological Theory for Mining Online Social Networks.",
            "A Domain Knowledge as a Tool For Improving Classifiers.",
            "Mining Therapeutic Patterns from Clinical Data for Juvenile Diabetes.",
            "Outlier Detection by Interaction with Domain Experts.",
            "Decision Prediction Using Visual Patterns.",
            "Adaptive Method of Adjusting Flowgraph for Route Reconstruction in Video Surveillance Systems.",
            "Preface.",
            "A Greedy Algorithm for Construction of Decision Trees for Tables with Many-Valued Decisions - A Comparative Study.",
            "Java SAM Typed Closures: A Sound and Complete Type Inference System for Nominal Types.",
            "Equations for Asynchronous Message Passing.",
            "One Graph to Rule Them All Software Measurement and Management.",
            "Automated Discovery of Properties of Rough Sets.",
            "Information Flow Testing.",
            "Defining Multi-Party Compromises using Unfoldings of Workflow Nets.",
            "A Hierarchy of Languages with Catenation and Shuffle.",
            "Analyzing Compatibility of Services via Resource Conformance.",
            "Ant-Based Clustering in Delta Episode Information Systems Based on Temporal Rough Set Flow Graphs.",
            "Nearness of Visual Objects. Application of Rough Sets in Proximity Spaces.",
            "From EBNF to PEG.",
            "A New Class of Fuzzy Petri Nets for Knowledge Representation and Reasoning.",
            "On Minimality and Equivalence of Petri Nets.",
            "An Incidence Algebra Approach to Knowledge Granulation in Pawlak Information Systems.",
            "Proving Propositional Tautologies in a Natural Dialogue.",
            "Preface.",
            "Towards Scalable and Cost-aware Bioinformatics Workflow Execution in the Cloud - Recent Advances to the Tavaxy Workflow System.",
            "Approaches to Distributed Execution of Scientific Workflows in Kepler.",
            "Hybrid Analytic Flows - the Case for Optimization.",
            "Turbine: A Distributed-memory Dataflow Engine for High Performance Many-task Applications.",
            "Data Linkage Algebra, Data Linkage Dynamics, and Priority Rewriting.",
            "A Logic Framework for Incremental Learning of Process Models.",
            "State Elimination Heuristics for Short Regular Expressions.",
            "Arithmetical Analysis of Biomolecular Finite Automaton.",
            "Bayesian Segmentation Based Local Geometrically Invariant Image Watermarking.",
            "Minimal Description and Maximal Description in Covering-based Rough Sets."
        ]
    },
    {
        "name": "FUIN",
        "year": "2012",
        "info": "2012: Volumes\n114, 115, 116, 117, 118, 119, 120, 121",
        "count": 165,
        "papers": [
            "Finite-valued Logics for Information Processing.",
            "A Note on the Model Theory for Positive Modal Logic.",
            "Pseudopower Avoidance.",
            "An Algebraic Semantics for QVT-Relations Check-only Transformations.",
            "Erratum to the paper: Forward-Secure Identity-Based Public-Key Encryption without Random Oracles.",
            "Dynamic Coloring of Graphs.",
            "Unambiguous Functions in Logarithmic Space.",
            "A Graph Grammar Model of the hp Adaptive Three Dimensional Finite Element Method. Part I.",
            "A Graph Grammar Model of the hp Adaptive Three Dimensional Finite Element Method. Part II.",
            "Ellipse Invariant Algorithm for Texture Classification.",
            "Preface.",
            "Cryptanalysis of the Full AES Using GPU-Like Special-Purpose Hardware.",
            "Evaluation of PP-1 Cipher Resistance against Differential and Linear Cryptanalysis in Comparison to a DES-like Cipher.",
            "On Second-order Nonlinearities of Some D0 Type Bent Functions.",
            "Algorithm for Generating Primes p and q Such that q Divides p4 ± p3 + p2 ± p + 1.",
            "Remarks on Pseudorandom Binary Sequences Over Elliptic Curves.",
            "The Cube Attack on Stream Cipher Trivium and Quadraticity Tests.",
            "Attacking M&M Collective Signature Scheme.",
            "Public-Key Cryptography Based on a Cubic Extension of the Lucas Functions.",
            "Remarks on the Classical Threshold Secret Sharing Schemes.",
            "Solving Trivium-based Boolean Equations Using the Method of Syllogisms.",
            "Preface.",
            "Epistemic Quantum Computational Structures in a Hilbert-space Environment.",
            "Completeness of Inner Product Spaces and G. Cattaneo.",
            "The Bipolar Complemented de Morgan Brouwer-Zadeh Distributive Lattice as an Algebraic Structure for the Dominance-based Rough Set Approach.",
            "Temporal Dynamics in Information Tables.",
            "On the Undecidability of Attractor Properties for Cellular Automata.",
            "From One-dimensional to Two-dimensional Cellular Automata.",
            "Computational Complexity of Avalanches in the Kadanoff Sandpile Model.",
            "Size Constrained Distance Clustering: Separation Properties and Some Complexity Results.",
            "Preface.",
            "Autonomous Knowledge-oriented Clustering Using Decision-Theoretic Rough Set Theory.",
            "Modelling Multi-agent Three-way Decisions with Decision-theoretic Rough Sets.",
            "A Multiple-category Classification Approach with Decision-theoretic Rough Sets.",
            "Soft Minimum-Enclosing-Ball Based Robust Fuzzy Rough Sets.",
            "Knowledge Reduction in Random Incomplete Decision Tables via Evidence Theory.",
            "Attribute Reduction Using Extension of Covering Approximation Space.",
            "Correlating Fuzzy and Rough Clustering.",
            "Set-theoretic Approaches to Granular Computing.",
            "Preface.",
            "Relations between Proto-fuzzy Concepts, Crisply Generated Fuzzy Concepts, and Interval Pattern Structures.",
            "Row and Column Spaces of Matrices over Residuated Lattices.",
            "The Category of L-Chu Correspondences and the Structure of L-Bonds.",
            "Fixing Generalization Defects in UML Use Case Diagrams.",
            "Computing Implications with Negation from a Formal Context.",
            "Attribute Exploration of Properties of Functions on Sets.",
            "Computing Formal Concepts by Attribute Sorting.",
            "Words, Graphs, Automata, and Languages; Special Issue Honoring the 60th Birthday of Professor Tero Harju.",
            "On the Computational Complexity of Matrix Semigroup Problems.",
            "Binary Symmetric Matrix Inversion Through Local Complementation.",
            "Some Characterizations of Sturmian Words in Terms of the Lexicographic Order.",
            "On the Shuffle of Star-Free Languages.",
            "A Note on the Logical Definability of Rational Trace Languages.",
            "A Boolean Approach for Disentangling the Roles of Submodules to the Global Properties of a Biomodel.",
            "The Krohn-Rhodes Theorem and Local Divisors.",
            "State Complexity of Combined Operations with Union, Intersection, Star and Reversal.",
            "Recurrent Construction of MacWilliams and Chebyshev Matrices.",
            "Subgroup Switching of Skew Gain Graphs.",
            "A Characterization of Regular Languages as Equality Sets of HDT0L Sequences.",
            "A Survey of Results on Stateless Multicounter Automata.",
            "Modified Traffic Cellular Automaton for the Density Classification Task.",
            "Repetition-freeness with Cyclic Relations and Chain Relations.",
            "Syntactic Complexity of Ultimately Periodic Sets of Integers and Application to a Decision Procedure.",
            "On One-Rule Grid Semi-Thue Systems.",
            "Language Equations with Symmetric Difference.",
            "The Computational Complexity of Universality Problems for Prefixes, Suffixes, Factors, and Subwords of Regular Languages.",
            "Mirror Images and Schemes for the Maximal Complexity of Nondeterminism.",
            "Length-k-overlap-free Binary Infinite Words.",
            "Foreword.",
            "Reminiscing over.",
            "Variation Statistics on Compositions.",
            "Some New Self-avoiding Walk and Polygon Models.",
            "Pattern 1j+10j Avoiding Binary Words.",
            "Half-lattice Paths and Virasoro Characters.",
            "Boys-and-girls Birthdays and Hadamard Products.",
            "A Kolmogorov-Smirnov Test for r Samples.",
            "Visits to Level r by Dyck Paths.",
            "On the Distributions of Absorbed Particles in Crossing a Field Containing Absorption Points.",
            "On Simsun and Double Simsun Permutations Avoiding a Pattern of Length Three.",
            "Bijective Counting of Involutive Baxter Permutations.",
            "On Families of Weakly Cross-intersecting Set-pairs.",
            "A Representation Theorem for Holonomic Sequences Based on Counting Lattice Paths.",
            "Generating Functions of Embedded Trees and Lattice Paths.",
            "On Terminating and Non-Terminating q-Gauss Hypergeometric Series Distributions and the Associated q-Orthogonal Polynomials.",
            "Domino Tilings with One Diagonal Impurity.",
            "A Lattice Path Combinatorial Approach to Rothe Numbers and Related Convolution Results.",
            "Dyck Paths with Parity Restrictions for the Final Runs to the Origin: a Study of the Height.",
            "Bivariate Finite Operator Calculus and Counting Ballot Paths Containing Patterns.",
            "Preface.",
            "Adhesivity with Partial Maps instead of Spans.",
            "ℳ-Adhesive Transformation Systems with Nested Application Conditions. Part 2: Embedding, Critical Pairs and Local Confluence.",
            "Lazy Graph Transformation.",
            "Transformation of Typed Composite Graphs with Inheritance and Containment Structures.",
            "Hoare-Style Verification of Graph Programs.",
            "Counterpart Semantics for a Second-Order μ-Calculus.",
            "Public Announcement Logic in Geometric Frameworks.",
            "Reduced-by-matching Graphs: Toward Simplifying Hamiltonian Circuit Problem.",
            "Spearman Permutation Distances and Shannon's Distinguishability.",
            "Tree Matrices and a Matrix Reduction Algorithm of Belitskii.",
            "A Novel Steganographic Method with Four-Pixel Differencing and Modulus Function.",
            "Development of Near Sets Within the Framework of Axiomatic Fuzzy Sets.",
            "A Label Correcting Algorithm for the Bus Routing Problem.",
            "Preface.",
            "Spatial and Stochastic Effects in a Model of Viral Infection.",
            "Flexible and Robust Patterning by Centralized Gene Networks.",
            "An Adaptive Coarse Graining Method for Signal Transduction in Three Dimensions.",
            "Complexity Issues in Computational Biology.",
            "Executable Modeling of Morphogenesis: A Turing-Inspired Approach.",
            "Self-organized Patterning by Diffusible Factors: Roles of a Community Effect.",
            "Preface.",
            "Approximations on Minimum Weight Triangulations and Minimum Weight Pseudo-Triangulations Using Ant Colony Optimization Metaheuristic.",
            "A Flexible and Adaptive Hyper-heuristic Approach for (Dynamic) Capacitated Vehicle Routing Problems.",
            "Feeding Syntactic Versus Semantic Knowledge to a Knowledge-lean Unsupervised Word Sense Disambiguation Algorithm with an Underlying Naïve Bayes Model.",
            "The Topological Complexity of MSO+U and Related Automata Models.",
            "Rough C-means and Fuzzy Rough C-means for Colour Quantisation.",
            "Tabular Expressions Operators.",
            "Inflation Algorithms for Positive and Principal Edge-bipartite Graphs and Unit Quadratic Forms.",
            "Antirandom Test Vectors for BIST in Hardware/Software Systems.",
            "Mining Induced/Embedded Subtrees using the Level of Embedding Constraint.",
            "Preface.",
            "Dynamic Programming Approach for Partial Decision Rule Optimization.",
            "The Equivalence of Reduction and Translation Semantics of Java Simple Closures.",
            "Exclusive Access to Resources in Distributed Shared Memory Architecture.",
            "Improving Reachability Analysis of Infinite State Systems by Specialization.",
            "On Graded Nearness of Sets.",
            "Unsupervised Similarity Learning from Textual Data.",
            "Update Propagator for Joint Scalable Storage.",
            "Unifying Equivalences for Higher Dimensional Automata.",
            "Towards SAT-based BMC for LTLK over Interleaved Interpreted Systems.",
            "An Improved Construction of Deterministic Omega-automaton Using Derivatives.",
            "Machine Learning for Traffic Prediction.",
            "Rough Set Based Reasoning About Changes.",
            "Enumeration and Leader Election in Partially Anonymous and Multi-hop Broadcast Networks.",
            "CRN Elimination and Substitution Bases for Complexity Classes.",
            "Reversible Data Hiding Scheme Based on Image Inpainting.",
            "Sheng Yu (1950-2012) In Memoriam.",
            "Elementary Yet Precise Worst-Case Analysis of Floyd's Heap-Construction Program.",
            "An Improved Axiomatic Definition of Information Granulation.",
            "On the Behaviours Produced by Instruction Sequences under Execution.",
            "Variance as a Stopping Criterion for Genetic Algorithms with Elitist Model.",
            "Computing Issues of Asynchronous CA.",
            "Towards Automatic Composition of Web Services: SAT-Based Concretisation of Abstract Scenarios.",
            "Preface.",
            "Synthesizing Concurrent Programs Using Answer Set Programming.",
            "Greedy Algorithms for Construction of Approximate Tests for Decision Tables with Many-Valued Decisions.",
            "Cellular Resource-Driven Automata.",
            "On Conditions for Modular Verification in Systems of Synchronising Components.",
            "On Compositionality of Boundedness and Liveness for Nested Petri Nets.",
            "Informational Analysis of Security and Integrity.",
            "Quantification of Positive and Negative Attacker's Information.",
            "Conservative Elementary Object Systems.",
            "Algebraical Characterisation of Interval-Timed Petri Nets with Discrete Delays.",
            "The Impedance Mismatch in Light of the Unified State Model.",
            "A New Translation from ECTL* to SAT.",
            "Preface.",
            "Completeness and Soundness Results for with Intersection and Union Types.",
            "The Algebra of Expansion.",
            "Characterising Strongly Normalising Intuitionistic Terms.",
            "Reducibility Proofs in the λ-Calculus.",
            "On Realisability Semantics for Intersection Types with Expansion Variables.",
            "Intersection Types and Termination Properties.",
            "Intersection Types with Subtyping by Means of Cut Elimination.",
            "Strong Normalization in the π-calculus with Intersection and Union Types.",
            "Intersection Types from a Proof-theoretic Perspective.",
            "Towards a Logic for Union Types."
        ]
    },
    {
        "name": "FUIN",
        "year": "2011",
        "info": "2011: Volumes\n106, 107, 108, 109, 110, 111, 112, 113",
        "count": 171,
        "papers": [
            "A Paraconsistent Linear-time Temporal Logic.",
            "Level Mapping Induced Loop Formulas for Weight Constraint and Aggregate Logic Programs.",
            "Unsupervised and Supervised Learning Approaches Together for Microarray Analysis.",
            "Structural Feature-Based Image Hashing and Similarity Metric for Tampering Detection.",
            "Application of the Method of Editing and Condensing in the Process of Global Decision-making.",
            "Preface.",
            "Proof-graphs: a Thorough Cycle Treatment, Normalization and Subformula Property.",
            "Observational Completeness on Abstract Interpretation.",
            "First-Order Linear-time Epistemic Logic with Group Knowledge: An Axiomatisation of the Monodic Fragment.",
            "Towards a Behavioral Algebraic Theory of Logical Valuations.",
            "About Parallel and Syntactocentric Formalisms: A Perspective from the Encoding of Convergent Grammar into Abstract Categorial Grammar.",
            "On Inferences of Full First-Order Hierarchical Decompositions.",
            "Team Logic and Second-Order Logic.",
            "Dualities for Algebras of Fitting's Many-Valued Modal Logics.",
            "A Schema for Generating Relevant Logic Programming Semantics and its Applications in Argumentation Theory.",
            "Knowledge, Time, and the Problem of Logical Omniscience.",
            "K-Comma Codes and Their Generalizations.",
            "Formal Analysis of SystemC Designs in Process Algebra.",
            "Mechanical Analysis of Finite Idempotent Relations.",
            "Rough Truth Degrees of Formulas and Approximate Reasoning in Rough Logic.",
            "Analysis of Recognition of a Musical Instrument in Sound Mixes Using Support Vector Machines.",
            "Cryptanalysis of an Identity Based Signcryption without Random Oracles.",
            "RCRA 2009 Experimental Evaluation of Algorithms for Solving Problems with Combinatorial Explosion.",
            "Flexible Plan Verification: Feasibility Results.",
            "Parallel QBF Solving with Advanced Knowledge Sharing.",
            "An Empirical Analysis of Some Heuristic Features for Planning through Local Search and Action Graphs.",
            "Efficient Graph Kernels for Textual Entailment Recognition.",
            "An automaton Constraint for Local Search.",
            "Restoring CSP Satisfiability with MaxSAT.",
            "Deriving Information from Sampling and Diving.",
            "Partitioning Search Spaces of a Randomized Search.",
            "A Representation Theorem for Primitive Recursive Algorithms.",
            "On the Fermat-Weber Point of a Polygonal Chain and its Generalizations.",
            "Trade-Offs Between Time, Space, Cooperation, and Communication Complexity for CD Grammar Systems.",
            "Look-back Techniques for ASP Programs with Aggregates.",
            "Analysis of Markov Boundary Induction in Bayesian Networks: A New View From Matroid Theory.",
            "Preface.",
            "A Scheduling Strategy for Synchronous Elastic Designs.",
            "Saving Space in a Time Efficient Simulation Algorithm.",
            "Compact Representations and Efficient Algorithms for Operating Guidelines.",
            "Flat Arbiters.",
            "From Concurrent Multi-clock Programs to Deterministic Asynchronous Implementations.",
            "A Modal Interface Theory for Component-based Design.",
            "Guaranteeing Weak Termination in Service Discovery.",
            "Preface.",
            "Monadic Algebras: a Standpoint on Rough Sets.",
            "An Investigation About Rough Set Theory: Some Foundational and Mathematical Aspects.",
            "Rough Sets, Coverings and Incomplete Information.",
            "Two Semantic Issues in a Probabilistic Rough Set Model.",
            "Game-Theoretic Rough Sets.",
            "Orthopairs: A Simple and Widely UsedWay to Model Uncertainty.",
            "Textures and Fuzzy Rough Sets.",
            "On Some Mathematical Structures of T-Fuzzy Rough Set Algebras in Infinite Universes of Discourse.",
            "From Glushkov WFAs to K-Expressions.",
            "Constraint Satisfaction Problems in Clausal Form I: Autarkies and Deficiency.",
            "Constraint Satisfaction Problems in Clausal Form II: Minimal Unsatisfiability and Conflict Structure.",
            "Reversible Steganography for BTC-compressed Images.",
            "An Operational Petri Net Semantics for A2CCS.",
            "On the State Complexity of Star of Union and Star of Intersection.",
            "A Tissue P Systems Based Uniform Solution to Tripartite Matching Problem.",
            "Cryptanalysis of Two Efficient HIBE Schemes in the Standard Model.",
            "Multiplicative Transition Systems.",
            "Preface.",
            "Resource Driven Automata Nets.",
            "Properties of Java Simple Closures.",
            "On Deadlock and Fairness Decision Problems for Computations on Client-server Systems.",
            "A Logic-Algebraic Approach to Graded Inclusion.",
            "Gained and Excluded Private Actions by Process Observations.",
            "A Relation between Modal Logic and Language Closure Operators.",
            "BDD-based Bounded Model Checking for Temporal Properties of 1-Safe Petri Nets.",
            "BITES Instead of FIRST for Parsing Expression Grammar.",
            "Function Approximation and Quality Measures in Rough-Granular Systems.",
            "Incomplete and Nondeterministic Information Systems: Object-Directed Semantics for Descriptor Languages.",
            "Stephen L. Bloom 1940-2010.",
            "eDonkey & eMule's Kad: Measurements & Attacks.",
            "Transformations Between Different Models of Unranked Bottom-Up Tree Automata.",
            "Mesh Algorithms for Solving Principal Diophantine Equations, Sand-glass Tubes and Tori of Roots.",
            "An Axiomatic Approach to the Roughness Measure of Rough Sets.",
            "Erratum to the paper: \"A Logic-Based System for e-Tourism\".",
            "Preface.",
            "A Multi-Criteria Metric Algorithm for Recommender Systems.",
            "P Systems with Insertion and Deletion Exo-Operations.",
            "Directed Overlap-inclusion Graphs as Representations of Ciliate Genes.",
            "Limit Sets of Stable and Unstable Cellular Automata.",
            "On the Hardness of Reoptimization with Multiple Given Solutions.",
            "Picture Languages Generated by Assembling Tiles.",
            "Typical Paths of a Graph.",
            "Hierarchies of Stateless Multicounter 5′ → 3′ Watson-Crick Automata Languages.",
            "On Approximating Non-regular Languages by Regular Languages.",
            "Transition Complexity of Incomplete DFAs.",
            "Computational Complexity of NURIKABE.",
            "The Sequence Equivalence Problem for Marked DT0L Systems.",
            "Minimum Unique Substrings and Maximum Repeats.",
            "The Unique Decipherability in the Monoid of Regular Languages is Undecidable.",
            "On the Regularity of Iterated Hairpin Completion of a Single Word.",
            "Membrane Systems with Qualitative Evolution Rules.",
            "State Complexity of Union and Intersection for Two-way Nondeterministic Finite Automata.",
            "Two-Way Reversible Multi-Head Finite Automata.",
            "On the Hairpin Incompletion.",
            "Limited Asynchronous Spiking Neural P Systems.",
            "Looking for Small Efficient P Systems.",
            "On Restricted Bio-Turing Machines.",
            "Characterizations and Existence of Easy Sets without Hard Subsets.",
            "Universality of Splicing Test Tube Systems with Two Tubes.",
            "On Almost-Sure Properties of Probabilistic Discrete Event Systems.",
            "Preface.",
            "Double Approximation and Complete Lattices.",
            "Attribute Reduction in Formal Contexts: A Covering Rough Set Approach.",
            "The Construction of Fuzzy Concept Lattices Based on (θ, σ)-Fuzzy Rough Approximation Operators.",
            "Approximation Operators, Binary Relation and Basis Algebra in L-fuzzy Rough Sets.",
            "Kernelized Fuzzy Rough Sets Based Yawn Detection for Driver Fatigue Monitoring.",
            "A Novel Multimodal Probability Model for Cluster Analysis.",
            "Object-Oriented Inheritance Metrics in the Context of Cognitive Complexity.",
            "On the Generative Power of ω-Grammars and ω-Automata.",
            "Infinite Traces and Symbolic Dynamics - the Minimal Shift Case.",
            "Weighted Extended Tree Transducers.",
            "Solution to the Range Problem for Combinatory Logic.",
            "Rough Truth Degrees of Formulas and Approximate Reasoning in Rough Logic.",
            "Forward-Secure Identity-Based Public-Key Encryption without Random Oracles.",
            "A Nonmonotonic Soft Concurrent Constraint Language to Model the Negotiation Process.",
            "Properties Complementary to Program Self-Reference.",
            "Self-Indexed Grammar-Based Compression.",
            "Runtime Monitoring of Contract Regulated Web Services.",
            "Reduction Techniques for Acyclic Cover Transducers.",
            "Mop: An Efficient Algorithm for Mining Frequent Pattern with Subtree Traversing.",
            "Efficient Algorithms for Games Played on Trees with Back-edges.",
            "A Lower Bound of the Second-order Nonlinearities of Boolean Bent Functions.",
            "Spiking Neural dP Systems.",
            "Rainbow Induced Subgraphs in Proper Vertex Colorings.",
            "Computing k-block Morphisms by Spiking Neural P Systems.",
            "Preface.",
            "Maximally Parallel Probabilistic Semantics for Multiset Rewriting.",
            "Model Checking Temporal-Epistemic Logic Using Alternating Tree Automata.",
            "On Synthesis and Analysis of Generalized Work Flow Net Structures and Transition Graphs.",
            "PlanICS - a Web Service Composition Toolset.",
            "Liveness of Safe Object Nets.",
            "Dynamic Motion Control: Adaptive Bimanual Grasping for a Humanoid Robot.",
            "Software Agent Systems for Improving Performance of Multi-Robot Groups.",
            "Preface.",
            "On the Size of Unary Probabilistic and Nondeterministic Automata.",
            "Blackhole Pushdown Automata.",
            "On Networks of Evolutionary Processors with Filters Accepted by Two-State-Automata.",
            "A Kleene-Schützenberger Theorem for Trace Series over Bounded Lattices.",
            "Growing Grammars and Length-reducing Automata.",
            "On McNaughton Families of Languages That Are Specified by Some Variants of Monadic String-Rewriting Systems.",
            "Survey: Weighted Extended Top-down Tree Transducers Part II - Application in Machine Translation.",
            "Versatility of 'Continuations' in Discourse Semantics.",
            "Rough Approximations in Varieties of Regular Languages.",
            "Algebraic Framework for the Specification and Analysis of Cryptographic-Key Distribution.",
            "A Framework for Interval Quantization and Application to Interval Based Algorithms in Digital Signal Processing.",
            "Security Pitfalls of the Certificateless Signature and Multi-Receiver Signcryption Schemes.",
            "Preface.",
            "Solving the International Timetabling Competition: a Deterministic Approach.",
            "Nested Preferences in Answer Set Programming.",
            "A Possibilistic Argumentation Decision Making Framework with Default Reasoning.",
            "A Threshold for a Polynomial Solution of #2SAT.",
            "Armin: Automatic Trance Music Composition using Answer Set Programming.",
            "Preface.",
            "Uncovering Bivariate Interactions in High Dimensional Data Using Random Forests with Data Augmentation.",
            "Efficient Search Methods for Statistical Dependency Rules.",
            "Relational Feature Mining with Hierarchical Multitask kFOIL.",
            "Preface.",
            "Separability in Persistent Petri Nets.",
            "Learning Workflow Petri Nets.",
            "High-Level Petri Net Model Checking with AlPiNA.",
            "On Three Alternative Characterizations of Combined Traces.",
            "Wendy: A Tool to Synthesize Partners for Services.",
            "Accelerations for the Coverability Set of Petri Nets with Names.",
            "Light Region-based Techniques for Process Discovery.",
            "Can Stubborn Sets Be Optimal?",
            "Causal Behavioural Profiles - Efficient Computation, Applications, and Evaluation."
        ]
    },
    {
        "name": "FUIN",
        "year": "2010",
        "info": "2010: Volumes\n98, 99, 100, 101, 102, 103, 104, 105",
        "count": 157,
        "papers": [
            "Analysis of the Effectiveness of the Genetic Algorithms based on Extraction of Association Rules.",
            "Scalable Clustering for Mining Local-Correlated Clusters in High Dimensions and Large Datasets.",
            "Discovering the Radio Signal Coverage Hole and Weak Coverage Area in Mobile Network by Spatiotemporal Data Mining on Location-Based Services.",
            "Predicting Website Audience Demographics forWeb Advertising Targeting Using Multi-Website Clickstream Data.",
            "Mining Outliers in Correlated Subspaces for High Dimensional Data Sets.",
            "Covariance Matrix Self-Adaptation and Kernel Regression - Perspectives of Evolutionary Optimization in Kernel Machines.",
            "Risk Mining in Medicine: Application of Data Mining to Medical Risk Management.",
            "Communication Error Determination System for Multi-layered or Chained Situations.",
            "Deterministic and Unambiguous Families within Recognizable Two-dimensional Languages.",
            "Feature Selection via Maximizing Fuzzy Dependency.",
            "Learning Behaviors of Functions.",
            "Adaptive Rough Entropy Clustering Algorithms in Image Segmentation.",
            "Design of a Hybrid Quantizer with Variable Length Code.",
            "Tree Structure Based Data Hiding for Progressive Transmission Images.",
            "On the Insecurity of an Identity Based Proxy Re-encryption Scheme.",
            "Free-Choice Petri Nets without Frozen Tokens, and Bipolar Synchronization Systems.",
            "Capacity-Raising Steganography Using Multi-Pixel Differencing and Pixel-Value Shifting Operations.",
            "On the Borel Complexity of MSO Definable Sets of Branches.",
            "Properties of Almost All Graphs and Generalized Quantifiers.",
            "A Most General Edge Elimination Polynomial - Thickening of Edges.",
            "A Note on Two-pebble Automata Over Infinite Alphabets.",
            "Tree-width in Algebraic Complexity.",
            "Grill Determined L-Approach Merotopological Spaces.",
            "Evolutionary Rough Parallel Multi-Objective Optimization Algorithm.",
            "Matrix Graph Grammars with Application Conditions.",
            "A Generic Approach to Connector Architectures Part I: The General Framework.",
            "A Generic Approach to Connector Architectures Part II: Instantiation to Petri Nets and CSP.",
            "Solving Sequential Planning Problems via Constraint Satisfaction.",
            "A Framework for Iterated Belief Revision Using Possibilistic Counterparts to Jeffrey's Rule.",
            "Interval-Valued Fuzzy Galois Connections: Algebraic Requirements and Concept Lattice Construction.",
            "Fuzzy Clustering for Semantic Knowledge Bases.",
            "Autonomy-Oriented Search in Dynamic Community Networks: A Case Study in Decentralized Network Immunization.",
            "Identifying Prime Implicate Branches in Reduced Implicate Tries.",
            "Arrow Index of a Fuzzy Choice Function.",
            "Computing Supports of Conjunctive Queries on Relational Tables with Functional Dependencies.",
            "Relational Contexts and Relational Concepts.",
            "Separating Multi-Color Points on a Plane with Fewest Axis-Parallel Lines.",
            "On the State Complexity of Scattered Substrings and Superstrings.",
            "Set-theoretical Constructions of Boolean Functions and theirs Applications in Logic Synthesis.",
            "An Interface Group for Process Components.",
            "Algebraic Ordinals.",
            "Bit-Parallel Algorithm for the Constrained Longest Common Subsequence Problem.",
            "Solvability of the Halting and Reachability Problem for Binary 2-tag Systems.",
            "Bounded Number of Parallel Productions in Scattered Context Grammars with Three Nonterminals.",
            "Expressing Cardinality Quantifiers in Monadic Second-Order Logic over Trees.",
            "Game Solution, Epistemic Dynamics and Fixed-Point Logics.",
            "A Note on Forcing and Type Theory.",
            "A Framework for Graded Beliefs, Goals and Intentions.",
            "Structures with Multirelations, their Discrete Dualities and Applications.",
            "A Local Version of the MLEM2 Algorithm for Rule Induction.",
            "Local Computations on Triangular Graphs.",
            "Approximation Spaces in Rough-Granular Computing.",
            "Dynamic Mereotopology: A Point-free Theory of Changing Regions. I. Stable and unstable mereotopological relations.",
            "PSF - A Retrospective.",
            "Preface.",
            "Synthesis and Analysis of Net Structures and Transition Graphs with Inhibitor Relations.",
            "Bounded Parametric Verification for Distributed Time Petri Nets with Discrete-Time Semantics.",
            "Safeness for Object Nets.",
            "Minimal Regions of ENL-Transition Systems.",
            "Interacting Workflow Nets for Workflow Process Re-Engineering.",
            "Partial Order Reductions for Model Checking Temporal-epistemic Logics over Interleaved Multi-agent Systems.",
            "On Computing Extensions and Restrictions of Information Systems Noting Some Order Properties.",
            "Infinite Product of Traces Represented by Projections.",
            "Toward Intelligent Searching the Rough Set Database System (RSDS): an Ontological Approach.",
            "Multi-Agent Decision Taking System.",
            "Perception and Classification. A Note on Near Sets and Rough Sets.",
            "Approximating Tree Edit Distance through String Edit Distance for Binary Tree Codes.",
            "Finding Patterns In Given Intervals.",
            "Similarity-Based Classification in Relational Databases.",
            "An Improved Bound for an Extension of Fine and Wilf's Theorem and Its Optimality.",
            "Level Mapping Induced Loop Formulas for Weight Constraint and Aggregate Logic Programs.",
            "Computing Maximal Error-detecting Capabilities and Distances of Regular Languages.",
            "Boruta - A System for Feature Selection.",
            "A Robust Multiple Classifier System for Pixel Classification of Remote Sensing Images.",
            "Enhancement of Multispectral Ikonos Satellite Image Using Quantum Information Processing.",
            "Another Constructed Chaotic Image Encryption Scheme Based on Toeplitz Matrix and Hankel Matrix.",
            "Preface.",
            "Time-independent Liveness in Time Petri Nets.",
            "A Notion of Biological Diagnosability Inspired by the Notion of Opacity in Systems Security.",
            "Update of Probabilistic Beliefs: Implementation and Parametric Verification.",
            "Agent Oriented Techniques for Programming Autonomous Robots.",
            "Process Algebra Contexts and Security Properties.",
            "Model Checking Optimisation Based Congestion Control Algorithms.",
            "Checking Consistency of an ABox w.r.t. Global Assumptions in PDL.",
            "SAT as a Programming Environment for Linear Algebra.",
            "A Categorical View of Timed Behaviours.",
            "Preface.",
            "Correct-by-Construction Concurrency: Using Dependent Types to Verify Implementations of Effectful Resource Usage Protocols.",
            "A Tutorial Implementation of a Dependently Typed Lambda Calculus.",
            "Automation for Dependently Typed Functional Programming.",
            "Preface.",
            "Evaluating and Improving Modern Variable and Revision Ordering Strategies in CSPs.",
            "Cluster Tree Elimination for Distributed Constraint Optimization with Quality Guarantees.",
            "Efficient Plan Adaptation through Replanning Windows and Heuristic Goals.",
            "Abductive Logic Programming as an Effective Technology for the Static Verification of Declarative Business Processes.",
            "Combinatorial Optimization Solutions for the Maximum Quartet Consistency Problem.",
            "An Empirical Study of QBF Encodings: from Treewidth Estimation to Useful Preprocessing.",
            "SLGAD Resolution for Inference on Logic Programs with Annotated Disjunctions.",
            "A SAT-based Method for Solving the Two-dimensional Strip Packing Problem.",
            "Preface.",
            "A Formalism for the Description of Protein Interaction Dedicated to Jerzy Tiuryn on the Occasion of his 60th Birthday.",
            "Data Linkage Dynamics with Shedding.",
            "An Efficient Algorithm for Learning Bayesian Networks from Data.",
            "The Complexity of Restricted Variants of the Stable Paths Problem.",
            "Modeling Proteolysis from Mass Spectrometry Proteomic Data.",
            "H-trees: a Model of Evolutionary Scenarios with Horizontal Gene Transfer.",
            "Church-Rosser Made Easy.",
            "Big-step Operational Semantics Revisited.",
            "Linearity, Non-determinism and Solvability.",
            "Communes via Yoneda, from an Elementary Perspective.",
            "Asymptotic Analysis of a Semelparous Species Model.",
            "Modeling Biology using Generic Reactive Animation.",
            "Bottom-up beta-reduction: Uplinks and lambda-DAGs.",
            "Complexity of Type Inference.",
            "The Logic of Persistent Intersection.",
            "A Computer Scientist's Guide to the Regulatory Genome.",
            "Behaviours of Unary Quantum Automata.",
            "Clearing Restarting Automata.",
            "One Pebble Versus epsilon * log n Bits.",
            "5' -> 3' Watson-Crick AutomataWith Several Runs.",
            "Low Disruption Transformations on Cyclic Automata.",
            "Regulated Nondeterminism in Pushdown Automata: The Non-Regular Case.",
            "Automorphissm Classification of Cellular Automata.",
            "Cellular Automata, Decidability and Phasespace.",
            "Target Based Accepting Networks of Evolutionary Processors.",
            "Preface.",
            "A Communication Approach to the Superposition Problem.",
            "A Note on a priori Estimations of Classification Circuit Complexity.",
            "Synthesis and Complexity of Asymptotically Optimal Circuits with Unreliable Gates.",
            "Some Remarks on Testing Irreducibility of Polynomials and Normality of Bases in Finite Fields.",
            "High Accuracy Asymptotic Bounds on the BDD Size and Weight of the Hardest Functions.",
            "Extended Nondeterministic Finite Automata.",
            "Once More on the Edge-Minimization of Nondeterministic Finite Automata and the Connected Problems.",
            "Greedy Algorithm with Weights for Decision Tree Construction.",
            "Modeling Contexts with Dependent Types.",
            "Univariate Equations Over Sets of Natural Numbers.",
            "Horn Knowledge Bases in Regular Description Logics with PTIME Data Complexity.",
            "Breaking Pomykala-Barabasz Threshold Proxy Signature Scheme.",
            "Preface.",
            "Extending and Implementing RASP.",
            "A Logic-Based System for e-Tourism.",
            "Solving Distributed CSPs Probabilistically.",
            "An Investigation of Multi-Agent Planning in CLP.",
            "Morphos Configuration Engine: the Core of a Commercial Configuration System in CLP(FD).",
            "A Logic-Based, Reactive Calculus of Events.",
            "Combining Satisfiability Procedures for Unions of Theories with a Shared Counting Operator.",
            "Graded Alternating-Time Temporal Logic.",
            "Preface.",
            "Closure Operators and Lattices Derived from Concurrency in Posets and Occurrence Nets.",
            "Deficiency Zero Petri Nets and Product Form.",
            "Hasse Diagram Generators and Petri Nets.",
            "Decidability Problems in Petri Nets with Names and Replication.",
            "Simple Bisimilarity Minimization in O(m log n) Time.",
            "A Convergence Proof for the Particle Swarm Optimiser.",
            "Equational Reasoning on Mobile Ad Hoc Networks.",
            "Equivalence of Processes in Partially Commutative Object-Oriented Environments.",
            "On the Use of Naive Bayesian Classifiers for Detecting Elementary and Coordinated Attacks."
        ]
    },
    {
        "name": "FUIN",
        "year": "2009",
        "info": "2009: Volumes\n90, 91, 92, 93, 94, 95, 96, 97",
        "count": 201,
        "papers": [
            "An Efficient Computation of the Equation K-automaton of a Regular K-expression.",
            "A Fragile Digital Image Authentication Scheme Inspired by Wet Paper Codes.",
            "Rough Set Algebras as Description Domains.",
            "A General Similarity Framework for Horn Clause Logic.",
            "Approximate Sorting.",
            "Indexing of Spatio-Temporal Telemetric Data Based on Adaptive Multi-Dimensional Bucket Index.",
            "A Note on Axiom System for SBL-algebras.",
            "Nondeterministic State Complexity of Basic Operations for Prefix-Free Regular Languages.",
            "Some Symmetry Based Classifiers.",
            "NovelWatermarking Authentication Schemes for Binary Images Based on Dual-Pair Block Pixel Patterns.",
            "Concept Lattices of Subcontexts of a Context.",
            "Extractive Support Vector Algorithm on Support Vector Machines for Image Restoration.",
            "New Construction of Short Hierarchical ID-Based Signature in the Standard Model.",
            "Preface: Cognitive Informatics, Cognitive Computing, and Their Denotational Mathematical Foundations (I).",
            "A Doctrine of Cognitive Informatics (CI).",
            "A Computational Model of Language Acquisition: the Emergence of Words.",
            "Statistical Independence and Determinants in a Contingency Table - Interpretation of Pearson Residuals based on Linear Algebra -.",
            "A Digital Image Encryption Algorithm Based on Hyper-chaotic Cellular Neural Network.",
            "Paradigms of Denotational Mathematics for Cognitive Informatics and Cognitive Computing.",
            "Testing Semantics for RTPA.",
            "A Comparison of Metric-Based and Empirical Approaches for Cognitive Analysis of Modeling Languages.",
            "Preface: Cognitive Informatics, Cognitive Computing, and Their Denotational Mathematical Foundations (II).",
            "A Formal Syntax of Natural Languages and the Deductive Grammar.",
            "Investigating Accuracies of Classifications for Randomized Imbalanced Class Distributions.",
            "Object segmentation in video via graph cut built on superpixels.",
            "3DM: Domain-oriented Data-driven Data Mining.",
            "Contingency Matrix Theory II: Degree of Dependence as Granularity.",
            "Toward Formal Models of the Theoretical Framework of Fundamental Economics.",
            "On Networks of Evolutionary Processors with Nodes of Two Types.",
            "Partial Halting and Minimal Parallelism Based on Arbitrary Rule Partitions.",
            "Satisfiability Parsimoniously Reduces to the TantrixTM Rotation Puzzle Problem.",
            "Universality for Turing Machines, Inductive Turing Machines and Evolutionary Algorithms.",
            "Skolem Machines.",
            "More on the Size of Higman-Haines Sets: Effective Constructions.",
            "Four Small Universal Turing Machines.",
            "Array P Systems and t.Communication.",
            "A Small Five-State Non-Optimum-Time Solution to the Firing Squad Synchronization Problem - A Geometrical Approach.",
            "Small Semi-Weakly Universal Turing Machines.",
            "Intrinsically Universal One-dimensional Quantum Cellular Automata in Two Flavours.",
            "The Complexity of Unary Tiling Recognizable Picture Languages: Nondeterministic and Unambiguous Cases.",
            "Modelling of Complex Systems: Systems as Dataflow Machines.",
            "Flat Parametric Counter Automata.",
            "Highly Undecidable Problems about Recognizability by Tiling Systems.",
            "Quantum Testers for Hidden Group Properties.",
            "On the Dynamics of Social Balance on General Networks (with an application to XOR-SAT).",
            "Universal Hard Interaction for Clockless ComputationDem Glücklichen schlägt keine Stunde!",
            "On the Computational Power of Querying the History.",
            "Program Schemes, Queues, the Recursive Spectrum and Zero-one Laws.",
            "Associativity of Infinite Synchronized Shuffles and Team Automata.",
            "Behaviour Preservation of a Biological Regulatory Network when Embedded into a Larger Network.",
            "Real Polygonal Covers of Digital Discs - Some Theories and Experiments.",
            "Analysis of Components for Generalization using Multidimensional Scaling.",
            "A Further Improved Online/Offline Signature Scheme.",
            "Hypergraphs for Generic Lossless Image Compression.",
            "Adjective Sense Disambiguation at the Border Between Unsupervised and Knowledge-Based Techniques.",
            "A Fast VQ Codebook Generation Algorithm Based on Otsu Histogram Threshold.",
            "Reversible Data Hiding Based on Three-Circular-Pixel Difference Expansion.",
            "An Information-Hiding Scheme Based on Quantization-Based Embedding Technique.",
            "Series-Parallel Automata and Short Regular Expressions.",
            "Handling Inconsistency In Distributed Software Requirements Specifications Based On Prioritized Merging.",
            "Undecidability Results for Timed Automata with Silent Transitions.",
            "Preventing Cheating in Computational Visual Cryptography.",
            "Evolutionary Approach to Data Discretization for Rough Sets Theory.",
            "Simple Random Access Compression.",
            "On Inferences ofWeak Multivalued Dependencies.",
            "Bisimulation Minimisation of Weighted Automata on Unranked Trees.",
            "Feature Based Affine Invariant Watermarking Robust to Geometric Distortions.",
            "Complexity of Normal Form Properties and Reductions for Term Rewriting Problems Complexity of Normal Form Properties and Reductions for Term Rewriting Problems.",
            "On Domain Theory over Girard Quantales.",
            "The Monadic Second-order Logic Evaluation Problem on Finite Colored Trees: a Database-theoretic Approach.",
            "Autonomous Units to Model Interacting Sequential and Parallel Processes.",
            "Greedy Algorithm for Construction of Partial Association Rules.",
            "Towards a Formal Semantics for the Process Model of the Taverna Workbench. Part I.",
            "A Proof of Plotkin's Conjecture.",
            "Algorithmic Correspondence and Completeness in Modal Logic. III. Extensions of the Algorithm SQEMA with Substitutions.",
            "Aggregation Pheromone Density Based Pattern Classification.",
            "Comparing Trade-off Based Models of the Internet.",
            "Towards a Formal Semantics for the Process Model of the Taverna Workbench. Part II.",
            "Codebook-linked Watermarking Scheme for Digital Images.",
            "On Distributed k-Anonymization.",
            "Formal Definition of XCCS Modelling Language.",
            "P Systems with Transport and Diffusion Membrane Channels.",
            "Levels of Persistency in Place/Transition Nets.",
            "JavaOmega: The Structures and the Implementation of a Preprocessor for Java with m and mc parameters.",
            "Perseus. Software for Analyzing Persuasion Process.",
            "What Agents Can Probably Enforce.",
            "Analysis and Synthesis of Net Structures and Transition Graphs.",
            "Using Ontologies and Algebra of Algorithms for Formalized Development of Parallel Programs.",
            "Timed Delay Bisimulation is an Equivalence Relation for Timed Transition Systems.",
            "The Outline of an Ontology for the Rough Set Theory and its Applications.",
            "Quantifying Security for Timed Process Algebras.",
            "Generation of Database Transactions with Petri Nets.",
            "Simulation of Security Protocols based on Scenarios of Attacks.",
            "On the Expressiveness of Communication Channels for Object Nets.",
            "Multiset Pushdown Automata.",
            "Properties of Multiset Language Classes Defined by Multiset Pushdown Automata.",
            "Timed Automata Based Model Checking of Timed Security Protocols.",
            "On Minimal Inhibitory Rules for Almost All k-Valued Information Systems.",
            "An Efficient Tableau Prover using Global Caching for the Description Logic ALC.",
            "A New Approach to Model Checking of UML State Machines.",
            "A Translator of Java Programs to TADDs.",
            "Applying Classical Concepts to Parsing Expression Grammar.",
            "Petri Nets with Time Windows: A Comparison to Classical Petri Nets.",
            "AC is Equivalent to the Coherence Principle. Corrigendum to my Paper \"Induction Principles for Sets\".",
            "On Insertion Grammars with Maximum Parallel Derivation.",
            "Branching Bisimilarity with Explicit Divergence.",
            "Normalized-scale Relations and Their Concept Lattices in Relational Databases.",
            "On the Parallelization of Self-Adaptive hp-Finite Element Methods Part I. Composite Programmable Graph GrammarModel.",
            "On the Parallelization of Self-Adaptive hp-Finite Element Methods Part II. Partitioning Communication Agglomeration Mapping (PCAM) Analysis.",
            "A New Algorithm for Optimal Path Finding in Complex Networks Based on the Quotient Space.",
            "Timed P Automata.",
            "Clausal Tableaux for Multimodal Logics of Belief.",
            "Algebraic Properties of Generalized Rough Sets.",
            "First-order Generalization of the MPMA Belief Update Operator.",
            "The Injectivity of the Global Function of a Cellular Automaton in the Hyperbolic Plane is Undecidable.",
            "Greedy Algorithms with Weights for Construction of Partial Association Rules.",
            "An Extended Comparison of Six Approaches to Discretization - A Rough Set Approach.",
            "Dominance-Based Rough Sets Using Indexed Blocks as Granules.",
            "Approximation Algebra and Framework.",
            "Learning Rule Ensembles for Ordinal Classification with Monotonicity Constraints.",
            "Single 2D Image-based 3D Face Reconstruction and Its Application in Pose Estimation.",
            "Pairwise Comparisons Based Non-Numerical Ranking.",
            "A Two-Phase Model for Learning Rules from Incomplete Data.",
            "Semi-supervised Rough Cost/Benefit Decisions.",
            "An Incremental Approach for Inducing Knowledge from Dynamic Information Systems.",
            "An Integration of Cloud Transform and Rough Set Theory to Induction of Decision Trees.",
            "Synthesis of Nets with Step Firing Policies.",
            "A Net-based Approach to Web Services Publication and Replaceability.",
            "Unfolding Semantics of Petri Nets Based on Token Flows.",
            "Modelling and Validation of Secure Connection Establishment in a Generic Access Network Scenario.",
            "Process Discovery using Integer Linear Programming.",
            "Building Efficient Model Checkers using Hierarchical Set Decision Diagrams and Automatic Saturation.",
            "A Practical Approach to Verification of Mobile Systems Using Net Unfoldings.",
            "Avoiding Irreducible CSC Conflicts by Internal Communication.",
            "Application of Concurrency in the Asynchronous Design of Write-after-read Operations.",
            "A Token-Managed Admission Control System for QoS Provision on a Best-Effort GALS Interconnect.",
            "Dynamic Error Handling in Service Oriented Applications.",
            "QoS-Driven Service Selection and Composition Using Quantitative Constraint Automata.",
            "Time-Bounded Model Checking of Infinite-State Continuous-Time Markov Chains.",
            "Performance Evaluation of Distributed Systems Based on a Discrete Real- and Stochastic-Time Process Algebra.",
            "Synthesis of Petri Nets from Term Based Representations of Infinite Partial Languages.",
            "Modular Construction of Finite and Complete Prefixes of Petri net Unfoldings.",
            "Evaluation of the Texture Analysis Using Spectral Correlation Function.",
            "Stochastic Model of Evolutionary and Immunological Multi-Agent Systems: Mutually Exclusive Actions.",
            "On Recognizable Tree Languages Beyond the Borel Hierarchy.",
            "Verifying a Class: combining Testing and Proving.",
            "Stochastic Model of Evolutionary and Immunological Multi-Agent Systems: Parallel Execution of Local Actions.",
            "Properties of Quantum Particles in Multi-Swarms for Dynamic Optimization.",
            "Congruences Generated by Extended Ground Term Rewrite Systems.",
            "An Improved Harmony Search Algorithm with Differential Mutation Operator.",
            "Integral Particle Swarm Optimization with Dispersed Accelerator Information.",
            "Particle Swarm Optimization Based Object Tracking.",
            "A Multi-swarm Approach to Multi-objective Flexible Job-shop Scheduling Problems.",
            "Robust Candidate Pruning Approach Based on the PSO-SVM for Fast Corner Detection with Noise Tolerance in Gray-Level Images.",
            "Low Discrepancy Initialized Particle Swarm Optimization for Solving Constrained Optimization Problems.",
            "Measuring Resemblances Between Swarm Behaviours: A Perceptual Tolerance Near Set Approach.",
            "Mining the Largest Dense Vertexlet in a Weighted Scale-free Graph.",
            "Instruction Sequences with Dynamically Instantiated Instructions.",
            "On Using LSB Matching Function for Data Hiding in Pixels.",
            "Friendly Color Visual Secret Sharing by Random Grids.",
            "A Similarity Measure for Cyclic Unary Regular Languages.",
            "Boosting Classifiers Built from Different Subsets of Features.",
            "On a Modal Epistemic Axiom Emerging from McDermott-Doyle Logics.",
            "A Decidable Probability Logic for Timed Probabilistic Systems.",
            "Hypergraph Cuts & Unsupervised Representation for Image Segmentation.",
            "The new SIMD Implementation of the Smith-Waterman Algorithm on Cell Microprocessor.",
            "Semi-GAPS: A Semi-supervised Clustering Method Using Point Symmetry.",
            "A Semantic Model for Matchmaking of Web Services Based on Description Logics.",
            "Integrating Finite Domain and Set Constraints into a Set-based Constraint Language.",
            "Actions Over a Constructive Semantics for Description Logics.",
            "Normal Form Nested Programs.",
            "GASP: Answer Set Programming with Lazy Grounding.",
            "Model Checking for Graded CTL.",
            "ALC + T: a Preferential Extension of Description Logics.",
            "A Folding Rule for Eliminating Existential Variables from Constraint Logic Programs.",
            "Measuring Semantic Closeness of Ontologically Demarcated Resources.",
            "Designing Model Based Classifiers by Emphasizing Soft Targets.",
            "Improved Resulted Word Counts Optimizer for Automatic Image Annotation Problem.",
            "Different Approaches to Model Relationship Between EMG Signals and Force Moments in Human Skeletal Muscle. Analysis for Diagnosis of Neuronmuscular Disorders.",
            "On Stability and Classification Tools for Genetic Algorithms.",
            "Quantization Step Parity-based Steganography for MP3 Audio.",
            "A Recursive Classifier System for Partially Observable Environments.",
            "Structured Occurrence Nets: A Formalism for Aiding System Failure Prevention and Analysis Techniques.",
            "An Effective Message Embedding Scheme for 3D Models.",
            "Expressiveness of Petri Nets with Stopwatches. Dense-time Part.",
            "Expressiveness of Petri Nets with Stopwatches. Discrete-time Part.",
            "Algebraic Semantics of Similarity-Based Bitten Rough Set Theory.",
            "MR Brain Image Segmentation Using A Multi-seed Based Automatic Clustering Technique.",
            "Tensor Framework and Combined Symmetry for Hypertext Mining.",
            "An Algebraic Framework for Defining Behaviours of Concurrent Systems. Part 1: The Constructive Presentation.",
            "Homogeneous Spiking Neural P Systems.",
            "Combinatorics of Unique Maximal Factorization Families (UMFFs).",
            "Faster Algorithms for Computing Maximal Multirepeats in Multiple Sequences.",
            "A New Algorithm for Building Alphabetic Minimax Trees.",
            "Toward a General Framework for Polyphonic Comparison.",
            "Complex Algebras of Arithmetic.",
            "An Image Authentication Based on Discrete Fourier Transform.",
            "Data Clustering Using Multi-objective Differential Evolution Algorithms.",
            "Modeling and Reasoning with Paraconsistent Rough Sets.",
            "An Algebraic Framework for Defining Behaviours of Concurrent Systems. Part 2: The Axiomatic Presentation.",
            "An Interval-Valued Intuitionistic Fuzzy Rough Set Model."
        ]
    },
    {
        "name": "FUIN",
        "year": "2008",
        "info": "2008: Volumes\n82, 83, 84, 85, 86, 87, 88, 89",
        "count": 204,
        "papers": [
            "Three-Phase Lossless Data Hiding Method for the VQ Index Table.",
            "Codebook Partition Based Steganography without Member Restriction.",
            "Editing Configurations of P Systems.",
            "Path Languages of Random Permitting Context Tree Grammars are Regular.",
            "Products of Tree Automata with an Application to Temporal Logic.",
            "Some Varieties of Finite Tree Automata Related to Restricted Temporal Logics.",
            "Image Search using Dominant Colors.",
            "Impact of Asynchrony on the Behavior of Rational Selfish Agents.",
            "Invariance Under Stuttering in a Temporal Logic without the \"Until\" Operator.",
            "On the Controller Synthesis for Finite-State Markov Decision Processes.",
            "High-Performance Reversible Data Hiding.",
            "Classes of Timed Automata and the Undecidability of Universality.",
            "Information in a Two-Stage Decision Process. General Idea and Classification.",
            "On the Relationship between Description Logic-based and F-Logic-based Ontologies.",
            "Embedding Event Algebras and Process for ECA Rules for the Semantic Web.",
            "Representing Uncertainty in RuleML.",
            "Fuzzy Description Logic Programs under the Answer Set Semantics for the Semantic Web.",
            "Compositionality for Tightly Coupled Systems: A New Application of the Propositions-as-Types Interpretation.",
            "Validating Behavioral Component Interfaces in Rewriting Logic.",
            "A Basic Logic for Reasoning about Connector Reconfiguration.",
            "A Deductive Proof System for Multithreaded Java with Exceptions.",
            "Interface Automata with Complex Actions: Limiting Interleaving in Interface Automata.",
            "Randomness with Respect to the Signed-Digit Representation.",
            "A Simple Proof of Miller-Yu Theorem.",
            "Proximal Connectedness.",
            "Nonterminal Complexity of Some Operations on Context-Free Languages.",
            "Blind Counter Automata on omega-Words.",
            "Regular omega-Languages Defined by Finite Extended Spiking Neural P Systems.",
            "The State Complexity of Two Combined Operations: Star of Catenation and Star of Reversal.",
            "On the Generation of Aperiodic and Periodic Necklaces via T-augmentation.",
            "A Non-linear Split Error Detection Code.",
            "Simulation Complexity.",
            "Computability Theoretic Properties of the Entropy of Gap Shifts.",
            "Prescribed Learning of Indexed Families.",
            "Applications of Kolmogorov Complexity and Universal Codes to Nonparametric Estimation of Characteristics of Time Series.",
            "Complexity of Topological Properties of Regular omega-Languages.",
            "A Hierarchy of Computably Enumerable Reals.",
            "Non-dominated Rank based Sorting Genetic Algorithms.",
            "First-Order Ground Non-Monotonic Modal Logic.",
            "WeightedWord Recognition.",
            "An Edge-based Image Copy Detection Scheme.",
            "Generalizations of Pixel-Value Differencing Steganography for Data Hiding in Images.",
            "A Predator-Prey Cellular Automaton with Parasitic Interactions and Environmental Effects.",
            "Abduction for Accessing Information Sources.",
            "An Algorithmic Solution of a Birkhoff Type Problem.",
            "Array Grammars with Contextual Operations.",
            "A Relation-Algebraic Theory of Bisimulations.",
            "A Modal Logic for Pawlak's Approximation Spaces with Rough Cardinality n.",
            "The Practical Efficiency of Convolutions in Pattern Matching Algorithms.",
            "External Memory Algorithms for String Problems.",
            "Algorithms for Computing the lambda-regularities in Strings.",
            "An Algorithm for BCH Codes Extended with Finite State Automata.",
            "Simulation and Measurement of Complex Network Growth: the Interplay of Uniform and Preferential Attachment.",
            "An Improved Boolean Circuit for Maximum Matching in a Convex Bipartite Graph.",
            "Permutation Representation of 3 and 4-Homogenous Latin Bitrades.",
            "Polynomial-TimeMaximisation Classes: Syntactic Hierarchy.",
            "Equivalence, Indicators, Quasi-indicators and Optimal Steiner Topologies on Four Points in Space.",
            "A Type Driven Theory of Predication with Complex Types.",
            "A Term Assignment for Polarized Bi-intuitionistic Logic and its Strong Normalization.",
            "On Krivine's Realizability Interpretation of Classical Second-Order Arithmetic.",
            "Category Theoretic Semantics for Typed Binding Signatures with Recursion.",
            "Realizability of the Axiom of Choice in HOL. (An Analysis of Krivine's Work).",
            "Davidson and Reiter on Actions.",
            "Some Alternatives to Parikh Matrices Using String Kernels.",
            "Multi-Valued MSO Logics OverWords and Trees.",
            "A New Architecture for Learning Classifier Systems to Solve POMDP Problems.",
            "A Novel Cryptographic Key Assignment Scheme with ID-Based Access Control in a Hierachy.",
            "Computational Efficiency of Intermolecular Gene Assembly.",
            "The Chain Relation in Sofic Subshifts.",
            "Adaptively Embedding Binary Data in an Image.",
            "Rough Rule Extracting From Various Conditions: Incremental and Approximate Approaches for Inconsistent Data.",
            "Change Detection of Remote Sensing Images with Semi-supervised Multilayer Perceptron.",
            "A Semantic Analysis of a Logic for Pragmatics with Assertions, Obligations, and Causal Implication.",
            "Fuzzy Symmetry Based Real-Coded Genetic Clustering Technique for Automatic Pixel Classification in Remote Sensing Imagery.",
            "Algorithmic Logic + SpecVer = the Methodology for High Integrity Programming - Invited Paper.",
            "A Multi-facet Approach to Dynamic Agent Systems.",
            "Methods as Parameters: A Preprocessing Approach to Higher Order in Java.",
            "A Logic for Reasoning about Persuasion.",
            "Time Distribution in Structural Workflow Nets.",
            "Boolean Algebra of Nets, their Synthesis and Analysis.",
            "Feature Selection Algorithm for Multiple Classifier Systems: A Hybrid Approach.",
            "Petri Net Controlled Finite Automata.",
            "Constraint BasedWorld Modeling.",
            "Satisfiability of Formulas from the Standpoint of Object Classification: The RST Approach.",
            "Case-based Planning of Treatment of Infants with Respiratory Failure.",
            "Probabilistic Information Flow Security.",
            "Security in a Model for Long-running Transactions.",
            "Approximation Space and LEM2-like Algorithms for Computing Local Coverings.",
            "Token History Petri Nets.",
            "Translation of Intermediate Language to Timed Automata with Discrete Data.",
            "Optimization in Discovery of Compound Granules.",
            "Language Classes Defined by Concurrent Finite Automata.",
            "On Trace-Expressible Behaviour of Petri Nets.",
            "Memory-Based State-Estimation.",
            "VerICS 2007 - a Model Checker for Knowledge and Real-Time.",
            "Linear Properties of Zero-Safe Nets with Debit Tokens.",
            "A Deterministic Algorithm for Identifying Direct Superclasses in Java.",
            "LDYIS: a Framework for Model Checking Security Protocols.",
            "Specification and Verification of Invariants by Exploiting Layers in OO Designs.",
            "Projection Representation of Mazurkiewicz Traces.",
            "Translation of Timed Promela to Timed Automata with Discrete Data.",
            "SAT-based Unbounded Model Checking of Timed Automata.",
            "Some Aspects of Parsing Expression Grammar.",
            "Processes in Systems with Limited Resources in the Context of Non-extensive Thermodynamics.",
            "Modelling and Simulation of Quantum Teleportation and Dense Coding Using Predicate/Transition-Nets.",
            "An Algebraic Framework for Defining Random Concurrent Behaviours.",
            "Distance Measures Induced by Finite Approximation Spaces and Approximation Operators.",
            "Improving the Translation from ECTL to SAT.",
            "Towards Verification of Java Programs in perICS.",
            "Greedy Algorithm for Attribute Reduction.",
            "Genetic Algorithms as an Alternative Method of Parameter Estimation and Finding Most Likely Sequences of States of Hidden Markov Chains for HMMs and Hybrid HMM/ANN Models.",
            "Partial Conway and Iteration Semirings.",
            "On Rational Stochastic Languages.",
            "A Multi-Criteria Decision Method Based on Rank Distance.",
            "Approximating Arbitrary Reinforcement Signal by Learning Classifier Systems using Micro Genetic Algorithm.",
            "Grayscale Image Hiding Based on Modulus Function and Greedy Method.",
            "Involution Solid and Join codes.",
            "On Characterization of Attractor Basins of Fuzzy Multiple Attractor Cellular Automata.",
            "On the Normalized Cut.",
            "Modeling the Dance Video Semantics using Regular Tree Automata.",
            "Some Issues on Inner Structure of Information. A Definition of the Decision Making Problem.",
            "On the Complexity of Consistency and Complete State Coding for Signal Transition Graphs.",
            "Causal Semantics of Algebraic Petri Nets distinguishing Concurrency and Synchronicity.",
            "Resolution of Encoding Conflicts by Signal Insertion and Concurrency Reduction Based on STG Unfoldings.",
            "Schedulability Analysis of Petri Nets Based on Structural Properties.",
            "Modeling Communication with Synchronized Environments.",
            "Towards Building the State Class Graph of the TSPN Model.",
            "Unsupervised Pixel Classification in Satellite Imagery: A Two-stage Fuzzy Clustering Approach.",
            "The Halting Probability via Wang Tiles.",
            "High Capacity Data Hiding for Grayscale Images.",
            "Sharing Numerous Images Secretly with Reduced Possessing Load.",
            "Bag Context Tree Grammars.",
            "A Development of Inclusion-degree-based Rough Fuzzy Random Sets.",
            "A P Systems Flat Form Preserving Step-by-step Behaviour.",
            "Implementing Sorting Networks with Spiking Neural P Systems.",
            "Computational Complexity of Simple P Systems.",
            "Solving SUBSET SUM by Spiking Neural P Systems with Pre-computed Resources.",
            "On the Computational Efficiency of Polarizationless Recognizer P Systems with Strong Division and Dissolution.",
            "A Quantum-Inspired Evolutionary Algorithm Based on P systems for Knapsack Problem.",
            "Smaller Universal Spiking Neural P Systems.",
            "Exploring Cycle Structures of Additive Cellular Automata.",
            "A New Time-Optimum Synchronization Algorithm for Rectangle Arrays.",
            "Radial View of Continuous Cellular Automata.",
            "Different Types of Linear Fuzzy Cellular Automata and their Applications.",
            "A Neuro-Genetic Framework for Pattern Recognition in Complex Systems.",
            "Cellular Automata Based Design of Cost Optimal Steel Building Frames.",
            "Lava Flow Hazard Evaluation Through Cellular Automata and Genetic Algorithms: an Application to Mt Etna Volcano.",
            "Characterizing DNA Bond Shapes Using Trajectories.",
            "Is Timed Branching Bisimilarity a Congruence Indeed?",
            "New Bit Reduction of Vector Quantization Using Block Prediction and Relative Addressing.",
            "Complete Process Semantics of Petri Nets.",
            "sPBC: A Markovian Extension of Petri Box Calculus with Immediate Multiactions.",
            "On Descriptional Complexity of Partially Parallel Grammars.",
            "A New Probabilistic Approach for Fractal Based Image Compression.",
            "Algorithmic Approach to Devaney Chaos in Shift Spaces.",
            "Fast VQ Codebook Generation Method Using Codeword Stability Check and Finite State Concept.",
            "Automatic Unsupervised Segmentation Methods for MRI Based on Modified Fuzzy C-Means.",
            "Robust User Password Change Scheme based on the Elliptic Curve Cryptosystem.",
            "A Cancellation Theorem for BCCSP.",
            "Adaptive Data Embedding Scheme Based on Similar and Dissimilar Clustering Strategies.",
            "A Large Payload Data Embedding Technique for Color Images.",
            "Alias Types and Effects for \"Environment-aware\" Computations.",
            "Nondeterminism in Constructive Z.",
            "Class Specific Fuzzy Decision Trees for Mining High Speed Data Streams.",
            "Second Order Fuzzy Measure and Weighted Co-Occurrence Matrix for Segmentation of Brain MR Images.",
            "Geometric transform Invariant Texture Analysis based on Modified Zernike Moments.",
            "An Improved Certificateless Signature Scheme Secure in the Standard Model.",
            "A New Proof on Embedding the Category of Proximity Spaces into the Category of Nearness Spaces.",
            "On the Compared Expressiveness of Arc, Place and Transition Time Petri Nets.",
            "Nets with Tokens which Carry Data.",
            "From Many Places to Few: Automatic Abstraction Refinement for Petri Nets.",
            "Synthesis of Elementary Net Systems with Context Arcs and Localities.",
            "Name Creation vs. Replication in Petri Net Systems.",
            "Coloured Petri Net Modelling of an Evolving Internet Standard: the Datagram Congestion Control Protocol.",
            "Working with the Past: Integrating History in Petri Nets.",
            "Hazard Checking of Timed Asynchronous Circuits Revisited.",
            "Synthesis of Petri Nets from Finite Partial Languages.",
            "A More Efficient Time Petri Net State Space Abstraction Useful to Model Checking Timed Linear Properties.",
            "Fault Diagnosis with Static and Dynamic Observers.",
            "Output-Determinacy and Asynchronous Circuit Synthesis.",
            "Analysis of Static Data Flow Structures.",
            "An Experimental Comparison of Different Inclusion Relations in Frequent Tree Mining.",
            "Multi-Dimensional Relational Sequence Mining.",
            "Compile the Hypothesis Space: Do it Once, Use it Often.",
            "Learning from Skewed Class Multi-relational Databases.",
            "A Restarted Strategy for Efficient Subsumption Testing.",
            "Relational Transformation-based Tagging for Activity Recognition.",
            "Learning Ground CP-Logic Theories by Leveraging Bayesian Network Learning Techniques.",
            "Byzantine Agreement & Fault Diagnosis Agreement in Dynamic Ad-Hoc Environment.",
            "Effective Prediction of Web User Behaviour with User-Level Models.",
            "Pebble Macro Tree Transducers with Strong Pebble Handling.",
            "Preferential Regular Path Queries.",
            "The Boolean Closure of Growing Context-Sensitive Languages.",
            "Logical Undecidabilities Made Easy.",
            "Efficient Implementation of the Italiano Algorithms for Updating the Transitive Closure on Associative Parallel Processors.",
            "Planar Straight-Line Embedding of Double-Tree Scan Architecture on a Rectangular Grid.",
            "On the Axiomatic System of SBLnotalgebras.",
            "Slicing Abstractions.",
            "Nuovo DRM Paradiso: Designing a Secure, Verified, Fair Exchange DRM Scheme.",
            "Universality Analysis for One-Clock Timed Automata.",
            "A Foundational Theory of Contracts for Multi-party Service Composition.",
            "On the Use of Behavioural Equivalences for Web Services' Development.",
            "Logic-based Conflict Detection for Distributed Policies.",
            "A Logical Reasoning Approach to Automatic Composition of Stateless Components."
        ]
    },
    {
        "name": "FUIN",
        "year": "2007",
        "info": "2007: Volumes\n75, 76, 77, 78, 79, 80, 81",
        "count": 192,
        "papers": [
            "In Memory of Professor Zdzislaw Pawlak.",
            "Life and Work of Zdzislaw Pawlak.",
            "Arrow Logic with Arbitrary Intersections: Applications to Pawlak's Information Systems.",
            "Rough Set Approach to Behavioral Pattern Identification.",
            "Multiset-Based Self-Assembly of Graphs.",
            "Entropies and Co-Entropies of Coverings with Application to Incomplete Information Systems.",
            "Rough Sets and Learning by Unification.",
            "Rough Dialogue and Implication Lattices.",
            "On String Languages Generated by Spiking Neural P Systems.",
            "Relative Nondeterministic Information Logic is EXPTIME-complete.",
            "A Correspondence Framework between Three-Valued Logics and Similarity-Based Approximate Reasoning.",
            "A Possibility-Theoretic View of Formal Concept Analysis.",
            "A Multi-modal Logic for Disagreement and Exhaustiveness.",
            "Complexity Issues in Multiagent Logics.",
            "Reaction Systems.",
            "CooperativeWorld Modeling in Dynamic Multi-Robot Environments.",
            "Towards a Pragmatic Mereology.",
            "Pawlak's Information Systems in Terms of Galois Connections and Functional Dependencies.",
            "Z. Pawlak, a Precursor of DNA Computing and of Picture Grammars.",
            "Romanian Academy Calea Victoriei 125, Bucharest, Romania Locally Derivable Graphs.",
            "On Construction of Partial Reducts and Irreducible Partial Decision Rules.",
            "Retracts of Algebras.",
            "Bridging the Gap between Non-Symbolic and Symbolic Processing - How Could Human Being Acquire Language?",
            "Near Sets. Special Theory about Nearness of Objects.",
            "Concept Approximation in Mathematics and Computer Science. An Essay in Homage to Zdzislsaw Pawlak.",
            "Approaches to Conflict Dynamics Based on Rough Sets.",
            "Subword Balance in BinaryWords, Languages and Sequences.",
            "Histogram Thresholding using Beam Theory and Ambiguity Measures.",
            "On Generating All Binary Trees.",
            "Behaviour Algebras.",
            "On the Optimality of the Binary Algorithm for the Jacobi Symbol.",
            "Tolerant Key Assignment for Enforcing Complicated Access Control Policies in a Hierarchy.",
            "Full-Searching-Equivalent Vector Quantization Using Two-Bounds Triangle Inequality.",
            "VQ Codebook Searching Algorithm Based on Correlation Property.",
            "A Pricing Approach For Grid Resource Scheduling With QoS Guarantees.",
            "A Co-processor for Computing the Euler Number of a Binary Image using Divide-and-Conquer Strategy.",
            "Advances in Symmetric Sandpiles.",
            "Intercode Regular Languages.",
            "Modal-Like Operators in Boolean Lattices, Galois Connections and Fixed Points.",
            "Particle Swarms for Linearly Constrained Optimisation.",
            "Rough set Based Ensemble Classifier forWeb Page Classification.",
            "Stochastic Petri Box Calculus with Discrete Time.",
            "Dynamic Meaning Membrane Systems: An Application to the Description of Semantic Change.",
            "Active Symbols in Pure Systems.",
            "Cooperating Distributed Grammar Systems as Models of Distributed Problem Solving, Revisited.",
            "Grammar Systems versus Membrane Computing: The Case of CD Grammar Systems.",
            "On Cooperating Distributed Grammar Systems with Competence Based Start and Stop Conditions.",
            "Modelling Grammar Systems by Tissue P Systems Working in the Sequential Mode.",
            "A Possible Connection Between Two Theories: Grammar Systems and Concurrent Programming.",
            "On Computing Bodies.",
            "Monocultures and Homogeneous Environment in Eco-Grammar Systems.",
            "Modelling Multiple Robots in Space: An Adaptive Eco-Grammar System.",
            "On Metalinear CD Grammar Systems.",
            "Secret Image Hiding and Sharing Based on the (t, n)-Threshold.",
            "Fuzzification of Rational and Recognizable Sets.",
            "A Resolution Calculus with Shared Literals.",
            "An Image Retrieval Method Based on Color-Complexity and Spatial-Histogram Features.",
            "Algorithms for Context Based Sequential Pattern Mining.",
            "Refinement, Decomposition, and Instantiation of Discrete Models: Application to Event-B.",
            "Retrenching the Purse: The Balance Enquiry Quandary, and Generalised and (1, 1) Forward Refinements.",
            "CoreASM: An Extensible ASM Execution Engine.",
            "Model Checking Abstract State Machines with Answer Set Programming.",
            "Time in State Machines.",
            "RAM Simulation of BGS Model of Abstract-state Machines.",
            "An Axiomatization of the Token Game Based on Petri Algebras.",
            "A Novel Image Hiding Scheme Based on VQ and Hamming Distance.",
            "Adaptive Ant Colony Optimization Algorithm Based on Information Entropy: Foundation and Application.",
            "Feature Extraction for Dynamic Integration of Classifiers.",
            "Efficient Algorithm of Affine Form Searching forWeakly Specified Boolean Function.",
            "The Completeness of Typing for Context-Semantics.",
            "Tutorial Examples of the Semantic Approach to Foundational Proof-Carrying Code.",
            "Can Proofs be Animated by Games?",
            "Untyped Algorithmic Equality for Martin-Löf's Logical Framework with Surjective Pairs.",
            "L3: A Linear Language with Locations.",
            "Rank 2 Intersection for Recursive Definitions.",
            "Arithmetical Proofs of Strong Normalization Results for Symmetric ?-calculi.",
            "On the Expressiveness of Affine Programs with Non-local Control: The Elimination of Nesting in SPCF.",
            "Verification of Concurrent Systems with Parametric Delays Using Octahedra.",
            "An Algebra of Pareto Points.",
            "Automating Synthesis of Asynchronous Communication Mechanisms.",
            "Controllable Delay-Insensitive Processes.",
            "Correct-by-Construction Asynchronous Implementation of Modular Synchronous Specifications.",
            "Improved Decomposition of Signal Transition Graphs.",
            "New Metrics for Phylogenies.",
            "A New Approach to the Concepts of Boundary and Contact: Toward an Alternative to Mereotopology.",
            "Predictive Grayscale Image Coding Scheme Using VQ and BTC.",
            "Block Prediction Vector Quantization for Grayscale Image Compression.",
            "An Algebraic Foundation for Linguistic Reasoning.",
            "An Infinitary Sequent System for the Equational Theory of *-continuous Action Lattices.",
            "Cellular Automata and Parallel Array Systems.",
            "Remarks on the Critical Behavior of Second Order Additive Invariants in Elementary Cellular Automata.",
            "Cellular Devices and Unary Languages.",
            "RBFFCA: A Hybrid Pattern Classifier Using Radial Basis Function and Fuzzy Cellular Automata.",
            "On Algebraic Structure of Neighborhoods of Cellular AutomataHorse Power Problem.",
            "Spectral Domain Boundaries in Cellular Automata.",
            "SPICE: A New Framework for Data Mining based on Probability Logic and Formal Concept Analysis.",
            "Hierarchical Hidden Markov Models for User/Process Profile Learning.",
            "Privacy Aware Data Management and Chase.",
            "Towards Efficient Searching on the Secondary Structure of Protein Sequences.",
            "Unifying Framework for Rule Semantics: Application to Gene Expression Data.",
            "Visualization of Differences between Rules' Syntactic and Semantic Similarities using Multidimensional Scaling.",
            "A Contribution to the Use of Decision Diagrams for Loading and Mining Transaction Databases.",
            "Privacy Preserving Database Generation for Database Application Testing.",
            "Sound Isolation by Harmonic Peak Partition For Music Instrument Recognition.",
            "A Note on the Emptiness of Semigroup Intersections.",
            "Davis-Putnam Style Rules for Deciding Property S.",
            "An Algebraic Characterization of the Halting Probability.",
            "A Logic-Based Approach to Finding Explanations for Discrepancies in Optimistic Plan Execution.",
            "A Propositional Proof System with Quantification Over Permutations.",
            "Foundations of Modal Deductive Databases.",
            "Composition Theorem for Generalized Sum.",
            "Optimal Proof Systems, Optimal Acceptors and Recursive Presentability.",
            "Predicate Introduction for Logics with a Fixpoint Semantics. Part I: Logic Programming.",
            "Predicate Introduction for Logics with Fixpoint Semantics. Part II: Autoepistemic Logic.",
            "Bounded Model Checking for the Existential Fragment of TCTL-G and Diagonal Timed Automata.",
            "A Comparative Analysis of Possibilistic Variances and Covariances of Fuzzy Numbers.",
            "Compositional Systems over Reducible Networks.",
            "Interpreted Nets.",
            "Decidability Problems of a Basic Class of Object Nets.",
            "Concurrent Turing Machines.",
            "Approximation Spaces Based on Relations of Similarity and Dissimilarity of Objects.",
            "Observation Based System Security.",
            "Checking Properties of Adaptive Workflow Nets.",
            "Modelling and Checking Timed Authentication of Security Protocols.",
            "Path Compression in Timed Automata.",
            "The Reachability Problem for Object Nets.",
            "A Formal Model of Multi-Agent Organisations.",
            "Algorithm of Translation of MSC-specified System into Petri Net.",
            "On Semilinear Sets over Commutative Semirings.",
            "Verifying Security Protocols Modelled by Networks of Automata.",
            "Verification of the TESLA protocol in MCMAS-X.",
            "Local Properties of Triangular Graphs.",
            "Nearness of Objects: Extension of Approximation Space Model.",
            "Parsing Expression Grammar as a Primitive Recursive-Descent Parser with Backtracking.",
            "Relational Data and Rough Sets.",
            "Analysis of Approximate Petri Nets by Means of Occurrence Graphs.",
            "Towards Efficient Computing Consistent and Partially Consistent Extensions of Information Systems.",
            "Approximation Spaces and Nearness Type Structures.",
            "SAT-Based Reachability Checking for Timed Automata with Discrete Data.",
            "On First-Order Fragments for Mazurkiewicz Traces.",
            "On Preserving Structural and Behavioural Properties by Composing Net Systems on Interfaces.",
            "Formalising TCP's Data Transfer Service Language: A Symbolic Automaton and its Properties.",
            "Making Petri Nets Safe and Free of Internal Transitions.",
            "Static BiLog: a Unifying Language for Spatial Structures.",
            "Finitary Compositions of Two-way Finite-State Transductions.",
            "Computing Properties of Numerical Imperative Programs by Symbolic Computation.",
            "On Communicating Automata with Bounded Channels.",
            "Uniform Satisfiability in PSPACE for Local Temporal Logics Over Mazurkiewicz Traces.",
            "Processes of Petri Nets with Range Testing.",
            "An Efficient Message Passing Election Algorithm based on Mazurkiewicz's Algorithm.",
            "On Minimal Rule Sets for Almost All Binary Information Systems.",
            "On Ethics of Mazurkiewicz Traces.",
            "The Decent Philosophers: An Exercise in Concurrent Behaviour.",
            "On Process-algebraic Verification of Asynchronous Circuits.",
            "Towards a Framework for Modelling Behaviours of Hybrid Systems.",
            "Maurer Computers with Single-Thread Control.",
            "How to Compute Times of Random Walks Based Distributed Algorithms.",
            "Inference of Parsable Graph Grammars for Syntactic Pattern Recognition.",
            "A Data Mining Formalization to Improve Hypergraph Minimal Transversal Computation.",
            "Formal Concept Analysis in Relational Database and Rough Relational Database.",
            "Security Analysis of the Pomykala-Barabasz Scheme.",
            "A New Practical Limited Identity-Based Encryption Scheme.",
            "RFCM: A Hybrid Clustering Algorithm Using Rough and Fuzzy Sets.",
            "Andrzej Grzegorczyk: Logic and Philosophy.",
            "Continuous Separation of Game Languages.",
            "Modal Logics for Region-based Theories of Space.",
            "On the Additive Theory of Prime Numbers.",
            "Induction Principles for Sets.",
            "Mathematical Fuzzy Logic: An Invitation to Interesting Research Areas.",
            "Pieri's Structures.",
            "Mathematical Fuzzy Logic and Natural Numbers.",
            "On Some Uses of Nonstandard Models.",
            "On Gödel's Theorem and Mechanism: Inconsistency or Unsoundness is Unavoidable in any Attempt to 'Out-Gö del' the Mechanist.",
            "Finite Arithmetics.",
            "On Modal Grzegorczyk Logic.",
            "Compactness Properties for Stable Semantics of Logic Programs.",
            "Potential Infinity and the Church Thesis.",
            "Did Leibniz and Newton Discover or Create the Calculus?",
            "Abstract Barycentric Algebras.",
            "Discrete Dualities for Heyting Algebras with Operators.",
            "Decidability w.r.t. Logical Consecutions of Linear Temporal Logic Extended by Since and Previous.",
            "Andrzej Grzegorczyk's Contribution to Computer Science.",
            "A Propositional Programming Environment for Linear Algebra.",
            "An Interpretation of Robinson Arithmetic in its Grzegorczyk's Weaker Variant.",
            "Logic, Rationality and Psychologism.",
            "Pushdown Automata Free of Explicit Nondeterminism and an Infinite Hierarchy of Context-free Languages.",
            "Tense Operators on MV-Algebras and Lukasiewicz-Moisil Algebras.",
            "Binary Search Trees, Recurrent Properties andWave Equations.",
            "Outfix-Free Regular Languages and Prime Outfix-Free Decomposition.",
            "A Generalization of the Assignment Problem, and its Application to the Rank Aggregation Problem.",
            "From Unification Compactness to Learnability.",
            "Erratum for \"Shuffle of Words and Araucaria Trees\"."
        ]
    },
    {
        "name": "FUIN",
        "year": "2006",
        "info": "2006: Volumes\n69, 70, 71, 72, 73, 74",
        "count": 170,
        "papers": [
            "Preface: Program Transformation: Theoretical Foundations and Basic Techniques. Part 2.",
            "Redundant Call Elimination via Tupling.",
            "Higher Order Deforestation.",
            "The Impact of seq on Free Theorems-Based Program Transformations.",
            "Implementing Typeful Program Transformations.",
            "Program Transformation with Scoped Dynamic Rewrite Rules.",
            "Control Generation by Program Transformation.",
            "A Multiple-Clause Folding Rule Using Instantiation and Generalization.",
            "Supporting Action-at-a-distance in Situated Cellular Agents.",
            "Efficient Parallel Query Processing by Graph Ranking.",
            "Similarity MV-algebras.",
            "Regular Expressions for Languages over Infinite Alphabets.",
            "An Image Retrieval System Based on the Color, Areas, and Perimeters of Objects.",
            "The Axiomatization of the Rough Set Upper Approximation Operations.",
            "On k-NN Method with Preprocessing.",
            "On the Axioms of Residuated Structures: Independence, Dependencies and Rough Approximations.",
            "Multistrategy Operators for Relational Learning and Their Cooperation.",
            "Eliptic Curve Based Threshold Proxy Signature Scheme with Known Signers.",
            "On minimal models of the Region Connection Calculus.",
            "Special Issueon Application of Concurrency to System Design.",
            "Rialto to B: An Exercise in Formal Development of a Language for Multiple Models of Computation.",
            "Verification and Implementation of Delay-Insensitive Processes in Restrictive Environments.",
            "Logic Synthesis for Asynchronous Circuits Based on STG Unfoldings and Incremental SAT.",
            "Towards Integrated Verification of Timed Transition Models.",
            "Guided Model Checking with a Bayesian Meta-heuristic.",
            "Nested Emptiness Search for Generalized Büchi Automata.",
            "Buffered Asynchronous Communication Mechanisms.",
            "Spatial Domain Image Hiding Scheme Using Pixel-Values Differencing.",
            "Perfect Hashing Schemes for Mining Traversal Patterns.",
            "Petri Net Semantics of the Finite pi-calculus Terms.",
            "On the Influence of Confluence in Modal Logics.",
            "An Improved Tree-Structured Codebook Search Algorithm for Grayscale Image Compression.",
            "Bounds for Validation.",
            "Counter-Free Keys and Functional Dependencies in Higher-Order Datamodels.",
            "Exact Computation of Minimum Feedback Vertex Sets with Relational Algebra.",
            "A Novel Color Image Hiding Scheme Using Block Truncation Coding.",
            "Di-Algebraic Semantics of Logics.",
            "Negative Ordered Hyper-Resolution as a Proof Procedure for Disjunctive Logic Programming.",
            "Indexing Schemes for Similarity Search: an Illustrated Paradigm.",
            "Decidability Analysis of Self-Stabilization for Infinite-State Systems.",
            "Preface.",
            "On the Analysis of Fuzzy String Patterns with the Help of Extended and Stochastic GDPLL(k) Grammars.",
            "Architectural Principles and Scheduling Strategies for Computing Agent Systems.",
            "Multi-agent Approach to Dynamic Pick-up and Delivery Problem with Uncertain Knowledge about Future Transport Demands.",
            "Architecture for Discovery of Crises in MAS.",
            "A Set Theory for Rough Sets. Toward A Formal Calculus of Vague Statements.",
            "An Empirical Study of Using Rule Induction and Rough Sets to Software Cost Estimation.",
            "Timed Approximate Petri Nets.",
            "A Petri Net System - an Overview.",
            "Reconstruction of Concurrent System Models Described by Decomposed Data Tables.",
            "Logic for Rough Truth.",
            "Thread Algebra with Multi-Level Strategies.",
            "Pruning Operators for Disjunctive Logic Programming Systems.",
            "A Novel Index Coding Scheme for Vector Quantization.",
            "Complexity of Searching for a Black Hole.",
            "Resource-Constrained Workflow Nets.",
            "The Weighted Suffix Tree: An Efficient Data Structure for Handling Molecular Weighted Sequences and its Applications.",
            "Spiking Neural P Systems.",
            "Exploiting the Lattice of Ideals Representation of a Poset.",
            "Reinforcement Learning with Approximation Spaces.",
            "A Robust Content-Based Copy Detection Scheme.",
            "Probability and Program-Size for Functions.",
            "On Simplification of Database Integrity Constraints.",
            "Foundations of Paraconsistent Resolution.",
            "A Novel Image Ownership Protection Scheme Based on Rehashing Concept and Vector Quantization.",
            "A Formal Language Analysis of DNA Hairpin Structures.",
            "On Problems in Polymorphic Object-Oriented Languages With Self Types and Matching.",
            "An Efficient and Secure Cryptosystem for Encrypting Long Messages.",
            "Observational Equivalences for Timed Stable Event Structures.",
            "A Calculus of Looping Sequences for Modelling Microbiological Systems.",
            "Behavioral Pattern Identification Through Rough Set Modeling.",
            "Expressing and Verifying Temporal and Structural Properties of Mobile Agents.",
            "Determining Sound Markings in Structured Nets.",
            "Equations for message passing.",
            "A Rewriting Framework for Rule-Based Programming Dynamic Applications.",
            "Modelling Global and Local Name Spaces for Mobile Agents Using Object Nets.",
            "Separation of Control and Data Flow in High-Level Petri Nets: Transforming Dual Flow Nets into Object Petri Nets.",
            "Possible Rough Ingredients of Concepts in Approximation Spaces.",
            "Dynamic Behavior of Simple Insertion Sort Algorithm.",
            "Network Information Flow.",
            "Slicing of Timed Automata with Discrete Data.",
            "A Strong Completeness Result for a MAS Logic.",
            "Comparing BDD and SAT Based Techniques for Model Checking Chaum's Dining Cryptographers Protocol.",
            "Star-Connected Flat Languages and Automata.",
            "Properties of Super-Dual Nets.",
            "On Quantum Vector Addition Systems.",
            "A Quantifier-free First-order Knowledge Logic of Authentication.",
            "Optimization of Speech Recognition by Clustering of Phones.",
            "Learning Sunspot Classification.",
            "Trace Nets and Conflict-free Computations.",
            "Star-free Star and Trace Languages.",
            "Associative Omega-product of Processes.",
            "Update and Abstraction in Model Checking of Knowledge and Branching Time.",
            "Calculi of Approximation Spaces.",
            "Rough Sets for Handling Imbalanced Data: Combining Filtering and Rule-based Classifiers.",
            "A Rough Set Approach to Multiple Classifier Systems.",
            "An Axiomatic Characterization of Algebras of Processes of Petri Nets.",
            "Complete Orders, Categories and Lattices of Approximations.",
            "Surface Properties from N-Views of a Strictly Convex Solid.",
            "On-line Approximate String Matching in Natural Language.",
            "P Systems with Proteins on Membranes.",
            "A Value-propagating Transformation Technique for Datalog Programs Based on Non-Deterministic Constructs.",
            "Model-Based Feature Compensation for Robust Speech Recognition.",
            "Trajectories of Language Theory.",
            "Automata Recognizing No Words: A Statistical Approach.",
            "An Algebraic Characterization of Semi-Simple Splicing.",
            "On the Branching Complexity of P Systems.",
            "On a Connection Between Cooperating Distributed Grammar Systems and Basic Process Algebra.",
            "Secret Sharing Schemes with Nice Access Structures.",
            "On Some Problems of Mateescu Concerning Subword Occurrences.",
            "Interpreted Trajectories.",
            "Observations on the Smoothness Properties of Real Functions Computed by Weighted Finite Automata.",
            "Faster Algorithm for Designing Optimal Prefix-Free Codes with Unequal Letter Costs.",
            "Undecidability in omega-Regular Languages.",
            "On the Problem Whether the Image of an N-Rational Series Equals.",
            "On the Computational Power of 1-Deterministic and Sequential P Systems.",
            "The Shortest Common Superstring Problem and Viral Genome Compression.",
            "Block Substitutions and Their Properties.",
            "Simple Gene Assembly Is Deterministic.",
            "Synchronized Shuffle on Backbones.",
            "Mild Context-Sensitivity, After Twenty Years.",
            "Routes and Products of Monoids.",
            "Membrane Computing and Economics: Numerical P Systems.",
            "A Property of Independency Relations Induced by Probabilistic Distributions with Binary Variables.",
            "Nondeterministic Bimachines and Rational Relations with Finite Codomain.",
            "Injectivity of the Parikh Matrix Mappings Revisited.",
            "Interactive Systems with Registers and Voices.",
            "Note on Some Order Properties Related to Processes Semantics (I).",
            "Logic Programming Representation of the Compound Term Composition Algebra.",
            "A Low-complexity Distance for DNA Strings.",
            "Multiple Images Embedding Scheme Based on Moment Preserving Block Truncation Coding.",
            "Adaptive Merging of Prioritized Knowledge Bases.",
            "Event Structures with Disabling/Enabling Relation and Event Automata.",
            "Foundations on Coordination Languages and Software Architectures.",
            "Fully Abstract Semantics for a Coordination Model with Asynchronous Communication and Enhanced Matching.",
            "Supporting Secure Coordination in SecSpaces.",
            "Coordination as a Service.",
            "Distribution of a Simple Shared Dataspace Architecture.",
            "A Component Coordination Model Based on Mobile Channels.",
            "Typing the Behavior of Software Components using Session Types.",
            "Special Issue with Selected Papers from ICGT 2004.",
            "Adhesive High-Level Replacement Systems: A New Categorical Framework for Graph Transformation.",
            "Fundamental Theory for Typed Attributed Graphs and Graph Transformation based on Adhesive HLR Categories.",
            "Stochastic Graph Transformation Systems.",
            "Local Computations in Graphs: The Case of Cellular Edge Local Computations.",
            "The Embedding Problem for Switching Classes of Graphs.",
            "Theory of Constraints and Application Conditions: From Graphs to High-Level Structures.",
            "Limits of Modularity.",
            "Reversible Data Embedding Based on Prediction Approach for VQ and SMVQ Compressed Images.",
            "Contact Algebras and Region-based Theory of Space: A Proximity Approach - I.",
            "Contact Algebras and Region-based Theory of Space: Proximity Approach - II.",
            "Rough Relation Algebras Revisited.",
            "A Categorical View on Algebraic Lattices in Formal Concept Analysis.",
            "Capabilities of Thoughtful Machines.",
            "The Linear Combination of Logistic and Gumbel Random Variables.",
            "Process-Specific Information for Learning Electronic Negotiation Outcomes.",
            "Analysis of RTCP-nets with Reachability Graphs.",
            "Machines, Computations and Universality.",
            "(Tissue) P Systems with Unit Rules and Energy Assigned to Membranes.",
            "Recursive Analysis Characterized as a Class of Real Recursive Functions.",
            "Higman's Theorem on Discrete Sets.",
            "Observation of String-Rewriting Systems.",
            "Decidability and Universality in Symbolic Dynamical Systems.",
            "Abstract Geometrical Computation 1: Embedding Black Hole Computations with Rational Numbers.",
            "Variable Complexity of Simple Programs.",
            "Reversible P Systems to Simulate Fredkin Circuits.",
            "On the Completion of Codes in Submonoids with Finite Rank.",
            "Computational Universality in One-variable Language Equations.",
            "Shuffle of Words and Araucaria Trees.",
            "A State-Efficient Mapping Scheme for Designing Two-Dimensional Firing Squad Synchronization Algorithms."
        ]
    },
    {
        "name": "FUIN",
        "year": "2005",
        "info": "2005: Volumes\n64, 65, 66, 67, 68",
        "count": 120,
        "papers": [
            "Contagious Creativity.",
            "Mathematical Chemistry: (3, g)-Cages with Girth g, Topological Indices, and Other Graph-Theoretical Problems.",
            "Biosyntax. An Overview.",
            "On P Systems and Almost Periodicity.",
            "Proving as a Computable Procedure.",
            "Results on Transforming NFA into DFCA.",
            "Time and Synchronization in Membrane Systems.",
            "On Total Contextual Grammars with Restricted Choice.",
            "An Automata Description of the Genetic Message Translation.",
            "Contextual Grammars with Subregular Choice.",
            "Fast Data Compression with Antidictionaries.",
            "Rank Distance with Applications in Similarity of Natural Languages.",
            "New Iteration Lemmata for Regular Languages.",
            "Representations of Recursively Enumerable Array Languages by Contextual Array Grammars.",
            "Parsing Local Internal Contextual Languages with Context-Free Choice.",
            "Does Light Direct Life Toward Cosmic Awareness?",
            "Refinement in Finite State Machine Testing.",
            "Complete Testing from a Stream X-Machine Specification.",
            "Deterministic Two-Way Restarting Automata and Marcus Contextual Grammars.",
            "On the Relationship Between Multiple Brackets and Selector Languages in Bracketed Contextual Grammars.",
            "Further Results on Contextual and Rewriting P Systems.",
            "On Probabilistic Contextual Grammars.",
            "On the Logic and Geometry of Bilinear Forms.",
            "Logical Analysis of Biological Systems.",
            "Time-Varying Distributed H Systems: An Overview.",
            "Marcus External Contextual Grammars: From One to Many Dimensions.",
            "On Characterizing Recursively Enumerable Languages by Insertion Grammars.",
            "Construction of Contextual Grammars.",
            "Contextual Grammars with Uniform Sets of Trajectories.",
            "Symport/Antiport P Systems with Three Objects Are Universal.",
            "Flow Graphs and Intelligent Data Analysis.",
            "On Rough Set Logics Based on Similarity Relations.",
            "On the Injectivity of Parikh Matrix Mappings.",
            "omega-rewriting the Collatz Problem.",
            "Rough Sets and Vague Concepts.",
            "Word Sense Disambiguation by Machine Learning Approach: A Short Survey.",
            "Deterministic Complexity and Entropy.",
            "Asymptotic Properties of the Factors of Words Over a Finite Alphabet.",
            "State Complexity: Recent Results and Open Problems.",
            "Typed Lambda Calculi and Applications 2003, Selected Papers.",
            "for Data: Differentiating Data Structures.",
            "Synthesis of max-plus quasi-interpretations.",
            "Inductive types in the Calculus of Algebraic Constructions.",
            "Principal Typing for Lambda Calculus in Elementary Affine Logic.",
            "A Logical Framework with Dependently Typed Records.",
            "On lambda-Definability I: the Fixed Model Problem and Generalizations of the Matching Problem.",
            "Parameterizations and Fixed-Point Operators on Control Categories.",
            "Sequentiality in Bounded Biorders.",
            "Tracing Relations Probabilistically.",
            "Behaviour and Instantiation of High-Level Petri Net Processes.",
            "Super Rough Semantics.",
            "Real Recursive Functions and Baire Classes.",
            "About Splicing P Systems with One Membrane.",
            "An Image Hiding Scheme Based on Multi-bit-reference Substitution Table Using Dynamic Programming Strategy.",
            "Revealed Preference, Congruence and Rationality: A Fuzzy Approach.",
            "On countable RCC models.",
            "Data Compressor for VQ Index Tables.",
            "R. Thomas' Modeling of Biological Regulatory Networks: Introduction of Singular States in the Qualitative Dynamics.",
            "Advances in Mining Graphs, Trees and Sequences.",
            "A Dichotomic Search Algorithm for Mining and Learning in Domain-Specific Logics.",
            "Efficiently Mining Frequent Embedded Unordered Trees.",
            "A General Framework for Mining Frequent Subgraphs from Labeled Graphs.",
            "Graph-based Relational Learning with Application to Security.",
            "Detecting Irrelevant Subtrees to Improve Probabilistic Learning from Tree-structured Data.",
            "Constructing a Decision Tree for Graph-Structured Data and its Applications.",
            "Frequent Subtree Mining - An Overview.",
            "Generalized Interpolation in First Order Logic.",
            "Synchronous and Asynchronous Communications in Composable Parameterized High-Level Petri Nets.",
            "Tracing Relations Probabilistically.",
            "On Winning Conditions of High Borel Complexity in Pushdown Games.",
            "On Effective Methods for Diagnosis of Retaining Faults in Circuits.",
            "Program Transformation: Theoretical Foundations and Basic Techniques. Part 1.",
            "Point-free Program Transformation.",
            "Proof Methods for Corecursive Programs.",
            "A Method for Automatic Program Inversion Based on LR(0) Parsing.",
            "There and Back Again.",
            "Infinite Unfolding and Transformations of Nondeterministic Programs.",
            "Preface: Concurrency Specification and Programming.",
            "Abstract Interpretation of an Object Calculus for Synchronization Optimizations.",
            "A Probabilistic Model for Molecular Systems.",
            "Higher order Programming in Java: Introspection, Subsumption and Extraction.",
            "An Axiomatic Framework for Proving Correctness of Nets.",
            "Petri Net Processes for Zero-Safe Nets.",
            "Satisfiability and Meaning of Formulas and Sets of Formulas in Approximation Spaces.",
            "On Star-Connected Flat Languages.",
            "Automatic Modeling and Analysis of MSC-specified Systems.",
            "Probability in Petri Nets.",
            "Flexible Indiscernibility Relations for Missing Attribute Values.",
            "Time Petri Nets for Modelling and Analysis of Biochemical Networks.",
            "Extreme Runtimes of Schedules Modelled by Time Petri Nets.",
            "Associative Omega-products of Traces.",
            "Social Formation of Negotiation Space and Groups for Non-Isolated Multilateral Negotiations.",
            "Modelling Complex Patterns by Information Systems.",
            "A Controller Design for the Khepera Robot: A Rough Set Approach.",
            "Restriction-Based Concurrent System Design Using the Rough Set Formalism.",
            "Spatio-Temporal Approximate Reasoning over Complex Objects.",
            "Weight-Based Negotiation Mechanisms: Balancing Personal Utilities.",
            "Universal Semi-local Election Protocol Using Forward Links.",
            "SAT-based Reachability Checking for Timed Automata with Diagonal Constraints.",
            "A New Partial Semantics for Disjunctive Deductive Databases.",
            "Tabular Expressions and Their Relational Semantics.",
            "KDS-transformation for Data Compression.",
            "First and Second Order Recursion on Abstract Data Types.",
            "Eliminating Introns in Ant Colony Programming.",
            "A Multimodal Logic Approach to Order of Magnitude Qualitative Reasoning with Comparability and Negligibility Relations.",
            "$-Calculus of Bounded Rational Agents: Flexible Optimization as Search under Bounded Resources in Interactive Systems.",
            "Event Structures for Arbitrary Disruption.",
            "The Open Calculus of Constructions (Part I): An Equational Type Theory with Dependent Types for Programming, Specification, and Interactive Theorem Proving.",
            "Towards a Framework for Modelling Systems with Rich Internal Structures of States and Processes.",
            "An Inverse Halftoning Technique Using Modified Look-Up Tables.",
            "On Finite Model Property of the Equational Theory of Kleene Algebras.",
            "Very Simple Chaitin Machines for Concrete AIT.",
            "The Open Calculus of Constructions (Part II): An Equational Type Theory with Dependent Types for Programming, Specification, and Interactive Theorem Proving.",
            "A Comparative Study of Algebra Viewpoint and Information Viewpoint in Attribute Reduction.",
            "Information Divergence Criterion in Speech Signal Recognition.",
            "A New Density-Based Scheme for Clustering Based on Genetic Algorithm.",
            "A Genetic Hillclimbing Algorithm for the Optimal Linear Arrangement Problem.",
            "Incidence Calculus on Lukasiewicz's Three-valued Logic.",
            "Random Surfer with Back Step.",
            "A Secure Strong-Password Authentication Protocol."
        ]
    },
    {
        "name": "FUIN",
        "year": "2004",
        "info": "2004: Volumes\n59, 60, 61, 62, 63",
        "count": 111,
        "papers": [
            "Relating Communicating Processes with Different Interfaces.",
            "Nonmonotonic Proof Systems: Algebraic Foundations.",
            "Tree Operations in P Systems and lamda-Calculus.",
            "Risk-type Description of Control Variants.",
            "Preface.",
            "A View on Rough Set Concept Approximations.",
            "Discovering Motifs in DNA Sequences.",
            "A New Rough Sets Model Based on Database Systems.",
            "Interpolation Models for Spatiotemporal Association Mining.",
            "DSD: Maintain Data Cubes More Efficiently.",
            "Imperfect Causality.",
            "A Comparison of Rough Set Methods and Representative Inductive Learning Algorithms.",
            "Pretopologies and Dynamic Spaces.",
            "Reasoning in Information Maps.",
            "Rough Set Approach to Domain Knowledge Approximation.",
            "Extraction of Structure of Medical Diagnosis from Clinical Data.",
            "The Quotient Space Theory of Problem Solving.",
            "RRIA: A Rough Set and Rule Tree Based Incremental Knowledge Acquisition Algorithm.",
            "Analytic Calculi for Monoidal T-norm Based Logic.",
            "Leader Election in Rings with Nonunique Labels.",
            "Trajectory-Based Embedding Relations.",
            "Error-Robust Functional Dependencies.",
            "A Set-Theoretic Framework for Component Composition.",
            "Preface.",
            "Bilateral Ranking Negotiations.",
            "Exploiting Labels in Structural Operational Semantics.",
            "Decision Rules and Dependencies.",
            "Entish: A Language for Describing Data Processing in Open Distributed Systems.",
            "Abstract Interpretation Against Races.",
            "Concrete and Abstract Semantics to Check Secure Information Flow in Concurrent Programs.",
            "Models and Parallel Programming Abstractions to Enhance Concurrency of Parallel Programs.",
            "Mobile Object-Net Systems and their Processes.",
            "A New Synchronisation Model for Multi-Level Object Petri Nets.",
            "On Fuzzy Reasoning Using Matrix Representation of Extended Fuzzy Petri Nets.",
            "A Graded Meaning of Formulas in Approximation Spaces.",
            "Data Mining and Its Use in Texture Analysis.",
            "Slicing Timed Systems.",
            "On Designated Values in Multi-valued CTL* Model Checking.",
            "Communities of Interacting Automata for Modelling Distributed Systems with Dynamic Structure.",
            "Best Fairness Hierarchy in Elementary Nets.",
            "Discovering Concurrent Models from Data Tables with the ROSECON System.",
            "The Performance Evaluation Tool for Automated Prototyping of Concurrent Cyclic Processes.",
            "Some Remarks on Sets of Communicating Sequential Processes in Topological Rough Set Framework.",
            "Minimization Algorithms for Time Petri Nets.",
            "On Associative Omega-Products.",
            "Complex Patterns.",
            "Compositional Synthesis of Generalized Mealy Machines.",
            "Open Maps and Observational Equivalences for Timed Partial Order Models.",
            "Galois Connections and Data Analysis.",
            "Improvements in SAT-based Reachability Analysis for Timed Automata.",
            "Integrating Forms of Interaction in a Distributed Model.",
            "Register Cellular Automata in the Hyperbolic Plane.",
            "Conjoinability in Pregroups.",
            "A Note on 3-valued Rough Logic Accepting Decision Rules.",
            "Asynchronous Circuits, Communicating Processes, and Muller Automaton.",
            "Semirings in Operations Research and Computer Science: More Algebra.",
            "Preface.",
            "Consecutive Optimization of Decision Trees Concerning Various Complexity Measures.",
            "Discovery of Asynchronous Concurrent Models from Experimental Tables.",
            "Hyperplane Aggregation of Dominance Decision Rules.",
            "Learning First-Order Rules: A Rough Set Approach.",
            "Reducts and Constructs in Attribute Reduction.",
            "Located Actions in Process Algebra with Timing.",
            "A Refined VQ-Based Image Compression Method.",
            "Consistency Conditions in Fuzzy Consumers Theory.",
            "On the Rlationship Between Monadic and Weak Monadic Second Order Logic on Arbitrary Trees, with Applications to the mu-Calculus.",
            "Asymptotics for Length and Trajectory from Cumulative Chord Piecewise-Quartics.",
            "C1 Interpolation with Cumulative Chord Cubics.",
            "Dual LDA for Face Recognition.",
            "Fast Index Filtering in Vector Approximation File.",
            "A Method to Prove Non-Reachability in Priority Duration Petri Nets.",
            "Image Indexing by Distributed Color Temperature Descriptions.",
            "Scenery Image Segmentation Using Support Vector Machines.",
            "Enhanced of Key Agreement Protocols Resistant to a Denial-of-Service Attack.",
            "Preface.",
            "Logics for Real Time: Decidability and Complexity.",
            "A Logic Framework for Verification of Timed Algorithms.",
            "Understanding Basic Automata Theory in the Continuous Time Setting.",
            "Synchronous Circuits over Continuous Time: Feedback Reliability and mpleteness.",
            "Preface.",
            "Synthesis of Open Reactive Systems from Scenario-Based Specifications.",
            "Quasi-static Scheduling for Concurrent Architectures.",
            "A Polynomial-Time Algorithm for Checking Consistency of Free-Choice Signal Transition Graphs.",
            "Detecting State Encoding Conflicts in STG Unfoldings Using SAT.",
            "Formal Refinement Checking in a System-level Design Methodology.",
            "An Adaptive Steganographic Scheme for Color Images.",
            "A Timed Extension for ALTARICA.",
            "An omega-Power of a Finitary Language Which is a Borel Set of Infinite Rank.",
            "Query Compilation under the disjunctive well-founded semantics.",
            "Approximation Algorithms for MAX-BISECTION on Low Degree Regular Graphs.",
            "The Compactness of Belief Revision and Update Operators.",
            "Optimal Unification of Infinite Sets of Types.",
            "A Rough Set Theoretic Approach to Clustering.",
            "Efficient String Matching in Huffman Compressed Texts.",
            "Knowledge Acquisition under Incomplete Knowledge using Methods from Formal Concept Analysis: Part I.",
            "Knowledge Acquisition under Incomplete Knowledge using Methods from Formal Concept Analysis: Part II.",
            "ACTLS properties and Bounded Model Checking.",
            "Embedding Invisible Watermarks into Digital Images Based on Side-Match Vector Quantization.",
            "Coalition Formation: Towards Feasible Solutions.",
            "A Formal Model for Situated Multi-Agent Systems.",
            "Rational Teams: Logical Aspects of Multi-Agent Systems.",
            "Agents that Know How to Play.",
            "From Bounded to Unbounded Model Checking for Temporal Epistemic Logic.",
            "Multilateral Ranking Negotiations.",
            "Knowledge-Based Asynchronous Programming.",
            "A Tuning Machine for Cooperative Problem Solving.",
            "A Timed Linda Language and its Denotational Semantics.",
            "Algebraic Structures Related to Many Valued Logical Systems. Part I: Heyting Wajsberg Algebras.",
            "Algebraic Structures Related to Many Valued Logical Systems. Part II: Equivalence Among some Widespread Structures.",
            "Applying term rewriting to partial algebra theory.",
            "Modeling and Verification of Reactive Systems using Rebeca."
        ]
    },
    {
        "name": "FUIN",
        "year": "2003",
        "info": "2003: Volumes\n54, 55, 56, 57, 58",
        "count": 103,
        "papers": [
            "On Decomposition for Incomplete Data.",
            "Constructing Decision Procedures in Equational Clausal Logic.",
            "Rough Mereology: A Rough Set Paradigm for Unifying Rough Set Theory and Fuzzy Set Theory.",
            "LTF-C: Architecture, Training Algorithm and Applications of New Neural Classifier.",
            "Exercises in Style (Alpha Specifications).",
            "A Decidable Notion of Timed Non-Interference.",
            "Revisiting the Algebra of Petri Net Processes under the Collective Token Philosophy.",
            "Proving Nets Correct via Cause-Effect Structures (An Experiment).",
            "Some Considerations on Higher-Order Petri Nets.",
            "Abstract Interpretation and Model Checking for Checking Secure Information Flow in Concurrent Systems.",
            "Undecidability of a Multi-Agent Logic.",
            "Concurrency in Mobile Object Net Systems.",
            "Dynamic Hierarchical Machines.",
            "Distributed Verification with LoLA.",
            "Rough Sets and Infomorphisms: Towards Approximation of Relations in Distributed Environments.",
            "Towards Ambitious Approximation Algorithms in Stubborn Set Optimization.",
            "Asynchronous Box Calculus.",
            "Classification of Infinite Information Systems Depending on Complexity of Decision Trees and Decision Rule Systems.",
            "Descriptional independence and the formal definition of sequential control structure.",
            "Applying Rough Set Theory to Multi Stage Medical Diagnosing.",
            "Deciding whether the frontier of a regular tree is scattered.",
            "Theoretical study and implementation of the canonical automaton.",
            "On the Classification and Aggregation of Hierarchies with Different Constitutive Elements.",
            "Compressible Infinite Information Systems.",
            "A Fixpoint Semantics and an SLD-Resolution Calculus for Modal Logic Programs.",
            "Petri nets and resource bisimulation.",
            "N-axioms Parallel Unification.",
            "Modelling with Hierarchical Object Petri Nets.",
            "Synthesis of Petri Net Models: A Rough Set Approach.",
            "Verifying Epistemic Properties of Multi-agent Systems via Bounded Model Checking.",
            "Using State Equation to Prove Non-Reachability in Timed Petrinets.",
            "Reachability Analysis for Timed Automata Using Partitioning Algorithms.",
            "Checking Reachability Properties for Timed Automata via SAT.",
            "Sequential Versus Parallel Grammar Formalisms with Respect to Measures of Descriptional Complexity.",
            "Shadowed Sets and Related Algebraic Structures.",
            "Deterministic Computations on a PRAM with Static Processor and Memory Faults.",
            "Untraceable Blind Signature Schemes Based on Discrete Logarithm Problem.",
            "Institution-independent Ultraproducts.",
            "Derived Tree Languages of Nonassociative Lambek Categorial Grammars with Product.",
            "Extensionality of the RCC8 Composition Table.",
            "Basic principles for understanding evolutionary algorithms.",
            "Occurrence and Substring Heuristics for i-Matching.",
            "Fast Multipattern Search Algorithms for Intrusion Detection.",
            "Better Filtering with Gapped q-Grams.",
            "Regexpcount, a symbolic package for counting problems on regular expressions and words.",
            "Speeding-up Hirschberg and Hunt-Szymanski LCS Algorithms.",
            "A Fast Algorithm for Optimal Alignment between Similar Ordered Trees.",
            "Computing forbidden words of regular languages.",
            "Time/Space Efficient Compressed Pattern Matching.",
            "Definability and Compression.",
            "A Simple and Scalable Algorithm for the IP Address Lookup Problem.",
            "Compact Suffix Array - A Space-Efficient Full-Text Index.",
            "Eliminating Unorthodox Derivation Rules in an Axiom System for Iteration-free PDL with Intersection.",
            "An Efficient and Practical (t, n) Threshold Proxy Signature Scheme with Known Signers.",
            "On the Infinigons of the Hyperbolic Plane, A combinatorial approach.",
            "On the existence of a new family of Diophantine equations for z.",
            "Center-Based Indexing in Vector and Metric Spaces.",
            "Tissue-like P Systems with Active Membranes for Picture Generation.",
            "Evolution of Collective Commitment during Teamwork.",
            "On the Notion of Elementary Description.",
            "On the Finiteness of Picture Languages of synchronous, simple non-deterministic Chain Code Picture Systems.",
            "An Extended Relational Algebra on Abstract Objects for Summarizing Answers to Queries.",
            "The Intrinsic Complexity of Learning: A Survey.",
            "Learning Recursive Theories in the Normal ILP Setting.",
            "Eventually Dual Failure Agreement.",
            "Preface.",
            "Quasi-Possibilistic Logic and its Measures of Information and Conflict.",
            "A Fuzzy Modal Logic for Belief Functions.",
            "Towards a Framework for Approximate Ontologies.",
            "Probabilistic Complex Actions in GOLOG.",
            "Formalizing Defeasible Logic in CAKE.",
            "From Rough Sets to Rough Knowledge Bases.",
            "From Tableaux to Automata for Description Logics.",
            "A Modal Characterization of Nash Equilibrium.",
            "Modal Probability, Belief, and Actions.",
            "Monitoring Agents using Declarative Planning.",
            "Intelligent Execution Monitoring in Dynamic Environments.",
            "Graphs and Colorings for Answer Set Programming with Preferences.",
            "Preface.",
            "Graph Transformation with Time.",
            "Euler Graphs, Triangle-Free Graphs and Bipartite Graphs in Switching Classes.",
            "Abstraction and Control for Shapely Nested Graph Transformation.",
            "Solving a PSPACE-Complete Problem by Recognizing P Systems with Restricted Active Membranes.",
            "Fuzzy Closure Operators Induced by Similarity.",
            "A New Channel for Image Hiding Based on Interpolating polynomials.",
            "Reasoning and Learning in Extended Structured Bayesian Networks.",
            "On (weakly) local approximation spaces of information systems.",
            "Risk in Control. On the Notion of Risk Function.",
            "An Improvement to Image Segment Based on Human Visual System for Object-based Coding.",
            "A DWT-based Deblocking Technique Based on Edge Detection and Zero Masking for Reducing Blocking Effect.",
            "Hiding Digital Watermarks Using Fractal Compression Technique.",
            "Foreword.",
            "Cellular automata with vanishing particles.",
            "Almost Periodic Configurations on Linear Cellular Automata.",
            "Simulations Between Cellular Automata on Trees Extended by Horizontal Edges.",
            "Simulations Between Multi-dimensional Deterministic and Alternating Cellular Automata.",
            "Space- and Time-Bounded Nondeterminism for Cellular Automata.",
            "Embedding Universal Delay-Insensitive Circuits in Asynchronous Cellular Spaces.",
            "Theory and Application of Cellular Automata For Pattern Classification.",
            "On One-Way Cellular Automata with a Fixed Number of Cells.",
            "Tools for devising cellular automata in the hyperbolic 3D space.",
            "Information Dynamics of Cellular Automata I - An Algebraic Study.",
            "Real-Time Generation of Primes by a 1-Bit-Communication Cellular Automaton."
        ]
    },
    {
        "name": "FUIN",
        "year": "2002",
        "info": "2002: Volumes\n49, 50, 51, 52, 53",
        "count": 105,
        "papers": [
            "ReMembrane Systems with Coupled Transport: Universality and Normal Forms.",
            "P Systems with Replicated Rewriting and Stream X-Machines (Eilenberg Machines).",
            "The Relevance of Cell Membranes for P Systems. General Aspects.",
            "Recursive Calculus with Membranes.",
            "P System Software Simulator.",
            "Gene Expression by Software Mechanisms.",
            "GP Systems with Forbidding Context.",
            "A Direct Construction of a Universal P System.",
            "The Topological Structures of Membrane Computing.",
            "The Bhopalator: An Information/Energy Dual Model of the Living Cell (II).",
            "On the Power of P Systems with Contextual Rules.",
            "Contextual P Systems.",
            "Closure Properties of Multiset Language Families.",
            "DNA and Membrane Algorithms for SAT.",
            "Membranes Versus DNA.",
            "On the Power of P Systems with DNA-Worm-Objects.",
            "A C Library for Simulating P Systems.",
            "Simulations of Photosynthesis by a K-Subset Transforming System with Membrane.",
            "A Formalization of Transition P Systems.",
            "Simulating Turing Machines by P Systems with External Output.",
            "On the Injectivity of the Parikh Matrix Mapping.",
            "Relaxed Update and Partition Network Games.",
            "Optimal Unification and Learning Algorithms for Categorial Grammars.",
            "Processing Indefinite Deductive Databases under the Possible Model Semantics.",
            "A New Bayesian Tree Learning Method with Reduced Time and Space Complexity.",
            "PathLog: a Query Language for Schemaless Databases of Partially Labeled Objects.",
            "Markov Decision Processes and Deterministic Büchi Automata.",
            "A Complete Axiomatization of Process Temporal Logic.",
            "A Class of Composable and Preemptible High-level Petri Nets with an Application to Multi-Tasking Systems.",
            "On Decision Trees for (1, 2)-Bayesian Networks.",
            "Analytic sets in Descriptive Set Theory and NP sets in Complexity Theory.",
            "The BDD Space Complexity of Different Forms of Concurrency.",
            "A structural encoding technique for the synthesis of asynchronous circuits.",
            "Optimization of Asynchronous Delay-Insensitive Pipeline Latency Using Stage Reorganization and Optimal Stage Parameter Estimation.",
            "Synthesising Elementary Net Systems with Inhibitor Arcs from Step Transition Systems.",
            "Algorithms for Signal and Message Asynchronous Communication Mechanisms and their Analysis.",
            "Analysis of Performance Bottlenecks in Multithreaded Multiprocessor Systems.",
            "A Modal Logic for Indiscernibility and Complementarity in Information Systems.",
            "On Average Depth of Decision Trees Implementing Boolean Functions.",
            "Self-describing Turing machines.",
            "On Fractal Dimension in Information Systems. Toward Exact Sets in Infinite Information Systems.",
            "A Linear Time Special Case for MC Games.",
            "UPSILON: Universal Programming System with Incomplete Lazy Object Notation.",
            "Completeness of Timed mCRL.",
            "A Notion of Non-Interference for Timed Automata.",
            "Products and Polymorphic Subtypes.",
            "Place/Transition Petri Net Evolutions: Recording Ways, Analysis and Synthesis.",
            "Verification of Timed Automata Based on Similarity.",
            "Dynamic Modification of Object Petri Nets. An Application to Modelling Protocols with Fork-Join Structures.",
            "A Comparative Study of Some Generalized Rough Approximations.",
            "Modeling Dynamic Objects in Distributed Systems with Nested Petri Nets.",
            "Bounded Model Checking for the Universal Fragment of CTL.",
            "Towards an Ontology of Approximate Reason.",
            "Global Action Rules in Distributed Knowledge Systems.",
            "Verification of Non-functional Properties of a Composable Architecture with Petrinets.",
            "A Comparison of Different Decision Algorithms Used in Volumetric Storm Cells Classification.",
            "Minimizing the Number of Successor States in the Stubborn Set Method.",
            "Reachability in Contextual Nets.",
            "Real Time Control for Autonomous Mobile Robots.",
            "Collective Intentions.",
            "Weaker Axioms, More Ranges.",
            "A Study of Interconnections Between Rough and 3-Valued Lukasiewicz Logics.",
            "Another Example of Higher Order Randomness.",
            "Residual Finite State Automata.",
            "RIONA: A New Classification System Combining Rule Induction and Instance-Based Learning.",
            "On Equations Including Strings.",
            "One-Turn Regulated Pushdown Automata and Their Reduction.",
            "Number-conserving cellular automaton rules.",
            "On Interacting Automata with Limited Nondeterminism.",
            "Chaotic Subshifts and Related Languages Applications to one-dimensional Cellular Automata.",
            "Pebble Automata. Figures Families Recognition and Universality.",
            "Firing Squad Synchronization Problem in Number-Conserving Cellular Automata.",
            "Stability of subshifts in cellular automata.",
            "A Geometrical Hierarchy on Graphs via Cellular Automata.",
            "Formal language recognition by stochastic cellular automata.",
            "Effective Simulations on Hyperbolic Networks.",
            "Cellular Automata: Energy Consumption and Physical Feasibility.",
            "Cellular Automata and Intermediate Reachability Problems.",
            "A Design of Real-Time Non-Regular Sequence Generation Algorithms and Their Implementations on Cellular Automata with 1-Bit Inter-Cell Communications.",
            "Three-dimensional Cellular Automata for Reaction-Diffusion Systems.",
            "A Simple Architecture for Computing Moments and Orientation of an Image.",
            "Comparing Refinements for Failure and Bisimulation Semantics.",
            "On Modal and Fuzzy Decision Logics Based on Rough Set Theory.",
            "Construction of Pure Grammars.",
            "One-Visit Caterpillar Tree Automata.",
            "A Logical Approach to Control. Some New Logical Concepts and their Application to the Notion of Safety for Control Variants.",
            "Automata-Theoretic Decision Procedures for Information Logics.",
            "Concept lattices and similarity in non-commutative fuzzy logic.",
            "Process Algebra with Nonstandard Timing.",
            "Complexity of the Unique Extension Problem in Default Logic.",
            "On message deliverability and non-uniform receptivity.",
            "Cryptanalysis of the Hwang-Shi Proxy Signature Scheme.",
            "On the Structure of Rough Approximations.",
            "Learning Rough Set Classifiers from Gene Expressions and Clinical Data.",
            "Characterization Results for Time-Varying Codes.",
            "New polynomial-time instances to various knapsack-type problems.",
            "Object Oriented Database with Authorization Policies.",
            "Making revision reversible: an approach based on polynomials.",
            "Probabilistic Cluster Unfoldings.",
            "A new class of algebraic series having a decidable equivalence problem.",
            "Rough Equalities From Posets and Rough Difference Orders.",
            "A Rough Set Approach to Estimating the Game Value and the Shapley Value from Data .",
            "Application of Rule Induction and Rough Sets to Verification of Magnetic Resonance Diagnosis.",
            "Approximate Entropy Reducts.",
            "A logical approach to control. The concept of Inner Implication."
        ]
    },
    {
        "name": "FUIN",
        "year": "2001",
        "info": "2001: Volumes\n45, 46, 47, 48",
        "count": 83,
        "papers": [
            "Elementary Complexity and Geometry of Interaction.",
            "Counting a Type's (Principal) Inhabitants.",
            "Computing with Böhm Trees.",
            "Explicit Environments.",
            "Marginalia to a Theorem of Jacopini.",
            "Strong Normalisation of Cut-Elimination in Classical Logic.",
            "The Ground Tree Transducer Game with Identical Tree Automata.",
            "Iteration-free PDL with Intersection: a Complete Axiomatization.",
            "From Mirkin's Prebases to Antimirov's Word Partial Derivatives.",
            "Complexity of Fuzzy Probability Logics.",
            "Decomposing Timed Push Down Automata.",
            "Uniform Generation of Languages by Scattered Context Grammars.",
            "Skeptical Reasoning in FC-Normal Logic Programs is P11-complete.",
            "Approximating a Shortest Watchman Route.",
            "Sup-Compact and Inf-Compact Representations of W-Operators.",
            "Sensitivity Analysis for Selective Learning by Feedforward Neural Networks.",
            "Valences in Lindenmayer Systems.",
            "Process Algebras for Network Communication.",
            "Nonmodularity Results for Lambda Calculus.",
            "Complexity Results for 2CNF Default Theories.",
            "Qualitative Spatial Representation and Reasoning: An Overview.",
            "Continuous Shape Transformation and Metrics on Regions.",
            "Dominance Diagrams: A Tool for Qualitative Reasoning About Continuous Systems.",
            "Algebras of Approximating Regions.",
            "On Connection Synthesis via Rough Mereology.",
            "The Qualitative Structure of Built Environments.",
            "Points in point-free mereotopology.",
            "A Categorical Axiomatisation of Region-Based Geometry.",
            "Empiricism and Rationalism in Region-based Theories of Space.",
            "A Fragment of Intuitionistic Dynamic Logic.",
            "A Possibilistic Decision Logic with Applications.",
            "Sensitivity Analysis for Selective Learning by Feedforward Neural Networks.",
            "A Note on SE-Systems and Regular Canonical Systems.",
            "Algorithms and Reductions for Rewriting Problems.",
            "Reduction and a Simple Proof of Characterization of Fuzzy Concept Lattices.",
            "On Different Models for Packet Flow in Multistage Interconnection Networks.",
            "The Modal Query Language MDatalog.",
            "Prelanguages Versus Submonoids.",
            "Geodesy and connectivity in lattices.",
            "Prediction of Ordinal Classes Using Regression Trees.",
            "A Generalization Model Based on OI-implication for Ideal Theory Refinement.",
            "On the Computational Complexity of Optimal Multisplitting.",
            "Constraint-Based Approach to Semistructured Data.",
            "Discovering and Matching Elastic Rules from Sequence Databases.",
            "Local Feature Selection with Dynamic Integration of Classifiers.",
            "Concept Based Retrieval Using Generalized Retrieval Functions.",
            "Discovering and Resolving User Intent in Heterogeneous Databases.",
            "Metadata, Intelligent Indexing, and Repository Management for Multimedia Digital Libraries.",
            "Musical Sound Classification based on Wavelet Analysis.",
            "Timed Automata with non-Instantaneous Actions.",
            "Similarity and Distance in Case Based Reasoning.",
            "w-Process Languages for Place/Transition Nets.",
            "Unfolding Based Algorithms for the Reachability Problem.",
            "Comparing Concepts of Object Petri Net Formalisms.",
            "Clusters, Confusion and Unfoldings.",
            "Transformations of Timed Cooperating Automata.",
            "Nested Petri Nets: Multi-level and Recursive Systems.",
            "Disassembly Scheduling with Parts Commonality Using Petri Nets with Timestamps.",
            "Sensor, Filter, and Fusion Models with Rough Petri Nets.",
            "Narrowing Petri Net State Spaces Using the State Equation.",
            "Information Granule Decomposition.",
            "Ensembles of Classifiers Based on Approximate Reducts.",
            "Supporting Textual Input by Using Multiple Entropy Models.",
            "On Variants of Communicating Distributed H Systems.",
            "Behaviour Abstraction for Communicating Sequential Processes.",
            "Multisequential Grammars with Homogeneous Selectors.",
            "On Efficient Handling of Continuous Attributes in Large Data Bases.",
            "Computability in Type-2 Objects with Well-Behaved Type-1 Oracles is p-Normal.",
            "Some Algorithms for Extension Computation of Nonmonotonic Rule Systems.",
            "A Fixed-point Characterization of a Deontic Logic of Regular Action.",
            "Deontic and Action Logics for Organized Collective Agency, Modeled through Institutionalized Agents and Roles.",
            "An Application of Deontic Logic to Information System Constraints.",
            "An Attempt to Adapt a Logic of Conditional Preferences for Reasoning with Contrary-To-Duties.",
            "Sets, Sentences, and Some Logics about Imperatives.",
            "Natural Frames and Self-dual Logics.",
            "Cumulativity, Identity and Time in Deontic Logic.",
            "Modelling Defeasibility in Law: Logic or Procedure?",
            "On the Representation of Action and Agency in the Theory of Normative Positions.",
            "Using Distance Functions to Solve Representation Choice Problems.",
            "Types for Active Objects with Static Deadlock Prevention.",
            "Effective Procedures for Handling Possible Equivalence Relations in Non-deterministic Information Systems.",
            "Non-Clausal Reasoning with Definite Theories.",
            "Computability by Sequences of Queries."
        ]
    },
    {
        "name": "FUIN",
        "year": "2000",
        "info": "2000: Volumes\n41, 42, 43, 44",
        "count": 68,
        "papers": [
            "Fundamenta Morphologicae Mathematicae.",
            "Mathematical Morphology on Complete Semilattices and its Applications to Image Processing.",
            "Granulometries and Opening Trees.",
            "Curve Evolution, Differential Morphology, and Distance Transforms Applied to Multiscale and Eikonal Problems.",
            "From Binary to Grey Scale Convex Hulls.",
            "Connections for sets and functions.",
            "The Watershed Transform: Definitions, Algorithms and Parallelization Strategies.",
            "Automatic Programming of Morphological Machines by PAC Learning.",
            "On Topological Hierarchies of Temporal Properties.",
            "On Algorithm for Constructing of Decision Trees with Minimal Depth.",
            "Deterministic and Nondeterministic Decision Trees for Rough Computing.",
            "Membrane Computing with External Output.",
            "Testing and Debugging Message Passing Programs in Synergy with their Specifications.",
            "Formalisation of a Production System Modelling Language The operational semantics of c Core.",
            "Similarity-based Unification.",
            "A Signal Extension for Petri Nets and its Use in Controller Design.",
            "Building Knowledge Scouts Using KGL Metalanguage.",
            "Decision Trees for Regular Language Word Recognition.",
            "A Proof System for Dependencies for Information Relations.",
            "Constructing the Least Models for Positive Modal Logic Programs.",
            "Models For Dependable Computation with Multiple Inputs and Some Hardness Results.",
            "An Algebra of Data Flows.",
            "Formalizing Context in Intuitionistic Type Theory.",
            "A Method for Hierarchical Description of Images Using Multiscale Analysis.",
            "Representation of Irrelevance Relations by Annotated Graphs.",
            "Succinctness Gap between Monadic Logic and Duration Calculus.",
            "The Nondeterministic Information Logic NIL is PSPACE-complete.",
            "Reliable Minimum Finding Comparator Networks.",
            "Towards Automated Consistency Checking of Module Interface Specifications.",
            "Necessity Measures and Parametric Inclusion Relations of Fuzzy Sets.",
            "First-order Non-monotonic Modal Logics.",
            "Formal Asynchronous Systems Modelling.",
            "A New Approach to Preferential Structures.",
            "Analysis of Timed Concurrent Models Based on Testing Equivalence.",
            "Finite Completeness of Categories of Petri Nets.",
            "Rational, Linear and Algebraic Process Languages and Iteration Lemmata.",
            "A Multi-region Linear Logic Based Calculus for Dynamic Petri Net Structures.",
            "Structural Analysis of Signal-Event Systems.",
            "Occurrence Net Logics.",
            "A Formalization of Autonomous Dynamic Reconfiguration in Distributed Constraint Satisfaction.",
            "Timed Cooperating Automata.",
            "Coping With Strong Fairness.",
            "Nested Petri Nets - a Formalism for Specification and Verification of Multi-Agent Distributed Systems.",
            "ChariTime - Concepts of Analysis and Design of an Agent-Oriented System for Appointment Management.",
            "A Simple Implementation of Dijkstra's Shortest Path Algorithm on Associative Parallel Processors.",
            "Improving Partial Order Reductions for Universal Branching Time Properties.",
            "An Application of Rough Set Methods in Control Design.",
            "Rough Mereology in Information Systems with Applications to Qualitative Spatial Reasoning.",
            "Analyzing and Reducing Simultaneous Firing in Signal-Event Nets.",
            "Stubborn Sets for Model Checking the EF/AG Fragment of CTL.",
            "TBase2 - a Web-Based Electronic Patient Record.",
            "Stable Models for Stubborn Sets.",
            "Interactive Knapsacks.",
            "A Foundation for Refining Concurrent Objects.",
            "Sharing Variables in Distributed Memory.",
            "Dynamical Teams in Eco-Grammar Systems.",
            "The PMA and Relativizing Minimal Change for Action Update.",
            "Two Problems on Reduction Graphs in Lambda Calculus.",
            "Platek Spaces.",
            "Boldface Recursion on Platek Spaces.",
            "Comparing Truly Concurrent Semantics for Contextual Place/Transition Nets with Inhibitor and Read Arcs.",
            "On a Construction of Context-free Grammars.",
            "Thue Specifications, Infinite Graphs and Synchronized Product.",
            "Normalized Decision Functions and Measures for Inconsistent Decision Tables Analysis.",
            "Deriving and Retrieving Contextual Categorical Information through Instance Inheritance.",
            "Conditional Concatenation.",
            "Computational Complexity of Multimodal Logics Based on Rough Sets.",
            "Representability of Pairing Relation Algebras Depends on your Ontology."
        ]
    },
    {
        "name": "FUIN",
        "year": "1999",
        "info": "1999: Volumes\n37, 38, 39, 40",
        "count": 83,
        "papers": [
            "Using Possibilistic Logic for Modeling Qualitative Decision: ATMS-based Algorithms.",
            "Chaotic Dynamics in Iterated Map Neural Networks with Piecewise Linear Activation Function.",
            "Ecological Model of Virus-Evolutionary Genetic Algorithm.",
            "Interval Regression Analysis with Polynomials and Its Similarity to Rough Sets Concept.",
            "On Fuzzy Integral Equations.",
            "Artificial Vision and Soft Computing.",
            "Differential Evolution Based Fuzzy Logic Controller for Nonlinear Process Control.",
            "Reformulating Learning Vector Quantization and Radial Basis Neural Networks.",
            "Relation Between VGA-classifier and MLP : Determination of Network Architecture.",
            "ILF and DAWN for Verifying Distributed Algorithms - An Idea for a Tool.",
            "Net-Definability of Process Languages.",
            "A Linear Logic View of Object Petri Nets.",
            "Using Logic Programs with Stable Model Semantics to Solve Deadlock and Reachability Problems for 1-Safe Petri Nets.",
            "Finding Symmetries of Algebraic System Nets.",
            "Integrating Distributed Algorithms into Distributed Systems.",
            "Analyzing Paths in Time Petri Nets.",
            "Fixed Point Equations Inside the Algebra of Normal Forms.",
            "Representing Hand-Shake Channel Communication in the Calculus of Cause-Effect Structures.",
            "Multi Lingual Sequent Calculus and Coherent Spaces.",
            "Iteration Lemmata for Certain Classes of Word, Trace and Graph Languages.",
            "A Precise Version of a Time Hierarchy Theorem.",
            "Relative Cost Random Access Machines.",
            "The Complexity of Identifying Large Equivalence Classes.",
            "A General Model for Adjacency.",
            "Traps, Cores, Extensions and Subdirect Decompositions of Unary Algebras.",
            "Bisimulation and Open Maps for Timed Transition Systems.",
            "Distinguishability, Simulation and Universality of Moore Tree Automata.",
            "On the Circuit Depth of Structurally Reversible Cellular Automata.",
            "Subwords and Power-Free Words are not Expressible by Word Equations.",
            "Defect Theorems for Trees.",
            "Solving Equivalence of Recurrent Sequences in Groups by Polynomial Manipulation.",
            "Construction and Enumeration of All Binary Duadic Codes of Length pm.",
            "Non-Injectivity and Knapsacks.",
            "Solitaire Zero-knowledge.",
            "Undecidability in Integer Weighted Finite Automata.",
            "The Equivalence Problem of D0L and DF0L Power Series.",
            "On the Decidability of Some Problems Concerning Morphisms, Regular Sets, and Post Correspondence Problem.",
            "On Causality Semantics of Nets with Priorities.",
            "Multi-Bracketed Contextual Rewriting Grammars.",
            "Many-Valued Modal Non-Monotonic Reasoning: Sequential Stable Sets and Logics with Linear Truth Spaces.",
            "A Subtyping for Extensible, Incomplete Objects.",
            "On Accepting Pure Lindenmayer Systems.",
            "On the Relationships among four Timed Process Algebras.",
            "On Synchronization in P Systems.",
            "A Pragmatic Approach to Extending Provers by Computer Algebra - with Applications to Coding Theory.",
            "A Hybrid Method for Finite Model Search in Equational Theories.",
            "Specification and Integration of Theorem Provers and Computer Algebra Systems.",
            "On Intuitionistic Proof Transformations, their Complexity, and Application to Constructive Program Synthesis.",
            "Combining Clifford Algebraic Computing and Term-Rewriting for Geometric Theorem Proving.",
            "On Quantified Modal Logic.",
            "On the Use of Subgoal Clauses in Bottom-up and Top-down Calculi.",
            "Basic Completion with E-cycle Simplification.",
            "An Open Automated Framework for Constraint Solver Extension: the SoleX Approach.",
            "Automating Inductive Specification Proofs.",
            "Algorithms for Rational Real Algebraic Curves.",
            "Relations Algebras in Qualitative Spatial Reasoning.",
            "On the Complexity of Perfect Models of Logic Programs.",
            "The Complexity of Certain Modal Formulas on Binary Ramified Subset Trees.",
            "A Comprehensive Setting for Matching and Unification over Iterative Terms.",
            "Thue Specifications and Their Monadic Second-order Properties.",
            "An Assistant Agent.",
            "On Average Time Complexity of Decision Trees and Branching Programs.",
            "The More We Learn the Less We Know? On Inductive Learning from Examples.",
            "The Membership Problem for Switching Classes with Skew Gains.",
            "Contributions to the Theory of Rough Sets.",
            "Modal Description Logics: Modalizing Roles.",
            "Inductive Inference with Procrastination: Back to Definitions.",
            "Meta-Queries on Deductive Databases.",
            "Processing Deductive Databases under the Disjunctive Stable Model Semantics.",
            "A Relation Between Unambiguous Regular Expressions and Abstract Data Types.",
            "Computation of Extensions of Seminormal Default Theories.",
            "Peter Lauer and COSY.",
            "The AltaRica Formalism for Describing Concurrent Systems.",
            "Generalised Composition Operations for High-level Petri Nets.",
            "Process Semantics for Place/Transition Nets with Inhibitor and Read Arcs.",
            "General Response Time Computation for the Deadline Driven Scheduling of Periodic Tasks.",
            "Applying Techniques of Asynchronous Concurrency to Synchronous Languages.",
            "The Synthesis Problem for Elementary Net Systems with Inhibitor Arcs.",
            "An Acceptance Vector Semantics for Path Programs.",
            "Tableaux Based Decision Procedures for Modal Logics of Confluence and Density.",
            "Full Abstractness of a Metric Semantics for Action Refinement.",
            "Rough Sets and Association Rule Generation.",
            "Generalized Mutual Exclusion with Semaphores Only."
        ]
    },
    {
        "name": "FUIN",
        "year": "1998",
        "info": "1998: Volumes\n33, 34, 35, 36",
        "count": 71,
        "papers": [
            "Minimal-Maximal Time Cause-Effect Structures.",
            "Cause-Effect Structures - Structural and Semantic Properties Revisited.",
            "On Scott Consequence Systems.",
            "CR-Structures.",
            "Automated Deduction Techniques for Studying Rough Algebras.",
            "Computable Approximations of Reals: An Information-Theoretic Analysis.",
            "Powerdomain of Paths for Representing Object Structures.",
            "Lambda Abstraction Algebras: Coordinatizing Models of Lambda Calculus.",
            "Termination of Graph Rewriting is Undecidable.",
            "An Efficient Parser for a Class of Contextual Languages.",
            "Generalized Factors of Words.",
            "Algebraic, Linear and Rational Languages Defined by Mix Operation.",
            "Limits of Pure Grammars with Monotone Productions.",
            "Parallelism in Contextual Grammars.",
            "Reduction of Pregrammars.",
            "Coinductive Axiomatization of Recursive Type Equality and Subtyping.",
            "A Simple Adequate Categorical Model for PCF, II.",
            "Names, Equations, Relations: Practical Ways to Reason About New.",
            "An Axiomatic System of Parametricity.",
            "Parameterized Structured Operational Semantics.",
            "Credibility of Information for Modelling Belief State and Its Change.",
            "Formalising Abilities and Opportunities of Agents.",
            "Synchronization of a Line of Identical Processors at a Given Time.",
            "Pattern Extraction from Data.",
            "From Optimal Hyperplanes to Optimal Decision Trees.",
            "The Ground Tree Transducer Game.",
            "Executing Suspended Logic Programs.",
            "Rule-Based Constraint Programming.",
            "Building Constraint Satisfaction Problem Solvers Using Rewrite Rules and Strategies.",
            "A Proof Theoretic View of Constraint Programming.",
            "Distributed Concurrent Constraint Programming.",
            "A Review of Image and Video Coding Standards.",
            "Detail Preserving Wavelet-Based Compression with Adaptive Context-Based Quantisation.",
            "Entropy-Constrained Multiresolution Vector Quantisation for Image Coding.",
            "Vector Quantisation.",
            "A Study on Partitioned Iterative Function Systems for Image Compression.",
            "Analysis of Fractal Operator Convergence by Graph Methods.",
            "Stability Analysis of Oja-RLS Learning Rule.",
            "Daubechies Filters in Wavelet Image Compression.",
            "Wavelets and Mallat's Multiresolution Analysis.",
            "Unearthing a Fossil from the History of Evolutionary Computation.",
            "Selection Mechanisms in Evolutionary Algorithms.",
            "On Evolutionary Exploration and Exploitation.",
            "An Overview of Parameter Control Methods by Self-Adaption in Evolutionary Algorithms.",
            "Finite Markov Chain Results in Evolutionary Computation: A Tour d'Horizon.",
            "epsilon-Optimal Stopping Time for Genetic Algorithms.",
            "Evolutionary Algorithm for Economic Lot and Delivery Scheduling Problem.",
            "Revisiting the Memory of Evolution.",
            "Learning Classification Programs: The Genetic Algorithm Approach.",
            "A Historical Perspective on the Evolution of Executable Structures.",
            "Some Aspects of Ant Systems for the TSP.",
            "New Trends in Parallel and Distributed Evolutionary Computing.",
            "DNA Compunting: A Review.",
            "Evolutionary Computation: Where We Are and Where We're Headed.",
            "Adding Partial Orders to Linear Temporal Logic.",
            "General Domain Circumscription and its Effective Reductions.",
            "On the Size of Stack and Synchronization Alphabets of Tree Automata.",
            "Processes of Contextual Nets and their Characteristics.",
            "Remarks on the Relationship Between Cooperating Distributed Grammar Systems and Lindenmayer Systems.",
            "On the Semantics of a Semantic Network.",
            "Characterization of the Expressive Power of Silent Transitions in Timed Automata.",
            "Remarks on Operations Suggested by Mutations in Genomes.",
            "A Uniform Axiomatic View of Lists, Multisets, and Sets, and the Relevant Unification Algorithms.",
            "Truth of Duration Calculus Formulae in Timed Frames.",
            "Optimizations of Rough Set Model.",
            "On Entropy and Optimal Coding Cost for Stochastic Language.",
            "On the Average-Case Complexity of the Graph Reliability Problem on Gaussian Distributions.",
            "Randomized PRAM Simulation.",
            "Pregrammars Versus Submonoids.",
            "The Modified Oja-RLS Algorithm, Stochastic Convergence Analysis and Application for Image Compression.",
            "Simple and Minimal Ground Term Equation Systems."
        ]
    },
    {
        "name": "FUIN",
        "year": "1997",
        "info": "1997: Volumes\n29, 30, 31, 32",
        "count": 87,
        "papers": [
            "On Using Semi-Dyck Sets to Analyse Coupled-Context-Free Languages.",
            "Semantics of Times Concurrent Systems.",
            "Discrete Time Process Algebra: Absolute Time, Relative Time and Parametric Time.",
            "Syntax and Semantics of Real-Time and Performance Evaluation Extensions of Specification Language LOTOS.",
            "Quasi-Metrics and the Semantics of Logic Programs.",
            "Algebraic Aspects of Attribute Dependencies in Information Systems.",
            "Mechanization of Real-Time Linear CSP with Higher Order Logic.",
            "On Definitional Transformations to Normal Form for Institionistic Logic.",
            "A Methodology for Constructing Logic Programs.",
            "How to Interpret and Establish Consistency Results for Semantics of Concurrent Programming Languages.",
            "A Compiler Correctness Proof for the Static Link Technique by Means of Evolving Algebras.",
            "Semantics of Nonsequential Tree-Based Computation Schemes.",
            "Chomsky Hierarchy and Systolic Y-Tree Automata.",
            "Atomicity and Concurrency Control in Process Calculi.",
            "A Representation of Dependence Spaces and Some Basic Algorithms.",
            "A New Method of Circumscribing Beliefs: The Propositional Case.",
            "Asking Questions Versus Verifiability.",
            "On the Decidability of Non-Interleaving Process Equivalences.",
            "Some Undecidability Results for Finitely Generated Thue Congruences on aTwo-Letter Alphabet.",
            "Controlled H Systems and Chomsky Hierarchy.",
            "Tree Automata and Automated Model Building.",
            "On the Power of Compositional Proofs for Nets: Relationships Between Completeness and Modularity.",
            "A Representation of Processes of Petri Nets by Matrices.",
            "Deriving Invariants and Constraints from Action Theories.",
            "Directions and Foldings on Generalized Trees.",
            "Some Techniques of Reducing the Dangers of Combinatiorial Explosion in Automatic Knowledge Acquisition.",
            "On the Computational Complexity of Marcus Contextual Languages.",
            "On Generalized Ajdukiewicz and Lambek Calculi and Grammars.",
            "Pattern Ambiguities for Pure Context-Free Grammars.",
            "Double-Pushout Hypergraph Rewriting Using Total Conformisms.",
            "Improving Image Classification by Combining Statistical, Case-Based and Model Based Prediction Methods.",
            "Five Useful Properties of Probabilistic Knowledge Representations From the Point of View of Intelligent Systems.",
            "Classification of Unseen Examples Under Uncertainty.",
            "Formal Account of Sequential Decision-Making in a Co-Operative Setting.",
            "Seeking Knowledge in the Deluge of Facts.",
            "Knowledge Representation in Fuzzy and Rough Controllers.",
            "Query Approximate Answering System for an Incomplete DKBS.",
            "Transactional Workflows in Distributed Systems.",
            "Decision Algorithms: A Survey of Rough Set - Theoretic Methods.",
            "Reasoning and Facts Explanation in Valuation Based Systems.",
            "Machine Learning Through Data Classification and Reduction.",
            "Contigency Tables as the Foundation for Concepts, Concept Hierarchies and Rules: The 49er System Approach.",
            "Representation of Residuated Semigroups in Some Algebras of Relations (The Method of Canonical Models).",
            "Petri Nets, Commutative Context-Free Grammars, and Basic Parallel Processes.",
            "A New Version of the Rule Induction System LERS.",
            "On a Hierarchy of Slender Languages Based on Control Sets.",
            "On Learning Decision Structures.",
            "From Dissemilattices to Snack Algebras.",
            "Formal Verification and Diagnosis of CombinationalCircuit Designs with Propositional Logic.",
            "Extension Rule for Non-Clausal Propositional Calculus.",
            "Natural Computation for Natural Language.",
            "Partial Structural Synthesis of Programs.",
            "Bounds on Average Weighted Depth of Decision Trees.",
            "Unimprovable Upper Bounds on Time Complexity of Decision Trees.",
            "Controlled H Systems of Small Radius.",
            "An Abstract Approach to Some Loop Detection Problems.",
            "Rough Sets and 3-Valued Lukasiewicz Logic.",
            "Well-Founded Semantics for Default Logic.",
            "Defining BDI with Abstract Languages.",
            "The c-Semantics: A Comprehensive Semantics for Functional Programs.",
            "Modal Logics for Local and Global Similarity Relations.",
            "Processes in Cause-Effect Systems.",
            "A Partial Order Representation of Processes of Transforming Graphs.",
            "A Concurrent Functional Semantics for a Process Algebra Based on Action Systems.",
            "The Block Product of Categories and Tilson's Division.",
            "The Kernel of a Relational Morphism of Categories.",
            "Fork Algebras in Algebra, Logic and Computer Science.",
            "The Topos of Labelled Trees: A Categorical Semantics for SCCS.",
            "Lambda Abstraction Algebras: Coordinatizing Models of Lambda Calculus.",
            "Queries and Algorithms Computable by Polynomial Time Existential Reflective Machines.",
            "Substitutivity Principles in Some Theories of Uncertainty.",
            "Qualifying Answers According to User Needs and Preferences.",
            "Complexity of Recursive Normal Default Logic.",
            "Rough Set Approximations of Languages.",
            "Combining Closed World Assumptions with Stable Negation.",
            "Proposal for a Theory of Belief Revision Along the Lines of Lindström and Rabinowicz.",
            "A Convex Powerdomain over Lattices: Its Logic and lambda-Calculus.",
            "Bi-Models: Relational Versus Domain-Theoretic Approaches.",
            "Unification: Nothing but the Solution of a System of Linear Equations.",
            "Modal Tableaux with Propagation Rules and Structural Rules.",
            "Graded Consequence and Some Metalogical Notions Generalized.",
            "Transition-Optimal Token Distribution.",
            "An Axiomatization for Regular Processes in Times Branching Bisimulation.",
            "Decision Problems Concerning a Power Series Generalization of DTOL Systems.",
            "Disjunctive Signed Logic Programs.",
            "On Relation of Image Compression and Image Association.",
            "Jumping Petri Nets. Specific Properties."
        ]
    },
    {
        "name": "FUIN",
        "year": "1996",
        "info": "1996: Volumes\n25, 26, 27, 28",
        "count": 96,
        "papers": [
            "Equational Constructor Induction.",
            "On Grammar and Language Families.",
            "About a Polyhedron of Cubic Graphs.",
            "Syntactic Elements of Declarative Programming: Symbolic Linear Equations.",
            "Unification Modulo ACI + 1 + 0.",
            "On a Quantitative Notion of Uniformity.",
            "On a Notion of Concurrence.",
            "On Sets of Terms: A Study of a Generalisation Relation and of Its Algorithmic Properties.",
            "Cartesian Stream Transformer Compositon.",
            "A Note on the Grammatical Inference Problem for Even Linear Languages.",
            "Axiomatizations of Temporal Logics on Trace Systems.",
            "Comparative Analysis of Deterministic and Nondeterministic Decision Tree Complexity.",
            "Towards an Algebraic Theory of Context-Free Languages.",
            "A Note on Métivier's Construction of Asynchronous Automata for Triangulated Graphs.",
            "Dependence in Algebras.",
            "On a Power Series Generalization of ETOL Languages.",
            "Two Lower Bounds on Distributive Generation of Languages.",
            "On Computational Power of Weighted Finite Automata.",
            "(Un-)Decidability of Geometric Properties of Pictures Generated by Collage Grammars.",
            "Complexity and Structure in Formal Language Theory.",
            "Text Languages in an Algebraic Framework.",
            "Contextual Grammars: Parallelism and Blocking of Derivation.",
            "Two-Dimensional Finite State Recognizability.",
            "On Synchronization Languages.",
            "On i-v Fuzzy Subgroups.",
            "Synchronization in Petri Nets.",
            "Some Undecidability Results Concerning k-limited 0L Systems.",
            "A Universal Model for Non-Procedural Database Languages.",
            "Maximal Chains and Antichains in Strongly Noetherian Semiorders.",
            "On Natural Deduction in First-Ortder Fixpoint Logics.",
            "Undecidability of Language Equivalence for Generalized Regular Expressions.",
            "A Complete Axiomatization for Prefix Iteration in Branching Bisimulation.",
            "Recursive Models of General Inductive Types.",
            "A Note on the Smyth Powerdomain Construction.",
            "Rank 2 Intersection Type Assignment in Term Rewriting Systems.",
            "McCarthy Algebras: A Model of McCarthy's Logical Calculus.",
            "Equational Term Graph Rewriting.",
            "Graph Processes.",
            "A Lower Bound on the Growth of Functions Computed by Tree Transducers.",
            "Graph Grammars with Negative Application Conditions.",
            "Abstract Semantics for ESM Systems.",
            "Probabilistic Graph Grammars.",
            "Logic Based Programmed Structure Rewriting Systems.",
            "Towards Synchronous and Asynchronous Graph Transformations.",
            "Defining Operational Behavior of Object Specifications by Attributed Graph Transformations.",
            "Expanding Graph Relabeling Systems have the Power of Recursive Enumerability.",
            "Parallel Word Substitution.",
            "Processes with Multiple Entries and Exits Modulo Isomorphism and Modulo Bisimulation.",
            "An Algebraic Formalization of the Relationship between Evidential Structures and Data Tables.",
            "Syntactic and Semantic Dependence of Array-Arithmetic Sentences, with an Application to Program Verification.",
            "Rough Sets, Rough Relations and Rough Functions.",
            "Formal Conception of Rough Sets.",
            "First-Order Rough Logic I: Approximate Reasoning via Rough Sets.",
            "Variable Precision Extension of Rough Sets.",
            "Rough Concept Analysis: A Synthesis of Rough Sets and Formal Concept Analysis.",
            "Computation of Reducts of Composed Information Systems.",
            "Some Bounds on Minimal Decision Tree Depth.",
            "Rough Sets and Nelson Algebras.",
            "A Note on Categories of Information Systems.",
            "Rough-Set Reasoning about Uncertain Data.",
            "Tolerance Approximation Spaces.",
            "Analytical Morphology: Mathematical Morphology of Decision Tables.",
            "A Common Algebraic Framework of Empirical Learning Methods Based on Rough Sets and Matroid Theory.",
            "Comparison of Rough-Set and Interval-Set Models for Uncertain Reasoning.",
            "Automated Discovery of Empirical Laws.",
            "Categorisation of Computable Data-Base Queries.",
            "On Four Partial Ordering Semantics for a Process Calculus.",
            "Abductive Change Operators.",
            "(0,1)-Totality is Undecidable for Arbitrary Context-Free Grammars.",
            "Belief Revision in Non-Monotonic Reasoning and Logic Programming.",
            "Meta-Variables in Logic Programming, or in Praise of Ambivalent Syntax.",
            "Designing Dependencies.",
            "Why Denotational? Remarks on Applied Denotational Semantics.",
            "Reducing Disjunctive to Non-Disjunctive Semantics by Shift-Operations.",
            "A Modal Herbrand Theorem.",
            "Approximating the Stable Model Semantics is Hard.",
            "Automating Algebraic Proofs in Algebraic Logic.",
            "The Algebraic Specifications do not Have the Tennenbaum Property.",
            "Logic Programming from the Perspective of Algebraic Semantics.",
            "Satisfiability of Inequalities in a Poset.",
            "On the Power of Compositional Proofs for Nets: Relationships Between Completeness and Modularity.",
            "Positive Recursive Type Assignment.",
            "Rough Sets Through Algebraic Logic.",
            "On a Logical Basis of Normal Logic Program.",
            "A Method in Linguistic Reasoning on a Knowledge Base Representing by Sentences with Linguistic Belief Degree.",
            "A Reduction Result for Circumscribed Semi-Horn Formulas.",
            "A Rough Set Model of Information Retrieval.",
            "Short Proofs for Nondivisibility of Sparse Polynomials under the Extended Riemann.",
            "On Semantics for the Nonmonotonic Modal Formalization of the Logic of Acceptance and Rejection.",
            "Parallel Communicating Grammar Systems with Negotiation.",
            "Argumentation Systems.",
            "Dynamic Behaviour of Spatial Signal OR-Graphs.",
            "Discovery of Concurrent Data Models from Experimental Tables: A Rough Set Approach.",
            "A Two-Stage Approach to First Order Default Reasoning.",
            "Concatenable Weighted Pomsets and Their Applications to Modelling Processes of Petri Nets.",
            "Theoretical Foundations of Order-Based Genetic Algorithms."
        ]
    },
    {
        "name": "FUIN",
        "year": "1995",
        "info": "1995: Volumes\n22, 23, 24",
        "count": 52,
        "papers": [
            "Linear Logic, Comonads and Optimal Reduction.",
            "All Compact Hausdorff Lambda Models are Degenerate.",
            "Cut Elimination for Classical Bilinear Logic.",
            "Parametric and Type-Dependent Polymorphism.",
            "Adjunctions Between Categories of Domains.",
            "A Semantics for Evaluation Logic.",
            "Categorical Combinations with Explicit Products.",
            "An Algebra of Dataflow Networks.",
            "Fix-point Semantics for Programs in Distributive Categories.",
            "About the Depth of Decision Trees Computing Boolean Functions.",
            "On the Generative Capacity of Certain Classes of Cooperating Grammar Systems.",
            "A Classification Theory of Semantics of Normal Logic Programs: I. Strong Properties.",
            "A Classification Theory of Semantics of Normal Logic Programs: II. Weak Properties.",
            "On the Complexity of Generation of Rational Numbers by Boolean Functions.",
            "Fairness and Priority.",
            "A Deterministic Linear Time Algorithm for Geometric Separators and its Applications.",
            "Convex Distance Functions in 3-Space are Different.",
            "Tentative Prune-and-Search for Computing Fixed-Points with Applications to Geometric Computation.",
            "Compatible Tetrahedralizations.",
            "Long Non-Crossing Configurations in the Plane.",
            "Grammatical Codes of Trees and Terminally Coded Grammars.",
            "A Default Logic Based on Epistemic States.",
            "Learning via Queries with Teams and Anomalies.",
            "Reachability in Some Classes of Acyclic Petri Nets.",
            "Relational Algebra and Equational Proofs.",
            "Approximate Inference in Default Logic and Circumscription.",
            "Papers on Context: Theory and Practice.",
            "A Formalization of Viewpoints.",
            "An Approach to Context-Based Default Reasoning.",
            "Context Hypothesization Using Probabilistic Knowledge.",
            "Reasoning about Theory Adequacy. A New Solution to the Qualification Problem.",
            "Metamathematics of Contexts.",
            "Managing Multiple Knowledge Sources in Constraint-Based Parsing of Spoken Language.",
            "Context Shifts and Clashes in Dialogues: An Active Logic Perspective.",
            "Formal Real-Time Imagination.",
            "Abstract Relations between Restricted Termination and Confluence Properties of Rewrite Systems.",
            "On the Diversity of Orderings on Strings.",
            "Simplification Orderings: Histrory of Results.",
            "Termination of Term Rewriting by Semantic Labelling.",
            "Contextual Rewriting in Automated Reasoning.",
            "Narrowing Strategies for Arbitrary Canonical Rewrite Systems.",
            "Regular Tree Languages and Rewrite Systems.",
            "The Clause-Diffusion Methodology for Distributed Deduction.",
            "Parameters and Parametrization in Specification, Using Distributive Categories.",
            "Similarity in Grammar Systems.",
            "Lower Bag Domains.",
            "Rational Processes and Linear Systems in CSP.",
            "On the Family of Conditional Implicational Dependencies.",
            "Axiomatizations of Interval Logics.",
            "Performance Evaluation of Systems Defined in Specification Language.",
            "On the Satisfiability Problem for Lamport's Propositional Temporal Logic of Actions and Some of Its Extensions.",
            "A New Incompleteness Result in Kripke Semantics."
        ]
    },
    {
        "name": "FUIN",
        "year": "1994",
        "info": "1994: Volumes\n20, 21",
        "count": 36,
        "papers": [
            "Bisimulation Semantics for Concurrency with Atomicity and Action Refinement.",
            "Reasoned Assumptions and Rational Psychology.",
            "Square Systems.",
            "Kleene's Three Valued Logics and Their Children.",
            "Reductions for Primitive 2-Structures.",
            "Semantics for Disjunctive Logic Programs with Explicit and Default Negation.",
            "Combining CCS and Petri Nets Via Structural Axioms.",
            "Compositional Proofs for Networks of Processes.",
            "A Note on Asymptotic Probabilities of Existential Second-Order Minimal Classes - the Last Step.",
            "Top-down Parsing with Simultaneous Evaluation of Noncircular Attribute Grammars.",
            "Distributive Evaluations of lambda-calculus.",
            "On Skolemization and Proof Complexity.",
            "On the Characterization of Input Sets as Output Sets.",
            "Introduction to the Special Issue.",
            "What is a Nonmonotonic Consequence Relation?",
            "A Critical Examination of Model Preference Defaults.",
            "Possible Worlds Semantics for Default Logics.",
            "Stationary Default Extensions.",
            "A Modal Logic for Hypothesis Theory.",
            "Approximate Inference in Default Logic and Circumscription.",
            "Circumscription and Generic Mathematical Objects.",
            "Defeasible Deontic Reasoning.",
            "What Defaults can do that Hierarchies Can't.",
            "Guest Editors' Preface - Selected Papers from the ISMIS'93 Symposium.",
            "Expressing Program Requirements Using Refinement Lattices.",
            "Modifying Intensional Logic Knowledge.",
            "The Logic of Only Knowing as a Unified Framework for Non-Monotonic Reasoning.",
            "Model Finding in Semantically Guided Instance-Based Theorem Proving.",
            "Adapting Classical Inference Techniques to Multiple-Valued Logics Using Signed Formulas.",
            "Completeness and Soundness of Axiomatizations for Temporal Logics. Without Next.",
            "Varying Selection Functions to Relate Conditional Logics and Preferential Models.",
            "Rough Relation Algebras.",
            "The Complexity of Local Stratification.",
            "Expressibility of the Semantics of Sequential Programs in First-Order Logic.",
            "Representable Tree Series.",
            "Optimization Problems for Decision Trees."
        ]
    },
    {
        "name": "FUIN",
        "year": "1993",
        "info": "1993: Volumes\n18, 19",
        "count": 38,
        "papers": [
            "From Concept Lattices to Approximation Spaces: Algebraic Structures of Some Spaces of Partial Objects.",
            "Generalized Derivatives.",
            "A Prolegomenon to Partial Deduction.",
            "Logical Characterizations of Bounded Query Classes I: Logspace Oracle Machines.",
            "Logical Characterizations of Bounded Query Classes II: Polynomial-Time Oracle Machines.",
            "Tableaux Versus Resolution a Comparison.",
            "Default Logic Models of Certain Inheritance Systems with Exceptions.",
            "Ulam Games, Lukasiewicz Logic, and AF C*-Algebras.",
            "Deciding Clause Classes by Semantic Clash Resolution.",
            "Spatial Mental Models in Cognitive Systems.",
            "Selected Algorithms of Machine Learning from Examples.",
            "Application of a Rough Set-Based Inductive Learning System.",
            "Learning Relations: An Evaluation of Search Strategies.",
            "Some Recent Developments in the Representation and Processing of Knowledge.",
            "Recognizable and Rational Subsets of Algebras.",
            "An Abstract Strategy for Transforming Logic Programs.",
            "Definability of Arithmetic Operations from the Order and a Random Relation.",
            "Logic and Artificial Intelligence: A New Synthesis?",
            "Modal Frame Classes Revisited.",
            "On the Algebraization of Some Gentzen Systems.",
            "Initial and Quasiinitial Models of Theories.",
            "Conservativity of Equational Theories in Typed Lambda Calculi.",
            "Substitution up to Isomorphism.",
            "Type Inference: Some Results, Some Problems.",
            "Type Inference with Extended Pattern Matching and Subtypes.",
            "Lambda Calculus Characterizations of Poly-Time.",
            "On the Undecidability of Partial Polymorphic Type Reconstruction.",
            "Primitive Recursion with Extential Types.",
            "On a Framework for Logic Programming with Incomplete Information.",
            "Dependencies in Relaional Databases Algebraic and Logical Approch.",
            "Retrieval System and Dynamic Algorithm Looking for Axioms of Notions Defined by Programs.",
            "A Fully Precise Null Extended Nested Relational Algebra.",
            "On Dependence in Wille's Contexts.",
            "Deletion Sets.",
            "Undecidable Fragments of Term Algebras with Subterm Relation.",
            "The Syntax of Parallelism.",
            "Time and Duration in Nininterleaving Concurrency.",
            "The Set of Probabilistic Algorithmic Formulas Valid in a Finite Structure is Decidable with Respect to Its Diagram."
        ]
    },
    {
        "name": "FUIN",
        "year": "1992",
        "info": "1992: Volumes\n16, 17",
        "count": 36,
        "papers": [
            "A semantic approach to fairness.",
            "On the compactness theorem of propositional temporal logics.",
            "On consistency and completeness of autoepistemic theories.",
            "On the generative capacity of context-free matrix grammars over one-letter alphabet.",
            "Partial higher-order specifications.",
            "Towards a categorical semantics of type classes.",
            "Operational, denotational and logical descriptions: a case study.",
            "Dynamic congruence vs. progressing bisimulation for CCS.",
            "Operational and denotational semantics with explicit concurrency.",
            "A modal semantics of negation in logic programming.",
            "Notes on the algebraic approach to dependence in information systems.",
            "On a problem concerning dependence spaces.",
            "A hierarchy of system descriptions via atomic linear refinement.",
            "Further remarks on reduced languages.",
            "A representation of partial Boolean algebras.",
            "Learning programs with an easy to calculate set of errors.",
            "Logic for information systems.",
            "Inductive modal logics.",
            "Epistemic Entrenchment in autoepistemic logic.",
            "Reasoning with parsimonious and moderately grounded expansions.",
            "Many-Valued Model Logics II.",
            "On perfect introspection with Quantifying-in.",
            "More on modal aspects of default logic.",
            "On the decidability and complexity of autoepistemic reasoning.",
            "Reflexive Autoepistemic logic.",
            "Algebraic considerations of autoepistemic logic.",
            "Quality criteria for partial order semantics of place/transition-nets with capacities.",
            "On some equivalence relations for probabilistic processes.",
            "Approximate learning with multiple machines.",
            "- Representability of integer, word and tree functions.",
            "An automata-theoretic decision procedure for propositional temporal logic with since and until.",
            "Logic as programming.",
            "History preserving, causal and mixed-ordering equivalence over stable event structures.",
            "A qualitative theory of uncertainty.",
            "On Grammatical inference and derivational complexity of context grammars.",
            "Relating distributed, temporal and causal observations of simple processes."
        ]
    },
    {
        "name": "FUIN",
        "year": "1991",
        "info": "1991: Volumes\n14, 15",
        "count": 50,
        "papers": [
            "Vector controlled concurrent systems, part II: comparisons.",
            "Modelling nondeterministic concurrent processes with event structures.",
            "On uniqueness of the Wulff shape for cellular automata.",
            "Applications of finite models properties in approximation and algorithmic logics.",
            "A compositional semantics for unmarked predicate/transition nets.",
            "Minimization of resolution proof systems.",
            "Unified theory of database serializability.",
            "A uniform test approach for RCC-adders.",
            "About semantic action refinement.",
            "Axiom system induced by CTL* Logic.",
            "A hierarchy of context-free derivations.",
            "Temporal logic and recursion.",
            "A note on PF(k) - parsable languages.",
            "Diamond properties of elementary net systems.",
            "On processing of fuzzy production systems.",
            "On generalized automata.",
            "Models of Clark's completion for some classes of logic programs.",
            "Arithmetic classification of perfect models of stratified programs.",
            "Embedding a default system into nonmonotonic logics.",
            "Modal nonmonotonic logic with restricted application of the negation as failure to prove rule.",
            "Closed sets of Boolean terms in relational databases.",
            "Three-valued predicates for software specification and validation.",
            "A three-valued logic for software specification and validation.",
            "Algebraic theory of independence in information systems.",
            "An axiomatic characterization of a class of Petri Nets.",
            "An algebraic approach to the approximation of information.",
            "Reducts in information systems.",
            "Deterministic concurrent systems.",
            "Jungle evaluation.",
            "A model logic for similarity relations in pawlak knowledge representation systems.",
            "Interpolation in conditional equational logic.",
            "On pure context-free language and left szilard languages.",
            "On the power of two-dimensional synchronized alternating finite automata.",
            "A problem on easy terms in Calculus.",
            "An analytic semantics of CSP.",
            "Relationship chase procedures interpreted as resolution with paramodulation.",
            "Cellular automata on tress, a model for parallel computation.",
            "Application of learning theorems.",
            "Algebraic considerations of autoepistemic logic.",
            "A functionalization of logical kits.",
            "Towards an approximation theory of discrete problems, Part I.",
            "Timed possibilistic logic.",
            "Many-valued modal logics.",
            "Monotonic and non-monotonic logics of knowledge.",
            "Quantification in autoepistemic logic.",
            "Conditionals and artificial intelligence.",
            "Reasoning about ignorance: a note on the Bush-Gorbachev problem.",
            "A syntactic approach to introspection and reasoning about the beliefs of other agents.",
            "Practical tools for reasoning about linear constraints.",
            "Query processing in distributed information systems."
        ]
    },
    {
        "name": "FUIN",
        "year": "1981",
        "info": "1981: Volume 4",
        "count": 40,
        "papers": [
            "Computational formalism: abstract combinatory view-point and related first order logical framework.",
            "Multiple regularity and binary ETOL-systems.",
            "On the semantics of parallel programs.",
            "Lattice theoretic ordering properties for NP-complete optimization problems.",
            "On the synchronizing tools for parallel programs.",
            "On subregular OL forms.",
            "A logically justified model of computation I.",
            "On universal binary search trees.",
            "On eliminating the lambda-rules from simple matrix grammars.",
            "A hierarchy of ETOL languages with rank.",
            "On the compilation of parallel programs.",
            "Global syntax and semantics for recursively enumerable languages.",
            "Implementation and propertives of certain tools for parallel computations.",
            "A logically justified model of computation II.",
            "APC: the algorithmic predicate calculus.",
            "On a variant of a method of Berstel's and Nielsen's.",
            "On the amount of non-determinism in pushdown in pushdown automata.",
            "Algorithmic aspects of the attribute set minimization problem.",
            "On partial languages.",
            "Generalized inverse of a finite graph.",
            "A remark on the syntactic partition.",
            "The arbiter: an active system component for implementing synchronizing primitives.",
            "A classification and closure properties of languages for describing concurrent system behaviours.",
            "Information retrieval systems, an algebraic approach I.",
            "A Criterion of Undecidability of Algorithmic Theories.",
            "Logic of effective definitions.",
            "Logic of effective definitions.",
            "PAL - propositional algorithmic logic.",
            "A survey of normal form covers for regular grammars.",
            "Information retrieval systems, an algebraic approach II.",
            "Algorithmic triviality of abstract structures.",
            "Algorithmic degrees of algebraic structures.",
            "Nonhomogeneous stochastic automata.",
            "A second-order dynamic logic with array assignments.",
            "On the quantifier-free fragment of 'Logic of effective definitions'.",
            "Word problem in distributed magmas.",
            "Algorithmic logic with recursive functions.",
            "Regular extensions of iterative algebras and metric interpretations.",
            "Automata in random environments.",
            "On sequents defined by means of information systems."
        ]
    },
    {
        "name": "FUIN",
        "year": "1980",
        "info": "1980: Volume 3",
        "count": 31,
        "papers": [
            "On probabilistic automata in deterministic environment.",
            "On metalinear ETOL systems.",
            "Functional Automata.",
            "Algorithmic logic with nondeterministic programs.",
            "Some remarks on deterministic Mazurkiewicz algorithms and languages associated with them.",
            "A theorem on the characteristics of nonsequential processes.",
            "Non-generable formal languages.",
            "Completions of ordered magmas.",
            "On stability of probabilistic automata in environments.",
            "A note on the intersection of context-free languages.",
            "Simple EOL forms under uniform interpretation generating CF languages.",
            "Model existence theorems in algorithmic logic with non-deterministic programs.",
            "Axioms for multilevel objects.",
            "Complexity of index sets and translating functions.",
            "General theory of relational automata.",
            "Resolution problem and their applications I.",
            "HAS-Hierarchy: A natural tool for language specification.",
            "A note on M-growth functions of FTOL systems with rank.",
            "Conjugated measures of computational complexity.",
            "On the algorithmic theory of stacks.",
            "Resolution systems and their applications II.",
            "Incomplete Information in a Relational Database.",
            "An algorithm of finding an acyclic f-graph for a family od sets.",
            "NP-completeness of combinatorial problems with unary notation for integers.",
            "Tree-codifications and convolutional codes.",
            "Programs as term transformers.",
            "Sets generated by stochastic automata of Markov's chain type.",
            "The metric space of infinite trees. Algebraic and topological properties.",
            "Continously generated fixed points in Pomega.",
            "On intersections of context-free languages.",
            "Decision problems in generalized vector addition systems."
        ]
    }
]