[
    {
        "year": "2021",
        "name": "24th HSCC 2021",
        "info": "Nashville, TN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2021",
                "sub_name": "HSCC '21: 24th ACM International Conference on Hybrid Systems: Computation and Control, Nashville, Tennessee, May 19-21, 2021.",
                "count": 35,
                "papers": [
                    "Topological entropy of switched nonlinear systems.",
                    "Synthesis of hybrid automata with affine dynamics from time-series data.",
                    "Switching controller synthesis for delay hybrid systems under perturbations.",
                    "Compositional safety rules for inter-triggering hybrid automata.",
                    "The computability of LQR and LQG control.",
                    "Strategy synthesis for partially-known switched stochastic systems.",
                    "Approximate optimal hybrid control synthesis by classification-based derivative-free optimization.",
                    "Optimal mixed discrete-continuous planning for linear hybrid systems.",
                    "From post-conditions to post-region invariants: deductive verification of hybrid objects.",
                    "A program logic to verify signal temporal logic specifications of hybrid systems.",
                    "Verification and runtime assurance for dynamical systems with uncertainty.",
                    "Model-based reinforcement learning for approximate optimal control with temporal logic specifications.",
                    "Learning lyapunov functions for hybrid systems.",
                    "Verifiably safe exploration for end-to-end reinforcement learning.",
                    "On the decidability of reachability in continuous time linear time-invariant systems.",
                    "Adaptive parameter tuning for reachability analysis of nonlinear systems.",
                    "Synthesizing ReLU neural networks with two hidden layers as barrier certificates for hybrid systems.",
                    "Reachability analysis of deep ReLU neural networks using facet-vertex incidence.",
                    "Stability analysis of complementarity systems with neural network controllers.",
                    "Computing the sampling performance of event-triggered control.",
                    "Quantizer design for switched linear systems with minimal data-rate.",
                    "Path-dependent controller and estimator synthesis with robustness to delayed and missing data.",
                    "AROC: a toolbox for automated reachset optimal controller synthesis.",
                    "FOSSIL: a software tool for the formal synthesis of lyapunov functions and barrier certificates using neural networks.",
                    "OmegaThreads: symbolic controller design for ω-regular objectives.",
                    "Hybrid modeling and predictive control of large-scale crowd movement in road network.",
                    "A few lessons learned in reinforcement learning for quadcopter attitude control.",
                    "Estimating infinitesimal generators of stochastic systems with formal error bounds: a data-driven approach.",
                    "Formal safety verification of unknown continuous-time systems: a data-driven approach.",
                    "Interval observer design of dynamical systems with neural networks.",
                    "Epidemic overdispersion strengthens the effectiveness of mobility restrictions.",
                    "Adaptive strategies for rLTL games.",
                    "OmegaThreads: symbolic controller design for ω-regular objectives.",
                    "Filtering over networks with random communication.",
                    "On-the-fly, data-driven reachability analysis and control of unknown systems: an F-16 aircraft case study."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd HSCC 2020",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2020",
                "sub_name": "HSCC '20: 23rd ACM International Conference on Hybrid Systems: Computation and Control, Sydney, New South Wales, Australia, April 21-24, 2020.",
                "count": 33,
                "papers": [
                    "Utilizing dependencies to obtain subsets of reachable sets.",
                    "Reachability analysis for hybrid systems with nonlinear guard sets.",
                    "Dynamics-aware subspace identification for decomposed aggregation in the reachability analysis of hybrid automata.",
                    "Worst-case topological entropy and minimal data rate for state observation of switched linear systems.",
                    "Piece-wise analytic trajectory computation for polytopic switching between stable affine systems.",
                    "AReN: assured ReLU NN architecture for model predictive control of LTI systems.",
                    "From LTL to rLTL monitoring: improved monitorability through robust semantics.",
                    "Sufficient conditions for satisfaction of formulas with until operators in hybrid systems.",
                    "Interpretable classification of time-series data using efficient enumerative techniques.",
                    "Classic and non-prophetic model checking for hybrid Petri nets with stochastic firings.",
                    "Falsification of cyber-physical systems with robustness-guided black-box checking.",
                    "Statistical verification of learning-based cyber-physical systems.",
                    "Conformance verification for neural network models of glucose-insulin dynamics.",
                    "Symbolic controller synthesis for Büchi specifications on stochastic systems.",
                    "On abstraction-based controller design with output feedback.",
                    "Compositional synthesis via a convex parameterization of assume-guarantee contracts.",
                    "dtControl: decision tree learning algorithms for controller representation.",
                    "A computable and compositional semantics for hybrid automata.",
                    "Does sample-time emulation preserve exponential stability?",
                    "Implicit structural analysis of multimode DAE systems.",
                    "Local lipschitzness of reachability maps for hybrid systems with applications to safety.",
                    "Compositional construction of control barrier functions for interconnected control systems.",
                    "A simple hierarchy for computing controlled invariant sets.",
                    "Robust output feedback control with guaranteed constraint satisfaction.",
                    "Synthesizing barrier certificates using neural networks.",
                    "A deontic logic analysis of autonomous systems' safety.",
                    "Formal verification of braking while swerving in automobiles.",
                    "Case study: verifying the safety of an autonomous racing car with a neural network controller.",
                    "Convergence of ant colony multi-agent swarms.",
                    "dtControl: decision tree learning algorithms for controller representation.",
                    "AMYTISS: a parallelized tool on automated controller synthesis for large-scale stochastic systems.",
                    "Inter-triggering hybrid automata: a formalism for responsibility-sensitive safety.",
                    "Resilient abstraction-based controller design."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd HSCC 2019",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2019",
                "sub_name": "Proceedings of the 22nd ACM International Conference on Hybrid Systems: Computation and Control, HSCC 2019, Montreal, QC, Canada, April 16-18, 2019.",
                "count": 41,
                "papers": [
                    "Falsification of hybrid systems using symbolic reachability and trajectory splicing.",
                    "Inner and outer reachability for the verification of control systems.",
                    "Numerical verification of affine systems with up to a billion dimensions.",
                    "SReachTools: a MATLAB stochastic reachability toolbox.",
                    "JuliaReach: a toolbox for set-based reachability.",
                    "Temporal logic robustness for general signal classes.",
                    "Interface-aware signal temporal logic.",
                    "Revisiting timed logics with automata modalities.",
                    "On the decidability of reachability in linear time-invariant systems.",
                    "On the decidability of linear bounded periodic cyber-physical systems.",
                    "Facetal abstraction for non-linear dynamical systems based on δ-decidable SMT.",
                    "Characterizations of safety in hybrid inclusions via barrier functions.",
                    "On topological entropy and stability of switched linear systems.",
                    "Robust invariant sets generation for state-constrained perturbed polynomial systems.",
                    "A complete characterization of the ordering of path-complete methods.",
                    "Formal verification of neural network controlled autonomous systems.",
                    "Reachability analysis for neural feedback systems using regressive polynomial rule inference.",
                    "Verisig: verifying safety properties of hybrid systems with neural network controllers.",
                    "Gray-box adversarial testing for control systems with machine learning components.",
                    "A new simulation metric to determine safe environments and controllers for systems with unknown dynamics.",
                    "Formal verification of weakly-hard systems.",
                    "Verification and synthesis of interconnected embedded control systems under timing contracts.",
                    "Evrostos: the rLTL verifier.",
                    "TIRA: toolbox for interval reachability analysis.",
                    "Mixed-integer formulations for optimal control of piecewise-affine systems.",
                    "Efficiency through uncertainty: scalable formal synthesis for stochastic hybrid systems.",
                    "pFaces: an acceleration ecosystem for symbolic control.",
                    "StocHy - automated verification and synthesis of stochastic processes: poster abstract.",
                    "Formal methods for computing hyperbolic invariant sets for nonlinear systems: poster abstract.",
                    "Sherlock - A tool for verification of neural network feedback systems: demo abstract.",
                    "SReachTools: A MATLAB stochastic reachability toolbox: demo abstract.",
                    "Predictive monitoring for signal temporal logic with probabilistic guarantees: poster abstract.",
                    "Invariant, viability and discriminating kernel under-approximation via zonotope scaling: poster abstract.",
                    "Structured reward functions using STL: poster abstract.",
                    "Moore-machine filtering for timed and untimed pattern matching: poster abstract.",
                    "Encrypted control system with quantizer: poster abstract.",
                    "Equalized recovery: Weakening invariance for control and estimation: poster abstract.",
                    "Combining LTL monitoring with model invalidation for improved fault detectability analysis for hybrid systems: poster abstract.",
                    "Safety control with preview automaton: poster abstract.",
                    "Poster on safety characterization in hybrid inclusions using barrier functions.",
                    "Relational differential dynamic logic: poster abstract."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st HSCC 2018",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2018",
                "sub_name": "Proceedings of the 21st International Conference on Hybrid Systems: Computation and Control (part of CPS Week), HSCC 2018, Porto, Portugal, April 11-13, 2018.",
                "count": 40,
                "papers": [
                    "Scalable Underapproximative Verification of Stochastic LTI Systems using Convexity and Compactness.",
                    "Global Almost-Sure Reachability in Stochastic Constant-Rate Multi-Mode Systems.",
                    "From Dissipativity Theory to Compositional Construction of Finite Markov Decision Processes.",
                    "Bisimulations, logics, and trace distributions for stochastic systems with rewards.",
                    "Reach Set Approximation through Decomposition with Low-dimensional Sets and High-dimensional Matrices.",
                    "Under-Approximating Reach Sets for Polynomial Continuous Systems.",
                    "Accurate reachability analysis of uncertain nonlinear systems.",
                    "Clock Allocation in Timed Automata and Graph Colouring.",
                    "Model Checking Bounded Continuous-time Extended Linear Duration Invariants.",
                    "A New Perspective on Quality Evaluation for Control Systems with Stochastic Timing.",
                    "Stabilizing switched nonlinear systems under restricted switching.",
                    "Lyapunov Design for Event-Triggered Exponential Stabilization.",
                    "Multi-Layered Abstraction-Based Controller Synthesis for Continuous-Time Systems.",
                    "ROCS: A Robustly Complete Control Synthesis Tool for Nonlinear Dynamical Systems.",
                    "Compositional Synthesis for Symbolic Control.",
                    "Constructing Control System Abstractions from Modular Components.",
                    "Formal Guarantees in Data-Driven Model Identification and Control Synthesis.",
                    "From Uncertainty Data to Robust Policies for Temporal Logic Planning.",
                    "Specifying Timed Patterns using Temporal Logic.",
                    "Efficient Parametric Identification for STL.",
                    "Parameter Invariant Monitoring for Signal Temporal Logic.",
                    "Localizing Faults in Simulink/Stateflow Models with STL.",
                    "Algorithms for exact and approximate linear abstractions of polynomial continuous systems.",
                    "State Estimation of Dynamical Systems with Unknown Inputs: Entropy and Bit Rates.",
                    "Improving validated computation of Viability Kernels.",
                    "Modeling the Impact of Vehicle Platooning on Highway Congestion: A Fluid Queuing Approach.",
                    "Graphical Modeling of Hybrid Dynamics with Simulink and Stateflow.",
                    "DSValidator: An Automated Counterexample Reproducibility Tool for Digital Systems.",
                    "Averist: Algorithmic Verifier for Stability of Linear Hybrid Systems.",
                    "ROCS: A Robustly Complete Control Synthesis Tool for Nonlinear Dynamical Systems.",
                    "Graphical Hybrid Automata with Simulink and Stateflow.",
                    "DryVR 2.0: A tool for verification and controller synthesis of black-box cyber-physical systems.",
                    "Formal Controller Synthesis from Hybrid Programs.",
                    "Compositional Synthesis of Interconnected Stochastic Control Systems based on Finite MDPs.",
                    "Compositional Synthesis of Finite Abstractions for Networks of Systems: A Dissipativity Approach.",
                    "Contract based Design of Symbolic Controllers for Vehicle Platooning.",
                    "Recent Results in State Estimation of Dynamical Systems with Inputs under Bandwidth Constraints.",
                    "CODEV: Automated Model Predictive Control Design and Formal Verification.",
                    "Sim-ATAV: Simulation-Based Adversarial Testing Framework for Autonomous Vehicles.",
                    "Major Computational Breakthroughs in the Synthesis of Symbolic Controllers via Decomposed Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20. HSCC 2017",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2017",
                "sub_name": "Proceedings of the 20th International Conference on Hybrid Systems: Computation and Control, HSCC 2017, Pittsburgh, PA, USA, April 18-20, 2017.",
                "count": 30,
                "papers": [
                    "Forward Inner-Approximated Reachability of Non-Linear Continuous Systems.",
                    "On the Polytope Escape Problem for Continuous Linear Dynamical Systems.",
                    "SMC: Satisfiability Modulo Convex Optimization.",
                    "Sapo: Reachability Computation and Parameter Synthesis of Polynomial Dynamical Systems.",
                    "Forward Stochastic Reachability Analysis for Uncontrolled Linear Systems using Fourier Transforms.",
                    "Controller Synthesis for Reward Collecting Markov Processes in Continuous Space.",
                    "Reachability Computation for Switching Diffusions: Finite Abstractions with Certifiable and Tuneable Precision.",
                    "Statistical Verification of the Toyota Powertrain Control Verification Benchmark.",
                    "Optimal Data Rate for State Estimation of Switched Nonlinear Systems.",
                    "Path-Complete Graphs and Common Lyapunov Functions.",
                    "Invariance Feedback Entropy of Nondeterministic Control Systems.",
                    "Robust Abstractions for Control Synthesis: Completeness via Robustness for Linear-Time Properties.",
                    "Formal Synthesis of Stabilizing Controllers for Switched Systems.",
                    "Convex Interpolation Control with Formal Guarantees for Disturbed and Constrained Nonlinear Systems.",
                    "Scheduling of Embedded Controllers Under Timing Contracts.",
                    "Convex and Combinatorial Optimization for Dynamic Robots in the Real World.",
                    "Coupling Policy Iterations with Piecewise Quadratic Lyapunov Functions.",
                    "Robust Model Checking of Timed Automata under Clock Drifts.",
                    "Safety Verification of Nonlinear Hybrid Systems Based on Invariant Clusters.",
                    "HyLAA: A Tool for Computing Simulation-Equivalent Reachability for Linear Systems.",
                    "Dynamic Periodic Event-Triggered Control for Linear Systems.",
                    "On a Class of Maximal Invariance Inducing Control Strategies for Large Collections of Switched Systems.",
                    "Sound and Automated Synthesis of Digital Stabilizing Controllers for Continuous Plants.",
                    "A Small Gain Theorem for Parametric Assume-Guarantee Contracts.",
                    "Relaxed Decidability and the Robust Semantics of Metric Temporal Logic.",
                    "Sampling-based Approximate Optimal Control Under Temporal Logic Constraints.",
                    "Abnormal Data Classification Using Time-Frequency Temporal Logic.",
                    "Piecewise - Differentiable Trajectory Outcomes in Mechanical Systems Subject to Unilateral Constraints.",
                    "Structural Analysis of Multi-Mode DAE Systems.",
                    "Bipedal Robotic Running with DURUS-2D: Bridging the Gap between Theory and Experiment."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19. HSCC 2016",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2016",
                "sub_name": "Proceedings of the 19th International Conference on Hybrid Systems: Computation and Control, HSCC 2016, Vienna, Austria, April 12-14, 2016.",
                "count": 33,
                "papers": [
                    "A Decision Tree Approach to Data Classification using Signal Temporal Logic.",
                    "Temporal Logic as Filtering.",
                    "Directed Specifications and Assumption Mining for Monotone Dynamical Systems.",
                    "Diagnosis and Repair for Synthesis from Signal Temporal Logic Specifications.",
                    "Computing the Domain of Attraction of Switching Systems Subject to Non-Convex Constraints.",
                    "Generating Unstable Trajectories for Switched Systems via Dual Sum-Of-Squares Techniques.",
                    "A Topological Method for Finding Invariant Sets of Switched Systems.",
                    "Hybridization for Stability Analysis of Switched Linear Systems.",
                    "Case Studies in Data-Driven Verification of Dynamical Systems.",
                    "Towards Model Checking of Implantable Cardioverter Defibrillators.",
                    "SL2SX Translator: From Simulink to SpaceEx Models.",
                    "SCOTS: A Tool for the Synthesis of Symbolic Controllers.",
                    "Safety Analysis of Automotive Control Systems Using Multi-Modal Port-Hamiltonian Systems.",
                    "Verification and Synthesis of Timing Contracts for Embedded Controllers.",
                    "Formal Analysis of Robustness at Model and Code Level.",
                    "Symbolic-Numeric Reachability Analysis of Closed-Loop Control Software.",
                    "SMT-Based Analysis of Virtually Synchronous Distributed Hybrid Systems.",
                    "Scalable Static Hybridization Methods for Analysis of Nonlinear Systems.",
                    "Adaptive Decentralized MAC for Event-Triggered Networked Control Systems.",
                    "Event-Separation Properties and Asymptotic Behaviour of Hybrid Event-Based Control Systems.",
                    "Semi-autonomous Intersection Collision Avoidance through Job-shop Scheduling.",
                    "Building Power Consumption Models from Executable Timed I/O Automata Specifications.",
                    "Control Synthesis for Large Collections of Systems with Mode-Counting Constraints.",
                    "Compositional Synthesis with Parametric Reactive Controllers.",
                    "Nonlinear Controller Synthesis and Automatic Workspace Partitioning for Reactive High-Level Behaviors.",
                    "Robust Asymptotic Stabilization of Hybrid Systems using Control Lyapunov Functions.",
                    "Optimal Co-Design of Scheduling and Control for Networked Systems.",
                    "Entropy and Minimal Data Rates for State Estimation and Model Detection.",
                    "Safety Verification of Piecewise-Deterministic Markov Processes.",
                    "Computing Distances between Reach Flowpipes.",
                    "Reachset Conformance Testing of Hybrid Automata.",
                    "From Simulation Models to Hybrid Automata Using Urgency and Relaxation.",
                    "Parallelotope Bundles for Polynomial Reachability."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18. HSCC 2015",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2015",
                "sub_name": "Proceedings of the 18th International Conference on Hybrid Systems: Computation and Control, HSCC'15, Seattle, WA, USA, April 14-16, 2015.",
                "count": 45,
                "papers": [
                    "A viability approach for fast recursive feasible finite horizon path planning of autonomous RC cars.",
                    "Reach-avoid problems with time-varying dynamics, targets and constraints.",
                    "An improved algorithm for robust safety analysis of sampled data systems.",
                    "What's decidable about recursive hybrid automata?",
                    "Bounded-rate multi-mode systems based motion planning.",
                    "A sufficient condition for the boundedness of matrix products accepted by an automaton.",
                    "Efficient finite abstraction of mixed monotone systems.",
                    "Compositional construction of approximate abstractions.",
                    "Computing bisimulation functions using SOS optimization and δ-decidability over the reals.",
                    "Probabilistic diagnosability of hybrid systems.",
                    "Dynamic scheduling for networked control systems.",
                    "Closed loop analysis of control command software.",
                    "Real-time control under clock offsets between sensors and controllers.",
                    "HYST: a source transformation and translation tool for hybrid automaton models.",
                    "ProbReach: verified probabilistic delta-reachability for stochastic hybrid systems.",
                    "A delta-sampling verification theorem for discrete-time, possibly discontinuous systems.",
                    "Eliminating spurious transitions in reachability with support functions.",
                    "Finite state approximation for verification of partially observable stochastic hybrid systems.",
                    "Statistical verification of dynamical systems using set oriented methods.",
                    "Requirements for hybrid cosimulation standards.",
                    "SpaTeL: a novel spatial-temporal logic and its applications to networked systems.",
                    "Computing the Skorokhod distance between polygonal traces.",
                    "First steps toward formal controller synthesis for bipedal robots.",
                    "Vulnerability analysis of dynamical power networks to stochastic link failure attacks.",
                    "Towards personalized prostate cancer therapy using delta-reachability analysis.",
                    "Temporal logic motion planning using POMDPs with parity objectives: case study paper.",
                    "Reactive synthesis from signal temporal logic specifications.",
                    "Estimator-based reactive synthesis under incomplete information.",
                    "Temporal logic control for stochastic linear systems using abstraction refinement of probabilistic games.",
                    "Cross-entropy temporal logic motion planning.",
                    "Enforcing temporal logic specifications via reinforcement learning.",
                    "Symbolic control of monotone systems application to ventilation regulation in buildings.",
                    "A stochastic hybrid system approach to aggregated load modeling for demand response.",
                    "Parallel state space exploration of linear systems with inputs using XSpeed.",
                    "Hybrid representation of rule-based systems.",
                    "HyRG: a random generation tool for affine hybrid automata.",
                    "Stability and stabilization of polynomial dynamical systems using Bernstein polynomials.",
                    "Hybrid multi-contact dynamics for wedge jumping locomotion behaviors.",
                    "Model-based design of time-triggered real-time embedded systems for digital manufacturing.",
                    "Counterexample-guided stabilization of switched systems using control lyapunov functions.",
                    "Falsification of safety properties for closed loop control systems.",
                    "CyPhySim: a cyber-physical systems simulator.",
                    "Towards online reachability analysis with temporal-differencing.",
                    "Demonstration of locomotion with the powered prosthesis AMPRO utilizing online optimization-based control.",
                    "C2E2: a tool for verifying annotated hybrid systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17. HSCC 2014",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2014",
                "sub_name": "17th International Conference on Hybrid Systems: Computation and Control (part of CPS Week), HSCC'14, Berlin, Germany, April 15-17, 2014.",
                "count": 33,
                "papers": [
                    "Computation of piecewise affine terminal cost functions for model predictive control.",
                    "Stabilizing discrete-time switched linear systems.",
                    "An LQ sub-optimal stabilizing feedback law for switched linear systems.",
                    "State-feedback stabilization of discrete-time piecewise affine systems.",
                    "Bisimilar symbolic models for stochastic control systems without state-space discretization.",
                    "Stochastic reachability based motion planning for multiple moving obstacle avoidance.",
                    "Timely monitoring of partially observable stochastic systems.",
                    "A type-based analysis of causality loops in hybrid systems modelers.",
                    "A hyperdense semantic domain for hybrid dynamic systems to model different classes of discontinuities.",
                    "Quasi-dependent variables in hybrid automata.",
                    "Stability analysis of large-scale networked control systems with local networks: a hybrid small-gain approach.",
                    "Model reduction of switched affine systems: a method based on balanced truncation and randomized optimization.",
                    "Control to facet for polynomial systems.",
                    "Simulation-guided lyapunov analysis for hybrid dynamical systems.",
                    "Cells driven by computers: long-term model predictive control of gene expression in yeast.",
                    "Component based design of hybrid systems: a case study on concurrency and coupling.",
                    "JSR: a toolbox to compute the joint spectral radius.",
                    "A bounded model checking tool for periodic sample-hold systems.",
                    "Inner approximated reachability analysis.",
                    "Sampling-based approximation of the viability kernel for high-dimensional linear sampled-data systems.",
                    "Proofs from simulations and modular annotations.",
                    "On approximation metrics for linear temporal model-checking of stochastic systems.",
                    "Resilience to intermittent assumption violations in reactive synthesis.",
                    "Model measuring for hybrid systems.",
                    "Abstracting and refining robustness for cyber-physical systems.",
                    "Parameter synthesis for polynomial biological models.",
                    "Compositionality results for cardiac cell dynamics.",
                    "Powertrain control verification benchmark.",
                    "Dynamic multi-domain bipedal walking with atrias through SLIP based human-inspired control.",
                    "Temporal logic inference for classification and prediction from data.",
                    "Energy and mean-payoff timed games.",
                    "Abstraction, discretization, and robustness in temporal logic control of dynamical systems.",
                    "Edit distance for timed automata."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16. HSCC 2013",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2013",
                "sub_name": "Proceedings of the 16th international conference on Hybrid systems: computation and control, HSCC 2013, April 8-11, 2013, Philadelphia, PA, USA.",
                "count": 41,
                "papers": [
                    "Least-violating control strategy synthesis with safety rules.",
                    "Limited-information control of hybrid systems via reachable set propagation.",
                    "Resilient synchronization in robust networked multi-agent systems.",
                    "Human-inspired control of bipedal robots via control lyapunov functions and quadratic programs.",
                    "Learning nonlinear hybrid systems: from sparse optimization to support vector regression.",
                    "Mining requirements from closed-loop control models.",
                    "On the decidability of stability of hybrid systems.",
                    "Lyapunov analysis of rigid body systems with impacts and friction via sums-of-squares.",
                    "Hybrid control lyapunov functions for the stabilization of hybridsystems.",
                    "CoSyMA: a tool for controller synthesis using multi-scale abstractions.",
                    "An aircraft electric power testbed for validating automatically synthesized reactive control protocols.",
                    "Towards sensitivity analysis of hybrid systems using simulink.",
                    "A toolbox for simulation of hybrid systems in matlab/simulink: hybrid equations (HyEQ) toolbox.",
                    "Stabhyli: a tool for automatic stability verification of non-linear hybrid systems.",
                    "Zélus: a synchronous language with ODEs.",
                    "A stochastic hybrid system model of collective transport in the desert ant aphaenogaster cockerelli.",
                    "Formal verification of distributed aircraft controllers.",
                    "A simulink hybrid heart model for quantitative verification of cardiac pacemakers.",
                    "A partially observable hybrid system model for bipedal locomotion for adapting to terrain variations.",
                    "State estimation for polyhedral hybrid systems and applications to the Godunov scheme.",
                    "Observer design for a class of piecewise affine hybrid systems.",
                    "Automated analysis of real-time scheduling using graph games.",
                    "Reachability analysis of nonlinear systems using conservative polynomialization and non-convex sets.",
                    "One-shot computation of reachable sets for differential games.",
                    "Tracking differentiable trajectories across polyhedra boundaries.",
                    "Flowpipe approximation and clustering in space-time.",
                    "Bounded model-checking of discrete duration calculus.",
                    "Pipelining for cyclic control systems.",
                    "Optimal CPU allocation to a set of control tasks with soft real-time execution constraints.",
                    "Safe schedulability of bounded-rate multi-mode systems.",
                    "Compositional heterogeneous abstraction.",
                    "Certifying the safe design of a virtual fixture control algorithm for a surgical robot.",
                    "Quantitative timed simulation functions and refinement metrics for real-time systems.",
                    "Formula-free finite abstractions for linear temporal verification of stochastic hybrid systems.",
                    "Quantitative automata-based controller synthesis for non-autonomous stochastic hybrid systems.",
                    "Control design for specifications on stochastic hybrid systems.",
                    "Rewarding probabilistic hybrid automata.",
                    "Approximating acceptance probabilities of CTMC-paths on multi-clock deterministic timed automata.",
                    "Specification-guided controller synthesis for linear systems and safe linear-time temporal logic.",
                    "Temporal logic model predictive control for discrete-time systems.",
                    "Iterative temporal motion planning for hybrid systems in partially unknown environments."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15. HSCC 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2012",
                "sub_name": "Hybrid Systems: Computation and Control (part of CPS Week 2012), HSCC'12, Beijing, China, April 17-19, 2012.",
                "count": 32,
                "papers": [
                    "Verification and control of hybrid systems using reachability analysis with machine learning.",
                    "Formal methods for dynamical systems.",
                    "Low complexity resilient consensus in networked multi-agent systems with adversaries.",
                    "Compositional safety analysis using barrier certificates.",
                    "Transcendental inductive invariants generation for non-linear differential and hybrid systems.",
                    "Heterogeneous verification of cyber-physical systems using behavior relations.",
                    "Avoiding geometric intersection operations in reachability analysis of hybrid systems.",
                    "Computing the viability kernel using maximal reachable sets.",
                    "Reachability games for linear hybrid systems.",
                    "Optimal scheduling for constant-rate multi-mode systems.",
                    "On synthesizing robust discrete controllers under modeling uncertainty.",
                    "Language-guided controller synthesis for discrete-time linear systems.",
                    "A generic ellipsoid abstract domain for linear time invariant systems.",
                    "Lyapunov abstractions for inevitability of hybrid systems.",
                    "Falsification of temporal properties of hybrid systems using the cross-entropy method.",
                    "Dynamically stable bipedal robotic walking with NAO via human-inspired hybrid zero dynamics.",
                    "Efficient algorithms for collision avoidance at intersections.",
                    "Parameter estimation for stochastic hybrid models of biochemical reaction networks.",
                    "From hybrid data-flow languages to hybrid automata: a complete translation.",
                    "Efficient computation of generalized input-to-state ℒ2-gains of discrete-time switched linear systems.",
                    "Algebraic analysis on asymptotic stability of switched hybrid systems.",
                    "Pre-orders for reasoning about stability.",
                    "Probabilistic invariance of mixed deterministic-stochastic dynamical systems.",
                    "Rare-event verification for stochastic hybrid systems.",
                    "Regularization of bellman equations for infinite-horizon probabilistic properties.",
                    "Passivity and stability of switched systems under quantization.",
                    "Stabilizing bit-rates in quantized event triggered control systems.",
                    "A symbolic approach to the design of nonlinear networked control systems.",
                    "Verification of linear duration properties over continuous-time markov chains.",
                    "Robust PCTL model checking.",
                    "NCSWT: an integrated modeling and simulation tool for networked control systems.",
                    "Computing bounded reach sets from sampled simulation traces."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14. HSCC 2011",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2011",
                "sub_name": "Proceedings of the 14th ACM International Conference on Hybrid Systems: Computation and Control, HSCC 2011, Chicago, IL, USA, April 12-14, 2011.",
                "count": 36,
                "papers": [
                    "Wireless control networks: modeling, synthesis, robustness, security.",
                    "Observability implies observer design for switched linear systems.",
                    "Analysis of the joint spectral radius via Lyapunov functions on path-complete graphs.",
                    "The earlier the better: a theory of timed actor interfaces.",
                    "Measuring performance of continuous-time stochastic processes using timed automata.",
                    "Measurability and safety verification for stochastic hybrid systems.",
                    "Stochastic non sequitur behavior analysis of fault tolerant hybrid systems.",
                    "Quantified differential invariants.",
                    "Decidability and complexity for the verification of safety properties of reasonable linear hybrid automata.",
                    "Quantitative automata model checking of autonomous stochastic hybrid systems.",
                    "Reachable set computation for uncertain time-varying linear systems.",
                    "Scalable calculation of reach sets and tubes for nonlinear systems with terminal integrators: a mixed implicit explicit formulation.",
                    "Computing bounded ε-reach set with finite precision computations for a class of linear hybrid automata.",
                    "Hybridization domain construction using curvature estimation.",
                    "A dynamic algorithm for approximate flow computations.",
                    "Automatic abstraction of non-linear systems using change of bases transformations.",
                    "Human-data based cost of bipedal robotic walking.",
                    "Characterizing knee-bounce in bipedal robotic walking: a zeno behavior approach.",
                    "Impulsive control for nanopositioning: stability and performance.",
                    "A predictive control solution for driveline oscillations damping.",
                    "Synthesis of switching controllers using approximately bisimilar multiscale abstractions.",
                    "Joint synthesis of switching and feedback for linear systems in discrete time.",
                    "Robust discrete synthesis against unspecified disturbances.",
                    "Synthesis of memory-efficient \"real-time\" controllers for safety objectives.",
                    "Hybrid controllers for tracking of impulsive reference state trajectories: a hybrid exosystem approach.",
                    "Variational formulation and optimal control of hybrid lagrangian systems.",
                    "A stochastic reach-avoid problem with random obstacles.",
                    "Impulsive data association with an unknown number of targets.",
                    "Resource constrained LQR control under fast sampling.",
                    "Consensus in networked multi-agent systems with adversaries.",
                    "Reputation-based networked control with data-corrupting channels.",
                    "Almost sure stability of networked control systems under exponentially bounded bursts of dropouts.",
                    "SHAVE: stochastic hybrid analysis of markov population models.",
                    "TuLiP: a software toolbox for receding horizon temporal logic planning.",
                    "Pessoa 2.0: a controller synthesis tool for cyber-physical systems.",
                    "A step towards verification and synthesis from simulink/stateflow models."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13. HSCC 2010",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2010",
                "sub_name": "Proceedings of the 13th ACM International Conference on Hybrid Systems: Computation and Control, HSCC 2010, Stockholm, Sweden, April 12-15, 2010.",
                "count": 30,
                "papers": [
                    "Succinct discrete time approximations of distributed hybrid automata.",
                    "Accurate hybridization of nonlinear systems.",
                    "Compositional analysis for linear control systems.",
                    "On integration of event-based estimation and robust MPC in a feedback loop.",
                    "From synchronous programs to symbolic representations of hybrid systems.",
                    "A descent algorithm for the optimal control of constrained nonlinear switched dynamical systems.",
                    "Timed automata with observers under energy constraints.",
                    "Real-time scheduling of mixture-of-experts systems with limited resources.",
                    "On a control algorithm for time-varying processor availability.",
                    "Timed I/O automata: a complete specification theory for real-time systems.",
                    "Receding horizon control for temporal logic specifications.",
                    "Synthesis using approximately bisimilar abstractions: state-feedback controllers for safety specifications.",
                    "Oscillation analysis of linearly coupled piecewise affine systems.",
                    "On infinity norms as Lyapunov functions for piecewise affine systems.",
                    "Identifiability of discrete-time linear switched systems.",
                    "Rank properties of poincare maps for hybrid systems with applications to bipedal walking.",
                    "Stealthy deception attacks on water SCADA systems.",
                    "A hybrid system model of seasonal snowpack water balance.",
                    "Comparison of overapproximation methods for stability analysis of networked control systems.",
                    "Distributed Kalman Filter algorithms for self-localization of mobile devices.",
                    "Convergence results for ant routing algorithms viastochastic approximation.",
                    "Monte-carlo techniques for falsification of temporal properties of non-linear hybrid systems.",
                    "Automatic invariant generation for hybrid systems using ideal fixed points.",
                    "Safe compositional network sketches: formal framework.",
                    "Bayesian statistical model checking with application to Simulink/Stateflow verification.",
                    "On the connections between PCTL and dynamic programming.",
                    "Modeling and verification of stochastic hybrid systems using HIOA: a case study on DNA replication.",
                    "A generating function approach to the stability of discrete-time switched linear systems.",
                    "Stabilization of planar switched linear systems using polar coordinates.",
                    "Amir Pnueli and the dawn of hybrid systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12. HSCC 2009",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2009",
                "sub_name": "Hybrid Systems: Computation and Control, 12th International Conference, HSCC 2009, San Francisco, CA, USA, April 13-15, 2009. Proceedings.",
                "count": 40,
                "papers": [
                    "Applications of MetiTarski in the Verification of Control and Hybrid Systems.",
                    "Three-Dimensional Kneed Bipedal Walking: A Hybrid Geometric Approach.",
                    "Safe and Secure Networked Control Systems under Denial-of-Service Attacks.",
                    "Actors without Directors: A Kahnian View of Heterogeneous Systems.",
                    "Simultaneous Optimal Control and Discrete Stochastic Sensor Selection.",
                    "Hybrid Modelling, Power Management and Stabilization of Cognitive Radio Networks.",
                    "Automatic Synthesis of Robust and Optimal Controllers - An Industrial Case Study.",
                    "Local Identification of Piecewise Deterministic Models of Genetic Networks.",
                    "Distributed Wombling by Robotic Sensor Networks.",
                    "Epsilon-Tubes and Generalized Skorokhod Metrics for Hybrid Paths Spaces.",
                    "Stability Analysis of Networked Control Systems Using a Switched Linear Systems Approach.",
                    "Parameter Synthesis for Hybrid Systems with an Application to Simulink Models.",
                    "Convergence of Distributed WSN Algorithms: The Wake-Up Scattering Problem.",
                    "Finite Automata as Time-Inv Linear Systems Observability, Reachability and More.",
                    "Optimal Boundary Control of Convention-Reaction Transport Systems with Binary Control Functions.",
                    "Trajectory Based Verification Using Local Finite-Time Invariance.",
                    "Synthesis of Trajectory-Dependent Control Lyapunov Functions by a Single Linear Program.",
                    "Uniform Consensus among Self-driven Particles.",
                    "Optimization of Multi-agent Motion Programs with Applications to Robotic Marionettes.",
                    "Decompositional Construction of Lyapunov Functions for Hybrid Systems.",
                    "Existence of Periodic Orbits with Zeno Behavior in Completed Lagrangian Hybrid Systems.",
                    "Computation of Discrete Abstractions of Arbitrary Memory Span for Nonlinear Sampled Systems.",
                    "Hybrid Modeling, Identification, and Predictive Control: An Application to Hybrid Electric Vehicle Energy Management.",
                    "On Event Based State Estimation.",
                    "Discrete-State Abstractions of Nonlinear Systems Using Multi-resolution Quantizer.",
                    "Event-Triggering in Distributed Networked Systems with Data Dropouts and Delays.",
                    "Specification and Analysis of Network Resource Requirements of Control Systems.",
                    "Periodically Controlled Hybrid Systems.",
                    "Stabilization of Discrete-Time Switched Linear Systems: A Control-Lyapunov Function Approach.",
                    "Bounded and Unbounded Safety Verification Using Bisimulation Metrics.",
                    "The Optimal Boundary and Regulator Design Problem for Event-Driven Controllers.",
                    "Morphisms for Non-trivial Non-linear Invariant Generation for Algebraic Hybrid Systems.",
                    "An Analysis of the Fuller Phenomenon on Transfinite Hybrid Automata.",
                    "Stochastic Optimal Tracking with Preview for Linear Discrete-Time Markovian Jump Systems (Extended Abstract).",
                    "Reachability Analysis for Stochastic Hybrid Systems Using Multilevel Splitting.",
                    "Orbital Control for a Class of Planar Impulsive Hybrid Systems with Controllable Resets.",
                    "Distributed Tree Rearrangements for Reachability and Robust Connectivity.",
                    "The Sensitivity of Hybrid Systems Optimal Cost Functions with Respect to Switching Manifold Parameters.",
                    "STORMED Hybrid Games.",
                    "Symbolic Branching Bisimulation-Checking of Dense-Time Systems in an Environment."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11. HSCC 2008",
        "info": "St. Louis, MO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2008",
                "sub_name": "Hybrid Systems: Computation and Control, 11th International Workshop, HSCC 2008, St. Louis, MO, USA, April 22-24, 2008. Proceedings.",
                "count": 62,
                "papers": [
                    "Markov Set-Chains as Abstractions of Stochastic Hybrid Systems.",
                    "Co-simulation Tools for Networked Control Systems.",
                    "On the Maximum Principle for Impulsive Hybrid Systems.",
                    "Algebraic Identification of MIMO SARX Models.",
                    "Contract-Based Design for Computation and Verification of a Closed-Loop Hybrid System.",
                    "Controller Synthesis with Budget Constraints.",
                    "Trading Infinite Memory for Uniform Randomness in Timed Games.",
                    "Solutions to Switched Hamilton-Jacobi Equations and Conservation Laws Using Hybrid Components.",
                    "Lost in Translation: Hybrid-Time Flows vs. Real-Time Transitions.",
                    "A Control Lyapunov Approach to Predictive Control of Hybrid Systems.",
                    "Discrete and Hybrid Stochastic State Estimation Algorithms for Networked Control Systems.",
                    "Anytime Control Algorithms for Embedded Real-Time Systems.",
                    "Stochastic Satisfiability Modulo Theory: A Novel Technique for the Analysis of Probabilistic Hybrid Systems.",
                    "A Counterexample-Guided Approach to Parameter Synthesis for Linear Hybrid Automata.",
                    "Approximately Bisimilar Symbolic Models for Incrementally Stable Switched Systems.",
                    "Zonotope/Hyperplane Intersection for Hybrid Systems Reachability Analysis.",
                    "Learning and Detecting Emergent Behavior in Networks of Cardiac Myocytes.",
                    "Compositional Modeling and Minimization of Time-Inhomogeneous Markov Chains.",
                    "Observer-Based Control of Linear Complementarity Systems.",
                    "Complementarity Systems in Constrained Steady-State Optimal Control.",
                    "Dealing with Nondeterminism in Symbolic Control.",
                    "Safety and Liveness in Intelligent Intersections.",
                    "LTLC: Linear Temporal Logic for Control.",
                    "Switched and PieceWise Nonlinear Hybrid System Identification.",
                    "Verification of Supervisory Control Software Using State Proximity and Merging.",
                    "Optimotaxis: A Stochastic Multi-agent Optimization Procedure with Point Measurements.",
                    "Noncausal Optimal Tracking of Linear Switched Systems.",
                    "Realization Theory for Discrete-Time Semi-algebraic Hybrid Systems.",
                    "A Decidable Class of Planar Linear Hybrid Systems.",
                    "Reachability of Uncertain Nonlinear Systems Using a Nonlinear Hybridization.",
                    "Modeling and Simulation of Biochemical Processes Using Stochastic Hybrid Systems: The Sugar Cataract Development Process.",
                    "Distributed Lyapunov Functions in Analysis of Graph Models of Software.",
                    "On the Optimality of Dubins Paths across Heterogeneous Terrain.",
                    "Switching Surface Design for Periodically Operated Discretely Controlled Continuous Systems.",
                    "Discrete Dynamics of Two-Dimensional Nonlinear Hybrid Automata.",
                    "Input-to-State Stabilization with Quantized Output Feedback.",
                    "Bisimilar Finite Abstractions of Interconnected Systems.",
                    "On Controllability of Timed Continuous Petri Nets.",
                    "Parameter Synthesis for Piecewise Affine Systems from Temporal Logic Specifications.",
                    "Necessary Conditions for the Impulsive Time-Optimal Control of Finite-Dimensional Lagrangian Systems.",
                    "Composition of Motion Description Languages.",
                    "On Optimal Quadratic Regulation for Discrete-Time Switched Linear Systems.",
                    "Approximation of General Stochastic Hybrid Systems by Switching Diffusions with Random Hybrid Jumps.",
                    "On Stability of Switched Linear Hyperbolic Conservation Laws with Reflecting Boundaries.",
                    "Sampling-Based Resolution-Complete Algorithms for Safety Falsification of Linear Systems.",
                    "Reachability Analysis of Stochastic Hybrid Systems by Optimal Control.",
                    "An Integrated Approach to Parametric and Discrete Fault Diagnosis in Hybrid Systems.",
                    "d-IRA: A Distributed Reachability Algorithm for Analysis of Linear Hybrid Automata.",
                    "Sufficient Conditions for Zeno Behavior in Lagrangian Hybrid Systems.",
                    "Separation in Stability Analysis of Piecewise Linear Systems in Discrete Time.",
                    "Level Set Methods for Computing Reachable Sets of Hybrid Systems with Differential Algebraic Equation Dynamics.",
                    "Approximate Control Design for Solar Driven Sensor Nodes.",
                    "Modular Development of Hybrid Systems for Verification in Coq.",
                    "Steering a Leader-Follower Team Via Linear Consensus.",
                    "Logical Verification and Systematic Parametric Analysis in Train Control.",
                    "Information Theoretical Approach to Identification of Hybrid Systems.",
                    "A Policy Iteration Technique for Time Elapse over Template Polyhedra.",
                    "Generating Box Invariants.",
                    "Qualitative Stability Patterns for Lotka-Volterra Systems on Rectangles.",
                    "Sampled-Data Event Control of Hybrid Systems for Control Specifications Given by Predicates.",
                    "On the Timing of Discrete Events in Event-Driven Control Systems.",
                    "Decentralized Event-Triggered Broadcasts over Networked Control Systems."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10. HSCC 2007",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2007",
                "sub_name": "Hybrid Systems: Computation and Control, 10th International Workshop, HSCC 2007, Pisa, Italy, April 3-5, 2007, Proceedings.",
                "count": 86,
                "papers": [
                    "Networked Embedded Systems: From Sensor Webs to Cyber-Physical Systems.",
                    "Control Challenges in Wireless Sensor Networks.",
                    "The Challenges of Embedded Systems Engineering.",
                    "Computational Approaches to Reachability Analysis of Stochastic Hybrid Systems.",
                    "Groupoids in Control Systems and the Reachability Problem for a Class of Quantized Control Systems with Nonabelian Symmetries.",
                    "Minimum Time for a Hybrid System with Thermostatic Switchings.",
                    "Complexity Reduction for the Design of Interacting Controllers.",
                    "Model Checking Genetic Regulatory Networks with Parameter Uncertainty.",
                    "MARCO: A Reachability Algorithm for Multi-affine Systems with Applications to Biological Systems.",
                    "Symbolic Analysis for GSMP Models with One Stateful Clock.",
                    "Robust, Optimal Predictive Control of Jump Markov Linear Systems Using Particles.",
                    "Optimal Switching of 1-DOF Oscillating Systems.",
                    "Feedback Scheduling for Pipelines of Tasks.",
                    "On Simulations and Bisimulations of General Flow Systems.",
                    "A Partial Order Approach to Discrete Dynamic Feedback in a Class of Hybrid Systems.",
                    "Systematic Simulation Using Sensitivity Analysis.",
                    "Motion Programs for Puppet Choreography and Control.",
                    "Hierarchical Synthesis of Hybrid Controllers from Temporal Logic Specifications.",
                    "Coupling from the Past in Hybrid Models for File Sharing Peer to Peer Systems.",
                    "Approximately Bisimilar Finite Abstractions of Stable Linear Systems.",
                    "Learning Cycle-Linear Hybrid Automata for Excitable Cells.",
                    "Input-to-State Stability of Discontinuous Dynamical Systems with an Observer-Based Control Application.",
                    "A Stochastic Framework for Hybrid System Identification with Application to Neurophysiological Systems.",
                    "Reachability for Linear Hybrid Automata Using Iterative Relaxation Abstraction.",
                    "Sporadic Control of First-Order Linear Stochastic Systems.",
                    "Price-Based Optimal Control of Power Flow in Electrical Energy Transmission Networks.",
                    "Robust Test Generation and Coverage for Hybrid Systems.",
                    "Minimalilty of Finite Automata Representation in Hybrid Systems Control.",
                    "Hybrid Control and Verification of a Pulsed Welding Process.",
                    "On Self-triggered Full-Information H-Infinity Controllers.",
                    "Impulse Differential Inclusions Driven by Discrete Measures.",
                    "CEGAR Based Bounded Model Checking of Discrete Time Hybrid Systems.",
                    "Solving Coverage Problems with Embedded Graph Grammars.",
                    "Comparing Forward and Backward Reachability as Tools for Safety Analysis.",
                    "Approximation of the Joint Spectral Radius of a Set of Matrices Using Sum of Squares.",
                    "Metrics and Topology for Nonlinear and Hybrid Systems.",
                    "The Image Computation Problem in Hybrid Systems Model Checking.",
                    "A New Hybrid State Estimator for Systems with Limited Mode Changes.",
                    "Ant Colony and Genetic Algorithm for Constrained Predictive Control of Power Systems.",
                    "Stabilization of Limit Cycles of Discretely Controlled Continuous Systems by Controlling Switching Surfaces.",
                    "Approximate Simulation Relations and Finite Abstractions of Quantized Control Systems.",
                    "Finite State Controllers for Stabilizing Switched Systems with Binary Sensors.",
                    "Safety Verification of an Aircraft Landing Protocol: A Refinement Approach.",
                    "Rate Admission Control for Hard Real-Time Task Scheduling.",
                    "Foundations of a Compositional Interchange Format for Hybrid Systems.",
                    "Automata Based Interfaces for Control and Scheduling.",
                    "Modeling and Optimal Control of Hybrid Rigidbody Mechanical Systems.",
                    "The Concept of Deadlock and Livelock in Hybrid Control Systems.",
                    "Reachability Algorithm for Biological Piecewise-Affine Hybrid Systems.",
                    "Necessary Optimality Conditions for a Class of Hybrid Optimal Control Problems.",
                    "Optimal Switches in Multi-inventory Systems.",
                    "Viability-Based Computations of Solutions to the Hamilton-Jacobi-Bellman Equation.",
                    "A Method for the Design of Optimal Switching Surfaces for Autonomous Hybrid Systems.",
                    "A Hybrid Bellman Equation for Bimodal Systems.",
                    "Networks of Hybrid Systems: Connections Faults Modelling and Detection.",
                    "Switching-Based Lyapunov Function and the Stabilization of a Class of Non-holonomic Systems.",
                    "Composing Semi-algebraic O-Minimal Automata.",
                    "A Hybrid Model for Subliminal Air Traffic Control.",
                    "On Bicontinuous Bisimulation and the Preservation of Stability.",
                    "Efficient Simulation of Component-Based Hybrid Models Represented as Hybrid Bond Graphs.",
                    "Diagnosability Verification for Hybrid Automata.",
                    "Piecewise Constant Feedback Control of Piecewise Affine Gene Network Models.",
                    "Hybrid Models for Gene Regulatory Networks: The Case of lac Operon in E. Coli.",
                    "Reachability Analysis of a Switched Buffer Network.",
                    "Composition of Dynamical Systems for Estimation of Human Body Dynamics.",
                    "Computation in One-Dimensional Piecewise Maps.",
                    "Toward Flexible Scheduling of Real-Time Control Tasks: Reviewing Basic Control Models.",
                    "Invertibility and Flatness of Switched Linear Discrete-Time Systems.",
                    "Trace-Based Semantics for Probabilistic Timed I/O Automata.",
                    "Asymptotic Stability of Switched Higher Order Laplacians.",
                    "Qualitative Analysis of Nonlinear Biochemical Networks with Piecewise-Affine Functions.",
                    "Guided Randomized Simulation.",
                    "Controller Parameters Selection Through Bifurcation Analysis in a Piecewise-Smooth System.",
                    "Fully Automated Stability Verification for Piecewise Affine Systems.",
                    "Differential Logic for Reasoning About Hybrid Systems.",
                    "A Sound and Complete Proof Rule for Region Stability of Hybrid Systems.",
                    "Switch Detection in Genetic Regulatory Networks.",
                    "Safety Analysis of Sugar Cataract Development Using Stochastic Hybrid Systems.",
                    "Case Studies in Event-Driven Control.",
                    "Hybrid Estimation for Stochastic Piecewise Linear Systems.",
                    "On-Line Optimization of Switched-Mode Hybrid Dynamical Systems.",
                    "State Nullification of Switched Systems by Linear Output Feedback.",
                    "Fault Accommodation for Hybrid Systems with Continuous and Discrete Faults.",
                    "A Heuristic Predictive Logic Controller Applied to Hybrid Solar Air Conditioning Plant.",
                    "Distributed Hybrid Control for Multiple-Pursuer Multiple-Evader Games.",
                    "A Controller Design Method Under Infrequent, Asynchronous Sensing."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9. HSCC 2006",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2006",
                "sub_name": "Hybrid Systems: Computation and Control, 9th International Workshop, HSCC 2006, Santa Barbara, CA, USA, March 29-31, 2006, Proceedings.",
                "count": 42,
                "papers": [
                    "Motion Coordination for Multi-agent Networks.",
                    "Towards a Third Generation of Control Systems.",
                    "Hybrid Systems - And Everything Else.",
                    "Behavioural Approximations for Restricted Linear Differential Hybrid Automata.",
                    "Bounded Model Checking for GSMP Models of Stochastic Real-Time Systems.",
                    "On the Stability of Zeno Equilibria.",
                    "Reachability Analysis for Controlled Discrete Time Stochastic Hybrid Systems.",
                    "Output-Based Optimal Timing Control of Switched Systems.",
                    "Hybrid Modelling and Control of the Common Rail Injection System.",
                    "Event-Based Model Predictive Control and Verification of Integral Continuous-Time Hybrid Automata.",
                    "Improving Efficiency of Finite Plans by Optimal Choice of Input Sets.",
                    "Optimality Zone Algorithms for Hybrid Systems: Efficient Algorithms for Optimal Location and Control Computation.",
                    "Approximate Reachability Computation for Polynomial Systems.",
                    "A Lattice Theory for Solving Games of Imperfect Information.",
                    "Observability of Hybrid Automata by Abstraction.",
                    "Reconstruction of Switching Thresholds in Piecewise-Affine Models of Genetic Regulatory Networks.",
                    "Decision Problems for the Verification of Real-Time Software.",
                    "Laplacian Sheep: A Hybrid, Stop-Go Policy for Leader-Based Containment Control.",
                    "Optimal Control of Piece-Wise Polynomial Hybrid Systems Using Cylindrical Algebraic Decomposition.",
                    "The Reachability Problem for Uncertain Hybrid Systems Revisited: A Viability Theory Perspective.",
                    "Efficient Computation of Reachable Sets of Linear Time-Invariant Systems with Inputs.",
                    "Verification Using Simulation.",
                    "Reachability Analysis of Large-Scale Affine Systems Using Low-Dimensional Polytopes.",
                    "Simultaneous Optimization of Continuous Control Inputs and Discrete State Waypoints.",
                    "Approximate Abstraction of Stochastic Hybrid Automata.",
                    "A Fully Automated Framework for Control of Linear Systems from LTL Specifications.",
                    "Reachability Analysis of Multi-affine Systems.",
                    "Approximation, Sampling and Voting in Hybrid Computing Systems.",
                    "Computational Methods for Reachability Analysis of Stochastic Hybrid Systems.",
                    "R-Charon, a Modeling Language for Reconfigurable Hybrid Systems.",
                    "Estimation and Conflict Detection in Human Controlled Systems.",
                    "Stability Analysis of Hybrid Systems Via Small-Gain Theorems.",
                    "Stochastic Hybrid Delay Population Dynamics.",
                    "Finite Gain lp Stabilization Is Impossible by Bit-Rate Constrained Feedback.",
                    "Specification and Analysis of Distributed Object-Based Stochastic Hybrid Systems.",
                    "Verifying Average Dwell Time by Solving Optimization Problems.",
                    "Interchange Format for Hybrid Systems: Abstract Semantics.",
                    "Model Checking of Hybrid Systems: From Reachability Towards Stability.",
                    "A Feedback Control Motivation for Generalized Solutions to Hybrid Systems.",
                    "Fixed Point Iteration for Computing the Time Elapse Operator.",
                    "Mixed Initial-Boundary Value Problems for Scalar Conservation Laws: Application to the Modeling of Transportation Networks.",
                    "Beyond Zeno: Get on with It!"
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8. HSCC 2005",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2005",
                "sub_name": "Hybrid Systems: Computation and Control, 8th International Workshop, HSCC 2005, Zurich, Switzerland, March 9-11, 2005, Proceedings.",
                "count": 43,
                "papers": [
                    "Coordinated Control for Highly Reconfigurable Systems.",
                    "Operational Semantics of Hybrid Systems.",
                    "SOS Methods for Semi-algebraic Games and Optimization.",
                    "The Discrete Time Behavior of Lazy Linear Hybrid Automata.",
                    "Perturbed Timed Automata.",
                    "A Homology Theory for Hybrid Systems: Hybrid Homology.",
                    "Observability of Switched Linear Systems in Continuous Time.",
                    "Controller Synthesis on Non-uniform and Uncertain Discrete-Time Domains.",
                    "Qualitative Analysis and Verification of Hybrid Models of Genetic Regulatory Networks: Nutritional Stress Response in.",
                    "Optimal Control of Discrete Hybrid Stochastic Automata.",
                    "Hybrid Decentralized Control of Large Scale Systems.",
                    "On the Stabilisation of Switching Electrical Power Converters.",
                    "Bisimulation for General Stochastic Hybrid Systems.",
                    "Position and Force Control of Nonsmooth Lagrangian Dynamical Systems Without Friction.",
                    "Existence of Cascade Discrete-Continuous State Estimators for Systems on a Partial Order.",
                    "Refining Abstractions of Hybrid Systems Using Counterexample Fragments.",
                    "PHAVer: Algorithmic Verification of Hybrid Systems Past HyTech.",
                    "Direct Torque Control for Induction Motor Drives: A Model Predictive Control Approach Based on Feasibility.",
                    "Reachability of Uncertain Linear Systems Using Zonotopes.",
                    "Safety Verification of Controlled Advanced Life Support System Using Barrier Certificates.",
                    "Polynomial Stochastic Hybrid Systems.",
                    "Non-uniqueness in Reverse Time of Hybrid System Trajectories.",
                    "Comparison of Four Procedures for the Identification of Hybrid Systems.",
                    "An Ontology-Based Approach to Heterogeneous Verification of Embedded Control Systems.",
                    "Mode-Automata Based Methodology for Scade.",
                    "Taylor Approximation for Hybrid Systems.",
                    "Infinity Norms as Lyapunov Functions for Model Predictive Control of Constrained PWA Systems.",
                    "Air-Traffic Control in Approach Sectors: Simulation Examples and Optimisation.",
                    "Identification of Deterministic Switched ARX Systems via Identification of Algebraic Varieties.",
                    "Learning Multi-modal Control Programs.",
                    "A Toolbox of Hamilton-Jacobi Solvers for Analysis of Nondeterministic Continuous and Hybrid Systems.",
                    "On Transfinite Hybrid Automata.",
                    "Design of Optimal Autonomous Switching Circuits to Suppress Mechanical Vibration.",
                    "Interchange Formats for Hybrid Systems: Review and Proposal.",
                    "Primal-Dual Tests for Safety and Reachability.",
                    "Adjoint-Based Optimal Control of the Expected Exit Time for Stochastic Hybrid Systems.",
                    "Safety Verification of Hybrid Systems by Constraint Propagation Based Abstraction Refinement.",
                    "Generating Polynomial Invariants for Hybrid Systems.",
                    "Modeling, Optimization and Computation for Software Verification.",
                    "Bisimulation for Communicating Piecewise Deterministic Markov Processes (CPDPs).",
                    "Sensor/Actuator Abstractions for Symbolic Embedded Control Design.",
                    "Modeling and Control of Networked Control Systems with Random Delays.",
                    "Controllability Implies Stabilizability for Discrete-Time Switched Linear Systems."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "7. HSCC 2004",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2004",
                "sub_name": "Hybrid Systems: Computation and Control, 7th International Workshop, HSCC 2004, Philadelphia, PA, USA, March 25-27, 2004, Proceedings.",
                "count": 44,
                "papers": [
                    "Lazy Rectangular Hybrid Automata.",
                    "Affine Hybrid Systems.",
                    "Abstraction by Projection and Application to Multi-affine Systems.",
                    "Observability of Switched Linear Systems.",
                    "Inference Methods for Autonomous Stochastic Linear Hybrid Systems.",
                    "Synthesis for Idle Speed Control of an Automotive Engine.",
                    "Network Congestion Alleviation Using Adjoint Hybrid Control: Application to Highways.",
                    "Understanding the Bacterial Stringent Response Using Reachability Analysis of Hybrid Systems.",
                    "A SAT-Based Hybrid Solver for Optimal Control of Hybrid Systems.",
                    "Incremental Search Methods for Reachability Analysis of Continuous and Hybrid Systems.",
                    "Discrete and Hybrid Nonholonomy.",
                    "Approximations of the Rate of Growth of Switched Linear Systems.",
                    "The Hybrid Guaranteed Capture Basin Algorithm in Economics.",
                    "Staying Alive as Cheaply as Possible.",
                    "On O-Minimal Hybrid Systems.",
                    "Extended Stochastic Hybrid Systems and Their Reachability Problem.",
                    "On the Controllability of Bimodal Piecewise Linear Systems.",
                    "Observability of Piecewise-Affine Hybrid Systems.",
                    "Non-deterministic Temporal Logics for General Flow Systems.",
                    "Almost ASAP Semantics: From Timed Models to Timed Implementations.",
                    "Discrete State Estimators for a Class of Hybrid Systems on a Lattice.",
                    "Benchmarks for Hybrid Systems Verification.",
                    "On the Optimal Control of Switch-Mode DC-DC Converters.",
                    "Event-Driven Programming with Logical Execution Times.",
                    "A Stochastic Hybrid Model for Air Traffic Control Simulation.",
                    "Stochastic Hybrid Systems: Application to Communication Networks.",
                    "Rigorous Modeling of Hybrid Systems Using Interval Arithmetic Constraints.",
                    "Modeling Subtilin Production in Bacillus subtilis Using Stochastic Hybrid Systems.",
                    "Sound Code Generation from Communicating Hybrid Models.",
                    "Multi-Parametric Toolbox (MPT).",
                    "Dynamic Partitioning of Large Discrete Event Biological Systems for Hybrid Simulation and Analysis.",
                    "Safety Verification of Hybrid Systems Using Barrier Certificates.",
                    "Piecewise-Linear Output-Error Methods for Parameter Estimation in Direction-Dependent Processes.",
                    "A Spatial Logic for the Hybrid p-Calculus.",
                    "Full Paper Sheet Control Using Hybrid Automata.",
                    "Constructing Invariants for Hybrid Systems.",
                    "Bisimulation of Dynamical Systems.",
                    "Control Design for a Hybrid Dynamic System: A NASA Life Support System.",
                    "Non-concurrent Error Detection and Correction in Switched Linear Controllers.",
                    "Nonlinear Systems: Approximating Reach Sets.",
                    "On Practical Stability and Stabilization of Hybrid and Switched Systems.",
                    "A Numerical Technique for Stability Analysis of Linear Switched Systems.",
                    "Asymptotic Stability and Boundedness of Delay Switching Diffusions.",
                    "Symbolic Systems Biology: Hybrid Modeling and Analysis of Biological Networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "6. HSCC 2003",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2003",
                "sub_name": "Hybrid Systems: Computation and Control, 6th International Workshop, HSCC 2003 Prague, Czech Republic, April 3-5, 2003, Proceedings.",
                "count": 39,
                "papers": [
                    "The Mathematics of Matter and the Mathematics of Mind.",
                    "A Grand Challenge: Full Reactive Modeling of a Multi-cellular Animal.",
                    "Developing Home Robotics Products: Challenges and Lessons Learned.",
                    "Progress on Reachability Analysis of Hybrid Systems Using Predicate Abstraction.",
                    "Reachability Analysis of Nonlinear Systems Using Conservative Approximation .",
                    "Mode Reconstruction for Source Coding and Multi-modal Control.",
                    "Hybrid Control Design for a Wheeled Mobile Robot.",
                    "Modeling and Control of SMT Manufacturing Lines Using Hybrid Dynamic Systems.",
                    "Hybrid Control of an Automotive Robotized Gearbox for Reduction of Consumptions and Emissions.",
                    "A Greedy Approach to Identification of Piecewise Affine Models.",
                    "A Hoare Logic for Single-Input Single-Output Continuous-Time Control Systems.",
                    "Reachability Questions in Piecewise Deterministic Markov Processes.",
                    "Automatic Verification of a Turbogas Control System with the Mur varphi Verifier.",
                    "Modeling the Electrical Activity of a Neuron by a Continuous and Piecewise Affine Hybrid System.",
                    "Hybrid Control of Parabolic PDEs: Handling Faults of Constrained Control Actuators.",
                    "Conditions of Optimal Classification for Piecewise Affine Regression.",
                    "Approximate Stabilisation of Uncertain Hybrid Systems.",
                    "Efficient Mode Enumeration of Compositional Hybrid Systems.",
                    "Automated Symbolic Reachability Analysis; with Application to Delta-Notch Signaling Automata.",
                    "Modelling, Well-Posedness, Stability of Switched Electrical Networks.",
                    "Hybrid Modeling and Simulation of Genetic Regulatory Networks: A Qualitative Approach.",
                    "On Systematic Simulation of Open Continuous Systems.",
                    "Estimation of Distributed Hybrid Systems Using Particle Filtering Methods.",
                    "Event Prediction for Switching Linear Systems with Time Varying Thresholds Using Orthogonal Functions.",
                    "On the Causality of Mixed-Signal and Hybrid Models.",
                    "Safety Verification of Model Helicopter Controller Using Hybrid Input/Output Automata.",
                    "Multi-object Adaptive Cruise Control.",
                    "Universality and Language Inclusion for Open and Closed Timed Automata.",
                    "On the Application of Hybrid Control to CPU Reservations.",
                    "Stabilization of LTI Systems with Quantized State - Quantized Input Static Feedback.",
                    "Qualitative Heterogeneous Control of Higher Order Systems.",
                    "The Phi-Calculus: A Language for Distributed Control of Reconfigurable Embedded Systems.",
                    "Hybrid Modelling and Control of Power Electronics.",
                    "On the Optimal Control of Hybrid Systems: Optimization of Trajectories, Switching Times, Location Schedules.",
                    "Efficient Representation and Computation of Reachable Sets for Hybrid Systems.",
                    "Model Checking LTL over Controllable Linear Systems Is Decidable.",
                    "Approximate Reachability for Linear Systems.",
                    "Observability of Linear Hybrid Systems.",
                    "Results and Perspectives on Computational Methods for Optimal Control of Switched Systems."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5. HSCC 2002",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2002",
                "sub_name": "Hybrid Systems: Computation and Control, 5th International Workshop, HSCC 2002, Stanford, CA, USA, March 25-27, 2002, Proceedings.",
                "count": 36,
                "papers": [
                    "Hybrid and Embedded Software Technologies for Production Large-Scale Systems.",
                    "Numerical Methods for Differential Systems with Algebraic Equality and Inequality Constraints.",
                    "From Models to Code: The Missing Link in Embedded Software.",
                    "Hybrid System Models of Navigation Strategies for Games and Animations.",
                    "Hybrid Control of a Truck and Trailer Vehicle.",
                    "Reachability Analysis of Hybrid Systems via Predicate Abstraction.",
                    "Towards Computing Phase Portraits of Polygonal Differential Inclusions.",
                    "Dynamical Qualitative Analysis of Evolutionary Systems.",
                    "Design of Observers for Hybrid Systems.",
                    "Guaranteed Overapproximations of Unsafe Sets for Continuous and Hybrid Systems: Solving the Hamilton-Jacobi Equation Using Viability Techniques.",
                    "On the Optimal Control Law for Linear Discrete Time Hybrid Systems.",
                    "A Computational Framework for the Verification and Synthesis of Force-Guided Robotic Assembly Strategies.",
                    "A Comparison of Control Problems for Timed and Hybrid Systems.",
                    "Hybrid Control Loops, A/D Maps, and Dynamic Specifications.",
                    "Switching and Feedback Laws for Control of Constrained Switched Nonlinear Systems.",
                    "Quantized Stabilization of Two-Input Linear Systems: A Lower Bound on the Minimal Quantization Density.",
                    "Analysis of Discrete-Time PWA Systems with Logic States.",
                    "Modeling and Control of Co-generation Power Plants: A Hybrid System Approach.",
                    "Exploiting Implicit Representations in Timed Automaton Verification for Controller Synthesis.",
                    "Computation of Root-Mean-Square Gains of Switched Linear Systems.",
                    "Mode Estimation of Probabilistic Hybrid Systems.",
                    "Symmetry Reduction of a Class of Hybrid Systems.",
                    "Bisimulation Based Hierarchical System Architecture for Single-Agent Multi-modal Systems.",
                    "Qualitative Modeling and Heterogeneous Control of Global System Behavior.",
                    "An Approach to Model-Based Diagnosis of Hybrid Systems.",
                    "Information-Based Alpha-Beta Search and the Homicidal Chauffeur.",
                    "Synthesis of Robust Control Systems under Resource Constraints.",
                    "Optimal Control of Quantized Input Systems.",
                    "Reconfiguration in Hierarchical Control of Piecewise-Affine Systems.",
                    "Hybrid Kernels and Capture Basins for Impulse Constrained Systems.",
                    "Ordered Upwind Methods for Hybrid Control.",
                    "Discrete-Time Refinement of Hybrid Automata.",
                    "Control of Switched Hybrid Systems Based on Disjunctive Formulations.",
                    "Composing Abstractions of Hybrid Systems.",
                    "Optimal Control of Hysteresis in Smart Actuators: A Viscosity Solutions Approach.",
                    "Series of Abstractions for Hybrid Automata."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4. HSCC 2001",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2001",
                "sub_name": "Hybrid Systems: Computation and Control, 4th International Workshop, HSCC 2001, Rome, Italy, March 28-30, 2001, Proceedings.",
                "count": 41,
                "papers": [
                    "Control as an Embedded Technology.",
                    "Optimisation of Hybrid Processes and Hybrid Controllers.",
                    "Embedded Software and Systems: Challenges and Approaches.",
                    "Hybrid Systems Applications: An Oxymoron?",
                    "Design of Luenberger Observers for a Class of Hybrid Linear Systems.",
                    "Hybrid Modeling and Simulation of Biomolecular Networks.",
                    "Compositional Refinement for Hierarchical Hybrid Systems.",
                    "Optimal Paths in Weighted Timed Automata.",
                    "Reach Set Computations Using Real Quantifier Elimination.",
                    "On Hybrid Control of Under-Actuated Mechanical Systems.",
                    "On the Decidability of the Reachability Problem for Planar Differential Inclusions.",
                    "The Substratum of Impulse and Hybrid Control Systems.",
                    "Path-Dependent Impulse and Hybrid Systems.",
                    "Hybrid Feedback Control for Path Tracking by a Bounded-Curvature Vehicle.",
                    "Minimum-Cost Reachability for Priced Timed Automata.",
                    "A Hybrid Approach to Traction Control.",
                    "Optimal Control Using Bisimulations: Implementation.",
                    "A Generalized Approach for Analysis and Control of Discrete-Time Piecewise Affine and Hybrid Systems.",
                    "Accurate Event Detection for Simulating Hybrid Systems.",
                    "A Clustering Technique for the Identification of Piecewise Affine Systems.",
                    "Lateral Inhibition through Delta-Notch Signaling: A Piecewise Affine Hybrid Model.",
                    "Supervision of Event-Driven Hybrid Systems: Modeling and Synthesis.",
                    "Control of Piecewise-Linear Hybrid Systems on Simplices and Rectangles.",
                    "Assume-Guarantee Reasoning for Hierarchical Hybrid Systems.",
                    "Hybrid Modeling of TCP Congestion Control.",
                    "Hybrid Geodesics as Optimal Solutions to the Collision-Free Motion Planning Problem.",
                    "Nonlinear Adaptive Backstepping with Estimator Resetting Using Multiple Observers.",
                    "Mode Switching Synthesis for Reachability Specifications.",
                    "Characterization of Stabilizing Switching Sequences in Switched Linear Systems Using Piecewise Linear Lyapunov Functions.",
                    "On a Novel Class of Bifurcations in Hybrid Dynamical Systems.",
                    "Global Controllability of Hybrid Systems with Controlled and Autonomous Switchings.",
                    "Modeling of Continuous-Discrete Processes.",
                    "Hybrid I/O Automata Revisited.",
                    "Validating a Hamilton-Jacobi Approximation to Hybrid System Reachable Sets.",
                    "Hamiltonian Mechanics2.",
                    "Robust Controller Synthesis for Hybrid Systems Using Modal Logic.",
                    "Diagnosis of Physical Systems with Hybrid Models Using Parametrized Causality.",
                    "Addressing Multiobjective Control: Safety and Performance through Constrained Optimization.",
                    "Representation of Quantised Systems by the Frobenius-Perron Operator.",
                    "Semi-decidable Synthesis for Triangular Hybrid Systems.",
                    "Hybrid Abstractions that Preserve Timed Languages."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3. HSCC 2000",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/2000",
                "sub_name": "Hybrid Systems: Computation and Control, Third International Workshop, HSCC 2000, Pittsburgh, PA, USA, March 23-25, 2000, Proceedings.",
                "count": 37,
                "papers": [
                    "Hybrid Models for Automotive Powertrain Systems: Revisiting a Vision.",
                    "Experiences in Designing and Using Formal Specification Languages for Embedded Control Software.",
                    "Model-Based Autonomous Systems for Robotic Space Exploration.",
                    "Models of Computation and Simulation of Hybrid Systems.",
                    "Modular Specification of Hybrid Systems in CHARON.",
                    "Approximate Reachability Analysis of Piecewise-Linear Dynamical Systems.",
                    "Maximal Safe Set Computation for Idle Speed Control of an Automotive Engine.",
                    "Optimization-Based Verification and Stability Characterization of Piecewise Affine and Hybrid Systems.",
                    "Invariant Sets and Control Synthesis for Switching Systems with Safety Specifications.",
                    "Verification of Hybrid Systems with Linear Differential Inclusions Using Ellipsoidal Approximations.",
                    "Theory of Optimal Control Using Bisimulations.",
                    "Behavior Based Robotics Using Hybrid Automata.",
                    "Hybrid Controllers for Hierarchically Decomposed Systems.",
                    "Beyond HYTECH: Hybrid Systems Analysis Using Interval Numerical Methods.",
                    "Robust Undecidability of Timed and Hybrid Systems.",
                    "Towars a Theory of Stochastic Hybrid Systems.",
                    "Automatic Compilation of Concurrent Hybrid Factories from Product Assembly Specifications.",
                    "A Hybrid Feedback Regulator Approach to Control an Automotive Suspension System.",
                    "Ellipsoidal Techniques for Reachability Analysis.",
                    "Uniform Reachability Algorithms.",
                    "On the Existence of Solutions to Controlled Hybrid Automata.",
                    "Nonlinear Stabilization by Hybrid Quantized Feedback.",
                    "Diagnosis of Quantised Systems by Means of Timed Discrete-Event Representations.",
                    "Existence and Stability of Limit Cycles in Switched Single Server Flow Networks Modelled as Hybrid Dynamical Systems.",
                    "Hybrid Systems Diagnosis.",
                    "Decidability and Complexity Results for Timed Automata and Semi-linear Hybrid Automata.",
                    "Level Set Methods for Computation in Hybrid Systems.",
                    "Towards Procedures for Systematically Deriving Hybrid Models of Complex Systems.",
                    "Computing Optimal Operation Schemes for Chemical Plants in Multi-batch Mode.",
                    "Hybrid Systems Verification by Location Elimination.",
                    "A Dynamic Bayesian Network Approach to Tracking Using Learned Switching Dynamic Models.",
                    "Stability of Hybrid Systems Using LMIs - A Gear-Box Application.",
                    "Invariance of Approximating Automata for Piecewise Linear Systems with Uncertainties.",
                    "Decidable Controller Synthesis for Classes of Linear Systems.",
                    "Towards a Geometric Theory of Hybrid Systems.",
                    "Controlled Invariance of Discrete Time Systems.",
                    "Dynamical Systems Revisited: Hybrid Systems with Zeno Executions."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2. HSCC 1999",
        "info": "Berg en Dal, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1999",
                "sub_name": "Hybrid Systems: Computation and Control, Second International Workshop, HSCC'99, Berg en Dal, The Netherlands, March 29-31, 1999, Proceedings.",
                "count": 23,
                "papers": [
                    "SACRES: A Step Ahead in the Development of Critical Avoinics Applications (Abstract).",
                    "Approximating Hybrid System Dynamics for Analysis and Control (Abstract).",
                    "High-Level Modeling and Analysis of an Air-Traffic Management System (Abstract).",
                    "Geometric Categories, O-Minimal Structures and Control (Abstract).",
                    "Polyhedral Flows in Hybrid Automata.",
                    "As Soon as Possible: Time Optimal Control for Timed Automata.",
                    "Verification of Hybrid Systems via Mathematical Programming.",
                    "Orthogonal Polyhedra: Representation and Computation.",
                    "A Geometric Approach to Bisimulation and Verification of Hybrid Systems.",
                    "Verification of Polyhedral-Invariant Hybrid Automata Using Polygonal Flow Pipe Approximations.",
                    "Path Planning and Flight Controller Scheduling for an Autonomous Helicopter.",
                    "Reachability Analysis Using Polygonal Projections.",
                    "Scale-Independent Hysteresis Switching.",
                    "Well-Posedness of a Class of Piecewise Linear Systems with No Jumps.",
                    "A New Class of Decidable Hybrid Systems.",
                    "Synthesis of Control Software in a Layered Architecture from Hybrid Automata.",
                    "An Overview of Hybrid Simulation Phenomena and Their Support by Simulation Packages.",
                    "Building Hybrid Observers for Complex Dynamic Systems Using Model Abstractions.",
                    "Integration of Analog and Discrete Synchronous Design.",
                    "Reachability Analysis of a Class of Switched Continuous Systems by Integrating Rectangular Approximation and Rectangular Analysis.",
                    "Refinement and Continuous Behaviour.",
                    "Computing Controllers for Nonlinear Hybrid Systems.",
                    "Stabilization of Orthogonal Piecewise Linear Systems: Robustness Analysis and Design."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "1. HSCC 1998",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1998",
                "sub_name": "Hybrid Systems: Computation and Control, First International Workshop, HSCC'98, Berkeley, California, USA, April 13-15, 1998, Proceedings.",
                "count": 27,
                "papers": [
                    "Equations on Timed Languages.",
                    "Hybrid Control for Automotive Engine Management: The Cut-Off Case.",
                    "Hybrid Control of Automotive Powertrain Systems: A Case Study.",
                    "On the Composition of Hybrid Systems.",
                    "An Equivalence Between a Control Network and a Switched Hybrid System.",
                    "Hybrid cc with Interval Constraints.",
                    "Reachability Analysis via Face Lifting.",
                    "Automotive Control Revisited: Linear Inequalities as Approximation of Reachable Sets.",
                    "Switching Controllers Based on Neural Network: Estimates of Stability Regions and Controller Performance.",
                    "A Logic for the Specification of Continuous Systems.",
                    "Integrating Projections.",
                    "Lyapunov Stability of Continuous-Valued Systems under the Supervision of Discrete-Event Transition Systems.",
                    "Reachability Verification for Hybrid Automata.",
                    "Subanalytic Stratifications and Bisimulations.",
                    "Integrated Design and Simulation of Hybrid Systems.",
                    "Hierarchical Hybrid Systems: Partition Deformations and Applications to the Acrobot System.",
                    "Formal Verification of Safety-Critical Hybrid Systems.",
                    "Strings of Vehicles: Modeling and Safety Conditions.",
                    "An Approach to the Verification of the Center-TRACON Automation System.",
                    "Deductive Verification of Hybrid Systems Using STeP.",
                    "Reduction and Decomposition of Differential Automata: Theory and Applications.",
                    "Optimization of Generalized Solutions of Nonlinear Hybrid (Discrete-Continuous) Systems.",
                    "Information-Based Optimization Approaches to Dynamical System Safety Verification.",
                    "Synthesizing Controllers for Nonlinear Hybrid Systems.",
                    "A Sufficient Condition for Controllability of a Class of Hybrid Systems.",
                    "Hybrid Regular Expressions.",
                    "Stabilization of Systems with Changing Dynamics."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5. Hybrid Systems 1997",
        "info": "Notre Dame, IN, USA,",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1997",
                "sub_name": "Hybrid Systems V, Proceedings of the Fifth International Workshop on Hybrid Systems, Notre Dame, IN, USA, September 11-13, 1997.",
                "count": 23,
                "papers": [
                    "Control Synthesis of Hybrid Systems Based on Predicate Invariance.",
                    "Computing Approximating Automata for a Class of Linear Hybrid Systems.",
                    "On Hybrid Systems and the Modal µ-calculus.",
                    "The Extended Linear Complementary Problem and the Modeling and Analysis of Hybrid Systems.",
                    "Controller Scheduling Using Neural Networks: Implementation and Experimental Results.",
                    "Rigorous Design of a Fault Diagnosis and Isolation Algorithm.",
                    "Scalble Data and Sensor Fusion via Multiple Agent Hybrid Systems.",
                    "Hybrid Control Systems Usind Timed Petri Nets: Supervisory Control Design Based on Invariant Properties.",
                    "A Case Study in Tool-Aided Analysis of Discretely Controlled Continuous Systems: The Two Tanks Problem.",
                    "Hybrid Systems with Finite Bisimulations.",
                    "Extracting Stable Timed Automata from Switched Model Reference Systems.",
                    "Sliding Mode Model Semantics and Simulation for Hybrid Systems.",
                    "Time-Deterministic Hybrid Transition Systems.",
                    "Heuristic Optimizaton and Dynamical System Safety Verification.",
                    "A Hybrid Receding-Horizon Control Scheme for Nonlinear Discrete-Time Systems.",
                    "Approximating Automata and Discrete Control for Continuous Systems - Two Examples from Process Control.",
                    "Action Systems with Continuous Behaviour.",
                    "Towards Using Hybrid Automata for the Mission Planning of Unmanned Aerial Vehicles.",
                    "Optimal Controller Switching for Stochastic Systems.",
                    "Robust Control of Hybrid Systems: Performance Guided Strategies.",
                    "Analysis of Slope-Parametric Rectangular Automata.",
                    "Control of Interval Temporal Systems.",
                    "Phase-Space Nonlinear Control Toolbox: The Maglev Experience."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4. Hybrid Systems 1996",
        "info": "Ithaca, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1996",
                "sub_name": "Hybrid Systems IV, Proceedings of the Fourth International Workshop on Hybrid Systems, Ithaca, NY, USA, October 1996.",
                "count": 19,
                "papers": [
                    "Bumpless Switching in Hybrid Systems.",
                    "A Toolbox for Proving and Maintaining Hybrid Specifications.",
                    "Simulation of Hybrid Systems.",
                    "Application of the Kohn-Nerode Control Law Extraction Procedure to the Inverted Pendulum Problem.",
                    "Decidability of Hybrid Systems with Linear and Nonlinear Differential Inclusions.",
                    "Reliable Implementation of Hybrid Control Systems for Advanced Avionics.",
                    "SHIFT: A Formalism and a Programming Language for Dynamic Networks of Hybrid Automata.",
                    "Synthesis of Minimally Restrictive Legal Controllers for a Class of Hybrid Systems.",
                    "Control Theory, Modal Logic and Games.",
                    "Agent Based Velocity Control of Highway Systems.",
                    "A Computatuional Analysis of the Reachability Problem for a Class of Hybrid Dynamical Systems.",
                    "A Class of Rectangular Hybrid Systems with Computable Reach Set.",
                    "Safe Implementations of Supervisory Commands.",
                    "Hybrid System Games: Extraction of Control Automata with Small Topologies.",
                    "Hybrid Control Design for a Three Vehicle Scenario Demonstration Using Overlapping Decompositions.",
                    "Towards Continuous Abstractions of Dynamical and Control Systems.",
                    "A Totally Ordered Set of Discrete Abstractions for a given Hybrid Continuous System.",
                    "Comparing Timed and Hybrid Automata as Approximations of Continuous Systems.",
                    "Hybrid Control Models of Next Generarion AIr Traffic Management."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "Hybrid Systems Workshop 1995",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1995",
                "sub_name": "Hybrid Systems III: Verification and Control, Proceedings of the DIMACS/SYCON Workshop on Verification and Control of Hybrid Systems, October 22-25, 1995, Ruttgers University, New Brunswick, NJ, USA.",
                "count": 48,
                "papers": [
                    "A Game-Theoretic Approach to Hybrid System Design.",
                    "Verifying Clocked Transition Systems.",
                    "Compositional and Uniform Modelling of Hybrid Systems.",
                    "Hybrid cc, Hybrid Automata and Program Verification.",
                    "Controlled Switching Diffusions as Hybrid Processes.",
                    "Hybrid Systems: Chattering Approximation to Relaxed Controls.",
                    "Verification of Automated Vehicle Protection Systems.",
                    "Extended RTL in the Specification and Verification of an Industrial Press.",
                    "Abstract Verification of Structured Dynamical Systems.",
                    "Design and Evaluation Tools for Automated Highway Systems.",
                    "Hybrid Control in Sea Traffic Management Systems.",
                    "Verification of Hybrid Systems: Monotonicity in the AHS Control System.",
                    "Examples of Stabilization with Hybrid Feedback.",
                    "General Hybrid Dynamical Systems: Modeling, Analysis, and Control.",
                    "The Residue of Model Reduction.",
                    "The Tool KRONOS.",
                    "Timing Analysis in COSPAN.",
                    "UPPAAL - a Tool Suite for Automatic Verification of Real-Time Systems.",
                    "Optimal Design of Hybrid Controllers for Hybrid Process Systems.",
                    "On-line Fault Monitoring of a Class of Hybrid Systems Using Templates with Dynamic Time Scaling.",
                    "Hierarchical Design of a Chemical Concentration Control System.",
                    "Switched Bond Graphs as Front-End to Formal Verification of Hybrid Systems.",
                    "Formal Specification of Stability in Hybrid Control Systems.",
                    "Requirements Specifications for Hybrid Systems.",
                    "Validation of Hybrid Systems by Co-simulation.",
                    "Proofs from Temporal Hypotheses by Symbolic Simulation.",
                    "On Controlling Timed Discrete Event Systems.",
                    "Supervisory Control of Real-Time Systems Using Prioritized Synchronization.",
                    "Epsilon-Approximation of Differential Inclusions.",
                    "Linear Phase-Portrait Approximations for Nonlinear Hybrid Systems.",
                    "Deciding Reachability for Planar Multi-polynomial Systems.",
                    "Modeling Hybrid Dynamical Systems.",
                    "Stability of Hybrid Systems.",
                    "Model and Stability of Hybrid Linear System.",
                    "Interconnected Automata and Linear Systems: A Theoretical Framework in Discrete-Time.",
                    "Modelling and Verification of Automated Transit Systems, Using Timed Automata, Invariants and Simulations.",
                    "An Invariant Based Approach to the Design of Hybrid Control Systems Containing Clocks.",
                    "Refinements of Approximating Automata for Synthesis of Supervisory Controllers for Hybrid Systems.",
                    "A Data Intensive Computing Approach to Path Planning and Mode Management for Hybrid Systems.",
                    "Hybrid I/O Automata.",
                    "A Formal Description of Hybrid Systems.",
                    "Logics vs. Automata: The Hybrid Case.",
                    "Hinfinity Gain Schedule Synthesis of Supervisory Hybrid Control Systems.",
                    "A New Approach to Robust Control of Hybrid Systems.",
                    "A DES Approach to Control of Hybrid Dynamical Systems.",
                    "Diagnostic Model-Checking for Real-Time Systems.",
                    "Specification and Verification of Hybrid Dynamic Systems with Timed forall-Automata.",
                    "Fischer's Protocol Revisited: A Simple Proof Using Modal Constraints."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "3. Hybrid Systems 1994",
        "info": "Ithaca, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1994",
                "sub_name": "Hybrid Systems II, Proceedings of the Third International Workshop on Hybrid Systems, Ithaca, NY, USA, October 1994.",
                "count": 28,
                "papers": [
                    "Symbolic Controller Synthesis for Discrete and Timed Systems.",
                    "A Calculus of Stochastic Systems for the Specification, Simulation, and Hidden State Estimation of Hybrid Stochastic/Non-stochastic Systems.",
                    "Condensation of Information from Signals for Process Modeling and Control.",
                    "On the Automatic Verification of Systems with Continuous Variables and Unbounded Discrete Data Structures.",
                    "On Dynamically Consistent Hybrid Systems.",
                    "A Self-Learning Neuro-Fuzzy System.",
                    "Viable Control of Hybrid Systems.",
                    "Modeling and Stability Issues in Hybrid Systems.",
                    "Hierarchical Hybrid Control: A Case Study.",
                    "Hybrid Systems and Quantum Automata: Preliminary Announcement.",
                    "Planar Hybrid Systems.",
                    "Programming in Hybrid Constraint Languages.",
                    "A Note on Abstract Interpretation Strategies for Hybrid Automata.",
                    "HYTECH: The Cornell HYbrid TECHnology Tool.",
                    "Hybrid Systems as Finsler Manifolds: Finite State Control as Approximation to Connections.",
                    "Constructing Hybrid Control Systems from Robust Linear Control Agents.",
                    "Controllers as Fixed Points of Set-Valued Operators.",
                    "Verification of Hybrid Systems Using Abstractions.",
                    "Control of Continuous Plants by Symbolic Output Feedback.",
                    "Hybrid Control of a Robot - A Case Study.",
                    "Verifying Time-bounded Properties for ELECTRE Reactive Programs with Stopwatch Automata.",
                    "Inductive Modeling: A Framework Marrying Systems Theory and Non-monotonic Reasoning.",
                    "Semantics and Verification of Hierarchical CRP Programs.",
                    "Interface and Controller Design for Hybrid Control Systems.",
                    "Hybrid Objects.",
                    "Modelling of Hybrid Systems Based on Extended Coloured Petri Nets.",
                    "DEVS Framework for Modelling, Simulation, Analysis, and Design of Hybrid Systems.",
                    "Synthesis of Hybrid Constraint-Based Controllers."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "Hybrid Systems Workshop 1993",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hybrid/1992",
                "sub_name": "Hybrid Systems.",
                "count": 20,
                "papers": [
                    "Introduction.",
                    "Verifying Hybrid Systems.",
                    "An Extended Duration Calculus for Hybrid Real-Time Systems.",
                    "Towards Refining Temporal Specifications into Hybrid Systems.",
                    "Hybrid Systems in TLA+.",
                    "Hybrid Models with Fairness and Distributed Clocks.",
                    "A Compositional Approach to the Design of Hybrid Systems.",
                    "An Approach to the Description and Analysis of Hybrid Systems.",
                    "Integration Graphs: A Class of Decidable Hybrid Systems.",
                    "Hybrid Automata: An Algorithmic Approach to the Specification and Verification of Hybrid Systems.",
                    "Hybrid Systems: The SIGNAL Approach.",
                    "A Dynamical Simulation Facility for Hybrid Systems.",
                    "Event Identification and Intelligent Hybrid Control.",
                    "Multiple Agent Hybrid Control Architecture.",
                    "Models for Hybrid Systems: Automata, Topologies, Controllability, Observability.",
                    "Some Remarks About Flows in Hybrid Systems.",
                    "Hybrid System Modeling and Autonomous Control Systems.",
                    "Fault Accomodation in Feedback Control Systems.",
                    "On Foraml Support for Industrial-Scale Requirements Analysis.",
                    "A Formal Approach to Computer Systems Requirements Documentation."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "1. Hybrid Systems 1991",
        "info": "Ithaca, NY, USA / 2. Hybrid Systems 1992",
        "venues": []
    }
]