[
    {
        "name": "INFORMS",
        "year": "2021",
        "info": "Volume 33: 2021",
        "count": 101,
        "papers": [
            "Note from the Editor.",
            "Approximate Dynamic Programming for Military Medical Evacuation Dispatching Policies.",
            "SDDP.jl: A Julia Package for Stochastic Dual Dynamic Programming.",
            "High-Performance Prototyping of Decomposition Methods in GAMS.",
            "Stochastic Decomposition for Two-Stage Stochastic Linear Programs with Random Cost Coefficients.",
            "Enumeration of the Nondominated Set of Multiobjective Discrete Optimization Problems.",
            "A Branch-and-Price Algorithm for Facility Location with General Facility Cost Functions.",
            "Polyhedral Results and Branch-and-Cut for the Resource Loading Problem.",
            "Optimization for L1-Norm Error Fitting via Data Aggregation.",
            "Exploiting the Structure of Two-Stage Robust Optimization Models with Exponential Scenarios.",
            "Perspective Reformulations of Semicontinuous Quadratically Constrained Quadratic Programs.",
            "Complexity Results and Effective Algorithms for Worst-Case Linear Optimization Under Uncertainties.",
            "Computing Feasible Points of Bilevel Problems with a Penalty Alternating Direction Method.",
            "A Computational Approach to First Passage Problems of Reflected Hyperexponential Jump Diffusion Processes.",
            "Efficient Sampling Allocation Procedures for Optimal Quantile Selection.",
            "Calibration of Voting-Based Helpfulness Measurement for Online Reviews: An Iterative Bayesian Probability Approach.",
            "Sparse Convex Regression.",
            "A Review Selection Method for Finding an Informative Subset from Online Reviews.",
            "Integrating Individual and Aggregate Diversity in Top-N Recommendation.",
            "The Migratory Beekeeping Routing Problem: Model and an Exact Algorithm.",
            "Robust Optimization for Electricity Generation.",
            "Multistage Stochastic Power Generation Scheduling Co-Optimizing Energy and Ancillary Services.",
            "Worst-Case Expected Shortfall with Univariate and Bivariate Marginals.",
            "Piecewise Constant Decision Rules via Branch-and-Bound Based Scenario Detection for Integer Adjustable Robust Optimization.",
            "Decision Diagram Decomposition for Quadratically Constrained Binary Optimization.",
            "Note from the Editor.",
            "Conflict Analysis for MINLP.",
            "Modeling Single-Picker Routing Problems in Classical and Modern Warehouses.",
            "A Branch-and-Price-and-Cut Algorithm for the Cable-Routing Problem in Solar Power Plants.",
            "Vehicle Sequencing at Transshipment Terminals with Handover Relations.",
            "Addressing Orientation Symmetry in the Time Window Assignment Vehicle Routing Problem.",
            "Sparse Solutions by a Quadratically Constrained ℓ q (0 q < 1) Minimization Model.",
            "On the Solution of ℓ0-Constrained Sparse Inverse Covariance Estimation Problems.",
            "A Mixed-Integer Fractional Optimization Approach to Best Subset Selection.",
            "Supervised t-Distributed Stochastic Neighbor Embedding for Data Visualization and Classification.",
            "Data-Driven Preference Learning Methods for Value-Driven Multiple Criteria Sorting with Interacting Criteria.",
            "Semidefinite Programming and Nash Equilibria in Bimatrix Games.",
            "A New Scatter Search Design for Multiobjective Combinatorial Optimization with an Application to Facility Location.",
            "A Learning-Based Matheuristic for Stochastic Multicommodity Network Design.",
            "Selecting the Best Alternative Based on Its Quantile.",
            "Reducing Simulation Input-Model Risk via Input Model Averaging.",
            "Lagrangian Duality for Robust Problems with Decomposable Functions: The Case of a Robust Inventory Problem.",
            "Conflict-Driven Heuristics for Mixed Integer Programming.",
            "Exact Multiple Sequence Alignment by Synchronized Decision Diagrams.",
            "Learning to Solve Large-Scale Security-Constrained Unit Commitment Problems.",
            "Scenario Grouping and Decomposition Algorithms for Chance-Constrained Programs.",
            "Breaking the rmax Barrier: Enhanced Approximation Algorithms for Partial Set Multicover Problem.",
            "Monge Properties, Optimal Greedy Policies, and Policy Improvement for the Dynamic Stochastic Transportation Problem.",
            "A Multistage Stochastic Programming Approach to the Optimal Surveillance and Control of the Emerald Ash Borer in Cities.",
            "Corrigendum to \"A Bucket Indexed Formulation for Nonpreemptive Single Machine Scheduling Problems, \" INFORMS Journal on Computing 28(1): 14-30, 2016.",
            "Note from the Editor.",
            "3-D Dynamic UAV Base Station Location Problem.",
            "Robust Models for the Kidney Exchange Problem.",
            "Tagging Items Automatically Based on Both Content Information and Browsing Behaviors.",
            "Multicomponent Maintenance Optimization: A Stochastic Programming Approach.",
            "Rapid Discrete Optimization via Simulation with Gaussian Markov Random Fields.",
            "The Risk-Averse Static Stochastic Knapsack Problem.",
            "The Quadratic Multiknapsack Problem with Conflicts and Balance Constraints.",
            "Combinatorial Benders Decomposition for the Two-Dimensional Bin Packing Problem.",
            "The Rank-One Quadratic Assignment Problem.",
            "Time-Dependent Shortest Path Problems with Penalties and Limits on Waiting.",
            "A Framework for Solving Chance-Constrained Linear Matrix Inequality Programs.",
            "Extreme Ray Feasibility Cuts for Unit Commitment with Uncertainty.",
            "An Augmented Lagrangian Decomposition Method for Chance-Constrained Optimization Problems.",
            "A Branch-and-Price Framework for Decomposing Graphs into Relaxed Cliques.",
            "An Improved Branch-and-Bound Algorithm for the One-Machine Scheduling Problem with Delayed Precedence Constraints.",
            "Mixed-Integer Convex Nonlinear Optimization with Gradient-Boosted Trees Embedded.",
            "Data-Driven Optimization of Reward-Risk Ratio Measures.",
            "Linearized Robust Counterparts of Two-Stage Robust Optimization Problems with Applications in Operations Management.",
            "A Branch-and-Bound Algorithm for Team Formation on Social Networks.",
            "Knowledge Learning of Insurance Risks Using Dependence Models.",
            "A New Combinatorial Algorithm for Separable Convex Resource Allocation with Nested Bound Constraints.",
            "An Exact Algorithm for Large-Scale Continuous Nonlinear Resource Allocation Problems with Minimax Regret Objectives.",
            "Multiproduct Newsvendor Problem with Customer-Driven Demand Substitution: A Stochastic Integer Program Perspective.",
            "Modeling and Solving the Intersection Inspection Rural Postman Problem.",
            "Note from the Editor.",
            "SDP-Based Bounds for the Quadratic Cycle Cover Problem via Cutting-Plane Augmented Lagrangian Methods and Reinforcement Learning.",
            "frvcpy: An Open-Source Solver for the Fixed Route Vehicle Charging Problem.",
            "Approximation Methods for Multiobjective Optimization Problems: A Survey.",
            "Decomposing Loosely Coupled Mixed-Integer Programs for Optimal Microgrid Design.",
            "Characterizing Social TV Activity Around Televised Events: A Joint Topic Model Approach.",
            "Near-Linear Time Local Polynomial Nonparametric Estimation with Box Kernels.",
            "Multivariable Branching: A 0-1 Knapsack Problem Case Study.",
            "A New Global Optimization Scheme for Quadratic Programs with Low-Rank Nonconvexity.",
            "Improved Computational Approaches and Heuristics for Zero Forcing.",
            "Unifying Online and Offline Preference for Social Link Prediction.",
            "Exact Facetial Odd-Cycle Separation for Maximum Cut and Binary Quadratic Optimization.",
            "Exact Algorithms for the Minimum Load Spanning Tree Problem.",
            "A Branch-and-Bound Algorithm for Building Optimal Data Gathering Tree in Wireless Sensor Networks.",
            "Integer Programming Formulations for Minimum Spanning Tree Interdiction.",
            "Fortification Against Cascade Propagation Under Uncertainty.",
            "Ranking and Selection with Covariates for Personalized Decision Making.",
            "Computing Sensitivities for Distortion Risk Measures.",
            "Robust Capacity Planning for Project Management.",
            "Logic-Based Benders Decomposition and Binary Decision Diagram Based Approaches for Stochastic Distributed Operating Room Scheduling.",
            "Modeling Defender-Attacker Problems as Robust Linear Programs with Mixed-Integer Uncertainty Sets.",
            "Structured Robust Submodular Maximization: Offline and Online Algorithms.",
            "Location-Aware Real-Time Recommender Systems for Brick-and-Mortar Retailers.",
            "Multirow Intersection Cuts Based on the Infinity Norm.",
            "Bilevel Integer Programs with Stochastic Right-Hand Sides.",
            "Chance-Constrained Multiple Bin Packing Problem with an Application to Operating Room Planning."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2020",
        "info": "Volume 32: 2020",
        "count": 73,
        "papers": [
            "Note from the Editor.",
            "Optimization Bounds from the Branching Dual.",
            "A Criterion Space Method for Biobjective Mixed Integer Programming: The Boxed Line Method.",
            "Globally Solving Nonconvex Quadratic Programs via Linear Integer Programming Techniques.",
            "Filtering Algorithms for Biobjective Mixed Binary Linear Optimization Problems with a Multiple-Choice Constraint.",
            "Advanced Tabu Search Algorithms for Bipartite Boolean Quadratic Programs Guided by Strategic Oscillation and Path Relinking.",
            "An Improved Branch-Cut-and-Price Algorithm for Parallel Machine Scheduling Problems.",
            "Enhanced Pseudo-polynomial Formulations for Bin Packing and Cutting Stock Problems.",
            "A Flexible, Natural Formulation for the Network Design Problem with Vulnerability Constraints.",
            "Spectral Analysis of the MIXMAX Random Number Generators.",
            "Sampling Scenario Set Partition Dual Bounds for Multistage Stochastic Programs.",
            "Recursive Calculation Model for a Special Multivariate Normal Probability of First-Order Stationary Sequence.",
            "Probabilistic Analysis of Rumor-Spreading Time.",
            "Convex Optimization for Group Feature Selection in Networked Data.",
            "Note from the Editor.",
            "Robust Quadratic Programming with Mixed-Integer Uncertainty.",
            "On Solving the Quadratic Shortest Path Problem.",
            "Mitigating Information Asymmetry in Liver Allocation.",
            "The Mothership and Drone Routing Problem.",
            "An MDD-Based Lagrangian Approach to the Multicommodity Pickup-and-Delivery TSP.",
            "Solving the Nearly Symmetric All-Pairs Shortest-Path Problem.",
            "Least-Cost Influence Maximization on Social Networks.",
            "Understanding the Impact of Individual Users' Rating Characteristics on the Predictive Accuracy of Recommender Systems.",
            "Scalable, Adaptable, and Fast Estimation of Transient Downtime in Virtual Infrastructures Using Convex Decomposition and Sample Path Randomization.",
            "Successive Quadratic Upper-Bounding for Discrete Mean-Risk Minimization and Network Interdiction.",
            "Online Risk Monitoring Using Offline Simulation.",
            "Estimating the Probability that a Function Observed with Noise Is Convex.",
            "On the Variance of Single-Run Unbiased Stochastic Derivative Estimators.",
            "Relative Robust and Adaptive Optimization.",
            "A New Branch-and-Price-and-Cut Algorithm for One-Dimensional Bin-Packing Problems.",
            "Mathematical Models and Search Algorithms for the Capacitated -Center Problem.",
            "Multiobjective Integer Programming: Synergistic Parallel Approaches.",
            "Presolve Reductions in Mixed Integer Programming.",
            "Piecewise Linear Function Fitting via Mixed-Integer Linear Programming.",
            "On the Derivation of Continuous Piecewise Linear Approximating Functions.",
            "Branch and Price for Chance-Constrained Bin Packing.",
            "Domination Measure: A New Metric for Solving Multiobjective Optimization.",
            "A Branch-Price-and-Cut Procedure for the Discrete Ordered Median Problem.",
            "MILP Models for Complex System Reliability Redundancy Allocation with Mixed Components.",
            "Distributionally Robust Design for Redundancy Allocation.",
            "Optimization-based Mechanisms for the Course Allocation Problem.",
            "Robust Optimization of a Broad Class of Heterogeneous Vehicle Routing Problems Under Demand Uncertainty.",
            "Convex Relaxations for Quadratic On/Off Constraints and Applications to Optimal Transmission Switching.",
            "Transient-State Natural Gas Transmission in Gunbarrel Pipeline Networks.",
            "Learning to Correlate Accounts Across Online Social Networks: An Embedding-Based Approach.",
            "Bilinear Assignment Problem: Large Neighborhoods and Experimental Analysis of Algorithms.",
            "A Lagrangian Bound on the Clique Number and an Exact Algorithm for the Maximum Edge Weight Clique Problem.",
            "An Ellipsoidal Bounding Scheme for the Quasi-Clique Number of a Graph.",
            "Differentially Private Distributed Learning.",
            "Differentially Private and Budget-Limited Bandit Learning over Matroids.",
            "Optimization-Driven Scenario Grouping.",
            "When Lift-and-Project Cuts Are Different.",
            "Assortment Optimization Under the Multinomial Logit Model with Sequential Offerings.",
            "Note from the Editor.",
            "On Mixed-Integer Programming Formulations for the Unit Commitment Problem.",
            "An Approximation Approach for Response-Adaptive Clinical Trial Design.",
            "Optimal Group Testing: Structural Properties and Robust Solutions, with Application to Public Health Screening.",
            "Evaluating a Prediction-Driven Targeting Strategy for Reducing the Transmission of Multidrug-Resistant Organisms.",
            "A Theoretical Framework for Learning Tumor Dose-Response Uncertainty in Individualized Spatiobiologically Integrated Radiotherapy.",
            "The Optimal Design of Low-Latency Virtual Backbones.",
            "Communication-Constrained Expansion Planning for Resilient Distribution Systems.",
            "Sampling Conditionally on a Rare Event via Generalized Splitting.",
            "Understanding and Predicting Users' Rating Behavior: A Cognitive Perspective.",
            "Production and Transportation Integration for Commit-to-Delivery Mode with General Shipping Costs.",
            "An Adaptive Heuristic Approach to Compute Upper and Lower Bounds for the Close-Enough Traveling Salesman Problem.",
            "Simple Pattern Minimality Problems: Integer Linear Programming Formulations and Covering-Based Heuristic Solving Approaches.",
            "A Core-Based Exact Algorithm for the Multidimensional Multiple Choice Knapsack Problem.",
            "Biobjective Simulation Optimization on Integer Lattices Using the Epsilon-Constraint Method in a Retrospective Approximation Framework.",
            "PyMOSO: Software for Multiobjective Simulation Optimization with R-PERLE and R-MinRLE.",
            "Reducing Conservatism in Robust Optimization.",
            "A Practical Scheme to Compute the Pessimistic Bilevel Optimization Problem.",
            "Predictive Analytics with Strategically Missing Data.",
            "Provably Near-Optimal Approximation Schemes for Implicit Stochastic and Sample-Based Dynamic Programs."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2019",
        "info": "Volume 31: 2019",
        "count": 51,
        "papers": [
            "Message from the Editor.",
            "Data-Driven Decisions for Problems with an Unspecified Objective Function.",
            "An Asymptotically Optimal Set Approach for Simulation Optimization.",
            "Dynamic Compressor Optimization in Natural Gas Pipeline Systems.",
            "A New Approach to Real-Time Bidding in Online Advertisements: Auto Pricing Strategy.",
            "An Approximation Algorithm for Capacity Allocation Over a Single Flight Leg with Fare-Locking.",
            "Robust Optimization of Dose-Volume Metrics for Prostate HDR-Brachytherapy Incorporating Target and OAR Volume Delineation Uncertainties.",
            "A Feasibility Pump and Local Search Based Heuristic for Bi-Objective Pure Integer Linear Programming.",
            "A Unified Decomposition Matheuristic for Assembly, Production, and Inventory Routing.",
            "Stochastic Network Design for Planning Scheduled Transportation Services: The Value of Deterministic Solutions.",
            "Exact Approaches for Network Design Problems with Relays.",
            "Transit Pattern Detection Using Tensor Factorization.",
            "Performance Comparison of Machine Learning Platforms.",
            "Efficient Convexification Strategy for Generalized Geometric Programming Problems.",
            "Continuous Variable Neighborhood Search (C-VNS) for Solving Systems of Nonlinear Equations.",
            "Primal Heuristics for Branch and Price: The Assets of Diving Methods.",
            "New Valid Inequalities for the Optimal Communication Spanning Tree Problem.",
            "Target Cuts from Relaxed Decision Diagrams.",
            "Solving Large Batches of Linear Programs.",
            "Modelling Human Decision Behaviour with Preference Learning.",
            "A Branch-and-Bound Approach to the Traveling Salesman Problem with a Drone.",
            "Modeling and Simulation of Nonstationary Non-Poisson Arrival Processes.",
            "Finding Critical Links for Closeness Centrality.",
            "Interdiction Games and Monotonicity, with Application to Knapsack Problems.",
            "Note from the Editor.",
            "No-Wait Scheduling for Locks.",
            "Enriching Solutions to Combinatorial Problems via Solution Engineering.",
            "Robust Maximum Likelihood Estimation.",
            "Identifying Fixations in Gaze Data via Inner Density and Optimization.",
            "An Exact Algorithm for the Quadratic Multiknapsack Problem with an Application to Event Seating.",
            "Integrated Scheduling of Production and Two-Stage Delivery of Make-to-Order Products: Offline and Online Algorithms.",
            "Computing the Moments of Polling Models with Batch Poisson Arrivals by Transform Inversion.",
            "Two-Dimensional Phase Unwrapping via Balanced Spanning Forests.",
            "Real-Time Radiation Treatment Planning with Optimality Guarantees via Cluster and Bound Methods.",
            "Chance-Constrained Surgery Planning Under Conditions of Limited and Ambiguous Data.",
            "Virtual Statistics in Simulation via k Nearest Neighbors.",
            "A Dynamic Programming Approach to Power Consumption Minimization in Gunbarrel Natural Gas Networks with Nonidentical Compressor Units.",
            "Permutations in the Factorization of Simplex Bases.",
            "In Memoriam: Shabbir Ahmed (1969-2019).",
            "Toward Computing the Margin of Victory in Single Transferable Vote Elections.",
            "Vehicle Routing with Space- and Time-Correlated Stochastic Travel Times: Evaluating the Objective Function.",
            "Learning to Rank in Entity Relationship Graphs.",
            "Surrogate Optimization of Computationally Expensive Black-Box Problems with Hidden Constraints.",
            "Identification of Essential Proteins Using Induced Stars in Protein-Protein Interaction Networks.",
            "Group Maintenance: A Restless Bandits Approach.",
            "Planning for Overtime: The Value of Shift Extensions in Physician Scheduling.",
            "An Efficient Morris Method-Based Framework for Simulation Factor Screening.",
            "Level 2 Reformulation Linearization Technique-Based Parallel Algorithms for Solving Large Quadratic Assignment Problems on Graphics Processing Unit Clusters.",
            "Bi-objective Branch-and-Cut Algorithms Based on LP Relaxation and Bound Sets.",
            "Branch-and-Bound for Bi-objective Integer Programming.",
            "A New Exact Algorithm to Optimize a Linear Function over the Set of Efficient Solutions for Biobjective Mixed Integer Linear Programs."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2018",
        "info": "Volume 30: 2018",
        "count": 51,
        "papers": [
            "Space Reduction for a Class of Multidimensional Markov Chains: A Summary and Some Applications.",
            "FiberSCIP - A Shared Memory Parallelization of SCIP.",
            "Computing the Maximum Volume Inscribed Ellipsoid of a Polytopic Projection.",
            "Integer Programming Formulations and Benders Decomposition for the Maximum Induced Matching Problem.",
            "Adaptive Partition-Based Level Decomposition Methods for Solving Two-Stage Stochastic Programs with Fixed Recourse.",
            "A Rare-Event Simulation Algorithm for Periodic Single-Server Queues.",
            "Parallel Scenario Decomposition of Risk-Averse 0-1 Stochastic Programs.",
            "Benchmarking a Scalable Approximate Dynamic Programming Algorithm for Stochastic Control of Grid-Level Energy Storage.",
            "Integrated Supply Chain Management via Randomized Rounding.",
            "Incremental Upper Bound for the Maximum Clique Problem.",
            "Gradient-Based Adaptive Stochastic Search for Simulation Optimization Over Continuous Space.",
            "A Branch-and-Bound Algorithm for the Prize-Collecting Single-Machine Scheduling Problem with Deadlines and Total Tardiness Minimization.",
            "A Data-Driven Model of an Appointment-Generated Arrival Process at an Outpatient Clinic.",
            "Optimal Sampling for Simulated Annealing Under Noise.",
            "Computing Minimum k-Connected m-Fold Dominating Set in General Graphs.",
            "Breaking the O(ln n) Barrier: An Enhanced Approximation Algorithm for Fault-Tolerant Minimum Weight Connected Dominating Set.",
            "Analytics Branching and Selection for the Capacitated Multi-Item Lot Sizing Problem with Nonidentical Machines.",
            "Optimizing Chemoradiotherapy to Target Metastatic Disease and Tumor Growth.",
            "Some Monotonicity Results for Stochastic Kriging Metamodels in Sequential Settings.",
            "Randomized Decomposition Solver with the Quadratic Assignment Problem as a Case Study.",
            "Solving Highly Detailed Gas Transport MINLPs: Block Separability and Penalty Alternating Direction Methods.",
            "Efficient Storage of Pareto Points in Biobjective Mixed Integer Programming.",
            "Automation and Combination of Linear-Programming Based Stabilization Techniques in Column Generation.",
            "An Open-Source Desktop Application for Generating Arc-Routing Benchmark Instances.",
            "Optimal Design of the Seasonal Influenza Vaccine with Manufacturing Autonomy.",
            "Partially Adaptive Stochastic Optimization for Electric Power Generation Expansion Planning.",
            "A Dual Ascent-Based Branch-and-Bound Framework for the Prize-Collecting Steiner Tree and Related Problems.",
            "A Memorial to Harvey J. Greenberg, Founding Editor of the INFORMS Journal on Computing.",
            "Quadratic Combinatorial Optimization Using Separable Underestimators.",
            "T-Closeness Slicing: A New Privacy-Preserving Approach for Transactional Data Publishing.",
            "Portfolio Optimization with Nonparametric Value at Risk: A Block Coordinate Descent Method.",
            "Scenario Generation for Single-Period Portfolio Selection Problems with Tail Risk Measures: Coping with High Dimensions and Integer Variables.",
            "An Extended Mixed-Integer Programming Formulation and Dynamic Cut Generation Approach for the Stochastic Lot-Sizing Problem.",
            "Spare Parts Inventory Management with Substitution-Dependent Reliability.",
            "Lateness Minimization in Pairwise Connectivity Restoration Problems.",
            "Risk Averse Shortest Paths: A Computational Study.",
            "The Vehicle Routing Problem with Floating Targets: Formulation and Solution Approaches.",
            "Structure Detection in Mixed-Integer Programs.",
            "Physician Staffing for Emergency Departments with Time-Varying Demand.",
            "What Works Best When? A Systematic Evaluation of Heuristics for Max-Cut and QUBO.",
            "Disjunctive Programming for Multiobjective Discrete Optimisation.",
            "Computable Error Bounds of Laplace Inversion for Pricing Asian Options.",
            "The Meet-in-the-Middle Principle for Cutting and Packing Problems.",
            "Exact Algorithms for Distributionally β-Robust Machine Scheduling with Uncertain Processing Times.",
            "Surrogate-Based Promising Area Search for Lipschitz Continuous Simulation Optimization.",
            "A Joint Vehicle Routing and Speed Optimization Problem.",
            "Mathematical Programming Algorithms for Spatial Cloaking.",
            "Methods for System Selection Based on Sequential Mean-Variance Analysis.",
            "The Ramping Polytope and Cut Generation for the Unit Commitment Problem.",
            "A Knowledge Gradient Policy for Sequencing Experiments to Identify the Structure of RNA Molecules Using a Sparse Additive Belief Model.",
            "A Branch-and-Price Algorithm for Parallel Machine Scheduling Using ZDDs and Generic Branching."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2017",
        "info": "Volume 29: 2017",
        "count": 48,
        "papers": [
            "Sampling the Functional Kolmogorov Forward Equations for Nonstationary Queueing Networks.",
            "Dynamic Pricing for Network Revenue Management: A New Approach and Application in the Hotel Industry.",
            "Solution of Monotone Complementarity and General Convex Programming Problems Using a Modified Potential Reduction Interior Point Method.",
            "Pricing Problems Under the Nested Logit Model with a Quality Consistency Constraint.",
            "Strengthened Benders Cuts for Stochastic Integer Programs with Continuous Recourse.",
            "Combating Prerelease Piracy: Modeling the Effects of Antipiracy Measures in P2P Networks.",
            "Linear Reformulation of Polynomial Discrete Programming for Fast Computation.",
            "A Backward Sampling Framework for Interdiction Problems with Fortification.",
            "Efficient Computational Analysis of Stationary Probabilities for the Queueing System BMAP/G/1/N With or Without Vacation(s).",
            "Planar Maximum Coverage Location Problem with Partial Coverage and Rectangular Demand and Service Zones.",
            "Constraint Aggregation in Column Generation Models for Resource-Constrained Covering Problems.",
            "A Machine Learning-Based Approximation of Strong Branching.",
            "Enumeration and Cartesian Product Decomposition of Alternate Optimal Fluxes in Cellular Metabolism.",
            "Assessing the Quality of Convex Approximations for Two-Stage Totally Unimodular Integer Recourse Models.",
            "Integrated Production, Inventory and Delivery Problems: Complexity and Algorithms.",
            "An Analytical Throughput Approximation for Closed Fork/Join Networks.",
            "How to Deal with Liars? Designing Intelligent Rule-Based Expert Systems to Increase Accuracy or Reduce Cost.",
            "Multisourcing Supply Network Design: Two-Stage Chance-Constrained Model, Tractable Approximations, and Computational Results.",
            "Algorithms for Generalized Clusterwise Linear Regression.",
            "Using a Conic Bundle Method to Accelerate Both Phases of a Quadratic Convex Reformulation.",
            "Parallel Nonstationary Direct Policy Search for Risk-Averse Stochastic Optimization.",
            "Globalized Robust Optimization for Nonlinear Uncertain Inequalities.",
            "Technical Note: The MAPt/Pht/∞ Queueing System and Multiclass [MAPt/Pht/∞]K Queueing Network.",
            "A Matheuristic for the Multivehicle Inventory Routing Problem.",
            "Lagrangian Heuristics for Large-Scale Dynamic Facility Location with Generalized Modular Capacities.",
            "Incorporating Aggregate Diversity in Recommender Systems Using Scalable Optimization Approaches.",
            "Spatiotemporally Optimal Fractionation in Radiotherapy.",
            "Collaboration Process Pattern Approach to Improving Teamwork Performance: A Data Mining-Based Methodology.",
            "A Branch-and-Bound Algorithm for the Knapsack Problem with Conflict Graph.",
            "A Branch Decomposition Algorithm for the p-Median Problem.",
            "New Enhancements for the Exact Solution of the Vehicle Routing Problem with Time Windows.",
            "Active Learning with Multiple Localized Regression Models.",
            "Progressive Selection Method for the Coupled Lot-Sizing and Cutting-Stock Problem.",
            "Numerically Safe Lower Bounds for the Capacitated Vehicle Routing Problem.",
            "Collaborative Operating Room Planning and Scheduling.",
            "SOCEMO: Surrogate Optimization of Computationally Expensive Multiobjective Problems.",
            "Exact Approaches for Designing Multifacility Buy-at-Bulk Networks.",
            "A Distributed Interior-Point KKT Solver for Multistage Stochastic Optimization.",
            "Fast Approximation Methods for Online Scheduling of Outpatient Procedure Centers.",
            "Algorithm for the N-2 Security-Constrained Unit Commitment Problem with Transmission Switching.",
            "Content and Structure Coverage: Extracting a Diverse Information Subset.",
            "A Graphics Processing Unit Algorithm to Solve the Quadratic Assignment Problem Using Level-2 Reformulation-Linearization Technique.",
            "Approximations for the Queue Length Distributions of Time-Varying Many-Server Queues.",
            "The Vehicle Routing Problem with Release and Due Dates.",
            "Machine Speed Scaling by Adapting Methods for Convex Optimization with Submodular Constraints.",
            "Heuristic Solutions to the Facility Location Problem with General Bernoulli Demands.",
            "Deletion Presolve for Accelerating Infeasibility Diagnosis in Optimization Models.",
            "Formulations and Approximation Algorithms for Multilevel Uncapacitated Facility Location."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2016",
        "info": "Volume 28: 2016",
        "count": 52,
        "papers": [
            "Modeling with Metaconstraints and Semantic Typing of Variables.",
            "A Bucket Indexed Formulation for Nonpreemptive Single Machine Scheduling Problems.",
            "Exploiting Binary Floating-Point Representations for Constraint Propagation.",
            "Discrete Optimization with Decision Diagrams.",
            "Solving the Pricing Problem in a Branch-and-Price Algorithm for Graph Coloring Using Zero-Suppressed Binary Decision Diagrams.",
            "Decomposition Methods for the Parallel Machine Scheduling Problem with Setups.",
            "An AO* Based Exact Algorithm for the Canadian Traveler Problem.",
            "Multilevel Optimization Modeling for Risk-Averse Stochastic Programming.",
            "Classification, Ranking, and Top-K Stability of Recommendation Algorithms.",
            "Application of Submodular Optimization to Single Machine Scheduling with Controllable Processing Times Subject to Release Dates and Deadlines.",
            "Robust Critical Node Selection by Benders Decomposition.",
            "Dual Inequalities for Stabilized Column Generation Revisited.",
            "Dynamic Sampling Allocation and Design Selection.",
            "Cutting Plane Algorithm for Convex Generalized Disjunctive Programs.",
            "Importance Sampling for Option Greeks with Discontinuous Payoffs.",
            "Providing Consistent Opinions from Online Reviews: A Heuristic Stepwise Optimization Approach.",
            "Developing Effective Service Policies for Multiclass Queues with Abandonment: Asymptotic Optimality and Approximate Policy Improvement.",
            "Service Provisioning Problem in Cloud and Multi-Cloud Systems.",
            "A Commonsense Knowledge-Enabled Textual Analysis Approach for Financial Market Surveillance.",
            "The Minimum Spanning k-Core Problem with Bounded CVaR Under Probabilistic Edge Failures.",
            "Approximation of the Quadratic Knapsack Problem.",
            "Bilevel Knapsack with Interdiction Constraints.",
            "Branch-and-Price for Personalized Multiactivity Tour Scheduling.",
            "Sequential Bounding Methods for Two-Stage Stochastic Programs.",
            "The Minimum Expected Penalty Relocation Problem for the Computation of Compliance Tables for Ambulance Vehicles.",
            "Decomposition Algorithms for Risk-Averse Multistage Stochastic Programs with Application to Water Allocation under Uncertainty.",
            "A Game Theoretic Model for the Optimal Location of Integrated Air Defense System Missile Batteries.",
            "Fast Approximation Algorithm for Maximum Lifetime Aggregation Trees in Wireless Sensor Networks.",
            "A Constraint-Programming-Based Branch-and-Price-and-Cut Approach for Operating Room Planning and Scheduling.",
            "Iterative Refinement for Linear Programming.",
            "A Horizon Decomposition Approach for the Capacitated Lot-Sizing Problem with Setup Times.",
            "Improving the Integer L-Shaped Method.",
            "Duality in Two-Stage Adaptive Linear Optimization: Faster Computation and Stronger Bounds.",
            "Modeling and Optimization of a Spatial Detection System.",
            "Risk-Averse Shortest Path Interdiction.",
            "Using GPU Computing for Solving the Two-Dimensional Guillotine Cutting Problem.",
            "Multistage Adjustable Robust Mixed-Integer Optimization via Iterative Splitting of the Uncertainty Set.",
            "Optimization-Based Very Large-Scale Neighborhood Search for Generalized Assignment Problems with Location/Allocation Considerations.",
            "Exact Solution Methods for a Generalized Assignment Problem with Location/Allocation Considerations.",
            "(s, S) Inventory Systems with Correlated Demands.",
            "Automated Multilateral Negotiation on Multiple Issues with Private Information.",
            "Efficient VaR and CVaR Measurement via Stochastic Kriging.",
            "Convex Relaxations for Gas Expansion Planning.",
            "The Surgical Patient Routing Problem: A Central Planner Approach.",
            "A Branch-and-Price Algorithm for Solving the Hamiltonian p-Median Problem.",
            "Computing Near-Optimal Stable Cost Allocations for Cooperative Games by Lagrangian Relaxation.",
            "An Exact Algorithm for the Two-Dimensional Stage-Unrestricted Guillotine Cutting/Packing Decision Problem.",
            "Optimal Learning in Linear Regression with Combinatorial Feature Selection.",
            "Modeling Two-Dimensional Guillotine Cutting Problems via Integer Programming.",
            "A Branch-and-Bound Algorithm for the Close-Enough Traveling Salesman Problem.",
            "Local Cuts and Two-Period Convex Hull Closures for Big-Bucket Lot-Sizing Problems.",
            "An Adaptive Flex-Deluge Approach to University Exam Timetabling."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2015",
        "info": "Volume 27: 2015",
        "count": 51,
        "papers": [
            "The Recoverable Robust Two-Level Network Design Problem.",
            "Statistical Database Auditing Without Query Denial Threat.",
            "Column-Generation Framework of Nonlinear Similarity Model for Reconstructing Sibling Groups.",
            "A Cutting-Plane Neighborhood Structure for Fixed-Charge Capacitated Multicommodity Network Design Problem.",
            "Algorithmic Approach for Improved Mixed-Integer Reformulations of Convex Generalized Disjunctive Programs.",
            "On Bounding the Bandwidth of Graphs with Symmetry.",
            "Solving Hierarchical Stochastic Programs: Application to the Maritime Fleet Renewal Problem.",
            "Maintaining Secure and Reliable Distributed Control Systems.",
            "A Computational Study of Exact Approaches for the Bi-Objective Prize-Collecting Steiner Tree Problem.",
            "A Strong Preemptive Relaxation for Weighted Tardiness and Earliness/Tardiness Problems on Unrelated Parallel Machines.",
            "New Heuristic Approaches for the Bounded-Diameter Minimum Spanning Tree Problem.",
            "Solving the Maximum Clique and Vertex Coloring Problems on Very Large Sparse Networks.",
            "An Integer Programming Approach for Fault-Tolerant Connected Dominating Sets.",
            "Book Reviews.",
            "Multivariate Mixtures of Normal Distributions: Properties, Random Vector Generation, Fitting, and as Models of Market Daily Changes.",
            "The Generalized Regenerator Location Problem.",
            "Dynamic Programming Driven Memetic Search for the Steiner Tree Problem with Revenues, Budget, and Hop Constraints.",
            "Computing in Operations Research Using Julia.",
            "A Network Structural Approach to the Link Prediction Problem.",
            "Solving Variants of the Job Shop Scheduling Problem Through Conflict-Directed Search.",
            "Optimal Budget Allocation Across Search Advertising Markets.",
            "Chance-Constrained Programming Models and Approximations for General Stochastic Bottleneck Spanning Tree Problems.",
            "Chance Constrained Selection of the Best.",
            "Approximation Methods for Pricing Problems Under the Nested Logit Model with Price Bounds.",
            "Importance Sampling in Stochastic Programming: A Markov Chain Monte Carlo Approach.",
            "A New Semidefinite Programming Relaxation for the Quadratic Assignment Problem and Its Computational Perspectives.",
            "Heuristic and Exact Algorithms for the Interval Min-Max Regret Knapsack Problem.",
            "Model Counting of Monotone Conjunctive Normal Form Formulas with Spectra.",
            "A Scenario Decomposition Algorithm for Stochastic Programming Problems with a Class of Downside Risk Measures.",
            "Period Decompositions for the Capacitated Lot Sizing Problem with Setup Times.",
            "Automatic Minimal-Height Table Layout.",
            "Optimal Policies for Security Patch Management.",
            "Online Checkpointing with Improved Worst-Case Guarantees.",
            "Achieving Rapid Recovery in an Overload Control for Large-Scale Service Systems.",
            "Robust Network Design with Uncertain Outsourcing Cost.",
            "Optimal Hour-Ahead Bidding in the Real-Time Electricity Market with Battery Storage Using Approximate Dynamic Programming.",
            "Optimization of Industrial-Scale Assemble-to-Order Systems.",
            "Learning Context-Sensitive Domain Ontologies from Folksonomies: A Cognitively Motivated Method.",
            "A Criterion Space Search Algorithm for Biobjective Mixed Integer Programming: The Triangle Splitting Method.",
            "Growth Projections and Assortment Planning of Commodity Products Across Multiple Stores: A Data Mining and Optimization Approach.",
            "A 3/2-Approximation Algorithm for the Multiple TSP with a Fixed Number of Depots.",
            "Linear Programming and the Control of Diffusion Processes.",
            "Exact and Heuristic Algorithms for Capacitated Vehicle Routing Problems with Quadratic Costs Structure.",
            "Roundoff-Error-Free Algorithms for Solving Linear Systems via Cholesky and LU Factorizations.",
            "Achieving Domain Consistency and Counting Solutions for Dispersion Constraints.",
            "Cloud Computing in Space.",
            "Machine Learning Approaches for Early DRG Classification and Resource Allocation.",
            "A Criterion Space Search Algorithm for Biobjective Integer Programming: The Balanced Box Method.",
            "A Progressive Hedging Approach for Surgery Planning Under Uncertainty.",
            "Improved Primal Simplex: A More General Theoretical Framework and an Extended Experimental Analysis.",
            "Optimization of Radiation Therapy Fractionation Schedules in the Presence of Tumor Repopulation."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2014",
        "info": "Volume 26: 2014",
        "count": 60,
        "papers": [
            "Survivability in Hierarchical Telecommunications Networks Under Dual Homing.",
            "An Efficient Semidefinite Programming Relaxation for the Graph Partition Problem.",
            "An Outer-Inner Approximation for Separable Mixed-Integer Nonlinear Programs.",
            "The Supervised Normalized Cut Method for Detecting, Classifying, and Identifying Special Nuclear Materials.",
            "Algorithms for Time-Varying Networks of Many-Server Fluid Queues.",
            "Quantifying Input Uncertainty via Simulation Confidence Intervals.",
            "An Exact Algorithm Based on Cut-and-Column Generation for the Capacitated Location-Routing Problem.",
            "Formulations and Branch-and-Cut Algorithms for Multivehicle Production and Inventory Routing Problems.",
            "On the Approximate Linear Programming Approach for Network Revenue Management Problems.",
            "Dynamic Container Deployment: Two-Stage Robust Model, Complexity, and Computational Results.",
            "Online Sequential Optimization with Biased Gradients: Theory and Applications to Censored Demand.",
            "Mathematical Programming Formulations and Algorithms for Discrete k-Median Clustering of Time-Series Data.",
            "A Dynamic Programming Heuristic for the Quadratic Knapsack Problem.",
            "The Weighted Set Covering Game: A Vaccine Pricing Model for Pediatric Immunization.",
            "Optimizing the Layout of Proportional Symbol Maps: Polyhedra and Computation.",
            "A Tree-Based Contrast Set-Mining Approach to Detecting Group Differences.",
            "On the Practical Strength of Two-Row Tableau Cuts.",
            "Cost-Sensitive Decision Tree Induction with Label-Dependent Late Constraints.",
            "Optimization Bounds from Binary Decision Diagrams.",
            "Constructing Discrete Unbounded Distributions with Gaussian-Copula Dependence and Given Rank Correlation.",
            "An Approximation Algorithm for the Continuous k-Medians Problem in a Convex Polygon.",
            "Resource-Constrained Assignment Problems with Shared Resource Consumption and Flexible Demand.",
            "Constrained Min-Cut Replication for K-Way Hypergraph Partitioning.",
            "The Robust (Minmax Regret) Quadratic Assignment Problem with Interval Flows.",
            "On Chubanov's Method for Linear Programming.",
            "Optimization-Based Approaches for Maximizing Aggregate Recommendation Diversity.",
            "Penalty-Based Algorithms for the Stochastic Obstacle Scene Problem.",
            "Conditional Value-at-Risk Approximation to Value-at-Risk Constrained Programs: A Remedy via Monte Carlo.",
            "New Formulations for Choice Network Revenue Management.",
            "An Integer-Programming-Based Approach to the Close-Enough Traveling Salesman Problem.",
            "Association Rules for Recommendations with Multiple Items.",
            "On the Lattice Structure of a Special Class of Multiple Recursive Random Number Generators.",
            "Effective Active Learning Strategies for the Use of Large-Margin Classifiers in Semantic Annotation: An Optimal Parameter Discovery Perspective.",
            "Regression Models Augmented with Direct Stochastic Gradient Estimators.",
            "Multiobjective Interacting Particle Algorithm for Global Optimization.",
            "Enhanced Models for a Mixed Arrival-Departure Aircraft Sequencing Problem.",
            "Covering Linear Programming with Violations.",
            "Complexity and Approximation Results for the Balance Optimization Subset Selection Model for Causal Inference in Observational Studies.",
            "Solving a Multigroup Mixed-Integer Programming-Based Constrained Discrimination Model.",
            "Domain Adaptation for Sentiment Classification in Light of Multiple Sources.",
            "Optimal Implantable Cardioverter Defibrillator (ICD) Generator Replacement.",
            "On Convergence Rates of Convex Regression in Multiple Dimensions.",
            "A Game-Theoretic Approach to Graph Clustering.",
            "Benders Decomposition, Branch-and-Cut, and Hybrid Algorithms for the Minimum Connected Dominating Set Problem.",
            "A Decomposition-Based Heuristic for Collaborative Scheduling in a Network of Open-Pit Mines.",
            "A Zig-Zag Approach for Competitive Group Testing.",
            "Improving the Performance of MIQP Solvers for Quadratic Programs with Cardinality and Minimum Threshold Constraints: A Semidefinite Program Approach.",
            "A Wide Branching Strategy for the Graph Coloring Problem.",
            "A Linear-Programming Approximation of AC Power Flows.",
            "Chance-Constrained Binary Packing Problems.",
            "Efficient Use of Semidefinite Programming for Selection of Rotamers in Protein Conformations.",
            "Lot Sizing with Piecewise Concave Production Costs.",
            "Computational Experiments with Cross and Crooked Cross Cuts.",
            "Integrated Facility Layout Design and Flow Assignment Problem Under Uncertainty.",
            "Districting for Arc Routing.",
            "Two-Stage Decomposition Algorithms for Single Product Maritime Inventory Routing.",
            "Estimating Sensitivities of Portfolio Credit Risk Using Monte Carlo.",
            "Role Refinement in Access Control: Model and Analysis.",
            "Computing the Distribution for the Number of Renewals with Bulk Arrivals.",
            "Chance-Constrained Optimization of Reliable Fixed Broadband Wireless Networks."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2013",
        "info": "Volume 25: 2013",
        "count": 61,
        "papers": [
            "Message from the Editor.",
            "A Network Simplex Algorithm for the Equal Flow Problem on a Generalized Network.",
            "Benders Decomposition for the Hop-Constrained Survivable Network Design Problem.",
            "Max-k-Cut by the Discrete Dynamic Convexized Method.",
            "A Branch-and-Cut Algorithm for the Double Traveling Salesman Problem with Multiple Stacks.",
            "Static Network Reliability Estimation via Generalized Splitting.",
            "A New Graph-Theoretical Model for the Guillotine-Cutting Problem.",
            "Rational Automata Networks: A Non-Markovian Modeling Approach.",
            "Assessing the Value of Dynamic Pricing in Network Revenue Management.",
            "Dynamic Appointment Scheduling of a Stochastic Server with Uncertain Demand.",
            "An Adaptive Hyperbox Algorithm for High-Dimensional Discrete Optimization via Simulation Problems.",
            "Convex Approximations of a Probabilistic Bicriteria Model with Disruptions.",
            "Discovery of Online Shopping Patterns Across Websites.",
            "Steady-State Simulation with Replication-Dependent Initial Transients: Analysis and Examples.",
            "An Exact Algorithm for the Multitrip Vehicle Routing Problem.",
            "A New Local Search Algorithm for Binary Optimization.",
            "On Maximum Speedup Ratio of Restart Algorithm Portfolios.",
            "Stochastic Trust-Region Response-Surface Method (STRONG) - A New Response-Surface Framework for Simulation Optimization.",
            "Bin Packing with Conflicts: A Generic Branch-and-Price Algorithm.",
            "Layered Graph Approaches to the Hop Constrained Connected Facility Location Problem.",
            "Valid Linear Programming Bounds for Exact Mixed-Integer Programming.",
            "Critically Loaded Time-Varying Multiserver Queues: Computational Challenges and Approximations.",
            "Branch-and-Price Guided Search for Integer Programs with an Application to the Multicommodity Fixed-Charge Network Flow Problem.",
            "Rapid Screening Procedures for Zero-One Optimization via Simulation.",
            "A Binary Search Heuristic Algorithm Based on Randomized Local Search for the Rectangular Strip-Packing Problem.",
            "A Powerful Genetic Algorithm Using Edge Assembly Crossover for the Traveling Salesman Problem.",
            "Expected Tardiness Computations in Multiclass Priority M/M/c Queues.",
            "An Algorithm for Approximating Convex Pareto Surfaces Based on Dual Techniques.",
            "From the Editor.",
            "Robust Modified Policy Iteration.",
            "A Time Predefined Variable Depth Search for Nurse Rostering.",
            "Separation and Extension of Cover Inequalities for Conic Quadratic Knapsack Constraints with Generalized Upper Bounds.",
            "I-SMOOTH: Iteratively Smoothing Mean-Constrained and Nonnegative Piecewise-Constant Functions.",
            "Column Generation for the Minimum Hyperplanes Clustering Problem.",
            "Grammar-Based Column Generation for Personalized Multi-Activity Shift Scheduling.",
            "Combining Lift-and-Project and Reduce-and-Split.",
            "Scenario Trees and Policy Selection for Multistage Stochastic Programming Using Machine Learning.",
            "Self-Organized Formation and Evolution of Peer-to-Peer Networks.",
            "Base Model Combination Algorithm for Resolving Tied Predictions for K-Nearest Neighbor OVA Ensemble Models.",
            "Optimal Sampling Laws for Stochastically Constrained Simulation Optimization on Finite Sets.",
            "Flexible Process Compliance with Semantic Constraints Using Mixed-Integer Programming.",
            "Uncommon Dantzig-Wolfe Reformulation for the Temporal Knapsack Problem.",
            "Approximation Algorithms for Integrated Distribution Network Design Problems.",
            "Exact Algorithms for a Bandwidth Packing Problem with Queueing Delay Guarantees.",
            "Book Reviews.",
            "The Cunningham-Geelen Method in Practice: Branch-Decompositions and Integer Programming.",
            "Exact Approaches to Multilevel Vertical Orderings.",
            "Efficient Risk Hedging by Dynamic Forward Pricing: A Study in Cloud Computing.",
            "A Logarithmic Method for Reducing Binary Variables and Inequality Constraints in Solving Task Assignment Problems.",
            "Zigzag Search for Continuous Multiobjective Optimization.",
            "Safe Approximations of Ambiguous Chance Constraints Using Historical Data.",
            "Stochastic Operating Room Scheduling for High-Volume Specialties Under Block Booking.",
            "Backdoor Branching.",
            "Construction of Risk-Averse Enhanced Index Funds.",
            "An Efficient Approach for Solving Reliable Facility Location Models.",
            "Dividing a Territory Among Several Facilities.",
            "Efficient Transient Analysis of Markovian Models Using a Block Reduction Approach.",
            "Fitting the Pht/Mt/s/c Time-Dependent Departure Process for Use in Tandem Queueing Networks.",
            "A New General-Purpose Method for the Computation of the Interval Availability Distribution.",
            "Positive-versus-Negative Classification for Model Aggregation in Predictive Data Mining.",
            "Approximating the Split Closure."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2012",
        "info": "Volume 24: 2012",
        "count": 47,
        "papers": [
            "Automating Bivariate Transformations.",
            "Transient Queueing Analysis.",
            "Efficient and Reliable Computation of Birth-Death Process Performance Measures.",
            "An Algorithm for Fitting Heavy-Tailed Distributions via Generalized Hyperexponentials.",
            "An Asymptotic Test of Optimality Conditions in Multiresponse Simulation Optimization.",
            "Constraint-Based Local Search for Inventory Control Under Stochastic Demand and Lead Time.",
            "Exact Solution of Graph Coloring Problems via Constraint Programming and Column Generation.",
            "A Hybrid Heuristic for an Inventory Routing Problem.",
            "Shilling Attack Detection - A New Approach for a Trustworthy Recommender System.",
            "A Time Bucket Formulation for the Traveling Salesman Problem with Time Windows.",
            "Computing Near-Optimal Policies in Generalized Joint Replenishment.",
            "Computational Testing of a Separation Procedure for the Knapsack Set with a Single Continuous Variable.",
            "Disjunctive Decomposition for Two-Stage Stochastic Mixed-Binary Programs with Generalized Upper Bound Constraints.",
            "Core Routing on Dynamic Time-Dependent Road Networks.",
            "A Level-3 Reformulation-Linearization Technique-Based Bound for the Quadratic Assignment Problem.",
            "Data-Mining-Driven Neighborhood Search.",
            "An Optimal Constraint Programming Approach to the Open-Shop Problem.",
            "Finding All Stable Pairs and Solutions to the Many-to-Many Stable Matching Problem.",
            "An Exact Method for Balancing Efficiency and Equity in the Liver Allocation Hierarchy.",
            "The Balanced Minimum Evolution Problem.",
            "C-NORTA: A Rejection Procedure for Sampling from the Tail of Bivariate NORTA Distributions.",
            "A Study of Quality and Accuracy Trade-offs in Process Mining.",
            "An Improved Branch-and-Bound Method for Maximum Monomial Agreement.",
            "A Hybrid Tabu Search and Constraint Programming Algorithm for the Dynamic Dial-a-Ride Problem.",
            "New State-Space Relaxations for Solving the Traveling Salesman Problem with Time Windows.",
            "Discovery of Periodic Patterns in Sequence Data: A Variance-Based Approach.",
            "Using Logic-Based Benders Decomposition to Solve the Capacity- and Distance-Constrained Plant Location Problem.",
            "CORAL: An Exact Algorithm for the Multidimensional Knapsack Problem.",
            "On the Prevention of Fraud and Privacy Exposure in Process Information Flow.",
            "A Branch, Bound, and Remember Algorithm for the Simple Assembly Line Balancing Problem.",
            "A Branch-and-Cut Approach for the Minimum-Energy Broadcasting Problem in Wireless Networks.",
            "Data Structures for Higher-Dimensional Rectilinear Packing.",
            "Robust Optimization in Simulation: Taguchi and Krige Combined.",
            "Coloring Graphs Using Two Colors While Avoiding Monochromatic Cycles.",
            "Robust Software Partitioning with Multiple Instantiation.",
            "From the Editor.",
            "Quantifying the Trade-off Between IMRT Treatment Plan Quality and Delivery Efficiency Using Direct Aperture Optimization.",
            "The Generalized Covering Salesman Problem.",
            "A Generic Branch-and-Cut Algorithm for Multiobjective Optimization Problems: Application to the Multilabel Traveling Salesman Problem.",
            "Dividing a Territory Among Several Vehicles.",
            "The Fixed-Charge Shortest-Path Problem.",
            "A Simple but Usually Fast Branch-and-Bound Algorithm for the Capacitated Facility Location Problem.",
            "Structural Search and Optimization in Social Networks.",
            "Finite-Sample Performance of Absolute Precision Stopping Rules.",
            "Large-Order Multiple Recursive Generators with Modulus 231 - 1.",
            "A Mathematical Framework for Data Quality Management in Enterprise Systems.",
            "SMART: A Stochastic Multiscale Model for the Analysis of Energy Resources, Technology, and Policy."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2011",
        "info": "Volume 23: 2011",
        "count": 47,
        "papers": [
            "Combining Constraint Programming and Local Search for Job-Shop Scheduling.",
            "A Parallel Branch-and-Bound Approach to the Rectangular Guillotine Strip Cutting Problem.",
            "Decorous Lower Bounds for Minimum Linear Arrangement.",
            "Branch and Price for Large-Scale Capacitated Hub Location Problems with Single Assignment.",
            "Branch and Price for WDM Optical Networks with No Bifurcation of Flow.",
            "The Robust Network Loading Problem Under Hose Demand Uncertainty: Formulation, Polyhedral Analysis, and Computations.",
            "A Fully Distributed Lagrangean Solution for a Peer-to-Peer Overlay Network Design Problem.",
            "Dynamic Programming-Based Column Generation on Time-Expanded Networks: Application to the Dial-a-Flight Problem.",
            "Solving Talent Scheduling with Dynamic Programming.",
            "Why Does Collaborative Filtering Work? Transaction-Based Recommendation Model Validation and Selection by Analyzing Bipartite Random Graphs.",
            "Algorithms for Coxianization of Phase-Type Generators.",
            "Triangular M/G/1-Type and Tree-Like Quasi-Birth-Death Markov Chains.",
            "From the Editor.",
            "Sequential Grid Computing: Models and Computational Experiments.",
            "Decision Support and Optimization in Shutdown and Turnaround Scheduling.",
            "Resource Allocation via Message Passing.",
            "Operating Room Pooling and Parallel Surgery Processing Under Uncertainty.",
            "An Automated and Data-Driven Bidding Strategy for Online Auctions.",
            "Computing a Classic Index for Finite-Horizon Bandits.",
            "An Efficient and Numerically Stable Method for Computing Bounds for the Interval Availability Distribution.",
            "An Algorithm for Data Envelopment Analysis.",
            "Performance of Skart: A Skewness- and Autoregression-Adjusted Batch Means Procedure for Simulation Analysis.",
            "A Parallel Algorithm for the Vehicle Routing Problem.",
            "A Randomized Exhaustive Propositionalization Approach for Molecule Classification.",
            "The Knowledge-Gradient Algorithm for Sequencing Experiments in Drug Discovery.",
            "A Cluster-Based Context-Tree Model for Multivariate Data Streams with Applications to Anomaly Detection.",
            "A Linearly Convergent Linear-Time First-Order Algorithm for Support Vector Classification with a Core Set Result.",
            "Predicting the Solution Time of Branch-and-Bound Algorithms for Mixed-Integer Programs.",
            "A Branch-and-Price Algorithm for the Bin Packing Problem with Conflicts.",
            "Lifted Tableaux Inequalities for 0-1 Mixed-Integer Programs: A Computational Study.",
            "Minimal Equivalent Binary Knapsack Inequalities.",
            "Efficient Optimization of Reliable Two-Node Connected Networks: A Biobjective Approach.",
            "Color-Coding Algorithms to the Balanced Path Problem: Computational Issues.",
            "Preprocessing Stochastic Shortest-Path Problems with Application to PERT Activity Networks.",
            "The Reliable Facility Location Problem: Formulations, Heuristics, and Approximation Algorithms.",
            "An Efficient Global Approach for Posynomial Geometric Programming Problems.",
            "Enhancement of Sandwich Algorithms for Approximating Higher-Dimensional Convex Pareto Sets.",
            "Optimal Testing of Digital Microfluidic Biochips.",
            "New Stabilization Procedures for the Cutting Stock Problem.",
            "Solving Large p-Median Problems with a Radius Formulation.",
            "Optimization of Supply Chain Systems with Price Elasticity of Demand.",
            "An Improved Primal Simplex Algorithm for Degenerate Linear Programs.",
            "Experiments with Two-Row Cuts from Degenerate Tableaux.",
            "A Method for Approximating Univariate Convex Functions Using Only Function Value Evaluations.",
            "Combination of Nonlinear and Linear Optimization of Transient Gas Networks.",
            "A New Evolutionary Algorithm for a Class of Nonlinear Bilevel Programming Problems and Its Global Convergence.",
            "A Clock-and-Offer Auction Market for Grid Resources When Bidders Face Stochastic Computational Needs."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2010",
        "info": "Volume 22: 2010",
        "count": 53,
        "papers": [
            "From the Editor.",
            "Feature Article - Merging AI and OR to Solve High-Dimensional Stochastic Optimization Problems Using Approximate Dynamic Programming.",
            "Commentary - Perspectives on Stochastic Optimization Over Time.",
            "Commentary - Post-Decision States and Separable Approximations Are Powerful Tools of Approximate Dynamic Programming.",
            "Rejoinder - The Languages of Stochastic Optimization.",
            "Convexity and Concavity Detection in Computational Graphs: Tree Walks for Convexity Assessment.",
            "Nonconvex Robust Optimization for Problems with Constraints.",
            "A Heuristic for Nonlinear Global Optimization.",
            "Sequential Sampling to Myopically Maximize the Expected Value of Information.",
            "An Algorithm for Fast Generation of Bivariate Poisson Random Vectors.",
            "A Generalized Wedelin Heuristic for Integer Programming.",
            "Pruning Moves.",
            "Setting the Research Agenda in Automated Timetabling: The Second International Timetabling Competition.",
            "An Inexact Bundle Approach to Cutting-Stock Problems.",
            "Feasibility and Constraint Analysis of Sets of Linear Matrix Inequalities.",
            "Binarized Support Vector Machines.",
            "Exact Algorithms for the Quadratic Linear Ordering Problem.",
            "From the Editor.",
            "New Optimization Model and Algorithm for Sibling Reconstruction from Genetic Markers.",
            "A Class Representative Model for Pure Parsimony Haplotyping.",
            "TreeHugger: A New Test for Enrichment of Gene Ontology Terms.",
            "A Tree Search Algorithm for Solving the Container Loading Problem.",
            "Two-Step MIR Inequalities for Mixed Integer Programs.",
            "The Multidimensional Knapsack Problem: Structure and Algorithms.",
            "Approximate Dynamic Programming for Ambulance Redeployment.",
            "A Lagrangean Heuristic for Hub-and-Spoke System Design with Capacity Selection and Congestion.",
            "Path-Reduced Costs for Eliminating Arcs in Routing and Scheduling.",
            "Combining Exact and Heuristic Approaches for the Capacitated Fixed-Charge Network Flow Problem.",
            "The Uncapacitated Time-Space Fixed-Charge Network Flow Problem: An Empirical Investigation of Procedures for Arc Capacity Assignment.",
            "Algorithms for Recognizing Economic Properties in Matrix Bid Combinatorial Auctions.",
            "Adaptive Auction Mechanism Design and the Incorporation of Prior Knowledge.",
            "A Recursive Algorithm for Finding All Nondominated Extreme Points in the Outcome Set of a Multiobjective Integer Programme.",
            "Solving the Order-Preserving Submatrix Problem via Integer Programming.",
            "Algorithms for the Bin Packing Problem with Conflicts.",
            "On the Numerical Analysis of Inhomogeneous Continuous-Time Markov Chains.",
            "The Valve Location Problem in Simple Network Topologies.",
            "A Dynamic Programming Decomposition Method for Making Overbooking Decisions Over an Airline Network.",
            "Least-Squares Support Vector Machine Approach to Viral Replication Origin Prediction.",
            "Freedom of Privacy: Anonymous Data Collection with Respondent-Defined Privacy Protection.",
            "Improving the Efficiency and Efficacy of Controlled Sequential Bifurcation for Simulation Factor Screening.",
            "A Note on \"A Superior Representation Method for Piecewise Linear Functions\".",
            "From the Editor.",
            "Integrated Airline Schedule Design and Fleet Assignment: Polyhedral Analysis and Benders' Decomposition Approach.",
            "Incremental Satisfiability and Implication for UTVPI Constraints.",
            "Bicriteria p-Hub Location Problems and Evolutionary Algorithms.",
            "Scalable Heuristics for a Class of Chance-Constrained Stochastic Programs.",
            "FilMINT: An Outer Approximation-Based Solver for Convex Mixed-Integer Nonlinear Programs.",
            "An Automated Intensity-Modulated Radiation Therapy Planning System.",
            "Dual-Based Local Search for the Connected Facility Location and Related Problems.",
            "Combination of Metaheuristic and Exact Algorithms for Solving Set Covering-Type Optimization Problems.",
            "The Nested Event Tree Model with Application to Combating Terrorism.",
            "MRSA Transmission Reduction Using Agent-Based Modeling and Simulation.",
            "Appreciation to Referees."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2009",
        "info": "Volume 21: 2009",
        "count": 50,
        "papers": [
            "Single-Machine Scheduling Problems with Generalized Preemption.",
            "Exact and Asymptotically Exact Solutions for a Class of Assortment Problems.",
            "Advanced Scatter Search for the Max-Cut Problem.",
            "Pareto Optima of Multicriteria Integer Linear Programs.",
            "An Optimal Constrained Pruning Strategy for Decision Trees.",
            "A Response Surface Approach to Beam Orientation Optimization in Intensity-Modulated Radiation Therapy Treatment Planning.",
            "Minimax Regret Single-Facility Ordered Median Location Problems on Networks.",
            "Efficient Correlation Matching for Fitting Discrete Multivariate Distributions with Arbitrary Marginals and Normal-Copula Dependence.",
            "Extending Algebraic Modelling Languages for Stochastic Programming.",
            "Solving Lot-Sizing Problems on Parallel Identical Machines Using Symmetry-Breaking Constraints.",
            "Linear-Programming-Based Lifting and Its Application to Primal Cutting-Plane Algorithms.",
            "A Set-Covering Approach with Column Generation for Parsimony Haplotyping.",
            "New Exact Algorithms for One-Machine Earliness-Tardiness Scheduling.",
            "From the Editor.",
            "Reinforcement Learning: A Tutorial Survey and Recent Advances.",
            "Balanced Explorative and Exploitative Search with Estimation for Simulation Optimization.",
            "Efficient Computation of Sparse Hessians Using Coloring and Automatic Differentiation.",
            "A New Sequential Extraction Heuristic for Optimizing the Delivery of Cancer Radiation Treatment Using Multileaf Collimators.",
            "StAMPL: A Filtration-Oriented Modeling Tool for Multistage Stochastic Recourse Problems.",
            "A Complementarity Constraint Formulation of Convex Multiobjective Optimization Problems.",
            "Scenario Tree-Based Heuristics for Stochastic Inventory-Routing Problems.",
            "The Time-Series Link Prediction Problem with Applications in Communication Surveillance.",
            "Solving Hard Mixed-Integer Programming Problems with Xpress-MP: A MIPLIB 2003 Case Study.",
            "A Superior Representation Method for Piecewise Linear Functions.",
            "A Dynamic Programming Algorithm for the Generalized Minimum Filter Placement Problem on Tree Structures.",
            "Accelerating Benders Decomposition by Local Branching.",
            "From the Editor - Special Cluster on High-Throughput Optimization.",
            "Grid-Enabled Optimization with GAMS.",
            "Transparent Parallelization of Constraint Programming.",
            "Computational Experience with a Software Framework for Parallel Integer Programming.",
            "Simultaneous Batching and Scheduling Using Dynamic Decomposition on a Grid.",
            "Parallel Stochastic Global Optimization Using Radial Basis Functions.",
            "Solving Beam-Angle Selection and Dose Optimization Simultaneously via High-Throughput Computing.",
            "Improving Bounds on the Football Pool Problem by Integer Programming and High-Throughput Computing.",
            "Synthetic Optimization Problem Generation: Show Us the Correlations!",
            "A Component-Based Heuristic Search Method with Evolutionary Eliminations for Hospital Personnel Scheduling.",
            "Enhanced Cut Generation Methods for Decomposition-Based Branch and Cut for Two-Stage Stochastic Mixed-Integer Programs.",
            "Dimension Reduction Techniques in Quasi-Monte Carlo Methods for Option Pricing.",
            "A Simulated Annealing Enhancement of the Best-Fit Heuristic for the Orthogonal Stock-Cutting Problem.",
            "From the Editor.",
            "State-of-the Art Review - Evolutionary Algorithms for Vehicle Routing.",
            "A Constraint Programming Approach for Solving a Queueing Design and Control Problem.",
            "An Exact Method for the Minimum Cardinality Problem in the Treatment Planning of Intensity-Modulated Radiotherapy.",
            "An Encoding in Metaheuristics for the Minimum Communication Spanning Tree Problem.",
            "On the Integrated Production and Distribution Problem with Bidirectional Flows.",
            "The Knowledge-Gradient Policy for Correlated Normal Beliefs.",
            "An Algorithm and a Core Set Result for the Weighted Euclidean One-Center Problem.",
            "Transforming Renewal Processes for Simulation of Nonstationary Arrival Processes.",
            "Numerically Safe Gomory Mixed-Integer Cuts.",
            "Appreciation to Referees."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2008",
        "info": "Volume 20: 2008",
        "count": 53,
        "papers": [
            "Monitoring an Information Source Under a Politeness Constraint.",
            "The Integrated Production and Transportation Scheduling Problem for a Product with a Short Lifespan.",
            "Discovering Generalized Profile-Association Rules for the Targeted Advertising of New Products.",
            "Decision-Tree-Based Knowledge Discovery: Single- vs. Multi-Decision-Tree Induction.",
            "Scatter Search for the Point-Matching Problem in 3D Image Registration.",
            "A Constraint Logic Programming Algorithm for Modeling Dynamic Pricing.",
            "A Model for Fresh Produce Shelf-Space Allocation and Inventory Management with Freshness-Condition-Dependent Demand.",
            "Novel Local-Search-Based Approaches to University Examination Timetabling.",
            "A Market Design for Grid Computing.",
            "Intrusion-Detection Policies for IT Security Breaches.",
            "A Parallel Genetic Algorithm for the Multilevel Unconstrained Lot-Sizing Problem.",
            "Time-Indexed Formulations and the Total Weighted Tardiness Problem.",
            "Edge Finding for Cumulative Scheduling.",
            "A Hybrid Guided Local Search for the Vehicle-Routing Problem with Intermediate Replenishment Facilities.",
            "A Noniterative Algorithm for the Linear-Quadratic Profit-Maximization Model for Smoothing Multiproduct Production.",
            "An Algorithm for Computing Minimal % Coxian Representations.",
            "Speeding Up Dynamic Shortest-Path Algorithms.",
            "Matchings in Node-Weighted Convex Bipartite Graphs.",
            "Algorithms for the Constrained Two-Staged Two-Dimensional Cutting Problem.",
            "The K King Problem, an Abstract Model for Computing Aircraft Landing Trajectories: On Modeling a Dynamic Hybrid System with Constraints.",
            "A Tensor Sum Preconditioner for Stochastic Automata Networks.",
            "Solving the Capacitated Local Access Network Design Problem.",
            "A Faster Index Algorithm and a Computational Study for Bandits with Switching Costs.",
            "A Unified Modeling and Solution Framework for Vehicle Routing and Local Search-Based Metaheuristics.",
            "Exploiting the Structural Properties of the Underlying Markov Decision Problem in the Q-Learning Algorithm.",
            "A Metaheuristic Approach for the Vertex Coloring Problem.",
            "Risk Minimization and Minimum Description for Linear Discriminant Functions.",
            "Heuristic and Exact Algorithms for the Identical Parallel Machine Scheduling Problem.",
            "Predicting Bidders' Willingness to Pay in Online Multiunit Ascending Auctions: Analytical and Empirical Insights.",
            "Improving Intrusion Prevention Models: Dual-Threshold and Dual-Filter Approaches.",
            "Extreme Point-Based Heuristics for Three-Dimensional Bin Packing.",
            "Efficient Jump Ahead for 2-Linear Random Number Generators.",
            "Optimal Broadcast Scheduling in Packet Radio Networks via Branch and Price.",
            "The Bicriterion Multimodal Assignment Problem: Introduction, Analysis, and Experimental Results.",
            "A Maximal-Space Algorithm for the Container Loading Problem.",
            "Tabu Search-Enhanced Graphical Models for Classification in High Dimensions.",
            "A Lifted Linear Programming Branch-and-Bound Algorithm for Mixed-Integer Conic Quadratic Programs.",
            "A Review and Evaluation of Multiobjective Algorithms for the Flowshop Scheduling Problem.",
            "A Multiobjective Branch-and-Bound Framework: Application to the Biobjective Spanning Tree Problem.",
            "Evaluation of the ARTAFIT Method for Fitting Time-Series Input Processes for Simulation.",
            "Reactive Tabu Search in a Team-Learning Problem.",
            "Approximation to the Transient Solution of the M/Ek/1 Queue.",
            "Disk Packing in a Square: A New Global Optimization Approach.",
            "Kestrel: An Interface from Optimization Modeling Systems to the NEOS Server.",
            "Top-k Correlation Computation.",
            "Mathematical Programming Algorithms for Two-Path Routing Problems with Reliability Considerations.",
            "An Effective Deflected Subgradient Optimization Scheme for Implementing Column Generation for Large-Scale Airline Crew Scheduling Problems.",
            "Efficient Simulation Budget Allocation for Selecting an Optimal Subset.",
            "A Stochastic Approximation Method to Compute Bid Prices in Network Revenue Management Problems.",
            "Computing Globally Optimal Solutions for Single-Row Layout Problems Using Semidefinite Programming and Cutting Planes.",
            "Beam-ACO for Simple Assembly Line Balancing.",
            "Estimating Cycle Time Percentile Curves for Manufacturing Systems via Simulation.",
            "Estimation-Based Local Search for Stochastic Combinatorial Optimization Using Delta Evaluations: A Case Study on the Probabilistic Traveling Salesman Problem."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2007",
        "info": "Volume 19: 2007",
        "count": 60,
        "papers": [
            "Enhancing Lagrangian Dual Optimization for Linear Programs by Obviating Nondifferentiability.",
            "A Heuristic Approach to the Multi-Period Single-Sourcing Problem with Production and Inventory Capacities and Perishability Constraints.",
            "Setup and Open-Stacks Minimization in One-Dimensional Stock Cutting.",
            "Using Decomposition Techniques and Constraint Programming for Solving the Two-Dimensional Bin-Packing Problem.",
            "Performance Guarantees of Local Search for Multiprocessor Scheduling.",
            "Enumeration of Pareto Optima for a Flowshop Scheduling Problem with Two Criteria.",
            "Linear Complementarity as a General Solution Method to Combinatorial Problems.",
            "A Compressed-Annealing Heuristic for the Traveling Salesman Problem with Time Windows.",
            "SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization.",
            "Simulation Allocation for Determining the Best Design in the Presence of Correlated Sampling.",
            "Waiting-Time Distribution of M/DN/1 Queues Through Numerical Laplace Inversion.",
            "Algorithmic Analysis of the Maximum Queue Length in a Busy Period for the M/M/c Retrial Queue.",
            "Improving Linkage of Web Pages.",
            "Implementing Sponsored Search in Web Search Engines: Computational Evaluation of Alternative Mechanisms.",
            "From the Interim Editor.",
            "Performance of a Wavelet-Based Spectral Procedure for Steady-State Simulation Analysis.",
            "An Evolutionary Random Policy Search Algorithm for Solving Markov Decision Processes.",
            "Solving the Bi-Objective Maximum-Flow Network-Interdiction Problem.",
            "Validation Sequence Optimization: A Theoretical Approach.",
            "A Survey and Experimental Comparison of Service-Level-Approximation Methods for Nonstationary M(t)/M/s(t) Queueing Systems with Exhaustive Discipline.",
            "ETAQA Solutions for Infinite Markov Processes with Repetitive Structure.",
            "Embedding {0, }-Cuts in a Branch-and-Cut Framework: A Computational Study.",
            "Computational Assessment of Nested Benders and Augmented Lagrangian Decomposition for Mean-Variance Multistage Stochastic Problems.",
            "Pricing Communication Services with Delay Guarantee.",
            "GRASP and Path Relinking for the Two-Dimensional Two-Stage Cutting-Stock Problem.",
            "Conditions that Obviate the No-Free-Lunch Theorems for Optimization.",
            "Solution of Large Quadratic Knapsack Problems Through Aggressive Reduction.",
            "An Evolutionary Metaheuristic for Approximating Preference-Nondominated Solutions.",
            "Toward Automated Intelligent Manufacturing Systems (AIMS).",
            "From the Editor.",
            "Efficient Computation of Overlapping Variance Estimators for Simulation.",
            "Scatter Search and Local NLP Solvers: A Multistart Framework for Global Optimization.",
            "Power Algorithms for Inverting Laplace Transforms.",
            "Computing with Domino-Parity Inequalities for the Traveling Salesman Problem (TSP).",
            "An Optimization Framework for Conformal Radiation Treatment Planning.",
            "A Study on the Cross-Entropy Method for Rare-Event Probability Estimation.",
            "Denser Packings Obtained in O(n log log n) Time.",
            "On a Binary-Encoded ILP Coloring Formulation.",
            "A Very Large-Scale Neighborhood Search Algorithm for the Combined Through-Fleet-Assignment Model.",
            "A Decomposition and Guided Simulation Methodology for Large-Scale System Design: A Study in QoS-Capable Intranets with Fixed and Mobile Components.",
            "A Two-Stage Heuristic with Ejection Pools and Generalized Ejection Chains for the Vehicle Routing Problem with Time Windows.",
            "Tariff Optimization in Networks.",
            "On the Selection of the Globally Optimal Prototype Subset for Nearest-Neighbor Classification.",
            "Efficient Computations for the Discrete GI/G/1 System.",
            "From the Editor.",
            "Constructing Ensembles from Data Envelopment Analysis.",
            "A Stochastic Radial Basis Function Method for the Global Optimization of Expensive Functions.",
            "Improving Web-Catalog Design for Easy Product Search.",
            "A Shortest-Paths Heuristic for Statistical Data Protection in Positive Tables.",
            "An Evolutionary Algorithm for Polishing Mixed Integer Programming Solutions.",
            "On the Distributed Bellman-Ford Algorithm and the Looping Problem.",
            "Primal-Dual Variable Neighborhood Search for the Simple Plant-Location Problem.",
            "A Traffic-Grooming Algorithm for Wavelength-Routed Optical Networks.",
            "Asynchronous Cooperative Local Search for the Office-Space-Allocation Problem.",
            "Multi-Issue Automated Negotiations Using Agents.",
            "A (2/3)n3 Fast-Pivoting Algorithm for the Gittins Index and Optimal Stopping of a Markov Chain.",
            "Dynamic Programming to Minimize the Maximum Number of Open Stacks.",
            "Variable Neighborhood Search for the Pickup and Delivery Traveling Salesman Problem with LIFO Loading.",
            "Rescheduling for Multiple New Orders.",
            "Very Large-Scale Neighborhood Search for the Quadratic Assignment Problem."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2006",
        "info": "Volume 18: 2006",
        "count": 43,
        "papers": [
            "From the Editor.",
            "An Automated Multiresolution Procedure for Modeling Complex Arrival Processes.",
            "The Distribution of Order Statistics for Discrete Random Variables with Applications to Bootstrapping.",
            "Dynamic-Programming Approximations for Stochastic Time-Staged Integer Multicommodity-Flow Problems.",
            "A Metastrategy for Large-Scale Resource Management Based on Informational Decomposition.",
            "A Computational Study of Cost Reoptimization for Min-Cost Flow Problems.",
            "A Set-Covering-Based Heuristic Approach for Bin-Packing Problems.",
            "Early Estimates of the Size of Branch-and-Bound Trees.",
            "Algorithms for the Frame of a Finitely Generated Unbounded Polyhedron.",
            "A New Mathematical-Programming Framework for Facility-Layout Design.",
            "An Improved Augmented Neural-Network Approach for Scheduling Problems.",
            "A Column-Generation Approach to the Multiple Knapsack Problem with Color Constraints.",
            "From the Guest Editor - Special Cluster on Operations Research in Electrical and Computer Engineering.",
            "Integer Linear Programming Models for Global Routing.",
            "Task Scheduling in a Finite-Resource, Reconfigurable Hardware/Software Codesign Environment.",
            "A Projection-Based Reduction Approach to Computing Sensitivity of Steady-State Response of Nonlinear Circuits.",
            "A Discrete Adjoint Variable Method for Printed-Circuit Board Computer-Aided Design.",
            "Using Eigenvectors to Partition Circuits.",
            "Integer Programming and Constraint Programming in Solving a Multimachine Assignment Scheduling Problem with Deadlines and Release Dates.",
            "Modeling and Performance Analysis of a Finite-Buffer Queue with Batch Arrivals, Batch Services, and Setup Times: The MX/GY/1/K + B Queue with Setup Times.",
            "Optimal Synchronization Policies for Data Warehouses.",
            "Optimization in Object Caching.",
            "Stockout Compensation: Joint Inventory and Price Optimization in Electronic Retailing.",
            "A Data-Mining-Based Prefetching Approach to Caching for Network Storage Systems.",
            "Segmental Pattern Discovery in Music.",
            "Tonal Description of Polyphonic Audio for Music Content Processing.",
            "Slicing It All Ways: Mathematical Models for Tonal Induction, Approximation, and Segmentation Using the Spiral Array.",
            "Recurrent Neural Networks for Music Computation.",
            "Methodologies for Evaluation of Note-Based Music-Retrieval Systems.",
            "The Multilevel Capacitated Minimum Spanning Tree Problem.",
            "Base Station Location and Service Assignments in W - CDMA Networks.",
            "A Branch-and-Cut Procedure for the Multimode Resource-Constrained Project-Scheduling Problem.",
            "The Shortest-Path Problem with Resource Constraints and k-Cycle Elimination for k 3.",
            "From the Editor.",
            "A Unified Framework for Numerically Inverting Laplace Transforms.",
            "Budget-Constrained, Capacitated Hub Location to Maximize Expected Demand Coverage in Fixed-Wireless Telecommunication Networks.",
            "A Memetic Heuristic for the Generalized Quadratic Assignment Problem.",
            "Scenario Formulation of Stochastic Linear Programs and the Homogeneous Self-Dual Interior-Point Method.",
            "Exact Algorithms for a Loading Problem with Bounded Clique Width.",
            "Maximally Violated Mod-p Cuts for the Capacitated Vehicle-Routing Problem.",
            "Discrepancy-Based Additive Bounding Procedures.",
            "FBP: A Frontier-Based Tree-Pruning Algorithm.",
            "Analyzing Document-Duplication Effects on Policies for Browser and Proxy Caching."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2005",
        "info": "Volume 17: 2005",
        "count": 39,
        "papers": [
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences: Board of Directors and Editors for 2005.",
            "On the Generality of Event-Graph Models.",
            "Meta-Heuristics for a Class of Demand-Responsive Transit Systems.",
            "Oblique Multicategory Decision Trees Using Nonlinear Programming.",
            "A GRASP for Parallel Machine Scheduling with Time Windows.",
            "Constraint-Propagation-Based Cutting Planes: An Application to the Resource-Constrained Project Scheduling Problem.",
            "Numerical Solutions of Renewal-Type Integral Equations.",
            "A Two-Moment Approximation for the GI/G/c Queue with Finite Capacity.",
            "A Local-Search-Based Heuristic for the Demand-Constrained Multidimensional Knapsack Problem.",
            "Optimal Processing Policies for an e-Commerce Web Server.",
            "Context-Independent Scatter and Tabu Search for Permutation Problems.",
            "An Experimental Study of LP-Based Approximation Algorithms for Scheduling Problems.",
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences: Board of Directors and Editors for 2005.",
            "LPFML: A W3C XML Schema for Linear and Integer Programming.",
            "Primal-Dual-Based Algorithms for a Directed Network Design Problem.",
            "Using Extra Dual Cuts to Accelerate Column Generation.",
            "Near-Optimal Solutions of Large-Scale Single-Machine Scheduling Problems.",
            "The Analytic-Center Cutting-Plane Method for Variational Inequalities: A Quadratic-Cut Approach.",
            "Designing Communication Networks to Decompose Network Control Problems.",
            "GRASP with Path Relinking for Three-Index Assignment.",
            "A New Pricing Model for Competitive Telecommunications Services Using Congestion Discounts.",
            "State-of-the-Art Review: A User's Guide to the Brave New World of Designing Simulation Experiments.",
            "Heuristic Search for the Generalized Minimum Spanning Tree Problem.",
            "Lower Bounds for the Head-Body-Tail Problem on Parallel Machines: A Computational Study of the Multiprocessor Flow Shop.",
            "An Analysis of the Alias Method for Discrete Random-Variate Generation.",
            "A General Purpose Algorithm for Three-Dimensional Packing.",
            "Intelligent Partitioning for Feature Selection.",
            "Laying Out Sparse Graphs with Provably Minimum Bandwidth.",
            "Effective Role Resolution in Workflow Management.",
            "A Modeling Layer for Constraint-Programming Libraries.",
            "Planar Branch Decompositions I: The Ratcatcher.",
            "Planar Branch Decompositions II: The Cycle Method.",
            "Warm-Start Routines for Solving Augmented Weighted Tchebycheff Network Programs in Multiple-Objective Network Programming.",
            "Simultaneous Generalized Hill-Climbing Algorithms for Addressing Sets of Discrete Optimization Problems.",
            "The Minmax Relative Regret Median Problem on Networks.",
            "Isotonic Separation.",
            "A Heuristic for Winner Determination in Rule-Based Combinatorial Auctions."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2004",
        "info": "Volume 16: 2004",
        "count": 47,
        "papers": [
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "Generating Cutting Planes for Mixed Integer Programming Problems in a Parallel Computing Environment.",
            "A Hybrid Genetic/Optimization Algorithm for Finite-Horizon, Partially Observed Markov Decision Processes.",
            "A Branch-and-Cut Approach for a Generic Multiple-Product, Assembly-System Design Problem.",
            "A New Pricing Scheme for Airline Crew Scheduling.",
            "The Filtered Nearest Neighbor Method for Generating Low-Discrepancy Sequences.",
            "On Bridging the Gap Between Stochastic Integer Programming and MIP Solver Technologies.",
            "A New Formulation and Resolution Method for the p-Center Problem.",
            "Scheduling Banner Advertisements on the Web.",
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "Implementing an LU Factorization for the Embedded Network Simplex Algorithm.",
            "Computer-Aided Complexity Classification of Dial-a-Ride Problems.",
            "An Ejection Chain Approach for the Generalized Assignment Problem.",
            "An Algorithm to Compute the Waiting Time Distribution for the M/G/1 Queue.",
            "Generalized Networks: The Theory of Preprocessing and an Empirical Analysis.",
            "Wavelength Translation in WDM Networks: Optimization Models and Solution Procedures.",
            "Using a Mixed Integer Programming Tool for Solving the 0-1 Quadratic Knapsack Problem.",
            "The Continuous Assignment Problem and Its Application to Preemptive and Non-Preemptive Scheduling with Irregular Cost Functions.",
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "Opportunities for Combinatorial Optimization in Computational Biology.",
            "DNA Sequencing - Tabu and Scatter Search Combined.",
            "Exploiting Tabu Search Memory in Constrained Problems.",
            "The Constraint Consensus Method for Finding Approximately Feasible Points in Nonlinear Programs.",
            "The Pht/Pht/infinity Queueing System: Part I - The Single Node.",
            "The [Pht/Pht/infinity]K Queueing System: Part II - The Multiclass Network.",
            "Searching for Good Multiple Recursive Random Number Generators via a Genetic Algorithm.",
            "On a New Collection of Stochastic Linear Programming Test Problems.",
            "Testing the Nearest Kronecker Product Preconditioner on Markov Chains and Stochastic Automata Networks.",
            "A General Heuristic for Production Planning Problems.",
            "From the Guest Editor for the Special Issue on Computational Molecular Biology/Bioinformatics.",
            "Palindromes in SARS and Other Coronaviruses.",
            "Searching for Multiple Words in a Markov Sequence.",
            "Haplotyping Populations by Pure Parsimony: Complexity of Exact and Approximation Algorithms.",
            "Computational Problems in Noisy SNP and Haplotype Analysis: Block Scores, Block Identification, and Population Stratification.",
            "Global Optimization of Morse Clusters by Potential Energy Transformations.",
            "A Semidefinite Programming Approach to Side Chain Positioning with New Rounding Strategies.",
            "Protein Threading: From Mathematical Models to Parallel Implementations.",
            "Optimizing an Empirical Scoring Function for Transmembrane Protein Structure Determination.",
            "Optimal Solutions for the Closest-String Problem via Integer Programming.",
            "Multiple Sequence Alignment as a Facility-Location Problem.",
            "Dynamic Programming Based Approximation Algorithms for Sequence Alignment with Constraints.",
            "The Fine Structure of Galls in Phylogenetic Networks.",
            "Steiner Trees and 3-D Macromolecular Conformation.",
            "Appreciation to Referees."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2003",
        "info": "Volume 15: 2003",
        "count": 34,
        "papers": [
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "A Genetic Algorithm-Based Approach for Building Accurate Decision Trees.",
            "A Linear Programming Approach to Discriminant Analysis with a Reserved-Judgment Region.",
            "A Multicommodity Network-Flow Problem with Side Constraints on Paths Solved by Column Generation.",
            "Optimal Integer Solutions to Industrial Cutting-Stock Problems: Part 2, Benchmark Results.",
            "Chained Lin-Kernighan for Large Traveling Salesman Problems.",
            "The Reversal Median Problem.",
            "MINLPLib - A Collection of Test Models for Mixed-Integer Nonlinear Programming.",
            "From the Guest Co-Editors.",
            "Efficient and Anonymous Web-Usage Mining for Web Personalization.",
            "On the Existence and Significance of Data Preprocessing Biases in Web-Usage Mining.",
            "A Framework for the Evaluation of Session Reconstruction Heuristics in Web-Usage Analysis.",
            "Web Business Intelligence: Mining the Web for Actionable Knowledge.",
            "Relationship-Based Clustering and Visualization for High-Dimensional Data Mining.",
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "Tour Merging via Branch-Decomposition.",
            "Solving the Generalized Assignment Problem: An Optimizing and Heuristic Approach.",
            "Guided Local Search for the Three-Dimensional Bin-Packing Problem.",
            "Combinatorial Auctions: A Survey.",
            "An Exact Approach to the Strip-Packing Problem.",
            "A New Genetic Algorithm for the Quadratic Assignment Problem.",
            "From the Editor.",
            "Institute for Operations Research and the Management Sciences.",
            "The Granular Tabu Search and Its Application to the Vehicle-Routing Problem.",
            "A Reactive Variable Neighborhood Search for the Vehicle-Routing Problem with Time Windows.",
            "Symmetric and Asymmetric Parallelization of a Cost-Decomposition Algorithm for Multicommodity Flow Problems.",
            "K-Cuts: A Variation of Gomory Mixed Integer Cuts from the LP Tableau.",
            "Execution Conditions: A Formalization of Event Cancellation in Simulation Graphs.",
            "The Use of Eigenvalues for Finding Equilibrium Probabilities of Certain Markovian Two-Dimensional Queueing Problems.",
            "Appreciation to Referees.",
            "Author Index.",
            "Key Word Index."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2002",
        "info": "Volume 14: 2002",
        "count": 31,
        "papers": [
            "From the Editor.",
            "Ranking and Selection for Steady-State Simulation: Procedures and Perspectives.",
            "A MINSAT Approach for Learning in Logic Domains.",
            "Combining Column Generation and Lagrangean Relaxation to Solve a Single-Machine Common Due Date Problem.",
            "An Iterated Dynasearch Algorithm for the Single-Machine Total Weighted Tardiness Scheduling Problem.",
            "Assembly-Line Scheduling with Concurrent Operations and Parallel Machines.",
            "Minimax Models for Diverse Routing.",
            "From the Editor.",
            "Contrasting Structured and Random Permutation Flow-Shop Scheduling Problems: Search-Space Topology and Algorithm Performance.",
            "Calculating the Distribution of a Linear Combination of Uniform Order Statistics.",
            "Solution of a Min-Max Vehicle Routing Problem.",
            "Minimizing the Average Query Complexity of Learning Monotone Boolean Functions.",
            "Experimental Comparison of Approximation Algorithms for Scheduling Unrelated Parallel Machines.",
            "From the Editor.",
            "Feature Article: Optimization for simulation: Theory vs. Practice.",
            "Simulation Optimization: Integrating Research and Practice.",
            "Additional Perspectives on Simulation for Optimization.",
            "Simulation Optimization is Evolving.",
            "Simulation Optimization in the Future: Evolution or Revolution?",
            "A Hybrid GRASP with Perturbations for the Steiner Problem in Graphs.",
            "Capacitated Network Design with Uncertain Demand.",
            "Symbolic Computation of Moments in Priority Queues.",
            "An Evolutionary Approach to Group Decision Making.",
            "From the Guest Editor: Special Issue on the Merging of Mathematical Programming and Constraint Programming.",
            "Logic, Optimization, and Constraint Programming.",
            "Extending an Algebraic Modeling Language to Support Constraint Programming.",
            "Constraint and Integer Programming in OPL.",
            "Efficient Intelligent Backtracking Using Linear Programming.",
            "The Role of Integer Programming Techniques in Constraint Programming's Global Constraints.",
            "A Hybrid Exact Algorithm for the TSPTW.",
            "Appreciation to Referees."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2001",
        "info": "Volume 13: 2001",
        "count": 27,
        "papers": [
            "From the Editor.",
            "Cascade Graphs: Design, Analysis and Algorithms for Relational Joins.",
            "A Flexible Java Representation for Uncertainty in Online Operations-Research Models.",
            "Linear Time Dynamic-Programming Algorithms for New Classes of Restricted TSPs: A Computational Study.",
            "Fault-Tolerant Virtual Path Layout in ATM Networks.",
            "Representations of the all_different Predicate of Constraint Satisfaction in Integer Programming.",
            "The Bounded Cycle-Cover Problem.",
            "Scheduling Batches with Sequential Job Processing for Two-Machine Flow and Open Shops.",
            "The Online TSP Against Fair Adversaries.",
            "Properties of Batched Quadratic-Form Variance Parameter Estimators for Simulations.",
            "Non-Approximability Results for Scheduling Problems with Minsum Criteria.",
            "Addendum to \"Presolve Analysis of Linear Programs Prior to Applying an Interior Point Method\".",
            "From the Editor.",
            "Modeling and Analysis of Discrete-Time Multiserver Queues with Batch Arrivals: GIX/Geom/m.",
            "The Path Restoration Version of the Spare Capacity Allocation Problem with Modularity Restrictions: Models, Algorithms, and an Empirical Analysis.",
            "A Parallel, Linear Programming-based Heuristic for Large-Scale Set Partitioning Problems.",
            "Fast Heuristics for the Maximum Feasible Subsystem Problem.",
            "Sorting Permutations by Reversals Through Branch-and-Price.",
            "On the Design Problem of Multitechnology Networks.",
            "From the Editor.",
            "Algorithms for Hybrid MILP/CP Models for a Class of Optimization Problems.",
            "Convergence Properties of the Batch Means Method for Simulation Output Analysis.",
            "The Semismooth Algorithm for Large Scale Complementarity Problems.",
            "Initialization for NORTA: Generation of Random Vectors with Specified Marginals and Correlations.",
            "A Dynamic Programming Based Pruning Method for Decision Trees.",
            "Phantom Harmonic Gradient Estimators for Nonpreemptive Priority Queueing Systems.",
            "Technical Note on \"Optimal Integer Solutions to Industrial Cutting Stock Problems\" by Degraeve and Schrage."
        ]
    },
    {
        "name": "INFORMS",
        "year": "2000",
        "info": "Volume 12: 2000",
        "count": 26,
        "papers": [
            "Progress in Linear Programming-Based Algorithms for Integer Programming: An Exposition.",
            "Statistical Analysis of Computational Tests of Algorithms and Heuristics.",
            "Parallelizing the Dual Simplex Method.",
            "When Does a Dynamic Programming Formulation Guarantee the Existence of a Fully Polynomial Time Approximation Scheme (FPTAS)?",
            "A Minimal Algorithm for the Bounded Knapsack Problem.",
            "Handling Sensor Data in Rapidly Changing Environments to Support Soft Real-Time Requirements.",
            "Minmax Regret Median Location on a Network Under Uncertainty.",
            "Time-Indexed Formulations for Machine Scheduling Problems: Column Generation.",
            "A Stochastic Branch-and-Bound Approach to Activity Crashing in Project Management.",
            "Algorithms for Path-Based Placement of Inspection Stations on Networks.",
            "Selecting Scheduling Heuristics Using Neural Networks.",
            "Reactive GRASP: An Application to a Matrix Decomposition Problem in TDMA Traffic Assignment.",
            "Solving Graph Bisection Problems with Semidefinite Programming.",
            "Market Split and Basis Reduction: Towards a Solution of the Cornue'jols-Dawande Instances.",
            "Complexity of Memory-Efficient Kronecker Operations with Applications to the Solution of Markov Models.",
            "A Simplex-Based Tabu Search Method for Capacitated Network Design.",
            "An Ant Colony System Hybridized with a New Local Search for the Sequential Ordering Problem.",
            "In Memoriam: Carl M. Harris.",
            "Internet-Type Queues with Power-Tailed Interarrival Times and Computational Methods for Their Analysis.",
            "A Revised Simplex Search Procedure for Stochastic Simulation Response Surface Optimization.",
            "Enhanced Model Representations for an Intra-Ring Synchronous Optical Network Design Problem Allowing Demand Splitting.",
            "General Open and Closed Queueing Networks with Blocking: A Unified Framework for Approximation.",
            "Approximation of Point Sets by 1-Corner Polygonal Chains.",
            "Practical Piecewise-Linear Approximation for Monotropic Optimization.",
            "Multiple-Machine Lower Bounds for Shop-Scheduling Problems.",
            "Subject Classification and Key Word Index to Volume 12."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1999",
        "info": "Volume 11: 1999",
        "count": 35,
        "papers": [
            "Localizer: A Modeling Language for Local Search.",
            "Neural Networks for Combinatorial Optimization: A Review of More Than a Decade of Research.",
            "Information Theory and the Finite-Time Behavior of the Simulated Annealing Algorithm: Experimental Results.",
            "GRASP and Path Relinking for 2-Layer Straight Line Crossing Minimization.",
            "Improvement Procedures for the Undirected Rural Postman Problem.",
            "Analyzing Infeasible Mixed-Integer and Integer Linear Programs.",
            "Solving Parallel Machine Scheduling Problems by Column Generation.",
            "On Exploiting Problem Structure in a Basis Identification Procedure for Linear Programming.",
            "Analysis of Stochastic Assembly with GI-Distributed Assembly Time.",
            "Lifted Cover Inequalities for 0-1 Integer Programs: Complexity.",
            "Exact Solution of the Quadratic Knapsack Problem.",
            "Computing Minimum-Weight Perfect Matchings.",
            "An Efficient Decomposition Algorithm to Optimize Spare Capacity in a Telecommunications Network.",
            "A Set-Partitioning-Based Heuristic for the Vehicle Routing Problem.",
            "A Computational Study of Search Strategies for Mixed Integer Programming.",
            "Packet Routing in Telecommunication Networks with Path and Flow Restrictions.",
            "Improved Constructive Multistart Strategies for the Quadratic Assignment Problem Using Adaptive Memory.",
            "A Class of Hard Small 0-1 Programs.",
            "An Approximation Scheme for Minimizing Agreeably Weighted Variance on a Single Machine.",
            "Mathematical Programming for Data Mining: Formulations and Challenges.",
            "Data Mining by Decomposition: Adaptive Search for Hypothesis Generation.",
            "Direct Marketing Performance Modeling Using Genetic Algorithms.",
            "Feature Selection for Financial Credit-Risk Evaluation Decisions.",
            "A Study of Composite or Hybrid Classifiers for Knowledge Discovery.",
            "Optimizing Expert Systems: Heuristics for Efficiently Generating Low-Cost Information Acquisition Strategies.",
            "Parallel Complexity of Additive Location Problems.",
            "Semantics-Based Transaction Processing for Real-Time Databases: The Case of Automated Stock Trading.",
            "Matrix Sensitivity Analysis from an Interior Solution of a Linear Program.",
            "A Fuzzy Hopfield-Tank Traveling Salesman Problem Model.",
            "Heuristic and Metaheuristic Approaches for a Class of Two-Dimensional Bin Packing Problems.",
            "Exact and Approximate Nondeterministic Tree-Search Procedures for the Quadratic Assignment Problem.",
            "A Bundle Type Dual-Ascent Approach to Linear Multicommodity Min-Cost Flow Problems.",
            "Computing Laplace Transforms for Numerical Inversion Via Continued Fractions.",
            "Optimal Integer Solutions to Industrial Cutting Stock Problems.",
            "Propagation of Interval Values in Simple Processing Networks."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1998",
        "info": "Volume 10: 1998",
        "count": 42,
        "papers": [
            "A Cutting Plane Algorithm for Multicommodity Survivable Network Design Problems.",
            "A Virtual Clustering Approach for Routing Problems in Telecommunication Networks.",
            "Interconnecting LANs and a FDDI Backbone Using Transparent Bridges: A Model and Solution Algorithms.",
            "A Dual Ascent Procedure with Valid Inequalities for Designing Hierarchical Network Topologies.",
            "On the Application of Explanation-Based Learning to Acquire Control Knowledge for Branch and Bound Algorithms.",
            "Numerical Methods for Fitting and Simulating Autoregressive-to-Anything Processes.",
            "Distributed State Space Generation of Discrete-State Stochastic Models.",
            "Complexity of Simulation Models: A Graph Theoretic Approach.",
            "Sparse Matrix Ordering Methods for Interior Point Linear Programming.",
            "An Efficient Algorithm for a Class of Two-Resource Allocation Problems.",
            "On the Performance of Heuristics on Finite and Infinite Fractal Instances of the Euclidean Traveling Salesman Problem.",
            "Solving the Orienteering Problem through Branch-and-Cut.",
            "An Exact Solution Approach Based on Shortest-Paths for p-Hub Median Problems.",
            "Approximating Shortest Paths in Large-Scale Networks with an Application to Intelligent Transportation Systems.",
            "Using Variable Redefinition for Computing Lower Bounds for Minimum Spanning and Steiner Trees with Hop Constraints.",
            "On Formal Semantics and Analysis of Typed Modeling Languages: An Analysis of Ascend.",
            "Feature Selection via Mathematical Programming.",
            "Operator-Splitting Methods for Monotone Affine Variational Inequalities, with a Parallel Application to Optimal Control.",
            "Variance Reduction and Objective Function Evaluation in Stochastic Linear Programs.",
            "Strategies for Creating Advanced Bases for Large-Scale Linear Programming Problems.",
            "Connections Between Integer Linear Programming and Constraint Logic Programming - An Overview and Introduction to the Cluster of Articles.",
            "Integer Linear Programming and Constraint Programming Approaches to a Template Design Problem.",
            "Properties of Some Combinatorial Optimization Problems and Their Effect on the Performance of Integer Programming and Constraint Logic Programming.",
            "Branch and Infer: A Unifying Framework for Integer and Finite Domain Constraint Programming.",
            "An Incremental Branch-and-Bound Method for the Satisfiability Problem.",
            "Interval Protection of Confidential Information in a Database.",
            "An Algorithm for Identifying the Frame of a Pointed Finite Conical Hull.",
            "Online Scheduling with Lookahead: Multipass Assembly Lines.",
            "Local Search Heuristics for the Single Machine Total Weighted Tardiness Scheduling Problem.",
            "An Approximate Analysis of a UNIX Macro Process Scheduler.",
            "Feature Article - The World Wide Web: Opportunities for Operations Research and Management Science.",
            "Commentary - Dynamic, Distributed, Platform Independent OR/MS Applications - A Network Perspective.",
            "Commentary - Predictions for Web Technologies in Optimization.",
            "Commentary - A New Horizon for OR/MS.",
            "]ary - The World Wide Web: It's the Customers.",
            "Rejoinder - OR/MS, Electronic Commerce, and the Virtual INFORMS Community.",
            "Partitioning the Attribute Set for a Probabilistic Reasoning System.",
            "An Efficient Algorithm for Solving an Air Traffic Management Model of the National Airspace System.",
            "Lifted Cover Inequalities for 0-1 Integer Programs: Computation.",
            "A Branch and Bound Algorithm for the Stability Number of a Sparse Graph.",
            "Distribution Estimation Using Laplace Transforms.",
            "Appreciation to Referees."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1997",
        "info": "Volume 9: 1997",
        "count": 41,
        "papers": [
            "A Mathematical Programming Approach to Data Base Normalization.",
            "How Much Communication Does Parallel Branch and Bound Need?",
            "A Branch-and-Bound Approach Using Polyhedral Results for a Clustering Problem.",
            "A New Knapsack Solution Approach by Integer Equivalent Aggregation and Consistency Determination.",
            "On the Use of the Power Series Algorithm for General Markov Processes, with an Application to a Petri Net.",
            "Bad Lattice Structures for Vectors of Nonsuccessive Values Produced by Some Linear Recurrences.",
            "Toward a Taxonomy of Parallel Tabu Search Heuristics.",
            "Presolove Analysis of Linear Programs Prior to Applying an Interior Point Method.",
            "Earliness-Tardiness Scheduling Around Almost Equal Due Dates.",
            "Art Gallery Problems for Convex Nested Polygons.",
            "Stochastic Programming Computation and Applications.",
            "OR/SM: A Prototype Integrated Modeling Environment Based on Structured Modeling.",
            "Solving Multicommodity Flow Problems with a Primal Embedded Network Simplex Algorithm.",
            "Finding a Useful Subset of Constraints for Analysis in an Infeasible Linear Program.",
            "Probabilistic Scaling for the Numerical Inversion of Nonprobability Transforms.",
            "Computing Gradients in Large-Scale Optimization Using Automatic Differentiation.",
            "An Automatic Approach to Deadlock Detection and Resolution in Discrete Simulation Systems.",
            "An Implementation of the Lattice and Spectral Tests for Multiple Recursive Linear Random Number Generators.",
            "A Parallel Implementation of the GTH Algorithm.",
            "Estimating Waiting Times from Transactional Data.",
            "Genetic Algorithms for the Operations Researcher.",
            "Developing Fitter Genetic Algorithms.",
            "When Genetic Algorithms Work Best.",
            "Genetic Algorithms: A Practitioner's View.",
            "What Are Genetic Algorithms Good at?",
            "Genetic Algorithms: No Panacea, but a Valuable Tool for the Operations Researcher.",
            "Placing Text Labels an Maps and Diagrams using Genetic Algorithms with Masking.",
            "A Finite Capacity Queue with Nonrenewal Input and Exponential Dynamic Group Services.",
            "A Generalized Univariate Change-of-Variable Transformation Technique.",
            "An Implementation of the Batch Means Method.",
            "A Parametric Optimization Method for Machine Learning.",
            "SALOME: A Bidirectional Branch-and-Bound Procedure for Assembly Line Balancing.",
            "A Branch and Cut Approach for Workload Smoothing on Assembly Lines.",
            "Scheduling Periodic Tasks with Slack.",
            "Optimal Resource Assignment of Preemptive Periodic Tasks on Multiple Processors.",
            "A Tabu-Search Heuristic for the Dynamic Plant Layout Problem.",
            "Adding Value to Induced Decision Trees for Time-Sensitive Data.",
            "An Integrated Modeling System for Structured Modeling Using Model Graphs.",
            "A Reactive Tabu Search Metaheuristic for the Vehicle Routing Problem with Time Windows.",
            "A Depth-First Dynamic Programming Algorithm for the Tree Knapsack Problem.",
            "Vector Quantization for Arbitrary Distance Function Estimation."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1996",
        "info": "Volume 8: 1996",
        "count": 41,
        "papers": [
            "Feature Article - Toward an Experimental Method for Algorithm Simulation.",
            "Commentary - Simulation of Algorithms for Performance Analysis.",
            "Commentary - On Experimental Methods for Algorithm Simulation.",
            "Commentary - On Algorithm Analysis.",
            "Rejoinder - Challenges in Algorithm Simulation.",
            "Computational Experience with an Approximation Algorithm on Large-Scale Euclidean Matching Instances.",
            "An Improved Algorithm for the Constrained Bottleneck Spanning Tree Problem.",
            "Computation of Derivatives by Means of the Power-Series Algorithm.",
            "Localizing and Diagnosing Infeasibilities in Networks.",
            "Isomorphic Routing on a Toroidal Mesh.",
            "A Comparison of Alternative Approaches for Numerical Solutions of GI/PH/1 Queues.",
            "Some Experimental and Theoretical Results on Test Case Generators for the Maximum Clique Problem.",
            "Application of an Annealed Neural Network to a Timetabling Problem.",
            "A Self-Organizing Approach to Managerial Nonlinear Discriminant Analysis: A Hybrid Method of Linear Discriminant Analysis and Neural Networks.",
            "Perturbation: An Efficient Technique for the Solution of Very Large Instances of the Euclidean TSP.",
            "A Fast Composite Heuristic for the Symmetric Traveling Salesman Problem.",
            "Constraint Propagation Based Scheduling of Job Shops.",
            "The Vehicle Routing Problem with Time Windows Part I: Tabu Search.",
            "The Vehicle Routing Problem with Time Windows Part II: Genetic Search.",
            "Adaptive Penalty Methods for Genetic Optimization of Constrained Combinatorial Problems.",
            "Stopping Criteria for Finite Length Genetic Algorithms.",
            "A Branch and Cut Algorithm for a Steiner Tree-Star Problem.",
            "The Multi-Tier Tree Problem.",
            "Experience with a Cutting Plane Algorithm for the Capacitated Spanning Tree Problem.",
            "Multicommodity Flows in Ring Networks.",
            "Capacitated Network Design - Polyhedral Structure and Computation.",
            "Selecting Ingot Sizes for Joint Production of Sheet Products.",
            "Inventory Management in Catalog Sales Companies.",
            "On the Two-Level Uncapacitated Facility Location Problem.",
            "Job Shop Scheduling by Local Search.",
            "Use of Representative Operation Counts in Computational Testing of Algorithms.",
            "Methodology for Stochastic Graph Completion-Time Problems.",
            "A Column Generation Approach for Graph Coloring.",
            "An Improved Algorithm for Approximating the Performance of Stochastic Flow Networks.",
            "Bottleneck Steiner Subnetwork Problems with k-Connectivity Constraints.",
            "Quad-Trees and Linear Lists for Identifying Nondominated Criterion Vectors.",
            "An O(n log n) Algorithm for the Two-Machine Flow Shop Problem with Controllable Machine Speeds.",
            "An Implementation of LPFORM.",
            "A Branch-and-Bound Algorithm for Single-Machine Earliness-Tardiness Scheduling with Idle Time.",
            "On the Laguerre Method for Numerically Inverting Laplace Transforms.",
            "Scheduling Periodic Tasks."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1995",
        "info": "Volume 7: 1995",
        "count": 42,
        "papers": [
            "A Matching Based Exact Algorithm for Capacitated Vehicle Routing Problems.",
            "A GRASP for the Vehicle Routing Problem with Time Windows.",
            "The Distribution Problem with Carrier Service: A Dual Based Penalty Approach.",
            "Numerical Inversion of Laplace Transforms of Probability Distributions.",
            "Preprocessing in Stochastic Programming: The Case of Capacitated Networks.",
            "Scheduling n Independent Jobs on m Uniform Machines with both Flowtime and Makespan Objectives: A Parametric Analysis.",
            "Hulls and Efficient Sets for the Rectilinear Norm.",
            "Disjoint Paths in the Plane.",
            "Efficient Computation of Probabilities of Events Described by Order Statistics and Applications to Queue Inference.",
            "Comparisons Between Aggregation/Disaggregation and a Direct Algorithm for Computing the Stationary Probabilities of a Markov Chain.",
            "A Branch and Bound Algorithm for Integer Quadratic Knapsack Problems.",
            "A Revised Stochastic Complementation Algorithm for Nearly Completely Decomposable Markov Chains.",
            "Bounds and Approximations for Overheads in the Time to Join Parallel Forks.",
            "Spectral Analysis of Basic TES Processes.",
            "Stability of p-Persistent CSMA/CD.",
            "A Comparison of Constraint and Mixed-Integer Programming Solvers for Batch Sequencing with Sequence-Dependent Setups.",
            "Expressing Special Structures in an Algebraic Modeling Language for Mathematical Programming.",
            "Optimal Scheduling of Tasks on Identical Parallel Processors.",
            "On the Asymptotic Optimality of Multiprocessor Scheduling Heuristics for the Makespan Minimization Problem.",
            "Analyzing the Pooling Problem.",
            "A Matching Identification Problem: A Knowledge Acquisition Approach.",
            "Single Machine Scheduling to Minimize Total Weighted Late Work.",
            "Introduction to the Cluster on Knowledge and Data Management.",
            "Incorporating the Majority Consensus Concurrency Control Mechanism into the Database Allocation Problem.",
            "Access Path Optimization in Relational Joins.",
            "A Stochastic Model for Performance Evaluation of Main Memory Resident Database Systems.",
            "A Relationship Between CNF and DNF Systems Derivable from Examples.",
            "A Graph Theory-Based Approach for Partitioning Knowledge Bases.",
            "A Staged Primal-Dual Algorithm for Perfect b-Matching with Edge Capacities.",
            "Primal-Dual and Primal Interior Point Algorithms for General Nonlinear Programs.",
            "Interval Graph Problems on Reconfigurable Meshes.",
            "Performance Issues for the Iterative Solution of Markov Decision Processes on Parallel Computers.",
            "Load Balancing in Hypercube Solution of Stochastic Optimization Problems.",
            "Parallel Search Algorithms for Discrete Optimization Problems.",
            "Parallel Algorithms for Stochastic Dynamic Programming with Continuous State and Control Variables.",
            "Data-Parallel Implementations of Dense Simplex Methods on the Connection Machine CM-2.",
            "Old Bachelor Acceptance: A New Class of Non-Monotone Threshold Accepting Methods.",
            "Tabu Thresholding: Improved Search by Nonmonotonic Trajectories.",
            "Solving a Class Scheduling Problem with a Genetic Algorithm.",
            "Problem and Heuristic Space Search Strategies for Job Shop Scheduling.",
            "Ghost Image Processing for Minimum Covariance Determinants.",
            "A Study of the Augmented System and Column-Splitting Approaches for Solving Two-Stage Stochastic Linear Programs by Interior-Point Methods."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1994",
        "info": "Volume 6: 1994",
        "count": 45,
        "papers": [
            "Feature Article - Interior Point Methods for Linear Programming: Computational State of the Art.",
            "Commentary - Progress in Linear Programming.",
            "Commentary - Major Cholesky Would Feel Proud.",
            "Commentary - Theory and Practice for Interior-Point Methods.",
            "Commentary - Interior-Point Methods: Algorithms and Formulations.",
            "Rejoinder - The Last Word on Interior Point Methods for Linear Programming - For Now.",
            "Complexity of Hierarchical Trees in Evidence Theory.",
            "Primary and Secondary Route Selection in Backbone Computer Networks.",
            "Design of Performance Constrained Optic Fiber Multidrop Access Networks.",
            "A Staged Primal-Dual Algorithm for Finding a Minimum Cost Perfect Two-Matching in an Undirected Graph.",
            "Tabu Search for General Zero-One Integer Programs Using the Pivot and Complement Heuristic.",
            "Numerical Factorization Methods for Interior Point Algorithms.",
            "From the Editor.",
            "Parallel Taboo Search Techniques for the Job Shop Scheduling Problem.",
            "A Computational Study of Local Search Algorithms for Job Shop Scheduling.",
            "The Reactive Tabu Search.",
            "Fast Clustering Algorithms.",
            "Genetic Algorithms and Random Keys for Sequencing and Optimization.",
            "Genetic Algorithms for Combinatorial Optimization: The Assemble Line Balancing Problem.",
            "A Double-Layered Learning Approach to Acquiring Rules for Classification: Integrating Genetic Algorithms with Similarity-Based Learning.",
            "On the Complexity of the Policy Improvement Algorithm for Markov Decision Processes.",
            "On Exploiting Original Problem Data in the Inverse Representation of Linear Programming Bases.",
            "CONOPT - A Large-Scale GRG Code.",
            "SSS: Subrouting Set for Experimenting in Simulation Research.",
            "Feature Article - Visualization and Optimization.",
            "Commentary - Visualization and Optimization: The Future Lies Together.",
            "Commentary - Visualization in Vehicle Routing and Scheduling Problems.",
            "Commentary - The Promise of OR is Helping to Solve Problems.",
            "Commentary - Designing Tools for Visualization and Optimization.",
            "Rejoinder - Anchoring and Cross-Fertilization.",
            "Consistency in Valuation-Based Systems.",
            "A Newton Based Radius Reduction Algorithm for Nearest Point Problems in Pos Cones.",
            "A Numerical Method for Controlled Routing in Large Trunk Line Networks via Stochastic Control Theory.",
            "From the Editor.",
            "Perspectives on Simulation Research and Practice.",
            "Intelligent Objects in Simulation.",
            "A Flexible Method for Estimating Inverse Distribution Functions in Simulation Experiments.",
            "Experimental Evaluation of a Procedure for Estimating Nonhomogeneous Poisson Processes Having Cyclic Behavior.",
            "The Application of Metamodeling to Interconnection Network Analysis.",
            "Convergence Results for Harmonic Gradient Estimators.",
            "Optimization of Simulation via Quasi-Newton Methods.",
            "A Structured Expert System for Model Management in Inventory Control.",
            "A Computational Study of Satisfiability Algorithms for Propositional Logic.",
            "An EP Algorithm for Computing a Minimum Weight Perfect Matching for a Set of Points on the Plane.",
            "Preprocessing and Probing Techniques for Mixed Integer Programming Problems."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1993",
        "info": "Volume 5: 1993",
        "count": 44,
        "papers": [
            "From the Editor.",
            "Feature Article - Reporting Computational Experiments with Parallel Algorithms: Issues, Measures, and Experts' Opinions.",
            "Commentary - The \"Tar Baby\" of Computing: Performance Analysis.",
            "Commentary - Parallel Reporting Guidelines Are on Target.",
            "Commentary - Speedups and Insights.",
            "Commentary - The Role of Performance Metrics for Parallel Mathematical Programming Algorithms.",
            "Rejoinder - Using Parallel Empirical Testing to Advance Algorithm Research.",
            "Dimensional Analysis in Mathematical Modeling Systems: A Simple Numerical Method.",
            "A Barrier Method for Large-Scale Constrained Optimization.",
            "Measuring Congestion for Dynamic Task Allocation in Distributed Simulation.",
            "Selecting Parameters of Phase Distributions: Combining Nonlinear Programming, Heuristics, and Erlang Distributions.",
            "The Alternating Step Method for Monotropic Programming on the Connection Machine CM-2.",
            "State-of-the-Art Survey - Constrained Nonlinear 0-1 Programming.",
            "Toward a Programming Environment for Combinatorial Optimization: A Case Study Oriented to Max-Flow Computations.",
            "ALPO: Another Linear Program Optimizer.",
            "Shortening Future-Event Lists.",
            "Optimal Balanced Assignments and a Parallel Database Application.",
            "A Production Scheduling System.",
            "Separable Quadratic Programming via a Primal-Dual Interior Point Method and its Use in a Sequential Procedure.",
            "Duality-Based Algorithms for Scheduling Unrelated Parallel Machines.",
            "An Implementation of the Generalized Basis Reduction Algorithm for Integer Programming.",
            "Feature Article - Parallel Discrete Event Simulation: Will the Field Survive?",
            "Commentary - Parallel Discrete Event Simulation: Fact or Fiction?",
            "Commentary - A Survival Guide for Parallel Simulation.",
            "Commentary - Will Parallel Simulation Research Survive?",
            "Commentary - The Silver Bullet.",
            "Commentary - Practical Parallel Discrete Event Simulation.",
            "Rejoinder - Future Directions in Parallel Simulation Research.",
            "Empirical Studies on the Average Efficiency of Simplex Variants under Rotation Symmetry.",
            "Parallel Asynchronous Hungarian Methods for the Assignment Problem.",
            "Graphical Interfaces for Network Modeling: A Model Management System Perspective.",
            "Computation of Steady-State Probabilities for Infinite-State Markov Chains with Repeating Rows.",
            "Applying an Architecture for General Intelligence to Reduce Scheduling Effort.",
            "Approximation Algorithms for Three-Machine Open Shop Scheduling.",
            "From the Editor.",
            "State-of-the-Art Survey - The Traveling Salesman Problem: A Neural Network Perspective.",
            "Mathematical Programming in Neural Networks.",
            "Learning Algorithms for Neural-Net Decision Support.",
            "Feedforward Neural Nets as Models for Time Series Forecasting.",
            "A GRG2-Based System for Training Neural Networks: Design and Computational Experience.",
            "Network Reoptimization Algorithms: A Statistically Designed Comparison.",
            "A Bayesian Approach to Database Query Optimization.",
            "Error Bound of a Heuristic for the Common Due Date Scheduling Problem.",
            "An Efficient Algorithm for the Min-Sum Arborescence Problem on Complete Digraphs."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1992",
        "info": "Volume 4: 1992",
        "count": 42,
        "papers": [
            "Editor's Introduction.",
            "Solving Large Sparse Nonlinear Programs Using GRG.",
            "Solving Piecewise-Linear Programs: Experiments with a Simplex Approach.",
            "Some Convergence Results for Probabilistic Tabu Search.",
            "Exploiting Special Structure in Primal Dual Interior Point Methods.",
            "Preprocessing in Stochastic Programming: The Case of Linear Programs.",
            "Scheduling Checks and Saves.",
            "Matroid Applications and Algorithms.",
            "Book Review.",
            "Editor's Introduction.",
            "Implementations of Affine Scaling Methods: Approximate Solutions of Systems of Linear Equations Using Preconditioned Conjugate Gradient Methods.",
            "Preprocessing Nonlinear Functional Constraints with Applications to the Pooling Problem.",
            "Generalized Networks: Parallel Algorithms and an Empirical Analysis.",
            "The Vehicle Routing Problem with Time Windows: Minimizing Route Duration.",
            "An Optimal Algorithm for the Orienteering Tour Problem.",
            "Massively Parallel Algorithms for Singly Constrained Convex Programs.",
            "The Ca/M/s/m Retrial Queue: A Computational Approach.",
            "Using a Hop-Constrained Model to Generate Alternative Communication Network Design.",
            "Fast Heuristics for Large Geometric Traveling Salesman Problems.",
            "Technical Note - On Performance of Path Planning Algorithms in Unknown Terrains.",
            "From the Editor.",
            "Jackknifing under a Budget Constraint.",
            "Parallel Decomposition of Multicommodity Network Flows Using a Linear-Quadratic Penalty Algorithm.",
            "A New Multiplier Adjustment Procedure for the Distributed Computation of Routing Assignments in Virtual Circuit Data Networks.",
            "Implementing the Simplex Method: The Initial Basis.",
            "Alternative Approaches to Feasibility in Projective Methods for Linear Programming.",
            "Numerical Issues in Computing Steady-State Queueing-Time Distributions of Single-Server Bulk-Service Queues: M/Gb/1 and M/Gd/1.",
            "Simulated Annealing with a Temperature Dependent Penalty Function.",
            "Solving the Steiner Tree Problem on a Graph Using Branch and Cut.",
            "Numerical Experiments with Iteration and Aggregation for Markov Chains.",
            "A Heuristic Algorithm for the Guillotine Constrained Cutting Stock Problem.",
            "Guest Editors' Introduction.",
            "Dynamic Three-Dimensional Linear Programming.",
            "Recognizing Voronoi Diagrams with Linear Programming.",
            "Matching Points into Pairwise-Disjoint Noise Regions: Combinatorial Bounds and Algorithms.",
            "Fast Algorithms for Geometric Traveling Salesman Problems.",
            "The Voronoi Partition of a Network and Its Implications in Location Theory.",
            "Efficient Algorithms for the Capacitated 1-Median Problem.",
            "1-Segment Center Problems.",
            "On the Optimal Bisection of a Polygon.",
            "Monotone Pieces of Chains.",
            "\"Lion and Man\": Upper and Lower Bounds."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1991",
        "info": "Volume 3: 1991",
        "count": 41,
        "papers": [
            "Editor's Introduction.",
            "Generating Markov-Chain Transitions Quickly: II.",
            "Approximation of Some Markov-Modulated Poisson Processes.",
            "Discrete Event Simulation Model Decomposition by Principal Components Analysis.",
            "A Mass Production Technique to Speed Multiple-Query Optimization and Physical Database Design.",
            "Parallel Implementation of Lemke's Algorithm on the Hypercube.",
            "On Finding Primal- and Dual-Optimal Bases.",
            "Pattern Classification Using Linear Programming.",
            "Book Reviews.",
            "Editor's Introduction.",
            "Optimal Partial-Match Hashing Design.",
            "Performance Characteristics of the Jacobi and the Gauss-Seidel Versions of the Auction Algorithm on the Alliant FX/8.",
            "Unique Names Violations, a Problem for Model Integration or You Say Tomato, I Say Tomahto.",
            "Improving LP-Representations of Zero-One Linear Programs for Branch-and-Cut.",
            "Column Generation Methods for Probabilistic Logic.",
            "A Computational Study of the Job-Shop Scheduling Problem.",
            "Locating Minimal Infeasible Constraint Sets in Linear Programs.",
            "Technical Note - Least-Squares Image Registration.",
            "SOFTWARE SECTION - RANDMOD: A System for Randomizing Modifications to an Instance of a Linear Program.",
            "Book Review.",
            "Editor's Introduction.",
            "An Introduction to Graph-Based Modeling Systems, Part II: Graph-Grammars and the Implementation.",
            "Computational Comparison of Two Algorithms for the Euclidean Single Facility Location Problem.",
            "A Comparison of Two Simulated Annealing Algorithms Applied to the Directed Steiner Problem on Networks.",
            "A Pruning Procedure for Exact Graph Coloring.",
            "Using State Reduction for Computing Steady State Probabilities of Queues of GI/PH/1 Types.",
            "A Product Automaton Formalism for Hierarchical, Modular, Discrete Simulation.",
            "Approaches to Diagnosing Infeasible Linear Programs.",
            "Technical Note - On the Cancellation Sequence Method of Tabu Search.",
            "Book Review.",
            "Editor's Introduction.",
            "Incremental Linear Constraint Solving and Detection of Implicit Equalities.",
            "Optimizing Interconnections of Local Area Networks: An Approach Using Simulated Annealing.",
            "Bounding Synchronization Overhead for Parallel Iteration.",
            "An Empirical Analysis of the Dense Assignment Problem: Sequential and Parallel Implementations.",
            "A Nonstandard Genetic Algorithm for the Nonlinear Transportation Problem.",
            "TES: A Class of Methods for Generating Autocorrelated Uniform Variates.",
            "Rule-Based Generation of Model Structures in Multifaceted Modeling and System Design.",
            "Linear Discriminant Functions Determined by Genetic Search.",
            "SQLMP: A Data Sublanguage for Representation and Formulation of Linear Mathematical Models.",
            "TSPLIB - A Traveling Salesman Problem Library."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1990",
        "info": "Volume 2: 1990",
        "count": 35,
        "papers": [
            "Editor's Introduction.",
            "Tabu Search - Part II.",
            "Tabu Search Applied to the Quadratic Assignment Problem.",
            "Reliability Computations for Planar Networks.",
            "Identifying Minimally Infeasible Subsystems of Inequalities.",
            "Worst-Case Analysis of Heuristics for Multidepot Capacitated Vehicle Routing Problems.",
            "On Valuation and Optimization Problems in Fuzzy Graphs: A General Approach and Some Particular Cases.",
            "Matrix Visualization in the Design of Numerical Algorithms.",
            "Book Review.",
            "Computational Testing: Why, How and How Much.",
            "Editor's Introduction.",
            "A Neural Network Implementation of a Data Association Algorithm.",
            "Matrix Balancing on a Massively Parallel Connection Machine.",
            "Generating Markov-Chain Transitions Quickly: I.",
            "An Introduction to Graph-Based Modeling Systems, Part I: Overview.",
            "The Influence of Computer Language on Computational Comparisons: An Example from Network Optimization.",
            "Parallel Solution of Sparse One-Dimensional Dynamic Programming Problems.",
            "Using Simulated Annealing to Solve Controlled Rounding Problems.",
            "Manipulation and Visualization of Sparse Matrices.",
            "Editor's Introduction.",
            "Computing Steady-State Probabilities of a Nonpreemptive Priority Multiserver Queue.",
            "Optimal Preemptive Scheduling of Two Unrelated Processors.",
            "A Decomposition Strategy for Global Optimum Search in the Pooling Problem.",
            "Backbone Network Design Tools with Economic Tradeoffs.",
            "Path Planning in 0/1/ Weighted Regions with Applications.",
            "Robustness of Rootfinding in Single-Server Queueing Models.",
            "Model Libraries: Knowledge Representation and Reasoning.",
            "Editor's Introduction.",
            "Further Development of a Primal-Dual Interior Point Method.",
            "Knowledge Modularization for Adaptive Decision Modeling.",
            "Computing Sparse LU Factorizations for Large-Scale Linear Programming Bases.",
            "An Algorithm for Network Reliability Bounds.",
            "Minimizing Total Tardiness on a Single Machine with Precedence Constraints.",
            "Neural Networks for Selective Vehicle Routing Heuristics.",
            "Book Reviews."
        ]
    },
    {
        "name": "INFORMS",
        "year": "1989",
        "info": "Volume 1: 1989",
        "count": 26,
        "papers": [
            "Editor's Introduction.",
            "Dynamic Programming, Integral Polyhedra and Horn Clause Knowledge Base.",
            "Parallel Numerical Optimization: Current Status and an Annotated Bibliography.",
            "Fixed Order Branch-and-Bound Methods for Mixed-Integer Programming: The ZOOM System.",
            "Numerical Solution of Linear Equations Arising in Markov Chain Models.",
            "Editor's Introduction.",
            "Approximation Algorithms for the Maximum Concurrent Flow Problem.",
            "An Implementation of a Primal-Dual Interior Point Method for Linear Programming.",
            "Data Structures and Programming Techniques for the Implementation of Karmarkar's Algorithm.",
            "A Formal Development of Event Graphs as an Aid to Structured and Efficient Simulation Programs.",
            "Analysis of Stiff Markov Chains.",
            "Editor's Introduction.",
            "Input Proofs and Rank One Cutting Planes.",
            "Possibilistic Linear Programming with Measurable Multiattribute Value Functions.",
            "Algorithmic Enhancements to the Method of Centers for Linear Programming Problems.",
            "A New Estimator of Sensitivity Measures for Simulations Based on Light Traffic Theory.",
            "On the Greedy Solution of Ordering Problems.",
            "Tabu Search - Part I.",
            "Editor's Introduction.",
            "Series-Parallel Bounds for the Two-Terminal Reliability Problem.",
            "Modeling Networks with Dynamic Topologies.",
            "A Neural Network-Based Optimization Algorithm for the Static Weapon-Target Assignment Problem.",
            "Anomalous Acceleration in Parallel Multiple-Cost-Row Linear Programming.",
            "Preprocessing in Stochastic Programming: The Case of Uncapacitated Networks.",
            "Continuous Models for Capacity Design of Large Packet-Switched Telecommunication Networks.",
            "Implementation of a Dual Affine Interior Point Algorithm for Linear Programming."
        ]
    }
]